[{"title":"snoogans!!!","rating":9,"date":"13 April 2005","review":"''f*ck,f*ck,f*ck'' when these words are said by a two year old version of Jay before the film switches to present day Jay doing his rap(''drinkin beers beers beers,rollin fatties,etc)the tone of the film is firmly set.But did you expect anything else?The heroes of Kevin Smiths Jersey film series finally get the screen time,and sadly the send off,they deserve.This film is JOKES from start to finish,the dialogue is funny and in places very rude, especially from Jay.|The cast is full of brilliantly chosen cameos,featuring many people having a tongue in cheek pop at themselves.The Good Will Hunting 2:Hunting season section shows Ben affleck and Matt Damon can laugh at themselves,which in a film like this they would need to!Jason Mewes is on top form as is Kevin Smith,especially when Bob is finally driven to an uncharacteristic outburst of more than a few words.BOUT TIME!!!The continuity of this in relation to the previous Jay and Silent Bob outings is superb,and although it is a funnier film if you have seen Kevin Smiths other Jersey films,there are still plenty of jokes for the uninitiated.This is mostly down to a fantastic supporting cast of some great comedic performers.Will Ferrells WildLife Marshall is funny as f*ck as Jay would say!The movie is not just full of jokes at previous Jersey films expense,but it takes a few good shots at other films and even the film industry itself...could Movie Poopshoot.com be a reference to IMDb.com?who knows?.The 2 disc DVD is WELL worth getting if you like the movie,the outtakes are worth the money alone.And one particular extra ''Ham Affleck'' is worth checking,with Ben showing his real cheese skills(which he would perfected in Pearl Harbour,only that time he was trying to be serious).Also the introductions to the many deleted scenes are worth watching,with Affleck again taking some lighthearted ripping from Mewes and Smith.LOL.Rude,fun poking,loud and very very funny.....just like Jay.9/10","user":"liam-tully","rank":[78,103]},{"title":"Pure gold!!!","rating":9,"date":"19 August 2001","review":"If you're the type of movie goer who gets uptight hearing countless F Bombs and explicit sexual discussion, then please move along and let others get in line to see one of the Funniest movies I have seen in my recent memory.<br><br>\"Jay and Silent Bob Strike Back\" is a movie that has so much going on, that one screening is not enough for me to all that was thrown at me in 90 plus minutes.<br><br>Writer/Director/Co-Star, Kevin Smith (Silent Bob) has without a doubt created if not his best movie, then it would have to be his funniest.  A fitting conclusion to his \"New Jersey Trilogy\" (that now consists of five films instead of the originally planned three) forgoes the serious religious overtones of \"Dogma\" and the Sexuality issues brought forth in \"Chasing Amy\" to go for pure Laughs...............and it succeeds.<br><br>The film's main plot revolves around the familiar duo of Jay (Jason Mewes) and his \"Heterosexual Life mate\" Silent Bob and their attempts to thwart a movie based on a comic book about Jay and Bob.  It's essentially a road picture as the guys make their way from Leonardo, New Jersey to Hollywood. Along the way they meet international Jewel Thieves, Steal a Monkey,  Meet The Scooby Doo gang,  Try and Beat up Ben Affleck and Matt Damon, and much more.<br><br>As Silly as all this sounds it's done in such a way that's smart, witty, and still has a touch of class about it.  And that's pretty hard to do considering I can't even tell you some of the content of the movie without being censored heavily.<br><br>If you are at all familiar with Smith's movies (Clerks, Mallrats, Chasing Amy, and Dogma) you will get a kick out of the countless cameos and connections to his other films.  For Example, Jason Lee reprises two roles (one from \"Mallrats\" and one from \"Chasing Amy\") as does Ben Affleck.  Matt Damon appears as himself playing \"Will Hunting\" in a fictitious sequel to \"Good Will Hunting\" entitled `Good Will Hunting II: Hunting Season\". There are two highlights of this movie that I need to talk about.  First Being Jason Mewes as \"Jay\".  This guy is for real, by far and away he has put in the best performance of all his five film appearances  as \"Jay\"  He carries the picture and is side splittingly funny.  It is my hope that he can now get other roles in movies besides the loveable Dope smoking \"Jay\". Secondly I want to address Kevin Smith's Directing.  To all the people who say Smith can't direct need to see \"Jay and Silent Bob\". His use of motion should silence everyone who claims there are no moving shots in a Smith film!!!  It's almost become fashionable to blast Smiths direction because that's the Thing to do. With all the great action and movement in \"Jay and Silent Bob'  Smith can finally shrug off all the criticisms of the past.<br><br>What can I say to sum up? It's a brilliant movie for everyone, not just Smith fans. You will laugh and laugh some more. Do yourself a favour and go see it as soon as you can!","user":"Hawkboy","rank":[92,126]},{"title":"Smith scores despite a different audience focus.","rating":9,"date":"25 August 2001","review":"Kevin Smith proved with J.S.B.S.B. that he is no longer just a glorified independent film maker.  In past films, Kevin Smith seemed to have a limited appeal, mostly among arm-chair directors (such as myself)who had become jaded with the Hollywood film industry, but with his slap-stick-like middle finger to the movie industry he seems to have branched out and struck a note with the \"MTV audience\" (10 to 16 year olds).  Smith's grade-school humor, delivered mostly by Jay, is nothing new to previous movies, but with  the focus on Jay &amp; Silent Bob this humor became more evident AND more inviting to a younger audience.<br><br>Nonetheless, Smith has not alienated his core audience who are, \"...over and underweight guys who can't get laid.\" (See Holden McNeil in \"Chasing Amy\"). The simple visual affects, as in his past movies, are FAR  overshadowed by the fantastic dialogue he writes which has Hollywood stars chomping at the bit to deliver.  If anything, the only disappointment was a  very thin plot (OK, Mallrats: Had a plot, no one ever said it was a good one).  But as he did in Mallrats, for what J.S.B.S.B. is lacking in plot, Smith sure as hell made up for it in laughs.<br><br>This movie junkie gives \"Jay and Silent Bob Strike Back\" a 9 out of 10.. .let's just hope what Chris Rock says in the movie doesn't come true.  See the movie and you'll get what I mean.","user":"brenny77","rank":[45,65]}]