[{"title":"It isn't Citizen Kane, but it never said it was.","rating":29,"date":"29 September 2003","review":"***SPOILERS***   ***SPOILERS*** This film made me laugh, simple as that, so it would qualify as a success as a comedy. The laughs are low-brow and you don't have to be an intellectual to understand or `get' the jokes when they come around.  This movie seems to have a lot of words like `tired' attached to it, and many people question whether the Farrelly brothers started losing the comedy muscle with this movie and while I would agree with these statements, I think they are still wide of the mark in most cases.<br><br>This movie is meant to revolt you, make you cringe and leave you disbelieving that people would do some of the things that will happen and anyone that has a problem with this, I retort by saying `well, duh!'  The main review that was on this page for this movie ripped it to pieces, which would have been fine except the person didn't even get the details of the movie right. I'm all for denouncing a movie, but please get the facts right if you're going to do it.<br><br>The story is simple. Boy meets girl, fall in love, get engaged and then find out their actually long lost brother and sister. Flash forward 16 months and we find girl engaged to wealthy small town man and boy with his newly found parents actually finding out that it was a mistake and they aren't related at all. Mother wants daughter to marry rich boy and neglects to tell daughter that boy is not her brother. Boy goes to said small town to win her back. Mother does everything in her power to stop boy, including making out he is a sexual predator. Well, it's actually pretty simple when you watch it. Plus there is some great subplot characters to go into the mix to keep the story moving.<br><br>There seems to be a very definite elitism when it comes to comedies such as this. Hey, I like a great dark comedy with many layers as much as the next person, but sometimes, I really like to just watch something that doesn't tax the brain. This falls into the latter category and has a sweet, twisted love story at its centre to boot. The acting from the leads isn't earth shattering but the support cast is a riot.<br><br>Don't look to hard and you will be entertained. 2¾ outta 5","user":"meidiot","rank":[9,10]},{"title":"Expect the unexpected along with the usual raunchiness","rating":6,"date":"13 June 2003","review":"This movie is typical of the raunchy comedy you can expect from Bobby &amp; Peter Farrelly. Perhaps I haven't seen enough of their movies to make an adequate judgment, but I didn't notice anything \"missing vibes\" from it. There are a few surprises in it however, that could make you ask questions beginning with \"Who Knew?\": <br><br>Who knew Orlando Jones could be cool? If you saw his 7-Up commercials you wouldn't think he was. For the record, his character was not Jimi Hendrix, or his ghost, or some nut who thought he was Hendrix. <br><br>Who knew Sally Field could pass herself off as a villainess, and a comical one at that? Fans who like her best during her Gidget/Flying Nun years will be just as surprised as those who praise her for Sybil, Norma Rae, Places in the Heart, and similar TV-Movies &amp; tear-jerkers.<br><br>Who knew the Farrelly Brothers would make a woman suffer so much heartbreak? In There's Something About Mary, we have Ben Stiller sobbing it up over the presumed loss of his object of desire. Here we have Heather Graham doing the same thing over a man she loves, but still believes is her brother.<br><br>Who knew an otherwise sugar sweet poem would be used as a weapon on any pets spending their final moments on earth? There's the scene where Chris Kline recites the poem he uses for abandoned animals he's about to exterminate for Heather Graham. I don't care how beautiful she thought it was, if I were any of those animals I'd be as scared of that poem as I would of the idea of being killed on the expiration date.<br><br>Anyway, this movie has a lot of sleaze, a lot of heart, and a lot of surprises. If you're not the uptight prim and proper-type, check it out.","user":"Ddey65","rank":[9,10]},{"title":"Gets off to a slow start, but gets funnier as it goes along","rating":7,"date":"21 August 2001","review":"First of all, I was disappointed that the Farrellys didn't take the director's seat on this one.  I hate when previews mislead you like that. Nine times out of ten, when you hear the announcer in a trailer say, \"from horror master Wes Craven\" or something of that sort, it means the well-known director is a producer or executive producer in the project, like in this case.  But it still has that Farrelly vibe, since J.B. Rogers worked as the A.D. in their previous works.  <br><br>The movie gets off to a slow start.  The gags start off pretty lame.  And most of the funny parts shown were given away in the previews.  We're handed a lot of quirks, but the comedy doesn't quite gel.  We have Richard Jenkins as a wheelchair-bound father, who uses excessive profanity through a voice-box.  So far, we're pushing the envelope, but the laughs haven't entirely arrived.  I have to admit, though, the nipple-piercing scene was very funny.  Luckily, that scene wasn't completely given away in the trailers, because quite frankly--it couldn't be shown on network television. <br><br>The film speeds up the comedy with the arrival of Orlando Jones as a pilot with artificial legs and a Jimmi Hendrix hairdo.  For some reason, the Farrellys have an obsession with handicapped characters.  Jones is very funny, and brings in the film's biggest laughs.  <br><br>I also think we wander into one-joke territory one time too many.  OK, the guy banged his sister.  It was funny at first.  How many times do we have to hear it repeated in the next gag...and the gag after that...and the gag after that?  But the gags improve as we go along, and I got more and more laughs.  By the last thirty minutes, I was laughing myself silly!  So I wouldn't say this comedy is anywhere near as bad as most people said it was. <br><br>\"Say It Isn't So\" isn't the best comedy of the year, but it often delivers. And it's one of the few comedies that gets funnier as it goes along, rather than starting off with a bang and dragging on as it progresses. <br><br>\nMy score:  7 (out of 10)","user":"mattymatt4ever","rank":[10,13]}]