[{"title":"Clichéd, but better than I expected it to be","rating":21,"date":"21 May 2002","review":"When Sara's mother is killed in a car accident she comes to live in a predominately black area in Chicago.  She is befriended by black Chenille and starts to fall for her brother Derek.  Derek teaches her the latest hip-hop dances to help her fit in and together they begin to fall for each other.  However a white girl seeing a clever black man is never going to be popular and the couple must overcome many obstacles to see their dreams and be true to themselves.<br><br>Did someone say `a black Dirty Dancing?'  Essentially that's what this is, although the story is naturally a bit more urban than that film.  The story is about overcoming to reach your dreams, and it does it quite well  better than I expected.  The love story is nice without being too romanticised. The obstacles are the usual things in an `urban' film  the challenge of mixed race relationships, the temptation to back up your crew instead of getting out etc.  These are quite cliched but are still well done.<br><br>My main problem came with the strength of black culture in the filmnot every black person (even in a poor area) talks like a gangstaand not everyone says `aiiiirite'  and why did Sara only become accepted when she started to imitate black culture and speak in that way.  It may be realistic, but I felt that Sara should have been allowed to be herself rather than be seen to be assimilated into the hip-hop culture (I don't mean that she shouldn't have got involved with the scene  but did she have to lose part of herself to get there?).  However these are minor side issues that many people won't even think about.<br><br>The cast are good for MTV teens.  Julia Stiles is cool and Thomas is cute and charming.  The rest of the cast fall into so many black stereotypes  we have gangsta friend, baby mothers galore, useless baby father, jealous bitchy ex-girlfriends etc.  However they are just what you expect so I wasn't too upset.  Fredro Starr was cool as Malakai  even if the character was just one big hood cliché.<br><br>The soundtrack is hot and the dance scenes are sexy  I wish I could do it! They are much more enjoyable than Dirty Dancing's scenes  although some day this will feel dated too!  Overall I expected another piece of MTV teen tat, but I was pleasantly surprised by a story that, despite being ridden with clichés, is actually very involving and enjoyable.","user":"bob the moo","rank":[40,50]},{"title":"Too clichéd to be really interesting","rating":5,"date":"28 April 2001","review":"[This comment contains SPOILERS!]<br><br>The main problem with Save the Last Dance is that it is too clichéd. We've been there, done that several times before. Also, some scenes were very embarrassing because they were so silly. E.g. when Sara is auditioning and Derek runs up on stage. Oh please... The same point could have been made in a more subtle way. Having said that, though, I must say that the film was also very entertaining, the music was great and the acting was more than just okay, especially Julia Stiles was impressive. (5/10)","user":"AKS-6","rank":[21,28]},{"title":"A very touching story, with some good points","rating":10,"date":"20 February 2001","review":"I really wanted to see this movie, I like Julia Stiles in her other movies (Down to You, 10 Things I Hate About You) and think that she is a very talented actress.  I was not disappointed.<br><br>As for this movie... I am very impressed.  I feel that Julia portrayed very real emotion and reactions to losing her mother, and placing the blame for losing her mother firmly on herself is the reaction that most people would have in that circumstance.  The train scene in the beginning sets a very good foundation for the rest of the movie, and it goes from there.  To those who would say that her acting is overdone, I say put yourself in those shoes: you've lost your Mom, best friend, confidante, and the foundation your entire world rests on, and think how it would affect you.<br><br>There are some parts of the movie that are slightly cliched.. dancing as she walks under the L - we saw Jennifer Grey dance her way up a flight of stairs in \"Dirty Dancing\" - but then again, not much in life hasn't been done before, so I don't count that against it.  Even Nikki is a believable character - I know there were quite a few like her when I was in high school! While it seems improbable that Sara would instantly fit in with her new crowd, it is made believable by Stile's portrayal of Sara as a slightly self-conscious, but not shy person, who will take a person at face value while still believing in the inherent good of people in general.  The match with Derek is natural, since they share these traits.<br><br>There are a few unbelievable parts - the empty studio (complete with barre) that she practices in with Derek, Steps, Sarah offering to walk the 5 blocks home alone, Sara dancing ballet (not that she didn't dance well, just that Stiles body is not standard for classical ballet) but all in all, I feel that this is a very touching movie, and would recommend it to everyone female, even my Grandmother (the language may be shocking, but she was in the Army, I know she's heard worse :)","user":"stefaffi","rank":[39,60]}]