[{"title":"Extremely entertaining post-modern pastiche","rating":7,"date":"15 May 2006","review":"From the get-go, you'll know that this is a film that relies almost solely on its style and its visual slickness. Low budget in the good sense, Versus resembles early Sam Raimi or Peter Jackson works (Bad Taste springs primarily to mind). It combines good-humored gore with Luc Besson-ish wide lens shots and quirkiness (the characters here reminded me of The Boondock Saints in their flamboyance), along with some very creative martial arts sequences. At some point, in fact, it gets so over-the-top it starts to play out more like a Stephen Chow movie. It then jumps from Night of the Living Dead to Mortal Kombat to Highlander, making a stop or two at X-Men along the way. This eastern/western mix works surprisingly well and the result is highly entertaining, if you enjoy this kind of thing. Just don't go looking for any depth, causality, plot logic, or plot altogether, really. The few dialogue scenes are a mess (excluding the one that takes place when everything turns an orange shade, about an hour into the film), and often serve only as a backdrop for canted steadicam close-ups and multi-character Mexican standoffs. This is not high brow cinema, it's high octane. And it was perfectly fine by me. It is when the film discards some of its humor that it begins to lose its charm, but even then, the spectacularly choreographed martial arts kept me entertained. I would be interested in seeing \"The Ultimate Versus\"  a director's cut that's ten minutes longer and has CGI special effects, according to IMDb.<br><br>P.S. There are few things I hate more than a dubbed movie, but in this case (like in Shaolin Soccer), I found that at certain scenes (particularly ones involving \"the runt\"  the wacky short guy), the English dubbing actually adds to the absurdity of the film. Anyway, the DVD offers both the American and the original Japanese dialogue tracks.","user":"Potty-Man","rank":[34,43]},{"title":"God bless the crazy guy in the green shirt!","rating":7,"date":"24 January 2005","review":"Some people are insane! I mean, what were you expecting? The English Patient? I for one love a good gorefest and awesome if its done out of Hollywood. The plot had holes, I guess, I can't really think of anything that really had me come out of the movie. If you rented or bought this and thought, \"Hey, that couldn't have happened, like, oh my Gawd how fake!\" Why would you watch a zombie/sci-fi movie to begin with? You did read the synopses right? The acting was good, watch the original undubbed one please before you blast the flick! The characters were priceless, I loved the \"Charlie's Angels\"-esquire stances the yakuza guys made! Tre cool. I loved the fighting as well, every ten minutes or so someone was getting the crap beat out of them. It was also very refreshing to not see so much wire-flying, the one part I can recall that did sort of do that was shot tightly so it didn't seem so exaggerated. I'm a chick and I LOVED how Prisonor KSC2-303 kept hitting the annoying chick over the head, classic! No out of nowhere love scenes here my good people! The \"villian\" was also top-notch. I thought the casting was great. Tak Sakaguchi, wow, baby don't be so mean! :P I can't wait to see him in more things or in the sequel. Please don't watch this if you're cynical or hard to please. ITS A ZOMBIE/GORE/SCI-FI INDIE FILM! Yeah just don't buy it, let someone else who appreciates such fineness get a copy.<br><br>*By the by, this review is based on \"The Ultimate Versus\" edition.","user":"CopperFrightful","rank":[56,76]},{"title":"We don't need no stinking plot","rating":10,"date":"3 October 2004","review":"This movie, while made to be an action type with some subtle humor, grades pretty low to folks looking for an action movie to snuggle up with and watch alone. This movie is much, much more fun to watch with others, preferably with a sense of humor. <br><br>If you're not a fan of action, and are looking for anything remotely deep and meaningful, look someplace else.<br><br>The movie is shot entirely in a forest setting, with the times shifting from morning to twilight frequently.<br><br>The action is very well put together despite being on an obvious low budget. I recommend this movie to anyone with a few hours to kill with a few friends.","user":"trunksofac","rank":[44,61]}]