[{"title":"The Life of David Gale: Possibly the film of a lifetime.","rating":28,"date":"28 March 2003","review":"`No one who looks through that glass sees a person, they see a crime.  I'm not David Gale, I'm a murderer and a rapist, four days shy of his execution,' exclaims Gale (Kevin Spacey) to reporter Bitsey Bloom (Kate Winslet) on one of his last few days of life.  While Gale might be right, no one who looks at The Life of David Gale on the silver screen sees a movie, they see a work of art.  This isn't The Life of David Gale, this is one of the most meaningful and insightful films created in years.  Its gripping screenplay, brilliant acting and creative cinematography explores one of America's most pressing issues in a captivating manner.<br><br>\nDavid Gale, top of his Harvard class, was Texas' leading death penalty abolitionist and professor at the University of Austin.  Now on death row for the rape and murder of his best friend, Constance Hallaway (Laura Linney), reporter Bitsey Bloom interviews Gale on his last three days of life.  The film is produced as a series of flashbacks exploring Gale's intriguing life and the crime he allegedly committed.<br><br>\nGale was written by former Vienna philosophy professor and first-time screenwriter, Charles Randolph.  The story is full of remarkable twists and turns constantly forcing the viewers to change their thoughts on who committed the murder.  The film is packed with memorable lines, both serious and humorous.  When city-savvy Bloom and her intern, Zack, first arrive in small-town Huntsville, Bloom remarks, `You know you're in the Bible belt when there are more churches than Starbucks.'  Zack adds, `More prisons than Starbucks.'  When Bloom first meets Gale, the prison guards seem unnecessarily rude toward Gale.  He remarks `they are practicing being cruel and unusual.'  In a flashback, Gale describes the pro-death penalty Texas Governor as being `in touch with his inner frat boy.'<br><br>The strongest part of the script occurs toward the end of the film when Bloom begins a race against time to discover what really happened at the crime scene.  The last ten seconds expand the film's meaning into a questioning of the purpose of life.  This theme is brilliantly touched upon in earlier segments of the movie.  During a flashback of Gale teaching his U of A class, he lectures `The only way we can judge the value of our own lives is by valuing the lives of others.'  In our hollow world of How to Lose a Guy in 10 Days, Bringing Down the House and Old School comes this film that is truly meaningful.<br><br>While the overall script was extremely powerful, it did have one significant weak moment.  On the night before Gale's execution, Bloom discovers some odd occurrences at the crime scene.  Instead of spending the night investigating, she goes to sleep.  The following morning is a battle against the clock to determine if Gale is guilty; she finally realizes the truth just a few minutes before the execution.  The plot would have been notably more gripping if Bloom had spent the night working on the case instead of snoring.  Mr. Randolph: Certainly not bad for your first screenplay; it is worthy of keeping you off this reviewer's death row.<br><br>Each actor was ideally selected for their respective roles (George Clooney was originally solicited for Spacey's role; thank God he turned it down). Spacey's role as Gale was one of the best in his career.  Much of his offbeat, sarcastic and monotonous American Beauty voice seems to emerge when Gale first meets Bloom and explains why he called for her.  One of Spacey's best lines ever uttered occurs later in the film when he tries to convince Bloom that he is innocent.  He shouts, `I used to be the state's leading death penalty abolitionist and now I'm on death row.  Doesn't that strike you as a little odd?' Another memorable Spacey scene occurs in a flashback at the U of A when a seductive female student, Berlin, pleads for a higher grade.  Gale approaches Berlin and whispers in her ear, `Okay Berlin, I will give you a good grade, a very good grade, if you would just. study.'<br><br>British actress Kate Winslet flawlessly pulls off an American accent throughout the entire film.  Winslet's tones of voice and minute expressions reveal a dynamic change in her personality from when she first arrives in Texas to when she leaves.  She enters Huntsville conscious of her status and hardened from city life.  `I'm a reporter, you're an intern,' she explains to Zack when they first arrive at the scene.  Later, she becomes so immersed in Gale's story that she nearly suffocates herself when trying to reenact the murder sequence.  This occurs when Bloom infiltrates the crime scene and secures a plastic bag over her head with duct tape to determine how long a person can survive without air.<br><br>Director Allan Parker took this powerful screenplay and perfect cast and created Gale in a strikingly different fashion.  Parker worked with both Director of Photography Michael Seresin and Editor Gerry Hambling in 1999 to create the depressing, slow tale of old Ireland in Angela's Ashes. Considering Gale was done with the same key crew members, you would think that there would be strong correlations between the two productions, but this was not the case.  Gale explores present-day issues in a fast paced, suspenseful thriller. Parker uses a fresh and different film technique when going between present-day and flashbacks.  The camera seems to be spinning 360 degrees as the film cuts between present-day, the flashback and graphics of a variety of buzz words (like `death,' `truth,' `power,' `love,' etc.) until the flashback phases out the other footage.<br><br>Parker masters the technique of intercutting to convey meaning.  On the day of Gale's execution, Parker rapidly cuts between the jail cook preparing his last meal, reporters discussing the execution, Bloom trying to tell the world of her findings and finally, Gale walking down the hall toward the death room.  These visuals, along with the frantic track, `Media Frenzy,' portray the extreme sense of tension.  Similarly, in a flashback, shots of Gale having sex with a student at a party are rapidly intercut with the fast-paced dancing of the other partygoers.  Parker smartly conveys emphasis through juxtaposing striking images following a scene.  After Gale utters to Bloom, `I'm running out of time,' the film cuts to a steak sizzling at a nearby barbecue.  Parker is comparing Gale's hopeless and desperate situation to frying dead meat.<br><br>The Life of David Gale is a truly remarkable film, one that will force tears out of your eyes and cause your knees to shake throughout the entire 130 minutes.  This absolutely riveting film will leave you thinking, for a long time, about the purpose of the death penalty and about the meaning of human life.  Beware: The film is so thought-provoking that it just may change your stance on the death penalty issue.","user":"bbodow","rank":[91,115]},{"title":"Kevin Spacey takes it trough the roof","rating":8,"date":"9 June 2003","review":"Ive been reading some of the user comments here on IMDB, and am a little stunned that most of them didnt really get the plot, and therefore shouldnt really comment on how \"bad\" it is. Like Winslet not having any chance in understanding the plot, thats the entire point of the movie, and if you didnt get that, you should not comment on how \"bad\" it is.<br><br>This movie is by far Spacey's strongest performance since the magical Se7en. Actually, all leading actors gives amazing performances in this movie that has a plot taken out from heaven. It will leave you moping, gasping for air. Giving Hollywood stick for a \"too complicated script\" is silly, since its far too seldom Hollywood actually offers a script like this. I would rather welcome that fact, than be mad about it.<br><br>If you feel you have what it takes to crack this puzzle before it unveals, go see this movie instantly, and be prepared to be taken on a journey.","user":"DJelusive","rank":[182,240]},{"title":"Very Underrated","rating":7,"date":"26 September 2007","review":"Directed by the legendary Sir Alan Parker, this is the story of David Gale, a University of Texas professor of philosophy against capital punishment who is accused of murdering a fellow activist and is sent to death row.<br><br>Kevin Spacey and Laura Linney deliver great performances in the flashbacks. This movie is by far one of Spacey's strongest performances, he is always very subtle and insightful portraying David Gale. Laura Linney really makes a name for herself in this motion picture, she's as consistently complex and likable here as she is in \"Primal Fear\" and \"You Can Count on Me\". Kate Winslet, however, has problems in carefully crafting her character. She's called upon to cry about four or five times in this film and each time she does so, the action unfortunately rings more and more false. Other than that, she is average. Meanwhile, Gabriel Mann, Leon Rippy and Matt Craven also provide colorful backdrops to the story at hand with their credible supporting characters.<br><br>\"The Life of David Gale\" is a film that had a great opportunity to create controversy about the death penalty. Unfortunately, it is excessively underrated by critics, despite being nominated for the Human Rights Award from the Political Film Society and being present at the prestigious Berlin International Film Festival. <br><br>Sad and stunning. 8/10","user":"joaocruzferreira","rank":[72,92]}]