[{"title":"Nothing typical, everything beautiful in a movie.","rating":9,"date":"9 February 2004","review":"This is not an ordinary movie.  Watching this film is like watching a poem. it is too bad that some reviewers here have to see everything in the plug and play mode meant for short attention spans.  This is a work of art intended to be tasted, smelled, seen, and touched.  It enlivens the senses, touches the heart, and moves you with little dialog. Blanchett doesn't have to speak.  Her face tells the pain of her loss, her remorse for her actions, and her lack of relief from her revenge.  Ribisi is stunning as the outwardly simple, infatuated boy-like man with subtly revealed inner strength and cunning. Sometimes it is nice to take a break from the usual fare and take a ride on a work of art.  I loved this film and will watch it again.","user":"ShrinkSteve","rank":[150,179]},{"title":"Absolutely Gorgeous","rating":4,"date":"4 November 2005","review":"This is an unusual film, start to finish, particularly finish. Why? Because......<br><br>It's a suspense film but not all that suspenseful, especially in light of today's bloody action scenes.<br><br>It has an ending that is not really an ending.<br><br>It's not listed (or categorized at rental stores) as a \"foreign film\" but much of the movie is spoken in Italian.<br><br>In other words, this is hard to label. Throw in an odd romance, some spectacular Tuscan scenery (actually wonderful cinematography all the way through), a slow-moving but involving storyline and one of this generation's most-interesting actresses (Cate Blanchett) and you have a film worth investigating.<br><br>A word of warning, especially to younger people: this film might be too slow for what you are used to seeing. If you want action, skip this. This film is more for people into visuals and a different story. Subtitles also turn off a lot of people, and you need them here.<br><br>As someone who just loves great visuals, this is an astonishing piece of work - just magnificent to view. I also appreciated the director's \"sky cam\" with some wonderful aerial shots.<br><br>The \"R\" rating comes from a very, very brief sex scene, which doesn't involve the major characters. There is almost no profanity in here. A strange film to label but it sure is a visual treat. I liked it even more on the second viewing","user":"ccthemovieman-1","rank":[101,125]},{"title":"thin, short, refined","rating":10,"date":"3 October 2003","review":"'Heaven' is a wonderfully subtle film, full of refined camera work and scarce in dialogue. It stands as a good representation for the 'X Filme' project that Tom Tykwer co-heads, which aims to create films both new and thought-provoking as well as successful in their theater runs.<br><br>At roughly an hour and a half, 'Heaven' is a cinematic triumph that nudges open the gates to the philosophy and psychology of the lone man or woman along with those of society on the whole. It takes place in Italy, but Tykwer himself stated in an interview that really it could have been shot in any number of places with the message remaining the same. 'Heaven' is a thinly-scripted, in-depth commentary on issues prevailing throughout the modern world. Drugs, sex, sexuality, identity and the fibres that make up humans as a race are what this film revolves around: it is not a film for tourists or spectators. The excellent performances of Giovanni Ribisi and Cate Blanchett (apart and together) should only be missed if you are mainly looking for external adventure and action. Though it shares its part in weapons, scheme and drama, 'Heaven' is not blockbuster material: it is art material.","user":"thomasbuster","rank":[83,111]}]