[{"title":"Rob Zombie's nightmare world realized on film","rating":6,"date":"1 June 2005","review":"In my opinion, House of 1000 Corpses is a fan movie. Fans of both the horror genre and Rob Zombie are likely to love it. Though I do not count myself a fan of either, I do like both at times, and I am quite familiar with both. Those familiar with Rob Zombie are likely to be the only ones who completely 'get' this clever little film - appreciating its depraved sense of humor and nihilism. Zombie's themes are fairly consistent - evil (without the usual religious connotations and clichés), murder, sex, insanity, and stereotype \"hillbillies\". Zombie's world is not a place for people who are terribly concerned with reality, but, for Zombie himself, it seems to supply endless muse for a prolific and interesting commercial creativity.<br><br>Two couples traveling across country and working on a book on bizarre roadside attractions stumble across a filling station / theme park run by a vaguely evil clown with a bad attitude - Captain Spaulding. Spaulding teaches them of a few local legends, including a mad surgeon who worked in a local insane asylum and came to be known as Dr. Satan for the grotesque surgical procedures he applied to mental patients in secret. They pick up a pretty blonde hitch-hiker on their way to see the tree where Dr Satan was hung, and run into some car problems, so the hitch-hiker invites them to her family house. The family, apparently headed by the phenomenally weird Karen Black, makes The Addams family look like the Brady Bunch.<br><br>My narrative has described the first 20 minutes or so of the film, and at this point the film, much like RZ's songs, is so campy that it seems a straightforward horror comedy. However, once our protagonists are in \"the house\", the plot takes a decidedly more sinister spin, and never lets up from that point forward.<br><br>This film successfully and entertainingly portrays all of RZ's themes in about the same proportions as his music. Of them all, sex is the least explored, and I, for one, am thankful for that. The film also walks a delicate line between Hannibal Lector grotesque art realism and supernatural forces. For example, at one point, one of the bad guys turns on a cassette player with low batteries so that the voice recorded on it sounds extra-satanic.<br><br>If you have problems with blood and other bodily fluids, and utterly repulsive surgically induced variations on the human body, you might want to avoid this film. If you don't have any great objections to standard hardcore horror imagery, or if you like it, you might want to see this. It is masterfully visualized and does a much better job of making horror into art than the standard Hollywood horror fair. This is Rob Zombie's art, and he does it much better than most. This first major effort in film bodes well for his future use of the medium, and I will look forward to his next.","user":"mstomaso","rank":[126,158]},{"title":"Is a horror fan entitled to have a second opinion?","rating":9,"date":"16 August 2005","review":"I already had a user comment for \"House of a 1.000 Corpses\" submitted here on this site, dated over a year ago andumnot very praising. In fact, my first viewing of this film was so disappointing that I excessively discouraged other people here to see it. Rather than to simply ignore the old comment and pretend I never bashed it, I wish to write a new – more positive – review, if it were only to convince other people (who also disliked at first) to give it a second change. Several factors (like the praising reviews on \"The Devil's Rejects\"-sequel and conversations with fellow horror fans) nearly forced me to re-watch \"House of a 1.000 Corpses\" and I'm glad I did. This truly is a film that requires multiple viewing before one can properly judge it. Rob Zombie's style is often innovating and so overwhelming that it might look overly hectic at first but, in reality, his dedication towards obscurity and his knowledge on classic cinema is one of the best things that could ever happen to the horror genre. And that is something you (or at least I) have to discover with repeated viewings <br><br>The power of this film lies in the fact that the screenplay covers all kind of successful horror premises. Serial killers, mad doctors, a family of crazies, deranged clowns, devil-worshipers.you name the type of terror and \"House of a 1.000 Corpses\" features it! This movie is a small revival of the entire horror genre all by itself. No extended and boring intros or pointless red herrings in this film, \"House\" is straightforward and surefooted sickness from start to finish and you're given almost no time to breathe. Some of the sequences in this film are so damn close to brilliant that I can't possibly figure out why I didn't love them right away!! The execution-scene guided by the moody \"I Remember You\"-song, for example, is amazingly atmospheric and quite unsettling. Although Rob Zombie's directing skills are still open for improvement (the abrupt climax, overly rough editing), his debut is a staggering gorefest that every horror fan has to experiencerepeatedly! Bring on the sequelI'm ready now!!","user":"Coventry","rank":[72,105]},{"title":"A revival of true horror","rating":9,"date":"3 May 2003","review":"Its sad that a film as wonderfully made as this is so grossly misunderstood.<br><br>\nLet me say this right off that bat. If you're idea of a horror film is I know What You Did Last Summer and you consider Scream and The Exorcist to be the most shocking films ever made, this is not a film for you. If you havent seen I Spit on Your Grave, Evil Dead, Texas Chainsaw Massacre, Dawn of the Dead or Last House on the Left, this is not a film for you. If you've never listened to \"Living Dead Girl\" or \"Superbeast\" this is not a film for you.<br><br>Now having said that, this is a film for me. It is a film for true horror fans, the kind that stay up and watch Dawn of the Dead and The Beyond, who know who Lucio Fulci and Dario Argento and George Romero are. This is a film that was meant to be seen by people like this and will only be enjoyed by people like this. This is not exactly mainstream stuff here. Only a small percentage of people enjoy this stuff, and for those people, this film is a true rivival of classic exploitive horror.<br><br>Rob Zombie has created a homage to 1970's exploitation/horror films, and he has been extremly successful in achieving that goal. The film borrows largely from Texas Chainsaw Massacre and Last House on the Left, with his own little bits of original demential thrown in and an assortment of other horror film references. The film tells the tale of four teenagers who are terrorized and tortured by a bizarre southern family living in a remote farmhouse in 1977. The film uses all sorts of camera tricks--negative colouring, split-screens and seemingly random inserts of grainy snuff-like footage of various S&amp;M and gore images; the off-the-wall effect is similar to what Oliver Stone did in Natural Born Killers. The film is not about plot, or about characters. Its purpose is to shock and disturb, to serve no other function than to entertain through exploitation and disgusting and bizarre violence. Just as you think the limits of weirdness are approaching, Zombie takes the film a step farther, and before long you surrender yourself to the mercy of the film and just accept things for what they are. The film has the feeling of an out of control freight train being piloted by a madman and the climax of the film is truly bizarre. The reviewers who wrote the film off as overly-sadistic with little in the ways of character development, plot or suspence have come to see a different kind of film, perhaps more at home with titles like The Sixth Sense or Silence of the Lambs. The have no busineness debasing a great film like this.<br><br>Rob Zombie has created a film that is both a homage and derivative at the same time; most things in the film have been done before, in one shape or another, and the level of gore is a fraction of what was intended, due to its shameful R-rating. To see the inevitable Unrated Directors Cut on video is going to be a true horror experience.<br><br>But this film is something has hasnt been seen in decades and it has been made with the utmost care that only a true horror fan could provide. It is a film made by horror fans for horror fans, a true labor of love by Mr. Zombie, despite some flaws. If you arent sitting the theater going \"hey, theres Bill Mosely from TCM 2!\" or \"hey, that shot is a homage to the cover of Evil Dead!\" or \"hey, he wears peoples skin like Leatherface!\" then you probably arent meant to be seeing this film. But for those who are, the film is a true gem and a rarity; it is a kind of film that hasnt been seen on the screens in over twenty years and probably wont be for another twenty years. Get out there and enjoy this rare experience while you still can.<br><br>An instant cult-hit.<br><br>Grade: A<br><br>For true horror fans only. Everyone else just wont get it.","user":"zombie84","rank":[240,389]}]