[{"title":"A Fun, Frenetic Farce That Didn't Deserve To Be A Bomb!","rating":8,"date":"18 May 2002","review":"When my husband and I heard that Barry Sonnenfeld was going to direct the film version of Dave Barry's first novel,  we were pretty excited.  Both men have a similarly nutty knockabout comic sensibility with a touch of the surreal, and this wacky farce about a motley crew of Miami citizens embroiled in a race to recover an atomic bomb seemed like the perfect vehicle for them to pool their talents on.  Well, it was! Hubby and I had a grand time -- but alas, we seemed to be among the very few moviegoers who even gave the flick a chance!  I guess it didn't help that BIG TROUBLE's originally-scheduled December 2001 release was delayed due to worries that a plot involving smuggling an A-bomb through laissez-faire airport security would seem more disturbing than funny after the horrific events of 9/11/2001.  Maybe most audiences are still too spooked right now to appreciate the satiric possibilities in Sonnenfeld &amp; Co.'s cynically funny, Billy Wilder-esque treatment of these elements -- but I hope that down the line, folks will give BIG TROUBLE a chance, because really, it's like what might have resulted if Billy Wilder had ever had an opportunity to direct The Marx Brothers.  We were laughing throughout!  The ensemble cast is superb, from Patrick Warburton and Janeane Garofalo as members of Miami's Finest, to Tom Sizemore and Johnny Knoxville as dunderheaded crooks, to Tim Allen and Rene Russo's chemistry as single (well, unhappily married in Russo's case) parents who get drawn into the shenanigans when their respective teenage kids Ben Foster and Zooey Deschanel (both delightful -- I wouldn't be surprised if these two became big stars someday!) accidentally foil a hit on Stanley Tucci (hilariously obnoxious as Russo's dreadful second husband) by Jack Kehler and Dennis Farina (spoofing his earlier role in Sonnenfeld's GET SHORTY adaptation).  Everybody gets a moment to shine, even Jason Lee as a hippy-dippy drifter and Sofia Vergara (who looks remarkably like a Latina Denise Richards) as Tucci's put-upon maid. C'mon, give this unfairly underappreciated gem a chance when it hits home video!","user":"dtb","rank":[80,86]},{"title":"Shame nobody went to see it","rating":8,"date":"10 December 2005","review":"I still remember laughing so hard I was in tears in a theater filled with less than 20 people! A great cast and well written, this movie got the shaft after it was suddenly moved to a 12/2001 release (with almost no publicity)after the events of 9/11 because the movie had scenes depicting lax airport security. We Americans were far to fragile to see someone smuggling an atomic bomb and a gun through poor security! What people missed was a funny story and some of the best one-liners I have ever heard (\"maybe you guys should plead Not Guilty by reason of stupidity!). Honestly, I have never been able to drive into an airport without thinking about Arriving and Departing (\"We're arriving, but then we are departing?\")and Florida Gator fans just get hammered! Great flick, get the DVD and see it for real, not the Comedy Central version.","user":"stuprince","rank":[23,24]},{"title":"Funny, easy-going comedy to enjoy; no slow times!","rating":8,"date":"29 June 2004","review":"Dave Barry, author of the book, does a really good job of portraying humor about his home town (Miami), teenagers, parents, divorce, marriage, autos, airports, difficulties of working in a strange town.  The movie is humorous, fun, and moves along quickly.  You can enjoy a nice time with it.  All the actors do a great job.  I think some of my favorite lines have to do with arrivals &amp; departures at the airport!  Behind the humor are the scarey foundations of some of the major scenarios of the movie.  (Can't say what those are; gives too much away.)  So if you are in need of a comedy to enjoy, but which may leave a residue of some of the problems of today's world, watch \"Big Trouble\".","user":"cowgirl-12","rank":[43,49]}]