[{"title":"Uniquely captures the mood of adolescence","rating":19,"date":"19 August 2002","review":"\"I like to go to beautiful places where there's waterfalls and empty fields\" Nasia  <br><br>George Washington is a meandering, moody, and hypnotic look at a group of black children, ages 9 to 14, during one summer in North Carolina. This was my second viewing and it remained a deeply satisfying experience. Though at times self-conscious, George Washington brings to mind Terence Malick's Days of Heaven with its voice-over narration, languid, dreamy tone, and gorgeous cinematography.<br><br>The youngsters are shown talking and playing aimlessly among the squalid junkyards and abandoned buildings of their neighborhood. They do not talk much about their hopes for the future but focus on their families and their girl friends and boy friends. The dialogue is partly improvised and, like Days of Heaven, allows the characters to speak in a manner that is slightly more poetic and contemplative than the average teenager.<br><br>\nThe narrator, Nasia (Candace Evanofski), is a 12-year-old who has just broken up with her 13-year-old boyfriend Buddy (Curtis Cotton III) because, in her view, he's too young and immature. She's more attracted to Buddy's friend George (Donald Holden), a quiet and serious boy who always wears a helmet to protect his soft skull. They hang out with their friends, a mismatched pair of amateur car thieves named Vernon (Damian Jewan Lee) and Sonya (Rachael Handy), and also with Rico (Paul Schneider), a local railroad worker. Buddy shares his sadness with Rico who comforts him with his own story of lost love. <br><br>When an unexpected tragedy occurs, each of them must look closer at themselves and struggle to make an emotional connection with the events. They come to their realizations at different moments throughout the film and slowly begin to change in different ways. George, for one, after saving a drowning boy in a swimming pool becomes a neighborhood hero. Those realizations, however, do not provide an instantaneous fix and Green does not provide a forced happy ending. <br><br>Green has said, \"One of the reasons I made this movie is because movies talk down to kids, put them as a cute little kid with a box of cereal and a witty joke,\" says Green. \"You watch movies like Kindergarten Cop and it's like, 'Oh, a kid said something about sex. Isn't that funny?' It's just annoying and it makes me sad for their parents.\" <br><br>George Washington presents a view of teens that is not condescending but shows each character as a person of dignity and worth. It uniquely captures the confusion of adolescence, the need to belong, to believe life is or can be important, and the universal longing for love. Green has looked into the squalor and found beauty. Like a poem of Walt Whitman, he has expressed the divine in the commonplace.","user":"howard.schumann","rank":[26,29]},{"title":"Pure cinema, a masterpiece of indie filmmaking.","rating":9,"date":"17 February 2002","review":"George Washington is the kind of film I instantly respond to for the simple reason that it is pure, perfect cinema.  This is what FILM can do when free of the constraints of popular movie-making.  When it ended it made me think of that old saying \"a picture is worth a thousand words.\"  Well what happens when that picture moves?  You get George Washington. I don't want to spoil the film for anyone reading this by needless plot exposition that I find so annoying in most professional reviews.  But the film does center around a small American town, and a group of poor children during the long, hot summer months.  This film has absolutely wonderful cinematography, better than most big budget Hollywood films, and the mood it sets is alternately playful, melancholy, surreal, and poignant.  Many times I was reminded of my own childhood; scenes play out in a very organic way and the actors, mostly children, are all wonderful. Before I saw this film I had heard that one of the director's influences was Terrence Malick, a filmmaker I love dearly, and George Washington reminded me a lot of Malick's \"Days of Heaven.\"  He uses voiceover in much the same way Malick did in that film...alternating between narration, random thoughts, and character exposition.  The voiceover use in this film, as in Days of Heaven, is spoken the way someone might hear their own thoughts. Watch the movie and you'll see what I mean. Although the movie is about children, it's not really \"for\" kids, but I would venture to say that any kid from about age 12 and up would be all the richer for seeing this movie.  However in this age of short attention spans, and video game editing I don't hold out much hope that many kids would appreciate a film like this.  But for adults, especially lovers of the cinema, this should be required viewing.  It's up to us support these kinds of movies so we can see more of them in the future.  I saw this for free on the independent film channel, but I plan on buying the DVD anyway...George Washington is a film I will be proud to add to my collection.  I loved it.","user":"TechnicallyTwisted","rank":[25,31]},{"title":"Why do people like this?","rating":3,"date":"17 January 2013","review":"I have hated almost every film David Gordon Green has made after \"George Washington\" - but even this movie begs the question, \"why?\"<br><br>The acting is supposedly honest, but actually felt hackneyed and unrealistic by both the kids and the \"real\" actors alike. The storyline is virtually nonexistent, but what *is* there says so little that it barely exists. All that's left is the okay photography, and the sleepy directing. This is \"Sundance\" stuff akin to \"Beasts of the Southern Wild\" - boring, pointless, and so utterly, formulaically \"non-form\" that it's just as predictably ambiguous as the most hackneyed Hollywood Romcom is happy-ending-ized. <br><br>The biggest difference between Sundance-honored independent films and Hollywood mediocrity is that at least Hollywood isn't totally disingenuous about what it's dishing out.","user":"dan-800","rank":[11,14]}]