[{"title":"A Truly Nice Film","rating":9,"date":"2 February 2006","review":"I liked this better than the original, and that''s a high compliment because I thought highly of the original film: Stuart Little. As good as that was, I just thought this was even better.<br><br>All the voice-overs are excellent with Nathan Lane having the best lines as \"Snowball,\" the cat. He was simply hilarious, line after line.<br><br>The film once again features great colors, a virtual rainbow of them, especially with some of the inventive rooms in the Little house. The parents, once again, are super nice. It's a treat to watch Geena Davis and Hugh Laurie play an old- fashioned \"Leave It To Beaver\"-type couple. The film has no objectionable material and leaves you with a nice feeling. There are animated films or animated/real life combinations like this, that advertise \"family-friendly viewing\" but don't really deliver, instead sneaking in sexual innuendos and the like.<br><br>Not here. This one is pure, morals-wise, except for one scene near the end when the mom (Geena Davis) tells Stuart and their son she's still proud of them even though they just got caught in a big lie. (Inferring that the lie was okay since everything turned out okay.) Other than that, nothing but good messages were heard and seen all around and this is a funny movie, to boot. Highly recommended for the family, and that's no cliché.","user":"ccthemovieman-1","rank":[25,27]},{"title":"I do not exaggerate in giving this my highest rating. I enjoyed it *that* much.","rating":10,"date":"8 May 2010","review":"As of present (May 2010), I have never read the E.B. White classic \"Stuart Little,\" however I have had the delightful privilege to see the two films based loosely upon its content. The first \"Stuart Little,\" released in 1999, was a very sweet and charming little family picture that I enjoyed immensely as a kid and still do to this day. I remember I also enjoyed the sequel, \"Stuart Little 2\" when I was younger, but now having re-watched the film for the first time in a long time, I discover that a rare instance has occurred: I enjoy the movie more now as an adult than I did when I was eleven. Perhaps it's because I now understand the adult humor and Snowbell's hilarious lines better, but overall, \"Stuart Little 2\" is a very good picture.<br><br>In the sequel, Stuart Little (voiced by Michael J. Fox) now has a quintessential relationship to his family. His human brother George has accepted him as a sibling and the cat Snowbell is now his pal instead of his enemy. However, poor Stuart feels a little left-out in the world because of his small size and his lack of real friends. That is until a little bird named Margolo (voiced by Melanie Griffith) literally drops into his life (from the sky), pursued by a vicious falcon. When they are clear of the evil bird's talons, Stuart and Margolo develop a very strong, very heart-warming friendship while teaching to the younger audience members very important lessons about life and friendship.<br><br>Those messages were communicated to be very well when I was younger and they still are today. I'm not exactly sure why I like \"Stuart Little 2\" more as an adult than I did as a kid, but maybe it's because I can understand the full extent of it. The filmmakers made the right choice to film it as a family picture, incorporating elements that children can understand but leaving in great moments of comedy to keep the adults interested. More so than in the first one, the picture is kept upbeat by the hilarious presence of Snowbell the cat, voiced by Nathan Lane, who has one terrific one-liner after another. A favorite moment of mine is when Snowbell is serving as a tool so Stuart can speak into a payphone. Their time runs out and he asks Snowbell for more change. The cat looks at the mouse standing on his head and cackles out: \"What do I look like? A fanny pack?\" \"Stuart Little 2\" is a real treat to look at with some gorgeous cinematography and a deliberately over-painted New York City with everybody in the movie wearing extravagant outfits. The special effects used for Stuart, Margolo, Snowbell, the falcon, and the other animated characters in the film is very good, best exemplified by the eyes of Stuart and Margolo. Their eyes are solid black with no visible pupils, but the animators carefully manipulate the characters' expressions to mirror every emotion that could be asked for from a real-life performer.<br><br>Perhaps the best element of \"Stuart Little 2\" is the change of point-of-view from the first one. In the original film, most of the plot involved the Littles' difficulties in adopting a talking mouse as a child and a great portion of the film was people looking down upon little Stuart. Here, the story takes place on Stuart's level, from his point-of-view, and we come to associate and identify more with him this time around. I also really like Hugh Laurie, Geena Davis, and Jonathan Lipnicki as Stuart's adoptive family, who do a really good job at maintaining the illusion that they are communicating to a two-inch mouse adopted as their son and treating him with loving affection.<br><br>But the best scenes are the scenes of Margolo and Stuart, particularly a little scene where they are on a date at a makeshift drive-in movie theater: sitting in Stuart's model car in front of a television, watching Alfred Hitchcock's marvelous 1958 film \"Vertigo\" which we later learn is a poignant choice as there are some parallels in the relationship between Stuart and his avian companion.<br><br>\"Stuart Little 2\" is a wonderful family film. Some may question my judgment and wonder if I exaggerate just a little in shelling out my highest rating for this film. You may ask: maybe it's good, but is it *that* good? Well, maybe not on some critical scales. But the way I review movies, dissecting and analyzing but more or less reporting how I personally responded, than no, not in the least. I enjoyed \"Stuart Little 2\" so much, every little second of it was a gem for me, and I more than enthusiastically award it ten stars.","user":"TheUnknown837-1","rank":[12,13]},{"title":"A parable on drifting siblings","rating":8,"date":"7 October 2012","review":"Stuart Little 2 is one of those children's films that appeals to both the children and those who must pay the ticket price. I thought those kinds of films only existed with the name \"Pixar\" stamped on them or the occasional \"Dreamworks.\" The film largely compiles odds and ends from the first film to try and lift the sequel off its feet but its sweet, good-natured charisma and kinetic warmth make the seventy-eight minute endeavor worth it.<br><br>The \"Little\" family are still happy, vibrant, and warm in their quest to give their new mouse sibling, Stuart (voiced by Michael J. Fox) a home he can be proud of. Yet the mother (Geena Davis) still worries that Stuart's small stature gives him the unfair advantage in sports and life itself, while the father (Hugh Laurie) is more of an optimist and feels that if a Little applies himself, he can be quite the character.<br><br>The main themes Stuart Little 2 tries to explore, however, are not about doing anything you want to do and proving that being small isn't a limitation but a welcomed challenge, like the first film, but more about siblings that drift away from each other. Stuart's older brother, George (Jonathan Lipnicki) is beginning to spend more time with his friends rather than Stuart, and while this is a natural part of life, it is nonetheless heartbreaking to the mouse himself, who begins to view himself as just a pest (no pun intended).<br><br>Stuart begins to befriend a small yellow canary named Margalo (Melanie Griffith), who he rescued after seeing her being pursued by an ominous falcon in the sky. It turns out, Margalo is in cahoots with the falcon to steal valuables from homes all across New York City, but little Margalo keeps that secret away from Stuart when she discovers how kind and gentle he really is.<br><br>Stuart Little 2 isn't particularly compelling or a very life-affirming film, but it's a genial, warm picture, with great computer effects, wonderful yet subtle themes on sibling relationships, and a plethora of jokes that kids and adults will find pleasing and joyful.<br><br>Starring: Geena Davis, Hugh Laurie, and Jonathan Lipnicki. Voiced by: Michael J. Fox, Melanie Griffith, and Nathan Lane. Directed by: Rob Minkoff.","user":"StevePulaski","rank":[7,7]}]