[{"title":"Cheech and Chong see the Millenium","rating":18,"date":"18 December 2001","review":"It's been done before in \"Friday\", and  \"Up in Smoke.\" There's no great plot line. There's no moral plea. There's no character development, cool graphics, intense cinematography or internal conflict. And yet.<br><br> This movie defies all the rules of story writing and film making. The absolute preposterousness of the storyline alone is intellectually offensive. And yet.<br><br>It was hilarious. From beginning to end, I laughed.<br><br> Warning: This is what my mother would call \"ignorant humor\". The things that in the opinion of the majority degrade and offend, but for some reason are funny.<br><br> Rappers Method Man (Wu Tang Clan) and Redman play two \"potheads\" (for lack of a better term) who through the use of a magical herb attain brilliance and gain acceptance to Harvard University. There is a scene that spoofs the old Reese's Peanut Butter Cup commercial where Method's character Silas sits in his car with a bag of contraband and no blunt. In the next car Redman's character Jamal sits in his car with blunt and no contraband. And thus a friendship is born. The two Ivy Leaguers wreak havoc along the Eastern Seaboard Cheech and Chong style.<br><br> You can tell by watching his MTV Cribs special that he has a funny bone. But who knew Redman was a bonafide comedian. Method Man was more or less the straight man but the rest of the ensemble cast provided enough laughs to split your sides. Especially notable was Mike Epps who portrayed Babypowder the Pimp. Can you imagine a pimp at Harvard? The alumni will no doubt write many letters.<br><br> Parents: The subject matter of this film is questionable. This film may not be suitable for children. Unless you smoked a lot of \"grass\" back in the 70's. Then you can't trip because  you'll be hypocrite if you do.<br><br> There's more marijuana in this film than \"Friday\" and \"Next Friday\" put together. If that's a turn on for you then by all means see the film.<br><br> If it's a turn off for you go see it anyway. The Harvard Pimp is worth it.<br><br>Don't tell my mother I laughed.","user":"UrbanFilmCritic","rank":[70,89]},{"title":"Allow me to explain why it's Hilarious!!","rating":10,"date":"4 October 2008","review":"I understand the fact that everyone has got their own taste when it comes to a movie genre and therefore some might feel that a \"comedy\" is based on a particular set of principles, essentially going into humour. But there are different ways in which many people perceive humour, some believe it's all about the jokes, some enjoy the swearing involved and others might love the typical Woody Allen script.<br><br>This movie isn't set to achieve an Oscar or any kind of prestigious award. I am pretty sure that that was the last thing that came through the writer's and director's minds. The only thing they intended to do was to make a film that could be enjoyed by the audience that loves the stereo-typing comedy films, which to be honest is growing faster and faster. And they nailed it.<br><br>The story is hilarious, the acting, well method and redman are hilarious at what they do best, which is fool around. Don't expect any intelligent sophisticated humour or satire. I'm not implying that the movie is full of dumb humour, on the contrary, its loaded with brilliant funny situations and loads of jokes. If you liked soul plane, then you're going to love this one.<br><br>So don't vote negatively just because it wasn't your cup of tea and try to understand that there's a different generation out there that really appreciates a good fun entertaining movie to watch as they also appreciate the other styles of \"comedy\".","user":"ac_away","rank":[40,51]},{"title":"'Highly' underrated","rating":22,"date":"22 March 2003","review":"Being a proud fan of lowbrow humor and a fan of Method Man and Redman, \"How High\" seemed like a no-brainer comedy, and I was right! This movie can only do harm to people who get offended easily at racial stereotypes, pot smoking and more pot smoking. The movie pokes fun at everyone; class and race. One glance at How High would make you think they're trying to make another \"Animal House\". Well, I think it's up there. It's got everything except the fraternities. From childish pranks to goofy humor, Meth and Red carry the movie to its predictable conclusion. Many people will write this off as another \"Black comedy\", but it really is a comedy for everyone. It just \"happens\" to star two charismatic rap artists. Director Jesse Dylan (yes, Bob's son) knows how to set up a joke and pull the punchline. This film is far funnier than the last two \"Friday\" films combined (Yes, let's just compare it to other pothead comedies).  The supporting cast is terrific as well, including the clueless Fred Willard and uptight Obba Babatunde. The only downside is Mike Epps' pimp character, done much better by Eddie Griffin in \"Deuce Bigalow.\" <br><br>The bottom line: Rent it, have a few beers and some good laughs without taking it too seriously.","user":"rogerebertsclone","rank":[57,75]}]