[{"title":"Charlotte Rampling, mostly","rating":13,"date":"13 June 2005","review":"\"Under the sand\" is Francois Ozon's last picture in the 20th century (not the motion picture company), preceding his more recent work of \"8 femmes\" (2002), \"Swimming pool\" (2003) and \"5x2\" (2004) going into this century.<br><br>The first 15 minutes say more than meets the eye. The relationship between husband and wife is depicted in the blandly uneventful annual ritual of going to the summer cottage. Yet, during the rest of the film, you keep thinking back to these first few minutes, looking for clues to explain what you see. You recall how at the service station break she draws a puff from his cigarette and then almost playfully puts it in his mouth, and how he does not seem to respond much. You recall how before going to bed, she is visibly happy (though not excited, as they must have done this for years) at \"finally getting to the vacation\" and how he does not seem to respond much.<br><br>When he vanishes from the beach, presumably drowned, it gradually becomes clear that the film is a psychological study of the woman, a detailed account of how she gets on with her life  career, friends, romance  as if he is still around, at least in one corner of her mental existence. Without the details depicted in the first 15 minutes, this would have been it, a refusal by someone who is bereaved of a beloved to recognize the tragedy. (Ozon, I understand, interviewed grief counselors to study bereavement to prepare for the film). The first 15 minutes however add another layer, of doubting whether he simply disappeared because she has bored him so, as suggested by the mother-in-law.<br><br>Words film critics used to describe this film include unsentimental, restrained, simple, ruminative. Charlotte Rampling's performance has been universally hailed by critics as one of her best. They are right. Watching Rampling in this film is quite a mesmerizing experience.","user":"harry_tk_yung","rank":[22,23]},{"title":"Life, Death, Grieving , Loss and Coping","rating":10,"date":"30 July 2005","review":"François Ozon is a rare director, one who takes a simple story, places it in the eyes and bodies of his cast, and simply lets the tale tell itself. SOUS LE SABLE (UNDER THE SAND) is an unforgettable film experience that probes deeply into our psyches, hearts, and reason: how do we cope with sudden death? Opening quietly in the French countryside, a loving middle-aged couple begins a brief vacation in a family house, quietly and lovingly going about removing dustcovers, opening shuttered windows - settling in for a time of being alone together. Marie (Charlotte Rampling) is a professor of English in Paris (her specialty is Virginia Woolf) and Jean (Bruno Cremer) is her retired husband. Their long-term love is palpable: Ozon provides almost no dialogue, as none is needed to establish this special relationship, so powerful is the non-verbal communication between Rampling and Cremer. They visit the beach the next day and while Marie is sunbathing, Jean goes for a swim - and never returns. Marie searches for him, engages lifeguards, and ultimately returns to Paris, trembling but intact. Months later, while Jean is never found, we see Marie reacting as though he still exists. She visualizes him in various situations and the two actors (yes, Jean is present in these scenes) interact as though nothing has changed. But Marie's friends note with great concern that she is 'delusional' and make various attempts for her to seek professional and emotional help. When news eventually arrives that Jean's body has been found, she internally denies this possibility but eventually returns to the vacation house town to identify the bloated corpse. Even at this point, though obviously in shock, she denies that the corpse is that of her beloved Jean. She walks back to the site where she last saw Jean and in the distance a figure rekindles her hope...<br><br>Charlotte Rampling delivers a performance wholly committed. She communicates the spectrum of feelings of this challenged strong woman with her eyes, her gazes in the mirror, her interaction with her class of students, her friends, her admirer with such power that makes her Marie a wholly credible creature stricken by loss yet surviving in her chosen manner. It is one of the great performances of cinema. The entire small cast of this film is perfection. Ozon is a magical director and continues to prove he is one of the most honest and quietly powerful figures in today's cinema. Highly recommended.<br><br>Grady Harp","user":"gradyharp","rank":[45,51]},{"title":"If you think you might like this you probably will.","rating":8,"date":"15 October 2001","review":"I disagree with a few comments below: first, I believe it 'is' appropriate to switch back and forth between French and English because the character is an english literature professor in Paris and has bilingual friends; second, I feel it is unfair of anyone to characterize the main character as elderly, she is sensual, attractive, and tentatively has a good life to live in her future.  I think the loss to the woman of her husband is like suddenly confronting the loss of the last 25 years of her life. To be able to cope with this changed reality she must cautiously explore a new experience; she is afraid to let go of her past and afraid to take hold of a future. I believe at the end of the movie we are shown that she will continue to refuse to relinquish the past, yet, invariably, it is shown to her that she must go on, embracing the present, as must we all.","user":"moovyfellow","rank":[15,17]}]