[{"title":"10 reasons this is the best budget buy ever......","rating":10,"date":"16 January 2006","review":"10 reasons you must see this film.<br><br>1. You get to see a leprechaun rap. 2. this film contains zombie ho's 3. the actors take themselves seriously 4. Every now and then every one decides to start rapping. 5. every other word is mother f*ck 6. It works on the level of a 'gansta' drama....then you realise there 'homie' was killed by a leprechaun rather than in a drive by. 7. that leprechaun got some major gold. 8. the leprechaun has sex.....with a transvestite. 9. they defeat him by having him smoke a four leaf clover. 10. I like waffles.<br><br>If you don't want to see it now then you must be crazy. Its the best movie i ever brought from behind the shelve at a garage.","user":"mightypekingman","rank":[26,31]},{"title":"An important movie","rating":9,"date":"6 November 2003","review":"***SPOILERS***   ***SPOILERS*** It has been said the good movies are merely entertaining, whereas great ones alter the way we think and feel about things. Leprechaun 'N the Hood is a great movie. Writer Doug Hall had a message he wanted to convey, and thankfully he came into contact with a director the caliber of Rob Spera to help him bring it to the masses. Spera was able to relay Hall's vision in a manner that was both entertaining and touching. The reason this film resonates with the audience is due to the characters and how they develop throughout the story. The plot revolves three aspiring rappers and their dreams of fame and fortune as their ambition leads them down a road of pain and despair. As part of their Machiavellian plot for stardom, they are reduced to robbing a famous rap producer and end up stealing a magic flute that guarantees their success in the rap world. At the same time, they also inadvertently awaken the vile leprechaun. Our first impression is that the leprechaun is an abject and detestable creature, and perhaps he is. By the end of the movie however, the viewer can't help being moved to anything but compassion for him. It isn't so much that the leprechaun evolves during the movie, it is more that the viewer evolves as the story progresses. As Leprechaun 'N the Hood unfolds, we come to accept that the deplorable leprechaun resides within all of us. We realize that everyone has a leprechaun within, it is only a matter of how well we contain it and what events could lead it to manifest itself. It the case of Postmaster P., It is his greed and ambition that unleash the Leprechaun, and we all see the horrific results. Unlike trash such as \"It's a Wonderful Life\" this movie will have a profound effect on viewers because the characters are realistic. They have real faults and weaknesses, and we can truly learn about others and ourselves by understanding them. This is a movie ideal for parents should watch with their children and then discuss afterwards. From the opening scene to the heart wrenching conclusion in which the leprechaun explains his plight in a poignant rap of his own, this movie will change the way you look at yourself and those around you. As the leprechaun explains in his song \"I hate to resort so soon to magic, I haven't been la!d in so long it's tragic.\"  Tragic indeed.","user":"billwill1456","rank":[33,41]},{"title":"I Wants Me Money Back!","rating":7,"date":"7 July 2000","review":"OK, it wasn't that bad, I just really wanted to get to use that line for once (my friend who went to see Lep 1 in the theater yelled it out during the movie and got a standing ovation).<br><br>My same friend also made a good point about watching the Lep series in general: you know exactly what you're getting up front. It's not like after the movie you're going to say to yourself, surprised, \"well, THAT was a total piece of sh--\". You can't really be mad at yourself. It's not like going to see, say, Play It To the Bone or 8 Heads in a Duffle Bag where you think you might actually laugh once or twice at something or enjoy the movie at some points, but end up wanting to punch everyone involved in the face (even Joe Pesci). no-one tricked you into it.<br><br>Anyway, this one was better than part 4 (In Space), but of course that's not saying much. The best one of the series (I can't believe I'm saying that-I should say \"the least painful to sit through\" instead) was the one set in Vegas. This one I rented mainly because I heard it was mildly amusing, better than part 4, but mainly I wanted to see Ice-T in a 70's pimp outfit with a big 'fro. I think the whole budget went towards paying his salary and they didn't have much left over for costumes, special effects, sets, etc. Oh well, still beats The Haunting.<br><br>This one had at least some entertainment value because it didn't take itself too seriously. A couple of things happened I didn't expect. Of course, couple things also happened that I didn't WANT to happen but had a horrible premonition that they were going to, such as the Leprechaun smoking a blunt and rapping (though not at the same time, Thank God). They were a few times I was surprised to burst out laughing at stuff that I think was supposed to intentionally be funny. There was one particularly funny moment when the heroes are hiding from  the Leprechaun that was worth the money I paid to rent it, because it was exactly like a scene from Scooby-Doo (in fact, I think it WAS a scene they stole from Scooby-Doo, but at least they stole from something amusing). I thought at first it was just because I had the flu at the time I watched it and had lots of Nyquil, but then my husband laughed at it too. There's another scene where two characters are having a very serious discussion about how to go after the Lep -- this is after a tragic event occurs, so I figured the movie was going to stop trying to be funny-- and you see that one of them is holding \"Leprechauns For Dummies\". For some reason (maybe this time it was the Nyquil) that also struck me as pretty amusing.<br><br>I bet Spike Lee would be really offended by this movie. For instance, you could easily have a Leprechaun 5: In the Hood Drinking Game with your friends (hey, you could use Nyquil! It's even green) during the movie just by drinking every time a character says, \"a'ight\", \"yo\", \"homie\", or \"that sh*t is WACKED, man!\". So, while on the negative side, we have the fact that the movie is completely stupid and mindless, with little gore, and really cheap production values, we do have the positives of a few good laughs and the fact that it would pi$$ off Spike Lee.  I've seen a lot of horror movies WAY worse and more insulting to viewer's intelligence, so I didn't really want my money back after I rented it.","user":"Rusty-61","rank":[12,15]}]