[{"title":"Better than I expected...much better.","rating":7,"date":"7 September 2003","review":"When I first saw the trailer to this movie on some other action DVD, I thought, \"You must be kidding me. This has got to be the worst straight-to-video HK-action rip-off ever made.\" But after watching the first few minutes of it on cable, I knew the trailer was all wrong. They'd focused on all the wrong elements. I found \"Love and a Bullet\" to be something of a black \"Snatch\"-type movie (no jokes, now), very tongue-in-cheek and enjoyably self-referential. The final battle, as silly as it was, was easier to swallow after the movie's setup. After all, it's not a straight gangsta-action movie; it's more of a black comedy. In both senses of the word. Definitely worth the 90-minute investment.","user":"Curtis G.","rank":[9,14]},{"title":"Quirky","rating":10,"date":"10 June 2003","review":"Picture this: a light-hearted action movie about a cold-blooded killer that does not hold back on the violence.  Well that pretty much describes Love and a bullet.  Ironically, whyat makes the the movie light-hearted is the honest and probably realistic reactions to many of the little speeches as well as certain actions that the main character has.  A key example being when a fellow hitman gives him a speeck about \"the life\" and the main character simply says that after thinking about it for awhile he has no clue as to what his associate was talking about.  Also, there are many points where this movie will fall into the typical hollywood syndrome of making the character overyl pathetic with the rush of emotion but it doesnt, instead, it makes him even more of a badass.  Another unique aspect is that the majority of the movie is the main character reflecting on how he became a a hitman, eventually going into into his confusion over his presetn situation and comparing it to another similar event in which he fall s on love with a fellow hitman (or hitwoman to be more accurate). As for the action scenes, three movies came to mind: The Way of the Gun, Eqilibrium, and Legend of Drunken Master.  The final martial arts bout at the end clearly shows its Legend of drunkne master unfluence with the villian fighting mainly on one foot and at oppne time balancing himself on one foot in a kick stance.  Also, you kinda see a rugh draft of Equilibrium's gun-kata although Love and a Bulllet's obviously has break-dancing as a basis for it.  As for way of the gun, i only though of that becuase there is an instance where a baddy is hiding behind a corner and his foot is visible by the hero resulting in the baddy's foot being shot.","user":"illeatyourdog","rank":[6,11]},{"title":"Confused?","rating":21,"date":"21 January 2004","review":"Love and a Bullet is a confused movie.  At times it seems like a comedy with the use of the MF word more times in a sentence than any other word.  But other times with its blood and violence it want to be a film trying to shock.  All the while filled with philosophy that doesn't make sense to anyone and they note it.  As love story starts to form, you feel small moments.  You feel for Bishop on thanksgiving but then it becomes a comedy of errors again.  This movie could have been better if it decided what it was before it decided who should die.","user":"fnordknt","rank":[4,8]}]