[{"title":"I actually really rather like Signs...","rating":7,"date":"27 May 2007","review":"Signs is set in Bucks County, Pennsylvania where Graham Hess (Mel Gibson) lives on a farm with his his two young children Bo (Abigail Breslin) &amp; Morgan (Rory Culkin) plus his younger brother Merrill (Joaquin Phoenix), one morning they discover elaborate crop circles in their corn fields. At first they think it's a hoax but there are newsflashes all over the TV which say these crop circles have appeared all over the world, then things turn really sinister when UFO's start appearing in the sky by these crop circles &amp; when footage of an alien is caught on a camcorder the Hess family have to consider the possibility of an alien invasion...<br><br>Written, produced &amp; directed by M. Night Shyamalan who also has a fairly big role in the film as Ray Reddy who ran over Mel Gibson's character's wife I actually really liked Signs. The script which takes itself pretty seriously could be described as somewhat slow at times but I thought the story was engaging &amp; pretty intriguing which kept me hooked. I really liked all the character's here, OK maybe the kids are a touch annoying as they tend to be in films but I thought this was pretty well written with a decent balance between humour &amp; seriousness. The alien invasion stuff is kept to a minimum &amp; little is seen of the aliens themselves, this is a film where less is more &amp; it retains a air of creepiness around the aliens. It's not big on action either &amp; concentrates on the Hess family &amp; almost totally ignores the outside world which is unusual for recent alien flicks which tend to be nothing more than showcase's for overblown CGI computer effects as in Independence Day (1996) &amp; War of the Worlds (2005) so Signs is a nice change of pace, I mean there's nothing wrong with huge CGI special effects filled films but Signs was just a nice change.<br><br>Director Shyamalan does a fine job but then he had a mega budget to help him, for those looking for another The Sixth Sense (1999) will probably be disappointed as Signs is a very different film &amp; doesn't have such a great ending. I thought there were some creepy moments here &amp; the restraint in the usage of CGI here helps create an ominous atmosphere &amp; leaves something to the audiences imagination which is a novelty these days. What CGI is here is very good &amp; the alien when eventually seen looks OK if a little unimaginative.<br><br>With a whopping budget of $72,000,000 Signs obviously looks the business &amp; has that big budget Hollywood look although that huge figure did surprise me a bit as there's not many special effects, there's only about five character's in the entire film &amp; it takes place in the same location for the most part so 72 big ones does seem like quite a lot considering the end result. I thought the acting was pretty good throughout.<br><br>Signs in my opinion is a great alien invasion flick that tells it's story in a different sort of way, I liked it a lot although I know for a fact there's a lot of hate out there for it. Personally I think it's well worth a watch.","user":"poolandrews","rank":[53,73]},{"title":"underrated film","rating":28,"date":"28 July 2005","review":"I don't think this film deserved the poor reviews that some gave it. I've only seen 3 of Night Shylaman's films (6th Sense, Unbreakable) and this one is the most sophisticated in my mind in terms of the director manipulating the viewers into seeing and believing what he wants you to believe.<br><br>This is not Gibson's worst film by any means. If anything he gets to try to portray an understated, confused, and emotionally scarred character and I think he soft-sells it very well. Joaquin Phoenix also has a similar character to play and he too soft-sells it well. That was probably not an accident as their calm, sullen personalities contrast with the unbearable situation they find themselves in.<br><br>If you haven't already, see it - and keep an open mind.","user":"J_Charles","rank":[294,464]},{"title":"Unspeakably brilliant","rating":10,"date":"5 August 2002","review":"In last week's issue of Newsweek, M. Night Shyamalan is quoted as saying to his accomplices in crime, \"If I did 'Pokemon 5,' would you come? Come on! I could turn it into a metaphor for the human condition!\" The scary thing about that comment is not only that he probably *could* do it if afforded the opportunity, but also that he pulls off a similar trick in \"Signs,\" which from an artistic standpoint is easily the best film he's ever done.<br><br>The greater picture of the film is the crop signs that suddenly and quickly start appearing worldwide - and the question of whether they mean anything for mankind as a whole. But once the greater picture is laid out in the first twenty minutes, it takes a complete backseat to Shyamalan's happy &amp; pained family of four, and focuses on their feelings, their worries, their doubts; as the horror of what's transpiring in the greater picture creeps closer to them.<br><br>When Merrill says, \"It's like War of the Worlds,\" it's NOT hyperbole, even though we never see what transpires in the greater picture. Instead, Shyamalan focuses on the subtle nuances of the fear of the individual. Instead of seeing hundreds of soldiers fighting in hand-to-hand combat with gigantic bugs, we gain an appreciation of what it's like for those who aren't blessed with such courage - or, in Graham Hess' case, being able to find it again.<br><br>This is the first horror movie I've ever seen that both genuinely scared me - because you sympathize with the family's plight, even without seeing it - and made me laugh at the same time, because the family's reaction to the terror unfolding in the world is a sign itself of a strength that most don't have - the ability to be levelheaded and always keep things in perspective, no matter how scary or \"out-there\" the situation is.<br><br>As usual, Shyamalan gets excellent performances out of all of his actors, especially Willis &amp; Breslin as Graham &amp; Bo. As usual, everything you see means something - the trick, like with \"Sixth Sense\" &amp; \"Unbreakable, is whether or not you can put them all together. I'd be shocked, though, if this film doesn't get nominated for its sound - the soundtrack is Hitchcockian-creepy, and Shyamalan is a master at using sound effects to create the terror that the visual effects normally do.<br><br>Don't go to \"Signs\" expecting a monster movie, or a shock ending, but definitely see it before the summer's out, and be prepared to be moved in ways that you previously couldn't have imagined from a horror or suspense film. It's been said that a genius of film is one who knows how to transcend or reinvent a genre - and with this film, M. Night Shyamalan is decidedly on his way there, if he hasn't already reached it. 10/10","user":"reismark","rank":[81,120]}]