[{"title":"The first milestone. Sinister mystery of Hogwarts.","rating":9,"date":"5 June 2018","review":"\"... The magical power that came to Joan Rowling from a different world, pulls for itself, and the book is read in one breath.\"\nBook Review, December 18, 2000<br><br>The second book about the adventures of the young wizard Harry Potter world waited impatiently. And finally, he waited. \"Harry Potter and the Chamber of Secrets\" appears before the reader's eyes with a bright and original work. Of course, it relies on the first book, but it remains individual. \"Harry Potter and the Chamber of Secrets\" - a darker and more terrible book, unlike the first. So became the film. But the film and the book have not lost their charm and easy immediacy. It's still the same kind of fairy tale about the fight between good and evil, where good will certainly win.<br><br>The magical world of Harry Potter has not changed. All the same oblique streets of London, the splendor of Hogwarts, the Forbidden Forest with its secret inhabitants, The slanting alley, the eerie Lute Lane, the unfriendly Rattling Willow, the huge school yard, the stunning quidditch. All this was preserved and was moved by magic wave in the second film, only slightly transformed. Hogwarts is a bright and active participant in all events. This castle, which became home for Harry, is no less important character than our young hero. Hogwarts carries in itself tying knowledge and great wisdom. This huge, majestic building knew a lot in its time. And all its secrets, its architecture and attract the eye.<br><br>In \"Harry Potter and the Chamber of Secrets\" we meet the amazing and frightening creatures of the magical world. Dobby's elf is very cute and funny. In such a small, frail body is hidden a wide soul, suffering in vain. He does his best to protect Harry from danger. But Harry Potter, like a magnet, attracts them. Favorite animal Hagrid turns into an unpleasant monster - a giant giant spider Aragog. He is wise, old, but does not inspire confidence. And on top of everything, the mighty, dangerous serpent Basilisk appears on the screen. There are many legends about this snake, and Joan Rowling decided to add it to her epic. And, in principle, not in vain. He inspires reverence and horror, but at the same time a frank desire for Harry to finish him off quickly. Another amazing character in the film is Phoenix Fawkes. Amazing bird flown from the pages of the book to the screen. She is an ancient mythical creature, dying and rising from the ashes. It reminds us of the eternal cycle of life and death.\nSpecial effects in the film, in other ways, as in the first, not at altitude. But even seeing a few implausible spiders and a snake, you believe everything that is happening on the screen. The magical, mysterious, magical and frankly amazing world of Harry Potter draws and you just do not want to return to reality. Chris Columbus, who became the director of the Potters for the second time, could not lose the charm and atmosphere of the first film. Just the movie \"Harry Potter and the Chamber of Secrets\" became more sinister, frightening and full of dangers.<br><br>Characters have not changed. Bright, alive, emotionally embodied on the screen of their heroes magnificent English actors. The cold and tough Potions master Severus Snegg performed by Alan Rickman, the same adamant Minerva McGonagall, the wise director of the Hogwarts School Albus Dumbledore (the eternal memory of Richard Harris, who died three weeks before the premiere of the film), the kind-hearted forester Hagrid. Pleased with new characters. Lucius Malfoy performed by Jason Isaacs is cruel, adamant. It just blows something negative and extremely unpleasant. Zlatopust Lokons is the life-builder, reclining on the laurels of others. He turned out to be too sugary, pretty, I would even say sugary. And, undoubtedly, the actor Kenneth Bran is on top. His character, or rather his performance, is very ironic.\nThe unchanged trio of the main characters remained the same. Harry Potter is the star of the magical world, the orphan boy, who grew up in disgusting muggles, displays remarkable courage, desperation and determination. The one with which courage he rushes into battle, you can just envy. I'm torn by internal contradictions, his similarity with Lord Voldemort, his knowledge of the snake tongue. He is afraid of all this. And Harry desperately tries to understand himself. But when you need to become a hero, he is ready for this, because he is a hero in the full sense of the word. He is ready to give his own life for others. Is this not the highest manifestation of heroism? But Harry does not boast of it. And this is a huge plus to his character.<br><br>\"I'm sure that Mr. Potter will always be there to save us.\" - \"Certainly.\"\nLucius Malfoy and Harry Potter.<br><br>Ron Weasley remained absolutely the same except for the character. He transformed, becoming better. His behavior towards Hermione, when she was insulted by Draco, calling her a Mudblood, his courage in the Forbidden Forest among not one hundred spiders, whom he fears until his death, causes respect and approval.<br><br>Hermione Granger is still the same smart girl with a lively mind and a great intellect. She is very natural and sincerely wants to help others. With her character there are certain metamorphoses. Hermione clearly ceases to be such an avid guardian of order.<br><br>\"We are badly influenced by it.\"\nRon Weasley, Harry Potter and the Sorcerer's Stone.\nTom Narvolo Reddle is the past of the cruelest magician of the magical world of Lord Volan de Mort. This character is interesting with his striking resemblance to Harry. They are like halves of one whole. Harry has collected all the good and positive, in Voldemort everything is bad and negative. They are very similar, but they are very different. The choice. That's what makes Harry the way he is and distinguishes him from a dark magician. Choosing Harry to live the life he wants. His choice.<br><br>\"Harry Potter and the Chamber of Secrets\" - a magical, mysterious, full of magic, amazing and terrible creatures canvas director Chris Columbus. For the second time we stepped into this unique world full of mysteries and terrible discoveries. Music, Gothic entourage, Hogwarts and unchanging heroes in the fight against evil: welcome to the magical world of Harry Potter, created by the hand of a fabulous storyteller Joan Rowling.","user":"BiiivAL","rank":[66,71]},{"title":"Darker fantasy than the first Potter film...brisk despite its length...","rating":20,"date":"20 June 2003","review":"Prepare yourself for a darker fantasy this time with some harrowing and scary special effects. Apparently J.K. Rowling has hit upon the fact that kids love to be scared stiff along with being entertained by touches of humor and excitement--although I think her imagination works overtime on scenes like the vomiting fit for Ron, one of the more tasteless sequences.<br><br>And apparently the makers of this Potter film have met the challenge of providing spiders and snakes that are hideous enough to have Ron and the audience in a fit of hysterics. It's all here--the main events anyway of the Rowling book--and for extra measure they've given a much needed humorous role to Kenneth Branagh who has great fun with his role as the self-loving Gilderoy Lockhart. The only real drawback is that Maggie Smith has very little to do--but the main chores belong to Daniel Radcliffe, Emma Watson and Rupert Grint who continue to charm as the three leads. Jason Isaacs as Lucius Malfoy has a commanding presence and an amusingly wicked final scene involving the computer created Dobby who steals every scene he's in.<br><br>Should keep Potter fans happy--and for a movie two-and-a-half hours long it moves along at a brisk pace from one adventure to another with what by now appears to be mechanical skill, thanks to artful direction by Chris Columbus who knows how to keep this sort of thing moving. John Williams' perky score is a distinct help.","user":"Doylenf","rank":[39,47]},{"title":"I want more!!!","rating":8,"date":"9 November 2002","review":"Chris Columbus said he wanted to make a 2,5 hour movie that feels like 30 Minutes. Well, in my case he surely succeeded! I saw the movie as a member of the press and couldn't get enough of it. I would have gladly sat in the cinema for another two or three hours with a biiiig smile on my face.<br><br>Like part one, \"chamber of secrets\" stays true to the book. I don't know about you - but I HATE it when movie makers change the storylines, add or remove characters and do it for the \"sake of the art\". I think they do it because they are too lazy to create their own storys, so they rip off other peoples ideas and crush them to make it more comfortable... If a book is loved by millions of readers there must be a good reason for that. Chris Columbus has captured the essence of the book on screen. So, after \"philosophers stone\" he delivered again!<br><br>When reading the book I always envisioned Michael Crawford playing Gilderoy Lockhart. His broad smile and clumsiness à la Frank Spencer would have been perfect for the role. But instead we get to see Kenneth Branagh, so of course you won't see ME complain. The great find of the movie is Jason Isaacs as Lucius Malfoy. In his short scenes onscreen he makes your blood freeze. And again: all the casting is brilliant. Every character just feels right - even if you imagined something different when you read the book. There also has been talk about the young actors getting older. Well, let me remind you that this also happens in the books. In every book Harry Potter and his friends are one year older. So there's no excuse to take the roles away from Daniel Radcliffe, Emma Watson and Rupert Grint. I couldn't imagine someone else playing their parts.<br><br>Go see \"the chamber of secrets\". It's pure fun and excitement! And it will wet your appetite for more to come. Richard Harris couldn't have asked for a better movie and legacy to be remembered by.","user":"Cheese-18","rank":[97,127]}]