[{"title":"Elegant Hoydens","rating":8,"date":"18 July 2003","review":"There are so few lesbian genre films \"OUT\" there. And for those lesbian genre films that do exist most have characters that are either disturbed psychopaths (my favorite- Heavenly Creatures) or cardboard cutout prototypes that have no place in my world. As result, unfortunately most lesbians are starved for good lesbian genre films.  The best lesbian roles have usually been played out in supporting role characters within the main stream.  To appease the appetite, `gaydar' commands an ever watchful eye to find those precious tidbits.<br><br>However, thank heavens for the charming wit and refreshingly real characters in \"Kissing Jessica Stein\".  \"Kissing Jessica Stein\" goes beyond the stereotypical to explore individual characters for who they are and what they are going through in their lives. The film is a positive reinforcement on the value of relationships to an individual's personal growth and spiritual evolution.<br><br>\"Kissing Jessica Stein\" is a highly intelligent romantic comedy that goes deep to explore emotional relationships:  Not only between Jessica and Helen but also between Jessica and her Mother, Jessica and Josh, other co-workers and all of their friends. The film highlights the importance of discovering yourself and of letting those that love and care about you know who and what makes you happy.  Ultimately anyone that truly loves you wants you to be happy.  Jessica and Helen's continued deep friendship after their breakup is testament to this.  Jessica's painting,  Josh's true love for writing and Helen's continued enjoyment of a lesbian sexual relationship is also testament.<br><br>\nAll is true to the spiritual core of the writers intent.  There is no definitive end to ongoing life.  The writers cleverly leave us to \"marinate\" within our own imaginations.","user":"jeanroman","rank":[51,60]},{"title":"A Risky Plot That Plays Beautifully-A Glorious Winner","rating":10,"date":"16 March 2002","review":"The mantra of the successful and single career woman in New York City, and undoubtedly elsewhere, seems to have evolved to \"All the good men are either married or gay.\"  But still, through singles ads and avocation-based meeting places and just hope they persevere.  Few decide that answering an ad in The Village Voice placed by a lesbian or bisexual woman is an antidote to the scarce-available-man dilemma.<br><br>That's just what copy editor and hopeful painter \"Jessica\" (Jennifer Westfeldt) does in \"Kissing Jessica Stein\" leading to an awkward first encounter, then a close friendship and ultimately an intimate relationship with a stunning, smart and funny art gallery manager, \"Helen\" (Heather Jurgenson).  The film tracks their relationships with each other and with the people in their lives - family, friends, co-workers.<br><br>The story could easily have sunk to the level of a zany, fluffy, sex comedy or, perhaps, strived to be a \"message\" drama. It does neither. What makes it wonderful is that all the characters have whole lives which they live in confusion and compassion, pathos and passion.  Superficially, they are familiar Manhattan, affluent stereotypes.  In reality, they have all the longings and frailties - and strengths - of people everywhere.  The character development is real and affecting without being cloy, cynicism is at a minimum. Helen and Jessica haven't stepped out of a Woody Allen take on Manhattan life.<br><br>Is Jessica really coming out for life as a lesbian or is she trolling in unfamiliar waters out of desperation for a friendship that includes intimacy?  Has Helen given up myriad lovers of both sexes to settle into a domesticated gay relationship?  Are the answers there?  Should they be?<br><br>If a Lifetime Achievement Oscar for portraying the Jewish mother-in-law is ever awarded Tovah Feldshuh will get it.  In this film she hovers dangerously close to a familiar caricature while projecting a warmth and wisdom deeper than the conventional portrait of the hectoring, always worried Jewish mom. The opening scene at a Day of Atonement synagogue service is priceless.<br><br>\"Kissing Jessica Stein\" is an Indie production based on the two leading actresses' collaboration in writing \"Lipstick,\" their 1997 play.  These are two very smart and insightful women: I hope more comes from their fertile and caring understanding of human, not just female but human, needs.<br><br>This film is very New York with scenes from a number of neighborhoods.  I have mixed feelings about the post-11 September premiere decision to delete shots of the World Trade Center and replace them with the midtown skyline. A reviewer noted that audiences at the premiere were distracted by the WTC-dominated panoramas.<br><br>In a largely full theater with a number of clearly lesbian couples along with many more single people and (probably) heterosexual couples it was really nice to be part of an audience that burst into frequent laughter not based on sexual orientation but rather together as people enjoying a really clever, funny-and-serious, good film.","user":"lawprof","rank":[48,63]},{"title":"Excellent Movie","rating":27,"date":"27 April 2004","review":"Kissing Jessica Stein is supremely wonderful.  It is the best romantic comedy  I  have ever seen.  The movie made me laugh, it made me cry, it was everything you could ever want in a movie.  I would recommend it to anyone. The characters are hilarious, but three dimensional and the sense of humor that the  movie carries is phenomenal.<br><br>The scenes in New York and beautifully shot, also and the Jewish family is very  much like my own.  Though some characters might be called stereotypical, I  would have to thoroughly disagree and say that I thought every character had  their our twists and turns. Lastly, I thought the chemistry between Helen and Jessica was so perfect for the  movie.  At first Jessica was uncomfortable, but by the end of their relationship  Jessica was dependent on Helen.<br><br> Beautiful, beautiful movie!!","user":"loopyluly","rank":[40,52]}]