[{"title":"The cut version is one of Jackie's weaker films","rating":5,"date":"19 April 2008","review":"Apparently there are two versions of \"The Accidental Spy\" in circulation, the most commonly found cut one (which runs about 90 minutes) and the harder to find long one (which runs about 110 minutes). This certainly offers a reasonable explanation as to why the plot of this movie in its cut form seems so disjointed. But it does not fully explain why it is so dull. The tone swings wildly from light spy comedy to serious spy drama - the movie never seems sure of itself. The fighting is unremarkable if you've seen any of Jackie's previous outings, and some of the action scenes have a \"been there, done that\" feel to them. The climactic \"Speed\"-like sequence of a tanker that must not slow down or it will explode is spectacular, but has nothing to do with the main plot. On the bright side, there is at least one amazing stunt (Jackie jumping from the roof of a building to the road below using three umbrellas as parachutes!), there is a nice international flavor (the locations include Hong Kong, Seoul and Istanbul), there are two pretty Chinese women, and of course there is always Jackie. (**)","user":"gridoon2020","rank":[8,9]},{"title":"Chan is missing, unfortunately","rating":5,"date":"16 February 2004","review":"Jackie Chan's greatest weakness in his movies is predictability: you know the good triumphs over evil, the good guys are easy to identify, Jackie drop-kicks some butt, and he takes time to save kids and babies (not to mention babes, who sometimes save him). You know that if he gets the girl, he doesn't get very far (PG all the way). <br><br>In his best movies, this is his greatest strength, too: against the repeated backdrop of white and black hats, you're never quite sure how he's going to manage to clutch victory from the jaws of defeat. You know he's going to get cornered by 6 black hats with 18 weapons in some storage room...and somehow use whatever's stored there to do away with the evil-doers.<br><br>Unfortunately, in the Accidental Spy, we're not kept guessing very long. The fight scenes are overly predictable (and, too often, the victim of a punch will start rolling their head back before they're punched). The plot is as unimportant to the Jackie Chan machine as usual, but, unlike other movies of his, the characters aren't memorable. The love-interest is lovely, but not interesting. The spy-who-coulda-have-loved-Jackie is relegated to making plot-digressing phone calls (\"did you order a helicopter?\").<br><br>And it's too bad, because there's otherwise some good material here: drug kingpins and orphans, lost parents, competing spy agencies, and beautiful locations (especially those Istanbul and other parts of Turkey). It's too bad that his escape from a Turkish bathhouse is wasted in this movie (you try to confront a half-dozen apes with only your bath towel to save you...and then not even the towel).<br><br>The dubbing doesn't help. Instead of offering the film in its original Chinese with subtitles (easily possible in this digital age), we're stuck with dubbing that sucks away what little life remains in these two-dimensional characters.<br><br>I really like Chan's movies, but he could have phoned his performance in for this one. Chan, unfortunately, is missing from his own movie.","user":"NoeValleyJeff","rank":[16,22]},{"title":"I know I'll be hated, but...","rating":23,"date":"23 October 2003","review":"Except for one glaring error, I think Dimension Films did an excellent job in recutting/redubbing The Accidental Spy for the American Market. They didn't cut any major action sequences, the editing in general was better in the US version, and the actors who did the dubbing in the US version were 500% better than the ones who spoke English in the original (especially the woman who played Carmen--she had a gorgeous face, but her English was less convincing than Jackie's and she was a horrible actress to boot). Also, the new English dialog is MUCH better in Dimension's version, easily beating out the original's English dialoge as well as the subtitle translations of it's Cantonese and Turkish dialoge.<br><br>For instance, in an early scene where shop-clerk Jackie is demonstrating exercise equipment to a middle aged man and his hot young wife, the man becomes indignant over that attention Chan pays to his trophy spouse. In the original version, the translation of his complaint about Chan to the shop manager is \"Is he a circus clown?\" In the US version, he says, \"Is he hitting on my wife?\" which makes MUCH more sense (to americans anyway). <br><br>Of course, the most unusual thing about this re-edit is that Dimension gave the film an entirely different story!  The original was about the chase for an ultra-lethal, weaponized pathogen called Anthrax II. Spy was set to come out right in the middle of our nation's big Anthrax scare, however, so that was out. In Dimension's remake, everyone is chasing after vials of a prototype drug 100 times more addictive than heroin. I say \"six of one, half a dozen of the other.\" The chase is the important part in a Jackie Chan movie, not what everyone's running after.  In fact, the drug plot works much better in many ways.<br><br>The only thing they messed up was the very end of the film--a common problem for Dimension (see the awkward end of the US version of Legend of Drunken Master). Spy's original ending was both bittersweet and comic. The US version's chopped up ending is just jarringly abrupt and the explanation of the plot is even more nonsensical than the HK version (oddly enough, the \"simple\" US-version explanation is more unbelievable than the convoluted version in the original.). <br><br>The Accidental Spy is Chan's best HK film in years--great cinematography, slick set design, great action! A class act, as these things go.","user":"curtis-8","rank":[22,32]}]