[{"title":"Spoiler : Highly offensive ending...","rating":22,"date":"22 July 2002","review":"Spoiler:<br><br>While most of the offensive and insulting material in this film is unsurprising and rather dependent on one's moral point of view I have to agree with HEP632 and Malmir comments regarding the final scene with the lead character and his ex-girlfriend. It is inexcusable that this rape scene is treated so casually.","user":"follower-fillet","rank":[62,66]},{"title":"rape is never OK","rating":1,"date":"22 May 2005","review":"OK, so the movie wasn't great. Not bad, but not great either. I'm sure you've read a million plot summaries by now. Some good laughs, some cheesy dialogue...<br><br>(what follows is a spoiler, but I recommend you read it before seeing the movie) And then comes the rape scene.<br><br>Thank you to all the other comments posted acknowledging that rape is bad. Having non-consentual sex with a bound, drunk, delirious ex-lover? This is what passes as OK in Hollywood these days? The worst part is the fact that not only is the fact that it was rape never mentioned in the rest of the movie, but the victim is held responsible! I actually signed up for an IMDb account JUST to condemn this film. I'm sickened by having watched that filth.","user":"astev9tu","rank":[85,101]},{"title":"I didn't know the 21st century looked like this!","rating":1,"date":"14 March 2002","review":"It doesn't take much to get me to go to a movie, and I had high hopes for a movie with a) Josh Hartnett, and b) a clever premise. I looked forward to insightful and funny commentary about the relationship between sex and love and men and women in our post-modern world. What I got was breasts. Lots and lots of breasts. While the movie does a fairly good job (by Hollywood standards) of including a panoply of attractive women instead of a cookie-cutter ideal, the women are ultimately reduced to meaningless bodies that crave the \"power\" that sex supposedly gives them.<br><br>WARNING: WHAT FOLLOWS IS A COMMENT ABOUT THE END OF THE MOVIE, WHICH IS SOMEWHAT RELEVANT TO THE PLOT. SO DON'T READ IF YOU DON'T WANT TO KNOW.<br><br>I could go on in that vein for hours, but what REALLY made me almost walk out on this film is the fact that Matt, the hero, is RAPED by is ex-girlfriend in the final minutes of the movie. Did nobody at the studio recognize that act for what it is? If the gender roles were reversed in that scene, it would have totally changed the mood and content of the film. As it was, I kept waiting for Matt, or ANYBODY, to call the police. Instead, movie goers get a happy ending where Matt's new girlfriend finally FORGIVES HIM FOR BEING RAPED. Hooray for Hollywood.<br><br>I guess it's not even safe to go to romantic comedies anymore. Sigh.","user":"hep632","rank":[113,139]}]