[{"title":"A Triumph for Bogdanovich","rating":9,"date":"28 April 2002","review":"Obsession, combined with jealousy, was the impetus for an incident that occurred in November of 1924, aboard the yacht of media mogul William Randolph Hearst, and which in the years since has become the stuff of Hollywood legend and lore.  The story has many versions, but the `whisper told most often,' is the one recounted in `The Cat's Meow,' directed by Peter Bogdanovich, a dramatization of what may or may not have happened during that extended weekend birthday-party cruise in honor of pioneer film director, Thomas Ince, which included an eclectic guest list of the rich, famous and powerful.  What is known, is that the party ended with the death of one of the guests, and that foul play and an ensuing cover-up have long been suspected, but never proved.  And one thing is certain:  Not a single person aboard the yacht at the time has ever spoken of what happened, at least not publicly; but there are those who believe to this day, that someone just may have gotten away with murder.<br><br>\tOnce a powerful force in a young Hollywood, Thomas Ince (Cary Elwes)-- who had formed Triangle Films with D.W. Griffith and Mack Sennett, and later founded Paramount Studios with Adolph Zukor-- has fallen on hard times. Once responsible for forty pictures a year, he now struggles to get a single film made.  And, his birthday aside, he has decided to mix business with pleasure during this cruise, pitching an idea to Hearst (Edward Herrmann), to combine their resources and make movies together.  Hearst, however, has other things on his mind; rumor has it that his mistress, Marion Davies (Kirsten Dunst), is being courted by Charlie Chaplin (Eddie Izzard), and he has brought them together, here, to observe and decide for himself if anything untoward is going on between them.  Hearst is not only in love with Davies, but is obsessed with her, as well as the course of her career, and he's not about to let this baggy-pants comic actor interfere.  And Hearst, a powerful and controlling man, always gets what he wants-- and what he wants right now is for this business with Chaplin to disappear.  So it is, that in the midst of celebration, paranoia overtakes the host of the party, and it's about to cast a pall over the proceedings and ultimately involve everyone aboard in one of the greatest unsolved mysteries ever to come out of Tinsel Town.  It's a story that Hearst keeps out of the papers, making sure in his own way that dead men, indeed, tell no tales.<br><br>\tBogdanovich successfully captures the era, as well as the mendacity of this rich assortment of characters, who are all the more intriguing for the fact that they are real people rather than the product of imagination; and it proves that fact is often more bizarre than fiction.  The excesses and overindulgences of many within the Hollywood community during this period rivals anything happening today, and one of the most telling scenes in the film is when novelist Elinor Glyn (Joanna Lumley) offers her take on what Hollywood really is and what it does to those who dwell within.  Glyn is also the narrator of the film; a wise choice, as it adds a balanced perspective to the events as they unfold, and are summarily grounded by her often wry and incisive observations.  The final words of the film are hers, in fact; a final observation that encompasses so much in so few words, that it provides an impact that makes it the perfect ending.  And it makes you realize what a terrific job Bogdanovich did with this film, and how well he brought this material (screenplay by Steven Paros, which he adapted from his own play) to life.<br><br>\tThe film is highlighted by a number of excellent and memorable performances, beginning with Herrmann as Hearst.  This is possibly the best work he's ever done in his career, perfectly capturing the many facets of this extremely complex man.  There's a depth to his performance that conveys not only the bravura of a powerful individual-- and one who delights in using it-- but the vulnerability, as well.  He also makes you cognizant of the fact that Hearst is a man capable of almost anything, including creating his own reality, and maintaining it with his limitless resources.  It's one of the subtle, underlying nuances that Herrmann brings to his portrayal, which is altogether convincing and believable.<br><br>\tKirsten Dunst also rises to the occasion, turning in a remarkable performance as Marion Davies.  It's a concise reflection of a young actress caught up in a situation that is at once enviable and undesirable, who manages to tactfully negotiate the sensitive issues with which she is faced with a sensibility and maturity beyond her years.  And through Dunst, we see the many layers of Davies' personality; the fun-loving girl, as well as the responsible woman, who finds herself in a perpetually tentative environment and selflessly refrains from playing the prima donna or attempting to act as if she is the center of the universe-- something to which too many others who have been swallowed up by the Hollywood lifestyle over the years are prone.  It's a comprehensive and convincing performance that proves that Dunst has the stuff to fulfill the promise made by her work in previous films.  <br><br>\tThe performance that surpasses them all, however, is turned in by Eddie Izzard, as Chaplin.  Izzard captures the very essence of Chaplin, physically and emotionally, with a detailed portrayal of the man, created through expression and astute introspection.  This is not the on-screen persona, the `Little Tramp,' but Chaplin the complex individual and artist who is presented here.  Izzard brings him to life with singular nuance and depth, and it's a performance that should, by all rights, earn him an Oscar nomination.  Skillfully acted and presented, `The Cat's Meow' is a memorable film that offers some insights into a town and lifestyle that few have ever experienced.  9/10.","user":"jhclues","rank":[55,62]},{"title":"Peter Bogdanovich is back, folks","rating":8,"date":"15 May 2005","review":"I have to say, I thought the Cat's Meow was the cat's pajamas. Peter Bogdanovich has made a story out of an event whose outcome is still unexplained. What's more, it feels like it actually could've happened. The interactions between the characters leading up to the act are given much more screen time than the actual act itself. So when it happens, it doesn't seem preposterous at all.<br><br>The story concerns newspaper honcho William Randolph Hearst (Edward Herrmann) and company celebrating the birthday of Hollywood producer Thomas Ince (Cary Elwes) on Hearst's yacht. That company includes Hearst's lover/actress Marion Davies (Kirsten Dunst), Charlie Chaplin (Eddie Izzard), author Elinor Glyn (Joanna Lumley), gossip columnist for Hearst's newspaper Louella Parsons (Jennifer Tilley), and Tom's lover. Tom hopes to negotiate a contract with W.R. Hearst for Marion to star in his next few films, but Hearst is more concerned about the attraction between Marion and Chaplin. Elinor is nearby to dispense advice, while Louella unsuccessfully attempts to mingle. There's also a pair of party girls on board attempting to have a raucous time as possible.<br><br>The Cat's Meow has an eclectic ensemble with a Robert Altman-esquire taste to it. Edward Herrmann's role may be the most challenging, because he has to juggle eccentric, warmth, and jealousy as W.R. Hearst. Joanna Lumley is wonderfully dry. And for those like me who only remember Eddie Izzard for his droll stand-up work, he's surprising in this film. He's quite good as Charlie Chaplin. Kirsten Dunst is the biggest name on the cast. She's very fetching in the Cat's Meow, and this represents a change of pace from her dearth of Hollywood-oriented films.<br><br>As good as the cast is, this is really just as much Peter Bogdanovich's film. After the excellent Last Picture Show, he sort of faded away and made smaller films (The Thing Called Love, for example). Although The Cat's Meow will not make him a household name, hopefully maybe his work will garner more attention again. His direction is very good here.<br><br>Oh, I should also mention the costume design and music here. The production values in general are excellent in imitating the feel of that era. I was reminded a little of Woody Allen's Bullets Over Broadway (and not just the Jennifer Tilly connection). Anyways, The Cat's Meow is a good movie with interesting characters and thoughtful direction.","user":"deadclowncollege","rank":[29,33]},{"title":"It was Mr Hearst, in the yacht, with the gun!","rating":9,"date":"9 November 2002","review":"`The Cat's Meow' is a mildly enjoyable telling of a notorious tall story that has been told in Hollywood for nearly eighty years.<br><br>Super-magnate William Randolph Hearst (Edward Herrmann) invites a diverse mix of Hollywood biggest names and its oddest fringe dwellers to celebrate the birthday of famed director Thomas Ince (Cary Elwes) aboard his luxury yacht. Things begin to fall apart when Hearst suspects a guest - none other than Charlie Chaplin (Eddie Izzard), the most famous man in the world - of having an affair with his actress girlfriend, Marion Davies (Kirsten Dunst).<br><br>Although the film is entertaining, there is something underwhelming about it. Its stage origins are obvious - characters perambulate from plot point to plot point, spouting exposition, never appearing much more than caricatures, and thus failing to evoke much sympathy.<br><br>The casting of Eddie Izzard in the pivotal role of Charles Chaplin is a grave mistake, though the script saddles him with a most unsatisfactory characterisation of Chaplin to work with. Chaplin was not a serial romancer, as is implied in the film, but a serial seducer. He would have been the last person to urge a woman to run away with him on the basis of undying love. He spent his most famous years running from women who suggested exactly that, freely admitting to them that while sex was a pleasant diversion, his work came before any woman. It's a casting decision that is an obvious attempt to distance us from the Little Tramp as opposed to Chaplin the real man, but we never get a true sense of either. Ironically, Izzard actually resembles the real Thomas Ince far more than does Cary Elwes, and as a real-life cabaret performer could conceivably have brought the flamboyance and eccentricity of the real-life director to life better than Elwes does.<br><br>The film also takes an annoyingly facile view of women, perpetuating the dull cliche that all women spent the 1920s with a bad case of St Vitus' dance and addicted to laughing gas. The grating performances of Claudie Blakley and Chiara Schoras in particular throw the beautifully understated efforts of Kirsten Dunst into high relief. Dunst feels like the only real person in this cast of cartoon characters - beautiful, funny, and vital, she is the best thing in the film. Yet there is never any moment in the movie to suggest the true depth of her dedication and passion for Hearst (portrayed as a roly-poly father figure rather than the hard nosed businessman he was), nor any justification for leaving him for the roguish but uncharismatic Chaplin. Unfortunately, the more interesting conflicts in Marion's  life, such as her growing alcoholism and her dissatisfaction with Hearst's insistence on casting her in leaden romances rather than the comedy to which she was so obviously suited, are only touched on lightly.<br><br>Though it could have been a thought-provoking and complex experience, as Joanna Lumley's poignant final statements imply (and like `Gosford Park' to which it has been compared), in the end `The Cat's Meow' doesn't feel much more substantial than your average game of Cluedo.","user":"SilentType","rank":[35,41]}]