[{"title":"Damned good fun","rating":5,"date":"6 January 2005","review":"As a fan of the novels and the movie Interview with a Vampire, I spent a good half hour yelling at the screen before realizing the following:<br><br>1. These are not Anne Rice's vampires. Every character is different, despite their names (The only one to nail a character was Vincent Perez, the highlight of the movie as Marius. Good job.) <br><br>2. The plot of the movie is not based on the books. It as if someone picked up a copy of The Vampire Lestat and Queen of the Damned, opened to random pages, made assumptions, got bored and stopped reading, then wrote a screenplay.<br><br>3. The vampiric rules adhered to in the books are not followed in the movie. The vampires just do whatever is coolest. A certain vampire can't fly? Why not? And why not give him a trail?<br><br>Once you have acknowledged all these things, you can watch the movie. Have fun. This is not heavy stuff like Interview with the Vampire. Watch Stuart Townsend dance around in a mesh shirt and tight pants, and applaud when his shirt disappears, or, if you like it better, watch Aaliyah gyrate in a scanty metal bra contraption. It's what these two do best. <br><br>Embrace its plot holes and stupid dialog (which lends itself to random quoting), sing along to the entertaining rock songs. Try and figure out what each of the ancients are named. Pride yourself if you can provide any explanation for what happens at the end of the movie, because \"trimming to help the pace\" leaves the ending fairly incomprehensible, especially to those who have read the books.<br><br>Be sure to watch the extra features, the gag reel for laughs and the deleted scenes if you want to know what happened in the movie. Also try the various documentaries, which are entertaining when they throw in weird special effects while people are speaking.<br><br>Perfect for a loud, popcorn-filled Friday night with the friends!<br><br>Prindora (Eibzesii)","user":"Eibzesii","rank":[171,237]},{"title":"As a stand alone vampire flick, it's worth seeing.","rating":17,"date":"17 September 2002","review":"Combining The Vampire Lestat and the Queen of the Damned novels into one screenplay was, ahem, damned to suffer massive story cuts because of the intricate and detailed background of a dozen or so characters involved. The amount of detail always was the strength of the Vampire Chronicles, in my opinion, and they were certainly worth the read.<br><br>That said, the question remains, without the detail and extra characters, can the basic story of Lestat's re-awakening of the Queen of all vampires be entertaining and sufficient enough to sustain itself?  While I can not answer the question with a glowing appraisal, I will certainly admit that it did a decent job of combining all of the basic elements into a stand alone movie.  The fact that this movie can stand on it's own without any ties to the prequel, Interview with the Vampire, is one of it's assets.  You do not need any fore-knowledge of the characters, books, or prequel movie in order to watch this.<br><br>Even though it fits into it's own little package does not mean it was packed very well.  There were some plot holes, some of which could have been filled by simply restoring the \"Ancients\" scenes that were on the dvd.  I understand, as the dvd points out, that they were left out because it introduced another subplot and characters that would add unnecessary confusion.  While I agree with their reasoning, I do think they should have somehow salvaged the scene so that while the introductions of the ancients would have been left out, Maharet's few lines about Akasha's reign of destruction and the vampire's responsibility should have remained.  They would have added a needed sense of urgency and motivation that would have made the final confrontation with Akasha and the ancients a bit more reasonable and satisfying.<br><br>The character of Jessie is supposed to be the human link for the viewer to empathize through as they are taken into the world of vampires.  In some scenes, this works adequately, but on the whole, Jessie's motivations, while they are explained, seem kind of empty.  I am not sure if I can fault the actress or script, but when the movie was over, I still felt ambivalent about the character's experiences.<br><br>There were other elements that were not as fleshed out as they could be. The paranormal Talamasca needed a bit more background about their vampire tracking as did the character of Maharet and her family tree.  Like Jessie, they were given some explanation, but I think a couple more lines of dialogue would have helped.<br><br>As I mentioned, the movie did a decent job of the basic story, but massive changes were made from the source material.  Characters were dropped completely, or merged together, and huge sections of character history were removed.  Most notably, Lestat's history is extremely compacted and revised. Nonetheless, there are some things that remained that I thought were done pretty well.  The character of Lestat in this picture is rebellious and reckless which is more true to the character than he was portrayed in Interview.  Lestat's re-awakening and concert scenes were exactly like I had envisioned when I originally read the book.  The character of Akasha was also as I pictured and a very good casting choice.<br><br>If you are a fan of the books, and you need the twins, Gabriel, Magnus, and crew, you are going to have difficulty sitting through this.  If, on the other hand, you can set that aside and view this as a vampire movie of it's own, unrelated to the chronicles, you will probably enjoy this for the stand-alone vampire flick that it is.<br><br>In summary, worth the rental.","user":"Peter Bott","rank":[79,122]},{"title":"Exactly what I expected","rating":1,"date":"9 March 2005","review":"This film was basically set up for failure by the studio. One, Anne Rice (author of the book) offered to write the screen play but was refused by the studio. Two, they tried to stuff 2 in depth novels in to a 2hour movie.<br><br>I maintain the only way for these two books -Vampire Lestat and Queen of the Damned- to work in a live action form would be through a mini-series. First off the the Vampire Lestat alone takes place from the 1700's to the 1980's and has a plethora of character vital to the plot understanding of the main character, Lestat. The entire book Vampire Lestat sets up the events of the second part Queen of the Damned. Without that full understanding the premise of a movie is destroyed.<br><br>Lestat was not cruel and vicious to all, he was not wanting to go along with Akasha's plans, Marius did not make Lestat, Lestat did not love Jesse or make her, Lestat could not go remain unscathed by the light, Marius was not after David nor the other way around, every character was completely represented wrong, BASICALLY same names different story.<br><br>If they wanted to make a vampire movie, fine. Even if you wanted to be inspired by these novels, fine. But don't piggie back into the theaters off the success of Rice's great novels and characters just to destroy what her loyal readers have come to love.<br><br>If you haven't read the books you won't understand the film really, if you have read the books you will be insulted. That being said, I am such a huge fan I had to see the movie knowing full well this was going to be the case and still went for it. Catch 22, must see it, will hate it.","user":"batman1891","rank":[67,103]}]