[{"title":"Improbable Reality","rating":8,"date":"7 March 2008","review":"If \"The Bank Job\" were fiction, it would be a fairly decent robbery caper. As it is, \"The Bank Job,\" a veritable documentary and realistic whodunit, is awesome. <br><br>Unlike most films, this one requires a couple of advance tips: First, watch it with the improbable idea in mind that most of it is actual, hard-to-believe truth; second, don't be impatient. As the story of a 1971 bank robbery begins, the setting in London, the parade of seemingly unconnected stories and characters is rather confusing, complex, disjointed. But stay with it - there is a crescendo of excitement and excellence. <br><br>The true elements of \"The Bank Job,\" some hidden until recently by Britain's \"D Notice\" censorship law (modified in 1993, becoming DA, or Defense Advisory) are these:<br><br>1. A big bank robbery did take place on Baker Street in 1971, culprits never found, money never recovered. After initial big headlines, the story disappeared from the newspapers. <br><br>2. There was serious police corruption in London in the 1970s, cops on payrolls of drug dealers and pornographers.<br><br>3. Princess Margaret was involved in a series of affairs, some caught on compromising photos which were not published by the otherwise relentlessly sensational British press, under the D-Notice rule. <br><br>4. There was a militant British black-power advocate, called Michael X, involved in a one-man, multi-country crime wave. (In 1971, John Lennon paid for Michael X's bail, something not mentioned in the film.)<br><br>\"The Bank Job\" director Roger Donaldson (of \"No Way Out\") brings together all these true threads in a way that may be true even in its totality, director and cast prevailing over some shoddy work from too many writers. <br><br>The content is all true, the context is excitingly possible. Did the government, in trying to prevent exposure of Princess Margaret by evidence in Michael X's possession, mastermind the bank robbery? Was MI-5 or MI-6 (says a policeman in the film: \"I never remember which is which\") involved, and actually assisting the robbers? Again, possibly. <br><br>The cast is remarkable: Jason Statham is the ringleader, the bad guy of \"Transporter\" and \"The Italian Job\" turning into a scourge of the really bad guys. Saffron Burrows, James Spader's vamp nemesis on \"Boston Legal,\" brings her remarkable name and looks to the criminally and emotionally ambiguous major female role.<br><br>Peter De Jersey is a totally scary Michael X; David (\"Poirot\") Suchet is a frightening crime lord; and a whole host of top British stage actors fill in big roles and small ones. Don't be misled by reviews speaking of a so-so thriller - \"The Bank Job\" is a great deal more than that, even to the point that you may want to see it more than once.","user":"janos451","rank":[338,366]},{"title":"Finally, 2008 has a movie to brag about!","rating":9,"date":"14 April 2008","review":"I was watching Ebert and Roper the other day on TV and they were discussing 2008's movies and how over all they have been disappointed, I think we all have. But they did discuss the top movies to see and The Bank Job was in their top three, I finally found a theater that was still playing the movie, I saw it today and I have to say that I really loved this heist movie. It's definitely one of the better heist movies in a very long time because it brings something different to the table, this isn't a movie about the heist, it's the aftermath of the heist. We are always usually left wondering if the robbers got away with the heist afterwords in movies. Now this movie is based on a true story, it's based in the 1970's(bonus it doesn't remind you every 10 minutes) and it's about just amateur robbers that pulled off one of the largest heists in England's history with finding corrupt cops and ending badly.<br><br>Martine Love approaches Terry Leather, an amateur thief and long time friend. She offers information to get into one of the biggest heists they could hit, the ability to break into a vault. Terry and his group successfully break into the vault and takes four million pounds, including jewelery, cash, bonds, and some extremely private and damaging photos of the mobsters and government of England. When the group just about gets away with it, things go terribly wrong when one of the members are captured and they found out there was an alterer motive to this heist.<br><br>The Bank Job has great acting, terrific editing, and is just a great thriller that truly keeps your attention. Jason Statham, this guy has never really stood out to me as someone who could be a good actor, most of his movies could never display what he could do, but The Bank Job is without a doubt his finest role to date that I'm aware of, he pulls the part off well and makes the story more real. The Bank Job has great drama and action, it's a great movie that I'm really glad I saw, a big recommendation if you're looking for a good movie to watch.<br><br>9/10","user":"Smells_Like_Cheese","rank":[103,116]},{"title":"That'll go nicely with a plate of chips","rating":10,"date":"25 March 2008","review":"Film-making at it's finest.<br><br>Nothing loud and boisterous. No over-stylized cinematography, pointless set-pieces, cheesy dialogue, or over-flowing emotions.<br><br>A perfect example of why the finest movie-making talent in Hollywood is British. And possibly the best caper movie of recent times.<br><br>Had this been from Hollywood, every fine detail of the complex subtext in the story would have been blown apart. Instead, everything is under-played, the characters are superbly realistic and believable, and the script sharp as a pin. And the cast is a brilliant ensemble.<br><br>Worth many repeated viewings for the subtle humour and to get the most out of the twisting plot developements.","user":"Zentaurion","rank":[267,329]}]