[{"title":"Very enjoyable (a quick review)","rating":8,"date":"1 January 2005","review":"Normally I like to give more detail in a review, but this is a quick one.<br><br>I enjoyed this movie a lot. I'm not entirely sure why. I think mostly it was just plain fun. 'Beat' Takeshi was just brilliant in the role of Aniki. It's a sign of a great actor when he can command your attention without really doing anything.<br><br>I loved its thoughtful pace and purpose, and how there was a real symmetry in the story. In terms of introduction of the characters and their interactions, the story closes in reverse really nicely. I won't say much more, as I don't want to spoil it; it's not major, just nicely done.<br><br>All in all, I highly recommend it. It's quite violent at times, but if you're okay with that (and hell, perhaps even like it in a Kill Bill kind of way) then definitely check this out.","user":"antony-1","rank":[13,13]},{"title":"Brilliant gangster picture sliced to ribbons by the M.P.A.A.","rating":9,"date":"3 December 2003","review":"Brother (2000) marks the English language directorial debut for Takeshi Kitano in this cross over gangster film about a deposed Yakuza living in exile on the streets of L.A. This entertaining and surprisingly fast moving picture (for a Kitano film) release date was delayed in the United States by more than a year. When it was finally released the film played mainly in Art houses and was heavily edited by the old cronies that sit on the M.P.A.A. board. It's impossible to see this movie how it was original meant to be show. Sadly, prior releases (even on video) were the same old prints that were used during it's theatrical release. Ho-hum. I recommend the director's/international version of this film. The M.P.A.A. cut lacks the punch of the original.<br><br>A+ (International)<br><br>B+ (american)","user":"Captain_Couth","rank":[34,40]},{"title":"Another masterpiece from Kitano","rating":10,"date":"29 June 2002","review":"Takeshi Kitano's Brother is Kitano's masterpiece among his other films. I really haven't seen bad film from him. Brother is set in America as Kitano's character travels to US from Japan, and starts new life there. He has his half brother living there so he has a place to live in. Soon he starts to have new friends and become a leader and member of their new gang/yakuza. Violent confrontations with other gangs and mafia take place as everyone is willing to use violence and vengeance in order to settle things.<br><br>Brother has all the usual and breath taking Kitano elements we've learnt to see. The flashbacks of events, long shots without editing, character's faces that say more things than 100 words, images of beauty and peace and wry humor, among others elements. The main theme in Brother is loyalty and friendship that becomes even love. The last scene is fantastic and very unusual for Kitano; never has he underlined his message this clearly as he does in Brother's finale. It is so purifying scene and really makes the point clear, but still, most people don't understand anything about Kitano's films, because they are so personal and different compared to Western mainstream films.<br><br>Brother is like a combination of Violent Cop and Hana'Bi. It has Violent Cop's bleakness and Hana-Bi's beauty and sadness. Brother is very sad film at times, and only last scene gives something really positive and also optimistic. Hana-Bi is very sad and beautiful film, and these two, Brother and Hana-Bi, have much in common. Both were composed by the same guy, Joe Hisaishi, who did fantastic job especially in Hana-Bi and also Sonatine. Violent Cop is very gritty and also pessimistic film, and is very similar to Brother in its overall look of life. Both films are also very calm and restrained and not as visually stunning as Hana-Bi and Sonatine. All these films are masterpieces of Japanese cinema, and it is interesting to see how Kitano mixes elements from his other films and creates always something new and immortal. <br><br>The violence is very brutal and challenging but definitely not gratuitous or exploitative. Kitano's violence is always very symbolic and sudden, and not necessarily realistic. These films analyze many aspects of violence as a tool of communicating for weak souls. Kitano definitely doesn't justify violence or praise it; he just shows what most people or film makers probably wouldn't even dare to think of, and once the viewer may be thinking \"yeah, kill that b****rd!\" the film turns against the viewer and makes him think what he just said and accepted. The more emotionally challenging film is, the more noteworthy it becomes and Kitano's films are perfect examples of that. <br><br>Brother is also occasionally filled with Kitano's wry and personal humor which was at its taunting in his Boiling Point. Brother has many great personal touches of its creator and every time Kitano's character laughs here, there is something very twisted in his mind and going on. Brother is not thoroughly cynical film after all, and these humoristic touches only add to the great purification of the last scene. <br><br>The film criticizes yakuza also pretty much and with the director's personal style, as there are numerous scenes involving yakuza rites and codes of honor. Also, there is a great scene involving basketball and yakuza member's attempt to get the ball and be king of the game and have a feeling of being somebody. Boiling Point has plenty of these scenes and tones as the gangsters play tough guy with big guns and thus try to get acceptance. These films really should make yakuzas ask themselves, why?<br><br>I am totally stunned by cinematic styles Kitano uses in his films. The editing and photography is so incredibly smooth and stylish, and creates the atmosphere of the film. The faces are among the most important details in Kitano's films as there are so many things to be read from characters' faces. For example, there is awesome scene in Brother's beginning where Kitano \"sees\" the death of a yakuza boss. Kitano has totally unique sense of beauty, sensitivity and expressing emotions that has no comparison from other films. His character doesn't talk too much in his films, but anytime he says something, he says and expresses more than thousand words. His films are immortal and can be seen over and over again, and still they have plenty of things to offer for the lover of this unique cinema.<br><br>Brother is among Kitano's greatest films and I definitely give this ten out of ten, because there are absolutely no negative aspects in this film, and this proudly stands in Takeshi Kitano's filmography.","user":"Bogey Man","rank":[39,52]}]