[{"title":"C'est magnifique, c'est ne le guerre pas!","rating":28,"date":"28 January 2003","review":"(Please excuse my French, it's probably wrong)\n \n Roll up, roll up! See the cinematic spectacle of 2001! See the horrible \n deaths of 2500 or so people commemorated by a film about two guys who \n fly fast planes really fast. See them go ZOOOOOOOOM, see them go \n WHIIIIZZZZ! See them reprise the 'flypast and debriefing' scenes from \n Top Gun. Watch the beautiful love story unfold. See the true love two \n people have for one another tested and broken when Kate Beckinsale \n comes between them.\n \n See a fine young actor reduced to playing Token Black Guy. Watch as he \n fights to prove he's more than a Token Black Guy, even though he's \n given so little to do that he ends up as nothing more than a Token \n Black Guy (even though, unlike the two guys in the planes, Token Black \n Guy actually existed).\n \n Watch the awful bombing of a military target. Watch the heroic bombing \n of a city. Watch Jon Voigt recreate Peter Sellars' unforgettable \n character Dr. Strangelove.\n \n Watch the whole reality of war, and the lives and deaths therein \n trivialised to make a Big Dumb Action Movie that thinks it's some kind \n of ghastly tribute to the American dead of December the 7th.\n \n Or better still... don't!\n \n On the other hand, if you want an unrealistic film with ponderously \n paced romance, fighter planes zooming all over the place and nice \n explosions, check this out. It's a lot of fun. Just don't take it \n seriously - you'll only encourage them!","user":"hissingsid","rank":[599,958]},{"title":"I'm confused with all the hate of the film.","rating":8,"date":"17 April 2019","review":"I've never written a review before but after seen how many people are saying this film I thought I better.\nI actually think the film was great the main premise of the film which I feel most people have completely missed is a bond between two guys that is as strong as a brotherhood hood. The alpha one who has the confidence to take over the world and the quiter one both who would die for each other in an instance. And maybe it was just me but I really did feel the emotions that they feel throughout the film. It seems like a lot of people hate the film so maybe I'm missing something but i think its a great film. The film is not totally accurate but films don't need to be and I film is long which is the reason I suspect it gets so much hate.","user":"joshhylto","rank":[18,23]},{"title":"Historical Trivia","rating":1,"date":"24 November 2008","review":"In 1941 it cost the Empire of Japan 147 thousand dollars to stage the three hour attack on Pearl Harbor.<br><br>In 2001 Michael Bay spent $132 MILLION dollars to film the event, and ran four minutes longer. <br><br>Even taking into account 60 years of inflation, the Japanese did a better job with a smaller budget...<br><br>Due to the ten line minimum submission this may be too short - but sometimes less is more.<br><br>20th Century Fox already did the Pearl Harbor attack in Tora Tora Tora - and did an excellent job. Michael Bay should have left well enough alone.","user":"daniel-mcgarry","rank":[261,418]}]