[{"title":"An inspirational story with some shortcomings","rating":7,"date":"21 April 2001","review":"Military training films are becoming so common that they are becoming a genre unto themselves.  Among the more prominent we have, `Officer and a Gentleman', `Top Gun', `GI Jane', and now `Men of Honor'.  The fact that this one happened to be true doesn't change the fact that the formula is the same.  This film is probably most like `GI Jane' since it focuses on the desegregation angle.<br><br>The story is actually quite inspirational and is probably the best human-interest story among those mentioned above.  Carl Brashear (Cuba Gooding, Jr.) is unquestionably a man of great courage and principle, and his strength of character shines through brightly in this film. Unfortunately, director George Tillman has tunnel vision in presenting the characters and eschews character development of various characters other than Brashear in favor of showing Brashear in a constant state of adversity. Billy Sunday (Robert De Niro) is a central figure, and except for the initial scene, the fistfight and a couple of scenes with his wife, we don't know much about him.  For instance, Brashear sees the scars on Sunday's palms and we are to assume that he worked a plow, but there is no follow-up on that point.  Mr. Pappy (Hal Holbrook) gets only one short scene by which we can judge him.  The rest of his screen time shows him pacing around and ranting.  If a director is going to make a human-interest story, he needs to humanize the characters.<br><br>Cuba Gooding Jr. gives an outstanding performance as Brashear.  This is probably the best I've seen him.  This is a role and a character that is far more complete than any part he has played before, and he rises to the occasion.  In `Jerry Maguire', Rod Tidwell was a fascinating, but one-dimensional character with the depth of a rain puddle.  Brashear is much more complex and grounded, and the issues he faces are life crises, making the part far more challenging.  This is an excellent recovery from Gooding's last role in `Chill Factor', a film so dreadful that it was almost an act of professional suicide to take the part.<br><br>After a stint trying his hand as a comedian (`Analyze This', `The Adventures of Rocky &amp; Bullwinkle', `Meet The Parents'), Robert DeNiro is back to his dramatic roots with an outstanding performance.  DeNiro isn't a bad comedian, he is just such a great dramatic actor that it seems like he shouldn't waste his time doing comedy.  DeNiro endows Billy Sunday with a rock hard personality belying a tortured soul.  It is a pleasure watching him work.  <br><br>It seems every film I watch lately has Charlize Theron in it.  I saw `The Legend of Bagger Vance', `Men of Honor' and `The Yards' right in a row and I was beginning to wonder if she had a part in every film in 2000 (actually, she only did five).  This was a minor role for Theron, but she carried it off well and managed to stay with DeNiro step for step.  David Keith, who co-starred with Richard Gere in `Officer and a Gentleman', has a cameo here<br><br>The DVD has some interesting special features, including reflections by the real Carl Brashear and some deleted scenes.<br><br>I enjoyed this film despite the hackneyed plot and the one-dimensional presentation.  I rated it a 7/10.  I'm a sucker for underdog stories and I have a fondness for stories where strength of character is the central theme.  This film is particularly strong in both areas and brings us two memorable acting performances that compensate for some of the director's shortcomings.","user":"FlickJunkie-2","rank":[51,62]},{"title":"The movie tells the story of a Professional Navy Man.","rating":10,"date":"11 February 2006","review":"This film is an excellent military movie. It may not be an excellent Hollywood Movie, but that does not matter. Hollywood has a reputation of sacrificing accuracy for good entertainment, but that is not the case with this movie. Other reviewers have found this movie to be too slow for their taste, but  as a retired Soldier  I appreciate the pace the movie crew deliberately took to tell their story as completely as possible given the two hours and nine minutes allotted. The story itself has been told and retold several times over, but it remains for a professional soldier  and an African American at that  to report on the story as presented by the movie crew, and as it presents the US Navy to the world. The story of Brashear's work to become a Navy Diver, and his life as a Navy Diver beyond his graduation, is not the only story that is presented. There I also the story of how Master Chief Petty Officer Sunday defied the illegal order of his Commanding Officer that Petty Officer 2nd Class Brashear not be passed in his test dive no matter how well he did, and paid the price of a loss of one Stripe and a change of assignment. It also told the true story how Brashear found the third Hydrogen Bombs lost in the Atlantic Ocean off the coast of Spain in the 1950's, and how he saved the life of another seaman who was in the line of the snapped running line that would have snapped him in two if Brashear had not shoved him out of the way and took the shot himself. This was a complex story that was worth telling, and I will admit that two hours and nine minutes was not enough to tell the full story, and I can tell from the deleted scenes on the DVD that the crew tried their best to tell a story as full as possible. As a professional soldier, I was proud to see such a great story told in such a comprehensive manner, and to see the traditions and honor of the navy preserved in such a natural and full manner.","user":"cseon","rank":[41,53]},{"title":"Very good film!","rating":7,"date":"16 April 2003","review":"This one is a great one! Robert De Niro and Cuba Gooding have teamed up to make a powerful and very influential film. This is the true story of the first black US Navy diver and the obstacles he faced in attaining his certification at the hands of a racist Master diver. Along the way, he must also face plain old bigotry from all of his classmates, none of whom want him in their class. They move out of the barracks when he arrives. Ultimately, he becomes certified and goes on to have a great career as a US Navy diver. Watch this one! It's a great tale of courage and honor. As the story unfolds, we get to watch racism slowly dissipate and everyone begins to respect men one at a time.","user":"grahamsj3","rank":[39,54]}]