[{"title":"Spy Kids 2: The Film of Lost Ambition","rating":4,"date":"17 August 2002","review":"After enjoying some success with the surprisingly enjoyable &amp; cheesy \"Spy Kids,\"  Director (and all around good guy) Robert Rodriguez now brings forth a sequel, \"Spy Kids 2: The Island of Lost Dreams\" which is far less enjoyable and far more cheesy.   As a matter of fact, you'd be hard pressed to find more cheese anywhere outside of a Wisconsin dairy farm.<br><br>Juni and Carmen Cortez (Daryl Sabara and Alexa Vega) are back, now officially a part of OSS, and officially recognized as Spy Kids.  But the OSS, just like every other government bureaucracy, cannot resist expanding upon a good thing, so now there is an entire army of \"spy kids\" at their disposal; but Juni and Carmen are, of course, the most renowned. <br><br>\nWithin in the first opening minutes of the film, which takes place in a truly inspired theme park, we quickly discern that Juni and Carmen have rivals: the Giggle kids (Matthew O'Leary and Emily Osment) who dearly covet the Cortez' fame and status.  With help of their conniving father (Mike Judge), the Giggles do what they can, not only to surpass the Cortez family, but to humiliate them as well.<br><br>Once again, we find the greatest threat to the OSS is the OSS itself, along with the internal politics and treachery which played a small but significant part in the plot of the first film.   It seems as if the OSS is more of a threat to world peace than a help, and one wonders why Uncle Sam doesn't just shut the operation down and call it a day.  Perhaps it would prevent the making of any more \"Spy Kids\" movies, which I'm beginning to think would be a very good thing.<br><br>The plot revolves around a device known as a \"transmooker\"  -- which can be best described as the ultimate cloaking device, even able to cloak entire islands off the map.  It also has the wonderful ability to render all electronic devices useless, which is quite a thorn in the side of the intrepid Spy Kids, who's reliance on James Bond style fancy gadgets is only a shade less than an alcoholic's dependence on his next drink.  Of course the transmooker itself is an electronic device, but somehow is immune to its own nasty effects.  (Only in Hollywood....)<br><br>So our two heroes, Juni and Carmen, locate the cloaked island, where the stolen transmooker was taken, and attempt to find it before their rivals, the Giggles kids, do.  The island turns out to be a retirement resort for every single monstrous creature ever created by Ray Harryhausen (\"Jason and the Argonauts,\" \"7th Voyage of Sinbad,\" etc.).  Except we are told that they were created by the socially insecure and somewhat troubled scientist \"Dr. Romero\" (Steve Buscemi) who was looking for some companionship, and a portable zoo.  But of course those of us who've seen a few movies in our time know better.  <br><br>During the same time, there is a completely boring and totally unnecessary sub-plot involving Carmen &amp; Juni's parents and grandparents.  The only reason the subplot exists is to cloak this poor homage to Harryhausen as a \"family film.\"  Yeah, right.  I certainly fell for it.<br><br>Hollywood films, especially action-adventures and sci-fi flicks, often  ask the audience to suspend logic and rational thought while the plot thickens. It is the price we pay, beyond the ticket price, for the pleasure of being \"entertained.\"  But Spy Kids 2 doesn't just ask for a suspension of belief, but a wholesale slaughter of anything remotely resembling intelligence. That's a big price to pay, and one I was unable to justify. <br><br>\nIf Daniel Rodriguiez is such a fan of Harryhausen, then he should make \"The 8th Voyage of Sinbad\" or some such thing, rather than trying to find a way to incorporate Ray's creatures into a movie allegedly about espionage.  The CGI recreations of Harryhausen's monsters was one of the more enjoyable aspects of this horrid film, but not enough to pull it out of the slimy pit in which very poor writing knocks it into.  <br><br>The dialogue is stupid, even for kids to listen to.  Most of the jokes fall as flat as the acting.   Much of the cuteness and fun of the first Spy Kids film is completely lacking in the sequel.  Instead, we have a very disjointed plot, an adventure that leads to nowhere, and a subplot that should have been locked in the submarine where it mostly takes place. <br><br>\nMy Rating: 4/10","user":"Theoron","rank":[24,36]},{"title":"A worthy sequel - great fun for adults and kids alike","rating":10,"date":"12 August 2002","review":"After reading some of these user reviews (especially the one about the Latino vs. White.... you have to be kidding me), I felt compelled to write one of my own.   Spy Kids 2 had everything I expected - a whole new adventure with characters from first that is fun, exciting, humorous, and still manages to teach about doing the right thing.  I also appreciated the references to the original ^_^ , and the special effects were even better than the first.<br><br>The hardest people to please in this case would be my 2 daughters (4 &amp; 7) who own the first Spy Kids on DVD and have seen it so many times they can act out the scenes down to the facial expressions and body motions.  When they saw Spy Kids 2 this past weekend they were transfixed and left the theater excited about seeing Carmen and Juni in their latest adventure.<br><br>A great movie for adults and kids... I cannot recommend this sequel highly enough!","user":"durmanx","rank":[24,37]},{"title":"Really Fun","rating":9,"date":"11 August 2002","review":"\nAnother winner in Robert Rodriguez' budding `Spy Kids' franchise, equally as\ngood as the first and showing real potential for the future. Rodriguez is\nperhaps the only filmmaker of kids' movies that seems to actually listen to\nwhat kids want and in the process delivers something every family member can\nindulge in--it's as delicious as chocolate, with plenty of giggles aimed at\nthe seven to ten crowd and dazzling ideas and humor that parents can\nappreciate. Rodriguez has an extremely fertile imagination and while his\nvisuals sometimes can't keep up (the digital effects are an occasional\nletdown) the concepts themselves are so ambitious and delightful that it's\neasy to look past the brief technological shortcomings. As in the first\nfilm, there are plenty of references to family films of the past (most\nnotably `Willy Wonka &amp; The Chocolate Factory' and the stop-action animation\nof Ray Harryhausen) and the overall design of both films is very similar.\n(Rodriguez seems to prefer shooting at twilight, giving everything an orange\nhue.) But it does seem more expansive, perhaps because he's creative enough\nto incorporate welcome new characters, such as the kids' grandparents\n(played with relish by Ricardo Montalban and Holland Taylor) and another\nbrother-sister spy team (Emily Osment and Disney Channel favorite Matthew\nO'Leary) as well as fresh retakes on characters from the first film (Steve\nBuscemi takes on the Alan Cumming role). Rodriguez' screenplay once again\ntakes on the theme of family but this time it's carried poignantly\nthroughout (it got dropped rather quickly in `Spy Kids') and the result,\ncoupled with his extraordinary vision, is a film that will thoroughly\nsatisfy just about everyone. ","user":"bix171","rank":[11,15]}]