[{"title":"Absolutely No Spoilers Here--READ THIS REVIEW INSTEAD!!!!","rating":19,"date":"19 April 2001","review":"Thank Goodness I didn't read the reviews posted before I saw the film!! Most reviews (including ones on this site) will tell you waaayyyy too much about the movie, and that's just plain frustrating.  But, as an avid cinephile, I promise not to do the same.<br><br>Memento is one of those pictures that will have you sitting in the theater after the lights come up so you can talk to everyone else about what they thought of the movie.  This is a highly intelligent and original brain teaser that will have you guessing from beginning to end, and even afterwards.  The story and the direction are the best I've seen so far this year, and it deserves all the kudos it gets.<br><br>Plainly put, the film tells the story of Leonard Shelby:  a man who lost his short term memory in an assault where his wife was raped and murdered;  now he's looking for the killer, despite his handicap.  Simple as that.  You don't need to know anymore.<br><br>The film is constructed and told in such a way that you are constantly put into the shoes of Leonard Shelby, beautifully played by Guy Pierce. Carrie-Ann Moss gives an equally mysterious and complex performance.  This film is well-made all the way around--from the direction, to the editing, and especially the unique story that is rarely found in Hollywood these days.  Four Stars!<br><br>This review may have been a little dry on the details, but go see the movie--you'll be thanking me later.<br><br>PS: Only go to the official website AFTER you've seen the movie.  It too will give too much away.  Afterwards, though, go and look at it--it's pretty impressive.","user":"soloyoda","rank":[1,1]},{"title":"An unforgettable trip into the mind of a man with no memory","rating":10,"date":"18 March 2002","review":"If you're looking for something intense, suspenseful, and different than your usual effects-packed thriller, this is the best movie you will see all year. You will be talking about Memento at work, at the grocery store (to total strangers!), and you will find yourself joining conversations when you hear the word \"Memento.\" That's why this little film that received almost no marketing stayed in theaters for months and was in the top 10 money makers for several weeks.<br><br>The movie starts with a murder -- a revenge killing, in fact. But was the right person killed?<br><br>Leonard Shelby (Guy Pearce) is a man with no short-term memory. He hasn't been able to form new memories since the night his wife was murdered. Now he's on a hunt to find the murderer but with no way of remembering names, dates, places, facts and faces. Instead he tattoos himself with mementos of his search. When someone knows his name, he checks Polaroids to see if he knows them. Does he like this person? Does he trust this person? Is this the killer? He doesn't know unless he's scribbled a note.<br><br>Don't worry about trying to empathize with Leonard because Writer/Director Christopher Nolan puts you right in Leonard's shoes. You live the story in reverse order so that you never know more than Leonard does. In one scene you see Leonard getting information from a person who knows him -- maybe a good person; maybe bad. In the next scene you see a previous meeting between the two which sheds more light on their relationship. Later still you see how they met. But is that all of the story? You've yet to find out... and you won't know everything until the last scene. By living it backwards, you, like Leonard, have no knowledge of what came before.<br><br>It's brilliant story telling. But you might get frustrated because you don't know what's going on. That's normal. In fact, that's the whole idea. Just sit back, try to relax (though that's difficult in this movie), and find out just how twisted and complex Leonard's world is.<br><br>This film will leave its own memento on your mind, and you'll have a hard time forgetting how much you enjoyed it.","user":"ltlrags","rank":[528,591]},{"title":"Addictive and fun to figure out","rating":1,"date":"1 September 2003","review":"Christopher Nolan's \"Memento\" is truly a rare and exceptional achievement in modern filmmaking in that it manages to be new, fresh, hip, and exciting without ever tiring its audience out - unless you're walking into this film without the desire to participate and actively analyze the mysterious details.<br><br>If that's the case, then this is DEFINITELY not a movie you should see. If, on the other hand, you are open-minded, creative, and alert, you'll definitely appreciate and get a kick out of this one. \"Memento\" is an old-fashioned \"film noir\"-type mystery thriller with an intriguing, ingenious twist: outfitting the entire film with a style that mirrors the protagonist's own mental condition while giving the poor viewer(s) his own perspective as well. It is masterfully filmed and edited in such a way that it is chronologically presented backwards (with two initially separate, parallel storylines - the main one, shot in colour, is the chronologically-backwards story with scenes that intercut with those of the other story, which is filmed more like a documentary, shot in black &amp; white, and mostly takes place inside a motel room with the main character narrating, talking about the effects of his condition, etc.) While the average viewer may already be put off by such a complicated, confusing format, it is a very original premise that is well worth the struggle to figure out.<br><br>Acting is solid across the board, as is the writing, directing, etc., but special kudos must be extended to the very talented editor Dody Dorn, who successfully managed to put all of these fragments together and help them flow in a smooth, healthy manner that is not easy to pull off.<br><br>One of the most \"memorable\" (sorry, couldn't help slipping in the bad joke) films you're likely to ever see, \"Memento\" is an instant classic due to its groundbreaking narrative style and impressive dramatic undertones. For those jaded moviegoers who seek something to keep them awake, interested, and constantly thinking, there couldn't be a better choice than this film.","user":"quixoboy","rank":[420,478]}]