[{"title":"Great chemistry makes a fun movie","rating":26,"date":"26 July 2002","review":"I ordered this DVD without even seeing the movie first, because I am a fan of both Kiefer Sutherland and of Anthony LaPaglia.  From the little I read about it, I thought it was gonna be a straight drama, so, what a pleasant surprise to find so much humor in the movie.  Kiefer, after working non-stop for years, is finally getting long over-due recognition for his excellent work in FOX TV's \"24\", and Anthony LaPaglia has been a fave since I saw him in the much underseen \"29th Street\".  These two stars have great onscreen chemistry and it makes for a fun movie to watch.  Kiefer plays a cop who is forced to retire after a heart attack, and isn't happy about being sidelined at age 35. Anthony plays his \"on the other side of the law\" hyper half-brother, who drags him kicking, into buying a racehorse.  They get involved with mob guys and there are some very dark moments due to the danger suddenly brought to their lives, but, that horse brings Kiefer back to life and he and his brother will do anything to keep it.  I think you'll like this flick.","user":"tnsmoke","rank":[10,10]},{"title":"Far more entertaining than it should be.","rating":7,"date":"7 October 2003","review":"Ok, so this isn't a great movie. But, it's entertaining, and the chemistry is spot-on. I admit, I dug the so-so romance between Sutherland and his estranged wife. I found the entire plot, while ill-constructed, fun enough to pass as a really well-meaning movie. It was fun, and the acting was good all around. Being the sucker for saucy fellows that I am, seeing Sutherland as such a good person was rather surprising, but he played it well all the same. I can't say I'd recommend this one for anything more than the channel surfer or the die hard Sutherland fan, but it's got some great moments and a fun little story, despite moments of obvious cheese and silliness.","user":"mooshoo89","rank":[5,5]},{"title":"Hidden Gem!","rating":8,"date":"28 January 2005","review":"I rented this movie because I'm a Kiefer Sutherland fan and I was really surprised! It's a really good story. It's cute, funny and original. The actors deliver great performances! There is a love story, an action story and some good laughs. It's about Pally Lamar, an ex-cop whose a bit depressed. To get him back on track his step brother proposes they buy a slow racing horse since Pally loves horses. They make this horse into a winner with the help of a unlucky gambler that's also their horse's jockey. By doing this, they get the attention of some mafia bosses who want the horse. It's an original story definitely worth watching. I definitely recommend it! I will give it an 8 because the plot can be a little far-fetched at times.","user":"im_canadian_1","rank":[9,11]}]