[{"title":"Interesting movie, mis-marketed as a \"grindhouse\" flick","rating":6,"date":"6 September 2007","review":"Strangely this movie got released again recently as part of a \"Grindhouse Double Feature\" DVD. Aside from the abundant nudity and softcore groping, it is not really what I expected. Rather than being sleazy and gritty like most old grindhouse movies, it's kind of arty, a little pretentious, and mostly just plain weird. It doesn't really fit in with stuff like \"Hitchhike to Hell\" or \"The Hitchhikers\" or the more exploitative youth-oriented films of the era.<br><br>A guy driving a tricked-out camper van and making some kind of mysterious delivery picks up two hippie chicks. One of them is a nymphomaniac, so of course they immediately have sex. The other is revealed to be suffering from religious delusions as the result of having been molested by a priest (a straight priest?--now I've heard everything!). After the threesome break down in the Florida Everglades the secrets of the girls begin to be revealed a little with flashbacks (between the sex scenes), but the movie also gets exponentially weirder.<br><br>As others have said the two girls are VERY pretty and not like the sleazy skanks that were often in these kind of movies. The cinematography is also very impressive and professional, and for a \"grindhouse\" movie they sure used a good looking, wide-screen print. The low-budget IS evidenced by a lack of sync sound in a lot of places (which might be the reason for the kind of nebulous plot and character development). With its emphasis on the visuals at the expense of plot and acting, this almost seems like a foreign movie of that era--like maybe Jean Rollin was slumming in the Florida Everglades. All in all, I guess I'd recommend it, especially if you're looking for a weird, arty hippie movie, but it seems pretty mis-marketed as a \"grindhouse\" flick.","user":"lazarillo","rank":[119,128]},{"title":"The GREATEST flick....... EVER.","rating":12,"date":"12 July 2006","review":"I gotta be straight up and just tell anyone reading this that PICK-UP is a favorite film of mine. The movie (in it's most basic sense) deals with two hippie chicks (both hot as hell by the way) who hitch a ride across Florida with a cool hippie dude. They take a detour and ultimately find themselves lost and stranded out in the Florida Everglades (props to the actors for dealing with what had to be miserable conditions out in those swamps).... Anyway.... Once out in the swamps you get lots of sex and nudity as well as a bunch of odd flashback sequences that give hints as to who the characters are etc.... I won't go into any further details because like a 'dream' or a 'trip'... It's best to just 'experience' THE experience... There's lots of stuff going on for the viewer to try to interpret if they so choose... Anyway....<br><br>In closing.... PICK-UP is incredibly difficult to get hold of but it's worth the search and is highly recommended to fans of trippy/weird/surreal type flicks as well as fans of early 70's exploitation.<br><br>This flick NEEDS a special edition DVD release!!!!!!!!!!!!!","user":"the_blue_dot","rank":[146,162]},{"title":"You won't have seen a film quite like this before","rating":8,"date":"19 September 2007","review":"Wow! I'm just a sucker for stuff like this. A real trippy trip and a real surprise. I was expecting crap camera-work, crap acting and silly story comprising a decent little, grind house piece of sleaze. But no, someone had genuine aspirations here and if it doesn't completely come off, it is certainly a super, one off of a movie that manages to encapsulate a brief moment in western youth culture. But leaving aside any seriousness this is such a great movie to watch with such super widescreen cinematography. Two girls and a guy and a converted bus are cavorting their way to deliver the said auto when they end up lost in the Everglades and just decide to enjoy themselves. Bright, cheery, sexy, yes maybe a little pretentious but it has such a glow about it that it would be churlish to complain. Just when I was beginning to wonder if this was going anywhere at all there is a most impressive burst of violence and it's over. You won't have seen a film quite like this before.","user":"christopher-underwood","rank":[100,110]}]