[{"title":"Come out, come out, wherever you are. (spoilers)","rating":7,"date":"10 March 2005","review":"You might initially be reluctant to give 'The Glass House' a try if you've been turned off by many recent \"thrillers\" as they often have been disappointingly by the book. This is your eerie psychotic chase thriller similar to movies like 'Pacific Heights' and 'Unlawful Entry.' And, though it does play by the rules (unforutnately), there is something about it that makes it more entertaining than the recent dismal fare (not that Pacific Heights wasn't highly entertaining).<br><br>Leelee Sobieski plays Ruby Baker, a kid going through the terrible teens. When she and her brother's parents die in a car accident, they move in with ultra-modern family friends, Terry and Erin Glass. You know right from the start that there is something dreadfully suspicious and exceedingly bizarre about the Glass couple, but you can never be too sure exactly what at first (that's the purpose of a thriller, to throw you a few hints and let your quick assumptions guide you into all the wrong paths so that you're--hopefully--pleasantly surprised when the real perpetrator and his motives are revealed). But, Ruby Baker is a smart kid who's ever-present skepticism about the intentions of her new surrogate parents, and starts trying to figure out what's wrong. Unfortunately, this movie does terribly follow the book when it comes to the main character being disbelieved by other well-meaning characters (social workers, lawyers, teachers, etc.) who consequently pay with their lives for their doubts and unwillingness to really investigate, and in turn, making things worse for poor Ruby. It also follows the book when it comes to the deranged finale and the he's-not-really dead ending.<br><br>But, there is something that makes this better than most of its kind. On the one hand, you're never sure whether you can always trust Ruby because even she, too, arrogant most of the time, seems like trouble. It's hard to sympathize for a character like that at first. And, not only does Stellan Skarsgård make an appropriate villain as Terry Glass, his wife (played by Diane Lane) is not entirely an innocent creature herself as most women are often written to be in the role of the creep's wife/girlfriend/mother, etc. A good mix of characters and a creepy setting, combined with a decent finale, make it just the perfect mix of suspenseful elements. And one that I would recommend seeing.","user":"vertigo_14","rank":[31,40]},{"title":"An Oscar for Leelee Sobieski","rating":10,"date":"23 June 2007","review":"The Glass House is probably the best thriller i'ever see.Leelee Sobieski is'the real actress and she deserve an Oscar for her role.She plays really convince,and she is'the real convince good actress.I'don't know how someone like Cathrine-Zeta Jones gets an Oscar she was never convince in her roles and she is not really good actress.This movie and the actress deserve an Oscar.The story begins when Ruby and Rhett parents die's in the car accident,The Glass married couple takes to their custody in their home,first seas to be normal family but later Ruby find's out that is is only illusion,the Glasse's wont's them dead, because Terry Glass is in deb with he's money so he wont's them to kill, so that he will get the money and pay he's play debs.He's wife is a doctor and a junkie,when Ruby find's out what the Glasse's are really intentions are,she has to fight for her and her youngest brother's life.The Glass House is probably the best thriller,too bad that they don't make more thriller's like this one.","user":"ivo-cobra8","rank":[26,35]},{"title":"Leelee Sobieski kicks some Glass","rating":9,"date":"8 February 2008","review":"I apologize for the pun, I could not resist myself. This film was recommended to me by a friend, and I had never heard of it, so I could not really say what I was expecting. What I received though was a smart, intense, fun, excellently executed thriller with wonderful performances that entertains from beginning to end.<br><br>Leelee Sobieski brings to her character, Ruby Baker, depth and likablity without even having to apply much effort to it. Stellan Skarsgård and Diane Lane are great as the Terrence and Erin Glass, and even Trevor Morgan gives a nice performances as Ruby's younger brother, Rhett Baker. The performances are part of what is effective with this movie. Everyone delivered their lines and completed scenes with finesse, even if they weren't Oscar worthy presentations and they created the atmosphere that the director was trying to set perfectly.<br><br>The film is not boring at all and it's not mediocre as a lot of reviews suggest. It has a nice, suspenseful build up and the material, while the gist is a bit overused, is fresh in it's own way. Who says an unoriginal plot has to bad? Is that a written rule? The plot is simply marvelous in this film, if you ask me. I enjoyed so much seeing how the twist in the film starts to slowly unravel piece by piece, because I liked the characters and was interested in the story from the get go. The movie almost trips on it's own feet a couple of times, but nothing seriously major that is worth noting keeps you from enjoying the fun and satisfaction the film brings. I even was extremely fond of the setting, and for those of you who say it's an overrated pun with the Glasses living in a house mostly made of glass, there are horror classics throughout history that work off puns much cornier, and The Glass House does it very well, stop complaining.<br><br>In any matter, as I have said, The Glass House is non-stop fun and excitement from beginning to end with delightful and even memorable performances (i.e.: Leelee Sobieski, who indeed gives the finest performance of all, and probably the finest of her career in general), an intense and realistic atmosphere, relentless build up and a twist that I honestly could not see coming. I loved it and had an amazing time watching it! It was a riveting, effective, astonishing accomplishment in my book.","user":"Dragoneyed363","rank":[23,31]}]