[{"title":"If you dig Robert Altman's style, it's worth it","rating":9,"date":"20 May 2002","review":"spoilers<br><br>I'm definitely fond of this movie.  Richard Gere comes off a serious person and his acting is perfect, which I wasn't expecting at all.  The film was very well made and ended on a note I thought was much more sincere than anything I've seen in movies recently.  The dialogue and plot took me two sittings to absorb.<br><br>Having said that, I gotta admit, people will hate this film.  Like most Altman pieces, the plot is not driven by outside events so much as it's driven by how characters feel and act towards each other.  Dr. T is a rather extreme example of this, where almost nothing happens but the spectacular collapse of a wedding, a failed relationship, and a short-story magic ending.  The arc of the plot is the growth of the Richard Gere character from a needy person who has been unconsciously trying to make himself the center of a kingdom of dependent women into a person who finds new meaning in his work with people.  Dr. T begins the movie as a man who is perfectly happy.  He's an overwhelming professional success with an attractive family and nothing but more of expensive happiness to look forward to.  But he's immersed in demanding women.  He has spent his whole life trying to put women on pedestals so that he can bask in their praise and affection.  This isn't exactly evil, but the movie shows how his life begins to unravel as a result of this basically sexist outlook he has devoted his life to.  After what must have been decades of relentless smothering, his wife reverts to a childlike state.  (An expensive psychiatrist assures him that it's from having a life that's `too perfect,' which is probably a way of telling him what's wrong without saying exactly why.)  His heroic efforts as an OB/GYN have led his patients to make unreasonable demands on him that make his job a hell.  He appears to have gotten the needs of his daughters backwards as far as which one requires more attention.  His time-bomb sister-in-law has moved into his home with her gaggle of little girls.  Just as all of this comes apart, he runs into a woman from outside Dr. T's kingdom.  Helen Hunt plays a woman who doesn't need him and won't let herself rely on his courtesies and affections.  He tells her frankly that he's never met any woman like her, which is a sad thing really.  Then it all falls apart and in his lowest moment he's wrenched away from the mess he's made of his life by a tornado out of The Wizard of Oz (people can believe in Yoda, clips of ammo that never empty, accept a deluge of frogs from the sky, and that a man can be just a little jarred after shooting himself in the head to kill Tyler Durden, but a magic tornado is too much)  Dr. T finds himself without his expensive status symbols or his dependent entourage of hypochondriacs, in a place without even a phone.  He does his job and he doesn't even get a girl. It's a boy and it's all new to him and that fills him with joy.<br><br>\nThere are other Altman traits will drive people up the wall - the plot that feels like sprawl the first time through, the lack of signposts to obviously sympathetic characters, insistence on sorting moral ambiguities, doing satire in a PC world where even the shopping classes can't be made fun of, the layers of dialogue and so on.  What I try to tell people that are new to Altman is that he pretty much invented the TV drama forms we respect.  E.R. and Hill Street Blues and any number of TV dramas thrive off Altman's formula - which is to pick an interesting locale, drop a ton of characters in, and set them in motion.  Events happen, but the real drama is watching the characters interact every week.  The Hollywood film industry has moved in the opposite direction, which is soap opera.  There you take a big cast of canned personalities, drop them in an upper income setting and write some love story or coming-of-age bit around the quest/monsters/gun fights that actually make them move from scene to scene.  Neither is inherently better, but the multiplex has gravitated towards the second so completely that most people are utterly confused when seeing the first.<br><br>Unless you're interested in seeing a movie about a man who is forced to change the values he built his life on with the best intentions, you'll hate it.  If you dig seeing that dramatized, Dr. T is fairly unique.<br><br>Also, I wish Altman had some pull with whoever is doing the advertising for his films.  Marketing Dr. T as a screwball comedy and Gosford Park as a whodunit has probably done more damage to his reputation than anything else. Illiterate marketing is almost as big a problem as trailers that give the best parts of movies away - I wish the studios would be a little more thoughtful about it.","user":"Lumpenprole","rank":[23,26]},{"title":"No really, I like this movie","rating":8,"date":"24 September 2005","review":"I'm sorry, but I like this movie. It might just be my defense of Robert Altman, but I think that this is a good comedy. Dr. T who devotes his life to taking care of women, but never considers how they could take care of themselves. He loves everything about women, and women love him. However, nothing he can do can protect them in the end.<br><br>The problem is that this film was presented as a movie for women: a date movie that you can drag a boyfriend or husband to in order to prove love and devotion. The film is actually examining women, their needs and relationships with or without a strong male figure. This isn't a chick flick; it's an analytic comedy. So, the intended movie date turns out to be a disappointment for both parties who have no idea what to expect.<br><br>The only positive aspect of this whole misunderstanding is that now, years later, Dr. T ends up on the cheap rack at any DVD store. So don't rent it, buy it, give it another look and even if you don't like it, sell it for even cheaper. When this movie is available for less than a dollar, no one will have any excuse not to watch it. Several of the people will end up actually liking it.","user":"shanepang","rank":[44,56]},{"title":"Satisfying, But Not Great Altman","rating":7,"date":"20 December 2003","review":"Robert Altman appreciates women. It shows in his movies; women are often the main characters, and his films offer up a variety of interesting roles for actresses. Dr. T and the Women is almost entirely about women, modern day wealthy Texas women. Richard Gere plays Dr. Sully Travis a very successful and popular Dallas gynecologist. Not only is he surrounded by women all day at work, but his family consists entirely of women. Only a couple of male buddies enter into his closed, female dominated life. And like all good Altman movies there are plenty of quirky characters and intersecting plotlines.<br><br>The problem is that the plotlines aren't that interesting or original. Dr. T's wife develops a rare mental disorder that affects only the wealthy, and must be institutionalized. The new female golf pro comes on to Dr. T, as does his nurse. His soon-to-be-married daughter is slowly realizing that she may be a lesbian. And so on.<br><br>For Altman fans, Dr. T and the Women is not a bad rental. The director has done better, but it's still Altman. Others, less interested, might want to give this a pass.","user":"gbheron","rank":[26,33]}]