[{"title":"Viva Tornatore!","rating":22,"date":"22 January 2001","review":"I found the film to be visually hypnotic and very moving. I was also impressed with the film maker's story telling technique. The film brought me into the bustling street life of the Sicilian village by eye-level camera work and the comments of the people in crowded scenes, through which I was taken with the characters. Just like walking down a busy urban street anywhere with your ears and eyes open. The film made me wake up to the fact that so much American film, perhaps all contemporary film, is composed mainly of close ups with two or a few people. Not this film. There is a sequence with airplanes overhead that is absolutely dizzying without any fancy 3-D or pyrotechnic effects. Mr. Tornatore brilliantly uses silent stares, pairs of eyes and silly dream sequences with amazing effect. The male lead, an adolescent boy, is portrayed with great empathy by Giuseppe Sulfaro without schmaltz or sanitizing, so typical in American films about puberty. The title role, played well by a dazzling Monica Bellucci, could have been written for a young Sophia Loren. (My dream sequence, I guess) My favorite character was Renato's father, hilariously played by Luciano Federico. A must see.","user":"paulcreeden","rank":[121,134]},{"title":"More than just Monica.","rating":8,"date":"28 November 2010","review":"On the face of it, this movie is about a young boy's fantasies as he falls in love with the image of an older woman. I say 'image' because he doesn't know her at all to begin with, but as he watches, her increasingly sad truth is seen through his eyes.<br><br>It's also about Sicily during the war, but deeper than that, to me, it seems to be about the mob mind, jealousy and hatred and about how people tend to become what is expected of them, or don't. <br><br>Monica Bellucci is undeniably among the sexiest women alive and her near wordless performance is mesmerising. My only criticism is the somewhat stereotypical way that the 'men' are portrayed. Perhaps there's some truth that we are all driven from an area below the waist, but I'd like to think it's not true of all of us.<br><br>8/10.","user":"LegionAvalon","rank":[70,76]},{"title":"Cinematographic Symphony","rating":9,"date":"19 June 2004","review":"Malena is a beautiful and deeply touching film. It is a masterful combination of sites, sounds and colors. The two leading actors (Monica Bellucci and Giuseppe Sulfaro) are simply excellent at what they are supposed to convey in this movie. Apart from her truly majestic elegance, Monica Bellucci invests her character (Malena) with an aura of tragedy, of some profound and unrelenting emotional trauma and pain which remains unspoken throughout the film and reaches its climax at the very end. Malena's stunningly beautiful eyes remain constantly downcast, and her face -- tense and pierced through by psychic pain (she rarely raises her face, let alone speaks words). Renato (the teenage boy) wins his audience by his incredibly pure and valiant love for Malena (this affection he carries in his heart for several years). She becomes his muse, his courage, his sense of honor, his whole rationale for confronting difficult and disruptive life of the war-torn Italy. I agree completely with another commentator who said that the ending of the movie is perhaps one of the most genuinely melancholic moments in modern cinematography. Simply brilliant. Superb music! This movie should be watched several times to be fully appreciated.","user":"lkil","rank":[179,208]}]