[{"title":"Big Shot's Funeral is commercialism run amok.","rating":8,"date":"3 October 2003","review":"Years ago my high school economics teacher held up a tin toy car with wooden wheels. It was the typical Japanese product of its day.  \"Beware of people who can do this,\" he told us.  The class did not understand his words until he turned the car over to reveal that it had been made from a Schlitz beer can.   The rest of Japanese ingenuity and production is history.<br><br>The movie Da wan (Big Shot's Funeral) carries a similar message.  Though they may be behind, the Chinese can catch on quickly, particularly to the world of Madison Avenue as illustrated by this hilarious movie where hype and commercialism run amok. This movie reminds me of the 50's si/fi novel \"Space Merchants\" (Gravy Planet) by Pohl and Kornbluth in which an ad agency gets the exclusive rights to advertise products on the planet Venus.  The unconscionable excess on both Venus and in China say much about us as consumers who would rather be entertained than informed.<br><br>Sutherland, always good, is excellent here.  I am confident the low rating for this film is because of its subtitles, but they are not a bother and are part of the humor.","user":"evanhitc","rank":[11,11]},{"title":"A delightful comedy about a funeral","rating":29,"date":"29 July 2007","review":"'Da wan' is a charming Chinese (and sort of American) comedy that centres around a cameraman Yoyo (Yu Ge) who's assigned to arrange a funeral for a famous American director, Tyler and the director's assistant, Lucy (Rosamund Kwan) helps Yoyo to complete the task. With excellent cinematography and lighting, and beautiful set designs, it is quite a visually likable. The humour isn't slapstick or like the toilet humour so often seen in American films. It's part of the satirical screenplay and mingles well with the plot.<br><br>Yu Ge is fantastic and he's hilarious without appearing 'obviously' funny. He brings out the character's honesty and naivety with conviction and is both identifiable and lovable to the viewers. Rosamund Kwan is charming and lovely. She and Yu Ge share a fine chemistry. And of course Donald Sutherland is great as usual. His scenes with both Ge and Kwan are endearing and funny.<br><br>Anyone interested in light comedy can pick this one but I'm not sure whether it'll appeal to all as the plot is a little different from the regular comedy...but I loved it.","user":"Chrysanthepop","rank":[8,8]},{"title":"Brilliant!","rating":8,"date":"5 July 2002","review":"I don't know how anyone can fail to see - this satire is hip and wicked to the bone.  Not at all a mainstream Chinese production you would expect!<br><br>The closest comparison for this baby would be to _Diva_, but for its viciously funny stab at dot-com money madness, there's no equal.<br><br>Within all the whirling satire, Donald Sutherland held down the movie's emotional anchor admirably.  He made the movie more than just an average comedy.  And the way director Feng used him showed me that China today can make films as sophisticated as any in the world.  He made Zhang Yimou and Ang Lee look utterly out-of-date and irrelevent.","user":"milesyao-2","rank":[10,11]}]