[{"title":"Rough around the edges, but interesting nonetheless","rating":9,"date":"11 February 2002","review":"Say what you want about Andy Milligan - but if his family was even 10% as deranged as the one in this film, well then I guess he could have turned out worse.  Unfortunately, the video print of this film contains sex scene inserts originally shot by the distributor to boost the picture's box office appeal.  Several times during the film Milligan's ugly camerawork and silent film music abruptly ends, and suddenly good-looking stand-ins for Milligan's homely actors take over and start doing it to psychedelic 60's guitar rock. It's pretty easy to fast-forward through if you're trying to pay attention to Milligan's original film, which, unfortunately, is missing quite a bit of action that was cut to make room for the added sex scenes.  What remains, however, is still compelling stuff.  I don't think I've ever seen a more hateful mother in any film before.","user":"MikeJackKearney","rank":[8,9]},{"title":"Have yourself a miserable Andy Milligan Christmas","rating":8,"date":"26 December 2017","review":"A rotten dysfunctional family of bitter, bickering, back-stabbing folks gather together to celebrate Christmas. The reunion naturally sets everybody against each other as everyone's worst secrets are exposed. The situation comes to a deadly head when a mysterious killer starts bumping people off. <br><br>Notorious Do-It-Your indie exploitation filmmaker Andy Milligan lets his trademark misanthropy and debauchery run rampant in this movie: Leave it to Milligan to populate the seamy story with a rich array of horrible individuals who include a nasty crippled alcoholic matriarch (played with unsparing harshness by Maggie Rogers), a brother and sister who had an incestuous affair as kids, a shady overcharging doctor, a hypocritical pedophile priest (an excellent performance by Neil Flanagan), a pair of scheming live-in servants, a pathetic homosexual, a snarky stuck-up blonde, and a brazen strumpet. Milligan captures the anguish and suffering of these colorfully awful characters with such merciless acuity that in a way it's a relief that the bulk of them meet brutal untimely ends. Moreover, Milligan tosses in a handy helping of gratuitous female nudity and sordid soft-core sex for sleazy good measure. A deliciously depraved doozy.","user":"Woodyanders","rank":[4,4]},{"title":"Watch the Milligan sample reel in the extras","rating":6,"date":"23 December 2012","review":"If you really want to see what Milligan intended, skip the main film. It is cluttered with boring softcore inserts that are tedious. Seeds is an interesting film about a dysfunction family gathered for Christmas as the home of an almost insane Matriarch (Maggie Rogers) One of the family is killing off the family. It's a crude but fascinating look at palpable hate and loathing. There is not one character who is a positive person the viewer can like. One character, Carol, is interestingly played by Candy Hammond, who was briefly married to Milligan. As mentioned, the producers, concerned the film was too dark and not sexy enough, all true, inserted the straight, boring softcore stuff. It doesn't come close to matching the characters. As mentioned, go to extras and watch the Milligan print; you'll see a unique film that's not for all tastes but is a great sampling of Milligan's art.","user":"doug1963-178-182597","rank":[3,4]}]