[{"title":"A good little thriller","rating":7,"date":"2 May 2008","review":"Some of the hardest reviews to write are the ones where you don't know what to say. \"Awake\" is one of them. Let me just start with the basics. Do I recommend it? Yes. Is it GOOD? That's what's hard to say about this movie. Some parts of \"Awake\" are good, but some are merely okay.<br><br>Like many thrillers, telling much about the plot defeats the purpose of seeing the movie. However, I will tell as much as I can.<br><br>The story goes like this. A rich young man named Clay (Hayden Christensen) goes into the hospital for a heart transplant, and he suffers from anesthetic awareness (meaning he can feel and hear everything, but can't do anything about it). This is key because what he hears changes everything.<br><br>That's about all I can say. \"Awake\" is an entertaining little thriller, and Jody Harold certainly has potential as a writer/director. His low-key handling of the film makes for an interesting, almost dreamy approach, but I don't know if it works like it's supposed to, because I have a feeling that it decreases the amount of suspense that the material warrants. That said, the unusual tone makes up for this deficiency.<br><br>The acting is solid too. Hayden Christensen became famous for his portrayal of Anakin Skywalker in the second and third \"Star Wars\" episodes. His first outing wasn't great, and called into question his acting ability. However, his second round with the light saber was terrific, and his performance here shows that \"Episode 2\" was more likely to be an anomaly than the norm when it comes to his acting ability. His co-star Jessica Alba isn't as good, but it proves that she has more acting ability than many people give her credit for (her reputation for being a tabloid sensation and the limited acting options that result from it are probably to blame). Terrence Howard is solid, but he isn't given much to work with. Same goes for Lena Olin.<br><br>Personally, I think it sucks when you like a movie but a lot of that feeling disappears when someone points out something that causes that to decrease. Such a thing happened with me and reading a review after watching \"Awake,\" but I won't say it because it's still a good movie to see.<br><br>So, is \"Awake\" a good movie, or just a movie with enough good points to warrant a viewing? I'd say it's somewhere in between, leaning more towards good.","user":"moviesleuth2","rank":[72,90]},{"title":"Why only 6.4? I was so entertained!","rating":8,"date":"11 January 2008","review":"I did not read reviews till after I saw this, and I am appalled. To each his own, but I felt as if I had held my breath the whole movie. And what a great ending to make you feel you so got your moneys worth. And how enchanting was Jessica? Adorable and virtually perfect in the role. Such a great ride. One of the best movies I have seen in the past year.<br><br>Also, it seems many feel the length of the movie is too short, but who says 2 hours is required? My stress level was so high throughout, and everyone in the theater kept laughing at parts, not because it was funny, but as a defense mechanism from the aforementioned stress. Perfect acting? Maybe not, but it was certainly very good... in my humble opinion. I can tell you to go see it, but no order needed to enjoy it... that part comes easily, without force. Cheers.","user":"krisvenema","rank":[167,234]},{"title":"Mother's Heart","rating":8,"date":"14 September 2008","review":"The twenty-two year old Clay Beresford (Hayden Christensen) is a genius of finance secretly in love of his mother's secretary Sam Lockwood (Jessica Alba). Clay has a complex, expecting recognition from his mother Lilith Beresford (Lena Olin) that he is as capable as his father was, and he needs heart transplantation. When Clay finds a donor compatible with his rare blood, he requests his friend Dr. Jack Harper (Terrence Howard) to operate him under the protest of his mother that wants the famous Dr. Jonathan Neyer (Arliss Howard) responsible for the procedure. On the eve of his heart surgery, Clay marries Sam and during the surgery, he experiences an \"anesthetic awareness\" that leaves his conscious but paralyzed. Clay witnesses the dialogs in the room and discovers dark secrets about his surgery.<br><br>\"Awake' has a simple but effective story about a wealthy young man that needs to be submitted to heart transplantation and experiences an anesthetic awareness discovering that things are not like he believes they are. The cast is excellent, leaded by the still gorgeous Lena Olin, Terrence Howard, Jessica Alba and Hayden Christensen. The plot point was a great surprise for me and I really like this original movie. My vote is eight.<br><br>Title (Brazil): \"Awake: A Vida Por um Fio\" (\"Awake: Life in the Edge\")","user":"claudio_carvalho","rank":[36,46]}]