[{"title":"Not bad at all","rating":7,"date":"11 June 2003","review":"An horror road movie with an interesting twist, this flick about a part of Route 666 infested by ghosts is better than one may think before of seeing it. Good cast, several surprising twists. For a double features b-movie evening with popcorn and cola.","user":"pumaye","rank":[23,30]},{"title":"i was not aware an entire script could be one liners","rating":2,"date":"2 November 2003","review":"don't let my tagline fool you, i like route 666. as far as straight to dvd flicks go it's above average. it actually reminds of drive in style scary movies of the 50's and sixties. Lou Diamond is a solid lead, Lori petty works, i hate to say it but i liked Dale Midkiff. The plot had some merit, it was an original take on a unoriginal concept. However, the script, is one liner, after one liner after one liner. i laughed through the movie, though i'm not sure it's intended to be funny. the lines are enough to make the movie worth while and the make-up effects are a nice refreshing change from the cgi laden horror flicks of late. watch route 666, it's a fun ride, no doubt.","user":"titantrap2","rank":[21,28]},{"title":"Not terrible.","rating":13,"date":"13 October 2002","review":"Good tension throughout, the living-dead guys are creepy enough (not easy to pull off in bright desert sunlight), and the Native American shaman looks more like a deli counterman than the time-worn cinema stereotype--all in all, worth a look-see.  Personally, I could have lived without all the jiggling camera work during the action shots, and the ending was a little weak, but otherwise I'd give it a 6 out of 10.<br><br>One big problem--though out of fairness it's not something that is peculiar to this flick alone.  In fact, this has been a pet peeve of mine for years, and I dearly wish it would be advised against by every teacher of cinema...<br><br>ACTION RULE # 1:  If people shoot the \"bad thing\" fifty damn times, and with no effect, THEN DON'T HAVE THEM KEEP ON DOING IT!","user":"capn_crusty","rank":[16,23]}]