[{"title":"I cried until I...cried some more","rating":27,"date":"27 July 2001","review":"While watching this entry in Disney's endless parade of DTV (direct to video) sequels, I didn't know whether to laugh, cry, or vomit when I saw what they had done to the movie that first got me interested in Disney movies. I just don't know where to start badmouthing this one.<br><br>While watching the movie, I saw that Ariel had developed a non-existent personality. What have they done to her?? I know she's grown up, and I know she's no longer the focus of the story, but that's no excuse to make her dull as dishwater. However, maybe good old Ariel might have been a better protagonist than the one we were given. There was something about her daughter, Melody, that didn't sit right with me at all. Maybe it was her many attempts to try to sound \"cool\" without ever once failing to sound annoying. \"What's shakin'??\" Ariel would never, NEVER have said that! Nor would Sebastian, Flounder, or Scuttle acted the way they did in this movie. It's as if they took their humorous parts from the original movie and overemphasized it. I was especially mad that Scuttle wasn't only dumb; it was as if he had received a lobotamy! What was up with him? This isn't the Scuttle that introduced us to the dinglehopper and the snarfblat!! I'd be surprised if this Scuttle knew his beak from his...well, let's move on. The villains were lame! Using Ursula's sister as the villain was an uninspired choice, but she was my favorite of the baddies. Undertow was completely uneccessary. Or maybe he was, seeing as how Cloak and Dagger NEVER SPOKE! Cloak and Dagger were a sorry attempt at redoing Flotsam and Jetsam. F&amp;J were eerie; they sent chills up your spine everytime they spoke or slithered around. C&amp;D were...well, they were there. And speaking of ineffectual duos, let's discuss Tip and Dash. What exactly was their purpose in the movie, other than comic relief that was sorely missing comedy? There are so many other flaws in characters, but I don't want to go into that right now.<br><br>Art direction, design, etc. was sorely lacking as it is in all DTV Disney films. The characters looked kinda like their original counterparts, but the coloring was way too bright and garrish. It's as if they threw away the subtle coloring scheme used for \"Little Mermaid\" (including ariel, the color they invented for Ariel's fins) and traded them for happy little pastels, taking away any depth or realism the look might have had.<br><br>Voices, voices, voices. Most of the original cast came back for this one (thank goodness), but the performances didn't seem to have that energy from the first movie. As for the new voices, Tara Charendoff's Melody was rather annoying. She's just great as Bubbles on \"Powerpuff Girls\", but that doesn't seem to translate well here. Maybe it was just the stupid lines fed to her. Prince Eric's new voice would be okay if it wasn't friggin' Yakko Warner from \"Animaniacs\"! Don't get me wrong; Rob Paulsen was wonderful on \"Animaniacs\", but he sounds nothing like the original Prince Eric. (Compliment or criticism? You decide.)<br><br>Well, I suppose I should wrap this up now; I'm sure I'm over the word limit and that this is the longest review I've ever written. I'm not really sure why I'm wasting this much space on a movie that's such a waste of space. I suppose I had to defend the honor of the original \"Little Mermaid\", but the movie can prove itself. I say that we burn all copies of DTV sequels, especially this one and the upcoming \"Hunchback II\", which looks like it will be another tragically horrible treatment of a Disney classic.","user":"sngbrd39","rank":[55,63]},{"title":"The worst Disney sequel I have ever seen in my life.","rating":1,"date":"2 April 2008","review":"This movie makes me want to throw up every time I see it. If you take the first movie, and reverse the plot (ariel wants to leave the sea, her daughter wants to go to the sea), take the same characters and give them new animals and new names, and then throw in crappy animation and the biggest suck factor, possible, you get the little mermaid 2. Its basically a copy of the first movie with a reversed plot. I'll take you through the horror of it step by step. These are the people from the 1st movie: First of all, Prince Eric is still prince eric, with about 3 lines in the whole movie. Ariel is uptight, annoying, and is not the carefree, headstrong spirit we saw in the 1st. In fact, she is the exact opposite. Sebastian is still sebastian only less cute, less convincing as being stressed out, and the jokes just aren't funny anymore. Flounder has about 2 lines. He now has kids and he talks with a dumb nasal voice. Scuttle is still dumb scuttle only not funny. King Triton's character is probably the best, he still retains the intimidation and love for his daughter, Melody. Ariel and Prince Eric appear not to give a hoot about their daughter. <br><br>Like i said, all they did was use the characters from the first movie and copy them. This is what they did: Ursula- The new evil villain is Morgana, Ursula's sister who feels like she always lived in Ursula's shadow. I wouldn't be scared of her if she showed up at my doorway with a knife. She can't do anything right and she's a failure as a villain. She has the same voice ursula did. Sebastian &amp; Flounder - Have been replaced by probably the most stupid sidekicks, Tip &amp; Dash, a walrus and a penguin. They try to be hero's but always fail when trying. the plot is so predictable. They become heroes at the end. Yawn. Flatson&amp; Jetsom- Now replaced by a shark who was turned about 10x smaller by triton. Hes really bad too. Morgana and the shark (sharkbait, I think was his name) have no chemistry, good or bad. Ariel-Ah, Ariel. Our lovely mermaid was replaced by her un-lovely daughter, melody. Melody cannot sing, her voice is about 2 octaves higher than it should be, and you want to punch her in the face because shes so fake sugary sweet. She wants to go to the sea, she is clumsy and the kids make fun of her, she has to go find herself. yawn.<br><br>Not only is the movie boring and unoriginal its so simplistic when you watch this movie you will gasp at how bad it is. Certain parts of the movie make you want to call Disney up and demand why such a horrible movie was made as a sequel to such a wonderful original.<br><br>Basically, comparing the little mermaid 2 to the little mermaid is like comparing and Ed Wood movie to Casablanca. Don't ever watch this, not even when your bored.","user":"classicx_attraction","rank":[28,32]},{"title":"Suddenly, I have a craving for sea-food...","rating":1,"date":"23 September 2000","review":"Well then, thank you SO MUCH Disney for DESTROYING the fond memories I USED to have of my FORMER favorite movie.  I was about 5 when the original movie came out, and it was one of the first movies I remember seeing.  So, now that I'm 16, and feeling masochistic enough, I decided to rent this movie. Thus, I managed to poison all my memories of the original movie with this sorry excuse for a movie.  This movie takes everything that made the original endearing and wrecks it, right down to the last detail.<br><br>In this movie, Ariel and Eric celebrate the birth of their daughter, Melody, and go to show her to everyone in the ocean...BROADWAY STYLE!  After the musical number ends, within minutes, the sea witch Morgana shows up and threatens to kill Melody if Triton doesn't give up the trident.  Thus, he gives it up without even a fight.  Eric stands there gaping, though Ariel figures out how to use a sword and save Melody.  Morgana escapes, so Ariel and Eric decide that Melody should never go near the sea until Morgana is caught.<br><br>Well...uh, nothing of note really happens.  Eric is a total wuss.  He never really manages to do anything.  Ariel sort of does something.  Melody manages to screw things up.  Plus, the animation is a new low-point for Disney.  The computer graphics wind up clashing with the backgrounds.  Ever single opportunity for character development is wasted.  The songs bite.<br><br>Look, don't waste your time.  I'm pretty sure even the little kids are going to be bored out of their skulls with this, since nothing even remotely exciting ever happens.  They won't want to sing the songs.  If you manage to grab a copy of this, throw it out into the ocean and hope that nobody ever finds it.  Ever.","user":"Rebochan","rank":[22,25]}]