[{"title":"A Quality Piece of Hard-Hitting Naturalism","rating":8,"date":"9 November 2002","review":"8 Mile probably isn't what you expect.  Given the cast and premise, you probably expect one of two things, either a silly excuse for self-aggrandizement or an overblown caricature of hip-hop culture.  You don't get either.  What you get is a brave film that is surprisingly culturally and intellectually rigorous and an aggressive film that is so emotionally intense that it seems to sometimes tear itself apart.<br><br>The plot is not a biography of Martial Mathers, a.k.a. Eminem, but it is very much informed and guided by the experiences of his early career as a rapper in blue-collar and no-collar Detroit.  Eminem gives a compelled, powerful performance that diverges just enough from his public self to inject the story with a strong sense of realism without sacrificing anything artistically.  The supporting cast also makes fine use of their considerable talents, carving the Detroit of this film out of the world itself, not out of fiction.  Even as they help communicate a hard, unforgiving time and place, they also give rise to deep and profound sympathies that don't come around in every film.<br><br>The naturalistic presentation doesn't stop there; most of the film is shot on location in Detroit, and the gritty, sometimes almost frenzied design and cinematography firmly establish that this is not just another Hollywood movie.  This is a movie that goes places movies don't generally go where, for good or for ill, many people do live every day.  For one, 8 Mile might have the most believable, most powerful representation of an automobile factory of any film in the last twenty years, and it still manages to use the location for sophisticated, plot driving drama.  Good stuff.<br><br>Of course, the film has its flaws.  It's very heavy and bleak, at times it skirts the boundary of cliche a little bit, and the villains, a rival rap group known as the \"Free World,\" are a little over the top, but, time and again, the solid acting and daunting camerawork keep coming back to seize the eye and command attention.<br><br>Oh, and, in case you were wondering, there is rapping, and plenty of it. The rapping is really top-quality, cutting edge stuff, for the most part, and it is integrated into the script so well that it is always clear that the characters choose to rap, not that the script forces them to do so.  The rapping happens because it must happen to these characters at this time, not because Eminem is a rapper.  In an industry where pop music movies are a dime a dozen, this is particularly impressive.  This film says something about rap and the human experience that hasn't been articulated this well many times before; it bridges the gap between rap and poetry in a big way, and makes that gap look a lot smaller.<br><br>All in all, the thing that really defines 8 Mile is how committed to this idea the cast and crew must have been in order to make this film.  Every minute and every second, the cast's intensity never gives up, and the camera never sleeps.  The film is detailed, finely crafted, and has a pounding heart the size of a boxcar.  If you don't mind the obscenity and violence (and there is a bunch), I'd definitely say this is a movie worth seeing.","user":"PeteBDawg","rank":[269,296]},{"title":"So, rappers CAN be actors...?","rating":8,"date":"28 November 2005","review":"I was afraid of this movie. For a long time I feared that one day, Eminem WOULD make a movie - and that movie would suck!!!!<br><br>Along it came, and you know what? It didn't suck. Man, was I relieved. <br><br>I have never been able to put a finger on Mr. Mathers' rapping skills, I think his technique is amazing. His rhymes are sharp and intelligent and he always performs them with pure justification. But could he take this to the big screen? He succeeded. In his debut movie he managed to play it real and natural. He had good on screen chemistry with pretty much all the characters, but especially with Brittany Murphy (Uh, gotta love that sex scene... That was hot.)<br><br>The final battles in the movie, are the absolute climax. If you ever had any doubts about Eminmems talents - one way or the other - you definitely know his worth now!<br><br><ul><li>Some might say that it must be easy to play yourself, and it's not a secret that this movie is somewhat autobiographic. But it sure takes guts to put yourself out there like that, well done.</li></ul><br><br>So 8/10","user":"MissMill","rank":[193,213]},{"title":"Yes!","rating":7,"date":"14 March 2019","review":"Rap is not my cup of tea.\nBut this movie is very well interpreted and perfectly holds water!","user":"FrenchEddieFelson","rank":[24,25]}]