[{"title":"Martially Artful. Don't blink or the plot leaves you behind.","rating":10,"date":"10 August 2002","review":"`Tokyo Raiders' starts off fast and furious.  Before we are on a first name basis with one of the main characters, he is embroiled in a fight scene the can only be described as Jet Li meets James Bond meets MacGyver. <br><br>\n`Tokyo Raiders' moves at an incredibly fast pace, Fight and Chase, Fight and Chase, and I found myself fighting and chasing the ever elusive plot.  I saw the version dubbed into English, and perhaps that's the only fault of the movie.  I never fully got a grasp of who each character was, what their name was, as well as the purpose for their actions.  Introductions to the characters are never properly given, and soon the plot twists so much you don't know who's who, who's Chinese, who's Japanese, who's working for which mob boss, and who's actually a good guy.  This might be part of the film's mystique, or just really bad English dubbing.  In any event I didn't really care.   The martial arts fight scenes are plentiful in this film, and they are brilliantly done.  The actors themselves are very skilled in the martial arts, and the director really enjoys playing with slow motion and rotating camera angles.   The effect is absolute brilliance: a truly new art form made up of technical merit and intelligence in both filmmaking and martial arts skill.  <br><br>This movie has been called a comedy.  It's not so much a comedy as it is a comedy of errors.  I liken it to `Lock Stock, and Two Smoking Barrels' as both involve some frantically hysterical antics that happen when average Joes get mixed up in the seedy mob underworld. Both films move at a mile a minute as well.  Have I mentioned this film moves fast yet? <br><br>\nThe artfully done martial arts more than makes up for any confusion caused by the speed of the plot and the poor English dubbing.  If you thought `Lock, Stock, and Two Smoking Barrels' needed some Kung Fu added to it, this movie might just be your soulmate. .  7/9 Stars","user":"hayabusa-1","rank":[10,10]},{"title":"Cool film","rating":14,"date":"14 September 2000","review":"When I saw the cast on the posters for 'Tokyo' I went \"wow\". Kelly Chen, Ekin Cheng and of course Tonly Leung. I was at first sceptical because of the Director Jingle Ma who directed another action film 'VR cops' which was terrible.  But for his 2nd action film he really has learned a lot. Obviously basing himself on John Woo (note the amount of dove shots and use of slow motions) and trying out some 'timelapse' shots, it really brings out some life into the film. Tony Leung and Ekin Cheng actually play well off each other, for the cantonese audience it is at times obvious when the cast ad-lib which was left untranslated and simplified on the English translation. The film is very simple and the twists get a bit over-done with one after another, but overall it did turn out quite good. Personally, I enjoyed the film with it's unique blend of Japanese and Chinese acting and a comedic score, it is a fun film.","user":"biwbiw","rank":[9,9]},{"title":"Brilliant HK Fusion Film","rating":10,"date":"26 April 2002","review":"Jingle Ma, long one of Hong Kong's best cinematographers, shows here that he can create and direct an amazing film when given greater control. <br><br>\n\"Tokyo Raiders\" is a quintessential HK fusion film, containing plenty of traditional HK elements but making superb use of Japanese and Western elements as well.  The soundtrack alone makes it stand out from other HK films of the post-New Wave era, but \"Tokyo Raiders\" adds great humor, irony, editing, photography, and a broad spectrum of choreography and action (a nod to Jackie Chan-film regular bit actor Allen Chiu-wai Sit as action choreographer here).<br><br>The main cast comes off very well, playing characters that veer from serious (or, in some cases, at least near-serious) to absurd -- as the story does the same.  \"Tokyo Raiders\" is really an action-comedy, and strong in both categories, and the cast is a delight.<br><br>I usually really hate fancy editing and camera-work for action scenes.  If the action is any good, it should be presented cleanly and clearly, so the audience can see it.  Anyone can fake action (albeit poorly, in most cases) by messing with the film.  That's not impressive.  If you have a cast capable of real action and go to the trouble of choreographing real action, then you're only hurting the film by chopping it up with close-ups, slow motion, rapid cuts, and the like.<br><br>But in \"Tokyo Raiders\", Jingle Ma shows that he has the very rare talent of actually enhancing action sequences through careful use of effects. Personally, even if the film weren't so all-around enjoyable, I think this would make it worth seeing all by itself.  Most other action directors should take notes.<br><br>It's true that many viewers may find the thread of the plot a little hard to follow at times, but this isn't the kind of movie where you have to follow everything to enjoy it.  (Few HK action films are, and it's a good thing, too.)  And it's true that many viewers will wish that Tony Leung's character's assistants had more screen time.  Well, no film is truly perfect, but \"Tokyo Raiders\" is definitely worth a shot if you like Asian action films and comedies at all.<br><br>Just be sure, if you don't speak Mandarin and Japanese, to get a subtitled, not dubbed copy, and not panned-and-scanned (edited to fit a TV screen) if you can help it.  As with most foreign films, it makes a world of difference.","user":"kensmark","rank":[6,6]}]