[{"title":"Almost 20 years later, still fun","rating":8,"date":"8 May 2019","review":"I have a theory that if you can watch a movie twenty years or so after it was initially released, it's probably a good movie.<br><br>A lot of folks complain that it wasn't \"the original\", and that's okay. The original is a good movie, and this doesn't really need to be it. Instead it takes a story, updates and tweaks it just a bit and creates a delightful world of it's own. Sure, there are a few plot holes, and yes, there are a few scenes that could have done better. But they aren't hell-worthy trespasses, and are forgivable for the sake of propelling the plot forward.<br><br>Other than the spot on casting, which is enjoyable and fun and really well portrayed, what brings you into this film are the sets and sceneries. This movie came out before CGI was used to replace the world rather than augment the world, and so you have real sets in real woods and real costumed creatures, and it just pulls together nicely. The music fits incredibly well to capture the tribal setting that humanity has found itself back into without it being too anachronistic.<br><br>All in all a fun, enjoyable film to watch, and much better than a lot of movies that have been coming out lately that force the narrative, rather than letting the story unfold.","user":"boe_dye","rank":[24,25]},{"title":"How life must have changed for actor Alan Young during forty two years!","rating":23,"date":"23 May 2002","review":"THE TIME MACHINE which I first saw at its London premiere in 1960 has long remained a personal favorite of mine. I bought the film 17 years ago and my own children grew up with it during the many times we have watched it since. It had a distinct charm and news of its impending remake was of no interest to me...another un-reworkable film if ever there was going to be one! I had no interest in its existence and even less inclination to see it. Dragged, protesting to the theater recently by my daughter who had already seen it and who, under the insane belief that I would enjoy it, strapped me into the seat! Raving incoherently and fully intending to dislike each and every frame, I watched what I expected to be my greatest nightmare since SPEED 2.<br><br>Well girls and guys...I was so wrong! The remake not only captures and enhances the memory and feel of the original in many ways, it is vastly better! Pearce, who improves mightily as the film progresses (his early wimpy appearance telegraphed danger as far as I was concerned!) is just plain excellent as the slightly unhinged designer. The time machine itself (understandably, with today's fx potential) creams Rod Taylor's 1960 mini-umbrella!  Mark Addy makes a great \"Philby\" very much in the style of Alan Young's original characterisation. Nice touch too, having him cameo here as the florist! For him of course, he has experienced his own \"time machine\" in the 42 intervening years!<br><br>\"One hit wonder\" Samantha Mumba is an acting natural and as the Eloi girl, hits exactly the right note called for in the role. Both she and her younger brother Omero contribute greatly to the film's success. Everything about this film is visually impressive. Wonderfully imaginative sets and masterful cinematography. Jeremy Irons' small but significant role comes off well too!<br><br>I read complaints about the Morlock make-up? Hello?  any of you ever SEEN a Morlock? No???  well then, kindly refrain from negative comment. These guys looked and moved way better than the little furry 1960 creations! I liked also the intent NOT to have Pearce able to reverse the death of his fiancee - that was heightened awareness on someone's part!<br><br>Add to the above a superb musical score and if this doesn't all make for an entertaining and thought provoking film, hey guys, you're hard to please. Certainly this was never intended for THE FAST AND THE FURIOUS set! It is inarguably the best remake I have ever seen and one of only a few have that ever managed to improve on the original!","user":"uds3","rank":[233,299]},{"title":"Great Remake","rating":10,"date":"10 May 2019","review":"Forget all the negative 'reviews'. This is a fantastic movie . Just watch it with an open mind and you will have great time.","user":"george-kanakaris","rank":[15,16]}]