[{"title":"Don't believe the critics... or the God-awful trailer. This is a great film!","rating":10,"date":"10 December 2002","review":"I think many of the problems this film had at the box-office (and with critics) were due to the marketing hack-job Lions Gate pulled prior to its release. Watching the trailer and TV ads, one would go into \"The Rules of Attraction\" expecting another one in a long line of a stupid teen sex comedies. I had the benefit of knowing a good deal about this film well before it came out, and knowing what writer/director Roger Avary was going for with his film. This film is not intended to be another \"American Pie,\" but rather, it is a satire of films like \"American Pie,\" and the totally unrealistic worlds of those films. And Avary pulls this off perfectly, and as far as I'm concerned, \"The Rules of Attraction\" is a work of sheer genius.<br><br>A lot of people have complained about the characters. Are they likeable? For the most part, no, they're very bad people. But that doesn't mean they're not interesting to watch. Since the characters are so realistic, we can gain a lot from watching their actions and the subsequent effects of those actions. Avary's adaptation of Bret Easton Ellis' book does a great job of showing that these are bad things the characters are doing. You do not at any time get the idea that Avary or Ellis endorse this behavior, but are showing it as a caution, hoping that people will think twice before acting like these characters. All this probably makes it sound like the film is depressing as hell. And in some ways, I suppose it is. But it's also very entertaining and darkly hilarious. I say \"darkly,\" because you sometimes feel guilty for laughing at such obviously atrocious actions, but you can't help it.<br><br>This is a film that relies heavily on acting. With bad acting, the points Avary is trying to make would have been totally lost. Luckily, the cast more the pulls it off. James Van Der Beek manages to make you forget that Dawson guy he's so well known for. He really seems to understand the character of Sean Bateman, and is not afraid to go all the way with his portrayal of this morally bankrupt man. He and Shannyn Sossamon are the highlights of the film. Sossamon's Lauren is the closest thing to a sympathetic character in the film. She does some undeniably stupid things, but she is not a totally bad person, and there are times in the film when you're heart just breaks for her. Sossamon does a great job of capturing the many mixed emotions her character feels. Ian Somerhalder is also very good as the other lead character, the bisexual Paul Denton. Jessica Biel seems pretty vapid, but then again so is her character, so it works fine. Kip Pardue and Thomas Ian Nicholas are also good in their smaller roles. Russell Sams steals the couple scenes he's in as an old friend of Paul's. His scenes are easily the funniest in the movie.<br><br>Now I must talk about the directing. Roger Avary has made \"The Rules of Attraction\" a very highly stylized film. But it is not, as is so often the case, style over substance. All of stylistic tricks, while technically impressive, also add a lot to the overall theme of the film. That, and the fact that he got great performances out of a cast made up largely of WB alumni make \"The Rules of Attraction\" one of the best directed films of 2002. It's a shame Avary won't get any recognition for his work since the film was unfairly trashed by critics and was a box office disaster. I'm looking forward to seeing more of his work. Hopefully more people will be exposed to his obvious talent the next time around. <br><br>This is a very dark and realistic film, something not too common with the vast majority of Hollywood films and, as such, it will not be for everyone. The film blows away the myths about sex and college life that have been perpetuated by countless films before it. People have been offended by this movie. Good. You should be offended that there are actually people this shallow and devoid of feeling in the world (and there are... people like this do exist). I know I am. But that doesn't mean it's a bad film. Rather, \"The Rules of Attraction\" is a great film, made be a group of very talented individuals, that at once entertains you and makes you squirm in your seat. If the film wasn't as graphic as it is, it wouldn't work nearly as well. It's the realistic, unsanitized nature of the film that gets the point across. It's not for everyone, but if you can handle it, \"The Rules of Attraction\" is a highly rewarding experience. See it when it comes out on video, since it was long gone from theaters within a few weeks of its release.<br><br>Rating: 10/10","user":"spazierganger","rank":[149,203]},{"title":"Pointless but then, that's the point!","rating":8,"date":"9 December 2002","review":"This movie will leave you feeling so empty. There are no likeable characters and no standard storyline construction (there is no beginning, middle or end as such). But, you see, that's the point. This certainly will not be everybody's \"cup of coffee\" so to speak. Too many people like their movies to wrap everything up at the end and have everything explained to them and for Lassie to save the day. If you are one of these people then don't bother. On the other hand if you like a movie to challenge you then I am sure you will find ROA superb.<br><br>Based on the book of the same name by Bret Easton Ellis it is probably THE best book to film adaptation I have ever seen. It captures Ellis' tone perfectly. Take some morally corrupt but beautiful people and show how much of a waste they are. Nobody ever listens to one another and everybody is out for number one. They are all selfish, greedy, and self centred. You are given not one character to like. It is a dark dark comedy about the corruption of excess and moral vacuum left behind. It is in my humble opinion brilliant. You will physically feel that vacuum in your stomach after watching the movie. These people and their actions are the perfect allegory for our ME culture. One significant difference from the book is the timeline which is updated to more current times from the books 80's context.<br><br>Roger Ebert went to see this twice because he was unsure how he felt about it. In the end he felt it was too unrealistic with regard to the nudity and attitude to it and he couldn't reconcile with the fact that there was no one to like in it. In response he received many letters from students saying that this is exactly how it is on campuses in the US, that this is what they do every weekend. That might give you an indication of the level of reality achieved here and also an idea of the culture gap. This is another movie where older people may just not get it. When I read Ebert's review his main criticism's centred on the characters but personally I found myself throughout the movie saying for almost all characters `I know someone like that'.<br><br>Go see it, but be prepared to feel nothing. It's decadent. It's great!<br><br>P.S. I haven't read the other reviews but if you are silly enough to compare this to American Pie or such nonsense then you are WAAAAAY off the mark.","user":"DeviousMrBlonde","rank":[108,147]},{"title":"A Tragic Case Of Mismarketing","rating":10,"date":"20 April 2003","review":"I saw the TV spot for this movie last year and i said to myself that i was going to avoid it at all costs, just another dumb teenage geared movie with one demintional charecters, not to mention the fact that i was afraid i was going to hear that god awfull \"She F*cking Hates Me\" song if i was going to see it. So, I completly avoided the damn thing until today, when a friend of mind who i greatly respect the oppions of said he heard that it was really good and that we should rent, i decided \"what the hell, I'll give the thing a chance\" and I am so glad that i did. This film is a work of art, plain and simple. It is NOT making sex and drugs seem cool or fun or anything of the sort. This movie is a complete send off of the idea that young adults can have carefree sex with no side effects. People who say this movie is just a typical teen movie need to look a little closer at what is really going on: every sex scene in this film is shot to make sex as unapealing as possible, in fact, the only time i was less turned on by sex scenes was watching \"A Clockwork Orange\", it shows sex as being something that when you make it a big deal in your life, it will consume you and draw out any humanity you may have. People who were like me that haven't seen this film yet, people who think \"It's just going to be another waste of time\" should see this film, and i have a feeling that if you really pay attention, you will see this disturbing masterpiece for what it really is.","user":"personguyman","rank":[27,33]}]