[{"title":"\"It's fun to get away from the camp, even if it's just for an hour.\"","rating":9,"date":"12 March 2002","review":"The strangest point in this film is a point, about a half hour through, when all of the seemingly normal camp counselors go out in to the city.  In a montage shot, they slowly go from reading books at the library, to smoking cigarettes, to smoking joints, to buying cocaine from a guy on the street, to becoming prostitutes, then becoming strung out heroin-addicts at the local crack house.  This is not your parent's parody movie.<br><br>From this point on, the film is never the same.  Seemingly normal character development goes out the window, and characters jump from one complete different personality to another within seconds.  We get brilliant lines of dialogue that could only be brought from members of The State, like: \"Hey, there's a problem.  I've got something I need to tell you.\" \"Oh no!  You have crabs.\"  \"No.  Well, yeah, but that's not the problem.\"  \"Oh good.\"<br><br>Pure genius!!!  Why don't more comedies have lines of dialogue like this?<br><br>Some other great points: \"There is a way we could save everyone's lives. Well, no that couldn't work.  In order for it to work, we would need to have a device that could randomly generate numbers between 1 and 20.\" \"That's impossible.  That would take some sort of highly advanced supercomputer to work.\"  \"Not necessarily.  No dungeon master goes anywhere without his...20 sided die.\"<br><br>I sort of wish I had known what films were being parodied in this movie.  I saw strands that sort of matched what I had seen from old Summer Camp movies I had seen back in high school during the wee hours in the morning during comedy central.  But, there were many things here that seemed like they must be references to other films.   Oh well.  It's just all crazy.<br><br>Anyway, I guess I should say that this isn't a really good...movie, per se, but...well, I have no excuses for it.  Wet Hot American Summer rules! Dolphins suck it!!!","user":"deputydoofus","rank":[72,115]},{"title":"I don't know what this is supposed to be.","rating":25,"date":"25 September 2017","review":"I somehow managed to go 16 years without knowing this movie existed and I wish I could have kept it that way. A certain movie podcast host mentioned how great this was(and that it was based on movies like Sleepaway Camp) and after seeing that it was the guys from The State, I knew it had to be funny. I couldn't have been more wrong. This movie has no comedy and no real story. Just a bunch of lame, shallow characters. Sleepaway Camp was not only a much better movie, it was a lot funnier and it wasn't even a comedy. Never see this.","user":"TheMeanGreenMidget","rank":[9,11]},{"title":"A mixed bag of a summer camp film","rating":16,"date":"16 February 2002","review":"This movie defintely has its high and low points, the plot concerns the last day of camp in 1981 at a small Jewish summer camp in Maine.  It's meant as a parody of all those late 70s, early 80s teen sex romps like Porky's and Meatballs, and while some of the parodies are dead on, others fall rather flat.  Perhaps the funniest moment concerns some of the counselors \"hour-long\" trip into town which starts out innocently but then degrades into a drugged-out parody where the kids start out smoking cigarettes and quickly go to robbing old ladies to feed their newfound cocaine and heroin addictions.  Other high points include the Vietnam veteran cook, the loony arts &amp; crafts instructor, and even the children deciding not to play baseball against the anonymously evil-rival camp because they just don't feel like it.  A lot of the movie seems more like a bunch of strung together sketches, which adds to its weakness.  However, it is fun to see the return of the bad haircuts, too-short shorts, and high socks that made up that era, along with some great early 80s rock hits.","user":"tex-42","rank":[28,45]}]