[{"title":"Childhood nightmare","rating":9,"date":"23 October 2003","review":"I saw this serbian film twice in my early childhood. Remember it still in the mist and it is one of the few horror movies that spooked the hell out of me. Highly recommended vintage treasure, straight 10/10, one of the TOP5 horror movies of all times. Brilliant camera, weird rural atmosphere, a true representative of Balkans' scary legends on the big screen.","user":"SpookyDuke","rank":[47,57]},{"title":"True childhood nightmare!","rating":25,"date":"25 September 2004","review":"Yes! There were quite a few 'not so smart' people at TV Serbia back in 80's because they showed this film at 19:00 or even worse around 10:00 so all the children (i.e. Me) could see it and think its drama for kids...What a misconception!!! <br><br>This is vampire-horror masterpiece! Unfortunetally its TV movie made with TV camera so you never have impression of a real movie...But that kind of work has many achievements because you simply don't expect that kind of HORROR in that form of film-making!<br><br>Makeup is brilliant!!! Acting is beutyfull - all professional, academic actors - which is not the case with 99.99% of horror movies! Story it pretty simple but it all revolves in 19th century Serbia so it has sweetest plot I'we ever seen in a Horror!<br><br>I recommend it with greatest pleasure!","user":"takac","rank":[43,53]},{"title":"Leptirica","rating":16,"date":"16 June 2006","review":"Wonderful, I've seen this movie ONCE when I was a kid and since then it's burned in my mind as of the most scary films I've ever seen. And I've seen A LOT of horror. Hm, I think I will try to find this film again, I'm pretty curious about how I would feel now while watching it. It certainly did contribute to my love for the horror-genre, and vampire figures in films, in general. This particular vampire , leptirica, is very old in Slavic folklore. The female vampire shapeshifter, upir, can even be considered as a metaphor for many things. Feminine mystery or sexuality is one of them.Interesting !","user":"diana_solaris","rank":[23,29]}]