[{"title":"Entertaining mix of Spaghetti Western and old-time serial","rating":8,"date":"5 August 2000","review":"In the tradition of Clark Kent/Superman, Robert Woods plays both the seemingly gawky and cowardly Johnny Black and the black-masked avenger Starblack, who resembles such 1940s serial heroes as Batman or The Phantom, but in a Western context. The film alternates between the gruff stoicism associated with Italian westerns and a cartoonish feel that was no doubt a homage to the old-time serials that the director/writer/star had enjoyed as children. Somehow it all works and produces a Eurowestern that is both exciting and fun. Woods, who is usually very convincing as a tough, violent character, here plays the (outwardly) bumbling and weak-willed Johnny Black very convincingly, like a cross between Will Hutchins and Tony Perkins! Overall, STARBLACK is a very entertaining film that should appeal to a broad audience and is a choice role for star Robert Woods (who also wrote and sings the title theme on and off throughout the film!).","user":"django-19","rank":[6,6]},{"title":"Goofy Exuberance","rating":5,"date":"18 February 2003","review":"A hero wearing a black sheriff's star and in a mask that brings to mind the one worn by the killer in Blood and Black Lace fights for justice against the brutal banker Curry and his gang of killers.<br><br>This entertaining Italian western in very much in the mold of the Spanish Zorro movies being made in the late Fifties and early Sixties by Joaquin Marchent, among others. Other early Spaghetti Westerns, like The Last Gun (1964), have a similar plot as these movies were one of the early inspirations for the genre. The western town in Fistful of Dollars was originally built for one of Marchent's Zorro movies. Starblack has the same plot of masked hero v. oppressor and the same goofy exuberance. It is essentially just a series of escalating episodes that consist of Starblack escaping a trap laid for him by Curry (played by Franco Lantieri, who really hams it up). This, of cource, leads to a more elaborate trap and more unlikely escape in typical comic strip or serial style. Later Spaghetti Westerns like the Sabata and Sartana films or God Forgive . . . I Kill Them (1967) have a very similar plot construction which suggests that they belong in the same lineage. Zorro films would continue to be made in Spain and Italy through the Mid-Seventies.<br><br>Director Giovanni Grimaldi wrote and directed a number of Franco and Ciccio films, as well as some Toto films, which partially explain the comic tone of Starblack (Sergio Corbucci and Bruno also had similar roots in comedy). He also had a hand in scripting a number of peplum and early horror movies, including Danse Macabre (1964). His only other SW was the good In A Colt's Shadow (All'ombra di una colt) directed earlier the same year. Both movies have the same naïve, 1950s American B-western look to them, though In A Colt's Shadow is by far the more interesting visually.<br><br>Robert Woods was one of the stars of the genre, though after the success of My Name Is Pecos, he would usually play darker roles including the memorable performances in cult classics like Blackjack (1968 ) and El Puro (1969) . Having seen these films before Starblack it was strange seeing him play a grinning, lanky, and guitar-playing cowboy. He sang the theme song, which is almost as memorable as Lee Van Cleef's solo for Captain Apache (1971).<br><br>Top spaghetti western list http://imdb.com/mymovies/list?l=21849907<br><br>Average SWs http://imdb.com/mymovies/list?l=21849889<br><br>For fanatics only (bottom of the barrel) http://imdb.com/mymovies/list?l=21849890","user":"rmahaney4","rank":[5,5]},{"title":"\"Chi era quell'uomo mascherato\"? (\"Who Was That Masked Man?\")","rating":10,"date":"10 September 2006","review":"Capturing the spirit of Zorro ...The Lone Ranger..Robin Hood.....a large dose of Clark Kent...Batman &amp; Robin...yes, even Mighty Mouse...\"Starblack' mixes tongue in cheek humor...high camp...A lot of good Spaghetti Western action ..into a pretty entertaining movie.<br><br>Robert Woods stars as Johnny Blyth...who returns home after striking out on his own..building a ranch in Colorado..(at least that's his cover story)...accompanied by his deaf mute sidekick (yes, just like Zorro &amp; his Bernardo)...to discover (?) his father dead..under mysterious &amp; shady circumstances.....his mother remarried to his uncle...his dead father's brother..the respected Judge King. The locals are being squeezed by a gang of cutthroats led by the well scrubbed but slimy 'Curry', saloon owner..banker..money lender...supporting a very profitable business driving people to financial ruin......then seizing their homes &amp; assets.<br><br>Curry's thugs are beginning to encounter an obstacle to their terrorizing &amp; killing of landowners...in the form of a masked protector...his face completely covered by a black mask....who rides a white stallion (like the Lone Ranger, yup).....carrying a black star, which he always leaves at the scene , as a symbol of justice. Zorro has his Z...Starblack has silver badges.<br><br>Woods plays it straight..and plays it well..both as the dashing, swashbuckling Starblack...&amp; the mild mannered, guitar strumming, somewhat meek &amp; cowardly Johnny. <br><br>It's obvious that this is in the hands of a good director..the guy knew his Western movies..knew the old 40s serials..&amp; without a ton of money, fashioned a nice little nod to them.....in the true spirit of old time good guy B Westerns...comic book super heroes..and old time movie serials........complete with secret tunnels..deception.....very hammy bad guys..and all not necessarily being as it appears to be......featuring our hero getting into dangerous predicaments &amp; getting out of them..sometimes inexplicably....with an uncanny knack for always being in the right place at the right time..<br><br>......but there's no doubt we're firmly in Spaghettiville---&gt; due to whippings...knives in the forehead...a rape followed by a stunning scene....a moment not only one of the best resolutions in Spaghetti Westerns..but in Movieland itself...I cheered.<br><br>Grimaldi was obviously aware of Leone..it shows ...but at a time when copies and simple variations of \"Dollars\" ..&amp; \"Django\" were flying out of Texas Hollywood..he went in his own direction. He also wrote the dialogue..&amp; threw in some wonderful lines.....like \"gotta go where people need our help\" ...I was waiting for.... ''ma'am\"..ha ha..just like the old movies.....in one early scene..after Starblack has saved the day...a woman looks up at him adoringly...uttering \"Starblack\"...a simple hoot of a scene.<br><br>Some of the camera shots are spot on terrific.. innovative &amp; fresh..such as peeking through a noose ....overhead shots....shots from behind..from inside a moving miner's cart......&amp; violently funny..like when Starblack knocks off 10 guys like shooting ducks.<br><br>Both a tribute..a spoof..AND playing it straight.. a fairly difficult blend to pull off......it's clear that there's a genuine affection for his subject matter &amp; his characters. ............the too often obligatory comic saloon fight was actually pretty good..the stunts were well done...the fights choreographed well...some nice moments in the score..nice whistling theme.. and Robert Woods really sings.- which, as it is, turns out to be integral to the plot.<br><br>Of course the German version called him Django.......w/ the great title \"Django - Black God of Death\". .brrrrrrrr!!! Call it a popcorn &amp; pasta flick...perfect for a Saturday afternoon matinée, perhaps..maybe w/ some cartoons &amp; a newsreel and then.......<br><br>\"Return with us now to those thrilling days of yesteryear.... A fiery horse with the speed of light, A cloud of dust, and a hearty \"Ciao-Yo, Argento...... Via\" !!!!!!!<br><br>Hey..it's not high art...but I give it a \"Bravo\" anyway.","user":"boardwalk_angel","rank":[4,5]}]