[{"title":"Enjoyable, but not superb","rating":17,"date":"17 November 2001","review":"A straight thriller, yes - but lacks of some forgotten story threads and some mysterious re-appearences.<br><br>(I will not spoil anything here, but take the final car accident or the stairs accident. Some threads mystically forgotten or without further notice accepted by the main actors, some threads re-appeared without further asking - it just happened.)<br><br>Also some characters are in desperate need of their not established credibility - honestly: that covers the most actors except the main ones. And they are in need of some more credibility, too.<br><br>It's not that I don't like this movie - but it could be better done.<br><br>I would prefer three-dimensional characters on one side, minor ones on the other; cut of some useless time stretching shooting here, and add of some story-development scenes there.<br><br>All in all: enjoyable, but not superb.","user":"bcm-2","rank":[6,8]},{"title":"Enjoyable, quite good...","rating":8,"date":"8 July 2001","review":"This was shown on a late night in the UK and I saw it. It was pretty good, I did enjoy it. I was interested in it all the way through. Good performances all round, generally. Certainly worth watching if it's on TV, a good little Thriller.","user":"jmcb","rank":[8,12]},{"title":"\"Sometimes I Get So Lonely!!!\"","rating":1,"date":"1 December 2019","review":"Bo Derek may always be worthy of the title of a \"Perfect 10.\" Unfortunately, this stinker of a film ranks as a perfect 1.<br><br>The acting was wooden, and the directorial emphasis on close-ups made the lackluster dialogue even less credible. It was never believable that Derek's character of Mrs. Katherine Sullivan was suffering from agoraphobia when she uttered such lines as \"sometimes I get so lonely\" to her paramour.<br><br>Early in the film, Mrs. Sullivan's husband Charles is murdered. But the entire death scene is called into question when no body is discovered, and the police officers who arrive on the scene are imposters.<br><br>Enter private investigator Jack Mize, a former attorney who graduated second in his class at Harvard Law School, then messed up when he succeeded in getting a killer acquitted. The murderer then went on a rampage, leading Jack to renounce the law. Yet, curiously, he seems to feel no remorse when he recalls his disgraceful conduct to Mrs. Sullivan as her new private eye, as well as her lover.<br><br>When Jack and Mrs. Sullivan begin an affair, there never seemed to be much passion between them. The attempt was made to get a feeling of claustrophobia in Mrs. Sullivan's home to convey her agoraphobia through extreme close-ups. But the result was merely awkward compositional choices and clumsy cinematography.<br><br>The slow pacing and lack of development in the characters were more off-putting features of this film. It was never made clear whether the spider and the rats were the work of Mrs. Sullivan's strange sister Sarah. But, alas, the sister apparently did not survive a fall down the stairwell to help tidy up the loose plot strands in this turkey of a film.","user":"lavatch","rank":[1,1]}]