[{"title":"I liked it more than I expected to","rating":6,"date":"5 February 2001","review":"I saw this on a plane. You know, you are strapped to a chair and forced to watch whatever garbage they put up there.<br><br>And I have to say I actually had fun. Some scenes are sugary and over the top but the kid's performance is above average for children actors. Casting was perfect. <br><br>One thing though: the music is inappropriate, heavy-handed and sometimes ruins the scenes. It is like asking Richard Wagner to write for an intimate comedy. Very weird.<br><br>But I strongly recommended the movie to my mom. It is that kind of movie.","user":"mauricio-19","rank":[22,25]},{"title":"This could have been much worse","rating":6,"date":"27 May 2005","review":"When this movie was shown on television, it wasn't announced as \"Disney's The Kid\", but just as \"The Kid\", a movie with Bruce Willis, and that's probably a good thing. I'm pretty sure I would never have taped it if I knew this was a Disney movie, fearing that all the syrupy nonsense would be too much for me to handle. Still, I don't know what made me decide to give this movie a try when I saw the title in the beginning of the movie, but in the end I was glad that I watched it, because it certainly wasn't as bad as I feared it would be.<br><br>Bruce Willis is Russ Duritz, a wealthy L.A. image consultant who's about to turn forty. He's a cynical workaholic who has estranged from his father, who has no memories of his childhood and who doesn't have a girlfriend, a family or even a dog. One night he surprises an intruder, who turns out to be an almost 8 years old kid. But there is something strange about him. The chubby kid is named Rusty and has a lot of similarities with Russ. Soon they find out that Russ and Rusty are actually the same person. Together they make a journey into Russ's past to find the key moment that has defined who Russ is. How this is possible, what it all has to mean and how it will affect both their futures will only be clear at the end of the movie.<br><br>In a way this is a very typical and predictable Disney movie with it's rather innocent and naive look on life, but I guess it can be enjoyable for adults as well. It is all very recognizable and it is a nice fairy tale about losing touch with your inner child. It certainly isn't the best movie ever, but it is some decent and heart-warming family entertainment that offers some nice acting and a good story. I would say: watch it with an open mind and you'll see it isn't as bad as you feared. I give it a 6/10.","user":"philip_vanderveken","rank":[16,18]},{"title":"No kidding - I loved it!","rating":7,"date":"11 July 2000","review":"The Kid - At 39 years old Russel Duritz has a life that most men would envy - he has a great job, is respected (and feared), has a beautiful house and makes buckets of money.  But everything comes at a cost, in this case no social life, no conscience and a fear of spending the rest of his life alone.   He just needs someone to show him the way.<br><br>As I watched the movie, I kept wondering why Disney didn't pass this film on to Miramax - not because it's particularly daring or edgy, but because it is clearly a movie for adults.  This is exacerbated by the marketing campaign which is clearly targeting children - it is lumped in with trailers for \"Rugrats the Movie\", and \"Pokemon 2000\" (aren't they passe yet?).   But I quibble.<br><br>I was impressed by the sensitive treatment of the subject matter - rather than the typical male midlife crisis that involves some pathetic sap buying a Porsche convertible and acting like a moron, Willis' character undertakes some serious introspection and takes stock of his life.  His guide on this journey of self-discovery is himself at age 8 (they never explain how Rusty arrives and frankly, I didn't care).   Young Rusty's innocence and unbridled optimism give him a distinct advantage in divining the truth - he sums up Russell's job as an image consultant thusly, \"You teach people how to lie and pretend to be something they aren't\".    In order for a good script to succeed, however, you need actors to bring it to life.  Not a problem here.<br><br>Although Willis has thrice ignored W.C. Fields' warnings about starring with children or animals he has lucked out once again, meshing as well comedically with Breslin as he did dramatically with Osment. Willis manages to balance Russell's cutthroat powerbroker traits with vulnerability and confusion, without becoming ridiculous.  Breslin meanwhile gives a dead on portrayal of a kid from everyone's childhood - the one that always stuck out for some reason and got picked on.   We also get two bonus performances: Lily Tomlin is great as Russell's levelheaded assistant and Jean Smart is perfect as an insightful charming anchorwoman (I loved her in \"Guinevere\").<br><br>The Kid is charming, heavy, and real.  And it will appeal to adults of all ages.","user":"Shiva-11","rank":[29,36]}]