[{"title":"The Magic Comes To Life!","rating":10,"date":"21 November 2001","review":"Once upon a time (and not that long ago), in the vivid, fertile imagination of author J.K. Rowling, a character was born:  A boy.  A young boy named Harry, who was destined to become one of the most beloved characters to emerge from a work of fiction in a long, long time, and was quickly embraced by young and old alike in all corners of the world.  And now, thanks to the magic of the cinema, Harry and his companions fairly leap from the pages of the novel to the silver screen in the phenomenal motion picture, `Harry Potter and the Sorcerer's Stone,' directed by Chris Columbus and written for the screen by Steve Kloves.  Indeed, Harry Potter is a boy, but not just any boy; because Harry (Daniel Radcliffe) just happens to be a wizard.  But, orphaned as a baby, Harry has been raised by his Aunt Petunia (Fiona Shaw) and Uncle Vernon Dursley (Richard Griffiths), who never let him in on the fact that he was, well-- what he was.  It seems that Petunia didn't approve of her own sister-- Harry's mother-- because she was a witch; nor of Harry's father because he, too, was a wizard.  When Harry turns eleven, however, the secret is out of the bag when-- after some strange goings-on-- a giant of a man named Rubeus Hagrid (Robbie Coltrane) shows up at the Dursley's door to collect Harry and take him off to `Hogwarts,' a school for wizards and witches and all who would perfect the gift with which they were born:  The gift of magic!  And from the moment Harry boards the train (from station platform nine-and-three-quarters) that will take him to his destiny, the magic is alive-- for Harry, and for the audience, as well; and it's a journey you will never forget.<br><br>\tWhat a monumental undertaking to even think of attempting-- translating and transferring this passionately beloved work from novel to the screen. Because to millions of people, Harry and his companions are so much more than merely characters in a book; these are characters for whom people have made a special place in their hearts, which puts a great burden of trust upon the man who would attempt to bring them to life.  And Chris Columbus, it turns out, was the right man for the job.  More than rising to the occasion and with some magic of his own-- and a lot of help from an extraordinarily talented cast and crew-- Columbus has delivered a film that is not only true to the story, but true to the very spirit that makes Harry Potter so special.  The special effects are absolutely beyond astounding, and Columbus, with a keen eye for detail and without missing a beat, keeps it all on track and moving right along at a pace and with a sense of timing that makes this an absorbing, thoroughly entertaining and enjoyable experience from beginning to end.  From the opening frame you get the feeling that you're about to have a singular experience; and you're right. Because you've just entered the world of Harry Potter.  And it's magic.<br><br>\tEven having the best special effects do not a great movie make, however, and this film is no exception; what catapults this one to the top are the performances, beginning with Radcliffe, whom you quickly forget is an actor playing a part.  And that about sums up what kind of a job this young man does here.  Without question, he IS Harry Potter, physically and emotionally, and when he waves his wand and does what he does, you believe it.  A wonderful performance by a gifted actor who has a great career ahead of him; without question the perfect choice for the role of Harry.<br><br>\tAlso turning in excellent performances are Rupert Grint as Ron Weasley, and Emma Watson as Hermione.  As with Radcliffe, the casting here could not have been more perfect.  Grint is `Everyboy,' with that special glint in his eye and a manner that makes him especially endearing.  And the spunky Watson adds some real sparkle to the film as Hermione, the one with the sense of urgency and the wherewithal to get things done; a real role model for young girls everywhere.<br><br>\tIt's obvious that a lot of care went into the casting of this film, and it's a big part of why it is so successful.  Richard Harris, as Headmaster Albus Dumbledore; Maggie Smith as Professor McGonagall; John Hurt as Mr. Ollivander; Ian Hart as Professor Quirrell.  Exceptional performances from one and all, with two that stand out as especially memorable:  Robbie Coltrane, who readily conveys the fact that Hagrid's heart is of a size that matches that of the man; and Alan Rickman, as Professor Severus Snape, deliciously droll while demonstrating menace through the fine art of articulation.  <br><br>\tThe additional supporting cast includes John Cleese (Nearly Headless Nick), Warwick Davis (Professor Flitwick), Julie Walters (Mrs. Weasley), Zoe Wanamaker (Madame Hooch), Tom Felton (Draco Malfoy), Harry Melling (Dudley) and David Bradley (Filch).  From Rowling's imagination to the written page to real life (albeit via the movie screen), `Harry Potter and the Sorcerer's Stone' is a triumph many times over; a unique film of truly universal appeal, the likes of which is as rare as, well-- a sorcerer's stone.  A film in which adults and children alike will rejoice, because it speaks to the heart in a universal language of life, love, experience and imagination; a film that states unequivocally that magic exists-- as long as there's a single child with a single dream somewhere in the world, and real wizards like J.K. Rowling, Chris Columbus, Steve Kloves and every member of this wonderful cast and crew around to bring it to life as they have here.  An instant classic in every sense of the word, this is truly a film for the ages.  A remarkable achievement, this IS the magic of the movies.  I rate this one 10/10.","user":"jhclues","rank":[70,80]},{"title":"The major start of all the magic!","rating":8,"date":"23 March 2018","review":"Having read the first few Harry Potter books before 2001 and hearing about the hype for the first movie, I was excited. I heard there was going to be an all-British cast (which makes sense, right?) and we'd get to see a live version of one of the defining novels of our generation. From what I remember I went with my family and a family friend to see the movie the day after Christmas and was pleasantly amazed. After the movie was over, I watched the credits and discovered some familiar names (the late Alan Rickman, Sister Act's Maggie Smith, James Bond 007's Robbie Coltrane, and Star Wars' Warwick Davis); others not so familiar (the kids, some of whom had their debut). But it was a good movie and was a party of colors and sights for all to see. This is easily my favorite of all the Harry Potter films. The catalyst of the movie series!","user":"Spike-Washington","rank":[13,13]},{"title":"...Welcome to magic world","rating":9,"date":"5 June 2018","review":"The breeze stirred the neatly cut bushes of Tisovaya Street, silently lying under the ink-black sky. Of all the streets in the world, this street was the least suitable for amazing events. Harry Potter turned in his sleep. A small hand groped for it and squeezed the envelope. The boy was asleep ... \"(c)<br><br>June 30, 1997 in the light came the debut of the writer Joan Kathleen Rowling. Literally such words began to become great, a series about a small wizard, with a scar on his forehead. The story that absorbed the minds of adolescents around the world, as it was said in the press \"... a book that can tear boys and girls away from TVs and computers, return it to the house from the street ...\"<br><br>Just imagine...<br><br>\"A dull, dank, dark night. In the street a storm. The little boy lies on the floor of his \"room\", in a small shack and draws a finger in the sand with an inscription, \"Happy Birthday, Harry!\". The cry of the soul, he knows that no one will congratulate him, no one will affably caress the top of his head. In a minute he will be eleven. Ten seconds ... Nine ... You can wake Dudley - just for laughing ... Three ... Two ... One ... A loud knock at the door, there's no knock, just a crash. There was someone behind the door, and he was obviously going to come in. \"<br><br>I think anyone will guess what happened next. Good-natured giant Hagrid, told Harry the striking news that he is not just a boy with a scar on his forehead, but a real magician.<br><br>A short word about the actors.<br><br>Harry<br><br>What to say, there would not be Harry James Potter, there would not be the book itself. Whatever happens in the books, I was always entirely for his character. In the first part, he's just small, you can even tell a confused boy. All situations, difficult fights, intricate situations, are still ahead. Now he just scooped up this great knowledge - magic. The first real home, first friends, first classes, the first meeting with this evil, he is experiencing all this in the first part.\nHermione<br><br>Hermione Jane Granger is my favorite female character in the book and film. In it, I see a part of myself. Hermione loves to learn and she pays a lot of time. Sometimes she is too arrogant and excessively proud of her success in her studies. Born of a muggle, so often heard the offensive word \"Mudblood\" in her address. Hermione is just a smart girl, how many times she has yet to pull friends out of difficult situations.<br><br>Ron<br><br>Ronald Bilius Weasley. Redhead. Already this word can give some characteristic. Ron is the sixth child in a wealthy family of hereditary magicians. Always the elders took on everything superior to Ron, be it study, sport, or female attention. Arriving at Hogwarts, gets to know Harry, the same situation is repeated as with the brothers, but he reconciles with his second plan. Whatever it is, he remains the best friend of Harry and Hermione.<br><br>I wanted to say that the whole trio was exactly the same as it was represented by millions of readers in the world. Actors took absolutely unknown, but this film made them real little stars.<br><br>The movie has good enough, more famous actors, the same Maggie Smith, Alan Rickman, Robbie Coltrane, Julie Walters and the inimitable Richard Harris. His death was just a blow to all the fans, his Dumbledore seemed to come off the pages of the book, the same wise look from under the half-glasses, gray hair and beard, hooked nose. He inspired a kind of majestic calmness, every appearance on the screen calming. By the way, I do not consider Michael Gambon a good Dumbledore, he turned out to be some kind of crazy, but this is not on this topic.\nIt is quite possible to write now a complete retelling of the book / movie, but you know, absolutely do not want to. Joan Rowling created an amazing, magical world, thanks to her, millions of boys and girls began to look for a scar on their foreheads and with impatience and hope to wait for their 11th birthday. And I'm certainly happy about how Chris Columbus embodied this idea on the screen, the fairy tale turned out to be absolutely childish, very bright, joyful and for some reason the word Christmas comes to mind, although there is not so much Christmas there.<br><br>Children's dream came true. Harry found his friends, his family, found loyal defenders, but he does not even suspect what he will have in the future. However, it will not be soon, but now enjoy watching!<br><br>Dedicated to: all those who are ready to go with Harry to the end.","user":"BiiivAL","rank":[74,86]}]