[{"title":"Humor, action and a half-hearted attempt at depth","rating":7,"date":"8 December 2002","review":"Analyze This had an element of novelty and a generous dose of humor. Lacking the novelty due to its sequelhood, Analyze That tries to compensate by making forays into the psyche of Dr. Ben Sobol (Billy Crystal) as well as a little more (very little) analysis of mobster Paul Vitti (Robert De Niro). The psychology angle is not given much time or emphasis, but I suppose director Harold Ramis should get a couple of points for making a token effort.<br><br>The film is pretty funny and worth seeing, but doesn't really offer us anything new.  This is forgivable, though, because Crystal and De Niro are entertaining enough to carry the picture.  Overall, I'd recommend it -- it's funny and watchable and the two leads are very good.","user":"imdbfilmcricket","rank":[12,13]},{"title":"Analyze This, That, and the Other Thing...","rating":8,"date":"28 May 2003","review":"\"Analyze That\" is proof the critics can be wrong. Which probably means you shouldn't be listening to me, either. But you are, oh well. I guess I'll have to review the movie, now.<br><br>The Boss and The Shrink are back in therapy: Paul Vitti (Robert De Niro) has been locked up in Sing-Sing for 850 days. Ben Sobel (Billy Crystal) has just lost his father. That's when he gets the call from Vitti. Vitti gives him the low-down: Someone is trying to kill Vitti in jail. Sobel hangs up, Vitti gets mad, so he fakes crazy, and Sobel gets called in (since he is Vitti's psychiatrist). Sobel believes Vitti is cuckoo in the slammer, as he sees him singing tunes from \"West Side Story\" (one of the funniest parts in the film). So Vitti is released into the custody of Ben Sobel. But on the ride to Sobel's house, Vitti snaps out of it, only to reveal that he is not crazy, but, in fact, quite well. Now Vitti must start a new life and get a real job - that involves working \"from 9 to 5!\" - and find out who is trying to kill him...and why.<br><br>Perhaps I am mistaken, but \"Analyze That\" is funnier than \"Analyze This.\" Maybe it's just me, but I found it quite funny. I didn't think it was a \"rip-off\" sequel, there for \"no artistic reason.\" Sure, it's a sequel. Of course it's not going to be an Oscar-winner for originality; I don't ask for that in a comedy. Honestly, can you think of any sequel (other than the rare \"Godfather Part II\" film) that is as good as the original in terms of reasons for being there? All I know is that I think \"Analyze That\" had some very funny moments. Take, for instance, the scenes where Vitti is trying to get a new job. He becomes a car salesman for a day, and leads around a couple, showing them a nice car. \"Look at that trunk - you could fit three bodies in there!\" he says. When they say they're going to think about it: \"What's there to think about? You've been busting my b@lls for the last hour over this thing, asking me all these stupid questions, taking it for a test drive...so why don't you buy it?\"<br><br>Scenes like these are hilarious. And while there are somewhat long sequences without any laughs, the laugh-out-loud scenes more than make up for those lacking.<br><br>The only thing about this film that makes me drop the rating a notch is the execution of the last half hour. Just like the first movie, they set up a ridiculous \"action\" ending, that isn't action at all. Its ending is overlong and goes way too long without any laughs.<br><br>But that is the only thing I didn't like about the movie. De Niro and Crystal have a real chemistry, even more so here than in the first film. De Niro steals the scenes he is in, and Crystal steals the scenes he is in, and when they are both on screen, you're not sure who to look at.<br><br>I find Robert De Niro's latest journeys into comedy quite funny. He made a few comedies here and there in the past, but in the last three years he's coughed out some funny movies. \"Analyze This,\" \"Meet the Parents,\" \"Analyze That,\" and to a certain degree (it was okay), \"Showtime.\"<br><br>Perhaps I am confused. Maybe I need to see the first again. But having seen the original about twice, and \"Analyze That\" once, I can honestly say that I laughed more in \"Analyze That\" than I did watching \"Analyze This.\" And if that's not a good sequel, I don't know what is.<br><br>Here's to \"Analyze This, That, and the Other Thing\"!<br><br>3.5/5 stars -<br><br>John Ulmer","user":"MovieAddict2016","rank":[39,50]},{"title":"Shadows !","rating":23,"date":"23 September 2008","review":"Sequel is mostly not a reputable thing in Hollywood. In one week, I was reviewing sequels to memorable comedies like (Arthur 2: On the Rocks - 1988), (The Odd Couple II - 1998), and now (Analyze That - 2002) to have a bad result all the way. I think the commercial exploitation reached its explosion at the 2000s. Away from that, just look at this example: Director (Brad Bird) after the smash success of his Oscar-winner (The Incredibles - 2004) refuses to make any sequel, prequel, spin-off and dedicates himself to make totally another movie, another Oscar-winner (Ratatouille - 2007). This is wise creative person with bold decisions to make.<br><br>Unlike Mr. Bird, here, after the genius simple (Analyze This), they produced (Analyze That)! First off, the concept of this (That) was weak. I mean it could have been prettier idea to see some reversal as the mob man treats the doctor this time, or something like that. But unfortunately what we've seen was muddled, semi-pointless, and less funny compared to the first one.<br><br>Basically the situations were on shaky ground. The credibility, which was smartly coherent in the first (Analyze), is lost. And to hide that, they made all the possible comic lines they could do, however none was well enough, and they showered the movie with really nasty jokes, which ended up as just nasty! The best of this movie remains its first half, where (De Niro) is a mad singing man, or undesirable guest, or failing at many jobs. As the second half was the best of perturbation; the wholly unfunny matter of the TV show (strange how they missed to produce any laughs out of it), some car chase, a sudden unbelievable heist, and one genuine fabricated happy end where (De Niro) must look as the criminal with the heart of gold, and everything finishes fine.<br><br>(De Niro) became finally Mr. Hollywood; who's making the obligatory empty sequel. What a pity to hire a great comedian like him; who didn't have the chance much to express his talent at that area, merely to be in a nice sketch or two. I'm sorry to say it, but (Billy Crystal) makes outrageously his Razzie-worthy role and movie. If you looked closer you'd find that the script gave him nothing to do, so he had to manage with what appeared as his most ridiculous performance yet. (Harold Ramis) turns to remakes (Bedazzled - 2000), and sequels (Analyze That - 2002) after years of his \"original\" masterpiece as a writer, producer, and director (Groundhog Day - 1993). It's nearly the perfect case for what Hollywood does with its people at the insolvent boring 2000s!<br><br>This movie is in disarray that makes it look poor. And after the success of the previous one, it's disappointing. What can I say? The absurd plot, the hasty dealing, and the easy dirty gags did it. The only good thing to be said about those couple of movies is that they're way better, and more watchable, than (De Niro)'s other candy bars of the same time: (Meet the Parents - 2000) and (Meet the Fockers - 2004) which were horrible.<br><br>More often than not, the shadows of good movies, which they call sequels, can shadow effectively.","user":"elshikh4","rank":[6,6]}]