[{"title":"Where They Put the Human Waste","rating":10,"date":"8 March 2007","review":"Pay no attention to these other reviews; the people who wrote them don't know what they're talking about: In 1996 I was convicted of armed robbery and sent to prison in Washington state for eight years (of which I did seven)and I'm here to tell you that ANIMAL FACTORY is the real deal; I was a lot like the character played by Edward Furlong and I was lucky enough to meet men like the character played by Wilem Dafoe, guys who didn't want to rape me, guys who didn't want to kill me, guys who acted decently amidst all of the indecency.<br><br>Since my release from prison in 2003 I am invariably asked the two big questions when it comes to incarceration in this country: A) did I get raped? and B) is prison really like you see on OZ? <br><br>Well, luckily, I didn't get raped and I've never seen OZ but anyone who wants to see what prison is like should get a gander at ANIMAL FACTORY. The entire film drips with authenticity. Within 2 minutes I felt that old queasy feeling in my stomach--exactly as if I were back there myself, all over again.<br><br>For those of you out there who might think there is still a bit of rebellious glamour left in going to prison, watch ANIMAL FACTORY and take it from me: being locked up is not cool and its not fun and it is not something that anyone should aspire to.","user":"raegan_butcher","rank":[103,117]},{"title":"Underrated, but will be enjoyed by few...","rating":17,"date":"17 January 2001","review":"Whew. What can I say. This was a fascinating film that was very hard to turn away from (even to answer the phone!). Edward Furlong turns in another very solid performance as a too-young-to-be-in-this-type-of-place prisoner and Willem Dafoe was very interesting as his would-be mentor.<br><br>Prison films are always tough to make as they tend to lean heavily upon stereotypes (the prisoner who runs the prison, male rape scenes, the violence in the prison yard) and this film is no exception. Buscemi gets away with it by making it all seem so workaday and routine, which in some ways is even more frightening.<br><br>Overall I enjoyed this film but I imagine the audience for a stark prison flick is pretty small. Kudos to Buscemi for having the nerve to make it, tho.","user":"dougraham","rank":[27,33]},{"title":"Quietly powerful in small moments","rating":7,"date":"18 September 2017","review":"Steve Buscemi's first feature as director was Trees Lounge, an engaging drama about the bored, alcohol-drenched inhabitants of a small town, and their day-to-day interactions. For his second, Buscemi explores many of the same themes of aimlessness and having too much time on your hands, but changes the setting and tone entirely. Adapting Eddie Bunker's novel of the same name (the real- life ex-con also shares script writing duties with John Steppling), Animal Factory is about as unglamorous as prison drama gets. With a heightened sense of realism, violence and rape lurk at every turn, often happening so quickly that you barely have the chance to comprehend it. Buscemi and Bunker also find time to explore an engaging father-and-son relationship, albeit one taut with tension and distrust.<br><br>After receiving an incredibly harsh sentence for drug possession, young Ron Decker (Edward Furlong) is packed off to prison where his youthful looks quickly attracts unwanted attention. Proving himself to be completely ill-equipped to handle the danger he faces, he is taken in by the shaven-headed Earl Copen (Willem Dafoe), who teaches him the ropes and how to spot a threat. A man of little physical prowess, Earl has risen to a position of authority by using his background in law to improve the living and working standards of his fellow inmates. Surrounded by his gang of trusted bruisers (including Danny Trejo, Mark Boone Junior, and The Wire's Chris Bauer), Earl promises to protect the vulnerable Ron. Pondering Earl's true intentions, Ron at first keeps the smiling convict at arm's length, until a bond is formed that just may help the young offender to make it out alive.<br><br>By shaping the drama in the most unsensational way imaginable, Buscemi adds the necessary grit to Bunker's knowing words, with many of Bunker's novels taking inspiration from his own time in the slammer. Performances impress across the board, as you would expect from an ensemble taking direction from such a seasoned pro (who also appears). In particular, there are memorable roles for Mickey Rourke, playing Furlong's motor-mouthed, transvestite cell-mate, and, of all people, Tom Arnold, who is unnervingly convincing as a predatory rapist with his eye on Ron. But the film belongs to its two leads. Dafoe brings extra layers to his somewhat sensitive gang leader, and Furlong, one of many promising young actors who emerged in the 90s to disappear into the ether, is particularly effective as the protagonist. Changing his behaviour to suit his surroundings, we see the prison sculpt him into the type of career criminal the system's suppose to prevent. While the matter-of-fact approach prevents it from generating any real momentum - despite an attempted prison-break climax - Animal Factory is quietly powerful in small moments.","user":"tomgillespie2002","rank":[6,6]}]