[{"title":"Rollerball is one of the worst movies ever made.","rating":1,"date":"8 November 2005","review":"Johnathan Cross, a lover of extreme sports, is recruited to star in Rollerball. The players are on Rollerblades, trying to bring a heavy metal ball into a high goal. Also, there are motorcyclists around to bring momentum to the players. Oh yes, and there are no rules in the game. During his skyrocketing career, Johnathan has to experience what Alexi has found out: Blood brings more viewing pleasure to the audience. In a final game, Johnathan and his team have to fight for mere survival.<br><br>Back in 1975, James Caan brought us a brutal movie in which you can literally hear every bone in the players body break. Now, John McTieran has brought that film to us again, for a new generation. With stars like LL Cool J, Rebbeca Romijn and Chris Klein you would expect it to be a pretty bad remake, but this is not the case. Rollerball does the unthinkable and gives Psycho a running for it's money as the worst remake ever created by man.<br><br>Chris Klein in every film he has been in manages to make it look as if he has no range at all. His soft voice and good looks can only go so far, and in a movie where you need to beat the living hell out of another team member, you want someone that can at least yell and make a sound beyond a bird chirp. LL Cool J is only hear to bring the film a \"cool\" hip look, he's suppose to be the I don't give a damn, James Dean character, but it doesn't fly. Rebbeca Romijn, well, she has a nude scene, but when it's covered in the dark, you wonder why she is even in the movie to begin with.<br><br>Rollerball is suppose to be a bloody entertaining film, but McTeirnan at no point manages to show us anything entertaining. The entire game sequences seem uninspired and drawn out. When it goes for a shock, it misses and misses completely. I'm still wondering if LL Cool J's character is dead or alive, but apparently it's not important to the story. LL Cool J probably knew that this was going to be garbage and left the movie, leaving the film crew to make his character disappear. I don't blame him.<br><br>Not even the professional himself, Jean Reno save this film from the ultimate horrible experience that we all will endure from seeing this film. In a film about violence in sports, you would expect to see some, but when you have a PG-13 rating, you know that it was targeted to make money and nothing else.<br><br>I can't understand why someone would want to see this film, the final action sequence is yet another let-down in this horrible tripe. The only thing that this film has going for it, is it's 97 minute length, so if you do have the unfortunate experience of sitting through it, it will be over soon enough.","user":"Matt_Layden","rank":[43,51]},{"title":"John McTiernan's amateur hour.","rating":1,"date":"5 January 2007","review":"Original 'Rollerball' was a movie about dystopia future, where huge corporations ruled the world and there was no wars. But the blood lust of people had to be compensated, so there was this game called Rollerball, which was full of action, thrills and kills. But then one of the players was in the verge of becoming too big. He, Jonathe E. was a threat to the rule.<br><br>We can forget all about that with this remake of that 70's classic. There is no political metaphor, no philosophical questions about humanity, in fact there is no sense at all, if you don't count nonsense, about the movie. John McTiernan, director of such classics as 'The Predator' and 'Die Hard' has managed to make a movie, that is in one word, poor.<br><br>With some idiotic excuse the main protagonist Jonathan (at least the name is same), gets in the hazardous game of Rollerball with his pal Marcus (LL Cool J). Soon he notices, that there is something fishy about the game.<br><br>There isn't anything worthwhile to mention about the film. Tiernan directs like a man, who hasn't directed a single piece of film in his life. The plot is idiotic and the main baddies are pretty much camp material. The action is poorly choreographed and the editing tries so badly to be music video like, that it's flat out funny.<br><br>Can't really figure any reason for anyone to see this film.<br><br>Rating: 1 out of 10<br><br>Camp rating: 4 out of 10","user":"tomimt","rank":[12,13]},{"title":"Rollerball is a pointless remake and a terrible film","rating":2,"date":"17 May 2005","review":"Rollerball is a bad movie that pretty much fails on every level. It's the year 2005 and the new sport of Rollerball is very popular. Marcus Ridley {LL Cool J} recruits his friend Jonathan Cross {Chris Klein} into the very dangerous sport which may not be that luxury as it seems. One of the games promoters will do anything to get higher ratings even if that means death. I have seen the original and after watching this I wonder why they took a very good film and just ruined it. Rollerball is a poorly written movie that lacks suspense and good action. The film is just really ridiculous at times that its hard to take serious. The dialog is really lame and the characters aren't very developed . The acting is terrible with the worst probably being Chris Klein who doesn't have enough charisma to be a lead. LL Cool J was alright but he just doesn't seem to be trying. Rebecca Romijn-Stamos and Jean Reno both do a decent job but like LL Cool J, they just don't seem to really be trying. I can't blame them though as the writing is horrible and they are not given a lot of material to work with. The film is a lot more violent then the original, however, the action is still not very impressive. It also doesn't help matters that the studio got scared and went for the PG-13 rating and so the editing looks very bad. The film is about 95 minutes long but it drags on forever since its just a really boring film. The film is also confusing as some of the events that occur in the film don't really make a lot of sense. At some point during the film you will most likely stop caring. If you have seen the original then you will hate this movie. If you haven't seen it then you might like this but that's not very likely. Its just better to see the original. Rollerball is a loud and terrible film that's worth skipping and its also one of the worst films of 2002. Rating 2/10 avoid this film at all costs.","user":"christian123","rank":[61,80]}]