[{"title":"This Movie Is Great For Special Olympic Athletes!","rating":16,"date":"16 December 2005","review":"As Head of Delegation for a Special Olympic Texas team who has athletes featured in this movie, I have to take exception with the concept of assuming the athletes are being teased and made fun of in this movie. I spent most of 3 months on the set watching the filming 2 years ago and I know how very carefully Special Olympics International has watched the development of this movie. They have been involved in every aspect of this movie, from script development to final product. I also know how very careful Special Olympics is with putting their seal of approval on projects. They simply do not endorse ANYTHING, yet they are completely and 100% behind this movie.<br><br>I have seen the movie and can't wait to take every member of my team. Many of them have seen the movie and indeed are in it. At the premiere in Austin December 6 my athletes were howling with laughter and having a great time. While I will admit that Johnny Knoxville, the Farrelly Brothers and Special Olympics do not seem to make the best mix in the world, this works. And it is a beautiful movie. There are a few dirty words (like Forrest Gump) and a few tasteless jokes, but it is screamingly funny and has worlds of heart. The athletes are always, ALWAYS treated with the utmost respect. Unlike most movies about the mentally handicapped, there are major parts in this movie played by genuine special Olympic athletes, and they used some 200 special Olympic extra's. This was a labor of love, on both sides of the camera. It deserves to be viewed and respected. The producers had a vision of bringing to life and light the fact that mentally challenged people are well rounded and enjoyable people. They did it beautifully. Go see the movie and laugh with all your heart.","user":"margielord","rank":[218,265]},{"title":"Wow this movie is really underrated!","rating":8,"date":"3 January 2006","review":"A long time ago when I first saw the trailer for \"The Ringer\" my reaction to it was what the hell? Why would someone make a whole movie based on a \"South Park\" episode? Then the trailer for \"The Ringer\" disappeared for a while and then resurfaced completely re-edited. The new trailer for the film didn't really increase my interest in the film but out of curiosity (and the fact there really isn't much out I haven't seen) I decided to give the movie a chance and did so this afternoon.<br><br>\"The Ringer\" is about a guy named Steve (Johnny Knoxville) who has just gotten himself in a little bit of trouble and is in a bit of debt because he owes $25,000 to the local hospital. With no where else to go Steve turns to his uncle Gary (Brian Cox), who is also in debt because of a bad gambling problem. Gary soon comes up with the solution to both their problems, Gary wants to fix the Special Olympics and enter Steve as the special athlete in order to win the money to pay off both their debts. Funny and touching moments ensue <br><br>Wow!!!! That's all I can say when I walked out of the theater this afternoon! This movie is probably one of the most poorly marketed and underrated films ever. The movie from its marketing makes you feel ashamed to even want to see it because it looks like it's about making fun of people who are \"special\" but guess what? The movie doesn't give off that vibe at all. In fact, it makes you actually view the mentally challenged as normal people. The movie is never mean when it comes to dealing with that topic in fact it's almost uplifting and inspirational. Holy crap! Who the heck would think that would be possible from looking at the trailer or reading the plot outline? <br><br>\"The Ringer\" is one of these movies that received mediocre reviews which I don't understand. Roger Ebert of all critics actually admitted to liking this movie which means the movie has to be pretty darn good because he's a very harsh critic. I don't understand how anyone can hate this movie. While it does contain some of Hollywood's most typical scenes, the movie has a ton of heart, a decent amount of laughs, and overall good performances especially for a comedy. This is one of those hidden surprises that we rarely get from Hollywood. Also a little side note, this movie was made with the help of the real Special Olympics so it's nice to know there is some reality that helps fuel the film.<br><br>The acting all around is really good. Johnny Knoxville plays his character Jeffy perfectly. Katherine Heigl plays Lynn the adorable counselor in charge of watching over the special athletes and her and Knoxville both have nice on screen chemistry. The best characters though are the mentally challenged athletes themselves especially Glen (Jed Rees) and Thomas (Bill Chott). Everyone did a fine job in making the film's performances funny and believable.<br><br>The screenwriter Ricky Blitt is best known for writing several episodes of one of my favorite TV shows \"Family Guy.\" Who would have thought that someone who had such a creative mind to create crude and original jokes for an animated TV series would be able to create such a touching and funny script? Director Barry W. Blaustein did a good job capturing the heart felt moments and comedy. The whole \"When did we get ice cream\" scene was a classic among others. I think both guys did a good job with the film and I feel bad for both that this movie is doing better at the box office because this movie really does have potential.<br><br>In the end, \"The Ringer\" is a very enjoyable and unique comedy, one that makes you laugh with the characters and not at them. The writer and director as well as everyone involved make you look and think of mentally challenged people as normal people. When the movie tries to exhibit typical jokes like every time Steve falls down it fails as a comedy but when it's not trying so hard to be funny it really is and luckily that's the majority of the film. When you leave the theater after watching this film, you leave with a big smile on your face and almost feel a bit inspired. This film is sure to win the hearts of most and is truly a victim of bad marketing. I for one loved \"The Ringer\" and will be sure to buy it when it comes to DVD.<br><br>MovieManMenzel's final rating for \"The Ringer\" is an 8/10. Ignore the trailers and check it out!","user":"MovieManMenzel","rank":[70,85]},{"title":"Underneath, This Has A Sweet Tone To It","rating":9,"date":"22 March 2007","review":"A typical modern-day comedy so some of its crudeness with sexual innuendos or remarks, but overall this is a full notch or two above most because underneath it is a soft, good- hearted feel to it. It's also a nice vehicle for a positive image to be presented for mentally- challenged people (formerl called \"retards\"). Those guys are as much of stars in this film as actors Johnny Knoxville and Katherine Heigl. <br><br>Knoxville plays the main character, \"Steve Barker,\" a guy for (for good reasons, if that's possible) fakes being \"handicapped\" and enters The Special Olympics. He is hoping to win a big monetary prize to help pay for a friend's surgery and to help out his degenerate uncle who could be killed if he doesn't pay gamblers what he owes. Brian Cox plays \"Uncle Gary.\" Both the man who needs the surgery (\"Stavi,\" played by Luis Avalos) and Cox are hilarious in their roles, one being sympathetic and the other sleazy.<br><br>Along the way, Knoxville falls in love with Special Olympics worker \"Lynn Sheridan\" (Heigl). Hey, who wouldn't? This woman is unbelievably attractive and plays a good-hearted character.<br><br>Most of the funny lines in the movie are delivered by the Special Olympics athletes. Unrealistic? Yes, credibility is not high in that regard as as 99.9 percent of all the world's population would't be clever enough to deliver some of these lines but they are a hoot to hear. The fact you hear them uttered by \"mentally-challenged\" folks makes it even more outrageous and funny, of course. I can't remember how many times I just laughed out loud at something being said.<br><br>And, the film ends on a nigh note despite our hero being discovered as a fraud. The whole story is just a lot of a fun and is truly a feel-good film when it's all over. Highly recommended, but not for small kids because of the language.","user":"ccthemovieman-1","rank":[27,31]}]