[{"title":"Better than I expected","rating":5,"date":"8 June 2005","review":"As a part time comic geek and a full time movie geek I was surprised that anyone would green-light a film based on the old Marvel comic \"Man Thing.\" Obviously I had no expectations for this straight to DVD release when I saw it last week but all in all I was pleasantly surprised. Now don't get me wrong, \"Man Thing\" is by no definition the best comic book film ever made but it is at least true to it's origins unlike \"Batman Forever\" and \"Batman &amp; Robin.\" The basic story is pretty much a product of the \"plot wheel\" and you won't see any big name actors but if you treat it for what it is, a solid B-movie, there are worse ways to spend an hour and a half. The title creature looks as if the special effects and costume designers did their best to capture this little known character's appearance and movement. Not to say that this film doesn't have it's problems, bad annoying camera gimmicks and cartoonish supporting actors among them, however I don't believe that a reviewers job is to turn into a whinny nitpicker. If you really love the medium there aren't that many films that you can't find at least one good element in. \"Man Thing\" never stood a chance to be much more than a guilty pleasure but honestly you can't expect a first rate film adaptation of a third rate comic book. This is a film for B movie night and that's not necessarily a bad thing. Cut. Print.","user":"KolchaktheNightstalker","rank":[40,50]},{"title":"Based on the popular comic book of the same name from Marvel comics group.","rating":6,"date":"13 November 2009","review":"An Oil Company whose owner is an ambitious villain(Jack Thompson)is polluting the Bywater lands and the villagers are up in arms and a swamp thing is committing horrible murders. A new sheriff named Kyle(Matthew Le Nevez) arrives the little town. He is sent to the Bayou to investigate , helped by a deputy (Alex O'Loughlin) . There finds a beast, a plant with an animal's aggression power for survival and fury. Meanwhile the sheriff falls in love with a gorgeous elementary school teacher named Teri ( Rachael Taylor).<br><br>This exciting picture is packed by thrills, chills, gory killings and brief nudism in charge of Imogen Bailey. It's an unusual mix of monster movie and intrigue but definitely an enjoyable movie. From the producers- Avi Arad and Stan Lee- of Spiderman, Daredevil, X men, Blade and several others. Director Brett Leonard made this campy swamp romp adapted from the Marvel comic books of the same name. Director deliberately use comic-book style to keep us from taking anything too seriously. It's a co-production USA-Australia filmed in Sydney , New South Wales with good cinematography by Steve Arnold. Fans horror will love this movie about a monster part vegetable, part man . In similar style adapted from D.C. Comics were made in 1982 ¨The Swamp Thing¨ by Wes Craven with Louis Jourdan, Adrienne Barbeau and Ray Wise in which a chemical installation turns into walking vegetation monster. And its following : ¨Return of Swamp Thing¨(1989) by Jim Wynorski with Heather Lockleaar, Lous Jourdan and Sarah Douglas.","user":"ma-cortes","rank":[16,19]},{"title":"One of the better Sci-fi channel originals I've seen...","rating":6,"date":"23 June 2005","review":"Something evil is living in a swamp, something that kills all that enter its territory, the \"dark waters\". As more people are killed, the local town sheriff learns that a swamp-monster of Indian legend is responsible. Can he stop the creature before it can continue killing? \"Man-Thing\" has gotten primarily bad reviews here on IMDb, but I thought it wasnot terrible. Not great either, loaded with clichés, yes, but I've seen much worse films released courtesy of the Sci-fi channel. Any of you ever seen of \"Boa Vs. Python\"?!?!? There's plenty of stuff to like here. The swamp photography is beautiful. The shades of greens gave the film a very nice look, and the swamp is setting is effectively creepy. Director Brett Leonardwho you may remember as the guy behind 1992's \"Lawn Mower Man\"gives the film good atmosphere, and there were even a couple of creepy moments towards the finale. The monster was scary and looked very, very impressive, to say the least. There was some pretty weak CG used for its tentacles among other things but thankfully the creature itself is a good old-fashioned man-in-a-suit creation, and a darn good one at that. Kudos to the effects team on this memorable, nasty-looking beast. Oh, there's the abundant gore too, which is certainly a plus. I won't give away what happens in the film, but I will say gore fans will be very happy. I also liked Roger Mason's creepy, atmospheric score. <br><br>Problems begin with two things: The script and the actors. The screenplay offers lots of typical horror conventions: Throwaway monster victims, cheap pop scares, greedy and unrealistic bad guys, wise Indians who know about the monster, and so on. If you know the genre, you're probably familiar with this set-up by now, and it can be very tiring. The actors are mostly weak (Save for lead actor Matthew Le Nevez who wasn't bad), and those \"southern\" accents sure sound Australian if you ask me! <br><br>\"Man Thing\" is flawed and offers a familiar set-up, but if you can overlook that you'll be treated to a gory, creepy monster movie. Better than most made-for-TV horror films I've seen, and I've seen a lot.<br><br>6/10.","user":"willywants","rank":[24,32]}]