[{"title":"A surprise treat!","rating":7,"date":"7 September 2004","review":"When I was 32 years old, back in 2001 when this movie came out, I took my then 7 year old daughter to see this move. As a parent I often have to suffer through books my children read to me, music they like, and television shows &amp; movies that I have no desire to see. The previews made this movie look like the standard Disney channel fluff I occasionally have to endure. However, I found that I actually enjoyed this movie.<br><br>Garry Marshall basically redressed his PRETTY WOMAN storyline for kids. He even brought in Hector Elizondo, the hotel manager in PW, as the head security officer for the Queen of Genovia, who is played by Julie Andrews. The story also has aspects of the LITTLE LORD FAUNTLEROY novel in it.<br><br>The story is not all that original. A long lost heir to the throne of Genovia has been identified as a klutzy teenager who lives in San Francisco. The Queen of Genovia goes to San Francisco and attempts to persuade her to come back to Genovia and take her place as a princess of the realm. From their the typical hijinks ensue. The princess gets an education in proper royal behavior &amp; procedures. The Queen learns to loosen up and relax. Princess Mia also struggles between dating the school jock, who ignored her before she became famous and dating an unpopular guy who has been her friend for years.<br><br>The story is predictable and hold no real surprises. Despite this I still found myself enjoying the film. Julie Andrews did well in her role as the Queen and it was a treat to see her in another Disney film. I was surprised by how well Anne Hathaway did in her role as Princess Mia. She held her own against such performers as Andrews and Elizondo. This movie could have come off as cheezy but thanks to the director and skilled actors it proved to be a real treat. I remember back in 1990 when PW came out that girls thought it was so romantic that a hooker could find romance, true love and wealth. In my opinion PD is a much better role model. I'd rather have my little girl wishing she that she was heir to throne than a hooker who happens to find true love. <br><br>Anyway, thanks to my daughter I discovered a film that I really enjoyed It is also because of her that I just saw the sequel, PD-2. It was even better than PD.","user":"AbeStreet","rank":[48,51]},{"title":"Entertaining","rating":24,"date":"24 February 2004","review":"I will admit that when I first heard a Disney movie called \"The Princess Diaries\" was coming out, I thought it would be corny. But upon actually SEEING the film, I found (as is usually the case when stupid judgmental people make up their mind about films without watching them, I won't name names, you know who you are...Tom!) that it was in reality a charming, original, humorous and thoroughly entertaining family film.<br><br>The plot is fairy tale in nature: Mia is a social misfit with terrible hair and no self-confidence. Her only friends are eccentric activist Lilly and rock band headliner Michael (played by real-life rocket Robert Carmine of \"Rooney\") who has a little crush on her. Then, who of all people should turn up but Julie Andrews to tell Mia that her father (who she hasn't seen since she was tiny) was actually royalty and that she, Mia, was princess of a country no one's ever heard of. What it comes down to is this: She has until a big embassy ball to decide whether she wants to give up the crown (and basically open the country up to a hostile political takeover) or take her place as princess. After a makeover (at the hands of funnyman Larry Miller), some training and at least four horrendously traumatizing incidents, she decides...well, that would be giving it away, wouldn't it?<br><br>This is not a movie for little girls dressed in tutus who want to be princesses when they grow up. For the first time in the studio's tenure (I'd wager) this film depicts the responsibility of royalty. Mia tackles with the pressures of ruling a country. But for my money the best part of this movie is the love story. No, not Mia and the uniquely attractive rocker (although, that is great). A second, unscripted love story exists between Andrews and her chauffeur, Hector Elizondo. That's terrific.<br><br>It's about being yourself and bettering yourself. It's about knowing who your real friends are. It's about living up to your own expectations. It's about smushing an ice cream cone on the blouse of a bitchy cheerleader who deserves it. And maybe that sounds corny to all y'all (rustic expression) but I know a lot of adults who could use lessons like these.","user":"Bondorf39","rank":[63,69]},{"title":"Typically Disney","rating":6,"date":"13 July 2002","review":"A fun story - if entirely unoriginal - about an awkward and unpopular 15 year old San Francisco girl (Anne Hathaway) who discovers out of the blue that she is the heir to the throne of the small, fictional European principality of Genovia, and has to deal with all the adjustments that requires.<br><br>It's typically Disney-esque. There's nothing here that would cause you to blush even a little bit as you watch this with your 8 year old. The strongest language used is \"shut up\" - and it was quickly explained to the Queen that in America \"shut up\" doesn't necessarily mean \"be quiet;\" it might just mean \"wow!\"<br><br>There's a strong cast. Hathaway put on a very good performance in the lead role of Mia, moving from shy and awkward teenager, to sudden celebrity causing her to have to deal with being popular not for who she is but for what she is, to - finally - elegant princess. Julie Andrews was - well - Julie Andrews. She didn't miss a beat in her portrayal of Queen Clarisse, and Hector Elizondo handled the role of Joseph - Mia's driver and bodyguard - with great style.<br><br>It's a fun movie. Nothing heavy, nothing that will cause you to think too much. Just nice, light fun. It loses a few points for being entirely unoriginal (how many movies have used this theme?) but is still enjoyable to watch. 6/10","user":"sddavis63","rank":[27,31]}]