[{"title":"It isn't over yet.","rating":8,"date":"13 March 2010","review":"In 1979, N.Y.P.D. Officer Mickey McCardle (Played by the film's director, under the name of John Christian) caught the Mirror Man Killer, otherwise known as Mark Trax (John Weiner) and arrested him for several brutal murders, including that of his partner Brendan Sullivan. Trax was convicted and sentenced to a mental institution in upstate New York. Flash forward to 1989, where Trax escapes from the loony bin to resume where he left off and vows revenge against McCardle, who since then has now been promoted to detective, yet still haunted by the death of Sullivan. Trax leaves a brutal amount of blood on his trail, and not only that, his victims were killed brutally and were associated with heavy metal music. When Trax stages a car accident, the police declare Trax to be dead, but McCardle knows better. Now with no one else to turn to, except for a witness who saw Trax kill the owner of a grungy nightclub, McCardle must now stop Trax's violent reign himself. Will McCardle succeed? <br><br>Now this is the kind of film you won't find at your local video store, or even on Netflix. While I really enjoyed the film for what it was and found it to be somewhat intense in some parts, I think the film could have had a bit more gore than the ending of this film did. I was lucky to find a German DVD of the film on eBay for real cheap, as the film can, so far, be found only on DVD in Europe.<br><br>Recommended.<br><br>Grade: B+","user":"RTheManF89","rank":[5,6]},{"title":"A waste of my time and money","rating":1,"date":"15 May 2017","review":"I recently bought this movie because it's supposed to be a cult favorite, i love watching cult films and cheesy movies. Most of these movies are far more interesting than any of those brain dead mainstream movies for the masses which you get shoved down your throat, when i say far more interesting... it sure doesn't count for this one. Blue vengeance is a failed crime flick about a cop who chases a serial killer who's obsessed with a rock band, there's only a small amount of blood. One stupid gore gimmick at the end, which they placed on the DVD cover (the dutch shock DVD cover). The actors tried to make something out of it but failed, there's nothing entertaining about the movie. I watched the whole thing, and it's just sh*t. I appreciate funny bad trashy horror films or action movies, but this one's just plain bad. Not even in a good way. Forget about it.","user":"ronnievanrijswijk","rank":[6,13]},{"title":"good story, no budget","rating":3,"date":"19 March 2009","review":"There is a shop in the Netherlands were sometimes you can find weird flicks that are rare or OOP, I already catch me over there a DVD of Death Spa, supposed to be OOP. last time I found this rare one. It clocks in at 99 minutes, a real long time for an independent. Well, I can tell that it never is boring, the storyline is actually really nice, but if they should have a budget they could have worked it out better. The acting is convincing, the camera does his work like it should, lightning is okay editing too. But the only problem that this movie has is the lacking of blood and gore. Only the last minute has a bit of a gory shot, supposed all the money went that way. Anyway, I have seen worser. I didn't know that this is an OOP, strange that at the shop they have real copies of this one, or like Death Spa and the much searched Prison. Weird, really weird","user":"trashgang","rank":[6,14]}]