[{"title":"As far as I'm concerned, this may very well be the finest film on the subject of war - or conflict in general - that was ever made","rating":10,"date":"6 January 2014","review":"In the case of this movie, the Oscar was well deserved. The film was nominated in the wrong category, though ('Best Foreign Language Film'). It should have been up for 'Best Picture', 'Best Original Screenplay', 'Best Director - and it should have won all of those. As far as I'm concerned, this may very well be the finest film on the subject of war - or conflict in general - that was ever made. I've never seen anything similar; this film manages to show so many aspects of war, of human nature; it somehow manages to capture the essence of something that is inexplicable. Truly one of a kind and a must-see. And don't think for one second that this is some pretentious drivel or slow art-house fare - this is very much the opposite. 10 out of 10.<br><br>Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/<br><br>Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/<br><br>Favorite Low-Budget and B-Movies: http://www.imdb.com/list/ls054808375/<br><br>Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/","user":"gogoschka-1","rank":[71,86]},{"title":"not a light-hearted chick-flick, but beautiful in every single respect","rating":9,"date":"5 March 2005","review":"i hate it when reviews go over the plot in detail. some scenes are there just for the reason of creating ambiance, mood. they might build up a story for the next move by a certain character, etc.<br><br>This is why i despise the only review above.<br><br>The movie is not a romantic picture you'd take your date out on Feb 14. Well, neither Feb 15, 16, and so on.<br><br>On the other hand, it is not \"overdone\" as Saving Private Ryan. As usual in life, it's got some humor, some drama, some mediocrity, some insanity. I'm not much of a critic, just a normal person, but i totally believed and \"lived the movie\" with the actors. They played beautifully. All of them. All three were outstanding by my standards ( again, which might be low for a critic )<br><br>What i can comment on with more understanding is camera work. 10 out of 10. Nothing extra to distract you from the main line. Even drama is in small doses, not to lose you in your own feelings.<br><br>It is not entertainment. It is more of an art. Watch it. Alone. And reflect on it.","user":"ebelin-1","rank":[115,180]},{"title":"IMDb's movie of the day is worth tracking down (NO spoilers)","rating":10,"date":"11 November 2004","review":"I'm glad the IMDb featured this flick as its movie of the day, it is a great film and one which I think a lot of people passed over because it has... (shudder) sub-titles. : ) I am always aghast at some people's reactions to \"foreign films\" (in other words not Hollywood-produced), much less if it actually requires you to READ the dialogue. If you like war movies (and I am talking about those war movies which have you contemplate the brutality and morality of armed conflict, not those that glorify it... although those can be fun too) then you will... well perhaps \"enjoy\" is too strong a word as I found parts truly horrifying, not in a \"look at the gore\" way but in a \"man is a terrible beast\" way... so let's say \"captivate\" you with its intensity and what I felt to be an honest assessment of war and this conflict in particular. Greatly acted and a great idea behind the movie, this film gets 10/10 from me, though as I mentioned it is not the same 10/10 a LOTR or Star Wars gets, this movie is not a popcorn muncher but one that will get you thinking and keep you thinking long after the credits finish.","user":"Neil_MacLeod","rank":[101,160]}]