[{"title":"Splatter/Horror lacking coherence","rating":4,"date":"22 November 2002","review":"The directors cut version, which was the one I saw, was very long for this type of movie. Almost two hours is way too long. If you have the choice, definitely go for the non-directors cut.<br><br>The main plot is almost not taken up at all, the movie consists to the main part of several murder scenes, which are connected but the feeling is that they're only shown in order to fill the movie with splatterish violence. The connection is not revealed until the latter part and the lack of context bored me out long before I was there.<br><br>As a horror movie it doesn't work. You never get the required feel for the characters due to mediocre acting and the general disposition (character is presented, 15 minutes later character is dead). This pictures strong side lies in the splatter part.","user":"xxon","rank":[6,6]},{"title":"omg","rating":1,"date":"27 September 2007","review":"Check out the film's website, more time was put into making that than in the writing of the script for this movie. It couldn't be more off in it's boasting. Original story? Original? They must have found the script tucked away between the old testament, or face legal repercussion for that bit of horn-tooting. High-end special effects? Come on, I could do better with an Atari 7600 and a jug of earwax. Stylish cinematography? Oh yes, the America's funniest home video look is still a classic. I'm sure they had little money available for this title, so of course the sf aren't really that good, or a bit bad now and then, or just plain hilarious, but it's the story that makes this film a waste of time and money. 4 stories rolled into one and all of them brainless bits of seen-befores and done-already's.","user":"crossthebreeze3","rank":[14,19]},{"title":"I'm a huge Cradle of Filth fan and even I couldn't stand this movie","rating":1,"date":"15 June 2005","review":"Normally when I go on a raid of the local Hollywood Video I head towards the B-Horror movies. To me the basic principals behind a B-Horror movie is it's camp value, Heavy Gore, Lots of needless Nudity, and special effects that anyone can put together with a pack of corn syrup and latex. I rented Cradle of Fear strictly because I've been a fan of the band since they released they're first Demo in 1995. The movie started off on an interesting note and then when I saw Dani Filth stomp on an extremely obvious latex mask I LAUGHED. When I saw the Lesbian sex scene for the sake of a Lesbian sex scene I LAUGHED EVEN HARDER. I spent pretty much the entire movie laughing and when I wasn't laughing I was shaking my head thinking about how a multi-million dollar rock star would want to make a movie that seemed like it was on a budget of multi-hundreds of dollars. The whole point of this movie to me seemed to attract the \"Hardcore Goth kids who think death, destruction, sex, blood, and Satan are the greatest things invented since Lava Lamps. That was really it. To me this movie seemed like 80.5% of the things that happened in this movie just happened for the sake of being Satanic. This movie had a lot of potential and really could have been a real good movie but in the end this \"Movie\" really is just an extended Cradle of Filth Video.","user":"Replicant88","rank":[8,10]}]