[{"title":"silly material made worthwhile","rating":14,"date":"14 March 2002","review":"Good-natured and funny comedy has Bullock perfectly cast as an uptight, tomboyish federal agent who—for the first time in her entire life—decides to embrace her femininity after she's assigned to go undercover at a beauty pageant to try and apprehend an elusive criminal. She's never even worn a dress, much less makeup and accessories, and the results are hilarious as she tries to do her job and be a credible contestant as well. Film's setup and execution are predictable, yet kept afloat by a meaningful story, good lines, and big time laughs. Bullock is as appealing as she's ever been, and surrounded here by a first-rate supporting cast. ***","user":"Special-K88","rank":[49,54]},{"title":"Bullock makes this work.","rating":6,"date":"18 March 2010","review":"67/100. Okay, it is a stupid movie with a far fetched and ridiculous plot, and it's predictable. But for whatever reason, it is very entertaining. Sandra Bullock has such a winning and likable personality, she has this way of making the films she is in appear better than they actually are. She also has a gift for comedy and a screen presence that is undeniable. I can't think of any other actress that could pull off this role.<br><br>The characters in the film do develop well, and you actually begin to care about them. The performances aren't bad, Michael Caine is great and has a field day in his role. I thought it was a fun film, what can I say.","user":"jazza923","rank":[14,14]},{"title":"Good Quality comedy","rating":8,"date":"12 October 2003","review":"There are some actresses who produce weighty or worthy pieces of work and there are those who produce popular movies.  Sandra Bullock is an actress who falls into the latter category.  Yet, in this category, she is at the top of the tree and it is in films such as Miss Congeniality that she proves this.<br><br>For a fish out of water comedy, this is a film that plays to Bullock's qualities - her tomboy image from Speed, her warm humour and her ability to play for laughs and be deadpan.  As such, Bullock is allowed to shine from a castlist containing Michael Caine and Ben Bratt.  However, if I had one criticism, it would be that there are occasions when Caine just appears to be shamelessly mugging and camping it up for the camera to no real effect.<br><br>There are some genuinely funny moments, mostly centred around the pageant and it is nice to see such a movie which doesn't take itself or its setting too seriously.  Many of the contestants give good supporting performances and as such, it is hard to pick one out.<br><br>Overall, it is a bit slight but anyone renting/buying this movie would surely know what to expect - familiar, funny and essentially sweet-natured - just like Sandra Bullock herself.<br><br>8/10 - A good example of the genre.","user":"GJBStar","rank":[64,73]}]