[{"title":"Better with age","rating":9,"date":"6 March 2011","review":"I just thought that it was amusing reading the reviews all the way from 2001 to the present. This movie received almost entirely negative reviews when it first came out, but now there is nothing but positive reviews.<br><br>It seems that most people that saw this when it first came out were expecting something closer to Tommyboy or Blacksheep, with David Spade portraying a sarcastic sidekick with little more to offer than the occasional zinger. Instead we have a great tale of an average Joe that makes keeps a positive attitude even though he is constantly thrown into hilarious (for us) situations.<br><br>Whats the deal? It's a great film, maybe it was ahead of its time.","user":"theycallmebrandon","rank":[14,14]},{"title":"This movie is a garden...dig it!","rating":10,"date":"10 June 2003","review":"Joe Dirt is simply one of those underappreciated comedies. Having reacquainted myself with it recently (and repeatedly) after having not seen it in almost two years, I myself am beginning to realize that. Not only is it thoroughly funny, it is entertaining and fast paced. David Spade plays Joe Dirt, a kind, well meaning radio-station janitor with an unusual hairdo (mullet!) and extremely bad-luck. He shares his life-story with the listeners of the radio station, which mainly focuses around his never-ending search for his parents (who ditched him on a family trip to the Grand Canyon) and his unrecognized love for hometown hottie Brandy. Joe meets many unusual people along the way, has many misadventures, and as if you couldn't guess, sets himself up for many disgusting and painful situations. The humor is pretty low-brow, but who cares? The movie is funny and that's the bottom line. What I like about this movie is that I can just turn it on and let go. The movie is so well-made for a simple comedy. Spade wrote the script himself, and you can tell he took his time. Every event in the movie happens for a reason and alludes to something that will occur later down the road. Also, Joe Dirt is Spade's first likeable character. You actually feel for this doofus. Even though he looks like white-trash, he is still a good person. Which of course, leads to this movie's moral: Good things come to good people. Or as Joe would say \"Life's a garden, dig it!\" or \"You can't have 'no' in your heart!\" Christopher Walken has a hilarious bit as Dirt's co-janitor at an elementary school that has been placed in the witness protection program and Kid Rock plays Joe's bully perfectly (I love the part where he reads the note just like those guys in high school who couldn't read past 2nd grade reading level). But Spade is the real star here. Too bad this character/movie never took off. I seriously love this movie. It is consistently hilarious, has dozens of quoteable lines (stuff that you say to people in your daily routine) and has an overall feel good vibe to it. I don't know how anyone can trash this movie. For one thing, it's an Adam Sandler production, you know what type of humor you're in for. And secondly: The movie is called 'Joe Dirt!' There are no pretensions here, folks. I wish there were more movies like this out there. And although not everyone appreciates it, I am glad that I at least have this movie and can watch it a million times if I want to. Joe Dirt, you're my hero.<br><br>10/10","user":"Incubus_Reborn","rank":[57,65]},{"title":"Good for some laughs","rating":8,"date":"22 December 2001","review":"Before I saw this movie, I was turned off by all the negative reviews and the fact that it was a SNL spinoff. But I bought a used tape from my video store. Instead of war coverage and serious drama, this has become a ray of hope. Make no mistake, it ain't winning any Oscars. But the slapstick is funny, has great co-stars like Joe Don Baker and Chris Walken. It has a good plotline, a search for his family. It's a lot of laughs and fun for plebes at heart. Serious, deep people will be offended, but when we try to make humor serious and deep, we're in trouble.","user":"Jakealope","rank":[59,69]}]