[{"title":"Cate Blanchett is mesmerising!","rating":8,"date":"10 June 2002","review":"'The Gift' is an understated, underrated thriller which succeeds in captivating one's attentions from beginning to end. The film's main strengths are its screenplay, its beautiful mise-en-scene, a strong ensemble cast and a haunting soundtrack (those of you who enjoyed 'The Shipping News' will recognise the composer from the lilting score of that film)<br><br>\nBut perhaps 'The Gift's' main attribute is the presence of the wonderful Cate Blanchett. Although I loved the film, I was forced to wonder if in the hands of a less capable actress, whether it would have had the same captivating power. Somehow I think not. Cate Blanchett's restrained portrayal of Annie exudes compassion and tenderness, and is integral to the success of the film as a whole. Her sensitivity as an actress is important in relation to the subject matter - ESP and the occult - as these areas generally attract much scepticism. Blanchett, through her unique skill as an actress, manages to make the more fantastical elements of the story not only plausible, but intensely moving. She is luminous to watch, reminding me of the (also magnificent) Meryl Streep in terms of her quiet beauty, her range of expression and her adept skill at accent mimicry. Who could believe that she is Australian?<br><br>In short, 'The Gift' is well worth seeing, primarily for Cate Blanchett, but also for the supporting actors Keanu Reeves (very impressive and effective) Hilary Swank (underused) and the magnificent Giovanni Ribisi - who is both explosive and reticent as Buddy Cole. Also demanding attention is the imaginative screenplay, and the hauting beauty of the mise-en-scene which manages to be both beautiful and eerie at the same time. Overall, 'The Gift' is a resounding success, due mainly to the heart of the film - Cate Blanchett's resonant performance. The actress has a unique gift herself, which richly deserves to be seen by many.","user":"Jen_UK","rank":[105,115]},{"title":"Good and spooky.","rating":7,"date":"12 February 2001","review":"In The Gift, Cate Blanchett is blessed(or cursed?) with the ability to sense things that no ordinary person can see.  She is asked by the police to aid in the search of a missing person and what follows, is a journey into the supernatural.  Sam Raimi knows how to set up a scene for the maximum scare potential.  Honed on his Evil Dead series, Raimi lets a scene begin slowly and allows the viewer to sense the dread and feel the suspense build.  There are visual tricks, interesting camera techniques and the fine performances by a very talented cast that propel this story forward.  Among this cast that really stands out is Keanu Reeves. People have always complained that Reeves brings down a movie.  At least some of the people I know.  I prefer to think that Reeves is an underrated actor.  In the role of Donny Barksdale, Reeves brings a certain menace to his character that usually isn't scene in his other roles. Barksdale isn't a creature of the night, or a space alien, but a flesh and blood creature that is capable of true evil.  When you watch him, look at his eyes and you'll see a true menace lurking behind those dark brown eyes. Cate Blanchett shows that she can master just about any accent that's out there.  She sounds like she's a native of the south and she has a quiet courage about her.  Most notable when she's squaring off against Reeves.  <br><br>All in all, The Gift is a wonderfully atmospheric thriller.  It has brains and doesn't insult the viewers.  It will keep you hooked up until the very end, and there are quite a few surprises throughout the film.  Highly entertaining, and very spooky at times.","user":"bat-5","rank":[102,113]},{"title":"Cate Blanchett Displays Her Own \"Gifts\"","rating":9,"date":"9 September 2001","review":"In a small town deep in the South, a single mother endowed with a special ability becomes involved with the disappearance of a young woman and has a brush with the supernatural, in `The Gift,' directed by Sam Raimi.  Cate Blanchett stars as Annie Wilson, a young widow attempting to raise her three kids and provide a decent life for her family, scraping out a living on Social Security since the tragic death of her husband in a work related accident the previous year.  She supplements her meager income by doing `readings' for the local townsfolk, accepting their donations for the insights she offers them into their own lives.  Annie has a `gift,' the ability to see certain things in the cards that enables her to advise her clients about personal issues.  It's something she can't explain; she knows only that it's inherited (which she learned from her grandmother), and that it's real.  And though it's helped her maintain her home, she soon finds that it doesn't always make for the most pleasant of situations, as when she must advise a young woman, Valerie Barksdale (Hilary Swank), on how to cope with her abusive husband, Donnie (Keanu Reeves), or attempt to help a troubled young man, Buddy Cole (Giovanni Ribisi) come to terms with some sensitive aspects of his life.  Then, when a client comes to her to ask for help when his daughter disappears, not only does it take her to the dark side of the human experience, she discovers that certain individuals, including local sheriff Pearl Johnson (J.K. Simmons) do not believe that her `gift' is real.<br><br>Stylistically crafted and delivered, Raimi's film will keep you engrossed and on the edge of your seat until the very end.  He successfully blends reality with just a touch of the supernatural that makes for riveting suspense while keeping it within the realm of believability.  The relationship played out between Donnie and Valerie is anything but unique-- you've seen this before, many times in many films-- but within the context of this story it's fresh and it works.  The doubtful sheriff and the cynical, jaded defense attorney, Gerald Weems (Michael Jeter), are fairly stereotypical, but that can be easily overlooked in light of the overall story and especially due to the credibility of the Annie character, which is well developed and never presented as anything beyond what can be readily accepted as true to life.  As the central character, Annie anchors the film and enables the circumstances in which she is involved to be perceived as real; it's the strength of the film, and it's what makes it all work so well.<br><br>What also makes it work is the strong performance by Cate Blanchett, who makes Annie so real and accessible, displaying her `gift' with restraint and avoiding the possible pitfall of taking it too far over the edge, which could easily have made it suspect.  Instead, she brings a depth to the character that draws you into her world and allows you to empathize with her, which would have been impossible had she invested Annie with even a touch of the charlatan.  With consummate skill, Blanchett creates a well rounded character which demonstrates that as an actor, she definitely has a very real `gift' of her own.<br><br>Ribisi also does a memorable turn as Buddy, with a striking performance in which he creates some disturbing moments that are almost painful to watch; his is a character study of a soul in distress, seeking solace and resolution, and even as he attempts to sort out his life, you are able to sympathize with his plight as you share Buddy's experiences.  And it's through Buddy (as well as Annie, of course), that the audience is able to make that necessary and very real connection with the film.  With films like `Saving Private Ryan' and now this one, Ribisi is on his way to establishing himself as one of the premiere character actors in the business today.<br><br>Playing somewhat against type, Reeves proves that he can be a good `bad' guy, giving possibly one of his best performances ever as Donnie.  He very credibly conveys that sense of explosiveness lying just beneath the surface that makes his character menacing and dark, which in turn makes Donnie psychologically as well as physically threatening.  It's a good job by Reeves, who deserves credit for taking on a role that is so disagreeable and insensitive.<br><br>The supporting cast includes Greg Kinnear (Wayne), Katie Holmes (Jessica), Kim Dickens (Linda), Gary Cole (David) and Rosemary Harris (Annie's Granny). A taut thriller that is emotionally involving, `The Gift' delivers what it promises early on, which is exceptional, as many films of this nature often fail to actually follow through after a tremendous opening act.  Rest assured, this one does and has it all; suspense, credibility and some memorable moments, all courtesy of Raimi, a good story and a superb cast. And that's the magic of the movies.  I rate this one 9/10.","user":"jhclues","rank":[116,130]}]