[{"title":"A pleasant watch...","rating":7,"date":"17 January 2004","review":"This is Dreamworks' 2nd attempt at an animated movie based on a Biblical story (note the word \"based\"...plenty of artistic liberty is taken).  Though it can't hold a candle to \"Prince of Egypt\", it is a fair attempt and a pleasant movie to watch.<br><br>The animation doesn't seem to be top notch (or at least as well as Dreamworks demonstrated in PoE), but it was easy to get used to.  The songs were not particularly memorable (ie: I couldn't tell you more than a line of lyrics used), but I can't really complain because the music was very nice and the singing was good.  Not enough to blow me away, but a pleasant background to the story.<br><br>Perhaps what I liked best were the characters themselves.  After experiencing Andrew Lloyd Webber's take on the Joseph story, I was eager to see how someone would take it seriously.  I found that the movie made Joseph to be a rounded character.  I mean, he had character flaws!  Good for him! The brother's sudden change (well, I guess there were 20 years...) wasn't bothersome, and I thought Potiphar was particularly well done.  Asenath was a nice addition as well.<br><br>Overall, a nice way to get kids to enjoy the story.  A good execution of the story, which did make me care about the characters.  Okay animation and music.  7.5 out of 10.","user":"queeny479","rank":[24,24]},{"title":"Left me breathless","rating":15,"date":"15 December 2000","review":"Ever since I started hearing rumors about this on Prince of Egypt message boards last year, I was pretty much looking forward to seeing it - though in the early stages of this news, I didn't take it too seriously. However, it is no longer a rumor but is now for real. And I must say, it left me breathless. I will probably sound high saying this but anyway...it was a *beautiful* movie.  It made me laugh and cry.  It  was really emotional.  The songs really touched my heart, and now they are stuck to my mind!   Of course, that's not a problem and  I loved the way the dreams were presented, they reminded me of the paintings of Van Gogh and other expressionist paintings.   I also found a lot of things to be similar to PoE, especially those words before the start of the movie....but then I suppose I can understand that they made it like that since the two stories are related.   Yhe characters look like the ones in Prince, too. It really reminds me a lot about Prince, yet I find it difficult to say which one is better.<br><br>Love it and I will watch it again.  It is unforgettable. I really loved the scene when Joseph first enters Egypt, the city seemed sooo...majestic.  I was totally glued to it and the way they portrayed the characters really interesting too. They made them seem so real, especially the relationships between the family members and Joseph was...amazing and I admire his personality too.  If I were Jacob, I would be *swelling* with pride. Bwn Affleck did a superb job as him.<br><br>Indeed, I will see this movie again and again.","user":"BabyCarrot","rank":[12,14]},{"title":"Such a good film - I nearly rate it 9!","rating":8,"date":"2 June 2007","review":"Genre: Cartoon Bible story Musical<br><br>My thoughts: To admit the plain truth, I was a bit shy of watching this because we had watched the \"Prince Of Egypt\" by the same makers and DID NOT like it! We watched this just over a month ago and I really like it! Since then I've watched it about four or five times (including once yesterday) and I'm STILL not bored of it (I think my bro's a bit bored of it. He keeps saying this film is \"barking religious\" but then he thinks that about anything that's religious). I like this film because of the beautiful songs (I can't stop singing \"You know better than I\", but of course my bro's bored of it because he's changed it to \"I know better than you\" and he gets a good laugh. I'm more bored of that version than the original!), stunning animation, good characters and it does a good job on the bible story.<br><br>What it all adds up to: Beautiful songs + Stunning animation + A good job on the bible story + Memorable characters = The beautiful film that is \"Joseph: King Of Dreams. Enjoy! :)<br><br>What happens: Joseph is the first born of Rachel, which makes him a miracle child. In a way he is! He outshines his half-brothers and makes his father and mother happy. He even receives a beautiful, shining coat...","user":"Mightyzebra","rank":[9,10]}]