[{"title":"Believe it or not, this is a movie to think about!","rating":10,"date":"9 November 2001","review":"Surprisingly, this was an excellent movie and certainly one that extends beyond simply being in the action genre.  The 6th Day grapples with the ethics behind cloning and the broad spectrum of implications cloning could have on our everyday lives.  While yes, the movie near the end becomes pretty action-oriented, it is a very smart movie overall, and it certainly merits one's attention.<br><br>Don't let the concept of Schwarzenegger with guns make you think that this movie is brainless...you'll be grossly underestimating it.","user":"tyheyn","rank":[139,181]},{"title":"Remarkably good with a few flaws","rating":7,"date":"5 January 2011","review":"I was pleasantly surprised with how good the not very favorably reviewed 6th day was. It delivered in several ways:<br><br><ul><li>It has the expected action, stunts, effects.</li></ul><br><br><ul><li>It has the expected one-liners and humor.</li></ul><br><br><ul><li>Acting is generally perfectly adequate for the purpose. Rather, it must be pretty good when I never was disturbed by any bad acting.</li></ul><br><br><ul><li>It is nicely futuristic in a near-future fashion with many perfectly or partially believable ideas (and some that we don't quite believe in, but hey, if we accept hyperspace travel then we can accept this).</li></ul><br><br><ul><li>It has a message that actually keeps us thinking after leaving the movie. The cloning problem is considered from many points of view (not only as the bad guy's evil plan). How far can we heal, how far can we preserve life, when does it become an ethical problem, when will it clash with religion?</li></ul><br><br>That is quite impressive if you ask me.<br><br>However, sometimes it fails on two points: Predictability and suspense. Some scenes, especially involving the bad guy, are so embarrassingly predictable that it makes me wish they could have skipped some clichés just for once. And the movie misses great suspense opportunities on several occasions. I won't tell you how, who or when, but when a guy is assassinated, it should not happen just out of the blue, but we should be led into the situation slowly (for example from the assassin's point of view) so we get the chance to worry about it. That opportunity is missed at least twice, when the movie jumps straight into the kill, giving us momentary cheap shock instead of thrill. Compare it to the killing in, for example, Predator (one of the most excellent Arnold movies). Most kills by the Predator don't come out of the blue, we are warned, and it adds suspense and thrill.<br><br>Those flaws push the movie down from the top marks, but I still rank it pretty high for the points mentioned above. Quite entertaining and even interesting too, which makes it one of the better Arnold movies. Recommended!","user":"ingemar-4","rank":[26,32]},{"title":"Decent sci-fi flick with failed potential","rating":6,"date":"6 December 2000","review":"I recently had the pleasure of teaching the wonders of film criticism to an English composition class at Marietta College in Marietta, Ohio. The experience was enjoyable, and the class posed a number of questions. One of the more interesting questions concerned the films I had seen that I believed had potential, but ultimately failed in execution. While I have seen a number of films that fit into this category, I couldn't think of a decent example. This was because I hadn't seen \"The 6th Day\" yet. What could have been an interesting and exciting look at the evils of cloning was a \"B\" grade action film at best, despite an above-par script and one of Arnold Schwarzenegger's better roles to date.<br><br>The film's premise is heavily based in TRUE science fiction; that is, fiction having its basis in scientific truth, using projections of the future to fully examine some aspect of our society. Sorry to go into such an elaborate definition, but I believe a lot of stuff gets swept into the category of science fiction simply because it has a robot, or takes place in outer space. But I digress.<br><br>This fictional reality here deals with cloning. In the film, which takes place in the \"near future,\" cloning is an every-day practice, but only with pets and animals. Cloning people has been outlawed, as the original human cloning project went horribly wrong. Schwarzenegger plays Adam Gibson, a decent family man and helicopter pilot chartered to fly Michael Drucker (Tony Goldwyn), a rich businessman who owns Replacement Technologies. This corporation is at the height of cloning technology, running everything from a fish cloning company to help repopulate the oceans, to \"RePet,\" a company that clones dead family pets. There's even a rumor that the company's head doctor (Robert Duvall) is experimenting with illegal human cloning. Something goes terribly wrong on Drucker's first flight, and before he knows, Gibson discovers he has been cloned. Its up to him to discover the secret controversy, and get his life back.<br><br>With this premise, the film is wide open to make many social observations, and does so very well, on occasion. Much of the legalities concerning cloning, as well as the ethical concerns, are discussed and examined by the characters. Even though the technology exists in the future, it is not widely accepted. Some of these observations are stated with all the eloquence you could expect from an Arnold/action film, but others are done so subtly, and surprisingly, with biting humor. Much of the concept of \"RePet\" is quite amusing.<br><br>However, if science fiction is the film's basis, lame action sequences are its filler. In between these intriguing dialogues are shoddy, cookie-cutter action scenes one should expect from a made for TV film. No matter if it's a car chase, a laser gun shoot-out, or a helicopter battle, it all feels very dull. It's not that I'm knocking these things, because they have to appear in action film; I just wish they were done well. Ultimately, the action suffers from a lack of creativity, which ironically, is where the rest of the script excels.<br><br>And one can't blame Arnold for not trying, as he is both charming and believable in his part. His is a performance with a surprising level of humanity, especially in scenes where he's going about his daily life. One almost forgets he's an action star and begins to take him a little seriously. But don't worry, after the first half-hour he's picked up a laser gun and is fighting and one-lining his way to the climax.<br><br>\nI guess my one qualm with \"The 6th Day\" is its failed potential: with some better action sequences (like those found in \"The Matrix\"), this could have been a very decent film, one I would be sending you to right away. Instead, it's simply a wait-for-video flick, and by my guess, that wait won't be long.","user":"Tom Schulz","rank":[73,107]}]