[{"title":"A film about human choices, lusts, and consequences","rating":22,"date":"22 October 2004","review":"Adrian Lyne is fascinated by human sexuality and he presents it in a way that is adult but without being pornographic. Unfaithful tells the story of a perfectly normal and happy couple, Edward (Richard Gere) and Connie (Diane Lane). They look ideal: he is a very successful businessman, she is a wonderful and loving wife and mother to their young son, and they live in a beautiful home. Everything is perfect until one day Connie goes into the city to shop for her son's birthday party when a wind storm makes her bump into a handsome French librarian/book collector named Paul (Olivier Martinez). She is injured and unable to get a taxi, Paul helps her and when he was unable to get her into a taxi he offers her to come upstairs to his apartment to use a telephone and bandage up her injury. Connie is immediately attracted and fascinated by the handsome stranger, but nothing happens and she goes home but she cannot stop thinking about Paul. She goes back and finds him. In the second encounter with Paul nothing happens but she still cannot stop thinking about him and it seems very obvious to Paul that he is also attracted to her. In the third encounter, Paul and Connie have sex and it is the beginning of a tumultuous affair that will set a chain reaction of guilt, jealousy, obsession, heartbreak, and murder.<br><br>I love how Adrian Lyne (very much like he did in Fatal Attraction) adds the human drama of the family breaking apart because of an infidelity. Connie was not looking for an affair and her relationship with Paul was the result of an accident. We don't even question why Connie has an affair with this person. She did it out of impulse, out of lust, and for the pure excitement of how far she could take it until she realizes the effect it begins to have on her: she begins to obsess over Paul, she is hurting the man she truly loves, Edward, and she begins to see the toll it takes on her as a mother. After another encounter with her lover she is late to pick up her son from school who is waiting for her on the steps of the school. We see the slow fall the family begins to take and we are even touched at the little child's innocence and how he never ever picks up the signals that his parent's marriage is breaking apart. The performances by the actors are especially effective particularly by the two leads: Richard Gere and Diane Lane. Gere is heartbreaking in a role that plays opposite to the playboy image that made him famous as he plays the role of a man whose own world falls apart as he begins to suspect his wife's infidelity and his own humiliation begins to take a toll on him. He never even asks his wife if she is cheating but hires a private detective. The ending when he tells Connie that it was her that he hated and it was her that he wished would die...what a great Richard Gere moment! And of course there is Diane Lane: she was beautiful at 13 and she is beautiful today. She is magnificent in this role which was originally intended for actresses like Sharon Stone and Kim Basinger who were the original choices for the role of Connie. But one word describes Lane's performance: luminous. The classic Lane moment was the scene with her on the train on her way home after her first sexual encounter with Paul. A scene that was shot only once and Lane's expressions changes from giddy, guilty, shameful, embarrassed, and excited as she cries and laughs and giggles. All of these expressions flashing through in a matter of seconds all in one shot! The scene where she finds the pictures of her and her lover taken by the private detective; How she looks through them and waves of nausea, embarrassment, guilt, and absolute regret. The scene where she sits by the fireplace as she burns the pictures taken by the PI and she looks back and wishes that she had never gone up in the apartment and if she had just gone home. Lane doesn't make us hate her character but at the same time doesn't really allow us to condone Connie's actions. She rather shows the audience that Connie is only a HUMAN being and she is not perfect and she made a mistake and that she feels lust and also feels guilt. It is a touching and sexy performance. Even Olivier Martinez plays his role effectively. He is if anything an innocent. He didn't fall in love with Connie and he wasn't searching for anyone. He was simply fulfilling his own desires and hers and it aroused him, but his desires in the end made him the victim of a tragedy that didn't need to happen. He is also very sexy and very mysterious and what woman in the planet wouldn't lust after him! Unfaithful really plays itself out as a human story about lust and the consequences but it doesn't preach. It's message is that no one is perfect and everyone is only human and we respond to the basic human desires and needs but there is always a consequence for every decision or impulse made. An excellent film.","user":"bondgirl6781","rank":[77,85]},{"title":"The Ending","rating":8,"date":"11 May 2009","review":"I am writing seven years after the fact to express my bafflement over the thought that the ending, which to me was as straightforward as an arrow shot from a bow, could ever be mistaken as ambiguous.<br><br>'Unfaithful' is an old fashioned morality tale, that moves in one direction almost vector-style. It is about a woman who allows a passing fancy to become an obsession, and finds the obsession devouring her entire life.<br><br>Her husband ends up murdering her lover. He at first appears to have escaped consequences, but as the movie closes, it is apparent the crime will be discovered. At the end of the movie, the couple are talking in the car about love and their lives together - then the camera pans back to show they are outside a police station. To me, the thought that some have that they may run away, may not, is out of the question. The synopsis is dead wrong. This last dialog is not hopeful, but forlorn and anguished. All that they have had is irretrievably lost, due to the wife's foolishness and her husband's anger.<br><br>Some members of the audience forget that characters in a movie are supposed to behave realistically. The couple in Unfaithful are far too entrenched in their upper middle class lives to have any genuine chance of flight. That last dialog is intended to underscore how much has been lost, and what devastating consequences the affair has had. It is NOT a discussion of possible alternative. The moment after the picture ends, the husband is going to surrender himself to the police. He really has no other choice.<br><br>To me, this ending was sad, profound, and absolutely logical, the fitting end to a picture in which there had been a great deal of commentary on the risks of infidelity.","user":"fdbjr","rank":[25,27]},{"title":"not quite what I expected!","rating":8,"date":"12 May 2002","review":"First off, I was quite surprised to see the cinema so full for this movie, even on opening weekend. I guess not that many movies for women in their 30's plus exist these days!<br><br>I expected this movie, as I'm sure many people did, to be a Fatal Attraction but with the genders switched around.<br><br>I was pleasantly surprised and shocked by it NOT being what I expected, and I definitely enjoyed it alot more than Fatal Attraction.<br><br>The summary of this movie is that Diane Lane's character starts cheating on her husband (Richard Gere) with a beautiful French man(Olivier Martinez). Everything else should be left for surprise.<br><br>The pacing of this movie is perfect. We got a sense of Connie and Edward's home life before she met the dashing Paul. They have a darling son, Charlie, who adds alot of humour to the movie, but in a non precocious way. After the affair starts we see Connie's feelings range from excitement to complete disgust with herself. And of course Edward inevitably finds out. His reaction is interesting, to say the least, and perhaps very honest.<br><br>\nThe acting is great, especially from Diane Lane. The sex scenes are pretty raunchy, and made me uncomfortable at certain points, but it's interesting to see how different sex with the lover and sex with the husband were.<br><br>At the end of this movie I didn't feel cheated or robbed with some contrived ending (although others may argue differently). This film dealt with how being in an affair must feel, and how finding out you're being cheated on could make your react in uncharacteristic ways.<br><br>As a movie critic said, this movie will indeed make you never have an affair!","user":"whirligig","rank":[134,163]}]