[{"title":"Thank you Disney for once again f*cking your classics up the @$$","rating":1,"date":"14 September 2010","review":"Yeah it's as bad as it sounds. In fact it's worse. I think Walt is probably turning in his grave every time one of these things are made. This thing is just a pile of trash plain and simple. Everything that was great in the original got gang raped by the greedy sh*ts at Disney who make these sequels. The beautiful animation has been replaced by animation that looks like it is from the 80's. The characters now lack personality also. Then there is the unforgivable fact that they sugarcoat the hell out of this movie. No more religious taboos, sexual cravings, death, violence, or darkness. Now everything is about that thing love. Well Disney I'm here to say what works in most of your movies doesn't work in others. So you can take your love and shove where the sun don't shine. Colors used in this movie never get very dark. Its all bright, and happy colors which it shouldn't be. Then there is the absolute joke of villain. I mean really are we supposed to take this self-obsessed pansy as a replacement for Frollo. Let's see on one side we have stealing a bell, and on the other we have killing hundreds of people. Yeah I think we all know which is more badass. There is also no form of tension in this movie. Let's count what can go wrong in the events of both these movies.<br><br>1. Esmerlda could die <br><br>Quasimodo could die <br><br>Hundreds of people could die<br><br>Paris could be burnt to the ground <br><br>Frollo could continue to exterminate Gypsys<br><br>2. A bell could be stolen <br><br>A heart could be broken<br><br>See the difference. Also the voice actors really didn't push great performances here. They don't all really bring charisma and charm to these characters this time around. The animation I could go on for days about. How do you go from a film that still looks great by today's standards to something that doesn't even manage to surpass \"The Little Mermaid\" in animation despite being made over a decade later. I mean wow did they mess up with the animation. Overall this movie insults anybody who enjoyed the original. I hate this movie.<br><br>0 stars out of 4","user":"wwe7961","rank":[35,39]},{"title":"ok for a sequel **contains a few Spoilers**","rating":27,"date":"27 November 2002","review":"First of all, let me say that I absolutely LOVED The original Hunchback of Notre Dame.Epecially the music That being said, It hurts deeply to say that this was one of the worst Disney movies EVER. I'm rather sure that poor Walt is rolling in his grave over this atrosity<br><br>Problems- Esmerelda completly lost her vivacious personality. Pheobus is still an idiot. Quasimodo still has NO self esteem Zypher is more of a prop than a character. The character design was awfull! The music was totally pointless except to save viewers from the dull,weak dialouge for a few minutes. The villian was way too Narcystic(obsessed with himself) The plot (both romantic &amp; otherwise)is WEAK. Pheobus keeps dissing Esmerelda's type of people(gypsies, cicus workers, general nomads..)<br><br>I HAVE A FEW QUESTIONS: **What happened in the music department?The songs were horrid and very ill-timed.Much worse than in the original. **Why does Disney always turn great characters in to horrible,worrywart,annoying parents???<br><br>\nso , The Hunchback of Notre Dame II gets a 4/10 LATER, Angelbearq","user":"angelbearQ","rank":[9,9]},{"title":"Ask not for whom the bells of Notre Dame toll...they toll for this!","rating":26,"date":"26 January 2003","review":"A previous commentator remarked that this monstrosity of a DTV sequel could only be watched in chunks. I found it interesting that my experience with this movie involved blowing chunks.<br><br>I know that's an awfully immature way to describe my experience with Hunchback II, but that's exactly what this thing did to the original Hunchback. It took the very dark (for Disney, at least) original and removed everything from it that made it mature and compelling. The only thing to remain fairly untainted by this incarnation of the film was the one element that was out of place in the original...the gargoyles. They were right at home in this one. That's a bad sign...it's indicative of the overall decline in the film's maturity level.<br><br>The first film centered around our protagonists' struggle against Frollo, whose lust for power and for Esmerelda provided a conflict more psychological than would have been found in an average Disney movie. This centers around a guy who wants to steal a big, fancy bell from the bell-tower along with his lovely assistant (who happens to fall in love with Quasimodo along the way). That's it. And people say the first film would have sent Hugo spinning in his grave! The returning characters are not immune from this either. They were at least somewhat well rounded out in the first film, but they have become two-dimensional cardboard cut-outs of themselves.<br><br>In fact, pretty much every aspect of the film has become flat. The music has regressed from the choral chants which were so appropriate to the movie's setting and the songs which so perfectly fit the moods and characters in the film to more-or-less generic Disney movie music (if I remember correctly; I've tried to block several aspects of the movie from my memory). There's no use commenting on the \"artwork\"; it's the same DTV schlock that we've become used to seeing from Disney's TV animation unit. The difference between it and the artwork from the original is like the difference between a child's messy crayon drawing and finely-rendered computer animation.<br><br>\nSo, how to sum up? What can I say here that hasn't been said in previous reviews of this and other Disney DTV sequels? Ending with the plea for Disney to stop the insanity would be futile, seeing that sequels are in the works for \"Mulan\" and \"The Jungle Book\" (that one should break my will to live). I suppose it's just best to keep our eyes peeled for more of these imposters to the throne of what was once Disney quality. (Heck, these aren't imposters...they're not even trying to masquerade as quality films!)","user":"sngbrd39","rank":[23,29]}]