[{"title":"Irony for the wicked","rating":9,"date":"1 November 2001","review":"If you understand irony, this film should be a real riotous laugh straight through. It is possibly one of the most brilliant movies so far this millennium, outright disrespectful of the \"spy\" theme: Brosnan's degenerated, decadent b*****d spy Osnard is just the way one would picture James Bond in real life, had the latter not been so awfully loyal. Actually, Osnard is James Bond minus loyalty and with his self-confidence, decadence and sexism turned up a couple of notches. A brilliant character, brilliantly acted. Another fantastic actor is the amazing Geoffrey Rush in the role as the Tailor of Panama, Harry Pendel.<br><br>The story is absolutely fascinating, one of the most clever and witty stories to emerge in a long while - the Tailor of Panama reluctantly becomes a spy and conjures up non-existent government plots to sell the Panama Canal to the Chinese, which makes the English and the Americans (portrayed as a bunch of idiots with delusions of grandeur and as militaristic blow-hards with victory as the only goal) react aggressively.<br><br>It is important that one understands that this film is serious in one respect only: its comedy. Don't see this expecting to see a thrilling spy-movie. It isn't, though I find the scope of the film thrilling. It's more of a comedy, and if you can't see that when the American general with tears in his eyes blurts: \"There is a star missing from the American flag!\", then you're not really equipped for this kind of film. The reason I'm writing this is that some reviewers have found the movie to be silly... which is just what one would think if one didn't get it.<br><br>Brilliant. Just brilliant.","user":"Rammstein-2","rank":[120,135]},{"title":"An atmospheric, well-crafted thriller with actors having an infectiously good time.","rating":24,"date":"24 September 2002","review":"The Tailor of Panama is an atmospheric, well-crafted thriller in which the actors have an infectiously good time with their characters, especially an excellent and hilarious Pierce Brosnan as Andy Osnard, a roguish British spy who is sent to Panama (superbly described as \"Casablanca without heroes\") to keep out of trouble and get back his government's trust. However, even in post-Cold War diplomacy you have to play the game and earn your wage.  The diplomats still have to listen to their sources.  Osnard selects British ex-pat tailor Harry Pendel (Geoffrey Rush) to be his information source, using Pendel's hidden past to get his cooperation.  Pendel is well-placed as his wife works for the director of the Panama Canal Company, but he also has friends formerly in the anti-Noriega ranks.  Osnard passes on what Pendel tells him to his superiors. These two characters start to spin a web of exciting misinformation that they start to revel in, but this has consequences which escalate beyond their control. The background of Panama, from its \"laundromats\" (banks) to its seedy nightclubs, suits the characters and the story perfectly, and gives the film an atmospheric richness of the type director Boorman excels in.  It is a treat for those who love international political intrigue and who may have traveled or lived in such places. This is a thriller which relies not on hi-tech filmmaking gimmicks (and there are many opportunities to), but on characters interesting enough to follow all the way through the film.  It has an old-fashioned feel, and an wry and mischievous humor.  Some may see some implausibility in the final conseuences of Osnard's and Pendel's actions, but on the whole the shamless good time they have bring these (almost) anti-heroes to life is infectious. Great fun.","user":"RichShep","rank":[48,56]},{"title":"Exciting and Cynical, LeCarre at His Best","rating":8,"date":"2 April 2002","review":"There are no heroes or villains in \"The Tailor of Panama,\" only exploiters and victims.  Some may be turned off by the cynical tone of the film.  For example, Andy Osnard, the British secret agent, played by Pierce Brosnan (who else?) is a scheming sociopath, not a patriotic hero.  The title character, Harry Pendel, played by Geoffrey Rush, is a liar and an ex-convict.  Don't be put off by these flawed characters, though.  In the great tradition of John LeCarre's characters, these devious, selfish people are endlessly interesting -- and believable.  I suspect that those who did not like this film reacted as they did because of a lack of heroes and because the outcome of the machinations it depicts are sadly grotesque. Nevertheless, this is the thinking person's spy movie.  Highly recommended, 8 out of 10.","user":"gws-2","rank":[59,72]}]