[{"title":"Everything is a Test!!! That's a Good and Bad Thing.","rating":7,"date":"14 May 2007","review":"'The Recruit,' is an MIT whiz kid James Clayton (Colin Farrel). His recruiter is CIA guy Walter Burke (Al Pacino). He is the head guy at the CIA training centre, 'the farm,' which Clayton and fellow trainee/love interest Layla Moore (Bridget Moynahan) go through.<br><br>The movie is good enough to watch but is not entirely riveting. You see, we are told 'everything is a test!!!' and this lurks behind every plot turn that Clayton goes through. Are his problems for real? Or is it just another training test by Burke? If this sounds like tense stuff, it is and it isn't. Sometimes it will hook you in but other times it is just annoying - the feeling that he's not in any real danger but its all just a drill. Interest goes up and down until after the 'farm' training stuff. At this point, the story's focus gets much sharper and things become more consistently interesting, with a few cool twists. This is quite a fair way into the movie, though.<br><br>I love Pacino, and was quite interested in whether Farrell could match him after the promise he showed in 'Minority Report.' Well he does. In fact, everyone holds their own and the combined chemistry boosts the film. Pacino is steady throughout and doesn't do his unrestrained thing until the end (its still worth the wait!). Also, Moynahan is thankfully given more to do than just be the obligatory chick/eye-candy.<br><br>Overall, decent enough to give a whirl. It's better than most of the other spy / thriller stuff out there.","user":"he_who_leads","rank":[39,45]},{"title":"Cat and Mole","rating":6,"date":"28 May 2003","review":"In \"The Recruit\" a computer whiz (Farrell) is recruited to be trained as a CIA operative and ends up playing cat and mole inside the agency while keeping the audience wondering who's \"cat\" and who's \"mole\". The film is a slick shoot with a convoluted plot which tries to work the notion that in the spy game no one can trust anyone. Unfortunately the film is dumbed down, full of plot holes and obvious contrivances, doesn't work well in the human drama, and relies too much on techno-junk and gobbledygook computer hacking spy stuff. Though \"The Recruit\" isn't much of a movie given the talent behind it, it is busy and keeps you guessing all the way to the conclusion. An okay watch for Pacino fans and anyone in the mood for a lukewarm spy flick. (B-)","user":"=G=","rank":[83,111]},{"title":"Good enough","rating":6,"date":"10 November 2003","review":"'The Recruit' is good enough for a nice evening but that doesn't mean the movie is very good. It is about James Clayton (Colin Farrell) who is recruited by CIA spy Walter Burke (Al Pacino). On a place called The Farm he and others including the beautiful Layla (Bridget Moynahan) are trained to become CIA agents. They learn to kill and all the stuff you see James Bond and such do in other movies.<br><br>It is all very entertaining but not very believable. Entertaining because of Al Pacino who almost always is fun to watch and because of Colin Farrell. I liked him in 'Tigerland' and since then he has only done good. The real star in 'Minority Report', the best thing in 'Daredevil' and a great performance in 'Phone Booth', and now a good reason to watch 'The Recruit'.<br><br>'The Recruit' is entertaining, but one plot twist after another, most of them predictable; it is just a little too much.","user":"rbverhoef","rank":[75,110]}]