[{"title":"This is Under-rated!","rating":7,"date":"31 May 2007","review":"While this film is far from a masterpiece, Evolution deserves better ratings than it currently enjoys here at IMDb. The cast and crew contribute superior work, and the storyline is quite inventive. The premise has been done a few times before, however, it has never been done quite as well as the treatment it receives here.<br><br>Alien spores land here on Earth and begin to wreak havoc.<br><br>I found this highly entertaining, cleverly witty, with a slick production quality which tends to draw in the audience, who finds its members laughing, sometimes in spite of themselves. You won't WANT to like this. There is a large amount of juvenile humor, which usually would detract from a work such as this, but this is a sci-fi comedy that WORKS.<br><br>Again, it's no masterpiece, but it IS clever and fun, in spite of the sophomoric humor.<br><br>It rates a 7.3/10 from...<br><br>the Fiend :.","user":"Elswet","rank":[78,88]},{"title":"Loved the Creatures","rating":8,"date":"11 June 2004","review":"A lot has been said about what's good and bad in the movie. I won't revisit those comments. I thought the creatures were creative and hysterical.<br><br>Sure they weren't logical or realistic, but they were fun in a fantasy sort of sense. I enjoyed the watching the entire alien \"ecosystem\" evolve.<br><br>Fortunately, I'm the kind of person that understands a movie made to be predominantly a comedy doesn't require scientific accuracy, nor should the audience expect it. It was intentionally silly.<br><br>One last thing. I thought David Duchovny did a great job playing a character that had a wry, dry sense of humor. He wasn't exactly a straight man, but it was clear to me, he was laughing at the world.<br><br>Rating, I gave it 8/10 because it entertained me AND my wife, something many movies can't do.","user":"dreamseq","rank":[107,128]},{"title":"Surprisingly fun!","rating":7,"date":"10 June 2001","review":"I can't say I suspected much from the previews.  I anticipated another lame comedy and a cheap imitation of \"Men in Black.\"  \"Evolution\" can be compared to \"MIB\" in certain aspects, but it breaks new ground.<br><br>I can't give a really scientific review, because quite frankly I was too busy laughing to weigh out the pros and cons.  This is a great popcorn movie!  (Metaphorically speaking, I was eating nachos) There are scary moments involving slimy creatures, so chances are if there are any females with you--they will be clinging onto your arms.  <br><br>Ivan Reitman is the famed director of the \"Ghostbusters\" movies, and \"Evolution\" has much of the same charm and quirky sense of style and humor. David Duchovny (who really has a good sense of humor off-camera, but happens to get stuck with mostly serious roles) is terrific in a looser role that enables him to flaunt his knack for comedy.  Of course, Orlando Jones is the funniest in the bunch.  He has a terrific scene in which a bug crawls inside his skin and doctors have to get it out...rectally.  I have to say, that was the highlight of this offbeat comedy and had me on the floor!  Julianne Moore plays the clumsy assistant.  I can't say I found her role all that humorous.  Her pratfalls are pretty lame and predictable.  But that minor hint of cheap slapstick didn't ruin the overall experience. <br><br>\n\"Evolution\" is great fun from start to finish (a very interesting finish with an innovative product placement)!  Sure, it's all low-brow, but it works and the crude humor is tamed down to a tolerant level (Well, compared to the average contemporary comedy).  This is not a movie to be studied or analyzed or discussed for hours at a time.  Just sit back and HAVE SOME FUN!!!  Because chances are (considering previous 2001 releases) you won't be having this much fun at the movies in quite a while.  I could be wrong, but better to be safe than sorry.<br><br>My score:  7 (out of 10)","user":"mattymatt4ever","rank":[106,128]}]