[{"title":"At best  Tired. At worst  bigoted and offensive","rating":31,"date":"31 May 2003","review":"Earl Montgomery is a cop wannabe who can't get past the academy into the force.  Hank Rafferty is a real cop who is emotionally on edge having seen the murder of his partner by a gang raiding a warehouse.  When the two get involved in a minor roadside traffic stop, Earl claims Hank beat him and gets him thrown off the force.  Hank takes up a job as a security guard and sets out to find the gang that killed his partner.  He finds them in a warehouse protected by Earl (also now a security guard) and the two reluctantly team up to go after the gang.  However when they steal the gang's merchandise they find themselves hunted by both the gang and the cops.<br><br>Although I like to think of myself as having reasonably good taste  I do find Martin Lawrence funny.  I don't know why but many of his films just make me laugh even though I feel like I shouldn't !  However this film is the recent exception to that.  I saw the trailer and thought that it might be worth a stab  wrong!  The plot is a shambles of coincidence and plot holes  where there is a doubt they simply have a big gun fight.  There is no real tension to the plot as it is so very loose  even at the end you'll struggle to know much about the plot outside of the two central characters.<br><br>The action scenes make the A-Team look realistic and tense  they are simply tonnes of bullets flying everywhere before the bad guys are dispatched with one shot!  This sucks any excitement or tension out of them and only leaves you with lots of noise that just feels pointless in the extreme.  In that way they reflect the wider plot I guess.  Sadly though, the poor action and poor plot is by no means the worst part of this film.<br><br>Easily the worst part of this film is the fact that 99% of the `jokes' are based on race  in particular Martin Lawrence's comments which are either a) laments on the victimisation of his race or b) reverse-racism remarks that border on the offensive and would certainly never be allowed to pass if the lines had been given to his white co-star.  The victimisation things are simply not funny and merely make the lead look like he has an enormous chip on his shoulder about his colour  maybe 2 or 3 remarks along these lines would have worked but to have nearly every line based on this is simply overkill and it quickly gets tiresome.  Other remarks I simply found offensive  I'm sorry, I know this is meant to be a comedy but I found them bigoted in the extreme.  What makes it worse is the fact that the film plays Earl as a hero and never shows him to change his way or his opinion  hence it validates what he says.  For example to have a character state that he is against interracial relationships between white men and black women (and never take it back) is simply offensive  as I (a white man) sat with my wife of Nigerian-descent I felt very uncomfortable that anyone would allow such insulting dialogue to be part of a film.  Even if you think I am making a big deal out of nothing  just imagine this whole film if even half of Earl's dialogue had been said by Hank  there would simply have been an outcry!<br><br>To make the offensive material worse  it is rarely funny.  I don't know what Lawrence is up to.  This summer he has the chance to kick start his big league career again in Bad Boys 2 where he'll get help from Smith and Union  but this is a huge leap back  pandering to an audience that may find it funny because they too have a chip on their shoulder about race.  I usually find his mugging and saying `yo ass' or `and sh*t' after every sentence funny but here the chip on his character should simply obliterates everything else.  Zahn is poor  I have not seen him in a strong role but this must be a step backwards even by his standards  he suffers at the hands of racist remarks and comes off badly  even his relationship with Denise is played for laughs as the writers expected the audience to find it a joke that Hank could land with a `fine sista' like that, it even goes so far as to have Denise admire Earl's penis!!  In fairness Robinne Lee (Denise) is gorgeous and it is good to see her in something again after only seeing her in Hav Plenty. God knows why Eric Roberts is in it  he has nothing to do and his wig just looked stupid, likewise Bill Duke is only there for the dirty looks.<br><br>Overall I enjoy Lawrence comedies even though many are silly.  Here the jokes are nearly all based on race or reverse-racism and after the first 3 time they get increasingly unfunny and tired.  At best this film is lame and barely amusing, at worst it is simply bigoted (regardless of what colour the character is  bigotry is bigotry) and will be offensive to anyone who tries to get past the issues of race and racism in their daily lives.","user":"bob the moo","rank":[29,40]},{"title":"Funny little comedy;Roberts should have got a bigger role","rating":6,"date":"12 December 2007","review":"I enjoyed this little comedy much more than I expected; my main reason for seeing it was Roberts. Anyway, the film works in an unpretentious way. It amused meme and the person that I was watching the comedy withas a film that found its tone and channel. It is very fastpaced, and quite likable. It's very physical, goodnatured and enjoyable; as a matter of fact, it is a humorous crime drama, a humorous cop film (about corrupt cops, etc.).<br><br>There are some very noticeable beautiful girls (\"Lola\" and Zahn's exgirlfriend).Mari Morrow and Robinne Lee.<br><br>Needless to say that my original reason for watching itRobertshas a role so small that they could use anybody else. But maybe Roberts was cheaper than anybody else?<br><br>Some perceived this flick as ...racist.I see it as politically incorrect,in a cheap but funny way--which is good.","user":"Cristi_Ciopron","rank":[10,12]},{"title":"What the problem is?","rating":7,"date":"17 October 2005","review":"I usually don't like Martin Lawrence and I find his anti-white humor to be quite offensive as well as his string of bad movies. But compared to his other movie of 2003 (that would be the shockingly awful Bad Boys II), National Security is a rather easy-going and light-hearted cop comedy flick with quite a few good laughs. A lot of them, surprisingly, coming from Lawrence himself.<br><br>Hank Rafferty (Steve Zahn)is a cop who is unfairly thrown in jail for apparently beating a black suspect (Lawrence) who just got kicked out of Police Academy. With his career in tatters he emerges from the slammer with only one job opportunity available; a lowly guard for a lowly security company. Determined to follow up on the big case he was involved with before serving time, he crosses the path of fellow security guard Earl Montgomery (Lawrence again) and the two reignite their old conflict.<br><br>The old love/hate buddy thing may be old and the plot may be silly but it's a great excuse for loads of action set-pieces and humor. The potentially dangerous comedy of black vs white never becomes offensive and is handled with such lightness that it never becomes an issue. Both men have their failings and bonuses and are as equal as each other. You really do feel a great partnership between them despite their arguing and fights.<br><br>Give National Security a try. It's slick and fast-moving and is a helluva lot better than Bad Boys II. You'll probably be surprised at how funny Martin Lawrence is. I was.<br><br>The DVD is in great looking 1.85:1 widescreen with pretty good Dolby 5.1 sound. The scenes where Lawrence uses his automatic pistol really pack a heavy punch in the .1 LFE channel. The usual deleted scenes and commentary are included on the DVD but I was surprised the extended ending wasn't included in the film. It would have been better with it.","user":"CuriosityKilledShawn","rank":[30,44]}]