[{"title":"The Western is Alive and Well","rating":8,"date":"25 March 2002","review":"I just caught the DVD version of \"Crossfire Trail\" and enjoyed it immensely. It is a western of the old school full of action, romance slimy villains and hard ridin'.<br><br> Tom Selleck stars as Rafe Covington who has made a promise to a dying friend to look after his ranch and his wife (Virginia Madsen) after he is gone. Along with his two pals (David O'Hara, Christian Kane), Covington sets up shop on said ranch. Joining the trio is crusty old Wilford Brimley (barely recognizable) as a former ranch hand. Unfortunately, villain Mark Harmon also has designs on the aforementioned ranch and widow. When Selleck proves to be a formidable opponent, Harmon brings in gunfighter Brad Johnson to settle things which of course, leads to the inevitable showdown.<br><br> The scenery, shot in western Canada, is beautiful and unspoiled. The town (looking suspiciously like the one in \"Unforgiven\"(1992) looks like a real dusty western town and the costumes and make-up have been  created authenticly as well. The acting is good all round and the action scenes are as exciting and well staged as any I've seen.<br><br> Barry Corbin as the town's drunken sheriff and William Sanderson as the bartender are excellent in featured roles.<br><br> \"Crossfire Trail\" is a western lovers delight. They don't make 'em like this anymore.","user":"bsmith5552","rank":[46,48]},{"title":"The Western","rating":8,"date":"12 December 2001","review":"The Western is a dying genre and it never ceases to amaze me that it is so. It is being displaced by the cops 'n robbers, grisly hero shoot'em-ups and a variety of other overly violent superhero vehicles.  As a kid, I grew up on Westerns and could not get enough of them.  The bad guys always wore black hats and the hero, like Roy Rogers, Gene Autry and others always wore the white hats coming to the rescue of the ladies at the last moment.  Villains were slime-suckers and deserved all they got.  I mean, who could even feel a twinge of regret when Joel McCrea shot Brian Donlevy in the Virginian after he engineered Sonny Tufts getting hung?  Well, this film loosely based on a Louis L'Amour story takes us back to a time when heros were just that: bigger than life figures that placed honor, decency and the love of their horses above the petty greed and avarice of the weaker villains.  Selleck is outstanding in this role as Rafe Covington who comes to \"take care of\" the widow of a friend (whom we later learn he knew but a short time).  What commitment!  Now, we get some growls here from the peanut gallery from some who fail to understand the archetype the Western Hero is based on and even one faithful Louis L'Amour fan who cries foul at the departures from the original.  OK.  We can let that go.  Someone observes that Selleck leaving his Magnum PI role is a \"natural\" for Westerns.  I second that!  He does. His pals, veteran character actor Wilfred Brimley, Kane and O'Hara add texture to the hero role while the villains are outright scumbags, especially usual good-guy Mark Harmon and refugee from the rapture, Brad Johnson (glad he made it out of the apocalypse).  These baddies are REAL bad. Cheap made-for-TV has-been Western flick?  No way, José.  This is FINE entertainment and I wish they had a lot more of it.","user":"artzau","rank":[36,38]},{"title":"Summarises all that is good in a Western.","rating":11,"date":"11 March 2003","review":"As an enthusiastic 'Western watcher' for over sixty years, I think that this one stands comparison with some of the great ones. Good acting by a strong cast, attention to detail and authenticity and the superb photography (ably enhanced by the scenery !!) make this a 'must-see '<br><br>Yes, the story isn't exactly original, but so what ? Tom Selleck fits the scene like a character from a Remington painting and what superbly crafted gems of villainy are portrayed without resort to excessive brutality or foul language.  This how they should be made.","user":"JAYLBEE","rank":[26,27]}]