[{"title":"Anything But Basic...","rating":16,"date":"16 July 2003","review":"\"Basic\" takes a lot of plot twists through the steamy jungles of Panama. They are often impossible to follow. No, literally. Impossible. As in they literally do not piece together. You can try to analyze them, but when you do, you find out there is nothing really to be analyzed. But the film, by confusing and tricking the audience, makes it appear as if something is there, which is almost as good as if something really is there. Therefore, the movie, though frustratingly difficult to follow at times, is entertaining. Confused yet? Yeah, that's what the movie will make you feel like.<br><br> The film opens up in a rain-drenched Panama jungle at night on an Army training mission headed by Sergeant West (Samuel L. Jackson). Most of the film--ALL of the film, for that matter--takes place at night, during a rainy hurricane, and adds to the nonexistant plot. What is so intriguing is that the plot isn't really there, but the writer tries to manifest one, and we feel as if we are staring at some nonexistant, material wad of words and flashbacks and images thrown together in a blender, the writer hoping for it to come out smelling of roses. But I already went over that, didn't I?<br><br> Flash forward to the next day. An Army chopper picks up two men from the training mission, one injured and one very much alive. The injured man, Kendall (Giovanni Ribisi), is sent to a hospital, and the alive man, Dunbar (Brian Van Holt) is sent in for questioning by the very sexy and very Southern Osborne (Connie Nielsen). Dunbar refuses to speak to anyone except a Ranger. So in comes Ranger Tom Hardy (John Travolta) to piece together the events surrounding the death of Sgt. West and his team.<br><br> The writer of \"Basic,\" James Vanderbilt, has so many twists and turns that the film is impossible to keep up with. I like movies like these, where you see different characters telling their version of one event, but the mistake Vanderbilt makes is that he overuses the plot flashbacks in the middle of other events. It becomes hard to seperate present from past and what's real from what's not. So many revelations happen that I feel like I'm in the middle of the writer's mind, as he comes up with new ideas and tries to squeeze them in time after time after time. There is a limit to how many times you can use \"surprise\" revelation endings. Vanderbilt uses three of four in a row, piled on top of each other, time after time after time. Just as we think the plot twists are done, and we start to smile because we think we might finally understand the basis of the plot, something else happens, and we zoom in suspensefully on John Travolta's face as he, along with the audience, realizes something. Which leads me to something else.<br><br> The end of the film leaves more open than concluded. So many plot holes are never ironed out. With the ending being the way it is, you can look back at certain events and think, \"Why did that surprise (so-and-so),\" and \"Why did that event happen as it pays no relevancy to the plot?\" The answer to all this? Simple: It's called audience manipulation, and James Vanderbilt uses it a lot. He throws the audience a bone to keep them happy, continues with something else, throws another bone, and when it's all done and over, we're choking on all these bones and he doesn't realize it. Interesting how he said he named his character Tom Hardy after the Hardy Boys. If I recall, the Hardy Boy novels, which I was an avid reader of at one time, usually revealed a lot at the end. \"Basic\" tries to, but does not.<br><br> The film has an excellent director at its helm, John McTiernan. A man who chooses his projects carefully and wisely and, unfortunately, sometimes horribly (\"Rollerball\" was exceptionally bad). But \"Die Hard\" and \"Predator\" are two of my all-time favorite action films, \"Predator\" being my all-time favorite \"alien\" movie. Who wants McTiernan to return to his roots and film a \"Predator 3\"? It would be good, but don't count on it. Like I said, he chooses wisely, and if I assume correctly, he's the kind of director who doesn't like to return to old projects.<br><br> \"Basic\" confused me, but after the film was over and my mind was in a knot trying to figure out all the different plot twists, I realized how much fun I had being duped by this film. I laughed to myself as I came to realize that this movie has a paper-thin plot, and the filmmakers all tricked us by taking so many twists and turns and throwing so many confusion bones at the audience and making us believe that the underlying plot of the film was something deep. I really enjoyed this movie, even if I still don't really understand it fully. Then again, I don't think you're really supposed to.<br><br> 3.5/5 stars -","user":"MovieAddict2016","rank":[119,152]},{"title":"Fascinating mystery with fine performances!","rating":10,"date":"20 December 2003","review":"Man, I can't believe I almost overlooked this because the major film critics panned it. Basic is seriously good and the kind of mystery/suspense story I don't see anywhere near enough of. I enjoyed every minute of this movie. I couldn't figure it out and was surprised at the end. For me, it doesn't get much better in the entertainment department than a movie like Basic. John Travolta does what John Travolta does best, playing a wise guy better than anyone, and Connie Nielsen delivers a great little performance and she's hot to boot. This movie has an amazing number of plot twists and the pacing is quick so try to keep up with it. I loved it!","user":"yossarian100","rank":[73,98]},{"title":"Mixed feelings about a confusing premise...","rating":29,"date":"29 June 2016","review":"I saw this movie back in 2004 and I liked it (or so I thought).<br><br>After a few years I had the opportunity to watch it again. The strange thing was, although I remembered how it ends, I couldn't find a logical path of what happens in the movie and what was true and what wasn't.<br><br>Today (June of 2016), after I watched Connie Nielsen in another movie, I remembered the existence of \"Basic\" (and how she looked good with her short blond hair and the uniform) and I sought it to watch it, but again, although I remembered the last couple of scenes and the resolution of the film, I still couldn't remembered how the plot evolves. <br><br>What I'm saying is that the movie is incoherent and the narrative is (purposely I guess, to give a sense of continuous twists) confusing. I also find it less satisfying in todays standards despite the obvious chemistry between John Travolta and Connie Nielsen.<br><br>To realize how confusing the plot is, take a look at the contents in Wikipedia. Usually in a movie, there is a \"Plot\" section with a summary or a more detailed description of the plot. Here you have ...subsections of the plot as follows:<br><br>1.1 Dunbar's story<br><br>1.2 Kendall's story<br><br>1.3 Dunbar's second story<br><br>1.4 Kendall's second story<br><br>1.5 Pike's final explanation<br><br>1.6 Final twist and explanation<br><br>I don't recall any other movie to have such a structure in its topic in Wikipedia!!<br><br>The thing is you are trying to follow what is happening (especially in the first viewing) and you even might have a suspicion about who the actual bad guy is, but the convulsive script combined with John McTiernan's erratic direction, have as a result a movie that is ultimately confusing.<br><br>If you see it superficially you will probably enjoy it. Travolta's character has an attitude of a \"know-it-all\" maverick investigator, Connie Nielsen looks really good, and the end is designed to think of it as rewarding and satisfying.<br><br>But if you look more closely and give it a second thought you will see clearly that this movie is more like a disappointment.<br><br>**P.S.: The atmosphere and the theme of the movie, plus the similar lead role of Travolta, but with Madeleine Stowe instead of Connie Nielsen, reminded me of The General's Daughter (1999). A better movie if you ask me.","user":"Dr_Sagan","rank":[17,20]}]