[{"title":"This story is unfortunately close to reality.","rating":8,"date":"23 January 2019","review":"In part, this movie rings true.<br><br>I am a Corrections MP. I have served under a few officers like this Commander. Usually they get weeded out by the time they make LTC. But, some get through.<br><br>It is very difficult to Maintain a professional position when you have a friend or someone you respect comes in as a confinee in your facility.\nHowever, being firm but fair is not only a motto, it is a way to always conduct yourself.<br><br>The Commander should have been removed and proper order restored and conducted.<br><br>It was a good movie. I did enjoy it","user":"langley-80203","rank":[7,7]},{"title":"Redford has the ability to fade","rating":8,"date":"20 August 2005","review":"Redford's ability to fade into a character is profound. Sometimes an actor who has been in the business a very long time will become larger than any role he plays... John Wayne for example (with a couple of exceptions). He becomes Eugene Irwin in this movie. This movie isn't about Redford's character, just like \"The Legend of Bagger Vance\" isn't really about Bagger Vance. The Last Castle is about honor to one's self and honor among soldiers, even if they are prisoners. James Gandolfini's portrayal of a colonel who knows nothing of this honor or brotherhood is excellent. He makes you despise his character. Colonel Winters is a deeply disturbing study of corrupt power and jealousy of others' glory. A fine ensemble cast of characters make this movie well worth watching.","user":"bamabryant","rank":[92,134]},{"title":"under rated","rating":10,"date":"10 July 2002","review":"This was probably one of the most under rated movies of 2001. I didn't have many expectations for it either. I am not a Robert Redford fan and I was not familiar with the work of James Gandolfini, but because I am an action fan and the trailer made this out to look like a not to bad action movie I decided to pick it up. The problem with most action movies that run over two hours is that they usually become boring and bogged down with confusing plot twists that ruin the entertainment value. But this movie never once became boring, my eyes were glued to the screen the whole time. Redford and Gandolfini lit up the screen with red hot performances that kept you at the edge of your seat. This movie has everything you could ask for in an action movie, strong performances, strong script, beautifuly directed action sequences and dare I say it, a few touching moments. Redford plays a war hero who is sent to a prision for war verterians. He then plans an uprising against the corrupt prision guard. Your heart will instantly go out to a shy inmate who was accused of beating someone to death with a hammer. The film also has some of the most mouth dropping action scenes that I've seen in a long time. I couldn't believe what I was seeing. So whether you are a fan of prision movies like The Shawshank Redemption or Fortress or a hardened action fan this movie will not dissapoint. I rank this film as one of the best of 2001 along side Made.","user":"casey_choas66","rank":[38,54]}]