[{"title":"Loud, crass, pointless - an insult to the viewer","rating":1,"date":"26 October 2002","review":"What can I say? If I've seen a film worse than this, it certainly doesn't spring to mind right now. I managed to get to the first screening in the local area and, even though the audience was fairly small, I still counted eleven people who walked out at various points in the movie and never came back. Now either Michael Myers slashed them up on their way to the lavatories or, like me, they were bored stiff by this absolute CLUNKER of a flick.<br><br>The plot, or what little semblance there is of one, is simple yet completely ludicrous. An organisation called Dangertainment, headed by the entrepreneurial Freddie Harris (Busta Rhymes), gets together a group of six students (!) to spend the night in serial killer Michael Myers' childhood home, in the hope that they will \"find clues\" as to what drove Myers to kill and kill again. Quite why, 25 years on from the murders, they think they will achieve anything by sending a group of teenagers into a house that, in the real world, would probably have long been demolished, is beyond me. Surely it is the job of police psychologists to dissect the minds of serial killers anyway? The film conveniently forgets the previous five sequels (with the exception of \"H20\"; this gets an irrelevant reference in the gratuitous opening scenes which serve merely as an excuse to waste Jamie Lee Curtis' talents in some customary 'running around' antics) and throws us almost immediately into the environment of the house, where each of the six kids are given a little handy-cam to strap to their heads and told to go searching for clues... You with me so far? Well, that's pretty much all there is to it. Needless to say, Myers himself shows up at the house about 10 minutes into the movie (how? why?) and decides he wants to kill everybody one by one, in the style we've now become accustomed to.<br><br>This paper-thin tale is told so badly, it's almost hard to believe what you're seeing on screen and that anyone was dumb enough to spend time and money filming it. I suppose you could almost see it like a series of noisy soundbites strung together randomly. It keeps things simplistic to the point of being nonsensical, presumably to avoid confusing its target audience of dribbling inbreds. I think I could've written a better, more entertaining and reasonable script myself on the back of a beermat. Nothing is ever explained or justified, no matter how implausible and ridiculous things get, and yet, bogglingly, the film still seems to take itself fairly seriously. It tries desperately to shock with a series of boring but bloody knife murders (nothing we haven't seen ad nauseam in any of the previous films) and innumerable 'false' scares with flashlights and toys falling out of cupboards. It's all so by-the-books and done-to-death that you'd have to have never seen a single horror film in your life to find it even remotely tense or scary.<br><br>I think what bugs me the most about the film is just how terribly made it is. Even forgetting the GAPING plot holes, there are loads of obvious continuity errors and a sad, desperate style of direction that seems to drag every scene to the point of agony in a desperate attempt to pad out the already-short running time of the film. The cast do nothing to help things - all the characters are cardboard stereotypes and the ugly, plastic teens seem to be having a battle to see who can be the most skin-crawlingly irritating. I think it ends up as a tie between Katee Sachoff's hyperactive, squeaky airhead and Bianca Kajlich's jitterbug 'heroine', who spends the entire movie simpering and screaming loudly every time someone drops a pin. Oh, for the record, Busta Rhymes is absolutely ATROCIOUS in this. His entire purpose in this movie seems to be to deliver the worst examples of wisecrack-by-numbers dialogue I've ever heard (ie: \"Trick or treat, motherf**ker?\") and he plays his role as a cross between Eddie Murphy and Vin Diesel, but without the charm or charisma of either.<br><br>I'd like to say John Carpenter would be ASHAMED to see such a horrible mess made out of his characters, but when you consider the maestro himself is making films almost as bad as this these days, he probably couldn't give a toss so long as the money keeps rolling in. I think this fact in itself proves just how much horror movies have changed since the first \"Halloween\" was made and, to its credit, \"Halloween Resurrection\" would be a perfect example of an \"of its time\" product you could stick in an 'early 21st century' time capsule for future generations to balk at. It is every bit as throwaway and pointless as the culture that spawned it. It is loud, crass and in-your-face constantly, despite having absolutely nothing to say when it gets there - it's like the movie equivalent of an annoying little brat screaming at you, desperate for attention. \"Look at me! Look at me! I'm being noisy and irritating!\"... I would highly advise, for your sanity's sake, that you don't look since, like that annoying child, you'll only encourage it and I, for one, don't think I could cope with another sequel this bad... This film is utter garbage and I fail to think of a single way in which they could've made it any worse. A resounding 0 out of 10.","user":"cjlines","rank":[113,143]},{"title":"Shame on you Rick Rosenthal!!!","rating":1,"date":"28 November 2003","review":"What the heck was this? Seriously, Halloween H20 was a perfect ending to the Halloween franchise and so help me God if this was their \"final sequel\" this was the worst way to end it. I remember seeing this in the theater and afterwards just everyone saying how much they hated this movie. First off they have Jamie Lee Curtis all crazed looking and drugged up and then they kill her off! Oh, my, God! How could they?! Shame on these stupid people, this is a pathetic attempt of the MTV generation trying to add technology to the Halloween series. What did the very first Halloween present to us? A killer who stalks babysitters and wanted to kill his family off, nothing else, that's it. Very simple, why do they try to crap up the story? How could you make a Halloween movie bad? Apparently this stupid director must have been drinking or doing some illegal substance because this was just a shamed attempt at giving us a few scares.<br><br>Beginning three years after the events of Halloween H20, Laurie Strode, has been confined to a psychiatric care facility. The Summer Glen paramedic located the body of Michael Myers in the dining hall of Laurie's school, Hillcrest Academy High School. When attempting to seemingly do away with the terror from her brother once and for all, she had killed an innocent man. Unable to deal with the crime and the fear of her brother, Lauire was later confined to a sanitarium. Myers had earlier attacked the paramedic and forcefully switched clothing and his mask. The paramedic was rendered a mute from a crushed larynx. On the night of October 31, 1998, Myers cleverly escaped once again. When Michael finally appears, Laurie lures him into a trap, but before she can kill him for good, he turns the tables on her. In a confrontation on the sanitarium's rooftop, she reaches over to pull off his mask to make certain it is actually her brother. He suddenly grabs her and pulls her over the edge with him, stabbing her deep in the back. She gives him a kiss on the lips of his mask, lastly telling him, \"I'll see you in Hell.\" Michael releases the knife from his sister and she falls many stories below to her death. Myers finally accomplished killing his sister, a pursuit twenty-three years in the making. He then makes his way back home to Haddonfield, Illinois. One year later on Wednesday October 30th, six college students win a competition to appear on an Internet reality show in which they are to spend Halloween night in the childhood home of Michael Myers. Their mission is to find out what led him to kill. On the actual date of October 31, the investigation is done in a style reminiscent of the MTV reality show, Fear. On this night, through the entrepreneurial broadcast business Dangertainment, it is shot live on the internet. Of course who is going to be there to ruin it? You guessed it, Big Bird, Happy Halloween.<br><br>This is just a stupid sequel, Halloween: Resurrection makes the other sequels look like masterpieces. Halloween 2 started off terrific, we slumped just a little, nothing major, things picked up majorly with Halloween H20, so how in the heck did this movie get messed up? Because the director and writer were looking to relate to today's audience, which are a bunch of ignorant teens and this was just a waste of my time and it will be a waste of yours' as well, I promise you, you're not missing out on anything, don't watch this movie. Let's just forget about it and think that H20 was the way the Halloween franchise ended, oh, Michael, please don't ever do this again, either that or kill the director, or I will! Where's my butcher knife? Happy Halloween.<br><br>1/10","user":"Smells_Like_Cheese","rank":[64,79]},{"title":"If This Is Merely Entertainment (Then Make It So!)","rating":1,"date":"5 May 2003","review":"\"They don't make 'em like that anymore,\" friends of the horror genre often remark on their web sites in reference to killer films from the late 1970s and 1980s era. They are right.<br><br>It's not just that sentiments of nostalgia have turned those films into little treasures in our memories. It's because current horror films stink. Not all of them, but plenty or more anyway.<br><br>Ever since Dwight H. Little last captured the right Halloween spirit and atmosphere in 1988's Halloween 4, the series deteriorated into a ridiculous, messy and pathetic show. I don't care how many fans of the series curse part 3, it was a pleasant watch compared to what came after part 4. Halloween 5 was a complete prank and lacked any sense of storytelling (compliments to Danielle Harris, who managed to perform extremely well under the circumstances). Part 6, well, let's not waste any words on that one. H20 had its moments and decent acting by Jamie Lee Curtis, but a Southern California private school seemed like a poor replacement for Haddonfield. The producers dedicated it to Donald Pleasance, ignoring the fact that his last name was Pleasence (with an E) and had been spelled correctly on all earlier installments that involved his acting. So much for Moustapha Akkad's commitment to the project!<br><br>Halloween Resurrection had a nice opening scene. A 1960s home movie at the Myers house, with the sounds of Johnny Angel performed by Shelley Fabares. It was cut. Of course, the Akkads in their infinite wisdom must have thought, why bother young people with an old song from someone they have never even heard of! Let's keep the film simple (and let's take a popular hip hop artist as the lead actor).<br><br>But, thank God, Rick Rosenthal filmed one other decent scene. It involves Jamie Lee Curtis's character hospitalized in a mental institution. This actually is quite a nice scene, with the actress performing wonderfully. It provides a satisfactory and surprisingly original bridge between the events at the end of H20 and the current state of affairs in \"Resurrection\", with Laurie Strode at the end of her wits and a killer still on the loose.<br><br>And after this? We might as well have left. After the promising Jamie Lee Curtis opening scene there seemed no budget, and more important: no inspiration left to come up with something, anything. It's a bore. It's a drag. The prospect of a replica of the original Myers house showing up is a joke. We're allowed one glimpse, and even on that one occasion it is very unsatisfactory: a big car is parked in front and taking the view, as the camera briefly glances up from a low, moving position. It beats me why they even bothered rebuilding it. The interior scenes can be ignored in this sense: it may have been any old house that Busta Rhymes's character Freddie Harris decided to do his online reality show in. And about these characters: have they ever been this flat in ANY Halloween sequel? NO! The characters in Halloween 5 or 6 were drawn brilliantly compared to what is presented to us here! Okay I realize this is actually pretty much of an achievement. Credit to Larry Brand and Sean Hood. It's amazing. The unimpressive cast (I'm not counting Curtis) is highlighted by 'stars' Busta Rhymes (pop artist who is kindly given the chance to act) and Tyra Banks (model who is kindly given the chance to act). Let's suffice by saying that in this case the actors have been given the roles they deserve.<br><br>Enough said. Or... We often are told one should not apply the same criteria to a horror film as the ones that apply to drama or classics. But why on earth not? I admire more than one horror movie, but that does not mean I feel I should appreciate the crappy ones by the grace of the good ones. I can see when a film is made with no heart, no spirit and Resurrection is the key example of that. Furthermore, if these films -as we are told so often by people like Moustapha Akkad- are made for entertainment (read: cashing in) purposes only and not for quality acting, complex storytelling or great photography then why, why, why do they so vigorously renounce that one basic goal, the goal of being entertaining???","user":"Carlo Houtkamp","rank":[71,95]}]