[{"title":"Average Christmas movie","rating":5,"date":"13 December 2003","review":"*contains minor spoilers*<br><br>I stumbled upon this movie while channel-surfing one day so I decided to sit down for 2 hours to watch it.  Because of its not-so-original and predictable plot, it's an average Christmas movie.<br><br>The movie is about a kid named Zack who believes in Santa and his mom's boyfriend, Peter, a TV reporter, who grew up in a dysfunctional family and has now become a grinch.  One day, while Santa is flying his sleigh, he encounters some air turbulence and falls several hundred feet from the air, landing on Peter's car.  Santa gets amnesia and Peter decides to let him stay at his apartment until Peter can find Santa's family--obviously, he doesn't believe it's really Santa at first while Zack is trying to persuade everyone that the old man is the real deal.  By just reading this, you could probably predict how the movie will turn out.<br><br>Adults may be a little bored with it, but most kids will enjoy it.  I enjoyed it--the elves gave me a chuckle now and then--though I probably wouldn't watch this holiday movie again anytime soon.<br><br>My score: 5/10","user":"clarinetgeek","rank":[5,5]},{"title":"Cute little movie...","rating":7,"date":"4 November 2001","review":"It looks like Disney is starting to understand that animation is not the only entertainment people desire!   This is a pretty good little flick!  I can not say this movie is outstanding, but it is enjoyable (in fact it is pretty funny).","user":"srmccarthy","rank":[8,9]},{"title":"Leslie Nielsen is great as Santa!","rating":3,"date":"3 December 2000","review":"Leslie Nielsen was the best part of the movie!  He was perfect as Santa, better than in \"All I want for Christmas,\" albeit that was more a cameo role. He played an amnesiac Santa with just the right amount of confusion and sympathy. The part where he (re)learned the Christmas Carols was one of the most original parts.  Overall a very enjoyable holiday movie.","user":"shawn_allen","rank":[6,7]}]