[{"title":"Quirky, but fun.","rating":7,"date":"19 July 1999","review":"An unnamed time, an unnamed place, probably Australia given the accents. The earth is dying from a poisoned atmosphere, in this post-apocalyptic live action / anime /art house crossover. The remains of humanity scour the surface in search of hope, until one of them is found by an angel.<br><br>It's bizarre, the animated sequences are nicely designed, but suffers from a lack of frames. The live-action is well done for low-budget stuff, and the integration is pretty minimal, but the whole sort-of works.","user":"pHill-7","rank":[12,17]},{"title":"Captivating in a way...","rating":8,"date":"25 July 2006","review":"Tripped over this movie on late night TV after a hard shift at work. Caught it just after the intro credits and wondered what it was about. The anime caught me off guard as I had gone to get a coffee and sandwich and thought the film had ended and was surprised to find it hadn't. The music caught my attention more than anything else. There is a classic piece played on the piano by one of the main characters which I have since discovered was not written for the movie as I had first thought. I'd like to track this piece down as it kept me watching the movie to the end. Some of the anime scenes have a haunting imagery to them which the music again complements well.","user":"spytfyre","rank":[10,15]},{"title":"not that bad","rating":10,"date":"10 July 2006","review":"OK, so its been ages since i caught this on in the early hours of the morning...but i did see it twice, both by catching those early am viewings.<br><br>And...OK, its not amazing. But as post apocalyptic art films go...I really like this one. A man in a gas mask, playing the piano, to the woman he loves who is inside the room with the only air they can breathe unaided.<br><br>cut in with bits of Oshiis anime.<br><br>Its actually really good. Power rangers with brains and heart I guess. But, just because its got lumps of another film in there, really doesn't make it bad, and I'd love to see it again.","user":"james-commins","rank":[8,13]}]