[{"title":"Riddick","rating":7,"date":"20 February 2020","review":"Riddick might not be the right character to build an epic saga story line about, but he's the right character to make a franchise with and this film proves that Vin Diesel's Riddick role is fun enough to watch with great action set pieces.","user":"MR_Heraclius","rank":[38,39]},{"title":"Very Underrated Movie","rating":10,"date":"15 May 2005","review":"I am not sure why this movie caught to much bad press. It is a very very solid sci-fi/action movie. Its completely different from the first one but in a good way. Pitch Black was sci-fi/horror not action. The action sequences in this are amazing as well as the fight sequences. Vin Diesel was born to play this character like Arnold to the Terminator. The special effects, fights and action make this movie a balls to the wall fun flick. If you have not seen it because of all the nay sayers, I say hogwash, wow never thought i would use hogwash in a sentence. I've seen this one three times now with different people and everyone who sees it ends up really liking it and asking themselves why they haven't seen it before this. Check this one out for certain.","user":"cjsteltz","rank":[255,298]},{"title":"Great Scifi action flick","rating":9,"date":"7 March 2005","review":"I would also like to comment on the fact that TCOR received bad reviews. Personally, I think that Vin Diesel should continue making the movies from the other screenplays that have already been written. The plot in these films (TCOR and Pitch Black) is actually quite original. From an action standpoint, the films do not lack anything. Riddick is the bad ass anti-hero that we would all like to be sometimes and they couldn't have cast the parts any better. There are some similarities between the Necros in TCOR and the Borg in the latter Star Trek movies, but who cares? David Twohy put a great spin on the Necro collective and I am eagerly awaiting another sequel. Anyone who likes Scifi and enjoys fantastic visuals will love this movie.","user":"mjohnston10-1","rank":[263,310]}]