[{"title":"This was an OK comedy, with realistic characters","rating":7,"date":"6 May 2006","review":"OK, so this was not exactly high art. But let's be realistic, it is a movie with Paul Gross and Leslie Nielson in it. I was not expecting the English patient.... What was here was a good little comedy movie that poked fun at a lot of Canadian idiosyncrasies, had realistic characters and had a bit of fun with a known Canadian (and international) sport. It was nice that most of the characters had some sort of flaw, but still managed to sort things out and overcome. Better yet, it was nice to see Leslie Nielson actually act in a movie with a character who had depth instead of his normal two dimensional slapstick characters. Mostly, I enjoyed this movie because it was not a complete cast of perfect people, and it did have fun with a lot of Canadian stereotypes. It is always good when we can laugh at ourselves. Like I said, not high art but that was not what we were looking for.","user":"david-comeau","rank":[20,22]},{"title":"Decent sports romcom","rating":5,"date":"7 August 2008","review":"If you just want a pizza and beer movie and a few laughs with mates then this is a good choice.<br><br>Just offensive enough to feel adult, just enough comedy to make you laugh, and enough curling to remind you you're watching a sports movie.<br><br>Is it a classic? No.<br><br>But, is it a turkey? No way.<br><br>It's an unusual sports movie with lots of silliness and little one-liners and it actually does the send up of curling very well.<br><br>All in all it shines for its small town values, it's heart, and good performances.<br><br>A nice break from the norm.","user":"intelearts","rank":[14,20]},{"title":"Not just for Canadians","rating":10,"date":"8 April 2006","review":"I loved this movie and I'm an American. I originally got it because of Paul Gross since I love Due South, but this movie was generally funny. I see from a lot of comments that people were disappointed in the clichéd plot, but seriously people. Do you want the team to lose the tournament? Do you not want the guy to get the girl? Most of us want the happy ending; that's why we watch these kind of movies. And there were just enough quirky things thrown in to give this movie its own originality. Think about the end of the tournament when our guys when and the evil Juggernaut comes over to Cutter. He turns out to be a pretty nice guy, pompous yes, but nice. And the little commentary between Cutter and Lennox afterward is hilarious.<br><br>The scene with the beavers on the road may have been a little bit slapstick, but its also exactly how I imagine a bunch of drunk men would deal with it. The biblical quotes were cracking me up.<br><br>Overall, I highly recommend this movie. I firmly believe that the only reason it didn't do very well in theaters in the US is because it wasn't mainstream enough: no major stars (other than Leslie Nielsen and he really only had a minor part), it was about a sport that a lot of people aren't familiar with, it wasn't made by a major production company, and I don't recall it getting a lot of advertisement here in the States.","user":"camcalli","rank":[9,12]}]