[{"title":"Michael Caine - Intense, Brooding, Sympathetic, Questioning","rating":8,"date":"30 November 2002","review":"I don't understand why the studio satraps thought it necessary to embargo this film after 9/11, requiring persuasion on Michael Caine's part to get it to limited release now so as to qualify for Oscar nominations.  The American role in Viet Nam is the subject of hundreds of books and countless articles - and not a few films.  There is nothing unhealthy about the continuing debate and contrary to what some opine, I doubt American policy vis-a-vis Iraq has much lineal connection to the troubled saga of U.S. involvement in Indo-China, or its partial successor in hapless interest, the Republic of Viet Nam.<br><br>The Graham Green story has been filmed before (1958) but this is a pungent, attention-grabbing version, filmed in various parts of Viet Nam.  The sultry and grasping humidity of the land almost comes off the screen.  The story takes place in 1952 as the inept and poorly led French stumble towards their ultimate debacle at Dien Bien Phu (anyone interested in this story should start and finish with Bernard Fall's remarkable account of the French Army's Super-Alamo).<br><br>Caine, a Brit named Fowler, assures Brendan Fraser, a putative U.S. humanitarian officer named Pyle, that he is a \"reporter,\" not a \"correspondent.\"  The difference to the easy-living Fowler is that the latter has a viewpoint, perhaps even a cause, while the former, as Sergeant Friday would say, only wants the facts.<br><br>This film really belongs to Caine and Fraser but one other character, the stunning Do Thi Hai Yep, Fowler's live-in girlfriend, deserves mention.  She lights up the screen with both her calculating passion for, first, Fowler and then Pyle.  Her character is realistically complex: I knew a number of such women when I was an Army officer and although the phrase isn't used here, she's a perfect example of the desperately ambitious, beautiful mistress whose only long-term goal is to be taken to \"The Land of the Big P.X.\"<br><br>A series of experiences transform both Fowler and Pyle.  Several of the scenes of violence are real enough but the music is intrusive.  You don't hear music when people are dying around you. At least not performed by an orchestra.<br><br>This is the third recent film in which Michael Caine distinguishes himself by the depth of his acting (the others being \"The Cider House Rules\" and \"Last Orders\").  Caine's Fowler leaves us wondering as to what his motives are as he slowly changes before us.  There's no clear answer and room for argument.  His Fowler is both disturbing and ingratiating.<br><br>The audience in the East Village theater where I saw \"The Quiet American\" today clearly was made up of folks whose minds were settled as to U.S. involvement in Indo-China, never mind the later escalation in Viet Nam. Their grunts and laughs at certain points reflected their views. But the story told here is a faithful mirror of what in 1952 were complex questions in a scary world made scary by communism, not the liberal democracies.  That mistakes of a grievous nature were made may be clear today but the road was ill-illuminated then.  This film, and Caine's portrayal in particular, reflects the contemporary confusion and the unravelling of any hopes for a peaceful reunification of the two Viet Nams after the French defeat.<br><br>I hope this film gets a very wide distribution after it finishes its two-week Oscar-qualifying run.<br><br>8/10.","user":"lawprof","rank":[104,110]},{"title":"Caine scores again","rating":10,"date":"10 August 2003","review":"Michael Caine gives yet another outstanding performance in `The Quiet American,' Philip Noyce's 2002 adaptation of the Graham Greene Cold War novel (the first movie version was released in 1958).   Set in 1952 Saigon, the film features Caine as Thomas Fowler, a world-weary British journalist who's been sent to Vietnam to cover the attempt by colonial French forces to hold back the communist insurgence from the North.  But Fowler has a problem.  Despite the fact that he is a reporter, he freely admits that this country exerts a sort of magical hold on him and that, in order to maintain that image, he must will himself to look beyond the ugliness and strife that are tearing the country apart.  In fact, reporting is the last thing on Fowler's mind.  He is even madly in love with a beautiful young Vietnamese girl who lives with him.  When his publishers back in England threaten to call him back, Fowler realizes that he must become more actively engaged in the events around him if he hopes to be allowed to stay.<br><br>One day he meets Alden Pyle (Brendan Fraser), an American eye specialist who falls in love with Fowler's girl.  Even though they are drawn together by much that they have in common, Fowler and Pyle soon become rivals for the woman, though by the end, their conflict has broadened to include the issues of war vs. peace, truth vs. deception, and personal feelings vs. political expediency.  <br><br>`The Quiet American' is typical Greene in that it provides an intense personal drama played against the backdrop of geopolitical turmoil in an exotic setting.  Both Caine and Fraser bring a quiet intensity to their scenes together.  Caine, in particular, is brilliant at conveying the many moods of a man who wants to be left alone to live a simple life with the woman he loves but who knows that circumstances are conspiring to make such a life impossible.  He is heartbreaking as he sees that ideal existence suddenly slipping away, with little he can do to stop it from happening.  He also begins to see just how difficult it is to remain emotionally detached from the horrors happening around him once the atrocities begin to encroach on his world directly.   Fowler also has to decide whether his final action is truly rooted in a humanitarian impulse or the product of wanting to eliminate a pesky rival from the field of competition.<br><br>In addition to telling a fairly solid story, `The Quiet American' also provides a glimpse into the history of its region, particularly showing how the Americans ended up usurping the role of the French in that far off, alien country in the late 50's and early 60's.  This is reflected in a wonderful coda that chronicles the steps leading up to this slow handoff of power and responsibility.<br><br>But for all the film's various virtues, it is Caine's performance that is the real reason to catch `The Quiet American.'","user":"Buddy-51","rank":[42,45]},{"title":"Michael Caine Superb in Vietnamese Drama...","rating":16,"date":"16 August 2003","review":"THE QUIET AMERICAN, Phillip Noyce's adaptation of the Graham Greene novel, is among that small subgenre of films (THE YEAR OF LIVING DANGEROUSLY, UNDER FIRE, SALVADOR) where journalists, writing in war-torn countries, discover conspiracies that undermine everything they've come to accept as true. These films are inevitably controversial, as they deal with actual places and historical events, and they demand an open mind, as they often portray governments in a less-than-flattering light. While the revelations of the stories aren't always entirely true, each film of this group are well-crafted, and certainly thought-provoking.<br><br>The film is told as a flashback, as the corpse of murdered American Alden Pyle (Brendan Fraser) is found, floating in the Mekong, in 1952. During the French police investigation, the story unfolds...<br><br>Thomas Fowler (Oscar-nominated Michael Caine) is a veteran British journalist (\"I prefer reporter,\" he jokes), writing in Saigon as the French fought the Communists in Indochina. Jaded and complacent, he only sporadically submits an article, devoting his time to a mildly hedonistic lifestyle, and his beloved mistress, beautiful young Phuong (portrayed by the stunning, if not overly talented Vietnamese actress, Do Thi Hai Yen). When young Pyle arrives, purportedly joining the American mission to treat eye disease among the Vietnamese, the older man is immediately impressed by his quiet, respectful, almost naive innocence. Introducing the American to Phuong, Pyle is immediately attracted to her, and, upon discovering Fowler already has a wife, in England, he begins wooing the girl, much to the chagrin of the reporter.<br><br>As his paper is threatening to return Fowler to England, taking him away from Phuong, he announces he is involved in a major story in the north, and leaves to investigate reports of Communist activities. What he finds is a massacre, with responsibility denied by both sides. Joined by Pyle (\"I didn't want to propose to Phuong behind your back\"), the pair barely make it back alive. Although the 'official' story blames the Communists for the deaths, Fowler doesn't believe it, and begins investigating in earnest.<br><br>A new military leader emerges, General Thé, opposed to both the French and the Communists, and Caine suspects his forces as the true perpetrators of the massacre. Visiting the elusive general's headquarters, he finds Pyle running a clinic, and the General apoplectic when he asks who is providing the arms and funds for his army. Again, with Pyle's assistance, he barely escapes with his life...and a growing suspicion that the United States is taking a less than neutral role in the intrigue...<br><br>While the film's climax will come as a surprise to no one, and the 'love triangle' lacks much spark (other than from Caine, who is totally believable when he confesses that without Phuong he would \"start to die\"), the film is engrossing, throughout. Brendan Fraser, as the enigmatic title character, does a very credible job in a complex role, after a somewhat shaky first meeting with Caine. The lack of chemistry between him and Hai Yen could easily be explained away as a natural reticence from her character towards any man saying \"I love you\", in a society where sexual favors are easily purchased. She seems far more comfortable and believable in her scenes with Caine, despite their major age difference.<br><br>Ultimately, the film is a triumph for Michael Caine, who again proves why he is one of the finest actors of his generation. As a man who goes from indifferent complacency to active participant by the film's climax, he is never less than superb. <br><br>This is certainly one of the better films of 2002!","user":"cariart","rank":[36,39]}]