[{"title":"Tongue in Cheek. Whose Cheek? Whose Tongue?","rating":8,"date":"7 June 2004","review":"I loved the first Re-Animator movie.  \"Bride of Re-Animator\" was OK.  This one is over-the-top, completely twisted, and just plain clean, gory, bloody, guts spattering about, eyeballs crawling around, penis-attacks-rat fun.<br><br>This isn't a movie that takes itself seriously, and you shouldn't, either.<br><br>Jeffrey Combes is wonderful, as always, as Dr. Herbert West.  Dr. West has figured out (or so he thinks) what was missing in his previous \"experiments.\"  Needless to say, it doesn't work as planned (hey, it's \"just a theory\"), and much mayhem ensues.  Much.  Much more than in the first two movies.  Think \"Attica\" meets \"Night of the Living Dead\" meets \"Freaky Friday.\"  Yes, it's that far off the deep end.<br><br>I would recommend this film highly to anyone who enjoys a humorous splatter flick.  If you're not a deranged gorehound, you probably won't like this one.  Speaking as a longtime deranged gorehound, however, I can safely say that this is one of the finest films ever made in its genre, and certainly worthy of several Academy Awards.<br><br>I did mention that I was deranged, right?<br><br>Yeah, I did.  And if you are, too, see this movie.  And don't forget to watch the absolutely classic \"Move Your Dead Bones\" video that also comes on the DVD.  You'll laugh, you'll cry, you'll like it better than \"Cats.\"<br><br>Kudos to Brian Yuzna!","user":"w00f","rank":[44,50]},{"title":"Excellent and Very Funny Cult Trash-Movie","rating":8,"date":"26 May 2005","review":"After thirteen years in a prison ruled by a very mean director, Dr. Herbert West (Jeffrey Combs) is invited to be the assistant of the new-comer Dr. Howard Phillips (Jason Barry), a brilliant resident, in the penitentiary infirmary. After being introduced to each other, Dr. Phillips discloses that the last experiment of Dr. West killed his sister thirteen years ago, when he was a boy, and he became fascinated with the possibility of bringing dead people back to life. The journalist Laura Olney (Elsa Pataky), who is covering a matter for her newspaper in the prison, has an affair with Dr. Phillips, and they fall in love for each other. However, the experience of Dr. West looses control and the place becomes a branch of hell. \"Beyond Re-Animator\" was a great surprise for me. I did not expect anything interesting in this sequel, but I decided to risk, based on the names of Brian Yuzna and Jeffrey Combs. When I saw twice the microphone mistakenly in the scene in the beginning of the movie, when Dr. West is having a conversation with Sergeant Moncho (Lolo Herrero) in his cell, I thought that I was going to lose my time watching this film. However, \"Beyond Re-Animator\" is an excellent and very funny trash-movie, with a great potential of cult-movie. The story is very bloody and has lots of black humor and gore, recalling the style of Peter Jackson's \"Braindead\". This movie is a worthwhile sequel of the cult \"Re-Animator\" and \"Bride of Re-Animator\". Along the credits, there is another very funny scene. My vote is eight.<br><br>Title (Brazil): \"Re-Animator  Fase Terminal\" (\"Re-Animator  Terminal Phase\")","user":"claudio_carvalho","rank":[27,36]},{"title":"More great gory fun!","rating":7,"date":"27 August 2004","review":"As a big fan of the Re-Animator series, I was quite excited when I found out that a second sequel was being made. Unfortunately, however, due to poor distribution in the UK; it has taken me over a year to find a copy. But now that I've finally seen it, I am pleased to report that Beyond Re-Animator doesn't disappoint! It is now 13 years after the infamous massacre of the second film and Herbert West has found himself in jail. However, you can't keep a good re-animator down, and being in jail doesn't stop his experiments, especially when a new doctor; Dr Howard Phillips arrives on the scene.<br><br>Jeffrey Combs returns as the insane scientist, Dr Herbert West. Unfortunately, Dan Cain (Bruce Abbott) from the other two films doesn't return, but Re-Animator was always Combs' series anyway, so although it's a loss; the show must, and most certainly does go on. Jeffrey Combs was made for the part of Herbert West; his portrayal of the character is absolutely wonderful. He catches just the right atmosphere of a man obsessed by his work in all three films. He also manages to tie a lot of humour in, which is obviously a good thing for a tongue in cheek movie such as this. The rest of the cast acts as a support to Combs, and succeeds fairly well in that respect but none really impress much on their own. Jason Barry (who had a small role in the rubbish movie; Titanic) acts as Dan Cain's replacement and Herbert West's new understudy; Howard Phillips. He never really impresses in the movie and it would seem that his main objective in the movie is to make West look more insane, and through his subdued performance; he does that well. Elsa Patasky looks good as the lady of the film, but her performance is terrible; even embarrassingly bad at times. Simón Andreu is the only member of the cast other than Combs that really impresses, and he plays the prison warden; the villain of the piece.<br><br>Gorehounds won't be disappointed with this film, I can guarantee you that! Re-Animator became infamous for it's heavy amounts of overly gory sequences, and this movie features lots of them too; from an exploding chest to a severed torso that walks on it's hands; this movie has it all. Many sequels, particularly horror sequels just recap the original with more gore, but the Re-Animator sequels haven't so far, all have something new. In Bride of Re-Animator (Re-Animator 2), a new idea about animated different parts of a dead corpse emerged, and in this film the new idea is adding the 'soul' to the re-animated body. It is admirable for the series to take that route as for a film of this ilk, more gore could simply be added and it's fans would almost certainly happy, but here you get a story to chew on aswell.<br><br>The last two films ended with a riot, which has become a part of the Re-Animator tradition, and this film doesn't break that great tradition. The last 30 minutes or so are absolutely insane, with many things going on all at once and that is sure to please fans of the original movies. Overall, Beyond Re-Animator is an incredible gory ride and is recommended to anyone with the stomach for this sort of movie.","user":"The_Void","rank":[23,33]}]