[{"title":"Some of the most astonishing cinematography I've ever seen.","rating":9,"date":"15 November 2004","review":"Some reviewers have suggested that the storyline of this movie is a bit plodding and portentous, and I'd be willing to allow that. But even if this film had absolutely no plot to speak of, I would have considered the money I plunked down yesterday to see \"Hero\" to be money well-spent, because I have been witness to some of the most achingly beautiful film-making I've ever seen. As in \"Crouching Tiger, Hidden Dragon,\" the characters here fly through the air and dance across water, but \"Crouching Tiger\" surely could have benefited from the sublime camera eye of \"Hero.\" One scene of swordplay in particular that takes place in a grove of trees amongst swirling yellow leaves almost stopped my heart in my chest: It was that gorgeous. And yes, there is a plot also, one that involves various assassins with names like Sky, and Broken Sword, and Flying Snow. I have to admit that the tales and counter-tales told were a bit confusing at first, but by the time the film is over, all the pieces have fallen into place, and this chapter of ancient Chinese history has assumed a truly mythical quality. At a time when movie theaters show a lot of utter dreck, we ought to be supporting movies like this.","user":"PolishBear","rank":[331,373]},{"title":"Haunting beauty and provocative message","rating":10,"date":"2 January 2005","review":"Hero is noteworthy on at least two counts.<br><br>First, there are scenes of haunting beauty(\"Duel in the yellow forest\" and \"Turquoise autumn\" to site a couple) that, like the best of impressionist paintings, are so affecting that you will forever see the world in a slightly different way having once beheld them.<br><br>Secondly, the overall message of the film is a provocative one. The claim is that a degree of human casualties and suffering may be the optimal path to a better world, especially when the alternative is equally brutal chaos. This is not a popular theme. It has become much more fashionable to be anti-war in all cases. And understandably so, since variations of this logic have often been used in the past to justify atrocities. But the film provides a crisp litmus test for avoiding delusion: action must be taken with a heart void of malice and an unwavering commitment to the broadest possible ultimate outcome of good for all. Can anyone live up to this standard? Several characters in the movie do, each in their own way. If the standard could be met, would the world be a better place? These are questions worth reflecting on that have not been dealt with, to this depth, in any film I'm aware of.","user":"rserrano","rank":[249,301]},{"title":"The best martial arts film ever made","rating":10,"date":"24 February 2004","review":"Rarely have I been so astounded by such a magnificent, awe-inspiring film. If you have not yet placed your eyes on this masterpiece of Chinese cinema then I cannot recommend this film highly enough. 'Hero' is by far the best Chinese film I have ever seen, and already a firm favourite of all time.<br><br>The imagery is unparallelled, simply draw-droppingly near perfect scenes, with bold and vibrant use of colour, symbolism and scenery. The fluent flow of the storyline, the delicate direction of the sword slicing action, the Chinese cultural concepts and the emotionally charged scenes between characters combine to produce a simply remarkable achievement. <br><br>This film has a few elements from Crouching Tiger Hidden Dragon, but is far, far superior in every way. The sleek direction from Yimou Zhang is so perfectly done, just imagine two martial arts experts ensuing in battle against each other, defying the laws of physics as we know it, and yet following them in 360 degrees in slow motion as one deflects a droplet of rain from one sword to the other, at the same time spinning and leaping over water... simply beautiful. The attack sequences are also superbly set, with hundreds of thousands of the King's warriors in formation, simultaneously firing enough arrows into the city which literally cover the sky, in addition to the viewer being able to watch the journey of a single arrowhead aimed during this event. The build up to the attack along with the unnerving tune of a Chinese stringed instrument help you, as the audience, to become firmly engrossed in your seat. <br><br>The individual martial arts is also second to none, for myself particularly to see the distant shots of the whole battle sequence showing the true skills involved with fighting, such as footwork, perfect timing,aggression, counter attacks and defence. Jet Li shows he is truly the grand daddy of martial arts. I cannot stress enough how much you need this film in your life. <br><br>The colourful imagery imposed by the director will take your breath away with luscious, vivid, bright, wind-blown,draped backgrounds as the setting for the important progression of the story. Even the story itself is brought to the audience in such a way which ensures your undivided attention, as there are twists in the tales and hidden plots which do not develop until the end of the film.Even short individual scenes are memorable due to their sheer awesome display of skill and speed. <br><br>This film even holds a political message which is relevant to all times, especially in today's American-lead world dominance. This film has absolutely everything - including an extremely sexy young Ziyi Zhang who simply is the biggest hype to come out of china since SARS. <br><br>This film was released in 2002, but this is certainly one of my all time favourites and will probably be the best film I see all year. I have never been more enthusiastic to pursue films in this genre in my life. For more action type enthusiasts who like more gore and violence check out 'Ong Bak', but for people who appreciate a fuller, visionary piece of martial arts filming, this will leave you speechless.","user":"rcropperUK","rank":[256,347]}]