[{"title":"Why Rated So Low?!","rating":10,"date":"28 October 2003","review":"I'm a sci-fi fan, but am pretty discriminating.  Often _years_ will go by where I don't like even a single sci-fi film that comes out.  This one scared and \"wow-ed\" me.  Doesn't just rely on special effects, but has a good plot and at least decent acting.  I don't see why this film was rated so poorly, unless other viewers didn't know ahead of time it had a strong sci-fi bent (I didn't).  Great storyline, eerie memorable scenes, and a complex background story that evolves slowly but consistently throughout the movie through flashbacks from the main characters.  Great way to condense the novel, I assume.","user":"stephenhill8","rank":[63,87]},{"title":"Wow! Now that's a crazy movie!!!!","rating":7,"date":"5 March 2004","review":"Man, where does Stephen King comes up with this things? Again, we have the childhood friends we think we know from \"Stand by me\" only this time they're older, have weird powers and face some really nasty creatures. I just come from watching it for the first time and i just wanted to say: What a weird movie!! I've seen some really weird movies, but this one... It's sort of a mixture of horror, sci-fi, comedy... At some point you don't know whether to be disgusted or to laugh! The special efects are great, and so is the music (\"On blue bayou...\"}. It may not be a great movie, but it's great entertainment. And it's sooooooo insane!!!! I liked it. Go see it.     7/10","user":"zegabriel","rank":[155,228]},{"title":"Nice looking, but hollow","rating":5,"date":"18 March 2003","review":"The first third of Dreamcatcher is worth the time.  Four childhood friends make their annual trip to a hunting cabin, weird things happen, and, before you know it, you're smack-dab in the world of Stephen King, at his most darkly comical and gaily grotesque.  It's flatulent, bloody fun on the page, and Goldman had no problem translating this hideous orgy of gas and guts from novel to screenplay form.  As the screenplay proceeds, it strays from the book to the point where the film becomes a Hollywood embarrassment of epic proportions.<br><br>The Dreamcatcher novel also fell apart in its second half, but what kept you reading the book was the mind games going on in the lead character, Jonesy's (Damian Lewis) head.  Jonesy's brain and body has been taken hostage by an alien named, Mr. Gray.  In the novel, Jonesy notices Gray becoming tempted by the trappings of humanity, and uses that to his advantage.  It's fun to watch the alien craving various human indulgences, more and more, with each passing minute.  This aspect of the novel is completely removed from the film, leaving us with nothing more than Damian Lewis, playing both Jonesy and Mr. Gray, making silly faces, and putting on goofy accents, as he goes between the two characters.<br><br>The second act of the film, one taking place in a concentration camp for American citizens whom may or may not be contaminated with an alien virus, is nothing more than a shadow of what is shown in the book.  Even the shoddiest of cliffnote \"authors\" would be embarrassed to condense a novel down to this elementary a form.<br><br>In the book, the head of the camp, Colonel Abraham Kurtz, played in the film by Morgan Freeman, was a nasty man, so over the edge that he was frightening, from his first appearance to his last.  In the movie, we're made aware of the fact that he has lost it, but almost exclusively through exposition, rather than action.  Seeing these innocent civilians locked up like animals was disturbing in the novel, and would make for an extremely tense mid-section of this movie, if this movie dared to have any tension.<br><br>\nIn King's Dreamcatcher, the people locked in the camps join together, with help from the telepathic Dr. Henry Devlin, in the film played by Thomas Jane, and start a massive uprising against the guards.  At the same time, Devlin is working on Colonel Kurtz's more conscientious subordinates, both through words, and the power that he, along with Jonesy, Beaver and Pete, was given by a mysterious fifth friend, Duddits.  In the movie, the uprising never occurs, and it feels as though each of the concentration camp scenes were put into the film to pad it out, while giving a plum role to Morgan Freeman.<br><br>I won't give away the finale to either the novel or the film, but I will say that everything good about the finish of the book form of Dreamcatcher, is noticeably missing from the film version.  Instead of an emotionally moving climax, we get a sloppy CGI-fest that reminded me a bit of Godzilla VS. King Kong, or maybe even Species 2.  Although I found myself squirming over the laziness displayed during the majority of the second half of the picture, I was still undecided as to whether or not I would recommend it.  The lousy last few minutes of film made up my mind.<br><br>This is the first movie I can think of that I can only recommend in patches. Drink a couple of gallons of water before you attend the picture, and run to the bathroom to let it out, whenever things start getting stupid.<br><br>\nIf you're a fan of horror, you will enjoy the first hour of the film.  The bathroom sequence is a near-masterpiece, and, for that alone, Lawrence Kasdan should be commended.  Kasdan also handles the flashback scenes, featuring the four main characters as children, adequately enough to get my thumb working its way toward the \"up\" direction.  Finally, during those few times Kasdan does take us into Jonesy's brain, he does so in an incredibly interesting, oftentimes humorous, manner.<br><br>When Jonesy leaves the relative safety of the locked room he has nuzzled deep within his cerebrum, only to find the evil that is hiding behind boxes of stored memories inside his mind's warehouse, it genuinely gave me chills. More scary moments like this, placed throughout the film, and Kasdan may have had his first instant classic in a long while.<br><br>There was a lot of money and time put into Dreamcatcher, and it shows on the screen.  Steve Johnson's work on the puppet versions of the \"s***weasels\" is extremely effective, and shows, once again, that anything CG can do, human hands can do better.  The CG isn't the best I've seen, but it's significantly less cartoony than either of the last two Star Wars prequels, and does the job nicely, even though I would have enjoyed the effects far more, if CG wasn't a part of them.  The cinematography by John Seale (The English Patient, The Talented Mr. Ripley, Witness) is gorgeous, but not noteworthy enough to make the Director of Photography the star of the film, like Caleb Deschanel's work did for him in the recent semi-stinker, The Hunted.<br><br>What we end up with is a nice looking film that feels hollow.","user":"sloopydrew","rank":[153,225]}]