[{"title":"Guilty pleasure","rating":8,"date":"5 February 2005","review":"Come on, I know it's not cool to admit to liking what is essentially a cheesy teen flick. But go ahead, say it aloud - this is a fun movie! Sappy, badly acted, full of exaggerated clichés and one-liner groaners, Center Stage nevertheless has a kind of charm to it. No, it's not an Oscar contender or a change-your-life kind of movie. This is pure escapism, plain and simple. But - say it together with me now - there's nothing wrong with that.<br><br>Amanda Schull plays Jody, a wannabe ballet dancer who gets accepted to the prestigious American Ballet Academy. The movie follows her life and that of her friends and fellow students, who fall into the predictable stereotypes. There's Eva (Zoe Saldana), the city kid with attitude. There's Maureen (Susan May Pratt), the teacher's pet. There's Erik (Shakiem Evans), the gay guy. There's Cooper (Ethan Stiefel), the bad-boy celebrity who's still in love with the director's wife ballerina. There's Charlie (Sascha Radetsky), the perfect good guy. One has the obnoxious stage mom. Another has the talent but not the drive. A third has the drive but not the talent. Etcetera. And the lives of the students take the typical high school romantic twists and turns, as the students compete for one of three spots in the company by the end of the year, and also in the various love triangles between the cast. There are few surprises here.<br><br>None of the cast is much of an actor - Schull is particularly uneven - and the plot has a sort of predictability to it that make eyes roll.<br><br>So why the 8/10? Well, because despite all this, Center Stage is a great amount of fun - mostly due to the dancing.<br><br>By casting real dancers in a lot of the roles, Center Stage lends an air of credibility to the lavishly filmed dance sequences, clearly done with love by such talents as world-leading dancers Julie Kent and Ethan Stiefel (widely considered to be one of the best ballet dancers in the world) as well as relatively new talents such as Amanda Schull. Some of the actors have body doubles dancing for them, such as Zoe Saldana - who had some dance training but not at the level required by the film. But overall, the dance scenes are the best part of the movie, especially Cooper's ballet at the end.<br><br>Some movies are great because they change your life or make you think. Center Stage is great because it's like candy - full of saccharine sugar and empty calories, but eminently watchable over and over again. Sometimes movies don't have to be socially relevant or intellectually stimulating to be good. Sometimes, escapism is OK too.","user":"segacs","rank":[44,50]},{"title":"Shut Up and Dance","rating":3,"date":"3 June 2000","review":"Every now and then there's a new movie about dancers, or dancing, or one with a lot of dancing in it. From Astaire to Kelly to Hines, it's the poetry of motion. If you have any appreciation for the art form whatsoever, the one to see right now is Center Stage. It's about a school year in the life of three teenage girls who are roommates at a ballet academy in New York. They pass the auditions to get into the school, but then have to work as hard as possible to move on from there. At the end of the year is a workshop performance where they can be seen by most of the people in the industry who could hire them, including the resident company. They work toward and hope for a career in the most demanding pursuit imaginable, facing gifted competition, and placed on a limited schedule. \"A dancer has ten years, maybe fifteen if they're not injured\" in order to peak in their career and be the best they can ever be. A singer can sing most of their life. An actor can act all his life. A dancer's clock is ticking. It's only a matter of time before they can only teach and choreograph, so there's a unique sense of urgency to start young, study hard, and survive. All that might make a good movie. Might not.<br><br>Along with the good, you have to take the less than good. The characters are nothing new. There's the naive female ingnue (Amanda Schull), the bad girl (Zoe Saldana), the favorite girl (Susan May Pratt), the cocky lead boy (Ethan Stiefel, \"hailed as the most advanced male dancer in the world\"), the nice guy dancer (Sascha Radetsky), the nice guy non-dancer (Eion Bailey), the gay friend (Shakiem Evans), the pushy mother (Debra Monk), the demanding teacher (Donna Murphy), and the dictatorial company director (Peter Gallagher). How'd he get in there? There's even a Russian figure skater (Ilia Kulik) in the cast as a dancer. By the way, everybody is amazingly good-looking. Kind of like, Friends as done by George Ballanchine. Only in the movies, right? The story is nothing new either. Will everything work out? Will their dreams come true? Will they survive the heartbreaks of love, and the bodyaches of dance? Well, it's the movies, isn't it? Since the cast features some of the youngest and best dancers in the world, the acting comes second. Often a distant second. Or third. Don't expect any awards to be handed out in that area. Some parts are surprisingly weak, but then they move on and get back to letting their feet do the talking.<br><br>\nDid I mention that the only reason to see this is for the dancing? The way it's filmed here is excellent, without actually having to go to a ballet. The beauty of movement, the grace of the girls, and the strength and skill of the boys is captured as well as any other movie in the subject you're likely to see. The big dance numbers at the end are worth seeing by themselves, including more modern styles. Beforehand, there are a couple of dance scenes without ballet. The kids go to a club one night and salsa, and later we see a bunch of Broadway hoofers in a jazz class lead by Priscilla Lopez (original cast of A Chorus Line) that reminded me of scenes in All That Jazz. Those were the most fun. Other scenes will remind you of The Turning Point, White Nights, and even Dirty Dancing. The comparison to Fame is inevitable. That was then, this is a new century. The natural talent, dedication, motivation, support, and ass-busting hard work needed to succeed at this kind of life is touched on here, but also touched on is the sheer love of the game. For dance itself. That's the main thing. E-mail and comments are welcome.","user":"nicardo","rank":[23,29]},{"title":"Unknown Cast in a Great Film","rating":9,"date":"18 February 2018","review":"A group of young dancers arrives at the ABA (American Ballet Academy) in New York to an audition. Twelve are selected to dispute the opportunity to be chosen to a workshop to have a chance to become professional dancers. Among the female dancers, the gorgeous Jody Sawyer (Amanda Schull), the rebel Eva Rodriguez (Zoe Saldana) and the anorexic Maureen Cummings (Susan May Pratt) share a room and become friends. The lead dancer and choreographer Cooper Nielson (Ethan Stiefel) has a personal dispute with the director and choreographer Jonathan Reeves (Peter Gallagher) since he married his partner and girlfriend Kathleen Donahue (Julie Kent). Along the days, there are friendship, tension, romance, frustration and many training in the lives of the participants. <br><br>\"Stage Center\" is a film that impresses first because of the ballet dancers, most of them professionals. The screenplay with entwined storylines and the natural and powerful performances of these young and unknown actors and dancers are also highly attractive. It seems that they are indeed fighting for a chance to be recognized by Hollywood as great actors and actresses, trying to show their skills to the studios. It shows a splendid direction of the excellent Nycholas Hytner. The choreography and soundtrack are also great. Certainly it is a lovely and wonderful movie, highly indicated for fans of 'Fame', dance, ballet and good films. My vote is nine.<br><br>Title (Brazil): \"Sob a Luz da Fama\" (\"Under the Spotlight of the Fame\")","user":"claudio_carvalho","rank":[6,6]}]