[{"title":"Good Old School Film-making","rating":8,"date":"17 December 2008","review":"\"When the most likable character in your film is an evil nazi, you've got problems,\" one reviewer noted of this film. He was wrong.<br><br>Honestly some critics have been doing his for so long and so dourly that they find it impossible to appreciate a story for what it is. Hart's War is an engaging story about the battle for a man's soul, and is a story told exceptionally well.<br><br>Tommy Hart, played believably by Colin Farrell is forced to defend a black man, Lincoln Scott in a court martial after he is accused of killing Vic Bedford (another effortlessly emotive performance from Terrence Howard). Tommy finds himself caught in a chess game between Col McNamara (Bruce Willis) and Werner Visser (a remarkable performance from Marcel Lures) which turns into a battle for Hart's decency and in the end his life.<br><br>Some scenes fall flat, but it's not hard to look past them and see the bigger picture. As well as being a story about becoming, it is also a story of betrayal, friendship and respect, the type of movie that would have starred John Wayne or Charles Bronson in the McNamara role back in the day.<br><br>Shunned by critics and audiences upon its original release, but deserves reappraisal and a second look now.","user":"bh_tafe3","rank":[29,33]},{"title":"Hart's War or McNamara's Band?","rating":21,"date":"21 September 2003","review":"If one were to place too great an emphasis on many of the smug and self-serving views expressed by various contributors here, it may well appear somewhat of an enigma that HART'S WAR still rates 6.3 overall. Obviously many who have voted have not posted a review. Equally obviously, to offset its many detractors...a significant number of people must have liked it. I'm one of them! <br><br>Let us agree immediately, anyone looking for a sequel to THE GUNS OF NAVARONE can expect to be disappointed. A screen adaptation of John Katzenbach's excellent novel, this late WW2 flick tackles racism, POW life and honor...and not necessarily in that order. A re-hash of the plot is unnecessary as every second reviewer has covered this aspect. It is a film to LISTEN to and to take from it what you are able. Negative comments such that the events portrayed are \"unlikely,\" that Bruce Willis isn't the \"star,\" that \"nothing happens except lots of people keep talking,\" are a sad indictment of viewers with a limited attention span. A lot of what is uttered during the \"court-room\" sequences has great relevance in all facets of life - IF you care to listen. Farrell is excellent as is Willis in what admittedly IS a far smaller role. Willis' presence however is felt throughout the movie in much the same way as was Jack Nicholson's in A FEW GOOD MEN. (Another military court room flick)<br><br>Yes its longish and it would be fair to say it is extremely dark for the greater part of the film. It is ultimately though a worthwhile addition to other POW films. You could do a lot worse.","user":"uds3","rank":[99,128]},{"title":"Doesn't give it all away but does give some hints","rating":12,"date":"12 September 2002","review":"Having grown tired of the typical action packed glorified war films (Pearl Harbor for example), I sought out more of a human interest story.  I wanted something that delved past the cliché romances, battle wounds, and graphic violence we have become accustomed to.  To me, Hart's War exemplified exactly what others have failed to do.  It was an inside glimpse into the lives of a WW2 POW camp, but more so.  It dealt with the struggle for power, respect, and honor in an unlikely situation.  The stellar performances by Bruce Willis and Marcel Lures stole the show away from the title character, Lt. Hart (played well by Colin Farrel).  There are times when you don't know who the token hero or villain is, just by the way that each commands their region.  If you missed this movie in theaters (as I am guilty of), easiest way is to catch it is on pay per view - it's still going to be running for a while. Enjoy!","user":"hotdudepetey","rank":[52,67]}]