[{"title":"A big surprize","rating":8,"date":"18 September 2004","review":"i didn't expect much coming into this movie, i didn't hear much about it and Van wilder was one of the national lampoon movies without Chevy Chase. however this movie surpassed all my expectations. Van Wilder defines the slapstick teen comedy of the new millennium. loaded with sexual humor and innuendo, Van Wilder keep the laughs coming. i believe Tara Reid was at her hottest in this movie, and believe it or not, there are a ton of quotable lines to live by in this film. as for the plot, its just about some guy who doesn't wanna leave the college he calls his home until he meets a girl that makes him realize his own potential. this film was much better then the last 2 American pies put together. this is a true popcorn movie to watch with your friends.","user":"Leafsman_69","rank":[58,79]},{"title":"One hilarious movie","rating":10,"date":"28 February 2004","review":"This was one heck of an hilarious movie. I can watch it over and over. Reynolds did a spectacular job in the movie, but I must say that without the character Taj the movie wouldn't have been as funny.<br><br>This is more of a guy comedy type movie but my gf loved it also.<br><br>The donuts scene I must say was a little gross but still the movie was amazing. Laughed from start to finish..... This is the kind of guy everyone would like to be or know in College.<br><br>I don't think they could of taken anyone else then Reynolds to do this role maybe I m just saying that because he is one of my favorite actors but he did do a great job. 9/10","user":"kidhasaces","rank":[58,83]},{"title":"Brainless, Makes 'American Pie' Looks Like an Art Movie But Also Very Hilarious. I Do not Recall the Last Time I Laughed This Way","rating":7,"date":"30 November 2004","review":"Van Wilder (Ryan Reynolds) is a very popular student, who organizes big parties and raises funds for the most different causes in his college. After spending seven years in the college without graduation, his father Vance Wilder Sr. (Tim Matheson) decides to stop paying his tuition. He applies for a loan to continue in the college, and becomes a professional promoter of parties to pay the installments. Meanwhile, Gwen Pearson (Tara Reid), a student of journalism who writes for the college newspaper and is the girlfriend of an ambitious and brilliant student of medicine Richard, is assigned to write about Van Wilder. Her boyfriend becomes jealous and begins a personal fight against Van Wilder. In the end, of course Van Wilder and Gwen Pearson stay together. This movie is brainless, making 'American Pie' looks like an art movie but it is also very hilarious. Yesterday I laughed a lot and repeated many scenes, such as when Van Wilder applies for a loan; or with the strip dancer farting in the nightclub; or preparing the sandwiches for the fraternity of Richard; or when Gwen prepares a milk shake with colon-blow for Richard; or the examination of Richard for the medicine university. I agree that the jokes are scatological and of very low level, but I do not recall the last movie I laughed the way I did with 'Van Wilder'. Stop thinking and prepare to have 90 minutes of very funny situations. My vote is seven.<br><br>Title (Brazil): 'O Dono da Festa' ('The Owner of the Party')","user":"claudio_carvalho","rank":[48,71]}]