[{"title":"Pai will be my leader!","rating":9,"date":"12 June 2003","review":"This film, which opened in New York recently, was a total surprise. Director Niki Caro has done wonders in bringing this story to the screen as it shows a different and much simple world than the rat race of our society and the horrible times we live in.<br><br>The film presents a glimpse of the Maori society in New Zealand's North Island. Having visited New Zealand, but not being very familiar with the Maori culture, this film was a refreshing way to learn some aspects of it.<br><br>The story presented here has a lot to do with pride and tradition, which is a running theme among different cultural groups the world over. It has to do with the frustration of Koro by the defection of his eldest son, the designated heir of hundred years of a bloodline where only the males can carry the knowledge and the legends from one generation to the next.<br><br>Because of the rage Porourangi, the eldest son, feels after the death of his wife giving birth to twins, where only the female survives, he leaves his country and the baby girl is taken by the grandparents. The girl, Pai, will grow to be an enchanting girl who will be excluded from the teachings of her grandfather Koro. Even though he loves the girl, he can't deviate in his narrow vision of the world he knows.<br><br>Basically, it is a simple story very well told with a great performance by the child actress Keisha Castle-Hughes. This girl has such a strong magnetism while on camera that one tends to forget the rest of the other characters every time she appears. The grandparents are very well portrayed by Rawiri Paratene and Vicky Houghton. <br><br>This is a film for all ages to enjoy. Compare it with the latest releases from Hollywood, and it's no wonder to arrive at the conclusion that stories like Whale Rider have such an universal appeal that  should be brought to the screen more often because of the positive way they show a society and its people at its best.","user":"jotix100","rank":[91,105]},{"title":"A real machismo meltdown.","rating":20,"date":"20 February 2004","review":"A beautifully filmed and convincingly acted treat for the entire family. Adults need NOT beware since the film respects its audience and contains levels of depth suitable for all ages. Although ultimately an upbeat movie, there are some grim plot elements that may not be appropriate for very young or overly sensitive children. However, there's no actual violence or anything truly frightening or morbid. <br><br>This is the story of a 12 year old Maori girl who knows that she is born to the destiny her grandfather believes died with her stillborn twin brother. I won't spoil the ending (which is hinted at early on) with specifics, but suffice it to say that the story's ultimate lesson is that change is sometimes as necessary a component of living traditions as repetitive ceremony. And that the Maori must ride that \"whale\" as bravely as their mythological ancestor rode the whale from Havaiki (a satellite island of Tahiti, NOT Hawaii) to New Zealand. Not to destroy or denigrate their culture, but to ensure its vitality and continuity in the cultural matrix of the modern world.<br><br>A great lesson in true cultural diversity without preachy slogans or \"politically correct\" censorship. It should be shown in all the world's classrooms. Keisha Castle-Hughes is unforgettable as the heroine, and richly deserves the Oscar for which she has been nominated.","user":"guanche","rank":[49,56]},{"title":"What a Find!","rating":30,"date":"30 January 2003","review":"Whale Rider is a story of the quest for the new leader of an indigenous Maori tribe living on an island off the coast of New Zealand.  Often this type of film ends up making a caricature of the people, accentuating their quaint customs and idiosyncratic behaviors and causing us to smile condescendingly at their ignorance and stunted development.  Whale Rider does nothing of the kind.  Director Niki Caro treats her subject matter with profound respect, genuine curiosity and effortless grace, while refusing to ignore the signs of cultural disintegration.  It is as if we are invited into the Whangara community, and are free to observe comfortably, without fear or embellishment.  The 11-year-old first-time actor Keisha Castle-Hughes gives the most astonishing performance by a child that I have ever witnessed, and lifts the movie from being just plain good to a profoundly moving experience.  Whale Rider is a tale of the evolution of a culture, wrapped in humor and hope.   It is a story of an indomitable spirit.  It is a movie about love and change, about the grim realities of life and the marvelous miracles of faith.  If you have a chance to see this film, do not miss it!","user":"baho2","rank":[37,43]}]