[{"title":"Enormous emotional impact.","rating":10,"date":"11 December 2005","review":"This is the saddest movie I've seen in years, maybe in my entire life. People who say it's comedy are dead wrong. It's a realistic, brutally true example of a failed life, and it's so tragic.<br><br>Nicholson plays Warren Schmidt, an insurance salesman, whose life crashes down on him when he retires. Nicholson, someone I've loved ever since I first saw him, gives his best performance since \"One flew over the cuckoos nest\". He's so subtle, so sad, so hollow. You don't doubt for a second that he is Schmidt. He has let his body age for the role, which makes him even more real.<br><br>Alexander Payne's direction is flawless. Everyone, simply everyone, does a great job portraying the various characters, from the hotshot newly educated young man who takes Schmidt's job, to the embarrassing buddy of Schmidt's daughter's fiancé.<br><br>This is a must-see movie. Even if you hate Jack in all his other movies, you will love him in this one. Don't expect a \"hilarious comedy\", though. This is a thoughtful movie and not \"Anger Management\".<br><br>10/10","user":"MrVibrating","rank":[162,186]},{"title":"The poetry of deceit and loneliness","rating":9,"date":"13 August 2005","review":"This film must be watched very carefully. If you're not paying enough attention to it, you would miss it (some did). It's in the frames, the atmosphere, the tiny details, the situations, the acting, everything. But it's not that obvious, unless you enter that world. Simple story? Sure. Life is simple. So is great art. All in all, \"About Schmidt\" is a really great film. Bitter humor, all-pervading lie, the infinite sadness of loneliness and failure, sincere egoism, everyday dullness, desperate and quiet hope - this is life, and in a non-blatant, nor melodramatic manner. But you're going to weep (and smile) at the ending (I did!). And one more question: is The Mulholland Man the greatest actor ever or not?","user":"Ana_Banana","rank":[98,115]},{"title":"Life's quirks","rating":1,"date":"1 September 2004","review":"I love Nicolson and I thought his work in this film was as good as any I have seen him do in any of his previous films. My accolades must begin with the writers for creating such a beautiful novel and script-a perfect canvas for the many fine actors in this film upon which they wove their considerable magic. There were no killings, no car chases, no violence of any kind-I'm surprised that Hollywood distributed it.<br><br>Such a slice of life-American life with it's many warts-warts that the Americans probably don't even recognize: Winnebagos like moving palaces, freeway monuments to genocide, business that consumes it's workers only to dump them unceremoniously, too much of everything that amounts to emptiness, etc., etc. The novel by Begley, upon which the film was based, illustrated this consumer emptiness brilliantly by the inclusion of the bookends to the film, the sponsorship of the Tanzanian child by Schmidt. The child's material emptiness was contrasted with Schmidt's emotional emptiness in a way America does not recognize much less watch on the screen.<br><br>The last part of the movie dealing with the marriage of Schmidt's daughter to a man who came from a diametrically opposite \"new age\" family was an unstated acknowledgment by his daughter that she wanted nothing of her father's values-she wanted a complete break and she was going to marry the break.<br><br>A fascinating, complex movie and I'm sorry I didn't see it much earlier.","user":"diane-34","rank":[135,166]}]