[{"title":"Genuine American Classic On That Brown Acid From Woodstock","rating":10,"date":"17 May 2006","review":"If any of you doubt that people used to eat a lot of acid in the 1970's as well as during the 1960's, go find MALATESTA'S CARNIVAL OF BLOOD. Not only is this one of the most mind-bending films ever made by people who were either completely insane OR tripping their head's off, it is also one of the most unique American shockers made during the horror boon years of the early 1970's when US filmmakers struggled to keep up with their European counterparts. Here's one that did.<br><br>THE PLOT: A nebbish small town family goes to work at a carnival in some decrepit, decaying upstate armpit half-city that is actually a front for a perverted cult of fanatics who feed on human flesh and watch old silent movies down in the catacombs below the carnival. One by one the family and their friends are lured to their deaths, and eventually eaten. I guess.<br><br>This is another one of those movies that isn't really about it's story: This one is about creating atmospheres or moments out of piles &amp; piles of used second hand rubbish, like sheets of mylar, hand made puppets, old junk you'd find along the river down by the train tracks and lights filtered by patterns made out of colored bubble wrap. Made on a budget of about 1/100th your average \"low budget\" shocker these days, MALATESTA'S CARNIVAL OF BLOOD is a triumph of ephemeralia as production design, and set in the cold blooded creepiest carnival or fairgrounds ever built -- That it was a real world pre-existing locale makes it even creepier. Everything is old, rickety, about ready to fall apart, shabby, unkempt, peeling with old paint and badly in need of some shoring up. \"Accidents, we've had lots of accidents\" relates Mr. Bean, the carnival's oldest employee who sports a hook for his right hand.<br><br>Yet people still flock to this \"carnival\" looking for fun: You can play dunk Bozo or shoot ducks for prizes, there is a tunnel of love, and a roller coaster that people are just losing their heads over. A hard working handyman keeps the grounds clean with his litter stick, picking up trash, drink cups, bloody remains of people torn apart for lunch, and a smile on his face that is the very essence of \"frightening\". He loves his work though, and like all of Malatesta's employees enjoys a special place that is more like a family than just a job, much like how that nice man Charles Manson's family was more than just a mob of brutal, psychotic, homicidal maniacs. Malatesta himself is an odd bird, not much of a businessman and more like an impresario, or figurehead of some kind of underground society, I can't make up my mind.<br><br>It's strange to think that THE EXORCIST was made the same year as this movie: The two couldn't be further apart as far as aesthetic exercises in creative design. One is a literal depiction of evil that spells it all out &amp; leaves nothing to the imagination, the other is all about creating visual paradigms with layers of meaning that go beyond just what you see or hear. You watch THE EXORCIST and (if you are like me) cannot help but sit there &amp; tick off the cinematic tricks doubtlessly being used to create the appearance of fire and brimstone ... You watch MALATESTA and you wonder not only how the hell did they stage what you see, but how the hell did anybody think this up?? Hazard and chance as production design elements perhaps, tons of blotter acid maybe, but the film is *SO* tightly scripted and choreographed that it cannot possibly all be improvisation. <br><br>It's like a big hippie movie from hell, with trippy sights, weirdo sound &amp; music effects, singing baroque cannibals (who are pretty good, actually), double meaning laden dialog that never quite sounds like people just delivering lines, all topped off by an ending so open that no sequel was even needed: There is a Carnival of Blood in every small or large town just waiting to be discovered and explored by people who might need to vanish. Feeding the hungry is also a national past time -- why not do it ourselves? the movie asks. And while sure, this is one of the creepiest, most atmospheric and potentially unnerving non-Hollywood horror movies ever made it is also an incredible study in how you can make movies for just peanuts. Watch the lady washing her hair in a mud puddle or the finale calliope organ number with the bendy mirrors, and tell me you have ever seen anything quite like it. While it might make a great double bill with CHILDREN SHOULDN'T PLAY WITH DEAD THINGS (another Manson-inspired ultra low budget regional American horror classic) there isn't another movie to my knowledge that looks like this. And at about 74 minutes it's just the perfect length, with excellent pacing and nary a dull moment.<br><br>You may not understand what you are seeing but you sure won't be bored by it, and it's most assuredly a \"love it or hate it\" kind of experience: You'll either say this film is just too bizarre and nothing happens or you'll wish that there were more bizarre movies with even less happening like it to enjoy. There aren't, so live it up.<br><br>10/10","user":"Squonkamatic","rank":[23,28]},{"title":"Innovative, unsettling, imperfect","rating":8,"date":"6 July 2017","review":"The horror films I enjoy usually fall into one of two categories: excellently made, or not well-made but still enjoyable in a trashy or kitschy way. This is a rare example that straddles the line between the two.<br><br>The film was obviously made with very little budget and by people with only minimal experience in film. But the cast and crew still had experience in the art world. They had good ideas. They knew how much a movie could be driven by its aesthetics.<br><br>To start with the negatives: the pacing is off, the acting is sometimes amateurish, and while the dialogue is okay, the script is hard to follow. You don't walk away understanding much regarding character motivation, or how action A led to consequence B. <br><br>But those are secondary concerns if a film is pleasurable overall, which this one is. The framing and lighting are disquieting throughout, with some dream-like scenes producing eerie effects that I've never quite seen before. Certain images--such as a closeup to a distorted view of the main girl's head wrapped in plastic, or a tracking shot of a bleeding man being slung across a ceiling in some kind of otherwise purposeless contraption--will haunt the view regardless of whether or not she could follow the plot. <br><br>The film's strongest aspect is probably its sound effects and minimalist score, which a blu-ray extra explains were made by a duo consisting of the director's older brother and a man who had been a military audiologist (seriously). The \"weaponized\" sound effects overcame technical limitations to produce a simulacra of bass-heavy \"fear notes,\" the likes of which were copied and stolen by hundreds of horror pictures. <br><br>Overall, I'd consider this an important film if it were more well-known. I'm not exactly a horror buff, but I'm somewhat knowledgeable and I'd never heard of it until it was released on Blu Ray by Arrow Films (it's not even mentioned in the Psychotronic Video Guide). But its effects upon trash and horror cinema are palpable, and it's plenty enjoyable for anyone who has a moderate interest in such films.","user":"eddie-177","rank":[5,5]},{"title":"Surreal Atmosphere Makes for a Nice Gem","rating":7,"date":"7 March 2017","review":"Malatesta's Carnival of Blood (1973)<br><br>*** (out of 4)<br><br>Malatesta (Daniel Dietrich) runs a fun carnival where he hired a couple people to help run the place. What Malatesta doesn't realize is that the two people are basically working undercover because they're searching for their child that went missing at the carnival. What the parents don't realize is all the sinister things going on there including the fact that Malatesta is a vampire.<br><br>MALATESTA'S CARNIVAL OF BLOOD is the only film from director Christopher Speeth and it was pretty much forgotten and never seen for thirty-years. All of this changed when the director started selling copies of a DVD from his personal website. Before long the film gained a small reputation but then Arrow Video released it to Blu-ray and DVD in a Special Edition form. As the introduction by Stephen Thrower states, it's a pretty weird little film and certainly one that deserves more of a following.<br><br>If you're looking for a coherent storyline then you probably won't enjoy this movie. There's actually very little of an actual plot and instead the film really plays off like a dream you might be having while you're also running a very high fever. Some have called the film's look psychedelic, which might be a good way to describe it. The story is basically being told by the visuals, which are actually quite striking and I'd argue that the dream-like nature of the picture actually works for it. The entertainment value certainly comes from the bizarre and surreal atmosphere.<br><br>The performances are a bit all over the place with some of them being incredibly good while others are clearly being done by inexperienced actors. Still, none of them are bad enough to ruin the film. There's also an effective music score that helps build up the atmosphere and there are some really nice gore effects throughout the picture. There's not a lot of violence but when it does happen with get some of that classic 70's overly-bright red blood.<br><br>MALATESTA'S CARNIVAL OF BLOOD isn't the greatest film ever made and there are certainly some flaws throughout it including some pacing issues. Still, at just 74-minutes the film is certainly worth watching and it's bizarre and surreal atmosphere really makes it stand out.","user":"Michael_Elliott","rank":[7,8]}]