[{"title":"Definitely Not Another Teen Movie","rating":9,"date":"15 July 2005","review":"In a world wrought with unoriginal and humor-lacking teen movies, The Girl Next Door provides a beacon of light. The director's hardest battle was to insure that although 90% of the cast are teenagers, that this movie should not be labeled as a teen comedy.<br><br>The first comparison that should be made between your average Hollywood teen offering and this movie is the humor. Some movies (American Pie 1, Road Trip) are genuinely funny, but in a slapstick way. The Girl Next Door provides more intelligent jokes (Eli saying that Matthews's motel advances towards Danielle was a little forthcoming, for instance).<br><br>Even after this fact is acknowledged, it is still tempting to accuse The Girl Next Door of being a teen movie, but suddenly the thought springs to mind. \"Hang on; did that movie have a story line?\" And the answer is of course \"too right it did\". The story line revolves around a life changing loss of innocence for: primarily, Matthew and Danielle, and secondarily: Eli and Klits.<br><br>Matthew starts the movie in a tether of his scholarship acquirement's, he spends hours studying and speech revising. enter Danielle, in the space of 2 weeks she turns Matthew from a text book geek, into the king of the school (I refer of course to his control over the jocks on prom night.). Danielle, for all her real world experience, is an emotional black hole. Matthew, in the movie breaks threw this, and Danielle \"makes love\" for the first time.<br><br>Eli, the local porn king, thinks he (sexually) knows it all, however, even the slightest sexual conduct, and he turns and runs (i.e. the porn star asking Eli/Klitz to feel his girlfriends breasts). Klitz, like Matthew, is a text book nerd and lacks any confidence in his appearance, what so ever. With the help of April, he breaks through this, gaining a silent reputation for the prominence of his manhood.<br><br>So let's compare these major story lines to some admitted teen movies. American Pie 2: The story line (singular) in this story is to go on vacation and get laid. WOW. Not exactly a feast for the thought. Road Trip: This time round the storyline (singular) is that a guy suddenly realizes that his pen pal is a girl and sets of on a several thousand mile trip to profess his undying love.. Rubbish.<br><br>One similarity I am happy to point out between this work and the self-proclaimed teen movies, is that it has an excellent sound track. A few examples of the excellent choices in music would be David Gray's This Years Loving. This song perfectly matched the budding affections of Danielle and Matthew, both while they share their first kiss, and when there have sex for the first time. On a smaller scale Lapdance by NERD, perfectly captures the moment when the new and improved Matthew, strolls into the Prom and officially becomes the Godfather of the school. On the topic of the sound track, I could go on for pages, so ill just stop that now.<br><br>The best movie to compare this piece to is Risky Business. You've all seen it I'm sure. The academically perfect Tom Cruise's parents do away for the weekend. And Cruise erupts. Going wild for the weekend, he dance around the house, pants-less (easily one of the most famous scenes in movie history) and more importantly (from a story line point of view), meets and falls in love with hooker Lana (Rebecca De Mornay). On comparison I preferred The Girl Next Door. The relationship between Hirsh/Cuthbert is far more convincing then that of Cruise/De Mornay, and more importantly, there was no real foundation for the change in Cruises character, whereas Matthew is forced out of his shell by the life-of-fun character of Danielle.<br><br>Unfortunately, Risky Business is unshakable from it pillar as one of the best movies ever. But the Girl Next Door deserves to stand right up there beside is it.<br><br>If you haven't seen this movie but have read this. sorry., but go get the movie anyway, trust me, i didn't talk about, about 90% of the content of this masterpiece. If you have seen it, then I hope you agree with my synopsis.<br><br>This movie is worthy of much more recognition then it is currently receiving. And ill bet that the reason is in the first eleven words of this review.","user":"ferdiaob","rank":[223,260]},{"title":"marketing is deceiving...one of the sweetest movies in years","rating":10,"date":"3 March 2006","review":"The Girl Next Door's tagline \"Matt didn't see her coming...but all his friends have!\" is very deceiving, because the movie is not like that at all. When you see this, you'll expect a raunchy, borderline porn movie, but what you get is a refreshing, adorable, and sweet love story with great performances from Emile Hirsch and Elisha Cuthbert.<br><br>Matthew Kidman (Emile Hirsch, The Emperor's Club, Lords of Dogtown) is not a geek by any means. He's your everyday nice guy who's never really 'lived'. He is the top student, the class president, and he's in charge of bringing a teenage super genius to the U.S.A. Everything is going fantastic, because he even gets accepted to Georgetown. Only problem is, he needs the money to get to the school, and this can only be paid by winning a scholarship. A few days before his speech on why he deserves the scholarship, Matt meets Danielle (Elisha Cuthbert, '24', Weezer's 'Perfect Situation video), a breathtakingly beautiful girl who (after a hilarious few scenes where they meet) he instantly falls for, and she falls for him.<br><br>For the first part of the movie, you see Danielle, the near unfairly sexy girl, push Matt to limits he hasn't gone to, such as running in the street naked, swimming in a stranger's pool, and skipping school. They're falling in love, and it's easy to see on screen, and it's adorable.<br><br>Just when it can't get any better for Matt, things take a turn for the worse. One of his best friends, Eli (the hilarious Chris Marquette), who is a massive porn addict, goes through his collection, and finds a tape...and who is the star? Danielle. Turns out, Danielle had just quit her job as a porn star and decided to turn over a new leaf. After a near tear-jerking scene, Danielle returns to her old career by contacting her old boss, a gritty and suave porn producer named Kelly (Tim Olyphant). It's at this point that Matt decides that he doesn't care about Danielle's past, and he's in love with her. He decides that he'll do anything to get her back, including taking on Kelly, the porn industry, and some very weird people.<br><br>After some events, the plot strays away from just Matt and Danielle, and thickens to become a real movie, not just a teen movie. The movie does an excellent job of keeping us interested, because just as the plot becomes serious, Eli and Matt's other friend, Klitz, add some very funny moments and ideas. Yes, the movie does sound like the classic Risky Business, but it does things that separate itself from that movie. The chemistry between Hirsch and Cuthbert is magical, and despite her gigantic sex appeal, the character of Danielle is so lovable for how sweet and caring she is to Matt. There are some great plot twists that keep you interested, not to mention hilarious in jokes and one liners, and not to mention a classic quote: \"The juice was worth the squeeze\". You'll understand. Tim Olyphant is great in a somewhat opposing role, and veteran actor James Remar makes a few appearances as a porn producing giant. The movie's ending is so great and funny that you can't help but enjoy, not to mention mysterious, keeping you hanging by a thread the whole way through.<br><br>Luke Greenfield has directed a movie that is so well liked and cherished, that I have never heard a bad thing against this film (I'm 17, and all my friends, guys and girls, loved it). I own it on DVD, and have watched it at least 10 times. I've finally gotten around to writing a review, because writing this has reminded me of how great this movie is. In a few one word sentences, The Girl Next Door is...fun. hilarious. sweet. lovable. classic. I recommend this movie to anyone from the ages of 13 to 30, because this is the age group it is intended for.","user":"The_Amazing_Spy_Rises","rank":[164,194]},{"title":"Strange but appealing","rating":8,"date":"3 February 2004","review":"The Girl Next Door is just simply an entertaining movie.  It's got plenty of flaws - almost every single scene of the second half of the film seems to act as the climax, and then the movie keeps going - but it's also got one of the most appealing casts I've seen in a while.  Emile Hirsh (Dangerous Lives of Altar Boys, Emperor's Club) is the central character Matthew, about to graduate from high school.  He's just plain likable.  The drop-dead gorgeous Elisha Cuthbert (Kim Bauer on 24, in a very different type of role here) is the title character, Danielle.  Matthew's two friends and one of Danielle's associates played by Tim Olyphant are particular standouts in terms of comic relief; the movie is genuinely funny.  Funny, a bit silly, and at times honestly sweet, it's an entertaining movie that's harmless and worth seeing.","user":"MikieMD","rank":[191,228]}]