[{"title":"Courageous and deeply moving","rating":9,"date":"9 May 2005","review":"Japan is a culture traditionally built on respect, concern for the other person, courtesy, honesty, and discipline. Recently, however, Japanese schools have become increasingly dangerous places with an increase in violent crimes, breakdown of order in classrooms (gakkyuu houkai), bullying and intimidation of weak or delicate students (ijime), and a high suicide rate. The dark side of Japanese culture is brought to life in Shunji Iwai's All About Lily Chou Chou, a disturbing look at the life of a junior high school student who seeks sanctuary from the bullying of his classmates through the music of a pop-icon, singer Lily Chou Chou. Shot on high-definition video, the film opens in a rice field where a sad-eyed young boy stands in the middle of a wide expanse of green. With his headphones on, he clings to his Discman while we hear a soft sensuous voice singing in the background and read the text of Internet messages clicking on the bottom of the screen.<br><br>The posters are brought together by their love of Lily who, to her fans, is a voice that comes from \"the Ether\", carrying the status of an otherworldly goddess. The boy's screen name is Philia but his real name is Yuichi Hasumi (Hayato Ichihara). He is a slender boy of fourteen whose devotion to Lily is an article of faith in his world of loneliness and nihilism. The communications, based on actual web messages, are revealing of the poster's frame of mind. \"Imagine being dead\", someone writes, \"won't that be great?\" Someone else writes that once he got to Junior High School his world went gray. Another comments, \"...For me, only the Ether is proof I'm alive. But lately my Ether is running out.\" Yuichi lives with his mother, a hairdresser, her boyfriend and his son. Left on his own most of the time to deal with his peers, his life is a struggle for survival. He is robbed, forced to perform a sexual act in front of local toughs and humiliated by his teacher and mother when he is caught stealing a Lily CD.<br><br>In a flashback to their first year at school, fellow student Hoshino (Shugo Oshinari), known on the message boards as Blue Cat, reaches out to Yuichi after being ridiculed in school and both join the Kendo club. When Yuichi spends the night at his house, Hoshino introduces him to Lily. Their friendship shifts, however, after a summer vacation in Okinawa full of strange events in which Hoshino is almost drowned and they witness a serious traffic accident. This fifteen-minute vacation segment, saturated with brilliant color and shot by a jerky hand-held camera, contains the film's most unnerving moments, and we instinctively know that the lives of the vacationers will never be the same.<br><br>In the next school year, shaken by his near drowning and the loss of his family's textile factory, Hoshino undergoes a drastic personality change. He assaults the school bully, Inubushi and becomes a bully himself, forcing Yuichi to become involved in bullying others, robbery, and running a prostitution ring involving one of their classmates, Shiori Tsuda (Yu Aoi). Sadly, the adults in the story seem helpless and can only respond in an uncomprehending manner. The only response a teacher has to a girl who had her head shaven was to buy her a wig. Yuichi passively agrees to Hoshino's demands but their friendship becomes increasingly strained when he tells him to follow and watch Shiori, a girl that likes him but cannot express her feelings.<br><br>Yuichi is also forced to set up an attack on Kuno (Ayumi Ito), a gifted pianist and a girl he has feelings for but lacks the self-confidence to communicate with. It is exasperating to see Yuichi passively follow Hoshino's demands, but Iwai has crafted his character so that we can all feel the pain of those who lack the power to stand up for themselves. When Lily comes to town for a sold-out concert, Hoshino assaults his dignity one more time. Unable to enter the concert hall, Yuichi watches Lily's image as her videos appear on the Jumbotron outside the theater and his accumulated tension reaches the breaking point.<br><br>All About Lily Chou Chou is disjointed and overlong and suffers from some stylistic excesses but it is a courageous film and a deeply moving one, a work that has the courage to confront some aspects of modern-day Japan that you will not read about in the tourist guides. Iwai's breathtaking images together with the poetic music of Debussy capture the adolescent experience in a way that is heartbreakingly real and, although the film's shifting time line may makes the story hard to follow for some, the message comes through with unmistakable clarity. Lily is a film of mood where black is the color and none is the number, but the darkness is redeemed by its appreciation that the solace of art is available to all, even those suffering the most desperate pain.","user":"howard.schumann","rank":[51,56]},{"title":"Rewarding and challenging coming of age film","rating":9,"date":"20 September 2002","review":"A harsh, almost 3 hour coming of age film, All About Lilly Chou Chou takes a number of real happenings in Japan-juvenile rape, violence, degradation, murder and pop idol fixation-and throws them together for effect.  It centers on Ichihara, the persecuted protagonist who eventually finds himself atop a group of persecutors.  He's in adult situations, but doesn't have adult faculties, and any grown-up that could help him escape the escalating sadomasochism of his friends is too clueless or apathetic to help. Ichihara fixates on Lilly Chou Chou, a Marilyn Manson/the Cure/Nirvana/Tori Amos figure whom he thinks embodies his disillusionment with his unfolding life.  When he finds that his best friend/tormentor shares his love of Lilly Chou-Chou, it's too much for him to take.<br><br>All About Lilly Chou Chou is embedded in the traditional avant-garde belief that film need not being pleasurable to be beautiful or effective.  It's a surprisingly graphic film, in fact, in some ways like Van Trier's the Idiots, Pasolini's Salo, or Wedekind's play Spring Awakenings.  All About Lilly Chou Chou is beauty that's sought after.   By foregrounding the filmmaking process and complicating the line between pain and pleasure, it forces the audience to be repulsed, enamored, whatever.   Presenting the film in traditional cinematic language wouldn't do justice to the depth of the narrative.  It's a film for catharsis.  <br><br>If All About Lilly Chou Chou has a savior, it's art.  Ichihara's passion for Lilly is endless, and his only connection with other people is through her. The director is critical of the cyber-community of Chou Chou followers, all disembodied voices, but acknowledges that this is the only way for these kids to understand themselves and communicate their feelings to others.  The cinematography follows this love affair with the healing of art. Beautifully shot on DV, moving from the public to the intimate seamlessly, and capturing subtle moments of transcendence, it's a love-letter to filmmaking.  And particularly the abilities of digital filmmaking, which is able to capture the processed, intimate, amateurish and technologically-filtered beauty that most First World children are used to.","user":"J. Harlan","rank":[39,44]},{"title":"a film born from the ether...","rating":10,"date":"26 January 2003","review":"\"all about lily chou chou\" begins with a series of manually keystroked chat-room-style statements that introduce facts and ideas, mostly related to mythical pop-star \"lily chou chou.\"  this sort of cinematic introduction sounds similar to many other computer-age-themed films, but amazingly the keystroke dialogue between several anonymous internet fanatics continues past the credits and runs through almost the entire movie.  the nicely-scripted, brilliantly executed text acts as the backbone that beautifully holds together a story that is ultimately about many things, including the fragility of relationships and the personas we use based on them, fanatical envy and love contrasted against blind rage and hate, metamorphosis, and technology versus nature.<br><br>although executed in an arguably confusing manner, consisting of many non-chronological vignettes, the film ultimately succeeds in depicting a modern-day story involving the relationship between two early-adolescent japanese boys, their journey through life and school, their changing identities, and their fascination with and \"connection\" to the strangely popular musician, lily chou chou.  visually, the filmmaking complements the ideas perfectly.  the camera is often puerile and shaky when showing the boys' ventures and conversations.  at one point, a vacation sequence is depicted solely through excited and dizzying amateur videography by the boys themselves, humorous close-ups of accompanying girls' bodies included. during the non-video portions of the film, the colors are beautifully rich, with verdant fields and saturated skies.<br><br>the abrupt, but fitting pattern between flowing, dreamlike camerawork, shaky camerawork, textual discourse, and the eerily sensual, fictitious lily chou chou tracks provide a momentum that is both refreshing in its originality but effectively discomforting.  by the film's closing the style is not so much regretfully confusing as it is fittingly and fully dramatic, as well as both amazing and beautiful.  the film is nothing short of art.<br><br>lastly, the film did well to keep free of preaching.  with much of what goes on in the world today, filmmakers feel social commentary is an added bonus (or even a main goal) to depicting a narrative.  this is not so much a problem until the viewer begins to feel manipulated in a propaganda-like fashion.  this film is very much based in a realistic society with realistically harsh and shocking issues and occurrences.  however, respectfully, this film does a fine job of depicting its characters and events in a manner that allows for the viewer's empathy without pointing direct fingers or offering direct solutions.  incidentally, much of the films drama and marvel comes from this quality.","user":"evilsmen","rank":[52,62]}]