[{"title":"One Last Big Score","rating":18,"date":"18 April 2006","review":"The story of two unlikely bank robbers, a sexy accomplice, and a would-be movie stunt man who come together for one last big score. The story is complex enough to keep your attention right up until the surprise ending. Beyond that, though, this is an ensemble character study with four wonderful actors and it is a pleasure to watch them work. Bruce Willis is a tough guy with a believable sensitive side. Billy Bob Thornton is a hypochondriac with a penchant for making trivial observations at extremely critical times. Billy Bob enjoys doing different characters and this is a memorable one. Cate Blanchett is a beautiful woman running from a failed marriage who falls in love with both men. Troy Garity is a cowboy stunt man whose lapses in judgment are made forgivable by his love for his work. This is, for Garity, a very different character from role in \"Barbershop\". The movie is beautifully filmed in interesting places and there are even a few classy automobiles around. If you enjoy a good story, some action, and good actors working well together, I recommend that you rent this one.","user":"roaddreamin","rank":[32,35]},{"title":"Funny, entertaining and original","rating":7,"date":"7 June 2002","review":"This could've been just another \"Bonnie and Clyde\"-style crime caper, but it's more than that.  \"Bandits\" starts out as a slick action-comedy and evolves into a sweet romantic comedy.  When I found out Barry Levinson was the director, I assumed the film would be at least halfway decent.  Levinson has a keen eye for character development, and that's one of the things that interested me.  Normally, a film like this would be consisted of cut-and-dry, stereotypical characters, but we gradually fall in love these three characters.  After reading the rave reviews (Joel Siegel voted this as one of the best films of the year), despite poor box office numbers, I had high expectations for this film--higher than they were after watching the trailer.  For some reason, this just doesn't look like a film that would receive 4-star reviews.  Now that I have seen it, I can't regard it as a 4-star film, but it's good and entertaining and I wasn't disappointed. <br><br>\nBruce Willis and Billy Bob Thornton make a great team--they really have an impeccable chemistry.  I hope to see them teamed up again in the future. They have the potential to be the next Martin and Lewis.  Billy Bob especially steals the film, playing a neurotic Woody Allen-type.  He is absolutely hilarious!  Bruce flashes his trademark grin and speaks in his usual soft tone, but his role doesn't exactly require the talents of Pacino or DeNiro.  Still, Bruce is entertaining and his constant banter with Billy Bob makes the experience even more entertaining.  And last but not least, I will mention Cate Blanchett, who gives another incredible performance.  I was lucky enough to rent 2 Cate Blanchett movies--this film and \"The Gift\"--by coincidence.  I got to see her sweet, charming performance in \"Bandits\" as well as her powerful dramatic performance in \"The Gift.\"  Just watching those 2 films, gives me a great idea of her scope as an actress. It's sometimes hard to believe she's an Australian actress.  How she pulls off such an impeccable American accent--I don't know.  I think if I were to hear her speak in an Australian accent, I'd think she's feigning it.  Well, Blanchett perfectly completes the trio of actors, and has a great chemistry with the 2 male leads.  And it's great to see that Willis, Thornton and Blanchett all seem like they're having fun.  <br><br>When first watching this movie, I found some of the bank robberies--though very slick and original--to be quite implausible.  If the film wasn't as charming and likable, I'd probably have a difficult time suspending disbelief.  But then I found out the story of the \"Sleepover Bandits\" was actually based on a real duo of bank robbers.  Of course, this is nowhere close to a biopic and most of the story is obviously fiction, the concept of these two guys sleeping over the bank managers' houses and robbing their banks the next morning was based on truth.  Why these managers didn't call the cops while the two guys weren't watching or why they didn't try to strangle the two guys in their sleep--I don't know.  The truth really is stranger than fiction.  But the bandits did have an interesting gimmick: they only robbed banks, since the money belonged to the government; they never snatched money from people's pockets.  There's actually a scene in the movie in which they bust out of prison and rob a lady's car.  Willis hands the lady her pocketbook and says, \"Don't forget your pocketbook.\"  <br><br>\nThe film evolves into a romantic comedy during the second half.  I guess that's why audiences were disappointed--they probably expected a sheer action-comedy/crime caper and not a romantic comedy.  But I think the fact that the screenwriter and Levinson stretched this out into a romantic comedy made it all the more better.  It added new dimensions, and helped us better fall in love with these amiable characters.  It was fun watching the strong and macho Willis vie lanky pushover Thornton over the love of alluring Blanchett.  It creates an interesting conflict, and spawns some very funny scenes.  <br><br>The film concludes, picking up from where it left off in the beginning--which is the two bandits pulling off their last bank robbery. The twist ending is nifty and unpredictable, and left me satisfied.  Though this is basically a feel-good comedy that kept me smiling, there's no cheap schmaltz or trashy sentiment.  That's what happens when you're under the wing of a great director.  This is not an excellent film, like some critics said--I don't think any movie that contains Blanchett's horrible rendition of \"Walk on By\" deserves to be regarded as \"excellent\" (Cate should DEFINITELY stick to acting!)--but it's good, solid entertainment.  And I love the use of U2's \"Beautiful Day\"!<br><br>My score:  7 (out of 10)","user":"mattymatt4ever","rank":[56,66]},{"title":"Three class performances, an original plot and a humorous script make for one entertaining film","rating":6,"date":"29 January 2005","review":"Bandits is an interesting original film about two outlaws, Joe Blake and Terry Collins (Bruce Willis and Billy Bob Thornton) whom, after escaping from prison decide to continue their bank robbing spree but with a different tactic. They kidnap the bank manager,take him to work the following morning and get him to open the vault without the complications of tellers and customers. This works successfully until they run into Kate (played to perfection by Cate Blanchett in an overlooked role).Kate is an overworked stressed out housewife who decides she needs some action in her dull life. She forms a romantic relationship with Joe and starts to rob banks with them, a little extreme for a mid- life crisis don't you think?. Later in the film she falls for Terry. Cate becomes torn between the two and a rift is formed between the thieves. This is the interesting dilemma explored in this film as the two cannot afford to be torn apart as all they have in life is each other.<br><br>This film is funnier than you would expect, it plays more as a comedy than a crime film. Willis nicely escapes his cop persona in the role of Smooth likable Joe Blake. Thornton is superbly funny as Collins, the neurotic paranoid partner. As aforementioned, Blanchett is perfect as the love interest.<br><br>The ending is enjoyable if not a little expected. The one big flaw in this film is that Thornton's character, though entertaining is clearly not the criminal type. Though the relationship between the two main characters is touching.<br><br>Bandits is a funny, enjoyable, original comedy that I recommend to everyone. Go out and see this film. There will hardly be a moment in it that you will not adore.","user":"falcon135","rank":[32,37]}]