[{"title":"Highly recommended; don't listen to the critics. Great film.","rating":10,"date":"24 February 2003","review":"Gods and Generals (despite the ravages of many critics) is a very good film. The acting, writing, cinematography are all of top quality. Billy Crystal once said, \"We know where we would be without the critics, but where would they be without us?\" This film is historically accurate, deeply moving, and with outstanding acting by all concerned. Stephen Lang's performance of Stonewall Jackson should be remembered at Oscar time. Some critics condemn it as being sympathetic with the Southern cause. Jeff Daniels and others give their side in eloquent dialogue for their feelings on the conflict. I suppose Gone With the Wind would be criticized the same if released today. Since the story revolves around Stonewall Jackson it will obviously give his point of view on the subject also. The religious overtones given by the characters of both sides conformed with the religious feelings of the times that is lacking today and as such it gives the critics something else to condemn. And the moving scene with human emotions between Jackson and the little Corbin girl brings the human touch to the character. What is wrong with the critics....they must have slept through most the film. They say it is pro-slavery. There are at least three fine speeches by Martha, Jim Lewis and Lawrence Chamberlain bringing out the wrongness of that issue. Even Jackson says that slavery should be abandoned. Such is a great movie trashed by the critics and they miss the whole reason for this masterpiece. I give it ten stars. See it, and decide for yourself about this film. Every minute of it's close to four hours is worth it. Yep. Yep. And Yep.","user":"Tom-406","rank":[123,158]},{"title":"The critics are wrong","rating":9,"date":"3 March 2003","review":"I've seen Gods and Generals twice, and I've enjoyed it both times.  The critics I've read seem to object to the piety, the length, and lack of political correctness.  It seems to have escaped them that the Civil War was fought in Victorian times, and that the Victorians were extremely pious and sentimental, not to mention hypocritical.  However, this did not stop them from efficiently making war on their enemies.  The movie caught this perfectly, with Jackson's assumption that God's will is his will -- the scene before the battle on Sunday, the contrast between his sentimental love of children and his 'Kill them all' about his enemies, the constant references to Bible verses ripped out of context. Regarding the length of the movie, all I can say is that I wasn't bored at all, or restless, just fascinated with what was happening on screen.  I'm sure for MTV critics any movie over 90 minutes is epic.<br><br>Regarding the lack of political correctness, which in my opinion is our modern version of hypocrisy (we can do anything we want as long as we call it by another name) I would like to point out that this is an attempt at a historical movie and that the Civil War was NOT fought to free the slaves, nor were many people in the North comfortable with the concept of a franchised Negro.  And some slaves in the South were relatively well treated by their owners, not that they probably didn't want freedom, but they didn't particularly wish their masters ill.  The system was set up so that everyone involved, slaves and masters, had something to lose by destroying the status quo, and that's a very difficult thing for people to do.  It's easy for us now to say 'they should have freed the slaves' but if you knew that to free your slaves would beggar your children, would you be able to do it?<br><br>As with Gettysburg, the battle scenes were impressive and awe-inspiring. And they made the strategy and tactics clear to the viewer which is a monumental achievement, not to mention showing the pure courage on both sides, going to probably death or dismemberment without flinching.  I would have liked more about the Northern command struggles to balance the picture but I can see how tempting it was to show the Southern victories to balance the horrible defeat at Gettysburg -- and this picture is meant to be one of a trilogy.  I can only hope that word of mouth defeats the critics and gets this movie the audience it deserves.","user":"mholland","rank":[170,229]},{"title":"Good movie overall but Gettysburg was better.","rating":7,"date":"26 February 2003","review":"My View in Summary: Overall, I enjoyed the movie (despite some of its apparent flaws), and I plan to see it again in the theater, as well as purchase the extended version when it comes out on DVD.  I liked Gettysburg and the novel \"Gods and Generals\" better.  I am fairly confident that the majority of Americans will not like nor support this film due to its overall pro-southern emphasis.<br><br>\nWhat I liked about the movie:  I thought Lang did an excellent job portraying Jackson.  I was deeply moved by his final scene in the film.<br><br>\nThe attention to detail was good; overall it was historically accurate--with some exceptions.<br><br>The costumes looked good.<br><br>I appreciated the show of how Christianity influenced many in the Civil War, such as Jackson and Lee.<br><br>I liked the fact that many from Gettysburg reprised their roles in this film, although there were some who couldn't, which was a little disappointing.<br><br><br><br>What I didn't like or wished was better about the movie: The fake beards were more than obvious in this film, with the exception of Jackson's and Lee's, but this is relatively minor to the overall film.<br><br>I thought, with maybe the exception of the Fredericksburg battle, the depiction of the battle scenes were not nearly as well done as in Gettysburg; but to be fair, there were more battles to cover in this film. Gettysburg only had one, meaning more time could be given to the details of the battle.<br><br>The battle of Antietam was not in the movie at all, not even mentioned, which is very disappointing given its significance and effects.<br><br>Some of the CGI is poorly done (i.e., very obvious), but, again, this is a small part of the movie and in my opinion neither makes nor breaks it.<br><br>Some of the speeches were a bit stiff and seemed contrived, particularly Chamberlain's speech before the battle of Fredricksburg.<br><br>Not enough time was given to developing the characters of Lee, Chamberlain, and Hancock, all of whom are important in the novel.  In fact, in contrast to the film, the novel gives most time to Lee, not Jackson. To be fair, however, novels usually are better than their film counterparts given the constraints of time.<br><br><br><br>My thoughts on some of the common complaints about the movie:  Some complain there wasn't enough realism as to the carnage of war.  To that I say there was enough to get the point across, and for myself, it is refreshing from time to time to see a movie that doesn't rely too heavily on blood and guts. This is not meant to be a blood and guts movie.  The novel is even less bloody.  Anyone who wants to see a blood and guts war movie should buy or rent Saving Private Ryan, Full Metal Jacket, Hamburger Hill, the Patriot, Braveheart, etc.<br><br>Others complain that there were too many poetic speeches.  Indeed there were many speeches, but that was also true of Gettysburg, which most view as a good movie.  I didn't mind the speeches so much other than they sometimes truncated the character in such a way that the audience fails to see their visceral humanity.  As stated above, the only speech I thought was a bit over the top was Chamberlain's before the battle of Fredricksburg.  It seemed forced, showy, and odd that the whole regiment would stand motionless and quiet for so long to hear him go on and on.  Clearly it was intended to be a poignant moment showing historical parallels between the American Civil War and Roman history.  But the whole scene ends up feeling staged and apathetic.<br><br>Others complain about the strong emphasis on religion.  As stated above, I found this emphasis refreshing, for certainly Jackson and Lee were very devout Christian men.  Christianity was a part of the ethos of this country at that time and affected many in both north and south.<br><br>Still others complain about the pro-southern perspective being so strong. While I admit there is an imbalance between the northern and southern perspectives, which clearly favors the southern view, I also think this only stands to reason, since the overall focus of the film is clearly on Jackson, a southerner.  And given the fact that many other movies often underplay the southern perspective (i.e., it was fought over State's rights) or ignore it altogether, some will find this movie's emphasis a refreshing change.  On the other hand, the clear downplay of the role and effect of slavery in this film will no doubt trouble many Americans.<br><br>Finally, others complain that the movie is too long.  But I find this to be a misnomer.  What most really mean by this is that the movie is not entertaining enough to justify such a length.  This is not the first long film in cinematic history.  Other films were very long and yet praised as wonderful (Terms of Endearment, Dances With Wolves, Gone with the Wind, Braveheart, Lord of the Rings, etc.).  The real issue here, I believe, is that this movie for many is too \"slow\" or \"mundane\" in their estimation. This, I think, is a result of our becoming so accustomed to roller coaster rides at the movies.  If it isn't constantly exciting or humorous or action-packed, it needs to be short.  I suppose that in a TV age wherein we are accustom to pure entertainment compacted into ten-minute blocks of time separated by pithy, entertaining commercials, this complaint ought not surprise us, given the historical orientation of this film.  But I think such a complaint is evidence of a deeper cultural problem, which should concern us all.<br><br>My opinion who will like this movie: many Historians, Teachers, and Homeschooling parents; most southerners; Civil War reenactors; many Christians.<br><br>My opinion who will not like this movie: Most northerners, most African Americans, many Liberals, most in Hollywood.<br><br>My opinion on how the movie will fare: It will likely not last long in the theaters.  Most critics will hate it.  It will come out on DVD/Home video sooner than most movies.  It will likely not rake in as much money as it cost to make.  However, I hope to be proven wrong here.  Though not without flaws, I believe it is worth seeing and discussing.","user":"Belfield","rank":[69,91]}]