[{"title":"A moving, life-confirming, and soulful comedy","rating":9,"date":"7 February 2008","review":"It is a very interesting and compelling film that on the surface seems to be one of the most boring ever made. \"Wind Will Carry Us\" tells the story of Behzad, the documentary director, who travels with his crew from Tehran to the tiny remote village of Siah Dareh where they hope to document an ancient funeral ritual. While there, all they can do is wait for an old lady to die and to hope that it would happen sooner than later. The lady does not seem to hurry to meet her Creator. Nothing much happens with the exception of waiting and repetitions of the same conversations on the cell phone with the constant interruption of calls but the honest and poetic celebration of the world around us shines through every frame of this ode to joy of life. One of my friends, who had recommended the movie to me, suggested that it should not be over- aestheticized and I totally agree. The film's serious political and social metaphors and overtones are undeniable but in its core, it is a moving, life-confirming, and soulful comedy. Watching my first Abbas Kiarastami's movie was a very rewarding experience.","user":"Galina_movie_fan","rank":[19,19]},{"title":"Beautiful, enigmatic, and haunting masterwork from one of today's leading filmmakers","rating":10,"date":"9 April 2003","review":"SPOILERS. A man (Behzad Dourani) comes to a rural town with his crew to document the bizarre funeral ceremony of the locals. He has heard that an old woman is about three days from death. Unfortunately (or fortunately, depending on your point of view), the woman keeps getting better, keeping Dourani and his crew stuck there. The person who is funding him pesters him constantly by calling his cell phone. Since he can only get the signal when on the highest point of the area, he must jump in his car and race to the top of a hill. There's a nice strain of black humor running through the movie. Dourani obviously can't kill the woman, but when a young boy tells him about the purpose of some bowls of soup the locals are offering her  if she eats the soup you made, you get your wish  we can almost hear him thinking what his wish would be. The comedy shifts to philosophy in the second half of the picture, where the nature of life and its relationship with death is explored. When on the top of the hill, Dourani kicks a tortoise onto its back and leaves it for dead. After he leaves, we see it rock itself back over onto its feet. Later, he helps save another man's life and then brings the doctor who has shown up to help the dying old woman (the crew had been there for over two weeks at this point). The doctor has a lot of dialogue (`We don't want to let go of this life because we know how beautiful this world is. No one has come back from the other side and proved that it is better there.') which comes dangerously close to the kind of third-act speech which ruined, in my opinion, Kiarostami's previous film, A Taste of Cherry. But perhaps I can accept the doctor's message easier because the director has succeeded in demonstrating just how wonderful the world is. The film is absolutely gorgeous, capturing some of the most beautiful landscapes in the world. Much like my very favorite Kiarostami film, Where Is the Friend's Home?, the culture and people of this isolated area is painted by the director's brush. 10/10.","user":"zetes","rank":[27,30]},{"title":"A Man In and Out of Time","rating":1,"date":"1 October 2000","review":"A man out of time finds the way back in. And so, too, do we. Films about such big subjects, metaphysical, quasi-metaphysical, or near metaphysical, can't afford to be petty. So this one meanders, lays a loose and light hand on its subject, finds and follows it by a process of mutual discovery, audience and film maker wandering an unknown road, led by faith in a final destination.<br><br>\nThree men journey from Tehran to a tiny remote village for purposes unknown. Contrasts evolve between their urban modernity and the ageless life of the rural village. They're ostensibly there for the funeral of an ancient woman, a stranger, not a relative, who confounds their expectations by not dying. Let's just say, for the sake preserving the mystery, that they're there, in a way, to cheat death, to rob the villagers of a ritual they themselves fail to understand. <br><br>By way of first person narration, the film centers on their leader (Behzad Dourani), a man who accepts being called \"engineer,\" but really isn't--or is he? The perspective is doubled: The world of the film narrowly revolves around him at the same time that it doesn't, claustrophobically relating everything to his solitary universe, at the same time that it encompasses the full scope of a world independent of him, thus giving the lie to his limitations, his distortions and blindness. This is narrative executed with great skill, care, and a free imagination.<br><br>\nForced to wait, idle and deprived of most of his customary modern distractions, his anxiety, emptiness, and his unease surface; this is a man out of time, who resists the present and fights against the future. His one connection to the outside world, a cell phone, requires every time it goes off that he drop whatever he's doing to run to his truck and drive up to a mountain-top cemetery for clear reception, an association of technology with death concurrent with its indifference to and alienation from it, a comical escapade repeated periodically throughout to give the film a rhythm, an intrusive repetitious beat that contrasts with the natural rhythms of the village. <br><br>With nothing else to do, he gradually is tugged by and eventually succumbs to the life around him. This is the kind of movie in which a shot is held so a rooster can walk across the frame. We, too, are made to wait. While waiting, stuck in a plotless limbo, all sorts of beautiful and instructive things emerge from an apparently banal reality, if one cares to notice. There is the unassuming visual poetry of the world, the shadows on a wall of a woman hanging clothes, rolling hills of golden grass, and the organic architecture of a village molded into a hillside; and the subtlety of social interactions: the tender trust of a young boy; the engineer's yearning for a pot of milk, which finally leads him into a primeval cave-like cellar alone with a fecund young woman who refuses his money; the casualness of the birth of a neighbor woman's 10th child; the shrewish complaints of a cafe proprietor, which are answered by one her customers with implacable peasant wisdom; and so on, one scene following upon another, small miracles falling into our laps unannounced. <br><br>If only this process of poetic inference, metaphor, indirection, and openness were in more widespread use, commonly adapted, thus more fully developed, instead of the literal dry analytic \"objectivity\" which tyrannizes modern fictions, nails meaning as if to a cross. Here there isn't even a hint of manipulation or exploitation, not a drop of didacticism. Instead, Kiarostami achieves the difficult feat of keeping water in cupped hands. The film teaches us to observe nature by observing nature.","user":"simuland","rank":[59,71]}]