[{"title":"The Artful Roger","rating":9,"date":"9 August 2003","review":"Roger Swanson is a coldhearted, fast-talking yuppie businessman who has cynically reduced the man-woman equation to its Darwinian essentials.  To Roger, women are objects to be conquered not people to be respected, and he has learned to employ his good looks, charm and over-analytical mind in the service of getting laid.  When Nick, his naïve, inexperienced 16-year old nephew comes to town, Roger decides to train the boy in the fine art of manipulation and seduction, taking him out for a night on the town that the youngster will not soon forget.<br><br>As conceived by first time writer/director Dylan Kidd, `Roger Dodger' is less a full-fledged narrative and more a series of extended conversations. And I, for one, couldn't be happier, for the dialogue Kidd has come up with is sharp, observant, insightful and witty, as Roger opens up and reveals his unique perspective on the dating scene.   He uses his mouth like a machine gun, shooting rounds of rapid-fire, staccato comments, indifferent to who's left standing when he's done.  He really has no qualms about `corrupting' his underage nephew, never seeing or caring about the corrosive effect he may be having on him.  In the process, we learn quite a bit about Roger as a person, most especially the aloofness he feels from others and his inability to make any kind of emotional connection that really works.  Long estranged from his father and sister, Roger is also facing a breakup with the older woman he's recently come to fancy (his boss in fact).  Roger is a humorous figure but also an immensely sad one, for he really does seem - for all his bravado and bluster to the contrary - to be a lonely, unhappy guy.  We are simultaneously drawn to him by his confidence and charisma and repelled by his smarminess and coldness, just like the characters in the film.  As Roger, Campbell Scott does a superb job bringing out both of those seemingly contradictory qualities.  A non-stop talker, Roger knows how to draw all the attention in the room to himself; he is (at the risk of mixing my metaphors here) like a chattering vortex up there on the screen and we can't help but be sucked in by his personality and presence.  No wonder Scott won the 2002 award for Best Actor from the National Board of Review.  In fact, I haven't seen a performance this smooth, alive and energetic in a very long time. Equally impressive is young Jesse Eisenberg whose wide-eyed innocence and youthful decency provide an effective counterpoint to the brash but empty Roger.  Isabella Rossellini, Elizabeth Berkley and Jennifer Beals also turn in outstanding performances as the various ladies who play a part in the two men's adventure.<br><br>In his debut film, Kidd shows himself to be in full control of his medium. He employs a jittery, handheld camera in almost every scene, a technique that may bother some people but which heightens the sense of realism so essential to the nature of the story.  In this way, the audience is made to feel almost like an eavesdropper on the various conversations.  Kidd should also be commended - in this day of maximum special effects and minimal verbiage - for allowing his characters to speak at great length on any number of topics.  Many another filmmaker would have felt intimidated by such a heavy reliance on dialogue.  Kidd, obviously, feels intoxicated by the beauty of language and his intoxication becomes ours.<br><br>Roger is a fascinating case study mainly because we feel so ambivalent in our attitude towards him.  Just as we are about to consign him to the category of heartless, cold-blooded b***ard, he wins us over by showing us that barest glimmer of humanity that peeks out every so often from beneath his well-oiled exterior.<br><br>`Roger Dodger' is not only an intriguing, amusing and poignant tale of realtionships and sex in the modern world, but a confident first film that augurs well for its gifted young maker.","user":"Buddy-51","rank":[65,74]},{"title":"ROGER & ME - RAZOR SHARP WIT & THE BEST PERF. BY SCOTT","rating":29,"date":"29 October 2002","review":"ROGER DODGER (2002) ***1/2  Campbell Scott, Jesse Eisenberg, Isabella Rosselini, Elizabeth Berkley,  Jennifer Beals.  Scott gives a remarkable performance as a silver-tongued misanthropic New York advertising copywriter facing a personal crises that only takes fuel to the fire when his teenage nephew Eisenberg (a nice thurst and parry polar opposite turn) comes to visit him to gain some insight to his lady killing' social skills which leads to a night of unveiling some inner demons via his fast-talking eviscerations and character assassinations in a furiously funny way. Scott's bravura (and brave) take on a smart, verbose and insecure jerk straddles the fine line of being a complete monster and an honest to goodness dyed-in-the-wool cynic on the subject of the fairer sex (who are represented smartly by Rosselini as his on-the-skids lover/employer and Berkley and Beals as two young women the relatives hit on in an eye-opening lesson in the battle of the sexes and what it really means to be a man.  A real sleeper gem with wickedly snaring arch humor to spare.  Written and directed by novice filmmaker Dylan Kidd is one of the few politically incorrect triumphs in recent memory.","user":"george.schmidt","rank":[25,28]},{"title":"Artful dodger","rating":8,"date":"8 December 2002","review":"Newcomer Dylan Kidd's first feature is a very refreshing exercise in filmmaking. This is an incredible debut for Mr Kidd. Let's hope his next release will be worth of the promise he shows in this one.<br><br>Of course, this film would be nothing without the presence of Campbell Scott. Mr. Scott gets better with every new screen appearance. His Roger is a tragic figure in spite of the front he presents to all the women he tries to conquer. The last scenes of Roger in his apartment are nothing short of magnificent. We get to see the real man then, and it's not funny what we see.<br><br>The interplay with the nephew, Nick, beautifully played by Jesse Eisenberg, is the best acting of the year. <br><br>The women in the film are brilliant too. Isabella Rosellini is incredible as Roger's boss. The ladies in the single bar, Elizabeth Berkley and Jennifer Beals are true portraits of women that are looking for Mr. Right in the wrong places.<br><br>This film is a rarity. Discover it.","user":"jotix100","rank":[44,53]}]