[{"title":"007","rating":5,"date":"21 February 2020","review":"Just what was needed. A punk version of James Bond. The first 12 minutes or so was almost believable. It even had a little decent humor. The movie went downhill from there. The music wasn't to my taste, but I can understand that many younger people will like it. If it is possible for an action flick to be less believable than the Bond movies, this one was.","user":"MR_Heraclius","rank":[36,37]},{"title":"It´s entertainment; just that","rating":7,"date":"9 April 2003","review":"I don´t understand all the commotion in the user opinion section. Is Van Diesel a decent actor or is he not.  Can somebody shoot a gun while flying through the air or not? Are the Beatles better than the Stones or is Wet Wet Wet a better band than the Backstreet Boys? It´s entertainment, nothing more. James Bond uses devices not yet invented and Frodo has hairy feet. If you want to comment on the contents and value of a movie I think you must take another movie like Schindler´s List (10+ !), not a movie that was produced purely for the fun. Sit back, enjoy the ride, don´t expect any deep going conversation and just have fun.","user":"MattOnTheNet","rank":[79,102]},{"title":"Not exactly smart entertainment, but fun.","rating":6,"date":"2 March 2005","review":"Look, I'm not going to pretend that this is some sort of masterpiece. Though it is basically another \"generic action flick\", the twists that they add to it make it worth watching. The way they incorporate their \"recruitment program\" into the movie is fun and original, and though Vin Diesel doesn't really \"act\" in it, it's a lot of fun to watch. It has a few suspenseful plot elements, and the way they incorporate his status as an extreme sports star (not a spoiler, it's in the previews) into the way he conducts himself as a secret agent makes it more believable. Ever think about some of the stunts that go on in an action movie and wonder, \"Okay, exactly WHY would this particular person know how to do that?\", because it seems completely unlikely that there would be some sort of training program for the stunt they just pulled off? This movie doesn't have that, because whether he's on a motorcycle, skis, or whatever, you can believe that an extreme sports star would be able to pull off what he's doing. Though the plot is as unrealistic as most movies of this genre, the stunts are a lot more believable than you'll find in most.","user":"jmuntmootcourt","rank":[54,70]}]