[{"title":"Nolte as a good actor? He is very good.","rating":11,"date":"11 April 2003","review":"In `The Good Thief' Nick Nolte plays Bob Montagnet, a down-but-not-yet-out Bogie, a very bright thief, and a heroin addict. Natsa Kukshianidge's femme fatale, Anne, is a 17-year old Bacall.  It's the south of France--Nice and Monaco-- and it's time to relieve Monte Carlo of some precious paintings. Picasso is the model for Nolte's scamming talents: Picasso's conflicted painting of a woman with 2 sides to her face is the appropriate analogy for the duality of the young girl, both innocent and depraved, and Nolte's gambler, good and bad as the title suggests. Picasso's being accused of stealing from everyone adds to the allusive charm. The caper involves a Judas deceiver to support director Neil Jordan's frequent Christian motif (Remember `Jude' in \"Crying Game\"). The crucifixion's' good thief, Nolte's thief, is good to the young Anne by saving her from the pimp.  Jordan again joins an unlikely couple (Consider Fergus and Dil in \"CG\"), here a father figure with an errant daughter.<br><br>The winding roads of the Mediterranean shoreline are also fitting metaphor for Nolte's tortuous path to redemption. The requisite drying-out scenes, where Bob handcuffs himself to the bed and rejects Anne's offer of sexual freedom, are effective realism in an otherwise stylish film that eschews clarity and ingenuity in favor of some character development and much atmosphere.<br><br>The scenes at the casino are smoother than \"Casablanca's,\" slicker than James Bond's, and lighter than \"Croupier's.\"  When Bob and Anne begin their end of the elaborate heist by challenging the house odds, there is little to worry about their losing but much about the philosophy of gambling, of going all the way regardless of the outcome. However, Jordan's take on slick thievery is not really different from that found in the recent `Confidence,' `Heist,' or `Ocean's Eleven.' The denouement is hardly logical or dramatically tight: Does an ex-thief go clean? Does he save his Mary Magdalene? Does he stop his losing streak and addiction? Does he pull off the heist? None of this is the point.<br><br>Bob as a \"good thief \" is all that matters. <br><br>And Nolte as a good actor? He is very good.","user":"jdesando","rank":[37,41]},{"title":"Stylish and Satisfying","rating":8,"date":"19 September 2003","review":"'The Good Thief' is the best film Neil Jordan did since 'Mona Lisa' almost two decades ago. It is a classical and well written robbery story, complex enough to catch the interest, simple enough for the spectator to follow and enjoy, and with the special twist at the end that makes a good script. The main character fits Nick Nolte like life, I can imagine only Humphrey Bogart doing better in this role. There are a few other memorable characters, with the Georgian (from the other Georgia) Nutza Kukhianidze promising to become soon a star if she has enough luck to continue to work with good directors and scripts. The cinematography has a special quality, with final stills after each shot, enhancing a good digital camera work. I also liked the soundtrack, it's a mix of classic, jazz and even Leonard Cohen sounds right for a change. 8/10 on my personal scale - certainly worth seeing.","user":"dromasca","rank":[33,38]},{"title":"With Subtitles, Better Than Bob","rating":7,"date":"14 January 2006","review":"This was a re-make of the 1955 film noir, \"Bob LeFlambeur,\" which I also own. That was black-and-white and made in France while this is 2002 movie in color with English-speaking actors.<br><br>Usually I'll take the original over the re-make but not in this case....with one major consideration. In order to like this film, I had to play the DVD with the English subtitles on because many of the accents were just too tough to decipher and if you can't understand the dialog, it gets a bit frustrating. The story is confusing enough as it is, so, if you have a similar problem as I had, play this with the subtitles.<br><br>If there is such a thing as colorful film noir, this would be it, with many splashes of the neon nightlife of France, inside and outside. <br><br>Story-wise, if you're confused you are not alone. After two viewings, I still haven't totally figured out the twist at the end. The dialog tries to be snappy mid-40s Raymond Chandler stuff and sometimes it's great, other times it's affected. Overall, however, it 's fun. Nick Nolte delivers most of the clever lines. The young girl in here, Nutsa Kukhianidze, is intriguing new face, as was the case with Isabelle Corey in \"Bob.\"<br><br>This movie gets a lot of negative reviews from professional critics. Don't trust them; give this a look.","user":"ccthemovieman-1","rank":[44,56]}]