[{"title":"fantastic love story.","rating":7,"date":"23 February 2020","review":"This is a tragic story. Angelina and Antonio make for a very enticing pairing but nothing is as it seems. Can love really exist or is all a double-sided blade of emotions and illusions, lies and deception?","user":"MR_Heraclius","rank":[38,39]},{"title":"\"No, this is not a love story, but is a story about love and the power it has over life, the power to heal, or to destroy.\"","rating":22,"date":"22 August 2002","review":"Set in the late 1880s in Cuba, Luis (Banderas), a wealthy coffee magnate, places an ad in a Maryland newspaper for a wife, \"because America is the future.\" He tells his close friend, \"She is not meant to be beautiful, she's meant to be kind, and true, and young enough to bear children.\" You see, Luis also thinks, \"Love is not for me. Love is for those people who believe in it.\"  He just needed heirs. The boat is due in at 6AM, they can be married at 9AM, and \"I can be back to work by 10AM.\"<br><br>The boat comes in, he finds Julia (Jolie), who isn't homely at all, but beautiful. She tells him she sent him a photo of someone else, because she didn't want him to want her just because she was beautiful. To which he replies, \"I'm not really a clerk with a coffee company, I own the company. I didn't want you to marry me because I am rich.\" \"The we both cannot be trusted\", she says. <br><br>some SPOILERS - The movie's title is aptly chosen. \"Julia\" is really Bonnie, who along with Billy ran away from the orphanage at age 14 and the two of them have lived a life of deceptions ever since. In another version this film could have been called \"Billy the pimp and Bonnie the whore.\" Everything during the first half of this story was their murdering the real Julia on the boat, then assuming her identity so that Bonnie and Billy could steal all Luis' money, which they do after Luis foolishly converts all his accounts to \"joint\" accounts.<br><br>I found the first half of the movie more interesting. Bonnie is narrating from a jail cell, we know she was caught at something, not sure what, and they are preparing to execute her. The second half gets complicated as Billy, posing as a P.I., gets into the mix. The problem Luis has is this, even though he despises what Bonnie has done, he falls inexplicably in love with her, the person he finds in reality, with all her good and bad.  She eventually reciprocates, they both end up wanting to get rid of Billy. They do, in an altercation when she shoots him.<br><br>Bonnie at the last hour works one more deception, convinces the priest in her cell that she is sorry and seeks forgiveness, and he swaps clothes with her so she escapes right before her execution. In the end we see Bonnie and Luis in Morocco, he is gambling, she is serving, and flashing secret signs for him to win by cheating. He started out as an honest man, she was his Eve, this has become his \"original sin.\"  <br><br>I can recommend this film, if for no reason than the remarkable job Angelina Jolie does with a script that doesn't deserve it. However, it also tells a good story of how love, in this case Luis', \"has power over life.\"  Most of us have done something out of character in the guise of love.  The cinematography is lush, and surround sound is used for good effect. Terrence Blanchard (New Orleans trumpeter) adds a very good mood-setting soundtrack, like the wailing and sensuous trumpet tune, accompanied by percussion, during the first love scene.","user":"TxMike","rank":[32,36]},{"title":"Much underrated!","rating":9,"date":"2 January 2006","review":"Unfortunately I saw this marvelous film on TV last night-unfortunate because it was on the small TV screen and not a large movie screen. I admit it-I am totally taken by period pieces whose setting is somewhere in Latin America and if those movies have good sets and/or locations then I am smitten. Original Sin, set in Cuba and filmed in Mexico had the visuals down perfect-throw in the acting of Jolie and Banderas and you have a visual feast.<br><br>The book/script were fabulous vehicles for the acting of the majors as well as a framework that works beautifully for the intrigues that pepper this film. This script should keep viewers interested throughout and I will definitely be renting this film so that I can savour it without interminable commercials. I want to wallow in the beauty of the images and settings at least one more time.<br><br>Any viewer who likes settings and images from slightly earlier times owes it to themselves to look for Original Sin in their local rental shop because it is a wonderful film that seemed to slip by the reviewers when it was released.","user":"diane-34","rank":[31,35]}]