[{"title":"Pretty Good,Even If It's A Kiddie Flick","rating":9,"date":"26 November 2008","review":"I was watching my little sister the other day,and seen that it was on Jetix.It's been a while.It totally brings back memories.<br><br>Plot:Alvin is at it again with his monster obsession,and thinks his neighbor,Mr.Talbot is a werewolf.Simon thinks Alvin is an idiot and that he is over-reacting.And for that reason,Alvin is forced to go cold turkey.Meanwhile,Theodore is struggling with a bully,and the school play,Dr.Jakyll and Mr.Hyde,and he has the role of Mr.Hyde.One night,Theodore is attacked and bitten by a 'stray dog' and starts to act weird.Alvin suspects his changing into a werewolf,and convinces Simon too.It's up to them to help Theodore before he becomes a full werewolf.<br><br>I loved being able to see this again after at least three years.It's one of my guilty pleasures to be honest.If you like Alvin and the Chipmunks,and of course werewolves,then you might enjoy this as much as I did.The idea is great and I thought the animation was great also.We do learn a little bit more about them also.I never knew Theodore was a vegetarian!","user":"Illyngophobia","rank":[3,3]},{"title":"Deep Characters with Great Music and Storyline","rating":10,"date":"27 October 2001","review":"The summary says it all.  This movie is something that I can watch over and over again and still laugh, not to mention let out a thousand \"Aww!\"s at how completely adorable all of the Chipmunks are.  I've been a fan of the show for quite a long time, and I think it's great to see them bringing back the timeless characters in these fresh and invigorating new movies.  I even hesitate to say any more, for fear of reducing anyone's enjoyment so please watch!  Every person I've recommended this to has gone out and purchased a copy of their own, so we can only hope for soundtrack or DVD release in the future (and hopefully, another movie).","user":"peteygal13","rank":[5,7]},{"title":"A really good send-off for the Chipmunks of the 80s!","rating":10,"date":"18 July 2012","review":"Basically, the story revolves around Alvin having nightmares about Werewolves and he's convinced that their neighbour secretly is one. Unconvinced and annoyed with his obsession, Dave removes all of Alvin's Monster related toys and books, but this does not hinder Alvin's demand to know the truth. Essentially press-ganging Simon into assisting him Alvin and Simon set about trying to find traces and evidence to prove the werewolf's existence whilst also trying to rehearse for a Dr Jekyll/Mr Hyde pantomime at their school. Meanwhile, Theodore is bitten by a large dog whilst returning from the Chippette's house to give Elenor a gift, the next day it is found that he is incredibly athletic and substantially more mentally able.<br><br>It's not often that a Direct-to-Video film grabs my attention, but the fact that it was Alvin and the Chipmunks, one of my favourite Cartoon memories, is the main reason I had to watch this. To be honest, I wasn't expecting much as I'd had a run in with various other films of this type which had either been blandly predictable or just downright boring. But this however was something totally different.<br><br>Unlike most DTV films, this film manages to keep the zest and entertainment of the original 80s show and weave it into a story that is just as much enjoyable for adults as it is for kids. The usual array of Chipmunk musical numbers never cease either and to be honest, they never seem to lose their originality either, which was always why I preferred the animated features to the beaten down live action films of the past 5 years. Also, this movie was able to keep the characters to their usual behavioural standards unlike the newer films which seem to have just replaced them with one stereotype and no individual character separating either of them. Alvin is still his usual mischievous and egotistical self, Simon is the voice of reason and logic and Theodore is the child of innocence, even though this film will reveal that he can be far more than that. It also has a good bit of humour as well, especially the part where Simon and Alvin are stood in front of the whole crowd with their trousers at half mast when the curtain goes up for their pantomime. It was so unexpectedly hilarious I spat my tea back out!<br><br>Basically, its a delight and really is a brilliant way for the Chipmunks of the 1980s TV Series to end, on a really high note. It almost makes me sad that the Chipmunks of my childhood ended at that point and were to be replaced by something a lot less enjoyable, but never the less, it is still a great film and I recommend it to anyone young or old! :D","user":"rorymacveigh","rank":[2,2]}]