[{"title":"Whats wrong with you people?!","rating":6,"date":"21 May 2003","review":"Worst movie of the year?  Ok...the name is SLACKERS!  Not Schindlers List Part 2.  Why do you people try to pull so much meaning out of these stoner flicks?  What are you thinking when you rent these movies?  That you'll find a diamond in the rough?  A Spielbergian classic?!?  I like stupid humor. Sue me.  I can laugh dumb nonsense.  I've shown this to a ton of people and they all found humor in it.  Cool Ethan is quite possibly the craziest character ever written and what his face from Rushmore pulls it off perfectly.  Plus whats his face from that Stan video is PIMP in this movie. Seriously...take notes from STAN, eminems greatest fan.<br><br>My advice to you critics that downplay a stupid script in the first place is to stop watching comedy's.  Stop now while you're ahead.  Thank you and good day.","user":"jayfril","rank":[67,95]},{"title":"Funny College Movie","rating":8,"date":"22 October 2005","review":"If you like teenage/college humor and dirty jokes, this is your movie. The whole movie is basically goofy college humor and most movies like that don't really have a well thought out movie. With this they had all of that without forgetting about what the movie was about or ruining the story at the end. I felt very sorry for Dave when Ethan lied to Angela about him. Luckily they got everything settled out. I liked some of the actors and actresses who played minor characters in the movie too like Michael McDonald, Retta and Jim Rash. I'm surprised actor Michael C. Maronna isn't as big as he is because he was funny in this movie. He should get himself into more movies like this. See this movie if you haven't seen it. If you have, see it again.","user":"General_G","rank":[20,26]},{"title":"An under-rated subversive take on the normal teen fare","rating":22,"date":"22 January 2003","review":"I'm actually a huge fan of all teen films, but I think this one was vastly under-rated.  Some comments give the impression that it is another gross-out teen romp with nothing new to offer.  In actual fact although it may be ranked alongside films such as American Pie Road Trip etc, and though it shares common themes, it is actually a far superior film. As a result, people expect a film similar to the aforementioned, and are faced instead with one which has slightly more to offer.  I found this very entertaining and surprising; quite subversive and original in actual fact, more likely to appeal to a greater intellect than that of a 13 year-old the jokes are more ironic and subtle in general, with a few obvious \"gross-out\" moments sprinkled in between.  Though these as well are done with tongue firmly in cheek.<br><br>I would highly recommend this film, and prepare to be presently surprised by a film that most people fobbed off as another teen movie, but which is actually a lot more than that.","user":"loserchic","rank":[26,35]}]