[{"title":"Insubstantial but highly entertaining","rating":7,"date":"22 February 2001","review":"Producer Jerry Bruckheimer seems to have an innate sense of what makes money in cinema.  He seldom makes a film that isn't profitable and has numerous blockbusters on his resume over the past 30 years (American Gigolo, Flashdance, Beverly Hills Cop, Top Gun, The Rock, Con Air, Armageddon). Bruckheimer is a populist producer.  He is more concerned with giving audiences what they want than he is about producing films of any artistic value or substance.  In that regard, `Coyote Ugly' fits right in.<br><br>This film is energetic, entertaining, scintillating and fun to watch.  The story is \"Flashdance\" lite, and is reminiscent of the popular but vacuous `Cocktail' with Tom Cruise, only with a decent plot woven in.  Violet Sanford (Piper Perabo) is a young aspiring songwriter who leaves South Amboy, New Jersey traveling to New York City to be discovered.  When things don't go as planned, she takes a job as a bartender in a raucous singles bar where the sexy female bartenders dance provocatively on the bar to the shrieks of the rowdy patrons below.  Of course, there is a love story to go along with the quest for fame, completing the populist formula.<br><br>Bruckheimer defies the conventional Hollywood big budget approach by using an ensemble cast of veritable unknowns and a first time director.  Other than John Goodman in a minor role, and supermodel Tyra Banks who hasn't done much acting, most of the actors have extremely short resumes.  This gives the film a freshness and energy that comes from the cast's exhilaration at just being on the set.<br><br>Piper Perabo is an incredible find.  She is not simply acting in this film, but living the role.  Just like her character Violet, this film is her big break so her ability to understand the character and the role is implicit (another stroke of Bruckheimer genius).  Perabo is an excellent actor with tremendous ability and potential.  It is likely that this film will be the launch pad for a bright career.  Maria Bello also gives a fabulous performance as Lil, the tough and successful owner of the nightclub. Australian actor Adam Garcia has great chemistry with Perabo as Violet's love interest.  His pleasant demeanor and good looks have many people comparing him with Mel Gibson, although it remains to be seen whether he can handle roles that are more substantial.  John Goodman provides one of the film's best moments when he gets up on the bar and dances as Violet auctions him off to the screaming women in the crowd.<br><br>The DVD is packed with interesting special features about the making of the film.  It also includes a DTS audio option, which I like better than Dolby Digital 5.1.  The soundtrack is pulsating and explosive and pumps the film up with excitement.<br><br>This is not great filmmaking, but it is great entertainment.  It is an amiable film that sparkles with energy and is easy to watch.  I rated it a 7/10.  Many people were surprised by how much they enjoyed it, but I'm never surprised when I like a Jerry Bruckheimer film.  He knows how to push our buttons.","user":"FlickJunkie-2","rank":[55,68]},{"title":"Coyote Ugly Was A \"Feel Good\" Film","rating":28,"date":"28 May 2004","review":"I was not disappointed with \"Coyote Ugly\". It made me feel good and we need this kind of film these days with all that's going-on.It was no worse than \"Flashdance\" or \"Footloose\" which also had little storyline and average acting. I enjoyed it and it was what I had expected.Many of you gave it negative criticisms; what did they expect from a film about a young girl coming to the city? This was a simple story about a young shy girl with dreams trying to make it in show business; which is hard if you don't have the right connections.The dance numbers and bar scene were very realistic. As a New Yorker, I was happy to see that she wasn't mugged or worse as many films about New York portray.I'd like a sequel.","user":"shulma2002","rank":[79,103]},{"title":"Without substance, but highly entertaining.","rating":7,"date":"24 March 2007","review":"Producer Jerry Bruckheimer seems to have an innate sense of what makes money in cinema. He seldom makes a film that isn't profitable and has numerous blockbusters on his resume over the past 30 years (American Gigolo, Flashdance, Beverly Hills Cop, Top Gun, The Rock, Con Air, Armageddon). Bruckheimer is a populist producer. He is more concerned with giving audiences what they want than he is about producing films of any artistic value or substance. In that regard, 'Coyote Ugly' fits right in.<br><br>This film is energetic, entertaining, scintillating and fun to watch. The story is \"Flashdance\" lite, and is reminiscent of the popular but vacuous 'Cocktail' with Tom Cruise, only with a decent plot woven in. Violet Sanford (Piper Perabo) is a young aspiring songwriter who leaves South Amboy, New Jersey traveling to New York City to be discovered. When things don't go as planned, she takes a job as a bartender in a raucous singles bar where the sexy female bartenders dance provocatively on the bar to the shrieks of the rowdy patrons below. Of course, there is a love story to go along with the quest for fame, completing the populist formula.<br><br>Bruckheimer defies the conventional Hollywood big budget approach by using an ensemble cast of veritable unknowns and a first time director. Other than John Goodman in a minor role, and supermodel Tyra Banks who hasn't done much acting, most of the actors have extremely short resumes. This gives the film a freshness and energy that comes from the cast's exhilaration at just being on the set.<br><br>Piper Perabo is an incredible find. She is not simply acting in this film, but living the role. Just like her character Violet, this film is her big break so her ability to understand the character and the role is implicit (another stroke of Bruckheimer genius). Perabo is an excellent actor with tremendous ability and potential. It is likely that this film will be the launch pad for a bright career. Maria Bello also gives a fabulous performance as Lil, the tough and successful owner of the nightclub. Australian actor Adam Garcia has great chemistry with Perabo as Violet's love interest. His pleasant demeanor and good looks have many people comparing him with Mel Gibson, although it remains to be seen whether he can handle roles that are more substantial. John Goodman provides one of the film's best moments when he gets up on the bar and dances as Violet auctions him off to the screaming women in the crowd.<br><br>The DVD is packed with interesting special features about the making of the film. It also includes a DTS audio option, which I like better than Dolby Digital 5.1. The soundtrack is pulsating and explosive and pumps the film up with excitement.<br><br>This is not great film-making, but it is great entertainment. It is an amiable film that sparkles with energy and is easy to watch. I rated it a 7/10. Many people were surprised by how much they enjoyed it, but I'm never surprised when I like a Jerry Bruckheimer film. He knows how to push our buttons.","user":"SmoothCriminal8291958","rank":[18,21]}]