[{"title":"Great prequel.","rating":7,"date":"12 July 2006","review":"Red Dragon takes place just before the events of The Silence of the Lambs. In this movie, a deranged serial killer is killing entire families every month on the night of the full moon. Jack Crawford of the FBI calls in retired agent Will Graham to help catch the killer. Graham left the FBI after being critically wounded while capturing the cannibalistic Hannibal Lecter. Now, Graham must interview Hannibal, to see if he can shed any knowledge on the case. Meanwhile, the killer struggles with himself when he begins to fall in love with a fellow employee. This movie is closer to Silence of the Lambs than Hannibal in quality and style, and therefore is more entertaining.<br><br>This movie is basically a reworking of the film Manhunter, except with Anthony Hopkins as Hannibal, so it connects better with the others. This movie sticks closer to the book than Manhunter did, which will please fans, except that it ads way more Hannibal Lecter interview scenes than were in the book, most likely to bank on Anthony Hopkins' name. The movie has the same suspenseful style as Silence of the Lambs, making up for the fact that Hannibal hardly had any suspense at all. The dialogue and overall fast paced style of the movie made it really worth watching, and if this movie had been released a year before Silence rather than a year after Hannibal, they would be great together. The characters are great and engaging. They seem more realistic than they were in Manhunter. I'm glad this movie managed to be far more successful than Manhunter, because I don't think I could deal with two bad Red Dragon adaptations.<br><br>The acting is superb. I was kind of annoyed with Anthony Hopkins in Hannibal, because he played the role way too differently than the way he played it in Silence. Now, in this movie, he gets back to basics. Edward Norton is great as Will Graham. The role of the Red Dragon/Francis Dolarhyde was made for Ralph Fiennes. He takes the role and makes it his own. Whenever I think Ralph Fiennes now, I think Red Dragon.<br><br>Overall, this is an awesome psychological thriller, and any fan of Silence of the Lambs should definitely see this movie.<br><br>7/10","user":"theshadow908","rank":[61,68]},{"title":"Another great film that slipped under the radar of most","rating":9,"date":"3 July 2006","review":"This was a fantastic film, but it slipped under many people's radar for three reasons: <br><br>1) The critics said (and rightly so) that it is not as good as the Silence of the Lambs. However, I find it difficult to compare the films, largely because Will Graham (Norton) is completely different to Clarice Starling (Foster). The different dimension they bring to the investigation is enough, by itself, to distinguish them beyond comparison.<br><br>2) This was the third film in the series. The problem with the Hollywood pumping out an absurd number of sequels and prequels (even when the original film was terrible to begin with) is that it alters the public's attitude towards them. People are usually happy to see the \"part 2\" but beyond that, you're usually down to loyalists. In fact, this situation has been made worse due to the fact that many of the sequels made are shockingly bad (eg, the American Pie sequels, the Highlander sequels). Some are so terrible that they can actually tarnish the memory of the original (eg... Matrix Revolutions). So a third Hannibal film was always going to be an uphill battle. <br><br>3) This followed an awful sequel: Hannibal. People who thought Hannibal was terrible (and there's no shortage of them) are likely to turn their nose up at any further sequels or prequels. That's what Hollywood always overlooks - once you pump out one bad sequel (eg, Ocean's Twelve 2004), fewer people will even consider seeing the next sequel, unless it receives almost unanimous critical acclaim.<br><br>I did not like Hannibal either and I think that many stars in Hollywood would have turned it down after reading the script. Jodie Foster, with the offer of reprising her academy awarding winning role, and Jon Demme (director of Silence of the lambs) walked away from the Hannibal after disagreements with author (Harris) over the character directions. Hopkins nearly left when Foster and Demme walked, but was persuaded to stay (probably with a nice salary increase!). In any case, key elements were gone and in my view, they ultimately failed to attract a strong supporting cast. <br><br>By contrast, I think many actors would have been falling over themselves to land one of the roles in Red Dragon after reading the script. Accordingly, we ended up with Hopkins (reprising his academy award winning role to absolute perfection), Norton (who is the rightful winner of the academy award for American History X in my view, even though the academy went to someone else that year), Harvey Keitel, Ralph Finnes and the brilliant, but under-rated, Phillip Seymore Hoffman. They combine to breath tremendous life into this investigative/thriller. And the opening 5 minutes is magnificent.<br><br>However, I have two criticisms that cost it a star. First, it wasn't quite dark enough. Perhaps that masterpiece, the Silence of the Lambs, used up all the visceral attributes that were so pathetically contrived in Hannibal and present, but not powerfully present, in Red Dragon. There certainly was a dark edge, but it just didn't get under my skin the way Silence of the Lambs did (if you'll forgive the pun). <br><br>Second, I felt that there were a few off-shoots to the main plot that could have been worked around or seemed to play no real role in the film whatsoever. For example, the tense relationship between Norton and the reporter (Hoffman), Finnes taking the blind girl to listen to the sedated tiger (or lion or whatever it was), Norton teaching his wife to shoot ... and many others. Most of the time, I felt that they should have been left on the cutting room floor as they were of little interest, had little (if any) role in the context of the story and accordingly, unnecessarily bulked out the running time of the film.<br><br>Otherwise, terrific viewing. Don't be dissuaded by Hannibal - this sequel achieves where that one so dismally failed.","user":"mattrochman","rank":[105,127]},{"title":"A Terrific Thriller!","rating":8,"date":"6 October 2006","review":"On paper, it looked a bit uncertain. The long-awaited prequel to 'The Silence of the Lambs' and 'Hannibal' was to be directed by Brett Ratner, most famous for the two 'Rush Hour' movies (1998, 2001).<br><br>However, the final result is pleasantly surprising. 'Red Dragon' opens with a wonderfully suspenseful prologue detailing the infamous Dr. Hannibal Lecter's (Anthony Hopkins) capture, and the unbearable tension rarely lets up for the remainder of the film.<br><br>Lecter's capturer, Will Graham (Edward Norton), is coaxed out of retirement by Jack Crawford (Harvey Keitel) to help track down a ruthless serial killer nicknamed the Tooth Fairy (Ralph Fiennes), who is murdering seemingly-random families in their sleep. Graham believes that Lecter may hold the key to capturing this killer, and, in order to prevent any further murders, he must revisit his old demons.<br><br>The acting performances are first-rate. Hopkins is good (as always) as the cold, calculating serial killer Lecter. Norton handles a demanding role exceedingly well. Throughout his career, Fiennes has excelled at portraying loathsome villains (i.e. Amon Goeth in 'Schindler's List,' 1993), and here he turns in perhaps his greatest performance. The facially-disfigured, mentally-unstable Francis Dolarhyde is shown not to be an inherently evil killing machine, but an emotionally-troubled young man who is still battling the overwhelming demons of an abusive childhood.<br><br>Strong supporting performances from Emily Watson ('The Proposition,' 2005), Harvey Keitel ('Pulp Fiction,' 1994) and Philip Seymour Hoffman ('Capote,' 2005) round off a terrific thriller, and one for which widespread recognition is long overdue.","user":"ackstasis","rank":[61,75]}]