[{"title":"worth watching","rating":6,"date":"3 September 2007","review":"Now let me start off by saying this film ever won't win any awards. That said, I did find it surprisingly enjoyable, especially after reading so many negative reviews. It is kind of a Tarantino lite, with an urban setting, quirky characters, cartoon violence, irregular dialogue and strange plot twists. If you are a fan of films with a traditional narrative, this is not the movie for you. However, if you are a fan of Denis Leary (not unlike Tommy Gavin here) and you are a fan of black comedy, you might like this. It's one of Decillo's lesser works, but it's still more charming than what you might find at the Multiplex. I was rarely bored, and i had a few good chuckles, that's all i ask of a late night cable film. So give it a chance.","user":"Stephenpdixon","rank":[10,12]},{"title":"Great indie flick, big stars, lots of comedy....a must see.","rating":24,"date":"24 December 2003","review":"I was reading through the comments about this movie and could not figure out why people were badmouthing it the way they were.  I remembered this movie to be quite good and wanted to refresh my memory so I went out and rented it again.  After seeing it a second time, I went ahead and purchased it.<br><br>This is a very funny movie with some witty acting and a great indie style. I think most of the people here that are rating this movie so poorly must be looking for the standard Hollywood blockbuster, made with tons of money and only ounces of heart.  If that's what you want, go rent Gladiator or the Matrix (both of which I loved as well).  But if you are really into films themselves and not just high dollar special effects, then go out and rent this fun and humorous picture.","user":"GeneJasper","rank":[17,27]},{"title":"An Odd Movie Indicated for Fans of Elizabeth Hurley","rating":6,"date":"21 July 2003","review":"Ray Pluto (Denis Leary) is a detective with a problem due to the lost of his wife and daughter. One day, he is in a fast food place, and due to a pain in his back, he is not able to avoid a massive murderer of six persons. A young boy uses his gun and kills the killer. He becomes a loser in the eyes of the police force and the public opinion and his partner (Steve Buscemi) convinces him to have a session with a chiropractor (Dr. Ann Beamer - the gorgeous and sexy Elizabeth Hurley). A complicated romance between them will grow. Meanwhile, at least two other plots happen, involving detective Pluto and other odd characters. <br><br>This movie is not totally bad, but it is impossible to label the genre. The screenplays 'shot ' everywhere: black comedy, drama, romance, and action, all of it mixed together. The result is very irregular, and there are parts enjoyable, other that could be skipped, other not resolved. It deserves to be watched at least once and is indicated for fans of the delicious Elizabeth Hurley, maybe. My vote is six.<br><br>Title(Brazil): \"Um Policial em Apuros\" (\"A Policeman in Trouble\")","user":"claudio_carvalho","rank":[14,22]}]