[{"title":"if you don't like this movie you're nuts","rating":1,"date":"1 November 2015","review":"Seriously, this movie is the best one ever.<br><br>It inspired my life dream of traveling to Australia to adopt baby kangaroos. This movie DOES NOT deserve a 4.4/10, it deserves a 14.4/10!!!!!!!! I couldn't love this movie more, it was totally fire and interesting and artistic and amazing and fantastic.<br><br>If people can't the artistic genius found in this movie you're nuts! Anyways go and watch this movie. it will be the best decision you will ever have made Get your life together people...Comments like \"piss poor directing\" and \"foully awful acting are out of line. <br><br>Keep up the amazing work David McNally","user":"ehenriqu","rank":[29,37]},{"title":"My 7 year old daughter and I had some laughs","rating":7,"date":"7 February 2003","review":"Regardless of its faults, my 7 year old daughter and I had fun and enjoyed the movie, which is what counts.  Obviously, the movie is not intended to be a masterpiece or believable, but children will find it very funny and adults may enjoy it too.","user":"cleeseely","rank":[22,29]},{"title":"Silly and Funny..But Very Well Put Together..","rating":7,"date":"19 January 2003","review":"I am very hard on Movies and will admit that this is a Silly kind of movie but it was easy to follow and was in all honesty, very, very funny. Better than most Adam Sandler movies and minus all the language and sexual content that Sandler and others seem to sneak into movies they try and sell to \"kids\".  This is a typical O'Connell role and he plays it well. Estella Warren spices it up and keeps her integrity as an actress in check.  She looks good no matter what she does anyway but the movie does not lower her standards at all.  It is a great movie for the adults to laugh with and the kids in the theatre were having a blast.  Plus, anytime Movie Critics trash a film, the odds are it will be a weekend Number #1 movie and you will like it. It did $18 million on the open and will clear $40 mil easily. Not bad for the budget it was made with. Good Job Bruck... 6 stars out of 10....<br><br>Have a great time and don't be to picky or critical. It is a movie about a Kangaroo after all!!","user":"rm051694","rank":[36,52]}]