[{"title":"this one shines....","rating":10,"date":"6 February 2003","review":"I saw this one a while back in the end of 2001, and I was very interested as it was the true story of the drug game in the mid eighties.  This movie is actually AZ's side of the story(AZ is Ace played by Wood Harris[Above The Rim, Remember The Titans, The wire]). well, it tells the story of drug kingpins AZ(Ace), Rich Porter(Mitch)and Alberto \"Alpo\" Martinez(Rico). Cam'ron really displays some actin' skills in his part as the trigger-happy, O-Dog reminiscent Rico(\"alpo\"), Wood Harris gives a very different performance from his previous roles in Above The Rim and The Wire as the laid back Ace. but this one belonged to Mekhi Phifer(8-Mile, Clockers) as Mitch(Rich Porter) he really came out and busted out Rich to a \"T\"! the certain flare that was necessary was there... And havin' DJ Brucie B all in the movie really put the icing on the cake for a rugged street feel, VERY Authentic...<br><br>underrated movie - this needs to be seen<br><br>10/10","user":"whoTheFuqRyou","rank":[32,39]},{"title":"Wow, what a great film!!!","rating":3,"date":"3 November 2004","review":"I was scanning through the channels one night and stopped on this film. Man, was I glad. It's nice to see the filmmakers trust the audience and their film by not cluttering up scenes with music. The silence was golden. Great direction, great acting and great music! I could tell this was based on a true story. It was so edgy and gritty it could not have been made up. The hardest part of making a true story work is keeping it real, they did that. I recognized all the actors, some one needs to hire Cam'ron he was great. I don't think you can compare this with New Jack City, I liked New Jack City but it was allot softer the Paid In Full. I could feel the tension in some of the scenes, it was powerful. I might buy this one.","user":"jdb-4","rank":[18,21]},{"title":"I was hoping for this...","rating":9,"date":"23 January 2002","review":"I am glad that there is a movie based on the lives of legendary Harlem kingpins Alpo, AZ and Rich Porter coming out.  I saw this movie and it really went back to the old school w/ music from Rakim(\"Paid In Full\" which is the theme of the movie).  It shows the ups and downs of the drug game and is focused mainly on AZ(David Sherwin(Wood) Harris).  The surprise came from rapper Cam'ron as Alpo(but is called Rico).  I don't want to give it away but for those people who checked the street documentary, \"Game Over\" would really understand this movie as well as those who knew AZ, Rich and Alpo personally and those who know the legacy of these hustlers.<br><br>It gets a 9 from me, I loved it","user":"Bring Da Ruckus","rank":[11,12]}]