[{"title":"A visual and sensual feast!!!!","rating":10,"date":"8 February 2005","review":"We had seen only the original silent movie, not the stage play, (or even the soundtrack) before going. So we knew not what to expect. But at the very opening, as the long-dead chandelier rises to life, swinging in what seems like one endless arc, and scatters the colour of memories about as it flames back to life, and the theatre is washed in colour and majesty not seen in decades... we both knew this was going to be good. And it was. <br><br>When it comes to sets, scenery and cinematography, they spared no expense. Every scene is drenched in rich detail. At the risk of sounding the heretic, I must say that a movie version removes the limitations of space and time to set up the stage, and so has the upper hand in the scenery and sets department. Some of these shots must have taken weeks to compose, and I'm glad they invested the time. <br><br>The music is just wonderful. I'd dare say that even if you are not a musical fan, if you are at least romantically inclined, you will LOVE this movie. By the end of some songs, like, \"All I ask of you\" I'm restraining myself from singing the song out loud with them! <br><br>The movie kind of departs from the setting of the original silent movie, in which the Phantom is actually quite hideous. This Phantom is more \"mysterious\" than hideous. But the attraction between him and Christine is pure, raw sensual. I mean it borders on erotic it's so strong. <br><br>During \"Past the point of no return\" I'm sitting there with my wife, literally falling under the spell myself. \"Yea... maybe she *should* be with this guy after all...\" But that's the whole point. She WAS influenced by him, and he did cast a strong spell, and he was very alluring. The movie made it so real I was beginning to feel it myself. <br><br>Some people have derided Gerard Butler's performance. Frankly, I find his throaty, sometimes raspy voice to be right on par. I heard so much ado about Michael Crawford that I went to Amazon and listened to some of his renditions of these songs. Verdict: Give me Gerard Butler! His voice is masculine, seductive, and hypnotic. In the final verdict, I find the movie versions of these songs to be FAR superiour to the Broadway versions. I say \"Bravo!\" to the selection of Gerard.<br><br>Definitely worth seeing in a theatre if you can. Don't wait for the DVD. See it BIG and LOUD. <br><br>My favs: Masquerade! \"All I ask of you,\" and \"Point of No Return.\" <br><br>Wow... Point of no return had ME believing!!!!<br><br>What raging passion floods the soul,<br><br>what rich desire unlocks its door,<br><br>what sweet seduction lies before us, ...past the point of no return...<br><br>Oh yeah, that's the stuff!","user":"kirby-21","rank":[39,44]},{"title":"Never loses it's beauty....","rating":9,"date":"8 January 2005","review":"I have just come from seeing phantom and was completely swept away. The stage show is my all time favorite Broadway show and I was a bit nervous as to how Phantom and the music of the night would hold up on the big screen but I needn't have worried because it was very definitely worth the price of the ticket-and then some.<br><br>The movie, for the most part, retains much of the stage show, I'd say about 85 percent true to the show, though there were slight differences. The magic present in the show live, is still, for the most part, here on film. In fact, I was wondering if I would cry during the movie and of coarse I did. Phantom of the Opera's's loveliness is still so luminous and the movie just fills your senses. I don't think there was a sound in the theater during the whole movie.<br><br>The film's look-among the most riveting I've ever seen-colorful, rich and oozing vibrancy, the look and feel are just magnificent. I sure hope this movie wins some awards for it's costumes and Cinematography. At times, there was almost a bit TO much going on which, as my friends and I discussed takes the focus away from the music a bit and maybe(though I'm torn on this) they should have toned it down just a tiny tiny bit. Still, the look was so spectacular I'm not even sure I'd definitely have done that myself. But still, 10 of 10 for atmosphere.<br><br>The casting-pretty good for the most part. I simply cannot believe Emmy Rossum is only 18 years old, she is magnificent and I am in awe of her. She was a beautiful, lovely Christine and I think we'll be seeing a lot of her in the future.<br><br>Gerard Butler has been getting some flack. I actually liked him in the role of the phantom although I began to feel more strongly about his rightness as the movie went on, not right at the beginning. That is not because he wasn't good in the role, just different then the stage version. To me, his singing got more and more soulful as the movie went on and his acting was an A plus, he wasn't just there to sing and look pretty, he acted the heck out of the role and succeeded in elevating the phantom from just a presence to a tortured individual. People have been saying he's to good looking, well that's certainly not his fault!(though they really could have gotten a more realistic looking mask for him to wear.) And besides, his looks are transcended by the end, they lose their focus until we are barely aware of them. He did a really good job. Patrick Wilson surprised me the most, I think in a way, I enjoyed his voice the most. He was simply Superb, and he too, embodied Raoul. He is a talented actor with a moving, gently powerful voice and he was great. Minnie Driver, Miranda Richarardson-all great. Good casting choices.<br><br>All in all a great night at the movies-I am giving this a 9 and I think if I had to say why it's not a perfect 10, it's just that this story was meant to, first be, a theatrical production, and as good as the movie was, and as many tears as I cried, it did not haunt me in the same way as the stage show. That does not take away from the movie's power or magnificence, I'm not even sure it could have been any better at all as a movie. It's just that seeing it live sends chills down my spine and haunts in a way that only a stage musical can do. I can actually understand how some people are not impressed by Phantom because, the bottom line is, this is as much about the music as the story and if one isn't a fan of this type of music, one probably won't simply find a lot here. But for those who have seen the beauty of Phantom on stage, they'll (probebly) love it and better yet, for those lucky enough to come into this film, and love it, WITHOUT having ever seen the play-see the play-because if you think the movie version is the stuff that magnificence is made of, think about all that live on stage right in front of you. This movie is good and I admiringly give it a 9 of 10.","user":"triple8","rank":[213,264]},{"title":"Play it AGAIN!!","rating":10,"date":"24 December 2004","review":"This is what I found myself saying when the end credits started rolling. I have seen the Stage Play 12 times. I have read the Book so may times I can not count it(LEaroux AND Kay's books). I will not put spoilers in here. All I'm going to say is go INTO it with an OPEN MIND. Some of the scenes are different from the Stage play. IT IS NOT a shot by shot remake. Bring Kleenex. Your going to need them. Butler plays Phantom with so much Intensity you CAN'T help but love him. I am NOT a fan of Minnie Driver by any means, but I have to say I liked her in this movie, she was even funny in it. As for Rossum she makes a good Christine. The costumes and the scenery were Beautiful. 2 days after seeing it, and I'm STIL IN AWE.","user":"lenoresden","rank":[447,567]}]