[{"title":"Not as Bad as People Say","rating":6,"date":"14 November 2018","review":"Honestly, I've never understood the hate for this movie. Is it the best buddy cop or action comedy movie? Obviously not. Have both Eddie Murphy and Robert DeNiro made better movies? Of course. Does that mean this movie sucks? Not in my opinion.<br><br>Most of the people who watched this probably came for three reasons:<br><br>1. They liked either one, or both, of the two main stars.<br><br>2. They like buddy/buddy cop action comedy films.<br><br>3. They came because of both of the first two reasons.<br><br>\nNow, as I said, obviously it's not the best movie, but it was originally intended as a satire, or at least as a little jab, at the 'buddy cop' genre, so naturally it's not going to take itself incredibly seriously. Some have made the case that the film ends up becoming the kind of movie it's supposed to be making fun of, and while that's true, it still ends up being enjoyable.<br><br>Critiques:<br><br>If you like the loud, potty-mouthed, confident, hilarious, charismatic Eddie Murphy from the 48 HRS or Beverly Hills Cop movies, you will get a little of that, but not as much as you're probably hoping for. Now, obviously, Eddie will have some funny scenes just because he's Eddie Murphy, but he is still limited by the script, and it doesn't seem like he ever is able to really cut loose or be himself, and some of his lines can feel forced at times.<br><br>Now, while I didn't find the main plot to be that bad, it is still not the best, and it's not super-engaging. The plot is that two very different police officers (Eddie Murphy, Robert DeNiro) are approached by a TV studio who are looking to make a hit buddy cop show, and the two are coerced into going along with it as the stars. This does prove for some interesting moments, but it's not enough to carry a movie on.<br><br>The other main plot, which one could argue, devolves the movie into becoming just like any other buddy cop movie, is the suave, sophisticated, nefarious, foreign arms dealer who rolls into town selling high-powered weaponry. It's not incredibly interesting, but it serves its purpose, and it does take a back seat to the TV show plot, at least until the third act.<br><br>As for comedy, this flick did have some funny moments, but it just didn't seem to really try, and other times, it didn't try at all. Overall, it is funny, but not as funny as a lot of the films that it's trying to be.<br><br>Postive Things:<br><br>The action, at least what's there, ends up being pretty well-done, at least the large-scale car chase about halfway through, the bar fight, and the final climax. I'm glad that the movie didn't focus solely on action, as the action wasn't the point of the movie, but the action that is there, while fine, did't feel entirely realistic, or just not super engaging, but I did like it.<br><br>I did enjoy the disagreeable chemistry between the leads, and I definitely think that Eddie Murphy saved this movie, even if he wasn't at the top of his game.<br><br>Director Tom Dey hasn't done much, but he does have \"Shanghai Noon\" as one of his credits, which is honestly a much more enjoyable film. I'd definitely recommend that one over this film.<br><br>Overall, I did like it, but it didn't need a sequel, and I'm glad one never came. 6/10.","user":"monkeysgalore","rank":[7,7]},{"title":"Funny Movie!","rating":10,"date":"4 October 2002","review":"I don't care what some of the reviews said, this movie was funny.  The thing with this film is that you can't expect anything else except to be entertained.  This is not some intellectual comedy, this is a clever popcorn movie.  The three main cast members are great and work very well with each other.  Shatner is a standout in the supporting cast as himself, a former TV cop, brought in by Russo's character to coach the cops on how to be \"TV cops.\"  Those are by far the funniest scenes.  If you want to be entertained and just sit back for a laugh, then watch this movie.","user":"StreepFan126","rank":[44,59]},{"title":"A fun film, and it even has Robert De Niro","rating":7,"date":"16 May 2002","review":"I cannot understand why so many people did not like this film. Robert De Niro was on top of his game, delivering his lines with such aplomb, one has to believe this is his everyday demeanor. Granted, the film seemed to take on many buddy-film conventions while trying to make fun of the concept, it goes without saying this film was genuinely funny. From the police dog, to the fact Eddie Murphy didn't annoy the heck out of me, this film is a real keeper. Rene Russo also evened out the rest of the cast perfectly, establishing her role so it does not interfere with the budding relationship between De Niro and Murphy.","user":"Agent10","rank":[43,58]}]