[{"title":"Classic love story","rating":20,"date":"20 May 2003","review":"I thought about doing this review long ago (and actually started it at one point), but, well, you know how it is... but I just happened to catch the first hour when I went home at lunch, so here goes.<br><br>All Over the Guy is, ultimately, a classic boy meets boy, boy falls in love with boy, boy loses boy, boy gets boy back.  In short, the kind of movie I wished for most of my younger life.  It is -- yes, let's just say it and get it over with -- sweet.  And that's nothing to be ashamed of.<br><br>\nFirst, a disclaimer -- I have worked with both Rich Ruccolo and Don Roos (I haven't seen either in years)... but that makes my love of this film all the more amazing.  I find it difficult to watch films of actors I have worked with because it's hard to separate the character from the person I know. Rich succeeded in making me forget the actor and concentrate on the character of Tom.  Tom is at once vulnerable and supremely sexy; you're not sure whether you want to hug him like a teddy bear or throw him down and get wild with him.<br><br>Dan Bucatinsky's Eli is perhaps not the polar opposite of Tom he appears to be.  Tom almost physically runs from relationships while Eli backs away apologizing the whole time.  They both embody the whole kaleidoscope of feelings that most of us have when we meet someone who interests us -- mostly, of course, fear.  Fear of falling in love, or of not falling in love.  Fear our feelings won't be returned, or that they will.<br><br>Personally, I see an enormous amount of chemistry between Tom and Eli. Look at the scene in the flea market, the interaction of their eyes, the body language... here are two guys who are fighting what they're feeling every step of the way (oh, and by the way, Eli is much more forgiving that I would be about the smoking).<br><br>The rest of the cast is superb as well, including some great cameo roles. Most of all, the characters of Brett and Jackie are very funny in a superb role reversal -- instead of the ubiquitous second-banana gay best friends, we have second-banana straight best friends.<br><br>The only problem I have with the film is the same problem I have with straight versions of this kind of story.  How likely is it that people who appear to have such different interests and such volatile emotions will stay together... not to mention Tom's penchant for alcoholism.  But then in \"Pretty Woman\" I just couldn't shake the feeling that this rich guy wouldn't stay with a prostitute long whether she looked like Julia Roberts or not.<br><br>\nGay cinema has, thankfully, branched out from the early \"Oh my God I'm gay I hate myself I can't let anyone find out\" films like \"Doing Time On Maple Drive.\"  There is a place for gay cinema in every genre.  And this film is in a definite class by itself in its genre.<br><br>Enjoy!","user":"keithla43","rank":[31,33]},{"title":"\"All's I know is...\" it's right on the mark!","rating":9,"date":"28 April 2002","review":"I've been expressing my distaste of so many gay-themed films to so many friends about how the films portray the men as stereotypical, young, pretty, and FABulous. And worse yet, always throwing in the obligatory drag queen. With the current trend of fantasy lesbianism, the gals are hot and act like everyday people but the gay males are kept in a lower level of being effeminate and weak.  This of course is because heterosexual males only feel safe if the gay men aren't portrayed as masculine (that's why so many of the straight guys are terrified of Cruising, seeking comfort in the delusions of The Man Show and Howard Stern).<br><br>All Over The Guy is a film that breaks the barriers and focuses on issues of intimacy and finding ways to communicate -- and it's a big shame it didn't get the major distribution it deserves as it is right on the mark and so much more enjoyable than the endless line of circuit boy romances being released.  Yes, there is a LOT of bickering and arguing going on between all the characters in this film, and that may become tiresome and turn some viewers off.  But when you really listen to what they say, understand their backgrounds, and realize that this is the kind of thing that really does occur between friends everyday, it makes for fascinating entertainment. The dialogue is sharp and quick and not in the campy way, but in the way that friends who know each other can convey in codes and gestures without a lot of extra narration. This film is chock full of HONEST dialogue. I know some will compare this to an R-rated type of Will &amp; Grace, but the big difference here is the characters in All Over The Guy are very real and have much more dimension than the sitcom offers.  It doesn't dwell on stereotypes for laughs, and even in a speach by Richard Ruccolo about the film In &amp; Out was one the TRUEST things I've ever heard about Hollywood and how mainstream \"gay\" films are so horrible. His character Tom is actually a bit rough around the edges and is refreshing because he's not portrayed as a youth obsessed club type.  Dan Bucatinsky's character of Eli may be well groomed, but he isn't snapping his fingers and saying \"girlfriend\" ...these guys are just regular men, and it is comforting to know that someone out there knows the truth that many gay men are just as average as most people. Besides, Eli loved Planet Of The Apes memorabilia and that's a nice change from the usual cliched obsessions .  I have always thought Adam Goldberg was a cool actor, and his involvement as Jackie's love interest was wonderful, as was Sasha Alexander as Jackie -- I sure wish I had her as a friend!  Good moments from Christina Ricci, and Doris Roberts was perfect (wow, can she cuss too!). I just wish Lisa Kudrow was given a little more to do!  Joana Kerns was a nice surprise and as always, I WORSHIP the ground Andrea Martin walks on, she's one of the funniest women around.<br><br>It's one of the only films I've seen that touches on issues that I've been trying to get so many people to understand: how so many assume gay men are only looking for quick sex and that when you get two guys together, it is assumed that one certain type of sexual act will occur.  All Over The Guy discusses definitions of sex and the importance of intimacy and it's refreshing to see it handled in a manner that doesn't come across as preaching.<br><br>For me, I was extremely impressed by the choice of music.  Instead of diva tunes from Cher and others like that (gawd, we don't all listen to Streisand or the latest flavor of the month \"Destiny's Child\" type group), there are very good rock songs by David Gray, The Jayhawks, Matthew Sweet and others that help keep the story grounded in reality.  Even the club-type \"Future Love\" tune during one scene was more akin to a B-52's song than the fluff that saturates Queer As Folk's soundtrack.<br><br>It gives me great hope when I see a breakthrough film like All Over The Guy. It's for everyone, as this is not exclusively a \"gay\" film.  I just hope that other film makers will see this one and learn that you don't have to make a flamboyant dragfest or youth worship type of film in order to involve a gay element.  This is impressive filmmaking and funny, funny stuff!<br><br>And don't forget about Joan Van Ark in \"Not Without My Nosejob\" (wink wink)!","user":"hippiedj","rank":[41,45]},{"title":"Hey, it worked for me!","rating":16,"date":"16 August 2002","review":"Well, I wonder: if it had been about two male/female couples (as the play it was based on was), would \"All Over the Guy\" have gotten such a critical reception?  More likely it would've been seen as an honorable, at times sparkling, addition to the screen tradition of romantic comedies -- which is what I think it is.  Sure, the characters are wildly neurotic and frequently annoying; so are people in real life, especially when they're in love.  Is it distracting that Richard Ruccolo (who does indeed give an exquisitely tuned performance) is so good-looking?  Actually, I thought it was necessary; Tom is so screwed up that we need the physical beauty to help relate to him.  Do the women steal the movie?  Well, with the likes of Andrea Martin, Lisa Kudrow, Christina Ricci and Doris Roberts in support, what do you think -- and how can you lose, especially since Dan Bucatinsky's script is so frequently sharp?<br><br>Forget the nay-sayers and see this one.  It's a very good romantic comedy, at times maybe even a great one.","user":"redoubtable","rank":[21,22]}]