[{"title":"an adorable movie with a great show from Reese Witherspoon","rating":7,"date":"6 April 2006","review":"My rule when rating movies is to review it all by itself....don't compare it to something else that's completely different from itself. That's the mindset you have to have when watching Legally Blonde, the movie that Reese Witherspoon managed to get a Golden Globe nomination out of. No kidding here. It's really an adorable movie that is appropriate for any age....a very light PG-13.<br><br>Elle Woods (2006 Oscar Winner Reese Witherspoon) has it all....the perfect boyfriend, Warner, who is handsome, charming, and driven, the perfect life, awesome friends, and a really cute dog. But all of this seems minuscule to the fact that her boyfriend has just dumped her because she is not serious enough, and he wants a girl that is well received by the public when he begins his political career. So, Warner enrolls at Harvard University, leaving Elle (it sounds like the letter 'L') disheveled and sad. Then, 'going where no blonde has gone before' (good use of tagline, right?), Elle decides to work extra hard to enroll at Harvard to win her man back. Well, Elle (funny rhyming there) achieves the requirements in tests and community service, and sends in a very interesting video essay, and gains entrance to the prestigious university. She quickly finds out that not only is her dream man already engaged to another woman (Selma Blair), but Elle is not widely liked around campus. She finds her calling in law, and with the guidance of a friend (the likable and funny Luke Wilson), proves to be a talented prospect in the field.<br><br>The film is a very watchable film from start to finish, as the movie's opening theme song (Hoku's hit song \"Perfect Day\") is catchy and likable. Reese Witherspoon's performance is so great and hilarious, yet so true to herself as a person. She shines like the sun in this movie. It can be a little silly at times, not to mention a tad unrealistic and dragging, but Witherspoon's ability overshadows those unfortunate facts. The supporting cast is also good, with Selma Blair and Luke Wilson leading the bunch. Also in there is 'Waiting...' star Alanna Ubach, Matthew Davis, Jennifer Coolidge (NBC's 'Joey'), Ali Larter, Victor Garber as Elle's law professor, and 'Scooby-Doo' star Linda Cardellini.<br><br>This is the ultimate 'girl power' movie that every person without a Y chromosome will love. Not all men will like it, but I enjoy it whenever it's on television. It's not something I'd buy, but one that is a great rent for the whole family. Also, a word to the wise: watch this one, and this one only, for the sequel is probably the most disappointing sequel in history.<br><br>7/10 --spy","user":"The_Amazing_Spy_Rises","rank":[48,54]},{"title":"Good Movie","rating":9,"date":"12 July 2001","review":"Saying this is a good movie may not sound like much, but after watching all the other summer movies, this is a breath of fresh air. Reese Witherspoon is proving to be one of the best young actors of our time and she makes this movie something fun to see.  Other than \"The Sexy Beast\", this was one movie that was any good so far this summer.","user":"tomrito","rank":[13,13]},{"title":"Avoids the Stereotypical and Worn Roots of Previous Girl-Power Comedies...","rating":11,"date":"11 April 2003","review":"I didn't go into \"Legally Blonde\" expecting too much. I rarely go to actual movie theaters to see a film (I usually rent videos/DVDs), but I got an advance on this one, and I was kind of sad it had to be this film I was going to see, but I had been invited along with two other people to see it and I wasn't going to say \"no\" for no reason. So I went.<br><br> One of the persons I went with just wanted to see Reese Witherspoon in a Playboy bunny costume, so I figured I was in for another average run-'o-the-mill sex comedy. But I was very surprised with the outcome.<br><br>So many girl-power comedies these days are made just for the sake of trying to prove a point that women are equals to men (I suppose that's the message behind it--what else was \"Now and Then\" made for?) and/or support for women. Fortunately, the 2001 hit \"Legally Blonde\" is not only a pleasant surprise, but an intelligent film, as well. (Sorry, that was my main \"gripper\" for this review and I had to leave it in.) <br><br>Reese Witherspoon plays California sorority girl Elle Woods. Unlike other people her age that are worrying about grades in school, Elle only worries about what toilet paper is the softest. But after her boyfriend dumps her and goes off to Harvard Law School, Elle is determined to go to Harvard and get her man back. So after putting together a very shallow video for the chairmen of Harvard, they accept her into the prestige college (because of her innocent sexuality, no doubt, as we see them gaping at Elle in a bathing suit on the video), and she packs her bags and heads off to Harvard with her little dog Bruiser; as the ads say, \"Boldly Going Where No Blonde Has Gone.\"<br><br>\"Legally Blonde\" doesn't give up on the plot and completely divulge into dumb blonde/sex jokes. This film not only has a funny--if ridiculous--plot, but the jokes are, surprisingly, NOT crude sexual jokes. This film is not another \"Scary Movie\" made for teens: It has divinely orchestrated comic timing. <br><br>Sometimes the plot gets a bit too heavy--the whole teacher-hitting-on-Elle thing is a bit stereotypical for a film like this--but in the long run it seems to break away from the typical girl-power comedy.<br><br>\nReese Witherspoon tends to play the same characters a lot, but hey, if she can pull them off, good for her. I don't mind if all her characters tend to be the same (to a certain extent) because they tend to be quite funny and cute--who can't laugh at her Elle Woods persona? <br><br>The film has a very nice co-star cast: Victor Garber (\"Titanic,\" \"Sleepless in Seattle\"), Luke Wilson (\"Blue Streak,\" \"Charlie's Angels\"), and Selma Blair (\"The Sweetest Thing,\" A Guy Thing\"--pretty much anyTHING).<br><br>In the end, not only does \"Legally Blonde\" come off very funny, but also very witty, good-natured and sweet: One of the most pleasant surprises of 2001, indeed.<br><br>4/5 stars -<br><br>John Ulmer","user":"MovieAddict2016","rank":[84,103]}]