[{"title":"Directors cut so much better.","rating":7,"date":"23 January 2005","review":"When I heard about a directors cut to this movie I never imagined it would be so much better than the original release. Why must movie studios always feel they know better than the director. This film would have been much more successful had they left it alone, but by insisting on so many cuts and changes they shot themselves in the foot. All because they wanted a family friendly spider-man type film instead of the much more dark and violent world of daredevil. Every scene added to the film makes you wonder why they cut it in the first place. It isn't just about adding scenes though they have taken a couple out too. I can't imagine anyone who would miss the fireside love scene. I urge everyone who saw the theatrical cut to watch the directors cut. It isn't a perfect film but it's a more complete and enjoyable one. Also watch the documentary on the directors cut DVD and see one of the producers trying to defend the original release and then actually saying he thinks it is the better cut. I think he must be more blind than Matt Murdock!!!","user":"p.greenwood","rank":[180,225]},{"title":"Forget the theatrical version, buy the director's cut DVD instead!","rating":9,"date":"1 December 2004","review":"This review is for the Director's cut DVD of Daredevil. In all honesty, i liked the theatrical version of this movie. But now that i have seen the true version of this movie, the director's cut, i don't have any desire to watch the theatrical cut ever again. The director's cut is an improvement in every way. Everything makes sense now, and the characters are more fleshed out, which is a very good thing. <br><br>The DC is 30 minutes longer than the original cut, of which the new footage ranges from a whole new big subplot, and little things, that actually have more impact and and make the movie more understandable and better than you might imagine. The action scenes are way better also. The DC makes the movie into what it should've been in the first place before the studio screwed with it. I can't believe how much the studio hacked this movie up for theater..it is quite ridiculous. But now with the movie restored to it's original vision, i can fully enjoy it without the thought of something missing from it. In comparison, the only thing that the original DVD release has over this new DC DVD is it has a second bonus features/behind the scenes disc. <br><br>The DC DVD is one disc, and has a few movie trailers, a making-of featurette, and an all new audio commentary. Despite it's shortcomings in form of a second disc compared to it's counterpart, i'd choose the DC over the theatrical version any day. The DC is simply so much better. Forget what you know about the theatrical cut of the movie, and give this new DC version a chance..it is superior to the other version in every way. So give it a try, and i think you might be pleasantly surprised. Even those of you who hate the original cut. <br><br>My vote, in comparison: Theatrical version- 5.5 Director's cut version- 9.5<br><br>In closing, i'd like to thank the Director, the film editors, and everyone else who made this wonderful Director's cut DVD possible. I love the new version, and it's nice to see the Director's vision restored to this movie after nearly 1 1/2 years. Two thumbs up! R.I.P. Daredevil theatrical version!!","user":"KryptoniteCornCob","rank":[225,300]},{"title":"director's cut- do yourself a favor. See it","rating":9,"date":"16 January 2005","review":"First of all, i was never a reader of the comics, and didn't know much about daredevil before venturing into the cinemas to see the original when it was released. At the time, there wasn't much action out and i like most of Ben Affleck's movies, so though i would give it a go. Although i liked the theatrical release ( but didn't love it) i still bought it when it came to DVD...and to be honest, when i watched it the 2nd time on DVD, i didn't think as much of it, as when i left the cinema.<br><br>So when i heard the directors cut was out, and people who hated the first release, but liked the 2nd one, i thought wow, i didn't mind the first, perhaps i will really like the new version. and guess what? I did ! Its absolutely fantastic. After the characters were fleshed out more, the storyline was more involved and filled in the plots- you actually cared about what happened and got more into the feel of being apart of what was going on in hell's kitchen.<br><br>If you watch the \"featurette\" : giving the devil his dues, you will understand that Mark Johnson the director, absolutely loves this material, loved the comic, and was disappointed himself with the theatrical release. He understood why the critics &amp; fans alike didn't support it, and really wanted to fix the problems with this DVD. When will Hollywood studios &amp; executives learn, a 100 minute movie, does not mean a better movie - and when will they learn that audiences DO want more than just action - we can think, you morons! And can hold our attention for more than 100 minutes. Here's a simple plan for your money making schemes - and this goes to Gary Foster ( producer who still says the theatrical version of daredevil is better) If you make a GOOD MOVIE, that gets good reviews, and that fans &amp; critics enjoy, then more people will see it, more people will see it a 2nd time, more people will recommend it to friends, and that means a bigger audience, a repeat audience and bigger dollars for your pockets ! So while the first was a quick paced movie that made quick bucks, a longer - more thought-out MOVIE, would have garnered longer life at the box office.<br><br>in a word - RECOMMENDED !","user":"realhiphop","rank":[185,247]}]