[{"title":"Requires major belief suspension but is engaging, slick and quite exciting","rating":19,"date":"19 April 2005","review":"Morgan Sullivan is a businessman who, rather than work for his father-in-law, takes a strange job working as a corporate spy for a company called Digicore. His assignments are simple and boring; attend a conference and use a covert device to transmit the speeches back to HQ. At one conference he meets a mysterious woman called Rita and flirts with her. On his flights and during his sleep he is bothered by vivid dreams and voices in his head; he thinks nothing of it but then his next meeting with Rita reveals something much more sinister than the basic assignments he thought he was getting and he soon finds himself in deep.<br><br>I had never heard of this film at all before watching it, nor did I even know anything about it whatsoever and I only ended up watching it because I had FilmFour free one weekend and this was one of the few films that they showed that was worth seeing. I'm glad I came to it with nothing because I found myself engaged from the start and the twisty plot was great fun even if the final five minutes could never have hoped to have delivered above and beyond what had come before. There are those that complain about the ending being \"terrible\" are perhaps being too harsh although I will acknowledge that it is a bit too tidy for its own good. The plot requires a lot of suspension of belief (and I mean a lot) but once you get into it it moves along really well and does keep you watching to see where it goes. It is helped by the way that it starts out in a \"normal\" world that many of us will relate to  boring business presentations and conferences that you wonder why you bothered. If you can keep up with it from here on then it is enjoyable even if logic and sense.<br><br>Visually the film really works even if the budget constraints are clear here and there. Director Natali injects a lot of style and imagination into it and also delivers a real sense of urgency and paranoia that helps the material work. The cast are a mixed bunch, although in this sort of film the characters tend not to be that well developed in all parts. Northam takes the lead role and does it well, making his character a drag little everyman but also convincingly changing him gradually across the film. Lucy Liu is not as good; she is a bit flat but fortunately she has limited screen time and was only what I'd call really bad one time. The support cast are all OK, delivering the required mix of the ordinary and the sinister to good effect even if they are all pretty straightforward.<br><br>Overall this is a nice little thriller in the style of things like Usual Suspects, Memento and the like. You do need to suspend belief and, if you can, it is enjoyably twisty and slick and is pretty exciting. Of course if you dislike the genre (the sort that has to keep moving for fear of getting caught by its own lack of logic) then you'll hate it but everyone else should at least get a fun 90 minutes from it.","user":"bob the moo","rank":[73,85]},{"title":"Stylish Film! Good Action Sequences!","rating":24,"date":"24 July 2005","review":"There was a stylish approach to this film on the part of director Vincenzo Natali with interesting camera angles and effective close-ups. It was also refreshing to see Jeremy Northam and Lucy Liu given leading roles and expanding their range as performers. This film also included one of the most imaginative \"escape\" scenes in recent years. The efforts of the director and the actors combined in an effective thriller.<br><br>Although the plotting of the film was convoluted, the story progressed very clearly as the layers of corporate greed and skullduggery were revealed.<br><br>In 1949, George Orwell suggested in his famous novel \"1984\" that the future would be ruled by the totalitarian State, which would control minds and diminish human liberty. It was interesting that in this intriguing futuristic film, it was not the State, but rather the corporate world that controlled and devalued the human worker.","user":"lavatch","rank":[109,132]},{"title":"Clever, visually tight movie","rating":30,"date":"30 April 2004","review":"Cypher was a movie I was looking forward to after I had read some comments here about it's story being like the works Philip K. Dick, an author whose paranoid tales I love to read.<br><br>As far as plot twists go Cypher never disappointed me, even though the last plot twist was a bit out there, it had a very cool ending that was very satisfying. The level of suspense was ok, this movie was not a nailbiter but it has really nice atmosphere at times with the opening music theme and the many shady operatives. A thinking man's movie as well, you need to pay attention throughout the movie or you will lose track. No problem in the DVD-age I would say. Overall it was acted very well. Jeremy Northam and Lucy Liu definitely deserve movies as good as this, although they don't seem to have found that many in their careers. <br><br>Visually the movie is stunning, it is filmed very tight and stylish, with a few well-dosed effects. This movie probably had a relatively modest budget but it looks awesome. Overall this was a very pleasant movie experience.  <br><br>\n8 out of 10","user":"FlorisV","rank":[100,122]}]