[{"title":"Stupid, yet entertaining...","rating":8,"date":"15 December 2000","review":"I love stupid movies... I live for them, in fact, and this was definitely stupid.  Spend the $5, go see it for yourself!  If you weren't interested in it, you probably wouldn't be looking at reviews in the first place unless you're a concerned parent (let your kids see it, it's not too bad), or if you hated it and wanted to see if anyone actually enjoyed it.  I did, and I recommend it to anyone who just wants to laugh at the antics of two total stoners.  Personally, I think a different ending could have made this movie a lot more enjoyable, but I don't want to give it away, so see it for yourself.  This one won't win any awards (with a name like \"Dude, Where's My Car?\" one wouldn't expect it to be a contender, anyway), but for all of us who have had a \"night to remember\" that we forgot, it's damn funny.","user":"dr_hollygoodhead","rank":[136,173]},{"title":"Shibby-est Movie Ever!!!","rating":9,"date":"17 October 2006","review":"Of all the stupid (yet funny) movies out there, \"Dude, Where's My Car?\" is definitely one of the funniest.<br><br>Nowadays, so many stupid/funny stoner movies are out, but none can really compare to the hilariousness that Chester and Jesse bring out of each other. Reminiscent to Beavis and Butthead, they cruise around as two aimless stoners with no real purpose in life but to shibby, shibby, and shibby. (Shibby, which could stand for ANYthing, really.) Being the first to fully implement the words \"Dude\" and \"Sweet\", Jesse and Chester deserve two thumbs-up for this stoner movie. Teenagers of any generation would definitely enjoy it. I've seen it a hundred times and still love it to this day.<br><br>Shibby!!!","user":"sweet_angelhugs","rank":[62,76]},{"title":"Lighten up, people!","rating":10,"date":"24 June 2001","review":"\"Dude\" is by no means an intelligent movie, nor does it want to be one. However, it is treated as one by the public. If you don't like stupid movies, why did you go see it anyway!? I mean, personally, I love stupid movies. American Pie, Idle Hands, Evolution- all genius. But if you see any of them thinking you are going to get an intelligent comedy the problem lies within you and your lack of a sense of humor.<br><br>Or maybe you're just too old.","user":"sparrtacus","rank":[178,255]}]