[{"title":"Cinema has rarely been this exciting!","rating":10,"date":"28 October 2015","review":"Having seen Tarantino's 3 previous films, going into the cinema, my expectations for 'Kill Bill' were already over the roof. However, regardless of my high hopes for quality entertainment, I was not prepared for this film. I was dumbfounded. I was blown away. I had quite simply never seen anything even remotely like it.<br><br>In 'Kill Bill', the revenge plot serves only as a larger story arc, thus allowing Tarantino to play with as many different genres as he likes, and boy - what a mix he dishes out! With complete disregard for the conventions of filmmaking, he paints an expressionistic masterpiece in his own unique style, the likes of which the world has never seen before. Cinema rarely gets this exciting. With 'Kill Bill', Tarantino proved once and for all that all the hype around his persona is justified: he IS the most daring, original - and entertaining! - filmmaker of his generation. Simply amazing: 10 stars out of 10.<br><br>Lesser-Known Masterpieces: http://www.imdb.com/list/ls070242495/<br><br>Favorite Low-Budget And B-Movies: http://www.imdb.com/list/ls054808375/<br><br>All-Time Favorite Films: http://www.IMDb.com/list/mkjOKvqlSBs/","user":"gogoschka-1","rank":[172,217]},{"title":"Tarantino's Blue Period is OVER!","rating":9,"date":"10 October 2003","review":"Just saw Kill Bill: Vol. 1 and was surprised, to be honest, at how incredibly GOOD this film is. Here is a craftsman (or artist, if you prefer) at the top of his game. Some of the shots are simply incredible; the score is, for the most part, vintage Tarantino selections- and the RZA does a very good job at filling the blanks; Uma Thurman is a great female lead, for sheer presence (and decent acting chops). Even Lucy Liu, who I expected was going to re-hash her Charlie's Angel character, burst on the scene like a flaming nunchuck.<br><br>The stringing together of the scenes was impeccable. The transitions, the intercutting between dialogue, the flashbacks... I simply could not get enough. Tarantino IS, indeed, having fun here. He is giving us a film that may not go down as a classic, Pulp Fiction style, but that shows us what is yet to come. I doubt that he's lost his writing talents (as some have claimed), and I actually disagree that the dialogue in the film is \"poor\", or that there are \"no memorable lines\" (Empire). The kung-fu genre has never been a particularly good park to display Shakespearean writing virtuosisms. The lines work fine. The plot is simple enough, but Tarantino takes a burger and serves it as \"steak tartare with sauce au poivre and asparagus terrine\". He basically manages to cram so much information into the film that plot is simply irrelevent. What is relevent is the Bride's thirst for blood, her primal sense of vengeance and our total devotion to her. Bill, of course, is one of the greatest characters to ever NOT appear on screen. Overall, a great movie and an example of how a filmmaker's tool is not his pen: it's his eye.","user":"emperorpasta","rank":[64,86]},{"title":"I love this movie, I don't know why, but I just do.","rating":9,"date":"26 April 2019","review":"This is movie is unusual, but it works for me. It kept me intrigued from the beginning with the plot which is not entirely clearly, but that made it more interesting for me. There's a lot of action in the movie which I found excellent and enjoyed a lot. It might not be realistic, but its a movie so it doesn't have to be. The plot is amazing and I can't wait to watch volume 2 soon because of how intriguing volume 1 was.","user":"SafReviews","rank":[22,27]}]