[{"title":"Okay Comedy From The Mind Of Adam Resnick!","rating":23,"date":"23 June 2002","review":"Lucky Numbers is not a great film but a good one. I thought John Travolta, Lisa Kudrow and Tim Roth and Ed O'Neill gave fine performances. Lisa Kudrow is the only one of the \"Friends\" cast who doesn't make totally sucky movies. With the exception of Jennifer Aniston in Office Space and maybe David Schwimmer in Apt Pupil.<br><br>I really dug the Midwest American setting, the two bumbling cops, how Travolta's character Russ Richards wallows and loves his local celebrity status and his reserved parking spot at the local Denny's, and the great 80's soundtrack. And this has to be the first flick directed by Nora Ephron that I enjoyed.<br><br>Adam Resnick wrote the screenplay for Lucky Numbers and the more recent Death To Smoochy. Both these films are good but flawed dark comedies and deserve to be seen and enjoyed. So don't listen to what others may say and go see these two (flawed) Resnick gems. Ciao!","user":"newnoir","rank":[12,13]},{"title":"A guilty pleasure","rating":8,"date":"20 August 2002","review":"Picture this.... a room that is full of people and only one of them has any redeeming values whatsoever but that person is patently unlikable. If this sounds like it might be a fun story, you're right. I enjoyed this movie on the simplest and most shallow level. It's no great spellbinder, there is no big surprise, but it moves along nicely and had be laughing out loud on a consistent basis. The performances were good with each character convincingly revolting. This movie is on my \"Own It\" list. Not because it is a masterpiece but because it managed to entertain me its entire length. I recommend this guilty pleasure to anyone who isn't too wrapped up in pretending they are a movie critic for PBS.","user":"CommonSns1","rank":[20,24]},{"title":"One of my favorite underrated films","rating":8,"date":"25 October 2005","review":"Why wasn't this movie well-received? Simple. It's a \"dark\" comedy. And let's face it, the general public doesn't like dark comedy. They want to see goofy, Jim-Carrey-type comedies that make you laugh out loud, while making you feel all warm and tingly inside. \"Lucky Numbers\" doesn't, for a second, make you feel warm and tingly. But I have a dark, cynical sense of humor and this movie was a delight for me to watch. It's a good idea, and it was well-executed. The talented cast helps make the film work. Lisa Kudrow is never fully convincing as her ruthless character, but she's still fun to watch. I do think John Travolta gives one of his best performances, since he doesn't play the usual tough guy you see him play in movies like \"Saturday Night Fever\" and \"Get Shorty.\" Instead, he plays a total wimp of a celebrity, and he pulls it off with flying colors. The underrated Bill Pullman has some funny moments in his supporting role. I was definitely impressed with Michael Moore, who's never had any acting experience before, yet it's not in any way visible in his very funny performance. Also in the supporting cast, we have Tim Roth, Ed O'Neill and Michael Rapaport--all giving first-rate performances. The movie is set in the 1980's, so I liked some of the cool 80's music in the soundtrack. Yet at the same time, Nora Ephron didn't try to capture the 80's atmosphere by having everyone where dorky 80's fashions and big hair and all that other stuff. \"Lucky Numbers\" is just a well-written film with a lot of great gags, and I would recommend this to anyone who's a fan of dark comedies.","user":"guyfromjerzee","rank":[17,20]}]