[{"title":"I admit a guilty pleasure of mine I never thought this is a terrible film","rating":6,"date":"24 September 2017","review":"SPOILER: Uber Jason in outer space I don't mind the film and it is a guilty pleasure of mine. I saw this movie in the video store 11 years ago when I was in high school I saw the VHS cover of the film and I saw it on DVD. So finally I got this film on Blu-ray disc just finish it watching it today and I must say it is not a bad film I like it a lot. Like I said it is a guilty pleasure of mine. I know a lot of people hate this film I don't. I think is MILES way better then Jason Goes to Hell and Miles way better movie then Hellraiser: Bloodline that was in outer space this movie is just better.<br><br>7.years ago when I become a fan of Supernatural I heard that Jared Padalecki will be in the reboot Friday the 13th movie I rushed to see this movie. I watch Friday the 13th the original, Friday the 13th Part 2, the (2009) reboot and this film Jason X and yes I like it.<br><br>I thought this movie will copy Alien and Aliens but it didn't copy any of those films it was solid and it was original it had his own story. I didn't thought this movie was bad I thought it was an interesting story that had a good action and a good slasher kills.<br><br>Lexa Doig was an alright as the final girl tough it was a science fiction film it was still good and I will still watching it. Lexa Doig was in The Tracker with Casper Van Dien and I liked that action film I haven't seen in a while.<br><br>Jason Voorhees returns with a new look, a new machete, and his same murderous attitude as he is awakened on a spaceship in the 25th century.<br><br>Lexa Doig worked in facility Crystal Lake in which they capture Jason Voorhees but he kills everyone and escapes but Rowan Lafontaine (Lexa Doig) freeze him and her self in 2008. The year is now 2455 and a new crew members on a ship unfroze those two only too realize they unfroze Jason Voorhees unstoppable killing machine. Now a new group of soldiers tries to defeat Jason who later becomes Uber Jason.<br><br>Lisa Ryder was great, sexy and really hot as Kay-Em 14 I liked her, she really kicked Jason's ass and she shot him to death ha ha.<br><br>So it is scary? No. Is it a good movie? No. Is it fun? VERY.<br><br>I also forgot this movie is reference to Demolition Man (1993) my all time favorite futuristic action Stallone film. In which they were mention to Lexa Doig's character that she was in Cryo it references to Cryo-prison it is similar to Demolition Man.<br><br>Jason X is a 2001 American science fiction slasher film produced and directed by James Isaac. It is the tenth installment in the Friday the 13th film series and stars Kane Hodder in his fourth and final film appearance as the undead mass murderer Jason Voorhees and his futuristic counterpart, Uber Jason.<br><br>This movie get's a C+ 6/10 wasn't that bad of a film but wasn't a great Jason slasher film either, but still it is my all time favorite guilty pleasure of mine.<br><br>I have enjoyed this movie and I had fun watching it. Honestly I have enjoyed this movie much more then I did Friday the 13th Part VIII: Jason Takes Manhattan but that is just my opinion It is my favorite guilty pleasure of mine.","user":"ivo-cobra8","rank":[59,63]},{"title":"An underrated gem","rating":8,"date":"18 October 2018","review":"This film is basically Jason in Space.<br><br>This movie massively divided fans. Some loved the innovation but some hated it to such an extent that they viewed it as the worst in the series. Yes, they even hated it more than Part 5: A New Beginning.<br><br>But I loved this movie. I even went to see it a bunch of times during it's original release.<br><br>Theres so much to love. The claustrophobia of the spacecraft, the tongue in cheek humour, the nerdy aspects of the film's vision (check out the eye operation on Jason and the way that injuries like severed limbs are remedied).<br><br>Theres also an amazing cameo by David Cronenberg thats worth the price of admission alone.<br><br>With this installment being based in space theres many nods to satify the most ardant sci-fi fanboys. Least not Lisa Ryder who was a star of Andromeda. Her android character is a great addition to the cast.<br><br>Uber Jason is a sight to behold! And check out the liquid nitrogen kill. It's one of the best in the whole series.<br><br>Highly recommended.","user":"meathookcinema","rank":[13,14]},{"title":"Big, dumb and stoopid, but fun","rating":5,"date":"13 January 2005","review":"Let's face it, if you're going to rent one of the later movies in a slasher movie series, you'd be an idiot to expect high art. The fact that this is the tenth movie in the Friday the 13th franchise, the most knuckle-draggingly, ball-scratchingly cretinous 'horror' series of all time AND it's set in space doesn't exactly suggest that this'll be an all-time classic, but it's a good fun way to kill an hour and thirty minutes nonetheless.<br><br>Okay, the plot is so thin even a slight breeze would make it disintegrate and the horror element is practically non-existent but then Jason movies abandoned that long ago in favour of just providing dumb escapism with inventive and bloody death scenes, which this film certainly provides. People are sliced in half, impaled on large spikes, blown up, one poor woman even getting her head dunked in liquid nitrogen and shattered on a desk, but the characters are so one-dimensional and it's so cheesy you're more likely to laugh than scream. And I defy you to watch the scene when Jason gets transformed into 'Uber Jason' for the first time and not have a colossal grin traverse your face. There's even a later scene which pokes fun at the earlier movie's clichés with a hilarious \"beating one camper to death with the other\" sequence.<br><br>This is not The Exorcist, it's not The Omen, it's even a very long way away from the original Friday The 13th, but as director James Isaac has said, \"it's just fun.\" Get your mates round, pop open a beer, disengage brain and you've got a very entertaining ninety minutes.","user":"ExpendableMan","rank":[84,111]}]