[{"title":"outrageously outlandish interactions","rating":6,"date":"6 February 2002","review":"Jon Favreau's 'proper' follow-up to 96's 'Swingers' see's him as part of a double-act with Vince Vaughn. The whole film is based around this double-act, and the various banter that passes between them - mostly ricocheting from Vaughn's outrageously outlandish interactions with everyone he meets, and Favreau's handling of the ensuing situation.<br><br>At times this makes for extremely funny entertainment, at other times however it makes for extermely cringe-inducing entertainment. Your not quite sure whether to love Vaughn's antics, or want him dead. Your also left wondering exactly WHAT Vaughn's character helped Favreau's out with in their younger days in order for Favreau to have such as deeply-routed tolerance and understanding for the man.... personally, I would have gotten rid of him years ago.<br><br>The story itself takes a backseat because of Vaughn's antics, which is a shame, cause there's some really juicy material in there. I would have loved to see more development between Favreau and his girlfriend, played by Famke Jansen, and also Jansen's daughter. Peter Falk (yes, 'Columbo') is absolutely brilliant as Max, the ageing boss, fully believable and a fully-realised characterisation.<br><br>Overall the film fit's together extremely well - the pace is fast, and you do get caught up in it... even during Vaughn's most cringe-worthy moments. Basically if you like 'Swingers' or general crime-capers, you'll love 'Made'.","user":"iainwatson","rank":[23,28]},{"title":"The New-Age Odd Couple","rating":10,"date":"3 December 2001","review":"This is a much darker comedy than the breakthrough hit, \"Swingers\", to compare the two would be useless.  The dialogue and chemistry between Favreau and Vaughn, though, is still at it's comedic best.  Since Favs was directing this flick, he let Vince go all out on his character Ricky.  The two longtime friends go to New York to do a mob job with little experience on how to do any kind of job.  They, needless to say, get themselves into quite a bit of trouble along the way. The entire movie itself is hilarious, there is quite a bit of profanity and a strip scene at the beginning, but if you can handle that, you should enjoy yourself thoroughly.  If it were up to me, Vaughn and Favreau would make a movie together once every other year.  The chemistry is so money, baby.","user":"Duderinoman","rank":[20,27]},{"title":"Some laughs but a very average flick.","rating":6,"date":"6 February 2002","review":"I tried not to have many pre-conceived notions about 'Made' before renting it. Then again, having Favreau/Vaughn together again will always conjure up thoughts of T &amp; Mikey. Swingers may well haunt Favreau for the rest of his career. He alluded to that with his guest shot on 'The Sopranos'. It was a special movie, an instant classic which would be hard to top for any writer. 'Made' certainly tries to follow suit with the writing style but it falls flat. Vaughn (Ricky) plays a character who talks exactly like Trent but is more of a lunatic loser who's dream is to give up boxing to be a mob guy. Favreau (Bobby) is the level-headed friend who vouches for him while getting an assignment from his boss (Falk). All he wants is to get some $ so he can make better life for his stripper girlfriend &amp; her child. Basically from there it splinters off into Ricky &amp; Bobby trying to take care of 'the drop' in NYC for the boss (Falk). Ricky's \"Goodfellas-like\" mentality is causing headaches for Bobby who just wants to take care of business. I thought Sean Combs did a fine job playing himself essentially (a ganster living the high life). Yes, there are some funny lines but overall the movie is just too sloppy.  It feels like a low budget flick, the camera work is not very good and the film takes no risks. Characters were not developed &amp; the ending tries to be all sweet but I don't think enough was done to set that up. There were just too many missing ingredients. If Vaughn &amp; Favreau want to do future films together maybe bring Doug Liman into direct it. He did a marvelous job with Swingers and maybe they could recapture some magic. It sure was missing in 'Made'.<br><br>Rating 6/10","user":"SP-10","rank":[7,8]}]