[{"title":"Kingsley is Dynamite","rating":9,"date":"20 July 2002","review":"Ben Kingsley's portrayal of gangster Don Logan is destined to go down as one of the most memorable mobsters in filmdom; up there with the best from Robinson, Bogart, Cagney, Raft, deNiro, Pacino et al. Kingsley's all that good and more.  And the other actors, in their portrayals of fellow gangsters and their lovers, are also excellent.  The story is simple. Gal (Ray Winstone) is a retired English gangster living a life of leisure at his Spanish villa. Then one day his idyll is shattered by a visit from Don Logan, an old protégé, and man to be feared. Logan's intent is to lure Gal out of retirement for 'one last job'. Gal wants nothing to do with it, and the first half of the movie is a battle of wits between the two men. The second half of the film deals with the heist and its aftermath.  The crime is downplayed in the movie which is primarily a psychological exploration of these gangsters; their personal demons, and the relationships amongst themselves. They are indeed scary people, no sympathetic characters here.<br><br>\nThis is one of the best movies of 2000, and is highly recommended. I don't understand how IMDb reviewers can rate this movie so low. In my book it definitely rates an \"A\".","user":"gbheron","rank":[146,162]},{"title":"strong performances, interesting drama","rating":26,"date":"26 July 2002","review":"In `Sexy Beast,' Ben Kingsley delivers a bone-chilling performance as the man everyone loves to hate, a role for which he earned not only universal critical acclaim but a Best Supporting Actor Oscar nomination as well.  Don Logan is so evil that even his fellow mobster buddies fear and hate him. From our very first glimpse of him high-strutting his way through an airport terminal, Kingsley hits just the right note for his character.  Cleverly, writers Louis Mellis and David Scinto have paved the way for this entrance by introducing Logan ahead of time in a series of conversations in which just the mere mention of his name sets off portentous reverberations amongst the people discussing him.<br><br>Chief among those people is the film's protagonist, Gal, Logan's `retired' ex-partner in crime, who wants nothing more than to be allowed to enjoy life undisturbed in his seaside Spanish villa with his swimming pool and the wife he loves so dearly.  But Gal soon discovers that a person cannot escape his past forever, when Logan suddenly shows up at his doorstep demanding that Gal join his own personally hand-picked gang of seasoned criminals whom Logan has brought together to pull off a major heist back in Merry Olde England.  Gal would like nothing better than to send Logan home packing empty handed, but he also knows that defying Logan can be the fastest route to an early demise.  It is this atmosphere of fear and dread that director Jonathon Glazer uses to make `Sexy Beast' such an engrossing and off beat little crime drama.  <br><br>In fact it is the THREAT of violence, far more than the violence itself, which distinguishes this tale.  Without the use of weapons of any kind, Logan is able to cow and terrorize a roomful of reasonably fearless adults simply by his steely-eyed demeanor and the unpredictable nature of his temperament.  Seemingly controlled and rational one moment, he can suddenly erupt into a volcano of exploding anger the next.  One of the most chilling moments in the film occurs aboard a departing airplane in which Logan refuses to douse his cigarette, thereby precipitating a confrontation with the flight crew.  Logan has that quality that distinguishes all great villains:  he throws us back on our heels by his refusal to conform to the social amenities that the rest of us simply take for granted and which put us at a decided disadvantage when faced with the evil characters of the world who know no rules and flagrantly disregard the ones we follow.  He reminds us of how weak and vulnerable the rest of us really are.<br><br>Logan, for all the intensity generated by his character, is not, however, the focal point of the film.  Gal, brilliantly played by Ray Winstone, who provides a fascinating counterpoint to Logan's no-holds-barred villainy, occupies that position.  Despite his criminal background, Gal wins us over by his openhearted frankness, his sincere devotion to his wife, friends and neighbors, and his obvious desire to lead a straight life from hereon out. Winstone underplays his scenes superbly, yet he never allows himself to be acted off the screen by the fiery Kingsley.  (One should mention that the heavy cockney accents of the characters make what they are saying a bit incomprehensible at times). <br><br>As is not uncommon in gangster movies these days, Glazer manages to inject an element of black humor into the proceedings.  The comedy often takes the form of twisted surrealism, such as when a giant boulder rolls down a nearby hillside and lands plop in Gal's beloved pool, barely missing taking Gal to the bottom with it.  The filmmakers also have an effective way of heightening the tension through indirection, particularly in the early scenes which prime us to dread Logan's entrance as much as the characters who don't want to see him  and we haven't even met him yet.  This technique of telegraphing information ahead of time contributes immensely to heightening the suspenseful quality of the film.<br><br>`Sexy Beast' provides superb performances, a nasty sense of humor and a fascinating glimpse into the dark side of human nature.","user":"Buddy-51","rank":[134,150]},{"title":"For Best Portrayal of a Rabid Dog...","rating":8,"date":"19 April 2003","review":"..the Winner is...Ben Kingsley in Sexy Beast, hands down (and panting on all fours).  Ben also wins the award for Best (and most frequent and creative) Usage of the \"c\" word, which plays a major part in this outrageously deranged and always thoroughly entertaining (even at its bloodiest) full-frontal bombast of a film.<br><br>The plot couldn't be any simpler: retired gangster Gal (yes, that's his name) is happy lounging around the pool at his Spanish villa with the woman of his dreams and a drink in his hand.  But the big bad brutal bulldog Don (Kingsley) has been sent to convince him to do One Last Job.  Gal says no. Donnie doesn't like this answer. Violence ensues.<br><br>To say any more would be a disservice; this movie has to be experienced, not explained.  Suffice to say, the brilliant performances (Ray Winstone and Ian McShane in particular) and the amazingly slick editing make every second of Sexy Beast a kinetic foray into surrealism and a tour de force of epic proportions for Kingsley. So why are you still bloody sitting there, you steaming c***?!!! Go rent it now.","user":"Rogue-32","rank":[61,71]}]