[{"title":"Powerful, quiet, effortless Crowe","rating":9,"date":"23 January 2002","review":"A Beautiful Mind<br><br>\nDirector Ron Howard has experience in playing with his audience's heartstrings. Remember in Apollo 13, when the fate of the astronauts was uncertain? (Ok, so if you remember your recent history, you knew.... but still!) Or remember in Parenthood, when Steve Martin's kid was about to make the crucial catch? Ol Opie can still pluck those strings with the best of them. (And you know, he'll never stop being called Opie, even by those of us who never saw The Andy Griffith Show during its initial run.) And plucking heartstrings is not a bad thing at all, not when you can do it in such a sincere, noncloying way as the masterful Beautiful Mind presents to its viewers.<br><br>John Nash is a mathematics prodigy who has a decided knack at solving previously unsolvable problems. He's socially dysfunctional, rarely looking anyone in the eye, but pours all of his energy - and soul - into producing one original idea, an idea that will distinguish him from all of the other mathemathical minds at Princeton University.<br><br>But John, like most who have had movies made about them, had his ups and downs. He meets and falls for a beautiful student of his named Alicia (Jennifer Connelly), and they produce a baby. But John also suffers from tremendous delusions and is diagnosed with a form of schizophrenia. Schizophrenia's a tough disease, folks - it's still not fully understood, and Nash was diagnosed with it in the middle of last century. He spends time in a sanitarium, as doctors struggle to find a cure.<br><br>Russell Crowe is absolutely powerful as the confused and confusing Nash. Although the marquee says \"Russell Crowe\", you'll immediately forget this is the hunky guy from Gladiator. I mean after all, he's playing some nerdy scientist dude! But Crowe completely disappears in the role, and he's unforgettable. Actors kill for roles like this one, because it gives them a chance to show off their acting chops. For many actors, this is the kiss of death, because then they're exposed as poor thespians. But not for Crowe; if anything, this proves once and for all that he's a grand master of acting. I realize that sounds like overkill for him, but I think that when actors are labeled as a \"hunk\" - their skills as actors aren't seen as very substantial. Hey, looking darn good worked against Tom Selleck, and to a degree it has worked against Crowe as well.<br><br>And he ages well, too. The movie takes place over a fairly extended period of time, ending with Nash's acceptance of the Nobel Prize in 1994. The makeup on Nash is neither garish nor schmaltzy; he looks completely genuine. And that's the essence of Crowe's performance. It's sincere, never trying to win over the audience with a sly wink here or a toss of the hair there. Crowe shows remarkable poise, elegance, and is utterly astounding in the role.<br><br>His supporting cast is more than able. Jennifer Connelly is better than I thought she would be; in most roles, she's the eye candy. But this role had meat to it, and she held her own. It wasn't an easy role to play, and she pulled it off. And her scenes with Crowe do have that movie magic that each of us looks for when we go to movies, that one moment, that compatible chemistry that leaves audiences mesmerized.<br><br>And yes, this does have some very, very touching moments. The final scene, while predictable (even if you don't know the outcome in real life), will bring more than one tear to the eye. Yes, I'll admit it, it got me right here. But it's okay; I did that old 'guy-crying-in-movie-theater' trick. If you feel the brime falling from the lid, you make a motion toward your cheek and then you scratch vigorously; people might think you have a skin infection and move away slowly, but at least they won't think you're a girly man.<br><br>At any rate, it's certainly one of the best movies of the year. Everything's in place: the direction, the photography, and especially the acting.","user":"dfranzen70","rank":[124,147]},{"title":"A beautifully written, acted, and crafted movie.","rating":10,"date":"16 January 2002","review":"A BEAUTIFUL MIND (2001) Rating: 10/10<br><br>A Beautiful Mind's greatest achievement, in my humble opinion, is the way it makes schizophrenia accessible to \"sane\" people. The general public knows schizophrenics tend to talk to themselves, repeat certain actions and do things generally at odds with the norm. But why? It's nearly impossible for a \"sane\" individual to understand why this happens...and more importantly, what that feels like. Without this essential empathy, many people become frustrated with the mentally ill, asking why patients can't pull themselves together and just bear up. We express this same impatience with the criminally insane who act upon delusions with disastrous results. It is incomprehensible.<br><br>A Beautiful Mind does all it can to change that, and it succeeds. Unless you are familiar with John Nash's story, you probably won't guess he's schizophrenic until part-way into the movie. He's eccentric, abrupt, and highly intelligent, but doesn't seem crazy. His delusions are as real as reality to Nash, and likewise, they are real to the audience, who cannot tell the difference between truth and delusion.<br><br>Incidentally, I came across a review from a \"professional critic\" who blasted A Beautiful Mind for including \"all that spying stuff that had nothing to do with Nash's work that was thrown in for Hollywood thrill.\" I feel bad for that chap, since he missed the entire point of the film. But that just proves Ron Howard's genius in creating a picture of insanity indistinguishable from reality.<br><br>There are some truly shocking moments in A Beautiful Mind. When Alicia finds her husband's secret cache of newspaper clippings behind their house, I was eerily reminded of Jack Nicholson's wife in The Shining discovering his endless, typewritten pages of the same phrase. The scene that follows, culminating with Nash's realization that his delusions are indeed a false reality is brilliant. In a moment, remembering Marcee, Nash has a flash of insight, and he finally accepts his illness -- ironically, through his intellect. When Nash imagines that someone is going to harm Alicia, he lunges at her -- and only through his eyes do we see how a seemingly senseless act of violence is a gesture of love, filtered through the smog of delusion.<br><br>Now my take on the acting: Superb in every sense of the word. Russell Crowe is incredible. I can't stress that enough. There's never any question about the authenticity of his character. Crowe doesn't rely on his elaborate makeup to age Nash -- his walk, words, and voice do that elegantly in the movie's end. Crowe will get at least another Oscar nomination out of this one. And, he better win. Jennifer Connelly is amazing as well. And when Crowe and Connelly are put together, extraordinary chemistry erupts, they just gel together, they really belong with one another. Some people have had problems with the romance part of the movie, saying that the way John and Alicia even started seeing each other wasn't very realistic and why Alicia would stay with John after he becomes distant. But, I think that maybe it started out as just a crush, you know, and the math question she showed him was just her excuse for going to his office and she already knew she was going to ask him out before hand. Maybe she's just attracted to the kind of person Nash is? Who knows? A lot of people are attracted to the \"weirdest\" things sometimes. The crush took over the fact that he sort of insulted her work and she still asked him anyway. When you're around someone you like so much you can't help but be fooled by them. I can't really explain it, but I can understand why she still asked him to dinner. And I guess if you love someone as much as Alicia loved John, then you would stick with them through anything. Even how distant he became, she still stuck with him.<br><br>Moving on, I think Ed Harris is, as always, great. Harris continues to prove that, simply because he's flawless. With delusions like these, no wonder Nash was torn between treatment and \"spying.\"<br><br>Simply put, A Beautiful Mind is a film which extends far beyond the 2 hours and 15 minutes that you will spend viewing it in the theater. The characters continued to haunt me after the movie (and still do), thanks to the Oscar-inducing performances by Russell Crowe, Jennifer Connelly and all of the supporting players. They are not merely acting, yet are transformed into the characters, leaving no trace of a line between their part and reality.<br><br>Of course a film is only as good as a screenplay would allow, and the story contained within is written in a way that compliments everything that is truly great about A Beautiful Mind. Ron Howard contributes truly inspiring work to this film, and I hope that the critics remember him when awards are being given out.<br><br>All I can tell you now is that if you're looking for an emotionally-charged movie that will make you cry, but still filters in some very funny moments as to lighten things up every now and then, with near perfect acting, cinematography, directing, editing and a screenplay which will cause the story of John Nash to inspire you, then consider A Beautiful Mind.<br><br>I hope a lot of people see this film. Not just because Russell Crowe is a hunk or because it's a Ron Howard piece, but because you will learn something important. You will learn why compassion is an absolute must when dealing with the mentally ill. You won't glare at the next person you see muttering to themselves. And when someone you love is dealing with a disorder, be it schizophrenia or depression, you won't ask them to \"pull themselves together.\" You will understand why they need your love -- because they are just as confused as you are.<br><br>In closing, if Russell Crowe isn't awarded the Best Actor Oscar this year, then my faith in movies and its rewards system will be seriously tarnished.","user":"The Mad Reviewer","rank":[243,305]},{"title":"A Beautiful Movie","rating":10,"date":"17 December 2001","review":"I think its a good idea to know as little as possible about this movie before seeing it.  Now that I've seen it, the commercials on television seem to be giving away too much.  With that in mind DO NOT READ THIS IF YOU HAVEN'T SEEN IT!<br><br>Its a hard movie to pinpoint.  Its not like any other movie I've ever seen, in that a character exists that is not real.  John Nash's mind is the reality of the movie and its not until the movie is half over that you realize this and its jarring that you've been taken on a ride with this man's illness, and accepted it as the real world.  Its also a very heartbreaking thing.<br><br>From the middle point, John and you see the world differently because he starts to receive treatment.<br><br>Russell Crowe does not overdo it for a minute and turns in his customary brilliant performance.  Would not surprise me at all if he were to win his second Best Actor Oscar in March 2002.  He really is that good.<br><br>\nJust as good but with less screen time is the beautiful and beautifully talent Jennifer Connelly, who the world may finally get to see in a mainstream movie.  Her chemistry with Crowe is vital to the movie and neither of them disappoint the audience at all in that respect.<br><br>\nI enjoyed it immensely and felt like I had seen a movie when it was over. I was shown a person at their best and the worse and everything in between, by a masterful actor at the top of his game.<br><br>I am sure Ron Howard deserves a lot of credit that he won't get, too.","user":"Boyo-2","rank":[211,268]}]