[{"title":"Great date movie!","rating":10,"date":"21 March 2005","review":"I found this movie on cable on dreary evening in winter. It was light and delightful and funny. The plot follows at a great pace, the characters are memorable, and Phil is hilarious. Call me naive, but I followed the movie at face value, not trying to guess what is going to happen next, and found it very entertaining. When you expect too much from a film like this, you are looking to watch a different movie. This is light romantic comedy at its finest. The casting was on mark and I really enjoy Ben and Matt in these minor roles where they are just having fun, I don't think they do that enough in movies anymore. Happy to see Melissa McCarthy (Sookie of Gilmore Girls) kiss Ben, and Jeff Garlin along with a really solid ensemble cast of comedic actors. Small movie, great cast, lots of fun.","user":"ppeters89","rank":[19,23]},{"title":"Pleasantly surprised.","rating":10,"date":"8 April 2004","review":"I just saw this movie and I really like it.  It was far from perfect, but I thought the actors were really good.  Denise Richards really enjoyable, Luke Wilson was fun, Ben was really funny, and Matt Damon had a good  part too.  The writer, Jay Lacopo, is also in it and I thought he was hysterical.  I saw Waking Up In Reno which was directed by the same director and that movie was kind of cheesey.  I think he's a bad director.  This film is choppy, but the actors are good enough, and the script is funny enough that it makes me wonder what Miramax was thinking.  With all of the terrible comedies they release you would think this one, with this star power, would have been a priority.","user":"moviefanforlife","rank":[14,20]},{"title":"I can't believe how much fun this movie was","rating":7,"date":"22 May 2004","review":"Picture: saturday night. You're alone. Nothing to do. A rom-com just happens to be in your bag, of which your girlfriend (who's a fan of the genre) said it wasn't any good. You decide to watch it anyway and... you really, really liked it. It's what happened to me and 'The Third Wheel'.<br><br>The movie stars Luke Wilson and Denise Richards as Stanley and Diana. They're co-workers, and Stanley has had an eye out for Diana for a while (as has most of the company). One day he finally asks her out, and she agrees to go with him to a play. But they're hardly on the road, or Stanley hits homeless guy Phil with his car.<br><br>Phil (a very good Jay Lacopo, who also wrote the movie) tags along for the ride, gaining the friendship of both of our stars, and ultimately bringing them closer to each other. Watch out for the bus-scene, it's hilarious!<br><br>To go short: loads of fun in this rom-com, also starring Ben Affleck and with a cameo from Matt Damon (as you would expect) as former boyfriend of Diana. Such a nice surprise!<br><br>7/10.","user":"TheOtherFool","rank":[11,15]}]