[{"title":"My number 1 the best werewolf horror film of all time a true classic masterpiece","rating":10,"date":"16 October 2016","review":"Dog Soldiers (2002) is my number 1 favorite best werewolf film of all time, a true horror classic! I love this film to death and it is my favorite action horror werewolf film in the horror genre! It is number 1 because it is simple, it is soldiers and werewolf's and they fight! Well directed and written by Neil Marshall who directed The Descent and Doomsday, I still have to watch Doomsday. I never saw before The Descent and I am not planning too. Dog Soldiers is my all time favorite werewolf movie because it reminds a bit on Aliens, instead of Aliens is werewolf's. It is practical I didn't noticed any CGI in it, I like the werewolf's they are tall and giant monsters. <br><br>I like the cast you have Kevin McKidd as lead, you have Sean Pertwee as his commander the name of the character is Sergeant Harry G. Wells. Kevin McKidd is Private Lawrence Cooper. Liam Cunningham is Captain Ryan the human bad guy in this, he is the guy we don't trust. I also like this guy Darren Morfitt who plays Private Phil \"Spoon\" Witherspoon. Thomas Lockyer is Corporal Bruce Campbell the name and the last name from the actor Bruce Campbell (Evil Dead trilogy). This THE BEST WEREWOLF movie of all time! It won in 2002 the Brussels International Festival of Fantasy Film's Golden Raven, so you get an idea.<br><br>\"Do you think it's all over? It is now.\" <br><br>Plot: A British Squad is sent on a training mission in the Highlands of Scotland against Special Operations squad. Ignoring the childish \"campfire\" stories heard about the area, they continue with their mission and come across the bloody remains of the Special Ops Squad, and a fierce howling is pitching the night sky... With two mortally wounded men, they make an escape, running into a zoologist by the name of Megan - who knows exactly what hunts them. What began as what they thought was a training mission turns into a battle for their lives against the most unlikely enemies they would have expected - werewolves.<br><br>This is actually British film it is not an American film, but I absolutely love it to death! THIS is how you do action horror movie with gore, suspense and most of all action. 100% fun and one of the movies that never gets boring. I specially liked the ending and I mean at the part where Wells sacrifices himself and blows up the house killing entire werewolf family excellent bad - ass scene ever!!! Neil Marshalls best film hands down. This film is so much fun and the werewolves look so bad ass. Love the fight scene at the end. A classic movie and a perfect example to every movie maker out there on how you can make a fantastic film on a low budget! It would have been awesome to see Statham take on these werewolves. But I liked the lead actors, great action, environment. I enjoy Dog Soldiers! Jason Statham as the main lead would be a bad ass seeing him kicking werewolf's ass! <br><br>There is a lot of this movie that I like: it is a true horror film, you see people get's slashed and ripped off, you see a lot of blood and so on. I love the line when Cooper (Kevin McKidd) says a line Do you think it's all over? It is now and bum he blows to pieces Ryan/werewolf (Liam Cunningham) with a shot gun. I love that there is one sole survivor in this movie, entire squad get's eaten by werewolf's. You have a lot of gun fire power, soldiers are using a machine gun Heckler &amp; Koch MP5A2 which is awesome. I love practical digital visual effects for werewolf's the animatronics by the company image FX were fantastic and the best one I ever saw! The physical-effects supervisor and stunt coordinator Harry Wiessenhaan was great and brilliant he knew how to make a werewolf for making this movie. Neil Marshall written and directed this movie so well and he really did made an excellent job making a horror film.<br><br>Dog Soldiers is a 2002 British action horror film written and directed by Neil Marshall, and starring Kevin McKidd, Sean Pertwee and Liam Cunningham. A British production, set in the highlands of Scotland, it was filmed almost entirely in Luxembourg.<br><br>Overall: Splitting the difference, we get an 10/10 -- an outstanding score, I absolutely love this movie to death, it is original and it is brilliant horror action film my number 1 favorite werewolf movie!","user":"ivo-cobra8","rank":[112,124]},{"title":"A good mix of horror and old time story telling","rating":7,"date":"6 December 2003","review":"I can't explain why I picked up the DVD, Dog Soldiers off the video store shelf.  The box art consisted of poorly drawn wolves and there was a tag line that read `From the producers of Hellraiser'.  Normally this combination would have me wiping down the cover in an attempt to remove any evidence that my fingerprints were interested in pursuing the rental.  But, somehow, Dog Soldiers worked its way into the Saturday night rental pile and once all other options were exhausted, there I was, reluctantly putting the DVD into the player and hoping that there would be enough of anything to entertain me until bedtime.<br><br>Dog Soldiers opens in Scotland, where two love struck campers are attacked by some creature in the middle of the night.  Cut ahead a few weeks and we are introduced to a group of army trainees that are left in the woods as part of an exercise against a team of Special Forces.  Lead by Sergeant Wells (Sean Pertwee) and motivated by Private Cooper (Kevin McKidd), the squad is surprised upon their first nightfall in the wild by a mutilated cow that is thrust into their campsite.  Following the bloody trail of the animal, they are soon led to the massacred remains of the elite Special Forces team that was stationed in the same region.  Evidence of a struggle was everywhere, but no bodies were immediately evident, except for the ramblings of the sole survivor, Captain Ryan (played by Liam Cunningham) who was severely injured during the night.  <br><br>Within moments, the group is besieged by wolf-like creatures and run for their lives towards the tree line, where they are fortunate enough to cross paths with a young woman that takes the remaining soldiers to a remote farm house.  As night progresses, onslaught upon onslaught is countered by the soldiers as they fight to keep the werewolves out of their new fortress, but some, one by one, they fall victims to the creatures hunger.<br><br>Dog Soldiers is one of those rare horror movies that actually works.  The creature effects are better than most bigger budgeted werewolf movies States side, and there are a few genuine good scares and tension as mounted by writer/director Neil Marshall.  What I also appreciated from the film was its sense of humour, or rather; it's lack of it.  In today's horror genre, we are subjected to countless Freddyisms' or inside jokes that make the Scream series such a box-office bonanza.  However, Dog Soldiers checks its humour at the door and focuses on the characters and claustrophobic feel of being trapped in a surrounded country house.  Actually, the only chuckle you will get in this film will is mixed with extreme horror and gore.  It occurs in a scene where the family dog pulls on the intestines of the living Sergeant Wells and he fights with the dog for his innards while the troops fight off a wave of attacks by the wolves at the front door.  You'll find yourself smiling and then grotesquely repulsed by the same scene that put a smile in your cheeks.  <br><br>I am not saying that Dog Soldiers is perfect.  Not by any means.  But horror films have never really gotten any better over the years, as Hollywood still tries to recapture such terror as identified in The Exorcist or Alien. However, Dog Soldiers will entertain and isn't that all we are looking for?","user":"gregsrants","rank":[98,111]},{"title":"This movie is just...","rating":10,"date":"8 June 2004","review":"...brillant.<br><br>I must admit that I was pretty skeptical when i picked it up from the rack at my DVD retailer. A werewolf movie? Aren't they generally so bad no one wants to watch them/buy them? The fact that it was on sale didn't help, but I braced myself and got it figuring that if it was bad, I'd bury it in some deep deep cave and never let it out. But the movie got me out of my seat with excitement and enjoyment at the action and the thrills. I remember checking the time on the DVD player and wincing at the fact I had only half an hour of film left to enjoy. True, I have seen better special effects. And true some things aren't very realistic (and the producers acknowledge those things). But for a studio I have never heard of with a budget far inferior to those of Hollywood super productions, I found those effects very well done.<br><br>A very good movie that gave me thrills I hadn't had since the first Predator.","user":"gregory-rebelo","rank":[209,245]}]