[{"title":"Not too bad a sequel...","rating":6,"date":"28 March 2001","review":"...as long as you keep in mind they tried to do something different with the franchise. As such, the fifth installment is more of a supernatural morality tale in the line of Angel Heart and Jacob's Ladder.  Everything does make sense, if you get all the way to the end.<br><br>Whether you like the inclusion of the Cenobites depends on whether you think they have to be center-stage or not. They basically do what they're supposed to here, and this movie does a better job of establishing how they torture people (as opposed to just ripping people apart in ugly ways) then the previous movies have done. The idea that they engage in psychological torture is one that none of the previous movies in the series have expanded upon in any great depth (although the fact they inflict pleasure as well as pain still needs to be touched upon a little more - the twin she-Cenobites kinda hint at this, though).<br><br>Basically this is perhaps the more subtle of the movies in the series, due to the apparent requirement that the Cenobites not play a large part. Rewatch it a time or two without the expectations that this will be a blood-oozing, skin-rippping \"Pinhead movie\" like the others, and you might be surprised.","user":"Gislef","rank":[53,63]},{"title":"This is a great psychological thriller....","rating":20,"date":"20 June 2001","review":"Hellraiser Inferno was a great movie. The acting could have been better, but it took a completely different turn than I expected it to.<br><br>Pinhead is what he was in the first two Hellraisers, A judge of Hell. If you notice Hellraiser 3 and Bloodline make him the bad guy, while in the first two movies it was the humans who were the evil ones.<br><br>This movie requires you to THINK. If you don't like having to think about a movie don't watch it, but if you liked the Blair Witch Project, You will like this movie.<br><br>This sequel brings back the style of the first two, but with enough difference to shock you in new ways. I believe this movie gets the point across that I think Clive Barker was trying to get across when he started this series, You create your own Hell, and you confront your own demons.<br><br>\nThis movie is not like the rest of the series. It is more of a psychological terror than a slasher film. Give this movie a chance, and think about it.","user":"sauron221","rank":[40,48]},{"title":"A nerve-wracking experience, it messes with your mind.","rating":7,"date":"28 January 2002","review":"I saw this film alone in a \"house container\" in the middle of the night, during my 24H shift as the radio Duty Officer in a UN military camp in Eastern Africa. Maybe that's why it made such an impression on me, partly, anyway!<br><br>Whatever the unusual setting for viewing it, it must be said I'm a long time fan of Clive Barker and his universe(s), and that that of course helped in gearing up my imagination. In my opinion, the special Barker trademark, namely a mood of overwhelming and insanity-inducing Biblical horror, translates well to the screen in this film. The protagonist, played by Sheffer, remembered from another Barker movie, Nightbreed, is caught in a web that seems impossible to escape. Even though he's a real dumb b*****d, you just can't help feel a little sorry for him; the way he is manipulated by gruesome, hellish powers is almost too much. No way he can experience what he does without loosing his mind!<br><br>The acting isn't anything special, but I tell you, if you are capable of living yourself just a bit into the story, you'll feel like I did: That movie has warped my fragile little mind!<br><br>Advice: see it alone, tired, just before you are going to sleep, and with your senses alert to begin with - and you'll be ready to continue the roller coaster ride in troubled dreams afterwards. Disturbing! 7 out of 10.","user":"Joshua Calvert","rank":[41,50]}]