[{"title":"Japanese Action Werewolf","rating":7,"date":"18 May 2017","review":"Sonny Chiba plays the only survivor of a clan of werewolves who relies on his feral, full-moon-activated superpowers to solve mysterious crimes. One night, a bizarre and bloody death in the Tokyo streets plunges him into a far-reaching conspiracy populated by crooked politicians, naked women, an invisible phantom tiger, and a shadowy organization known as the J-CIA.<br><br>Steve Kopian writes, \"If you look up WTF in the dictionary, one of the top five definitions will be this film.\" He is not wrong. While this may not be one of he five most bizarre movies out there, it certainly makes every attempt. And if \"weird\" isn't your thing, there are also copious explosions and a great deal of gun play and squibs in the later scenes, evincing a definite Sam Peckinpah influence. So, there's that.<br><br>As author Bryan Senn points out, even though the title is \"Wolf Guy\", one of the strange things is that Chiba never actually becomes a wolf at all. He has his strength fluctuate based on the lunar cycle, and at its peak he can deflect bullets or even reverse the effects of being disemboweled. But at no point does he howl or even grow the slightest bit of hair.<br><br>If one person can be blamed for this bizarre mash-up, it must be writer Fumio Kônami (1933–2012). By this point in his career, he had already made a name for himself with \"Female Prisoner #701: Scorpion\" (1972) and \"New Battles Without Honor and Humanity\" (1974), both of which are available in the United States thank to Arrow Video. Director Kazuhiko Yamaguchi's first impression upon being given the story was actually, \"Is this worth making a movie out of?\" Luckily someone said yes.<br><br>On top of all the awesome visuals, there is an unbelievably funky score that I need to have. As noted in other reviews, it would be great is Arrow (and others) would more frequently add a bonus music disc to their Blu releases. We need more love for the soundtracks, too.<br><br>For decades the film was presumed lost, and remains tragically little known. Thankfully, Arrow Video has brought it out of the depths and on to Blu-ray. They also give us new video interviews with actor Shinichi \"Sonny\" Chiba (14 minutes), director Kazuhiko Yamaguchi (10 minutes), and producer Toru Yoshida (17 minutes).","user":"gavin6942","rank":[9,12]},{"title":"The Pinnacle of Film-Viewing","rating":8,"date":"8 May 2019","review":"After spending the better part of a decade doing very little with your life but watching movies, you eventually check out of life. You also lose all your interest in film as an artistic or storytelling medium, and shift your focus towards ever more cheap and schlocky bottom-shelf B-movies. Eventually, you arrive at Wolf Guy: Enraged Lycanthrope.<br><br>For those who would rather nothing more than to stare, braindead, at a screen through 90 minutes of gratuitous nudity, violence, martial arts, and random surgery, loosely held together by the most senseless werewolf narrative imaginable, this is the place.<br><br>The story goes that Shin'ichi Chiba one night witnesses a man apparently mauled to death by an invisible tiger after running through the street rambling incoherently about a tiger and a curse and a woman named Miki. A very non-threatening-looking tiger is superimposed on the screen briefly to suggest that Shin'ichi Chiba can see the tiger too, I guess.<br><br>Upon investigating the case further, he discovers that the woman, Miki, who cursed that guy with being mauled by said tiger, is actually a stripper who got syphilis, and the yakuza boss responsible for arranging her infection with syphilis is intentionally directing her tiger curses against his enemies by telling her they're the ones who gave her syphilis.<br><br>I'm not sure what any of this has to do with Chiba's character. Is he supposed to be a police detective investigating the maulings? I don't even know. Half way through the movie, we're informed that he's a werewolf. Presumably you knew that from reading the title, but it's easy to forget by that point. We're told on the 15th day of the lunar cycle, he will transform into a werewolf.<br><br>Well, \"transform\" is a stretch. No attempt is made to make him look like a werewolf. In the final climax, well, he just kind of jumps high and a funny sound effect plays when he jumps so you know he's changed. Also he's impervious to bullets. The two defining attributes of a werewolf: invulnerability and jumping!<br><br>It's hilarious to hear the director and producer interviewed on the blu-ray edition, basically trashing the film, amused and bemused that it's being sold in the West now. Basically, the studio wanted an adaptation of the Wolf Guy manga, but wouldn't put up any money to do it properly, so neither the producer nor the director took the project seriously at all. The writer of the manga walked out of a private screening after 15 minutes, swearing never to let Toei adapt one of his properties again.<br><br>Most people viewing Wolf Guy I expect, will react to it like the director says: \"What the hell is this?\". But perhaps, if you're coming to Wolf Guy following the natural progression I described in my first paragraph, you will be in a state to take in the film's convoluted plot uncritically, at which point, I believe you will have achieved a kind of film-viewer's nirvana.","user":"Grethiwha","rank":[3,4]},{"title":"Mindblowing and genre busting","rating":8,"date":"25 May 2018","review":"Let me see if I can come close to summarizing the insanity that is this movie: Akira Inugami (Sonny Chiba, of course), our hero, is the last survivor of a clan of werewolves. As a child, he watched his village and people get destroyed. Today, he uses his werewolf abilities to help him solve crimes - but never transform into a wolf.<br><br>His new case begins when a man is yelling in the street about being attacked by an invisible tiger that soon tears him apart. At the center of his investigation is Miki, who was abused by The Mobs, an evil rock band, and now only cares about heroin and killing everyone who hurt her. Now, a phantom government agency uses her to kill those they deem necessary of elimination.<br><br>Along the way to solving this mystery, Inugami will battle ninjas, the Yakuza, the Japanese CIA, assassins and more. It's also worth noting that Wolfguy sleeps with more women in this movie than James Bond, but everyone he touches usually ends up dead. There's one bonkers sex scene near the end with his true love, Taka, that has him remember sucking on his werewolf mother's breast while doing the same to the woman he claims is his wife. Alright there, Wolfguy.<br><br>Sonny Chiba didn't form the Japan Action Club for nothing. This group, created to develop and raise the level of martial arts techniques and sequences used in Japanese film and television, has him at its center. In this film, he has a multitude of battles and even gets thrown down a cliff and somehow front flips directly onto his feet, a stunt that completely astounded me.<br><br>Directed by Kazuhiko Yamaguchi (Sister Street Fighter) and written by Fumio Konami (Female Prisoner #701: Scorpion), this is the only Japanese werewolf that's not a werewolf scored by Japanese jazz noise rock that sounds like Goblin featuring blood gushing FX that I have - and probably will ever - see. Imagine Wild Zero but played completely straight. I've also never seen a movie where the hero is able to control his intestines and pull them back into his body.<br><br>Imagine this: loud guitars, neon colors, dizzying camera angles, werewolf fistfights again ninjas and a love scene every fifteen minutes. This is a gloriously scuzzy, scummy, silly and majestic piece of film. It blew me away from start to finish and I can barely comprehend much of what I watched!","user":"BandSAboutMovies","rank":[4,6]}]