[{"title":"Brilliant!","rating":8,"date":"8 September 2001","review":"As a long time lbt fan (14 years now) I know I am slightly biased but none the less I think this movie is great!<br><br>Now even though I am a fan, I'm not blind. I know why many people may dislike the rest of the sequels. They may seem rather corny and irritating. But this movie is different.<br><br>One of the things that sets this apart from the other sequels is that the dialogue is not a childish as the others. And there are a few funny quotes thrown in as well.<br><br>such as \"I dislike violence' 'then why did you hit me?\"<br><br>It seems as if the creaters of this series are finally realising that just because it is a children's series does not mean all the things have to be utterly childish. There are a few scenes in this movie where references are made to later films. This is a good thing.<br><br>Another good point is that there are 2 mysteries in the movie. The first is why Petrie's uncle Tyranno is hated by the others and the other is why is up with the strange rainbow faces.<br><br>Even though I know what would happen, it was still interesting.<br><br>Focusing of kidnapping instead of natural disasters (which they are running out of ) this sets it's self apart from the others.<br><br>a solid 8/10<br><br>and kids (regardless of age) will love it :) even those who are as old as me (I'm 20)","user":"cyberbat","rank":[10,11]},{"title":"After watching it as a child a few years ago, I think that this is the best of the series!","rating":7,"date":"6 June 2012","review":"I remembered watching this a few years ago as a six year old child in the early 2000s when it first came out and I actually liked it. Which is why I think that this surpasses both \"The Time of the Great Giving\" and \"The Secret of Saurus Rock\" as the best of the series.<br><br>Yes, the story's a little episodic filled with forgettable songs and the fact that it's too short, but it doesn't matter.<br><br>The animation is very nice to look at and the editing is very decent. The characters are well-developed and the pacing moves along very nicely. I know it's weird, but I actually liked the villains. Rinkus and Sierra were great, but I think that Pterano steals the show. Littlefoot was tolerable as the main protagonist as is the two rainbowfaces.<br><br>The strongest aspect is the excellent voice acting and the hilarious dialog. I like Sierra's \"No, no, no, jeb, jeb, jeb, it's driving me nuts nuts nuts!\" and the rest of the quotes in this movie. The voice acting, like I said before, is very excellent with Michael York stealing the show for portraying Pterano very well.<br><br>Overall, not excellent, but is arguably the best in the series and it's definitely worth watching!","user":"gavin-thelordofthefu-48-460297","rank":[4,4]},{"title":"The best sequel so far","rating":9,"date":"16 June 2001","review":"Littlefoot observes a \"stone of cold fire\" fall into the Mysterious Beyond but everyone thinks he imagines it, apart from Petrie's uncle, Pterano.<br><br>This film has a serious message about how we should take responsibility for our actions. It also explains that goodness can be found even in a person who seems bad.<br><br>Pterano and his henchmen are entertaining new villains, especially Pterano. He basks in his assumed greatness and demonstrates a range of emotions. He is excellently voiced by Michael York. Two other new characters are a pair of \"rainbow faces\" who encourage Littlefoot in his quest for knowledge. They are mysterious right up to the surprise ending which I won't give away.<br><br>The youngsters are as cute as ever, especially Ducky and Petrie, who are given more to do than normal. The best song is sung by Pterano. The animation isn't top notch but that is only to be expected from a straight to video release. It can be enjoyed by adults. (I'm 23)<br><br>Rating 9/10","user":"Cylex","rank":[8,10]}]