[{"title":"A classic, unforgettable piece of cinema wraps up","rating":9,"date":"3 October 2005","review":"With the authorities cracking down on organized crime, many yakuza families prolonged their existences by becoming political parties. The cops weren't fooled, but it did make it harder to prosecute them.<br><br>The talkiest of the entries and the entry burdened with the task of wrapping up dozens of loose threads, FINAL EPISODE depicts the legitimization of the crime and protection business and draws a curtain on the life of Bunta Sugawara's symbolic yakuza \"torpedo\".<br><br>It is as compelling for its performances as for its historical detail. Right up until the last body falls, director Fukasaku keeps the energy level high and kicks the narrative along at a heady pace.<br><br>It has been a monumental journey and a classic, unforgettable piece of cinema.","user":"fertilecelluloid","rank":[16,17]},{"title":"End of a (yakuza) era","rating":6,"date":"1 July 2016","review":"FINAL EPISODE is, unsurprisingly, the last of Kinji Fukasaku's five-part yakuza film series that began with BATTLES WITHOUT HONOR AND HUMANITY years previously. This handles a more political storyline, lighter on the action and heavier on the talk, that nonetheless brings the story virtually up to date and continues to enchant with its depiction of a lawless world of honour, reputation, and death.<br><br>As with the other films in this series, FINAL EPISODE has plenty of energy to keep it moving through the slower spots. The yakuza may be older and more grizzled in this film, but they're none the wiser, and the low level thugs are still committing carnage on the streets. Bunta Sugawara's Hirono is finally released from prison and discovers a world very different from the one he knew previously. The production values remain high and the excellent soundtrack continues to complement the on-screen action perfectly.","user":"Leofwine_draca","rank":[3,3]},{"title":"A mediocre ending","rating":5,"date":"24 February 2019","review":"If it weren't in the film series, I wouldn't even watch this movie. True, the series depicts the hard life of yakuza and tells many profound tales. However, I see that the creative energy of the crew just disappeared entirely as the series progresses. The final installment is a mishmash of all the elements of the previous films, like regrets for the death of the lower tier member.","user":"realIK17","rank":[1,1]}]