[{"title":"Just like Sunday's at Mamaw's house","rating":10,"date":"30 November 2004","review":"One of the funniest movies I have ever seen. We've watched it so many times we know the lines by heart. These people are all in my family, and I've often wanted to holler out myself to some of my relatives \"Shoot her Wardel, shoot her in the head.\" I can relate to being gay in a small southern town.<br><br>My partner and I are gay in Arkansas, although they have just tried to pass a law to prevent us from being so. But for some reason \"It ain't a workin\" and there are more of us coming out now that the election's over than before. You'll laugh til you cry when Brother Boy sings Til I Can make it on My Own to the psycho with a fish in her ear - although I do not believe this was one of her \"early years\" songs. Watch it 10 times and then you can pretend you're in the cast.","user":"rcltrh","rank":[26,32]},{"title":"worth the wait","rating":10,"date":"9 June 2002","review":"My girlfriend and I saw trailers and the great website for Sordid Lives over a year ago and couldn't wait to see it.  We kept checking back to see if it had finally made it's way out to us in LA every so often and had begun to figure we'd have to wait for the dvd release.  Then driving today we saw it playing at a little house on LaBrea and hit up the next showing.<br><br>This film was well worth the wait.  It's true that the camera work isn't flashy and it's easy to tell it was adapted from a play.  But all the great characters and witty dialogue are so engaging you hardly notice.  The whole cast does and excellent job and I honestly haven't laughed during a film this much since Waiting for Guffman.  Although I think the film may be more targeted at gay audiences there seems to be something for everyone in this. Rarely have I seen a movie that managed to be this funny while being touching and real at the same time without seeming completely contrived and cheesy.","user":"spacedawg4","rank":[17,20]},{"title":"Funny, kind, hip and in its 23rd week in Palm Springs, CA","rating":10,"date":"21 April 2002","review":"I saw this with my 30-something son who asked, still smiling, as we came out of the theater, \"How long do you think they took to make that?\" \"About a week,\" I answered and I'll bet they had the time of their lives.\"<br><br>Sordid Lives manages to be sweet, glib, compassionate, irreverent, moving and very funny on an obvious shoe string budget. A triumph over crash 'em up Hollywood and stale romance flicks.<br><br>See it in a theater if you can, the group amusement is a pleasure to share.","user":"mandy-1","rank":[13,15]}]