[{"title":"Not spectacular, but pretty good","rating":7,"date":"20 October 2004","review":"One of those films which I don't think the current IMDb score (5.4) actually captures.<br><br>It's a bit formulaic - ex-bad-boy super-DEA agent gets the bad guy, pays with the life of his nearest &amp; dearest, and goes out for revenge. Even I saw the reveal at the end coming way-off (I rarely do), but I still really enjoyed this film.<br><br>I thought it was very well plotted and paced; Vin Diesel played it gruff, but mostly low-key (no huge sobbing moments, or tearful walks on the beach, which was refreshing). His character, along with that of his friend, were fleshed out into more-rounded human beings than the usual action hero &amp; sidekick. The enemies were straight out of 'the Big Book Of Drug Dealers and Cartel lackeys', but Timothy Oliphant was amusing and well played, as ever (also a great turn in The Good Girl).<br><br>And I found the violence viscerally satisfying &amp; gritty, without being seriously glorified, or venturing (too far) into Bad Boys style Hollywood explosions, helicopter gunships, LA car chases etc.<br><br>Most surprising of all (to me) is that Vin agreed to grow his hair out a little - as you would in an extended hospital stay - and roughen up his otherwise clean shaven / macho male model looks. Wandering around with the goatee, he reminded me more of the guy out of Cypress Hill.<br><br>Kudos also goes to the ending. It could have finished two scenes earlier than it did, but the tying up of loose ends wasn't done in an overly sentimental or triumphant way, which was similarly refreshing.<br><br>Good screenplay, good acting (in a pretty standard film like this), and mostly avoiding the really obvious clichés of plot &amp; character. I really enjoyed it. On the scale of revenge movies - it's not as good as Mel Gibson's remake of Payback, or The Rock in the remake of Walking Tall. But it would hold its own alongside them in a collector's box set.","user":"tenten76","rank":[47,64]},{"title":"Decent action film","rating":7,"date":"22 February 2004","review":"Lately, i do not watch too many old-fashioned' action films like this. This has mostly to do with the fact that action films are somehow always the same. The only things that can make an action film decent are not too many corny scenes and some comedic elements. Take for instance Cradle 2 the Grave, which I saw a couple of weeks back. Now the action was pretty OK, there were some funny elements, but there were some stupid things as well (such as a corny ending). Or Bulletproof Monk, which was a bit corny overall. While A Man Apart is certainly not a good film, it is one of the better old school' action films I've seen lately. The acting is decent, there are no corny elements and there is a good mix of emotion / softness and action. The film might not be suited for the big screen, but it does well as a rental (BTW: the film was shot between 2000 and 2001 and got shelved at first). The film certainly has some interesting elements and is better than most of Seagal's or Van Damme's new films. I was not disappointed to have rented it.<br><br>\n6,75 out of 10","user":"stamper","rank":[33,50]},{"title":"A pale revenge movie","rating":6,"date":"3 March 2019","review":"The start of the movie is good and gripping and it gives you the feel of a good movie in making but after 20-25 minutes the movie start loosing the plot. The movie misleads in between and after a point of time it will feel boring. Action is good, Vin diesel is as good as always. The movie could have been better provided with a good screenplay.","user":"sauravjoshi85","rank":[4,4]}]