[{"title":"an extended jam on an established theme, with improvisations","rating":9,"date":"3 July 2002","review":"I'll try to avoid echoing other comments here and cut straight to the chase: This is not perfect, but MAN it's so close. I had some trouble with the pacing, which seemed a bit slow to me--as if they weren't quite sure how to work with a feature-length timeframe; I'm still a bit hazy on just how the villain's threat was resolved, which I'm usually not after a CB episode; and gosh, *why* isn't \"Tank!\" on the soundtrack?  Songs with words just don't cut it in a CB score. --But honestly, those seem like such small problems next to everything that's wonderful about this movie. It has all the stuff you love about Bebop the series: the brilliant, flashing action and fight sequences, the character interaction, Spike's nicotine jones =), the gorgeous cinematic visuals, and the dreamlike melancholy that underlies even the funniest moments.  The villain, his grip on the fantasy/reality divide completely erased after a genetic experiment on Titan, makes a neat counterpoint to Spike, forever haunted by his dreams of the perfect future he once believed in. Jet's protective concern for his reckless teammates was never better painted than in a scene where he blusters about how much happier he was without any of them and couldn't care less where they are, only to pounce on the phone's first ring like a worried mom on date night. There's just a *little* more of Faye's skin for the fanboys (but only a very little bit more, honest! we're not talking topless here! x my heart!), Ed has a trick-or-treat encounter that would never make it to American TV,  and even the Big Shot duo put in an appearance (despite having absolutely nothing to say). <br><br>It's not intended as a wrap-up or finale to CB the series; it occurs in between episodes and should be thought of that way, as an experimental episode both different from and similar to the original sessions. Kind of like an extended jam on an established theme, with improvisations, in the true bebop style.","user":"angelynx-2","rank":[54,64]},{"title":"More than worthy of being associated with the series","rating":10,"date":"17 August 2004","review":"This movie is just as good, if not better, than most of the episodes in the series. If Bebop fans learn to accept the story for what it is--an extended version of a typical(albeit superior) episode, this movie will live up to the exceptional quality of the series. And if someone with no knowledge of the series watches this movie, they will have very little to catch up on. The great thing about the film is its accessibility to all audiences with its stand alone storyline(although Bebop fans can still get new things out of it).<br><br>With the introduction of the character of Vincent Volaju, the Cowboy Bebop brain trust has provided a great nemesis for the protagonist Spike to interact with. These two characters' fight scenes are exceptional, and the bond that they share works great with the overall tone of the series. The subtle philosophical points of the film may not be mind blowing, but they are definitely above average. Great dialogue is rare in animation, let alone anime, and this is one of the strong points of both the series and the movie. It is obvious that the creators have tried to fit almost all elements of the series into this work, and they have succeeded, despite that great burden. Each of the five major characters from the series(Spike, Jet, Faye, Ed, and Ein) get the right amount of time in the spotlight, while allowing the new characters(Vincent, Electra, and Rashid) time to develop properly. Also, as any fan of the series can vouch for, the music is not only original, but almost like a character unto itself.<br><br>Ultimately, this film boils down to the centerpiece of the series, Spike Spiegel, and his final meeting with his kindred spirit, the tortured Vincent Volaju. The result of this film helps propel the series into its heart wrenching conclusion and underlying philosophical tone. <br><br>More than worthy of being associated with the Cowboy Bebop series.","user":"Alan_Gabriel","rank":[65,79]},{"title":"A Heavenly Door","rating":10,"date":"28 October 2002","review":"I have to disagree with anyone who says that Knockin' on Heavens Door (Tengoku no tobira) is a throw-away movie version of a popular anime series.<br><br> I have seen this movie and I loved it.  The plot is involving and keeps the viewer involved in the story.<br><br>The aspect of Vincent being the one who is searching for a way to see if he is really dreaming or awake is a nice twist from it just being Spike who wonders the question.  The soundtrack fits well with the action in the movie and heightens the action and suspense.<br><br>The scenery is dynamic and the characters, the main cast as well as the new additions, carry the weight (yes, yes, I know they're not real) of the movie and the script which is well written and very Bebopish.<br><br> This movie is a perfect addition to the Cowboy Bebop series and is definitely not a throw-away.","user":"peter-c-odlaug","rank":[36,43]}]