[{"title":"Nice cast saves routine movie","rating":7,"date":"24 February 2003","review":"My subject line sort of sums up my views on this movie. The plot is not particularly original. Once you know hook, you can predict much of the rest of the movie. The difference is that they stir the pot a little in this one, and the cast seems to really enjoy working together and is fun to watch. There are a few minor surprises, but who cares. This is a movie about the charisma of it's stars, and they all shine. This is not a movie that will go down in history, it will not change your life, but it is not a bad way to spend an hour and a half.","user":"suawiyp","rank":[12,12]},{"title":"Enjoyable and quirky.","rating":8,"date":"21 August 2003","review":"I wasn't expecting much from this movie, but ended up enjoying it!  Susan Sarandon plays a character like a lot of mothers.  She's been so busy bringing up a family, that she forgets who she is and what she stands for and Suzette, Goldie Hawn brings her \"back\".  This movie reminds you to be true to yourself.  Remember who you were at 18?  Well, some of that teenager, some of her beliefs and dreams are still inside you.  And I love how neurotic the 16 year old daughter is --\"Ginger, open your throat.\" She has a little phlegm problem.  This movie has some very real moments.  I think that most women could appreciate it!","user":"jennabella36","rank":[17,18]},{"title":"A great afternoon romp","rating":8,"date":"22 September 2002","review":"I just saw this movie, and all I can say is that many of the critics don't `get it'-this is a fun romp, especially because of the efforts of the extremely gifted actors in it. Sarandon as an \"uptight\" matron is a hoot. Hawn giggles a bit, but shows us a force of nature as well. And Geoffrey Rush's character is a wondrous \"mess.\"<br><br>Basically, a best friends story, with a few twists and turns. Yes, I'd love to see more of a back story on how Vinnie becomes Lavinia and more of the Bangers' `history,' but for an afternoon of memories and joy, this is it.<br><br>\nI really appreciate the central question Bob Dolman seems to be asking.what happened to us? Kids, for those of us living before AIDS changed the sexual revolution and the greed of the '80s turned most of us into yuppies, we were `free-er.' Gee, it's a chick flick. The theatre was filled with women when I saw it, and they were all laughing at the jokes and sighing at common experiences. The Harry Plummer character? Just think about his reaction to Suzette's caring for her friend's child. The scene shows her `real' character, not just the `floozy.'<br><br>If you want great meaning and angst, rent a Bergman DVD; for a fun romp, SEE THIS MOVIE!","user":"SuetheCritic","rank":[26,33]}]