[{"title":"Future Camp Classic","rating":4,"date":"8 May 2003","review":"I rented and watched KILLING ME SOFTLY on DVD and giggled throughout the movie. It's so unintentionally funny, and silly and stupid and pointless, that I'm sure people in the near future will look back at this as camp. The film stars Heather Graham and Joseph Fiennes. Heather's character goes though a number of things or does things that are totally divorced from logic. She marries a man she hardly knows and the rest of the film is spent on her trying to know her husband's suspicious past. (If Heather's character had tried to get to know him first before marrying him there wouldn't have been a movie). Heather's role is funny and oddly endearing at the same time. She tries so hard but the whole thing is so silly that her efforts are all for naught. In EVERY scene, Heather is seen with her big doe-like eyes, dropping her clothes at any given moment, looking totally befuddled. The scene when the reporter faxes her the strange messages at her office, which is supposed to be filled with apprehension, is very funny. As is the scene when Heather pretends to be a reporter from The Guardian. Or the scene when Joseph ties her down on the kitchen table, which is simply priceless. Heather, bound to the table, doesn't look terrified or stressed, she looks bored and annoyed. The entire scene is truly out of this world. After seeing it, I wondered \"What was that all about?\" If your new husband ties you up on the kitchen table and starts going crazy, well, there's a good chance that the marriage won't last long. As for Joseph Fiennes, well, he looks, hmm, weird. I think the director was intimidated by Joseph. It seems the director didn't know how to film him at all. And because of this, his character/performance is WAY over-the-top. <br><br>The story (or lack thereof) is so obvious, the moment the \"villain\" appears on screen I knew it. The revelation of the villain's motives made me laugh out loud. It's supposed to be shocking and twisted but it had me in hysterics. Add to this the fact that the director literally took the meaning of title and applied this to the film's script/action, and everything about this film ends up looking truly silly. Everything is treated just so softly (like when Heather is tied to the table). Imagine a S&amp;M movie directed with the soft touch of a bunny rabbit.<br><br>Many scenes look like they were rushed (the mountain climbing scenes). In one scene, you can see Fiennes looking straight at the camera for a split second. The direction is not really good. The look of the film is sometimes interesting. Some scenes where cool but the whole ultra-hip look of the film will positively date it in a matter of years. The office where Heather works looks like a place where the Teletubies would feel at home. Everything about KILLING ME SOFTLY is hilarious. It's pure camp.","user":"Maciste_Brother","rank":[83,116]},{"title":"Thriller with some sex.","rating":8,"date":"9 August 2008","review":"I really feel that I have to defend this movie after the ripping it has gotten here. I watched the film without knowing anything about it, and I really enjoyed it. Heather Graham was easy on the eye, and Joseph Fiennes was suitably dark and brooding. I think that the sex scenes, probably allowed people to view this as a cheap skin flick, which is a pity. They probably should have gone further to ensure that Fiennes was viewed as a sadist, and therefore very capable of killing. There was plenty of tension, and the music was suitably Hitchcockian. <br><br>If anything, Joseph Fiennes character was too laid back towards the end. As the tension was mounting, more could have been made of the fact he appeared to be a murderer. Instead he was allowed to sit back and protest his innocence. I think had it been a Hitchcock film we would have been in no doubt he had done it, until the end. The sister could have been a really sinister character, but again lacked any development. I am not blaming the actors for this, it is obviously the script. Heather Graham is a better actress than people are giving her credit for here. I think with the lack of development in the Fiennes, and sister characters, she was left to carry the film alone, which she did admirably. I would recommend this film, just watch without prejudice. Incidenally, I married my wife after six days, and without knowing anything about her. We are still married after 32 years, so perhaps Heather was not so crazy, as stated in some of the earlier reviews.","user":"arcadia1","rank":[18,22]},{"title":"Razzie material","rating":5,"date":"27 January 2003","review":"\"Killing Me Softly\" tells of a couple who has sex, gets married, and then has problems because she (Graham) grows increasingly suspicious of him (Fiennes) whom she never really got to know before the marriage (duh). On the downside, the film has a thin story full of plot holes and implausibilities with ponderous music which is always off target and a perfectly awful school girl performance by Graham. On the upside, it's a good shoot with good camera work and lots of Graham skin. Overall, \"Killing Me Softly\" is a classy loser only for the less discerning viewer who wants a little suspense (very little) to zone to. (C)","user":"=G=","rank":[65,93]}]