[{"title":"Good.","rating":6,"date":"17 February 2007","review":"'Kevin &amp; Perry Go Large' is a really successful follow up to Enfield and Burke's original TV characters. There is always an ever present danger with feature length adaptations of TV shows, in that they'll not always transfer onto the big screen with quite the same clout (Think Family Guy).<br><br>BUT, K&amp;P have done very well.<br><br>So maybe the content is crude, but quite frankly it's a perfect reflection of youth culture abroad (yet obviously within a slanted comedic context). People do go to such destinations as Ibiza, Malia, and Ayia Napa and they DO lose their moral code.<br><br>K&amp;P is if not anything else, a depiction of REAL youth culture.<br><br>Whether it glorifies that culture or not is up for debate. I'd argue that it doesn't as I feel that Enfield's character rather pokes fun at the naivety of youth, and whilst I've been partial to my own dalliances in nutty behaviour, I can sense a critical undertone in the Kevin character.<br><br>The film is funny, and the plot is definitely good enough to keep you watching. As a pre-pubescent teen at the first time of watching, I found the film better then, than perhaps I would do now - but I know I could always whip out the DVD, watch it, and enjoy it time and again.<br><br>Enfield and Burke were obviously well versed in their roles, but as always too the Mum and Dad characters played by James Fleet and Louisa Rix, were fantastic. Their uppish standards and typical parental attitudes are thrown out the window in Ibiza, and the denigration of these standards not only shocks, but humours you too.<br><br>Eyeball Paul (Rhys Ifans) is a refreshingly crude character, and the relationship between him and the boys is one of the anchors of the flick. Typically Ifans plays the role with precision, taking any subtleties and throwing them straight out the window.<br><br>All in all, K&amp;P is a good film, but perhaps nothing but. It's hard to tell whether it's supposed to be a no hold barred comedy, or a tongue in cheek critique on British society. Am I supposed to take the film seriously? Or not? For that reason, I've given it six out of ten.","user":"pauloone1989","rank":[22,27]},{"title":"Not a masterpiece, but if you are British, quiet entertaining.","rating":9,"date":"21 October 2007","review":"I like the film, I gave it a 7, I even use a quote as my signature (\"all I wanna do is do it\") but I can see that it is not an amazing film, but it does what it says on the tin: its a Harry Enfield comedy - so its a puerile, toilet humour driven extended comic sketch. But it does have an awesome soundtrack, and does chronicle, in a comical way, the rights of passage for a British teenager from the late 90's and the traditional image of holiday with your parents in THE place to be at the time - ibiza.<br><br>I was a teenager in the 90's, I loved and still love dance music, I went to ibiza many times and now even live here, and I, like millions of other brits at the time, was a fan of Harry Enfields comedy. So for those reasons, this was more than a reasonable evenings entertainment. If you are looking for a masterpiece of comedy, then Anchorman is a good place to start, so too is The Office. Don't look in the direction of this film unless you know what you are going to get in advance - Lowest common denominator humour that pulls no punches and loves what it is. Enjoy!","user":"alicante22","rank":[10,15]},{"title":"KEVIN AND PERRY","rating":1,"date":"1 May 2000","review":"I thought that this movie was quite funny. However some of the jokes are stretched out too far. The story sees Kevin and Perry (from the Harry Enfield and Chums sketch show) go to Ibiza with Kevins parents. I would recommend this film only if you are a fan of the Harry Enfield show, or you like gross humour. I give KEVIN AND PERRY GO LARGE a 7/10.","user":"rlough9272","rank":[12,19]}]