[{"title":"a sterling comic gem","rating":8,"date":"8 June 2002","review":"I think I smiled all the way through `About a Boy,' a comic near-masterpiece derived from the best-selling novel by Nick Hornby.  For the sake of accuracy, both the novel and the film should more rightly be titled `About TWO Boys,' since the story focuses not only on 12-year old Marcus, but on 38-year old Will, a man totally dedicated to the proposition that any man who so desires can live quite happily on his own private little urban island, thank you very much.  Will's `island' is his own London flat, which he has equipped with all the accoutrements of comfort and diversion that modern technology  in the form of computers, big screen TV's and DVD players - can afford.  Who needs people when you have so much `stuff' to keep you content and occupied?  Will thrives in his environment, much to the chagrin of his married couple friends who keep insisting that he must certainly be miserable without a wife and family to give his life meaning. But Will loves being shallow  a fact of his personality he is more than willing to declare right up front  and the last thing he needs  or thinks he needs  is people to clutter it up.  Yet, island dwellers have a tendency not to remain marooned for long, and, before he knows it, Will finds himself striking up a relationship with a lonely, backward boy named Marcus, whose mother suffers from serious bouts of suicidal depression.<br><br>More than any comedy in recent memory, `About a Boy' establishes a tone and sticks with it to the end.  The screenplay by Peter Hedges, Chris Weitz and Paul Weitz (the latter two function as the film's directors as well) manages to take a potentially clichéd and predictable story and invest it with a warmth, wit and tenderness that are all-enveloping.  The voice-over narration by both Will and Marcus, which introduces us to their characters and keeps us informed as to their mental progress throughout the film, is remarkably clever and droll.  Yet, the characters never come across as smug, smart-alecky or flippant.  Rather, they speak and behave in ways that are both believable and realistic.  Hugh Grant gives his richest performance to date as Will, the man who refuses to grow up and assume the role of responsible adult, blithely unaware of the emotional depths that lie hidden under a surface of apathy and indifference.  The superb Grant is more than matched by relative newcomer Nicholas Hoult, an extraordinarily gifted young actor who doesn't look like the average `adorable' screen kid, and who makes Marcus into a very real, very likable and very sensitive young man.  The remainder of the large cast is outstanding as well.  Moreover, the film is very astute in its observation about just how easy technology has made it for us to isolate ourselves from one another.  Admittedly, a little of the sharpness does go out of the screenplay in its closing stretches, but not enough to diminish one's pleasure appreciably.<br><br>In many ways, `About a Boy' is a movie that needs to be experienced first hand, since mere words fail to convey the very special charm and spell it manages to cast over the viewer.  Rush to see it.  Comic gems like this one don't come around very often!","user":"Buddy-51","rank":[118,130]},{"title":"Effective, Satisfying Film","rating":9,"date":"6 June 2002","review":"Being afforded a life of independent means can be a blessing in some regards, perhaps, but it can also be the definitive test of one's character. If one chooses to use such a situation toward altruistic ends, or at the very least a venture that can provide some personal fulfillment, it says something about who that person is.  On the other hand, if one squanders the opportunity on a totally self-absorbed, shallow existence, it says even more.  And while taking the latter path may provide some interesting moments, it's a cosmetically created, external bubble that serves no other purpose than covering up an empty life, and sooner or later-- to anyone with even a modicum of intelligence-- that bubble is bound to burst; and when it finally happens, when the wake-up call comes, how one responds to it is the ultimate test of character, which is what happens to a such a man in `About A Boy,' directed by Chris Weitz and Paul Weitz, and starring Hugh Grant.<br><br>As far as Will Freeman (Grant) is concerned, he has the perfect life; he lives comfortably, if not extravagantly, on the income provided by a certain kind of inheritance.  On the surface, at least, he's happy.  Admittedly, however, he's the very epitome of `shallow,' who makes a conscious and concerted effort at avoiding any commitment in relationships, or even attempting to accomplish or achieve anything at all.  He merely takes from life, gives absolutely nothing back and has always been content with it. But of late, his relationships have become a bit `sticky.'  Women are becoming too demanding, the break-ups too messy.  He needs a new conquest, a relationship in which he can flex his shallowness anew, with a woman who will give him everything and demand nothing in return. <br><br>\nFortuitous circumstances provide him with just what he's looking for; fortuitous, however, in a way he doesn't realize, as it leads to a relationship through which he encounters a young boy, Marcus (Nicholas Hoult).  And it's a meeting that is destined to have an enormous impact on his life, as Marcus becomes the catalyst that changes Will's entire perspective.  For the first time, Will begins to question who he is, and what he's doing-- or not doing-- with his life.<br><br>Telling this story (adapted for the screen by Peter Hedges and the Weitz brothers, from the novel by Nick Hornby) presented a challenge to the filmmakers, in that it's nothing really new; the history of the cinema is filled with stories of individual epiphanies, many along the same lines as this one (recently, `The Kid,' with Bruce Willis, for example).  So a fresh approach and presentation, including the kind of performances they could extract from their actors, was essential for this film to attain any distinction whatsoever.  Which it does, and splendidly.  And, moreover, they succeed on all fronts.  The screenplay is intelligent, and the characters-- especially Will and Marcus' mom, Fiona (Toni Collette)-- are convincingly well developed.  With Will, there is no sudden leap into who he becomes by the end of the film; it comes though a gradual recognition and realization of who he is, after first establishing a starting point from which the character can grow.  The same is true of Fiona.  There's detours and set-backs which-- as in real life-- prevent a direct journey from point A to point B, and create the proverbial sticky wicket along the way.  Weitz and Weitz set a good pace, and most importantly, manage to give their film some real heart without lapsing into any melodramatic, maudlin sentimentality. Rather, the sentiments and situations they express are real and believable, and presented in such a way as to afford the audience any number of elements to which they can genuinely relate.<br><br>As Will, Hugh Grant gives arguably his best performance ever.  In some respects, Will is similar to other characters Grant has created (most notably Daniel in `Bridget Jones's Diary'), but there's a depth to Will he's never previously managed to achieve, and without question this is his most three-dimensional, fully developed character yet.  Grant has a natural charm and a charismatic screen presence, but his presentation is often tinged with a bit of pretentiousness that is entirely absent here.  He does an especially nice job of effecting Will's transition in very real and credible terms, and by the end, it's obvious that this is a side of Grant we have not seen before; with this role, he has effectively expanded his range as an actor.  In the final analysis, it's a performance with real substance, and it makes Will a truly memorable character.<br><br>The young Hoult brings Marcus convincingly to life, as well, with an extremely natural performance, in which he commendably manages to avoid the trappings of stereotype into which this character could easily have fallen. Some credit must go to his directors, of course, but it's Hoult who makes it especially believable in the way he responds, for instance, to certain given situations that typically seem to evoke a particular reaction when being depicted on screen (his rather introspective response to the taunts of his school mates, for example; quite different than what is usually portrayed in film).  And in their scenes together, Grant and Hoult strike a chord of reality that finally assures the overall success of this film.<br><br>The supporting cast includes Rachel Weisz (Rachel), Isabel Brook (Angie), Sharon Small (Christine), Victoria Smurfit (Suzie) and Nat Gastiain Tena (Ellie).  Entertaining, as well as insightful, `About A Boy' gives a truly fresh perspective to an element of the human condition that has been explored before, but rarely as effectively.  The Weitz Brothers make the subject of their film accessible to a wide audience, and in a way that is engaging and satisfying.  This film is going to be a pleasant surprise to many who see it, in that it delivers a whole lot more than most would expect.  And that's the magic of the movies.  9/10.","user":"jhclues","rank":[89,106]},{"title":"Hugh Grant shines; great coming-of-age movie; bloody hilarious and touching at the same time","rating":10,"date":"17 June 2005","review":"In the wonderfully entertaining \"About A Boy,\" Hugh Grant shucks everything that made him famous nearly a decade earlier in \"Four Weddings and a Funeral\" (the floppy hair, the stuttering, etc.) and ends up giving his best performance to date. He plays Will, a wealthy, happily unemployed, commitment-phobic cad (slightly less insidious than Daniel Cleaver of \"Bridget Jones's Diary\") whose newest ploy is to date single mothers because they are easier to dump. However, he meets Marcus (Nicholas Hoult), the son of a somewhat suicidal mother (Toni Colette), and realizes that he cannot continue living his life so shallowly.<br><br>This film was based on Nick Hornby's wonderful book of the same name and retains much of the wit and touching humor. The early scenes depicting Will's \"full,\" but spiritually empty, life are particularly amusing, with Will dividing the day up into units of time and spending these units on \"web-based research\" (finding pics of supermodels with see-through tops), \"exercise\" (shooting pool), grooming, and the like. Grant makes his character irresponsible, but remains enormously likable throughout the film. This is important because we start to identify with him, and understand his fears of commitment and helplessness behind his outward superficiality. His mannerismsGrant's specialty, I thinkare v. entertaining to watch; the selfishness, hurt, anger, recognition and more pass across his face effortlessly. The other cast members Nicholas Hoult, Toni Colette, and Rachel Weisz  are also v. good in their supporting roles and play off each other well.<br><br>The film doesn't follow the book too closely, however, but does one-up on the book by wisely emphasizing some parts that the book downplays. For example, Rachel (played by Rachel Weisz) only appears for a few pages in the book, but has much more presence in the movie. Through the Rachel character, we see how Will's relationship with her is different from his past shallow ones, and we realize that he is growing up. Also, the movie is filled with great one-liners and sharp, witty dialogue that never feels forced. The movie also employs voice-over function (Will's) very nicely; for example, in one serious scene, Will follows the ambulance to the hospital, looking rather serious, but in his voice-over he says. \"It was all terrible, just terrible. But driving fast behind the ambulance was fantastic.\" The character would never say that out loud, but it provides comic relief and the assurance that he is, indeed, very shallow.<br><br>The strength of \"About a Boy\" is in the simplicity and power of its scenes. Not one scene is wasted; each one tells us a wealth about the characters and leads to Will's self-discovery. That, along with Hugh Grant's delightful performance, and backed by a great score from Badly Drawn Boy, make \"About A Boy\" one of the most delightful, entertaining, and touching movies I've seen. It's a great feel-good movie. Highly recommended, especially to Hugh Grant fans, or anyone who has ever empathized or sympathized with Will and his situation. One of my favorites. 10/10.","user":"kwongers","rank":[52,64]}]