[{"title":"Glad I listened to my instinct, not the critics. A fine and funny movie!","rating":6,"date":"6 February 2003","review":"Ever hear of the story of crying \"wolf?\"  Most of the extra forceful reviews of \"Sweet Home Alabama\" are the professional and amateur reviewers that try to tell us, \"stay away, this is a waste of your time, do not see it.\" Bull-dinkey! They are just crying \"wolf\" for some unknown reason. This is a fine, funny movie that relies more on an ensemble cast than just on Reese Witherspoon. The writing is smart and funny, the directing fits the comedic mood of the story, and the acting is just right.  Although it is a quite different film from \"Legally Blonde\" and \"Election\", I enjoyed it just as much, and will enjoy it upon repeat viewings.<br><br>no SPOILERS here...<br><br>Critic Ebert has a good summary of the story so I won't repeat any of it here.  For those who may see the film and wonder how much the small town life is exaggerated, let me tell you \"not much!\"  I grew up in a very small southern town, and I go back on occasions for high school reunions. What is depicted in this film is pretty darned close to reality, with some license taken for making the story a bit more interesting. Pay special attention to the story with the cat, and its burned tail, and watch closely at the end. :-)<br><br>The DVD is fine but the picture is not \"reference\" quality. The sound is Dolby 5.1 but surround channels are not very dynamic.  The \"extras\" has several deleted scenes, and also includes the original ending that was scrapped after comments from test screenings. They had to re-shoot and I think the eventual ending is very appropriate. The first and last scenes complement each other very well.<br><br>\"Sweet Home Alabama\" - a fine movie for those who enjoy a good comedy, and especially those who like Reese Witherspoon.","user":"TxMike","rank":[51,63]},{"title":"Reese Witherspoon as a smart, sassy blonde? Hard to believe, I know.","rating":5,"date":"8 December 2004","review":"I cannot envision anyone but Reese Witherspoon as Melanie, a snooty-but-lovable up-and-coming New York City fashion designer from Alabama who receives a marriage proposal from the prominent, well-bred son of the mayor of New York. Of course, this means that she must go back to the small town where she was raised to demand a divorce from Jake (Josh Lucas) - seven years after walking out on him. <br><br>Aside from being a love story, this film shows us that you cannot escape your past, no matter how hard you try. Everywhere she turns Reese's character is beset by the people and events of her youth. Old friends seem almost compelled to reminisce about their youthful escapades. She just cannot seem to get away from it. You really get a sense of how she must feel when you see her in the honky-tonk bar, surrounded by rednecks with no visible exit.<br><br>Witherspoon is right at home in the role as a smart, sassy young woman ala 'Legally Blonde'. However the real star of the show is Josh Lucas. His expressive face lends an authenticity to Jake that transcends the stereotypical former football star and produces a charismatic, likable guy who just wants to win back his girl. But if it is stereotypes that you want, they are there to be found. Most prominent is the mother of Reese's fiancé, played by Candice Bergen. She is one tough politician who is as cold as ice and predictably obsessed with her public image. Others include the independent, feminist girlfriend, the redneck buddies and a gay fashion designer.<br><br>Director Andy Tennant also likes to deal with some classic historical and societal conflicts in this movie, such as the North versus the South. In addition to numerous Yankee/redneck jokes, Witherspoon's dad (Fred Ward) is involved in the regular reenactment of a Civil War battle. Tennant also seems to be a fan of love's ability to prevail in the face of these conflicts. His film 'Ever After' has a similar theme  it deals with the struggle between nobility and commoner during medieval times. Specifically, it is about a Prince who falls in love with a peasant girl. Despite the odds, their love overcomes this obstacle. <br><br>If you like romantic comedies, you should like this film. Despite its flaws this movie is upbeat, entertaining and it comes with a lesson about the futility of trying to escape your past that might prove invaluable to some audience members.","user":"daddyfads","rank":[49,64]},{"title":"Home is where the heart is","rating":6,"date":"27 October 2006","review":"I found Sweet Home Alabama to be a very sweet romantic comedy, Reese Witherspoon was just so adorable in this film. I wanted to see Sweet Home Alabama because I love Reese and remember hearing so much about it when it was released. So, of course, I figured now would be a good time to rent it and find out what this movie was about. Over all, I'd say it was a bit over rated(everyone I knew who saw this movie loved it), but still a watchable romantic comedy.<br><br>Sweet Home Alabama is about a girl, Melanie, she is about to marry the mayor of New York city's son. But she has a bit of a bumpy past in the south where her family and old friends are, she's still married to Jake, her high school sweetheart. Without trying to bring up her embarrassing past to her fiancée, she has to get things done and settled with everyone, including her husband. But she slowly discovers how much she missed her true home and how much of a wonderful guy that Jake is.<br><br>A bit predictable and silly, but over all I would recommend Sweet Home Alabama for a lite comedy that most could enjoy. Like I said, it's not that big of a deal, but I love Reese Witherspoon personally, so you might disagree, but then again, how will you know if you don't give the movie a shot? So, sit back and just have fun! <br><br>6/10","user":"Smells_Like_Cheese","rank":[27,34]}]