[{"title":"Review by a Polynesian viewer","rating":10,"date":"16 February 2005","review":"I loved this movie!!! My father is Tongan and my mother is Samoan (the first island Elder Groberg landed at the beginning of his journey). Even though I was born and raised here in the US, I have been exposed to my Polynesian roots and love and embrace both cultures of who I am (Polynesian side and American side).<br><br>I have to say that my family and I LOVED this movie. It is refreshing to watch a beautiful movie without all the sex, violence and vulgar material that permeates our society today. This movie is about True Love on so many levels - the love between Elder Groberg and his future bride Jean, the love between the Tongan people and Elder Groberg and the love between Our Lord and his children. No, I'm not Mormon, I'm actually an Assembly of God Christian, however that does not overshadow my appreciation for this movie.<br><br>The depiction of the people of Tonga is accurate. They are a lighthearted and loving group of people who love to laugh and find joy in the simple things of life. They are all about respect and honoring one's family. The scene of the first funeral brought back memories for me as it illustrated exactly how these kind people handle the departing of a loved one. When my dear Grandmother Siu passed away in 1994, my family and I traveled back to Vava'u (an island within the Kingdom of Tonga) to lay her to rest. The unmasked grief and crying as depicted in the movie was exactly how my grandmother's funeral was. The crying and grieving took place for 1 full day (24 hours - day and night) while different groups of people from all the villages on the island, came to pay their last respects.<br><br>Hats off to Disney for going out on a limb to bring the story of one young man's journey of faith and trials and tribulations of his mission to the big screen! Well done!","user":"jmellor00","rank":[40,48]},{"title":"a well-made film","rating":9,"date":"20 December 2001","review":"Considering that this movie was neither made by, nor endorsed by, the LDS church, The Other Side of Heaven is an endearing, uplifting movie that celebrates and pays respect to Mormon missionaries without going too deep into LDS philosophy or beliefs.  Produced in part by the same producer who brought us such cinematic gems as Schindler's List and Jurassic Park, Heaven is refreshingly devoid of many \"blockbuster\"-style elements and is a very low-key presentation of a young man's struggle to survive, adapt, and succeed in a world far far away from his familiar hometown in Idaho.<br><br>In the early 1950's Elder John Groberg from Idaho Falls accepts a call to serve a three-year LDS mission to Tonga.  Although he is thrilled and dedicated to his mission call, he is understandably concerned about leaving Jean, the love of his life, in Utah for fear that she will marry somebody else.  Yet his faith and determination to do what he believes is right are shown throughout this movie as his motivation to stay through the hardships, the loneliness, and the difficulties that are faced during his mission.<br><br>The Other Side of Heaven is essentially a chronicle of Elder Groberg's true life mission.  At times spiritual, humorous, frightening, and uplifting, the movie is a tribute to a young man who faced overwhelming odds and setbacks to continually overcome some of the most difficult situations ever beset a young missionary.  Throughout the film, Elder Groberg's letters to Jean and her letters back to him keep the film centered on it's true message, that of a man out of place . . . loving where he is, but wishing at the same time, to be home with the others that he loves.  And it is this internal struggle which, I am sure, has been faced by every other missionary in history, that gives the movie its depth and emotional quality.<br><br>My only criticism of the movie comes from the very brief explanation of the traditions and culture surrounding LDS missionaries and the way in which they receive their calls.  For those who are familiar with LDS missions, this should be no problem, but for those viewers who have not been exposed to the process of a Mormon mission, the first 15 or 20 minutes may seem a bit confusing.  There is another bit of Mormon tradition which is very poorly explained, but I can't tell you what it is without giving away a fairly poignant moment of the film's ending.<br><br>Nevertheless, The Other Side of Heaven is not just a Mormon movie.  It is a movie that can be enjoyed and appreciated by people of all faiths (and even those of no faith).  Because in the final analysis, this is a movie about the triumph of the spirit and the joys and rewards of fighting for, and doing something, you truly believe in.","user":"millardmovieguy","rank":[33,42]},{"title":"An inspiring film","rating":8,"date":"26 June 2004","review":"My one liner says that this is an inspiring movie.  Unfortunately, some of the other reviewers feel pretty uninspired by it.  I guess their \"a priori\" hatred for the protagonist and his religion are the predicate for these feelings.  This film is based on true events.  It is not \" Mormon propaganda\" as suggested by many.  The missionary happens to be a Mormon but the story would be as moving despite the denomination.   It is the story of a young man on a religious mission to the Tongan people.  His companion is a native and his mission is characterized by a love for this people, not condescension to them.  How anyone could watch this film and come away with bad feelings is beyond me.   The whole point of the film is about loving our fellow man and giving them due consideration.  The protagonist has his detractors in the film also that he eventually wins over with his sincerity and goodness. If some one does not like this film--fine--but to use these pages as a canvas for painting one's hatred demonstrates the need for films of this kind.  There is a lot of hatred and bigotry in the world that needs to be done away with.  This film demonstrates one example of how understanding and respect develops between people.  I'm sorry members of the \"new inquisition\" missed this point.  I give it an 8 out of 10.","user":"jawlaw","rank":[45,60]}]