[{"title":"Good laugh","rating":7,"date":"8 January 2007","review":"We first saw this movie a long time ago and it has several laugh out loud moments. We then rented it again for a couple of our nephews, a few years ago, who really enjoyed it. They were at the time wrestling fans who knew wrestling was mostly fake.<br><br>Last weekend we borrowed it from a friend to watch with those same nephews from a few years ago, and we laughed all the way through it again. The boys no longer watch wrestling, said they are catching new jokes in it this time around.<br><br>The acting is over the top, and bigger than life but so is wrestling! It is a great movie if you want to escape and laugh for an hour and a half.","user":"RunningD","rank":[12,13]},{"title":"Just plain fun","rating":28,"date":"28 December 2001","review":"I think the people who criticized this movie missed the entire point of it. Ready To Rumble isn't supposed to be a \"good\" movie; it is just supposed to be a \"fun\" one.  I don't think the folks who put this film together had any illusions about it winning any Oscars but I think they made a very good \"dumb\" movie.  I am NOT a wrestling fan and I still enjoy watching it because I can enjoy it for what it is without expecting more out of it.  I watched it last night with my 10 yo son and he thought it was great.  Those who found fault with the movie need to take themselves and their entertainment less seriously.","user":"efeigenbaum","rank":[13,16]},{"title":"What could have been a disposable b-movie is salvaged by the fine acting of an ensemble cast.","rating":6,"date":"6 February 2010","review":"Ready to Rumble doesn't much going for it at a glance. Gordie (David Arquette) and Sean (Scott Caan) are two adolescent boys trapped in the bodies of twenty-something sewage workers from Lusk, Oklahoma. The WCW is their passion and as true die hards, they brook no criticism of the sport's veracity. Their nights are spent in a convenience store parking lot jawing with junior high school students. These men are losers through and through. And yet there is something innately likable about these boy-men. They are losers in the sense that Rocky Balboa was a loser; they were born with nothing into the middle of nowhere, blessed with naught but dogged determination and unwavering faith in their cause. Ready to Rumble follows their quest to restore an even bigger loser to his former glory. That loser is disgraced professional wrestler Jimmy \"The King\" King (a terrific Oliver Platt). King is a hero and role model to the boys from Lusk, who know him only from his television persona. In reality, King is an alcoholic who spends his days in drag, hiding from child support collectors in a secluded trailer. He has been exiled to Palookaville by corrupt wrestling promoter Titus Sinclair (the always unctuous Joe Pantoliano).<br><br>The story is told kayfabe; that is to say, the filmmakers would have us believe that wrestling is a real sport and these athletes are really beating one another to a pulp in the ring, night after night. So when a gang of professional wrestlers dive off of the four corners of the ring to deliver a four man head butt to the fallen King, we are expected to cringe at the brutality. When King is unjustly stripped of the title, we are expected to feel outrage on his behalf. And when the boys travel cross country on a search for their hero, we are expected to feel excitement at the prospect of King's triumphant return. Personally, I had no such experiences as a viewer, yet something about this very simple film moved me. At its core, Ready to Rumble is the story of an emperor disrobed. Oliver Platt gives a commendable performance as King, a boorish oaf still capable of feeling shame. This man is no Bret Hart, no Hulk Hogan; no \"Stone Cold\" Steve Austin he. King fights dirty, drinks heavily, and mistreats his only supporters constantly. That by the end of the film I came to care about this man and his struggle is a true credit to Oliver Platt, one of Hollywood's finest unsung actors. Above all what touched me about Ready to Rumble was the faith of the two boys in their hero. Initially it was so undeserved it occasionally strained credulity; other times it was merely heartbreaking. But if there is one thing a viewer ought to take from Ready to Rumble, it is the testament borne to the transformational power of faith. By the end of the film, King has paid the cost of redemption and becomes the hero the boys always perceived him to be. The film's message is the following: as we believe, so shall it be.<br><br>As a self important film snob, I would be remiss if I didn't note duly the many things in Ready to Rumble I could have done without. This film is supposed to be a comedy, but its humor mostly comes in the form of juvenile absurdity. Perhaps Adam Sandler fans will enjoy the adolescent mischief, but I mostly found it a distraction from what could have been a compelling drama in the hands of a more capable director. In a forced subplot, Gordie's overbearing father, the town sheriff, is hell-bent on getting Gordie to follow in his footsteps. He'd rather see his son find a steady career in law enforcement than spend the rest of his life a wrestling obsessed sewage handler. This man is introduced as an antagonist, but bluntly, I found his position very sympathetic. Who could blame him for attempting to intrude on his adult son's adolescent fantasy? Moreover, Rose McGowan plays a conniving, unlikable tart that Gordie becomes quite stricken with. Her character really doesn't have much of a reason for existing other than to cram an attractive actress into a Nitro-girls outfit. And of course the ending is all too pat, as it must be in a film that takes place in the WCW universe.<br><br>For all of its faults, I was surprised to find myself enjoying Ready to Rumble. I came to care deeply about its well meaning protagonists and their fallen hero. Arquette, Caan, Pantoliano, and especially Platt all show their stripes as actors, turning what could have been a farce into a compelling journey of redemption. I can't quite give the film a recommendation, but it's underdog story and rock solid performances struck a chord with me.","user":"b_buddy1","rank":[6,7]}]