[{"title":"Crass, offensive, and absolutely hilarious","rating":9,"date":"9 August 2004","review":"Usually this kind of film turns me off, but I was talked into watching 'Road Trip' with a bunch of college buddies and a couple of twelve-packs, and I couldn't stop laughing.<br><br>Josh (Breckin Meyer) has loved Tiffany (Rachel Blanchard) since they were both five years old. But Josh attends college in upstate New York, while Tiffany has gone to school in Texas. Josh's friends think he's crazy to keep up a long-distance relationship when there are plenty of girls around to . . . date. Particularly alluring is Beth (Amy Smart), who has the hots for Josh. When Josh is unable to locate Tiffany by phone and begins to suspect that she's been cheating on him, he gives in to his urges and brings Beth back to his dorm room for a night of hot love. Beth, eager to show how wild she can be, decides to videotape the encounter. The next day, Josh finds out that he couldn't reach Tiffany because of a family emergency, and is immediately wracked with guilt. Things get more complicated when his knuckleheaded suitemate Barry mistakes the sex tape for a video message to Tiffany which Josh had asked him to drop in the mail. Horrified at the thought of Tiffany popping a tape into the VCR to see him making the double-backed beast with another girl, Josh determines to travel to Texas to intercept the illicit tape. His two best friends--resident prankster E.L. (Sean W. Scott) and stoner-intellectual Rubin (Paul Costanzo)--offer to come along, and help Josh persuade mega-nerd Kyle (D.J. Qualls) to let them use his father's car in exchange for a chance to come along for the ride.<br><br> From that point on, 'Road Trip' follows the traditional teen exploitation comedy format, though with greater wit and intelligence than should be expected from the genre. Director Todd Phillips manages to give us slapstick, gross-out comedy while simultaneously poking fun at stereotypes and experiences familiar to anyone who's gone to college (psycho-sorority hazing, TAs trying to make undergrad girls, alcohol- and pot-related shenanigans, the nerd breaking bad, a hilarious run-in at an all-black fraternity house,etc.). Compensating for the adolescent hijinks is the surprisingly smart and thoughtful subplot for Kyle, who transforms from nerdy object of derision into the film's most likable and memorable character.<br><br>In the tradition of 'Animal House,' 'Road Trip' is crass and juvenile, but irresistibly funny. Not a movie for date night, but a good choice for gathering around the tube with bongs, brews, and bros. An instant joe six-pack classic.","user":"eht5y","rank":[64,80]},{"title":"Unforgettably crude and unforgettably funny! You will not stop laughing!","rating":8,"date":"17 April 2001","review":"How can I explain this movie?  IT'S HILARIOUS!!  Though you know the plot is no more than a setup for one wacky situation after another, it works and it works great.  This comedy pushes the envelope in every aspect, and smiles proudly.  Tom Green, who gets a pretty small role, is the scene-stealer. Fans of him will be very impressed.  One moment that had me almost on the floor was the French toast scene with SNL regular Horatio Sanz.  I don't want to give away any of the comedy, because that would be a sin.  Just take my word:  You will love this movie!  You will not stop laughing!  This is one trip worth taking!","user":"mattymatt4ever","rank":[57,73]},{"title":"My kind of movie","rating":8,"date":"29 January 2005","review":"Similar in style to American Pie, and ultimately stemmed from the likes of Porkys and Animal house, this movie was right up my street.<br><br>Josh Parker is separated from his childhood sweetheart by a difference of collage and of course 1800 Miles, until he videos himself having sex with someone else and accidentally sends it to her.<br><br>The road trip then begins, and its a journey of disaster, discovery and above all laughs, as Josh tries to get to his sweetheart before the tape does.<br><br>A really funny film, with the right ingredients.<br><br>8/10 Also check out, American Pie, Old School and if you fancy something older try Porkys and Animal house.","user":"mjw2305","rank":[41,54]}]