[{"title":"One of the bravest observations on the truth of humanity","rating":10,"date":"3 November 2004","review":"I started watching Dogsville and felt like turning it off.. after all, what kind of movie could occur with no scenery? No doors.. it seemed like some sort of play/movie hybrid but after a shortwhile all those things faded away until I realized how much I would have missed if I had turned it off - it is now one of my favourite movies of all time.<br><br>Why? It is so brave to criticse humanity like this and admit just how 'dark' a race we truly are - not matter how much each of us profess to being 'good', we all know that most of us are anything but. Through this movie you see a woman who learns the cold harsh truth in a place where she expected to find the goodness that her faith told her existed. And then on not finding it, discovered that even within her lay a wrath that echoed the darkness that she herself wished did not feature so dominant in our race. And the biggest test of this is to observe your own emotions throughout this movie until what you feel at the end as perfect evidence...<br><br>I honestly believe those people that don't believe what this movie is expressing needs to take a cold hard look around them. And if they still don't believe, they are just like the people in this movie - unwilling to see the truth and coming up with excuses and reasons when nothing justifies the horrible world we live in.<br><br>A true masterpiece - one of the few pure pieces of art in cinema with amazing acting from Nicole Kidman especially, and the lack of a set causes you to be immersed in the characters like no other movie. And its 'them' and human nature that is the focus. Will leave you thinking and astounded (unless you don't like to think and can't watch a movie that isn't afraid to do something unique, in which case there a countless movies for 'you').","user":"Viz79","rank":[563,696]},{"title":"A Disturbing Sense of Illustration","rating":3,"date":"3 March 2006","review":"\"Dogville\" is, along with Peter Jackson's \"Heavenly Creatures\", one of the most disturbing film experiences I've ever had. Love it or hate it, it's impossible to be indifferent about this overwhelming film written and directed by Lars von Trier.<br><br>This is the first part of a trilogy ironically entitled \"USA: Land of Opportunities\" (\"Manderlay\" is the second, \"Wasington\" will be the third). \"Dogville\" begins with a prologue and extends to nine chapters in almost three hours of daring, exquisite film-making.<br><br>Nicole Kidman gives the performance of her career, in my opinion. Forget her (great) portrayal of Virginia Woolf in \"The Hours\", and the ambitious Suzanne Stone (\"To Die For\"): Kidman's most accomplished composition to date is Grace. She's a beautiful young American who, apparently on the run from gangsters, hides herself in a small Colorado town called Dogville, helped by Tom (Paul Bettany) and the other residents. Things go fine for some time until Dogville's folks begin to exploit the lovely Grace and, literally, chain her up like a dog.<br><br>You'll better appreciate the film if you don't know too many details (and even if you do, Von Trier reserved us lots of bitter surprises). We could say briefly that this is a film about those people you lend a hand and want to take your arm, but \"Dogville\" is too sharp and intelligent to be summed up this way. Many people accused Lars von Trier of criticizing the American arrogance violently. That's true, but the fact is that \"Dogville\" is a universal story: it could happen anywhere. Human beings are really this bad?, we wonder by the end. \"Dogville\" wasn't made to make you feel good, but it's a compulsory film for everybody.<br><br>\"Dogville\" is a much better work than \"Dancer in the Dark\", Von Trier's previous film which gave him the Golden Palm at Cannes, and proves definitely he's one of the greatest filmmakers nowadays. He led his ensemble cast wonderfully, and all of them are superb (that's no surprise, however, regarding Kidman, Ben Gazzara, Lauren Bacall, James Caan, Chloë Sevigny, Paul Bettany, Stellan Skarsgård, Jeremy Davies, Patricia Clarkson, Harriet Andersson, Udo Kier, Zeljko Ivanek and Philip Baker Hall, among others  honourable mention to John Hurt's excellent, ironic narration). 10/10.<br><br>P.S.: You'll never forget David Bowie singing \"Young Americans\" after seeing this film.","user":"Benedict_Cumberbatch","rank":[134,166]},{"title":"Hard to digest, but great.","rating":9,"date":"28 August 2005","review":"Tough. Once again Lars von Trier tortures the audience (as he did previously on Dancer in the Dark) by upraising the darkest side of the human being. From the beginning you know that things can only get worse, but I doubt that one can figure out neither what's to come nor the powerful conclusion. Nicole Kidman's interpretation is perfect - intense, poignant, passionate, you name it. She is fantastic and so is the small cast locked inside Dogville's scenario (a wonderful creation - I wonder how something so simple can bring such a strong effect). Again, the entire cast is fantastic and for that goes an extra credit for Lars von Trier. His capability of pushing actors to the limit and extracting painful emotions from them creates a heavy atmosphere, full of tension and, at the same time, so familiar. It is not that Dogville represents the essence of our communities, but it exposes some aspects of our lives that we prefer to hide under the carpet.","user":"ffc_home","rank":[103,128]}]