[{"title":"Great Film (for the right fans), Horrible DVD","rating":8,"date":"25 January 2004","review":"Version reviewed: 'Key DVD' distributed by 20th Century Fox, 2002, 80 minutes <br><br>My recommendation rating OF THE FILM ONLY: 8 out of 10. <br><br>Recommendation rating for this version: 2 out of 10<br><br>Let's get the bad news out of the way first, then I'll explain my high rating of the film. The DVD box art says that Carnivore is a widescreen presentation that is 'digitally mastered'. The film is NOT in widescreen, and 'digital mastering' can only mean that either the master exists on some kind of digital medium, or worse, that the film was 'mastered to digital' in the sense that DVDs were made from the master (obviously, since the product is a DVD).<br><br>The transfer is one of the poorer ones that I've seen (unfortunately it isn't the worst). It is extremely grainy (it looks like it was recorded from a VHS tape that had been rented about 300 times in the mid-80s, and then stored in a mildew-filled basement for 10 years), The sound has a lot of hiss and was equalized with far too much bass--you have to crank up the treble, crank up the volume, and you still can't hear dialogue in some scenes. I don't know what aspect ratio directors F. Joseph Kurtz and Kenneth Mader filmed in, but the framing suggests that it _wasn't_ filmed in 'full-screen' (1.33 : 1), which is the aspect ratio on this disc.<br><br>Additional bad news is that the box art also promises a director commentary, a featurette called 'Carnivore Kills!', a trailer, and optional Spanish subtitles. None of these are on the disc. Instead, the disc has two menu options. One for 'Play Movie' and one for 'Scene Selection'--which gives you access to only eight chapter markings. This is either a serious case of false advertising or an equally serious screw-up on the manufacturing end. And in both cases, it would probably be best for everyone to send their copies of the DVD back to 20th Century Fox and demand a refund plus a free copy of the DVD when the corrections are made. Even if some of the problems (such as the sound) are rooted in the source material, these can be fairly easily rectified in a moderately-equipped recording/engineering studio, especially with a distributor like 20th Century Fox.<br><br>And why might you want a copy of the DVD in anamorphic widescreen with remastered sound, a director's commentary, and other special features? Because this is a very fun and entertaining little horror film. At least if you have a taste for camp, and you're not one of those philosophically-challenged folks who conflates 'horror' and 'scary'. Carnivore is more likely to be enjoyed by someone who thinks that Killer Klowns from Outer Space is a masterpiece. Someone who thinks that two of the most underrated films of the 70s are Daddy's Deadly Darling and Carnival of Blood. Someone who has actually memorized a number of lines from Sgt. Kabukiman N.Y.P.D. and is proud of it. Someone who thinks that one of the biggest tragedies in filmdom is that Frank Henenlotter has only directed five films since 1982 (and none since 1992). If you have no idea what I'm talking about, and you're looking for scares only, do yourself a favor and pass this one up for now.<br><br>Carnivore is one of those 'genetic experiments gone wild' films, with touches of the X-Files and an 80's slasher flick mixed into the stew. Yes, it has narration by a woman with a heavy Midwestern accent who is obviously reading. It has (sometimes intentionally) ridiculous performances. The monster is obviously a guy in a suit. For long periods of time, everything in the film is blue. However, as difficult as this may be for some people to understand, all of these elements are assets in a film like this, especially because it's obvious that Mader and Kurtz harbor no delusions that they're making something in the vein of Gone With The Wind. Instead, Carnivore plays like an impeccable, hilarious spoof of its influences, sometimes approaching a spoof of a spoof, and at the same time seems like a lost horror gem from 1985 (its authenticity in that respect is incredible). It pokes fun at the clichés and conventions, and yet embraces them at the same time--a feat only serious fans of the relevant eras of horror could achieve. There are serious aspects. There is plenty of tension. Some of the blue shots (and some others) are beautiful. The gore effects are well-done and well-shot. The sets are excellent, and even more impressive when you realize they were built in the basement of the director's rented house. It is clear that Carnivore is a low-budget affair, but the artistry and dedication apparent enables it to transcend any budgetary limitations.<br><br>But please, give us a release on DVD that does the film justice! This would have been a perfect candidate for Troma, Lucky 13/Program Power, Something Weird, or anyone comparable. But the Key Video/20th Century Fox edition is horrible.","user":"BrandtSponseller","rank":[13,15]},{"title":"Painfully bad monster flick.","rating":3,"date":"3 May 2006","review":"A Top Secret Government project decides to set up its laboratory in the basement of an abandoned old house.They're using genetics to create an intelligent,regenerating mutant critter for the purposes of warfare.Even more inevitably,four teenagers decide to pick that night to camp out in the spooky old house.\"Carnivore\" is absolutely bad and painful to watch.Whoever give it a 10 needs to have his/her head examined.I can't believe that it took almost twelve years to make this piece of cow dung.The acting is horrendous,the creature looks lame and there is absolutely no suspense.A couple of gore scenes can't save this this boring trash from fading into total obscurity.Watch this one only under the influence of alcohol.3 out of 10 and that's being kind.","user":"HumanoidOfFlesh","rank":[9,10]},{"title":"Clean the garage or bathroom instead","rating":1,"date":"7 February 2003","review":"What's there to say...  Other than this is the absolute worst \"horror\" flick I've ever seen.  Don't waste your time.  The acting is terrible and the monster looks about as scary as a soggy puffball. At 80 minutes, I found myself fast forwarding to find something worth watching.  I never found it.","user":"jjenkins14502","rank":[7,9]}]