[{"title":"Not excellent, but often funny","rating":7,"date":"31 July 2001","review":"Martin Lawrence is often trusty in the world of comedy.  Maybe I'm just overcoming his awful \"Blue Streak,\" but I felt this comedy--though saggy at times--was quite funny.  The premise is undoubtedly implausible.  How's a whole neighborhood going to believe that this undercover cop with a latex body that looks somewhat like Big Momma is actually Big Momma?  There's a lot of disbelief to suspend.  But the gags often worked and I can say I laughed about 75 percent of the time.  Some are predictable, like when Big Momma takes a karate class and starts beating the teacher--played by Anthony Anderson--to a pulp, but they still work due to the way they're handled. And Lawrence turns in yet another fine comic performance, with a script that could've used a rewrite but was nowhere near as bad as the crackerjack script he had to work with in \"Blue Streak.\"  The talented comic helps keep the movie togehter, with a little assistance from the supporting cast.  Paul Giamatti, who was great as Pig Vomit in the acclaimed \"Private Parts,\" is funny as Lawrence's partner.  We also have \"Me Myself and Irene's\" Anthony Anderson and Cedric the Entertainer.  <br><br>The plot is chaotic, sometimes predictable, and becomes more and more implausible by the minute but the comedy works and because of that we're able to excuse the script's shortcomings.  \"Big Momma\" doesn't deliver the biggest laughs, but it's good, fun entertainment on a lonely weekday afternoon.  <br><br>My score:  7 (out of 10)","user":"mattymatt4ever","rank":[25,32]},{"title":"Funnier Than I Thought It Might Be","rating":8,"date":"3 December 2006","review":"This was a surprisingly good comedy, despite the predictability of it and the typically-sappy Hollywood ending. Nevertheless, this film has a bunch of laugh- out-loud scenes and jokes and Martin Lawrence is a likable guy. He has the ability to make us laugh just by making goofy faces. His best were when he was trapped in the bathroom behind the shower curtain when the real \"Big Momma\" (Ella Mitchell) was taking a dump a few feet away! The looks of Lawrence's face during that period were hilarious! <br><br>Lawrence eventually dresses as a big fat woman and provides laughs doing so. Ever since the early days of television and Milton Berle, people have laughed at men dressing up imitating women. Pretending to be a 300-pound woman makes it even funnier.<br><br>Throw in a pretty female lead (Nia Long) and a little drama to go along with the yuks and it winds up being a decent movie.","user":"ccthemovieman-1","rank":[24,35]},{"title":"Not Nearly As Bad As I Feared","rating":6,"date":"7 December 2002","review":"Why did I rent this movie? I don't really appreciate Martin Lawrence, not his old TV show nor his stand-up routine. But I did rent it nonetheless, fearing that I'd wasted my $2.99 after returning home.<br><br>My fears were ungrounded. This movie is actually funny, hysterically so in a few scenes. Not to mislead the reader, I have to state that this movie is nothing great; it's actually just a trifle. Just suspend all belief as Lawrence portrays an FBI agent who dons a fat-suit in order to impersonate the 350-pound aunt of the lovely young suspect Lawrence and his partner are tailing. Of course, no one, not even the aunt's suitor, can tell the difference. If you can get by this absurd premise, \"Big Momma's House\" contains some really rib-tickling slapstick. When Lawrence, while impersonating Big Mama, is required to mid-wife a birth...that scene alone is worth the $2.99.","user":"gbheron","rank":[18,27]}]