[{"title":"While pointless, it's still a fun movie","rating":5,"date":"11 January 2004","review":"Mr. Deeds, the remake of Mr. Deeds Goes To Town, Mr. Deeds Goes To Town is an old comedy that is personally one of my favorite comedies. It's just a wonderful film that I highly recommend you watch if you get the chance. So Adam Sandler decided to take on that classic and make it into his film, which honestly isn't that bad, just in comparison, believe me then you look at it as a horrendous film. It was just one of those movies that really didn't need a remake. But Adam Sandler did bring his own bite to the film and just updated the story for the younger generation that obviously never heard of the movie.<br><br>After Preston Blake freezes to death at the summit of Mount Everest with a triumphant smile on his face, a search for his heir for his successful company begins. When it is found that he has a living nephew named Longfellow Deeds who runs a pizzeria in New Hampshire, Deeds is contacted and brought to New York City by attorney &amp; businessman Chuck Cedar. Plans are made for Deeds to sell his shares in the company to Cedar and return home $40 billion richer, but he must remain in New York for a few days as all the legal details are worked out. The story is major news, and reporter Babe Bennett, who works for a tabloid show, has a friend pretend to steal her purse in sight of Deeds, because their research indicated Deed wanted to meet a girl by saving her, the same way his father had met his mother. Deeds rescues her and she continues to go out with him under the disguise of Pam Dawson, school nurse. Though Pam initially hopes to just get a good story on the new heir, she eventually falls for the kind-hearted Deeds while realizing that all she's done is lie to him and wants to be with him. Chuck is also up to no good in wanting to take over the company from Deeds and doesn't have the best intentions.<br><br>Mr. Deeds has a few funny moments, even though it was incredibly immature, I do have to admit that I got a kick out of the scene where Longfellow shows off his frostbite foot and tells the servant to hit it with the fire poker, and screams to freak him out, yeah, it's something that most little brothers would do to their older sibling, but it still got a laugh. Wynonia Rider was actually pretty good in the film, she was very adorable, but her chemistry wasn't exactly on key with Sandler, not her fault, just I wasn't feeling it too much in the film. Over all the film is worth the look if you see it on TV, but otherwise, I wouldn't recommend going out of your way to see the movie.<br><br>5/10","user":"Smells_Like_Cheese","rank":[27,36]},{"title":"Sandler's lovable fool has a serious message while slipping on a banana skin","rating":28,"date":"28 April 2003","review":"Nobody goes to see an Adam Sandler movie for spiritual enrichment or intellectual stimulation - let's get that out of the way first. Once you accept you've paid your money to be mildly entertained in a lighthearted, slapstick manner, strap in and enjoy the ride.<br><br> I keep hearing Sandler is a major Hollywood player these days with an equal footing as producer as he is actor (he has produced a considerable amount with fellow actor Rob Schneider - the similarly inane but funny - mostly in spite of yourself - Hot Chick being the most recent example, in which he has a cameo role and indeed, Schneider helps Sandler out in Mr Deeds) so it's hard to prove that Sandler is now typecast as a lovable fool, because it's fairly likely he chose the part himself, possibly aware that Hamlet might be a little out of his league. Sandler need only check his bank balance to see that the lovable fool is certainly a lucrative one, having made an absolute mint playing countless other characters blessed with naive charm and a heart of gold.<br><br> The story - we all know it's a remake of the classic depression-era propaganda film starring Gary Cooper, designed to lift spirits and foster a sense of community - centres around a picturesque New England town and its perenially-cheerful, smalltown inhabitants, chiefly Longfellow Deeds (Sandler), who inherits a fortune from an uncle he never knew, finds himself at the helm of a media empire and heads to the Big Apple to find out more. Here Winona Ryder steps in as the ambitious TV reporter determined to get her big scoop and dupes the affable Deeds into falling in love with her. All the time she's wearing a wire and a hidden camera to enable their courtship and his antics, sometimes drunken, sometimes heroic, to be broadcast on the evening news. Typically Deeds is the last to know and is appalled when he makes the connection. By which time Ryder's character has fallen in love herself, resigned from her job and is begging for a second chance.<br><br> Deeds' only flaw is a short fuse and this is at odds with his generous spirit, who at times could be George Bailey, James Stewart's kindly smalltown character in Capra's It's a Wonderful Life (1946), but this spices things up a little and allows the suspension of disbelief to continue a little longer. The number of disrespectful, foulmouthed city folk he takes out is entertaining, while not always convincing, but then times have changed and these days your average bloke doesn't think of taking a swing at a man for swearing in front of a lady (more's the pity I say).<br><br> While you could aim criticism at this and jeer at the corny lines and simplistic moral at the film's end, there is something to be cherished here. The moral of course being that money is less important than being true to yourself, and while you're at it, be nice to your neighbour. As Mother Teresa once said, kindly words are heard once but their echoes are heard for ever - Deeds' character and his deeds (pun definitely intended) themselves are echoes of another, lamentably more innocent time and it's uplifting to see this spirit so laboured in the film's remake. It's also refreshing to see this bravely recreated by the producers, who have not shied away from dealing with the film's essence in these cynical times.<br><br> It's not all sentimental Queen of Hearts stuff though. There are some hilarious, laugh-out-loud moments that counter the film's message perfectly - the helicopter ride to Manhattan where the crew and Deeds are singing 'A Space Oddity' complete with air-guitar springs to mind here - and there is the usual dose of slapstick you'd expect from a Sandler picture. The 7 flying cats rescued from a burning building by our hero is particularly memorable and as I say, I was laughing in spite of myself.<br><br> This humour compliments the film's slushy message and prevents any actual retching in the theatre - leaving the cinemagoer shuffling out content, with a smile on his face - definitely a feelgood movie. I just hope Sandler doesn't attempt It's A Wonderful Life next, I don't think the world's quite ready yet.","user":"aliciadipesto","rank":[39,55]},{"title":"Very Funny But ..........","rating":7,"date":"20 March 2006","review":"This, once again, has most of the earmarks of modern-day comedies: tons of sexual innuendos, lots of good laughs but many of them out of questionable lines or behavior, and a stupid, rushed ending that tries to make all the good guys win and the bad guys lose. The latter is fine - I want the good guys to prevail - but they way they go about it is stupid.<br><br>I did think this movie had a little softer edge than most other blatantly-low class \"Something About Mary/American Pie\"-type comedies of today however. I guess what I am saying is this isn't as in-your-face type offensive most of the rest are.<br><br>Of course, Adam Sandler is playing the low-key Gary Cooper role of Mr. Deeds from the 1940s, so he's not the high-strung Happy Gilmore type here, although he does get violent at times. Winona Ryder plays the love interest, a tabloid low-moral reporter who is reformed by the amiable Mr. Deeds. She's not believable at all and one can see one reason she isn't much of star actress anymore. It isn't just her real-life problems. She's pretty and she's okay in the role but something's missing in her acting.<br><br>The real star of the film is John Turturro, as the Spanish butler. He's funny in about every scene he's in and he's a guy everyone roots for here.<br><br>In summary, it's a pretty nice film, with a number of laugh-out-loud scenes, but it's still a long way from the Gary Cooper-Barabara Stanwyck classic film version, at least in terms of an aw-shucks wholesome hero. This film just doesn't have the heart and soul of the original, because it's more concerned with cheap laughs than a moral message. Still, it has its funny moments and I found worth watching.","user":"ccthemovieman-1","rank":[29,49]}]