[{"title":"Rush Hour 3 was a lot of fun, but it is getting kind of old","rating":6,"date":"25 August 2007","review":"Rush Hour 3, the sequel I've been waiting for, it's been 6 years since our last Rush and I couldn't wait to join Chris and Jackie once again for their awesome comedy and action. I saw Rush Hour 3 a few days ago and I have to say that while I was definitely entertained, this still didn't feel the same as the previous Rush Hour films. It had great comedy, don't get me wrong, Chris Tucker is still so much fun to watch on screen. Jackie adds a little more comedic edge to his role this time; but it seemed like Jackie and Chris are not clicking as well as they used too. It almost seemed like they were meeting for the first time watching them on screen. Not only that, but this movie seemed more rushed and the story wasn't as well developed as the first two Rush Hour films.<br><br>In the beginning it seems like Lee and Carter are not on good terms, Carter seems to have broken off Lee's relationship to his ex girlfriend, Isabella. After an assassination attempt on China's Ambassador, Lee and Carter are about to face the Triads', China's deadliest gang. They are looking for a list in Paris and Lee and Carter are on the case to find a beautiful woman who might hold the secret. Things get a little more tricky when Lee has to his own brother who is the leader of the Triads'.<br><br>Rush Hour 3 is all in good fun, standing on it's own, if this was the first Rush Hour, it would have been fine somewhat, but just comparing it to the first two films, this wasn't as good. But that's just my opinion. But I think if you loved the first two Rush Hour films, you should see this, it's still a fun film and has great comedy, there is a little less action, a warning in advance, but it's all good if you are looking for a fun film for the end of the summer.<br><br>6/10","user":"Smells_Like_Cheese","rank":[73,93]},{"title":"It was very good but I think the series should end here","rating":7,"date":"11 August 2007","review":"So again we are back with a sequel of the Rush Hour series. The first two were pretty good comedy movies staring both Jackie Chan and Chris Tucker as cop partners with a typical plot with good action mixed with comedy. This one follows the same structure, but how does it hold up?<br><br>If you liked the first two, you'd probably enjoy this one. There's quite a few decent action scenes and again Chris Tucker's character delivers a lot of the jokes and Jackie Chan's still got the awesome moves and stunts but is it just me or was the action a bit tamer compared to the other two? Not that its much of a problem since I still enjoyed it but just something I noticed. Anyway, usual plot including a kidnapping and this time they go to Paris, and the two meet up with a person who wants to be like a spy.<br><br>It was very good and I'm glad the series is still working but perhaps the series should end here. It's hard to tell, but usually 3 movies is enough and the first one started like 10 years ago so its a rather large gap. The movie delivered a few laughs, some action scenes, and for what it was I thought it stayed true to its previous movie structures. I'm glad that Chris and Jackie still work well together, but to be honest I think the series should end with this one before it goes overload and loses what made it fun in the first place.","user":"AdrenalinDragon","rank":[112,171]},{"title":"Don't Know Why people bash this","rating":8,"date":"10 August 2007","review":"I thought this movie was actually good. It was everything I expected it to be,funny and full of intense action. I do not understand why people are hating on this wonderful film, but the jokes I guess could be said that they have been done before. Either way the whole audience was laughing in the theater I went too. It deserves be watched.<br><br>Jackie Chan's fights were cool too. His fights fall short compared to other the movies he has done, but for a movie like this they are considerably good. I thought the story was pretty basic though, but I didn't go in expecting an epic movie like Lord of the Rings, Star Wars, etc. I went to laugh and i did. Chris tucker just kinda does the same thing like the movie. But isn't that why we love Rush Hour?","user":"squallz10","rank":[186,292]}]