[{"title":"Halle Berry's shining moment","rating":9,"date":"27 July 2002","review":"Independent filmmaking is alive and well and evident in Monster's Ball. This film had a minuscule $4 million budget, a terrific script and a director not afraid to take some risks.  Billy Bob Thornton and Halle Berry practically donated their time they were paid so little.  The result is a powerful and disturbing film that walked off with a boatload of awards, not the least of which was a best actress Oscar for Berry.<br><br>Director Marc Forster conjures a forceful presentation with stark sets, next to nothing in the way of props and other set decoration, and a non existent soundtrack.  Forster does it with innovative use of the camera, sharp editing and most importantly excellent actor direction.  Forster could have done better at character development and the ending is nebulous and unsatisfying, but these shortcomings can be partially forgiven for the films many assets.<br><br>This is an actors' showcase, with outstanding performances all around. Heath Ledger makes a short but intense appearance as the son that Hank (Billy Bob Thornton) despises.  Ledger pumps the character full of repressed anger and disappointment, simultaneously resenting him and seeking his father's approval.  Peter Boyle is despicable as Hank's bigoted and self centered father.  Billy Bob Thornton delivers his best performance since `Sling Blade' with a complex character torn between his prejudices and his attraction to Leticia (Halle Berry).<br><br>Of course the big story here is Halle Berry.  Berry shows once again that she is not just another pretty face.  I first took serious notice of her after seeing her performance in `Introducing Dorothy Dandridge', a little seen TV movie in which she won both a Golden Globe and an Emmy.  After that marvelous dramatic performance, I was surprised that she couldn't land roles any better than `Swordfish' and `X-Men', which tapped nothing more substantial than her looks.  <br><br>In this film, Berry is sexy and alluring, but these are only incidental attributes.  She displays a full range of emotions from vibrant elation and unbridled passion, to utter despondency.  She practically rips her heart out and throws it at the camera.  She can convey volumes with a single look, or come completely unglued with equal impact.  Her Oscar for this performance was richly deserved and had nothing to do with her race as so many have rationalized.  She just flat out won it going away.  As good as Nicole Kidman was in `Moulin Rouge', it wasn't even close.<br><br>This is an excellent film that is worth seeing for the acting alone.  I rated it a 9/10.  It is a compelling and deeply disturbing drama that serious film lovers will surely enjoy.","user":"FlickJunkie-2","rank":[122,155]},{"title":"A harrowing, daring film. One of the year's best. **** (out of four)","rating":10,"date":"3 February 2002","review":"MONSTER'S BALL / (2001) **** (out of four)<br><br>When I finish reading a great book, I don't close it right away. Treasuring the story's emotional grasp, I just sit there and hold it for a minute, enthralled, sensing the character's lives are continuing even as I put the book away. <br><br>\"Monster's Ball\" is a similar experience. The film contains so much truth, vigor, and so many harrowing moments, I just stared at the screen through the ending credits. Even after a second viewing the conviction did not diminish. It really says something about a movie when you know what happens and you're equally as mesmerized every time you watch it.<br><br>\nMost movies about depravity are really about entertainment, but director Marc Forster avoids preachy speeches, big sappy moments, and melodramatic music. Even during the movie's most important scenes, Forster does not overplay the material. He knows that careful, quiet dialogue, and long, silent pauses speak louder than lengthy emotional summaries.<br><br>Consider a scene where a character checks his father into an old folk's home. It does not feature long good-byes or conclusive hugs. Instead, it projects unflinching, raw emotion. \"You must love him very much,\" reassures an attendant to the character who replies, \"No I don't, but he is my father\"<br><br>The character, Hank, is played by Billy Bob Thornton, who makes his Academy Award-winning performance in \"Sling Blade\" look like SNL material. Hank, bitter and racist, lives in a Southern country house with his son, Sonny (Heath Ledger), and father (Peter Boyle). <br><br>Hank and Sonny work as prison guards on death row. Sonny desperately wants out of the family business, especially after an unpleasant emotional reaction to the latest execution. When Hank explodes at him for his mistake, Sonny teaches his father a lesson he will never forget. <br><br>\nThe film eventually becomes a story about the relationship between Hank and the widow of the man he has just executed. She's played by Halle Barry, who was paid an extra one-million dollars for doing an extended sex scene completely nude. This is a gradual, yet sudden relationship that is not based on physical attraction or love, but emotional need and depravity.<br><br>\nForster makes interesting editing choices. During certain scenes, he cuts back and forth between separate occurrences while the central action fills the soundtrack. Especially unique is how he handles a sex scene. While two characters engage in some of the most graphic stimulated sex of last year, Forster flashes images of a caged bird before us. A metaphor of shattered innocence or repressed emotion, perhaps?<br><br>Actually, Forster fills \"Monster's Ball\" with metaphors, including the title itself. He even includes a moving soundtrack of timid rhythms and sudden beats, symbolizing the characters complex states of mind. Forster's haunting, daring feature reminds us why we all love the movies.","user":"Movie-12","rank":[106,144]},{"title":"Far More Than Just That Sex Scene","rating":27,"date":"27 October 2006","review":"This movie was not a big favorite with audiences and I figured I would be among the majority on this one......but I wasn't - I like this film. In fact, I liked it even better on the second viewing.<br><br>I found it to be one of those rare movies that deals with racism that doesn't come on too heavy-handed with all the political correctness nonsense. It handled the problem intelligently, I thought.<br><br>The cinematographer, Robert Schaefer, did a terrific job with this, too, and that is another reason I have come to really enjoy this film. The visuals - and the audio - are outstanding.<br><br>None of the characters are particularly likable but I thought Billy Bob Thornton's \"Hank Grotowski\" was so interesting a character that I concentrated more on that than whether I liked him or not. However, I wound up liking him, anyway, and boy, did his character change in this film. There is a steamy sex scene in here with Billy Bob and Halle Barry that was quite the talk when the film was released. I didn't think it was all that it was made out to be. I've seen steamier moments such as Alec Baldwin and Kim Bassinger going at it in the non-rated version of \"The Getaway.\" <br><br>Overall, this a rough film in spots but I think it is a solid, underrated drama that offers far more than the \"celebrated\" sex scene. This is a well-made movie.","user":"ccthemovieman-1","rank":[74,99]}]