[{"title":"Purity and beauty for the traditional romantic.","rating":28,"date":"28 June 2002","review":"I don't know - I'm way too old for a middle life crisis, maybe its the onset of dementia, but this film really got to me. Never in all these years have I come across as beautiful and pure a character as Jamie Sullivan - and to think I gave MTV the flick whenever Britney-clone Miss Moore, started up her song of the month. Call it manipulative, unrealistic, contrived, saccharine, whatever your pleasure - but I absolutely lost my heart to Mandy Moore's character here.  Perhaps the deep-rooted protective instinct in my nature, maybe a reminder of what I never found but always desired, but I would be lying if I did not admit to falling totally in love with Jamie, matter of fact that would be an understatement.<br><br>An impossible blend of strength, integrity, natural beauty, youth, feistiness, femininity and vulnerability - Mandy Moore delivered a performance so genuine and moving it totally stunned me. She was utterly spellbinding in every scene she was in - which was most of them. I thought her rendition of \"Its gonna be love\" during the school play was cinematic magic. She was for those moments, every man's dream and the epitome of virginal translucence.  <br><br>I was impressed too with Shane West's performance who at times was so reminiscent of a young Kevin Bacon somewhere around his FOOTLOOSE days. At times I agree, the film seemed to be headed down THE MAJESTIC path of over-sentiment but I'm sorry guys, I don't care. So long as Jamie was on-screen ripping my emotions apart, the rest really didn't matter!  What a stunning performance from so young a girl with barely any acting experience. The mere fact that this flick has pulled an everage user rating of 6.6 would suggest a LOT of people liked it. It blows LOVE STORY totally out of the water. On reflection, it is the film's very simplicity, lack of  pretension and strong supporting actors that serves it so very well.<br><br>By the way, it does so help being a hopeless romantic!","user":"uds3","rank":[284,312]},{"title":"Succeeds where it counts","rating":10,"date":"26 November 2004","review":"I'm a 17 year old male teenager who happened to stumble upon this movie two years ago at school during a free day in math class (when I was 15). I liked it then, but the math class ended before the movie could be finished. Finally, on the WB a few days ago, the movie aired and I saw the conclusion. AWTR contains a heartfelt conclusion to a story where you get to care about Landon and Jamie, two polar opposite teenagers who face peer struggles and the perils of love and death. The situations that occur are very real, and very sad. Once the movie finishes, you'll be left wondering what happens to everyone (heck, even though it doesn't make sense, I want a sequel!).<br><br>As a maturing male, I couldn't help but cry inside, and I'm someone who felt indifferent toward movies like Titanic. I found myself wishing I were either Landon or Jamie, because they represent the real virtues of life and love. Aside from the movie's undying message, there are some slight flaws. The ending could have been expanded a bit more (you'll see when you watch it as I don't want to spoil anything) to include more emotion. Otherwise, the acting done by Mandy Moore and Shane West is superb and top notch - these two actors have quite the career ahead of them. You'll see as these two characters develop that you can't imagine any other people doing the job.<br><br>This isn't your typical love story, because when it comes down to it, the love is only part of the whole scheme. While I never expected this to touch me so much, AWTR enters as perhaps my favorite movie of all time. You will feel as if you're a part of the movie, you will be able to relate to them, and you will love it. AWTR succeeds in delivering a great experience. Available on DVD now, you'll be wishing the release had deleted scenes, et. all. Highly recommended.","user":"cvxfreak","rank":[382,430]},{"title":"Shining stars....","rating":8,"date":"16 December 2003","review":"This was one of the best films I've seen lately. Mandy Moore shone in her role as Jamie Sullivan, although never to the point where she became unbelievable. Her singing was fabulous, but it was clear that this was not a film about her singing - too many pop artists starring in films wind up in films about their pop careers, whether real or inferred.<br><br>The storyline was VERY good. I can't say too much without spoiling it for everyone else, but take my word for it. You absolutely must watch this film at some point - make sure you grab plenty of tissues though, because if you don't get emotional towards the end, you must have a heart of stone.<br><br>All in all, fantastic.","user":"mrtufty","rank":[18,18]}]