[{"title":"Fun, if over-the-top, comic fantasy","rating":30,"date":"30 November 2002","review":"`Big Fat Liar' offers a lively contemporary spin on the Boy Who Cried Wolf legend.  Jason Shepherd is a 14-year-old inveterate liar who spends most of his time devising elaborate yarns to keep himself out of trouble with his parents and teachers.  One day, through an amazing fluke, he meets up with a nefarious movie producer named Marty Wolf who steals Shepherd's story idea  a composition he wrote for his English class entitled `Big Fat Liar'  and proceeds to make a movie out of it.  When Jason's parents refuse to believe their son's outlandish tale, the youngster heads out to Hollywood to confront Wolf and make him verify his story.  When Wolf refuses to do this, Jason concocts an elaborate scheme to make Wolf's life a living hell until he relents and helps make things right back home.<br><br>Kids will love `Big Fat Liar' for the simple reason that it works as pure adolescent fantasy wish-fulfillment on several levels.  First, it shows a youngster getting the rare opportunity of turning a major studio backlot into his own personal playground (the film sometimes feels like a 90-minute commercial for Universal Studios' behind-the-scenes tour).  Second, it feeds the desire we all have to watch the tables being turned on a certified rascal.  And, third, like any good fantasy for children, it puts the kids in a position of power over the adult world.  Jason and his pretty cohort, Kaylee, get to call the shots and pull the strings that eventually get the grownups to pay attention and listen to them.<br><br>`Big Fat Liar' might actually have been a better film had it resisted the tendency to overdo so much of its comedy.  In fact, the best parts of the film occur near the beginning when Jason and his adventures stay connected to the real world.  Once he gets to Hollywood, the film loses a bit of its edge.  The cleverness and wit of the film's opening stretches give way to overwrought plot mechanics and over-the-top slapstick.  The film has a great deal of undeniable energy, but subtlety can be a virtue as well and we miss that sense of sly fun that defines the film's ambiance early on. <br><br>\nStill, `Big Fat Liar' has more to recommend it than the average teen comedy. First of all, it stars the marvelous Frankie Muniz (`Malcolm in the Middle') who has energy and charm to spare in the role of Jason and who literally keeps the film bouncing along even when the comic setups don't always pay off as well as they should.  Muniz is one child actor I will miss when he grows too old to still play these parts.  Amanda Byrnes is equally likable as Jason's conspiratorial companion, Kaylee.  And even though Paul Giamatti seems to be doing a Jim Carrey impersonation through large sections of the film, this fine comic actor hits heights of magnificent manic madness as the put-upon, hissable villain of the piece.  The movie also has a fun time ribbing many of the elements of Hollywood culture  from the unemployed `actors' working as chauffeurs to the has-beens looking for that big career turnabout to the insipid material that often serves as the basis for big studio productions (a movie about a cop teamed up with a crime-fighting chicken is the example here).   <br><br>`Big Fat Liar' provides mixed blessings for the sophisticated adult audience, but youngsters should enjoy it all.","user":"Buddy-51","rank":[27,30]},{"title":"Better than Expected","rating":15,"date":"15 October 2002","review":"When a 14 year old boy has an accident with one of Hollywood's biggest producers, he soon finds that the producer has begun to make a movie off of an English paper story he left in his car.  When no one believes the kid he takes his best friend and they go to Hollywood to get the producer to admit that the kid created the story and they are willing to do anything to make sure he admits it.  Although this is more for kids it is still a fun comedy for all ages.  A good acting job by the young actors.  ** out of ****.","user":"Cyber256702000","rank":[18,20]},{"title":"Very nice kids movie; adults can play spot the connection.","rating":5,"date":"10 February 2002","review":"Broad comedy, minimized violence, recognizable stars - drop the kids off at the matinee and you're in good shape.<br><br>If you go along with them, you can play spot the movie connection. Half the movie is set at Universal Studios Los Angeles. Aside from the obvious (character walking past the Norman Bates House, etc.), the producers left dozens of props from other movies lying around. (I already submitted the cars from \"Back to the Future\" and \"How the Grinch Stole Christmas\".) It's almost like the movie is one big plug for the Universal Studios tour.<br><br>Speaking of plugs: Note the obvious ones for Coca-Cola and the E.T. re-release.<br><br>Parental Guidance note: Please be sure to explain to your kids that a) Hollywood is not a nice place to run away to, and b) they shouldn't expect to get hugs and encouragement after they run away.","user":"klantry","rank":[28,36]}]