[{"title":"Dark, erotic tale of underaged assassin","rating":8,"date":"27 December 2004","review":"Director and storyboarder Yasuomi Umetsu's high octane visuals hang from KITE's basic, unoriginal storyline, but don't let that put you off this pleasing document.<br><br>An assassin forced to kill and driven into occasional sexual servitude by perverted bosses is the basic set-up of this excuse for subversion (nothing wrong with that).<br><br>That the assassin looks twelve (despite her concessionary breasts) is why KITE is questionable material in more conservative circles.<br><br>The shoot-outs are beautifully realized and the sound effects are sharp and effective. Umetsu has a passion for the domino effect of violence as one grisly atrocity begets another until the Tokyo streets and subways resemble a hellish inferno.<br><br>The erotic sequences, cut or softened in some versions, are as explicit as you can possibly get and gorgeously drawn.<br><br>The 2004 Kitty Media DVD (the only one to get) is totally uncut, as is a German disc released a couple of year's ago (sans English subs).<br><br>KITE is juvenile in spots, slow in others, but it's a good animated co-feature if you're thinking of screening Luc Besson's THE PROFESSIONAL for your comrades.","user":"fertilecelluloid","rank":[24,29]},{"title":"another rare find","rating":8,"date":"2 April 2001","review":"Solidly built anime and a pleasure to watch. Character development is believable, although predictable. The story feels slightly sketchy and rushed closer to the end. Bonus points for the absence of \"will be continued in #2\" hint. Absolutely worth watching and owning.","user":"PKozyura","rank":[19,24]},{"title":"Exploding Bullets Cause Exploding Pulse Rates","rating":9,"date":"5 October 2000","review":"NOTE: This review is going to have some crucial spoilers in the second paragraph, so watch the movie before you read this.<br><br>I really like good anime, but I am usually hesitant to rent it because I often pick out a tape that is really a collection of TV episodes. While they still may be good, they rarely leave you with a sense of closure that makes you feel like you got a good deal out of the movie when it is over. I was a little nervous about renting \"Kite\" (pronounced 'key-tae') because it clocks at a mere forty-five minutes, which is usually a sign of TV excerpts. I went ahead anyway and checked it out. Boy, did I get a good deal out of the movie when it was over!<br><br>The movie begins with a jaw-dropping scene of violence: a child molester getting killed by a young girl. You expect something like it is going to happen, but the movie is more graphic than you will expect. But this is a good thing, and it really sends your pulse flying later on. We soon find out that the girl is named Sawa, and she is under the care of a slimy police detective named Akai, who, along with an even slimier associate named Kanie, give Sawa information on people she is to kill; they tell her the victims are all child molesters, but you begin to wonder if they are really being honest with Sawa (which they aren't). Akai and Kanie murdered Sawa's parents years earlier, and over time have forced her to kill who they want her to kill, which she does excellently with a special gun that shoots exploding bullets. Sawa does her job emotionlessly until she meets another young assassin that works for Kanie: a boy named Oburi. When they meet, they begin to consider getting away from their masters, but they find out that leaving is easier said than done, as Akai and Kanie aren't about to let their lucrative business go down the drain.<br><br>The movie is not for the weak-of-stomach. The exploding bullets create a huge mess, but that seems to make everything all the more real. There is a very violent scene in a men's bathroom that is one of the most exhilarating and exciting scenes I have ever had the pleasure of watching. The dubbed dialogue is very good, as compared to most dubbed dialogue cartoons in which you can just tell something got lost in the translation (although with criminal editing, something is indeed lost). And the animation is terrific, too. My only quarrel is the time. I wish the movie was twenty or thirty minutes longer, enough time to strengthen the relationships between the characters, especially between Sawa and Oburi and between Sawa and Akai. The reason this time is gone is because the company that released the film in the United States hacked out a substantial amount of the film, which was a terrible thing to do. Otherwise, I probably would have rated this film a perfect 10. Nevertheless, don't pass this one by when nosing around in the animation section, looking for an exciting anime. It sure beats the TV show stuff you could end up with. Zantara's score (edited version): 9 out of 10.","user":"Zantara Xenophobe","rank":[10,13]}]