[{"title":"Actually two one-hour movies, great inspirational stories.","rating":28,"date":"28 August 2002","review":"My favorite films are those which are based on an interesting true story, and are well made. \"The Rookie\" fits that bill, and I rate it very highly. At first glance it appears to be about getting to play baseball. In fact, it is about making your dreams come true, and the power of friendship. Baseball just happens to be the subject matter. The first one-hour movie is about a 10-member high school team in West Texas that barely manages to win one game each year. It is about their coach inspiring them to become the district champs and go to the state tournament in 1999. <br><br>The second one-hour movie comes about from a \"deal\" the kids made with the coach.  \"If we win district, then you have to go to a tryout with a professional baseball team.\"  They do, so he does. And to his and everyone else's surprise, his 85-mph fastball as a 20-year-old has become a 98-mph one as a 35-year-old.  The films hints that it might have been divine intervention, a prayer to St Rita, the patron of the impossible. Might have been!!<br><br>Dennis Quaid is a bit older than 35, but he does a good job and is believable as science teacher, coach, and finally a surprised big-league pitcher in Arlington, Tx stadium, where he strikes out his very first big-league batter. The real Jim played two seasons, not particularly distinguished, but that point is way secondary. The journey, and the way he made it, with support from family and his baseball kids is what this film is all about.<br><br>The DVD is very nice, with a great picture and decent use of the 5.1 Dolby surround sound. Extras include footage of the real Jim, some original footage of his playing days, and his narration and re-enactment of his first trip to a big-league mound. Great stuff!  Plus a few, moderately interesting deleted scenes explained by the director.","user":"TxMike","rank":[33,35]},{"title":"They Did This Sports Movie Right","rating":10,"date":"17 March 2006","review":"I love it when they actually do a sports story well. So many in the past have been so hokey it was embarrassing to watch. Not this one. It's just a genuinely nice movie, an old-fashioned type of story - and based on a real-life guy to did exactly what Dennis Quaid did in this film. He plays a high school coach who is talked into trying out, late in life athletically-speaking, to become a pitcher in professional baseball. Eventually, he reaches his goal of making it to the Major Leagues, even if it was a very brief stint.<br><br>All the characters in here are nice people, the kind you root for, from Quaid to the players on his high school team, to his little boy (Angus T. Jones, now somewhat of a star on television.)<br><br>Quaid is believable in playing Jim Morris because, unlike actors in the past in sports films, he knows how to throw a baseball. He looks like a pitcher, a guy who could fire it 90-plus miles per hour. And, most of this film is true, as testified by the real-life pitcher in one the documentaries on the DVD.<br><br>So, if you're looking for a nice, inspirational true life sports film, you can't wrong with this one.","user":"ccthemovieman-1","rank":[37,42]},{"title":"Respectable Movie Worth A Look","rating":1,"date":"1 April 2003","review":"Usually I review a movie just after I've seen it, but the last time I saw this one was a full 2 weeks ago. Yet it still sticks in my mind and heart.<br><br>\nBaseball movies are inspirational by nature and seem to have all kinds of application to life (for example, my review of Field of Dreams). Jimmy Morris challenges the losing baseball team he's coaching to not give up on their dreams and has the challenge thrown right back at him. This wouldn't make for such drama if the majority of the movie up to that point hadn't been to show how Jimmy's own dream had been systematically dismantled. Such movies anyone can write, but when I found out it was a true story, it put the movie in a higher bracket altogether. <br><br>The conflict between Jimmy and his father is played very well by both Quaid and Cox. At one point or another, you can just feel coldness of the walls built up between them. They're reaching out (Hunter's baseball glove, Jimmy's asking advice), but can they ever connect? <br><br>While some might balk (sorry) at the presence of Hunter, Jimmy's son, I think the kid adds a lot to the film. Baseball is all about kids, anyway. And it's good to see a son who looks up to and believes in his dad. That phase is over far too soon for most fathers to enjoy it enough. I think the dream is as much Hunter's as it is his father's.<br><br>The theme of the Rookie is \"never give up on your dreams.\" That's laudable. But the affirmation of the importance of families, even through broken relationships, as well as a clean script, makes this one that families can buy to watch every now and then. Disney surprised me with this believable, down-to-earth tale. I'm definitely picking this one up on DVD.","user":"timberline_thunder","rank":[21,23]}]