[{"title":"the one where Dave has an aneurysm","rating":7,"date":"10 March 2001","review":"Oh, wait, that applies to every A&amp;TC cartoon...AAALVEEEN! YOU EEEDIOT! Heh heh heh. But seriously. I used to watch the '80s show when I was but a wee larva, and I never really liked it that much. The show had its good points, but it just seemed kinda slow. And the character designs didn't appeal to me. This movie, which appears to have been put together by all or most of the original creators &amp; voice actors, keeps all the original charm of the older incarnations while giving us a story that's cute, funny, sweet, &amp; never boring, plus subtly redesigned chipmunks that..I dunno, they just look really good in this movie. More alert, like they've taken some caffeine tabs since the '80s. I can't quite explain it. Maybe it's just a higher budget that I'm seeing. Anyway, I thoroughly enjoyed it. I've never felt more affection for 'the boys,' and I even found Dave's obligatory exasperation scenes less grating than usual. Could it be that, as I approach adulthood, I'm starting to identify more with his role as the chipmunks' adoptive father? Am I showing signs of creeping maturity? Oh God, I hope not. Anyway, this movie had the feeling of a real labor of love on the part of its producers; hope I'm not mistaken on that count.. Go ahead and rent it or whatever. Two open questions: (1) Why didn't Dave notice the broken glass in the back door? (2) Assistant Director Yoko Ono? Any relation? I know Simon briefly went to see the Maharishi, but...","user":"Nicholas Sedillos","rank":[10,13]},{"title":"Good for a fan or a child.","rating":8,"date":"26 August 2011","review":"In the Alvin and Chipmunks canon this is probably the least interesting video. However small children would enjoy this flick around Halloween.<br><br>As usual any Alvin video is full of really catchy songs that even I can't stop humming.<br><br>The theme of this video is on the lighter side so there is no need to worry about scaring your kids with this movie.<br><br>The animation is bright and cheerful, I can't help but find Alvin, Simon and Theodore really cute in this, though it's probably a video you want to sit your kids in front of and then leave the room.<br><br>If you enjoyed this you'll enjoy these too.<br><br>Alvin and The Chipmunks Meet the Wolfman The Chipmunks Adventure.","user":"liberty_mks","rank":[2,2]},{"title":"Not as good as the Wolfman, but certainly worth a watch","rating":7,"date":"18 July 2012","review":"Any die hard fans of the Frankenstein Franchise, go hide in your under- house shed immediately, as for the rest of you, grab a seat and enjoy!<br><br>Being the first Chipmunk movie after the Chipmunk Adventure in 1987, Alvin and the Chipmunks Meet Frankenstein returns to the Chipmunks of our childhood in a Direct-To-Video release. The basic story is that a mad doctor in a European country of no designation (much the same with the villains of the last movie), is forced to flee his castle with his vicious monster Frankenstein in tow. He then takes up residence in an American theme park in a castle built as a house of horror exhibit, quickly turning it into a new laboratory so he can carry out his sick experiments. Meanwhile, the Chipmunks are playing at a concert in the theme park but end up getting lost due to Alvin's shenanigans. That night the Chipmunks come across the castle and witness the monster being awoken with electricity. After being spotted, a comical chase through the park ensues with the Chipmunks eventually outrunning the monster, but Theodore loses his teddy in the skirmish. Later that night, the monster manages to find where they live using the smell of Theodore on his teddy as a way of tracking them down. Whilst trying to rescue his Teddy, Theodore is captured by the monster and you'd expect him to be torn limb from limb by the monster, but instead, the opposite occurs. And I'll leave you to watch the rest for yourselves.<br><br>It's a really good watch I must admit, even though it can be quite silly at times such as how they depict Frankenstein. There's a lot of humour in it as well including this running gag of the Doctor despising the Theme park's mascot with a passion, so much so that he eventually becomes trapped in a mascot suit and is forced to sing the mascot's theme, of which he absolutely detests. A lot of unexpected surprises as well, including Alvin turning into something out of Woody Woodpecker and of course, no Alvin and the Chipmunks film would be complete without the usual array of songs, of which, they are really quite enjoyable, but not as good as those in the previous or the next film.<br><br>Overall, a really fun watch and I'd recommend it to adults and children alike, simply as a film you can turn off and watch. :D","user":"rorymacveigh","rank":[1,1]}]