[{"title":"Extremely Enjoyable!!","rating":27,"date":"27 May 2002","review":"First off...why does the fact that this movie deals with spousal abuse and a woman smart enough to run and hide automatically make it a ripoff of \"Sleeping with the Enemy\"?  Because \"The Count of Monte Cristo\" has swordplay, does that make it a ripoff of all of the Zorro movies, or the Robin Hood movies?  Does the fact that Spiderman is a Marvel Superhero make it a ripoff of \"The X-Men\"?  Of course not. And only the very basic storylines make \"Enough\" and \"Sleeping...\" similar at all. Let me illustrate...<br><br>In \"Sleeping with the Enemy\", Julia Roberts plays a weak willed woman who stays with her mentally abusive husband until she finally has enough and leaves when she gets the chance to fake her death. Julia never changes...always the weak willed, scared out of her gourd hiding wife.<br><br>In \"Enough\", Jennifer Lopez plays a strong minded woman who decides to leave her abusive husband as soon as she finds out what he is really like. Jennifer never changes either...but in this case she maintains her strength, and although scared out of her gourd also, she sets out to confront him in a physical battle...his forte usually. <br><br>This movie was great entertainment. Anyone who says they felt this was a total yawner, with no tension at all is too critical. This is what entertainment is about. This was a great way to spend 2 hours as far as I am concerned.<br><br>Ms Lopez is becoming a better actress with each film. But, as far as the female actresses go in this flick...the little girl who portrayed Jennifer's daughter out-acted everyone else...male or female. Two thumbs UP for this little lady!!","user":"Dantzr","rank":[89,131]},{"title":"loved it","rating":10,"date":"29 January 2003","review":"What's everybody's problem? This movie realistically portrayed domestic abuse and had a great plot, acting, everything. The end scene is the best, in my opinion. maybe it is just a chick flick, but it does a good job of drawing you in and keeping you there, my emotions ran high.<br><br>Maybe people should stop looking at movies so critically and look at them for what they are - a way to gain understanding of other people's lives and issues like domestic violence, which is society's problem, not just the victim's.","user":"tuula611","rank":[78,118]},{"title":"Stop with the dumb reviews, I had ENOUGH","rating":10,"date":"1 December 2018","review":"I watched this movie when I was younger &amp; still watch it till this day. Easily one of my favorite movies DUE to the fighting and the plot. The scenes where perfect and at times unexpected. I'm starting to think a lot of miserable men, possible beaters are mad at this movie because the acting was perfect. At times I even felt for the little girl as if it was REAL. Stop with the bashing and some of you critics really feel like you could have done better but still paid the money to watch sooo who still won? By the way, It's 2018 and I just saw it on tv the other day. Can't be that bad right ? Oh okay. Anyways , it's 2018 and I still highly recommend watching. I've never been in a position of being hit by my lover but this opened my eyes to other girls that may deal with this in life and that was ENOUGH.","user":"jasmineposhtv","rank":[18,24]}]