[{"title":"Citizen Toxie The Toxic Avenger IV: A franchise ending on the lowest note imaginable","rating":1,"date":"22 November 2018","review":"As I settle down to write this I see that the current featured review refers to this as \"One of the greatest movies of all time\" this hurts my brain.<br><br>Now I've never been a fan of the Toxic Avengers films, prior to this out of a potential 30 points the three previous films attained a remarkable *Drumroll* 7 points from me. They're dumb, they're silly and they personify Troma films perfectly.<br><br>Made 16yrs after the first movie this 4th and I do hope final movie is the worst of the bunch by a long margin and will be one that lingers on my mind for longtime to come for all the wrong reasons.<br><br>Our hero (And I use that term loosely) finds himself transported through time and space switching places with an evil version of himself. Cue more stupidity, childish humour and stuff that I don't understand how it even constitutes as comedy at all.<br><br>So why the 1/10? For me that means a movie is devoid of all redeeming features and has absolutely nothing going for it therefore are rare entities. Well because it suffers from all the same issues as the first three movies but this time ramps them up to the next level.<br><br>The writer was clearly trying to shock, trying to be as sick and inappropriate as possible throughout. Don't get me wrong I'm not easily offended (And wasn't here) and am entirely 100% anti-censorship but this was just nasty stuff.\nWhen you actively mock the mentally disabled throught the 90 minutes, resort to making multiple rape jokes and have crass characters whom I couldn't even name or describe without breaching IMDB's t&amp;c's you've sunk too low in my opinion.<br><br>The violence is considerably stronger than previous films, it's riddled with camero appearances by the likes of Ron Jeremy, Julie Strain, Corey Feldman and Lemmy \"Motorhead\" KIlmister and all the usual cast members have been recast.<br><br>Citizen Toxie is a dire childish movie that makes me thankful the franchise has died.<br><br>The Good:<br><br>Some oddly good political and social commentary<br><br>The Bad:<br><br>Excessively crude in places<br><br>Some jokes are really quite sick<br><br>Recasting<br><br>Lloyd Kaufmans direction<br><br>Things I Learnt From This Movie:<br><br>Pregnancy tests, now in braille<br><br>Abraham Lincoln was bi-polar<br><br>The best ladies of the night accept cash or pastries<br><br>Noel Gallagher is the worst superhero ever","user":"Platypuschow","rank":[22,27]},{"title":"So Bad It's Good","rating":8,"date":"5 August 2002","review":"Its always a problem to review a Troma movie.  Troma is a genre unto itself, and you can't compare their movies to what everyone else is doing.  They have their own rules and esthetics... and going by those, this is the best film to come out of Troma in years!<br><br>Without doubt, this is the most over-the-top, all-out assault on good taste Troma's put out.  They even had the good idea to include an apology for Toxic Avenger Parts II &amp; III.  The movie is overloaded with gore, sex, breasts, political incorrectness, breasts, sex, lesbians, transsexuals, mutant superheroes... and did I mention sex, breasts and gore?<br><br>Yes, it has no socially redeeming value whatsoever.  Its Troma.  It's not supposed to.  If you're a Troma fan, see it.  If you're not, you probably won't like it.  Unless you do.<br><br>The screening I saw was just this past weekend at the Renegade Film Festival in St. Petersburg, FL.  The copy was an advanced screening, and according to the festival promoters the editing on the film was completed just in time for the festival, so I don't know how people were seeing this months ago or why the date listed is 1999 on here...","user":"w00f","rank":[22,30]},{"title":"One of the greatest movies of all time...","rating":10,"date":"1 June 2003","review":"The unrated version that is (the \"R\" version sucks really bad).  This has to be one of Troma's most offensive, yet, most hilarious films ever. I crack up everytime I watch it. From Lardass (the funniest charactor in the whole movie, I wish he was in there more) to Kabukiman (both evil and \"good\" Kabukiman) to Tito the Retarded Rebel. Definitely not for the whole family. Only for those with a very sick sense of humor. But in the words of Evil Kabukiman, \"I can't pass this up!\"<br><br>ACTION SAUSAGE NUNCHUCKS!!! DELI STYLE!!!<br><br>10/10","user":"Krakker_Jakk","rank":[17,24]}]