[{"title":"Down Underworld noir thriller","rating":8,"date":"3 July 2003","review":"'The Hard Word' is an excellent, well-paced Australian movie, straddling the genres of the American noir caper film and the British thick-ear crime drama. Some of the sequences in this movie remind me of scenes in 'The Asphalt Jungle', 'The Killing', 'La Jetee', the Peter Sellers comedy 'Two-Way Stretch' and even 'Eating Raoul' ... but 'The Hard Word' is definitely a one-off original, and it's very good.<br><br>The early scenes in this film take place in the Australian prison system. I've done some prison time Down Under (in my original name, before I changed it), and I found these scenes extremely realistic. Seppos and Poms (Yanks and Brits) will have difficulty understanding the Strine slang in this movie; for instance, when an inmate shouts 'Half yer (expletive) luck!', it's not instantly clear to non-Australians that this means 'I wish I was half as lucky as you.' Also, American audiences will be confused by this movie's references to racetrack 'bookies'. In Australia (as in Britain, but unlike in the States), bookies are lawful businessmen ('turf accountants') who privately take bets at sporting events, as independent contractors.<br><br>And most confusing of all for audiences outside Australia: some of the dialogue in 'The Hard Word' is spoken in 'butcher talk'. This is never explained in the movie, so I'll reveal that butcher talk (or 'rehctub klat') is the dialect used by (real-life) Australian criminals for covert conversations in public ... in which every word is spoken BACKWARDS, very rapidly. Even if you know the secret, you won't understand a conversation in 'butcher' unless you've practised a lot. (In Britain, criminals have a gimmick called 'backslang' which is a simpler version of the same thing.) Several times in 'The Hard Word', the dialogue is brilliantly ambiguous, carrying two meanings at the same go.<br><br>Three felons are released on the same day: violent Dale, easy-going Malcolm and Pepsi-swilling mother-obsessed Shane. (The dialogue identifies them as brothers; they don't look remotely alike, but that line explains why they stick together no matter what.) As soon as they get out, our lads participate in an armoured-car robbery that's been set up by their crooked lawyer Frank ... but Frank might be setting them up for a fall. And while the lads were 'inside', Frank has been having a go with Dale's sexy wife Carol. Rachel Griffiths, who plays Dale's wife, is not conventionally beautiful ... but in this film she gives one of the sexiest performances I've ever seen on screen.<br><br>SLIGHT SPOILERS COMING. There are some eye-catching frame compositions in this film; all credit to director/scripter Scott Roberts. But several pieces of business seem to be set up only to create odd images on screen. A rival gangster lures Dale into a trap by disguising himself as Dale's wife and then hiding in their bed with a gun; I found this wildly unlikely. Frank kills another gangster by cramming a lava lamp into his mouth: no blood, no broken teeth; just an interesting visual composition. One long sequence takes place inside a restaurant shaped like a giant cow.<br><br>An actor named Robert Taylor (doesn't he know that this name's been used before?) is very good as Frank, the brothers' crooked lawyer. Frank dies a horrible death. How to get rid of the corpse? We know that Malcolm is handy with a sausage-grinder, and in the next scene we see him grilling some FRANK-furters on the barbie. That pun is no coincidence. (Damien Richardson is a revelation as Malcolm.)<br><br>On several occasions, the crooks jeopardise their own well-planned caper by brawling or arguing; I found this a very accurate depiction of criminal behaviour. Yet there's one very implausible plot twist during the robbery at the Melbourne Cup, when Shane is supposed to open a locked door by typing a 4-figure number into a numeric keypad ... but a henchman named Tarzan insists on doing it himself, even though he's dyslexic. Doesn't Tarzan realise that his dyslexia disqualifies him from this job? Sure enough, he mucks it up.<br><br>During the caper sequences, I kept expecting to see the cliché shot from every caper film ... when a swag-bag rips open, and banknotes go flying in all directions. Blessedly, that hackneyed image never came. For most of its length, 'The Hard Word' commendably avoids clichés. I thought Rhondda Findleton quite sexy as an anger-management counsellor with a semi-Louise Brooks hairbob, but I was annoyed when her character became that prison-movie cliché: the sexy female prison staffer who goes home every night and can get any man she wants on the outside, yet who becomes sexually involved with one of the inmates a few minutes after she meets him! I couldn't believe that this woman would be having sex with Shane ... it would have been much more plausible if she had merely **led him on**, arousing herself with his sexual frustration while offering him no release.<br><br>At the very end of this flick, the three brothers and Carol are striding purposefully towards the camera. 'Please', I thought, 'please do NOT commit that horrible cliché of freeze-framing the final shot.' Instead of a freeze-frame, the final image went into a slo-mo ... which is also a cliché, but not quite so hackneyed yet. Despite a few complaints, I'm vastly impressed with this highly entertaining movie. I'll rate 'The Hard Word' 8 points out of 10. Nice one, cobber!","user":"F Gwynplaine MacIntyre","rank":[32,38]},{"title":"Heist Movie Down Under","rating":15,"date":"15 July 2003","review":"\"The Hard Word\" is a gritty, sexy, Australian take on the double-crossing heist movie.  <br><br>We get to hear Guy Pearce (long-haired and greasy) and Rachel Griffiths (blonde and wet) go native in their accents in an entertainingly original script by first-time director Scott Roberts.  <br><br>While not the first film to have quirky brothers-in-crime as the comfortable loyalty fulcrum, the familial psychological pathologies make for a nice counterpoint to the friends', foes', and femme fatale's twists and turns. There's more jokes and ironic humor than even the violence, which helps to block out some quizzical plot turns.  <br><br>The movie never tells us that the title is Ozzie slang, among other blunt phrases used throughout (such as the tendency of Ozzie blokes to affectionately call each other the \"c\" word).  My Down Under friend Bronwyn translates (used with her permission): \"In it's 'ultimate' usage it means to pressure someone for sex. If you were talking to a girlfriend who went out on a date with someone new, you might ask 'did he put the hard word on?' However, it is sometimes also used just in a general sense of exerting pressure. In fact, it was in a headline in our local suburban paper (\"The Leader\") yesterday: 'Minister puts the hard word on district pollies [politicians].' An article about the State Minister for Local Government pushing the local councils to sort out boundary reforms.\"","user":"noralee","rank":[24,29]},{"title":"Good for a \"heist\" film","rating":7,"date":"4 March 2004","review":"This was a really enjoyable film. While it may not have had the most original script, it certainly shines when compared to other, much more lackluster, heist films. I enjoyed this from start to finish and did not find it as formulaic and predictable as many other films in the genre. It's sort of like an Australian version of the film \"Confidence,\" only with better acting and more interesting characters. Guy Pearce throws himself into the role and does not waver.<br><br>Even when the focus is on another actor his presence commands the attention of the audience. Few actors are as skilled in stealing a scene without ever saying a word. The female characters are rather one dimensional, but it's a detail that's easily overlooked as they are not the central focus. Definitely worth a visit to the video store.","user":"one2runn2","rank":[27,34]}]