[{"title":"Comfortable feel-good film with great acting.","rating":10,"date":"2 March 2010","review":"Despite being inspired by true events, this story doesn't follow the typical trend of investigating the murder, catching the killer etc.<br><br>Instead, it focuses on the people who remain and where they go from there. In this case, two young LA girls, whose father had abandoned them in favour of a life in the Rodeo road shows. The girls must leave behind their comfortable life of plenty and get used to life with their father, on a small-town ranch without so much as a telephone.<br><br>Thrust in the deep end as a sudden single parent, this real-life cowboy is forced to reconnect with them. The \"Father's Choice\" comes when his old life again calls him to glory as a champion and he must choose between being a cowboy and being a father.<br><br>Although the tale progresses as you might expect, it is nonetheless very touching and the cast do an outstanding job of bringing true feeling into their portrayals.<br><br>Impressive anyway, given the casting of both Peter Strauss and Mary McDonnell, but the real stars are the young girls - Michelle Trachtenberg and Yvonne Zima.","user":"ttaskmaster","rank":[5,6]},{"title":"Essential viewing for Trachtenberg fans, v1.01","rating":28,"date":"28 September 2009","review":"Along with Forever Together and Christmas In My Hometown, I rate this as the best of the early Trachtenberg features that I have, so far. I do not like to compare these with the series Pete, Pete and Buffy.<br><br>Forever Together as romantic Tracht. I rate it as the pinnacle, but the low budget is fairly obvious.<br><br>A Father's Choice is also low budget, but that does not show to such an extent. Here she is a disillusioned early teen whose reality is gradually becoming less putrid. It is quality, as is Forever, just it is not big budget type quality but a quality story.<br><br>My DVD is 4x3 NTSC.","user":"annevejb","rank":[5,9]},{"title":"does anyone care about the mother?","rating":28,"date":"28 May 2001","review":"This is your typical movie about a parent trying to reconnect with his children after the death of his ex-spouse. It's pretty much routine. However, the one thing that I think they overlooked or didn't address was the apprehension of the girls' mother's killer. In the end the mother's killer was never caught. Don't you think that would be something that's going to haunt the girls? If this is a true story, there's not much that can be done.","user":"RONY-3","rank":[7,20]}]