[{"title":"A highly underrated movie","rating":7,"date":"4 May 2003","review":"Man I don't understand why people come down so hard on this movie and personally, I thought that is was a good but not a great movie but it doesn't deserved all the negativity that you hear, anyway it's about Jerry (Cuba Gooding) who proposes to his snotty girlfriend Felicia (Vivian A. Fox) and he and his unsophisticated friend Nick (Heratio Sanz) decide to go on a cruise so they can meet some beautiful woman but after Nick cussing one of the cruise agents out, they wind up on a GAY CRUISE!! There's a funny appearance by Roger Moore who was a former James Bond and there's a funny scene by Felicia who tells a guy to be careful with her luggage cause she claims that they're worth more than what he makes in a year.<br><br>When I saw this movie in the theater, they're was only 8 people, only 8, can you believe that.<br><br>If you ask me if I would watch this movie again, the answer is yes but I'll wait till it comes out on DVD or the video.","user":"csweetleaf2","rank":[50,74]},{"title":"Not great, but still quite entertaining","rating":8,"date":"29 December 2003","review":"I stumbled on this movie by pure accident and I had absolutely no idea what kind of movie it was before I saw it. As I didn't recognize the name of that movie, I guessed that it would be really bad flop, but the movie turned out to be a pleasant surprise.<br><br>The movie is not a masterpiece, but I found it quite entertaining, relaxed and maybe even hilarious. And I guess it is really hard to make a comedy that people would consider a masterpiece. I will definitely show this film to my friends and I think this film can be enjoyed more than once. It is somewhat clumsy film, but mostly in a positive way.<br><br>The movie had a lot of silly jokes based on different kind of stereotypes like swedes and gays, but I think it worked quite well. And in my opinion none of the stereotypes was done in offending way and all of the characters were likable - even the promiscuous, but a bit \"blond\" Swedish woman and her strict coach. At least as a gay I didn't find the movie homophobic or the gay stereotypes offensive at all, unlike some comments.<br><br>I think that the movie could have been a bit better if it wouldn't have had that explicit \"I guess gays might be OK\" phrase and the stereotypes had been a bit nastier. And with a bit better directing the movie could have had better fluidity.<br><br>But I can recommend the movie even though it wasn't flawless. I especially liked the performance of Cuba Gooding Jr. But some straight guys might find the movie boring or maybe a bit embarrassing even though the movie has some relatively good looking women and the main characters are straight. And of course not all people like this kind of comedies with adolescent and a bit tasteless humour.","user":"Fin2003","rank":[19,28]},{"title":"a funny film to rent","rating":7,"date":"10 September 2003","review":"Well, I thought this movie was pretty funny. Two straight guys on a gay cruise. Which they don't know when they board. It's not exactly a masterpiece of a comedy. Cuba Gooding does what does best, plays around acting like an idiot. But in this scenery it works, he is kind of girly. Just don't expect to much of it, and it's quite enjoyable. When I went to see it didn't have any expectations, and ended of feeling good about myself (im not gay by the way, although it might sound like it). The swedish swimsuit team was a bit much though. It might have been funnier if they actually spoken swedish. But to summarize, it's a good movie to rent with your buddies!","user":"theavier","rank":[21,32]}]