[{"title":"Very Close to Heaven","rating":10,"date":"11 January 2003","review":"Todd Haynes' Far From Heaven, a homage to the 1950s melodramas of Douglas Sirk, is an exquisitely crafted film of beauty and grace. The world that Haynes creates is so meticulously detailed that one almost forgets that the movie isn't fifty years old.<br><br>Julianne Moore deserves an Academy Award for her portrayal of Cathy Whitaker, a homemaker whose idyllic life begins to disintegrate when she learns that her husband is gay. Moore's Cathy is a delicate woman who would like to be courageous, but can't be because of the world that she is trapped in. As her innocence begins to die, she realizes how empty and superficial her life is. When she begins a cautious romance with her black gardener (Dennis Haysbert) she begins to see the racism and hypocrisy that forms the underbelly of a seemingly perfect world. At the end of the film Cathy has no illusions, and realizes that the life that she thought was perfect is actually a never-ending hell.<br><br>Dennis Quaid is equally stunning as Cathy's tortured husband Frank. After Cathy discovers his homosexuality, the two are forced to grapple with a truth that neither of them can comprehend. Frank goes to a doctor for \"treatment,\" and his confession is heartbreaking. He says that he \"can't let this thing, this sickness, destroy my life. I'm going to beat this thing.\" We look at Frank and pity him because we realize that such a feat is impossible, and unnecessary, but Frank does not possess that knowledge. Frank begins to drink more, and when he finally breaks down and tells Cathy that he has fallen in love with another man, all of the anger, shame, and joy comes pouring out of him all at once. It is a supremely moving moment, and the best performance of Quaid has ever given.<br><br>As the marriage between Cathy and Frank begins to unravel, the two also begin to fight. All of Cathy and Frank's arguments and confessions take place at night, bathed in shadows. The truth has no place in this bright, artificial world, and it must stay hidden at all costs. One night, when Frank tries to make love to Cathy and can't, Cathy tries to placate him, saying that he is \"all man\" to her. At that remark Frank hits her, and for a moment the audience does not breathe. Cathy then asks quietly for her husband to get her some ice. Cathy is all restraints, and it is only with her kind gardener that she has a chance to break free. The scenes between Moore and Haysbert crackle with erotic energy because everything remains unsaid. When Cathy finally asks him to dance with her, it is a moment when we realize what human beings are capable of being together.<br><br>\nThe fourth example of stellar acting comes from Patricia Clarkson as Cathy's best friend Eleanor. Eleanor is a bitter, gossipy, cold-hearted woman, and when she tells Cathy \"I am your best friend,\" you want to scream to Cathy not to believe her. Clarkson makes the most of her rather limited screen time, and turns in a fascinatingly layered performance.<br><br>Far From Heaven may very well be the best picture of the year. In creating an artificial world, Todd Haynes has managed to lay bare the human soul in a way that has never been done before. It is a moving and important motion picture, populated with some of the most nuanced acting I have ever seen. Cathy and Frank Whitiker may be far from heaven, but the film comes about as close to heaven as is possible.","user":"GodsLionesse","rank":[136,161]},{"title":"Underneath the Facade of Complacency","rating":10,"date":"4 November 2005","review":"Had it been released in the year it's set in -- 1957 -- FAR FROM HEAVEN would have broken grounds on several different levels because it brings to light what stories then only hinted at. Todd Haynes, channeling Douglas Sirk inch by inch, goes one step further and comes up with a masterpiece of domestic melodrama.<br><br>This is the story of three people caught in unfortunate circumstances. The Whitakers, Cathy and Frank (Julianne Moore and Dennis Quaid), are the Perfect Couple, married and living under the conservative spotlight of Suburbia, known more as Mr. and Mrs. Magnatech, successful -- the couple who have everything going for them. Of course, with the slight detail that Mr. Whitaker is gay and about to come out.<br><br>Coming into the picture at the time the local society writer (Celia Weston) comes to interview Cathy about their idealistic marriage life, Raymond Deagan (Dennis Haysbert) enters the picture. A quiet man who happens to be black in a time when being black meant being segregated, Cathy expresses kindness to him, and the writer jots down 'friend to Negros' which comes to mark Cathy later on.<br><br>Frank's double life is the catalyst which will bring Cathy and Raymond together. When Cathy, in her manicured, wifely way, comes to bring Frank his dinner at work, she walks in to seeing him kissing another man (Matt Malloy). Clearly, something is wrong in this picture... and gets progressively so when Frank decides to beat his illness, while still going to sordid bars with equally ashamed men who hang out with the spectre of fear just out of frame, as if one of the many bar raids would befall them at any moment.<br><br>Once Frank is out of the picture Cathy turns to Raymond for solace. Friends begin talking, mainly through the correctly named Eleanor Fine (a chilling Patricia Clarkson) who doesn't know how to react to this friendship, while we know she is probably spinning stories behind Cathy's back. It is here when the morals of the time come into play. We are, in fact, reminded that this is the late fifties at every turn. Cathy has been 'seen' with a Negro and this means trouble. Frank, even though he already has a boyfriend, can't stand her friendship. Raymond's daughter gets assaulted by a couple of boys coming home from school. Doors are closing all around Cathy, but there is the hope she may leave with him to Baltimore. Raymond assures her, that is impossible.<br><br>The Douglas Sirk influence virtually comes out of the screen at every frame in Todd Haynes film. From the saturated color and excellent cinematography, set decoration, to the almost exact acting from all the leads and supporting actors and its pessimistic/happy ending. Where many movies fail through anachronisms, an almost perfect attention to detail has been taken to make this movie as authentic as possible -- down to the cinematic language and its characters, who are enclosed in its time period. For example, in one scene, Frank swears... but then apologizes, because it is impolite to do so. His gayness even as the film reaches its conclusion remains closeted, within its shame, as he secretly meets with his boyfriend. No happy ending for him here. Neither for Cathy and Raymond, whose acquaintance is vibrant with tension even though they barely exchange a shy kiss and are destined to remain apart. It reminded me a little of IN THE MOOD FOR LOVE (2000), another film enclosed in its time period with the two romantic leads knowing their chances of a relationship is nil due to tradition. Here it's man's bigotry to himself.","user":"nycritic","rank":[41,48]},{"title":"Another superb performance from Julianne Moore","rating":13,"date":"13 July 2003","review":"Todd Haynes' achievement in his homage to the films of Douglas Sirk is so complete, and seems so carefree that it is easy to dismiss FAR FROM HEAVEN as a trifle. The look of such ease is deceptive, however. Haynes' accomplishment, that of telling a new story through a loving recreation of the 50's weepy, is visually sumptuous and sweetly moving. The painstaking effort, from the amazingly overblown dialogue (ever so slightly exaggerated from the style of the actual 50's weepy) to the oversaturated colors and evocative score, never strains the film. <br><br>In Julianne Moore he finds the perfect heroine. Her performance is so skilled that we don't see her at work. Though nominated, Ms. Moore was sadly overlooked at the 2003 Oscars. Apparently no one could see past Nicole Kidman's prosthetic nose in THE HOURS. (When a beautiful actress plays \"ugly\" she wins an award. Ms. Kidman's performance in THE HOURS is one of her best in that deeply moving film, but it hardly matches the subtlety and difficulty of Ms. Moore's work in FAR FROM HEAVEN.) With such breathtaking ease that we forget she is acting, Ms. Moore scales the grand challenge of using melodramatic dialogue that verges deliberately on camp to reveal the tenderness and desire of the naive 50's housewife who is the center of FAR FROM HEAVEN. (Watch her face in an early scene where she and the excellent Patricia Clarkson talk with their girlfriends about their respective marriages.) <br><br>Credit must be given to Haynes as well, who asks his cast to play it straight. Ms. Moore, who consistently achieves beauty and depth with each performance, brings this tender film to life. She has a fine counterpart in the handsome and Dennis Quaid who has not had such a plumb role since his early days. <br><br>Though every film should stand on its own, you should check out the milieu that Todd Haynes is working in  the oeuvre of Douglas Sirk being the main source  but you can also check out earlier films like DARK VICTORY and other domestic dramas.","user":"tommyrockt","rank":[63,77]}]