[{"title":"You'll get it if you know modern Japan","rating":14,"date":"14 May 2004","review":"Most of the reviewers here speak from their own viewpoints, i.e. non-Japanese westerners, and they praise/knock the movie based on its violence, plot, etc. That's fine. But through their ignorance of the culture this film springs from, they are missing its subtleties.<br><br>I've been teaching in a Japanese high school for three years now. Once I saw this movie, I could instantly appreciate its skill and surprising frankness at commenting on some of the sad and strange realities of Japan's modern youth.<br><br>Japan is a culture obsessed with youth. Almost everything here is tailored to the under-30 (and much younger, actually) crowd. For example, most westerners watching Japanese TV will be surprised at how childish it seems. The things that seem childish to your average American junior-high student are very appealing for a Japanese high-school student. Girls in their 30s desperately try to be \"cute\" to attract guys. Adults and children alike read comics by the droves, and sometimes pops up a strange, not-too-well-hidden undercurrent of pedophilia.<br><br>This movie takes the heavily cliquish, often childish, and often incomprehensible (to me) social system of young Japanese boys and girls and gives them guns. This is the natural result. Take it from me, the characters and situations are very realistic. <br><br>This gets mixed with the growing anxiety among the older generation at the rising rudeness and rebellion of the new generation in a culture that values politeness above all else. From a frustrated and humiliated teacher; to students killing each other over seemingly unimportant squabbles; to the overly-cutesy, peppy training video that perfectly mimics nearly any show on NHK these days -- this film subtly and brilliantly comments on half-a-dozen issues that weigh heavily on the minds of Japanese people today. That's why it was such a big hit in Japan.<br><br>Maybe you just have to live here to get it. I give it 5 stars.","user":"tkuhns","rank":[429,498]},{"title":"Dark, dystopian, original, pretty girls and Takeshi","rating":8,"date":"9 August 2019","review":"This film has been ripped off and sequeled and become something of cult movie, but it cannot be duplicated. The acting is superb, the schoolchildren play it very seriously. The authority as depicted by the army (grown-ups) is quite sinister and the action entertaining. It is non-stop, which makes for a great film.\nWho doesn't like a whole bunch of thin pretty girls in skirt? So there is that.\nYes, it is a superb film.","user":"drapersukhman","rank":[14,14]},{"title":"Really Good Film","rating":8,"date":"2 November 2019","review":"First of all this is a super combination of originality and amusement. Secondly, this has been ripped off so many times it is astounding. Thirdly, the acting is top notch. The adult with anger management issues is horrendous and deadly. It shows the jarheads are evil. It also shows how beautiful girls are when they are fit, rocking and not tattooed trash.","user":"xzadrianedinson","rank":[13,13]}]