[{"title":"Noir Ain't Dead-- It Was Just Resting","rating":10,"date":"10 February 2007","review":"What I fail to understand is why if \"The Usual Suspects\" was so incredibly popular (because it was so freakin' good), \"The Way of the Gun\" gets stepped on, both at the box office upon its initial release, and in various, snarky IMDb user comments.<br><br>This movie isn't just good. It's INTENSE. It's DARK. There's not a single character in the movie who's likable, and some viewers attack that like it's a bad thing. The story line is complex, the relationships between the numerous characters are subtle and nuanced; and still, some viewers attack that like that's a bad thing.<br><br>Just because a viewer doesn't understand something, doesn't make the film bad. It's a difference of opinion, absolutely, but that doesn't make \"The Way of the Gun\" a bad film. Au contraire, this is a very smart film... and when a filmmaker is making a smart film about amoral, gun-toting outlaws, the people who come to see that sort of movie are going to feel confused and angry. Because they wanted it to be simple. They wanted easy answers, a clear-cut good guy and bad guy, and a happy ending. The way movies have gone since film noir faded away, decades ago.<br><br>But this film is not so simple, and neither are the characters within it, nor is the plot. Chris McQuarrie refuses to write something so cut-and-dry, so black-and-white. It's taut, it's tight, it rides a bad vibe from the opening sequence all the way down to the last line. This film is so gritty it makes me feel dirty after watching it... McQuarrie may be a victim of his own success, because it was released in the aftermath of \"The Usual Suspects,\" but if it built up an underground following like \"The Killer,\" it would be on the shelf of must-haves next to John Woo, Guy Ritchie and any other art film your parents wouldn't approve of.<br><br>Every character has his own motive, has his own backstory, and not all are necessarily spelled out for you. The dialogue is wound so tight, it snaps: \"Fifteen million dollars is not money. It's a motive, with a universal adapter on it.\"<br><br>I own this movie, and on a dark, rainy afternoon, I'll whip it out on the unsuspecting guest... \"It's from the writer of 'The Usual Suspects'\" I tell them. And from the opening scene, they're INTO IT.<br><br>It's not for everyone. But don't you dare call it a bad film. This is where YOUR favorite filmmaker steals all of his ideas.","user":"Quicksand","rank":[27,30]},{"title":"Ode to Peckinpaugh -neo-noir pulp fiction","rating":28,"date":"28 April 2004","review":"THE WAY OF THE GUN (2000) ***1/2 Ryan Phillippe, Benicio del Toro, Juliette Lewis, James Caan, Taye Diggs, Nicky Katt, Scott Wilson, Kristin Lehmann, Geoffrey Lewis, Sarah Silverman.<br><br>Christopher McQuarrie makes his directing debut in a big way with an obvious nod to Sam Peckinpaugh with his screenplay about two ne'er do well criminals (Phillippe and del Toro, both exemplary) who decide to make a mark for themselves by kidnapping a very pregnant surrogate mother (Lewis) to a wealthy businessman (Wilson) that eventually pans out to be a big mistake in a tangled web involving the woman's bodyguards (Diggs and Katt) and the bagman friend of the rich man (Caan in one fine, low-key performance of nuanced dread). More than enough rich dialogue and pinpoint camera angle set ups to go around with some live wire moments of unexpected turnarounds, double crosses and shoot outs may be the film's only fault in being an excess of too much of a good thing. A roundelette of pulp fiction best served by its exciting cast (as a side note, del Toro reminded me for some reason as a young Robert Mitchum in some scenes; go figure) and a filmmaker to watch.","user":"george.schmidt","rank":[35,40]},{"title":"An adult action movie","rating":30,"date":"30 July 2004","review":"I used to like movies like: \"The Matrix\" and \"Bad Boys\". But I've grown very tired of violent conflict portrayed as easy, fun, moral, and without risk. This is a movie where all the violence is fearsome, difficult, and wholly unpleasant. As it should be, anything else really is dishonest and evil. <br><br>This is one reason i think most people don't like this movie. There are two more. One is a somewhat complicated plot. There are about a dozen characters and each one have different motives and I think most people can handle no more than 4 motives. The other reason is that the \"main characters\" are not the heroes of the story. They set the story in motion and keep it together but they are not who the movie is about and to tell a story in such an unconventionally roundabout way is entirely confusing for some people.<br><br>So you may not like this movie if...<br><br>You are uncomfortable with violence being violent,<br><br>You can't keep track of the motivations of 8 separate characters,<br><br>You automatically believe that the story is about the characters played by the actors pictured largest on the box.<br><br>otherwise you may really like this movie because it's really well made in all its aspects.","user":"Grabbagool","rank":[138,172]}]