[{"title":"Great film, if you haven't read the book","rating":8,"date":"6 October 2004","review":"This is an entertaining movie that goes over two hours, but I really don't understand why it was made. Sprawling stories spanning several decades with several subplots involving dozens of characters are totally defensible on the printed page, where we can always go back and remind ourselves which character is which and how this character is related to that one. But this type of thing makes no sense whatsoever in a film. Unless a viewer has a phenomenal memory, such a story on film invariably leads to confusion and to my asking myself, \"now wait a minute, whose brother is this, and whose son?\"<br><br>So that is one of the principal problems with this film.<br><br>There are several other problems as well. Reese Witherspoon is badly miscast. She simply lacks Becky Sharp's bite. In fact, the whole film lacks Thackeray's bite. Reese does a good job with the British accent, but it just doesn't work. She is just too American for the role. Weren't there any British actresses available, or were the producers just relying on Reese's star power? Reese is just too nice to play Becky.<br><br>It has often been said that Becky Sharp was the model for Scarlett O'Hara in \"Gone With the Wind,\" although Margaret Mitchell denied this. Even so, I kept visualizing Vivien Leigh in this role and imagining how perfect she would have been. I think Mira Nair was thinking of GWTW as well, because there are several scenes in the film that are obvious homages to it. First there are the battle scenes during the Battle of Waterloo, followed by a panoramic view of the carnage following the battle, complete with corpses strewn all over the battlefield. This was an obvious homage to the crane shot over Atlanta in GWTW. The final fight between Becky and her husband reminded me of the final fight between Scarlett and Rhett in GWTW. I half expected the husband to say \"Frankly, my dear, I don't give a damn.\"<br><br>Another flaw involves the Indian director Nair's inability to resist bringing in some Bollywood type scenes, particularly one involving Becky leading an Indian type dance, with Indian music, before the king, no less, and to thunderous applause.<br><br>And yet another thing: this film spans at least twenty, maybe twenty-five or thirty, years in Becky's life after she graduates from finishing school--I am not counting the one scene of her as a child--yet the character never ages. Neither do any of the other characters. Maybe the makeup staff went on strike?<br><br>But most of these problems won't even be noted by someone who hasn't read the book, so if you haven't, go ahead and see it; you'll probably be entertained. And if you are someone like me who loves the book, you may not be able to resist seeing it anyway. But Thackeray was never so soft.","user":"wjfickling","rank":[106,122]},{"title":"Thackery goes Hollywood","rating":6,"date":"2 February 2005","review":"\"Vanity Fair\" (2004) is an acceptable but abbreviated version of the classic Thackery Victorian period novel which tells of Becky Sharp (Witherspoon), who uses artifice and charm to climb from lowly governess to aristocrat, always able to find a suitable family of peerage or property to use as a rung in her ladder to the top in spite of the tribulations of the time. At just over two hours, this film cannot deal in depth with the many characters in the story and has to content itself with hitting the high points which make for a very condensed telling suited to those who only wish the flavor of the story. Those with a particular interest in Victorian pulp fiction or more expansive dramas should turn to the BBC's 1998 six hour miniseries which offers greater character depth, a presentation much more true to the period, and a very much better cast. (B-)","user":"=G=","rank":[64,74]},{"title":"A novel without a hero becomes a film without any bite","rating":2,"date":"15 September 2004","review":"If Becky Sharp, Georgian England's conniving, calculating social climber, had a contemporary equivalent, it surely would be Tracy Flick, the deliciously ambitious high school student played delightfully by Reese Witherspoon in the acerbic comedy, \"Election\" (1999).<br><br>Director Mira Nair has said what made Witherspoon the ideal Becky Sharp was the actress' \"American energy and sassiness.\" Fair enough. But why did Nair then tame that energy and sass? We see none of it in Witherspoon's Becky. This isn't the feisty actress who proved she could play edgy and biting in \"Election\" and \"Freeway\" (1996). This is Elle Woods as Becky, thanks to Nair's misguided decision to turn Becky into an appealing feminist.<br><br>I'm not averse to directors stamping their distinct styles on literary works, mixing film styles or modernizing old works. But you don't change the work's crucial essence. You don't transform Goneril and Regan into caring daughters, for instance.<br><br>That's where Nair's take on William Makepeace Thackeray fails miserably.<br><br>She and Oscar-winning screenwriter Julian Fellowes - the two other credited writers, Matthew Faulk and Mark Skeet, reportedly disowned the film alleging the shooting script bore no resemblance to their work - have stripped Becky of all her viciousness and cunning. They've declawed her in a ridiculous attempt to make her likable.<br><br>In interviews, Nair and Witherspoon insist they didn't want to make a typical \"bonnet\" film. Fine. But you also shouldn't make a film that doesn't know what it wants to be and lacks emotional resonance. And that's what Nair's film is.<br><br>It sparkles for about a half-hour or so as we see a young Becky, played pluckily by Angelica Mandy; then, the older Becky (Witherspoon) leaving school with her friend, Amelia (Romola Garai), and meeting, among others, Dobbin (Rhys Ifans) and George Osborne (Jonathan Rhys-Meyers). Later, Becky becomes Sir Pitt Crawley's (Bob Hoskins) governess and meets her future husband Rawdon (James Purefoy) and Matilda (Eileen Atkins).<br><br>But once Becky heads to London, the film screeches to a halt. With no one seemingly knowing what the emotional tone should be and the story's harshness and satiric edge excised, the film grinds at a snail's pace, the actors slowly sapping all the energy out of it. A scene between Becky and George at the piano should be tart, their words should sting. Instead, the two actors labor with the dialogue and make the moment as sharp as a dull razor.<br><br>Adapting Thackeray's massive novel into a feature film was never going to be easy. But Nair gets more wrong than right. With the exception of the children, none of the characters age. Gabriel Byrne looks the same at the end of the film as he did in the beginning, which takes place 40 years earlier. Witherspoon, Garai, Hoskins, Ifans, Purefoy and Rhys-Meyers also show no hint of aging. And in an attempt to condense the story, important characters - Amelia and Dobbin, for instance - disappear for long periods and show up solely to wrap up subplots.<br><br>The highlights are Declan Quinn's striking cinematography, performances by Hoskins and Atkins, the only two who seem to be having any fun, and a superbly restrained Ifans, playing convincingly against type.<br><br>Much has been made about the Indian influence in Nair's story. There's nothing wrong with them being in the film. Thackeray was born in Calcutta and the colony's impact was evinced in Georgian English society. Not only do Nair's Indian touches make the film seem more vibrant, but the peacocks, parrots and Indian musicians, costumes and servants also make provocative statements about the exploitation of India and how the British Empire amassed its wealth. However, no matter how exotic it seems, Becky's dance just doesn't work and seems like nothing more than an imprudent attempt to add a foreign film style into this period piece.<br><br>Witherspoon, whose English accent falters occasionally, works commendably, but ultimately remains unconvincing through no fault of her own, really. You don't take someone who quips, \"Revenge may be wicked, but it's perfectly natural,\" and turn her into a sweet, amiable victim. Witherspoon isn't even remotely as devious as Nair would want us to believe. <br><br>It's unlikely another actress, say Kate Winslet or Kate Beckinsale, would have fared any better for she'd have worked with the same script and Nair's foolhardy direction, which includes inexplicably asking Geraldine McEwan to not so much speak her lines as to squeal them high-pitched, making the veteran actress' Lady Southdown needlessly irritating.<br><br>This film remains so emotionally lackadaisical that when Becky finally breaks down before Rawdon, it seems more like a \"For Your Oscar-Consideration\" moment for Witherspoon than anything else. By softening Becky, making her more alluring than calculating, Nair destroyed the story's spirit. She and Fellowes also tacked on a ludicrous ending.<br><br>As botched film adaptations of literary works go, \"Vanity Fair\" isn't nearly as execrable as Roland Joffé's \"The Scarlet Letter\" (1995). But I'm confounded as to how the skilled storyteller of \"Salaam Bombay!\" (1988) and \"Monsoon Wedding\" (2001) could have gone so horridly wrong.","user":"anhedonia","rank":[166,208]}]