[{"title":"These ladies kick ass!","rating":10,"date":"20 August 2003","review":"'8 Women' is a rather unique film. On the surface it is the probably only entry in the genre of the grotesque whodunit-musical. But actually, it's a huge playground - for the actresses who get the chance to play with the stereotypes attached to them, and for director François Ozon to toy with the clichés of the whodunit.<br><br>Here's the setup: 1950s. A beautiful mansion. A man is found lying in his bed with a knife in his back. The possible suspects: His wife, his two daughters, his sister, his mother-in-law, his sister-in-law, the chambermaid and the cook. As these eight women can't leave the estate or call the police, they try to find the murderer themselves. We know this situation from countless Agatha Christie-stories.<br><br>But what Ozon makes of this situation is just incredible. It already begins with the casting: Who else could play the gentrified Gaby if not Catherine Deneuve? Is there any actress who would fit more perfectly for the role of the spinsterish sister than Isabelle Huppert? Who else would you want to walk around in that dress of a chambermaid than the most desirable Emmanuelle Béart? The actresses are eagerly playing with the stereotypes that surround them because of both, the roles they played and their private lives.<br><br>Then there's the story: All whodunits have those obligatory scenes where the motives of all characters are revealed. '8 Women' takes that formula and deliberately goes over the top with it, it's characters are unfaithful, pregnant, lesbian, poisoners and many things more. And as a final twist, the film stops eight times to give each of its protagonists a chance to reveal her true character in a scene entirely devoted to them - singing and dancing. There is also another scene worth mentioning that is entirely dedicated to the actresses: A scene with a lot of dialog that entirely consists of nothing but a series of closeups - and that for about three minutes.<br><br>Cinephiles can enjoy this film on even another level: The film is filled with references to beloved classics. Consider Fanny Ardant's musical number, which pays homage to Rita Hayworth's glove-strip in 'Gilda', and another Rita Hayworth-moment so wonderful I won't reveal it here. Consider Emmanuelle Béarts hairstyle that echoes Kim Novak in 'Vertigo'. Consider the fact that the late husband of the Dannielle Darrieux character was a general, reminding us of 'Madame de...'. Or consider the painting of the young Catherine Deneuve hanging in one room - a replica of a 'Belle de jour'-poster. All this is supported by the rich, colorful cinematography, the art direction and the costumes, that give the entire film a 1950s look.<br><br>But attention: If you give this film a chance, don't expect it to be logically consistent. It isn't. But that doesn't matter at all. The murder mystery story is replaceable. The film is entirely devoted to its brilliant actresses and the wonderful, bitchy dialog they exchange. It's great fun and it is getting better with every viewing.","user":"RWiggum","rank":[91,105]},{"title":"8 stars for 8 Women","rating":8,"date":"3 November 2007","review":"In the simply uncategorizable French movie \"8 Women,\" successful businessman Marcel is found stabbed to death in his bed. Whodunit? Was it his wife (Catherine Deneuve) or his estranged sister (Fanny Ardant)? Or his mother-in-law (Danielle Darrieux) or his sister-in-law (Isabelle Huppert)? Or one of his daughters (Virginie Ledoyen, Ludivine Sagnier)? Or his longtime cook (Firmine Richard) or his new housemaid (Emmanuelle Béart)? <br><br>The movie, however, is less concerned with the murderess's identity than with giving these 8 actresses the chance to show off, in a series of campy, funny, melodramatic scenes. To that effect, there are countless catty remarks and catfights. The revealing of progressively more outrageous family secrets. Lesbianism, twisted love triangles, chic couture wardrobes, transformations from ugly duckling to swan. And, last but not least, musical numbers. The action stops for each woman to dance and sing (usually in a breathy untrained voice) a pop song that reveals her character's emotional state. It's a bizarre mix, but you'll find yourself laughing through your incredulity.<br><br>Faced with eight such talented actresses it feels rude to single out individual performers, but Huppert's portrayal of the embittered spinster Augustine steals the movie. Every one of her line readings is distinctive and hilarious, making this abrasive, histrionic character an absolute delight to watch. Almost as good is Ardant, playing a surprisingly likable free-spirited bad girl; because her character has no shame, she's at least honest when all the other women tell lies.<br><br>The lesser-known Firmine Richard gets one of the best musical numbers with \"Pour ne pas vivre seul\" (\"So as not to live alone\"), and Sagnier, who was in her early twenties when she filmed the movie, very convincingly plays a bratty 16-year-old.<br><br>All of the actresses' roles allow them to satirize their own or others' personas: Béart sends up the \"seductive French maid\" stereotype; Ledoyen is costumed to look like Audrey Hepburn but her character is no girlish innocent; Deneuve plays a variation on her customary chilly, glamorous bourgeois matron. Meanwhile, grande dame Darrieux cuts loose in the role of a meddling, lying grandma.<br><br>\"8 Women\" is thus more than just a comedy-mystery-musical: it's a witty postmodern comment on movie genres, movie stars, and three generations of French divas. It has a healthy sense of its own absurdity (indeed, how can anyone take this Agatha-Christie-type mystery seriously anymore?) yet all of the actresses are fully committed to telling this ridiculous story. Certainly one of the strangest films I've ever seen, it also--unlike so many serious and earnest modern movies--reminds me of why I love the Technicolor screen and its great actresses in the first place.","user":"marissas75","rank":[29,36]},{"title":"8 Women: 8 facets of womanhood which drive men crazy...","rating":10,"date":"8 February 2002","review":"Francois Ozon is a daring director who never leaves the audience indifferent... 8 Women can be seen as a mysoginist view of womanhood from the viewpoint of a gay director... However I for one saw this movie as great entertainment and excellent showpiece for France's leading screen divas.<br><br>8 Woman is a whodunnit not so far from Agatha Christie's 10 Petits Negres: 8 women each have enough reasons to kill the father, in-law, brother and master of the house. Of course I will not tell who killed the man and why, but it is not so important after all. Because 8 Women is first and foremost about womanhood: all facets of the woman exposed through the revelations, attitudes, manipulations of 8 different women: the girl, the blossoming young lady (Ledoyen), the femme fatale (fabulous Ardant), the femme repressed (hilarious Huppert), the bourgeoise (Deneuve), the old stepmother, the lesbian, the sexual and sexy maid (Beart).<br><br>This film is all about the cast performance. All women have their sing-a-song moment very apropos and funny. All actors deliver stunningly, especially Ardant, Deneuve and Beart. It is very lighthearted despite the somber revelations: bright colours, golden 50's nostalgic atmosphere, nice pop tunes with fun choreography.<br><br>It is great to see that French directors love their actresses whatever their age... Hollywood learn from this, we don't care much about Pamela Anderson or Jennifer Lopez-like babes... Honestly as a young French guy, the 50-something Fanny Ardant is the one who turned me on the most!<br><br>Wholeheartedly, 9.5/10","user":"davidguy","rank":[9,10]}]