[{"title":"Making a killing off comic books.....","rating":6,"date":"10 April 2008","review":"Kind of a unique idea for a dark comedy. Competing comic book store owners trying to outwit each other for a prize collection. Unfortunately the crazed collectors are all, except one, unlikable, unsympathetic, and greedy. The movie is very uneven, with characters morphing from just scheming crazies, to murderers. It is at this point, when almost everyone has transformed into killers, that \"Comic Book Villains\" seems to have run out of ideas, and rapidly spirals downhill. If after the confrontation in the old ladies home, the script had been fully developed, the movie might have worked better on several levels. As it stands, it is at best, a very mediocre black comedy. - MERK","user":"merklekranz","rank":[6,6]},{"title":"See this movie if you've ever liked comics","rating":8,"date":"5 January 2003","review":"I admit that I rented this movie simply because I love comic books (and have been wanting to see it ever since I first learned it was being made); however, the movie really surprised me. It was a very entertaining tragicomedy, namely thanks to its premise of trying to get a 45-year-old comic book collection from an unrelenting mother.<br><br>Donal Logue put forth an excellent performance as the bankrupt and shabby local comic store owner, and Cary Elwes actually made a believable thug. Despite cliché hijinks from the Natasha Lyonne-Michael Rappaport team-up and unnecessary narration, the story makes good with incorporating capitalistic competition, laid-back criminals, and comic trivia. In short, anyone can really enjoy this movie, but it is a must-see for what Stan Lee calls \"true believers.\"","user":"The Overdrama","rank":[14,17]},{"title":"The time flew by!","rating":5,"date":"5 May 2003","review":"These types of stories, by which i mean, a group of people who's true natures are exposed by greed and obsession, will either work for you or not, and by default the climax will seem over the top and take away half the audience.. but no matter the ending, the ride there is very well executed, and went way past the expectations i got from just watching the trailer.<br><br>The great cast of guys who steal scenes in other films, was one i was very interested in, but i sceptical about the actual film, i thought past the interesting plotline,it would be poorly written and directed by a moron.. but it so wasn't!<br><br>It's one of those movies that through good storytelling just makes you watch, and not want to get up, and the 90 minute runtime just flies by! not one scene is wasted, not one performance is perfunctonary, it's just completely well made all round, and very well written/directed. I think the negative comments are from people who are expecting way too much from the film, and maybe movies in general.. if you're someone who just goes along with the ride, so long as it's all relatively credible, and you like the cast, then i think you'll have a great time, no doubt! this film went way past my expectations!<br><br>my only quibble, and it's so minor, plus it seems unavoidable with films about greed, HOW THE HECK DO YOU END IT!! if the film was being completely realistic, then the film's ending probably wouldn't happen, but in real life the ending would be pretty dull, and lose the whole comic book feel to the film.. comic books also use violence as a device, comic books are visually over the top representations of everyday things.. many characters in comic books are 2-dimensional simple folk.. hence the title to this movie, and in general the whole feel and look to the movie (which btw looks VERY good for such low budget!).. so the ending in after thought may seem to be slightly over the top, and doesn't seem to fit the characters, but while watching i was hooked! and so will you! :)<br><br>definately worth the rental!! maybe even a buy. It's hard to recommend as a film for comic book fans, because that's like saying every girl is going to like a chick flick, but there are comic book references aplenty, and comic book collectors for fellow guys to relate with.. so i think a comic book fan might get more out of it than others, but not necersarily enjoy it more.. but what's great about this movie, is that you don't need to know ANYTHING about comics to enjoy it, you can even watch it in mute! it's really well made!","user":"tj_director","rank":[8,10]}]