[{"title":"Smarmy, tasteless, trendily cynical rewrite of \"The Devil and Daniel Webster\"","rating":3,"date":"21 July 2010","review":"Struggling novelist, unable to get anything published much less an actual audience to read his work, enters into a pact with a comely female Satan: fame and fortune in exchange for his immortal soul. Archibald Macleish's play \"Scratch\" becomes an updating of \"The Devil and Daniel Webster\" (filmed in 1941, with a panicked farmer as the tempted central figure); producer-director Alec Baldwin portrays the leading character opposite a terrific supporting cast, including Anthony Hopkins as lawyer Daniel Webster and Jennifer Love Hewitt as the Devil. Unfortunately, the movie was edited against Baldwin's wishes after sitting on the shelf for years, debuting on the Starz television network in 2007 after some brief theatrical bookings. It begins well but quickly loses its footing once Baldwin's writer gains the success he so desired, turning the picture into a yuppie treatise on the old money-can't-buy-happiness ploy. The filmmakers are so out-of-touch, they don't even consider the fact that maybe some of the writer's needs ARE fulfilled by his newfound celebrity. Instead, he turns into a sad sack with money in the bank and women at his feet--clearly not something struggling writers in real-life can identify with. Worse, there's never a moment when this man's heart is actually detectable; Baldwin is so callow an actor (not to mention as the director) that all we perceive are his handsome, unmodulated externals. He purses his lips and gazes intently at the camera, hoping to smolder, while viewers lose track of the character's roots. The final courtroom battle is well-played, though so much of the writing is smarmy, and executed without style, that the overall results are distinctly unsatisfactory. *1/2 from ****","user":"moonspinner55","rank":[11,14]},{"title":"it pained me to see Sir Anthony Hopkins in such an awful movie","rating":1,"date":"3 August 2018","review":"This movie was an utter piece of trash. it only scraped the surface of such a classical topic and one that many people have pondered upon for all eternity. and while at it, not only did it not offer no new points, but i felt it took all seriousness and gravity off it. the characters: underdevelped, the action: sloppy and head-titled. the use of slow motion: childish. an awful movie. the end.","user":"super_cynical_biitch2003","rank":[4,4]},{"title":"A Very Good film and definitely worth watching","rating":9,"date":"25 August 2006","review":"I saw this film at the Venice Film Festival and have waited a long time to comment on it as I wanted to see it again when I was released. However, it still has not come out and I don't know if it ever will.<br><br>Alec Baldwin is a writer, down on his luck and nowhere to go but down even further.<br><br>As with many viewers I suspect, I was attracted to this film by the cast and the fact that it has received so much press, good and bad. The plot is based on the old casino idea of a writer whose career in next to nil and is getting ready to self destruct  and unless you get into it, it'll feel rather forced and silly at times.<br><br>However the film helped me to overcome this by being very low key and downbeat  very much like Baldwin himself. The film is not a great thing but one that is easy to get into. The film uses Las Vegas really well but it is a classic story that is fun to believe in. It is much better than the fun, breezy and slick fantasies that we are sold in other films. The mix of romance, comedy and violence works very well  at points it was very touching, at others quite funny.<br><br>It isn't perfect of course and the writing is where the problems lie; the story did rely on the audience buying into it and at times the dialogue comes very close to corn (but just misses). The only time I felt really let down was the ending, which, although fitting with the spirit of the film, missed a great chance to be fun, exciting and original all at the same time.<br><br>Still, a good film and definitely worth the watching.","user":"cute_little_seniorita","rank":[30,49]}]