[{"title":"Charming M4TV Faerie Tale.","rating":8,"date":"29 March 2007","review":"Although this does begin slowly, it picks up nicely and proceeds at a fair pace.<br><br>This is basically set as a commentary on the idiocy of war, having set the Leprechauns against the Faeries over nothing more consequential than race. Although forbidden by the Grand Banshee (Whoopie Golodberg), the fighting continues, as the Troopoing Faeries are the \"natural enemies\" of the Solitary Faeries. They have no pause to battle one another, as Fae Folk cannot die. Having no consequence to war, war seems a trivial thing to these folks. It is discussed with great dramatics, for to these wee ones, it is but a game of acting and playing, regardless of the caustic cause of the war. Once war is taken seriously, they still engage one another to a surprising effect, via the Grand Banshee, who is attempting to teach them to value their lives via reward and punishment.<br><br>Too bad humans do not learn from such drastic consequences.<br><br>Actually, this was quite enjoyable; featuring some great performances, an interesting story, and decent execution. The story is fashioned after a Romeo and Juliet setting, with good contrast between the two opposing sides, and a clearly defined relationship between the involved couple. Additionally, there is a simultaneous romance involving the humans Jack (Randy Quaid) and Kathleen (Orla Brady).<br><br>Endearing characters, enchanting story with solid morals, and magical execution make this a near-classic.<br><br>If you like this, you should try Disney's \"Darby O'Gill and the Little People,\" \"FairyTale, A True Story,\" or \"Legend: The Ultimate Edition.\"<br><br>This rates an 8.4/10 from...<br><br>the Fiend :.","user":"Elswet","rank":[16,18]},{"title":"This movie was VERY entertaining","rating":8,"date":"17 January 2006","review":"So there weren't very many big name movie stars in it, but who cares? Zoe Wanamaker was great and so were quite a few others. If you have no imagination and enjoy stunting the growth of creative minds, you probably won't like this movie. The storyline did have some throwbacks to classic themes, but it was done in such a way that it wasn't tiresome. The scenery was beautiful and anyone that loves Ireland will enjoy seeing the blue skies and rolling green hills. Whomever designed the costumes for the characters must have had fun. The were very pretty and fit the personalities of the respective wearers. Anyone that enjoys a little magic will enjoy this movie.","user":"sgoldenbird","rank":[17,21]},{"title":"For children, it is a must see! A magical \"Romeo & Juliet\" with a happier ending.","rating":10,"date":"7 October 2002","review":"I think that this was a great movie. My daughter (4) and I have rented it several times. It makes you want to be a kid again and to believe that there really is a magical world that exists.  That this world exists in the here and now.","user":"anchorage74","rank":[10,12]}]