[{"title":"an amazing document!--Andy Milligan at his most Warhol-esque","rating":9,"date":"26 September 2003","review":"If I were going to try to convince someone of the value of Andy Milligan's work, VAPORS would be the film I'd show. In fact, I HAVE shown it to a few people over the years with that purpose. It's a gritty 16mm black-and-white feature set in a gay bathhouse and it seems very much like a \"small theatre group\" play, which makes sense since Milligan himself ran a few such theatre groups. The film transcends the gay aesthetic it represents and is really a meditation on loneliness--gay, straight, or whatever. While the room-tone echo on the recorded sound takes a little getting used to, it should not diminish the quality of the acting, which is quite moving in the case of the two leads. While the late Mr. Milligan was a unique filmmaker, Warhol always seemed to be his main-man artistically, and that's clearer here than anywhere else in Milligan's work. Milligan obviously knew what it meant to be lonely, to be afraid, and to reach out. This beautiful but raw film captures that as well as, for example, any Bergman film or Saul Bellow novel. History will view this film as a pioneering work of cinema. Please be warned, though, that it is NOT for the casual viewer or the viewer who cannot see beyond the film's lack of traditional qualities of slickness and \"professionalism.\" Seeing this on a big screen at the time of its minimal release must have been a revelation!!! If Milligan had never made another film, this would rate him as a major filmmaker in my book.","user":"django-1","rank":[13,14]},{"title":"weird little movie","rating":10,"date":"10 January 2001","review":"You can buy this on the Something Weird label as part of one of their collections of Gay Films from the 60s and 70s.<br><br>\"Vapors\" is about a man's first trip to a gay steam-room. It was banned across America when it came out - it's quite tame by our standards, but does feature a male-male kiss and is very weird. Full of camp little gay men running around being horrible to each other, and a very odd climax involving a paper sunflower and the rhyme \"this little piggy went to market\". The final scene, which shows a penis coming at the screen was censored with an annoying black line.<br><br>The two main characters seem to be more interested in spooking each out than having sex - there's a particularly horrible story about a man's son who died in a lake, while the description of dreams involving women's feet, and the analysis of sanitary pads reveal that these men find the ordinary to be disgusting - of course this is all juxtaposed with the fact that their targets would find going to a gay bathhouse to be disgusting... Interesting all the same.","user":"bakerjp","rank":[6,6]},{"title":"First film by a grind house superstar is possibly better than everything else that followed simply because it was closest to his heart","rating":7,"date":"30 June 2007","review":"Milligan's first film is possibly his best. Certainly its one of the few where the technical limitations of his equipment didn't hurt the film (Andy used basically one camera with one lens which could make things cramped) The plot has the meeting of two men in a gay bath house and talking. Very little happens other than other men come and go and you sense the longing and the need to connect to someone like yourself. One of the first films graphically (well for the time) deal with homosexuality as something real and not monstrous this film rattled cages. Very much an independent film, low budget art film this is very different than almost anything else that Milligan did (at least that survives). There is a rawness and a realness that shines through so that even though we know its artificial we can sense the reality behind it. Clearly not for all tastes this is an interesting look for those who like Milligans drek, to see where he started, and its an interesting side note for theater buffs to see one of the footnote founders of off Broadway went off theater.","user":"dbborroughs","rank":[7,9]}]