[{"title":"I got what I wanted","rating":9,"date":"13 March 2008","review":"What would you expect from a film titled 'Surviving Christmas'and presented as 'festive fun', something like Ghandi or English patient? There are lots of things I love about this film, it's funny, it is very well cast and it is superbly written. I came to the film as a Kaplan/Elfort fan but was dubious when I read the plot, it sounded ridiculous. But the film doesn't come across like that because Affleck (as Drew Latham) plays his part perfectly, one minute a child-like adult, the next a mature man who realises he has gained everything in life apart from what he really wants. In fact we see Latham grow up in this film, when he encounters the problems of those he envies and realises that their lives are not so good, he sees that his own lot is not so bad.<br><br>This film has fewer weak or dud scenes than many other comedies I have seen. Comedy is so much harder than any other type of drama, it either works or it doesn't and very few comedy writers get it correct every time.I particularly loved the drama scene, where the family take to reading parts written by Latham . The pleasure is in the reaction of Tom Valco (James Gandolfini) and the comments of Brian Valco (Josh Zuckerman). It is the dilemma of the greedy Tom Valco who has to bite his tongue, wear silly hats or sing to the Christmas tree in order to earn the prize money that keeps the film moving along well.<br><br>The addition of daughter Alicia (Christina Applegate) into the story brings a delightful romantic angle, and why not in a Christmas film? Of course its corny and contrived; he's rich and handsome, she's beautiful and single, and so inevitably her and Afflect end up falling over together in the snow and finding themselves face to face. Great! One thing I would have liked was more use of festive music to boost the atmosphere but I can't really complain. I got what I wanted.","user":"cg-cgeorge","rank":[34,38]},{"title":"Surprisingly funny","rating":7,"date":"14 March 2005","review":"Surviving Christmas is a surprisingly funny movie especially considering the bad publicity when it was first released. Ben Affleck is funny as an obnoxious millionaire who pays the family that occupies his childhood home to be his family for Christmas. He then drives the family crazy with overindulgence for Christmas cheer. I have not been a Ben Affleck fan in the past (though I did like Daredevil and Paycheck) but here he is well cast in this role. I also like Christina Applegate as the daughter in the family who can't stand Affleck's character at first. Sure you can see where this movie is going but you don't care. Ignore what the critics say and rent this movie out because it is funnier than a lot of Christmas movies.","user":"jpintar","rank":[30,36]},{"title":"A joyful Christmas movie","rating":8,"date":"1 January 2005","review":"Its a good thing I rented the movie before seeing the viewer rating from this site. It was a wonderful movie that I will be adding to my Christmas selection. The cast was wonderfully chosen and Ben Affleck plays a good leading role. I would tell viewers who have not seen the movie to go ahead and buy it. I rate it right up there with Christmas vacation. The movie was very funny and well written and Ben plays the eccentric rich executive very well. The things he says and does is just how I would imagine a person with too much money to act. The movie is much funnier than The Santa Claus and Christmas With The Kranks. Plus it has a good story line and teaches the true meaning of Christmas which is you can't buy love with money.","user":"jjcaine","rank":[24,30]}]