[{"title":"Bemusing as well as agreeable film with super Jackie Chan","rating":5,"date":"29 November 2004","review":"The movie centers a police agent (Jackie Chan) who will face down an evil baddie called Snakehead (Julian Sands) for the possession a medallion with an extraordinary power and he wants to use its magic for his own nefarious plans . Chan and other agents (Claire Forlani and Lee Evans) will have to face off nasties who are waiting to rule over the world and obtain eternal youth , but the medallion is carried by a boy and he hands over one halve to Jackie Chan . As Chan must determine the secret of the medallion and confront the evil Snakehead who wishes to use its magical powers for his own nefarious schemes . <br><br>From start to finish action pace is interminable , the movie is fast moving and that's why it is amusing and isn't boring , neither tiring . The film blends intrigue , humor , pursuits , frenetic action , struggles and results to be very entertaining . In spite of it , this comedy/action picture failed in the box office and was a real flop. The action by Jackie Chan is proceeded by means of special effects , FX , and wires to difference other films in which he makes his owns stunts . The motion picture has a certain likeness to ¨the Tuxedo¨ similar in extreme powers of Jackie such as : thanks to the 'medallion' and 'tuxedo'. While in the first Jennifer Love Hewitt played as ¨buddy movie¨ couple with Jackie Chan , here plays along with Claire Forlani .<br><br>The final showdown between the starring and nasty contenders is astounding and overwhelming although there are made by computer generator FX . The motion picture was regularly directed by Gordon Chan (Painted skin , Fist the legend , Thunderbolt) . After seeing credited director Gordon Chan's rough cut, Columbia hired Douglas Aarniokoski to shoot new sequences and re-edited the film extensively . The yarn will appeal to action-packed buffs and Jackie Chan fans.<br><br>Rating : Average 5/10","user":"ma-cortes","rank":[17,20]},{"title":"Typical Jackie Chan movie of later years","rating":5,"date":"14 September 2006","review":"Recap: Police officer Eddie Yang traces known gangster Snakehead to Ireland after Snakehead kidnapped a holy kid in Hong Kong. According to the myth, the kid, with a certain medallion, can resurrect people and give them superpowers (like immortality). Yang, and his colleagues Watson and James, tries to free the kid as Snakehead tries to smuggle the kid into Ireland on a boat. The result however is that the kid and Eddie falls in to the water, trapped in a container. Eddie drowns, but saves the boy, and in return, the boy later resurrects Eddie. Now, Eddie, with superpowers must stop Snakehead once and for all.<br><br>Comments: I thought they really had something going there. Started out nice. As I expected, a lot of martial arts and fights, all nicely choreographed and with augmented with extra aids (like wires), of course, but still with a good feeling and some nice touches. The story was nothing fancy, but they had found the balance in the fights. Just enough fancy kicks and jumps. Action director Sammo Hung and Jackie Chan were onto something here. Then came the superpowers. Then everything went just silly. The balance went right out the window (along with Jackie Chan/Eddie Yang actually). Instead of nicely choreographed fights we get ridiculous fights with a lot of special effects. Net result; Silly. And the story didn't get any better either.<br><br>Jackie Chan delivers what is expected of him, he does what he usually does. But I can't do anything but wonder why the character Arthur Watson is in the movie? To add some comic element apparently, as that was needed. Watson is annoyingly clumsy, petty and incompetent and has mysteriously risen to a high position within Interpol. Evans plays the part well, I guess he does what is asked of him, but again, why is the character in the movie? Claire Forlani got the role of Nicole James, agent/love interest, of Eddie Yang. Though Nicole is much more competent than Watson she is clearly side-stepped both in the movie and with the virtual Interpol. Therefore her role is small, her potential and talent not used, her major part is as the one taking care of the kid (Doh, she's a woman - and this is a boring stereotype). She gets to show her skill in martial arts a few times though, showing she (or her stunt double - some shots make it easy to assume she has one) got them. Her only major fight though is, of course, against the female bad guy (to the sound of screeching cats... oh, come on!).<br><br>So, the beginning was promising, the second \"half\" disappointing. On average a 5.","user":"Enchorde","rank":[6,6]},{"title":"Entertaining, Fast-Paced Genre Melder","rating":8,"date":"13 January 2005","review":"Every 1000 years a child is born who can wield the power of two halves of a supernatural medallion, which can bestow superhuman strength and immortality, as well as take life away. Snakehead (Julian Sands), your typical crook with world domination ambitions, has discovered the identity of a modern-day chosen child, and pursues him. Meanwhile, Hong Kong police detective Eddie Yang (Jackie Chan) and Interpol agents Arthur Watson (Lee Evans) and Nicole James (Claire Forlani) have been pursuing Snakehead because of his criminal activities, and stumble into the grander scheme.<br><br>While The Medallion is certainly not a film without flaws, it is satisfying on the whole if you approach it as a comic book/cartoon-styled Jackie Chan actioner. The film combines even more genres than that, actually, and there are times when it seems almost to be a spoof of James Bond-styled thrillers. There are also more straightforward comedy elements--especially when Evans is on screen, the film almost becomes a slapstick farce--there are Matrix-styled fantasy/action aspects, and there is a romance subplot. On top of all of that, The Medallion moves very quickly. Director Gordon Chan packs a lot of information into the film and barely pauses for a breath--if you blink, you're likely to miss some bit of crucial action, a plot point, or a joke.<br><br>In short, it's a complex stew of different genres, with a mixture of adult themes and childlike lightheartedness, wrapped in a dense mythology of fantasy and served at a non-stop, breakneck pace. Undoubtedly, those qualities will turn off a great deal of viewers, whether because they hate MTV/attention-deficit-disorder-styled editing, genre hopping or a lack of real-world believability. I don't mind any of those qualities, and in fact I tend to prefer films that forgo realism.<br><br>I only had two small complaints about The Medallion. One, it took me a few scenes to get up to speed with the film, both plot-wise and in terms of style. Once I got into the groove, though, I didn't want the film to stop--enough that my second complaint is that the film was too short (and in general, I strongly dislike the fact that most films seem to be forced by studios to end within 90 minutes). I wanted to see more of these characters, especially Evans, who stole most of the scenes he appeared in. Jackie Chan fans seeking a return to films that are solely kung fu-oriented will likely be disappointed, but if you have broader tastes, The Medallion might hit the spot. An 8 out of 10 from me.","user":"BrandtSponseller","rank":[33,46]}]