[{"title":"Extremely obscure horror film with legendary Joe Spinell.","rating":5,"date":"29 May 2004","review":"\"The Undertaker\" is a lost and forgotten horror film with Joe Spinell.He plays crazy mortician with the penchant for necrophilia called Roscoe,who stalks and kills beautiful girls.His nephew tries to stop him.The film is clearly not as good as \"Maniac\",albeit there are some striking similarities between this one and Lustig's gruesome gorefest.The acting is truly awful with the exception of Spinell.The budget is extremely low and there is almost no gore.However there is plenty of nudity,so fans of low-budget slasher flicks won't be disappointed.\"The Undertaker\" is also filled with many clips from \"The Corpse Vanishes\",which Roscoe watches everyday.Anyway, if you're a fan of Joe Spinell you may give this one a try.My rating:5 out of 10.","user":"HumanoidOfFlesh","rank":[12,14]},{"title":"He'll love you to death!","rating":5,"date":"17 August 2016","review":"The late, superior character actor Joe Spinell (of \"Maniac\" fame) had his last leading role in this obscure shocker, before dying at 52 of undetermined causes. Joe gives this bargain basement piece of excrement what little value it has, playing the part of \"Uncle Roscoe\", a mortician in a small New Jersey town. Dabbling in some necrophilia on the side, Roscoe resorts to murder to drum up business for his shabby funeral home. His nephew Nicky (Patrick Askin) develops suspicions about the old man, and relays them to his college professor, Pam Hayes (Rebeca Yaron).<br><br>Although fairly brief at an 83 minute running time, \"The Undertaker\" can be pretty tedious. It's mildly amusing at best, but considering the fact that it was never really completed, that's at least some sort of accomplishment. Still, as written by William James Kennedy (who also plays a supporting role), it relies on padding a LOT. Public domain titles like Roger Cormans' \"The Terror\" and especially the Bela Lugosi vehicle \"The Corpse Vanishes\" are showcased ad nauseum, the latter presumably because it helps to inspire Roscoe. There are also extended sequences of sexy young ladies exercising, and one excruciatingly overlong period of Mandy (Susan Bachli) exploring Roscoes' lair.<br><br>Overall, this comes off like somebody's bad home movie, and it's just as crudely edited as one could expect. There's some partial female nudity to keep some audience members in their seats, but the gore is quite mild. The music isn't that great but it still manages to be somewhat catchy. Most of the supporting characters and performances are pretty insipid, with Spinell being the only real professional in this bunch. (One might assume that he did this as a favor to someone). The ending is particularly bad.<br><br>Devotees of Spinell will want to see this for completions' sake, but they'd better keep those expectations REALLY low.<br><br>Five out of 10. (Spinell increases the rating by a point.)","user":"Hey_Sweden","rank":[4,4]},{"title":"Spinell's last movie","rating":3,"date":"24 March 2006","review":"This is truly an example of bad horror at its worst, with bad writing and uneven editing. However as Joe Spinell's last film it is an interesting curiosity of a film and it has some good moments. Spinell is not at his best here and the acting overall isn't very good however Patrick Askin turns in a good performance as Spinell's nephew. The biggest problem with the film is the editing which results in some unintentionally comic moments in particular the big confrontation scene between Spinell and his nephew. The whole scene falls flat due to choppy editing. But for die-hard horror fans this film may be watched as an exercise in scary camp.","user":"pwaryan","rank":[6,7]}]