[{"title":"Transcends its flaws to earn a \"B\"","rating":8,"date":"21 February 2005","review":"After Lewis Thomas (Paul Walker) buys a car to pick up would-be girlfriend Venna (Leelee Sobieski) from college in Colorado, he learns that his brother, Fuller (Steve Zahn), was jailed on a misdemeanor charge in Salt Lake City. So he decides to pick up his brother first. During a pit stop, Fuller has a mechanic install a CB radio. They joke around with truckers, going so far as posing as a woman and setting up a false date with one. When the prank turns to tragedy, the trucker seeks revenge.<br><br>For the most part, Joy Ride is an enjoyable horror/thriller. It is loaded with tension and it's easy for viewers to picture themselves in the scenario, as it's relatively realistic. The horror is formed from everyday situations, where just a couple bad decisions can lead one into the sights of a madman.<br><br>However, I had to subtract two points for something I very rarely subtract points for--\"stupid decisions\" on the part of protagonists. Of course, some people think that horror films are primarily based on characters making stupid decisions, but in my view of the genre, even if such actions are clichéd, filmmakers generally justify such decisions at least in the context of the film. Too often in Joy Ride, writers Clay Tarver and J.J. Abrams, along with director John Dahl, make little attempt at justification. Why don't they just turn the CB off? Why don't they just ignore the villain? Why don't they call the police? Why don't they stay in places that are more populated (like the truckstop)? Why do they keep trusting the villain? While there are some cursory answers to a few of these questions, taken together, you keep wondering, \"In the film's world, how can someone so stupid be in college?\" <br><br>One possible answer is suggested by the Joy Ride DVD. It contains a 29-minute alternate ending that thankfully has a bit of commentary from both the director and the writer. The alternate ending is just is good as the theatrical version, in my opinion, and tries to put a slightly more logical spin on the film. Our heroes do end up at a police station, with some police cooperation. However, it was apparently felt that this alternate (actually the original) ending \"didn't work\" and \"didn't maintain tension\". Abrams felt that involving the police more directly in the plot removed too much of the focus from our heroes. Dahl also states that he thought there was too much character development in the original ending. I beg to differ on all of those points. Although the revised ending has many positive aspects not found in the original--especially a Rube Goldberg-like scenario involving maximum, immediate risk and creating maximum tension, the original ending may have worked better overall in my opinion.<br><br>But Joy Ride is good enough overall to transcend stupid decisions on the part of the characters. If seen as a sequence of high-tension scenarios, where logical plot connectors are only secondary to creating thrilling rides, Joy Ride almost deserves an A (a 9 in my rating system). There isn't a scenario in the film that's not smart and inventive in some way. The three principles--Walker, Zahn and Sobieski--give good performances, and the villain is masterfully done by Matthew Kimbrough (who provided the body), Ted Levine (who provided the bizarre, creepy voice), and Dahl, who wisely shows glimpses of him, but only glimpses. The villain is almost supernatural in his cleverness, strength and obsession. It's just too bad that we haven't had a sequel yet.","user":"BrandtSponseller","rank":[60,68]},{"title":"Scary Road Thriller Somewhat Reminiscent of \"The Hitcher\".","rating":8,"date":"15 February 2007","review":"\"Joy Ride\" is an extremely entertaining road-set horror/thriller that was surprisingly quite good. The film is about Lewis (Paul Walker), a college coed who decides to buy himself a car and take off across the desert to pick up a would-be-girlfriend, Venna (Leelee Sobieski) in Colorado for a road trip together. He then learns that his older troubled brother, Fuller (Steve Zahn) has been arrested in Salt Lake City, so he picks him up on the way. After having a CB radio installed into the car, the two take off to pick up Venna, but end up pulling a prank on an anonymous trucker who goes by the name of \"Rusty Nail\" (excellently voiced by Ted Levine) on the CB radio. After the trucker learns about the prank, he attacks the brothers with his large semi, but they manage to escape. But soon after they pick up Venna, the menacing truck driver begins harassing them again, seeking revenge for the joke they decided to play on him - he'll stop at nothing to get it, and he's looking for more than an apology.<br><br>Reminiscent of \"The Hitcher\" in quite a few ways, but also a much different film, \"Joy Ride\" was a surprise for me. I was expecting something along the lines of your typical teenage-horror fare, and I was pleasantly surprised with this intelligent and heart-pounding little thriller of a film. To start off, the story in itself is very nicely written and manages to avoid clichés. The characters in this film are smart, and the audience is rooting for them the entire way through. There are some excellently orchestrated thrill sequences, one of them being the really intense chase through the cornfield, among others, and these scenes are sure to get you on the edge of your seat.<br><br>Tension builds slowly during the first 40 minutes or so, and from there it just goes rampant. The cast is led by Paul Walker, who hasn't accomplished anything too amazing, but manages to lead the film well and play his character believably. Steve Zahn in his quirky and funny older brother, and plays the part suitably. Leelee Sobieski plays the intuitive girl-next-door friend who ends up along for the ride, and she also gives a worthy performance. The psycho-trucker villain of the film is very scary, never really seen - we get to know him through the frightening conversations on the CB radio, where he makes numerous threats and has many disturbing confrontations with the group of friends. Ted Levine, who played the notorious Buffalo Bill in \"The Silence of the Lambs\" voices the psychopath, and his voice itself is creepy enough, and adds to the villain's overall demeanor. The ending was excellent, and I loved how ominous it was. I really didn't see it coming, and it concluded on a very unnerving note.<br><br>Overall, \"Joy Ride\" is a superior action-filled horror/thriller that came as a big surprise to me. It was intelligent, tense, scary, and very well-written, which was nice because of my semi-low (no pun intended) expectations going into it. People who enjoyed \"The Hitcher\" will more than likely also enjoy this road trip from hell. Very well done and worth seeing for both horror and thriller fans alike. 8/10.","user":"drownnnsoda","rank":[39,46]},{"title":"A surprisingly engrossing and effective thriller. Not all that original but extremely entertaining.","rating":13,"date":"13 January 2003","review":"It would be very easy to overlook 'Roadkill' (the title 'Joy Ride' is known by here in Australia), especially considering the leads are mainly known for asinine teen movies. But dig a little deeper and you will see that it is directed by the underrated John Dahl, also responsible for the crackerjack thriller 'Red Rock West' a decade ago. Paul Walker ('The Skulls') is very effective as your average joe college kid, and Steve Zahn ('Out Of Sight') is even better as his smart ass older brother. Zahn is a talented comic often better than the movies he appears in, and he is in fine form here. The chemistry between the two is believable and amusing without becoming tired. Leelee Sobieski ('Eyes Wide Shut') has yet to make much of an impact on me, and there's very little to change that here. She is passable but little more than eye candy as Walker's potential love interest. The real star of the movie is the mysterious and frightening trucker Rusty Nail ('The Silence Of The Lambs' Ted Levine). Of course the whole scenario is hugely indebted to Spielberg's suspense classic 'Duel', but Dahl and co. manage to put a fresh and exiting spin on familiar material. 'Roadkill' won't change your life, but it is a genuinely exciting and effective thriller, a real rarity in Hollywood these days. Hitchcock it ain't but it's a very entertaining popcorn movie with plenty of thrills and twists. Recommended.","user":"Infofreak","rank":[54,66]}]