[{"title":"Costner and Russells' Revenge","rating":8,"date":"13 August 2001","review":"Scrolling through the 135+ comments, I'm amazed at how outraged so many viewers are at the \"excessive violence,\" \"explicit sex,\" \"foul language,\" etc., etc., etc.  C'mon.  A film is advertised as Elvises robbing a Las Vegas casino during an Elvis convention.  How much more lead in do you want? You expect, action, thrills and ... content?  Amazing.  Listen.  This is one of the funniest, outrageous films I've seen in a long time. Yes.  The story's incredible.  But, in any film, we have to consider the level at which we're willing to \"buy in.\"  I mean, some people were outraged at the farting scenes in Shrek.  Now, they're complaining because Russell and Costner-- especially the latter-- are too violent.  Well, let's go back a year or so when Russell and Costner both made Wyatt Earp films, playing the title roles.  From my view, both vehicles were ghastly but entertaining. So, I submit that what we have here is the COSTNER and RUSSELL Revenge vehicle.  Costner is always on the leafy edge, whether he's dancing with wolves, building baseball fields for ghosts or water-skiing as bait for sea monsters.  Russell, whose track record in shoot 'em-ups is no less than Stallone or Arnie, is likewise coming off some hound dog roles, such as being an automated soldier, a remake of his Escape from New York (LA?  Why'd anyone want to go there in the first place?) and the sci-fi Stargate.  Now, we get these two guys in a mindless, black comedy, full of S&amp;V-- the most since the cult film Thursday-- with quirky twists and turns.  Mindless violence? Yes.  Gratuitious sex? Yes.  Entertaining?  Yes-- but only if you don't take it too seriously.  I loved it.","user":"artzau","rank":[105,119]},{"title":"Crap but great crap","rating":7,"date":"8 March 2001","review":"Like True Romance, and Pulp Fiction this film is movie junk food that I love to eat.  Film purest will classify this film as crap, and so it is; but this is crap that the masses want and the movie elite hates.  For action films this is great, a few slow parts, and the action scene at the end got a little predictable, with the high kill counts, but rebounds with a great ending.  An old western show down, and being a road movie it gives the junk food escapism I love and need.  The acting is great, Costner plays such a great jerk in this film, his attitude makes the viewer dislike him, like a bad guys in wrestling.  Costner should keep playing bad guys. I believe this is his strong point.  Russell plays the hero or the not too bad bad guy. Russell character is the all American type he acts too the tee.  Stay at the end of this film for they have a bonus with the credits, an Elvis video and a funny out take from the film.   Taker easy, and give yourself a break and watch this film.","user":"mm-39","rank":[68,90]},{"title":"Excellent Action movie","rating":9,"date":"21 August 2001","review":"Blah, Blah, Blah.  Yes, there is a lot of violence and foul language in this movie.  If that is the sort of thing that offends you than don't see this movie.  If not, this was a great action movie.  I was really surprised because of negative reviews.  I wanted to see it in the movie theater, but couldn't find anyone else to go.  I regret now not seeing it at the theater. Costner was EXCELLENT as the bad guy.  Russell was good too.  And there was an excellent supporting cast.  You will see this movie and after you were done with it you will say this movie was different than I thought - guaranteed.  This is a perfect example of critics killing a great movie (it was the violence and language).  One of the best action movies I have ever seen.","user":"Zingbot_9000","rank":[35,49]}]