[{"title":"The first H.P. Lovecraft movie","rating":10,"date":"25 February 2002","review":"While it's not technically the *first* Lovecraft film, \"Dagon\" still has the honor of being the first actual adaption of one of his stories, rather than existing in the 'Lovecraft-inspired' genre.<br><br>I think I speak for everyone when I say that a good straight-forward Lovecraft film has been a long time coming. Sure, \"Re-Animator\" was a great quirky homage, but we've also suffered through more \"Unnammables\" and \"Lurking Fears\" than one can point a shotgun at!<br><br>Adapted from \"The Shadow Over Innsmouth,\" this film actually does justice to Lovecraft's rich universe. Die-hard fans will no doubt go nuts when they see that every bit of the 'Deep Ones' mythos has been preserved. \"Dagon\" also marks the first time Cthulu is ever mentioned in a film (unless you count \"Cthulu Mansion.\" Heh heh.)<br><br>While it doesn't contain the high production values needed to properly execute every aspect of Lovecraft, the film still looks damn good considering it's microscopic budget. This is the best looking Lovecraft film we're apt to see, as Hollywood won't touch this material with a ten-foot pole.<br><br>Sure, a few of the elements look cheap and the acting delivers its share of ham (does anyone understand a word Pablo Rabal is saying?!?!), but Stuart Gordon still succeeds in making \"Dagon\" an entertaining (and sometimes creepy) foray into one of history's greatest horror authors.","user":"akasch-2","rank":[95,124]},{"title":"Dagon: Everything a Lovecraft adaptation should be","rating":8,"date":"10 December 2018","review":"I love Lovecrafts work, I grew up with them and yes I'm fully aware that's probably not the best reading material for the young!<br><br>It's prime material for movie adaptations, but they always tend to be terrible. Sure there have been exceptions like Necronomicon (1993) and the Re-Animator franchise but for the most part they've been plain awful.<br><br>Dagon is a rare exception and is fantastic on near every level. Spanish made it tells the story of two couples of after a boating accident are forced to seek help at a nearby island which holds a horrific secret.<br><br>Cue the great visuals, strong performances and a near flawless story. I watched this immediatly upon release and have thankfully had the chance to watch it multiple times since then. It's a pure unadulterated horror nightmare which I think is highly underrated.<br><br>It looks Lovecraft, it feels Lovecraft, it IS Lovecraft.<br><br>The Good:<br><br>Looks great<br><br>Mostly loyal to the source material<br><br>Genuinely atmospheric<br><br>The Bad:<br><br>Could have done with being a tad longer<br><br>Things I Learnt From This Movie:<br><br>Proof! The problem is the filmmakers not the material<br><br>Movies are just better with tentacles","user":"Platypuschow","rank":[15,17]},{"title":"Dark Symbolist Nightmare","rating":10,"date":"14 January 2014","review":"*** Major Spoiler Alert ***<br><br>Stuart Gordon's Dagon is an intense and unique film based mostly on H.P. Lovecraft's The Shadow Over Innsmouth and his much shorter work entitled Dagon. This is really epic material in a strangely soaked Spanish environment. A Lovecraftian cult worshiping the underwater deity Dagon have taken over a small town on the Atlantic coast of Spain. A sailboat on pleasure cruise ends wrecked there. They will not be leaving anytime soon.<br><br>Now situationally this is a fairly obvious menu. Gordon does, at one point, dive off the gory edge, but this is a Stuart Gordon film after all. Meanwhile the chase through dripping dampness of the town is really a pulse quickener. What makes this work is the danker than dank waterlogged environment and the extraordinarily emotional relationship of Dagon's daughter played in a one of a kind performance by Spanish actress Macarena Gomez to our trapped nerd, played by Ezra Godden.<br><br>Macarena plays the part of tentacled siren princess with real fish-eyed believability. She was given instructions by Gordon (whose previous Lovecraft works include From Beyond and Re-Animator) to keep her eyes from blinking. When in the end Uxía (Gomez) craves Paul (Godden), whom she calls Pablo, she calls out to him with such an urgent imploring sad doomed yet loving tone in her voice she becomes perhaps the ultimate mermaid nightmare: Her eyes filled with wells of tearful salt water, her robes of gilded Symbolist splendor. She reveals the dark secrets of the unholy sect.<br><br>Uxía: Pablo, it is your destiny... We had different mothers, but the same father... We are children of Dagon. Your dreams. Remember your dreams, Pablo. They brought you here. Paul: No. They were nightmares. They weren't real. Uxía: Every dream is a wish. Paul: Somebody help me! What's happening to me? Uxía: You are my brother. You will be my lover - forever.<br><br>The tone Macarena hits here is the crescendo of the entire film, that sense of hopeless beauty and tragic certainty. I don't agree philosophically with the fatalism of that black romance, but who hasn't felt that temptation to give into it. And as Paul sets himself on fire and plunges into the sea Uxía follows. And together they descend into the depths of the tentacled God Dagon's realm. One feels the drowning, yet liberation. Yet we know to follow is to be annihilated.<br><br>I can't think of another film to present the darker aesthetics aspects of the antique Symbolist dream so vividly. For those with strong stomachs yet sensitive hearts I strongly recommend Dagon.","user":"gulag","rank":[11,12]}]