[{"title":"Revenge or Justice?","rating":9,"date":"2 March 2006","review":"I really didn't appreciate this film until the second viewing. Afterwards, I thought, \"Wow, that was really a satisfying, great film to watch.\" Satisfying, of course, to see the typical good guy-gets-revenge tale but also a film which provided some beautiful scenery and photography all the way through: a real treat for the eyes and must-see on a widescreen DVD.<br><br>I also put on the English subtitles on the second viewing in parts, which helped me understand a few things I missed on the first viewing and had made the film just a bit confusing in several parts. That was cleared up, and the rest was just enjoying the scenery and performances.<br><br>Most fun to watch was Richard Harris as \"Priest,\" the longtime prisoner who tutors young Jim Caviezel, the man (Edmond Dantes) unjustly imprisoned who exacts his revenge in the last hour of the movie. Yes, Harris' teaching stretched credibility as he seems to teach his pupil about everything there is know in life! Harris, too, had some of the best lines in the movie, several very profound statements. Ironic that he would be giving Caviezel - who two years later was playing Jesus in \"The Passion Of The Christ\" - sermons about believing in God! That's Hollywood! One film you're an atheist, the next you are God.<br><br>For those who might think the first 30-40 minutes of this movie are a bit slow, stay with it as the action picks up once Caviezel escapes from the prison. Shortly afterward, he is aided by the other character I found most fun to watch, played by Luis Gusman, who still sounds like he's more at home in the streets of New York but, once again, you suspend belief and just go along for the ride.<br><br>Strange how our human nature makes revenge so sweet when forgiveness is the right thing to do, but Hollywood has always capitalized on this human failing, making enjoyable films like this. To be fair, it isn't just revenge, as this film points out, it's \"justice\" we all like to see. In here, the two words are interchanged, depending upon ones rationalizations.","user":"ccthemovieman-1","rank":[133,155]},{"title":"Excellent!","rating":10,"date":"4 May 2003","review":"I hired this one on a whim, remembering that i had seen the trailer and had been vaguely intrigued.  I have to admit, having gone in with little expectation, i was flawed!  This was one of the better movies that i have seen in a long time.  Jim Caviezel's performance is slightly whiny to begin with, but in the context of the whole story, the reason therefore is appreciated and makes his transition and growth as a character that much more riveting to watch.  I absolutely loved him as Edmund Dantes then the dynamic Count of Monte Cristo and cannot have imagined a better choice.  He was definitely not bad on the eyes either.  Every scene had him looking more dashing and more handsome than the one before.<br><br>Guy Pierce surprised me with a performance that was totally believable.  His dry humour only made him more appealing, very well acted.<br><br>The entire epic, though long, never gives you the impression that you have been sitting still for ages.  It moves along swiftly and always had me gripped, from the action, suspense, and even to the humour that was evident from time to time.  The love story surprised me most of all.  Instead of taking on a highly sexual slant, as all these new films do, it was understated, the female lead doing an admirable job of portraying the wounded lover, who has always longed for her Edmund.  I loved the innocence that she managed to bring to the role, a really terrific actress and a really beautiful one as well.<br><br>Wonderfully scripted, exceptionally carried out!  This has to be the best adaptation yet!<br><br>An emphatic 10!","user":"sweetrupturedlight","rank":[112,136]},{"title":"The most underrated movie which is always ahead of all of my favorites","rating":10,"date":"24 September 2016","review":"One of the most underrated movies..<br><br>I can watch and re-watch millions of times without getting bored..<br><br>A non-stoppable excitement for the sequential events.. Adventure.. Life changing.. Drama.. Action.. Medieval.. Intelligence.. Love story.. Thriller.. Revenge.. and everything else you'd love to see in a single movie..<br><br>Perfect cast and performance.. soundtracks are well-picked for each scene.. I have no negative feedback on this movie.. I think it's worth the excellence.. I rated it 10/10.<br><br>It's always been in ahead of my list of favorites..<br><br>I wish people re-consider watching this again and give it the real deserved rating..","user":"mgh_root","rank":[11,11]}]