[{"title":"Better than expected, underrated!","rating":6,"date":"25 February 2003","review":"With the negative response from critics for this movie I was concerned that this would be rubbish, especially when it was released straight to video in my country (UK). As a Diesel fan I had high expectations for this film but was aware he had a supporting part.<br><br>However I was actually pleasantly surprised that the film was actually fairly enjoyable. The story is basic, about a mobsters son (Barry Pepper) who has grown up disparaged by the life of crime his family are involved in, but in his adults days he is unable to get the sort of legit career he wants, as a sports agent, because no-one will hire him for the simple reason that he is related to Dennis Hoppers character. Anyway he resigns himself to the fact that he can't go legit and that working for his dad is the way forward, but since his father only has enough faith in him to pick up his sandwiches, Matty is frustrated and begs his father to give him some more responsibility, he gets support here from his uncle Teddy played by John Malkovich. He gets his responsibility of course but things go awry, by fault of Matt's friend Marbles played by Seth Green. Half a million pounds has now gone missing in a small town, with some fairly clichéd hicks. Matty takes two of his friends over to assist Marbles in getting the money back, and on ensures a tale of deception and murder, with dirty cops, double dealing mobsters, and unwelcoming locals.<br><br>It's a fairly simple film that is nicely placed and very well acted. There are comical moments and some moments of character depth, particularly with central character Matty. There are really any surprises in this flick but it is on the most part entertaining. Barry Pepper is very good in the central role as is Vin Diesel as his best friend Taylor, who offers support and advice as well as muscle when it's needed. John Malkovich and Dennis Hopper are good in their small roles although they are cruising really but it is Tom Noonan who steals the show in a delightfully seedy role as the bent small town sheriff Decker.<br><br>All in all this is worth a rental, if you're a fan of Diesel like me you'll appreciate his performance in a role that has more depth to it than XXX. 6/10","user":"supertom-3","rank":[27,29]},{"title":"Mobsters sons wish for the freedom & glamorous lifestyle their fathers had.","rating":12,"date":"12 September 2004","review":"Loved this movie! It's the type of movie you'd want to see more than once; so much of the humor is so subtle that it's easily missed. Deals w/ the next generation of baby mobsters, &amp; how much has changed since \"back in the day\". Performances by Pepper, Davoli &amp; Green have a surprising depth; their characters are so immediately recognizable that it's almost scary. As a strong Diesel fan, I have no complaints at all about the Taylor Reese character. Diesel's moody acceptance of his position in life &amp; his lack of options, is gloomy, but believable. The strong point of the film is the loyalty &amp; love the characters have for each other. It gives a true nobility to characters who mainly live outside the law.<br><br>See it twice. No, three times!<br><br>rating: 8 out of 10 (Okay, I really mean 9!)","user":"becktribe","rank":[17,19]},{"title":"Nice movie. Worth watching.","rating":7,"date":"31 December 2002","review":"Almost all of my recent reviews have been very negative, but this movie is worth watching if you are a Vin Diesel fan.<br><br>Summary: Matty is the son of Benny, a mobster and he is as bad as they come. As a kid he is put to the test of killing someone, but fails, therefore his father keeps him away from the life of a mobster, but now as a grown up, Matty can't get a job anywhere due to his father's reputation, which gets on his last nerve. So he decides to talk to his father about letting him work for him. Benny puts him on a task, to collect some money in a bag and to come back with it. Doesn't sound so difficult. Matty meets up with his childhood friends, Scarpa, also a son of a gangster, but trying hard to concentrate on his restaurant, his cousin Marbles who has always been the screw up and Taylor, the guy that everyone brings in when they need to scare the heck out of someone. So Marbles has a plane, he gets the money, but in Montana he lands for gas, only there are 2 hillbilly cops there, that intimidate Marbles, as he feels they are on to him and during his panic he puts down the bag of money with other luggage that is being put on another plane. Only he is too late to retrieve the bag so he calls upon his friends to help find the missing bag, which didn't make it to the other plane...so who took the bag?<br><br>Seth Green plays the messed up Marbles, who wants responsibility, but doesn't know the meaning of the word. Vin Diesel was great in this movie as a tough guy Taylor, he played his part perfectly. John Malkovich was the ruthless right hand of Benny and he was great! As for the roles of Matty and Scarpa, they were ok. The plot was a little weak, but got better after the first 20 minutes or so. <br><br>I rate this movie 7/10.","user":"Streetwolf","rank":[7,7]}]