[{"title":"Exactly what I expected...","rating":7,"date":"1 June 2001","review":"Let me preface by saying I am a fan of Rob Schneider, and of Adam Sandler. I enjoyed Deuce Bigalow, and all (except for Big Daddy) of Adam Sandler's movies.  So I basically was expecting some (Ok, a lot) of low-brow humor, a decent plot to keep rolling through, and to laugh throughout the movie. This movie provided just that.  It wasn't the greatest comedy in the world, or a landmark motion picture, and it wasn't made to be that.  Colleen Haskell's skills at acting reminded me of when they put a \"famous\" non-actor on Saturday Night Live, and don't give them too much to do in the skits. She's only in the movie probably a total of 15 minutes, but does what they ask of her, and does a decent job of it.  The movie is a hoot, and doesn't actually stoop to every joke being a f**t joke.  I laughed about every 3-4 minutes, and enjoyed the ending as well.  If you're expecting something similar to Deuce Bigalow, you won't be disappointed.","user":"MMartian","rank":[38,48]},{"title":"I Have To Admit: This Is Pretty Funny","rating":8,"date":"15 February 2007","review":"This was just plain funny and very entertaining throughout the goofy 83 minutes. Crude? Yes, at times, but what modern-day comedy isn't lately? The PG-13 rating is a joke. With all the sexual stuff in here, \"R\" is more appropriate.<br><br>Some of that sleazy stuff, to be honest, was pretty funny, though and there isn't much profanity. <br><br>Rob Schneider, as \"Marvin,\" lays his goofy Deuce Bigelow-type character on us, trying to get the pretty girl \"Rianna\" (Colleen Haskell). <br><br>I really thought this would be a stupid film but Schneider's animal imitations are hilarious and, overall, this a very fast-moving, silly-but-lots of laughs film.","user":"ccthemovieman-1","rank":[29,36]},{"title":"Pure Awesomeness","rating":8,"date":"27 January 2003","review":"Rob Schneider cracks me up. This movie is absolutely one hour and 20 minutes of pure awesomeness. Not making the movie long is great. The guy from office space is so funny. Everything about the animals is hilarious too. This movie is one of my top 5 comedies. I love any body from SNL. This is just another classic. Rob Schneider is absolutely one of the best comedians out there.","user":"davishasrisen","rank":[6,6]}]