[{"title":"stunning performances","rating":10,"date":"1 July 2002","review":"A Truly wonderful film that left you thinking and feeling for hours after walking out of the cinema.<br><br>Michelle Pfeiffer is exact in her portrayal of the smart, rich, no-nonsense lawyer who realises how empty her luxurious and successful life is. As always she delivers an outstanding performance and reminds us of just how excellent and beautiful an actress she is.<br><br>Sean Penn is so believable that you forget that he doesn't actually have anything wrong with him...he captures every emotion perfectly and instills all of that emotion in the audience. Penn is highly under rated in the world that is movies, as he shows with this Oscar potential performance.<br><br>The young actress who plays his daughter is amazingly mature in her acting, whilst always managing to capture the innocence of her youthfullness. On top of all that she is gorgeous. The combination of three excellent main actors combined with the supporting actors and the genuine theme and style of the film makes I am Sam an excellent and must see film. Truly Inspiring.","user":"alphabettysoup","rank":[183,210]},{"title":"One of my favourite movie","rating":9,"date":"24 February 2020","review":"This film goes to show you that often critics lose their humanity and writhe in puddles of their own egotistical nonsense. This is a great film with a brilliant performance by Sean Penn (who broke the rules and went full retard). I wouldn't put it up there with Rain Man, but this is still a great film. Michelle Pfeiffer wishes every film she was in was like this, and Dakota Fanning is cute enough to get away with playing the same role she played in every film she did as a child: the little girl who's too smart for her own good.","user":"MR_Heraclius","rank":[38,41]},{"title":"Great film, but hard to watch at times","rating":28,"date":"28 August 2002","review":"I Am Sam is a great movie that deals with marginalized people in our society and how they're treated. It's a very realistic portrayal. I watched it with my 13 year old daughter and it alternately made us cry, got us angry and caused us to laugh uncontrollably.<br><br>Sam is loved and respected by those who know him (Starbuck's patrons, IHOP Waitress, friends), taunted by those who have no regard for anyone different (Lucy's arrogant classmate and his equally arrogant father) and generally misunderstood by everyone else.<br><br>I especially liked the irony of the lawyer, who is an emotional train wreck, yet because she's an adult intellecutally, no one questions her ability as a parent. Sam on the other hand loves his daughter and it shows.<br><br>This movie is not for anyone looking for a \"fun weekend rent\". If you rent this, be prepared to have your values and your emotions challenged.","user":"Amy723","rank":[111,128]}]