[{"title":"Underestimated masterpiece by Costa-Gavras","rating":9,"date":"31 May 2005","review":"I was very surprised by reading so many bad comments about 'Amen.'. This is a breathtaking movie about a German officer who realises what they are actually doing to the Jews and who afterwards tries everything to prevent this murdering. Ulrich Tukur gives one hell of a performance. You really see this man suffering under the killings he cannot prevent.<br><br>Another perfect performance is given by the priest who tries to help the German officer. Mathieu Kassovitz (who also played the male leading role in 'Le Fabuleux destin d'Amélie Poulain')is very convincing in his role.<br><br>I think this movie is highly underrated. Costa-Gavras has made an important movie with 'Amen.' which looks at the holocaust-tragedy from another point of view which is seldom showed. The movie gives a true although unbelievable answer at one of the most important questions concerning the holocaust: didn't anyone saw this coming? Couldn't anyone prevent this from happening? <br><br>If you really want to know the answers to this questions, you certainly have to watch 'Amen.'. This movie should at least have an 8 and I'll give you two reasons why: one because the story is unique and magnificently told; and two because the two leading actors are giving the performance of a lifetime. Highly recommendable! <br><br>9/10","user":"Travis_Bickle01","rank":[90,109]},{"title":"Gavras film is an excellent depiction from a unique point of view","rating":14,"date":"14 November 2002","review":"I think I am the first person from the USA to comment on this film.  We saw it as part of the Pittsburgh Filmmakers festival.  There were only maybe 50 people at the screening we attended, and there were only two screenings. This is so unfortunate.<br><br>This is an excellent film, and exemplifies, I think, the role of the arts in raising society's level of conscience and effecting social change.   It galls me that a mind set is growing, (sixty years later) that refutes the occurrence of the holocaust. All the pictures, names and movie footage in the world will never change these people's minds; convincing them is not the issue.  But when you take on the large institutions of society, when you make them accountable and demand that they fess up to their inadequacies, and that they not allow it to happen again, then you get the kind of permanent, positive change that is not eroded by a capricious shift in the political winds.<br><br>The amazing thing about this film was the powerful effect it achieved with very little, if any, shocking footage.  We are conditioned to look away from all the \"standard\" holocaust images - the drawn faces, the gaunt skeletons, the bones in the ovens, the piles of shoes and personal effects. Instead, Gavras uses Gerstein's involvement with the engineering side of the issue, and paints a chilling picture of the magnitude of the killings.  The project management meetings where they discuss the efficiency improvement strategies for gassing people and cleaning out the chambers are eerily similar to meetings I and many other Dilbert-types attend on a regular basis.  The final scene at the camp where all the SS facilities officers chorus their concerns over decreased KILLING efficiency is ridiculously chilling. These guys could be whining about their bottom line numbers at a board meeting for any major corporation.<br><br>Gavras hammers home the numbers with the repeated scenes of empty trains going and full trains coming - and you never see a person in the full ones, only closed doors.  Think about the numbers.  A million people a year is nearly three thousand a day. Instead of making his point with stark images, the way so many other films have, Gavras keeps hammering the shear logistics, the size of the camps, the amounts of the gas needed, the HUGE numbers of people that had to be transported. Think of how big a train with a thousand people is - that's over three times the capacity of the biggest airliners.  Gerstein's confrontation with his old friend, the transportation officer, points out how people could vilify certain nazis (SS and Gestapo), and yet remain conveniently ignorant of their own complicity.<br><br>The Vatican issued a watered down apology in 1998, admitting partial culpability and asking forgiveness.  There are still many who believe that the diplomatic tightrope the Vatican walked was the best course.  The conversation between Cardinal Maglione and the German ambassador is accurately taken directly from the Vatican archives.  But Gavras makes a valid case that the arguments against outing the German killing machine were weak. That other protests had yielded positive results (look up the 1943 Rosenstrasse uprising) and that the motivations for not acting more decisively were based in part on anti-Semitism, along with diplomatic prudence.<br><br>Gavras trys to show that many people who could have acted knew all the facts and chose not to act.  I remember, around the time Gavras' released \"Z\", how the protesters at the 1968 democratic national convention chanted \"THE WHOLE WORLD IS WATCHING. THE WHOLE WORLD IS WATCHING!\"   It didn't matter then, and Gavras makes the case that it didn't matter during the holocaust; the political powers of the world move at their own pace.<br><br>Now, sixty years later, we have the last of the actual participants dying off.  WWII veterans here in the USA are dying at a rate of 1500 a day, and their ranks are dwindling.  There are fewer and fewer left to tell the story or be held accountable.  It is incumbent on us, however, to uncover the cover-ups, identify the systems or methods that allowed such atrocities to happen, and make the changes in our society's structure to ensure they don't happen again.  Gavras' film effectively does this. Like the principals in the film, we now know the real story.  Like the principals in the film, how we act with this knowledge will be judged by future generations.","user":"rd350c","rank":[92,113]},{"title":"Painful, Questioned, Controversial History as Art","rating":7,"date":"31 January 2003","review":"\"Amen,\" a film based on the largely accurate account of German SS officer Kurt Gerstein's multiple attempts to alert the Vatican to the ongoing highly efficient mass slaughter of Jews and others - for which he bore no small responsibility as a technician facilitating efficient genocide - is well done with excellent acting.  Yet in the end Costa-Gravas's film is somewhat unsatisfying and not sufficiently responsive to the viewer's need to know what Gerstein was all about.  Why?<br><br>\"Amen\" begins with the Nazi euthanasia program aimed at murdering retarded and mentally ill Germans.  A campaign, spearheaded by both Protestant and Catholic clerics and their flocks, forced the regime to end the killings. Some have argued that this sole widespread public rejection of Nazi homicidal machinations might well have been repeated if Germans were alerted - internally or through specific denunciations by the pope and foreign leaders - of the fate of deported Jews and those rounded up in conquered territories.  \"Amen's\" Kurt Gerstein and his priest friend both believe that would have happened.<br><br>That argument is at best questionable and, more likely, reflects the human need for the wish to spawn the thought.  Whether one accepts the Goldenhagen thesis of mass complicity by Germans in the Holocaust, the fact remains that when the slaughter began Germany was at war and, as a character in \"Amen\" notes, defending the Reich and winning the war, to say nothing of staying clear of what would be seen as treasonous ideas, was the only realistic option.<br><br>Kurt Gerstein is a mystery.  As Hannah Arendt wrote of Eichmann as an example of evil's often banal incarnation, historian Saul Friedlander described Gerstein years ago in terms of the ambiguity of good.  Gerstein sincerely and at risk to his life tried to warn the Vatican of the Nazi death camps.  But he also worked efficiently to make those camps operationally efficient.  \"Amen's\" Gerstein is tortured but also highly compartmentalized.  He gives quick and accurate advice to improve destruction of the \"units,\" as the Jews were referred to, and then tries to prevent use of the Zyklon B gas he helped develop with almost unbelievable declarations that shipments are defective and must be buried.<br><br>This film owes its origin not so much to Friedlander's compelling account but to Rolf Hochhuth's controversial (still so after many years) \"The Deputy,\" presented as a play to the outrage of many.  Hochhuth portrayed Pope Pius XII as insensitive and unwilling to use his moral authority to challenge an extermination program he knew to be in progress.<br><br>In the film Gerstein is aided by a young Jesuit priest whose remarkable moral and physical courage was demonstrated by a few, or perhaps too few, clerics who knew what was happening.  The pope is shown as a remote, unemotional figure.  The now standard explanations for the Vatican's unwillingness to take on the Nazis are included in catalogue format.  Allied unwillingness to bomb the death camps or take in refugee Jews are recited almost for the record.  Complex questions still debated are reduced to the equivalent of sound bites. They need no repeating here.<br><br>Hochhuth's thesis which outraged many decades ago and which still brings angry denunciations has been partially rehabilitated by scholarly works such as John Cornwell's provocatively titled study, \"Hitler's Pope,\" an exaggeration which belies the serious research and analysis within the book's covers.<br><br>Cornwell's pope is personally unpleasant, haughtily autocratic, rabidly fearful of Communism, at least mildly anti-Semitic and certainly emotionally and politically pro-German if not pro-Hitler (he wasn't that).  The Pope Pius of \"Amen\" lacks the depth a more accurate and compelling portrayal would have provided.<br><br>The strongest moments in the film are those briefly showing the efficiency of the death camps focusing less on the victims, most of whom aren't shown, but rather on the chillingly competent technicians and logisticians without whose efforts millions could not have been murdered.<br><br>Director Costa-Gravas deserves much credit for bringing a difficult to tell complex story to the screen.  Ultimately, however, we know less about Kurt Gerstein than we need to and the Vatican, from pope to bureaucrat, is too colorless.  Was Gerstein a victim or a collaborator with a schizophrenic sense of morality?  Even scholar Friedlander couldn't answer that question. Did the Vicar of Christ shame his church's vision of Jesus by putting political expediency ahead of moral imperative?  That is a very alive issue today but \"Amen\" gives us a largely one-dimensional Supreme Pontiff.<br><br>The cast is unknown to American viewers but all act with varying but generally strong ability.  Gerstein and the Jesuit priest are especially well portrayed as men of deep conviction.<br><br>7/10","user":"lawprof","rank":[53,72]}]