[{"title":"\"A brilliant teenage comedy\"","rating":6,"date":"12 January 2005","review":"'A Fate Totally Worse Than Death' is quite a provocative title. In my country this film is called 'Bad Girls From Valley High' which I think was made to hide what sort of film this really is. <br><br>This film is about three teenage school girls named Danielle, Tiffany and Brooke who are each the closest of friends. They are also vain, selfish and quite mean. They will do anything to get what they want especially Danielle who only has eyes for fellow student Drew and she will eliminate any other girl who becomes attracted to Drew. <br><br>Well now these mean and selfish young girls are about to suffer their worst nightmare. Someone has placed a curse on them, and the curse is rapid aging. Their hair turns grey, their skin goes wrinkly, and they become weaker and weaker. So these beautiful teenage girls change into ugly elderly women within a matter of days. They are literally rotting! For such beautiful girls this is a fate far worse than death! <br><br>This film had good performances by all the actors. I really liked the high school teacher in this film who is played by Christopher Loyyd a comedian who is best known for his role as Dr Emmet Brown in the 'Back To The Future' films. This film is based on a novel by Paul Fleischman who writes funny novels for teenagers and if his books are this good I might consider reading them. So I recommend this film for anyone who likes comedies about teenage girls.","user":"simon-trek","rank":[20,28]},{"title":"Mildly entertaining","rating":6,"date":"8 March 2009","review":"I watched this movie circa 2005/2006 and didn't think I wasted my money on the rental... it was enjoyable.<br><br>Do not take it too seriously. It was filmed just off the mark from the 90s/00s boundary in 2000 (which is why it gives off that 90s vibe) and apparently ran into financial difficulties during post production and thus did not get released to the general public until 2005.<br><br>It's a typical high school teen comedy flick except with a supernatural / curse theme. The movie is pretty mundane in its use of the \"bitch girl\" clichés but if you are seriously just looking for a way to kill some time and the chick flick genre is your penchant... this movie isn't half bad.","user":"Xarabe","rank":[14,23]},{"title":"Shamefully Good...Almost","rating":5,"date":"10 January 2006","review":"Having two actresses that I think are really good - Monica Keena (\"Dawsons Creek\", \"Freddy vs. Jason\") and Nicole Bilderbeck (\"Clueless\" and \"Bring It On\") intrigued me to watch this film - plus it seemed in the style of the fantastic \"Mean Girls\". Instead, the film was a bit of a let down, though it had some good moments. Julie Benz gets most of the screen time, and she is pretty decent, while Monica Keena and Nicole Bilderbeck are good, this is not their best work.<br><br>The rest of the cast didn't fare much better. Suzanna Urszulay was uninteresting as the new girl, Jonathan Brandis (R.I.P) was nice to look at, but rather bland, and Chris D'Elia was only funny until he became annoying. Janet Leigh (R.I.P), gives, as usual, a terrific performance in her small role, though I wonder what she was thinking when she signed up for it. Christopher Lloyd is funny as the school teacher.<br><br>The film seems to try a bit hard in places, and fails. It also seems of poor quality, for example, when the three girls are in the school, there isn't the usual back ground noise you would expect, and it is very noticeable. There are far worse films that one could watch, but there are far better ones also. Only the actors redeem this film.","user":"boyinflares","rank":[17,30]}]