[{"title":"future classic","rating":24,"date":"24 February 2004","review":"One of the funniest movies I've seen in a long time.  I haven't seen a funnier first 10 minutes of a movie since SOUTH PARK -- the gags are puerile and stupid, yes, but they are also refreshingly original.  No fair comparing this to POLICE ACADEMY -- the characters in that dreadful series of movies were all alien morons and hardly recognizable as human beings.  These characters are smart and fully fleshed out -- these are the kind of guys who remind you of your friends.  This movie should be an inspiration to both aspiring film-makers and to the big studios -- you don't need a $20 million actor and twenty-five different writers and a ridiculously contrived concept to make a successful comedy.  If I were running a big studio, I'd sign Broken Lizard up to do 10 more movies at the $5-$10 million range, let them hit their stride and develop a following, and cash in on the DVD sales. And let's face it -- none of these guys are leading men, none of them would ever have had a career in Hollywood on their own, but together, they're funnier than those lames on SNL.","user":"tallandthin","rank":[125,146]},{"title":"One of the best comedies ever.","rating":10,"date":"16 July 2005","review":"Not many movies keep on getting better and better as you watch them for the 5th, 6th or 7th time, especially comedies. The first time I saw this movie in the Cinema it didn't blow me away, and most people I know who have seen this movie only once do not rate it very highly. After seeing it a few times I rate this movie as high as Fletch and other classic comedies, probably higher.<br><br>There is so many worthwhile jokes that I think it must have taken quite a while to write - if you don't have a similar sense of humour you would probably think they had written it all in one night which clearly wasn't the case. There is not a lot to complain about with respect to the acting either - their style suits the movie perfectly.<br><br>Remember that it is a comedy first and foremost - if you are looking for an clever story you have the wrong genre. Criticism of the movie being a series of sketches or jokes is really irrelevant - one look at the cover or preview tells you exactly what kind of movie it is. Regardless, there is nothing wrong with the plot and if you appreciate/comprehend the jokes the movie flows just fine.<br><br>If you are going to watch it, watch it 2 or 3 times.","user":"blairjones78","rank":[135,171]},{"title":"Realistic Comedy Classic","rating":10,"date":"20 June 2006","review":"This movie was hysterical! The way they joked around with each other was so true to life! It wasn't unrealistic at all! Anybody who sees this will have to agree that there is at least one character in the film that reminds them of one of their buddies! I know it sure reminded me of the guys that hang around me! We just saw the movie this evening on IFC in widescreen, without commercials, and unedited. I am very happy I waited to see it this way instead of a TNT, TBS, USA, or FOX broadcast version. I am definitely getting this movie on DVD as soon as possible! The outtakes and behind the scenes features are probably fantastic!","user":"King-of-Boops","rank":[56,71]}]