[{"title":"Not a bad movie actually","rating":7,"date":"27 June 2010","review":"I am a little stumped at the low rating, this movie is not that bad. It is no masterpiece in any shape and form, and I have certainly seen better films, but I have also seen worse. Also it is entertaining enough and has cute moments too. I do agree the story is predictable and nothing special, the script has its weak spots and the pacing is uneven being a little too draggy in the middle. But there is a lot to redeem it, namely the amazing scenery captured by the lovely cinematography. The soundtrack was a nice touch too, the direction is good and the acting is actually above decent. Cuba Gooding Jnr is a likable enough lead and James Coburn the great actor he was matches him wonderfully. The really cute snow dogs steal the show though, it could be said they are the film. Overall, definitely not a bad movie, exceptional no, entertaining yes. 7/10 Bethany Cox","user":"TheLittleSongbird","rank":[16,16]},{"title":"Great family film","rating":8,"date":"12 May 2005","review":"If you like dogs, if you like an adventure, you'll probably enjoy this film. Even a bit of a tear-jerker as Cuba Gooding goes to save his long-lost father! The love interest is attractive. The dogs are cute. Even the border-collie is great! My 4 yo loves the movie. We re-enact the \"Demon, save me!\" scene often. Demon is the name of the lead dog. Comical slapstick mishaps run throughout the film as Ted (Cuba) is constantly being chased by dogs, dragged through the snow, slides down hills, and suffers mild injuries. None of these are excessive, however, a few crude remarks, some adult dialogue and a suggestive image, are not appropriate for very young children. But reasonably acceptable for children age 6 and up.","user":"kmwhite_1999","rank":[35,46]},{"title":"I liked this movie because it was fun and entertaining.","rating":10,"date":"1 January 2006","review":"I watched this movie on one of the big networks last night, and ran across it purely by accident. Since I didn't even know the title, I had to look it up on IMDb. So, I read the other comments and decided to add my own. Sure, it was a predictable plot, but what isn't? Almost no story idea is new these days, just modified, re-packaged, and directed differently. There's still a lot to enjoy! I have to say, Cuba Gooding, Jr. was perfectly cast in his role as Dr. Ted Brooks because he's so well suited to slapstick and not just serious dramatic roles (which he excels at). I really enjoyed the way his character handled surprise situations. Being a Miami dentist and suddenly finding yourself across the continent in a completely different culture, especially in wilderness Alaska, can lead to some hilarious situations, and this movie went there. The dogs were funny (enhanced with some computer graphic features to occasionally make them humanized), and the dream sequence was good too. I also enjoyed James Coburn, who's tough guy image was perfect in this comedy role. Plus it was great to see Uhuru from Star Trek cast as Mrs. Brooks. Whatever others might say, that this movie is great for kids but dumb for adults, is just not true. As a well-educated adult, I still found it fresh and fun. For those commenter's who thought the movie was silly for just for kids: I guess some people just don't know how to have good clean fun!!","user":"lalusk2002","rank":[28,36]}]