[{"title":"Beautiful.","rating":9,"date":"31 October 2005","review":"Though it doesn't hold up to the wonderful original Balto, this is one of the very few animated film sequels that didn't totally make me gag. The storyline is completely different (thankfully not going the 'Oh, no! Another epidemic!' route one would expect) and the entire movie takes a Native American twist, focusing less of dog-sleds and more on the Wolf roots of both Balto and his daughter, Aleu. The songs are touching and beautiful, my favorites being \"Taking You Home\" and \"Who You Really Are\". \"Taking You Home\" is probably the only song I've ever heard from an animated film that has ever made me cry- and it take a lot to make me cry.<br><br>This film, combined with the original Balto film, would be a wonderful little gift pack for anyone who's a fan.","user":"ginger_sling","rank":[15,17]},{"title":"`Balto II' An Enjoyable Wolf Quest","rating":21,"date":"21 February 2002","review":"What with the popularity of their numerous direct-to-video sequels to The Land Before Time and An American Tail, it's not surprising that Universal's latest video offering is a sequel to their 1995 Balto.  The original is based on the true story of a dog who, facing unbelievable dangers, brought medicine to those of Nome, Alaska when many children were suffering a life-threatening sickness.  This one finds Balto father to some adorable pups, all of whom are adopted by a human eight weeks after birth  except Aleu, who looks more like a wolf then her half-wolf father. When a hunter mistakes her for one, Balto reveals the truth about her mixed heritage, and she runs  with Dad hot on her trail, thanks to a mysterious raven from a reoccurring nightmare.  The result is an enjoyable Wolf Quest, which surprisingly doesn't do harm to the original.  While the animation here isn't top-notch  more Cartoon Network-ish -- that's to be expected from a direct-to-video sequel.  Indeed, the film's main fault is being a musical  featuring a singing rat  something the first movie never was designed to be.  The songs are good, and fit well, but longtime fans of the original might be a bit disappointed.  On a nicer note, the villains from within the wolf pack pleasantly resemble Steele and his gang of bully dogs from the first movie, and the bear sequence would have been just as brilliant as the one in the original if not for the cheesy `inner knowing' ending to the scene.  By far not as good as the first, but a wonderful movie nonetheless, and one I'll definitely watch again.  ***** (5/5).","user":"funjokerjake","rank":[11,13]},{"title":"Rough, but with lots of heart.","rating":7,"date":"16 February 2002","review":"I felt this film was kinda like Balto himself--a bit rough around the edges, but with a heart of gold underneath. I didn't care for Boris, Mu(c)k and Lu(c)k this time around, but Maurice LaMarche, Lacey Chabert and Mark Hamill were good as Balto, Aleu and Niju. However, the BEST piece of casting was David Carradine as Nava...he was WONDERFUL. The songs were generally well-done, and \"Taking You Home\" was beautiful. I really thought the ending of the movie was well-done: hopeful and leaving you with a satisfying feeling without being a traditional \"happy ending.\" <br><br>So I have to say I still like the original a bit more, but this film was by no means a failure.","user":"Figaro-8","rank":[10,12]}]