[{"title":"This is a must see! A haunting and thought provoking tale - with some excellent acting thrown in the mix!","rating":9,"date":"14 December 2004","review":"I had to see this gem twice to really appreciate all of it. When a widowed father of two interrupts his two sons' sleep with a shocking revelation, they are torn between believing him and not. As the horrifying events of this tale unfold, we learn a lot about the father, about his two sons, and about their destinies. With shocking twist after shocking twist, this film never allows for a lull in the plot. Bill Paxton plays the father, but the most notable performances are that of his older son, Fenton, played by Matthew O'Leary and his younger son, Adam, played by Jeremy Sumpter. This is one of the best thrillers that I have seen in a while, and you will want to watch this a few times to appreciate every intricate aspect of the plot. I give this film a 9/10.","user":"FentonMeiks","rank":[161,201]},{"title":"A very disturbing movie","rating":9,"date":"31 August 2004","review":"This is a very dark and intriguing horror type thriller based on the idea of religious murders. The storyline centres on a deranged man who lives in Texas, US who suddenly goes on a killing spree with his two young sons after being instructed by God to redeem the world of bad people.<br><br>Bill Paxton who directs this movie plays the deranged Father who is known as the Hand of God Killer while Matthew McConaughey plays his finest performances to date as the oldest son, Fenton Meiks. The film revolves around Fenton who decides he can no longer hold the burden of his murderous childhood alone and uses flashbacks to hauntingly tell the story to FBI Agent Wesley Doyle (played by Powers Boothe).<br><br>I cannot think of many movies that literally keep the viewer chained to their seat from start to finish and this is definitely one of them. Even if you want to stop watching, you wont be able to because of the sheer power of this movie.<br><br>The directors have filmed this movie very well, and they help to set the plot through the good scenery. The acting in this movie is great but if there is any drawback it is that some parts are very powerful and may disturb some people.<br><br>Whilst the concept of this film is very dark, the young children help to portray the idea through brilliant acting. This really is a spine tingly movie and it is guaranteed to have you at the edge of your seat throughout. I would highly recommend this movie to anyone who enjoys horror, disturbing and powerful movies or anyone who just wants to see something different.<br><br>8/10","user":"jameslamont","rank":[142,180]},{"title":"An excellent horror/thriller","rating":9,"date":"11 March 2005","review":"Bill Paxton stars in and directs this highly original film. Having watched the first time I was by how good it was. The reviews I had heard were OK . As a result I was expecting an average thriller at most .However because of Paxtons excellent directing and acting the film is well worth watching , especially if you are a horror film fanatic.The film is also helped by the plot twists which keep coming until the closing credits . The films strongest point is the storyline which I have to say is highly original and is like I have ever seen before. Well done also to the 2 young leads which perfectly convey the emotions if these confused boys. I give this film 9/10 and I highly recommend that everyone catches it.","user":"skcollob","rank":[95,125]}]