[{"title":"Loved this sequel! Amazing work by everybody","rating":8,"date":"20 February 2020","review":"The Mummy Returns is a film that, I think, you need to see the first film of the saga because otherwise you don't understand some little details. That film is a film like Indiana Jones with the same plot and the same characters. But the kid is an exception. The cinema show us the kids like boys and girls insufferable, but Alex O'Conell is a boy that \"pass more time in the museum that in house\". One difference this film have respect Indiana Jone's films are the sobrenatural characters than appears like The Scorpión King or Imhotep. If you like Indiana Jones and Egyptian mithology, I recomend you that film","user":"MR_Heraclius","rank":[35,36]},{"title":"Non-stop action","rating":7,"date":"14 June 2010","review":"The success of \"The Mummy\" in 1999 surprised everyone, and on the day that it opened, Universal Studios greenlit another sequel. The original (the 1999 one) was a lot of fun because it mixed creepy scares with awesome action and goofy humor. The sequel does more or less the same thing, except that the action sequences come pretty much one after another from beginning to end.<br><br>Rick (Brendan Fraser) has married his love from the first film, Evelyn (Rachel Weisz), and the have a son, Alex (Freddy Boath). After finding the bracelet of the mythical Scorpion King, they're attacked by villains who are intent on raising Imhotep from the dead (again) so he can kill the Scorpion King and take over the world. Of course, it's up to Rick and Evelyn to stop them.<br><br>All the characters from the first film in the franchise are back, and they slide into their parts easily. Arnold Vosloo gets to do more with his character, and Patricia Velasquez (who has about 10 times as much screen time as she did in the first film) has a lot of fun acting like Jennifer Lopez's alter-ego. There are a few new characters as well, including young Freddie Boath, who is excellent as Alex. His screen appeal rivals Macauley Culkin at his best. Shaun Parkes is a much better source of comic relief than Kevin J. O'Connor (he's consistently funny, and the dialogue between him and Rick or Jonathan is hilarious). Adewale Akinnuoye-Agbaje is suitably creepy as a new villain and Alun Armstrong is suitably kooky as the ringleader.<br><br>Stephen Sommers knows how to create an action movie. He creates real characters, not actors who are given different names, and sends them into action scene after action scene. It's a fun and exciting flick, and that's all it tries to be.","user":"moviesleuth2","rank":[23,25]},{"title":"Better than some would make out...","rating":21,"date":"21 May 2001","review":"When The Mummy hit theatres in 1999, critics everywhere panned it as being a poor man's Indiana Jones. While the two movies are about as similar as Dr. No is to GoldenEye (thankfully), I suppose comparisons between one non-stop adventure film and other are inevitable. In the end, what really counts when determining a film's quality is the level to which it can entertain. And if there is one thing The Mummy did well, it was entertain. Brendan Fraser, Rachel Weisz, and Arnold Vosloo were very well chosen for their roles.<br><br>The Mummy Returns is easy to see as being another sequel churned out to satiate the greedy money-machine that Hollywood has become, but it has a few things working for it. One thing that is immediately obvious is that the sequel was very much intended to be a film that could be enjoyed without ever having seen the original. The only references to the previous film are done to fill in the narrative gaps about who Imhotep is, and why he is the way he is. The addition of The Scorpion King was an interesting effort to give the film a new antagonist, but the lack of screentime didn't work well in this tangent's favour. Another tangent that could have been better developed was the rivalry between Imhotep's girlfriend and whatever her name was. Imhotep originally mistook Rachel Weisz's character for being his girlfriend reincarnated, so the use of a woman who looks exactly like her while creating this new tangent needed to be developed differently.<br><br>Most people won't give a damn about complex story tangents and will want to know if this film is entertaining. And it is entertaining, alright. There is barely a dull moment in the film's substantial running length, and Oded Fehr does a bang-up job of providing a Mad-Max-cum-Indiana-Jones hero. I want to know where they get those groovy costumes and tattoos from, they look quite nice. Anyway, when all is said and done, this is an eight out of ten film. A few badly constructed story details here and there, but some extremely entertaining action sequences make up for them. Don't listen to the nay-sayers. This is matinee-style material at its (almost) best. Get the DVD when it comes out, it will at least tide you over until George Lucas gets his head out of his proverbial and realises that the VHS era is well and truly over.","user":"mentalcritic","rank":[73,87]}]