[{"title":"Terrific Entertainment!","rating":30,"date":"30 January 2003","review":"Gangs of New York is just perfect entertainment. It is an enthralling, bloody, melodramatic epic that more than justifies its two and one half hour running time. In Gangs director Martin Scorsese spins another tale of the New York underworld but with a twist. Instead of the mid-twentieth century organized crime milieu of Goodfellas, Scorsese ventures back to the 19th century to show us the origin of the modern street gang.<br><br> It's the early 1860s and the notorious Five Points slum is ruled by the savage `Bill the Butcher'. The viciously nationalistic Bill terrorizes all the immigrant masses jammed into his slum but seems to harbor a particular hatred for the Irish population. Into this seething cauldron wanders mysterious young Amsterdam Vallon who soon works his way into the trust and affection of Bloody Bill. Amsterdam, however, has a past with the unsuspecting Butcher and sports an agenda not unlike a certain Prince of Denmark. Bloody vengeance and dark betrayal soon come to pass, all played against a backdrop of corruption and unrest that lead to up to the horrors of New York Civil War draft riots.<br><br> Daniel Day-Lewis is marvelous as Bill the Butcher. His Bill is both recognizably human and a full bore, moustache-twirling villain. Day-Lewis strides his savage and profane way across the screen and steals the whole of the movie. The only other actor to approach Day-Lewis' level is Jim Broadbent as William 'Boss' Tweed. Broadbent is Tweed's spitting image and he makes the grasping old pirate so winning we find ourselves rooting for Tweed against the gaggle of reformers that infest his domain.  Though Leonardo DiCaprio is the nominal lead of the picture he is overshadowed by his co-stars.  Large, slope shouldered and vaguely brutish looking, DiCaprio is physically perfect for Amsterdam.  While he could have used some of the fire and rage of a young James Cagney, DiCaprio's acting is superior throughout the movie. The problem is that Amsterdam just isn't as flashy a role as Bill or Tweed and, as good as DiCaprio is; Day-Lewis operates on a whole other level. Cameron Diaz as the beautiful pickpocket Jenny,  never convinces that she is a product of the slums. Despite having considerable screen time, Diaz fades into the background when compared to her more powerful co-stars.<br><br> Just as important as the actors are to Gangs is the period atmosphere that drips off the screen. The amazing old New York set has an air of lived in reality that you could cut with a knife. You can almost smell the vermin. Gangs is entirely free of the embalmed feeling you get from most modern period movies.  The cast handles the period argot as if it were their true speech and wear their costumes like lived-in clothing. You come away convinced that this is how the world looked and sounded in 1862.<br><br> Scorsese does eschew all nuance and subtlety in Gangs. Instead he tells his tale in wide, bold, exploitive and melodramatic strokes that make the movies two and a half hours fly by. Be warned that if you are waiting to see Gangs on DVD you are making a huge mistake. Gangs has to be seen at the theater. The detail and scope of the film cries out to be viewed in all its wide screen glory.  This movie is a fantastic achievement.","user":"slimjack","rank":[189,253]},{"title":"He actually did it!","rating":12,"date":"12 February 2003","review":"You'd think Scorcese has bitten a bit more than he could possibly chew, this time. Well, he didn't. Gangs of new York is not an \"epic masterpiece\" and it ain't that because I seriously doubt the directors aim was that. It's a great movie in it's own account, but you have to watch it in the right way.<br><br>The plot: Tight enough and well paced, with a couple of lows (expected for a three-hour film) but generally it comes out pretty neat. Some may find it disturbing, as it contains extreme violence and it does not portray an America of happy workers, even happier slaves, benevolent rich and just authorities - instead, it portraits the true 1860 society. Definitely not for those who like their films with plenty of sugar on the top.<br><br>The epic and the drama: Well, basically the film is the story of two men. Around them things evolve and a brave new world comes forth - but we only get to watch snapshots of that world. Until the last sequence, that is when the whole city \"explodes\" (in some occasions literally...) and the streets are being covered in blood, and the two aspects (the main story and the events of the era) are being tied together in the same continuum.<br><br>At the same time, the director attempts to portrait the whole birth and growth of the United States, in a kind of parabole, but without loosing his focus on the main story and the surrounding. Scorsese dives deeply into the psychology of his heroes, without giving out any explanation of their acts other than the probable - he lets us figure it out ourselves, and that's a God-given gift.<br><br>The visuals: The film is disturbing, as it contains extreme violence. There are literally streams of blood, hacking, slashing, crushing - even some action movie fans (hey dude, look, he smashed his head with that thing... cool, man!\") might find some parts of the film interesting. The last sequence is visually astounding, and it's by it's own account a reason to watch this film over and over again... if you got the stomach to actually cope with the disturbing images, that is.<br><br>The actors: I didn't think it would come a day when I'd say that Leo Di Caprio can act, but ...here I go: The kid can act. And quite good too. Guess he needed a Scorsese to put him in the right path. Same with Cameron Diaz - she has got some potential, seems so. Too bad she wastes it in films like \"the sweetest thing\" and other throw-ups like that. And... Daniel Day Lewis. Truly, with this performance, they should give him the Academy award. He portrays the vile \"Butcher\" in a way few would be able of, and he adds depth to a character that could very easily end up \"two-dimensional\". He is stunningly good.<br><br>New York, New York: Scorsese gets involved in something that compares to his previous work the way a fancy little sports car compares to a huge truck: A grandioso film of epic proportions and of great ambition. He does deliver, I believe. But this film shall not be acknowledged universally, because there is too much violence, corruption, lack of the good old white vs black (good vs evil, I mean) concept and does not sweeten the pill in any way. It's disturbing and raw, and it's a great. It's not a political film - in such, the director usually picks a stance, a \"true\" hero, an opposing view, and builds upon those. In this case, the director is truly endistancemented and keeps that distance, even from his \"hero\". There are no \"good\" people in that movie, all are acting like chess pieces in a predetermined way, but at the same time they try to burst out and do their own.<br><br>The verdict: A fabulous film, which is going to be recognized for such in some years","user":"Rosacrux","rank":[221,303]},{"title":"great filmmaking overcomes banal story","rating":26,"date":"26 January 2003","review":"Finding yourself brooding over the sorry state of civilization lately? If so, I would strongly recommend you take a trip to `Gangs of New York' and see how much worse things USED to be in the not too distant past.  The film is Martin Scorcese's epic paean to the Lawlessness That Made America Great, a theme most often explored against a Far West backdrop, out on the open prairie or in two-bit towns like Tombstone, Arizona or Dodge City, Kansas. Here it's been transferred to 1860's New York City, which in Scorcese's vision, turns out to be a veritable Dickensian hellhole of vice and corruption, a place teeming with rival gangsters, pickpockets, corrupt politicians, lawbreaking policemen, and even firefighters so obsessed with matters of jurisdiction that they do physical battle with rival departments while an unattended building goes up in flames behind them.  This is a world where life has no value and where a man's existence can be snuffed out without so much as a by-your-leave or a single person left behind to mourn him.  The members of these rival gangs make the Sharks and the Jets - who would make their appearance on the same turf a full century later - look like mere pantywaists in comparison.<br><br>Visually, the film is a masterpiece, offering some of the best cinematography, art direction and costume design of any film released in 2002.  With the help of some master craftsmen, Scorcese has created a complete world unto itself, one that doesn't look quite like anything we have ever seen on film before.  The setting provides a stunning mixture of the real and the surreal, with everything from the clapboard buildings to the foot-tall hats deriving their style from extrapolated exaggeration. It is truly an astonishing, eye-popping achievement.<br><br>The same cannot necessarily be said for the rest of the film, however. Based on a story by former film critic Jay Cocks, the screenplay by Steven Zaillian, Kenneth Lonergan and Cocks himself never quite achieves the level of greatness promised by the setting.  The main drawback is the story itself, which is basically just a trite revenge melodrama all gussied up in fancy period clothes.  Leonardo DiCaprio takes center stage as Amsterdam Vallon, a young man who, as a boy, witnessed the murder of his father at the hands of Bill `the Butcher' Cutting, the meanest man ever to terrorize the streets of this fledgling metropolis.  Bill, who is an expert with knives and other cutting instruments, is the man all the denizens of the section of the city known as The Five Fingers fear, and he is able to use that fear to make himself undisputed king of the area.  After a 16-year absence, Amsterdam returns to the scene of the crime, determined to even the score and make Bill pay for his offense with his life.<br><br>Despite the glories of the setting, Scorcese is never able to bring the story itself to life.  Perhaps DiCaprio is just too weak and passive to make a very convincing foil for the hard-as-steel Bill Cutting (who seems heavily derived from Dickens' Bill Sikes character in `Oliver Twist,' a literary source that never seems too far from the minds of the movie's authors). Perhaps Daniel-Day Lewis is just too convincing in the role of villain to make it seem like anything even close to an even match.  Perhaps, too, the obligatory romantic plot strand involving DiCaprio with a miscast Cameron Diaz is simply too hokey to fit into the grim tale being told here. Whatever the reason, the core of the film turns out to be the weakest element of  `Gangs of New York.'  Moreover, the dialogue is utterly banal and uninspired, consisting mainly of syrupy platitudes and half-baked philosophizing.  Lucky for us, then, that the director has provided us with enough visual stimulation to keep us at least intrigued, if not quite fascinated, throughout.<br><br>What does fascinate us, however, is all the historical detail that permeates the outer fringes of the story.  These include the ever-present backdrop of the Civil War, which keeps encroaching into the world these people inhabit, and the anti-war riots that tore virtually all of New York City apart - both of which the filmmakers use as a kind of macrocosmic comment on the petty battles and rivalries taking place in this hellish part of town.  In moments like these, `Gangs of New York' almost touches greatness.  Also of interest is the way in which the film highlights the fervid anti-immigration attitude that has so completely permeated the history of a country that, in a bewildering paradox, has always prided itself (in theory, at least, if not always in practice) on being the great `melting pot' for the world's downtrodden and disenfranchised to flock to - and the film reminds us of how prevalent that anti-immigrant attitude still is today in many quarters. Truly, some things never change.<br><br>In some ways, this film might make an interesting companion piece to Scorcese's `Casino,' in that both films deal with the theme of lawlessness and corruption making way for legal conformity and respectability.  Each of these works, so distant from one another in time and place, manages to portray the kind of epic birth pangs that cities and countries often have to go through before they can call themselves truly `civilized.'  This theme is, undoubtedly, what led Scorcese to compose a kind of visual ode to New York City in his closing shot, his own personal valentine to a city that has suffered so much in the past few years.  It is his way of saying that, from such squalid beginnings, New York City has grown into the great cultural center that it is today and that it can be proud of its heritage and the people who helped make it.  After the events of 9/11, that is a very powerful and stirring sentiment indeed.<br><br>Yes, `Gangs of New York' is a severely flawed film in a lot of ways, but it is also a work of vision and of almost unparalleled technical accomplishment that deserves to be seen.  Even if there is not much here to engage the mind or the heart, you can always feast your eyes on the glorious visions unfolding up there on the screen.","user":"Buddy-51","rank":[112,150]}]