[{"title":"A smart, chilling \"B\" picture.","rating":10,"date":"20 October 2002","review":"Below (*****)  I know what you're thinking.  A \"B\" picture about a haunted submarine?  And I think it's the best flick I've seen so far this year? Well, when a \"B\" picture is this smart, this intricate, this well-made, this damned entertaining, then, yeah, it's the best movie I've seen so far this year.<br><br>Here's the set-up:  it's 1943 in the North Atlantic, and the U.S.S. Tiger Shark picks up three survivors from a British hospital ship that was torpedoed two days earlier; the discovery that one of the survivors is a German leads to violence; and, then, really weird things start happening, all the while a German cruiser is chasing the sub down.  Is a ghost trying to destroy the sub and its crew, or are they just imagining things through convenient coincidences? <br><br>Below was written by Lucas Sussman, Darren Aronofsky and the film's director, David N. Twohy; Aronofsky is the smart filmmaker behind the art-house hit Requiem for a Dream, and Twohy has consistently specialized in sophisticated \"B\" pictures like The Arrival and Pitch Black.  Below offers up an intricate storyline that keeps both the characters and the audience guessing--when they and we aren't jumping out of our skins in terror. Twohy's direction is an example of economic brilliance--the flick charges forward, piling on the twists and scares methodically, but never gratuitously--thankfully, this is a horror flick that's more about mood than about gore--indeed, it's less in tune with modern splatterfests than it is an homage to the cerebral Val Lewton thrillers of the 1940s (like The Seventh Victim or Isle of the Dead).<br><br>And what mood this movie creates!  Ian Wilson's cinematography is vibrant and chilling, and the magnificent special effects never overwhelm the story--except for a final, hauntingly beautiful shot that will linger in your memory for quite awhile.<br><br>An added bonus is the cast of smart players:  Bruce Greenwood as the sub commander trying to hold his crew and himself together; Matt Davis as the wet-behind-the-ears officer not really accepted by the crew; Olivia Williams as an English nurse who is both suspect and suspicious; and Holt McCallaney as a gruff officer. <br><br>It appears that Below is being dumped by its studio, Dimension, with little advertising or fanfare; a shame, really, since it's one of the most sophisticated and highest quality pictures I've seen in quite awhile. [Rated R:  Violence, language, brief nudity.]","user":"jojofla","rank":[100,116]},{"title":"Subtle, understated, and effective","rating":9,"date":"25 October 2002","review":"Periodically I go through fits where I'm convinced that the American public is losing the capacity for thought in entertainment; that 99% of the movie-going public has reached the point where every smallest nuance must be telegraphed as loudly and as blatantly as possible, and any intelligent content must be simplified so it's comprehensible to the lowest common denominator.<br><br>Below is not like that.<br><br>This is a movie that simultaneously gives one hope (that something this stylish and subtle could be made in 2002), and despair (that the studio has shown so little faith in it that they've cast it adrift without any advertising or backing). Why this hasn't received even one quarter of the attention of Ghost Ship I can't fathom--if you have a choice, go see Below instead.<br><br>If you like beautifully photographed, well-thought-out eerie psychological horror films that don't tie everything up in a nice pretty package of explanations in the final shots, and are willing to give the relatively unknown but excellent cast a shot, then by all means hunt this one down. <br><br>\n9 out of 10","user":"coyote13","rank":[99,120]},{"title":"Best ghost movie in quite some years","rating":10,"date":"16 November 2004","review":"This film has its share of fans, and I wanted to chime in. <br><br>I thought its visual effects were beautiful and functional throughout--this is a ghost movie, but the ghost effects are subtle, and never stoop to goofy atmospherics. Indeed, the ghost images are only a very small portion of the visual effects platter on display. Most of the wonderful miniatures and digital constructions concern themselves with the reality of the submarine and its adventures. And these numerous shots feature very little showing off--like the very best effects, they are tools to transmit the story, first and foremost. This rigid adhesion to story is visible all around, and it's very clear that cast and crew were solidly focused.<br><br>\"Below\" is a basic ghost mystery story (who is the ghost and what does it want), a type of film that is seldom done nowadays. A good number of these have been done over the years, certainly, and so the subject matter is familiar, but the story details/mechanics of \"Below\" present it all in a fresh manner. Lots of business for the actors to work with.<br><br>It's intricate, and demands attention from its viewers, and this is rewarded by what I think is a very watchable and entertaining ride, thanks in no small part to its great cast and tight direction. Yes! it's scary, possibly one of the most frightening films I've seen in years. I hesitate to call it a \"horror\" film, because its audience identification characters do their best to see that justice prevails, and eventually they pull the audience out of this hellish experience. This optimism gives the film a quality of fairy-tale parable. But it is certainly a white-knuckle suspense thriller.","user":"roddmatsui","rank":[72,87]}]