[{"title":"6.6/10? What absolute bull. Don't believe the low rating.","rating":10,"date":"28 March 2007","review":"I heard bad things about this movie. I heard it wasn't well written and that Jim Carrey was a bad actor in it etc. DON'T YOU BELIEVE IT! It's not true. This movie is absolutely amazing. Jim Carrey did an excellent job at acting serious. He was 100% serious in this movie. He didn't try any facial expressions or noises he was 100% serious. He did an unforgettable role. He's even more serious than The Truman Show. The story is well put together and well written. Carrey losing his memory after a car crash in the river. The town people think he's someone that went to war and who has come back. Carrey must try to remember who he is. The people they know who he is are looking for him and will cause a lot of trouble if he doesn't find out quick. Fantastic, sweet and dramatic story. I recommend it to anyone. It is to be enjoyed by anyone. 10/10","user":"ninjagaiden007","rank":[197,232]},{"title":"I liked it too although I'm not usually a Jim Carey fan","rating":21,"date":"21 November 2004","review":"This DVD came in my last batch from Netflix, and I wondered why I had ever chosen it. Finally on a rainy Saturday, I put it on and was enchanted and moved. Jim Carey was great as were all the cast. The story seemed so very timely in light of recent national events. A land where dissenting voices are labeled unpatriotic and people of intellect and wide-ranging analysis are dismissed as elitist is positively frightening. \"The Majestic\" shows how we can get back to being our best selves and fulfill our promise as a nation that now seems so bleak to some of us. Caring about each other, our community, that is how we really come alive and make a difference. Building and striving for what is possible and making it safe to express and fulfill dreams gives me hope that we really can get back to where we belong if we'd only stop being so self-righteous, rude, and intolerant. I grew up in the party of Eisenhower but never felt that opposing ideas were unpatriotic. We need to be kinder to each other, recapture the courtesy of a lost era, be thoughtful and intellectually curious to be sure that we come up with the very best ideas and solutions we can in today's world. \"The Majestic\" is a wonderful reminder of what ordinary people can do when we come together and work to achieve something that uplifts a whole community. I heartily recommend it.","user":"mjtaylor_communications","rank":[93,111]},{"title":"A throwback film in the Frank Capra style","rating":18,"date":"18 July 2004","review":"That comment sums up the movie. If you happen to like Capra-esquire movies, you will adore The Majestic. If you think they are silly, sentimental and simplistic, you won't. It's just that simple.<br><br>The movie plot runs on two levels. Jim Carrey, playing straight, is Peter Appleton, a B-movie screenwriter in 1951 Hollywood who is trying to break into A-pictures when he is accused of being a Communist by the House Un-American Activities Committee. As the witch hunt begins to unfold, he has a traffic accident that ends with him and his car falling into a river. He is carried out to sea only to be washed up on the beach below Lawson, California - with no memory of who he is, his past life, or how he got there.<br><br>He is promptly mistaken for Luke Trimble, a local hero missing and presumed dead by the entire town, who like 62 other Lawson boys gave his life for his country in World War II. Lawson's sacrifice was recognized by President Roosevelt declaring the town a national monument and sending a bronze sculpture to commemorate its dead. However, the town's losses have caused Lawson to lose its heart and its way.<br><br>The reappearance of 'Luke,' and Peter's actions taken in another man's shoes, revitalize the town beginning with Luke's father, Harry (Martin Landau, in a great role) and The Majestic, the theatre owned by the Trimbles, which Harry had closed in 1942 presumably on learning of Luke's death. While Adele, the doctor's daughter (and Luke's fiancée) tries to restore 'Luke's' memory, Peter and Harry refurbish and reopen The Majestic, and bring life back to the town. All is going well in 'Luke's' life... until the investigators for the HUAC show up with a subpoena a couple of days after Harry's death - on the day of Harry's funeral, in fact - and coincidentally after Peter's regaining his memory.<br><br>Peter's agent also shows up. He has news. It has occurred to the HUAC that in Peter's case, perhaps they are mistaken; but they have to save face. All Peter, a man who has never had much in the way of personal convictions, has to do is stand up at an HUAC hearing in Los Angeles and read a prepared statement in which he abjures his membership in the Communist Party, apologizes for his error, promises to mend his ways and name names, and all will be forgiven. He'll get his life back. His A-list film, which the studio shelved, will go back into production. He'll get everything he ever wanted.<br><br>But Peter has a problem. It's Luke, you see. He was not just a local hero. He was a Hero with a capital H, and Peter has been him for a few months, as Adele points out to him; and when Luke reaches out from the past to touch Peter, Peter is ready to listen.<br><br>If you are a Capra fan, you can guess the ending and will approve. If you aren't, you'll say this is a mixture of schmaltz and hokum with just a dash of idealism and SO not realistic. And if you say that, I say you're wrong.<br><br>Capra could have made this picture, with Jimmy Stewart as Peter/Luke, June Allyson as Adele, Edward Arnold as the head of the HUAC, and a whole bunch of MGM's \"old reliable\" character actors in the supporting roles. The movie is a throwback to a more innocent time when people still believed in heroes and dared to dream about more than just maintaining the status quo. On a scale of 1 to 10, I give it an 8; and I wish Carrey would make more movies like this. He's a better straight actor than he is given credit for. This is one of the movies you can tell will stand the test of time, and as such you should add it to your collection and your list to the 200 Greatest American Movies.","user":"royjaruk","rank":[41,47]}]