[{"title":"I'm not drunk, I'm... celebrating.","rating":8,"date":"31 August 2007","review":"What is life for? That's a question that many people throughout the ages have asked. There is no question in the mind of Tom Bledsoe (Aidan Quinn). Life is for enjoying. His idea of enjoying is playing music and drinking corn liquor. I don't know if I can argue with that.<br><br>Neither could Lily Penleric (Janet McTeer), Doctor of Musicology, who came up into the mountains to visit her sister Elna (Jane Adams), and discovered music that had not been heard by \"outlanders\" in hundreds of years. Songs that were originally written in Ireland and Scotland and hidden in the Apppalatian Mountains. She discovered that there was indeed culture among those whom the outlanders considered ignorant, inbred hillbillies, and she was determined to capture and share that culture.<br><br>In the process, she learned what life was really all about. It was a beautiful, tender story about people and differences; like the reaction over the discovery of her sister's partner, Harriet (E. Katherine Kerr).<br><br>The music was awesome, and this was Emmy Rossum's first movie. I loved her in The Phantom of the Opera, The Day after Tomorrow, and Mystic River; and now add another great performance to the list. I wasn't inclined to see Posiden, but I will make it a point now to see her again.<br><br>I have to end with a note about Pat Carroll, who played Viney Butlet. Her career is is old as i am and I am sure that I have probably seen her many times over the years and not known who she was. I will not forget now, as she was the most interesting character in the movie. Brava!","user":"lastliberal","rank":[23,23]},{"title":"Music (Maker) Lover's Delight","rating":10,"date":"12 October 2007","review":"Beautiful music, and even more beautiful portrayal of a music-lover. The main character Lily's love oozes off the screen and shames everyone who's ever made a tape or CD music collection with far less effort and trial -- and persistence. No less beautiful is the love that catches fire between the leads, and where it takes them.<br><br>If you believe music, not to mention love, should be near the helm of your ship, you will savor the textures of this surprisingly fine home-made wine of a story. If you've also ever loved simple folk music, then that will be sinfully delicious icing on the cake. Hat's off to the crew for this very-obviously (and satisfyingly successful) labor of love.","user":"BobStein-VisiBone","rank":[20,21]},{"title":"Honest view of Appalachia circa early 1900's","rating":10,"date":"1 September 2006","review":"This movie accomplishes many things within the premise of \"Songcatching\". The movie exposes the hardships, ignorances, prejudices, resourcefulness, intelligence, commonsense and heart of the people who remained out of touch with \"progress\".<br><br>The movie has some graphic and controversial scenes; but the majority is appropriate for all ages.<br><br>The way the folk music is in-twined in the lives of the local people is magical and authentic. I wish a sound track was available with the full versions of the \"collected\" songs in the original voices of the actors, in the same simplistic way they were produced for the movie.<br><br>This is a movie I have enjoyed on many occasions and look forward to future viewings. I have purchased the DVD.","user":"frankie_time","rank":[13,13]}]