[{"title":"Personal Significance","rating":9,"date":"17 August 2004","review":"It seems this movie has taken a bit of heat, known by many as Shyamalan's \"worst\" film. It is often written off as slow moving, and the twist at the end as unoriginal and boring. I've heard people say the acting and camera work was awkward and stale and that the casting was poor. Ironically enough, as more people begin to dislike this movie, the more I seem to fall in love with it. This film has a lot of personal bearing with me, both as a student of psychology and a lover of movies and just plain art. I feel like I've taken this film under my wing during its times of criticism, and now I'd like to try and show everyone what exactly I love about it so much. <br><br>Shyamalan really showed a stroke of brilliance by getting Serra to be his cinematographer and to play around with the aestetics of the film. I don't know how or where Shyamalan is getting these guys for his movies, but I definitely love the style of each frame he shells out. Serra had been involved with predominately foreign films before Unbreakable. This was his first big American film, and I think you gotta give a little credit to Shyamalan for that. His unique and creative touch really added to the direction. In keeping with the \"comic book\" theme of the movie, you will notice that almost every shot is taken as if you are looking through or in between something. Like the squares of a comic strip. There is also a dark, slightly blue colored filter used throughout most of the film. This gives the movie a very bold, but eerie tone. Showing that the world can be a rough and scary place, but it can also be fought and overcome. It is evident that time and effort went into every shot. It may not slap many viewers in the face as brilliant, but it really strikes a chord with me. <br><br>As for the score, I am more than willing to argue that this is, hands down, James Newton Howard's best score of his very successful career. It is compelling and booming. It's very powerful, but not over-the-top and excessive. For anyone with the soundtrack, check out 'The Orange Man' and 'Visions'. These are two of the most powerful pieces of any film score around. And I stress the word \"powerful\". Yeah, he's no Hermann or Morricone, but the emotional weight and emotive power of his chords and his overall composition are just downright chilling. <br><br>The writing and the direction are just as captivating as the score. Almost every line of dialogue and every scene seems to be placed out on an island, alone so that everyone can stop and judge it. Some people might view this as cocky and/or boring direction, but I see it as daring and unique. Much of Shyamalan's writing is done that way. ('…I see dead people…' '...They call me Mr. Glass…' etc. etc.) Another aspect of the film that tickles my fancy is the underlying themes. I do believe, to a certain extent, that people do have somewhat supernatural powers at times. People have been known to make miracles and do unbelievable things. Maybe these things could be 'developed' in some way. These theories are, in a way, intertwined with some aspects of psychology, such as selective attention and self-actualization. If you care to discuss some of these ideas, let me know and I will relate them to the film through my eyes. In short, I do believe there is a superhero in everyone. It may not be through supernatural powers, but it may simply be through the act of reaching out to a person in need. Other themes of the movie, like how completely different people can always be connected in some way and how everyone has their vulnerabilities and weaknesses are intriguing, yet universal. From a psychological point of view, Shyamalan really gets inside the head of OI patients (osteogenesis imperfecta). He then brings this psyche to the next level with Jackson's character. Elijah, is very passionate but very tortured and evil. His interactions with Willis bring depth and focus to both the characters and the story. Certain scenes in the movie are really quite striking and powerful. The shots of Willis in his security poncho. The train station scene. Elijah's breathtaking fall on the stairs and many more speak so loudly to me and say so much in just a simple clip. For some reason this movie just speaks to me, like art. If anyone cares to discuss more about this film, that'd be cool. There is a lotta other cool stuff to talk about with this movie. Just thinking about it makes me want to watch it a few more times. It may not be the feel good film of the year, or the masterpiece that everyone was looking for, but it definitely sits well with me.","user":"bilcal7-1","rank":[484,582]},{"title":"Very subtle. Requires multiple sips to get the full measure.","rating":18,"date":"18 July 2004","review":"This movie will be the curious nugget in the collection of Shyamalan films. It is great to see young writing and directing talent that is carving a niche away from the usual fair while running with the big boys and girls. Entering the mainstream was achieved through his kick-off blockbuster, The Sixth Sense. If you are among the small cadre of people who figured out The Sixth Sense's twist before the ending, salute! Unbreakable continues Shyamalan's unorthodox view of things by crafting a more 'mortal' superhero drama. Unlike Peter Parker (Toby Maguire - Spiderman) who completely emerges as Spiderman (web-slinging and building-hopping) within about 30 minutes of the whole movie, David Dunn (Bruce Willis) is discovering his more subtle but extraordinary abilities for the whole movie, with some help from his friends and foes. Being able to stick to and vertically climb a building wall is a fairly noticeable attribute (why it would occur to somebody to try it escapes me) but never being sick in one's life may actually escape one's attention. People develop mindsets that prevent them from recognizing certain things until a suggestion changes that condition. In this movie, being the sole (uninjured) survivor of a train crash is a pretty strong suggestion. From there you watch the revelation unfold. Yes, there is a villain but I won't spoil the movie for those who have not ventured to try it. If you have been avoiding it after poor recommendations from others, forget about The Sixth Sense and give it an undivided attention DVD viewing.<br><br>Be patient and let it take you. I liked its subtle power. It implies a certain superhero quality in all of us.","user":"Videofilm","rank":[196,235]},{"title":"Hugely underrated and misunderstood movie","rating":8,"date":"10 January 2006","review":"I love this film. I'm the only person I know who doesn't hate it, but I cannot fathom why it gets such a bad rap from everybody. It seems that Shyamalan's films have this a running theme - with the notable exception of the Sixth Sense, which pretty much everyone seems to get. He makes movies that are very subtle, and which seem to need you to focus on them just right to fully grasp what he was trying to do. I've enjoyed all his movies, but for me the alien part of Signs takes a lot away from what I believe to be the central storyline and as such the whole movie suffers a little. Yet I know other people who think Signs is his best, specifically because of the way the alien plot line accentuates the central one.<br><br>Unbreakable is a beautifully simple film, but I think it has to hit you just right for you to completely get it. All the actors nail their parts, particularly Bruce Willis and his kid. Shyamalan takes an interesting (if slightly fringe) theory and puts it in a real world context, with a real family. Somehow he manages to never go overboard with it and - for me at least - it gripped me from the first moment to the last. Samuel L Jackson's character history is really nicely crafted in the middle of the other plot lines and you get genuinely involved in the people Shyamalan has created.<br><br>Don't get caught up in all the talk of the twist ending. The ending is good, but if you spend the whole movie waiting for this tumultuous twist you'll inevitably be disappointed, and the movie stands alone without it. <br><br>Don't go into this movie expecting another Sixth Sense or Signs. It's very very subtle and very understated. If you don't like slow movies, just don't watch this because it moves at a very sedate pace, but I personally think you'll be missing out. You'll likely either love it or you'll loathe it, but at least it will make an impression.","user":"edinburghstoryteller","rank":[164,205]}]