[{"title":"Ridiculous","rating":6,"date":"26 October 2002","review":"I thought this was a film about Navajo code talkers. Well, it's not.  While there are a couple of Navajos in the film, the story revolves  around Nicolas Cage winning WWII all by himself. This guy's incredible  and makes John Wayne look like a wimp. Every time the Marines are in  trouble, up jumps good old Nicolas Cage with his Thompson and POOF! the  battle is WON! I wonder how we won WWII without Nicolas Cage? The film  has a LOT of combat footage and most of that is very well done. That  alone is worth a watch but don't expect to learn much of anything about  the Navajo code talkers. You should read about them, because theirs was  an important part of history, but they're a minor part in this film. I  gave it a 6, only because of the good combat footage.","user":"grahamsj3","rank":[177,237]},{"title":"The most realistic war movie ever made","rating":3,"date":"28 October 2006","review":"I learned a lot about World War II from this film. First of all, during this war it was a custom of both the Japanese and Americans to scream every time you shoot or get shot (even with about 30 bullets in your chest you can still scream apparently). Secondly, Japanese soldiers do not like cover. They like to stay out in the open, and will not fire their rifles unless they're within 15 feet of American soldiers. Thirdly, one man with a Thompson sub-machine gun can take out an entire regiment of Japanese soldiers in an afternoon.<br><br>This film was completely first rate, start to finish. From the soldiers who flail about wildly as entire belts of machine gun ammo are pumped into them (before they drop to the ground mind you), to the 12 soldiers that Nicholas Cage shoots with a handgun while laying on his back wounded in the space of about 15 seconds, this film just screamed realism and authenticity. Highly recommended to history buffs and people who can appreciate some of the best acting ever put on film.","user":"bmyers22","rank":[320,441]},{"title":"The Director's Cut is an improvement","rating":8,"date":"26 October 2005","review":"I just watched the director's cut on DVD after having seen the theatrical cut some time ago.<br><br>Plot summary: In WWII, a code based on the Navajo language was used to securely communicate between US troops in the Asian Pacific, without the Japanese eavesdropping. We follow two Navajo code talkers and their US Marine \"bodyguards\" as they go into combat on a Japanese island.<br><br>A lot has been written about this somewhat flawed John Woo movie. After having seen both versions, my main disappointment is still that the two code talkers seem like background characters. A movie with a lower budget, without big Hollywood stars put in the foreground would probably have been more satisfying. Maybe that movie should have been done by another director too, I don't know. <br><br>Enough good \"general\" war movies have been made. The code talker part of the story should have been made much more pivotal as was done here.<br><br>I'm a fan of Woo's Hong Kong and Hollywood work. The director's cut of Windtalkers doesn't turn a mediocre Woo film into a masterpiece, but it is certainly an improvement.<br><br>Main advantages of the DC are more fleshed out characters. You get more background on all main characters, including the two Navajo code talkers. I felt more involved. As a result, the code talker part of the story is served better, but still not enough to my taste. The DC also has more uncut battlefield scenes. Woo really shows his talent here, with raw yet beautifully shot war action. You get the sense that you are in the middle of the action.<br><br>I was particularly interested if a scene was put back in where a US soldier takes a golden tooth from a Japanese corpse. This scene was described in several documentaries about censorship by the US Army. Not completely surprisingly, this scene was also absent from the DC.<br><br>If you are a Woo fan or already appreciated the theatrical cut, it may be worth checking out the director's cut.<br><br>My ratings: 6/10 for the original cut. 8/10 for the director's cut.","user":"ridleyrules","rank":[48,64]}]