[{"title":"The slow death of a nightclub band in Korea","rating":9,"date":"8 September 2002","review":"A  frequently-comedic drama about a night-club band undergoing a slow disintegration, as the members beat each other up, drink themselves into unconsciousness, and leave to pursue more glamorous careers in things like bus driving.  This is a smart social commentary and character study, definitely worth watching.","user":"Lagomorph","rank":[7,8]},{"title":"Bittersweet Nostalgia","rating":8,"date":"1 February 2007","review":"This quiet South Corean film is about the slow demise of a nightclub band. Set in the 1990's or perhaps the late 1980's in rural Corea, the film is primarily a character piece centered on the band leader, the quiet and enduring Hae-il.<br><br>There's a lot of rumination on the changes that occur between idealistic youth and realistic adulthood and somehow Hae-il manages to stand somewhere in the middle, unmarried and continuing to pursue a music career although his band is falling apart. Over the course of the film, there is a lengthy flashback to the main character's youth, which sets up and explains further events over the course of the film.<br><br>In many ways, this film is akin to Take Care of My Cat, another South Corean film about high school graduates' struggles in the real world.<br><br>Although musicians are the focus of the film, music isn't the focus of the film, just the dressing by which we can view the characters and their exploits. The writing is subtle, but not boring. The portrayals are likewise subtle, but manage to emotional and somehow not seem over-the-top. The direction is basically invisible Hollywood direction, which works to let the story and characters shine.<br><br>It's not a happy film, but perhaps a bittersweet one, with the taste of nostalgia, an enduring perseverance in the face of reality and yet an understanding of the way that things must be. It's a story that many artists and dreamers can relate to. And I'm grateful for this film. I'm biased because of my affinity for the topics therein, so I'd have to rate it excellent. 8/10.","user":"refresh_daemon","rank":[3,3]},{"title":"A meditation of the being lost.","rating":9,"date":"11 December 2005","review":"Waikiki has been often regarded as one of most worth visiting places among traditional Korean folks who experienced the rapid Americanization of society since the end of the Korean War. Now, time has changed and any word associated with \"Waikiki\" is regarded as a symbol of the unenlightened because of its strong nuance for the generation of old timers. The movie focuses on the everyday life of an itinerant vocal band named \"Waikiki Brothers\" which reminds of the residue of retarded, cheap musicians.<br><br>The collapse of Waikiki brothers is well-anticipated at the first scene of the movie, and the plot is about how each member of the band compromises with the modernized realm of the contemporary Korean society. The basic emotion of this film is the nostalgia and its approach is an archaeological review of ancient cultural icons which are rarely witnessed now. The message that the nostalgia of the past can serve as a powerful resource for preparing the future is hovering around this movie, and the attitude toward reincarnating the relics of youth is the major motto this film demonstrates.<br><br>Quite a contemplative text on the lost glory and hope of the Korean past which are calmly absorbed in the spirit of loneliness and alienation of modern Korean society. Must be one of standing ovation-able works that will shine year after year.","user":"luke-35","rank":[3,3]}]