[{"title":"A thought provoking look at the thin line between `the famous and the not so famous.'","rating":23,"date":"23 April 2004","review":"If it hadn't already been used, a perfect alternative title for a movie about Los Angeles DJ, Rodney Bingenheimer might have been Almost Famous.<br><br>\nListen to how Alice Copper describes Bingenheimer: `He was accepted by the Rolling Stones, he was accepted by The Beatles, he was accepted by The Beach Boys' This slightly unflattering choice of words is significant. Not `was friends with,' not `hung out with,' not `partied with,' but `was accepted by.' One critic called the documentary Mayor of the Sunset Strip the greatest rock &amp; roll movie ever made. I'd have to watch Stop Making Sense and The Velvet Goldmine again before I could make that commitment, but in my opinion, Mayor isn't even about rock &amp; roll. It's about fame, or the proximity to fame. It's about acceptance. <br><br>Rodney Bingenheimer's greatest achievement is that, for a generation, he introduced the most influential artists in modern rock to America radio. His second greatest accomplishment was his ability to be accepted. So many larger than life personalities try to force themselves into the spotlight. Meanwhile, quiet, shy, unassuming Rodney Bingenheimer has lived at the edge of the spotlight for his entire adult life. <br><br>Pamela Des Barres (who appears in the film) is arguably the world's greatest groupie.  Bingenheimer is probably a close second, despite the handicap of being male (being a groupie, like being a fashion model or porn star, is one of the few pursuits in patriarchal society where being male is a handicap). But, while Des Barres is a pop icon, published author and happily married to former rocker Michael Des Barres, Bingenheimer is single, lives in a modest home with tattered furniture and has a once-a-week, 3 hour late-night radio show. <br><br>George Hickenlooper's Mayor of the Sunset Strip is a thought provoking look at Los Angeles and the thin but often uncrossable line between `the famous and the not so famous.' From its opening it seems to ask the question, why is one of the most influential men in American radio not a household name, when so many less deserving souls (cough-Carson Daly-cough) are. From the first frame of the film, I found myself sizing Bingenheimer up to come up with an answer. He's a short, skinny, funny looking guy. He's got what you'd call `a great face for radio.' However, he doesn't have a radio voice and after twenty years on the air he has not developed a radio persona. Perhaps this is why he will never reach the heights of Wolfman Jack, Kasey Casem or Rick Dees (yes, I just used `heights' and Rick Dees in the same sentence. No small feat).  He lacks the authority of a Kurt Loader and perhaps was just born too early to take advantage of MTV, the network that can make less-than-handsome music aficionados like Matt Pinfield into TV personalities. <br><br>Over the span of the film, we see Rodney with the likes of Oasis, No Doubt, Mick Jagger, David Bowie, Coldplay and Cher (who Rodney says was like a mother to him, although she looks remarkably younger than he does. Hmmm ). Many of these artists and many more credit Rodney with being the first to play their music on American radio. In photo montages we see old stills of Rodney with Elvis, Jimi Hendrix, and Bob Dylan, to name a few. We see film clips of Rodney with Jerry Lee Lewis, The Mamas and the Papas and John Lennon. The list is so impressive; if you saw it out of context you'd swear the pictures were fakes. The diminutive Bingenheimer often looks matted into the footage like Woody Allen in Zelig or Tom Hanks in Forest Gump.<br><br>\nBefore the credits roll we will see Rodney betrayed by his best friend. We will see his unrequited love for a young girl who insists they are `just friends.' In one humorous and painful scene, we see his estranged family searching the house for pictures of Rodney in desperate attempt to look less estranged. Throughout the film two seemingly opposing questions dominate: With all these famous friends, why isn't Rodney more successful? And, why did all the famous people gravitate toward him to begin with?<br><br>In the end, perhaps the fact that Rodney Bingenheimer couldn't parlay his access to the rich and famous into wealth and fame is not the tragedy of Rodney Bingenheimer. Perhaps the fact that we find anyone who doesn't cash in on their proximity to fame tragic is the tragedy of America. Rodney Bingenheimer is our inner geek, the star-stuck autograph hound in all of us. Hickenlooper's film holds up a mirror to a celebrity obsessed culture, a culture fixated on something 99.9999% its members will never experience. Perhaps this is the tragedy of all our lives. After all, as bad as we may feel for Bingenheimer, the fact remains: WE are watching a movie about HIM, a movie in which he is hanging out with David Bowie, and we are not.","user":"wraith-13","rank":[36,38]},{"title":"a stranger-than-fiction true life story","rating":7,"date":"16 January 2005","review":"If \"Mayor of the Sunset Strip\" were not a documentary, no one would ever believe the story it tells. The film chronicles the life of Rodney Bingenheimer, the L.A. DJ who helped to launch the careers of many of the most influential bands in rock music history. However, if you're expecting Rodney to be a dashing, high-powered music exec with loads of cash and garages full of fancy sport cars, think again. He is, in fact, a painfully shy and unassuming man who seems totally out of place in the celebrity swirl of which he became so integral a part beginning in the 1960's. This is what makes his story and the film so fascinating, for who could have imagined that this gnomish young lad from Mountain View, California - essentially abandoned by both his mother and father and rejected by his peers - would somehow manage to make himself the center of attention for some of the greatest rock celebrities of the 1960's and '70's. Everybody who was anybody knew and adored Rodney, and, after he landed a gig as DJ at L.A.'s KROQ in the 1970's, he gave many struggling alternative artists their first real toehold on the radio, playing their records at a time when no other disc jockeys would touch them. The bands who practically owe their careers to Rodney Bingenheimer include Blondie, the Ramones, the Sex Pistols, the Runaways, the Go-Go's, No Doubt, Coldplay, and many many others. <br><br>As a documentary, the film, written and directed by George Hickenlooper, takes a fairly conventional approach, combining images from Rodney's life with interviews by celebrities, relatives and friends commenting on him both as a person and as a phenomenon. The film provides a virtual who's who of some of the biggest names in the music business stepping up to the camera to have their say, most of it highly complimentary to the subject. Indeed, almost to a person, the interviewees talk about what a sweet, lovable guy Rodney is and how hobnobbing with so many celebrities has not diminished his innate humility and decency as a person. There is one moment in the film when Rodney allows his anger to get the better of him, but, most of the time, he comes across as a goodhearted, almost passive person who is surprisingly inarticulate and - one senses - not all that comfortable being the subject of a documentary. The film achieves a poignancy and sadness in its latter scenes when we discover that, despite all this notoriety among the glitterati in Hollywood, Rodney lives a rather isolated existence, never having found that one true love with whom he could settle down and make a life. In fact, the movie makes us question whether fame - or even proximity to the famous - can ever really lead to a happy, successful life. It's a lament we've heard many times before and will hear many times again.<br><br>\"Mayor of the Sunset Strip\" provides us with a kaleidoscopic view of the L.A. music scene from the mid 1960's to the present. Rodney's life becomes the forum for reliving all those exciting moments in which this parade of beautiful and talented people came to define the culture and eras of which they were a part. The film has an almost \"Zelig\" quality to it, as Rodney is photographed standing next to virtually every important rock artist to come down the pike in the last four decades.<br><br>I must admit that, even after watching \"Mayor of the Sunset Strip,\" I still don't claim to understand how Rodney achieved everything that he did, and maybe no film could ever really capture that magic alignment of elements that made it possible for a shy, insecure young boy from a broken family - yet a boy with dreams and an abiding love of rock 'n roll - to play such a crucial part in music history. I guess you had to actually be there to really understand it.<br><br>My own experience with Rodney Bingenheimer is an extremely modest one. I once stood behind him while waiting to board a flight from San Jose to Burbank. Few people in the crowd seemed to know who he was, but an attractive young girl, obviously interested in pursuing a career in music, approached him and politely engaged him in conversation. Rodney, despite the fact that he could have simply ignored her advances and begged for privacy, instead turned his full attention to what it was she was saying, smiled demurely at her compliments, and offered her an opportunity to perform for him when they got back to L.A. It's that Rodney Bingenheimer who comes through in the film.","user":"Buddy-51","rank":[19,20]},{"title":"Excellent, But Not Enough Music","rating":7,"date":"7 October 2004","review":"As an Angeleno, I was a long-time listener to KROQ, but gave it up the day grunge came to town. I used to listen to Rodney back when he was on at a decent hour. He was so weird and you always felt like you were terribly cool and on-the-edge for listening to him. It is too bad KROQ abandoned Rodney's kind of music in favor of the crap they play today.<br><br>But on to the movie itself. I thought it was excellent in its own right, which had the classic tragedy theme. Looking at it that way, this movie could not have been better.<br><br>But from a music standpoint there was something lacking. Rodney is Rodney because of the music, his love of the music, his ear and knack for the music. There was plenty in this movie about the musicians but very little about the music they play. I would have liked a few comments along the lines of, \"Oh, the first time I heard the opening riff of such-and-such a song,\" or \"Man, when I saw so-and-so play for the first time at the Whiskey!\" There is a curious lack of talk about the actual tunes in this movie. One DOES come away with the feeling that it was just celebrities that Rodney loved and not the art they created...and I know this is not the case.<br><br>But back to the \"tragedy\" that was this movie's real purpose. It was so excruciating to watch some of these scenes. A truly great movie in this respect. The encounters with the family, the dumping of his mom's ashes, the freak-out with Chris Carter, the horrible, horrible side-story of the 50-year-old wannabe rock star. This movie was positively Shakespearean! And knowing what a tragic landscape Los Angeles really is, I loved that this was conveyed so well in this film; the Denny's, the stripmalls, the ugly apartment buildings.","user":"fleetmind","rank":[15,16]}]