[{"title":"A Beautiful, Bloody Ghost Story","rating":10,"date":"21 May 2005","review":"The year is 1939. The Spanish Civil War is nearing its bloody end. Ten year old Carlos, the orphaned son of a slain Republican, is left by his tutor at an isolated orphanage for boys. The school is destitute, barely able to provide enough food for the children, but headmistress Carmen and Dr. Casares do the best they can. Carlos accepts his fate bravely, but there are still school bullies to contend with, an unexploded bomb sitting in the courtyard as a constant reminder of the war which still rages, and an abusive caretaker named Jacinto who has his own secret agenda. As if that were not enough, a ghost begins stalking Carlos, the ghost of a boy named Santi whose demise is shrouded in mystery and who solemnly warns Carlos that many will soon die. As the war begins closing in on the orphanage, violence erupts within and Santi's prediction comes sadly true. But the worst has not yet happened. The abandoned boys must band together if they hope to survive, and the dead will aid their cause if they are to be avenged.<br><br>This is a beautiful movie, absolutely gorgeous from start to finish. The dusty, isolated landscape is a ghost itself and the constant threat of violence - from the war, to the bullies and, of course, from the traitorous Jacinto - gives this film an unrelenting atmosphere of tension and dread. The acting is superb, from the children as well as the adults. Federico Luppi as Dr. Casares is superb, providing us with a true hero, a gentleman of class and compassion. Eduardo Noriega is perfectly cast as the despicable Jacinto, making you despise him more and more as the film progresses. This is not just a ghost story, though the figure of Santi is central and key to everything that happens. It is a tale of love and honor as well as horror and ruin. It is a coming of age story and an adult drama. It also manages to be scary as hell when it wants to be.<br><br>Guillermo del Toro has made a masterpiece with \"The Devils Backbone.\" Ten stars for this hauntingly lovely epic.","user":"Gafke","rank":[118,144]},{"title":"Haunting, Sad And Beautiful","rating":8,"date":"11 February 2018","review":"A beautiful, atmospheric story about a haunted orphanage. To date, I think it's Del Toro's most \"complete\" film, combining his trademark visuals with a very touching story about war, death, guilt and grief - and ultimately hope.<br><br>Like 'Pan's Labyrinth' the story is set against the backdrop of the Spanish civil war (although here the war serves merely as a background noise). The film is so beautifully shot that I would recommend it even to people who don't normally like ghost stories (it does have some scary moments, mind); this one transcends the horror genre. 8 stars out of 10.<br><br>In case you're interested in more underrated masterpieces, here's some of my favorites:<br><br>imdb.com/list/ls070242495","user":"gogoschka-1","rank":[34,39]},{"title":"Masterful Spanish ghost story - an instant classic","rating":10,"date":"6 May 2005","review":"THE DEVIL'S BACKBONE (El Espinazo del Diablo) <br><br>Aspect ratio: 1.85:1<br><br>Sound format: Dolby Digital<br><br>During the Spanish Civil War, a young orphan boy (Fernando Tielve) is sent to an isolated boarding school where he encounters the ghost of a murdered child (Junio Valverde) who warns him of impending disaster...<br><br>A masterpiece. Filmed in Spain by writer-director Guillermo del Toro following his unhappy Hollywood debut (MIMIC), this spellbinding melodrama works both as an examination of the political turmoil which characterized the Spanish Civil War, and as a simple ghost story in which a tragic spirit seeks vengeance for a terrible crime. Employing restless camera-work and atmospheric set designs to their best advantage, del Toro visualizes his own script (co-written with Antonio Trashorras and David Muñoz) as the story of a vulnerable child cast adrift in a strange new world, where he must contend not only with everyday problems (such as the school bully, Ínigo Garcés, whose motives are rather more complex than they first appear), but also his frequent encounters with the unhappy ghost, some of which are genuinely unsettling (watch out for the heart-stopping sequence in which Tielve is besieged in a closet by the enraged phantom).<br><br>Production values are first-class throughout, ranging from César Macarrón's evocative art direction and Salvador Mayolas' ultra-creepy sound design, through to Luis de la Madrid's crisp editing skills and Javier Navarrete's unforgettable music score. Visual effects and makeup designs are also superb, though deliberately underplayed for maximum emotional effect. The cast is toplined by Spanish movie veterans Marisa Paredes (a favorite of Pedro Almodóvar) and Federico Luppi (CRONOS), and there are impressive turns by Irene Visedo as a young woman whose loyalties are divided by circumstances, and rising star Eduardo Noriega (the Spanish equivalent of Brad Pitt) as Visedo's boyfriend, an orphan-turned-caretaker whose volatile nature leads to a dramatic conclusion, with appalling consequences for everyone around him. Tielve is magnificent as the wide-eyed innocent at the center of the narrative, and Garcés is every bit his equal as the bully who reclaims his dignity during a climactic showdown with the forces of evil. Released around the same time as THE OTHERS (2001) - another Spanish ghost story, filmed in English as a vehicle for Nicole Kidman - THE DEVIL'S BACKBONE was consigned to Art-house distribution by virtue of its status as a subtitled movie and suffered a comparative loss at the US box-office, though del Toro's magical fever dream is unquestionably the better of the two films.<br><br>(Spanish dialogue)","user":"Libretio","rank":[84,107]}]