[{"title":"A mixed bag for me","rating":7,"date":"23 April 2005","review":"Ichi the Killer is the story of a Yakuza gang run by Anjo, whom his underlings find missing (possibly killed) with 100 million yen gone as well. The functional head of Anjo's gang while he's absent is an off-the-wall sadomasochist named Kakihara (Tadanobu Asano). There is a former affiliate gang, now somewhat rivals, run by Fujiwara (Toru Tezuka), and there are a number of gang outcasts who hang out at a bar/brothel, with Jijii (Shinya Tsukamoto) as their head. Jijii is manipulating/grooming a bizarre killer named Ichi (Nao Omori), who is gradually taking out Anjo and Fujiwara gang members for him.<br><br>If you haven't seen infamous Japanese cult film director Takashi Miike's Ichi the Killer yet and you're considering it, there is one \"test\" that might make the decision easy for you--do you like fairly regular over-the-top violence, torture and gore? If that's enough to turn you on to a film, do not pass Ichi the Killer up--you're sure to love it. This is one of the most brutal and gory films I've seen, and yes, I've seen Andreas Schnaas films. However, if those things are enough to turn your stomach instead, you shouldn't come near this film with a two-foot needle.<br><br>For me, I don't mind over-the-top violence, torture and gore, but that in itself isn't sufficient for me to like a film. Despite some admirable stylistic flourishes, including some very unique cinematography and editing as well as an unusual but extremely effective soundtrack, there were a number of things in Ichi the Killer that didn't quite work for me. I ended up liking the film, but just moderately. A 7 is a \"C\" in my rating system.<br><br>One problem I had with the film, which might be clear from the description in my first paragraph, is that the plot isn't exactly easy to follow. Writer Sakichi Satô, adapting the script from a manga (Japanese comic) by Hideo Yamamoto, introduces a large number of characters in each scene, and we do not always get their names or very clear dialogue explaining who they are. There were quite a few characters for whom I was never very sure about their identity. In conjunction with this, the film didn't always flow as well as it should have. It tends to feel like long scenes of establishing exposition alternated with violence/torture showcases.<br><br>But by the final \"act\", there are some very interesting revelations about characters and their relationships to one another. So it's not that the kernel of a good story isn't there. It's just told a bit awkwardly. This might not have been helped by the fact that Miike has stated that he was shooting for a kind of open-ended vagueness that is characteristic of Asian genre films. The impact of the revelations is somewhat dissolved by the time we get to the dénouement due to the intentional ambiguity.<br><br>The beginning of Ichi the Killer employs a lot of extended cinematographic techniques in rapid succession ala Oliver Stone--different film speeds, stocks, tinting and processing methods, and so on. While these are interesting, Miike forgets about them quickly as he works his way into the story. They pop up occasionally later in the film, as do a couple shots in the vein of Dario Argento, such as a tracking shot through someone's ear. Even when more conventional, the cinematography and production design remain admirable throughout--I particularly liked the shot of Kakihara sitting in front of a red background, with his purple coat and green scarf, but there is a lot of outstanding visual composition in the film.<br><br>Whether intended or not, Ichi the Killer frequently reads as more of a black (morbid) comedy. This is because the violence is so over-the-top that it is frequently cartoonish and ridiculous. Those are positive qualities in my book, but anyone looking for realism should beware. On the other hand, the emotional reactions from \"victims\" are fairly realistic throughout the film, including the fact that people do not die immediately after they are injured.<br><br>But Miike's concern, as with his other films, is more surrealist. The behavior of the principal characters is particularly wacky, especially Ichi, who often seems borderline mentally deficient--he cries and cowers before he brutally attacks his victims, and has a very odd sexual dysfunction associated with his violence. Ichi is also portrayed as something akin to a superhero, and Miike constantly bounces back and forth between showing him as an admirable vigilante and an anti-hero. Kakihara, who is giving something of a venerable \"bad boy\" rock star/punk persona, is also almost a hero through much of the film, and he also has some bizarre sexual dysfunctions, as do a number of other characters. This is one of the main subtexts of the film; it isn't entirely dissimilar to the later A Snake of June (2002). There is also another character who undergoes something of a superhero transformation, as he sheds his public appearance and becomes a muscle-bound avenger near the climax.","user":"BrandtSponseller","rank":[141,166]},{"title":"Over the top violence/ bizarrely fun/ Manga for the screen","rating":8,"date":"17 July 2002","review":"Be warned - as early as the film's titles - letters rising from fallen sperm - (The costumed killer ejaculated voyeuristically watching violence done by one of the other team of gangster killers).  You should either run screaming from the theater or stay for an over-the-top exercise in so much violence it becomes white noise and almost disappears.  Seen at the Cinematheque, here in Los Angeles, with an adult crowd - this unrated but surely X-cubed film was a delight to those who stayed  A few patrons fled in the middle of the screening but most got the point.  Bad guys pursuing bad guys - with genre formula being trashed at every point - the humor built and built.  Any good characters (children included) were decimated or tortured.  None were spared.  Yet the film is a romp - from the complaining co-workers who grumble about having to clean up blood-drenched murder scenes (they found intestines everywhere) to the sado-masochistic special effects.  The film has left turns into fantasy - then back again - it has intentional bad-acting scenes (from previously capable actors)- the camera work has a will of it sown - exposition that makes no sense.<br><br>This film posits the questions: If you are going to be a bad-boy film director and take screen violence as far as it can go - no farther than that - NO REALLY FARTHER THAN THAT - to the point of blood almost every minute - what would the result be?  Apparently the director feels that on the far side of excess violence and blood letting in glorious technicolor and grotesque special effects, the cinema would revert to a twisted sense of innocence (beyond all that killing there is a comic sense of the universe).<br><br>A film that should be seen - but you should be prepared for it.  Not a classic - but a definite statement - more a cinema-artist's statement than a traditional film.  Museums will find a place for it - families will abhor it.<br><br>I got into it to my amazement.  It stretched my mind about what should be so.","user":"ScriptDr","rank":[71,83]},{"title":"Genuinely disturbing and intensely shocking but very brilliant","rating":8,"date":"8 January 2006","review":"Ichi the Killer is definitely not a film for people who have weak stomachs or who are easily offended. This film contains some of the most shocking images you'll ever see and includes some very disturbing characters that won't be forgotten in a hurry. It is always a very brave move for a film maker when they decide to adapt from a manga as manga often has aspects within it that can not be replicated in to a live picture. Takashi Miike makes the transition possible and blows away all walls of reality with an outstanding and totally unforgettable film.<br><br>The plot involves Yakuza boss Anjo going missing with a huge stash of cash, his gang members investigate and a classic game of cat and mouse is involved. This seems simple enough but what is out of the ordinary is that the leader of the investigation, Kakihara (Tadanobu Asano), is a major masochist and Anjo's killer, Ichi (Nao Omori) is the ultimate sadist with a tormented soul. This is where Ichi the Killer's shocking and graphic imagery really come in to force. Miike is uncompromising in his approach with regards to what he delivers on screen. There are no subtleties, no off camera goings on; it is all there for the audience to see, in full detail! The torture scenes, and their results, are especially horrific. If this film had been made in America or Europe, it would have been banned within a second of being made, it's that graphic. What disturbed me more than the disgusting imagery however, were the characters. Ichi's character I found genuinely terrifying as whilst he often comes across as a cartoonish character, there is a disturbingly real quality to his character. Ichi's childlike naivety draws many parallels to past psychotic killers that have existed in real life and his sexual excitement at causing pain and death is incredibly unsettling. Also unsettling is the character of Kakihara. His badly scarred face and clips either side of his lips immediately make him appear a scary figure and the only thing more disturbing than his pleasure for torturing others and watching their pain is his unparalleled love for being beaten and tortured himself.<br><br>What I like about many Asian films is that the acting is often very good and Ichi the Killer is no exception. Tadanobu Asano is brilliant as Kakihara. His performance is charismatic and terrifying, he does a great job of making the role his own. Nao Omori plays Ichi perfectly. The way that he can act tormented, childish and merciless all in one scene is incredible to watch and, as I said before, gives the film a genuinely disturbing edge rather than just immense gore. Alien Sun is very sexy as Karen and the way she speaks more than one language in an almost random fashion adds further mystery to this film. The fact that Karen is the only character who has Ichi's past explained to her from Jijii makes the audience able to empathise with her character more than anyone else. Shinya Tsukamoto is also very good as Jijii. His character is unravelled throughout the film and Tsukamoto is very convincing in his portrayal of what turns out to be a very complex character.<br><br>The purpose of this film is to shock and it achieves its goal to the point where you almost can not watch. With extremely graphic gore and some intense surrealist imagery that Salvador Dali himself would have been proud of, Ichi the Killer will never be forgotten and deserves to be watched by a lot more people (even if they can only watch it once!). Miike is very clever with his direction. The way he blends Kaneko's flash back sequences with the present does wonders to keep the audience's attention. The ending is also done with great style and is very effective in ending the film so it is down to interpretation of the audience.<br><br>Despite being very hard to palate, Ichi the Killer is a fantastic film. Directing, acting, writing and score are all spot on and the quality of the film is very good. Not a film I could handle watching too regularly but definitely a film I'll want to watch a few more times in the future.","user":"Lt_Coffey_182","rank":[94,118]}]