[{"title":"a radical movie about love and torture","rating":8,"date":"17 June 2005","review":"A very impressive movie where the main character has to face humiliation and sufferings, while the narrator keeps observing her without doing anything to relieve her. The dramatic side of this movie is really fascinating and makes it a strong aesthetic choice. Olga Karlatos, the principal actress, is beautiful and radical. In the heart of the movie lies a true love relationship between the actress and the director. Love is also made of tortures. The movie also deals with the problem of torture during the Algerian independence war. It denounces radical patriotism. The director, Nico Papatakis, was also a producer. He helped John Casavetes to finance \"Shadows\". He also produced Jean Genet's only movie.","user":"jsord","rank":[18,24]},{"title":"An unflinchingly radical little-known near-masterpiece.","rating":8,"date":"4 April 2020","review":"The Greek/French director Nikos Papatakis has not made too many films, and this one may be the closest he had ever reached towards cinematic mastery. An extremely radical political drama, this film chronicles the journey of the protagonist Galai (played with a certain maddening quality by Olga Karlatos), an actress of political torture B-movies made by her husband Hamdias. Now Hamdias is also secretly a anarchist revolutionary of the Palestinian Liberation Front, absent throughout the course of the film due to some underground operation, leaving Galai and his editor to finish his latest torture film and arrange a screening for distributors. Under this complex premise, Papatakis explores and criticizes the role of artists, intellectuals, filmmakers etc who take pride in calling their art 'revolutionary' while living under the safeguard of their bourgeoisie producers and patrons.<br><br>Exaggerated and talkative at places, one can easily understand the lack of love it received (just look at its modest rating itself) because of its anti-israel and its anti- 'white-liberator' stance. Having said that, one might argue that its brilliant final act is politically somewhat ambiguous. The film within this film (the torture film made by Hamdias) is harrowing enough to call for such dramatic expanse. A definitely difficult watch, understandably more so by the European audience, but extremely rewarding as you begin to identify with the opinions presented here.","user":"shanbhattacharya_","rank":[1,1]}]