[{"title":"Just what I needed, When I needed it","rating":10,"date":"24 November 2006","review":"I never thought that a movie would change my life. I never dreamed that a message could come through so loud and clear, as this movie's message. On the corporate treadmill, I was running faster and faster and creating a really chaotic life for my family. I nearly lost them, the family; to a corporation that did not love me, care for me, or nurture me. I got off of the treadmill, and took a less demanding job. I sleep in my own bed at nights with the woman I love. The frequent flier miles and first class upgrades, and huge bonuses are all gone but not missed. I named the llc company that holds our real estate investments ICHUZUS (I Choose Us) from the movie quote. I can't help but think that this flick has positively affected many people's lives. Many thanks to the writers and those that brought it to life. Take care, I chose us.","user":"dacole1","rank":[259,280]},{"title":"Loved it.","rating":10,"date":"30 July 2007","review":"This is a heart-warming, if somewhat sentimental film at times, but with a superb cast, and very well written. The chemistry between Cage and Leoni is something quite rare - in fact, I can't think of a film with such amazing chemistry between the two leads.<br><br>As far as the storyline is concerned, I don't have too much to add to the comments that are already posted. Whatever limitations the film's storyline or premise has, the individual performances rise above it.<br><br>In the DVD extras there is an interesting comment by the producer where he says he challenges any man to watch the film and not want to live with Tea Leoni and I must say I wholeheartedly agree with him. To be fair her character is completely idealised (naturally beautiful but unaffected by it, intelligent, insightful, sexy, gracious, humble, caring, unstoppably positive and non-demanding). Have you ever met anyone like this in real life?<br><br>I enjoyed this film so much that it just about creeps into my all time top ten. The only reason a romantic comedy made it in there is because the performances and the chemistry elevate the film above any other romantic comedy I have seen, both before and since.","user":"seshy","rank":[64,69]},{"title":"Worth watching more than once","rating":10,"date":"3 October 2003","review":"\"The unexamined life is not worth living.\"  Plato put these words in the mouth of Socrates.  Brett Ratner puts this theme into `The Family Man.' This is not \"It's a Wonderful Life.\"  While it is a \"feel good movie,\" it is an intelligent, reflective one.  Neither of the parallel lives led by the main character is shown to be flawless.  Both have their attractions.  Jack, the lead character, is forced from his comfort zone by a \"glimpse\" of a life connected by commitment and love to friends and family.  This movie does something for me few \"feel good\" movies ever come close to causing.  This movie makes me think about what I really value in life.  Both pro-capitalist and pro-family, \"The Family Man\" either leaves you pondering whether your life is consistent with your values or goes over your head and leaves you with the impression that your emotions have been manipulated by another crass commercial Christmas movie.  It depends on what the viewer brings to the table.<br><br>P.S.  Tea Leoni's shower scene has got to be the sexiest portrayal of a movie mom I ever saw.","user":"Tom4Surfing","rank":[169,194]}]