[{"title":"Underrated","rating":10,"date":"5 April 2007","review":"Scooby-Doo is a worthy live action film to a brilliant original T.V. show<br><br>Plot: The Mystery Inc. gang have split up and are each off on their own, only Scooby-Doo (Voice of Neil Fanning) and Shaggy (Matthew Lilard) remain together and they own the Mystery Machine. They are called back into action when a strange man shows up and invites them to Spooky Island to solve a mystery. They are convinced when he mentions an all you can eat buffet and are on their way to the airport. There they run into the rest of the gang, Fred (Freddie Prinze Jr.), Velma (Linda Cardellini), and Daphne (Sarah Michelle Gellar). Still resenting each other they refuse contact and once on the island they meet the owner, Emile Mondavariours (Rowan Atkinson) who informs them of the problem. He believes that somebody is casting a spell on the visitors who come to his resort. Starting off on looking for clues by themselves the gang realizes after a attack that they need to put their differences aside and team up if they ever want to solve the mystery.<br><br>The Good News: This being the motion picture film to a T.V. series that spawned thousands of imitators it had a lot to live up to and it delivers. Since it was released people have bashed this film to pieces, but if you take a minutes and look at it closely it is a pretty underrated film. The actors all do an outstanding job at bringing the gang to life. At first glance Freddie Prinze Jr. may seem like the wrong choice, but he fills Fred's shoes amazingly well with adequate skill. Linda Cardellini portrays the brainy smart Velma we all know, but Linda plays her with a sensitive side which is new and a a nice choice. Sharah Michelle Gellar is the shining light here bringing warmth and believability to her character as Daphne, everyones favorite danger prone female who proves she is tougher than most think in one of the film's best scenes. Matthew Lillard plays Shaggy well and plays off of Scooby-Doo well even though there was nothing there during filming. Lillard's acting is a key success to the film. It doesn't matter how well the CGI Scooby is made Lillard really has to bring it to life by make believing that Scooby is actually there. The whole thing could have gone completely wrong, but luckily this escapes that. Now the question that most people are asking. How does Scooby-Doo stack up? Neil Fanning's has to be the best since the original and the CGI Scooby looks pretty convincing. The action is a big part of this film as it plays a huge part. There are plenty of action scenes to keep you interested. My favorite one probably has to be the castle scene, a ten minute romp where the gang uncovers clues and it all ends in a big bang, but there are many more to more than fulfill your attention. The screenplay keeps thing's nice and simple and so is the direction. Constant and flashy cuts would've gotten in the way here so the direction they took works the best. The film all ends with more action scenes, big bangs, and many great twists. This could've been a lot worse.<br><br>The Bad News: The could've taken out the crude humor, but that's my only complaint<br><br>Conclusion: See this at any cost if you are a hardcore Scooby-Doo fan and others will all so want to check this out. Recommend<br><br>Rated: PG","user":"jason06-1","rank":[47,51]},{"title":"Scooby-Doo in Spooky-Island","rating":28,"date":"28 April 2018","review":"I don't understand why so many dislike this movie because I think it's the complete opposite. This movie has what you would expect to see in a Scooby-Doo show. I'm a huge fan of Scooby-Doo, and watched the animated series on Cartoon Network, so it's inevitable I would go and watch this, and I wasn't disappointed by it for the most part. Scooby-Doo was fun, entertaining and interesting from start to finish. It definitely had the mystery element in it especially once the gang headed into Spooky Island - that was my favourite part of the movie. I don't know about you, but this movie had me guessing right till the end, and I was very surprised to say the least. That's why I rate Scooby-Doo pretty highly. It's a good movie to watch when you're having snacks or \"scooby snacks\" or something.","user":"Min111","rank":[25,27]},{"title":"Great movie","rating":9,"date":"7 January 2018","review":"I remember watching this movie when I was about 7 and I really loved it. \nThis movie is defiantly a good joy ride for new and old Scooby Doo fans.\nI haven't seen this movie for ages so bare with me if I can't remember everything.\nThe best parts where when the creatures attacked the house, the flashback with scrappy, when a guy was about to sacrifice a chicken and the last scene. \nOverall it's an adventurous movie and I would recomand it.","user":"WeAreLive","rank":[22,24]}]