[{"title":"Criminally Underrated","rating":9,"date":"24 April 2004","review":"Admittedly, DEMONLOVER makes a sharp left narrative turn at the halfway point that's going to confound viewers who are intrigued by the straightforward (and extremely absorbing) high-stakes opening.  But that's no reason to dismiss the many, many things that writer/director Olivier Assayas gets absolutely right.  In the end, DEMONLOVER is a fascinating mirror-world reflection (as William Gibson would call it) of where our global society might be just five minutes from now:  the fittest who survive will be multilingual, career-consumed and ridiculously chic, but also soulless, as if missing the gene that supplies a sense of loyalty and ethics.  The movie is a cautionary, though entirely plausible, tale of humans debased by their own lust for ungoverned capitalism.  Every line of dialogue is about the business merger at hand; in the rare instances where feelings are discussed, they're usually about how *work* affects those emotions.  The big wink here is that the characters don't even discuss business honestly, because each has duplicitous motives.<br><br>Technically, DEMONLOVER is a feast.  Denis Lenoir's widescreen photography constantly dazzles -- many of the tracking shots are sustained in close-up (creating paranoia), and the color spectrum appears as if filtered through corporate fluorescence.  (The neon-drenched Tokyo sequence is particularly hypnotic.)  Jump cuts keep the narrative one step ahead of the audience. Sonic Youth's atonal guitar score creates the same mutant environment that Howard Shore pulled off in CRASH.  Most significantly, Connie Nielsen's face (and hair and wardrobe) mesmerizes more than any CGI I've ever seen. Considering the labyrinthine motives of her character, Nielsen's exquisite subtlety may be lost on first-time viewers; on second look, her emotionless gaze speaks volumes.<br><br>Audiences (and critics) have unanimously attacked the `problematic' second half as an example of directorial self-indulgence.  While I agree that it's not as satisfying as the first half, I don't think it's a total crash-and-burn (pardon the pun).  Clearly, the ending is open to thematic interpretation, but I think Assayas is just saying that if our species isn't more careful, we'll end up like one-dimensional characters in a video game of our own devising - sure, winner takes all, but the rest of us suffer enormously.<br><br>Narrative ambiguity aside, DEMONLOVER is the great Hitchcockian/Cronenbergian espionage fantasia I've been waiting for.  It makes sense that it would come from Europe, since Hollywood forgot long ago how to make their assembly-line genre exercises intellectually stimulating.  (Like the animé porn within the story, Hollywood movies today represent no more than a calculated corporate commodity.)  More than any other film from the last 2½ years, DEMONLOVER seems a product of the post-9/11 world - a not-so-distant future where overwhelming paranoia goads us to preemptively eliminate any form of potential competition before it can do the same to us.  And how in doing so, we devour our own tail.<br><br>I expect this movie's reputation will grow by leaps and bounds in the coming years.","user":"arturobandini","rank":[72,85]},{"title":"Bleak vision, very good movie","rating":9,"date":"16 October 2003","review":"First off, the movie's plot DOES make sense.  I'll address that below, after the Spoiler Alert. <br><br>It's a very interesting movie, thematically, visually, aurally. I summarize the theme as `Who's the top now.'  (By `top' I refer to the sadomasochistic term for the dominant partner.)  It sees corporate life, in particular, and modern Western culture, in general, as a soulless contest for dominance among individuals, who have no meaningful connection to other people beyond the dominance-submission relationship.  Life has been reduced to a video game, in which winning is everything; consequently, life has been reduced to something as \"spiritually\" and socially empty as a video game. Demonlover is a serious condemnation of the culture we shaped and which in turn shapes us.<br><br>Much of the camerawork is relentlessly close-up. There are even relatively long tracking shots where you never have enough distance to see in any one frame much more than a hand, or a skirt, or a car door.  It makes the movie exciting to watch, even when all you're watching are yuppies negotiating or driving from one place to another. It also helps present the theme of characters with no moral distance from what they're doing, with no `perspective.' It makes everything Go-Go-Go, just like in a video game, where something is always coming at you, or like in the `go-go' make-a-buck corporate world.<br><br>Nobody has faulted the acting. Nielsen is great, a desirable top in the first half, if ever I've seen one! And I've never seen Berling before, but I'd be happy just watching that pleasant slimeball eat and talk for thirty minutes straight.  (If you cast HIM in My Dinner with Andre it would instantly have a voluptuously seamy quality!)<br><br>As for the pornography scenes, Assayas shows almost nothing. It's an especially NON-explicit movie. Not only is it neither erotic nor titillating, it actually shows less graphic violence, sex, and nudity than the average R-rated movie these days. It is not at all `exploitative.' Critics are taking offense at the meaning and implications of what is shown, not at the graphic content.<br><br>SPOILERS BELOW<br><br>I've seen reviews that think the plot falls apart after `the first half,' which means after Gershon and Nielsen fight. What happens is that both women black out, and then Sevigny and cohorts clean up the mess, perhaps dispose of Gershon (it doesn't matter), and `rescue' Nielsen. Then she finds out that Sevigny ALSO is an undercover agent. Sevigny in the meantime, while Nielsen is knocked out, has managed to climb the corporate ladder, so that their roles are reversed  both at Volf AND as spies for Magnatronics. (Maybe Sevigny worked for Magnatronics from the start, or maybe she was co-opted later; it doesn't matter.)  As someone playing her role in a dominance-submission relationship, she is then stuck as a submissive, and acts it. It's not out of character. She is just no longer the top she thought she was.  <br><br>The plot doesn't go haywire; it's just that Assayas has fun with us, as we find out that Karen is familiar with the ways of Magnatronics and then, finally, that Sevigny actually works for Berling. In other words, EVERYONE we've met at Volf, except Volf himself, is actually an undercover agent. The company is a shell full of people who are not on its side, who are only out for themselves and are, through greed and deceitfulness, actually in the employ of their employer's enemy.  Just as the society is shown to have no values outside of individual success and dominance, so it is shown, to an absurd extreme, within the analogue of the Volf Corporation. The DNA molecule at the end of the movie fits this theme: stripped of the overlay of cultural illusions, it's all just survival of the fittest, each gene-set for itself.<br><br>Finally, I want to comment that Nielsen's reaction to Berling in the bed scene makes sense, too. While who is the dominant is undecided, she seems to be into the sex, undoing his belt, etc. But then he asserts his dominance, and the scene turns into a rape. They couldn't really have balanced consensual sex, since it's about winning, not about love. Hence he takes the dominant role, forcing intercourse (even though she clearly was heading there anyway!). Next it's her turn to `win,' his having just trumped her with male physical strength: she uses the equalizer.","user":"panspermia","rank":[34,44]},{"title":"Ghosts In the Machine","rating":4,"date":"4 October 2003","review":"One of the great things about the French is their interest and promotion of THEORY. Sometimes when theory infiltrates Art in too direct a manner the results can be boring or pretentious. In the case of demonlover neither is the case yet the end product doesn't measure up to its individual parts which are brilliant. Suffice it to say this is not a movie for the squeamish or for fans of the character building qualities of a life in business. What the film shows is how much of a construct modern identity is; how much it depends on role, on possessions, on our relationship to the pecking order of whatever tribe we find ourselves in. The film also suggests that the price we pay for hanging on to this fragile identity is nothing less than the seeds of our destruction - a doorway in fact to depression, madness and perversion. Lastly, the film is a devastating look at the way big media corporations hide their involvement in anti-social projects under the veneer of 'just business' or, if they went to the Harvard Business School, 'shareholder value'. Its a rare thing to make an interesting movie with NO sympathetic characters but demonlover achieves this. Many complaints have been launched against the incoherent plot, but the fact is that the plot is not incoherent at all, it just lacks credibility which is a different matter altogether. But no matter: its still an interesting take on a very real set of contemporary circumstances. The performances are also quite compelling which suggests that no matter how dubious a character's morality is, if she's beautiful we (men, that is) will hang on her every word.","user":"mjmkeating","rank":[26,37]}]