[{"title":"K-19: The Filmmaker","rating":10,"date":"28 May 2005","review":"Based on a true story, K-19: The Widowmaker tells of the Soviet Union's attempt in 1961 to not fall behind the United States in the Cold War. The United States had just launched the Polaris-class nuclear submarines. K-19 was a Russian sub retrofitted for nuclear capabilities. The Soviet crew's assignment was to take the sub into the Arctic and test fire an Intercontinental missile. The Americans would monitor the test as a part of routine surveillance--the test was done relatively close to a NATO outpost for one, and it would notify them that the Soviets had equal capabilities to the American Navy, helping to either stave off war, sustain the Cold War, or both, depending on your interpretation.<br><br>As the film begins, K-19 Captain Mikhail Polenin (Liam Neeson) is running his crew through a routine simulation. The nuclear reactor ends up having a problem, as it had on previous simulations. Polenin says they're not ready to run the mission yet. Instead of listening to him, the Soviet military powers that be install a new Captain--Alexei Vostrikov (Harrison Ford). Vostrikov is a hard-ass, which doesn't help him go over well with the K-19 crew, who were used to being chummy with Polenin. To make matters worse, Vostrikov has a questionable reputation--many believe that he's only in his position because of familial influence, and this despite the fact that his military father ended up in the gulag. After a number of bad portents, the sub is off on its mission and Vostrikov tries to get the crew into respectable and responsible shape so they can complete their task and get back home. As foreshadowed by the prologue, the K-19 eventually has a crisis with its nuclear reactor. The bulk of the film tells of this dilemma, attempted solutions, and various problems it causes.<br><br>K-19 is incredibly suspenseful and emotionally poignant. But it's perhaps amazing that it creates such nail-biting tension when we consider that on the surface level, it is simply a drama about a piece of machinery. Most of the plot is about trying to fix a broken gadget.<br><br>That might not sound very exciting, but there's much more to the film that a superficial glance at its plot would indicate. Director Kathryn Bigelow makes K-19 a combination of extended character portraits--primarily of Vostrikov, but also of a handful of other K-19 crewmembers, and a subtextual exploration of formal organizations and hierarchies in general.<br><br>Of course, the film is also a tribute to the real-life sacrifices and heroism of the K-19 submarine crew, who couldn't tell their stories for many years due to the Soviet government's official squelching of the incident. And on that end, the film is also a remarkable and perhaps somewhat controversial (politically and even artistically/philosophically) attempt to tell a serious, \"balanced\" historical story from a perspective \"within\" another culture.<br><br>Ford's performance is top-notch. He easily coaxes viewers to first hate him, even if they can understand his motivations, then he gradually layers complex nuances of character until we finally turn our opinions about Vostrikov around and empathize with him--but after not a little skepticism, which lingers for most of the central portion of the film--finally rooting for him against those government meanies who just can't understand his decisions because they weren't there. The whole arc easily takes film viewers on the same emotional journey the K-19 sub crew would have had.<br><br>Neeson has a similarly complex arc, but much more subtle--fitting for his supporting role. He goes from being your best buddy to someone to be suspicious of, then someone to be disliked for being a hard-ass of a different sort, then finally he surprises the audience with a saving grace action just about the same time that we realize that Ford as Vostrikov was right all along.<br><br>The film would be worth watching for just these two fine performances. But the crewmembers featured are just as sympathetic, especially when they make their mind-boggling sacrifices.<br><br>The progression of the matrix of dynamic personalities, their judgments, reservations, disputes, and suspicions, their pressing on despite less-than-perfect circumstances, and their relation to edicts from on high resemble what is probably more the norm for any complex, formal organization--not the least of which is the film-making enterprise, and more than likely, wherever you earn your daily keep.<br><br>Most of us have been involved with vocation-oriented projects or tasks that have had to progress despite the fact that a lot of people (involved or not) thought there were problems with the project or task at a fundamental level. This happens in films all the time. Studios and producers demand that a film begins production, maybe because it has to meet a particular release date, maybe because of marketing tie-ins and on and on, yet there still might not be a finished script, or we still don't know who is going to be cast as the villain, or any number of potentially disastrous situations. Vostrikov is like a film director being told to turn in a product on a tight deadline. He's doing the best he can to get the film rolling, and that means getting the crew to stop goofing off so they're ready to shoot, especially if the pressure becomes greater. It's probably a good thing that films don't run on nuclear reactors.<br><br>Of course the more literal political dilemmas that arise later on in the film are equally fascinating. But the humanizing elements of the characterizations and the universalizing elements on the story are what make K-19 hit home so hard. They add to the intriguing historical drama, the great direction and the good cinematography, score and other technical elements to easily push K-19 up to a 10.","user":"BrandtSponseller","rank":[125,150]},{"title":"Memorable For The Radiation Scenes","rating":7,"date":"15 July 2006","review":"This was a pretty solid supposed true story of a Russian submarine and its captains during the early 1960s. It's memorable, story-wise, for the radiation victims among the crew members. There are some really dramatic scenes involving that horrific event. Otherwise, it's a story of the sub's problems and the conflict between two captains.<br><br>The story starts slowly so you have to stick with it as it gets better and better as it goes on and rewarding enough to make you glad you hung in there for the whole 137 minutes. <br><br>Profanity is minor and the Russian accents are handled well by the lead actors, led by Harrison Ford, Liam Neeson and Peter Sarsgaard.<br><br>It's not a great film, but it's good and interesting enough to recommend a rental, but not something I'd watch numerous times. Those radiation scenes would be a little too grim to watch numerous times.","user":"ccthemovieman-1","rank":[59,72]},{"title":"It's frightening how close we came...","rating":8,"date":"10 May 2008","review":"K-19 has a massive cast, especially in the two lead characters of Mikhail Polenin (Liam Neeson) and Alexei Vostrikov (Harrison Ford). My understanding is that Ford wanted to take on a role different than ones he had taken in the past to prevent type-casting, and while he does a good job in his role (as does just about everyone involved), the movie does slip up a little bit by having an almost nonexistent Russian presence in what is supposed to be the story of a Russian submarine.<br><br>Comparisons to the far superior Hunt for Red October are inevitable, and it is interesting to note that that movie was also about a Russian submarine but was presented all in English, but it doesn't lose credibility the way K-19 does, probably because it at least maintained a Russian accent, while Ford is speaking an unmistakable American accent and Neeson, well, Neeson is just Neeson and that's always good. He makes a great German but is less convincing as a Russian. I don't know why.<br><br>Nevertheless, as a story about an extremely important submarine mission rife with problems the movie succeeds brilliantly. K-19 is basically Russia's protection again nuclear war, which they fear the Americans might start at any moment. They hope to deter attack by showing evidence that they can issue destruction in return, and it is because of this that the sub is commissioned and sent on a mission to the polar ice caps to launch a test missile. There is a great scene where all of the crew and many other people are witnessing the launch of the submarine, and a woman swings a bottle of champagne on a rope to smash against the hull, but it bounces off unbroken. \"We're cursed,\" one of the dismayed crewmen says. That woman must have felt terrible.<br><br>There is an immediate rivalry between Polenin, who understands the ship's limitations and wants them corrected before beginning the mission, and Vostrikov, who also understands the ship's limitations but also understands how important the mission is and so outranks Polenin's protests. One of the best things about the movie is that the dramatic action is pushed along by genuine concerns. The movie would have suffered terribly if they were ignoring such important problems with the submarine without good reason.<br><br>One of the best things about the movie is that it is able to create so much dramatic tension, even though it takes place during peacetime. There was a huge amount of political tension in the air, but there wasn't a war going on. This is why there is not a lot of concern shown when an American destroyer is sighted near the submarine, because one of the goals of the mission is for the Americans to see what they're doing.<br><br>Instead, a small leak aboard the nuclear sub becomes a problem big enough to potentially start a war. Incidentally, one of the crewmen noticed something wrong with one of the dials at least twice before the leak was discovered (once before the ship left port). Had he reported that problem when he first noticed it, he could have saved the lives of everyone who died because of the radiation and prevented the entire thing. At any rate, once the leak is discovered, the options are to abandon ship and surrender the crucial technology to the Americans (a single concession which could dramatically alter the futures of the two nations, and thus rendering it unacceptable), try to repair the reactor without sufficient protection against the radiation, or scuttle the ship (also unacceptable because of the boat's importance).<br><br>There is a tense scene where Vostikov orders the ship to dive to almost crush depth, one of the obligatory scenes in submarine movies where the hull creaks and groans and everyone stares at the ceiling, like there's something to see there, and then he orders the ship to ascend at breakneck speed, surfacing through a layer of ice. Vostrikov intends to push the boat and the men to the limit so that they all know what the limit is, but unfortunately it culminates in a hugely disappointing display of digital effects as the ship breaks through the ice in something that looks more like it belongs in a cartoon than a serious film like this (I was reminded of the unfortunate Scrat's efforts to save an acorn from a splitting glacier in Ice Age).<br><br>The film requires an extra bit of suspension of disbelief to accept a story about a Russian submarine but without any Russian actors. I'm curious to know how it was received in Russia. I imagine it was a hit, despite the lack of Russian presence in the film, because it illustrates their courage and dedication to their country in the most difficult of times. But nonetheless, it is hugely effective and never lets up once it gets going. The ending strikes me as the part where the most creative liberties were taken with the original true story, leaving you with the feeling of a Hollywood ending imposed on a true story from Russian and American history. But if nothing else, the movie is a fascinating look at how close we came to widespread destruction during one of the most tense times in modern history.","user":"Anonymous_Maxine","rank":[30,35]}]