[{"title":"An excellent use of time.","rating":7,"date":"9 January 2005","review":"I'll keep it brief - I appreciate this movie a whole lot. When I got it I really was expecting something different, so for the majority of the movie I was disappointed, considered the plot and characters mediocre. But the last two minutes of the movie made me rethink the entire thing, man... I can not promise you an amazing ending or anything like that, because most people probably saw it coming, all I can say for certain is that it sure did affect me. I thought it would just be all typical and uninteresting and everything but having a meaningfully strung conclusion like that set my head straight and made me see what it was all about. Now I can't wait to watch it again. I consider this movie a well done story with good acting and a nice enough plot. It has strong aesthetic value through it's good looking images/scenery, too. Of course it made me completely depressed. The stories that are supposed to be life-affirming are always the ones that make me the most depressed, \"A Year of Impossible Goodbyes\" was supposed to be a life-affirming adventure but it's the saddest book I've ever read!","user":"DeusExKatrina","rank":[25,27]},{"title":"Wonderful Film For All Ages","rating":9,"date":"2 October 2003","review":"I can be a pretty cynical fella, but I had actually read the young adult novel this film is based on and really enjoyed it. The message of the book is brought to the screen and I was thoroughly impressed with the adaptation. A fine cast does great work and Ben Kingsley has a field day playing the mysterious Man In The Yellow Suit. The film is a little slow going in the beginning but all the strands and backstory must be laid out and once it gets going - the film moves with a beauty and tenderness that is rare. The music score is lovely as is the cinematography but overall, the message of the movie is what is special - it is not how LONG we live, but HOW we live. A beautiful film - for kids 9 and up.","user":"shark-43","rank":[48,55]},{"title":"Excellent fantasy film","rating":10,"date":"20 February 2005","review":"A young rich girl (Alexis Bledel) in the early 1990s, meets and falls in love with Jesse Tuck (Jonathan Jackson). The problem is that he's part of a family that are immortal.<br><br>I read this book in college as part of a Children's Literature class. I love it! I thought it was just incredible. I never saw the 1980 version of this and when I heard Disney was going to redo it I expected the worst. Fortunately I was wrong. Disney made a quiet, beautiful, charming fantasy film. They don't overdo the sentimentality (as they could have) and make the story quite moving and engrossing.<br><br>This is also a rare film where virtually every performance is good--especially Bledel and Jackson. But Sissy Spacek, William Hurt, Amy Irving and Scott Bairstrow also turn in very good acting. And Elisabeth Shue narrates and does an excellent job.<br><br>This is beautiful--well-directed and acted with a sweeping music score. I was captivated from beginning to end. This failed at the box office but it really should be rediscovered. I give it a 10!","user":"preppy-3","rank":[43,49]}]