[{"title":"I Like Big Butts and I Will Always Lie","rating":7,"date":"6 January 2009","review":"This movie makes me ashamed of the modern soft-core American porn that I see on the premium cable channels. Every part of a woman's body is shown, without apologies. You could say that no punches have been pulled; HOWEVER, the sex and nudity aren't treated as punches. Penises, both flaccid and erect are shown, as if the average adult actually knew what one was.<br><br>It is a beautiful movie, if one likes the female form. The movie's star is gorgeous with no silicon or evidence of a personal trainer. There is a plot, but it doesn't get in the way of the movie very much. The dialog is stupid, but sincere. They don't make movies like this anymore and I doubt that they ever will.","user":"masercot","rank":[35,39]},{"title":"Decent, light-hearted softcore rubbish","rating":6,"date":"6 November 2007","review":"Cheeky is actually a much better film than most of the crappy softcore porn stuff out there. It's directed by Tinto Brass; the same director who gave us 'Salon Kitty', a film that I've been meaning to see for ages and have never got round to, in spite of the fact that I have a copy. Anyway, for most of this film the camera focuses on Yuliya Mayarchuk's backside, but it's a nice backside so that isn't really a flaw. Yuliya Mayarchuk and her backside take the lead role, and she stars as a girl named Carla; who is on the lookout for some flats, right near a park filled with perverts and horny couples. She goes to an estate agent and meets a sexy woman named Moira, who wants her. She rents a large apartment and Moira gets her own way, and this causes trouble as Carla is in a relationship with a young man named Matteo. Naturally, Matteo is none too pleased with the way that his girl parades her assets all around town. He comes to London, and the pair has an argument over the pictures that he found in Carla's bedroom.<br><br>How much you like this film will largely depend on exactly what you want to get out of movies. If you're looking for something deep and meaningful, don't see Cheeky - but if you just want some cheap and cheerful softcore porn, then this could be for you. There's plenty of nudity, and the leading lady's body gets completely exposed on numerous occasions. There is a lesbian subplot, which is always nice to see and the scenes between the women are actually quite well done. The fact that they're both really hot helps a lot. There are also some regular sex scenes, and plenty of teasing and general nudity. It's all extremely light-hearted; there's plenty of scenes that see the lead in a flimsy short skirt which is being blown about by the wind, and if you ask me; that sort of stuff pretty much sums this film up. It's always obvious where the plot is going - usually another sex scene - so there's not a lot of surprises. There's a couple of scenes that take place to music which are decent, and that's pretty much all I have to say about this one.","user":"The_Void","rank":[32,39]},{"title":"good eye candy-lesbian experimentation-voyeur style","rating":5,"date":"21 August 2006","review":"This movie was pretty shocking at first, but shortly became just ridiculous, it was filled with silly scenes, and no real plot, lots of genitalia even more than derrière. If you are looking for a titillating, plot less, sex-filled, gratification centered, Italian dud...this would be my pick. I suppose it would have helped to know that subtitles weren't available on this film, but after a few minutes one understands that no subtitles are necessary, as it is easy to figure out, without them. Good to watch if you are enticed by lipstick lesbian love, and Italian horny boys and girls doing it. Great eye candy, and masturbation material/sex material. It was visually and physically exciting, but mentally void of anything worthwhile.","user":"n_thread","rank":[46,58]}]