[{"title":"Well, I liked it!","rating":7,"date":"9 October 2007","review":"So many people have already written reviews of this movie, which has been out for five years now, that I am not going to go into detail about the plot, or the acting, or whether the storyline is predictable, or how cute Ty Posey was. I am merely going to say that I watched it tonight for the first time with my 13-year old daughter and we both enjoyed it immensely. I found Jennifer Lopez a bit stiff in places, but overall she handled the role well. I do not understand why so many people had problems with Ralph Finnes in this movie, I found him not only believable but incredibly sexy, and I hope he gets the opportunity to do more romantic comedies! Bob Hoskins stole every scene he was in. Stanley Tucci chewed scenery. Natasha Richardson was suitably selfish and blonde. New York was lovely. The dog overacted shamelessly. The movie was not perfect, but it was delightful. The only wrong note was the series of magazine covers at the end, showing what happened to the characters; it was much too \"cute\" and rather unbelievable (all three of her maid friends become hotel managers?) And I was rather disappointed that - for all the film's brave talk of crossing social barriers - the movie ends with nothing more than a magazine cover with the headline \"A year later, they are still together\". I felt cheated.","user":"MusicalMagpie","rank":[41,54]},{"title":"Defining Moments","rating":7,"date":"17 July 2010","review":"This is a warm-heated story with a predictable plot. It may not be a great film, but but it is good entertainment. And the highlight of the movie may be hidden in a soliloquy, rather than revealed at the end. Every good story offers hope and this film delivers that. Its characters also experience transformation thanks to several easily-overlooked defining moments. So watch and enjoy the film for entertainment. Then watch it again, and again, for the pleasure of discovering the tapestry of truths it contains.<br><br>This is every bit as good a film as \"The Wedding Planner\" and Fiennes portrays a politico who learns the world doesn't revolve around himself. To some that might seem like fantasy, but it doesn't detract from the story. The supporting cast is a delightful menagerie. And perhaps the best role is that of Lionel Bloch, played by Bob Hoskins, who portrayed Smee in \"Hook.\"<br><br>This isn't just another chick flick. And guys may need a few Kleenex. They will definitely be glad that Jennifer Lopez didn't wear another dress.","user":"writestuff-793-816916","rank":[16,19]},{"title":"Wonderful \"Feel Good\" Movie","rating":10,"date":"11 May 2003","review":"So you'll know where I'm coming from, some of my favorite movies are \"Parent Trap,\" \"Father of the Bride,\" \"Kate &amp; Leopold.\"  If you like these kinds of movies that leave you feeling good and happy about life, then you'll enjoy this tastefully done movie as well.  I could have done without a certain scene between the two, but this movie has a lot to offer, and has a moral to teach as well.  It has strong characters of positive principles, and there's even an \"older man mentor,\" like from \"Pretty Women,\" that adds that wholesome touch to the film.","user":"sarahbelle77","rank":[46,63]}]