[{"title":"historically a joke","rating":3,"date":"28 June 2008","review":"more to entertain than to inform and, sadly it fails to do the former. in 82 BC when the film opens Caesar (born 100 BC) was 18, yet they would have you believe that he had an eight year old daughter. also seems to be an unknown which was not the case. as for Cato, he appears to be years older than Caesar in the film yet in reality was three years younger. <br><br>also to clarify another reviewer's comments; Cato was Brutus's uncle. he--Cato--shared a mother with Servillia, the mother of Brutus. she was the sister of Livius Drusus, the tribune of the plebeians who was assassinated around 108. her original husband, Caepio father of Servillia, was killed in the east. she then took up with M. Porcius Cato's father. according to Plutarch, Sulla died after having relinquished the office of dictator and retired to the countryside to spend the end of his days in total debauchery.<br><br>also missing from the film is Crassus and Cicero. to omit these characters is akin to omitting w.t. Sherman and Jefferson Davis from any story about the civil war. as a result the movie is careless in its regard for history. one of the early scenes in the movie involving the pirates is so ignorant of history as to make the viewer throw up their hands in disgust and say 'why was the primary text ignored?' the story of Caesar and the pirates is one of the best stories of his life and it was not given any justice. if one would be interested in roman history i strongly suggest reading up on the harrowing tale of Caesar and the pirates. in the end this movie was in terms of historical accuracy below even the HBO series Rome which was also fairly free in its interpretation of roman history but much more entertaining.","user":"csongor","rank":[27,32]},{"title":"i feel insulted. (SPOILERS)","rating":12,"date":"12 December 2004","review":"this movie hurt to watch, as a result i was not able to stomach watching all of it. once i reached the point of Pompey's return. i stopped watching, i could no longer take the woeful Historical inaccuracy of the piece. As such i can only point out the holes in the part i did see.<br><br>first a short explanation of the roman political climate just previous to the beginning of the movie (i've simplified it for ease of time): in 87 BC Sulla was sent by the Senate to Asia Minor (turkey) to deal with The King Of Pontus, who had invaded roman macedonia, and roman Asia, however Gaius Marius (non-blood Uncle to Caesar)the Greatest of Romes Generals to that date (though now rather old) connived to have the position transferred to him, after Sulla had already left. After hearing his command had been stripped of him, Sulla turned around and marched on Rome, Lacking an army to contend with, Marius fleed, eventually reaching Africa, where a large number of Veterans who had fought with Marius years earlier were now settled. when Sulla had finally left for good to the east, Marius landed just north of rome, where he gathered an army of slaves to join his veterans, he then marched on rome and his army proceeded to pillage the city, rampantly slaughtering Marius's enemies, soon afterwards Marius died of a stroke, and though he was evil at his end, he would be loved by the people as their greatest hero, until Caesar took his place. Rome then fell to Cinna, ally of Marius, who ruled for a time until his death, when he was replaced by Carbo, who ruled until Sulla's return to Italy.<br><br>now for the film.<br><br>starting with Sulla's arrival, the people of Rome seem surprised at his appearance, when in fact they had known he was coming for a long time, he had been fighting a civil war against Carbo's Rome for quite some time. Pompey was not with him when he reached Rome, as Sulla had sent him to Sicily to secure the grain supply. furthermore Pompey was in his early twenties at this time, and had golden hair, as opposed to the middle aged black haired figure of the movie. We see in the film Cato, as a middle-aged man, come out of the Senate House and make a comment against Sulla. in reality Cato was only 13 at the time, 5 years younger than Caesar, he was also Pro-Sulla. according to the film Marius used to make the same allegations of being descended from gods as Caesar did. Marius was not Caesar's uncle by blood, furthermore he had been raised in the countryside and was a Novus Homo, the first man in a family to reach the Senate. the degree to which Pompey was a close agent of Sulla is vastly overstated, Pompey was an arrogant pup, Sulla used him when he had to, and not anymore. when Caesar is bought before Sulla, Sulla does not recognise him, when in fact Sulla's first wife had been Caesar's aunt, and they had met many times. as stated Cinna was already dead when Sulla took Rome. In reality Caesar was not helped by Pompey, Pompey knew nothing of Caesar at the time, more to the point he did not flee to the east, but into the Italian countryside, where he hid until a delegation of noblemen convinced Sulla to recall the sentence of death upon him, Sulla was never tricked into thinking Caesar dead, as the movie would have you think. <br><br>Sulla is treated very harshly in the film, he was in reality not mad or evil. He reformed Rome in an effort to prevent the turmoil of recent years being repeated. He fought to maintain the Senate's position as the main body of government, and thus limited the powers of the assemblies, he reformed a corrupt court system. He served as Dictator for 3 years, before handing back sovereignty to the people and retiring to private life, none of this is passed on in the movie. When during his consulship (shared with Crassus, who is completely ignored in this film) Pompey repelled some of Sulla's laws, he did it only to his own selfish ends. furthermore the movie makes it look like Pompey was some big senate leader. in fact Pompey wasn't even in the senate! At the funeral oration of his wife (why this funeral and not the far more significant funeral of Julia wife of Marius is used int eh film i don't know) Caesar implies Marius died at Sulla's hand, he in fact died of a stroke, while Sulla was on the other end of the roman world. the film completely ignored the vast senatorial opposition to Pompey. When Pompey returns Caesar says he is Consul, in fact in the year of Pompeys return ( i assume the movie has amalgamated the campaigns against the pirates, and Pompeys conquest of the middle east, if they have not then things are even more inaccurate than i thought) Caesar was inly Praetor.and would not be consul for another 2 years. <br><br>this is were i stopped watching.<br><br>lastly the issue of Caesar in the east, Caesar did go to King Nicomedes Of Bythnia, but it was a military assignment of Caesar's own choosing, not as a refugee from Sulla. it was on a second trip to the east the Caesar was captured by pirates. pirates whose lair he later found and had them all crucified. <br><br>this movie an insult to the history of rome 0/10","user":"gaius-marius","rank":[36,45]},{"title":"Not bad as TV biopics go, especially for history buffs.","rating":8,"date":"9 August 2003","review":"Covering the period from Sulla's occupation of Rome in 82 BC to Julius Caesar's murder in 44 BC, this is a fairly good biography. Some of the details of Caesar's career are touched on only briefly, and some relationships are inaccurate. E.G. Brutus was Cato's son-in-law, Portia was Cato's daughter. The film says Brutus was Cato's nephew. One may be disappointed not to get the dramatic aftermath of the murder, but that would take at least another hour. One might wish for better acting here and there, but you seldom get really great made-for-TV movies. As a lifelong history buff, I found the film entertaining, even instructive once in a while.","user":"fisherforrest","rank":[20,28]}]