[{"title":"A very pleasant surprise - not what I was expecting!","rating":31,"date":"31 December 2005","review":"I bought the uncut German Pal DVD of this movie as a blind buy a few months back. Looking back, I'm not sure why I purchased it - I rarely buy purely on instinct. I finally decided to watch it last night and was blown away - what an unexpected treat! I'm not going to give much away as it's one of those movies that's best viewed with little knowledge going in. What starts out as a \"Desperate Hours\"-style movie soon proves a much more interesting ride.<br><br>This scores as my unexpected delight for the year. It's a low-budget gem. Some of the acting is \"love it or hate it stuff\" - the writer Dave Larsen plays Odessa James as a cross between Kiefer Sutherland and Mickey Rourke and I found some of his dialogue a little unintelligible - but, ultimately, I loved the cheesy charm of this film. It's also great looking - the film's scenes are bathed in a lovely blue light in the early scenes - very stylish.<br><br>The DVD set is a 2 disc set but the second disc has only trailers and a German-language only short on it. Still, it's a great looking Disc 1 and worth the purchase price, IMHO.","user":"DVD_Connoisseur","rank":[8,10]},{"title":"Somehow this movie stuck in my mind","rating":8,"date":"19 June 2005","review":"I saw a midnight premiere of this movie in college and it quickly disappeared, but it stuck in my head long after I forgot the title, and I'm lucky I re-found it. No one in that theater knew what to expect from this movie, and it start out as everyone's worst nightmare: a cheap, clichéd crime drama. A lot of people walked out after the first 20 minutes, but I was determined to stick it through. And I'm really glad I did.<br><br>At the twist point in this movie, the horrible clichés and acting and directing of the first half feel like an amazingly underplayed setup to a punchline with actual humor and shock. Imagine \"From Dusk till Dawn\" if the vampire angle hadn't been completely ruined by over promotion.<br><br>It's really rare that a movie seems to be one thing but then turns completely around halfway through into something 10x better, but this is one of those. It used the low expectations and low budget to it's own advantage and turned out a movie I never forgot.","user":"mmohr","rank":[6,7]},{"title":"Completely outlandish and over the top! AWESOME!","rating":7,"date":"15 August 2008","review":"As far as my rating goes, I'm voting on the entertainment value of the movie, and not analyzing each category of the movie as far as cinematography, special effects, dialogs and stuff of the sort might go...<br><br>The movie is just a completely amazing and over the top adventure, with outlandish plot twists, cheesy lines and dialogs. The characters are just totally unbelievable and over the top that you can't help loving them and most of the movie just feels like a completely delusional experience, but it's AWESOME! It just grips you to it, and entertains the living crap out of ya! Well, at least it made my night! I'd recommend it to any movie-watcher that just likes having a laugh, with some fun involved.<br><br>AVOID if you take films too seriously!","user":"hugor","rank":[4,5]}]