[{"title":"\"Words create lies. Only pain can be trusted.\"","rating":10,"date":"27 February 2005","review":"It's probably an exaggeration to describe Audition as extreme (its mixture of gore and realism is nowhere near as bad as in, say, Irrerversible or A Hole In My Heart), but that shouldn't sidetrack from what is ultimately a very challenging and unorthodox film. While the idea of a film changing genres midstream is nothing new or radical in itself (From Dusk Till Dawn is a good example), the way in which Audition suddenly hits you with its own surrealistic brand of Freudian horror is wholly untypical because the change in genre is not just a gimmick (likein aforementioned Dusk Till Dawn) but is used to directly comment on whatever has preceded it during the storyline.<br><br>One thing which struck me about Audition is how complete and accomplished it all seems. I say this because most of Takashi Miike's work (including films I sincerely enjoyed, like Ichi The Killer or Dead Or Alive) does appear a bit rushed at times. No doubt this is in part due to Miike's notoriously insane work rate - an average of three films a year - but it makes Audition all the more remarkable. This is in no way meant to downplay Miike's other work, it's simply to emphasise the strengths on display with Audition: nigh-flawless acting, stunning cinematography, a very intelligently and thoughtfully constructed narrative, and some of the most memorable (albeit disturbing) imagery I've ever seen on film.<br><br>To regard the final third of Audition as a feminist revenge fantasy is true to a degree, but I think it's also to oversimplify the more cerebral aspects of the narrative. Graham White made some excellent points in his review of the film here, and it's difficult to add anything of substance, but I personally interpreted the final third as a physical illustration of the mixture of guilt and fear Aoyama feels towards both his old and new wife; guilt at his late wife for remarrying, and at Asami for holding a fake audition and furthermore lying to all women involved during the audition (a point where Aoyama himself says he feels like some sort of criminal). In any case, people who take this film at face value are missing the point because the final third is an extended metaphor (even if the myriad of different interpretations we can arrive at illustrates how richly textured the narrative is).<br><br>Unfortunately the film's ingenuity is often ignored due to its violent content, and as a consequence Audition is stuck in a double bind of sorts, too violent for serious movie goers and too intellectually challenging for gore fans. This is probably a gross generalisation of its audience, but the fact that people constantly bicker about its \"boring\" start and it's violent ending, while very little attention is paid to the thematic elements of the narrative, seems to suggest that this film has largely been misinterpreted in what it actually set out to achieve. Audition does not simply aim to comment on the state of relationships between men and women, it also aims to challenge our perception of film genre by playing around with conventions to such an effect that it deliberately shocks and destabilises its audience. Ultimately, this is what makes Audition such a challenging movie. We as an audience have become so accustomed to the lazy generic categorisations of movies that when we see a love story we want a romance, and when we see horror we want gore. Finding the two mixed up challenges our expectations and demystifies the notion that everything about a film can be summarised by the one genre it's meant to fit into. I hate using the word post-modern, but this is what ultimately what this film is, since it's very conscious of the conventions it plays with. Furthermore, this is not simply a case of romance mixing with horror, but also with realism mixing with extended metaphors, and the latter eventually taking over the narrative completely - it's very rare that this sort of thing happens in film, but needless to say it only adds to the clever originality on display here.<br><br>If a mainstream audience is willing to dismiss a film as radical and wonderfully uncompromising as this simply because it does not meet their narrow expectations of what films are meant to be, and if they are unwilling to embrace a different kind of film making and widen their scope, then I expect the fault not to rest with the film itself but with the audience that has rejected it. I for one am glad to have seen it,","user":"desh79","rank":[145,174]},{"title":"Difficulty Understanding the Progress of the Movie","rating":23,"date":"23 May 2005","review":"In this post I'm going to cover some important points of the progression of the movie, that were not cut and dry.<br><br>There are a few different parts where the movie takes its sharp turn into believing that Asami is a mentally scarred torturer, some of which could be considered a dream sequence or a hallucination. As the movie progresses, it becomes clear that most of them could be viewed as a dream sequence- but the problem is, not all.<br><br>When Aoyama gets in bed with Asumi, it can be assumed they do what we'd expect them to do, and then falls asleep, which would allow him the chance to dream, which could encompass the entirety of Asami disappearing without a trace, meeting the old stepfather, going to the shut down restaurant and the surreal torture sequence, save for the brief moment where he 'wakes up' to be back in bed with Asumi and goes to the bathroom.<br><br>This is fine, and works with the exception of the foreshadowing clip of Asumi answering the phone call for the second(?) date, where the slave in a bag rolls across the floor and moans. This is before the dream sequence, and there is no reason for Aoyama to be hallucinating or dreaming at this point- he is just at work and decides to make a phone call on his way out. Also, he doesn't seem the least big perturbed by this vivid hallucination he has, as they go on a date anyway. The placement of this scene tells us the slave, and Asumi's vile intentions are all real.<br><br>From there, you have to assume that it is Asumi's disappearance, the crazy old man, the slave in a bag and the torture scene that are all real. The 'waking up' in bed with Asumi is a fantasy. This is supported also by Asumi's body language as she undresses- her movements are slow, and angered, and then she returns to her submissive facade as she faces Aoyama again.<br><br>At that point all of the happenings between when Aoyama gets drugged and hits the floor are hallucinations that just don't happen, mixed with the pieces that Asumi told Aoyama while they were going out on dates. For the most part, nothing that Aoyama experiences while falling down drugged is new to him, or couldn't be pieced together inside his head at that point. Also, Aoyama was drugged, so Asumi's little speech after her neck was mangled by her final fall could have been hallucinated as well.<br><br>\"For the most part\", however, doesn't include that Aoyama vividly hallucinates the slave in a bag while falling down from being drugged. If the slave in a bag exists, then he couldn't possibly hallucinate something he has no experience with to that sort of detail. In this description of the progress of events, there is no point where Aoyama is introduced to the slave in a bag, nor is there time for him to be.<br><br>That brings us to a binary choice about what to think of this movie: Either Aoyama was hallucinating vividly, without any precursor, of awful things about Asumi that he didn't believe while in no state to do so (which entails that Asumi really is just a tortured girl, not a sadistic torturess)... Or Aoyama vividly dreams something he doesn't know about, that actually does exist. This could be either a super lucky guess, or some mental link between Aoyama and Asumi, or maybe some good old voodoo. This would entail that Asumi actually is the evil torturess, really did cut off one of Aoyama's feet, and possibly died when she hit the floor after sailing over that flight of stairs.<br><br>If anyone can piece together the movie so it doesn't have either of these blatant holes in the plot, then I'd be happy to go onto a deeper discussion of the meat of the movie.","user":"jacques_05","rank":[26,29]},{"title":"The horror, the horror!","rating":8,"date":"30 May 2004","review":"Art-house horror flicks are not a very common genre (few come to mind except 'Don't Look Now') but Takashi Miike's film 'Audition' is a welcome addition to the canon.  Beautifully shot and orchestrated, it is both a subtle personal drama and one of the most genuinely horrifying things I have seen. The early stages of this film resemble a work by Claude Sautet, only seen through a Japanese sensibility, about the relationship between an older man and a beautiful young woman, but there's something slightly discomforting both in the man's definition of the perfect partner, and in the person he finds who fulfills it. The story slides into first a mystery, and then a full blown horror story, the power of which comes from following a very simple golden rule: namely, make the audience care about the characters first: one small needle can be very very scary if you think that it's for real. And by keeping the meaning ambiguous (unlike, say, 'The Shining', with its self-defeating collapse into hyperbolic mania), the film also retains its impact after the initial shock.<br><br>This sense of ambiguity is also crucial to the film's claims to be something more than simply an unorthodox gore-fest.  'Audition' constructs, and then deconstructs, a certain vision of the world and the \"horror\" scenes are only part of this.  The result is utterly beguiling,  and one can even see similarities with Conrad's 'Heart of Darkness' in 'Audition's' portrayal of a man's complicit relationship with hell.<br><br>In some ways, this is not a universal film and I could not imagine it working in English: can you envisage any Western actress speaking the Eihi Shiina's lines with a straight face?.  Whether that's because the film is saying something profound about Japanese culture,  or whether the fact that it appears to do so can finesse the issue for foreign audiences, I'm not sure.  Dramatically, 'Audition' is, despite its climax, not the best film ever made.  But atmospherically speaking, it's a masterpiece.","user":"paul2001sw-1","rank":[140,182]}]