[{"title":"Not a bad film.","rating":6,"date":"11 November 2006","review":"This film isn't fantastic, but it is far from dismal as many people here have made it out to be.<br><br>Sure, the premise of the movie is silly, but most of these types of comedy movies are. The film is entertaining and Martin Lawrence shows his comedic talent again.<br><br>If you think this film deserves one or two stars, you probably haven't seen enough movies. For a true 1-star film, go see \"Going Overboard\" with Adam Sandler---I bet you won't be able to watch it until the end.<br><br>Black Knight is a pretty good film and I recommend you see it if you get the chance.","user":"rjames-11","rank":[28,29]},{"title":"Laugh out loud funny","rating":10,"date":"22 December 2015","review":"If you want a film with a history lesson, hook into national geographic channel. If, however, you have 90 odd minutes to spare, have a good old fashioned belly laugh or ten with this. Corny jokes? tick. visual humor? tick. couple of eurrgh moments? tick. Try and be in a mellow mood before you view, and you won't regret spending time with this one. Also, a nifty soundtrack, though not all over the film, and some great (although there is a bit of a theme) olde worlde talking gags. There's some great looking maidens in it as well. Considering it was made in 2001, it has aged quite well, but some sports references could leave you scratching your head. I loved it, and seeing as it didn't hurt anyone else, i don't care who knows it! There was a ready made set up for a sequel, but as far as i know, it never happened. If anyone knows different, please let me know, as i wouldn't hesitate to watch it!","user":"dphill-76688","rank":[10,10]},{"title":"Not the worst movie ever made--but it sure seems that way after Harry Potter","rating":1,"date":"29 November 2001","review":"Black Knight is an unforgivably unfunny piece of trash. Although the blame can be attributed almost entirely to Lawrence's craptactularly excessive performace, with a story so uninspired, lame and uninteresting, Black Knight was destined for turkey-ville before a dime was even spent. The embarrassing thing is that 20th Century Fox actually paid the lead $ 16.5 million and that the production value is frighteningly high for a film of such low caliber. Hollywood should know better--movies about guys being sent back in time aren't even worthy of direct-to-video release. Luckily, however, Black Knight will drown at the box office in Harry Potter's wake.","user":"sagemichael","rank":[15,20]}]