[{"title":"Everything that Pearl Harbor isn't","rating":8,"date":"3 August 2001","review":"Bursting into my Top Five war movies of all time is this film.  A gritty and realistic portrayal of one of the worst battles in the history of war - the 1942-43 armwrestle for the city of Stalingrad.  <br><br>Much has been made of the actors speaking in their native accents, but this seems a trivial complaint - the film is in English after all!  More important is the masterful manner of speech of the actors - Bob Hoskins' gutteral exultations as Ukrainian potato farmer Nikita Krushchev; Joseph Fiennes' pompous and proud intonations as the political officer; Jude Law's common man for the peasant turned soldier; Ed Harris with the clipped and crisp tones of a German officer.<br><br>This is my pick for the best film of the year so far (August).  It is truly a cinematic masterpiece, with horrific scenes of the violence of war, brilliant dialog and heart-wrenching tragedy.  Expect to be moved.","user":"Jonathan-13","rank":[204,276]},{"title":"A selective distortion of history","rating":18,"date":"18 March 2001","review":"\"Enemy at the Gates\" by William Craig was a great history of the Battle of Stalingrad as retold by living participants. \"War of the Rats\" was a powerful, moving dramatization of Zaitsev and the Soviet snipers who fought at Stalingrad, as well as the Germans who opposed them. I thought that the movie would be based on at least the novel. I was disgusted to find out that the producer/director/writers chose to throw both of these memorable books out the window and instead manufacture their own vision of the battle that provided absolutely no historical insight, replacing the great stories of the two books with warmed over putrid anti-communism.<br><br>The movie goer gets no insight into the complexities of why Soviet soldiers fought and defeated the Germans at Stalingrad. Instead we are given the impression that the only reason any Soviet soldiers fought there was due to the threat of being machine gunned by the Stalinist \"blocking units\". Then suddenly, one commissar has a brilliant idea to \"create a hero who will be an example\" and the whole battle turns on Vasily Zaitsev. None of the other real acts of heroism at Stalingrad are shown, such as the soldiers who held out for 53 days in \"Pavlov's house\".<br><br>Further, the main function of Zaitsev's publicity in the Red Army newspaper was to popularize sniper techniques. This was not shown. Nor the sniper school set up where snipers were \"mass produced\" to harrass the Germans. The heroic deeds and harrowing adventures of the real Tania Chernov are never mentioned. Her being blown out of the boat on the Volga, surviving the journey through the sewers, behind German lines, her responsibility for the loss of several fellow snipers and Zaitsev's anger with her for that, all would have made great scenes.<br><br>The tension and suspense of snipers hunting each other for days was completely missing as well as the long range aspect of these duels. The ludicrous scene at the end where Konig and Zaitsev confront each other \"High Noon\" style was absurd. No sniper would expose himself like that, let alone battle hardened troops by that point in the battle, even Germans.<br><br>The insipid speech by Commissar Danilov at the end about \"there will always be rich and poor\" was apparently thrown in to reassure the viewers that the director and producer do not sympathize with \"Communism\".<br><br>All in all, this movie was a travesty both as art and as history. It did a severe disservice to both. Soviet soldiers who fought and died at Stalingrad did not only do so out of fear of NKVD retaliation. Patriotism against a genocidal invader was a real part of it. And yes, many actually believed that they were fighting for a better future, that they were saving socialism. Why is it that Craig's book and Robbins novel can convey these complexities of the battle of Stalingrad while all we get from the movie is an insipid love triangle, rediculous \"sniper tactics\" and lots of good old fashioned anti-communism. You don't have to cover up the truth about the crimes of Stalinism to make an accurate portrayal of Russians in the battle of Stalingrad. But you don't have to churn out an anti-communist diatribe either. The truth will not be found in either. Certainly not in the sorry cinematic adaptation of \"Enemy at the Gates\". The only thing it has in common with the history is the title.","user":"sisko2374","rank":[205,285]},{"title":"Easily the best thing that has come out all year...","rating":10,"date":"28 July 2001","review":"It would be all too easy to dismiss Enemy At The Gates as being an attempt to cash in on Saving Private Ryan's success, but in my opinion, it is a very worthy competitor. In fact, it is a better film. I say that primarily because I am sick to death of Americans using World War II as a basis for films that generally amount to little more than propaganda. Of course, Enemy At The Gates comes off as being somewhat fantastic due to its attempt to balance entertainment with historical fact, and it came as a surprise to me to learn that Sergeant Vassili Zaitsev was a real person (whose sniper rifle is still an exhibit in a Russian museum), but this makes it all the more entertaining to watch.<br><br>A lot of historians have it that the battle of Stalingrad was the most unpleasant one fought during the second World War, and this film's set design and cinematography capture that impeccably. When the Russians are battling the Nazis, you get the idea that if the Nazis didn't kill them, malnutrition, tetanus, scurvy, bubonic plague, or a million other things would. Jude Law and Joseph Fiennes lend authenticity to their roles that makes it even easier to follow them on their personal journey through hell, and Ed Harris is scarily convincing as a high-ranking Nazi. The real surprise here, however, is Rachel Weisz as Sergeant Tania Chernova, and the very heart and soul of the film. When she describes the reasons why she decided to take up a gun and battle the Germans, it all makes so much sense that you just want to buy the poor girl a beer and give her a good warm embrace. Not that such things would erase the scars that her character bears, but one would feel obligated to try.<br><br>Writer/Director Jean-Jacques Annaud, writer Alain Goddard, and cinematographer Robert Fraisse treat the subject matter with great care towards authenticity and entertainment value. It's very tricky to get these two things in proper sync, but they more than manage here. They also don't rely on any hokey photographic effects to tell the story, simply letting you see everything as clearly as possible, letting your imagination do the rest. Anyone who's read anything credible about the inhuman suffering the Russian soldiers endured during this battle will have no trouble filling in the gaps that the narrative leaves about their living conditions. The blood and gore shown during the battles is also very conducive to the atmosphere. Rather than just expecting you to believe that a solider gets his stomach spread all over half a kilometer of pavement by enemy bullets, they show you so you can get a feel for how bloodthirsty both sides in the confrontation were. Even the sex scene doesn't look out of place here.<br><br>To make a long story short, this is the first film I've seen in a long, long time that I haven't been able to come up with a list of criticisms for. It is simply excellent, and the 7.1 rating it is currently stuck with does not do it justice. It is easily superior to the likes of Platoon, the equal of more esoteric war films such as Three Kings, and it is miles above the likes of Saving Private Ryan and Pearl Harbour. Vassili Zaitsev would be very happy that his struggle has inspired such a commendable piece of art - it is exactly the sort of thing he and millions of others like him (on both sides of the planet) were fighting for.","user":"mentalcritic","rank":[234,361]}]