[{"title":"don't watch alone, but watch it in the dark","rating":9,"date":"11 March 2005","review":"I work at a video store and when customers ask me what's a good horror movie that will actually get to them, I don't suggest any of the Freddy or Jason movies. Those are for fans, and I don't consider them to be genuinely frightening. Session 9 is, most definitely, genuinely frightening. It takes place at a mental hospital that is legend where I live. So most people know what I'm talking about when I say Danvers State Mental Hospital. It is one of the few psychologically affective movies that I've ever seen. It takes the audience on a ride through a building that seems alive to it's visitors, and forces the audience to resolve for themselves why things are happening to each character. If you want a movie that is challenging and thought-provoking, this is the one. I always tell my customers to watch this movie in the dark, but not to watch it alone. Just be aware that if there is any distraction during the movie you'll have many questions about it. I hope you enjoy it as much I as do every time I watch it!","user":"mals13","rank":[157,191]},{"title":"\"What are YOU doing here...?\"","rating":10,"date":"14 May 2002","review":"Seeing a film like Session 9 just reaffirms that there are truly great films still being made.<br><br>While many (including the filmmakers) will find comparisons to Don't Look Now, The Shining, and even a nod to The Changeling, Session 9 still stands on its own as a most effective, brooding experience of dread -- and that's a good thing!  I found the style and tension more genuine than the grandiose The Shining, and Session 9 relies mostly on real fears and no gratuitous material to entertain.  This film wants to creep you out and that's its soul purpose.  No pretty young GAP models, no trendy MTV-influenced rap/metal soundtrack, no breasts, no giggle-inducing decapitation effects.  If you want those, by all means go watch something else as there are plenty other films that offer that to those with short attention spans. If you want to be drawn INTO a film, a place of fear, and THINK as well, Session 9 is like a therapy session of nightmares.<br><br>The story is simple and complex at the same time, as workers removing asbestos from the massive Danvers Mental Hospital slowly unravel along with secrets from taped audio recordings of a former patient.  I never saw the characters' backgrounds as \"underdeveloped\" as some have complained -- you don't need to know EVERYTHING about these guys and besides, more information about them would have slowed the film down even more, and its nice, brooding pace is just right as it is.  And don't worry if some of the things that seem like \"clues\" are left unresolved, that's part of the fun.  Just like I still say many of the weird \"clues\" in David Lynch's works like Twin Peaks and Mulholland Drive are just there to be weird and draw you in, not that they actually have any direct connection to the main story.<br><br>The actual Danvers Hospital is an amazing setting as the whole structure is a character all it's own and will disturb you without it having to do much but just BE there in the film.  The minimalistic soundtrack is unsettling and downright perfect (I even bought it on CD and am still trying to figure out why it attracts me so much, playing it in the background while, say, typing away something like this....).<br><br>Each actor does a fine job -- yes, even David Caruso (some of you need to get off his back!) as a guy who seems to get a bit impatient yet maintaining a sense of calm.  Peter Mullan, Steven Gevedon, Josh Lucas, and Brendan Sexton III seem like real, regular blue collar guys. It's refreshing to see a film not insecure in having a mature, rough-edged cast.  By giving you a sense that these guys are real (yes, even though they tend to be slacking off quite a bit in places when they're supposed to get the job done in a week), the quiet dread of the story will draw you in and you'll be absorbed completely.  Of course, if you appreciate less flashy films like this, you'll agree it's damn near perfect. Oh, to those here on IMDb who criticized the scene with a jar of peanut butter left on the floor, welllll, think about this: considering the state of its consumer, do you think that whoever left it there cared where the container was disposed?  Man, do you people get picky over the strangest things!  Whatever may seem implausible in the story or the characters' actions really doesn't wreck the film, as it is to be appreciated much for its atmosphere and story.  I didn't find the ending to be so hard to understand at all, those that had their mind set that they didn't like this film were too busy being angry to just sit back and let everything present itself quite clearly.<br><br>If this film is categorized as horror then it's one of the best I've ever seen, definitely one of the best in years.  It takes a LOT to scare me, and there's one specific scene with Josh and his experience in the basement that caused a wave of tingling goosebumps all over my body. It was exhilarating to be scared that effectively by a single scene!<br><br>\nFolks, you can't trash this film because it doesn't give you easy explanations or allows you to have some cheap voyeuristic thrills.  Many of you who didn't like Session 9 seemed to know from reading its summary that it wasn't offering slam-bang entertainment.  If you like your mind to be stimulated and love being absorbed in mysterious and wondrous storytelling, Session 9 is by my definition a flawless piece of work. For anyone else, I'd just say.........\"What are YOU doing here....?\"","user":"hippiedj","rank":[305,390]},{"title":"Gets under your skin","rating":9,"date":"27 August 2001","review":"Everything about this movie impressed me. The script was lean and inventive, the direction stylish without being overblown, the acting top notch. Even the shot-on-video cinematography looked great (with the exception of one or two exterior shots that had a hint of video look to it, most everything else was \"filmic\" and artistic).<br><br>I also appreciate any horror movie that can generate real tension and suspense from imagination and suggestion rather than relying on lame and lazy tricks that populate most horror movies (if something as limp as Urban Legends can be called a horror movie).<br><br>First rate film and I recommend to anyone who appreciates a thinking-man's horror film.","user":"wytshark","rank":[171,219]}]