[{"title":"Pretty good action movie.","rating":7,"date":"23 February 2020","review":"The action/fight scenes themselves would explain the rating I'm giving this movie! Sure some of the action scenes are over the top but not so much to take away from the film itself, so for me, it worked! I thought the French detective guy played his role nicely and so did the Asian girl. This is definitely a rewatchable movie because some of the action/fight scenes are a nicely executed.","user":"MR_Heraclius","rank":[36,37]},{"title":"colorful action picture","rating":27,"date":"27 October 2002","review":"`The Transporter' is pretty good for what it is - a sleek, slick, high-octane action thriller that couldn't possibly expect us to believe anything we are seeing on screen and, quite frankly, doesn't care that we don't.  That attitude is probably all for the best in this case, since it allows the filmmakers to devise elaborate action and stunt sequences without having to pay the slightest heed to that fantasy killjoy known as `credibility.'<br><br>Jason Statham literally drips attitude as The Transporter, a stolid, nattily dressed former military man who spends his time delivering packages (no questions asked) all over the French Mediterranean for what turn out to be some pretty shady criminal clients.  One day he discovers that the `package' he is to deliver happens to be a human being - a pretty young Chinese girl named Lai Kwan who has been dropped, bound and gagged, into the trunk of the sporty car on which he lavishes most, if not all, of the love and caring he has to offer.  Yet, Frank turns out, despite his initial air of callous and self-serving indifference, to be a criminal-type with a heart of gold, and he is soon helping Ms. Kwan foil an attempt by her nefarious father to sell a crate load of Chinese immigrants into slavery.   However, the plot is the least of the matter when it comes to a movie like `The Transporter.' This film is far more concerned with attitude and style than it is with its storyline, which exists merely as a vehicle on which to hang all the explosions, car chases and kickboxing fight scenes that have become the stock-in-trade for modern action pictures.   The movie is well directed, well edited and quite beautifully photographed by cinematographer Pierre Morel, who gives the film's French Riviera setting a bright, sparkling sheen.   In fact, Morel's camerawork here is some of the best I have seen in a film in a very long time.<br><br>In addition to Statham, who makes for a very `cool' action film hero, Francois Berleand turns in a wonderful performance as a shrewd, wisecracking police inspector who knows that Frank is up to something but who has enough faith in his own instincts to at least give the man the benefit of the doubt.  Qi Shu is cute and charming as the uninvited and unwelcome `complication' that steps into Frank's smooth-running, well-ordered life.<br><br>`The Transporter' is the cinematic equivalent of junk fast food - not high in nutritional value, but quickly consumed and satisfying when you don't have the time or inclination for something more demanding.   Like its cool-under-pressure protagonist, the film delivers the goods.","user":"Buddy-51","rank":[155,175]},{"title":"An excellent action movie!","rating":9,"date":"12 May 2003","review":"All action movies should strive to be this imaginative!  OK, the plot was not particularly intriguing, but what action movie's actually is?  But the plot was secondary to the action, it only served to make the bad guys bad and the good guys good.  The rest was up to Jason Statham's considerable fighting talents.<br><br>There were some unbelievable yet jaw-dropping stunts, a terrific fight scene in oil, and some great car chase scenes.  There were no smarmy one-liners making light of good action sequences as is too often the case in American-directed action flicks.  The hero was cold, yet compassionate.  He didn't kill unnecessarily, but when he had to, he was ruthless.  There are many great action sequences, some so unbelievable you have to just shake your head and remember that action movies are not supposed to be based on reality.  There is even a great shot of the hero jumping off a speeding semi while it races over a bridge onto the back of a bus going perpendicular to the truck under the bridge!!  I mean, come on!  It would never happen, but I have to give credit to the stunt coordinator who imagined the possibilities.<br><br>There is another hilarious scene where the hero chases down an airplane on foot, hijacks it, jumps out of the plane at great altitude in order to land on the back of a speeding transport with a conveniently located borrowed parachute!  I am glad all crop dusters carry such indispensable equipment and that it is so easy to land on the back of a truck speeding down the highway at 130 KM/hour.<br><br>All in all, 90 minutes of sheer enjoyment.  Even with the predictable ending, I have to highly recommend this movie.  If you can suspend belief for a little while, you will be rewarded.","user":"Rooster99","rank":[88,115]}]