[{"title":"-LE PACTE DES LOUPS- One of the Most ORIGINAL Movies in Modern Cinema.","rating":9,"date":"20 November 2017","review":"----LE PACTE DES LOUPS--- or<br><br>-- --The Brotherhood of the Wolf--- or -------El Pacto de los Lobos---- ---title in French, English and Spanish, respectively)<br><br>....IS (IMO) ONE OF THE MOST ORIGINAL MOVIES IN MODERN CINEMA!!!!!!!<br><br>LE PACTE DES LOUPS is a very entertaining movie at the beginning and a film that invites a lot to reflection and afterthought in its middle and final parts. It also has very nice scenarios, both natural and man-made. It keeps us most of the time wondering about the outcome of the three parts that (IMO) constitute the central plot: the story of the characters, the story of the hunting of \"The Beast of Gévaudan\" and the history of La France and Europe as a whole during those years, corrupt monarchies and controlling church included.<br><br>Scenography is very good and really makes us dream about the \"époque\" the film talks about, with all its good and bad (and sometimes very very bad) things. We also had some very decent scenes of action and an overall feeling of being experiencing things very close to they way they should have been in France during the seventeen hundred and something. An eclectic mix of drama, terror, eroticism, martial arts and both historical and detective novels that I found completely enjoyable, thrilling and satisfying!!!!!!!<br><br>One of the most interesting things, I guess, is reading in the IMBb Trivia Facts about the real existence of a \"Beast of Gévaudan\" during the XVIII Century, same as most of the main characters depicted by the movie, even when we know that a lot of it'd have been novelized, knowing that virtually all the elements in the movie have at least some historical background is impressive, to say the least.<br><br>Thanks for reading<br><br>IMDb Review written by David del Real. México City. México. November 2017.","user":"David_del_Real_Reviews_in_IMDb","rank":[22,22]},{"title":"Merchant Ivory takes up kickboxing","rating":10,"date":"23 October 2001","review":"In 1765 something was stalking the mountains of south-western France. A 'beast' that pounced on humans and animals with terrible ferocity. Indeed they beast became so notorious that the King of France dispatched envoys to find out what was happening and to kill the creature. By the end, the Beast of Gevaudan had killed over 100 people, to this day, no one is entirely sure what it was, wolf? hyena? or something supernatural? Whatever it was, shepherds had the same life-expectancy as the red-suited guys in 'Star Trek'. The Beast is a popular myth in France, albeit one rooted firmly in reality; somewhat surprisingly it is little known to the outside world, and perhaps incredibly it has never been made into a movie. Until now, and what a movie!<br><br>Categorising 'Le Pacte des Loups' would be tricky, but I'll try. Its a period costume horror martial-arts werewolf movie and surprisingly all those pieces work together provided you don't concentrate too hard. Why no one has previously made a period costume horror martial-arts werewolf movie before is a mystery, but I expect plenty of imitations in the future.<br><br>\nTaking the Beast as its starting point the movie quickly diverges from historical fact and steps up the pace. We are introduced to the two heroes, Gregoire de Fronsac (Samuel le Bihan) and Mani (Mark Dacascos) in the midst of a torrential storm that culminates in the first of many magnificently staged fights. De Fronsac has been dispatched by the King to find the Beast. De Fronsac represents the new rational world of the Enlightenment which is being forced to confront the backward, superstitious France outside of the capital. Mani, an Iroquois shaman and hunter befriended by de Fronsac whilst adventuring in the Americas brings another type of wisdom entirely. At the time of the movie America was a dark and mysterious place, home to all of the fears of Europeans. Of course it was shortly to become the home of the very republicanism that would sweep across France and remake the Old World in a new image.<br><br>'Le Pacte des Loups' wears its republican colours on its sleeve and uses the conflict between rationalism and the stereotypical backward villagers to drive home the point. This is good old-fashioned horror movie territory and the source of much of the plot. Guvaudan is the sort of village that would give the inhabitants of Sleepy Hollow the creeps. If it were in England, Christopher Lee would be the lord of the manor and Peter Cushing the priest.<br><br>\n'Le Pacte des Loups' has one of the strongest French language casts possible, a mix of veterans and some up and coming talent. Here it is dominated by the priest Sardis (Jean-François Stévenin) and the saturnine Jean Francois (Vincent Cassel), a crippled hunter and explorer who rapidly becomes more dangerous than the Beast itself. Both are scornful of the changes coming from Paris and seek to shield their world from the future. The remainder of the population are either stupid, indolent, superstitious or just evil, holding back the new rational world of the big cities. The Beast is very much an extension of their way, as much as it is a physical monster, the Beast is a projection of all the villagers hatreds and bigotry.<br><br>A strong female role is unusual in movies, but two? And such different characters. There is the strikingly elegant and almost hypnotic courtesan Sylvia (Monica Bellucci), playing her role of seductress with frigid professionalism. In a world where women had little more than their wits to protect them, she is the most dangerous of all and far more than she first appears. For most of the movie you are unsure if she is going to help or hinder the heroes, she is always mysterious and captivating.<br><br>\nIn complete contrast there is the innocent, fragile, and astonishingly beautiful, Madeiline (Emilie Dequenne), younger sister to the protective Jean Francois. Surrounded by evil, prejudice and superstition on all sides she is clearly the romantic heroine, but is also intended to represent the French Republic; the very symbol of which gives her name. De Fronsac falls hopelessly in love with this witty and charming woman, but in doing so he risks further conflict with Jean Francois.<br><br>The two leads are fantastic and share a chemistry reminiscent of the relationship between Butch and Sundance. Le Fronsac is wise when needed, with a sensational put down for those who think that Mani is less than human. Mani is a man of few words but utterly dominates the screen when present. Needless to say, they are both fantastic fighters.<br><br>Horror movies live or die by the creature and fortunately this movie delivers. Wisely there is never a chance to get a good look at the animal - it is enough to know that it is big and nasty, the viewer's mind will fill in the details. The creature is also used surprisingly sparingly. When the viewer might expect it to pounce it doesn't, a few minutes later it appears out of nowhere - wonderful, shocking stuff reminiscent of 'Alien'.<br><br>\nWhilst the design of the animal from the Creature Workshop is perfect, some of the CGI work is a little below the standards we have come to expect - a couple of the daylight shots are well-below par, but the nighttime work is outstanding. Indeed one shot where the creature stalks out of the fog behind the hero has to be amongst the most effective CGI work in film.<br><br>Cinematically this is some of the best work of late; it bears many resemblences to Ridley Scott's 'Gladiator' - luscious slow character-forming scenes mixed in with frantic camera work for the action scenes. Again, this strange hybrid style works exceptionally well, although perhaps it can get a little too frantic. Just about every camera and digital trick is used at least once, some to excellent effect (one flashback scene is particularly striking, using a strongly solarised effect to give it an otherworldly texture).<br><br>One of the designers was previously involved with Merchant Ivory productions and the luxurious interior scenes have every bit as much detail as any period piece, (and a special word for the costumes that use some of the most sumptuous fabrics possible). A good deal of the film is lit by candle or fire light, filling the screen with warm oranges and flesh tones (and the movie *never* misses a chance to show lots of flesh).<br><br>In contrast the exterior shots are frequently chill blues and washed out hues, making the French countryside look like a hostile world that could conceal all forms of dark secrets. The countryside itself is magnificently filmed and quite different to the stereotypical French landscapes.<br><br>Tragically all this splendour is playing to minuscule audiences, I saw it with just five other people whilst the queues for 'American Pie 2' stretched across the auditorium. Do yourself a favour and try a foreign language movie. For those people who think French cinema involves two middle aged peasants smoking Gauloises whilst arguing about the finer points of philosophy this film will come as a revelation.<br><br>At 140 minutes perhaps the movie runs a little too long and there are one too many plot twists (there is one near the end that is VERY difficult to accept, but just wince and accept it), but it doesn't outstay its welcome.<br><br>For the English-speaking market the film has been subtitled. Sadly they seem to be quite workmanlike translations and some of the wittier dialogue isn't translated, a shame because the script (even to this very poor French speaker) sparkles. A number of misspellings and grammatical errors in the subtitles should have been caught earlier, but for once you can actually read the subtitles.<br><br>This isn't great art, it doesn't redefine the genre and it doesn't preach. Horror by is very nature is irrational, there is nothing to learn from horror (apart from don't split up a group and never go down to the basement to check why the lights went out). This movie delivers over two hours of solid entertainment, you'll probably come out with a silly grin on your face - and what more do you want?<br><br>Finally, a word of praise for the most imaginative dissolve between two shots I have ever seen - a woman's breast fading into a mountain. No doubt the women of the World are eager to find out just what Christophe Gans can do with the Eiffel Tower.<br><br>In short, I have to give 'Le Pacte des Loups' two paws up.","user":"mikerichards","rank":[141,183]},{"title":"A brilliant genre film ...","rating":24,"date":"24 November 2003","review":"Candle-lit interior cinematography, lush misty landscapes, strong characters, exquisite costumes, an authentic boudoir recreation of 18th century French society, a new kind of savage 'monster' and some of the finest stylized fight scenes ever laid down in a 'genre' film, place \"Brotherhood of the Wolf\" among the classiest horror adventure films of all time.<br><br>Great moments include the culminating rage of Samuel Le Bihan's gentlemanly character 'Fronsac' who explodes into a Conan-like fury as he meets out 'justice' to those that wronged his Iroquois-Mohawk 'blood brother' played by Marc Dacascos, Vincent Cassel suitably creepy as the decadent 'Morangias', sensuous Monica Belluci as the dangerous and vicious 'Sylvia', interesting historical plot-points, and a bond of friendship between an unlikely pair of frontier adventurers, make director Christopher Gans \"Brotherhood of the Wolf\" an original  masterpiece of 'genre' film-making...","user":"beingofsoundmind","rank":[73,99]}]