[{"title":"As an entertaining adventure film, \"The Four Feathers\" stands firm","rating":7,"date":"27 April 2008","review":"The story is set in 1884 during the British Empire uprising <br><br>Harry Faversham (Heath Ledger) is a young army officer from a distinguished military family who never wanted to join the army He did it for his father He resigns his commission on the eve of his regiment's departure for Sudan Harry has already disgusted his strict father, a respected General in the Queen's Army, by declaring no interest in a soldier's life and now that he is about to be married to his beloved Ethne (Kate Hudson), he wants to settle down <br><br>When his closest friends and fellow officers find out that he disgraced the regiment, they send him a box of feathers of cowardice When Ethne sends him another feather, he then disappears to redeem himself, to face up to his fears, to discover himself, to win back his self-respect...<br><br>Shekhar Kapur's \"The Four Feathers\" is beautifully filmed and performed The themes of love, honor, loyalty, friendship, trust, redemption, wisdom, true strength, and true courage are all there They made the characters entirely plausible But what truly lingers in the memory about it are the stunning sequences filmed in the Sudan and the splendid staging of several battles, showing the then standard British tactics employed in holding off attackersthe forming of squares, with riflemen deployed in standing, kneeling, firing, holding line, and keeping eye on the target These exciting scenes of combat and carnage are truly impressive","user":"Nazi_Fighter_David","rank":[57,74]},{"title":"This director doesn't know what a square is for - SOME SPOILERS","rating":1,"date":"6 September 2007","review":"This movie should have had SO much going for it. A top rated if somewhat revisionistic director whose first big effort in the west, Elizabeth, certainly made me look up and take notice. A pair of strong male leads whose work in films like American Beauty and The Knights Tale certainly wasn't shabby. Superb production values. And some research certainly went into it as shown by the introduction which references Sir Henry Newbolt's famous poem of Victorian and Edwardian youth and manhood going into battle as if they were going to a football match.<br><br>Then, as they say in the Victorian army, 'it all went 'orribly wrong'.<br><br>SOME SPOILERS BELOW The history behind this director's chosen period - the first Gordon relief expedition - certainly has more than enough adventure and drama to it, particularly when one considers that not only does Newbolt immortalize it in Vitai Lampada but so does Kipling with his 'Fuzzy Wuzzy' who, indeed, did nearly break the legendary British squares at the battles of Abu Klea and Tamai.<br><br>Someone, however, needs to explain to this director what a SQUARE FORMATION is and what it does. This is more than just a military nerd's nitpicking it is - and one sees this at the party scene toward the start - a KEY ELEMENT in the narrative. The officers of the Royal Cumbrians 'form square' to create a nice little romantic space for the romantic leads but what's never explained - probably because the director doesn't get it - is that a square formation is key against both cavalry (as at Waterloo) and native warriors (as at Ulundi and the Sudan) because A SQUARE CANNOT BE FLANKED. You cannot 'get behind' a square and stab the hapless infantryman in the back because another face of the square is guarding the back. As such this formation, outdated on European battlefields where long-range rifle fire and more accurate cannons could mangle these squares at range, was key for fighting less technologically advanced or cavalry heavy enemies.<br><br>Now a square is ridiculously vulnerable to fire - logically a shot that hits one guy at one face of the square will hit someone on the opposite face. Infantry cannot stand in square for long as ranged fire will cut them down until there are too few men standing to maintain the formation. Thus the next thing that the director doesn't get comes into play - COMBINED ARMS. A square can stand IF it has artillery - sometimes outside as at Waterloo, sometimes at the corners as at Ulundi and the Sudan to shoot up attackers at range. And the British infantry had a wonderful new piece of artillery with them in the Sudan - the Machine Gun. When speaking of the colonial wars, one British politico remarked, \"Whatever happens, we've got the Maxim gun and they don't\".<br><br>Problem is, after referencing the Newbolt poem the director FORGETS the central stanza with its reference to 'The Gatling's Jammed and the Colonel's Dead'. This was one reason why the Brit squares were nearly broken on occasion by the fanatical Dervishes - the machine guns would sometimes jam, if fired too fast or if it got too hot or sand got into the mechanism, etc.<br><br>Toward the end of the battle the surviving British officer orders the soldiers to break formation and retreat. This totally ruined it for me. NO British officer in their right mind would be so stupid - sheer logic dictates that one REMAIN in formation as long as possible as a retreat, every man for himself, would lead to the utter destruction of the unit. Even the surrounded British companys at Isandhlwana fought back to back until they were utterly overwhelmed. By rights the entire regiment should have been eliminated to a man.<br><br>Well, that's the military side of things.<br><br>The actors are way too politically correct. Like it or not Victorians WERE racist in their attitudes to 'lesser breeds without the law' and no British officer would have hesitated to shoot a man who fired on his troops - the sharpshooter would have been shot down like a dog without a second thought. No explanation is really given for the political situation and one gets the impression that these are transplanted American GI's in Fallujah trying to win hearts and minds rather than British redcoats in the Sudan.<br><br>The speech of Durrance at the end was ludicrous and long and given the lack of emotion throughout the movie, never had a snowball's chance in hell of stirring up emotion for the man on the right (or left).<br><br>The editing was choppy - particularly toward the end when the couple are walking out of the barracks. The soldiers drilling in the background jump-cut all over the place.<br><br>The film, for all the redcoats and 'jolly good old boy' accents NEVER invokes the Victorian era in manners or morals. The director just does NOT get the heart of the film that at this time courage, honour and all those things which we consider effete and stupid today were actually cherished - at least until the carnage of WW1 showed them to be idols with feet of clay.<br><br>SPOILERS END HERE.<br><br>As a film it's overblown, revisionist and Kate Hudson is horribly miscast. There are many fine British and Commonwealth actresses - why Kate? Just because Almost Famous made her flavour of the month? This film was about as Victorian as Shanghai Knights. No Gunga Din, Zulu or Man Who Would Be King, this one. Spare yourself the agony and expense and watch one of the above three instead of this rotten egg of a picture.","user":"teacher_tom516","rank":[56,79]},{"title":"Critics? Don't listen. This is a very, very good film.","rating":10,"date":"21 September 2002","review":"The newest rendition of the Four Feathers is a real epic, aesthetically beautiful, sweeping, completely refreshing in terms of emotional presentation and scope for both characters and audience. This is one of the best of this year in terms of mainstream film.<br><br>The beginning drags, and the editing is confusing at times, the lighting is dark, and it has a rich (as in dense) atmosphere to it that can make it seem unnecessarily claustrophobic at times, yet which helps during certain scenes (don't want to give anything away). In fact the first 1/3 of the movie is a plum bore. But as soon as Harry goes off following some enemy spies, the movie flows beautifully. It becomes quite the rousing adventure, with lots of fairly disgusting dead bodies and their missing parts all over the place (surprising for a PG-13 flick) and the sole battle scene is one of the better ones I've ever seen, because it creates uncliched emotion, and it's very effective in creating a seemingly helpless situation, with great battle choreography to boot. <br><br>In a movie that has quite a few flaws, it does something really well, develops supporting characters (other than Wes Bentley). The 4 different comrades of Harry's, plus Adu (Hounsou's character), have faces and lives and are important to the flow of the story, though they seem fairly unimportant till it matters (again, don't want to give anything away), when something happens to them, you want to know, and care about, what will become of them. It was refreshing to actually know the fellow soldiers in a war movie for once! And it helps add to the great emotional impact this movie has. <br><br>The acting is OK. There are no bad performances, bad accents to be sure, but Heath Ledger ceases to be his heartthrob self and eventually turns into the character (somewhere between the chapped lips and matted hair I suppose), and provides a steady and trustworthy lead performance. Hudson, I think, is too big for her role, though she and Bentley both provided, again, well done and steady roles. Djimon Hounsou is really the standout. Other than technical aspects I don't think it'll get any nods, except maybe for Hounsou who is exceptional in the film. <br><br>I think that this is a very good film that boasts great cinematography, authentic and realistic costumes and excellent production design, and for me, a great emotional punch, plus a captivating adventure story. It's definitely not a teen flick, or chick flick, it's too gruesome and historical for either faction. And unlike other better systematically made films I've seen this year, it didn't feel \"canned\", too unoriginal, or overly pretentious, it felt fresh. <br><br>I think this suffered the fate of fairly bad advertising and early press and not living up to the expectation of \"Elizabeth\", but I'm glad I saw it because I really did enjoy it, a lot. Highly recommended.","user":"mercybell","rank":[90,139]}]