[{"title":"The Christian film from Hell.","rating":30,"date":"30 May 2003","review":"Manson-era social anxieties and rabid pinko-phobia fuel this fire-and-brimstone propaganda film, which just happens to be made by a personnel of sexploitation cinema veterans. It sure as hell won't save your soul, but it might lead you to wonder if prankster hippies spiked the Ogallala aquifer with premium-grade LSD...<br><br>According to Southern Baptist preacher Estus Pirkle, if Americans don't begin living lives of Christian purity, then a communist takeover is inevitable...within the next several months(!). Television, alcohol, drugs, sex, and miniskirts are condemned in his thundering sermon, which is vividly illustrated in a number of extremely gory scenes(people senselessly gunned down, women raped, and children being beheaded and having their ears jammed full of shish-ke-bob skewers). And let's not forget the age-old sin of DANCING...we all know what THAT leads to, don't we, you shameless whore....<br><br>This is, without question, the most relentless assault on the senses I have ever experienced. No matter what your personal belief system may be, you *will* be nauseated, mortified, perplexed, and delighted watching this hopelessly dated cautionary paranoiac vision...a stultifying and richly rewarding viewing experience.<br><br>HALLELUJAH!! A perfect 10.","user":"EyeAskance","rank":[25,26]},{"title":"Fidel will bring you candy!","rating":1,"date":"25 November 2014","review":"Before I get into the review, I must say that the background of this film is interesting. Ron Ormond, a low budget C-grade movie director on the level of Ed Wood, survived a small plane crash with his family. Instead of thinking that maybe he's not a very good pilot, he saw it as a sign from God that instead of making terrible B movies, he must make terrible Christian movies. He teamed up with a preacher named Estus W. Pirkle to make Pirkle's book of the same name into the hour-long sermon that is \"Footmen.\"<br><br>From the very beginning, even before watching the film, you know it's going to be terrible, mainly in that the title is too long and unwieldy. It may be OK for the title of a book, but movie titles are usually a lot shorter and to the point. Something Ron apparently didn't learn in film school.<br><br>The film itself consists mainly of Estus W. Pirkle giving a sermon in a church while occasional flashbacks show graphic detail of what Pirkle believes will happen if the United States doesn't get Christian enough and allows the commies to take over. From making children run through a stream, numerous shots of dead bodies with ultra-fake blood all over them, teaching children that praying to Jesus doesn't get you candy but praying to Fidel Castro does, dropping people on pitchforks, to shooting Christians leaving a church service, you get the general idea that when the commies come life will be particularly bad for Christians. The beheading scene is particularly hilarious in that not-meant-to-be-funny way of bad movies like this. However, the scene where the child with sticks poked into his eardrums is vomiting is particularly disturbing when you realize they must have really made him vomit for that scene.<br><br>And one thing that seems particularly funny is that when the commies come they won't be driving tanks, but they'll be riding horseback. In fact, none of the communist soldiers or officers drove any kind of vehicles at all except for the one white Ford pickup with a gun rack in the back window. And for some reason the commies all have M16 rifles in one scene. I guess living in a communist economy meant shortages of AK-47's so they had to steal rifles from the U.S. military when they invaded.<br><br>As far as the technical aspects go, the sound is bad and the color tends to get washed out even in dark scenes. The acting, of course, is particularly atrocious, and the main commie officer can't seem to hold his accent together. Not to mention that the armbands on their uniforms look like something made by children in grade school.<br><br>Then of course you have the message, a mixture of paranoia and religion. The basic message that Pirkle gives is that within 24 months (back in 1971), if we don't stop watching Saturday morning cartoons, dancing, and going to drive-in movies, God will leave America and go to Indonesia (strange because that country has a huge Muslim population) and without God living here (that's right, he seems to insinuate that God is an American) the commies will easily take over and start killing Christians. Apparently fundamentalist Christians had a persecution complex even 40 years ago. And of course the only solution is to fill churches with bible-believing people to listen to bible-banging preachers. I just hope they don't all fall asleep during the sermon like some of the people did in this movie.<br><br>The writing of this movie is completely horrible, since watching this movie is about as fun as listening to a street corner preacher for an hour. The flashback scenes with the communists persecuting Christians were totally laughable. And of course, what Christian movie would be complete without a come-to-Jesus moment? This movie is hilarious only when you look at it through the lens of what some crazy fundamentalist Christians believe. Of course, nowadays they're not afraid of communists so much as they are Muslims. The old paranoia is still there, only the bogeymen have changed. This movie is worth a laugh or two and shouldn't be taken seriously by anyone, even Christians. My condolences to anyone who was forced to watch this at their church group as a child.<br><br>The entire movie is available on Youtube, but for a better version look for the version by the Riffing Religion guys who give it an MST3K treatment.","user":"nuhc","rank":[7,7]},{"title":"Terrified me as a child!","rating":3,"date":"6 September 2013","review":"This movie was one that all our local churches gathered for a viewing when it first came out. IMDb has the release year to be 1971, but, we must have been seen it before it was officially released, because I was 5 years old when I saw it the spring or summer of 1969. I remember screaming and hiding my face in Daddy's shirt. It was the SINGLE most terrifying movie that I watched as a child. Horror movies, viewed as a teen, never left such impression on me as this movie did. It is not such a \"scary\" show NOW in this day and age, but, at the time, it was not a movie for a child to see. My parents have always apologized when this movie has been brought up in conversation. So, please, keep in mind that, while this movie is okay for older children and up, it is not appropriate for children who have not yet learned the difference between what's real and what's not real.","user":"aagdeppa","rank":[7,7]}]