[{"title":"An old fashioned modern western","rating":8,"date":"21 August 2007","review":"I saw this film last night at a preview in the lead up to the Toronto International Film Festival. Having never been a big western fan (with a few exceptions - Shane, High Noon, The Wild Bunch) and having been rather indifferent to Walking The Line, James Mangold's last directorial effort, my expectations were modest, despite the hype that the film has received. But I was duly impressed. The action and tension remain constant throughout but, more importantly, the plot is compelling and the acting is terrific. No doubt many will be impressed by Ben Foster's affected performance as Russell Crowe's loyal but psychopathic sidekick (think Johnny Depp in the Pirate movies) but to my taste it was much too over the top in a cast that offered a number of subtle and well thought out performances.<br><br>Russell Crowe is brilliant as the arrogant, amoral outlaw Ben Wade and Christian Bales infuses his role as a beleaguered rancher and Civil War veteran with just the right mix of pathos and dignity. Iy was wonderful to see Peter Fonda be given a role in which he was allowed to demonstrate his genuine talent, much too long hidden away. In my view, though, it is Logan Lerman who most deserves the accolades that will certainly come his way. He plays Bales' teenage son who comes of age in the course of the film. Initially disillusioned with a father whom he sees as drudge and a failure, he eventually recognizes his father as the hero he is (or at least becomes).<br><br>Cinematically, this film ranks up there with the best westerns of all time. It is consistently beautiful to watch and captures the expanse and majesty of the American west as well as any movie I've ever seen.<br><br>In many respects this is a traditional western (it is a remake, after all). They really don't make movies like this much anymore and it will be interesting to see whether it finds an audience in this era of dumbed down teen comedies and quirky slices of dysfunctional modern life. I wish it well.","user":"harricks","rank":[400,524]},{"title":"Seven/Noon","rating":21,"date":"21 August 2007","review":"\"The boys dressed themselves, hid their accoutrements, and went off grieving that there were no outlaws any more, and wondering what modern civilization could claim to have done to compensate for their loss. They said they would rather be outlaws a year in Sherwood Forest than President of the United States forever.\" Mark Twain's Adventures of Tom Sawyer <br><br>In 3:10 to Yuma, a few references to The Magnificent Seven and the idea of a train arriving at a specific time when good and bad guys converge, as in High Noon, made viewing this Glenn Ford remake from 1957 a pleasant one. And right I was but for even more good reasons.<br><br>Not since Unforgiven and The Quick and the Dead have I been as excited about seeing a Western in its heroic and revisionist forms. 3:10 to Yuma is a true Western in the American film tradition about the 19th-century American West: It has clear heroes and villains (and a mixture of those), wide prairies, dirty towns, fast guns, weak lawmen, cunning murderers, kids on the cusp, and women marginalized, just for starters.<br><br>Then ratchet up to the philosophical/post modern/post Eastwood reflections on the profession of being a gunman juxtaposed with being a responsible father, and you have an classic angst-filled clash where villain has a wee bit of heart and hero an equal measure of cowardice. Delightfully mix in a certifiable baddie in the Lee Van Cleef/Jack Palance tradition, Ben Foster (Alpha Dog) as Wade's amoral lieutenant Charlie Prince (as in \"of darkness\"). Best of all, it is nail-bitingly suspenseful and beautifully photographed.<br><br>In order to pickup some home-saving cash, poor crippled farmer Dan Evans (Christian Bale) is helping transport murderer Ben Wade (Russell Crowe) to court via the 3:10 to Yuma from Bisbee, Arizona. Getting Wade to the station is no easy task, even for the several deputies, because Wade's evil gang is in hot pursuit and more importantly, Wade is psychologically working on them from within, alternately charming and brutal; just imagine his roguish smile behind an extremely fast gun and unscrupulous conscience.<br><br>It's hard to believe a studio could dump such a winner in the dog days of summer. I will say only that if you have even a modicum of respect for this genre, see 3:10 to Yuma and relive the golden days of straight-up shoot-em ups with rough-hewn characters, electric plot, and revisionist attitude about the romance of being an outlaw or a farmer. Get there on time because that movie train goes fast from the get go.","user":"jdesando","rank":[337,468]},{"title":"No western, with courageous sacrifice, can be stunning by accident!","rating":8,"date":"30 March 2008","review":"Christian Bale (Dan Evans) holds the screen as an honest rancher who volunteers for two hundred dollars to be part of a doomed group of guards to take the enigmatic bandit and killer Ben Wade (Russell Crowe) to a train, the 3:10, leaving Bisbee, Arizona for Yuma prison to trial<br><br>Beaten down by an old Civil War injury, and unable to protect his farm and his family from Wade's ruthless gang and humiliated by his teenage son (Logan Lerman) who makes no efforts to hide his disappointment in his impoverished father, and who doesn't try to hide the fact that he admires the charismatic criminal, Dan finds a great quantity of reasons to undertake the perilous trip to Contention City to fight back like a real man and regain his son's respect The story concentrates on Evans whose unknown destiny tries to paint to his son an unforgettable picture turning up poignant and endearing <br><br>Wadeleader of a murderous band of robbershad great respect for Dan throughout the film and develops a kind of understanding and appreciation for him Their short scenes in the hotel room celebrate the virtues of two opposite men who stand up for what they believe stopping on issues in relation with family, dignity, virtue, and admirable integrity The best scenes are those in which Wade teases Dan: \"Your conscience is sensitive, Dan. It's not my favorite part of you.\" <br><br>Crowe's interpretation of a gifted cold-blooded smooth-talking bad man is one of the most compelling parts of the film Bale is splendid as the struggling, crippled rancher, misunderstood by his whole family The two actors comfortably inhabit this stunning western <br><br>It is nice to see that there are still good westerns being made lately And James Mangold's \"3:10 to Yuma,\" a remake of Delmer Daves' 1957 picture, is one of them It is a Western with realistic violence, great action sequences, breathtaking photography, and an inevitable final shoot-out","user":"Nazi_Fighter_David","rank":[91,125]}]