[{"title":"A Surprisingly Good Sports Film Lacking Most Cliché","rating":8,"date":"28 February 2010","review":"During the 2010 Winter Olympics, NBC broadcast a 30-minute documentary piece on the 1980 US Olympic ice hockey team. While I knew the story of how they beat the Soviets and won the Gold Medal (I had seen it live as a kid), I was expecting some clichéd rhetoric about the team and what they had done, akin to films like \"Knute Rockne, All American\" (1940) and \"Rocky\" (1976). I was pleasantly surprised to find that the story was anything but. The coach of that team, Herbert Brooks, was no hackneyed clone of a Knute Rockne or a Vince Limbardo. Instead he was a tight-fisted uncompromising hockey general who distanced himself from his players, more like a Bobby Knight than a Knute. This was not someone with whom teammates would feel comfortable having a beer. Instead, his inspiration to the players came from the other direction, by exposing their weaknesses and in some cases using unfairness and resentment as anchors from which to get the best out of his players. I decided that \"Miracle\" might be worth a look, especially as a prelude to the US vs Canada in the gold medal round of 2010 Olympic Hockey.<br><br>Kurt Russell portrays Herbert Brooks as a lean and mean hockey coach who leaves sentimentality at the front door of the ice hockey rink. From the get-go he informs his players he's not there to be their friend. His goal is to let loose their highest playing potential coupled with the best conditioning among the Olympic hockey players at all costs. At times, he seems to be driving the players too hard well-beyond their comfort zones. Much of the story is the unconventional training techniques he uses to prepare the players for the 1980 Winter Olympics. According to the film, Brooks is relatively new to these techniques which he adopted while studying USSR hockey. His plan is to use the Soviets' techniques against them in the Olympics, which is not just about strategy but also about extreme discipline and an uncompromising tough sensibility akin to the military. One character points out that everything Brooks does has a purpose behind it. <br><br>The only short-coming in the script may be the portrayal of Brooks' wife who finds her relationship with her husband compromised, at least according to the film. I wondered if it played out in real life as in the film or if it was fabricated by the screenwriters. Too many sports movies have this sort of relationship with the wife acting as the balance between the obsessive coach and the needs of his family. She's been through this before. Why did she marry him in the first place? To be a successful account?<br><br>Certainly, most Americans know the outcome of the story, although the sequence of the game between the US and the Soviets is riveting and plays out about as well as the fight between Rocky and Apollo Creed. However, the meat of the story is really about the relationship between Brooks and his players, and the coach's single-minded determination to create the best Olympic team possible. By putting a certain amount of anger and determination into their hearts and heads, Brooks brings out the best in them, much like a sergeant in boot camp. The speech before the Americans played the Soviets is one of the better scenes of its type, leaving behind the \"do it for the Gipper\" silliness that has become a sports cliché. The only moment which was lacking in the film was the speech before the very final game when the US played Finland after the Soviets. In that speech, apparently Brooks told his team that if they didn't win, they would go to their graves regretting the missed opportunity. I would have liked to have seen Russell give that speech as well. Apparently Herb Brooks died before the principal shooting of this film had ended, and the film is dedicated to him. Just about as fitting a tribute as a coach could ask for.","user":"classicalsteve","rank":[22,22]},{"title":"It was winter of 1980, and I remember it well.","rating":1,"date":"1 November 2004","review":"'Miracles do happen', the announcer's original broadcast is heard during the scenes recreated for this movie, 'Miracle.' Anyone who remembers what happened during those Winter Olympics in 1980 will know what this movie is about, and how it ends. However, there can be no spoilers, because this is not a movie about a hockey game, or even the sport of hockey. Nor is it about the players. It is solely about the coach, Herb Brooks, who, with his unconventional style and wisdom about the game, took these young hockey players to a level no one thought possible. In the end it didn't really matter whether they won or lost the game against the Russian. What mattered was that each of the 20 players found out what was possible inside himself.<br><br>The movie begins with a montage of scenes from the period, the years, leading up to the selection of the Olympic hockey team in the summer of 1979. The cold war. The oil shortage and long gasoline lines. The disgraced President Nixon. The embattled President Carter. The Russians invading Afganistan. Then we see coach Brooks doing it his own way. A year and a half of scouting, one day of try-outs, to pick the 26 players which would eventually be cut to 20 for the competition. The DVD extras show us how much went into making the movie faithful, including a session with Brooks himself, who died in an accident right after filming was wrapped up. A very fine movie of a very inspirational journey.","user":"TxMike","rank":[41,45]},{"title":"A Miracle for Disney","rating":8,"date":"13 May 2005","review":"Don't let the fact that this is a Disney movie deter you from watching a thoroughly enjoyable and adult-level sports movie for two-plus hours. Kurt Russell does an excellent job portraying coach Herb Brooks as a complex and sometimes ruthless and inscrutable leader. Very UN-Disney-like indeed. <br><br>I am not a hockey fan - in fact I dislike the game intensely - yet I enjoyed the well-crafted scenes of competitive team play. Knowing the outcome of the BIG GAME did not detract at all from the excitement and suspense surrounding it. Sort of like the suspense Ron Howard achieved in Apollo 13 (where we knew in advance the outcome, but were worried about and later relieved for our astronauts). <br><br>A must-see for sports fans and non-fans alike.","user":"j-lacerra","rank":[41,48]}]