[{"title":"Stunning - in every sense of the word","rating":10,"date":"18 December 2004","review":"Cidade de Deus seems to have a lot of praise on the IMDb boards, and with good reason too. It simply is, in my opinion, one of the best contemporary films ever made.<br><br>Based on true events and characters who live in the overlooked and poverty stricken slums in the shadows of Rio de Janiero, where life expectancy doesn't reach the 30's and drug dealers are kings.<br><br>The tale of the City of God, and its myriad of characters is told by Rocket, a young man who struggles to make something of his life, other than to wind up another victim of drugs or gang wars.<br><br>Not only are the characters in City of God absolutely fascinating, and also very endearing, but also convincingly acted by groups of young and unknown actors. The stoies are well-told, and at times, funny, and at others, brutally shocking.<br><br>The cinematic style of the film gives a nod to Tarantino, with some clever time-jumping, freeze-framing, and texts indicating another chapter of the film. In every sense, a bit of a Brazillian \"Pulp Fiction\" or \"Goodfellas\", but with its own unique flavour to it.<br><br>The City of God is a marvel, and a highly recommended film to watch, but not recommended for the over-sensitive or easily distressed.","user":"trelloskilos-1","rank":[753,838]},{"title":"\"One of the best films you'll ever see!\"--Roger Ebert, does it live up to the hype?","rating":10,"date":"28 November 2004","review":"The film revolves around the, 'City of God,' a favela (or ghetto) in Rio de Janeiro, Brazil, a horrifying area where drug dealers run the community, and where children killing children is not an uncommon occurrence. <br><br>The story begins with the early stages of the City of God (in the 1960's) showing where many of the problems stem from- the extreme poverty, overcrowding etc. Here, in the early stages of the favela, we meet our main characters, along with the supporting cast. The story revolves mainly around two characters living in the favela, Rocket and Lil Ze, and how they take two different paths through life. Rocket's dream is to become a photographer and to escape the City of God while Lil Ze becomes a powerful gang leader and drug dealer.<br><br>The film offers an unflinching look at gang life in the City of God, as it follows the favela through three decades; the 60's, 70's and 80's, and shows how violence just spirals into more violence with the disturbingly high amounts of violence in the favela, most involving teenagers and children. <br><br>The direction, cinematography, and editing are all Oscar-worthy. The cinematography is some of the best I have ever seen- with a very visceral, jerky feel, very reminiscent of Saving Private Ryan. The editing is very frantic, which makes you feel like you are on the streets of the City of God, and the direction is flawless, seamlessly blending the many elements of the story.<br><br>The film was definitely one of the best films I have ever seen. The story, the direction, the cinematography, the editing and the acting all add up to make a excellent movie that I would recommend to all. <br><br>10/10, A+<br><br>Would also recommend: Bus 174 and Carandiru","user":"ragin_kagin","rank":[633,717]},{"title":"Gangs of Rio","rating":17,"date":"17 May 2003","review":"If you're unlucky to be born into a socially, economically and racially isolated community that has poverty, crime, drugs and violence as its everyday realities, the odds are stacked incredibly high against you. It literally takes so much effort, strength, struggle and plain ol' good fortune to simply avoid becoming a gangster, let alone do anything more with life. Most who find themselves in the situation described above never even enter this fight and out of those that do - only the rare ones succeed.<br><br>\"City of God\" depicts this conundrum masterfully. <br><br>In a Rio slum called Cidade de Deus we meet character after character that has the right idea, knowledge and courage to get out but somehow always ends up being pulled right back into this vicious circle. Becoming a hoodlum in Cidade de Deus isn't just a fringe career option for disenchanted rebels and social outcasts - it's the main industry.<br><br>The images of gun toting pre-teen killers are very disturbing and Meirelles uses them relentlessly to underscore just how hopeless and frighteningly predetermined life is for these kids. Many of them can't read or write but already know how to use a gun and kill without remorse. In a particularly harrowing scene, local drug lord Ze Pequeno or Lil' Ze (Leandro Firmino da Hora) exacts revenge on a disobedient gang of 9 and 10 year olds by incapacitating two of them and forcing one of his own kid soldiers, as initiation of sorts, to choose which one of the two he wants to kill. Faced with death, one of the kids starts crying crocodile tears; suddenly all the bravado is gone and he is shown for what he truly is - a desperately misdirected infant.<br><br>'If only these people had more options....' is the sentiment reinforced with every gruesome event. <br><br>Of course, this lifestyle comes a little more naturally to some than to others. Ze Pequeno, for example, from an early age when he was known as Dadinho / Lil' Dice shows a considerable lack of aversion to blood and death. In another aptly choreographed scene so that we don't know what exactly happened until much later, he more than 'holds his own' alongside much older gangsters during a motel stickup. <br><br>Also on hand is a colourful palette of characters. From our narrator Buscape / Rocket (Alexandre Rodrigues) whose ticket out of the slum is his love of photography over to people like laidback Bene / Benny (Philippe Haagensen), followed by Ze's fierce rival Cenoura / Carrot (Matheus Nachtergaele) or good guy turned bad (although it's not so simple) Mane Galinha / Knockout Ned (Seu Jorge) we see a multidimensional, pulsating, alive community that seems in need of a strong, sustained outside push to finally stop chasing its own tail and get out of this destructive cycle.","user":"Decko_koji_obecava","rank":[362,424]}]