[{"title":"I wish I had known how sad this movie was going to be.","rating":10,"date":"29 January 2007","review":"I just watched this movie last night for the first time. I wish I hadn't. It was one of the saddest films I have ever seen. It bothered me to no end. I kept waking up all night thinking about it. I feel terrible.<br><br>The movie hit me especially hard because of my personal experiences. I spent several years living in the West and had a relationship with another man, who has since died. Watching this movie brought back many of the emotions I thought were long buried.<br><br>I feel like grabbing my coworkers and talking them to death about this film, but I know they don't want to hear about it. I feel this driving need to keep talking about it - maybe if I keep talking about it I can get the ending to change.<br><br>If I had known how this film was going to affect me - I wouldn't have watched it. It's too late now - I can't get it out of my head. I don't think I've ever been affected this much by a movie.","user":"fezziwiggs","rank":[176,187]},{"title":"A jewel of a film.","rating":10,"date":"9 July 2006","review":"I love this movie. Really love it. Haunting score, stunning cinematography, gripping performances, timeless tale--everything. People quibble about non-essentials. I'm female, middle-aged, hetero, and I defy you to tell me that the average straight guy is any more expressive than Ennis or any less needy than Jack. Or the average gal, either, straight or gay. Deeper than their sex, their sexuality, their religious, educational, economic or historic backgrounds, Jack and Ennis are two human beings living in the world as they find it--beautiful and indifferent at best, and as they find themselves--beautiful and flawed at best. Desire is desire. The desire for warmth, for connection, for any echo at all in the vastness of time and space, is shared by every human being ever to have lived. For me, the issue is not how repressed or thwarted Ennis and Jack are, but how persistently they turn toward the light, despite all impediment. Brokeback Mountain lyrically retells a story thousands of years old: loss and grief are unavoidable; love is where you find it.","user":"magicmote","rank":[89,95]},{"title":"This movie broke my heart.","rating":10,"date":"15 October 2006","review":"For all of those who are holding back from watching this movie because it is \"gay\" or has love scenes between two men...oh! This movie has nothing to do with sex...and to be honest, I don't feel that it has much to do with homosexuality. This is the most beautiful and profoundly sad love story I have ever come across, and the fact that it is a love between two men is beside the point. It's about a love between two people who cannot be together, but if human beings were better at being human, and if the world was a better place, they would have lived out their lives side by side. I was so, so moved. AMAZING!!!! A must see.","user":"aimeelee76","rank":[115,124]}]