[{"title":"Entertaining horror movie","rating":7,"date":"23 November 2015","review":"At first, when I saw the name Paris Hilton, I wasn't too sure about House Of Wax (2005). But I decided to give it a fair shot anyways, and I'm glad I did. House Of Wax was actually an entertaining well made horror film. The plot was cool and intriguing. The actors were well casted, and I enjoyed all the characters and the actors playing them did a good job, yes, even Paris Hilton did a pretty good job. The movie was never boring, it always kept you interested and on the edge of your seat. The violence was a bit too graphic at times, but overall it wasn't that bad, other horrors have been far worse when it comes to carnage. Now it's not like the movie was flawless, it did have some flaws. The acting in a few scenes was kinda lackluster, could have been better if they would've just tried again I'm sure. I know a lot of people thought Paris Hilton was going to just be terrible in this movie, in my own personal opinion, I actually thought she did pretty good In her own respective role. She did get to dance around in her lingerie in 1 scene, so you straight guys out there, there you go. For the ladies and gay guys, do not despair, there is definite eye candy for you as well. Chad Michael Murray is one of the main stars here, who actually acts well and looks hot in his role at the same time, hard to find in a horror movie! So does Jared Padalecki, he does well in his role, and looks good doing it. This movie is just a good time for horror movie fans. It's not poorly made or cliché, or cheesily acted. 7/10 for house of wax.","user":"davispittman","rank":[12,12]},{"title":"Great Friday night horror entertainment","rating":8,"date":"15 May 2005","review":"I like a horror movie every now and then. There's been a dearth of acceptable ones lately.<br><br>This one was different. The setup's the same, and you know when somebody's about to get killed, but I didn't end up hating the cast. Usually, horror movie victims, they deserve to die either for being too stupid or too unlikeable in the first place.<br><br>These characters just showed up at the wrong place at the wrong time. I wanted them to live even though most of them don't make it. <br><br>Elisha Cuthbert's performance was excellent, just as Jessica Biel was in the remake of the Texas Chainsaw Massacre. Chad Michael Murray's role I liked as well. They both play ordinary characters dealing with a dire situation, but doing so in a credible, intelligent manner (e.g. they don't run around screaming for the duration of the money, only parts of it). The movie starts out slow but picks up the 2nd hour...there's a lot of moments with chilling, atmospheric intensity.<br><br>and I have to say...I thought they ran out of ways to creatively kill people in this genre, but I saw a variation yesterday. And it was nasty enough to keep me awake last night after the film, thinking, \"that's got to be such a horrible way to go.\"","user":"grillmasterj","rank":[10,10]},{"title":"A guilty pleasure of mine, a fun and entertaining slasher.","rating":8,"date":"2 May 2010","review":"House of wax is a typical slasher in many respects but that does not take away from the certain charm it holds...it has pretty much everything you would want in a horror film.<br><br>The plot is simple and standard for the genre. We are introduced to a group of young adults on their way to a football game. Carly Jones (Elisha Cuthbert) a sweet yet sassy girl who is nervous about moving to the city for a new job. Her trouble-making bad-boy brother Nick (Chad Michael Murray), supportive best friend Paige (Paris Hilton). Along with Carly's sweet and protective boyfriend Wade (Jared Padalecki) and rounding off the cast Dalton (Jon Abrahams) proving comic relief, and Blake (Robert Ri'chard) Paige's boyfriend who is really just a token character. whilst hoping to score tickets to the final football game of the season. Along the way, they run into some car trouble, and are forced to camp in the woods where they enter a desolate town where nothing is what it appears to be. <br><br>What's nice about House of Wax is its relatively slow burning, sure there are some jump scares and creepy moments but the real action does not start until around the 40 minute mark, some might call this dull but for me it only makes the third act even more impressive.<br><br>Despite the little character development, the acting is surprisingly good and helps make the characters likable. Jared makes a sympathetic turn as Wade but the real stars are Elisha and Chad. Elisha gives a great performance as Carly and is one of the better lead actresses I've seen in recent horror. She is vulnerable and strong at the same time, portraying fear very well indeed. Chad despite his pretty boy image does a good job as the bad-boy and unlikely hero of the film, he is strong and protective and you root for him as he tries to save himself and his sister. The only problem i had with this paring was the high sexual tension there seemed to be between them. There were many moments where you felt as if they were about to kiss and its almost better to just picture them as girlfriend and boyfriend during the final act.<br><br>The film is of course not perfect, the dialog was weak and the big \"twist\" was hardly anything surprising as you could have predicted it from the start. <br><br>The ending tried to give you another \"twist\" which again failed in the same way the previous one did....in fact the whole ending was a let down. The characters make very stupid choices through out the film such as not making sure the attacker is dead, splitting up etc and whilst these are also a given in slasher films it never stops being annoying. <br><br>The third act was pretty intense though if a little short but all in all the film is a great fun ride full of scares and tension....also great kills and leads you want to live instead of hoping they would die.","user":"lbabe29","rank":[14,15]}]