[{"title":"It's about time there's a movie about morals.","rating":10,"date":"29 June 2005","review":"Honestly, I don't care about dates. I don't care about names, or stats, or if the writers got a bunch of stats confused. I mean did you actually watch the movie, or were you just looking at the screen for misprints on jerseys? To believe that some people can actually watch a movie and then complain that the time line is off with reality is beyond my comprehension. Who cares about the time line! It's not reality that you're watching, it's a movie. Movies, no matter how real the stories they are based on, are not real. They are altered. They are changed to make a better storyline.<br><br>If people can be dense enough to complain about names and numbers and dates, then they missed the big picture. They missed a great movie that actually conveys a real message. It's not about the sports, it's about the students. And it's not always about what you put in, it's about what you take out. It's about what you take away from the situation that you've walked into.<br><br>That's what this movie is about, not about basketball. It's about life, and how easily people give in and give up. It's about learning, and having faith that people will do the right thing. Yes, it's about public education, and a community on the edge of stupid, but there's more to it than that. You just have to stop looking, and watch.<br><br>This movie truly was excellent, right up there on the shelf next to \"With Honors.\" But make sure you are really paying attention, otherwise, what's the point?","user":"crity2re","rank":[161,181]},{"title":"\"I Came To Teach Boys... And You Became Men.\"","rating":10,"date":"12 October 2010","review":"This movie was fantastic! I first saw it during the last day of Summer School (yes, I went to Summer School. Shut up) and I have to admit that I did NOT want to watch it at first because it was a sports movie. But upon viewing this movie, I found that I liked it and enjoyed it. I then swiped the movie from my father's house and watched it every night for 3 nights straight. Here are the things that caught my attention.<br><br>1) Samuel L. Jackson. One of the greatest actors ever was in this movie so I was instantly drawn in and thought that I'd give it a chance.<br><br>2) The Music. Loved the music even though the majority is rap. It fit the movie perfectly.<br><br>3) The storyline. I really loved the story and the plot devices. The drama sequences were REALLY good.<br><br>4) The truth. This movie was pretty much dead-on to Ken Carter's real life experience. I watched the bonus feature \"Coach Carter: The Man Behind The Movie\" and it compared the movie to real life. It was like a perfect match.<br><br>My favorite lines were at the end spoken by Samuel L. Jackson after the final game. I always watch that every night. It's become kind of like a tradition for me. I showed this to my mom and she instantly fell in love with it, too.<br><br>So, all in all, really good movie. If I could rate this higher than 10 stars, I would've.","user":"Megatron1234","rank":[15,15]},{"title":"Good Movie","rating":30,"date":"30 January 2005","review":"\"Coach Carter\" is a well-made movie, and from what I have heard it stays true to the actual story. If you're sick of inspirational-type movies, then don't go see it, but otherwise I highly recommend it. All of the performances are at least tolerable, and most are really good. Samuel L. Jackson is great. Most sports movies have terrible action scenes, but the basketball footage in the movie is actually quite believable (for example, no short white kids dunking and things like that). The movie is very realistic, and the director has gone to great lengths to make it seem as true-to-life as possible. I think it works very well.","user":"Gundersonm","rank":[59,67]}]