[{"title":"Great Friday night flick!","rating":7,"date":"26 November 2010","review":"While digesting my Thanksgiving meal, I wanted to watch a good movie in front of the fire on a cold winter night. Whiteout seemed appealing because of the synopsis and the setting. I love the desolate setting of an science facility in the cold lifeless continent of Antartica. There is always something creepy and thrilling about being so far from civilization and life sustaining climate; the movie had a similar creepiness to some other thrillers that take place in deep space. The plot and setting were original, and keep you guessing throughout the movie. The suspense and thrills were more likened to a horror movie or a slasher film, but I say that in a good way. My 17 year old daughter and wife had to turn their eyes away for many scenes in fear and anticipation.<br><br>I like to judge movies by what their intent is. I try and compare Old School to Gone with the Wind for example... 2 completely different audiences and intents, but both great movies that deliver what they try to deliver. In my opinion, Whiteout delivered what it tried to deliver, a scary, interesting, beautiful, thrilling escape. Exactly what I wanted to see on a cold Friday night in front of the fire!","user":"hkronin","rank":[51,62]},{"title":"Sorry, but I loved it","rating":8,"date":"4 July 2011","review":"Okay, this isn't a Great movie. It's not even a great whodunit. But in a world where old Charlie Chan pot-boilers have a cult following, and boneheaded Spielberg spectaculars are considered works of genius, I'd say that Whiteout definitely has a place.<br><br>What did I like about Whiteout? I loved the setting. ANY movie set in the confines of an Antarctic research station is okay with me. (There aren't nearly enough of them!) I loved the characters. Kate Beckinsale isn't in the front ranks of thespians, but she's a solid leading lady, and brings a good mix of likability, vulnerability and toughness to this part. The supporting characters are just fine as well. I loved the idea of setting an action-mystery in this odd locale, and I greatly enjoyed the way the mystery unraveled - predictable though it may have been. And I loved the various ways that the frozen environment is brought in as an element in the story.<br><br>What did I hate? Not a thing. True, the cold is not treated realistically. Too many people walking around bareheaded and such. Yes, it's a dopey Hollywood convention. But in a little action flick like this one, I wasn't bothered - at all. Did I hate the acting? No. It was just right for this kind of film. Did I have problems with the writing? Okay... there were a few bits of logic that could have been tighter. But, again, no worse than in many movies that get a 10/10 from every blockhead on Earth. (I won't itemize... this review is going to get enough down-checks as it is.)<br><br>Bottom line, Whiteout is a pile of fun. It's a 'genre' film, with few if any artistic pretensions. But it delivers the goods where it counts. I've watched it several times on DVD, and expect to enjoy it quite a few more. If you don't get it, go watch some Merchant-Ivory drawing room masterpiece, and we'll all be happy.","user":"fung0","rank":[62,79]},{"title":"Not bad. It has some nice atmosphere and a great setting.","rating":6,"date":"29 May 2010","review":"Whiteout isn't as bad as people are claiming it is, in fact I had an OK time with it, when all was said and done. There is a dull section in the middle that's hard to get through, but the fairly exciting finale makes up for that in my opinion. I give big props to the film cast for having to go through such a rigorous weather treatment, but it made for a fairly effective movie. The negative thing about Whiteout though is, I didn't think it took advantage of its immense potential. It's definitely watchable and fairly entertaining, but it could have been a film to remember with that type of setting and the plot, and unfortunately I guessed the twist at the end halfway through the movie. Kate Beckinsale makes for a very good lead, while being believable at the same time, and that's very important for a film like this. Whiteout has it's fair share of spooky moments, the atmosphere is great, and in the end I was entertained for the most part, but it could have been so much more.<br><br>Performances. Kate Beckinsale is gorgeous to look at, but also a pretty good actress too. She's likable and her Feistyness, but also vulnerability worked well for her. Gabriel Macht does well as Pryce, he was pretty charismatic. Tom Skerritt is OK as the Doctor, I suppose he had a presence. Columbus Short is likable as Delfy. Alex O'Loughlin is quite intense in his role.<br><br>Bottom line. It's worth a watch on Telly or DVD that's for sure, it passes the time well.<br><br>6/10","user":"callanvass","rank":[39,53]}]