[{"title":"Performances are rich","rating":19,"date":"19 January 2004","review":"The Cooler is an odd but ultimately satisfying mixture of real feelings, unexpected violence and improbable situations set against of the backdrop of a Las Vegas nearly gone from this world.<br><br>William H. Macy plays Bernie, the Cooler of the title.  He is a man whose luck is so bad that it not only infects his own life, but can be rubbed off on unsuspecting gamblers at the Golden Shangri-La casino where he works. By merely touching the table where a winner is betting he can change their luck to bad, thereby cooling off their winning streak.  It is in this capacity that he meets a cocktail waitress named Natalie (Maria Bello) who begins a relationship with him after he cools the luck of a customer who gets fresh with her.  As the unlikely couple begin to form a strong bond, Bernie's luck begins to change.  It is when Shelly (Alec Baldwin), the casino manager and boss to both Bernie and Natalie imposes his will on the situation that Bernie's newfound luck and love are tested.<br><br>Macy has spent his career playing hapless losers and hard luck characters. In Bernie, he hits the jackpot, delivering a well modulated, brave performance.  Brave because he allows Bernie to be shown for what he really is, a not overly attractive, middle aged loser in both body and spirit. Macy shows us a lot of himself both literally and figuratively and it is that which brings a sense of truth to the performance.<br><br>\nBaldwin, who is being billed as a mere co-star is actually a major player in the story.  Shelly is a character who utilizes more brute force than the usual steely-eyed verbal barrages that Baldwin excels at.  But Shelly is a great character for Baldwin, a man so sure of his place in life and even in Vegas history that he will not bend under any amount of pressure.  The Golden Shangri-La is, according to Shelly, the last of the old-style Vegas casinos.  The proposed remodel of the casino threatens Shelly at a deep level, making him all the more inflexible.  This is definitely bad news for anyone Shelly comes into contact with who would try to thwart his will in any way, including Bernie and Natalie.  It is a tribute to Baldwin that the Shelly is someone the audience can never find it in their hearts to dislike completely, despite his intolerable actions.<br><br>If in the end, the improbabilities of the story overshadow the ending, it is a fairly minor consideration.  This is a movie of performances more than storytelling.  Macy's performance is so fine and delicate that one is hard pressed to see how difficult it must have been to do.  Bello, as Natalie, shows an underlying fragility that draws the viewer to her and shows us why Bernie would love her.  And Baldwin is the hurricane force wind that rages and storms through the proceedings.  And it is the audience who is lucky enough to see it all.","user":"Qcoatl","rank":[83,99]},{"title":"ALEC BALDWIN","rating":20,"date":"20 June 2004","review":"The Cooler is worth seeing just for Alec Baldwin's performance alone. An old style casino boss, his inability and unwillingness to accept the new Vegas sends his volatile nature over the edge. Baldwin has always been an underrated actor- at the start of his career, the big studios made the mistake of trying to market him as a star, rather than as the quality actor that he is. He is also helped by working alongside another great actor, William H Macy, who can do more with a look than most can do with 6 OR 7 pages of dialogue ( See the scene when he realizes Maria Bello is still in his flat ). See this film for the acting. It's good to see that films like The Cooler and 21 Grams are doing well and being recognised - it is a triumph for acting and strong scripts as opposed to continual FX and CGI in modern cinema.","user":"jedobi","rank":[86,104]},{"title":"outstanding performances in a flawed but good film","rating":21,"date":"21 August 2004","review":"William H. Macy, Alec Baldwin and Maria Bello give unforgettable performances in 'The Cooler,' a moody tale of high stakes gambling on the Vegas Strip. Baldwin plays Shelley Kaplow, a casino operator steeped in nostalgia who hates what has become of his beloved city and prefers to do business the old-fashioned way (i.e. breaking a leg or two or even rubbing a person out if the situation calls for it). Shelley is also so intensely superstitious that he's hired a 'cooler' to rein in any gambler who starts winning a bit too much against the house. Macy is the 'cooler,' a man named Bernie who's been a loser all his life. It is Shelley's contention that all Bernie has to do is stand next to a gambler on a hot streak and that player's luck will immediately turn cold. And it works. Bernie is like a dark cloud roaming the floor of the casino, bringing despair and depression wherever he goes. The problem for Bernie is that, although he makes a living doing this, he has virtually no self-esteem left. He truly believes that he is a bad luck charm, an impression he carries over into his personal life as well. Enter Natalie Belisario, a sweet, beautiful cocktail waitress at the casino, who is assigned by Shelley to accompany Bernie on his treks around the room. What none of them expect  least of all Bernie and Natalie - is that the two of them will wind up falling in love with each other and that this happy turnabout in Bernie's personal life will extend to the professional arena as well. Bernie's new role at work as a wandering leprechaun, dispensing good luck and fortune in his wake, is not, of course, a positive thing for business. Thus, Shelley feels compelled to step in and wrest control of the situation, any way he can.<br><br>The screenplay uses the gambling scene in Vegas as a metaphor for life. The film, written by Frank Hannah and Wayne Kramer and directed by Kramer, shows that achieving happiness is really all about taking chances, laying down our bets and going for the big score even when all the odds are against us. And nothing in the film underscores that theme more than the relationship between Bernie and Natalie. In fact, Bernie's final act is really one giant spin of the wheel that manages to pay off. After he's taken his chance and beaten the house (and not just at the craps table), he is Bad Luck incarnate no more. Yet, in many ways, the script is so heavily symbolic - so rife with contrived allegory and neatly lined-up parallelism  that it almost ends up derailing the film in the second half. On the positive side, Bernie and Natalie make a compelling romantic couple, as she attempts to build up his confidence and make him see his own self-worth. Macy and Bello do a beautiful job capturing the essence of these two lost souls who find strength in each other's weaknesses. In addition, Baldwin paints a chilling portrait of a man who is smooth and suave on the surface, yet so ruthless underneath that he will literally stop at nothing to get what he wants. The dialogue is sharp, abrasive and insightful and the insider view of casino operations is, as always, fascinating to watch. The film also captures the evolutionary struggle Vegas itself has been undergoing over the years. Shelley is like an animal facing imminent extinction, as the Vegas he yearns for  the one run by syndicate money for hardcore gamblers, truly the last outpost in a fading frontier where a fistfight or a gun battle could settle any argument  makes way for the new Vegas of glitzy mega-casinos and family-oriented Disney-esque attractions. <br><br>What undercuts the film in the second half is its falling for its own fantastical premise. The idea that one person can spread good or bad luck depending on his mood is fine for a ruse, but when the screenplay itself begins to endorse that view, the film loses both grit and credibility. The final sequences, in particular, have a feeling of desperation to them, as if the filmmakers couldn't come up with a viable ending, so they turned, quite literally, to Lady Luck to get them out of their predicament. The problem, essentially, is that 'The Cooler' starts off as a realistic drama, then wanders off into rueful fantasy. It makes the film more 'clever' in the long run, I suppose - though I, for one, would have preferred a more consistently life-like approach and a more believable resolution.<br><br>This is not to in any way denigrate the brilliant performances of the three leads or to minimize the many elements of quality that make up the film. Despite its flaws, 'The Cooler' is a compelling human drama that, if nothing else, will make you think twice before you grab all those winnings off the crap table.","user":"Buddy-51","rank":[74,94]}]