[{"title":"\"Not everyone can become a great artist; but a great artist *can* come from *anywhere*\"","rating":10,"date":"9 November 2018","review":"That's what the food critic, Anton Ego, says in his review of the movie's restaurant at the end of the movie. That is a good way to sum up Ratatouille.<br><br>This movie released a few days after my 9th birthday. My Grandma got the DVD and I loved it. I was a kid and animated movies were my jam! I even taped a Disney Channel showing on a record-able VHS. I have seen this numerous times, and I still love it. I just saw it again as a 20 year old and it still puts me in awe.<br><br>The movie is about Remy, a rat who has an obsession with food, cooking, and the humans who cook food. He meets a chef who can't cook very well, and he uses his talent to secretly help him. But that causes issues with a secret rat in a failing restaurant.<br><br>I can't think of a single flaw with this movie.The animation is beautiful(I noticed one car that almost looked real at one point)and the story is well told.<br><br>I know when I love a movie when I feel this thrill in my heart and an excitement along with it.(See my review of Lord of the Rings: The Return of the King) I felt that all throughout this movie, even though I have seen this movie numerous times.<br><br>This is an animated movie where you don't need to be a kid to enjoy it. (Roger Ebert said this as well.) Anton Ego also says that he will return to the restaurant \"hungry for more.\" Revisiting this as an adult makes me say the same thing about the movie he is in.<br><br>Edit: Nearly 11 months later, 7/7 people found the review helpful. I appreciate the positive feedback from everyone! If you enjoyed this review, please click on cinephile-27690 and click \"reviews\" on the right for more reviews! Movies are my passion, so let me share it with you!","user":"cinephile-27690","rank":[39,39]},{"title":"Nothing less than the finest movie ever made","rating":10,"date":"28 June 2019","review":"In many ways, the work of a critic is easy. We risk very little, yet enjoy a position over those who offer up their work and their selves to our judgment. We thrive on negative criticism, which is fun to write and to read. But the bitter truth we critics must face is that, in the grand scheme of things, the average piece of junk is probably more meaningful than our criticism designating it so...<br><br>This movie is perfect. This movie is the reason why I write movie reviews. This movie helped me appreciate effort and art. This movie helped me defeat my prejudices against things I don't really know.<br><br>It is a perfect kids movie, it is a perfect adult movie. Most Pixar movies actually contain very mature messages and this movie's message, \"anyone can cook\" is why we watch movies. Movies are meant to inspire the audience and this movie does a great job. Show this to a kid, they will watch it over and over again. I know because I used to watch this movie every single day.<br><br>This is not Remy's movie, this is not Linguini's movie, this is definitely not Gusteau's movie. This is Anton Ego's movie. The character development of Anton Ego is phenomenal. We see an arrogant critic become a humble and honest person, and it is what we should become at the end of the day. Most of us start out as arrogant and we do not appreciate effort and talent. However we must learn to give credit where it is due. We see Ego's journey in becoming this modest person, he changes for the better.<br><br>The final scene is one I cannot praise enough. Seeing Ego complete his arc This movie is an inspiring masterpiece, something we really need in the movie industry today.<br><br>Maybe I highly rate this movie because of my memories watching it. The scene where he tastes the ratatouille is exactly how I felt re-watching this movie. When I rewatched this movie I experienced something new, an appreciation of kids movies and their messages. This movie changed my whole perception on animated movies. Today, most movies are cash grabs produced with the sole purpose of making profit from tickets and action figures. We need more movies like Ratatouille in this world. In this critic's opinion, this movie is nothing less than the finest movie in history.","user":"fyapar-27303","rank":[20,20]},{"title":"Incredible","rating":10,"date":"17 June 2007","review":"Remember how everyone was talking about Toy Story when it first came out? The incredible visuals, unique style, vividly imagined world? The next time people were talking that way with such enthusiasm about a computer animated movie was Finding Nemo. I'm excited to say that Ratatouille will be the next one to redefine the visual creativity and technical detail of computer animated movies. Honest to goodness, I was awestruck by the animation, and that never happens to me. It is a visual masterpiece of a movie if ever the term applies.<br><br>The next thing to talk about is the \"genre\" of the movie. As Pixar enthusiasts will tell you, Brad Bird, the director of Ratatouille, also directed The Incredibles, which has the most inspired and creative action sequences from any of the Pixar movies. Ratatouille, while not so straightforward with its action, has almost as much as The Incredibles did, in unique ways. Most memorable is the shotgun scene near the beginning. (You'll know what I'm talking about when you see it). Other than that, this is the expected comedy-with-heart movie from Pixar that so many have grown to love.<br><br>The voice acting? Spot on. Every voice is distinctive, and it never feels like a celebrity's voice tacked on to a character (Shrek, I'm looking at you), it feels like the characters themselves speaking. You can't ask for more from voice acting.<br><br>And finally, the script and the story. The entire irony of the story -- a street rat with a passion for fine food -- is beautiful, and a tight, smart, wonderful script flows from this. The pacing of the story is odd and choppy at places, but this is a very forgivable grievance. The only other minor fault is that a few of the dramatic one-liners feel a bit forced. Other than that, this is the most layered, complex, and satisfying script from Pixar since The Incredibles.<br><br>Overall, I recommend that everyone see this movie when it hits theaters (I was lucky enough to see a pre-release screening). Though not perfect, it is an animated masterpiece in true Pixar form with breathtaking animation and visual design.<br><br>10/10","user":"stalcup","rank":[555,649]}]