[{"title":"The Devil's Rejects is not always an easy film to watch","rating":7,"date":"2 September 2006","review":"The Devil's Rejects is not always an easy film to watch. It has a genuine savagery that makes recent films such as Hostel or Saw II, non spectacular though they were, appear rather tame.<br><br>I think part of the reason the film is such uncomfortable viewing is through Rob Zombie's creation of a strong sense of ambiguity as to who we are supposed to sympathise with- who are the antagonists and the protagonists? Initially things seem quite clean cut- psychopathic killers= evil, Sheriff on a vigilante mission = good, but then the lines blur. The Sheriff turns nasty, yet we the audience take joy in his sadism- are we as bad as these killers? And at the same time we the audience feel flashes of sympathy for the killers too- through glimpses of their own, warped domestic bliss. This is interesting and<br><br>one that gets under your skin and disturbs.<br><br>I have to mention the humour also- which is also a nice contrast to darkness, though some of the humour is very close to the edge- you DO need those moments of light relief, to prevent the proceedings becoming completely grimy and depressing.<br><br>The only main downside of this film is it does at times feel overly long, almost deliberately drawn out,and that can distract from the intensity of things.<br><br>Personally this film marks a huge improvement for Rob Zombie after the debacle that was House Of 1000 Corpses, a masturbatory fan boy effort which had an okay build up but quickly descended into cartoony drivel. With The Devil's Rejects Rob Zombie seems to have shifted focus from being a kid with a film camera and a budget, and shifted focus on telling a story, and making the audience FEEL something, and he actually does a pretty good job of it too.<br><br>Special mention has to go to Sheri Moon. A real delight to watch. I can't help but smile when I see her on screen- I wouldn't be at all surprised if she finds herself with a huge gay following. A lovely mixture of sassiness, innocence and an edge of something slightly darker. I like her a lot- well at least when she's not making racist playground chants fashionable again.<br><br>I'm actually excited now about Zombie's remake/ reinvention/ prequel of Halloween. Okay so the term \"remake/ reinvention/ prequel\" fills me with an underlying sense of dread, but I'm going to breathe out and try trust Rob Zombie on this one. If nothing else, I know it'll be anything but bland.","user":"boy_in_red","rank":[34,41]},{"title":"Zombie gets it right!","rating":10,"date":"7 August 2005","review":"I went to this movie having seen 1000 Corpses which I thought was a great retro B style horror in the Texas Chainsaw massacre genre. <br><br>This movie FAR exceeded any expectation I had. Zombie NAILED it in this one. Classic Freeze frames, awesome soundtrack(used with purpose)-Just enough gore with out going over the top.. the essential random nudity shots that we B fans have come to expect. Suspenseful through-out.<br><br>I realize that what makes all of these components work:<br><br>A- This movie (Unlike 99% of all B Horros) is not predictable. You do not know what is going to happen next. <br><br>B- Zombie builds characters. You learn history and connections, and see things from their view. <br><br>C- Slight comedic aspect added. <br><br>Summary: MUST SEE, MUST OWN<br><br>in the words of my horror loving awe-struck friend \"This is hands down the best B horror I have ever seen!\"","user":"INCESSANT","rank":[220,335]},{"title":"A depraved, sick and brutal film.","rating":10,"date":"22 July 2005","review":"Alright, I never bothered with \"House of 1,000 Corpses.\" Mainly due to the poor reviews and the fact it looked like a \"Texas Chainsaw Massacre\" rip off. As a matter of fact I wasn't that interested in this movie at first. But the early buzz raised my interest and I went out and saw it.<br><br>\"The Devil's Rejects\" is a sick, ruthless, grab you by the throat and don't let go horror movie. Which is exactly what it sets out to do and it succeeds brilliantly. While the movie is sadistic and violent, the characters are extremely well developed and the movie is extremely well written. I've always felt that Rob Zombie would make a good horror director and while \"Corpses\" wasn't so well received it was only his first film. This is something else altogether.<br><br>A genre masterpiece and the best movie I've seen all year. If Zombie keeps this up he will become a force to be reckoned with in the horror genre","user":"sidewinder572","rank":[315,501]}]