[{"title":"A blast (***1/2)","rating":9,"date":"4 July 2004","review":"Talk about an appropriate title. <br><br>This is a collection of 11 short stories directed by indie stalwart Jim Jarmusch (\"Strangers in Paradise\", \"Ghost Dog: The Way Of The Samurai\") that have been filmed over the last 18 years, all of which involve two or more characters simply sitting at a table, conversing over...yep, coffee and cigarettes. <br><br>In the hands of a lesser director that might be extremely boring, but Jarmusch is a master of subtle understatement and great deadpan humor. This may be one of the funniest movies you've ever seen in which no one cracks a smile. <br><br>Almost all the actors play themselves, which adds a meta-theatrical, slightly surreal touch to it all. <br><br>Among my favorite stories are one in which an overly eager Alfred Molina has a surprise in store for coolly arrogant fellow actor Steve Coogan and a great one in which Cate Blanchett plays both herself and her jealous cousin Shelby. Then there's the one where Tom Waits and Iggy Pop meet in a dive bar to discuss things and have a smoke (to celebrate quitting smoking), Jack and Meg White of the White Stripes experimenting with a Tesla coil, and in the funniest casting, RZA and GZA of the Wu-Tang Clan sharing some downtime with, of all people, Bill Murray. I also like the one with Spike Lee's twin siblings, Joie and Cinque, dealing with an invasive waiter (a hilarious Steve Buscemi). Almost all the stories are excellent, but there are three that are very forgettable and pretty unnecessary, and they're all in a row, which disrupts the flow of the film. If those three had been taken out, \"Coffee and Cigarettes\" would be just about perfect, but it's still really good. And those three are out of the way in the first half, anyway.<br><br>\nFor the first hour the movie feels mainly just like fun. Straight-faced, deadpan, B&amp;W comedy just like \"Strangers In Paradise\". But as it goes on, and strange connections are made between the stories, it seems to have a sudden dreamlike depth to it. <br><br>The final story in particular, in which two old men in a dark room (Bill Rice and Taylor Mead) discuss life while on a coffee break that feels like it'll last forever, has a distinct \"Waiting For Godot\" feel and ends the movie on a perfect note of haunting, existential sadness.<br><br>\nIt was at that point that I realized I hadn't just watched a string of jokey short stories, but a string of jokey short stories that say a lot about human nature and life in general. <br><br>And if that's not enough to interest you, how often do you get to see Tom Waits and Iggy Pop have a conversation? Or RZA, GZA, and Bill Murray?","user":"Ronin47","rank":[90,105]},{"title":"Breezy absurdist comedy","rating":6,"date":"11 February 2005","review":"--Mild spoilers-- <br><br>I haven't seen a single Jarmusch before this and have no knowledge or his style whatsoever, nor have I smoked a cigarette while drinking coffee, but I enjoyed this film immensely.<br><br>It doesn't purport to speak of grandiose themes and epic emotions, nor does it go out of its way to be deliberately offbeat and quirky; the audience has no emotional attachment to the characters and there is no plot in most of the vignettes. So what puts this film above all the pretentiously shot black-and-white art-house crap that is slugged out every year? For one thing, it is really funny. From its expressionistic colors to the dialog that proudly smacks of absurdist humor, this film is like a breeze of cool air, utterly enjoyable from the first reel to the last that does not cloy on to the heart, but is very unforgettable.<br><br>Ultimately, its unobtrusive absurdist humor, which provokes chuckles instead of heartily laughs, serves to prove the Pinter-esquire themes of the futility of communication. We get a sense that the characters are isolated and desperately trying to touch each other through their speech but ultimately failing to do so; and yet, through their manic speech patterns and delirious pauses, what is unsaid speaks more than what is said itself. While this unconventional style of humor is often difficult to pull off as it might fast become monotonous (as evident in a recent stage production of The Caretaker that I saw), Jarmusch's deft direction with his actors (from their gestures to the way they hold their coffee cups) pushes forth the humor and carries it on steadily throughout the entire film.<br><br>It is hard to say much about a film who has nothing much to say. As in my favorite segment, 'No Problem', the one with the two French black guys, their dialog only serves to underscore the meaningless and nothingness of communication. What is scary about it is that it is so accurate, that these type of conversations, however ridiculous and absurd when portrayed on screen, often typifies our daily conversations. It depresses me sometimes that human communication can be easily reduced to all these, and this film makes the point entirely clear.<br><br>So it definitely comes as a relief, that as a conclusion, the relatively more heart-warming vignette with the two old guys (Champagne) was chosen. Not only does it touches lightly on the recurring 'acoustic resonance' theme, it also hints that we may in fact touch each other, through common music or through a common idea. And it just happens that that common song was 'I have Lost Track of the World' by Gustav Mahler, an amazing piece by an amazing composer that I have just recently began to love, a delightful moment which shows that although we are as disconnected at the different vignettes in the movie, it is comforting to know that we are still united in some weird cosmic way, like this forum here. And like the two old guys, after our coffee and cigarette break in which we step into an odd world that is not really unfamiliar, we would have to step back in to the real world again. But it doesn't hurt to have a little nap in between and pretend bad coffee is champagne.","user":"danielhsf","rank":[63,81]},{"title":"No tea and biscuits","rating":8,"date":"10 July 2004","review":"Short films with nonsense dialogue of shifting dignity. Lots of self irony or even self sarcasm. Tom Waits is mocking with Iggy Pop in a way that it's hard to believe they ever can talk to each other again. Bill Murray is pulling the leg of the hip hop movement and the movement finds that funny. Cate Blanchett is on a genial level playing the double part of the filmstar and her jealous cousin.<br><br>Jim Jarmusch can't be beaten. The dialogue seems to be mostly improvised, but the concept is not. Every short chapter here has a meaning and gives us something to think about. The films are in black and white, like coffee and cigarettes and that still is, and will always be, a way of pushing things harder. This is very much comedy and very much serious.","user":"stensson","rank":[82,109]}]