[{"title":"Great Sunday Hangover Film","rating":7,"date":"5 February 2007","review":"Hand on heart I did not want to watch this film. Although I grew up with the TV series and really enjoyed it, when the film was released I have to say that I was not keen, I can not put my finger on why, perhaps it was Stiller, who, Something About Mary apart, has never really done it for me. But what ever the reason, it remained unveiwed.<br><br>That was 2004 - Xmas 2006 and I get DVD vouchers, so In the January sales off I go to see what I can get, I do quite well, but have £3 remaining, I have 2 or 3 to chose from 2 I have already seen, and Starsky &amp; Hutch.....So I bought it.......yet still it was unwatched until yesterday.......hungover and feeling a little lazy I needed something to pass the time that was easy to watch, funny, and not too taxing.....so on it goes.<br><br>How surprised was I then when after only a few minutes I was giggling away. Stiller was actually entertaining and I was enjoying watching him, Mr Wilson was very good and I got the vibe that the characters gelled as the ones in the TV series did. Vaughan was a good baddie, and Snoop was hight entertaining if not as camp Huggy Bear! All in all this is a good solid comedy film, not brilliant don't get me wrong, but worth a watch.","user":"toffeesi","rank":[22,24]},{"title":"Great melding of traditional 1970s flicks and Stiller/Wilson","rating":9,"date":"8 February 2005","review":"David Starsky (Ben Stiller) is a by-the-book cop who thinks nothing about destroying thousands of dollars of property to apprehend a mugger who has stolen only a few dollars. Ken Hutchinson (Owen Wilson) is the complete opposite--it seems the only reason he has become a cop is that it makes a life of crime much easier. Captain Doby (Fred Williamson) can't stand either of them, but hits upon the brilliant idea of pairing them. When they begin investigating a murder that has ties to a prominent millionaire, the best qualities of each just might start influencing the other.<br><br>Although I always wait to read others' reviews and comments until I've seen a film and written my own review (I do not want to be swayed or influenced in any way by other opinions), I can imagine that quite a few people would not like Starsky and Hutch. To really enjoy it, one would have to alter their expectations to what director Todd Phillips has chosen to deliver instead--a clever film that is both an absurdist spoof and a respectful, faithful homage at the same time. Creating that combination is a difficult feat, but Phillips was largely successful.<br><br>The combination means that Starsky and Hutch is not aiming to be over-the-top hilarious, and it's also not aiming to be overly consistent with the characters and tone of the original pilot film and series. Viewers expecting either are likely to be a bit disappointed. However, if you're a fan of gritty 1970s films as well as a fan of Stiller and Wilson's usual material, you should find much to love here.<br><br>Phillips has remarkably captured the look and feel of a typical 1970s film. The costumes, hairstyles, and overall production design are also perfect for a subtle spoof on the 1970s, and given the source material, even the plot has the slightly formulaic, slightly hokey, almost made-for-television feel that is appropriate for this genre. You know they're on the right track when Fred Williamson--star of such blaxploitation masterpieces as Hammer (1972), Black Caesar (1973) and Mean Johnny Barrows (1976)--has a prominent supporting role. The 1970s spoof/homage aspect is far more understated and reverential than you'd normal expect from a Stiller film, but easy to like and understand.<br><br>Other outstanding supporting roles are played by Vince Vaughn, Snoop Dogg, Will Ferrell and Juliette Lewis, all except Dogg slightly out of character, but just as enjoyable and funny as always, as they're all somewhat faithfully filling traditional 1970s roles. Dogg is the most in character, as he has long been deferential to that era, anyway.<br><br>The film hinges, of course, on Stiller and Wilson, and true to form, Stiller is still a somewhat oblivious buffoon with Wilson as a hipper, more streetwise buffoon. Grafting their comedy personae onto the Starsky and Hutch characters was more easily done and natural than anyone might have thought, and provides a highly amusing 100 minutes, even if it's a bit of an acquired taste and not likely to be understood quite as well by future generations.","user":"BrandtSponseller","rank":[65,89]},{"title":"Fun entertaining movie.","rating":7,"date":"10 August 2005","review":"Of all the recent buddy-cop movies, released lately this is one of the better ones.<br><br>Biggest strength of this movie is in the two main characters played by Ben Stiller and Owen Wilson. They are such a great screen duo together and have some great team chemistry on the screen. The movie is filled with many other great comical talented actors such as; Vince Vaughn as the main villain, Snoop Dogg and Will Ferrell and some smaller roles for famous names such as; Chris Penn, Carmen Electra, Amy Smart and Juliette Lewis.<br><br>But the movie is more then just an ordinary buddy-movie, it also is a priceless parody of '70's TV-shows in general. It uses some of the same camera-positions and style of editing at times, especially in the action sequences. But also the way of acting, dialog and costumes perfectly spoof all those silly '70 TV-series. I'm not sure if everybody catch or understood this but I really laughed out loud at some moments.<br><br>The comedy can be put in the category silly, so this movie is clearly not suitable for everyone. The humor is really over-the-top but I for one really enjoyed that. The characters are really silly but the professional comedy actors portray them extremely well and likable.<br><br>A perfectly fun comedy to kill some time with.<br><br>7/10<br><br>http://bobafett1138.blogspot.com/","user":"Boba_Fett1138","rank":[25,33]}]