[{"title":"Cold Manipulation","rating":9,"date":"9 October 2005","review":"Every action has a reaction, and watching \"Capote\", we can't help but wonder how it ever got made. \"Capote\" is entrancing, dark, depressing, and quite satisfying. It benefits from Hoffman's perfect performance. He embodies the physical and psychological make up of a man who was the toast of the nation before and after the publication of its classic novel, \"In Cold Blood\". As a human being, he appeared to be an intelligent, fascinating, and manipulative creature. He could have gotten away with almost anything. Then he found the two criminals behind one of the most heinous crimes of the century and might have gotten to the realization he could also be trapped by their own dark existences.<br><br>It is difficult to ascertain what happened to Capote after he developed a relationship with Smith. He grows attracted to the actions and revelations behind this killer, and we never really know what is exactly going on. There are displays of guilt and detachment at different parts in the film. What we do see is that something really affected the man, and it changed his life for good.<br><br>The film moves slowly but never loses its audience. Along with Hoffman, a remarkable supporting cast keeps us interests going, and enough is presented to make us want to know more. That will probably be the film's only flaw. It fails to deliver everything it promises. It is a big satisfying tease, but after all, we are left with an endless number of questions. Keener is wonderful as Capote's supporting friend, and in his lover's role, Bruce Greenwood intrigues us as well, with the dubious character that never gives enough information to explain his attraction to a total opposite.<br><br>\"Capote\" is a really good film and should be admire for it achieves. For those who want to explore more in depth what lies behind the protagonists of the movie, there are several books that will give you a more detailed background on their nature. The truth, will however, remain, a big mystery.","user":"aharmas","rank":[133,164]},{"title":"Mesmerizing Performance in Complex, Contradictory Film","rating":10,"date":"28 October 2005","review":"Like the non-fiction novel and the Richard Brooks film that was made from it, \"In Cold Blood,\" \"Capote\" focuses on and sympathizes with two killers at the expense of the four murdered members of the Clutter family. Once the viewer gets beyond this sticking point, however, all three works are outstanding, unforgettable experiences. Unlike the book and the original movie, \"Capote\" does explore the contradictory feelings that author Truman Capote wrestles with as he researches and writes \"In Cold Blood.\" His feelings for Perry Smith, the more \"sensitive\" of the two killers, are particularly problematic as Capote becomes emotionally close to Smith and helps the men with legal aide that postpones the executions, while at the same time Capote cannot finish his book until Smith and Hickcock are hanged. Praise for Philip Seymour Hoffman's uncanny performance as Truman Capote cannot be overstated and, come awards time, if he does not collect enough accolades to fill his mantel, indictments for film critics and Academy voters would be in order. Hoffman not only captures the mannerisms and voice of Capote, he inhabits the man's soul and expresses his feelings and emotions without histrionics or the type of caricature that mimics often have made of the notoriously fey writer in the past.<br><br>Fortunately, Hoffman's performance is only the jewel in a gilded crown of fine writing, excellent direction, and solid supporting performances. \"Capote\" will send viewers back to their bookshelves to re-read the book and to their video libraries to re-view the 1967 film. Considering the time that Capote spent with the two convicted murderers, questions arise as to why the Richard Brooks film did not have Truman Capote as a character, but rather presented a bland, nameless investigative writer, who wanders through the proceedings without much purpose. The film is so good and so intriguing that questions such as that, and what happened to the writer that Capote lived with? and did Harper Lee write anything beyond \"To Kill a Mockingbird?\" and did Capote's presence at the execution lead to his alcoholism, his lack of further writing, and eventually his death, and other questions will send viewers to Google as soon as they get home. \"Capote\" is an outstanding film and possibly the first of the year to be assured of a place on the \"10 Best\" lists for 2005.","user":"dglink","rank":[172,218]},{"title":"Mr. Hoffman, you are Truman Capote.","rating":9,"date":"27 September 2005","review":"The easiest role for an actor to play is a historical figure - we have no idea how Julius Caesar really sounded, how he moved his body, punctuated his speech, bit his lip, walked into a room, held his cigarette. The hardest role is the living, or recently deceased, celebrity whom we watched, heard, studied, mimicked and thought we understood. JFK, Martin Luther King, Ray Charles, and, above all, the inventor of self referential celebrity, Truman Capote (with apology to Andy Warhol and, of course, Noel Coward)..<br><br>After exploding to meteoric fame with his novella Breakfast at Tiffany's, Capote became the New York café society's darling, heir to Coward's gay-man-child-bon-vivant. He drank and held court with the best of New York, which just also happened to be the nexus of television in the early 60s. Before long Capote was the quintessential modern celebrity, famous for being famous. And he did it all before our eyes.<br><br>Philip Seymour Hoffman does not so much play Capote as become him. And not just in mannerism, no mean feat, but in personality, because we are convinced that Hoffman feels what Capote felt, cries over the lies, accepts his moral failings. For a short story writer-raconteur from New Orleans, Capote found himself at the center of a nationally enthralling multiple homicide, facing the ultimate journalist's Faustian dilemma: if he perpetrates a lie for the sake of exposing the truth, is he ever worthy of redemption? Capote, in the end, concluded that he wasn't; he never wrote another book. He descended into drunkenness and died a lonely soul. This is not the stuff of Holly Golightly.<br><br>I saw this picture at the Toronto Film Festival with Hoffman, Catherine Keener and director Bennett Miller in attendance. Though they had seen it many many times before, it was obvious even they were moved by it and by our reaction. As we stood and applauded them, we turned to one another, glowing in the realization that we had witnessed an amazing performance.<br><br>We knew Truman Capote. We watched him live on television. Truman Capote was (we imagined) our friend. Mr. Hoffman, you are Truman Capote.","user":"mklein-4","rank":[359,467]}]