[{"title":"Diane Lane is Brighter Than the Tuscan Sun","rating":9,"date":"28 September 2003","review":"\"Under the Tuscan Sun\" is a polarizing film that seems to leave viewers (and critics) either in love with a story of growth and renewal or dismissive of its line.  I'm firmly in the former camp.<br><br>Based so loosely on Frances Mayes's own account of her regeneration in beautiful Italy as to carry an end credit pronouncing that substantial fictionalization replaced key true details, writer and director Audrey Wells crafted a stunning vehicle for Diane Lane whose radiance projects from the screen powerfully. And in every scene.<br><br>Diane Lane, as the changed-from-the-memoir Frances, abandons San Francisco after her never shown cad husband divorces her, getting the house she once loved.  Frances is a writer and literary critic.  Why does she leave S.F.? Two of her closest friends give her a ticket for a gay bus tour of Italy and she jumps off the bus to look into a ramshackle old country house up for sale.  Impetuosity?  Definitely.  Believable?  Yes, actually.<br><br>\nFrances' new house isn't a handyman's special, it's a contractor's assurance of food on the table for a very long time.  Frances adapts to the house and the locals with remarkable aplomb.  Tuscany is sunny but its light fades before Frances's challenged but resilient commitment to not just restore a house but to create a home.  The two aren't the same. I'm not sure how many male directors could so well create that reality.<br><br>Director Wells tells the story from a woman's heart but with a breadth of humor and drama that should appeal to anyone who wants to believe, or needs to hope, that there really is a light at the end of the tunnel of marital infidelity and dissolution.  <br><br>Supporting Diane Lane is Sandra Oh as Patti, her closest friend.  In relatively short scenes, Ms. Oh displays a lively and laconic grasp not only of her friend's life but also of her own which is not, as they say today, devoid of \"issues.\"<br><br>Lindsay Duncan is Katharine, an older woman determined to hold on to her now fading attractiveness through a blend of humor, earthiness - and alcohol. Her character may be predictable but she's also fun.<br><br>Raoul Bova has garnered some press attention as handsome Marcello, the romantically available and affluent Italian.  That's a character we've seen in many, many films and Bova delivers an expectedly satisfactory but hardly deep performance.<br><br>Yes, Diane Lane is beautiful but there is much more to her acting than a shining appearance.  Her facial gestures, mirroring her emotions as they shift from moment to moment, are the product of extraordinary acting ability.  And her character draws a powerful portrayal.<br><br>Credit also must go to cinematographer Geoffrey Simpson.  Perhaps it would be impossible for a blind camera director to turn in anything but a gorgeous visage of rural and urban Italy but Simpson did do a marvelous job of making the locales come alive.<br><br>This is a film for adults, for people who can understand pain and the search for recovery and understand the difficulty of coming back from a space that once offered the mirage of safety and security.<br><br>I loved this film.<br><br>9/10.","user":"lawprof","rank":[146,178]},{"title":"Gorgeous Eye Candy","rating":15,"date":"15 February 2004","review":"I love this movie.  I don't care if it was a \"chic flick\" or what. Whatever, it was so breathtakingly beautiful that anyone should be entranced by it's sheer visual assault on the senses.  When you add great performances by a fine cast, and an interesting story, you can't loose.  Who wouldn't love to escape for an hour or so to the Italian Sun?  Even the ending was realistic. <br><br>This is the second movie I've seen lately that took place in a beautiful countryside Italian Villa.  The other, \"My House in Umbria\" was equally eye catching and enjoyable.  <br><br>But I think I've reached the point of satiation.  If I have to see one more movie where the lead actress has nothing to do but make friends, remodel her gorgeous Tuscan Villa, eat gourmet food on her sunny patio in the garden, have no money worries, and not work, I think I might snap.  I pray daily that Diane Lane and Maggie Smith will one day be slinging hash in a Barstow truckstop and experience the real world.","user":"PrairieCal","rank":[69,92]},{"title":"Diane Lane in Italy. Nothing else matters in this nice but unremarkable movie.","rating":4,"date":"4 February 2004","review":"Well, 'Under The Tuscan Sun' isn't precisely unremarkable -- I am remarking on it right now!!  There aren't many truly new stories in print and cinema, this one has been told many times -- someone finds theirself in a rut of some kind, is reluctant to step out onto an unknown path, but does so anyway to discover a better life. Diane Lane plays Frances, a writer, who early in the movie finds herself single again and free to do anything she wants. She is offered a chance to travel to Tuscany with a group of gay couples and at first she dismisses it. When she finally does take it, her life is transformed. The DVD has a nice Dolby 5.1 sound track, and the cinematography is superb, with beautiful shots of the Italian countryside and the Mediterranian coast.  The 'making of' extra is only mildly interesting, and the three deleted scenes are even less so. There is an interesting 'Easter egg' showing how they digitally altered a man's naked butt, covering it to get the contractually mandated 'PG-13' rating in the USA. Overall a pleasant little movie that tries to seem important but isn't really.  I believe it is '7' movie on the 10-point scale.  I cannot imagine why 22% of the ratings are '10'.<br><br>SPOILERS are contained in the rest of my comments, beware!!<br><br>Apparently happily married, at a function for another author Frances is approached by a man whose book she had negatively reviewed, partly because the male character messed around with young women, he said \"Do you see the irony?\" Puzzled, then he said, 'Ask your husband.' Next thing we see is her and her attorney discussing disposition of joint property. Since he wants the house, her share is bought out, she keeps virtually nothing, goes to Italy, while on the bus sees a property for sale, against her nature gets off the bus, buys the old house, has natural 'buyer's remorse', but gets contractors and fixes it up, reminded me much of 'A Year In Provence'. In fact her strange blond friend is played by the same actress that plays 'Annie' in the 'Year in Provence' movie.<br><br>One contractor worker is a young Polish man, falls for Italian girl, parents don't approve, Frances helps convince them. Meanwhile she runs into a handsome Italian who gives her a ride to the coast, looking for fix-it-up parts, she asks him to make love to her, they apparently hit it off, but her pregnant gay friend shows up, Frances and the lover have a tough time meeting again, when she looks him up he has another girl, goes home, young couple wed in her courtyard, at the end an American (Rory Gilmore's dad) writer shows up, looking for Frances, we imagine they might hit it off. However, that doesn't matter, Frances has started a new life and is happy.","user":"TxMike","rank":[14,16]}]