[{"title":"It's about the dogs.","rating":9,"date":"15 March 2006","review":"The acting in this movie is weak. Now that I got that out of the way, let me tell you why this film is worth watching: the outdoor photography and the dogs. This movie contains some of the most impressive outdoor cinematography that one can hope or expect to see in a Hollywood movie. This movie shows the awesome and forbidding beauty of icebergs, ice flows and glacier-covered mountains. Compared to these magnificent edifices of nature, man is rendered almost utterly insignificant, a mere dot in a wilderness of ice that is almost endless. Indeed, the scenery is spectacular. That's one interesting part of the movie. But the main part of the movie are the dogs - eight of them. This movie offers a wonderful story about eight brave and stalwart creatures that are determined to survive in the polar wilderness. Having been abandoned by their owner, the dogs must fend for themselves, and they do so, by staying together, working as a team, looking out for each other and caring for each other. They set an example for us humans to follow. That's why this is a movie that's not about us, but about those wonderful dogs.","user":"PWNYCNY","rank":[118,136]},{"title":"AMAZING STORY....one of the best of the year","rating":10,"date":"27 February 2006","review":"Just getting back from seeing 8 below, i am completely blown away by  several elements.  Firstly, right away you get glimpes of STUNNING scenery that continue  throughout the whole film. Beautiful artic landscapes frame the main  story line and on the big screen, it really takes your breath away.  The movie also is really able to give anyone an idea of what its like  to be in the artic, and really gave a clear picture of what being an  explorer was like. This added to the appeal of the movie, because its  not something most of us get to experience.   Although the acting has been in some cases been criticized, I believe  the actors fulfilled their purpose within the movie. They were able to  play their roles, without distracting from the dogs, which of course,  is the most important part. Paul Walker clearly comes across as a  strong animal lover, and displays this well. He becomes relatable to  any animal lovers, who will utimatly love this movie. As for the  others, the fulfilled their jobs, which is what matters. The character  of \"Cooper\" gave great comic relief, and \"Katie\" acted out the  predicable love story line well.  But of course, the most important aspect of this movie was the dogs. I  can hardly even begin to describe what a wonderful job they did. The  tricks preformed (as a dog lover and trainer) were some with great  difficulty. Ultimately, the way the dogs interact with each other and  are so compassionate, you really connect with them. The only way to  really experience this is to GO. the movie is AMAZING and a wonderful  family film. Although a part or two may be slightly scary, its still an  amazing picture for ALL to enjoy, it completely blew all of us a way.","user":"moonlightprincess-1","rank":[156,186]},{"title":"Surprisingly good","rating":8,"date":"18 February 2006","review":"I went begrudgingly to see this film with my daughter. It was not on my list of films to see but she insisted. Knowing that it was a Disney product only made me dread it more. The schlock they try to pass off as good films these days is ridiculous. The only up-side I could see was the director, Frank Marshall. He has produced some of my favorite films. Let's see what he can do behind the camera.<br><br>Pleasantly surprised I think is a good term for my reaction. Although the film was about 20 minutes too long, it did sustain the action and drama all the way through. I knew the basics of the story: a team at a base in Antartica must evacuate and cannot take the sled dogs with them. Winter sets in and the dogs are forced to survive on their own in the brutal cold for months.<br><br>The dogs are very entertaining and their scenes with the science team are warm and amusing, even thrilling. Where I expected the film to fail was after the humans and dogs separate. Amazingly though, this is where the Mr. Marshall seemed to kick it into gear. Watching the opposing scenes unfold of the guilt-ridden Paul Walker frantically trying to find anyone to help him get back down to the Antartic, interlaced with the Huskies who are struggling through the rough winter, scrounging for food and defending each other from predators, was very emotional.<br><br>While the film is a grade A survival pic, I hadn't expected it to be such a tear-jerker. Be forewarned. Although the human performances (Paul Walker, Bruce Greenwood and the necessary romantic lead, Moon Bloodgood) were mediocre at best, the canine actors really do steal your heart.<br><br>No Oscar material here, but as far as family films go these days, this one is above par. Grade: B","user":"Chuck-156","rank":[134,164]}]