[{"title":"Pretty damn good but falls like a house of cards at the end.","rating":7,"date":"18 February 2006","review":"This movie is really pretty damn good right up until the last 10 minutes where we really spin out into ridiculous attempts to tie up every single plot string in under 10 minutes. The pace at which all the story lines come to an end is jarring to say the least and very unrealistic, improbable and - a gyp.<br><br>But I would recommend this movie because right up until that point it's a fun ride with great chemistry and casting of all the players. Dillon is a bank employee hoping for a raise on his upcoming review and looking forward to marrying his live-in girlfriend. This feels like an indie film but it's a bit too clever clever for it's own good. <br><br>Steve Zahn has some really awesome moments in this movie when he is ripping on everyone within talking distance of his character. His delivery was perfect. You will notice one of the actors from Kids in The Hall fame- his part matches what he is good at, that was an excellent casting choice as well.<br><br>So even though the script fumbles at the end, all the other parts of the movie work well.","user":"dilbertsuperman","rank":[22,27]},{"title":"Entertaining throughout!","rating":10,"date":"8 July 2004","review":"I wasn't expecting too much with this one, but was pleasantly surprised and thoroughly enjoyed it. Great to see a movie go in a direction that is not expected, and if anyone tells you this movie is predictable, they are more than likely lying. Matt Dillon has turned into a solid actor these days, without being the marquee attraction of some lesser actors.<br><br>Applegate and Zahn also add some weight to the movie, and a must see confrontation with the boss is a highlight (who wouldn't want to do that). Highly recommended, if not at the cinema it will make a great Sunday night in on DVD!","user":"themagicrat-1","rank":[70,96]},{"title":"Too many twists remove the shock element.","rating":6,"date":"15 July 2006","review":"The film has its moments. It's got a rather nice plot. It's first-person commentary is interesting. Matt Dillon and Christina Applegate have both done quite well. The sequence before the bank robbery was very stylish and funny. It's sound editing is perhaps below average but the music is okay.<br><br>It's got endless plot twists in the end. After the first major twist I said to myself \"Well, that's clever...\" and after the second I was like \"Wow! never saw this coming\" and the twists continued on to a point where I got rather irritated. Plot twists are supposed to offer surprise elements in a story to see it from an entirely different point of view. But in this film, surprise is stripped off.","user":"shanfloyd","rank":[22,29]}]