[{"title":"Mischief managed!","rating":9,"date":"5 June 2018","review":"The third film about the young wizard is the most controversial, for it was he who split the fans of the novels about Potter into two warring parties: conservatives and innovators.<br><br>The first group of fans absolutely condemned and condemned the actions of the director Cuaron, altered \"Harry Potter\" in his own way. Say, they did not like the strange werewolf, all sorts of jokes-jokes, interspersed by the director in addition to the script, and in addition to all the claims they discovered the disappearance of the atmosphere of magic, because of which the popular expression of \"Quaron in the furnace\" was born.<br><br>The second group, on the contrary, furiously began to praise Cuaron, extolling him to the unprecedented pedestal of fame, thus creating almost a cult of personality. They liked everything that only they could like in the third film.<br><br>Only now it became clear that both sides are not right in their convictions. So it should be, movies must be different in essence. The error crept in from the very beginning: Chris Columbus took the first two films, and this put the old debate on what kind of movies Harry Potter should be about. Columbus did not have to give the right to shoot two films, and one would suffice. Spectators are used to the atmosphere of the first two films, because most of the audience took the innovative approach of Quaron to the screen version of the third novel with bayonets. Now the producers make a mistake again - they give the right to shoot two films (The Order of the Phoenix and The Half-Blood Prince) to the new director David Yates. This should not be done in any case. It is necessary to preserve the diversity of director's visions. Hogwarts is not accidentally depicted in different ways in films, like Hogsmeade. Everything in novels is seen differently every time, because all the reader and viewer sees through the eyes of Harry Potter, and in films through the prism of the director's vision, the viewer must perceive the magical world through the eyes of a young wizard.\nAlfonso Cuaron still hit the spot with his timely vision of the plot of \"The Prisoner of Azkaban.\"<br><br>He created a sparkling tragicomedy for the growing up of a young wizard.<br><br>In general, Cuaron's film reminds me of our old Soviet films. For the reason that the whole film can be easily taken away on the shots, quotes, fragments, heroes, soundtracks, etc., etc.\nDespite everything, this film is much kinder than the previous two, differing in their gloomy Gothic style. It's more fun, crazy, and it should be, because it's Sirius Black himself on the scene!<br><br>For the whole of Rowling's novel, like the film of Quaron, is a tribute to the memory of the crazy, hooliganistic and such lonely Sirius Black ... Black, whose heart is beating violently, hot blood flows in his veins, and in the soul is truly dog devotion.\nThe third film, as well as the film, is dedicated to the looters - James Potter (= Harry Potter), Peter Pettigrew, Rimus Lupine and Sirius Black - a group of friends who used to be friends a long time ago ...<br><br>The film ruthlessly shows how easy it is to lose friendship and how difficult it is to acquire a friend ...<br><br>Thanks to Alfonso Cuaron, who did a talented work, showing in one stroke all the huge gallery of the characters of the magical world and their essence: the Minister of Magic plunges into a puddle; the soothsayer with big glasses on her nose stumbles on her own table; The evil teacher Severus Snape closes the children from the werewolf; eccentric Dumbledore slams his hand over Ron's gnarled leg; Remus Lupine, at the lesson, takes a snack with an apple; portraits of Hogwarts, it turns out, also like to sleep; Stan Shanpike with his brave words is not very strong in dragging student suitcases; Hagrid and ties are incompatible things; Tom from the Leaky Cauldron has a nehyl auto; Ernie, wearing spectacles with large lenses, is led by the \"Night Knight\"; Sirius Black finally began to talk moral nonsense ...\nAlso it is necessary to thank the new actors, so successfully merged into the old line-up:<br><br>Emma Thompson (Sibyl Trelawney); Michael Gambon (Albus Dumbledore); David Thulis (Remus Lupine); Julie Christie (Madame Rosmerta); Gary Oldman (Sirius Black); Timothy Spall (Peter Pettigrew) and many others. By the way, if my memory does not change me, then the two actors from the third film (cleaning woman in the bar \"Leaky Cauldron\" and Aunt Marge) Quaron quietly consigned to his other project - \"Child of Man\", but that's another story ...<br><br>Let me love the fourth film about Harry Potter (director - Mike Newell), but I always revise the Curaron part - it is the brightest of all existing.<br><br>In a word, long live Rowling and Cuaron!<br><br>\"Potter, come back!\" (Severus Snape, potions teacher).","user":"BiiivAL","rank":[86,96]},{"title":"Abstract and dark themes abound; still the most mature HP entry","rating":10,"date":"19 January 2011","review":"Alfonso Cuarón's masterful adaptation does the source material immeasurable justice by exploring its underlying concepts in an intelligent manner. Of course, it certainly helps that the aesthetics of the film are incredible, the acting remains stellar (and the trio of young actors handle their roles admirably), and John Williams offers an amazing (and eclectic) score. Character development is superb - Steve Kloves penned a great script.<br><br>First-time and young viewers will likely enjoy the film for its merits based on plot and 'adventure' alone, but it takes multiple viewings and a critical eye to enjoy the abstract ideas and nuances. Cuarón himself credited the source material as being laden with real-world issues: oppression, racism, loneliness, power, friendship, justice and so forth.<br><br>This is the Harry Potter film that stands on its own and as a tremendous cinematic achievement. It challenges viewers and yet doesn't patronize them or attempt to offer answers to all of the questions presented. For instance, the ending is bittersweet at best and retains a healthy amount of ambiguity.<br><br>If you've never read the books or understood the acclaim of the series as a whole, watch Cuarón's 'Prisoner of Azkaban' and you'll understand why this entry is clearly the zenith of the seven.","user":"jpoulter11","rank":[74,84]},{"title":"Finally, a movie that captures the books' magic","rating":8,"date":"25 June 2004","review":"If there's anything this movie proves, it is the difficulty in separating the series from the demands of fans. This is clear just from hearing some of the comments. \"Why didn't they identify the names on the Marauder's Map?\" \"Why wasn't the second Quidditch game shown?\" \"Why wasn't there more of Crookshanks the Cat?\" By focusing on what the film didn't have, fans fail to look at the film on its own terms. I think this is by far the best Harry Potter movie yet.<br><br>The only way to satisfy fans would be to include everything from the book, which would require a miniseries. Since that isn't what these films are, the story has to be abridged. The first two films tried to fit everything they could within a reasonable slot of time. The result was a set of films that felt cluttered yet incomplete. Had they continued with this strategy for this movie, based on a much longer book, it would surely have been over three hours long.<br><br>The virtue of the latest film is that it makes a real attempt to adapt the story, not just marching in lockstep with the book's events. The screenplay is sparing, leaving out or simplifying loads of details not directly relevant to the plot. But it captures much of the book's delight and humor. The first two films fell short in this regard, because they lacked the guts to tinker with the details, even though that was the key to condensing the story while staying true to its spirit.<br><br>The movie is still faithful to the book, of course. Many of the scenes are exactly as I had imagined them. When it deviates, it does so based on an understanding of the story and characters. This is evident in the way they show, for example, the Knight Bus; Hermione's overstuffed schedule; and the introduction of the Marauder's Map, a scene that captures the twins' mischievous personalities. The changes are clever and funny, and they help compensate for the movie's loss in other areas.<br><br>Certainly this has something to do with the new director. Columbus's approach was to stick to the books as literally as possible, often draining them of their subtlety. For instance, where the books only hint that Dumbledore can see through the invisibility cloak, the earlier movies make it unmistakable. The new director never condescends to the audience in that way. This is a children's movie, but it is also a fantasy-thriller that we can take seriously, because not everything is spelled out for us. We're given a chance to think.<br><br>But part of what makes the movie work is the book itself. The story is gripping from start to finish, because the threat looming over the school is established early on. Harry's personal life is sharply intertwined with the plot. We feel for him as we watch his disastrous (but hilarious) attempts to escape his uncle and aunt, and his humiliating reaction to the dementors. The story avoids common devices such as the talking killer or deus ex machina, which the other books have in abundance. The ending is nicely bittersweet and ambiguous. The plot is so complicated, however, that the book spends several chapters explaining it all. The movie wisely includes only very little of this, allowing the plot twists to become understood as the story progresses. I was surprised to see certain events that were in the movie but not the book lend support to an important theory some fans have had about what is to be revealed at the end of the series. Of course, it is well-hidden and won't give anything away for those who aren't looking for the clues.<br><br>I was so satisfied with the film that it almost seems trivial to mention the flaws, but there are some. The portrayal of Fudge's assistant as the standard hunchbacked dimwit is out of place here, as it would be in anything other than a cartoon or spoof. The most serious misstep, though, is the casting of Michael Gambon as Dumbledore. Gambon's face seems frozen in a perpetual nonexpression, and his voice lacks resonance. He compares poorly to the late Richard Harris, whose line readings had gravity, and who played the character with a twinkle in his eyes. It is a pure mystery to me why this actor was chosen as a replacement, especially considering the fine performances from other members of the cast. Even the children are in top form here.<br><br>Those complaints aside, this is the movie I was hoping they would make when the series began. If it doesn't live up to the book, so what? What's important is that it lives up to its potential as a movie. Fans who want a carbon-copy of the book are looking in the wrong place, because they're never going to get it here. This is probably the best example of a Harry Potter movie that we're ever likely to see.","user":"kylopod","rank":[192,230]}]