[{"title":"Not bad at all","rating":12,"date":"12 December 2004","review":"I just finished watching this film and decided that I should say something about it. Firstly, Wow! Kristen Stewart. There is an actress with a great future. An impressive performance. The support cast, which it must be remembered, play a fairly incidental role in this film, were adequate at allowing her to shine through. The Directing was solid. I didn't get lost, it wasn't all over the place. <br><br>Plotwise, I was quietly moved. I had seen this film on cable a couple of times before and just flicked passed it thinking it was just more \"made for TV\" crapola, but tonight I tuned in at the beginning and failed to channel surf away. I stuck with it till the end, and if anything, was sorry that it was over. It managed to suck me right into the story, I wanted to see where I was being taken. <br><br>It's not a bold film, even though it discusses a challenging topic. I was worried the Teen Angst Engine may kick in, and was glad to see it nowhere in sight. It was a film that left me thoughtful, and wanting to tell someone to give it a chance.... so... give it a chance, I thought it was worth it.","user":"DaveMcDave","rank":[103,115]},{"title":"A Beautiful Piece of Work","rating":10,"date":"11 February 2004","review":"I saw this movie at Sundance and was very surprised that it went home with no awards.  Though I'm not familiar with the book, I can say that Jessica Scharzer does a masterful job of telling a delicate story in a very real and touching way.  It is never easy to handle a story about a traumatizing event, but to do it with such sensitivity, in the midst of a HILARIOUS movie, is pure genius.  A great deal of the credit must go to Kristen Stewart for her  portrayal of a girl whose emotions are always known to the audience, though she hardly ever says a word.  Anyone who has been to high school should get a big kick from some of the send-ups in \"Speak.\"  And for anyone who has doubted the talents of Steve Zahn, just look for the scene where he sees what Melinda (Stewart) has done in the supply closet.<br><br>I hope to see this movie in theaters soon, and I give it my highest recommendation.  And no, I don't know anyone who was involved with it.  I just wanted to give credit where credit is due.  Go see this movie!","user":"KM_391","rank":[89,101]},{"title":"Kristen Stewart Should Have a Lot of Fans After This Performance","rating":9,"date":"6 September 2005","review":"In my review a year ago of \"Catch That Kid\", I referred to Kristen Stewart as a young Portman/Knightley. Most people thought I was going a bit overboard but with her performance in \"Speak\" I feel even more confident of my assessment. Although \"Speak\" was shot within a few months of \"Catch That Kid\" Stewart looks considerably older, with the Portman/Knightley connection even more obvious. Her understated performance as Melinda Sordino is absolutely riveting. Stewart's performance is critical to this film because she is not just the central character but also the narrator, the entire story is told from her point of view.<br><br>Cinematographer Andrij Parekh gets maximum effect from the camera as the film is filled with tight shots of Stewart's face and eyes. Director Jesseca Sharzer gets an incredible non-verbal performance from Stewart which is nicely offset by the voice-over narration. Like the narration in \"The Opposite of Sex\" and \"Girl\" this helps relieve the intensity and introduces some wry humor into the story. I particularly liked Stewart's offhand voice-over on her way to the principal's office: \"I forgot that the suffragettes were hauled off to jail, duh\".<br><br>Melinda's flat and distanced narration is often contradicted by the crushing emotional trauma she is experiencing on the screen, this dichotomy is a very effective way to illustrate her inner strength and multi-dimensionality.<br><br>Parekh complements his close work with interesting short focal transitions and some good exterior shots. One especially nice one is when Stewart is walking in the distance and the focus slowly changes to highlight a bee and a flower in the foreground.<br><br>Like \"Welcome to the Dollhouse\", the adult roles are a bit extreme but the student roles are very convincing. <br><br>Interestingly, the climatic scene actually occurs about 15 minutes before the ending. Melinda's rejuvenation happens during her impromptu hospital visit, her voice-over reflects this change: \"It happened. There's no avoiding it. No forgetting.\" Strong again she dumps Heather, plays a killer set of tennis, and bicycles to the scene of last summer's party where she confronts what happened to her and decides to tell Rachel. The tree that inspired her painting helps tie everything together.<br><br>Virtually everyone should find this film engrossing, but it will especially appeal to those who like to see their heroines get stronger as a story progresses.<br><br>Then again, what do I know? I'm only a child.<br><br>NOTES ON THE ADAPTATION: A personal visualization process occurs when reading a book that often makes its movie adaptation less powerful and less enjoyable. But it also affords the opportunity to focus on understanding why the screenwriter, director, and editor choose to use, alter, or omit each element in the book. Adaptations are all about economy and efficiency as they try to tell the same essential story visually and often symbolically.<br><br>In the case of \"Speak\", I think the movie is more powerful than the book as you feel Melinda's trauma more, even if you don't understand it as precisely. The visuals of Melinda's emotional battles are more powerful than any narrative; as are the visuals of her drawings and of the process of her growing stronger as the story progresses.<br><br>The adaptation shows Melinda's parents more positively but still portrays them as disinterested. The key scene is Christmas morning. Watch how after receiving the art supplies Melinda is pleasantly stunned that her parents were actually aware that she was drawing, then quickly disappointed when they disconnect and start their own conversation about the stereo system, which brings on the flashback of them not being there when she returned home from the party.<br><br>They wonderfully condense the process of Mr. Freeman connecting with Melinda, the key scene is when he and Ivy are discussing her art project with the turkey bones and the palm tree. Melinda is seated as they come into the frame from both sides. The camera is static as they discuss the project until just before Mr. Freeman says the word \"pain\". At that point they cut to a tight reaction shot of Melinda's face as the word registers and her eyes look up at him in surprise. With that short sequence they manage to communicate about 50 pages of narrative and to say all that is needed about the special relationship that Melinda and Mr. Freeman will develop. The viewer is shown not just that he is picking up her pain from the symbolism in her art work, but more importantly that she now realizes there is someone who is tuned in and interested in her welfare. This little sequence is truly inspired and a great illustration of the visual power of film.","user":"aimless-46","rank":[70,81]}]