[{"title":"Not Everybody Will Like This Film; Though, I Highly Recommend Watching It.","rating":8,"date":"17 May 2017","review":"This is a special movie, not just because it's a brilliant and original horror movie, but because of the story behind the making of the film.<br><br>The writer and director Andrew Getty started this film back in 2002 when it was titled \"The Storyteller\" and was released in 2017 under the current title, two years after Getty's death due to an ulcer causing internal bleeding. This is a shame as he spent so much money on the project and wasn't around to see his creation brought to life... or take credit for it.<br><br>The story is about a mentally handicapped man, Dennis (expertly portrayed by Frederick Koehler), living in his brother's, John (Sean Patrick Flannery), care. Dennis is plagued by twisted and dark nightmares for which a tall grey man claims responsibility. Then one day John and his girlfriend, Lydia (Dina Meyer) bring home a mirror for Dennis' bedroom. Dennis hates the mirror as he doesn't want to loose his hamsters like he's lost his comic collection. However, his decision changes when his reflection starts talking to him and offers him a way to get better... to get smarter...<br><br>It was the trailer that had me salivating at the thought of watching the film. However, be aware the movie isn't how it looks on the trailer. Instead of an exciting run-of-the-mill horror what Getty gives his audience is a deep and powerful insight into the human psyche and not just through Dennis, but all of the other characters have some kind of dysfunction. John is hiding a secret. Lydia has relationship issues. Even Pete (Tim Bagley) - who is only in the film a few minutes - hates people touching him and invading his person space.<br><br>The film can even be taken a couple of ways. It could be a very dark psychological thriller or it could be a supernatural entity possession, making it a horror. It works in either genre.<br><br>The star of the show is Frederick Koehler as Dennis. He is brilliant at portraying the character, giving him facial ticks, body form, hand gestures, and a speech impediment. His acting is really believable and draws the audience into the film more. However, it's Flannery's and Meyer's characters that appear flat at times, a little too dimensional and wooden; I think this may be the characters they were playing or the direction at the time of the scenes, as both of them are good actors. It just jars the mood and atmosphere at times and this is a bad thing as the movie depends on mood and atmosphere, which Getty builds beautifully. It's also great to see Michael Berryman again.<br><br>This film reminds me of Phantasm in its essence and spirit, and like Phantasm I will gladly watch this film again... and again... and, probably, again... There are a lot of interesting and well thought out concepts in this story, which should send a chill down your spine. However, if you prefer shock horror over creepy and atmospheric then this probably won't be your cup of tea.","user":"stephenabell","rank":[46,53]},{"title":"Cinematic Genius","rating":10,"date":"6 December 2018","review":"The story, script, and everything are phenomenal!!! Everything from the angles of the shots, to how the characters interacted with each other (themselves), to the types of shot, were done beautifully! This movie is a hidden gem. If people aren't able to see that this is a masterpiece for future generations, they shouldn't be making reviews.<br><br>The movie is (in my opinion) light horror and a mind freak. If you don't like the first few minutes, you won't like the movie. If you don't like the movie, you probably shouldn't be making reviews. After I watched the movie I found out that the director and writer are the same person...I also found out that he is dead! The world lost the next great writer/director/producer all at once.<br><br>-cheers,\nsocial3ngin33ring","user":"social3ngin33ring","rank":[10,10]},{"title":"Bizarre, yet amusingly twisted.....","rating":7,"date":"22 March 2017","review":"This film was quite unexpected; it appears to have been filmed over a decade ago (Matthew McGrory has a \"Tiny\" cameo, but the actor died in 2005); Dina Meyer looks like she was fresh out of Starship Troopers, and the televisions appear to be old Sony Trinitron Wega tube TV's.<br><br>In the film we have what appears to be a mentally challenged man in his 30s who lives with the older brother who caused his impediment by punching him when he was six, thus sending him reeling down the stairs, resulting in brain damage.<br><br>Big brother feels an obligation to care for his little brother, who is a tad difficult to take care of.<br><br>Little brother (who was a prodigy genius child until his brain was damaged) starts seeing his reflection in the mirror start to talk to him, and tell him to do bad things - this, he is assured, will make him smart.<br><br>He is told that he must kill his neighbor's cat, and that this is perfectly OK as people eat meat, which is supposed to be a \"clue\" that it is OK to kill all animals, and that the rule against killing pets is \"a fake rule\", and is told to learn taxidermy.<br><br>One amazing line from the evil mirror twin - \"Grab another doggie from the cooler.\" He soon is told by his evil reflection that he must now kill a child - he reluctantly does so, and eventually graduates to killing adults.<br><br>The ending is quite zany, and it's important to also note that the late director (who was a wealthy heir to the Getty oil fortune) was a meth addict who died in 2015, so it's plausible that some of the film was shot while he was under the influence.<br><br>This film is worth watching, if only for the sheer mind-twisting absurdity - there really is nothing quite like it out there.","user":"jpowell180","rank":[31,37]}]