[{"title":"So?","rating":3,"date":"9 November 2003","review":"The real story of the Jessica Lynch affair is how the Pentagon lied to the country trying to depict miss Lynch as a hero, fighting off the enemy, when in actual fact all she suffered was getting injured and caught by the enemy. It was strange that CBS chose today to air (60 mins) the real story of what happened on that day and by the looks of it Jessica did not do much , contrary to the usual lying spin we get from our leaders today. The film, although technically well done is about nothing, with no conflict no interest and a who f*%&amp;+#@ cares outcome. It is about nothing and the only reason why this story surfaced is because of the lie perpetrated by those who would blind us about the horrible immoral and unworthy war we are sending our children to.","user":"sulari","rank":[23,33]},{"title":"Who were/are the good guys and the bad guys?","rating":10,"date":"10 November 2003","review":"I came away from this film the same way as I do when I watch a Second World War film or documentary in which the Germans are fighting the Russians. The Germans were invaders and were ruthless yet the Russians were equally as bad and they were just defending their homeland against an aggressive invader so just let them all fight and kill each other (which they pretty much did). In viewing this I could not find myself cheering for the U.S. Troops or feeling sorry for them when they came under attack from the Iraqis. It makes no difference if the U.S. said that what they were doing was right and just and were there as liberators (The Germans said the same thing) . The U.S. waged an aggressive unprovoked war under what could very well be false pretenses. All that aside and considering that this incident just happened a few months ago the film for a made for TV venture was quite well done. Much of what really happened and took place may not be known for some time and when the full story finally does come out as they all eventually do when it comes to war stories it may make this picture seem hypocritical, foolish and phony.","user":"yenlo","rank":[9,15]},{"title":"Not bad...could have been better","rating":8,"date":"10 November 2003","review":"Overall, the made for TV movie was well acted.  It was good to see that the focus really was not on Jessica Lynch, but rather on Mohammed Al-Raheif. If you've read his book (which this movie is based on), you will see how he risked everything just to save this woman.  He really was the hero and it's too bad that SO MUCH attention was put on Lynch.<br><br>Good things about the movie:  well-acted, focused on the Iraqi, felt like you were in Iraq, visual and sound effects acceptable<br><br>Bad things about the movie: a little slow paced, some of the scenes don't seem to match the Al-Raheif's book, visual and sound effects could have been better.","user":"jdcbomb","rank":[8,13]}]