[{"title":"Pleasantly surprised","rating":7,"date":"4 July 2004","review":"Perhaps it's because when one sees, \"MTV Films\", in the opening credits, one's expectations then hit rock bottom. It's as if MTV lulled me into a false sense of security, knowing the usual \"depth\" of their projects. However, I was pleasantly surprised by this little film. It doesn't hurt that I could watch Scarlett Johansson sitting on a couch doing nothing and I'd be enthralled for hours. At any rate, I found the film, though cliched, quite cute. Roy, the obvious comic relief, played his role very effectively, I laughed at him often. The other characters were of lesser involvement, but several stereotypical demographics were adequately represented: the brain, the jock, the average joe, the stoner, the angry rich girl, and the decent good guy. It truly was as if MTV was trying to create \"The Breakfast Club\", twenty years later, for a new generation. If they succeeded in that is debatable, but at least the made a decent, funny flick.","user":"HulkVader","rank":[28,33]},{"title":"A PG-13 Teen Movie...that works","rating":9,"date":"30 January 2004","review":"Those expecting cinematic events like the Godfather or Saving Private Ryan.<br><br>Stop reading this.<br><br>Those expecting crude teen humor films featuring underage drinking and nudity, such as Road Trip and Varsity Blues.<br><br>Stop reading this.<br><br>But those of you looking for a teen movie full of the typical adolescent hinjinx and cheap laughs.<br><br>Start reading this.<br><br>The Perfect Score won't light up the box office or have everyone waiting day after day for its release onto DVD.<br><br>Instead, it's a movie targeted towards middle schoolers, high schoolers, and most college students.<br><br>Typically good kids under rough circumstances, most of us who have taken the SATs remember the pain in the arse they were. Throw in two very attractive, and talented acting-capable, girls...two guys and a jock...and an Asian pothead quick with one liners...<br><br>and you got a pretty solid movie. <br><br>While the Perfect Score won't give you everything you want, I feel that it will make you just happy enough that you caught the showing.<br><br>So if you're looking for a movie to sit back and relax too...and perhaps vicariously wonder if you could steal the answers to the SAT...check out the movie.<br><br>I enjoyed it, and chances are if you kept on reading this post.<br><br>You will too.","user":"nikecjc","rank":[39,54]},{"title":"Better than expected","rating":6,"date":"28 July 2004","review":"The Perfect Score is one of those movies you would expect to be incredibly stupid.  The premise is absurd: kids try to steal the answers to the SAT. However, I found myself enjoying this movie.  The characters are likable and have good reason to cross the line to cheat on the SAT.  I especially enjoy Erika Christenson (who I didn't recognize from her work in Traffic and Swimfam) as the girl who needs a high SAT score to get into Brown University.  This movie shows the pressure that high school students have on standardized testing in general.  Their grades may be good, but without a good score on this one test makes the difference in what college they can get into.  I was not a fan of standardized tests in high school and I do not like them now.  I think that dislike of these tests adds to the appeal the movie.  I give this movie a 6/10.  It is worth 90 minutes of your time.","user":"jpintar","rank":[16,20]}]