[{"title":"Deeply Flawed  The message seems to be: \"Give up; accept second best\"","rating":4,"date":"21 January 2005","review":"I have resisted watching this film for a long time; I remember cringing when watching Steve Martin in the remake of 'Father of the Bride' and did not wish to see an actor, I enjoy, suffering so again. Well this also was not a patch on the original, but that said there was nothing wrong with Steve Martin's performance; he does well with the material as indeed do all the performers. In fact this is well directed, and a fine film technically: it is just that the script is unbelievably awful (warning there may be slight spoilers):- <br><br>This is a film about family values, yet it has been written by people who clearly don't understand family values. There is no family spirit; no feeling that, with the exception of the parents, any of the family members cares about anyone but themselves. Of course children can be selfish; of course families have off-days; but at the end of it all they pull together, that's what it means to be part of a family. This family didn't pull together; it was self destructive to an absurd degree. I come from a big family I have a big family and one thing I know, as does anyone who is or has been part of a big family, is that big families need discipline. When you have more children than you have hands, you have to know that your children will do what they are told when it matters: this is fundamental it is simple survival. The major calamities, the scenes of complete mayhem, these at least rang true, but where was the aftermath: the parents seemed to accept it as there lot to be the butt of their children's nasty pranks. I don't mean to be overtly moral, but for this film to have worked it needed to have a moral backbone, there needed to be a demonstrable upside to helping each other and a realisation that when hurt was done, that this was bad: unfortunately this was missing even to the point that we, the audience, were meant to think it funny that one of the children was nicknamed Fed Ex to signify that he did not fit in. The first time it was sort of funny, but when it kept happening and was not challenged it became unpleasant. At least here there was a consequence, but there was no acceptance of guilt on the part of the main perpetrator and there was no evident remorse.<br><br>If you watch this film, I am sure there are odd moments of high comedy that will appeal, but, unfortunately, that is probably all. There is no pathos, no feel-good emotional payoff. The ending is deeply disappointing. The parents give up. All they needed was for the children to help for two weeks, but that was too much for this loveless family, so the parents give up their dreams, and accept the easy course. What sort of lesson is this? If threatened with difficulty, if the right thing to do is too hard  Give up! This film does not have a nice message. I find it deeply worrying that there are so many favourable reviews. On reading some of these I am relieved to find that their authors, clearly, took other things from this film; who knows, they may be right, perhaps I have misinterpreted the content. There are others, however, who seem to have read the same message as I, but see no wrong in it: this I find disturbing!","user":"jfwhelan","rank":[47,60]},{"title":"Children Of The Damned","rating":1,"date":"8 November 2005","review":"When Ashton Kutcher is the funniest thing in your movie, it's time to re-assess everything you hold dear.<br><br>An unworthy, implausible remake of the 1950 film, Steve Martin and Bonnie Hunt unconvincingly helm a hornet's nest of selfish, ill-mannered, impertinent teen and sub-teen models in an ostensible \"family comedy\" which illustrates quite conclusively why some animals eat their young.<br><br>Focus groups are quick to finger \"obvious\" causes for juvenile derailment (video games, violent cartoons, Ozzy Osbourne), yet subversive media of this ilk - insidiously promoting the now-staple Hollywood formula of incompetent-dad-tenaciously-grounded-mom, sending messages of ignorance triumphing over experience, emotions triumphing over pragmatism - is the real black-milk teat behind every school shooting and heavy metal suicide.<br><br>The MPAA trip over their bibles to quash one-second visuals of female nipples, then permit ninety minutes of mental and physical terrorizing of a father by his children (through communal pouting and \"precious\" antics), forcing him to relinquish the dream job he needed in order to keep these selfsame devil-children wallowing in the opulence they have been spoiled into believing is their inalienable right  all for the petty sake of lost frogs and puppy love and hovel living.<br><br>When a child goes bad, truly, it is the parents' fault - for allowing movies like these to logjam our cinemas under the guise of \"inoffensive, family-oriented entertainment\"!<br><br>(Movie Maniacs, visit: www.poffysmoviemania.com)","user":"dunmore_ego","rank":[39,50]},{"title":"Not as good as the original, but still very good","rating":9,"date":"22 January 2005","review":"Tom (Steve Martin) and Kate Baker (Bonnie Hunt) have a Baker's dozen--children, that is. When Tom, a football coach, gets a job offer to coach a college football team just outside of Chicago, and Kate's book about raising 12 children finally gets a publishing offer, they see bright things for their future. The only problem is that their 12 children do not want to move from their rural Illinois home, and things become nearly disastrous when Kate has to leave for a couple weeks to promote her book.<br><br>While I didn't enjoy Cheaper By The Dozen as much as the original version of the film from 1950, the 2003 \"re-imagining\" is still a 9 out of 10 for me (the original was a 10 out of 10 for me). It's a re-imagining rather than a remake because although the overall plot arc has some similarities, these are two very different films, with very different messages, and very different kinds of families. Both are rather cartoonish, which works for me--I don't require much realism in my films. For anyone who is looking for something primarily believable, Cheaper By The Dozen may not fit the bill.<br><br>The major change from the original to the new film is a change from control to near-chaos. In the Baker's case, it doesn't take long to realize that the chaos arises from their lack of disciplining their children. While this may not be realistic (surely anyone planning to have a family this large would realize that discipline and control would be necessary to not have one's home destroyed), it does lead to a lot of comic situations, and that's really the point here. Yes, there is a message in the end about putting family first, but what director Shawn Levy really wants you to do is laugh. My wife and I laughed quite a bit while watching the film, so Levy accomplished his goal with us. My only slight complaint on this end was that some of the funniest material involved the eldest Baker daughter's boyfriend, Hank (Ashton Kutcher), and he just wasn't in the film enough. The material about the Shenk's, neighbors of the Baker's, was also funny and a bit underused. This was the reason for lowering my score 1 point.<br><br>The rest of the cast is good, although like the original Cheaper By The Dozen, we barely get to know some of the children, but that's understandable when we have to deal with 14 characters as well as ancillary characters. Steve Martin was excellent, as always (I enjoy his work in even his less popularly appreciated films), and although Hilary Duff (as daughter Lorraine Baker) seemed a bit odd in the context of the family, I enjoyed her performance a lot, also. There's something about her that I like, and it's not just her looks.","user":"BrandtSponseller","rank":[39,57]}]