[{"title":"Good","rating":7,"date":"23 February 2020","review":"The plot is more coherent and the action is staged more interestingly with some cool moments, but could someone please ask the gentleman holding the camera to take a few steps back and stop shaking the camera all over the place.","user":"MR_Heraclius","rank":[34,35]},{"title":"Nothing complicated here.........","rating":7,"date":"18 September 2005","review":"Just an all around fun romp at the movies. No new or complicated story here. We just get more of Frank kicking some serious tail. Implausible action sequences are forgiven with the wink of an eye from the director and actors. Some of the fastest action you will see that doesn't rely on wire-fu or CGI. Rather, we get a lot of the same from Frank and that is exactly what should be expected. I think in the modern era of the high concept action movies, they have forgotten how to just show the audience a good time. This movie and it's predecessor take us back to a time when action wasn't bogged down by complicated stories, rather the star's charisma and action were all that one needed to enjoy their time in the theater.<br><br>These movies have no lofty aspirations other than to give you one hell of a ride for an hour and a half. This outing delivers in spades.","user":"abahb1","rank":[63,83]},{"title":"Great popcorn flick","rating":6,"date":"21 December 2008","review":"Firstly, this film is never going to win any awards, but who cares when it is this much fun? Jason Statham gives us a likable turn as Frank Martin, and the rest of the cast aren't bad either. <br><br>The plot is complete and utter nonsense but is interesting. The stunts are completely over the top, but great fun to watch and very inventive (watermelon boxing gloves!). The film never takes itself too seriously and remains tongue in cheek the whole way through. Yes, it's all silly implausible nonsense, but remains very entertaining silly nonsense. Worth a watch if you want a mindlessly fun action movie. If you want something more intelligent, you'll have to look elsewhere, but I've seen far stupider films than this.","user":"Thomassweet","rank":[23,28]}]