[{"title":"One of my favorite movies","rating":8,"date":"22 February 2020","review":"I love this movie, by far my favorite R rated movie and in the running for one of the greatest and most epic in my opinion. The acting, the world-building, the character depth, and the thrill of such an incredible depiction of the time period. I didn't think it was possible to make an accounting of the Trojan war void of the supernatural presence of the Greek Gods that rivals the old story in excellence, but this movie does.","user":"MR_Heraclius","rank":[47,48]},{"title":"It's just a movie","rating":9,"date":"18 November 2012","review":"I'm sick of all the bad reviews for this movie. I really don't give a damn if it's true to the Iliad or not. The movie is extremely entertaining. I really like the fact that the gods are downplayed in this movie. It makes the story a lot more realistic. The acting was good. The story was good. The dialogue was good. The action scenes were good. I really can't see what's not to like in this movie. I guess I could pick it apart and find flaws, but I could do that with every movie ever made. For those upset by the fact that there was no definite good side or bad side, I have some shattering news. In war, there is never a good side or bad side. War is all subjective depending on whose side you are on. Every side thinks they are the good guys. A lot of people were upset about Paris, who is cast as a coward, becoming heroic in the end. Like it or not, we all have cowardliness and heroism within us. We just don't like to admit it. So, ignore the critics and watch this movie. Remember, critics have an opinion just like everyone else and as the old saying goes, opinions are like a**holes. Everyone has one and a lot of them stink. You don't have to agree with me, but don't let someone else make up your mind for you either.","user":"ja0576","rank":[153,174]},{"title":"\"Where does it end?\" -- \"It never ends.\"","rating":10,"date":"11 March 2014","review":"If Homer's mythical epic \"The Iliad\" is based on a factual story, that story is magnificently depicted in Wolfgang Petersen's 2004 epic \"Troy.\" In other words, don't expect any goofy 'gods' or 'goddesses' like Athena popping out of thin air because \"Troy\" is a realistic portrayal of the Trojan war.<br><br>More than that, \"Troy\" is arguably the best sword &amp; sandal epic ever put to film. You name the picture -- \"Samson and Delilah,\" \"Spartacus,\" \"Ben-Hur,\" \"Ulysses,\" \"The Viking Queen,\" \"Conan the Barbarian,\" \"Braveheart,\" \"Attila,\" \"The Odyssey,\" \"Gladiator,\" etc. -- \"Troy\" is superior. At the very least it's as good as some of the better flicks just noted, like \"Ben-Hur,\" and far edges out \"Spartacus\" and \"Samson and Delilah.\" As for more recent sword &amp; sandal epics, like the overrated \"Braveheart\" or \"Gladiator,\" \"Troy\" blows 'em out of the water.<br><br>Roger Ebert is a great writer and critic, but his mediocre review of \"Troy\" is all wrong. Ebert's major criticisms, believe it or not, are the main reasons I have such high respect for this film: He complains that Petersen omitted the many Greek 'gods' &amp; 'goddesses' and gripes that the actors perform their roles as believable people and not larger-than-life caricatures. This can, of course, be respectably done, as in the 1955 film \"Ulysses,\" but this is not what Petersen was shooting for in \"Troy.\" His goal, as already noted, was to depict the actual Trojan War on which Homer's myth is based. (Even if it never really took place, wars LIKE IT did).<br><br>Regarding Brad Pitt's heavily criticized performance as Achilles, I couldn't care less about Pitt until seeing this movie as he does an outstanding job portraying Greece's greatest warrior. No, he's not the bulkiest warrior to ever grace the earth, but he's fast as lightning, confident, expertly skilled and deadly accurate. Even his voice completely fits the role. Eric Bana (from \"Hulk\") is also great as Hector, Achilles' Trojan counterpart, who's sick of war and just wants to live a life of peace with his family. These two have a showdown in the film and it is without a doubt the greatest mano-a-mano sword &amp; sandal duel ever filmed.<br><br>What's interesting about the picture is that you never really end up rooting for one side or the other. When Achilles and Hector have their powerful face-off, my wife and I couldn't decide for whom to root. Maybe that's the point. Don't get me wrong, Agamemnon could be viewed as the villain in this picture, and I wasn't rooting for Menelaus when he fights Paris (Orlando Bloom, who seduces Helen, Menelaus' wife), but neither the Greeks nor the Trojans are painted as the 'good guys' or 'bad guys.' They're just people at war, and in war there's no real glory, as Hector points out... and it never ends, as Achilles states. An additional point is that living in a state of war is a JOYLESS existence. And both Bana and Pitt get this across well.<br><br>As for beautiful women, there are only a couple mentionable: Diane Kruger plays Helen, \"the face that launched a thousand ships.\" Some have complained that she's too plain for the role, but I disagree. I'm not a fan of hers or anything, but she looks pretty dang sharp to me (not to mention has an impressive behind shot). Besides, beauty is in the eyes of the beholder. If Paris deems her worthy of starting a war, who are we to disagree? Also on hand is cutie Rose Byrne who plays Briseis, the virgin priestess whom Achilles converts to the pleasures of the flesh.<br><br>I should point out that \"Troy\" was one of the most expensive pictures ever made at the time and it definitely SHOWS on the screen. Make no mistake, \"Troy\" is breath-taking just to WATCH -- the colossal armies, ships and battles are awe-inspiring to behold, not to mention the Maltan and Mexican locations. And the CGI effects are outstanding for the time, not fake-looking like the Rome &amp; Coliseum scenes in \"Gladiator.\"<br><br>Another complaint by Ebert is that the dialogue is lousy; nothing could be further from the truth. There are great pieces of dialogue interspersed throughout, including Achilles' comment that the 'gods' envy people because we're mortal and \"Everything's beautiful because we're doomed.\" Thankfully, there's not one goofy one-liner anywhere to be found.<br><br>James Horner's score should also be mentioned. If you enjoyed the soundtrack of \"The Passion of the Christ\" you'll love this one because it's just as good/serious/reverent/powerful. For instance, the intense percussion during Achilles and Hector's showdown is magnificent.<br><br>Interestingly, Brad Pitt, who plays Achilles, injured his Achilles tendon during shooting. Fitting, no?<br><br>FINAL WORD: If you're in the mood for a sword &amp; sandal epic, \"Troy\" more than fills the bill. The story captivates from the get-to and never lets up the entire 2.5 hour runtime (technically 2 hours, 42 minutes, with credits). It extravagantly visualizes the Trojan War for you, something I never did until seeing this mind-blowing, outstanding piece of cinema.<br><br>GRADE: A+","user":"Wuchakk","rank":[33,39]}]