[{"title":"a new direction","rating":8,"date":"3 October 2005","review":"So in the last few years we have seen Jet Li in Romeo must die and Cradle to the grave, both modern and with Jet Li approaching the subject of acting, though hardly touching it. So far Jet Li has not acted he has merely been that kung fu guy, another Bruce Lee.<br><br>But here, we see him act, not for just five minutes when there is a break in the fighting, but for the entire film. At times there is over half an hour between any kind of fighting, and it is very much appreciated. We really see a different side of Jet Li, this is not 'you killed my master; I have come to avenge him'. But a new, modern martial arts film, where we have a plot we can believe in.<br><br>Bob Hoskins takes a nice dramatic turn here, 'that man sure can talk', as Danny's 'owner' and it's a gangster role that suits him well. His angry growl is both fearsome and less put on but unleashed.<br><br>But don't get me wrong here; this is still a martial arts film. You'll find yourself cringing and laughing from fright at the fight scenes. Jet Li is not a sleek, showy performer here, but real fighter, intense and scary in his brutality. But equally brutal is the realisation of human freedom and human nature, in some ways were all somebody's dog.<br><br>Danny the Dog is clearly Jet Li's best work, and hopefully marks a new direction for him, one I am very much looking forward to seeing.","user":"evergrey-2","rank":[83,90]},{"title":"Transcending Evil, Discovering Humanity","rating":9,"date":"28 October 2005","review":"Luc Besson's signature style is all over the writing of this very fine little film. His ability to push the buttons on the most violent screen business while gradually developing a tale of warm sentiment is well served by director Louis Leterrier and a perfect cast of actors. UNLEASHED is one of the few examples of how martial arts and bona fide drama can be mutually supportive in creating a film that is at once thrillingly athletic and gently tender.<br><br>Bart (Bob Hoskins) is a brutish loan shark thug who makes his 'collections' accompanied by his 'dog' Danny (Jet Li), a silent man Bart has raised form childhood to be a caged killer, a human with a dog collar that when removed unleashes a ferocious beast who kills on command of his master Bart. Bart keeps him in a cage, feeds him, and uses him solely for his criminal doings. Danny unleashed is simply a Pavlovian animal and when the collar is replaced, he becomes docile with the sad eyes of a puppy.<br><br>During a 'collection' gone bad, Danny escapes and finds shelter in an antique shop basement where he meets blind piano tuner Sam (Morgan Freeman), a gentle man who gradually introduces Danny to music, trains him as his assistant, and introduces him to his 'family' - his step daughter Victoria (Kerry Condon). With the two of these welcoming, tender people Danny discovers how beautiful life can be. The story from this point is how Danny chooses between his Pavlovian response life as a killer and the simple life of Sam and Victoria. The journey is not without stressors and it is a difficult transition that keeps the viewer on seat's edge.<br><br>The wonder of this film lies in the extraordinary performances not usually associated with martial arts films. Jet Li does some of his finest athletic fighting on film, but thankfully at the same time creates a character who is multidimensional and memorable - a very fine acting job by Li. Bob Hoskins is brilliant as the despicably cruel Bart, Morgan Freeman adds a luster to his fine portrayal of blind Sam, and Kerry Condon makes Victoria zany and lovable at the same time. The action is superbly captured by cinematographer Pierre Morel with the aura of darkness in Danny's caged life serving as a perfect foil to the martial arts sequences.In short, this is a fine little film about characters worth knowing and provides audiences with both action and drama of a very high level of achievement. Grady Harp","user":"gradyharp","rank":[59,64]},{"title":"a.k.a - Danny the Dog","rating":7,"date":"17 May 2005","review":"It has happened finally. Jet Li has made a foreign movie (that would be a non Chinese movie) that is actually good. For the most part, Jet Li's career in American and European movies have been brainless action movies. In these movies Jet has not had to act and would appear to the untrained eye as not being able to act. This of course is not true (especially if you have seen any of his Chinese movies - Once Upon a Time in China series and Fong Sai Yuk series as an example). This movie actually lets him flex his acting muscle.<br><br>The story revolves around a Glasgow loan shark, Bart, (played despicably well by Bob Hoskins) who enforces his territory with the use of a man on a leash (a.k.a. Danny, Jet Li). When the leash is taken off and the command given, Danny springs into a violent rage. With the collar on, Danny is quite docile and child-like. As the story progresses, we discover that Danny has been \"trained\" to behave like this since he was a child. He eats from a can and sleeps in a cage. When Bart rubs a payee the wrong way, the payee feels the need to rub Bart out (namely with a dump truck and some automatic rifles). Danny gets away, and stumbles onto a blind piano tuner (Morgan Freeman) and his step-daughter (Kerry Condon), who take him in and show him a different lifestyle.<br><br>The conflict in this movie arises from the contact between Danny's two divergent lifestyles (especially since Bart doesn't die in the hit). First and foremost, if one comes to see this movie with a preconceived notion of Jet Li (especially from his non-Chinese movies), you will be disappointed. This is not an action movie. This is a drama. This is not to say there isn't action in the movie, but it is not the main attraction.<br><br>There is action in this movie, but it doesn't dominate the drama. It is used effectively to convey the chaos and inhumanity that Danny goes through. The action is quite good and Ong-Bak-ish. One can't help but go ouch, when a kick or punch (or sledge-hammer) connects.<br><br>Jet Li is the main attraction of this movie. In studying for this role, Jet Li trained with an acting coach and seemed to do quite a lot of method acting. On set he would sit alone and eat his food and would isolate himself from people. He also studied the behavior of dogs. Morgan Freeman plays the wisely-father-figure. Kerry Condon does a good job of playing the cute, innocent, &amp; potential love interest. Bob Hoskins does a great job of doing a cockney, ruthless thug. Jet's performance along with that of his supporting cast, make this the best of the Jet Li's foreign (non-Chinese) movies. I highly recommend it.<br><br>-Celluloid Rehab","user":"CelluloidRehab","rank":[45,49]}]