[{"title":"Not one to see twice, even with the cloning element.","rating":4,"date":"16 July 2004","review":"I guess this film didn't really grip me. You knew from the start where the film was heading, but it seemed to take its sweet time about getting there. Perhaps that's why I found myself nodding off several times, only to be awoken by the obligatory, and repeated use of, shock tactics throughout the film.<br><br>I can't really think of anything positive to say about this film, but neither can I say anything greatly negative. It was neither good, nor bad. In fact, watching it was very much like being trapped in limbo. There was little to stimulate the audience's minds through most of the movie.<br><br>It's also irritating to see Hollywood moralising about the evils of cloning through the use of film. I'd hesitate to say it was right, but the last thing reasoned debate on the subject needs is idiot screenwriters cashing in on public fears (and fears that are generated by media misrepresentation, at that) and adding more fuel to the fire. What next, a movie about people turning into flies because they ate genetically modified food crops?<br><br>This film isn't very good and you won't be seeing it twice even if you do have the foolishness, like me, to watch it once. Lets just hope that this is one film that Hollywood decides NOT to clone in the future.","user":"Rob_Taylor","rank":[79,99]},{"title":"Has potential, but it's a bit like watching molasses in January","rating":7,"date":"20 February 2005","review":"After losing their son, Adam (Cameron Bright), to a freak accident, Paul (Greg Kinnear) and Jessie Duncan (Rebecca Romijn-Stamos), are approached by Dr. Richard Wells (Robert De Niro), with a risky and illegal idea--to try \"replacing\" Adam with a clone.<br><br>In my way of looking at ratings, 7s are Cs. They tend to do as many things wrong as right. Godsend has some admirable script characteristics, a good to great cast and some very good technical aspects. But it also has negative script characteristics and some questionable directing and editing.<br><br>Overall, I believe Godsend is worth watching, so let's look at the positive points first. It's rare that filmic science fiction--and this is just as much as science fiction film as a thriller or horror film--tries to tackle \"hard science\" as exposition and motivation. Although Godsend also mixes some strong fantasy elements into its \"twist\" and the consequences that lead to the film being a thriller/horror picture, the basic idea is one rooted in actual genetics. De Niro is given quite a few mouthfuls of science-oriented dialogue that are fairly sound, and for my money, he delivers them well.<br><br>I'm a big fan of De Niro's, so I tend to be gracious in my evaluation of his work. But I could see where some viewers less enamored with De Niro overall might find his performance here questionable. It's certainly a bit different than normal, being oddly restrained and almost emotionless for much of the film. For me, that approach fit the character, given his profession and eventual revelations about his personality. The other three principles--Kinnear, Romijn-Stamos and Bright--were good in my view, but again I can see where some viewers could interpret their performances negatively. To me, however, all of the obvious problems stem from direction and editing, not the actors' work.<br><br>The biggest problem seems to stem from director Nick Hamm's comments about the horror/thriller genre. He has stated, \"what was interesting to me about Godsend was that the horror and the suspense had nothing to do with anything supernatural or spiritual\". Hamm isn't a very big fan of the fantasy aspect of horror, which to me, translates into not being a very big horror fan. This led to trying to create a horror film where suspense arises out of realist drama and psychological situations. The realist drama in Godsend tends to be very slow and relatively uneventful--just as one might expect from someone not really wanting to make a horror film. Psychological horror is barely approached. There just isn't enough that happens. There are two potential villains, but neither does much. It would be very difficult to call either \"evil\".<br><br>Kinnear and Romijn-Stamos aren't given enough to work with. They don't have anything very meaty to react to. Hamm seems too afraid to leave realist drama territory, at least in terms of the overall plot/action. That makes some of their \"horrified\" reactions seem shallow or false. Worse, Hamm doesn't seem to know how to cut horror films very well. Scenes go on far longer than they should, and occasionally almost seem as if we're seeing a bit of the footage either before Hamm said \"Action\" or after he called \"Cut\". A prime example of this is the scene near the end when Romijn-Stamos is walking through woods toward a shed.<br><br>Godsend is also one of the few cases where copious DVD extras may have hurt the film more than helped. The DVD contains four alternate endings, averaging about 12 minutes long each. These occasionally deviate strongly from the theatrical ending, but none seem quite satisfying (all of the more nihilistic endings that Hamm described on his commentary but which apparently weren't shot would have done the trick for me; I also liked the filmed tag suggesting a sequel). They all tend to drag on, an impression that isn't helped by the lack of a score and a sound effects soundtrack.<br><br>Also curious, given Hamm's dislike of the fantasy aspects of genre films, is the fact that the crux of the \"twist\" in Godsend is extremely loopy. What's happening with Adam makes little sense from a realistic/scientific standpoint, and how it happened just isn't possible. Of course, I'm not averse to fantasy, and I don't subtract points for elements in film that are wildly divergent from our beliefs and understanding of the actual world. But if Hamm is going to abandon realism when it comes to important plot points, why not abandon it wholesale, so that we can maybe see a film that deserves an A instead?","user":"BrandtSponseller","rank":[46,58]},{"title":"\"Dad, did I die?\"","rating":3,"date":"3 October 2004","review":"What can I say about Godsend that hasn't already been said? Probably not much. It was just so...blah. I'm convinced that there could have been a good movie here. I mean Greg Kinnear, Rebecca Romijn, and Robert Deniro! Come on! This should have been a much better film. The premise was good: a couple lose their only son and are given a chance to bring him back through the possibly amoral process of cloning. If they would have listened to Jud Crandall they would have realized that \"sometimes dead is better.\" It was just terribly hard to sit through and the ending was really lame. I have to blame the writer. You know why? Because there are 4 alternate endings on the DVD and they all suck too. Either he just didn't know how to end it or perhaps the studio wasn't pleased. Either way, it's completely avoidable.","user":"Backlash007","rank":[46,62]}]