[{"title":"A Film Of Three Acts","rating":7,"date":"11 April 2013","review":"I came in to this film knowing absolutely nothing about it apart it being directed by David Cronenberg and it receiving a fair amount of critical acclaim on it's initial release . This isn't necessarily a bad thing because at the heart of the story is the mystery surrounding protagonist Tom Stall who becomes an unwilling hero when two armed robbers walk in to his restaurant one night . At this point I was expecting to see a film dealing with a reluctant hero finding themselves trying to cope with celebrity culture and having a reputation that other lesser mortals want to test in the most basic and violent form ie \" Let's see if tough guy Tom Stall is really that tough \" <br><br>Viggo Mortenson plays Stall in his usual convincingly understated manner and one wonders why he isn't a bigger name in Hollywood ? Possibly because he's an actor rather than a star and doesn't Stall in a showey manner , just an average family man wanting to get on with his life and the film does emphasise his everyman nature . The film does three distinct acts , Tom the family man , the mystery involving Tom and finally the showdown featuring Tom the man with a violent past <br><br>The problem is that the first third is slightly slow which isn't necessarily a criticism , the second third is very intriguing and keeps the audience on the edge of their seats but the final third is fairly daft . Fair enough it's not too difficult to buy in to the idea that Tom was once involved with the mob but the violent climax at the home of mob boss Richie Cusack is rather ridiculous as he dispatches bad guys who in these type of movies stand around watching their colleagues get beaten to a pulp and not intervening till the good guy manages to get hold of a gun and only then does the bad guy pull out his own shooter only to get shot by the good guy . You've seen this all too often in straight to DVD releases and for two thirds of the way through you're aware that this is too far good to be anywhere near a Steven Seagal straight to DVD movie","user":"Theo Robertson","rank":[13,14]},{"title":"One of Cronenberg's best and most accessible films","rating":9,"date":"9 April 2006","review":"Cronenberg's adaptation of a Wagner and Locke graphic novel places a simple American family man, and his all-American family, into a new and disturbing context which has them questioning everything they think they know. Tom Stall (Viggo Mortensen) owns a little diner in a small town and has a nice house on the outskirts of town, where he and his wife Edie (Maria Bello) raise their two kids apparently living the American dream in their own way. One day at the diner, two murderers pop by at closing time for some cherry pie, and Tom's heroic defense of his diner, his customers and himself sets off a series of events that threaten his family, his sanity and his life. The eerie tension never lets up in this powerful examination of identity, honesty and violence.<br><br>David Cronenberg has directed some of my favorite off-beat films - the masterpiece Naked Lunch, Scanners, Videodrome. I have watched these films many times and I still find them interesting. I can't really call myself a fan, however, because there are also just as many Cronenberg films out there which I found difficult to get through the first time (Crash, eXistenZ, Dead Ringers). Cronenberg enjoys creating disturbing situations and imagery, and wants to get under your skin and to stimulate your mind on as many levels as he can. In most cases, he pulls it off masterfully, but sometimes, his emphasis on the bizarre can come across as pretentious and forced.<br><br>Like a lot of very creative and intelligent people, Cronenberg sometimes leaves his signature virtually everywhere in his work. And sometimes, a director needs to make a film which does everything they want to accomplish but leaves off the signature. For example - the brilliant David Lynch showed us his ability to jump out of his own skin with Elephant Man and The Straight Story. These are still very much Lynch films, but they also appeal to the wider audience of mainstream cinema-goers. A History of Violence is, in some ways, Cronenberg's most straightforward film. A key to its success is that it is very easy to forget that you are watching a Cronenberg film, no matter how aware you are of Cronenberg's many quirks, idiosyncrasies and trademarks. It is so masterfully directed that, although the plot is not entirely unpredictable, you are right there in the action with the characters and feeling what they feel so that, though you may know what's next, you never exactly see it coming and you never know how it will take you there.<br><br>Viggo Mortensen, in his best mainstream role since Aragorn, and Maria Bello (one of the actors who made The Cooler worth watching), head an impressive cast in this adaptation of a Wagner and Locke graphic novel. Nobody in the cast slips up at all. The script is intense, realistic, and probably did nothing to make the performances easy. The plot, if described without the plot and the context created by the script, would seem somewhat absurd, but like Woody Allen's Match Point, it's absurdity does not make it impossible to believe. Editing, directing and pure performance combine to make flawless performances for this cast. Backed up by veterans Ed Harris and William Hurt, and very strongly supported by the excellent Maria Bello, Mortensen is shockingly excellent in a difficult role. I can't explain why without giving too much of the film away. Although the rest of the cast did exactly as they were supposed to, I want to single out Ashton Holmes - an actor I was completely unfamiliar with but who I will look out for in the future.<br><br>I recommend A History of Violence highly. It is one of my top five reasons for considering 2005 to have been a great year in North American film.","user":"mstomaso","rank":[152,211]},{"title":"Cronenberg hits a deep nerve brilliantly","rating":10,"date":"29 September 2005","review":"I expected bloody senselessness and instead saw a film laden with the deepest human emotions. It was real. From youthful loving to hard violence, from simple innocent joys to the full depth of adult violence and sex, and ultimate redemption, this film has it all. Every piece of clothing and set, every camera angle and lighting propelled the story relentlessly. I was never bored, and never overwhelmed with overdone violence. Nothing was gratuitous. Viggo Mortensen proved he's one of the finest actors to come along in a long while. Maria Bello carries so much on her talented shoulders. With Mortensen she shines with alternately warming and heartbreaking truthfulness. Ed Harris was delightfully menacing, and William Hurt gave the liveliest and best performance I've seen from him.<br><br>This movie is about truth and redemption. It's the best film I've seen in a very long time. Kudos to Cronenberg, Mortensen, Bello, and all the cast and crew for what was for me a nearly perfect movie.<br><br>See it, then see it again. It's brilliant.","user":"BJ Galler-Smith","rank":[428,639]}]