[{"title":"The dancing is great but everything else falls apart","rating":3,"date":"15 November 2004","review":"The competitive world of street dancing is explored through the eyes of two best friends, played by Marques Houston and Omarion. As the leaders of a hot local dance crew, they are challenged to a competition that causes a rift in their friendship, but if they're going to win at \"The Big Bounce\" they will have to put their dispute aside and work together.<br><br>You Got Served has some great dance spots but not much in terms of plot or originality. The makers of You Got Served only had one thing on their mind and that was to wow its audience with its dancing. They succeeded at making the dancing really good but failed to make a good movie. If you watch it just to check out the dancing and ignore everything else then you will enjoy it. But if you notice how bad the acting is or how stupid the story is then you will hate it. The dancing sequences are done extremely well and the movie gets a ten on that part but for everything else it gets a three.<br><br>The acting was decent enough for this type of movie but it could have been a lot better. The plot was stupid and it was tied together with the dance sequences. I think so many people hated this movie because of the story not making a lot of sense. While I didn't really like the film, I'll admit that the rating of 1.8 is too low for the movie. It was a bad movie but it wasn't that bad. Chris Strokes does a good job at directing the dance sequences but he can't tell a story at all. He would randomly move from scene to scene and none of them would really make sense. I heard they're going to make a sequel so hopefully they will work a little harder on the script. Though if they did make one, I probably wouldn't watch it. In the end, unless you're into dancing, this film is worth skipping. Rating 4/10","user":"christian123","rank":[31,41]},{"title":"The most enjoyable dance movie for me","rating":10,"date":"26 March 2012","review":"This movie is way better than step up 1, 2 and 3 and other dance films like those. Way better! After i saw it i start to watch the other movies of that kind with a \"different eye\". The dancers are awesome and the choreographs great! The music in it also! I cant understand why this movie is so underrated. OK the scenario about competitions is a lil bit \"clishe\" but even if it is i really liked this movie. It is not a love story again like always the strong part of it like the most movies of this kind. It is about music, and the passion of dancing! And the battles seemed too real to be fake that could make you wanter. Then i saw an interview of \"David\" who said: It was so real the whole thing in that dance ring that everyone wanted to battle and win for real, even when we knew the winner from before. And it seems exactly like that to a viewer who watches it. If you like hip hop music and dancing... Then you got to see \"You Got Served\" for sure! I have seen it about 9-10 times. I can see it more in the future. Trust me, it worths it. The most realistic and awesome hip hop dance movie ever.","user":"theotsi7","rank":[12,14]},{"title":"Good dance movie","rating":7,"date":"28 June 2008","review":"I think a lot of the people who commented on this movie before me were way too harsh. This is a teenage dance movie. If your not a teenager or into dance your not gonna get into it. Granted SOME of the script wasn't that great but I thought the basic heart of the story was good. I really don't get why all you people go out of your way to pick a movie apart. This is not some boring life affirming drama,this movie is for fun! So take it like that enjoy the fairy tale where everything works out and get a life.<br><br>Another thing,you have got to be kidding me with all the comments about bad acting,they were not that bad! The only time I found them bad was when the script made them say stupid crap. Oh and about them acting all \"thug\" like,are you serious?! Do you people even know any teenagers? ANY? Black white whatever? That is how they talk! Its not exaggerated!","user":"nicegal211","rank":[9,10]}]