[{"title":"A couple of answers that may be useful to understand this film better!!","rating":9,"date":"12 February 2008","review":"Hi! I am a South Korean national student here in London, and would like to give you some clues why the main character, Oh Dae-Soo, was kept in the private prison for exactly 15 years and why he ate the live octopus as I hope you all understand this film a little better.<br><br>Firstly, his wife was killed one year after his being kept in the privately run prison. Obviously, Oh Dae-Soo didn't kill her but was suspected of murdering her. It must be done by Lee Yu-Jin who planned to have his sister's revenge upon Oh Dae-Soo. In South Korea, criminals of unsolved crimes including murder cases are forgiven/overlooked by law 15 years after the crimes were committed, which means a murder suspect wouldn't be charged or get punished unless the suspect is caught within 15 years after the murder. This is why Oh Dae-Soo was released 15 years after his wife was killed. Thus, he wouldn't be disturbed by the police investigation and Lee Yu-Jin could play with him at his own discretion.<br><br>Secondly, nobody in the country eats live octopus like the way he ate in the film. It seems to me that the scene shows his uncontrollable anger against the man who he talked with on the phone and didn't say anything about the reasons why he was kept in the prison. If there was a piece of cake or a bowl of rice in front of him, I guess he would probably eat it in the same way he did with the octopus. So, please don't get it wrong that eating something alive is part of Korean culture. It should be understood itself in that extreme context.<br><br>I saw this film several times with my friends. I didn't quite understand it in the first view but came to like it in the second time and it's one of my favourites now. I like the complicated plot and the shocking ending. As I'm studying translation of English and Korean, most of my classmates and friends are English who spent some time in South Korean and they liked this one the most among other Korean films.<br><br>I hope my talk helps.","user":"kywoo7","rank":[323,401]},{"title":"If only we were all living in Asia....","rating":10,"date":"19 December 2007","review":"To start off; This is the one and only film that kept me quiet for a whole 5 mins after seeing it. I literally couldn't close my mouth, and yet there wasn't any sound coming out of it. Oldboy had such an impact on me that words are too little to describe that impact. Therefore this film is definitely in my top 3 films ever made. It belongs there because it has a massive ingredient that a lot of films seem to miss out on; a divine plot. Even though the acting and screenplay are world class, the plot is really the cherry on the cake.<br><br>When it comes to screenplay Park Chan-Wook is unique (at least for western standards) in his way of filming. The colours are so vivid and it seems like he wanted every shot to be a piece of art. One tip: If you like the shooting in 'Oldboy', have a look at 'Sympathy for Lady Vengeance', the third part in Park's revenge-trilogy. It's even superior to the camera-work in 'Oldboy'. Don't, however, expect a story like Oldboy's, because you would be very disappointed.<br><br>When it comes to acting and the music, this film is also one of the better films ever made. The music sticks in your head and every time I put in my Oldboy-DVD and the theme-song comes up, I'm just flooded with good memories (even though the plot doesn't have a single reason to be happy about). The characters are also presented very well by the outstanding cast. Especially Choi Min-Sik and Yu Ji-Tae set a very convincing performance. <br><br>I really appreciate this film being respected as it should be, by having a place in the top 250. If, however, it was up to me it would be even higher in the ranking. I don't see why films like 'The Usual Suspects' or 'Memento', which are fantastic pieces of film-making and which without a doubt deserve a place in the top 250, are higher in the top 250 than 'Oldboy'. They serve the same cause; a fantastic plot. But those plots can't stand in the shadow or even come close to the plot of 'Oldboy'. The one and only reason is that those two films are better known and from a western production company. If we were all living in Asia, no doubt 'Oldboy' would be in the top 20 of all time. <br><br>My advice to people who haven't watched this film yet: Go see it! This is definitely a must- see. If you have a weak stomach, pull yourself together and still watch it. Don't be as shallow as a lot of people here tend to be. Look beyond the violence and see the things I mentioned before: world class acting, cinematography, music and last but certainly not least the plot. Once you've opened yourself up you'll find a whole new world of cinema. Enjoy!","user":"bur_007","rank":[715,984]},{"title":"Freaked me out","rating":9,"date":"29 July 2007","review":"I haven't written a comment on IMDb for about 3 years but was inspired to with this film. It is not very often that I come across a film by accident (World Movies on cable) and the spend the next day scouring the internet to find out information about it and can't get it out of my head! Anyway, yep there are plot holes, but Old boy borrows a lot from surrealism and you are meant to suspend your disbelief! I don't buy comments when people say \"it is so unrealistic because he should've done this ...\" because it is a surrealist film and meant to be unrealistic! For me the sign of a good film is if it sticks on your head! THis one surely does (althought I did have to look away a few times ... ) Loved it!!!! Work of cruel genius!!! (HOLLYWOOD - Please don't ruin it by remaking it!!!)","user":"Genevieve_X","rank":[290,428]}]