[{"title":"This movie deserves a grade d-","rating":2,"date":"3 March 2015","review":"The director, grade f The cinematography grade d+ The story grade b The acting a big fat f<br><br>The story was good, my problem is the acting was terrible. It is like, the budget was so low that they had to do everything in no more then two takes. <br><br>I can only imagine the director, if he was worth anything he must be embarrassed by what he tried to put together, because like I said, I think this was so low budget that he had no choice.<br><br>The story line was a little confusing, but I managed to get through it only because I pretty much knew what the outcomes would be. very predictable.<br><br>If I was to teach a movie class, this would be one to show how a good story is made bad with bad acting, bad directing and way under budgeted.","user":"chinablix","rank":[5,5]},{"title":"Don't let the obvious fake reviews and ratings fool you","rating":1,"date":"16 March 2015","review":"A amateurish, pathetic and depressing melodramatic gangster \"woe is me, I've killed tons of people without thinking and just got shot and now I'm sad\"-tale <br><br>To be honest I couldn't even finish this dreadful piece of crap and poor excuse of a movie<br><br>Furthergoing with my honesty to call this a piece of crap is disrespectful to piece of craps in general this piece of crap is a whole new level of crappiness<br><br>If a man ate a hundred nachos and drank 4 gallons of Magarita and he farted, those farts would create a cloud that would resemble this movie<br><br>Lacking any kind of talent behind and in front of the camera it's fairly obvious that the positive +50 ratings are made by people who were apart or know someone who were apart of the making of this movie","user":"Seth_Rogue_One","rank":[6,7]},{"title":"Good acting and cinematography","rating":9,"date":"21 June 2005","review":"My girlfriend and I saw this movie at a friend's house. We probably would not have picked this movie out because of the violence, but it was a great movie. To watch the lead demonstrate his ability to show the gamut of emotions was touching to say the least. I want to know more about this story. It would obviously have to be in a prequel. Some of the scenery was gorgeous. What a contrast with the gutsiness of the plot. It moved with great velocity. I would like to see more from these writers. There is a realism that is not often seen in film these days. The twists and turns in the story were so surprising,but seemed to be very sensible once divulged. \"Oh yeah, why didn't I see that coming!\" it is definitely worth the rent.","user":"pooletom","rank":[3,8]}]