[{"title":"Cinderella of the Far East","rating":7,"date":"22 January 2006","review":"Asian dramas -- even the ones involving fantasy fighting -- have a certain lushness and a complex texture that I believe only Asian directors can truly capture. So having Rob Marshall, a very American director, step in, is a risk, and for two-thirds of the picture he mutes the frenetic editing and lurid visuals used in CHICAGO, slows the pace of the narration, and achieves the goal in making his vision look as authentic as possible.<br><br>MEMOIRS OF A GEISHA has a lot of Charles Dickens in its storyline. The tale of Chiyo, the little girl who is sold by her mother to a geisha house, her trials and tribulations, her knowledge and yearning of true love and success as a geisha is almost identical to the Dickensian universe. It even evolves in a similar manner, and its more effective moments are the ones involving Chiyo as a girl (Suzuka Ohgo) becoming friends (and later enemies) with Pumpkin, not understanding why she is in this strange house, why she has been separated from her sister whom she frantically tries to seek out, or why the geisha Hatsumomo (Gong Li) is so mean to her. One touching scene, which becomes the focus of Chiyo's drive, is when she encounters this \"prince\" of a man, the Chairman (Ken Watanabe). The smile he coaxes out her sad face is the most luminous moment in the entire film, and this event makes Chiyo want to become a better person and reunite with the Chairman. They do meet later on, but the movie mutes their romance after she becomes the geisha Sayori (Zhang Ziyi), and in trying to keep him distant in a casual way -- they don't share as much as a stilted conversation -- somewhat works against the believability of their mutual but restrained love.<br><br>What does work is the subtext within the relationships between the two other women and Sayori, intended or not. Hatsumomo explodes in rage against Sayori after being successfully put down the night of her debut that has hints a little of repressed lesbianism. Notice the way Hatsumomo lashes out like a snake: it also seems as if she would be ready to kiss her at any second. Also noteworthy is the relationship that Sayori develops with her mentor Mameha (Michelle Yeoh). I loved it because I've seen Ziyi and Yeoh play rivals in CROUCHING TIGER, HIDDEN DRAGON and it was great to see them interact in a completely different way, one that indicates Mameha was the replacement for the sister Sayori lost, one who also lost a chance at love and happiness, and who only knows the life of a geisha.<br><br>Where the film falters, somewhat, is in trying to tie in all of the story lines once the last half hour arrives. The invasion of World War II, while intending to show how times change and traditions morph, somehow didn't work on film as it must have on paper. I also felt that Pumpkin's late introduction as a very American-friendly whore with double intentions could have been handled better and seemed to belong in another movie with comic overtones. Granted that her character had becomes, as the mistress of the geisha house had predicted, Hatsumomo's puppet via her actions, but I felt it slowed the story down a little. Another character who did an about-face was Nobu's (Koji Yakusho). There was little-to-no indication he had any interest in Sayori and more than once he rebuffed her or looked bored by her. His sudden declaration of love comes too abrupt and I didn't quite buy it. But it's the problem with staying too close to the source material: sometimes you have to tweak it a little while maintaining its essence.<br><br>As usual, there is some fantastic subtle acting from the three leading ladies, all film veterans in their native China and Malaysia, as well as in Ken Watanabe and Koji Yakusho. Yes, it's thirty minutes too long. Yes, the love story is marginal at best. And yes, it would have benefited better had it been done in its native tongue with subtitles, but that would have been at the expense of it having limited availability. However, it is a sumptuous, gorgeous film about the triumph of the spirit of this one girl against the odds around her. And it even has a happy ending.","user":"nycritic","rank":[102,124]},{"title":"Duel in the Rising Sun","rating":13,"date":"13 December 2005","review":"Looking over previous comments here, it is clear that this is a very polarizing movie experience, one that seems to put \"Syriana\" to shame in that realm. Director Rob Marshall has taken a best selling novel and turned out a feature film that it appears some people love and some absolutely hate. Count me in the first category, but allow me to indulge the critics, too.<br><br>First, this isn't a typical Hollywood film. Despite popular western misconceptions about Geishas, there's no sex, almost no violence and beyond that, there's nearly two and a half hours of women's problems that many men may find hard to relate to. This is not \"Desperate Housewives\" or even \"All my Children.\" This is about deceit, treachery and rivalries as much as it is about a little girl who gets sold into bondage by her impoverished Japanese family. Its also about a lifelong search for love in a society in which people apparently can't just step up and make frank declarations of devotion to one another. This movie is in a word \"complicated\" and that is going to turn some American movie goers off.<br><br>But not all Asian film fans are raving about this movie either, some thinking it is a very superficial look at Japnese customs and others incensed that a movie that's about an important Japanese tradition should star three Chinese actresses. I cannot comment on either topic, since I know little or nothing about Japanese tradition and I don't know why Ziyi Zhang, Michelle Yoeh and Gong Li were cast. They have been seen before by American audiences, but are hardly film stars in this country, so it wasn't as if they were going to draw in tons of fans on their names alone.<br><br>The only thing I can think of is, all three are fine actresses and they more than proved that in this film. If Gong Li does not get a best supporting actress nomination, there's no justice. And Zhang should probably get a crack at best actress for her work, as well.<br><br>All three just light up the screen.<br><br>But, I can understand in this age of political correctness, how some would be offended by the casting and how others might complain about the handling of the Japanese subject matter.<br><br>All I can say is, movie makers face trade offs and one is either targeting your film to a mass audience (and in America, that means a generally poorly educated audience) or \"narrow casting\" your film to people very well acquainted with the topic who will swoop down on any flaw. But that, when dealing with a topic like Japanese geisha culture, is a pretty small audience in America, too small to generate the kind of box office a film like this needs to pull in to pay for itself. From a purely Anglo, American, unschooled in Japanese culture standpoint, I think Marshall made good decisions. I hope he has not slighted Japanese culture too much, but I think he has made a suspenseful, captivating, enchanting film that does something a lot of films haven't in recent years.<br><br>He gave us a complex central character we can pull for throughout the film and for that, I thank him.<br><br>\"Memoirs of a Geisha\" ranks among my five best films of the year thus far, and deserves a best picture nomination.","user":"Tony43","rank":[430,562]},{"title":"Breathtaking from the first scene","rating":9,"date":"8 December 2005","review":"I lived in Japan for 3 years and I loved the book, rich with visual imagery. I went to the see the movie with a good deal of trepidation, convinced that they were going to butcher it and sex it up to appeal to American audiences. Instead I sat spellbound in my seat as I watched the images that Arthur Golden has created in my mind with words years before, play themselves out on the screen in front of me. Every shot, ever scene, every tiny detail was just beautiful. I literally did not look away from the screen the entire time. The acting wasn't spectacular. I think they could have found somebody better to play Sayuri. The children were all wonderful. The stand-out actress by far was Gong Li as Hatsumomo. The villain had the best opportunities to show her skills as a thespian. The plot stuck very closely to the book. They eliminated the scenes that they needed to in the interest of time, but they didn't try to take any shortcuts or speed up the plot. I really felt like the story was played out beginning to end without sacrificing any of the meat. You'll read a lot of reviews in the coming weeks praising the gorgeous photography. Every word is true. Words like \"lush\" and \"exquisite\" only begin to do it justice. I've never had the experience of being transported to another time by a movie in quite this way.","user":"kyaroko","rank":[320,435]}]