[{"title":"Taut thriller led by Cruise's excellent work.","rating":8,"date":"7 January 2005","review":"For the better part of his career, Tom Cruise has played the All-American good guy. Gleaming eyed and bushy tailed, Cruise has played the roll of the hero in many films and is certainly the richer for it.<br><br>Something happened along the way, though. Cruise wanted to be considered a legitimate actor, rather than merely a \"movie star.\" Therefore, we've seen him go against type, successfully (MAGNOLIA), and not so much (THE LAST SAMURAI). It's as if Cruise is the neglected kid in the back of the classroom who knows all of the answers but is never called upon, and therefore will go to desperate ends for attention. \"Oh, Oh!! Pick me!!! Pick me!!!\" <br><br>For me, Cruise hit it this time. His character in COLLATERAL is a menacing study in coldness. It is a thoroughly believable depiction of an utterly ruthless hit-man. It seems, finally, Cruise is actually BAD, rather than merely acting bad. He disdains his usual tricks in favor of a simple and very real performance.<br><br>Let us not forget Jamie Foxx. His character's transformation into a hero is rendered all the more effective by how wonderfully Foxx captures his character's initial impotence and bewilderment. It's a wonderfully effective, energetic, and yet very subtle performance.<br><br>Special kudos to Michael Mann. He has a very interesting eye when it comes to capturing the city of Los Angeles on film. His vision of L.A. in this film is one of unease and uncertainty, hardly the usual glitz and glamor treatment. This work is always compelling to the eye and paced to keep the action moving ever forward. Each scene has its own logic, contributing to the overall whole. This is first rate film-making.","user":"actorman_us","rank":[253,321]},{"title":"Mann's stylish view of a blue lit, dark LA in a rare character driven (action) film","rating":8,"date":"8 August 2004","review":"Dirty, sun baked, sprawled, crowded... LA generally has its soul borne to us in sunsets and palm trees, highways and high-rises. Michael Mann and his creative eye for detail and engrossing storytelling style showed us a different Los Angeles. One of soft lights that spill from their street lamps, blues that mix with whites and mingle with greens. His veteran hand having wrought films such as HEAT and Ali, Mann delivers a beautifully created film, which compels the audience to not just watch and listen, but to be a part of the film, and to truly challenge the characters brought to life on screen.<br><br>Tom Cruise plays Vincent, a cold contract killer in LA for a single night of hits. Through an interesting course of events, Max (Jamie Foxx), a timid cab driver who lives on dreams never full realized, gets pulled into the whirlwind of murders as the driver for a hired assassin. The majority of the film is just that, Max and Vincent. Cruise drowns himself in the role, training in weapons handling for months beforehand and plays Vincent as a cobra, a natural killer of lightning reflexes and sudden violence. A contrast to Nathan Algren of The Last Samurai, Cruise plays a morally flexible man of questionable scruples quite well, characterizing a dystopian apathy well. Foxx gives a terrific and serious performance as Max, showing well his growth through the film. Also uncharacteristically heavy, the character of Max was a challenge well met by Foxx. The admiration between the two characters is evident only via the actor's incredible performances and without such subtle and silent respect for each other, the characters (and thus the film), would fail.<br><br>A modern Film Noir, Collateral starts with a smooth beat and never skips until the final notes. Music choice is excellent, flowing into and out of the smooth and extremely choosy camera work. Without interrupting the scene, the music simply adds to the pressure and tension. The first shots of the film set its tempo; a combination of quick shots of characterization, tearing tiny pieces of meaning from a whole, and large, smooth panning shots in filtered digital, lighting in even blues smoothing all of LA's rough edges, present the film immediately as a piece to be taken in. Los Angeles is presented in all of its sprawling, seedy glory as a ponderous, living, breathing and dangerous American Hell in the most beautiful way in years. Stylized artwork in the film results in beautiful scenes of high contrast, the medium gray of Vincent mixing with the blues, blacks and whites of the background and mis en scene to create compelling visuals. The smart dialogue, written by Stuart Beattie (Pirates of the Caribbean), is short, often witty and has a knife fight nature of quick cuts and ripostes. Mann's camera continues to bring the audience into the movie, slipping us into the cab to nearly intrude on the dialogue between Vincent and Max as they explore each other's limits over a series of threats, philosophical discussion and guidance in a setting so tense it nearly quivers.<br><br>For most of the movie the audience never sees the action, only the Vincent and Max. Their growth is incredible, Mann coaxing amazing performances from his leading men. Masterful use of the camera, well written dialogue and incredible acting take a movie in which nothing happens, no explosions, no thunderous gunshots, no huge arguments or fanfare, and presents it as perhaps the most compelling and intriguing film in recent years. <br><br>A macabre relationship develops between Vincent and Max which leads into sibling rivalry, relationship and life advice, moral guidance and general discussion of life which is an area generally left to close friends to breach. Poetic scenes involving an understated fight for motherly affection and a question of morality of the hows and whens to kill lead to an intense relationship that seems to bond the two men. In terminus, the two realize their admiration for the contrasting aspects of the other man and the resultant event is a confrontation, a skillfully manufactured climax. The most compelling aspect of the film is not the content but what that content means. As Max and Vincent explore each other and developed, their conversations pose questions and begin to form inquiries in the minds of the audience. Some answers are the easy ones; others are much harder to come to resolution with. There is no right answer to any of them. <br><br>Never losing momentum, the film inexorably pushes onward through its motions, the audience running after it attentively. The third act of the film comes after a climactic gunfight and seems almost a let down until once again we are at home with Max and Vincent in the cleanest cab in LA. A series of quick twists deliver a more conventional final piece of the film, hurtling toward a final confrontation. It can not be emphasized how different the final part of the film is from the former pieces, nor how important it is to the film in its entirety. An interesting and intense crime drama, Collateral delivers in a way few films have in many years and will leave you walking away from the theater wondering at the significance of the film.","user":"torsotheclown","rank":[168,222]},{"title":"A Masterpiece","rating":9,"date":"25 February 2005","review":"Collateral is a masterpiece of American cinema. Jamie Foxx is Max, a Los Angeles cab driver with dreams of his own limo company, \"Island Limo\". After twelve years on the job he has become quite gifted at discerning the most intimate details of his passengers' lives... just a glance at their clothes, and he knows.<br><br>His worldly insight manages to tear down the defenses of one of his passengers, a State Attorney played by Jada Pinkett Smith, who graces him with her phone number. Max hasn't even begun to revel in the pleasure of possessing the beautiful attorney's digits when he gets his next passenger, Tom Cruise as Vincent, a slick hit-man in town for a night of killing.<br><br>When a body drops out of a fourth story window and onto Max's cab, he becomes an unwilling partner on Vincent's murder spree. Director Michael Mann (The Insider, Ali) does a masterful job manipulating texture and tone throughout the movie, taking us to settings as diverse as a junkie's apartment, a penthouse, a hospital room, and a smoky jazz club, all the while making the city of angels a central character in the story.<br><br>The soundtrack is also excellent, with a mixture of popular music and ambient tracks perfectly-timed and synced to the story... tribal drumbeats during the chase scenes, haunting rock ballads at pivotal moments, and one track that reminded this viewer of the scene at the other end of Tom Cruise's career, when he drives his father's Porsche out of the garage in \"Risky Business\" to the accompaniment of a thumping synth track. A bizarre side-note, I know.<br><br>As the movie builds to a climax, the police are hunting for Max, believing he is the one on a killing spree, and Vincent stalks his final victim in a blacked-out high-rise office to a backdrop of the brilliant LA skyline, reflected in multiplicity by the office's dozens of glass cubicles.<br><br>Tom Cruise, Jamie Foxx, and Jada Pinkett Smith all rise to the occasion in Collateral, and together they transcend their previous appearances on film. Mark Ruffalo gives a good performance as the cop who knows everything is not what it seems.<br><br>There are a few minor plot points which didn't sufficiently suspend my disbelief (like when Max agrees to take Vincent the vicious hit-man to see his Mother in the hospital), but overall this is a fantastic movie.<br><br>Troy Dayton","user":"daytony94","rank":[249,335]}]