[{"title":"Absolutely wonderful","rating":10,"date":"23 September 2004","review":"Well, reading all these interesting comments above made me think.... First of all,i have to say that i loved Wonderful Days. A lot. The art is gorgeous, yes, i think this is the one point everyone can agree upon, hands down. Now, concerning the storyline itself....<br><br>I think there should be some clarification, especially for all those poor ppl who must have watched this in English (either subtitled or dubbed). Those who did the translations deserves to get hanged. and i mean it. i own the special edition 3-disc original Korean DVDs and have also watched both the subtitled and dubbed versions. It actually feels like i'm watching 2 completely different versions of the story! The original korean version has a much more interesting (not the greatest, but definitely superior and full of nuances)script and explains the story quite well, unlike the English versions that either skip entire parts of dialogues (which are essential to understand the movie *_*) or change their meanings into something totally different and just plain wrong! And someone mentioned that some characters' names weren't mentioned in the movie till the very end. Well, i can tell you that the names (except that evil adjudant(?)) are mentioned quite early in the beginnings, but mysteriously, NOT in the English versions O_o ! I'm on the verge of thinking that it must be some sort of conspiracy to ruin this otherwise great movie... I suggest you watch the korean version....or get a korean friend to actually translate you the real lines, instead of getting confused at the horrible English sub/dub. <br><br>anyway. oh, and i honestly don't understand all those who say that the story wasn't original,good enough,etc etc. i mean, it might not be the most mind-boggling thing on earth, but the twists are original enough to set it wiiiide-apart from your average anime/movies where all you have is 90 minutes of explosions, punches, boobies, and some supposedly dramatic ending (that ppl apparently find \"original\"). <br><br>For those of you who still think the story isn't well explained in the movie...well, there's always the novelized version that came out in Korea (no English versions, sorry) that gives all the background story between the characters and all. Like what really happened in Shua &amp; co.'s childhood, the characters' motives, blah blah...<br><br>Boy, is this review getting longer and longer....<br><br>A final word... considering the depressing situation in Korea (let's just say that animation/comics are ignored by most and the market terribly limited) the creators and all those who worked on this film did an unbelievable job. I really hope things get better back there, cuz it's not the skills they lack, but public support and funding. <br><br>oh, i guess i have to rate this thing. 10/10 for the story (9/10 for the actual flow), 10/10 for the art, 15/10 for the efforts lol.","user":"hendercrazy","rank":[65,73]},{"title":"Bravo Korea...","rating":9,"date":"20 November 2003","review":"Great great movie...tech-wise. Ok, granted it's not the most elaborate or original of movie plots. It's the eternal story about love and jealousy, power and corruption, good and evil but it has got a Miyazaki twist to its story, or at least tries to emulate the master, rather unsuccessfully I might add. The animation is like nothing I have seen before though, and I HAVE seen Final Fantasy. Main problem: the characters are poorly developed, if not at all. And the story doesn't grab you by the collar and throw you in its world, so you're always \"aware\" of the animation, it being the masterpiece that it is... But again, it's a movie well worth seeing, some shots will even make your jaw drop and eyes bulge, that's how much the scenes are beautifully drawn and animated. The authenticity of the \"small\" things (rain dropping pattern, eyes watering) is what I personally marvelled at more than anything else. Oh, and an out-of-this-world soundtrack to top it off, with some exquisite pieces that matched the moods perfectly. It was the only thing that really \"sucked me in\" a few times... All in all, it is a very promising start to all-korean animations.","user":"wannas81","rank":[31,36]},{"title":"Wow","rating":7,"date":"29 August 2005","review":"This is definitely more than a pure animation. It's more like a movie, only an animated one. My emphasize here is on the word movie. Not because it has a brilliant colorful animation, that sometimes appears to be 3 dimensional, and sometimes 2 dimensional ( which is spectacular by itself). It has that. But I'm thinking of it as a movie because of high details. Actually, this is direction. When I watch animation, I don't really care who's the director of it. In fact, Until this one I forgot there is one in each animation like in every film. This movie is full of details that make it look much better than other animation. I'll mention some of them, that I found the most interesting.<br><br>1. Near the beginning of the movie, there is a scene with a tunnel exit covered by a waterfall, that flows not quite as one could expect of it. You get an explanation of the irrational flow a couple minutes after, but isn't it amazing they thought about it? 2. Flies around a lamp. When was the last time you saw flies around a lamp (in animation), just as part of the view, because they attracted to light and not to portray something ( like trash site, bad smell, dirt or other metaphoric things that flies represent). 3. While Jay was entering the rebel zone a guard watched him through the optics of a sniper rifle. They could show us only the guard, without the mentioned aspect. But no, this is what a direction is about!!! 4. Jay's fight with the army's commander. Just watch the details.<br><br>I could possibly continue with some more examples,like shooting scenes from different angles and so, though those were the most vivid to me. Think about it. Think about they thought about it. <br><br>In one word the animation was excellent. In some words it was a tasteful mixture, with live colorful characters and places. I don't really think they could do it better. Both the 3 dimensional animation and the 2 dimensional looked awesome. I really don't agree with those who say that the latter was dull and poorly done. As I said, I don't think it could be done better.<br><br>Another aspect of this movie, that stroked me with it's uniqueness, at least from western animation, is the brutality and the naturalism. I don't know much animation (again western), where a gun was violently put against somebody's head, shooting it, and spilling the blood all around. I don't think this kind of violence is good or bad, but in a way it completes the movie. I just get the feeling that it's necessary. This also brings it closer to movies because there is some convention (unspoken) that animation is for younger audience.<br><br>Well, the movie is not all good. Like every other movie, the plot is a crucial thing. Wonderful Day clearly lacks one. It tries to be scientifically ingenious in it's main idea which makes no sense if one thinks about it (you don't really have to think, its obvious enough). There is another thing that bothers. This movie involves a drama among three characters, which at the end gets exaggerated and too emotional ( emotional not for the viewer but for the characters themselves). There are a lot of animated and non-animated movies with that kind of drama in them. Some of them pass this drama to the audience, while others try but fail. Wonderful Days belongs to the latter. It has a good revealing of the drama at the beginning and the middle of the movie, but in the end it disappoints.<br><br>Wonderful Days' flaws are minor compared to its highlights. I would recommend it to anyone who likes animation and is not disturbed with excessive violence. <br><br>My rating: 7.5/10","user":"athena24","rank":[24,30]}]