[{"title":"The message? Don't be late to pick your child up from school","rating":10,"date":"25 April 2005","review":"Yoshimi Matsubara (Hitomi Kuroki) is in the middle of a nasty divorce from her husband, Kunio Hamada (Fumiyo Kohinata). The biggest issue of contention is their daughter, Ikuko (Rio Kanno). Kunio accuses Yoshimi of being unstable, and he seems to have a point. Still, Yoshimi is awarded at least temporary custody of Ikuko. We see her finding an apartment for her and Ikuko to live in. They pick a less-than-ideal apartment, because it is affordable. Soon after, strange occurrences begin. Yoshimi's bedroom ceiling is developing a water stain. Mysterious puddles of water appear in different locations. An unusual item keeps appearing, despite attempts to discard it. Yoshimi periodically sees a strange girl, but only in glimpses. Ikuko begins acting oddly. On top of all this, Yoshimi is trying to go back to work, and she's having trouble balancing that with taking care of Ikuko. Things are spiraling out of control. Are the problems due to Yoshimi's divorce, or is there also something more sinister or supernatural going on? <br><br>Despite Dark Water's relatively overt similarities to a number of other filmic works, this is one of director Hideo Nakata's most successful films--at least as good as his famed Ringu (1998), if not better. I came awfully close to giving Dark Water a 10 out of 10, and can easily see myself raising my score on subsequent viewings. Many facets of the film do not open up until you see them again. For example, when fact checking something about the film shortly before writing this review, I re-watched the beginning; the opening credits are extremely eerie, but the full impact doesn't hit you until after you've seen the film once and more fully realize what you're looking at while watching the first shot.<br><br>The similarities include quite a few thematic resemblances to Ringu, which shouldn't be surprising considering that not only is Nakata the director for both films, they are both based on novels by the man who is often called \"The Japanese Stephen King\", at least in the Japanese press--Koji Suzuki.<br><br>Like Ringu, Dark Water's menace comes in the form of a young, long haired Japanese girl who makes frequent, mysterious appearances. Girls may be the focus because of irony--they're supposed to be cute (as is Kanno, who turns in a great performance along with her more adult fellow cast) and innocent. A girl menace should therefore be that much more unnerving.<br><br>The menace is often accompanied by water. Water was important symbolism in Ringu, too. I would venture a guess that Nakata and/or Suzuki have a fear of water. It might be more impersonal, too. Water is a powerful force, both easily adapting to its surroundings and easily molding them. It permeates much of the world. As such, it's a good visual symbol for kami, which is the Shinto \"essence\" or \"beingness\" that permeates everything, and (among many other things) can be godlike, or the soul of a dead human, or tsumi, a \"pollution\" form of kami which could perhaps be also at least symbolically cleansed by water.<br><br>Another important symbolic commonality shared by both Ringu and Dark Water is that of claustrophobic spaces. These occur in Ringu in forms like the well, closets and crawl spaces. Dark Water has the elevator and a structure for which you'll only realize the importance near the end of the film. Water combined with the elevator also enables Nakata to give a nice nod to Stanley Kubrick's The Shining (1980) in one scene.<br><br>A further similarity to Ringu is that Dark Water is just as concerned with familial problems as it is concerned with horror. In fact, the horror may only be symbolic or may only be a metaphor for familial problems (in the Ringu/Ring films, this is made even more clear in Nakata's latest, American Ring film--The Ring Two, 2005). Both feature a young mother struggling to maintain a normal existence with her only child. In Dark Water, it is particularly easy to see the horror elements as mere metaphors for Yoshimi's psychological decline and the effects it has on her daughter, which echo her own problematic childhood--we learn that her parents were also divorced when she was young, and the opening dramatic scene of the film shows Yoshimi as a child, waiting at school for someone to pick her up. We also hear her comment that her mother was \"bad\".<br><br>This is not to say that Dark Water has no focus on horror. Nakata's well known deliberate pacing is perfect here. The spooky events are subtle but unnerving, and Nakata achieves some amazing build-ups, such as the scene in the elevator near the end of the film, with a particularly frightening reveal. This reveal works as well as it does because Nakata takes so long to get there. He builds tension through stretching out pregnant pauses until the viewer is ready to burst. There are many such scenes throughout the film.<br><br>Dark Water also succeeds because the story is kept relatively simple and straightforward. Unlike typical American films, much of the story is \"told\" through implication. As a viewer, you are frequently left to figure out decisions and events based on seemingly innocuous comments in an antecedent scene followed by relationship and scenario changes in a following scene. In other words, you have to make assumptions about what has happened. That might sound complex, but the aim, which is wonderfully achieved, is actually to simplify the events on screen. Although that famous Asian horror film dream logic is still present in the supernatural events, it doesn't usurp the plot, which continues to gradually hone in on and build up the tension between Yoshimi, her husband, Ikuko, the mystery girl, and the apartment complex. The ending, which comments on all of those elements and the profound ways that they've changed, is particularly uncanny and poignant.","user":"BrandtSponseller","rank":[81,93]},{"title":"One of the best ghost movies ever made","rating":10,"date":"25 March 2003","review":"This is my idea of a horror movie. No junk, no noise, no random jolts, but plenty of fear, delivered quietly and compactly, without fuss. It's the most suspenseful movie I've seen since \"Ring,\" and I think it's even better. Like that movie, it put my stomach in knots to prep them for the chills, which rose up like waves out of calm water. I thought \"Ring\" rather like a Robert Aickman story; this is as near as a movie can come. The director has uncanny skill in knowing where to place the camera and how long to hold a shot. And the leading actress gives a wonderful performance. Her face in the elevator...but that would be giving it away. The conclusion is foreseeable--maybe the ends of all ghost stories are foreseeable--but nonetheless satisfying. If you like tales of quietly disturbing dread, this is one for you.","user":"galensaysyes","rank":[70,83]},{"title":"The Asian horror industry is the new standard.","rating":7,"date":"18 January 2012","review":"The American horror film scene has been getting staler and staler for the better part of two decades. We get the same boring clichés and jump scares packaged under different titles with little originality. That is not to say that there aren't some very good American horror films to be produced since the 1980s but the more Asian horror that I watch the more I see that they have taken up the torch and are producing the best horror movies of the era.<br><br>Dark Water isn't necessarily one of the best Asian horror films to come out but it certainly is a good one. The American remake is really indicative of what is wrong with the industry in North America. The story is the same and many of the scenes are very similar but for some reason, some intangible reason, it is of remarkably lower quality. Even with a very talented actress in the lead role it still doesn't shine like the Japanese original, even though it possesses every required ingredient. It is these intangibles that the Asian horror scene has somehow mastered and the American scene has lost.<br><br>Dark Water itself is a nice little ghost story. It is a slow-burner with an unsettling tale and reveals itself subtlety. The characters are not throw away fodder as in many modern American horror tales and there are some scenes that had me, a hardened horror veteran, wanting to squint my eyes at the television screen. This is not American horror in the sense that everything is not in your face blood, gore, and knife wielding psychos. This is a much more subtle, psychological tale. It will creep under your skin.<br><br>Asian horror is the new standard. I hope that the American industry will learn thing a thing or two from the Asian scene and not just try to emulate it so that perhaps the next generation of filmmakers can bring the torch of horror back to the United States.","user":"TransAtlantyk","rank":[9,9]}]