[{"title":"Unbelievably - does what it says on the packet","rating":7,"date":"18 February 2004","review":"A quick glance at the story or trailer tells you that School of Rock is probably the cheesiest, gratuitous, airhead excuse for a movie in ages, but if you thought that was a good reason to avoid it you'd be wrong. Jack Black plays the slightly past it rocker, stuck in a groove of 70s heavy metal rock and roll and refusing to move on  until his (more up to date) band fire him. Struggling to pay the rent, he takes a phone call intended for his schoolteacher flatmate and accepts a job as supply teacher at a top school. Soon he has the kids not only studying the history of rock and roll, soundproofing the room and playing rock instruments, but actually competing in a major Battle of the Bands' competition.<br><br>Unbelievable? Yes. What's more unbelievable is that somehow the whole thing works  Jack Black's over-the-top enthusiasm for his subject is contagious, the edge-of-disaster suspense is continued throughout the length of the movie, and by the end the audience is so desperate to see how the kids (who they all play their own instruments by the way) perform in the concert that seat wetting would probably go unnoticed. Joan Cusack, as the gobsmacked headmistress, delivers a performance that is worth the price of your cinema ticket in itself. Achieving such tears-down-the cheeks laughter and adrenalin-packed excitement for air guitar music is nothing short of miraculous.<br><br>School of Rock is a movie that promises entertainment and delivers. Everything is as it says on the packet. For sheer feelgood factor, this movie is unbeatable  and you can even take the kids!","user":"Chris_Docker","rank":[153,166]},{"title":"Jumpin' Jack Black, It's a Gas, Gas, Gas","rating":8,"date":"7 October 2003","review":"Greetings again from the darkness.  With so few good comedies these days, it was pure joy to laugh out loud a few times during this Jack Black showcase. Is he over the top? Absolutely.  Is his humor and delivery similar to the great John Belushi?  Yes, down to the arching eyebrows.  And I say SO WHAT? Jack Black is hilarious in this movie and director Richard Linklater (the underappreciated gem \"Dazed and Confused\") uses his spot-on observations of Rock music and school days to deliver a wonderful film going experience. Writer Mike White (\"The Good Girl\") also plays Black's wimpy friend and former bandmate.  Although his acting is fine, it is White's writing that will make him rich in Hollywood.  The kids in the band are wonderfully cast and appear to be very talented musically as well.  Special recognition to Joan Cusack, who just nails the role of the uptight private school principal who is just itching to be unleashed.  I would have enjoyed a bit more of the Rock History tossed in for the sake of today's youngsters, but the tributes to Pete Townsend, Jimi Hendrix, Zeppelin and the Ramones are much appreciated.  Look for Nikki Katt in a brief role, but mostly just sit back and enjoy a pure comedy that truly ROCKS!!","user":"ferguson-6","rank":[73,80]},{"title":"Jack Black is Back! Better than Ever!","rating":10,"date":"18 December 2004","review":"Finally! Somebody has done right by Jack Black. Somebody has actually made a movie where Jack Black can be the man and show off his talents. This is Jack Black at his best and I feel privileged to be alive while this guy's star continues to skyrocket! <br><br>Dewey Finn (Jack Black) loves rock and roll. He is the consummate fan who knows every worthwhile group and song. He is a singer, songwriter, and guitarist in his own band called \"No Vacancy.\" But other members of the group have grown tired of his immature stage antics, such as 20-minute solos and stage-dives. They vote him out and hire someone to replace him for an upcoming Battle of the Bands contest.<br><br>Downcast and distraught, Dewey doesn't know what to do. Plus, his usually patient roommate Ned (Mike White), a schoolteacher, is being pressured by his aggressive girlfriend (Sarah Silverman) to make Dewey pay the money he owes for rent or get out. When a call comes in to Ned asking him to serve as a substitute teacher at the prestigious Horace Green Elementary School, Dewey decides to assume his identity and take the job.<br><br>Of course, faced with a class of fifth-graders all nicely clothed in their school uniforms, this rocker doesn't have a clue as to what to do. So he tells them to chill out and enjoy some downtime. This scheme works for a little while but then Dewey visits the orchestra class. Lights go off in his head and bingo! -- the new class project is to form a rock band. He decides to teach them everything he knows about rock with lectures on its history, the evils of \"The Man,\" and the essentials of playing rock songs.<br><br>Dewey's spirits are lifted when he realizes that there are some talented musicians in the class including Zack (Joey Gaydos, Jr.), the lead guitarist; Katie (Rebecca Brown) on bass; and Lawrence (Robert Tsai) on keyboards. Freddy (Kevin Clark), the class rebel, turns out to be an eager learner on drums, and Tomika (Maryam Hassan) surprises him with her unusual singing talent. The smartest girl in the class, Summer (Miranda Cosgrove), gets her chance to excel as band manager while others serve as back-up singers, special effects wizard, head of security, and the official selectors of the band's name.<br><br>The humor quotient of the film is heightened by the funny performance of Joan Cusack as the uptight and unlocked principal of Horace Green Elementary School. When Dewey discovers that she is a secret fan of Fleetwood Mac, they are able to connect as friends. The rock fan gets his wish when he has the class entered in the local Battle of the Bands. By the end of this rollicking film, you'll happily be chanting, \"For those about to rock, we salute you!\"<br><br>Overall: 9/10","user":"babiedol12","rank":[182,212]}]