[{"title":"Very good","rating":10,"date":"5 December 2004","review":"I've been hearing lots of negativity about this movie. I think a lot of people have been shocked, frankly, by the raw and rough nature of the film. Having read the play, I've been looking forward to it for about a year now, and it's honestly one of the best plays I've ever read. Mike Nichols presents it in an amazing way, very faithful to the words as they're written (and they should be, for the movie is also written by the man who wrote the play, the brilliant Patrick Marber). <br><br>It's a brutal topic, sex and love, especially when they're combined. I thought the movie was amazing. It captured all of the vulnerability, caustic harshness, and acerbic flirtation that the play vibrated with. All of the cast brought the movie alive. It uplifts and then brings you way down, but that's the point, and yet at the end, I didn't feel depressed or saddened, just really really awake and curious. It's the feeling you get when you get \"closer\", I suppose. <br><br>Natalie Portman, in a tour-de-force performance, is the standout by far. Maybe it's because she's the youngest, and not expected to be that awesome, but she is. Anyways, her Alice is flirty and sweet, caustic and manipulative, evasive and yet very open, sexual and gloomy all in one character. She has the best chemistry with the men - whether it be purely sensual with Clive Owen, or innocence and affection with Jude Law. She comes alive with the two guys, and their scenes are ones to look forward to.<br><br>Julia Roberts, whom everyone looks towards, is not bad in this film. She's very understated and good, but she is outshone in nearly every scene by whomever she's acting with. <br><br>Clive Owen is absolutely astounding, and he's definitely on everyone's radar screen. As the man of experience and \"simplicity\", as Jude Law's character comments, he's brash and hotheaded, but also extremely clever. Owen perfectly plays the sleazy, unlikeable character, but somehow manages to appeal to the audience and even though he's a disagreeable character, I think many managed to find something all right about him - Owen's human sense in Larry. <br><br>Jude Law is simply very very good; neither astounding nor bad. The only reason he does not stand out is the fact that we've all expected him to do a good performance. And he does, he has a great performance. He and Portman have amazing scenes together, and he's always on par.<br><br>Simply put, the movie is not for everyone (especially not for seeing with a parent or young child); it's a mature adult flick, and does not back down from anything. It's high drama - with all the uplifting romance and brutal arguments of relationships. It's a story about people.","user":"ShannonAmidala","rank":[650,864]},{"title":"It's all about questioning surfaces","rating":6,"date":"6 December 2004","review":"Closer: A<br><br>Mike Nichols delivers his best work yet. CLOSER is a well crafted dissertation on art's reflection of the human condition, particularly the dependence on romantic relationships. It delivers an intimate film that actually achieves depths rarely seen on screen. Kubrick's Eye's Wide Shut only scratched the surface of literal naked lies that represent sexual game-playing on screen. His work came off as a freshman treatise on relationships in a pervy, self-obsessed way. Nichols and screenwriter Patrick Marber deliver a full and rich study on the difficulties of love and sexual tension. Without ever showing a sex scene on screen they are able to portray the nasty nature of jealously, lust and obsession without actually exploiting these acts as Kubrick and countless others have done. The result is a pure _expression of the realization that we don't know anything when it comes to assessing truth in character. <br><br>Alice (Natalie Portman), a former stripper, is hit by a car in London as she forgets to look right. Dan (Jude Law) comes to her rescue and guides her to the hospital before guiding her into his life. Dan writes obituaries but soon finds a novel in himself thanks to Alice. While shooting the photo for his book he falls for the photographer Anna (Julie Roberts) who pulls back from him given that he's with Alice. For light-style revenge Dan sets up Larry (Clive Owen) in an Internet sex chat room to meet Anna thinking this will embarrass him and her. Cupid backfires thus throwing Larry and Anna into a relationship of their own. First impressions, like all art, can only show you broad strokes of character like stereotypes and lies. Alice is presented as a young girl in need of saving, literally. Anna is a strong, independent artist who seems smart in her career and choices. Dan is a struggling, sensitive writer in search of a muse, someone to inspire and rescue. Larry is a sex obsessed dermatologist and self-described caveman. By the end of the film, however, the audience will get a deeper and more profound view of all four characters and realize we just don't know them as well as we think. <br><br>Acknowledging that film can be art, the screenwriter is skilled with dialog that reflects the illusionary quality that is art. Every piece of conversation, every word has meaning, reflection and sometimes foreboding for what is to come and the gaps in story and exposition brilliantly leads the audience to fill in those elements with their own interpretations. It is those interpretations and broad-stroke impressions that the film is there to question. Alice, in the scene at Anna's photo exhibit, discusses this very concept to Larry when discussing her reaction to the photos and the show. The function is just a big lie, the glossy photos of people's faces don't' show the real person, the fancy people at the party only reflect that same quality. Everything is for surface show - one-dimensional illusions of character. Alice, Anna, Dan and Larry are those photos just in moving form but that makes all the difference. The movement and editing of the film allows us to jump through months and years of their relationships to unpeel parts of the illusion of character and stereotypes. We can explore wrong assumptions about characters and that should make us explore the real-world difficulties of knowing people, really knowing them and not just their image or attitude. Many will just see this film as a sad story of four wounded people making bad relationship choices. This is really sad because this film is truly a great wake-up call to humanity to embrace a new approach and attitude about art and people. Strength can be a weakness. Vulnerability can be empowering. Dependence can be comforting. Nothing can be valued or viewed without bias and prejudice. Great art, like this film, can sometimes achieve a new way to show us how wrong we can be when we let our bias prevent us from just experiencing life and being open to shifts in perception. So take a closer look, at this film and the life around you. You just might find happiness in walking away from the expected.","user":"peffs","rank":[161,206]},{"title":"Flawed and cold, but sharp and haunting.","rating":8,"date":"30 January 2005","review":"I've seen Closer described as a cinematic triumph, but it's precisely not. The film wears its theatrical origins on its sleeve, and the presence of the camera is mostly irrelevant.<br><br>It also fails in a more subtle way. Initially, I watched four apparently amoral people, devoid of depth or shame, being clever at each other in increasingly hurtful and exploitative ways, and my mind rebelled. This can't be right, I thought, people don't talk like this. Hell, people don't *act* like this.<br><br>Then the light dawned. The characters seemed inhuman because they are. They aren't people at all, they're philosophical positions. When they talk, they're not talking. They're saying the things that people only dare think, asking the questions that haunt anyone whose relationship has gone horrifically pear-shaped. This isn't the story of four people and four relationships, it's an attempt to compress everything the author believes about human relationships into a film and bend it into a story. It feels artificial because it is.<br><br>With that realisation, I actually began to enjoy it, because Closer is a very clever film. I wish I could disagree with more of it, because many of the things it has to say about human relationships are painfully true. Every mistake you've ever made in a relationship is in here, and it's guaranteed to make you squirm at least once. It's also blackly funny in many places.<br><br>Without exception, the performances are fantastic, with the honours going to Natalie Portman's emotionally scarred escapist who wears lies like they were armour, and Clive Owen's brutal, perceptive, and ultimately absolutely human dirty doctor.<br><br>Be warned! The marketing campaign may lead you to think it's a comforting rom-com, but it's not. I wouldn't advise going with your partner unless you're rock-solid. You may leave asking some uncomfortable questions, and wondering how well you really know them...","user":"OverAnalysisBoy","rank":[39,50]}]