[{"title":"Interesting and mysterious, but somewhat problematic","rating":6,"date":"14 December 2010","review":"Cargo is dazzling, mystifying, sometimes scary, and is able to manipulate a rather familiar plot to seem less familiar. That last one however, is just as much a weakness as it is a strength. The film's problems are not on the screen, but on the pages.<br><br>Cargo contains a weighty story line, with questionable focus and a lack of coherency. There are also places where the movie feels draggy and repetitive. Characterization gets off the ground but not quite to the degree of emotion that was probably intended.<br><br>Anyone who sees Cargo is gonna wish they had seen it in theatres. Its greatest achievement is photography. I liked Cargo for its mystique and stylistic choices, but the writing and construction need a tune up. Its facade is perfect but its soul is murky, and its story is disoriented which does not allow us to appreciate Cargo to the full.","user":"Samiam3","rank":[94,120]},{"title":"A really nice indie movie!","rating":8,"date":"27 March 2010","review":"First of all I'm a bit curious about the low rating of the movie here (6,4). This is a great movie raising all sorts of questions to the viewer. Which is what a good movie is supposed to do. Identity, sense of belonging, isolation, and the essence of the human nature are just some of the things the movie touches on. Yeah there are plot points that have been explored before in other movies but seriously who cares? It's how you portray those situations and plot. So I wasn't disappointed there. In fact I wasn't disappointed at all!! A brilliant film that will speak to the audience that loved, \"moon\".<br><br>Congrats to all the people involved in this movie. Hope someday it'll be released on Bluray.","user":"dkatsafouros","rank":[116,162]},{"title":"Spectacular  powerful  beautiful  terrifying","rating":9,"date":"8 December 2010","review":"I'm so glad that I overlooked some of the poor responses posted about this film and rented it. <br><br>I found it absolutely riveting - and beautiful.<br><br>The first few minutes recall aspects of the BladeRunner modern cityscape - but on steroids, with the aid of modern day visual effects. The plot is interesting and unfolds nicely keeping your interest and attention. No big stars, no truly stellar performances, but the story line is solid and I was so taken in by it, that I'm going to watch it again tonight, with someone else who's not yet seen it. Some mesmerizing visuals and scenarios. The lighting is particularly strong, creating great ambiance and dramatic effect, without drawing too much attention to itself. This movie is about human frailty, various emotions and connections, about the work we do in order to follow our dreams. It also relates feelings of being small, powerless, and becoming disconnected because of technology - assessing trust in others and in the systems which dominate our lives, searching for 'truth' and authentic experiences...<br><br>A very unconventional melding of ideas which for me, worked on many different layers.<br><br>Highly worth a trip for any Sci-Fi lover.","user":"shootingangles","rank":[53,71]}]