[{"title":"Is it a signal of peace or actually a rescue beacon?","rating":7,"date":"19 July 2003","review":"This is an exceptional Sci-Fi Network Production. Decent F/X and a story line that is not too far fetched to enjoy. A team of government scientists conducting botanical experiments at the South Pole stumble upon what is believed to be an extraterrestrial black box. After further examination and disregard for a decoded warning an alien tries to communicate. A terrific finale out of the ordinary. James Spader leads an apt cast that features:Leslie Stefanson, Janine Eser, Roy Dotrice, John Lynch and Keir Dullea. A don't miss for Sci-Fi fans.","user":"michaelRokeefe","rank":[18,19]},{"title":"Pretty Good Science Fiction","rating":8,"date":"14 January 2006","review":"I thoroughly enjoyed \"Alien Hunter\". I didn't ponder whether it was drawing upon other films, or harshly criticize the actors. I simply enjoyed the plot and people and the entertainment it provided. I thought the cast all did a fine job. It's pretty good science fiction! I do wish the producers had found a more meaningful name for it.<br><br>The premise of the film had an element of originality that made it gripping and entertaining. The finale was a complete surprise to me. I had envisioned quite another resolution. <br><br>The director sets an overall somber, brooding tone with the consistently drab surroundings of the Antarctic lab. The plot develops well, and holds interest. There were very few slow spots, and those could have been my own perception. I liked the characters, and flowed right along with them. I would recommend this film to any science fiction fan. The beautiful girl in the white bikini, wading into a cornfield in an Antarctic lab, was irresistible. Just the right touch. <br><br>The film is thoughtful and poignant, with elements of intellectual science fiction that made viewing it fascinating for me. Its the kind of film that one can just lean back with, and imagine being right there with the cast, living it all with them.","user":"teuthis","rank":[35,44]},{"title":"Better than average.","rating":8,"date":"2 October 2004","review":"Reading over the reviews for this film, I see that pretty much everyone agrees that while it's not an A+ Top Notch effort, it certainly isn't as bad as it could have been.<br><br>What's good about it:<br><br>1) James Spader (!), who's incredible in everything he's in. 2) Pretty good Visual Effects. 3) Nice Musical Score.<br><br>What's average: <br><br>1) The other performances. 2) The story (as many have pointed out, it's a mosaic of other movies).<br><br>What's monumental: <br><br>You will never see another movie in which the end credits has as many crew members with last names ending with the letter \"v.\"<br><br>What's unforgivable: <br><br>The title! \"Alien Hunter\" is an absolutely terrible name. Surely they could have come up with something a little more enticing. It sounds like a reject Jean-Claude film title.<br><br>I'm still amazed that they were able to cast James Spader in this. I mean, JAMES SPADER!!! :)<br><br>Bored? Nothing else to watch or rent? Give this movie a try.","user":"atrac","rank":[42,54]}]