[{"title":"One of the better entries in the series","rating":8,"date":"11 February 2005","review":"The Tremors series seemed to run out of ideas on the second installment, so the idea that we are sitting around discussing a fourth is quite absurd, to say the least. Nonetheless, the fourth in the series may well be the best aside from the original, which is one of the most surprising things I've ever seen myself type. Perhaps the big secret here is that the series has never taken itself too seriously, which is certainly a plus in comparison to other series, where the sequels never seem to realise how bereft of ideas they are.<br><br>Tremors 4 takes a completely different tack to its three predecessors and sets itself a couple of hundred years in the past. Before the town of Perfection became Perfection, it was known as Rejection (ha ha). Burt Gummer's great-granddaddy, Hiram, was a wimp who held guns in much the same manner that many of us hold dead fish. Contrary to the impressions of the other films, Rejection was a silver town with a mine owned by the aforementioned Hiram. It seems that when the miners stop work due to fear of being eaten, it eats into profits, and Hiram comes out to see what is scaring away the workers.<br><br>As with the last three films, the cast is strictly low-rent, with Michael Gross and Billy Drago forming the most recognisable portion of the cast. Indeed, Gross seems to be so comfortable in the role of the Gummers that he barely seems able to portray anything else. Or rather, he doesn't seem to just portray the character. For all intents and purposes, he is the character. Which is certainly a great change from his days in Family Ties as the head of one of those saccharine families that only seem to exist on daytime or early afternoon television. It is just as well they placed the burden of the acting upon the shoulders of a veteran like Gross, as the rest of the cast seems lost.<br><br>Tremors 4 also seems to return to the style of the original when it comes to revealing the worms. Instead of having them constantly attacking the populace through CGI simulation, much of their interaction with the human cast returns to the practical effects and trick photography of the original. The one shot in the film I noticed that was obviously CGI only helps to demonstrate that simple off-screen levers or cables still have a lot of usefulness left in them. The one problem I have with the films to date is that none of the DVD-Videos have been offered with a featurette that explains how these practical effect shots were achieved.<br><br>Tremors 4 also marks the first time we get to see anything of the oft-referenced Carson City. The city doesn't appear at all special, but that's fine. Just inserting a view of the place is enough. Among Tremors 4's weaknesses, on the other hand, are attempts to build up suspense with danger to Hiram Gummer. As if the existence of Burt didn't already make the resolution of such scenes clear. Another problem is the constant debates about the next step in the residents' plans against the worms. The recitations of homilies start to get rather stilted after a while. There is also a bit too much repetition of the noisemaking technique. To the credit of the writers, they do manage to insert a few of the guerrilla-style battle moves that made the first and third episodes so amusing. Thankfully, the idea that Hiram Gummer could fight these creatures and Burt not have any idea what they were is sort of half-explained towards the end.<br><br>In all, I gave Tremors 4 an eight out of ten. It isn't nearly as good as the original, but it is a massive improvement upon the other two. Here's to hoping that they manage to keep as many good ideas in a fifth or sixth, although I personally would pay good money to see a film set a hundred years from now with Perfection as a thriving city that is hit by the worms. Yes, that was a hint.","user":"mentalcritic","rank":[34,39]},{"title":"Fun and not half bad","rating":7,"date":"8 May 2005","review":"The original Tremors was a classic and a well put together big budget Sci Fi movie. The follow ups have all been more low budget and released only on video, but have actually been OK. I mean, you can't possibly take them seriously, but they're a lot of fun and the characters wind up being pretty memorable. Tremors 4 manages to continue the follow ups while maintaining originality. This alone is an accomplishment, since many sequels end up being repetitive and boorish. Tremors 4 doesn't have this problem.<br><br>Instead, Tremors 4 is a prequel set in 1889. Perfection is a new town called Rejection and is populated by miners....until they start getting eaten. Most of the remaining townsfolk leave. The only ones that stay behind are an Indian, the Chang family, a Mexican guy, and an unmarried red headed woman. Sound familiar? The townsfolk send for a man to asses the mine, which turns out to be Burt Gummer's great-great granddad: Hiram Gummer. Hiram is a proper eastern dude who has never touched a gun and is completely unprepared. He doesn't want any business with the \"dirt dragons\". However, he gets swept up with the situation and decides to stay and fight the worms. He enlists the help of a famous gunslinger and together the motley crew of 8 battle the monsters. A big subplot in the movie involves the revelation of how the Gummer family became obsessed with guns, bombs, and preperation. Although, like all Tremors movies, its inherently a little bit silly and hard to take seriously, the movie is laced with nostalgic humor and for a #4 continuation, it's pretty well done and should satisfy most any fan.","user":"leadpoisonaod","rank":[28,33]},{"title":"I've seen worse $200+ million epics!","rating":9,"date":"9 April 2005","review":"If you're looking for entertainment..no more, no less - this little gem delivers! By far the best sequel (arguable order of merit for the series would be 1,4, 2 and 3) this is Michael Gross's film in totality. He has made the franchise his own and comes full circle playing his own Great Grandfather. It is a measured and emotional performance. As mine-owner Hiram Gummer he comes to Rejection\" (as the backwoods township was known) to find out what has been killing the miners. What he discovers is completely outside his somewhat wimpy comfort-zone.<br><br>Very much a return to the original in terms of characters...and even special effects which rely thankfully here, far less on laughable CGI. What might be seen as scaled-down excitement is more than compensated for with absolutely knock-out performances - Drago and Gross especially.<br><br>All four films have an easy-on-the-eye laid back feel, principally because the production teams has remained intact throughout. Four excellent movies without sex, gratuitous violence and a solitary screen cussing in fifteen years. Not that Gross looks any older now than he did in 1989/1990.<br><br>Very faithful to the earlier films and fully explanatory of how it all came about. Mention should also be made of Jay Ferguson's great musical score - the best of the four films.<br><br>Best scripted, photographed and acted straight-to-video film I have yet seen and certainly was deserving of a theatrical release.","user":"uds3","rank":[37,45]}]