[{"title":"Brutally Beautiful","rating":9,"date":"18 November 2003","review":"The storyline is predictable, but the visual and the fights makes up for it. I understand why people compare the lead actor with Jet Li. They both have that presence on screen, the amazing flexibility and fighting sequences. Outstanding acrobatic movements when running from the bad guys in the street and it was good to see the shots from different angles.<br><br>\nIt reminds me of some Jet Li's better fighting sequences before he took to the wires. This is the kind of martial arts film that makes me smile and cheer. <br><br>If you like martial arts films, then you'll sure to like this.","user":"kamwingp","rank":[163,188]},{"title":"Wow, someone totally missed the point","rating":8,"date":"8 December 2004","review":"Saying that Ong Bak was a bad movie because of the weak story is like saying that the Simpsons is a bad series because of the lack of continuity from show to show.<br><br>YOU'RE MISSING THE POINT! The story is only there to loosely tie together the fact that this guy is being a badass. Which he is. There were only a FEW fight scenes? What are you talking about? There were so many fight scenes and chase scenes and the like. Every time you thought you saw the coolest thing ever, he breaks out another move that STILL totally blows you away. The only reason that this movie exists is simply to showcase Phanom Yeerum's skills as a martial artist and an acrobat, which frankly, is enough for me.<br><br>*sigh* If you care so much about story, steer clear. If you have any interest whatsoever is the GENRE of martial arts movies (where the quality of the story is usually not the primary concern), watch this movie. You won't be sorry.","user":"mastercko","rank":[376,462]},{"title":"Entertaining","rating":29,"date":"29 October 2004","review":"I saw Ong-Bak for the first time on the Stockholm Film Festival in November of 2003, and now recently saw it again on DVD. I usually see at least 4-5 Asian films on the festival every year and each one is a gamble. At worst Asian action films can be unbearably slow and dull with uninteresting action scenes and horrible acting. At their best they can be like a wonderful ballet with astonishing moves and moods. Ong-Bak falls somewhere inbetween these two.<br><br>The story and set-up in Ong-Bak is nothing very original. The head of the village Buddha-statue (named Ong-Bak) is stolen which spells bad luck for the village. So they send their best man to the city to find the son who moved away, and they can search for the head together. Of course the villager is completely lost in the city and soon gets himself into trouble.<br><br>So the story is nothing new, neither is the setup which is more or less van Damme standard fare movies like \"Lionheart\" except in Thailand. We see some street-fighting and some tournament-style fighting in seedy bars. So, what makes Ong-Bak stand out? Well, the fighting! I have seldom seen such well-made fighting scenes. Both well choreographed and plentiful! The thai-boxing done here might be very stylized to look good, but it really does the trick. The fights are simply put amazing! The lead actor really knows his moves and his acrobatics, and many times you can really feel the crushing hits as kicks and elbows hit home. Also the pace is very high with almost constant fighting in the last half of the movie. And it all looks very very nice.<br><br>So, Ong-Bak is definitely for those of you who are suckers for martial-arts and fighting. Don't expect an original story or terribly solid acting. But expect a fun ride, lots and lots of violence. And for me that's enough. Ong-Bak receives a 7/10.","user":"Antagonisten","rank":[81,100]}]