[{"title":"Eerily beautiful, never obvious","rating":8,"date":"2 April 2005","review":"\"The Embalmer\" (which is what the title translates as) is, in a sentence, about Peppino, a middle-aged Neapolitan taxidermist of stunted growth (verging on dwarfhood) who employs a good-looking young assistant he soon becomes obsessed with. Furthermore, Peppino has Camorra connections (the Camorra is Naples's equivalent of the Sicilian Mafia) and is employed by the Neapolitan mobsters to sew drugs in and out of their excellent cadavers. With its superb cinematography, photography, soundtrack and imagery (some of the scenes featuring dead, stuffed animals in the lab are unforgettably eerie), the film will be appreciated by anyone who loves a well-scripted, steady but confidently-paced, subtle little thriller that's never a crowd-pleaser.<br><br>The sense of impending danger is always very strong and real in the viewer's mind, though it never really lashes into sensationalist, gratuitous violence. In fact there's next to no violence or blood in this film and not one single Tarantinesque, gun-waving shouting match between mobsters scene: in fact you hardly ever see a gun in the film. In L'Imbalsamatore, anger IMPLODES and is the stronger and more threatening for it, and the human element is far more prominent than the formal crime element. Though obviously, its organised crime subplot (which you only ever glance at sideways) is pivotal in heightening the sense of threat in the film. But it never crowds the film, which simply isn't ABOUT organised crime. L'Imbalsamatore boasts a psychologically credible theme of obsessive love and attraction which would make Fatal Attraction look hollow and fake. It's also never distasteful and never, ever makes cheap use of the main character's semi-disability as a shock element. Also, unlike the crass Michael Douglas movie, L'Imbalsamatore's obsessive lover is vulnerable and human, as only someone who constantly holds his bleeding heart in his hand can be. But when said obsessive lover starts resenting that the object of his adoration has had the emotional upper hand for too long, things can get REALLY scary. This is especially true when the spurned lover, any spurned lover has major Camorra connections, and the chestful of treasures he's been so selflessly offering his beloved is being dismissively waved away for the umpteenth time! You really get a sense of all the characters playing with fire in L'Imbalsamatore, which is why it succeeds in creating a sense of suspense which just never lets up (and yet never climaxing when you expect it to). <br><br>The film is also invested with genuine humanity and is never judgemental or moralistic. It moves us to sympathy towards the obsessive and love-lorn character, who despite his physical appearance and potentially lethal reactions, is invested with true pathos and dignity. His tears are bitter and no different from those of any other lover, no matter how good, handsome or psychologically healthy. And that's precisely why he's so scary. <br><br>Please watch l'Imbalsamatore: it really deserves more international acclaim.","user":"Asa_Nisi_Masa2","rank":[25,27]},{"title":"Under the skin","rating":8,"date":"21 March 2005","review":"Definitely not a movie for everyone. I looked for this movie immediately after seeing the most recent Garrone feature, Primo Amore (First Love) currently in the Festival circuit.<br><br>The structure of the movies is non surprisingly very similar: a love story that transcends understanding and plays with common notions of relationship and sexuality, eventually trespassing into obsession. Again Garrone starts from a true story, but tries to make something universal, abstracting it from time (no modern technology) and space. The geography of the action is clear (well, at least to Italian) but the beautiful photography transforms the landscape into chiaroscuro paintings of foggy uncertainty. Ernesto Mahieux is the perfect choice for the central character-- a strong although somewhat physically stunted, madly in love protagonist.<br><br>This is one movie that is difficult to classify: it's not a thriller, and very few will consider this a love story, although it borrows elements from both genres to construct something unique that gets under the skin of the spectator. Think Fellini and Lynch, but without the gratuitous weirdness. A little gem, for the few who will get it.","user":"PAolo-10","rank":[17,19]},{"title":"The taxidermist","rating":7,"date":"19 June 2006","review":"Peppino, the taxidermist at the center of this story, is a man who nature has not endowed with many physical attributes. He is a short homely man, who might repel many people. Yet, what he lacks in stature, and good looks, he compensates with a larger than life personality.<br><br>When he first spots the handsome Valerio, he decides he wants to see more of him. Valerio, who is working as a cook, is offered a job by Peppino, even though he is not experienced in that line of work. What he doesn't realize is that Peppino, in addition of stuffing animals is also an expert in stuffing dead bodies with drugs. He works closely with the local mafia boss.<br><br>Valerio and Peppino develop an easy relationship, but the younger man doesn't have a clue about the little man's affection for him. Peppino, who knows he can't force himself on Valerio, gathers prostitutes to go to bed with the two of them because that is the only way he can be with Valerio without coming out to him.<br><br>When Valerio meets Deborah, the dynamics between the two friends change; Peppino senses it, but he can't do anything to separate them. Deborah, who becomes pregnant, proposes to go home to Cremona and Valerio accepts. Their lives appear to be getting in the right track until one day Peppino appears at her parents' home. It's clear by now that Valerio must make a decision that will change his life forever.<br><br>Director Matteo Garrone, who also contributed to the screen play, shows he knows how to deal with this sordid situation with great taste and he is never in the viewer's face. By presenting the main character as physical handicapped and the object of his desires as a handsome young man, Mr. Matteo achieved a coup because of the possibilities in the strange relationship, aggravated by a third party, in this case, by Deborah.<br><br>The best thing in the film is Ernesto Mahieux, who as Peppino gives one of the best performances in an Italian film in recent memory. His Peppino is a complicated man who is trapped in a body that no one wants. Yet, his need for love is something no one can satisfy. Valerio Foglia Manzillo is awkward as the handsome man he is portraying. In part, the character, the way Mr. Foglia Manzillo played it, makes sense because Valerio's loyalties play a trick on him. Elizabetta Rocchetti appears as Deborah, the woman who is able to get Valerio away from what she senses is a threat to her own happiness.<br><br>\"The Taxidermist\", is a great collaboration between its director, Mr. Garrone, and his star, the larger than life, Ernesto Mahieux.","user":"jotix100","rank":[8,9]}]