[{"title":"Morris Versus McNamara and the Political Pundits of the Left","rating":2,"date":"2 February 2004","review":"If you're like Errol Morris, and you want to make documentaries about unusual personalities, it's one thing to choose obscure subjects, people like Fred Leuchter (aka \"Mr. Death\") or men that excel in topiary hedge sculpture or the study of the African mole rat (two of the people interviewed in \"Fast, Cheap and Out of Control\"). Not many critics out there will be waiting to pounce if you don't get things just right about the likes of people like these.  But it's quite another matter if you choose Robert S. McNamara, one of the last century's most towering, controversial, and - some would say - evil characters.  \"Fog of War\" distills more than 20 hours of interviews that Morris conducted with McNamara over a span of two years, when McNamara was in his mid-80s, and the subjects - all various McNamara ventures - range from \"his\" World War II, through his days at Ford Motor Company, the Cuban missile crisis, and - finally and mainly - his views of the Vietnam War.<br><br>As a result, Morris now finds himself in a no man's land of critical crossfire.  On the one hand, film critics - people like Steven Holden, Roger Ebert and J. Hoberman - uniformly praise this work.  While political pundits of the left - people like Eric Alterman and Alexander Cockburn of \"The Nation\" - lacerate Morris, accusing him of being overmatched, manipulated, not doing his homework (i.e., being naïve and unprepared), and thus allowing his film to be nothing but a conduit for the formidably crafty McNamara's continuing campaign of self aggrandizement and distortions of history. Whew.  I think the controversy here is based on a misconstruction of the film's purposes by the pundits.  First, it is quite clear that McNamara, in full command of his fierce intellectual and interpersonal powers, is not about to be pushed around by an assertive interviewer.  McNamara is gonna say what McNamara wants to say, period.  To drive home this point, Morris gives us a brief epilogue in which he asks McNamara a few trenchant questions about his sense of responsibility for the Vietnam War, why he didn't speak out against the war, and so on.  And McNamara won't bite.  He stonewalls Morris absolutely, with comments like, \"I am not going to say any more than I have.\"  Or, \"I always get into trouble when I try to answer a question like that.\"<br><br>More importantly, it doesn't matter very much if Morris or McNamara does not get all the facts straight.  If the political pundits went to the movies more often, at least to Morris's films, they would know that his primary interest is in the character of his subjects - their integrity and beliefs and ways of explaining or rationalizing themselves and their lives: he's into people way more than into facts. \"Fog of War\" is not an oral history, it is the study of a person.  For all that, in my estimation, Morris does get on film as close to an acceptance of responsibility for his actions in two wars as McNamara is likely ever to make, short of some dramatic, delirium-driven deathbed confession.  He speaks of the likelihood that he and Curtis LeMay would have been deemed war criminals for the fire bombing of Japanese cities, had our side lost.  And he speaks clearly when he says \"we were wrong\" in not seeing that the Vietnam War was a civil war, not a phase of some larger Cold War strategy by the USSR or China.  What do the pundits want?<br><br>Nor was it Morris's purpose to use Santayana's lesson about repeating history to rail at Bush's preemptive war in Iraq.  In fact Morris decided to make this film way back in 1995, after reading several books by McNamara and concluding that he was a quintessential man of the 20th Century, embodying all that was so outstandingly smart and sophisticated and ultimately destructive.  The interviews wrapped sometime in 2001, the year before Iraq. As usual in Morris's films, the editing is superb, with seamless use of archival footage and special visuals created for this film.  I do think Morris gratuitously flattered McNamara by organizing the film around 11 platitudes of his - many of them banal aphorisms known to most high school graduates, students of martial arts, or your grandmother (e.g., \"get the data,\"  \"empathize with your enemy,\"  \"rationality will not save us,\" \"belief and seeing are both often wrong\").<br><br>Political pundits, mired in interpreting concretisms from the historical record, not only see too few films but also don't take seriously the symbolic visuals and sounds offered here.  Philip Glass has created an edgy, anxious score that feels just right, just creepy enough for the macabre subjects at hand.   I'm also thinking of the scenes when McNamara is recounting his pioneering (he claims) studies of auto safety.  As we listen to him, Morris shows us human skulls wrapped in white linen being dropped several floors through a stairwell to smash upon the floor below, all in slow motion.  The effect is chilling and speaks volumes about McNamara's famed passionless capacity to treat human carnage as a matter of statistical calculation.  It is through such poetic characterization that Morris keeps the game with McNamara in balance.","user":"thecineman","rank":[140,145]},{"title":"Still Confident and Brilliant, Still Seeking to Hold the Moral High Ground","rating":10,"date":"20 December 2003","review":"My first encounter with Secretary of Defense Robert S. McNamara was in the late spring of 1966 when, as a young Army Intelligence officer just rotated back from Asia, I was assigned to the General Staff in the Pentagon and directed to brief him.  The first of a number of occasions when I either briefed the secretary or, more often, was a resource aide to a senior officer, I was cautioned by a nervous lieutenant colonel to expect questions but never, absolutely never, to ground my response in \"intuition.\"  It was the pre-Powerpoint age but all briefers were admonished to either have facts best supported by charts and numbers or to simply confess ignorance.<br><br>I acquitted myself reasonably well and there followed almost a year and a half of observing the nation's highest defense officials and generals in the superheated pressure cooker atmosphere of what we called the \"Puzzle Palace.\"<br><br>Gifted documentarian Errol Morris's \"Fog of War: Eleven Lessons from the Life of Robert S. McNamara\" is a vital and presciently timely examination of a past that can repeat itself with incalculable harm to the United States. Interpolating documentary film clips from World War II through Vietnam with excerpts from an extensive interview with McNamara, the camera always focused on the alert, articulate and still (controllingly) brilliant eighty-six year old former secretary, Morris quickly takes viewers through his early life getting quickly to World War II.  Then as an officer specializing in systems analysis he became  a significant analyst whose studies supported the carpet bombing of Japan.  His comments about General Curtis \"Bombs Away with Curt LeMay\" LeMay reflect his transition from wartime admiration for a superb combat leader to distrust of a four-star Air Force chief of staff champing at the opportunity to use nuclear weapons while we still had a commanding edge in what came to be called Mutual Assured Destruction.<br><br>Interesting and important as McNamara's early war activities were, the crux of his life and the undying source of charge, defense and recrimination is his stewardship of the Defense Department during the early and mid years of the Vietnam conflict.<br><br>Where Michael Moore wears his views on his sleeve and on the screen through entertaining ridicule and now predictable pillorying of his subjects, Morris wisely and effectively lets McNamara tell his story, prompted by an off-screen inquisitor whose tone is neither hostile nor friendly.  The evidence  supports McNamara's claim that he sought disengagement during the Kennedy years and he repeats the unprovable belief that J.F.K. would never have permitted the escalation that followed his death (McNamara's account of being Kennedy's right-hand cabinet man during the Cuban Missile Crisis can only leave viewers dry-mouthed as the implications of the Cold War cat-and-missile game clearly emerge as truly bringing the specter of nuclear conflagration to near reality).<br><br>McNamara frames his eleven life lessons, none startling new advances in philosophical thought. He joins many scholars and advocates of binding international law, the majority of whom have never heard a shot fired, in arguing for the concept of proportionality in the exercise of force.  He never seems to realize that contemporary armed conflict is very different, politically and militarily, from his wars.<br><br>While stating sorrow for what war has wrought, and recognizing his own role, he never apologizes and credibly advances his message for the future through the technique of universalizing:  mankind has a problem with violence.  I was doing the best I could.<br><br>Tapes of conversations with President Johnson, who eventually fired him with such subtlety that the Defense Secretary had to ask a friend whether he had resigned or been canned, are especially fascinating.  Fractal shards of a once close and then disintegrating relationship, the brief excerpts illustrate just how little both the President and McNamara actually knew (McNamara made many trips to Vietnam-I remember them well.  Each time he came back with a positive spin on what was an unraveling military and political situation).<br><br>At the Pentagon I was struck by the almost total concurrence McNamara's policies and statements enjoyed among civilian leaders and generals alike. McNamara, I thought then and now, was not a man who needed sycophants. He was simply so sure he was right that it probably never occurred to him to wonder why he rarely encountered disagreement.  I particularly remember Joint Chiefs of Staff chairman General Earle Wheeler as a mindless echoer of the secretary's thoughts.<br><br>A brilliant documentary and a fair one too.  McNamara clearly wants this film to be part of his legacy without it being an apologia.He does admit the United States was wrong in misjudging the nature of Vietnam and its history, wrong about assessing on-the-ground intelligence and wrong in not securing support from nations with traditions and values similar to ours (a curious and somewhat Europhilic anachronism). At the end he clearly and brusquely cuts off questions about personal guilt that, I'm sure, he will never be ready to address.  Fair enough.<br><br>I generally dislike any music by Philip Glass but in this film the minimalist score works very well against the documentary images.  It would have been a big mistake for Morris to use the folk and protest music of the past.<br><br>Morris is probably the finest, from an intellectual standpoint, documentarian working today in the U.S.<br><br>10/10 (because of its enduring archival and current thought-provoking value)","user":"lawprof","rank":[169,183]},{"title":"Fascinating and Compelling","rating":9,"date":"9 February 2004","review":"Educated in the best Ivy League schools, successful leaders in the business world, they were the best and the brightest, the core of John F. Kennedy's administration. They came to office in 1961 with high hopes that the world would become a better place. When they left, these expectations lay shattered amidst the rice paddies and jungles of Vietnam. Considered the architect of what came to be known as \"McNamara's War\", Robert S. McNamara, Secretary of Defense under both Kennedy and Johnson, was one of the brightest but had the reputation of being aloof and arrogant. This public image, however, may not have been the whole story. In the fascinating Oscar-nominated documentary, The Fog of War: Eleven Lessons from the Life of Robert S. McNamara, Errol Morris (The Thin Blue Line, Dr. Death) interviews the now 86-year old Defense Secretary in an effort to come to terms with what led to the quagmire of Vietnam and reveals a more complex, even strangely sympathetic man.<br><br>Interspersed with archival footage, actual news broadcasts, and tape-recorded conversations from the period, the interview documents McNamara's personal account of his involvement with American policy from WW II to the 1960s. Culled from 20 hours of tape, the interview is separated into eleven segments corresponding to lessons learned during his life such as \"Empathize with your enemy\", and \"Rationality will not save us\". The Secretary does not apologize for the war, saying he was only trying to serve an elected President but is willing to admit his mistakes. He says that he now realizes the Vietnam conflict was considered by the North Vietnamese to be a civil war and that they were fighting for the independence of their country from colonialism, (something opponents of the war had been trying to tell him for over five years). Morris never undercuts McNamara's dignity or pushes him into a corner yet also does not slide troubling questions under the rug and there are some questions McNamara does not want to discuss.<br><br>\nThough his reputation is that of a hawk, previously unheard tape-recorded conversations between McNamara and both Presidents reveal that he urged caution and opposed the continued escalation of the Vietnam War. In 1964, we hear Johnson say. \"I always thought it was foolish for you to make any statements about withdrawing, but you and the President thought otherwise, and I just sat silent.\" McNamara also discusses his role in World War II, the Cuban Missile Crisis, and his accomplishments as President of the Ford Motor Company. In talking about Cuba, he reveals how close the world came to nuclear annihilation, saved only by the offhand suggestion by an underling. McNamara repeats over and over again, demonstrating with his fingers, how close we all came to nuclear war. He talks openly about his involvement in World War II under General Curtis Le and how he helped plan the firebombing of 67 Japanese cities including Tokyo in which 100,000 Japanese civilians were killed. In a startling admission, he says that if the allies had not won the war, both he and Le May could have been tried as war criminals.<br><br>\nMr. McNamara has spoken out a bit late to save the lives of 50,000 Americans and several million Vietnamese but at least he has spoken and we can learn from his reflections. Though the Secretary does not apologize for the war, saying he was only trying to serve an elected President, to his credit he has looked at the corrosiveness of war and what it does to the human soul and we are left with the sense of a man who has come a long way. While his lesson that \"In order to do good, one may have to do evil\" sounds suspiciously like \"the end justifies the means\", his sentiments are clear that the U.S. should never invade another country without the support of its friends and allies. He says, \"We are the strongest nation in the world today\", he says, \"and I do not believe we should ever apply that economic, political or military power unilaterally. If we'd followed that rule in Vietnam, we wouldn't have been there. None of our allies supported us. If we can't persuade nations with comparable values of the merit of our cause, we'd better re-examine our reasoning.\" A valuable lesson indeed.","user":"howard.schumann","rank":[78,85]}]