[{"title":"A great movie, yet completely surpassed by the book","rating":7,"date":"11 July 2007","review":"When I first walked into the movie, my expectations were not very high. The first two movies, I thought, were the best of the series mainly due to Richard Harris' dead-on portrayal of Dumbledore and screenplays that closely followed the original books. Though the third and fourth movies were very artistic and dramatic, I couldn't really connect to them in the way i had with the books. They glossed over many of the little things that made the Harry Potter series so magical in the first place, focusing on a select few plot lines and limiting dialog to only what was necessary to further the story. <br><br>As a result they've felt more like a collage of scenes, a series of puzzle pieces, thrown at the viewers faster than they can piece together, just leading up to a final confrontation. Pacing has certainly been an issue, leaving fans feeling disjointed, and those new to the series confused as to what exactly is going on. In this respect, Order of the Phoenix was very similar to the previous two movies. As a Hollywood film, it deserves praise, bringing this amazing world to the big screen, telling a compelling tale, and keeping the viewers glued to their seats for the duration of the movie. However, to the die hard fans of the books, you will undoubtedly be disappointed. <br><br>Many scenes that one would think invaluable to the story have been cut, replaced by the hasty filling in of plot holes. And while it pains me to ignore some of my favorite scenes from the book being left on the cutting room floor (St. Mungo's, Harry's Quibbler interview, the Quidditch fight, etc.), I realize that yes, not everything could be included in the movie. But in this watered down version of the book, there seems to be something missing. We still have all the drama and excitement, but some of the magic just seems to be gone. <br><br>Aside from Evanna (couldn't have made a more perfect Luna), the kids give simply average performances, never really reaching the full potential put forth by JK Rowling's writing. The same goes for Gambon, who seems to have ignored the calm, all knowing, endearing idea of who Dumbledore is, in favor of a more erratic yet powerful headmaster. Sure, this works well in the more dramatic scenes (specifically the final battle), but otherwise, his performance falls flat, lacking the eye twinkling charm we came to love from the late Richard Harris. Thankfully, Imelda Staunton more than makes up for this in an amazing portrayal of Dolores Umbridge, one of the more fully realized characters of the movie. As for the rest of the cast, it's largely hit or miss, determined by how each scene is written. <br><br>Overall, I would certainly recommend the movie for everyone, fan or not, as it really was a well made movie, despite a few wooden actors and some bad dialog. But when looking at the books, one really can't help but think how much more potential this movie could've had.","user":"java5989","rank":[600,858]},{"title":"Order of the Plot-Holes","rating":4,"date":"12 July 2007","review":"For those of you looking for a faithful adaptation of Order of the Phoenix, this film isn't it. How director David Yates got the go to direct completely baffles me. Not since Chris Columbus' stilted pacing has a HP film disappointed me. I realize that in a book as rich in detail as the HP series something is bound to be left out in the film version, but the direction and editing of this film leave much to be desired.<br><br>The film opens in Little Whinging with the dementor attack on Harry and Dudley. Mrs. Figg happens across the boys as if by accident just after Harry defeats the Dementors with his Patronus, but is never \"outed\" as a squib. The Dursleys were more worried than horrified, and never threatened Harry with expulsion from their house. The sheer vileness that audiences last saw in Prisoner of Azkaban was notable absent, leaving the view to wonder what happened to bring us the weak and whimpering version of the Dursleys that appears in this film.<br><br>When Harry is brought to the Order's headquarters, very little is made of the fact that the Noble House of Black was once a bastion of pure-blood fanaticism. Kreature makes a very weak appearance, and the simple existence of Regulus Black (R.A.B.?) was never even touched upon.<br><br>Fred and George remain the comic relief, but the ever developing character of Ginny Weasley is ignored. Even more upsetting was the notable absence of Mrs. Weasly's growing concern for her family's safety. I thought that one of the most touching moments in the book was the chapter in which Mrs. Weasly attempts of banish the boggart only to have it continually morph into the horrifying visages of various dead loved ones. Bill and Charlie were also not mentioned, leaving the viewer to wonder if the film franchise plans to reduce the Weasly family from 9 to 7.<br><br>As excited as I was with the casting of Imelda Staunton as Dolores Umbridge, I felt that Yate simply did not do her justice. Yes she was vile, but not in the bureaucratic evil way Rowling depicted her in the novel. She simpered, but I just did not get the feeling that she took malicious pleasure that she should have in what she did as the High Inquisitor.<br><br>The rumored St. Mungo's scene, while it may have been filmed, was disappointingly absent, with the film jumping from Mr. Weasly's attack in the ministry (although why he was in the Deapartment of Mysteries was never addressed) to Christmas dinner at the HQ and a lame \"Here's Daddy!\" from Mrs. Weasly.<br><br>Even more disappointing was the depiction of the Department of Mysteries. I entered the movie hoping for some wicked effects and bizarre magical elements, and was left with just the Hall of Prophesies and the mysterious doorway. To add insult to injury, the relationship between Sirius and Harry was never developed to the point where Harry would naturally feel devastated by the loss of his godfather. I felt as though their relationship was more vague friend of the family then Harry beginning to look to Sirius as a surrogate father figure.<br><br>Over all the continuity of the film felt too rushed and disjointed, as opposed to the more fluid Prisoner of Azkaban and Goblet of fire. Relationships between the characters felt forced, which I found odd, considering the fact that the cast has been working together for 7 years or so. If any of my personal suspicions and predictions for the future of Harry are accurate, this film has left out numerous key elements. That being the case, then films 6 and 7 will have to scramble to make up for what this film lacks. As Yates is slated to direct the next installment, I can only look to it with a feeling of dread, wondering how he will mangle the Half-Blood Prince.","user":"PropTart77","rank":[139,198]},{"title":"Simply Put...Phenomenal (A Book-Reader's Review)","rating":10,"date":"11 July 2007","review":"OK. Yes stuff was left out. Yes some things were inaccurate. And yes, at times the story jumped around. But I'll tell you what, if that's the price to pay for being able to see fantastic literature on the big-screen...I'll take a few inconsistencies any day.<br><br>For having the task of taking 870 masterful pages and turning them into a 2.5 hour movie, David Yates did one heck of a job. This movie is a must-see, no matter how you look at it. For book-readers, sure you notice the absence of certain parts, but you finally get to see what you've imagined in your head for years take place in real-live motion on the screenand you know what, those few things left out, help you gain a better understanding anyway, because you have already read the in-between stuff. Then, in the same breath, this is a great movie for non-book-readers as well. For those HP fans who take the lighter approach of skipping the books and simply following along by the moviesyou won't know what you're missing anyway. The biggest complaints about this movie will be from book-readers who wanted a 10-hour long, word-for-word re-creation of the book. Other than that, there is nothing to complain about. Acting was great, story-line was great, and the special effects were flawless.<br><br>(Slight Spoiler In This Paragraph) Being a book-reader, I knew heading in that I would have to be prepared to accept substantial cuts from all that takes place in the book. However, the parts that Yates chose to focus on, were by far, the most important ones; and the way in which he did it, left me speechless. Yates was clearly at his best at the movie's climactic ending. When reading those last few chapters, when Harry is at the Ministry, and there is the great battle, the book reads like a whirlwind. Everything is happening at once: death-eaters here, death-eaters there, Sirius finally getting the chance to fight, Moody kicking ass, Ginny going on a tear and straight-up owning people. And you try to picture in your head what all this would look likea million things going on at once, and trying to picture how wizards and witches really \"fight\" each other. Somehow, someway, Yates was able to create that fast-paced, action-packed, confusion, and then all of a sudden, like an orchestra going flat after their last booming note, Sirius Black is gonejust like in the book. This was the hardest part for me to swallow when reading the book, as tears ran down my cheeks, not only because Sirius was my favorite character, but because you go from such a \"high\" of seeing the Order save the day, to the unbelievable \"low\" of seeing Harry's godfather simply fade away. This is an emotion and thought process which was excellently portrayed in the film. Ironically enough, Yates was only warming up.<br><br>As for the Dumbledore/Voldemort showdown, I don't think that it could have been done better. In a Star Wars type fashion, Harry is being tempted by Voldemort to release his anger, to have his revenge on Bellatrix Lestrange, to have a taste of the dark side. And as we sit there fearing for confused, helpless Harry, we see a green fire of hope, and more like Master Yoda than any other fictional character, Albus Dumbledore appears and engages Voldemort in a wizard-duel that puts Gandalf and Sarumon to shame.<br><br>The way the movie engaged the audience and got their emotion kicking is a great film-making talent not found in many movies anymore. Think of the way Yates made you HATE Umbridge, just like the book. The way you felt bad for Snape when you saw his hidden past, just like the book. And think of the best two lines of the movie where you felt comfort, confidence, and safety on Harry's part. The first of these lines was Sirius Black to Lucius Malfoy: when the death-eaters are over-whelming the kids, Sirius appears behind Lucius with a firm, \"get away from my godson.\" Then once again, when Harry is alone with Voldemort, Dumbledore appears and almost as if to initiate the duel, says, \"It was a mistake for you to come here tonight, Tom.\" Overall, the movie was fantastic. The best of the fiveby far. You just have to put aside the gaping holes of chapters that were left out, and look at what was done well. For the book-readers, imagine if you were forced to take only 400 of the 870 pages out of the bookyou would take the most important ones that relate to the plot. So as much as the \"prefect storyline\" and the \"Harry/Cho drama\" and all that other stuff is a great read, the big screen simply doesn't allow enough time for it. As for the non-book-readerspick up the books and get busy. Because as great as a job that Yates did with the moviethe woman he got the story from, Ms. Rowling, might just be one of the greatest authors of our time.<br><br>Now go spend 10 bucks and enjoy the show!","user":"inzirilloc","rank":[538,819]}]