[{"title":"Farscape Returns!","rating":9,"date":"5 December 2004","review":"Having been a fan of this show since I first saw it on BBC 2 in 1999, I sat down to watch PKW with some nervousness, Farscape's characters are like a family in a way. A family who you visited every week, you shared their highs and lows, their loves and hates.<br><br>Would Peacekeeper Wars be faithful to the series? Or would it be a hodge podge of ideas and scenes with none of the old humanity?<br><br>Happily my fears were unjustified. PKW grabs you by the throat and does not let go.<br><br>The acting was, as usual, superb with believable characters, The bad guys do not resort to the cliché of being bad for the sake of it. Everyone has their reasons for doing what they do.<br><br>The effects were amazing and the story line is a roller coaster ride.<br><br>Admittedly, there are times when the compressed season 5 storyline jars. But this is forgivable.<br><br>The rumour at the time of filming was that the mini series used up all the available squibs in Australia. After seeing the battle scenes, you realize why!<br><br>All in all, a good ending to this part of the story while still leaving a way to make more. <br><br>Let's hope Moya keeps flying and we visit her crew in the future.<br><br>;-)","user":"praxis-9","rank":[56,59]},{"title":"Culmination of all that is best in Farscape","rating":10,"date":"21 October 2004","review":"This miniseries neatly wraps up the plots and characters of the always inventive, wildly funny, and deeply intelligent Farscape. (Check out the first four seasons for proof).<br><br>And it does so with panache! It's wonderful to see Crichton, Aeryn, D'Argo, Chiana, Moya, Pilot and Rygel back, their inimitable selves as usual. And of course the Scarrans, Scorpius, Grayza and a host of other less than savory characters also make their presence keenly felt.<br><br>I won't talk about the plot (people have done so already), but the acting and the characters and the plot are all raised to the next level. The wit is just as sharp, the emotions just as strong, and many loose ends get tied up (but not so tightly that there can't be more future Farscape if the creators decide to go that route). <br><br>The last hour of the mini is enough to justify it a permanent place on my DVD shelf whenever it comes out. I cried, I laughed, I gasped. I was thoroughly entertained. Truly, some of the best sci-fi out there.","user":"jlvov","rank":[54,61]},{"title":"Fan-frelling-tastic!","rating":10,"date":"8 November 2004","review":"At last Farscape has the ending it deserved. The Peacekeeper Wars did everything I hoped it would, and even more than I dreamed possible. As a long time fan of the show I had waited for this with growing anticipation, to the point where I almost expected to be disappointed.<br><br>I wasn't.<br><br>It's big, it's bold, it's thrilling, it runs the gamut of emotions and then some, and amidst all the spectacle it never loses sight of the most important component of this brilliant series - the characters. I was reduced to tears on several occasions, particularly during the last ten minutes.<br><br>A big thank you to all the fans who got this made, to Ben, Claudia, Anthony, Gigi, Wayne and all the other actors and puppeteers, and to Rockne O'Bannon, David Kemper, Brian Henson et al for bringing us this and four wonderful seasons.<br><br>It was one helluva ride.","user":"stephen-damarell","rank":[51,58]}]