[{"title":"the most underrated movie of 2005","rating":9,"date":"8 April 2006","review":"Have you heard of Stay? If you're here you must have but I'll bet it wasn't too long ago that you found out about it. It's a movie that came out late last year with little fanfare, was dismissed as a poor movie by critics and quickly ushered back out of theaters.<br><br>It's a crying shame.<br><br>It was a wonderful movie. My favorite type of movies are psychological horror movies. Favorites include: Jacob's Ladder, Mulholland Dr., Donnie Darko, and in a similar realm, Momento and Fight Club. I love seeing a good representation of the human mind on film and that is exactly what this film shows so well.<br><br>It's about a college student (Ryan Gosling) who tells his shrink (Ewan McGregor) that he is going to kill himself on the stroke of midnight this Saturday, leaving his shrink to enlist the help of his formerly suicidal girlfriend (Naomi Watts) to figure out why he wants to kill himself and how to stop him, while his world falls apart.<br><br>It's directed by Marc Forster of Monster's Ball and Finding Neverland fame. The movie has been called pretentious, shallow, ridiculous, bewildering, absurd, and empty by many reviewers. Personally I think that they didn't have the patience for it and/or were put off by its extravagant visuals and cuts. I thought it was great and deserves much more credit than it has received.<br><br>The movie's visual style is very interesting and jarring in a good way. It had me constantly saying to my girlfriend \"did you see that?\" Full of slight of the hand camera/editing tricks. Nearly everything in the movie is symbolic of other things or ideas in the movie. The acting is very good, especially among the lesser characters. Everything in the movie feels so unreal, but that is serves some purpose even if one couldn't know what it is right away. A second viewing would reveal many new things. In the end much of the movie is left up to interpretation and my girlfriend and I had a good conversation about our ideas on what things meant in the movie. After thinking about it for a day I'm pretty sure that I could explain everything in the movie, even what the hell is up with Ewan McGregor's pants, Why Gosling wanted to commit suicide and the twins and triplets.<br><br>It was fun was figuring out what the rest of the movie meant after seeing its end, the solution. The movie is like a code and the end is the decryption key. It differs from other \"sixth sense\" type surprise ending movies because everything you would see in the movie before the end would not act as a clue to what it all means or what the ending is. It's more like decrypting a diary than a problem with a solution to it.<br><br>Basically, any movie buff owes it to themselves to see this movie. I rented it but after seeing it I fully intend to purchase the DVD.","user":"Barshki","rank":[185,220]},{"title":"A brilliant film about a young man near death","rating":9,"date":"23 October 2005","review":"It's hard to comment on this film without including a spoiler, but I feel it is necessary to try because of all of the unwarranted bad reviews this film is receiving. If you go into it expecting to see a rendition of The 6th Sense, you might be disappointed. If you go into it expecting to see a logical plot with a chronological story behind it and an honest portrayal of developed characters, you will be disappointed and very confused.<br><br>However, if you go see this film with an open mind and simply EXPERIENCE what it has to offer, you will be rewarded greatly at the end - assuming, of course, that you understand what you have just seen, at least to some degree. For the best experience, pay attention to the little details, but don't try to figure anything out until the end. See it with someone so that you can discuss it afterward. It's that good.<br><br>This movie is visually appealing and artistically constructed - pleasing to both the eye AND to the mind.","user":"Melissa_1982","rank":[335,435]},{"title":"The 2-films-in-1 phenomenon","rating":6,"date":"21 October 2006","review":"I think the very first movie I ever saw that absolutely required a second viewing was Angel Heart, back in 1987. The second viewing is necessary because after you know what you know from the initial viewing, you get to watch an entirely different film the second time around. Angel Heart was considered before its time when it was released, and since then, indeed there has been a spate of these kinds of films, some more successful than others.<br><br>Stay is one of these 2-films-in-1 experiences, but this film, unfortunately, is not as successful (in my eyes) as, say, The Sixth Sense, Memento, The Machinist or even Angel Heart. Those films succeed brilliantly because they manage to evoke a chilling impact on the viewer by the end. Stay, on the other hand, left me more confused than anything, even though I understood what had happened: -=- SPOILER ALERT -=- The film takes place in the consciousness of Ryan Gosling's character, Henry, who is teetering between life and death after a terrible car accident which killed the other passengers in his vehicle (his mother, his father and his soon-to-be-fiancée). This is a horrendous tragedy, what has happened to Henry: if you can imagine being near death but yet aware that your 3 closest loved ones have been killed in an accident that you inadvertently caused (his tire blew out) - this is a monumentally sad thing to have happen to you, but yet this sadness was not effectively conveyed at the end of the movie because I was instead confused about what had transpired and I had to think about it in depth afterwards to realize that Ewan McGregor's character Sam (who seemed to be the main character of the movie) was also part of Henry's semi-conscious hallucinatory state.<br><br>There were just too many scenes in the film that Henry didn't appear in (although McGregor and the always-fantastic Naomi Watts are perfectly cast in their 'roles', as is Gosling). In retrospect, I think this is what caused the confusion and left me not feeling the impact that should have been felt at the realization of what had just transpired. -=- END OF SPOILER. -=-<br><br>I don't like making comparisons, but The Sixth Sense, for instance, was hugely successful because it was written in such a way that it included the viewer in Bruce Willis' shocking realization at the end; it has the impact it does (even on repeat viewings!) because of the masterful way it's staged.<br><br>What I'm saying is, while Stay is a noble and ambitious effort and still worthy (in my opinion) of a couple of viewings, it's not enough to have a movie that becomes a second movie once you've seen it - the movie has to stand on its own the FIRST time; the impact has to be there the first time or there's no genuine payoff for the viewer. I love a movie that haunts you afterwards and makes you think, that's the best kind of film, but there does have to be that impact the first time, that all-important creeping sense of realization that makes your eyes go wide and gives you goosebumps.","user":"Rogue-32","rank":[25,28]}]