[{"title":"Bloody Northern Line","rating":8,"date":"30 January 2005","review":"This is good little shocker; not perfect by any stretch of the imagination, but tight, competent and disturbing. An excellent example of a simple idea developed into a compelling 90 minute script.<br><br>The set up requires no bells and whistles, no lengthy exposition or wordy back story; Kate (Franka Pontente), a young German business woman living in London, drifts off whilst waiting for the last tube train. She awakens to find the place deserted, but quickly comes to realise that she is far from alone. Someone, or something, is down there with her and it's intentions are wholly malicious.<br><br>In fact she encounters several other characters in her quest to survive, including a lecherous work colleague, a homeless couple and a caged sewage worker, all of whom add pace and substance to the plot. There is a slightly awkward gear change somewhere in the middle of the film when tension thriller mutates into gore fest, but nothing so clumsy as to slow the hectic pace. For those of you with weak dispositions this is likely to be a harrowing ride; for those of you who relish a bit of well executed carnal mayhem this should press all the right buttons.<br><br>The climax of the film is perhaps less successful than the main body of the film, but it is punctuated with a nice moment of unexpected social commentary which provides a satisfying conclusion.<br><br>Some may find themselves feeling somewhat cheated of a clear explanation as to the exact nature and history of the threat encountered by Kate and her confederates, however, for me this was not the case. A horror film writer should not need feel compelled to dot every i and cross every t, in the same way a writer of political thrillers might be expected to. There are enough clues here to give you a very pretty clear idea of what brought this evil into existence, making a detailed and conclusive solution superfluous. The retention of a certain sense of mystery is to be welcomed and reminds us that in this film the ride was always going to be more important than the exact destination.<br><br>My understanding is that the budget for this film was, to say the least, minimal, in which case our applause for this British horror should be all the louder, for at no point does one have the impression of corners being cut or effects failing to deliver.<br><br>If this sounds like your kind of film then it probably is. Buy a ticket and climb aboard.","user":"vmvm","rank":[163,197]},{"title":"works against its own ideas","rating":3,"date":"20 April 2007","review":"Creep is the story of Kate (Potente), an intensely unlikeable bourgeois bitch that finds herself somehow sleeping through the noise of the last underground train, and waking up to find herself locked in the tube station. After somehow meeting workmate and would-be rapist Guy on a mystery train that runs after the lines have closed, things go awry and she finds herself pursued by what lurks beneath the city's streets. Her story is linked to that of George (Blackwood), an ex-con working in the sewer system; they meet in the final third of the film, brought together by their attempts to escape the monster that pursues them.<br><br>The pair proceed through a set of increasingly unlikely locations; from the Tube station, they end up in the sewage works before somehow finding themselves in some sort of abandoned underground surgery. Most Tube stations don't have toilets, so how one has a surgery is beyond me. Naturally, the film cares to explain that the surgery doesn't have running water. Yet it has electricity? Just one of many inconsistencies that work against the atmosphere of everyday believability that the film tries to create.<br><br>The monster itself is a problem. There's a complete lack of reasoning for its actions, it just kills people for no obvious reason. And then of course it keeps some alive for no real reason either, perhaps just so that they can eventually escape and give the film an extra 15 minutes or so running time. I understand that natural evil is supposed to be scary, but then the film attempts to explain itself via a photo of a doctor and his son, and a few shots of some jars containing babies, and yes, it is just as tired and pathetic as it sounds. It also fails to explain how the creature has been underground long enough to lose the ability to speak, communicating only in raptor screams, but not long enough for its pair of shorts to decay. Hmm.<br><br>This doctor business leads to scene that is the film's desperate attempt to implant itself on your memory, and while it is gory and uncomfortable to watch, it just isn't enough. The final third of the film hinges on an emotional relationship that never existed, and the characters break down and recover for little or no obvious reason. George breaks down, unable to cope with something despite stating that he wants to escape so he can see his daughter again, and Kate becomes emotionally tough seconds after going to pieces over someone that ripped her off for a travelcard. Yeah.<br><br>After starting out as a \"this could happen to anyone\" movie, it quickly falls apart as it introduces ideas that make it more and more unrealistic. A complete lack of emotional interest in the characters and an absence of suspense make this one to avoid.","user":"snow0r","rank":[45,60]},{"title":"What a sickly, demented creep!","rating":6,"date":"21 October 2006","review":"After leaving a party one night, Kate heads to a London subway. But being a bit drunk, she nods off and when she finally awakes, she realises she's alone and has been locked in. Now she's panicking, but a train pulls up and to her surprise no one else is on board. After a few seconds the train comes to sudden halt and Kate comes to the realisation that someone or something is lurking down there, which has some nasty surprises waiting for Kate.<br><br>When watching \"Creep\", what entered my mind was that I was seeing the backwoods horror slasher \"Wrong Turn (2003)\" basically set in a subway, but only more bloodier and incredibly cruel. I get the train to work and back, but I'm just glad that there are no subway systems on my journeys. But there's no doubting public transport can be the pits.<br><br>Christopher Smith the writer and director of this slick British Indie subterranean horror flick presents one very tight and atmospherically Gothic feature that benefits highly from its relentless surge of twisted and ragged jolts. It's gruesome, mean-spirited and unflinching terror is mostly delivered in a serious manner, despite the script being sprinkled with quick-witted remarks. The damp, isolated and claustrophobic setting of the poorly lit tunnels makes a huge imprint on the disorientating cloud the audience and main protagonist face. Smith integrates some flashy and rapid techniques. The versatile hand held photography adds a real moody and intimate vibe amongst the very effective sound effects and creaky understated music score. Hitting the mark was the graphic and always on the ball makeup effects. The appearance of the hideously unusual subway dweller just lingers in your mind and when it came to the kills it didn't disappoint.<br><br>However, there are things that really do bring the film down. By the third act it starts to wear a bit thin with predictable jumps and wearisome clichés. The story is terribly vague from the get-go. Illogical patterns and stupid circumstances unravel throughout the string-like plot. Originality comes in minor doses, but in all, there's a nice sense of realism and a speeding train-like pace created to keep you mostly involved. Franka Potente gives a strong, flexible and quite capable performance as Kate and the amusing Vas Blackwood gets caught up in the gruel too.<br><br>A very nasty and dour slasher that won't blow you away, but it provides the nightmarish thrills and intensity one would hope for.","user":"lost-in-limbo","rank":[18,22]}]