[{"title":"Very pleased","rating":10,"date":"26 October 2004","review":"This is a great family film/clean fun. Good to see with others. Fun to watch with children or as an adult. The focus of the film(plot) is clear. The characters/actors were well chosen. It wasn't too long, and it kept ones suspense. This is the type of film, I feel, that helps people better appreciate the holiday season. The film had no explicit scenes, so it could be watched with children.<br><br>The focus of the film was to make one laugh and to apply the romantic need for togetherness. Excellently done...","user":"jason-varble","rank":[19,24]},{"title":"The Santa Clause 2","rating":6,"date":"18 December 2012","review":"The Santa Clause 2 takes place a number of years after the original film. The first movie saw Tim Allen's character \"Scott Calvin\" become Santa Claus after the previous Santa Claus fell off of his roof on Christmas Eve. Well in this one Scott has settled in nicely to his role as Mr. Claus, but there is one problem. He has to find a Mrs. Claus in only twenty eight days or Christmas as we know it will be over forever! On top of that major problem, another subplot includes his quest to get his son Charlie off of the naughty list. It seems Charlie has been rebellious as a teenager, spray painting school walls and such. So while Santa/Scott leaves the North Pole to take care of that business, his trusty sidekick elf Bernard and newcomer elf Curtis create a clone Santa to take over on an interim basis. Scott ends up falling for Charlie's principal Carol Newman, and with the use of magic wins over her heart. Meanwhile in the North Pole, the fake Santa that Curtis the elf created ends up becoming a power hungry dictator who believes ALL kids are bad and deserve only lumps of coal for Christmas. It's up to Scott to defeat him and save Christmas.<br><br>The Santa Clause 2 is not nearly as good as the first film. While the whole idea of Santa may be absurd to many people, this film has so much more unrealistic things occur in it that it lost my interest. For example, Scott's ability to snag a wife in under a month? It's completely ridiculous but I guess had to be done to wrap up the movie very nicely. And all of the magic that he uses to make Carol fall for him goes completely unnoticed by her character, such as a mistletoe and twenty presents appearing out of nowhere. She just brushes it off. I also did not like that the major characters from the first film (Scott's ex wife Laura and her husband Neil) took a back seat in this film for the overly annoying young elf Curtis. It lost the magic and heart that the first movie had.<br><br>There were some good moments in this of course. Tim Allen had some great comedic moments, especially when he ditches the Santa suit and acts like a regular person. I like him better as Scott Calvin than I do as Santa Claus. He and Carol have a good combative chemistry that turns sweet once we start to see the human side of her. And the scenes when Scott uses magic to give all the teachers toys that they loved from their childhoods really was a good piece. It just wasn't as good as the original. I thought it was ridiculous that he had to find a wife in one month. And considering that was the major obstacle in this film for the main character to overcome, I wasn't really engaged in it.<br><br>Children will love this movie (I know I did years ago), and that's really all that matters with a Christmas movie. But as an adult looking for a good holiday film, this one fell flat up against others such as Home Alone 1/2, Christmas Vacation and even the first Santa Clause.<br><br>6/10","user":"Toronto85","rank":[5,5]},{"title":"Good Christmas Fun","rating":7,"date":"12 January 2004","review":"It's been quite a while since I've seen the first Santa Clause movie, but I remember being quite surprised by it.  It was a unique twist on the beloved Santa character with great comic timing by Tim Allen.  But that was a while ago, and I didn't really know what to expect from The Santa Clause 2.<br><br>The movie started off kind of slow when everything is going smoothly. Everybody's happy and Santa's meeting with his fellow \"legendary figures,\" which I admit was a fairly funny scene, but this movie just started off kind of boring.  Of course this is normal with any movie until we're presented with a conflict.  Santa is reverting back to his civilian self and must find a Mrs. Clause to fulfill the contract and continue being Santa.  So to watch over the North Pole, a duplicate, plastic Santa clone is made, and slowly turns to a maniacal boss over his elves.  I thought this was pretty funny, especially with me being a business major.  I wonder if I'll act like that after school!<br><br>Anyways, back to the story, Santa goes back to his hometown with limited magic.  We're introduced to a frigid principal that has punished Santa's son for displaying some Christmas spirit.  More fun ensues as Santa tries to find and woo the next Mrs. Clause.  To seal the deal, his Santa magic gives him the edge and results in some very nice scenes of the movie.<br><br>I won't go any further as you get the idea.  Overall, The Santa Clause 2 is a nice, snuggly movie that will keep you in the holiday spirit.  It's not groundbreaking material, but it has a nice message and should put a smile on anyone's face.<br><br>My IMDb Rating: 7/10.  My Yahoo! Grade: B (Good)","user":"travisimo","rank":[19,27]}]