[{"title":"Good movie for those that enjoy passion","rating":10,"date":"10 March 2006","review":"Probably the best romantic comedy my wife and I have seen in twenty years. Although we have always been a fan of Ashton Kutcher, this movie separates from his previous achievements. His chemistry with Amanda Peete is more believable than any other actress he has performed with. You actually fall into to the story as someone you might have known in life, whether it was a friend or someone that remains in your thoughts from years past.<br><br>To knick-pick the movie on plot or commercialization is to miss the writers passion for what he/she is trying to convey. Take the movie for what it is at face value and that is to travel through their relationship in all the what-if's, all the heart breaks and joys. If you let yourself do that you will enjoy a great story with someone you at one time shared the same passion with. -Curt &amp; Tam","user":"vanclanoregon","rank":[74,84]},{"title":"Reel Love: a Lot Like Real Life","rating":7,"date":"14 May 2005","review":"Perhaps this film won't inspire the twenty-something folks at whom it was marketed. They might not appreciate its message, after all, when you're young, life stretches out before you like an eternity. But if you're over 30 and haven't found that perfect person to share your life with, it might really touch you... <br><br>This is the most romantic movie I have seen in years. As a regular armchair film critic who happens to love romantic comedies but finds the quality of most to be sorely lacking, I usually start to gnaw away at a film within the first five minutes. But A Lot Like Love immediately embarks on a tortuous journey of love's most confounding mileposts. The fireworks, the mystery, the seduction, the retreat... A guy who wants to get \"all his ducks in a line,\" and a gal who deals with whatever happens to come her way, help each other loosen up their respective rigid perspectives on how life should be lived.<br><br>The chemistry between Oliver and Emily percolates over a span of nearly seven years but neither lets it come to a full boil lest it ruin their plans. Kutcher and Peet each deliver endearing performances and actually play against the urge to gratuitously combust making for just the right emotional veracity and sexual tension to keep it real. No \"just add water\" instant love here. These two take their time to fall into the soup.<br><br>This film is certainly easy to look at what with the hip modern beauty of both of its stars decorating every shot. The fly-on-the-wall perspective of watching these two people awkwardly and trepidaciously flirt with what might be, kept my attention rapt, and experiencing it in the moment, I can honestly say that I did not know what was going to happen next.<br><br>If anyone has ever had that \"friend\" that you've know for years, you know you have feelings for them, appreciate their loyalty, and take their bad with their good (because after all, you're \"just friends\"), but have spent years keeping an eye out for something better, or just not taken that \"next step\" because of geography, peer-pressure, or fear of rejection, you will appreciate the honesty and sentiment of this story.<br><br>You'll definitely get a refresher course in the fact that life is indeed short and a lot can happen when you're not paying attention. Enjoy every moment you can, and take some risks or you'll be looking back on an awful lot of regret. A Lot Like Love is funny and sad, playful and poignant, and was over before I wanted it to be. For me, this movie is a lot like life.","user":"Half_the_Audience","rank":[160,188]},{"title":"Great movie - funny, romantic and poignant","rating":10,"date":"8 May 2005","review":"From the majority of other comments written about this film, it would seem that there are a lot of bitter, cynical people out there.<br><br>I watched this film last night with my wife and we both loved it - we laughed a lot, and thought the 2 main characters perfectly complimented each other - their chemistry was wonderful and utterly endearing, and you actually gave a sh*t about what happened to them.<br><br>Maybe I'm a sucker for a good romantic comedy, but I'm astounded by the negative comments posted on this site. Some posts criticise the dialogue, but, well, isn't that just how people actually speak? I generally do not give out lengthy monologues re: my emotional state, and can appreciate a movie that deals in real language. It doesn't make the film any less appealing or worthwhile.<br><br>Go and see it with an open mind and, if you have a heart, then you'll love it.","user":"s_oneale","rank":[194,238]}]