[{"title":"Very worthwhile movie...give it a try.","rating":30,"date":"30 March 2004","review":"Hmmm...where do I start?  Should I point out to a recent reviewer, who sarcastically pointed out that Nigeria has an air force and could have bombed the group fleeing through the jungle, that the \"bad guys\" are rebels, not government forces?  Since the rebels just killed everyone in the President's family, they probably scared off the government pilots, too. (Sorry...couldn't resist.)<br><br>And since when was a movie so horribly, horribly bad because it couldn't be filmed in the actual location?  So what if this was filmed somewhere other than Nigeria?  And so what if the music was not \"authentic Nigerian music\"? I don't remember a title card at the beginning of the movies saying it's a National Geographic documentary.<br><br>This is a good movie.  Less action than many war movies and less thought than some political dramas.  There are good and bad people of all races. There's tension and there are explosions and gunfire.  There is ample opportunity to reflect on what mankind is capable of doing to each other for political reasons.<br><br>Give it a chance and I think you'll enjoy it.  Better yet, I think you'll be sombered by it.","user":"innocuous","rank":[219,280]},{"title":"Outstanding middle part surrounded by Hollywood clichés","rating":6,"date":"21 May 2006","review":"'Tears of the Sun' is a movie with a message and an interesting first hour, but contains too many Hollywood clichés to really be something. We start with Lieutenant Waters (Bruce Willis) and his team of SEALS who have to rescue Dr. Lena Kendricks (Monica Bellucci), a priest and two nuns from a missionary post in Nigeria where murdering rebels are about to arrive. The priest and the nuns want to stay, Kendricks only wants to come if the Nigerian refugees can come too. Waters agrees only to leave them behind as soon as Kendricks is on the helicopter. Then, from the helicopter, he witnesses the result of rebels passing by and in an instant he disobeys his orders and turns the helicopter around.<br><br>This is the point where the best part of the movie begins. Waters and his team are on their own now, leading the refugees to the border of Cameroon. The way his team not always agrees with his decisions but how they are loyal anyway is one of the interesting things here. Another is the way the movie dares to show the rebels and their actions, things we see parts of on the news in places like Liberia and Sudan. It gives us an impression how hopeless the situation is in some parts of Africa. The distraction here comes from Kendricks who is an obvious Hollywood plot device. She is the possible love interest, or at least the needed female character, and she must annoy Waters by constantly suggesting things that even to her must sound stupid when followed by a lot of rebels. Never mind.<br><br>Then the third act starts and the movie fails to deliver what it kind of promised before. Instead of following the dramatic path it changes into the kind of action film Hollywood likes to produce. A lot of gunfire, explosions and bodies flying through the air. That's too bad since an earlier action sequence was able to show both the horrific actions of the rebels and the trained and nuanced way of SEALS dealing with a situation. During that sequence I felt a director (Antoine Fuqua) doing his job the right way, making the movie very intense. He did the same thing for the excellent 'Training Day' from the year before. His third act of 'Tears of the Sun' was sort of like an introduction to his real Hollywood adventure, 'King Arthur'.","user":"rbverhoef","rank":[81,100]},{"title":"A very powerful and authentic film with a strong moral theme","rating":9,"date":"22 July 2005","review":"This film was simply incredible. I didn't see it at the cinema, which upon seeing it later on DVD release, regretting missing first time round.<br><br>It made some incredibly powerful statements and was very difficult to watch. I rarely admit to this, but I actually found parts of it so moving, that I cried! And I never cry.<br><br>The choice of Bruce Willis was a good one and he plays a deeply conflicted character, he plays him with depth. I have seen Monica Belucci in films before. She is an incredibly gifted actress and she really believed in this project. Her character comes across as having strong religious and moral convictions, prepared to die to help and protect others. This comes across in the decisions she takes and the willingness to stand strong under pressure.<br><br>Having seen the Documentary on the special features section of the DVD afterwards, I could see the incredible lengths that everyone attached to the filming went to. Each of the actors playing Seal Team members, went through some very authentic training in preparation and stayed in character outside of filming during the day. Given the commitment of all those attached to the film, I can see why the film is what it is.<br><br>The director, Antoine Fuqua, from the films I have seen in which he directed, brings a strong moral theme to his characters and the story. The whole visual manner of filming, camera angles, close ups etc adds to the intensity here.<br><br>The choice of filter during filming, that gives a subdued and darker feeling visually, was perfect. The use of Africans as extras was an interesting and a suitable choice, given their backgrounds. Many of these extras were showing genuine emotions which was captured on camera, as they relived traumatic moments in their lives when certain scenes were filmed.<br><br>On that note, one scene in particular made for very difficult viewing, but totally in context and I would expect it would provoke a strong reaction from viewers, for good reason. The actual combat scenes are kept selectively short and in context to the overall film. They are also very realistic. <br><br>The soundtrack was well suited and complimented the whole overall feel to the film. I would not say that this film was entertaining, it is very hard to watch but it is an example of good film that will challenge everyone who watches it and who has a conscience.<br><br>After seeing this film, as with Hotel Rwanda and Tears of the Sun, I am constantly reminded of our individual and collective moral responsibilities in the 'civilised Western World' when atrocities are committed. And it sits badly with my conscience that 'we' in the West do so little and so late in trying to stop such genocide from happening. I for one think that every adult should see it.","user":"cooperaitaliano","rank":[138,177]}]