[{"title":"Much better than I expected...","rating":3,"date":"3 June 2003","review":"In this world where we must be politically correct a hundred percent of the time or face court, Fat Pizza is like a breath of fresh air simply because it doesn't go out of its way to not offend anyone. We've all grown tired of films that go out of their way to please everyone and wind up pleasing noone as a result, so here's one that goes out of its way to please noone.<br><br>And it winds up pleasing most anyone who has ever lived in a city where there are a lot of people who represent an ethnic minority. Even people from California or New York might relate to it on some level. If you have never been outside of an exclusively Anglo-Saxon community, on the other hand, don't bother.<br><br>It has been stated that the film is little more than an extended episode of the television series, and this is true to some extent. However, the cinema format removes a lot of the restraints inherent in television, and as a result, the humour is more unapologetically ethnic, disgusting, and just plain revolting. The Farrelly brothers are complete tryhards in comparison to Paul Fenech and his cohorts. And the refreshing thing is that they truly don't care who they offend, offering absolutely no apologies whatsoever.<br><br>Another fun element of Fat Pizza is spotting all of the cameos from minor, or even major, Australian celebrities. Angry Anderson, Red Symons, Kamahl, Elliot Goblet, even Jeff Fenech himself - anyone who has ever been anyone on Australian television is packed in here, and you'll need to watch the film twice just to identify them all. The best part is that they're not taking themselves even remotely seriously.<br><br>When Red Symons happily tells the illegal immigrants that \"We take bribes\", or Kamahl asks us for the zillionth time why people are so unkind, one cannot help but laugh because it is all so utterly irreverent in a time when it should be. Forget about political correctness here - if you want to see Lebanese men acting like utter imbeciles while bikies, Italian gangsters, and bad Ronald McDonald clones give them hell, this is the film you've been waiting for. You will not find a scene where a stoned Anglo pizza delivery boy runs over cyclists and thinking he's scoring points for it in any American film before this one was made, I can garantee that. If you see it in one that was made after mid-2003, I can guarantee that it won't be nearly as funny.<br><br>Normally, I would never have considered this film because of its shameless appeal to the lowest common denominator, but it scores big because it represents a much-needed loosening of the collar in this day and age where minor mischief on the part of people who are treated like slaves in our society is treated like a spree of murders. Well done, Paul Fenech - people like you may well be the salvation of this blinkered, speak-no-evil society that none of us who were born in the 1970s or 1980s actually want. Ten out of ten for laughs, but minus two for going just a tiny bit too far at times (and even they were pretty funny because of the loosening up that the rest of the film offers).","user":"mentalcritic","rank":[21,23]},{"title":"It's bigger and cheesier.","rating":8,"date":"23 April 2003","review":"It's been said that this movie sets Australian culture back 20 years. Whoever said that (I read it somewhere, but can't remember where) has his/her head in his/her armpit. It's the side of Australian culture outsiders rarely see. Illegal immigrants ARE arriving in leaky boats. Police ARE unfairly targeting ethnic minorities. Fast-food corporations (eg McDoggles) ARE being mean to the little guy (and I don't just mean Pauly). People ARE making speed in their backyards. Backpackers ARE being murdered.<br><br>Though I'm sure that, when these things occur in the real world, they are nowhere near as funny as they are in Fat Pizza. This movie is utterly hilarious from beginning to end. Sure, the humour may not be everyone's cup of tea. I certainly wouldn't feel comfortable watching it with my Nanna.<br><br>It's unfair to say there is no structure to the plot. There is. Just not a standard one. Which, in this age of Hollywood formula, should be regarded as a good thing. This movie breaks the rules, baby!<br><br>If you enjoy watching the Pizza TV show on SBS, you'll have a blast. It's longer, with more jokes and cameos crammed in. A family-size Pizza, if you like.<br><br>If I had to choose between Fat Pizza and Kangaroo Jack as a representation of Australian culture, I'd choose Fat Pizza in a second.","user":"LennyRenquist","rank":[32,38]},{"title":"If you're looking to watch a Politically Correct movie, this ain't it.","rating":10,"date":"28 July 2005","review":"Fat Pizza is a fast-paced comedy that just about makes fun of every ethnicity, creed, color, size, and sexual preference of the peoples in Australia, it seems (Having never been to Australia, I'm only guessing they are making fun of everyone)... It's definitely low-brow humor at it's best!<br><br>I realize that Fat Pizza may not be everyone's cup-o-tea. If you're one of those super-sensitive they-shouldn't-make-fun-of-anyone-or-anything sort of people, stay away from this movie! You will get your feelings hurt!<br><br>Though if you're like me, a person who's sick to death of all this Politically Correct crap run amok in movies, you'll probably love this particular movie!<br><br>The only criticism I have about the movie is how hard it was to find it here in the U.S.. I found it by chance at a garage sale.<br><br>I give this movie a 10!","user":"john-2266","rank":[21,24]}]