[{"title":"My Review","rating":10,"date":"28 December 2005","review":"The Producers (2005) **** Nathan Lane, Matthew Broderick, Uma Thurman, Will Farrell, Gary Beach, Roger Bart Dir. Susan Stroman<br><br>I don't think the critics know what they are talking about. This movie rocked! It took me back to the old days of movie musicals. You know, the Bugsby Berkley years, big and flashy with hum able songs. Based on the 1968 film starring Zero Maestel and Gene Wilder, and the smash hit on Broadway, the story of a failing Producer named Max Bialystock who has just had the worst show in town close called Funny Boy, a musical version of Hamlet. Distraught he runs into accountant Leo Bloom who comes up with the notion that you can make more money with a flop than with a hit. Max overjoyed to hear such wonderful news lays it all out. Step 1. They find the worst play ever written, the \"mother lode\" as Max calls it when he comes across Springtime for Hitler, written by neo-nazi Franz Liebkind. Step 2. Hire the worst director, a prime and proper gay man named Roger Debris who wants to keep everything gay! Step 3. Raise 2 million dollars from Max's backers: harmless little old ladies looking for a last roll in the hay. Step 4 Open on Broadway and before you can say step 5 they close and run off to Rio. All goes well until Springtime for Hitler becomes a success leaving Leo and Max in the dust.<br><br>People have been comparing it to the original, which sure it has some of the same lines, and the story is the same, but both shows have something different to offer. You get songs in this version that you don't get in the original. Nathan Lane tears up the screen and will have you in stitches as Max; his show stopping number \"Betrayed\" will have you applauding. Matthew Broderick is also very good as Leo who can't grab life by the balls and go. He sings \"I Wanna Be A Producer\" with such gusto and dances with Ms. Uma Thurman, who is amazing as Ulla, and their dance number has sheds of the old Astaire and Rogers's musicals of the 30s.<br><br>Also excellent, are Will Farrell as the Nazi who speaks to his birds and Gary Beach and Roger Bart as Roger De Bris and Carmen Ghia they gay \"couple\" who want to put Springtime for Hitler on the stage, both stand out in the cast, and both played the roles on Broadway. Other familiar faces you will see are Jon Lovitz as Leo's accounting firms boss, Michael McKean as one of the prisoners and Richard Kind as the Jury Foreman who took over in the Nathan Lane role on the stage.<br><br>Susan Stroman doesn't make the camera cuts flashy, they are simple, which makes it more enjoyable to watch the dance numbers, from the opening number to the hilarious \"Along Came Bialy\" when the old ladies do a dance break with walkers, to \"Keep it Gay\" to the uproarious Springtime for Hitler number. The best-staged number was probably \"I Wanna Be A Producer\" as it has shades from the 30s mixed with modern day. It was wonderful! If you listen to some critics who choose to say \"this film show inexperience\" or \"not as good as the original\" you are missing a terrific movie musical that is just as good as Chicago! Plus Mel Brooks was also standing there at the helm with Ms. Stroman. Be advised to stay until the very end of the credits to view something special! Bravo!","user":"bschneid76","rank":[111,165]},{"title":"Surprisingly Disappointing","rating":5,"date":"14 October 2006","review":"I am a huge fan of the original movie and had the pleasure of seeing the wonderful Broadway show in 2003, so I was more than expecting to love this remake. Unfortunately it didn't live-up to my expectations on a number of fronts.<br><br>Most fundamentally, it seemed more of a cinematic rendering of the stage show than a remake of the movie - the problem is that it utterly lacks the charm of the 1968 film, and fails to capture the excitement and energy of the show. This is not to do with the actors, who all put in great performances and do the best job possible with their roles. Though, I wonder if it was a good idea to keep the leads from Broadway - playing a part on stage is very different from doing the same thing in a movie. This is at the heart of what is wrong with this movie - it is trying to be cinematic and theatrical at the same time.<br><br>Also, they have cut some of the funniest scenes and changed some of the best lines from the original. Why, I wonder? For example, the first encounter between Max and Leo in the original movie is hilarious and dramatic - a magnificent opening set-piece, with drama, humour and conflict. In this version, Leo just knocks on the door and introduces himself. Bit of a damp squib, really.<br><br>Overall, I am not sure what to make of this movie. I would probably have enjoyed it more if I had not seen the original. But not much.","user":"misterphilco","rank":[36,51]},{"title":"Springtime is delightful, in Germany (and for the audience)","rating":8,"date":"19 March 2006","review":"What a fantastic surprise. I've seen Luke-warm reviews about this film, largely saying that the theatrical basis (the Broadway show) is oh-so-evident. Well, in my opinion, this is one of the film's strengths. It's a well-intentioned performance and is close enough to the original Producers, and so unlike it, that the musical remake is justified.<br><br>I love musicals, especially musical comedy. This film is a sop to the musical comedy, with good performances from the leads, and Uma Thurman and Will Ferrell, who all appear to be enjoying themselves.<br><br>The central (staged) number \"Springtime for Hitler\" is brilliantly choreographed, with suitably outrageous costumes. Gary Beach as a brilliantly camp Hitler completes this excellent scene. And the bratwurst!! The editing in this sequence - camera panning to the gob-smacked audience is brilliant. This is a film that salutes and spoofs musicals. It's an absolute delight","user":"philip-ct","rank":[43,63]}]