[{"title":"Surprisingly Good!","rating":9,"date":"21 July 2004","review":"When I was growing up, one of my favourite authors was Isaac Asimov. I loved his books and his ideas about robots. The man was a genius in the way he wrote, he invented the three laws of Robotics, as the very beginning of the movie tells us, they are: 1) A robot can never harm a human. 2) A robot must obey all human orders unless it conflicts with the first law. 3) A robot must protect itself unless it conflicts with the first two laws.<br><br>Because of this and because of the fact that I knew Will Smith was the leading actor in this movie I went into this movie with lowered expectations. I expected to see a corny movie full of explosions and killer robots. <br><br>I did get that, or at least the explosions part, but imagine my surprise when the movie ended up exceeding my expectations and more. Even though during the ending credits it says that the movie was suggested by the books by Isaac Asimov most of the movie seemed to play quite well with Isaac Asimov's ideas about robots. The movie played with concepts that Isaac Asimov played with, if the three laws can be made, they can be broken. And it was an Asimov-ish \"whodunit\" as well. <br><br>Will Smith managed to pull off a stunning performance as \"Del Spooner\", a Chicago detective that is suspicious of robots and is against technology. His acting is much more like his acting in \"Enemy of the State\" than his performances in his other two Science Fiction flicks, \"Independence Day\" and \"Men in Black\". He is a believable character, one that you end up sympathising with as you learn why, exactly, he hates robots so much.<br><br>A highly critiqued point usually comes from the fans of the book in that Bridget Moynahan plays Susan Calvin. It is true that Moynahan as Calvin is much younger than the Isaac Asimov version, but beyond that I found her to be a pleasant surprise as well. She plays her persona very well, delivering a wooden, robot-like performance. She is obvious in the fact that she likes robots much more than humans, and her dislike of Spooner is amusing. Over the course of the movie she thaws a little, but not an incredible lot. I find her to be a believable character. <br><br>The pure stroke of genius in this movie is the robot, Sonny, who at first reminds one of Data from Star Trek. His character evolves over the course of the story, and Alex Proyas does a good job at keeping us guessing at whether the emotional robot is a \"good guy\" or not. <br><br>This movie, which I've now seen twice, has been raked over the coals so to speak in the realm of artistic licence, but I felt that Isaac Asimov, if he were here, would have been rather pleased with this movie. The only two points of conflict, perhaps, would be the amount of violence against actual robots in the story (he was never that violent in his short stories/books) and the very typical Hollywood blow'emup climax, which, yes, smacked heavily of Terminator for a while there. The ending, I felt, repaired and wrapped up nicely, making up for whatever excessive action went on before it.<br><br>Two notes about the cinematography in this movie, first of all, the Matrix scene was not necessary. A character was being chased and did a Trinity pause in mid-air pose, which pulled me out of the movie for a couple seconds. Luckily it wasn't too hard to get back into the movie. Second note was something that I felt was very innovative on the part of Alex Proyas, which was the \"camera moving with moving object\" shots. I noticed at least three of them in the movie. Very nice film work there. I'm sure it will get horribly overdone in the next few years, but for now it is nice. The CGI also gets honourable mention for making the robots meld so well with their surroundings. Finally CGI has reached a point where they don't seem fake, even for a moment. <br><br>In regards to nudity in the movie... I've read a couple of reviews which notice the Moynahan nude in fogged up shower scene, and forget to notice the Will Smith completely nude with no fog shower scene. I must say, as a female viewer it is nice to get the generous end of the stick when it comes to seeing something as, dare I say appealing? as Will Smith's very nicely developed body. <br><br>Lastly and in a point that has nothing to do with the movie and more to do with questions brought up by it-- It took until a day later and thinking about the movie some more that I realized that \"I, Robot\" was also very socially different. As in two of the main characters, including the hero are black males, one woman, and one (male) robot. I didn't find this odd at all in watching it, perhaps because Will Smith is such a recognisable character, but after thinking about it, I felt that this is a very positive sign. It shows, to me, that society is changing. I feel that I wouldn't have been able to see that, even 10-15 years ago and thought nothing of it. I've noticed this before though... that the most gender/social equal views seem to come from science fiction in our media... it is interesting.<br><br>Now, of course the movie does bring up some ethical questions like if it's all right to make a servant/slave class out of robots, etc., but all in all I really liked this movie. Any movie that makes you think is a good movie, any movie that gives you fun, drama, action, mystery, and makes you think is a great movie. Thank goodness I, Robot is all of the above.","user":"Mstrom42","rank":[335,450]},{"title":"Just because it doesn't follow the book doesn't mean that it is not good","rating":10,"date":"16 July 2004","review":"From reading the comments posted by others I got the impression that people mainly rated it low because it did not follow the book. Just because a movie does not follow the original work like the Bible does not mean that the movie should not be given a chance. I read the Asimov book, and I went to the theater with my friend who has not. She enjoyed the movie just as much as I did, if not more. I was fascinated by the angle Proyas approached in the novel, and I did not mind one bit that the movie was completely different than the book.<br><br>Another element of the movie that receives an unfair \"bad rap\" is the acting. It's no worse than the acting in the Spider-Man movies. I am by no means a fan of Will Smith, but I was a fan of Willem Dafoe, and that mirror scene in Spider-Man made me cringe. Might of worked on stage, Willem, but not on the big screen. I did not find myself cringing at any acting in I, Robot. In fact, the only thing over-the-top sometimes was the special effects. Other than that, nothing made me slink down in my seat and cover my face in shame.<br><br>One actor that deserves a shout out is Alan Tudyk. I read many comments where people think he just voiced the character of Sonny. Actually, Tudyk pulled a Gollum. This means he put on a weird looking body suit and actually acting out the scenes. Later, CGI used his performance to model the computer graphic robot. Except for a few obvious actions scenes, Tudyk *was* Sonny. My complements to his performance.<br><br>Hopefully, people will give this movie the chance it really deserves, and not base their decisions on how close it followed the book. I give I, Robot a 7.5/10","user":"KnightsSayNI","rank":[23,27]},{"title":"Excellent film","rating":21,"date":"21 July 2004","review":"The maker of a film adaptation has three choices. First, he can try to translate the original medium as faithfully as possible, striving as much as possible to preserve the spirit and content of the original while re-imagining the story as a film. Peter Jackson's Lord of the Rings films exemplify this approach. Second, he could instead try to capture the essence of the original, while largely abandoning the particulars of the original, as in the intelligently satirical but hard-hearted film version of Starship Troopers. Third, he can try to do something original with the material, drawing inspiration from the written story, but creating a unique film with a unique vision. I, Robot is more the the third than the first or second. While little remains of Asimov's stories in this killer robot metropolitan fantasy, the film is informed by, and offers no disrespect, to the good Doctor's creations. <br><br>Will Smith plays a Jack Slater-styled maverick cop. If it's old, it's good.<br><br>He wears vintage converse, listens to Stevie Wonder, and apparently regards sweet potato pie as a food group. Will Smith's acting is a naturalistic shuffle, a Columbo-like pastiche of mumbling, sarcasm, and unexpected outbursts of charisma and off-balancing interrogation techniques. He delivers his one-liners with unnecessary seriousness. While in Men in Black, he aimed for the ballparks with his power-swinging action-comedy style, here his conscientious style gets in the way, suggesting a character who stands in front of the mirror practicing his zingers like a Tuesday night comic. It's not entirely Smith's fault, as the movie itself can't seem to decide if he's standing in for Bogart or Schwarzenegger, or if the character had a life of his own before the film starts rolling. His performance is intelligent, marred by occasional \"Gotcha, suckaz!\" moments that remind us that all films made in Hollywood are made in Hollywood. <br><br>His opposite, Bridget Moynahan, fits her role more surely. She's an ice queen in the classic action movie tradition, a stiff-necked, self-important, lonely woman who has been absorbed by her work so completely she remains a teenager at heart, awkward, vulnerable, and searching for the approval of others. Moynahan's bug-eyed discomfort and clipped, TV-sarcastic delivery are those of the quintessential comedy sidekick. Nonetheless, in rare moments, she invests the character's personal revelations with warmth, doubt, and a glow of determination and moral purpose. While Smith vacillates between supercop and Bogie, Moynahan seems to have found a happy medium between the Saturday matinée and the midnight marathon, a mixture of fun and humanity with a carriage of seriousness appropriate to what is essentially a monster movie.<br><br>The robot, Sonny, is a character himself, a curious, frightened creature that seems capable of anything. Could Sonny be the murderer? We hope not, and yet, we see the grim possibility that a machine might consider itself more than a human being. We understand Sonny's drive to live and grow. As human beings, we know what lengths we would go to to ensure our survival, whatever the moral charges facing us. <br><br>A top scientist has been murdered, and there are no human suspects, so the powerful US Robotics corporation (no relation to the modem manufacturers) convinces the powers-that-be to consider his unexpected death a suicide. Spooner (Will Smith) alone searches for the truth of the matter, fueled by hatred for robots and a personal debt to the dead scientist. Dr. Calvin (Moynahan) feels his intrusive investigation is unnecessary, although new pieces of evidence appear that gradually shake her confidence. Robots are programmed by the Three Laws to serve humanity, but Spooner is convinced one of the new NS-5 units, a unique prototype, is the murderer. As Spooner gets deeper to the heart of the mystery, the story explodes with robotic violence. Like all good mysteries, the real question is not \"Whodunnit?\" but \"Why?\" The heroes do some things for the wrong reasons, and the villains do some things for the right, rational reasons. Although I, Robot hardly pauses for introspection, it does asks us, \"What makes a human being superior to a machine?\" There are twists and surprises, although in the end, the movie plays out in the only way it can, a band of brave heroes trying to throw the ring into Mt. Doom while the armies of evil march. And yet, the movie leaves us wanting more. What is the future of humanity? How will we control our machines, and how will we prevent the machines from becoming our masters? <br><br>While not as ambitious as A.I., it is more successful, and while not as intelligent as Robocop, it is better played. While the movie does suffer from inconsistencies in mood and philosophy, such hiccups are secondary to the emotionality and drive of the film, its fury of thought as well as action. In moments, I, Robot is a terrifying vision of the future. Too few science-fiction movies manage to scare us with the power of technology, but future shock is vital to the science-fiction story. Modern science-fiction truly began with the detonation at White Sands. The Atomic Age has given way to the Digital Age, but we still have not solved the problem of how to wrest the power of technology from the creatures of the id.","user":"pawsplay","rank":[220,318]}]