[{"title":"On-screen sexual thrills take a backseat to Shortbus' emotional core","rating":9,"date":"5 October 2006","review":"Set in modern-day New York City, a heterogeneous group of straights, gays and transgenders find common ground at Shortbus, an underground salon where people are free to explore their most carnal sexual desires with random hookups and nightlong orgies  sometimes even finding bits of wisdom along the way.<br><br>The superb cast of characters of John Cameron Mitchell's \"Shortbus\" powerfully draws the viewer in to each of the characters' lives and problems. Sofia (Sook-Yin Lee), a sex therapist who's never had an orgasm, seeks out ways to overcome her \"pre-orgasmic\" dilemma, profoundly affecting her marriage. James (Paul Dawson), a former male escort battling depression, goes to ultimate extremes when he can't even seem to feel happiness with his loving and devoted partner of five years, Jamie (PJ DeBoy). Struggling artist Severin (Lindsay Beamish), who succumbed to work as a dominatrix, seeks to have a meaningful relationship with someone  anyone.<br><br>Yes, the on-screen sex is real. And there's lots of it. But rather than displaying sexually explicit scenes for the sake of cheap titillation, \"Shortbus\" is provocative with an actual purpose. We're not in Hollywood anymore.<br><br>While sex is a main focal point in the film, it is not the sole one. \"Shortbus\" deals with all manners of human relations. Not stressing one form over another, it shows how sex, friendship and love continually intermingle. Because one's comfort level with their sexuality mirrors how one relates in all other relationships, showing the raw and carnal aspect of each character so explicitly works beautifully to accurately convey their motivations and struggles.<br><br>In a touching conversation, an old man identifying himself as the former mayor of New York says to the young and naive Ceth (Jay Brannan), \"People come to New York to get laid ... People also come to New York to be forgiven.\" The latter can also be said for those who elect to see this film. Whether dealing with sexual oppression, struggling with sexual desires deemed socially deviant, seeking redemption for having already been there and done that, or feeling generally unaccepted for being who you are, the redemption value in this film is tenderly perceptible. \"Shortbus\" lets us know that gay, straight, bi, transgender, whatever  we all just want to feel accepted.","user":"pullmydaizy","rank":[228,282]},{"title":"Explicit, and that's a good thing","rating":7,"date":"22 July 2006","review":"What everyone will hear about \"Shortbus\" is that the sex is real and explicit. Yes, this is all true. But so is the emotional journey the characters go through. <br><br>Far from being crude or offensive, Shortbus is fresh, insightful, celebratory -- and, most importantly, focused on the fully realized people, not just the bodies, who bare their flesh and feelings on screen. Like Michael Winterbottom, who made the explicit \"9 Songs,\" writer/director John Cameron Mitchell says he wants to show true human sexuality as part of his story. Unlike \"9 Songs,\" which seemed to focus on 1/8 of the full human experience of relationships (concerts and sex), Mitchell's \"Shortbus\" approaches 9/10 of the authentic experience of being human, being miserable, looking to come to joy, and exploring funny, sensual, and affectionate avenues to get there.<br><br>Is \"Shortbus\" provocative? Yes. Is it explicit? Yes! And these are good things in these politically authoritarian times.","user":"Felisfamiliaris","rank":[217,286]},{"title":"For Once, Emotion Trumps Sex","rating":8,"date":"19 October 2006","review":"A married sex therapist doles out relationship advice at work but privately spends her time in search of an orgasm, which she's never had. Two gay men find themselves drifting from one another and introduce a third man into their relationship in an attempt to bring some fulfillment back to their emotional connection. A professional dominatrix excels at abusing clients, but brings that abusive behavior to her personal relationships as well and as a result isolates herself from any true human contact. Meanwhile, all of these characters meet regularly at Shortbus, a sex club where everyone is free to be whatever they want to be, where no one's a freak because everyone's a freak, and where, most importantly, everyone feels a sense of community in a scary post-9/11 world.<br><br>Such is \"Shortbus,\" John Cameron Mitchell's emotionally affecting follow up film to his dazzling debut, \"Hedwig and the Angry Inch.\" By now, everyone knows that \"Shortbus\" contains many scenes of quite explicit sex. As happens with any more conventional film that contains material we are used to seeing only in bona fide pornography, the sex tends to dominate on a first viewing; it's so hard not to be distracted by the explicit scenes and ignore the other things going on. However, it is to Mitchell's great credit that I left the film not remembering the sex as much as I remembered some of the beautiful emotional moments, of which \"Shortbus\" is chock full.<br><br>I saw a screening of this at the Chicago International Film Festival, and two of the actors, Sook-Yin Lee and Lindsay Beamish, were on hand to answer questions. Lee explained what Mitchell was trying to do with this film, and I greatly admire his ambition. She said that he was trying to make an antidote to all of the other films out there that treat sex just as explicitly but in such more negative ways. Sex in our movie culture is usually full of dysfunction -- if it's not downright harmful, it's at best desultory and unsatisfying (think \"9 Songs\"). Our culture condones graphic violence in films, many times in combination with sex, but squirms away from sex as it really looks, even though it's one of the most natural of human functions. Mitchell wanted to illuminate this hypocrisy and show that sex can be fun, sex can bring people together, sex can make you laugh. It can't necessarily solve problems, as the characters in this film realize, but it doesn't always have to necessarily cause problems either.<br><br>My biggest complaint about \"Shortbus\" is that I felt somewhat left out. As a heterosexual male, I don't feel that I was represented by any of the film's characters. Mitchell, as a gay man, obviously has an understanding of gay relationships, and the storyline with the three gay lovers is handled beautifully. But I felt that Mitchell was stereotyping heterosexual relationships in the same way that heterosexuals stereotype gays. The married couple is bored, unfulfilled, caustic with one another. Lee's character can't achieve orgasm until she comes to a sex club and gets it on with another woman. Just once, can't a film show a heterosexual couple who are happy and having a completely satisfying emotional and sexual relationship? I know this wouldn't make for great drama, but it would at least make me feel better.<br><br>I really liked \"Shortbus\" without feeling that it was a complete bulls-eye for Mitchell. At the very least, he has an outstanding talent and has proved himself to be a young filmmaker to watch.<br><br>Grade: A-","user":"evanston_dad","rank":[106,151]}]