[{"title":"This film could DERAIL you!!","rating":7,"date":"13 February 2006","review":"I was a bit hesitant about seeing the film because of the low ratings.<br><br>BUT despite false \"endings\" this is a film worth seeing. The three leads are good, although Clive Owen's character is three dimensional in a way that Vince Cassell's and Jennifer Aniston's aren't.<br><br>There is definitely a chemistry between Clive Owen and Jennifer Aniston, which goes a long way to making the premise of the film \"work\" and also makes the twists so sudden, so plausible, so believable, so odd! It's an atmospheric film aided by good music and interesting \"minor\" characters.<br><br>See this film, willing to suspend disbelief. It's not a great film, often a little implausible. But the genre it creates calls for one to \"go for a ride\" too.<br><br>It is a film that, with twists and turns, will keep you \"derailed\". It's a good thriller, and ends on a positive note.<br><br>Don't be put off seeing it.","user":"philip-ct","rank":[171,247]},{"title":"Spoilers: Ho-Hum","rating":5,"date":"11 January 2006","review":"This movie was incredibly predictable, and required way too much suspension of disbelief: \"Hey, honey, I'm going to teach at a prison so I can murder the guy who ruined my life after I had an affair with his girlfriend...\" Sure, an American suburban housewife is gonna get behind that and stand by her man. And the holes in the \"detective work\" are inexplicable.<br><br>The dialogue was predictable, the acting so-so: Clive Owen had some good moments in spite of the totally unbelievable dialogue, and RZA was rather good. He probably had the best lines, by the way.<br><br>Vincent Cassel chews the scenery in a lovely baddie role.<br><br>Jennifer Anniston is the real mystery here. I disagree with other reviewers who say she really broke out in this role: she tried to go for an enigmatic look, but she usually just looks blank. Which may be realistic in a confidence game, but has to be a lot more lush to be enjoyable to watch (see \"House of Games\" for better \"blank\").","user":"otterswimshome","rank":[13,15]},{"title":"Good name for it","rating":7,"date":"13 June 2008","review":"Clive Owen and Jennifer Aniston are two adulterer-wannabes who are \"Derailed\" from their plans in this 2005 film. It also stars Vincent Cassel, RZA, Tom Conti and Melissa George. Charles Schine (Owen) and Lucinda Harris (Aniston) meet on a commuter train; on the night they take a hotel room to begin their affair, it's broken into by a criminal, LaRoche, who steals from both of them, rapes Lucinda repeatedly, and then continues to blackmail Charles for large sums of money. Lucinda refuses to go to the police, saying that her husband will file for divorce and take her daughter away from her.<br><br>Normally I take a film for what it is, and even if it has holes, if I really like it, I'll accept those holes. \"Derailed\" doesn't have holes. It has gullies. The character of Charles is completely unlikable throughout the film and a constant source of frustration. His diabetic daughter has had two or three kidney transplants, all of which were rejected by her body. For seven years, he and his wife, a teacher, have been saving money for a new antirejection drug coming on the market that the insurance won't cover. And I'm supposed to believe that he just keeps meeting LaRoche, who beats him to a pulp every time they meet, and handing him this hard-earned money that will save his daughter's life. Instead of going to the police, he honors the wishes of Lucinda. Well, forget it. Gulley number one.<br><br>Gulley number two. A young man at the office, Winston (RZA) who has been in prison decides to help out Schine. Knowing how violent and ruthless LaRoche is, Schine and Winston go alone, and Winston has an unloaded gun. Not a wise move. Didn't Winston have any buddies that could have gone along? <br><br>Gulley number three. Schine says he has two mortgages on his house and talks about how they've scrimped and saved. Question: a man, a woman, a child and a dog live in what looked to be a 10,000 square foot home in a ritzy neighborhood - gosh, ever heard of downsizing? Bet the couple of million you'd have gotten for that place would buy a lot of antirejection drugs.<br><br>With a minimum of work, a terrific, exciting, scary story could have been made into a fantastic movie with just a little restructuring and some stronger motives that made sense. Schine really didn't have a reason not to go to the police, even if he said he was mugged and left Lucinda out of it.<br><br>Clive Owen made a big splash in \"Closer\" and was considered for the role of James Bond. He's handsome and a wonderful actor, but if he wants a big-time film career, he's going to have to do better than this. Aniston did a good job as Lucinda, and Cassel was absolutely terrific as the revolting LaRoche.<br><br>At the end of the film, when the action and plot devices really pick up, I realized that the first hour and something had been a real waste. It had been badly DERAILED.","user":"blanche-2","rank":[6,6]}]