[{"title":"Live Free or Die Hard is the best Action film of 2007 and it works for me","rating":10,"date":"16 October 2015","review":"Live Free or Die Hard (2007) is the last good Action film of 2007 in the Die Hard franchise. An old-fashioned cop emerges to foil a high-tech attack on the country's computer infrastructure as Bruce Willis brings back one of the biggest action franchises in screen history. It is one of my personal favorite action movies, it is a sequel I love to death.<br><br>It's been over a decade since audiences last saw New York cop John McClane (Willis), but now, as the world's greatest criminal mastermind (Timothy Olyphant) attempts to cripple the entire country with an innovative act of technological terrorism, only one cop can insure that the integrity of the system stays intact. In this, the fourth installment of the long-running action series, Underworld director Len Wiseman picks up the torch formerly carried by directors John McTiernan and Renny Harlin to helm a script penned by Mark Bomback. <br><br>Best Action Film Of 2007. Even with ratings PG-13 this film works for me. Those four movies of the franchise are the ones I love. When a criminal plot is in place to take down the entire computer and technological structure that supports the economy of the United States (and the world), it's up to a decidedly \"old school\" hero, police detective John McClane, to take down the conspiracy, aided by a young hacker.Well, I can't believe I'm saying this but the newest edition to the Die Hard series may rank with the first. It's superb direction, fantastic acting, groundbreaking special effects and clever scenes, will leave you with (almost) nothing to complain about. Die Hard may very well be the best action flick of 2007. It can be beat, but I doubt by a sequel. I am proud to say that Bruce Willis still has some John McClane left in him. Bruce gets to say one of most famous lines in action film history, \"Yippy Ki-ya Motha ******!\", without cuts, he even gets to talk to himself, a scene that is almost identical to the scene in the air vent of the first film. (C'mon, it'll be fun, come out to the coast, have a few laughs.) About all the controversy for the MPAA rating...it was all useless. Die Hard acts just like a rated R film, just because it says PG-13 doesn't mean its not as violent as the others. No, he doesn't say the F word, but it's not as bad as you think. It's more of a character to character type of thing then anything else. John McClane learns to bond with a young hacker. (Justin Long) It's more...I don't know...\"cute\" then the other movies, it doesn't need the F word. I don't think there is much else to say. Die Hard is one of my best movie experiences to date. The crowd laughed and screamed and then cheered at the end. The only slightest problem I had with this film was the fact that the realism was quite low. Then again, as I have said before, if everything were realistic we wouldn't have action movies. <br><br>Live Free or Die Hard is a must-see FOR DIE HARD FANS.<br><br>Live Free or Die Hard (also known as Die Hard 4: Live Free or Die Hard or simply Die Hard 4 and released as Die Hard 4.0 outside North America) is a 2007 American action film, and the fourth installment in the Die Hard film series. The film was directed by Len Wiseman and stars Bruce Willis as John McClane. The film's name was adapted from New Hampshire's state motto, \"Live Free or Die\".<br><br>I loved the fact it's still Die Hard especially in the Unrated cut. the PG-13 didn't bother me he still told jokes, put a smile on my face gave his tagline &amp; killed the bad guy. But my favorite scene is the Car Chase with the Chooper if I had to pick one. An enjoyable pop projection of post-9/11 anxiety. That said, it also makes you nostalgic for the days when irresponsible action movies didn't have to deal with it. Bruce Willis should not be the victim of facile stereotyping. He brings more heart and humor to apocalyptic pulp fiction than any other actor I can think of offhand. <br><br>That film is great and the last good Die Hard film, A Good Day To Die Hard sucks horrible. Live Free or Die Hard is my favorite fourth film in the Die Hard franchise and this film, filmed in 2007 was great. 9/10 Score: A+","user":"ivo-cobra8","rank":[104,116]},{"title":"Just didn't fit...","rating":6,"date":"29 June 2007","review":"The first Die Hard was probably the best modern action film ever made. The second Die Hard works because the movie has a major sense of humor about how ridiculous it is to put John McClane through such a similar situation again; it practically makes fun of itself for a lot of the movie. The third one works because you have a bad guy that is out for revenge against John McClane. The fourth one though, it just felt like McClane's character was dropped in as an after thought. I don't think you can just drop John McClane into any story and call it Die Hard and this movie felt more like a Tom Clancy political thriller than a Die Hard movie.<br><br>While watching this I at least thought I would let it pass as a generic action movie, because I was having fun. However, then I started thinking about it and I'm sorry I need even my action movies to at least make a little bit of sense. There was just too much stuff in this one that didn't work for me. The first problem I had was that the bad guys created a giant traffic jam in DC causing congestion everywhere except of course for the streets they need for the major car chase scene. Also during the part of that car chase that took place in the tunnel, how come when the bad guy started turning the lights off in the tunnel not a single person though to turn their head lights on? However the biggest action scene that bugged me was the scene where John McClane is driving the big rig truck and being chased by the fighter plane. This scene was so laughably over the top that it had no place in a Die Hard movie. I know Die Hard movies are known for their over the top action at some points but I just could not stop laughing at how completely ridiculous this scene was. Oh and seriously, since when does the 695 beltway around Baltimore have palm trees? OK, that is a bit too nitpicky, but it was kind of funny.<br><br>The film seemed to me to also be extremely inconsistent about whether or not cell phones were working. The cell phones weren't working, so he reprogrammed the phone to use the old \"satcomm\" satellites instead. Then that stopped working and then a little bit later that is working again. Also I'm still amazed at how Kevin Smith's character is still able to hack into so much stuff even after all the power on the entire eastern seaboard has been shut off. I mean seriously there are a lot of servers out there that have battery backups and stuff, but a lot of the servers he would need to go through to have a good enough connection to do any of the hacking he was doing would have been shut down after the power outage. OK, maybe I am picking at too much of the film, but all this bugged me while watching the film and I wasn't able to just sit back and get sucked in like I would in any other Die Hard film.<br><br>The acting in the film for the most part was pretty good, except of course for the main bad guy. He had one facial expression for the entire movie and the tone of his voice never changed. His only way of showing anger was to throw something off his desk. His performance was so wooden; it just paled in comparison to Alan Rickman, William Sadler and Jeremy Irons, who all three just played wonderful bad guys.<br><br>The look and feel of the movie didn't feel at all like a Die Hard movie to me either. Sure, John McClane takes a good beating like he does in all the films but all the action seemed to crisp and clean. It didn't feel nearly as gritty as the previous Die Hard films. Also one of the things I noticed was the film seemed to have this predominantly blue color scheme going on. It just felt like there was this blue hue through out the film, where in the previous Die Hard films the predominant colors are very earthy and red. I don't know if anyone else even knows what I am talking about, but that is just something that I noticed that took away from the gritty Die Hard feeling.","user":"Rick_Bman","rank":[176,230]},{"title":"This movie is not only \"Die Hard\" x 4...","rating":9,"date":"23 June 2007","review":"...but literally a quadruple serving of awesome \"Die Hard\" action.<br><br>My girlfriend and I saw \"Live Free Or Die Hard\" at a premiere screening last night at Radio City Music Hall. The place holds about 5,000 seats and it was packed. <br><br>With an 8:30 start, we got to our seats by 7:30. The movie didn't begin until 9:30!!! Guess who was late?<br><br>Julie and I are not particularly big 'Die Hard' fans. And having to catch a train home from Grand Central station at a certain time, we both agreed that if the movie was sub-par, we would split early to get home earlier.<br><br>So finally the lights go down around 9:20 and out comes Bruce Willis. He respectfully apologized and then started jazzing up the audience for the film. The excitement was palpable as the crowded theater whooped it up with Bruce shouting \"Are you ready!!!\" <br><br>Well, Julie and I were, as we got swept up in the excitement and cheered aloud as if we were at the ball game. Even the couple next to us, I'd say they were about in their late sixties, dressed very 'proper', were just as energized. <br><br>The movie starts and a mere few minutes in, the action explodes. By twenty minutes into the film, Julie and I were sold. Who cares what time we're gonna get home!? <br><br>I have not had this much fun at the movies since I can't remember when. I have always loved summer movies, but only the ones that deliver the goods. The action sequences are top shelf, 21st century movie making brilliance. These explosive scenes are a seamless composite of fantastic, real world stunt work, and exceptional CGI. Hands down, they make the film. And for an action movie with 'die hard' in the title, I'd say that was the point.<br><br>It was awesome watching this film with so many people because it was like riding a gigantic roller coaster, with everybody having a shared, hair raising experience. People were cheering like when Luke blew up the Death Star. The humor throughout was just right. By the end of the film, our senses were stunned as we dizzily made our way out of the theater, thoroughly entertained.<br><br>Excellent summer movie! Well done Bruno and crew!","user":"dv909","rank":[674,1]}]