[{"title":"Disney Got The Characters Right In This Sequel","rating":10,"date":"13 September 2015","review":"After more than four decades, Disney made a sequel to the original film. Years before the sequel was release, the franchise include a live-action film, and an animated TV series. For many years, although I see a lot of stuff related to the franchise, I hardly care. This was until I saw an ad about a blu-ray of the original film. From there, I begin to research the franchise.<br><br>When I read info about the first film, I noticed a lot of the male pups are played drag kings. I was kinda disappointed by that. Talk about stealing a guy's a job. But thankfully, Disney did the right thing in this sequel by using child actors for those pups. The studio should keep it that way.<br><br>I look forward to another sequel, perhaps a Christmas-themed one.<br><br>For a long time, I thought the live-action film was the only one that has a sequel. But then I found out the animated one has too.","user":"terrigunmor","rank":[15,17]},{"title":"A one-of-a-kind pup, a canine superstar, a backstabbing sidekick mutt, and much, much more...","rating":20,"date":"20 August 2003","review":"My opinion for the movie is funny and great! Patch \"felt lost in a sea of spots\". I know. That line is getting old, but SO WHAT!?<br><br>Patch soon meets his hero, Thunderbolt, in a contest. But, with his bad bark (\"Who sat on a squeaky toy?\") It's obvious he's not going to win.<br><br>Meanwhile, Lil. Lightning, Thunderbolts spunky (and, I must say, kinda cute) sidekick has turned dark in the lead dog's shadow. Good pun, huh? Anyway, he tricks Thunderbolt into thinking he's going to be killed off the show and replaced. And that the only way to remain on the show would be to do something heroic in the real world. Thunderbolt falls for it.<br><br>As for Cruella de Vil? She's being kept out of every fur shop in London, as part of her parole. She soon meets up with pop-artist, Lars, who works on painting spots. She decides to give him an inspiration by re-stealing the puppies and giving them to him as a gift. But Lars quickly rejects when he learns what Cruella plans to do with them.<br><br>As the trailer says, this movie shows the difference between acting like a hero and being one. It also shows that you can be a one-of-a-kind if you put your mind to it. One minor lesson is that if at first you don't succeed, try, try, and try again.<br><br>Patch is a good-hearted adventurous pup, Thunderbolt is the fame-loving canine superstar, Lil. Lightning is his spunky and cute backstabbing sidekick mutt, Cruella is not allowed to buy furs, Jasper and Horace are scared of her, her car is still broken down from what happened in the first movie, Pongo has a bad habit of loosing count of the dalmations... it's hard to write down in one review every piece I like about this movie.","user":"DanMat6288","rank":[21,25]},{"title":"Not Bad....","rating":25,"date":"25 January 2004","review":"Coming from a parent who cringed and groaned all the way through Little Mermaid II, Cinderella II, and just about ever \"II\" Disney has inflicted on the public, this one wasn't bad.  It kept the spirit and fun of the first, didn't get too sticky sweet, and just had a good time with itself.<br><br>Although the animation is on par with other direct-to-video releases (read: poor), had Dinsey put a little more into its development, they could've had a nice theater release on their hands.  How the potential films like this are ignored, but the embarrassing Jungle Book 2 was release in theaters, I'll never figure out.<br><br>My daughter loves this one and, while it's no Toy Story, I can gladly sit through it to keep her attention away from Care Bears: The Movie.","user":"hendmik","rank":[11,13]}]