[{"title":"Well Acted, Well Crafted and Yet a Little Disappointing.","rating":7,"date":"2 April 2005","review":"A great deal of viewers will pan The Clearing for being too \"not down to the point\", an intelligent suspense thriller about a wealthy man (Redford) kidnapped by an angry ex-employee (Dafoe) and held for ransom until the rich business owner's wife (Mirren) pays the price. Although The Clearing is creatively put together, I just doesn't get right down to the point. What you expect it to be is a kidnapping thriller but it turns into mostly a big discussion between Redford's character and Dafoe's character. Not that that is an insult to the film, their discussions are very carefully and skillfully written, it is just that we are expecting this movie to go places, it doesn't go.<br><br>The other half of the film consists of Mirren's character dealing with the F.B.I. and the kidnapper to get back her beloved husband. Her part of the film also consists of her chats with her two grown up children (played by Laurel Canyon's Alessandro Nivola and Soul Survivor's Melissa Sagemiller) who are visiting from out of town to comfort their mother in her time of need. The scenes of dialogue between Mirren and her son are very engrossing due mostly to the fact that Nivola is a great actor. However, the scenes of dialogue between Mirren and her daughter are perhaps the most tedious parts of the film, due mainly to the fact that Sagemiller is not a good actress, and unfortunately we get to see more of the scenes between Mirren and her daughter, then scenes with Mirren and her son. The most intriguing of Mirren's interactions of the film, is that of her and the F.B.I. agent in charge of getting back her husband, played by Matt Craven in one of his very best roles. In a whole, The Clearing is a film about interactions rather than actions.<br><br>The most rewarding element of Pierre Jan Brugge's The Clearing, is perhaps the acting. All three leads are pitch perfect in their roles, with talent to spare. Robert Redford gives us another great performance that was long awaited. Willem Dafoe is priceless and the meticulous and spooky kidnapper. I think Dafoe's role is the most interesting out of the bunch, but maybe unintentionally. In the hostage scenes with Dafoe and Redford, you're supposed to pay close attention to Redford's stories, but Dafoe's reactions to the stories turn out to be way more interesting. I think the best performance in The Clearing (which may be honored with an Oscar or at least Golden Globe nomination) is Helen Mirren as the intensely worried housewife of Robert Redford. She reels you into to feeling her emotions about this horrible and stressful situation. It takes real talent for an actress to do it, but it takes even more talent for an actress to do this without opening her mouth. That is what Helen Mirren achieves in this film, among many others she's been featured in over the years.<br><br>The ending of The Clearing is very disappointing. Although, it's realistic and not hokey, it leaves a lot of questions unanswered. In the last fifteen minutes of the movie they lead you down the garden path into believing everything will be made clear at the end, and don't go through with it. The ending of the film will sit with you better a day after you've seen the picture then it will two seconds after the credits start rolling. You'll realize this was a smart unexpected way to end it, and that it was okay to not add everything up, because in real life not everything always adds up. I think the people who would be most disappointed in The Clearing, are those who watch a lot of television during the week. The reason being is that on television everything is neatly put together in a package and there are no loose ends in the final moments, but on film that doesn't always happen. I think film scholars would appreciate The Clearing substantially more than then the general public.<br><br>In closing, this is a good, not great, but good film from first time filmmaker Pierre Jan Brugee. Brugee does a sensational job for his first picture, and presents himself like he's been doing film-making all his life. He is a very bold filmmaker, with a lot of confidence that I'd like to see more of in the not-to-distant future. (review written 8/16/04) Grade: B (screened at AMC Deer Valley 30, Phoenix, Arizona)","user":"MichaelMargetis","rank":[59,68]},{"title":"A meditation on loss and regret","rating":8,"date":"12 July 2004","review":"Wayne and Eileen Hayes appear to be the ideal couple. They have a successful business, live in a wealthy Pittsburgh suburb, and have two well-adjusted grown children. But when Wayne is kidnapped at gunpoint and held for ransom by a former employee, cracks in their armor begin to show. Based on the kidnapping of a Dutch industrialist, Pieter Jan Brugge's The Clearing shows two different takes on the American dream. <br><br>Robert Redford plays Wayne, a self-made car-rental executive who has become emotionally estranged from his wife and children. Willem Dafoe plays Arnold Mack, an unemployed man who sees himself as a failure and is unable to handle the success of his one-time employer. The film tells parallel stories that operate in different time frames, a unique device that deepens the puzzle. One thread revolves around Wayne, handcuffed and held at gunpoint by Arnold, being led through an area near the Great Smoky Mountains. The other revolves around Eileen (Helen Mirren) and her interactions with FBI investigator Ray Fuller (Matt Craven) who has set up his unit as a control center inside the Hayes home while the couple's children look on.<br><br>Redford is outstanding as the intense business tycoon, and Mirren gives one of her best performances, portraying a tightly controlled suburbanite wife who refuses to panic even when her husband misses a dinner party she told him to be on time for. She keeps going even when it is obvious that something has gone wrong -- swimming in her pool, holding a birthday party for her grandchild, and waiting before calling the police because she thinks that her husband may have left her. Eileen discovers through the FBI search of phone records that her husband has continued seeing another woman, a relationship he'd told her was broken off. She visits Wayne's mistress (Wendy Crewson), and retains her composure, showing emotion only in the way that she purses her lips. Always self-assured, she wants to know only where their trysts had taken place and what gifts he had brought her.<br><br>As Wayne and his abductor walk through the forest, they engage in conversations about their lives and about opportunity in America. Wayne says that he made himself what he is today, and that Arnold had the same opportunity but failed. Both play a cat-and-mouse game, but treat each other with grudging respect, and it is clear that they've both paid a price. Wayne admits that his he has lost the love of his wife because of his overindulgence in his work, and the lack of attention he paid to his children. He tells Arnold, \"I love my wife... we have two beautiful kids, and I'm just getting to know them.\" <br><br>The Clearing is a quiet, thoughtful film that slowly builds suspense that is not released until the very end. Although there are some contrivances in the plot, the acting is superb throughout and the film works as a psychological thriller, a meditation on loss and regret, and a character study of two flawed but loving people who have forgotten how to express their joy in living.","user":"howard.schumann","rank":[74,92]},{"title":"Not so bad","rating":7,"date":"2 January 2005","review":"After all of the negative reviews I read about this movie, it was with reluctance and groaning that I agreed to watch it when my wife picked it out. I fully expected a bomb. What a pleasant surprise. \"The Clearing\" is, as many have pointed out, a slower moving film. Just because there is no action does not mean a film is bad. \"The Clearing\" is a drama with two story lines moving along in parallel. There is interesting dialogue building up to an uncertain climax. \"The Clearing\" held my interest and developed suspense. With an only 90 minute running time, I kept wondering how they were going to wrap everything up. And that is the strength of this movie. It is not formulaic. You will not guess the ending. All of the loose ends in both plot and character development come to a conclusion in the final minutes. All in all, much better than expected and well worth renting. 7/10","user":"toddinvestor","rank":[33,39]}]