[{"title":"Sometimes, dead is better.","rating":3,"date":"6 May 2012","review":"Admittedly, you could have taken a 6 inch brush and coloured me sceptical for this one. I am a huge fan of the original Wicker Man (less so of the Nicolas Cage version) and so it was with apprehension and doubt that I ventured into this sequel of sorts. The one saving grace may have been the close involvement of Robin Hardy, the original author and director of the Christopher Lee classic.<br><br>Lee was pencilled in to star in this movie but unfortunately health problems excluded him from doing so, his appearance is stripped down to a very incidental flashback scene, yet his name still rides high in the opening credits. This is only the first disappointment that you will experience when it comes to The Wicker Tree.<br><br>It is essential to be fair and state that it is far from the worst horror movie you will see this year, as it has a certain amount of redeeming features. The problem is the unfortunate fact that it will always have to stand comparison to the original, a movie which has cemented itself as an indisputable classic.<br><br>One of the primary difficulties which The Wicker Tree stumbles to overcome is the overall tone of the movie. It can't seem to decide whether it's a knowing and acerbic in-joke, a serious thriller or a humorous homage to its predecessor. This is one of the main reasons that it fails to have any definite resonance with the viewer, although it doesn't make it difficult to watch. There are some beautifully composed shots of the unforgiving Scottish countryside and a particularly handsome raven, but there's so little going on under the surface that it quickly becomes the equivalent of a rushed meal at a fast food restaurant, complete with the subsequent guilt, nausea and comedown.<br><br>The American leads are satisfactory in that all they have to do is play vacuous Evangelist Christians, sent over on a mission to the remote Scottish village. The villagers are played for comic relief rather than any form or actual menace and so the inevitable 'scene' that we're all waiting for the entire movie is played out like a community centre theatrical production of The Wicker Man, only with a slightly bigger budget and more actors.<br><br>If you're a Hardy obsessive, by all means give it a shot. If you're unfamiliar with the movie's origins, you'll probably get a few laughs out of it, but that's hardly what one would expect when a story comes from such good original stock. A missed opportunity.<br><br>More reviews available at zombiehamster.com","user":"cjmccracken","rank":[20,21]},{"title":"Wicker basket case","rating":4,"date":"22 June 2014","review":"Did we really think writer/director Robin Hardy could better \"The Wicker Man\", that masterpiece of horror, which along with William Friedkin's \"The Exorcist\" defined the genre in the 1970's? It was a tall order, but he did come up with one surprise - he more or less repeated himself.<br><br>A couple of born-again Christians, 'Cowboys for Christ', Beth Boothby (Brittania Nicol) and Steve Thompson (Henry Garrett), cross the Atlantic on a mission to spread the Lord's word to the spiritually challenged flock in Scotland. After meeting a local laird, Sir Lachlan Morrison (Graham McTavish), they are directed to Tressock, a community that has an infertility problem caused by a leak from a nuclear power plant.<br><br>The innocent couple become central to the town's May Day festivities, involving human sacrifice to get the community's seed germinating again. All conspire against them except for Lolly (Honeysuckle Weeks), the head groom on Sir Lachlan's estate.<br><br>We know how it will end because there was no mercy for Edward Woodward in the first version so we don't expect any for Beth and Steve in this one.<br><br>The problem with knowing the basic premise is that the only tension comes in seeing how the ritual will be carried out. However, for some reason, Hardy holds back - we see nothing that compares to the anguish of Edward Woodward locked in his blazing wicker prison in the 1973 film. The Wicker Tree itself is an artistic looking number, but it doesn't project the menace of the giant wicker cage of the original.<br><br>Where the \"The Wicker Tree\" breaks from \"The Wicker Man\" is in the attempts at black humour; the naive Beth and Steve are treated as somewhat comic characters, as is Beame, Sir Lachlan's head man, who is involved in a number of jocular bits of business such as being stabbed up the kilt with a broken glass; it's hard to know quite how to take this movie as it changes mood at odd times.<br><br>The film doubles up on a couple of elements from the original, namely the number of sacrifices and the amount of nudity. Honeysuckle Weeks sheds her \"Foyle's War\" khakis and everything else for a couple of airy romps, including a brave effort in a chilly Scottish stream.<br><br>Although it's nice to see Christopher Lee back for a little homage, the biggest problem with \"The Wicker Tree\" is that it pays just too much homage to the original movie. The most important sacrifice of all would have entailed letting go of the old plot and heading off in a new direction.<br><br>Instead of a lop-sided remake, maybe a follow-up to the original would have been a better option - by 2011, the number of disappearances on Summerisle would have reached epic proportions with the supply of wicker also running dangerously low. At least that approach may have provided a few surprises.","user":"tomsview","rank":[9,9]},{"title":"Oh dear !","rating":3,"date":"6 May 2012","review":"Difficult to describe just how bad this attempt to bring up to date the Wicker Man story is without totally dissecting it and going into detail, but frankly it's just not worth that kind effort. Some of the acting is okay - though the two American leads are both pretty poor - and the direction is competent, that's all the positives done and dusted ! The storyline doesn't work very well, the music is absolutely woeful and completely wrong - unlike in the Wicker Man where it was perfect and added greatly to the atmosphere - and the sense of realism you get from the original is totally missing here. The film feels and looks a bit like a fairly low budget Hollywood remake, a real surprise considering they were both made by the same director. I'm not going to waste any more time and energy on this very poor effort, except to say that it's only highlight for me was a comedy scene and if you love the truly classic Wicker Man, do yourself a big favour and stay well away from the Wicker Tree !","user":"LeeVanNero","rank":[34,41]}]