[{"title":"Sometimes, You Have to Hide in Plain Sight...","rating":10,"date":"26 October 2006","review":"Who said that they don't make films like they used to? A couple of weeks ago, I declared that \"The Departed\" was the best film of 2006. Last week, I replaced the Scorsese epic with Sofia Coppola's luscious biopic of \"Marie Antoinette\". I never would have guessed that Paul Verhoeven (Yes, the Paul Verhoeven who directed \"Total Recall\", \"Basic Instinct\" &amp; \"Showgirls\"!!!) would challenge them both with a gripping, edge-of-your-seat World War II yarn.<br><br>I use the old-fashioned term, yarn, because \"Black Book\" is very much a film that feels like it was made decades ago. The lush visuals, orchestral music, European styling, wartime romanticism and cliffhanging chapters all add a certain 1950's charm to the white-knuckle plot. One gets the feeling that the ghosts of Gregory Peck, Hedy Lamarr, Ava Gardner, Spencer Tracy &amp; Jean Harlow are embodying the cast of this classic espionage drama.<br><br>The film begins in 1956 with Rachel Steinn, a school teacher at an Israeli kibbutz, being accidentally found by an old acquaintance, who is on vacation with her husband. The meeting brings back painful wartime memories and Rachel heads to a quiet place by the river to recollect our central story.<br><br>So back we travel, to occupied Holland, circa 1944, and we see a more youthful Rachel, diligently practicing a bible passage in order to earn a meal from the family who is hiding her from the Germans. She, like many Jews at that time, were surviving by any means necessary in order to outlast the Nazi tyranny. However, one day, while flirting with a young man sailing on the nearby lake, her safe zone is destroyed in one fell swoop by a low flying bomber. Rachel is immediately on the run, aided by her new sailor friend.<br><br>So much of this film relies on surprises and shocking twists that it would be unfair of me to detail too many plot threads. And my goodness, there are a tons of them. This is truly a definitive epic, in every cinematic sense of the word. Rachel is crossed and doubled-crossed and triple-crossed, eventually winding up as a member of the famed Resistance. Via cunning and fortunate circumstance, she manages to transform herself into Ellis de Vries, a blond bombshell who infiltrates the German command in the area. She uses a quick wit, a gorgeous voice, some feminine charms and a collection of Queen Wilhelmina stamps to crawl her way into the arms of Herr Müntze (Sebastian Koch).<br><br>From deep within the Nazi camp, she is able to strategically plant a microphone and to use tidbits of acquired knowledge in order to provide the Resistance with vital information and plans. While evolving into a brave spy, she must learn how to reconcile her own personal vendettas and her surprising romantic feelings for Müntze.<br><br>There are no more exciting themes for me in movies than tragic romance, espionage and escape. I have loved them all with a passion ever since I was a small child. Throw in a magnificent screenplay, marvelous cinematography, a plot that churns along with the efficiency of a Swiss watch, and the added bonus of a gorgeous actress -- the result is sure to be a huge winner for me. \"Black Book\" satisfies everything that I truly want from a film. It is the reason I go to the movies. I was utterly swept away by the intrigue, drama, romance and tragedy. This emotionally weighty film even manages to deliver a few wonderfully witty moments to break the supreme tension of it all.<br><br>The cast is immense. Every one of them exudes authenticity. It is one of the best ensembles of the year. However, I struggle to call it an ensemble because it would be ignoring one of the singular performances in recent memory. Carice Van Houten is not a household name to most. She is a Dutch beauty who, if this role is anything to go by, is on the verge of a magnificent career. Her grasp on the emotional turmoil of Rachel/Ellis is of profound proportions. It is a stunning turn that flatly demands award consideration. The range on display in this movie is astonishing. Rarely have I ever been as moved by a character's heroism and charm and guile and wits. She is able to create a sympathetic creature... one that we will root for until the end... one that we trust and believe in.<br><br>I cannot leave this review without admitting to my utter admiration for Paul Verhoeven, a director whose films I have often enjoyed and panned in equal measures. This is the work of his lifetime. It is the film he should list above all others on his résumé. This is a thoughtful, poignant and tremendously thrilling adventure. For attentive viewers, the final scenes of the film act as a provocative meditation on the relationships between war and justice, peace and insularity, the actions of the past and the promises of the future. \"Black Book (Zwartboek)\" is not only a riveting WWII adventure, but a superb contrast of morality -vs- reality.<br><br>TC Candler IndependentCritics.com","user":"tccandler","rank":[359,401]},{"title":"Hold on for an epic thrill ride","rating":9,"date":"25 September 2006","review":"I attended the North American premiere of \"Black Book\" at the Toronto International Film Festival. Although my main interest lies in independent film, and I did see many indies as well as foreign films and documentaries in Toronto, I also saw a few of the \"Gala\" selections. Of those \"big movies\" on my list, the one which impressed me the most was this Dutch production from Paul Verhoeven. Set in Nazi-occupied Holland during World War II, the film centers around a young Jewish woman named Rachel, who changes her name (and hair, and personality, and more) to Ellis and enters an odyssey of determination and sheer luck in an effort to survive what would otherwise be certain death.<br><br>Make no mistake about it: this is an epic in the true sense of the word. The visuals are stunning. Everything about the production from the sound to the effects to the score says \"big budget.\" The story is chock full of more twists and turns than just about any film I've seen in this genre. And just when you think that, perhaps, Verhoeven is beginning to stretch the bounds of credulity, you realize (at the end credits, if not before) that \"Black Book\" is based on fact.<br><br>Most of all, the film's power is due to the magnificent acting of Carice van Houten. Her Rachel/Ellis is a character so unique, so original, that it holds up against the great heroines of contemporary cinema. Combine her marvelous performance with a wonderful story and superb production values and you end up with a thrill ride from start to finish. \"Black Book\" left me breathless.","user":"larry-411","rank":[276,324]},{"title":"Excellent WWII thriller","rating":8,"date":"15 September 2006","review":"Saw it at Toronto Int. Film Festival with Paul Verhoeven and Carice van Houten on stage. This movie has Verhoeven's trademark stamp all over it. It's evident this film was a more personal project for him. Non stop action and good acting, especially from the lead actress, Carice van Houten. I've seen other films (American and French) about Resistance fighters during WWII, but non of them gripped me by the throat like this one. I admit Verhoeven is at times a bit heavy-handed, especially the sound effects of German machine guns, but the story never sags. It's a \"By the seat of your pants\" type of movie. After you leave the theater, the impact of the story stays with you for days. Go and see it when it comes to your local cinema in North America. I highly recommend it.","user":"adriaan-dekkers056","rank":[215,267]}]