[{"title":"From a Middle-of-the-Road Guy","rating":22,"date":"22 November 2004","review":"A little background on myself for some perspective: I'm a middle-aged Roman Catholic single father of three, who attends church regularly (a few times per month) and generally leans a bit toward the right. I'm certainly not fanatical, but am somewhat spiritual. And just to clear up any misconception, Catholicism is, in fact, a Christian religion.<br><br>My teenaged son and I watched this movie together, and I don't know his impression specifically, but he did watch the entire movie, which is generally an indication he likes it. I enjoyed the movie as well, and did not find it to be in the least bit mean-spirited or anti-Christian. The main character never denounces God, but merely changes her perspective to one that's a bit less fanatical. The fact is, some people do go to extremes in their religious zeal (anyone familiar with 9/11), and simply depicting such a character in a movie hardly makes it anti-Christian. I think this movie represented a very accurate cross-section of religious attitudes in our society. If you are a religious zealot, or anti-religion zealot, you probably won't enjoy it because it doesn't lean in favor of either extreme. All others may find it worth the price of the rental.<br><br>And just to address some of the other reviewer comments - not wanting to regulate morality does not make one immoral, and if you think your sexual preference is a choice, think back to the time you CHOSE to be heterosexual.<br><br>Come now, you surely must remember a significant decision like that (and no, I'm not gay).","user":"jordan2240","rank":[258,325]},{"title":"Funny, Sharp and genuinely Sweet","rating":8,"date":"5 June 2004","review":"This film exceeded my already high expectations. The director and screenwriter have delivered an amazingly acute study of high school dialogue and interaction, while simultaneously exploring the polarizing landscape of evangelical Christianity in America and still delivering consistent laughs from start to finish.<br><br>The acting is superb. Martin Donovan (who routinely shines in Hal Hartley's films) here nimbly deconstruct his familiar grim sociopath persona to depict one of the most nuanced anti-heroes ever seen in a teen film. Jena Malone continues and deepens her fine work from Donnie Darko, creating one of the most moving teen heroines in memory. Eva Amurri is an inspired bit of casting as the multi-faceted school rebel who's full of surprises. And... it's true, Macaulay Culkin can act-- and even carries more than one scene with his understated comic timing<br><br>The storyline itself often leans on contrivance, but the situations presented ring true with an emotional depth rarely granted to pre-adult characters, and none of the events will seem off the wall to anyone familiar with modern adolescence or this particular religious subculture.<br><br>The film is blisteringly funny, unusually sharp in its look at different types of people and their individual frailties, and sweet-- possibly even, despite what else you may have read elsewhere, too sweet. The ending is the softest spot in the movie, but draws effectively on the hard-won empathy for each character to float to a graceful (ahem, pun intended) stop.<br><br>To be perfectly honest, as a reviewer who grew up in a very similar environment, I have to say that if the filmmakers could be accused of any distortion of the truth, it is in making their 'villains' *too* sympathetic, too keenly aware of their own flaws, and, in the end, too readily aware of a larger world around them to accurately reflect the worst elements of this belief system. All of the less-sympathetic characters in this film could be drawn from a documentary (yes, even Hilary Faye!)... if, that is, the documentary chose to edit out their least savory moments.<br><br>Of course, there are many good-hearted, well-meaning evangelicals in the world, and they are ably represented by characters such as Mary's mother, who makes mistakes, but who thinks more with her heart than her dogma. But the indignant critics who are so intent on finding a mote in the director's eye, because he dares to show how twisted some of their fellow believers might be, might stop for a minute to wave a hand in front of their own face, or their neighbor's, where they may just find a log they've been trying to ignore.","user":"ian23","rank":[104,128]},{"title":"A good wake up call for the evangelical church","rating":15,"date":"15 November 2004","review":"I recall the controversy surrounding Saved when it came out earlier this year, especially from the evangelical church, conservatives and fundamentalists. I wanted to judge for myself its merits, or lack there of, since I've been an evangelical for 30+ years. I felt the movie did exactly what it intended to do; bring to light the hypocrisy of the church. I don't see how anybody, Christian or non-Christian could miss the message. I thought the selection of actors and actresses for the cast was right on, with each doing a very good job of portraying the personality of their characters well. I'm sure the movie was particularly biting to many evangelicals, as it should be--it even 'stung' me in a few places. I could see how evangelicals and conservatives would be outraged. However, the one thing I was especially struck by was the fact that this movie was written by non-Christians. As I watched all the 'digs' on Christians and the points of the evident hypocrisy within the church and Christianity, I came to a conclusion; if this movie was written by a non-Christian, then obviously there is a significant segment of our culture who believe the 'church' really is like this. If anything should move we evangelicals to start living lives of authenticity that reflect the love and grace of Jesus, this movie was it!","user":"kdillman","rank":[178,243]}]