[{"title":"An excellent character study despite its flaws","rating":7,"date":"9 October 2002","review":"Mamoru Oshii's first two \"Patlabor\" films were excellent, both incredible and atmospheric pieces of work that always focused on characters first. For the third movie, you will find almost none of the original production staff involved but for Kenji Kawai, longtime Oshii composer.  This said, I entered into the experience skeptical and was pleasantly rewarded.<br><br>WXIII, which stands for \"Wrecked 13\" for an almost indecipherable reason, is a fitting continuation of the series that gets occasionally bogged down in a ridiculous \"big monster\" plot.  Much like the second film (arguably Oshii's best), fans should note that the main characters of the regular Patlabor series appear only incidentally.  Asuma and Noa are the first members of Unit 2 to make an appearance,  in a non-speaking part, almost 30 minutes in! Goto and Unit 2 don't have an actual speaking role until the last 20 minutes or so of the film.  The movie focuses entirely on Detective Matsui, now older and on the injured list, and his young partner.  Viewers of the first two films will recognize them, and it's a welcome exploration of their lives.  In essence, it's a detective story, although the outcome is never really in doubt.<br><br>What makes the film so enjoyable is the excellent characterization of the detectives.  The monster plot-line is fun at points and ridiculous most of the rest of the time, but thankfully it's spread out pretty thin.  There are some beautifully composed shots, the music is spot-on, and the script is clever and in keeping with the tone of the first two films.  There are some annoying plot holes that a Kazunori Ito script would have avoided, but it is overall a good effort from the new screenwriter.<br><br>Those expecting an action-fest will get a couple of fun, suspenseful moments, but otherwise look elsewhere.  But fans of solid drama and intrigue will be rewarded.  The Japanese DVD has excellent subtitles and a number of fun extras, so if you have an all-region player I would recommend it for your collection.  Patlabor 3 is very good film that, despite its flaws and the reputation of the previous films, succeeds in the right places.  7 out of 10.","user":"mike-1145","rank":[10,11]},{"title":"Ever-so-slightly-Above-average anime thriller (With its share of flaws)","rating":6,"date":"10 January 2009","review":"Last week on SBS, I managed to catch Patlabor 3 at one p.m. Wow. Thankfully, it was the one anime that wasn't airing at midnight or one in the morning, like SBS always does. <br><br>Starting off, you'll notice the lackluster voice acting in the English dub. It sounds monotonous to the point of blandness. Blandness is also a problem with the character designs, as the main character (who resembles the garbage-truck guy in Ghost of the Shell)'s eyes are reminiscent of the creepy dead eyes problem in The Polar Express. Most of the characters are Average Joes and Janes, but then again this isn't an extreme action anime like Bleach or Dragon Ball.<br><br>Instead of the thought-provoking philosophy of the previous Patlabors (and also largely to blame for the directorial absence of Mamoru Oshii) we're treated partially to a monster film, which takes away a lot of the thriller aspect. I mean, really, couldn't the writing team come up with some thing a little better? Well, at least we have good animation.<br><br>To finish, if you enjoyed the previous films, you might want to pick this up, but if you're looking for a deep and philosophical film like Ghost in the Shell or The End of Evangelion, you might let it pass.","user":"gdayclay","rank":[4,4]},{"title":"A Stunning Return For A Classic Series","rating":12,"date":"12 December 2002","review":"I've been an anime fan since i was 11, and now, in the year 2002 over 10 years later, i'm delighted to say that i still find such remarkable titles such as this. As a standard mark....my favourite anime movies include.....Akira, Jin-Roh, Princess Mononoke, Cowboy Bebop, Grave Of The Fireflies, Wings Of Honneamise, and so on.<br><br>The first Patlabor movie was one of the first anime i ever saw, and whilst it is now finally starting to show its age, it's follow up remains a benchmark in both the standards of animation and story-telling that animated features have managed to achieve. And being directed by the now legendary Mamoru Oshii who would expect anything less. But for the third film the Patlabor usual suspects disperse and let a new team handle it with the only consistant contributor being the finest composer in animated or live action films in the east... Kenji Kawai.<br><br>Importing the japenese dvd i was salivating at the chance to watch this highly anticipated sequel and a day after i've finally managed to qualm my excitement to review it.<br><br>I have to say that i was blown away by this flick. The animation is continuously gorgeous and at times just ridiculously beautiful with an attention to detail that i have never seen before. The characters aren't going to be easy to get to know if you've never seen any of the other Patlabor films or series, but center here around the detectives rather than the Labor operatives themselves. Its a wonderful touch to see the regulars of the series wander about in the background in certain scenes following their perspective of the film that would usually be what we got to see. The story is quite remarkable. Not because it's not slightly familiar to this sort of anime (especially the sub-dued, dreamlike government conspiracy plots that tend to regularly be used on the Patlabor flicks) but because it's pulled off with an elegant ease and makes far more sense than most people would probably give it credit for.<br><br>Not wanting to give any of the deliscious surprises away....this film plays out like a cross between Patlabor 2, a Tom Clancy novel, and a hefty slice of Godzilla. That's right. I really don't want to say anymore about the plot though. The animation style is the very best of both worlds comprising of Jin-Roh style realism set to Ghost In The Shell detail and elegance. And of course - the music is absolutely superb.<br><br>If i have any flaws with this film it's that the outcome is rather predictable, but it doesn't really seem to be the directors intentions to keep you guessing anyway. So if you are the type of person who wants twists and turns and action packed anime look elsewhere. There's pretty much no humor, barely any action(although when there is its all the more punctuated for its absence elsewhere) and only features the Patlabors themselves in the last 15 minutes or so. However if you find that they aren't enough gentle, genuinely interesting, sumptuous and mature anime out there then this will probably end up as one of your favourite films of all time....animated or otherwise.....just like me.<br><br>09/10","user":"thepolarbear","rank":[8,12]}]