[{"title":"Great Impressionist Film-making","rating":6,"date":"6 July 2004","review":"I saw this film last night with my nephew, and chose it simply because the title was interesting and it was playing at the local art house, so I gave it a shot. As I am a bit disillusioned by the Oscars these days I don't pay much attention to them, I was unaware that this film was a huge success in Japan and received a Best Foreign Film nomination. What I received in return for my curiosity was one of the best foreign films that I have seen in a long, long time.<br><br>The crux of the film is the relationship between personal honor and social honor. Iguchi is indeed a most honorable man. He truly loves his children and his senile mother, and sacrifices his dignity and station to care for them. He works from dawn to dusk, attending his duties with the court by day and working on his farm by night, somehow finding time to also sell handmade insect/bird cages just to help his family get by. He does all this even though it soon becomes apparent that he has no equal as a swordsman, and in that right alone deserves the respect of those who deride him. We come to understand that selfless sacrifice is the single greatest act of honor, especially when one can still consider himself a blessed man. However, the personal honor that Iguchi wields even more skillfully than his sword becomes at odds with the social honor that his status as a samurai calls for. This conundrum is the heart of almost every scene in the film, and reaches its peak as the story moves toward its climax. Though Iguchi tells his best friend that he would gladly surrender his status as a samurai to become a simple farmer, he finds himself unable to resist his call to duty under the code of the samurai. He knows that to be honorable in his duty as a samurai, he must compromise his honor as a man. How can he kill a man to fulfill the unjust motives of his clan, especially when the man he is fighting is so much like himself?<br><br>The direction of the film is beautifully impressionist. Yamada crafts pictures of everyday life which gives us an inherent understanding of the life of Iguchi. In one scene, he sits dejectedly on his doorstep after coming home in the rain, lamenting the holes in his socks while his squire stands outside in the downpour. In another, he quietly applies his perfectionism to the construction of his cages in his dark and dirty living room while his family sleeps. In yet another, he shares a meal with his family as they laugh and enjoy each other's company. Yamada's eye for imagery, in combination with his patient and subtle storytelling, are reminiscent of great impressionist directors such as Ozu, Tarkovsky, and Malick. There are many other memorable images in this film, many of which depict the duality of nature. In one scene we see soldiers learning to fire rifles under the spring buds of a lotus tree. In another we see men fishing along a sapphire blue river, with golden fields behind them and a stunning, snow-capped Mount Fuji on the horizon-- and the bodies of starved peasant children floating down the river.<br><br>This is a great film. See it.","user":"FlickeringLight","rank":[125,129]},{"title":"Sanada's Brilliant Performance","rating":7,"date":"7 June 2004","review":"Hiroyuki Sanada (Western audiences may recognize him from his recent turn as Ujio from The Last Samurai, 2003), carries this film with his masterful acting, making the portrayal of \"Tasogarei Seibei\" (a.k.a. a samurai jokingly called \"Twilight\" by his colleagues), a poignant and memorable portrayal of a true hero.<br><br>Sanada plays Seibei Iguchi, a poor, 50-koku ranked samurai who has to support his two daughters and a senile mother, due to the passing away of his wife. The structure and plot turns of the story are simple, but fascinating to watch unfold, and it is perhaps the simplicity and novelistic grace of the narrative that makes the film so remarkable. Seibei works as a scribe with his fellow samurai, and always has to rush home after work to attend to his duties as a father. He lets hygieine slowly slide into second priority (resulting in rather unkempt clothes and socks), but in general, he doesn't seem to care: his two daughters he treasures above all other things. When a woman named Tomoe, a childhood friend that Seibei was particularly fond of, suddenly re-appers into his life, Seibei makes certain decisions that he ultimately ends up regretting later. The rest of the story is full of very interesting plot develoments, playing with the audience's expectations (especially with the relationship between Tomoe and Seiebi), and although the film is not a traditional samurai film in that it does not have alot of action scenes, the composition of the tale, and its \"storytelling\" invocation (one of the daughters narrates) is good enough to keep you watching.<br><br>Hiroyuki Sanada playing Seibei is really a marvel to watch; he adds a very sensible depth and modesty to the character, and infuses it with some understated comic acting as well. At the end of the film, after the climatic final battle, Sanada is able to make the character of Seibei resonate with a very unconventional but nonetheless strong and beautiful heroism. Sanada is really a very talented thespian, and in this film, you may get to sample the sheer range of his great technique. For the world-class acting work he did in this film, he won a Japanese Academy Award, and the film also got noticed by the Oscars (nominated for Best Foreign Language Film, 2004). If there's a chance your able to catch this film in a local theatre (usually, it plays at Landmark) do so, you won't regret it. You'll be able to watch an excellent story unfold, and also see some of the finest acting in world cinema today.","user":"artist_signal","rank":[46,47]},{"title":"A beautiful, lyrical samurai movie","rating":10,"date":"7 December 2004","review":"I approached director Yoji Yamada's period film anticipating the usual brew of flashing blades, unfathomable codes of honour and majestic arterial sprays but found instead a gently melancholic and beautifully played story of unspoken love and ethical struggle.<br><br>Seibei (a mesmerising less-is-more turn from Hiroyuki Sanada) is a low-ranking widowed samurai with a senile mother and two daughters, working in the castle's stores and taking in piecework to get by.<br><br>Grief at his wife's death has led him to turn his back on violence but he is confronted with it nonetheless, firstly as a result of the return of a childhood friend for whom he has strong feelings and who is fleeing her abusive marriage and, finally, when the politics of the day overtake his clan and he is ordered to carry out an assassination.<br><br>Seibei's struggle is not for outward respect but to find integrity within a social order over which he has no influence, making the bursts of violence all the more jarring.<br><br>Yamada's film is rightly compared to Kurosawa's work and its thoughtful, lyrical tone and themes resonate powerfully.","user":"paulnewman2001","rank":[83,87]}]