[{"title":"The time has come to admit that the Rock is just plain cool (***)","rating":7,"date":"8 April 2004","review":"I hate wrestling, but when I saw \"The Rundown\" last year I had to admit, The Rock is one cool guy, and a perfect action star. He's big and tough, but most importantly he's charismatic and has a sense of humor and a certain softness that actually makes him seem somewhat vulnerable. This is what sets him apart from someone like Vin Diesel, who was all set to be the next big action star but never was because he has no personality or sense of humor.<br><br>\n\"Walking Tall\" is a remake of a 1973 based-on-fact film about a man who fights back against corruption in his town by becoming sheriff and waging war on the bad guys. I haven't seen the original, but I'm willing to bet it's closer to the truth than the 2004 \"Walking Tall\", which is packed with more machine guns, axes, exploding trucks, and gunfighting strippers than anything that's \"based on fact\" could possibly be. <br><br>Here, Vaughn returns home after years of being away to find his hometown in shambles and dependent on a corrupt casino run by drug-dealing, knife-wielding thugs. After he receives a brutal beating and his nephew (Khleo Thomas, from \"Holes\") nearly overdoses on crystal meth bought there, the war is on. My inner 12 year-old says \"Woohoo!\". <br><br>Yes, this film is ridiculously over the top. It's also completely predictable. But it's FUN. A lot of fun, in fact. It's extremely fast paced, well-acted, the action scenes are excellent, and at just under 80 minutes, it's exceptionally lean too. Not one unnecessary or drawn-out scene.<br><br>\n\"Walking Tall\" doesn't aim to be anything except old-fashioned popcorn entertainment, and it succeeds, yet it has been made with surprising artistry as well. The cinematography is very good, and there are some interesting things done with sound and unexpected fade-outs. Also, Vaughn is an interestingly complex hero (complex as far as these movie go, anyway). At one point, when he clearly wants to bring a loaded shotgun into a fight with him, he hesitates, and brings a less-deadly 2x4 instead. It's a neat moment.<br><br>\nSo it's not going to be winning any awards any time soon. But I had a really good time, plain and simple, and the audience I saw it with did too.","user":"Ronin47","rank":[88,107]},{"title":"The Rock is a Star","rating":8,"date":"10 April 2004","review":"The Rock is the next great action hero. He has all the requisites. He is handsome, an amazing athlete with an awesome physique, charismatic, intelligent, and funny. His star power carries Kevin Bray's \"Walking Tall\".<br><br>The Rock is great in an entertaining movie. \"Walking Tall\" though great fun to watch, and capably produced and directed also punctuates that The Rock needs to work on more edgy and quality projects. He is definitely a movie star, who can become a solid actor. <br><br>\"Walking Tall\" has to overcome a very convoluted writing credit. This is not a retelling of the Bufford Pussor story, although its original screen writer, Mort Bristein, is acknowledged. This \"Walking Tall\" by David Klass, Channing Gibson, David Levien, and Brian Koppelman tells the story of returning Special Forces war hero Chris Vaughn (The Rock), who comes home to a small town outside Seattle. The town mill has been closed down, and his old high school bud, Jay Hamilton (Neal McDonough), owns the new town casino and pretty much owns the local police too. Jay is not the man he remembered from his youth. Chris is forced to raise his hand reluctantly against Hamilton's men. They leave him for dead, and fortunately Chris survives. So Chris is out to right an injustice, and exact revenge with extreme prejudice. This \"Walking Tall\" resembles \"First Blood\" particularly in it's local and plot setting. <br><br>Props to Director Kevin Bray for delivering on the story line as Chris exacts his revenge. Bray has a clean and lean style. The action sequences are crisp and dramatic. The Rock truly excels in the fight sequences. For one thing he is an big strong guy, and when he is laying \"the smack down\" on the villains it is believable and thoroughly enjoyable. The bad guys truly get what they deserve. <br><br>The supporting cast is solid. Ashley Scott (almost unrecognizable from the short-lived \"Birds of Prey\") is good as the stripper with a big heart who is Chris's love interest. Johnny Knoxville (of \"Jackass\") is funny and charming as Chris's bud and deputy Ray. <br><br>I completely enjoyed \"Walking Tall\". It is a brisk 75 minutes of cool action, and has the star power of The Rock. I look forward to seeing more movies starring The Rock.","user":"jon.h.ochiai","rank":[52,66]},{"title":"Surprisingly Entertaining Rock Flick ala Chuck Norris","rating":7,"date":"7 January 2006","review":"The Rock takes a page out of the Chuck Norris bible in his rendition of a special forces soldier returning to his home town. He quickly learns things in his hometown are not as he had left them and not for the better. Soon, things come to a head and he has to make a choice as to whether he is going to put up with it, or Walk Tall.<br><br>As The Rock himself mentioned- the original Sheriff Buford was a white man in his 40's so remember this is an adaptation of a 1970's movie script that was originally \"based\" on a true story, so we are a pretty long ways out from accurately representing the original events- this is only representing the SPIRIT of the original true story.<br><br>Fabulous fight scenes, a tense script and some funny moments all are reminiscent of the numerous Chuck Norris movies that portrayed a quiet guy that doesn't take any bull-crap from nobody man!<br><br>While the script made perfect sense in an earlier time - the Viet Nam era, it doesn't quite fly 100% in this day and age. So suspend a little belief.You may findyourself scratching your head as to how that could happen in this day and age.. well.. it could back then - even though it didn't really haha. However, no mention is made of the actual time period they are trying to represent- yet they mention current items like home depot and cops TV show. The moonshine whiskey sheriff buford fought is updated in this script to be crystal meth/ice.<br><br>The acting is surprisingly good for the Rock and he is looking manly in this movie instead of the sculpted eyebrow weirdo looks he has achieved in the past. Instead of looking like a dancer in a gay club like he did in Scorpion King, he looks the rough and tumble part for this role.<br><br>His attachment to his family is acted in a clumsy and weak manner but that isn't really important to the script- even if he only sort of likes his family he would still protect them with his life so it still works for the momentum of the movie.<br><br>Johnny Knoxville is mainly weak but has some great shining moments where they allow him to be Johnny Knoxville instead of the stupid 1-d concept of his character that seems to be forced on him through the other parts of the flick. At times he is reminiscent of Barney Fife to Rock's Andy. :-)<br><br>If you want to READ about the real man that INSPIRED this really great story- http://www.sheriffbufordpusser.com/history1.htm (the welcome page has a picture of him)","user":"dilbertsuperman","rank":[49,63]}]