[{"title":"Hilarious!","rating":7,"date":"15 October 2003","review":"Korea's answer to American Pie and the like sees clutzy university freshman Eun-shik falling for dream girl Eun-hyo (Ji-won Ha of Phone and Nightmare fame). But while his rather pathetic attempts to woo her fail to register, Eun-hyo is swept off her feet by dashing - and frivolous - playboy Sangik. With Eunhyo unable to see past her new lover's infidelite ways, Eun-shik must try to mature his image to save his dream girl from making a terrible choice.<br><br>\"Sex Is Zero\" starts off in hilarious fashion, with Eun-shik and his similarly sex-obsessed friends trying to score with as many college girls as is humanly possible. Throw in a couple of jokes about manhoods and cosmetic implants and we're talking comedy heaven. Unfortunately, as I've noticed with a few Korean films of late, the director chooses to veer off into other, more serious, genres in the final reel and this really puts the dampeners on the humour. There's one particularly shocking revelation around the hour mark which is so serious for a comedy that the film barely recovers - but of course I won't spoil it here. Put it this way, you know in a Hollywood production of this ilke that the good natured guy is always going to get his girl at the end... Korean productions are far more unpredictable!<br><br>Acting is excellent from all the main cast and the director brings a funky, lively and very energetic approach to his duties resulting in a highly entertaining mix of comedy, drama and weepie rolled into one. Comedy fans should be satisfied with the opening hour - people looking for a little more substance will lap up the finale. All in all, a recommended movie  - ***.5 / *****","user":"Iguanatic","rank":[18,25]},{"title":"It's AllProtein","rating":5,"date":"19 January 2006","review":"Eun-shik seems like a decent, if a bit odd, sort of guy. A 28-year-old freshman, Eun-shik had to delay his entrance into college because of the obligatory military service that all Korean males have to serve and other difficulties. However, with his younger roommates, Eun-shik is able to enjoy the pleasures of college which in this film seem to be limited to smacking the head of the martial arts club with various implements, gawking at pretty girls, and masturbating to his and his roommates large stash of pornography.<br><br>Similar to Jason Biggs character in American Pie, Eun-shik is a bit hapless when it comes to striking up conversations with members of the opposite sex. Yet it must be said that he does not aid his cause very well because he tends to find himself in some awkward situations such as standing on a windowsill in his tighty whities, after drinking a medicine that will supposedly give one an erection for three days, with a couple of perverts who seem to enjoy molesting girls on subways and jerking off at any given opportunity, while hiding in closets watching people have sex and at gymnastic events.<br><br>The main object of Eun-shik's affection, or lust, is the gorgeous Lee Eunhyo, played by Ha Ji-won, who seems to acquire a bit of affection for Eun-shik after she kicks him in the balls and sends him to the hospital. This incident also leads to Eun-shik's martial arts club being able to share a room with the gymnastics club where the sultry Kim Ji-won rules the roost. Eventually Eun-shik and three of his friends take out Eunhyo and three of her friends, but while his three friends make \"progress\" with their dates, Eun-shik seems to be losing Eunhyo to Sung-OK, the university's big man on campus and Ji-won's boyfriend. However, for Eunhyo, even though Eun-shik leaves a lot to be desired, maybe in the long run he would have been the better choice.<br><br>Similar to Jung Cho-sin's Wet Dreams 1 and 2, Sex is Zero is filled with some very low brow humor, such as the consumption of semen in soup and fried form and a very sloppy kiss that starts before a drunk girl has finished emptying the contents of her stomach, but unlike the two films above there is quite a bit more skin. With the exception of Ha Ji-won each supporting actress bares her breasts with the actress showing a bit more. While some of these bits can be quite humorous such as when one girl gets stuck in \"the wrong hole\" there is one scene in which the guy unbuttons the top of a passed out drunk girl feels her up amongst other things. While meant to be humorous this scene was a bit uncomfortable especially after the girl wakes up and the guy blames her for coming on to him. They stopped at a hotel because she had a bad headache from drinking too much.<br><br>In addition to the scatological humor which is so gross at points that it is not amusing, Sex is Zero falls into the trap of many other comedies and tries to take itself too seriously in the last third of the film. If it had been left as a sex comedy the film might have been more tolerable, but the last third of the film divulges too much from its beginning to be taken seriously.<br><br>If one is looking for eye candy one will find it in abundance in this film, but if one is looking solely for a light, if a bit raunchy, comedy then there are better ones to be found.","user":"Meganeguard","rank":[6,7]},{"title":"Gross Out Humor Korean Style","rating":6,"date":"6 November 2003","review":"SEX IS ZERO is a rather funny film in the style of, as others have noted, AMERICAN PIE. There are three differences: the characters are Korean; the scene is college; and the Third Act is Overwrought Melodrama that completely undermines all the gross out gags of the first hour.<br><br>Anyone familiar with Asian films will not be all that surprised by the movie's sudden shift in themes. Tackling a serious topic like abortion in a movie where characters masturbates at just about EVERY given opportunity??? It provides an odd dichotomy, to be sure.<br><br>Still, the film is reasonably funny enough, even if all of its gags are telegraphed about 10 minutes beforehand.<br><br>6 out of 10<br><br>(go to www.nixflix.com for a more detailed review of this movie)","user":"NIXFLIX-DOT-COM","rank":[12,17]}]