[{"title":"A Very Safe Movie","rating":6,"date":"2 May 2005","review":"The Interpreter is an extremely packaged political thriller that contains only a little punch. The main reason I gave it a go was Sean Penn who seems to rarely make mistakes selecting his work. Nicole Kidman can be a mixed bag, and Sydney Pollack a competent seasoned veteran director. All three performed well without setting the screen alight.<br><br>The use of the United Nations building was a big plus and definitely gave the movie more realism. It also gave the viewer more of an idea on what a massive organisation the UN is.<br><br>Even though \"The Interpreter\" was enjoyable the ending was definitely a disappointment. It wasn't that it was necessarily wrong, just that you knew what was coming. This was the \"Hollywood Factor\" showing through. Perhaps the reason it didn't turn into real Hollywood trash was the fact it was filmed and produced in New York.","user":"daveisit","rank":[129,178]},{"title":"Ridiculous Ending Spoils Good Movie","rating":6,"date":"22 January 2006","review":"Seldom has an ending been so disappointing and ruined a good film as this one.<br><br>For most of the way, this was a slick thriller, nicely photographed and nicely acted. Sean Penn is outstanding in here. I like to see him play low-key characters instead of hot-headed sleazeballs. Nicole Kidman also gives a good performance. Sometimes her classic beauty hides the fact she can act. <br><br>The story was pretty involving, hard to put down once you've started. My only complaint up to the ending was the obvious plug for the United Nations. This looked a public relations piece for that organization.<br><br>However, then came that ending - a real insult to anyone's intelligence. In a nutshell, nobody would go the extremes they went to here to protect a visiting dignitary, using all that manpower and machinery....and then leave him all alone in a room at the end! Are you serious??? It was unbelievably stupid and ruined what had been an entertaining and somewhat- smart film.","user":"ccthemovieman-1","rank":[46,63]},{"title":"a thought or two on The Interpreter","rating":10,"date":"22 January 2007","review":"Last night, I watched The Interpreter, primarily because I wanted to see if Sydney Pollack still had it and in my humble opinion, he does. I don't see too much film-making like this these days. For one thing, it's slow, but in a good way. Too many suspense films speed by at such an absurd rate that there's never any time for a mood to be built or characters to be known. Here, we get to know the characters intimately and are gradually drawn into the complex and compelling and relevant plot. Speaking of relevance, there is, here, a \"message\", but it's delivered organically by way of carefully structured storytelling and character development, not with a bullhorn and fireworks. Speaking of characters, I love the understated performances in this film by Sean Penn and Nicole Kidman. I love also the moments in this film, such as when Penn's character in a country-western bar unplugs the jukebox to stop the noise of some country-pop crap then restarts it in order to play Lyle Lovett's wonderful \"If I Had a Boat\" then goes to a pay phone and calls his own house just to hear his wife's voice on the answering machine.<br><br>Also, while I have nothing against fast, action-adventure-cartoon-type violence when it's done just right. The violence in this film isn't exciting. It's just as it should be considering the subject matter. It's sad and desolate and when a man speaks his last words to the child-soldier who has just shot him and when a bus is bombed or a desperate man is betrayed and murdered you feel it, the final moments of human lives; a being being taken away. There's room for sentiment in such films and it doesn't have to be sap as it so often is.<br><br>I don't follow entertainment news much these days (much as I'd love to) because such stories and reviews and even trailers (which I also used to love watching) give away far too much of the story (which I'm trying here not to do) so I don't know how this film was received, but I hope it did well and if it didn't, I hope audiences come to discover and love it gradually so that there might be more films like it.","user":"oddvincent","rank":[40,57]}]