[{"title":"An Underrated John Woo's decent Sci-Fi action futuristic favorite flick of mine!","rating":10,"date":"5 March 2016","review":"Paycheck (2003) is very underrated John Woo's solid action futuristic thriller, that combines spectacular action sequences with a spellbinding mystery that keeps you guessing from beginning to breathtaking end. It is my John Woo's fourth personal favorite action film of his, that I absolutely love to death. <br><br>I know a lot of people don't like this movie because it is John Woo's movie and it is rated PG-13, I love it. I love Ben Affleck his made some of his movies that are favorite mine like are: Reindeer Games, The Sum of All Fears, Daredevil and of course this one Paycheck. Watching this movie I must say Ben Affleck can act and he gave one of his convincing acting performances I have seen. I have been from the beginning against his role Bruce Wayne / Batman which I thought they should have left Christopher Nolan's The Dark Knight trilogy alone, but now after I have seen him in this movie I must say, if you gave Ben Affleck a good script, he will acted terrifically.<br><br>This flick is outstanding and Ben Affleck's character is well written and decent. Paycheck is a film that I feel is underrated (I enjoyed the story/ideas, the 'writing your own future, and then living the future you wrote after your memory has been wiped' aspect, the cast (I am a fan of Ben Affleck), the 'Sci-Fi' MacGyver aspect, the action bits which were there. I love the story I love Ben Affleck's character that he is a computer engineer who is working for company's and after he is done, they erasing his memories, he later accepts the job by friends company signs a three year contract and starts working on something big. Three years later, he thinks he won $92.000.000, but he is later double-crossed and chased by FBI and ruthless mercenaries. He finds an envelope with 20 subjects who helps him out of the trouble. The film is filled with mystery around, with what is all about. On the end of the film we found out, it is about a time machine, who can write a future and tells what will happened in your own future, which Michael Jennings build. Now Michael has to race against time, to go back where he started working on machine and destroy it, before Jimmy Rethrick (Aaron Eckhart) re writes his future by destroying the world. <br><br>About the cast a lot of actors in this film practically everyone in the main cast is connected to Batman in some weird way. Ben Affleck is the star of this movie and will be the next actor to portray The Dark Knight himself in Batman v. Superman: Dawn of Justice this month. Aaron Eckhart plays the villainous Rethrick but in The Dark Knight he played Harvey Dent s Two-Face and if I may say he was incredibly underrated. Aaron played outstanding villain in this flick. Uma Thurman plays Rachel in Paycheck but we all of course remember her as Poison Ivy in the 1997 clunker Batman &amp; Robin. Also Batman's love interest in The TDK trilogy is called Rachel. Uma Thurman was very likely in here and I liked her very much. I more remember her as the Bride in Quentin Tarantino's Kill Bill: Vol. 1 &amp; 2, Mad Dog and Glory and of course I mentioned a failure Batman &amp; Robin. Colm Feore played my favorite character Henry Taylor in 24 Season 7, he was outstanding as Rethrick's henchman Wolfe. I had no clue Michael C Hall - Dexter Morgan him self was in here as an FBI agent, he was just awesome. The last one is Paul Giamatti who was Jennings friend he wasn't also annoying I love him! He only had three scenes and he acted perfectly. Honestly I dare to say Paul Giamatti is far way better actor than Rob Schneider is.<br><br>Paycheck is written by short story of the same name by science fiction writer Philip K. Dick., I have enjoyed the action scenes, the acting performances, the chase on motorcycle was my favorite scene in the film. I love this movie and it is John Woo's fifth favorite action film of mine. This movie get's a solid perfect 10 score by me.","user":"ivo-cobra8","rank":[50,60]},{"title":"Better than expected action / sci fi flick","rating":6,"date":"3 August 2005","review":"Philip K Dick wrote many stories which seemed to have great film potential. I never thought of this as one of them.<br><br>I have seen Ben Affleck in a number of films, and felt that he was good in a few, OK in most, and positively annoying in some.<br><br>I saw the horrible, misleading trailers.<br><br>The soundtrack was simply bad.<br><br>So, needless to say, I went into Paycheck with very low expectations.... and I was pleasantly surprised.<br><br>Affleck plays a talented reverse-engineer, who sees the possibilities in new technology, and is able to carry it through to fruition. He takes on top-secret jobs and has his memory erased upon the completion of each. He decides to take on a project big and profitable enough to allow him to retire comfortably for the rest of his life. He completes the project, goes through the memory erasure, and then starts to discover what he has done, and, pursued by corporate hit men and the police, tries to recover his memory. Uma Thurmond, a biologist he had fallen in love with, is one of the memories he wants to recover, and also a target. <br><br>Paycheck is more of an action film than a sci fi flick. The plot serves the action, as do the somewhat one-dimensional characters. And there is so little chemistry between Affleck and Thurmond that the romantic subplot is almost just a distraction. Despite these flaws, I spent an evening being thoroughly entertained by this rehashing of the usual technology-run-amok / knowledge-is-power story. This film is very Hollywood, and uses a lot of slick and clichéd camera-work, but nevertheless tells a good story and does it well enough.","user":"mstomaso","rank":[90,121]},{"title":"Intriguing premise is made mildly enjoyable, but ultimately unsatisfying.","rating":9,"date":"9 January 2005","review":"Rating: ** out of **** <br><br>I wonder what it says about the state of cinematic science fiction that most of author Philip K. Dick's adaptations generally mix high-octane action with its interesting sci-fi concepts. Paycheck is no exception, hardly a surprise when you note it's from once beloved Hong Kong filmmaker John Woo, who's quickly reaching Michael Bay/Roland Emmerich levels of notoriety in the U.S. with each regressive film.<br><br>To be fair, Paycheck isn't unenjoyable, and it even gets off to a pretty good start. Set sometime in the near future, there's not much of a noticeable difference with our present time except for a few elaborate-looking gadgets and computers. Ben Affleck stars as Michael Jennings, a reverse engineer who's hired by major corporations to build products superior to all rival companies. Afterwards, his memory is erased by a partner of his (Paul Giamatti) and he's given a large paycheck for his time and troubles (usually the whole process takes about three months).<br><br>His latest offer comes from an old friend of his (Aaron Eckhart), who promises an eight-figure deal at the end of the transaction. The catch is that the whole procedure will take three years. Despite some reluctance, he agrees to the deal and when the three years pass by, Jennings, thinking he's a rich man, is shocked to discover he gave up over ninety million dollars in favor of an envelope containing twenty everyday household items. Now he finds himself on the run from both the FBI and the company that hired him, and must set out to discover what he built during those three years he's missing.<br><br>Uma Thurman also stars in the movie as Jennings' girlfriend during that three-year span, but she factors so lazily into the picture, she's obviously only in the film so that a) Jennings can have a love interest and b) he can also have someone to talk to about every little discovery he makes. Then again, function \"b\" could have worked just as well with Giamatti, but everyone knows a \"sexy\" chick is a better sell (I have to put quote marks around sexy because Thurman looks positively haggard for almost every minute of screen time she's present; I can't help but feel the much hotter Kathryn Morris would have done better in the role).<br><br>There are two concepts in this movie that specifically intrigue me (some moderate spoilers here), the first one is choosing deliberately to erase your own memory, but the notion is forgotten after the first half-hour. I was quite curious to know exactly what the process is like to the subject. Take, for instance, the fact that he lost his memory over the three-year span. Does the last thing he remembers feel like a three-year old memory or an event that happened just a second ago? Instead, all we get is a half-hearted (actually, not even that much) attempt at a sorrowful romance because he can't remember his girlfriend and she's not very happy about that.<br><br>The other major sci-fi concept, the ability to see into the future, isn't explored with much more interest and it leads to a number of baffling questions. You see (quite a few spoilers here), it's revealed Jennings sent himself those twenty items because they can come in handy at a specific moment that'll help him survive or escape from a dangerous situation.<br><br>But the thing is, Jennings couldn't have known each item would come in handy unless he used the device he built at least twenty times, because there's no way he'd know a motorcycle would come in handy if he never had, say, the bus ticket to escape from the FBI, meaning he used the device to see what he needed to escape the FBI, but still foresaw that he'd be killed in even more future events. That would mean this guy was originally destined to die or get caught in well over ten different scenarios (i.e. he had the bus ticket to escape, but if he didn't have the motorbike keys, he wouldn't have gotten further, and so on and so forth), but this is never really addressed.<br><br>By John Woo standards, there's surprisingly only a modest amount of action in the film, but at least the material is competently handled, even if it's not entirely believable. What might work in movies that establish their characters as supercops with impeccable aims doesn't come off quite as well in action scenes that feature scientists beating up a large number of armed goons. But if you suspend disbelief, the action scenes are pretty fun (especially the motorcycle chase and the laboratory battle), and coupled with the relatively fast pace, keep the movie perfectly watchable despite the poor script and mediocre acting (I never got into specifics, but this is Ben Affleck and Uma Thurman we're talking about).<br><br>When all is said and done, Paycheck is a wasted opportunity and is never as memorable a mixture of science fiction, mystery, and action as Minority Report, but it's likely to do the trick for undemanding fans of any of these genres. If you expect more, well, you'd do best to remember this is John Woo we're talking about, not Steven Spielberg.","user":"Li-1","rank":[122,177]}]