[{"title":"Extremely Silly Gore Fest","rating":6,"date":"28 April 2003","review":"I have had the pleasure of seeing this film at a horror festival in Edinburgh. Garden of Love does not have a serious bone in its sick low-budget body. There is lots and lots of blood and gore, starting with the opening credits. The plot is extremely silly like everything else in this film. In fact you might say this film is a pastiche of gory films. At first this film seemed really bad, but it was so entertaining that the director must have been doing something right. Garden of Love definitely needs to be enjoyed in company (with like-minded people!).<br><br>A lot of people were laughing at the quality of the acting, but to be so funny throughout the film it had to be deliberately bad - SURELY?. The character playing Munster was my definite favourite and I would see the film just for his extremely camp performance. I am not sure that many actors could have made the awful lines quite so funny.<br><br>You may have gathered that Garden of Love won't be everyone's cup of tea but if you have a soft spot for bad taste gory films then see it, because it's wonderfully awful.","user":"straight-face","rank":[17,19]},{"title":"Ittenbach Brilliance","rating":27,"date":"27 June 2006","review":"This film is further evidence that Olaf Ittenbach is the current king of splatter and gore. There are directors who make scarier and more accomplished films than Ittenbach but no one currently orchestrates squashed skulls, severed limbs and general acts of mutilation better than this German maestro. Garden Of Love is a horror treasure - a highly entertaining mix of black humour and flying body parts.<br><br>Garden Of Love is probably Olaf Ittenbach's most structured film, the time leaps and flashbacks which feature so prominently in his other works have been toned down. This has the advantage of making Garden Of Love more appealing to mainstream horror fans but is initially somewhat disconcerting for fans of the manic storytelling on display in films like the classic \"Premutos\". After overcoming the initial shock of the film's traditional structure and the noticeably improved production values, Ittenbach fans will not take long to settle into the film - despite the somewhat slow start. In fact, in the film's first 30 or 40 minutes is oddly violence free with the exception of the initial massacre and an ingenious butcher knife infomercial.<br><br>The film's plot is admittedly rather thin. However, it more than suffices as a backdrop to the film's real purpose - blood, and lots of it. In short, the Verlaine family is massacred in their sleep and the only survivor, Rebecca, wakes from her coma with amnesia. Years later, Rebecah starts receiving messages from her dead family on the TV (just go with it!) and she returns to the family farm for a reunion of sorts. This is the point where Ittenbach kicks free of the storytelling constraints that interfere with his virtuoso approach to blood and gore and lets rip. My favourite scenes include Rebecca's inventive use of a power drill and a spectacular set piece in which the zombified Verlaine family members literally rip a team of police men to shreds. Skulls are smashed, holes punched through faces and bodies, heads shot off and torsos ripped in half. Ittenbach handles this scene with the grace and precision of a maestro conductor standing before an orchestra.<br><br>The real brilliance of the film lies in the director's \"more is more\" approach to gore and his phenomenal skill at employing special effects. Garden Of Love is another showcase of brilliant blood and gore effects. Their realism and impact belie the film's modest budget. It is only the presence of some dubiously talented Ittenbach regulars among the cast that occasionally reminds you that you are watching a micro budget, shot-on-video horror movie. The exception to the mediocre acting is the lead Natacza Boon, who makes a reasonably convincing scream queen. The make-up artists and cameramen deserve a lot credit for the eerie atmosphere inside the Verlaine farmhouse.<br><br>Garden Of Love exceeds all the requirements of a good splatter film. You can't help but sense that it will only be a matter of time before the rest of the world catches on to the pleasures of Olaf Ittenbach and his beautifully sick and twisted mind.","user":"Crap_Connoisseur","rank":[12,13]},{"title":"A Bit Of A Departure From Ittenbach - But Still Plenty Splattery...","rating":7,"date":"30 December 2007","review":"GARDEN OF LOVE shows a bit of \"maturity\" on Ittenbach's part, compared to earlier low-budget splatter entries like PREMUTOS and BURNING MOON. It's obvious that Ittenbach has gotten a little better at his craft while still bringing plenty of the red stuff.<br><br>Rebecca's family is viciously slaughtered when she was a child (in a kick-ass opening sequence...), and is herself stabbed and left for dead. She awakens from a two year coma, and is taken in by relatives. As an adult, she begins having flash-backs of the events that brought about the demise of her family, and she decides to go back to her childhood home to investigate. There she meets the spirits of her dead relatives, who demand that Rebecca find the murderers and bring them back to the home so that the ghosts can deal out a little revenge...<br><br>A pretty solid film that blends a decent storyline with Ittenbach's trademark gore-FX. It's pretty obvious that the director has become more technically proficient, and it's good to see that even though his films seem to be a little more \"mature\" than some of his previous entries, Ittenbach also still brings the gore in all of his films. The acting seemed relatively decent for the most part, but the atrocious dubbing of the spoken and sound FX tracks that was often several seconds off from what was happening on-screen was done horribly, to the point of distraction. Other than that, not too much to complain about in GARDEN OF LOVE. Not an exceptional film by any means, but a decent entry in the German gore genre. Not quite as fun and splattery as PREMUTOS, but one of Ittenbach's more solid films...7/10","user":"EVOL666","rank":[6,6]}]