[{"title":"A Feel-Good Dramedy That Explores Humanity","rating":8,"date":"8 July 2014","review":"Tom Hanks and Steven Spielberg, two of the biggest names in Hollywood, two people who could literally make any film they wanted to, and instead they settle on a feel-good dramedy... good thinking Steven. 'The Terminal' is a charming adaptation of a true story about a foreign civilian stuck in an American airport terminal lounge after his country faces war. The thing that makes this film worth watching are the excellent performances from the amiable cast and the sympathetic direction from Spielberg. After watching some of the behind the scenes as well, I was amazed at how the crew had built a full-size replica airport in a hangar in LA complete with working escalators, the attention to detail is astounding, and this makes the film that much more worth sitting through. 'The Terminal' is an entertaining comedy-drama that explores humanity and sentimentality, a spectacular flick from Spielberg and Hanks.","user":"CalRhys","rank":[93,106]},{"title":"I can't believe I missed out on the film when it came out","rating":8,"date":"14 January 2013","review":"Yeah, it might be unrealistic and cheesy at times but it's still a great movie and pleasant to watch. It's heartwarming and has humanity to it along with cute comedic moments. Tom Hanks Russian accent seems forced in the beginning but I quickly got use to it and seemed natural afterwards. Tom plays a very naive and yet kind hearted guy name Viktor Navorski who can't leave the airport terminal because of certain circumstances. And Stanli Tucci put on a believable performance and fit the mood of this movie well. He plays a Frank Dixon who is the head of security at the airport this movie takes place. And is the one that gives Navorski the most difficult time but without him there wouldn't be this story. The comedic moments in this movie really works and is a film the whole family can enjoy. The different scenarios come together in a delightful manner and that is what this film is, it's delightful and entertaining. So parts just seem way too far-fetched and underdeveloped. But that is passable because this isn't suppose to be a really realistic film. In fact it sorted reminded me of \"Forrest Gump\" except it takes place in a terminal. Overall this is a movie that adults and kids can enjoy.<br><br>8.5/10","user":"KineticSeoul","rank":[10,10]},{"title":"Feel-good","rating":10,"date":"8 July 2004","review":"It's funny how Steven Spielberg and Tom Hanks, two of Hollywood's most powerful men, who could literally do any movie they want, end up making something like The Terminal. Instead of reaching for new heights of film-making like including the latest in special effects, or new original ways of storytelling and editing, Spielberg goes back to a simpler form. That in itself is surprisingly refreshing. Filmmakers try so hard to be inventive and change the typical form of the classics, that when someone finally does go back to that Capra or Wilder fashion, it ends up seeming original. That's what The Terminal goes for. A movie about characters, not plot. About emotion, not CGI. It's a true heart-felt piece of work. It's funny, it's cute, and it always keeps you interested.<br><br>Tom Hanks leads an exceptional cast as Viktor Navorski, a man stranded in JFK airport, not welcome in the U.S. and having no country to come home to. Throughout the experience he makes friends, a love interest, and a rival. He changes all of their lives, of course. That's to be expected from a movie like this. Tom Hanks is totally believable, accent and all. It's a performance well worthy of an Oscar nod.<br><br>I loved The Terminal for many reasons, but one big reason is it's simplicity. And more importantly, because it is good at being simple. It doesn't contribute anything new to movies, it doesn't try to. It is what it is. A great, feel-good film. Something that is getting rarer and rarer these days. Sometimes you'll want to see a gritty, wrenching melodrama, but other times you'll want to see The Terminal.<br><br>My rating: 10/10","user":"Derek237","rank":[311,408]}]