[{"title":"worthy of its subject matter, truthful","rating":8,"date":"19 November 2005","review":"Whenever I see so much \"Oscar worthy\" tags/blurbs in an ad campaign I get nervous, see Cinderella Man. Usually you look closely at the fine print and see that the esteemed critic lauding the film is Joe Schmoe from the One Stop Light Bugle Press in Buttcreek, Illinois or a low level flunky who just happens to work for the media conglomerate that is distributing the film. So my heart sank a little when a film I have been eagerly awaiting was swaddled with such praise when the ads hit the air.<br><br>But they're right for once.<br><br>Joaquin Phoenix wears Johnny Cash like a suit. He isn't doing a Rich Little impersonation, you don't rub your eyes in disbelief, but he channels a man so distinct in appearance and voice to a level that is beyond admirable. One of the traits that made Johnny Cash a legend was that nobody sounded or looked like him. Short of a computer generated Cash walking around in his own bio-pic like one of those John Wayne beer commercials this is the definitive representation.<br><br>And yet Phoenix may not give the best performance in the film.<br><br>Reese Witherspoon more than holds up her end in a role that easily could have been reduced to a clichéd bumpkin. Witherspoon portrays the on-stage June in the way June portrayed her own \"character\", the stage persona that people adored, while giving her the resolve and inner strength to be the woman who tamed a hell-bent, grizzly bear of a man like John.<br><br>The chemistry of Phoenix and Witherspoon together in any scene, but their on-stage duets in particular, are truthful in a way that resonates long after the credits. I know that unless you have been living in a cave for the past week you have likely been bombarded with the word that the actors sing themselves without use of lip syncing. I have never been a fan of musicals, or even musical performances in a film. They generally seem forced and uncomfortable to me, the moment when I stop experiencing the story and feel reminded that I am watching a movie. I never felt that in this film. I never felt that their singing took the focus of the film, but the performances work with the story like no other music bio I have ever seen. I never felt as if I was being led through the catalog, the songs felt as organic and natural as any spoken dialog in a great narrative.<br><br>This film far exceeded my expectations and afforded me the first trip home from a theater with a true feeling of satisfaction in a very, very long time. Highly recommended.","user":"hollingsworth76","rank":[562,623]},{"title":"And The Oscar Goes To......","rating":10,"date":"22 November 2005","review":"Wow, what a film. I had been waiting to see this movie since I read that Joaquin Phoenix and Reese Witherspoon were cast in the lead roles. I was not sure what to expect when I heard they were going to do their own singing, but was I ever impressed. Their performances in this movie were brilliant, and I had chills down my spine. It was truly amazing how much Phoenix sounded like Johnny Cash-this was a role he was born to play, and he was mesmerizing. Totally sizzling. Witherspoon was positively radiant as June Carter, and talk about chemistry between the two actors. Talk about lightning striking! I only hope they are rewarded for their efforts come Oscar time. This was a truly amazing movie, filled with great music, a top-notch supporting cast and a terrific script which was wonderfully directed.","user":"Snoopymichele","rank":[367,437]},{"title":"Great film","rating":9,"date":"18 November 2005","review":"Considering the formula junk coming out of Hollywood these days, I was blown away by how good this movie was. The direction was perfect. Using close ups to get us in under the skin of Johnny Cash. And since it was a period piece, he could have bored us with lots of cgi of Memphis and L.A. to take us back in time. Instead he used the actors and the music to take us there. Biopics naturally have a formula to them, but the director and screenwriter did not take us down the track of overly sentimental scenes. These were real and done with a bit of well placed humor. Just like real life. Afterall you still have to follow the real lives of Johnny and June. You can't make it up, just to be original! The movie was also a movie you can take most of the family to. No nudity and sex to SHOW how in love they are, just real dialog...it's nice to hear REAL dialog and not just another chase scene, or four letter word. Yes, some movies need that to tell the story, this one doesn't. This movie goes onto my short list of great biopics, with \"Ray\". Not much else comes close to Ray or Walk the Line. The true test of any biopics is: can you still understand the plot even if you never heard of the people the movie is about. This movie is a great love story even if you never heard of Johnny and June Cash. Oscars all around I say! Plus I loved the Rockabilly music through out the movie.","user":"radioriot","rank":[224,281]}]