[{"title":"An all right LBT","rating":7,"date":"9 November 2007","review":"Unfortunately, this LBT has a spoilt, usually positive Ducky who is now grumpy and a storyline that is good for teaching but not very good for a LBT film. <br><br>Luckily, the plot is all right and the songs are good, especially \"Family\" and the learning songs. The animation is quite good as well, sort of in between LBT 7's animation and LBT 9's animation. <br><br>The new characters are entertaining. Mr. Thicknose is a wise threehorn (they are all dinosaurs) who likes to teach Littlefoot and his friends. While he talks to them again, Ducky is angry at Spike and Littlefoot is worried that he is seeming to upset Mr. Thicknose. The film continues on as a pretty good learning adventure and an adventure good for an animated film.<br><br>The best character in this who is one of the main five is Petrie.<br><br>Ah well. Enjoy \"Land Before Time VIII: The Big Freeze\".","user":"Mightyzebra","rank":[5,5]},{"title":"Great film, a bit light on action","rating":10,"date":"19 June 2005","review":"The title says it. The action is not exactly long, but I think \"Family\" makes up for it. (SPOILER) Snow falls on the great valley and there are a few days of snow fun. Spike and Ducky get a bit mad at each other and Spike goes off with a migrating herd of Stegos. The kids enlist the help of know-it-all fraud Mr. Thicknose to guide them through the Mysterious beyond. They are reunited with ducky and face a rex. Their joint efforts pull through. They find a hot spring and green food. Thicknose admits his fibbing. Later, they go to the great valley to show the others the spring. They are soon joined by the spiketails.(SPOILERS END) I still can't help praising \"Family\" for its significance to the plot.","user":"jcmariano","rank":[9,11]},{"title":"Decent but not great","rating":5,"date":"12 February 2010","review":"While a long way from being the worst, this sequel isn't the best either. It does benefit from some nice colourful animation, a sweet story and a sterling vocal turn from Robert Guillaume(who also voiced Rafiki in \"The Lion King\"). Actually in general the whole voice cast was very well done. However, while sweet the songs aren't exactly memorable, some of the dialogue is a little on the corny side and the film is too short. I may be alone as well in thinking the singing was a tad weak, Guillaume has done much better singing before.<br><br>Overall, I do recommend it for kids, they will definitely love it. However depending on whether you loved the first film, I did, or how old you are, others may find it disappointing. It does do the right thing though, provides decent entertainment for its target audience. 5.5/10 Bethany Cox","user":"TheLittleSongbird","rank":[5,6]}]