[{"title":"Get the DVD, the extras are great!","rating":6,"date":"6 December 2004","review":"I got the DVD as a gift and I noticed that the feature documentary on The Dark Side Of The Moon is followed by a DVD-only extra section. This section adds extra footage that was taped but not included in the documentary (probably to avoid making the documentary too long) - an in-depth part on Gilmour's use of the double and triple-tracked guitars, an interview on the nature of Rock 'n Roll with Roger Waters, a story on the background voices, etcetera.<br><br>For any fan on Pink Floyd or student of modern music, this DVD is a must-see. Especially noteworthy is the in-depth look at recording and producing Dark Side; since this was pre-computer technology, the stories about the tape-loops to sync the clocks for the intro of Time, the story by Waters on making the cash register sound for Money, using sequencers for the space sounds... Their creativity is astounding.<br><br>A few small details were so incredibly interesting - Rick Wright using a piano chord from Miles Davis' Kind of Blue for instance was a revelation for me, as I recognised the chord but couldn't place it.","user":"AmsterdamReprobate","rank":[12,12]},{"title":"In-depth look at the creation of the classic album","rating":10,"date":"26 February 2004","review":"I half expected this to be a cobbled together compilation of TV interviews, but it's the real deal...each song is dissected by its creators in brand new interviews. You also get unplugged style acoustic versions of \"Breathe\" and \"Brain Damage\", by David Gilmour and Roger Waters, respectively, as well as a listen to the demo for \"Time\". There are rare photos, and Richard Wright plays the piano live. This is a gift to fans! If you're not a fan, what are you reading this for? If you are, pick it up today. This is so exhaustive, it even features interviews with Alan Parsons, who had more than a casual role in the shaping of \"Dark Side\". No Floyd collection is complete without this.","user":"cantthinkofname","rank":[15,16]},{"title":"One of those \"gotta see\" DVDs","rating":7,"date":"23 January 2005","review":"It's weird to see the members of Pink Floyd looking so old as they talk about their phenomenal \"Dark Side of the Moon\" album, but that's life, I suppose. They still have what it takes, as David Gilmour shows us, to crank out the music. This behind the scenes DVD is a bit more cerebral than others I've watched but nonetheless fascinating. It's a bit like watching philosophers pontificate, which is alright, I suppose, considering the Floyd was always a bit more intellectual than most of your garden variety musicians then and now. We also see the man who created the cover art that is probably the most recognized album cover in history and his story of how it came about and how the members of Pink Floyd chose it is revealing in its simplicity. We also find out who the lovely female vocalist on \"The Great Gig in the Sky\" is and why she felt she had to apologize right after-wards.","user":"The Gryphon","rank":[12,13]}]