[{"title":"solid sci-fi action flick with good effects","rating":13,"date":"13 February 2005","review":"The CGI effects, the \"liquid metal\" type reminiscent of those in Abyss and T-2, are the real star of what is a pleasing combination of Alien and The Thing. Lorenzo Lamas is the sole bit of recognizable star power, but he's purely incidental to how enjoyable this flick turns out to be. Pour a drink, open a bag of chips and turn off your brain while you watch this one. If you take it too seriously you're going to end up bitter and twisted...just like many of the IMDb Users whose comments seem to be coming from either film-school dropouts or Hollywood wannabees. Or both. Remember - it's called the \"willing suspension of disbelief\" for a reason. Are we talking Academy awards here? Nope. Instead we have an hour and a half of cinematic popcorn - tasty enough to entertain but nothing that will stick with you for long. The folks at First Look Home Entertainment and DEJ Productions have given us another solid effort. Keep 'em coming, guys.","user":"heavyc65","rank":[31,42]},{"title":"Alien revisited on Earth with a low budget","rating":3,"date":"17 February 2004","review":"This is called a Canadian movie but it is an American Pay TV movie set in Alaska but filmed in Canada to save money. It is basically a story of germ warfare; with a twist. American scientists working on a project in futuristic Alaskan Laboratory find a new terror weapon. Any more explanation would be a spoiler. Rather simplistic movie worth watching after midnight if there is nothing else to watch. Most simple storyline would be ..Alien meets Alaska. 3/10 is about what this film deserves and i would like to say that i am in reality -being generous. The type of film where you watch and watch only to see if you were correct in your guesses as to what the plot will bring about. Simple and when it ends it ends--finally. the end","user":"meslon","rank":[13,16]},{"title":"Lamas on the way down","rating":6,"date":"7 July 2005","review":"This is a typical movie about aliens loose in a confined environment. The presence of Lorenzo Lamas only proves that he is on a descending curve as casting is concerned and he has a really secondary role that involves no foot work, so he doesn't really belong in the movie.<br><br>There are a lot of loopholes in the plot, but how does care? This is a monster movie, just produce the monster, let him loose on people that we don't know and don't care about and maybe, just maybe, let a few of them alive to be cast in some other movies.<br><br>Someone mentioned the effects, they were not great. If you count greenish, reddish, yellowish liquids coming out of twitching people as special effects or you like quick morphs between computer generated aqua and people dressed in plastic, then this is the movie for you.<br><br>Actually, the only good scene of this movie is when the young daughter of the general i doing an erotic dance for Lamas at the beginning of the movie. From then on, the movie just keeps going downwards :)","user":"siderite","rank":[13,17]}]