[{"title":"Underrated and ignored, but a bit of a classic","rating":9,"date":"4 February 2010","review":"Tony Scott can make good films and bad, personally I think he can be a bit flashy and trashy and his work obviously suffers in comparison with that of his rather famous brother, but this is quite possibly his best film.<br><br>What makes this film so great is that Scott gives Denzel (on scorching form, better than Training Day) and the revelation who is Dakota Fanning time to develop a relationship of real warmth and tenderness. The set up is absolutely NOT boring, although it takes time - it is involving, and takes us on a little journey into the characters - including a superb role for Radha Mitchell as the mother. This all serves to make the action so much more effective, as we are so invested in the characters, for all their all too obvious weaknesses. This film has you on the edge for its entirety, and doesn't cop out at the end either.<br><br>The film would of course be nothing without Washington. I often wonder why he seems to get so many duff roles, when he quite clearly is as good as almost any leading man out there (I can only really think of one, Daniel Day Lewis, who has more on-screen power these days). This film should have been huge, given his status and the strength of his performance, and the quality of the film. It just goes to show you that if a studio doesn't back a film to the hilt, it ends up going straight to video. I wish I'd got the chance to see this on the big screen.","user":"bt-wells99-1","rank":[69,75]},{"title":"Riveting viewing!","rating":10,"date":"4 January 2005","review":"Certainly one of the finest movies I have seen for quite some time. Exquisite direction and flawless acting make this a very entertaining and often moving film. Denzel Washington plays one of his most engaging and emotional roles to date, and the rest of the cast perform beautifully. Christopher Walken is of course superb in his part although he did not appear as often as I would have liked. A story of ultimate greed that backfires is offset against a childs innocence and love. This is also a film for action movie lovers as it has its fair share of bullets, rockets and revenge. The location of Mexico City adds a feel of seediness and corruption which in itself is an eye opener. All in all, a truly gripping film from beginning to end. Highly recommended!","user":"sblenkharn","rank":[421,514]},{"title":"Denzel VS Mexico City... with unexpected heart","rating":9,"date":"10 January 2007","review":"Alcoholic mercenary Creasy (Washington) is all washed-up, until his friend (Walken) finds him a job in Mexico City, as bodyguard for a rich family's little girl Pita (Fanning). The taciturn man and melancholy girl slowly develop a strong bond... that is utterly shattered the day that Pita is kidnapped and that negotiations are sorely mishandled.<br><br>\"Man on Fire\"'s title works against it. It proclaims an adrenaline-fueled action film, when in fact what we get is very different. What could be mistakenly thought to be a prologue (Creasy is introduced, meets Pita and the relationship is shown) constitutes a good half of the film's running time. Washington and Faning are on top form, the former tortured and angry and the latter endearing without being cloying, so it is a tribute to Scott and screenwriter Helgeland that the film takes its time showing their odd relationship. This makes things all the more hurtful and outraging when she is captured in a kidnapping that leaves Creasy severely scarred, both emotionally and physically.<br><br>The film earns its title in the second half, not because of non-stop action - which it fore-goes in order to give us something more pondered and cruel - but because Creasy is literally ablaze with silent fury. As he hunts down anyone who participated or profited from Pita's kidnapping, dismantling rings of Mexico City's tower of corruption, his methods get bloodier while his movement actually get slower. Creasy races against time and his own likely death, as a tragic figure who's newfound reason to live has been taken away from him.<br><br>The performances are fine, with great turns from the two leads and superb supporting turns by the always reliable Christopher Walken and Jiancarlo Giannini. What sometime detracts from the film's quality is Tony Scott's now signature messy visuals. While some shots are magnificent, reminiscent of brother Ridley's work, some are almost trashy and epilepsy-inducing (some unnecessary hyper-MTV editing). the man redeems himself by handling his actors with care, superbly illustrating his environment and creating a stark atmosphere.<br><br>This is a precious oddity: a quality blockbuster.","user":"OttoVonB","rank":[60,69]}]