[{"title":"Twenty Four Carat GOLDEN AGE","rating":10,"date":"13 December 2004","review":"Honestly, there's nothing better you could do with your time or money than buy this movie and watch it immediately.<br><br>I'd heard glowing reviews of this movie, so as soon as it hit Chicago I was first in line, bringing a friend along. The next day, I was back there again, with another friend in tow.<br><br>Myself, my friends, and everyone else I know that's seen this movie feel it is the most important documentary ever made about Broadway. They say history is made by the people who lived it, and here--from his own personal passion--Rick has amassed the largest number of living legends ever to appear in the same film. Rather than a bland collection of facts, this movie is filled with life and energy and stories--both silly and heartfelt--by the people who were actually there. You can't beat Chita Rivera talking about the original production of WEST SIDE STORY, or Angela Lansbury and MAME, or countless others.<br><br>As you watch, you're simply spellbound by the love and dedication that went into preserving these people on film and more so, by the love and dedication these legends have for Broadway stage. Your heart aches to be there, with them, in all the glory and splendor they recreate from their recollections.<br><br>Quite simply, if you care about theatre in any way shape or form, this movie is required viewing. And if you don't care about theatre, this movie will make you a convert to the magic that is live theatre. Rick McKay is a saint of the performing arts and deserves entry into the theatre hall of fame for this movie, right alongside all the legends he interviewed.<br><br>The only thing you could possibly have against this film is that it's too short. It's two hours, and when it's done, you want to sit for another two, and I imagine another two after that.","user":"originaltopherp","rank":[12,13]},{"title":"Truly Inspirational","rating":9,"date":"9 November 2004","review":"I was fortunate to view this at the NYC premiere. I was in total awe. After shaking hands with Kitty Carlisle Hart and saying Hi to the most recently departed Fay Wray, I was just amazed. It was an experience I will never ever forget. I also saw Miss Celeste Holm, Tommy Tune, Chita Rivera. It was totally wonderful! The film was excellent. I wanted to just sit there for hours and hours listening to what the actors and actresses had to say. Their stories were fascinating. Which is what a Documentary should be. Telling the story about what life was like. Giving the \"Inside Scoop\" I hope I will be able to see the sequel to it. Anyone who says this film is Amateurish obviously overlooks the fact that this film will be a classic and should receive an Oscar Nomination, if not the Oscar for best Documentary. Anyone guy who can go and interview over a hundred stars, has to be amazing.<br><br>Go and buy this DVD!!!! It is worth every Penny!","user":"bschneid76","rank":[11,12]},{"title":"DVD is amazing","rating":6,"date":"6 November 2004","review":"I saw this film in New York in June and loved it then and I just saw a press screener of the DVD - it is amazing what the filmmaker has done. In addition to being incredibly entertaining as a film, this is destined to be an invaluable historic reference. There are dozens of interviews with actors giving us a first person account of Broadway's Golden Age by those who were there, creating it.<br><br>The DVD has at leat 30 minutes of interviews with the cast of the upcoming (I hope soon) \"Next Generation\" including: Betty Buckley, Jason Alexander, Doug Sills, John Barrowman, Cady Huffman and Daisy Eagan. There are also deleted scenes, one has Marian Seldes on Katharine Cornell - I cannot imagine how this was not in the original film. The movie could have been twice as long and still held up. It's also fun to see the alternate ending on the DVD and the red carpet footage of the NY and LA openings. This is not a rental, you will want to own it and watch it when you want to be entertained, or inspired, or moved, or laugh. This film is incredible.","user":"vonthurnundtaxis","rank":[10,11]}]