[{"title":"Zorro","rating":6,"date":"6 March 2020","review":"Considering that the first one was absolutely terrific in delivering top notch action and delivering a solid story, this sequel is surprisingly average. The film has the feel and good ideas of the first, but the film mostly feels strained and forced. The film is still an entertaining film but its also disappointing in the fact that the first one was so good. I thought The Legend Of Zorro delivered average action and an average plot, I felt that there was nothing special about the film. The film feels like they're trying to outdo the first one which of course was great. This sequel is at times silly and really doesn't live up to the original. Overall the film is bordeline good fun, it's nothing truly excellent or good. The film is average. I found the acting to be quite sloppy too. The kid annoyed me and he was probably written into the script to give the film a \"needed\" edge that almost every sequel needs, a kid that gets himself into a shitload of trouble for the sake of putting the main characters at risk. This is too bad, because The Legend Of Zorro could have been something truly terrific, but the end results is that of a strained sequel that tries to overdue it's predecessor. The Legend Of Zorro will disappoint fans of the first, and some will think that this is an average or mediocre film with a watered down plot. Borderline decent, but not good or great at all. I was disappointed.","user":"MR_Heraclius","rank":[40,44]},{"title":"The Legend of Zorro - Don't Compare It To The First One","rating":7,"date":"28 October 2005","review":"We saw \"The Legend of Zorro\" at our local theater tonight, long-anticipating a sequel to a wonderful film featuring Antonio Banderas and Catherine Zeta-Jones. While hoping it would follow suit with the first film, we were committed to going in with open minds.<br><br>Simply, the film does not match the robustness, passion or provocative nature of the first film. That does NOT mean it is a bad film - just different.<br><br>Strengths of the movie include admirable performing by the Alejandro and Elena stars. Clearly, their on-screen match-up was a great renewal. It was good to see them together again, though there was far less chemistry than they enjoyed in the first film.<br><br>The stunt work was fairly good, though some was a bit over-the-top and not particularly believable. All in all, though, it added a bit to the overall story.<br><br>The most disappointing aspects of the movie were select portions of the scripting and casting. For example, young Joaquin speaks in 2005 language - 150 years too early. Those creating the script should have restrained themselves, and used a bit more time to research the language of the era being portrayed in the story.<br><br>As to scripting: unless my eyes deceived me, one of the padres in the film (actually, Joaquin's teacher) appeared to be one of the Dons from the first film. I am unsure why this would have been a choice by the casting folks - and further unsure why it would be approved by the producer or the director.<br><br>Finally, the film seemed to drag out a bit - didn't need to be &gt;2 hours long, in my estimation.<br><br>With all of this said, it is worth seeing. Just don't expect the blockbuster film that was the first \"Zorro!\"","user":"mls-11","rank":[89,130]},{"title":"Solid family adventure film","rating":8,"date":"3 November 2005","review":"If you don't like Saturday morning cartoons, children's adventure movies, and silly fun, then don't bother seeing this film. Otherwise, you'll have a good time. <br><br>The filmmakers take major liberties with history, human behavior, and the laws of physics, but it really doesn't matter. They're not going for realism. They wanted to make a flamboyant PG-rated kids' movie and succeeded. The characters all behave pretty much the way they do in kids' movies, and the cast is obviously having far too much fun.<br><br>Adults expecting a grown-up swashbuckler will be disappointed, but the adventurous kid in me really enjoyed it.","user":"Tigereyes","rank":[61,92]}]