[{"title":"Of course, you realize this means war!","rating":10,"date":"20 July 2004","review":"I have to admit having approached this movie with as much trepidation as anticipation. After all, Mel Blanc is gone, Chuck Jones is gone, and the hallowed Looney Tunes franchise now resides in the hands of younger players.<br><br>Think about all the things that could have gone wrong. The voices might not be quite the same. The animation might be done on the cheap, like a lot of modern \"cartoons\". The writers might opt for the kind of witless \"humor\" that seems to be in vogue today.<br><br>Happily, all my fears were unfounded. \"Looney Tunes - Back in Action\" is EXACTLY as good as I hoped it would be. <br><br>Not only are the animation and voices superb (the latter being indistinguishable from the originals), but \"Looney Tunes\" turns out to be a veritable showcase of variations on all those goofy gags you remember from the old cartoons. Characters walking into paintings, horribly defective ACME products, the running \"rabbit season/duck season\" feud...they're all here, with every bit of comic timing and inventiveness that you remember, and then some.<br><br>Fans of the old cartoons will have a field day catching glimpses of all sorts of minor players in the background. (Watch for Sam and Ralph, the sheepdog and wolf who pummel each other -- but only between 9 and 5 -- in the background of the cafeteria scene.) The writer, Larry Doyle, miraculously manages to cram dozens of minor Looney Tunes characters into the story, yet without making it seem awkward or contrived.<br><br>Of course, for the human characters, one needs actors almost as cartoony as the venerable WB rabbit and duck, and Brendan Fraser, Jenna Elfman and Steve Martin work beautifully in their roles. Fraser of course already has \"George of the Jungle\" and \"Dudley Do-Right\" under his belt; Jenna Elfman always WAS something of a cartoon; and after so many movies that underutilize his comic talents, what a joy it is to see Steve Martin turned loose to perform the \"wild and crazy\" kind of comedy we haven't seen since the beginning of his career!<br><br>There are also gag appearances by Timothy Dalton as a James Bond-ish spy (hmmm...) and Heather Locklear as one of his covert cohorts. Both actors show a nice flair for comedy. (Casting directors, please note.) There are also a few surprise cameos which I wouldn't dare to spoil. <br><br>The plot (for those who apparently weren't paying attention) involves the head of the evil ACME corporation (Martin) and his attempt to find a magical diamond which can change humans into monkeys. Recently-fired Fraser and Daffy are hot on the trail of Fraser's father, a spy who was captured while attempting to stop Martin's diabolical plot. Elfman and Bugs follow. The trail leads the foursome to clues in Las Vegas and Paris, before reaching its climax in outer space. It's pretty much your standard James Bond plot, except that it's scads wittier. (For those who expected something meatier, please check the IMDb for the following references: KUBRICK, STANLEY...WELLES, ORSON...and BERGMAN, INGMAR.)<br><br>Half the fun comes from seeing the various \"operatives\" that ACME throws up against our heroes: Yosemite Sam, Elmer Fudd, Marvin the Martian, Wile E. Coyote, et. al. And if that wasn't enough, there's a secret lab wherein Robby the Robot, Kevin McCarthy (\"They're coming! Beware!\"), and an assortment of recognizable 1950s bug-eyed monsters reside.<br><br>There's even a nice subtext involving Daffy's frustration at always playing straight man to Bugs, and the whole love/hate relationship between the two characters. Clearly, writer Doyle knows this material inside and out. <br><br>There are inherent dangers in taking characters that were, after all, short subjects, and expanding them into a 90-minute movie. Doyle overcomes these nicely, thank you, by moving Bugs, Daffy, Fraser and Elfman from one set-piece to another. He also eschews the all-too-common tendency nowadays to make an action movie fastfastfast, without any change of pace so we can catch our breaths. But no matter whether the characters are involved in an action sequence or just standing around talking, the gags come thick and fast.<br><br>Everything is rounded out with some nice special effects, and a zippy music score by the ever-reliable Jerry Goldsmith, who manages to beautifully integrate several classic Carl Stalling and Raymond Scott cues. (Yeah, you remember Scott. His music was that piece they played whenever they showed some sort of giant conveyor belt or monstrous contraption.)<br><br>As for those who didn't find this movie funny, all I can do is quote Bugs: \"...If you don't find a rabbit wearing lipstick amusing, then we ain't got nothing' to say to each other.\"<br><br>Or in the words of Daffy: \"Youuuuuuuuuu're despicable!\"","user":"Thomas_Veil","rank":[34,40]},{"title":"Slam dunks \"Space Jam\" and outdoodles \"Cool World\"","rating":8,"date":"22 November 2003","review":"Ever since \"Who Framed Roger Rabbit\" hit theaters in 1988, Hollywood has tried to replicate the formula of placing animated characters in the real world and vice-versa. \"Space Jam\" was loved when first released but now seems like a feature length commercial for Michael Jordan's career. \"The Adventures of Rocky and Bullwinkle\" worked on a spot-the-cameo level but little else. \"Cool World\" has for the most part blissfully faded from memory.<br><br>Then along comes \"Looney Tunes: Back in Action\" and does the impossible - it manages to be funny, entertaining and lively while still slowing things down at times to be insightful. Loaded with numerous celebrities mugging for the camera, satirical jabs at Hollywood and pop cultural references out the ying-yang, the movie has the true frantic nature of a cartoon.<br><br>Daffy Duck (voice of Joe Alaskey) has become fed up by constantly playing second banana to Bugs Bunny (also Alaskey) for the past six decades. He makes an ultimatum - either he gets equal billing and pay alongside Bugs, or he's out of there. Warner Bros. Vice President Kate Houghton (Jenna Elfman) promptly gives the duck the boot, and while vindictively wrecking havoc on the studio lot, Daffy hooks up with ne'er do well security guard D.J. Drake (Brendan Fraser) who happens to be the son of famous movie spy Damian Drake (Timothy Dalton).<br><br>D.J. is fired as well for not be able to stop Daffy's rampage, and reluctantly goes home with the duck in tow. However, things go crazy when he discovers that his father really is a spy and has been captured by the evil President of the ACME Corporation (Steve Martin). D.J must take up his father's mission of seeking the Blue Monkey Diamond, a mystical jewel that - like all mystical items in such movies - can be deadly in the wrong hands. Daffy's eyes naturally light up with greed at the sound of the word diamond and joins D.J.<br><br>Meanwhile, Kate is facing her own dismissal following less then stellar studio reviews of the latest Bugs cartoon without Daffy, and must track down the duck with Bugs' help to convince him to return. The four unlikely heroes team up to stop ACME, save Damian Drake and patch up Bugs and Daffy's fractured partnership.<br><br>A lot of love went into this product and it shows. Some of the best jokes are attacks on numerous sensitivity issues that protest groups have mounted against cartoons in the past few decades. Porky Pig and Speedy Gonzalez lament the effect that political correctness is having on their careers while Daffy is told that his constant complaining makes him appealing only to angry bald men who live in basements.<br><br>Sight gags rain in as well, the most memorable being a wonderfully conceived scene in the Louvre Museum in Paris where Elmer Fudd chases Bugs and Daffy in and out of numerous famous paintings like \"The Scream\" and \"Persistence of Memory.\"<br><br>The voice acting here is all near perfect. Alaskey does a much better job imitating Mel Blanc's famous Bugs Bunny voice then Billy West did in \"Space Jam.\" Bugs is still the street smart Brooklyn hustler he has always been, and adds a nice bit of levity to the proceedings.<br><br>Daffy is still delightfully conceited and selfish, though in a nice change of pace he is actually allowed to be heroic at some points. Also, it should be noted that while Bugs clearly control every scene he's in, this in indeed Daffy's movie and he carries it well.<br><br>Fraser has a strong enough presence to play alongside cartoon characters but doesn't have much to do in the humor department. We're reminded that like in \"Dudley Do-Right,\" Fraser just can't make a character funny without decent lines.<br><br>Elfman is also lively but remains wallpaper to her animated co-stars, as she should. Dalton on the other hand manages to be serious and goofy at the same time, and seems to be having a great time spoofing his own James Bond character.<br><br>But it's Martin who really puts in a performance here, playing the ACME President with a combination of Jim Carrey's loose-limbed gait and Robin Williams' rapid-fire dialogue. He's a truly unique character for Martin to play, a live action cartoon competing for screen time with Bugs and the others.  Martin makes him Dr. Evil as played by Jerry Lewis.<br><br>Director Joe Dante films this with the same tongue-in-cheek abandon that he used to bring \"Gremlins\" and \"The Howling\" to life. The movie's success owes much to his respect for cartoons, and his desire to undo the harm that \"Space Jam\" did to the characters is a breath of fresh air.<br><br>Along with fellow Warner Bros. characters like Wile E. Coyote, Pepe Le Pew and Sylvester the Cat, the movie also makes room for cameos by wrestler Bill Goldberg, Joan Cusack and even legendary B-movie schlockmeister Roger Corman.<br><br>\"Looney Tunes: Back in Action\" lacks the same originality that made \"Roger Rabbit\" immortal, but still has the energy and wit to remain memorable for decades to come. The movie twists the legends of the Warner stable while still honoring their personalities, and as such the movie works as both an homage to and a wink-at-the-audience spoof of the classic cartoons. It's a movie even Daffy will love.<br><br>Eight out of ten stars. Funny toons makes up for some lifeless actors, and the Looney Tunes legacy is returned to its former glory. Nothing despicable here.","user":"filmbuff-36","rank":[54,67]},{"title":"What The Yosemite Sam Were Those Naysayers Talking About?!","rating":10,"date":"14 November 2003","review":"What movie did those negative reviewers see?! It sure wasn't the affectionate, screamingly funny, devilishly clever animation/live-action comedy-adventure my family and I saw! Perhaps you need to be a Looney Tunes lover like our household and director Joe Dante to best appreciate this zany romp, because when we weren't laughing hysterically over the wall-to-wall gags (often delightfully inventive, like the sequence in the Louvre and the space climax -- and don't you dare leave before the end credits finish rolling!), the various pop culture references had us grinning, and not just the cameos by more obscure Looney Tunes characters (and I don't just mean Nasty Canasta and Cottontail Smith as Vegas casino owner Yosemite Sam's strong-arm boys, either!); spy flicks and action-adventure flicks come in for some sharply funny ribbing, too. Also, keep your eyes peeled for a couple of other beloved animated characters owned by Time-Warner these days. The humans are up to the task of acting opposite the irrepressible 'toons, too (Joe Dante fans, keep an eye out for cameos by his favorite actors and a certain B-movie director), especially hilariously ridiculous villain Steve Martin (as the head of the Acme Corporation -- which explains a lot :-) and Brendan Fraser, who good-naturedly sends up his own role in a certain movie franchise as well as simply being full of the muffiny goodness that long ago won our household's collective heart! :-) Don't listen to those flinthearted critics -- just see LOONEY TUNES... and have a big ol' laughariffic time!","user":"dtb","rank":[40,50]}]