[{"title":"Not the Tourist's Istanbul","rating":10,"date":"18 September 2004","review":"Uzak (2002), a Turkish film shown in the U.S. as \"Distant,\"<br><br>was directed, produced, written, and filmed by Nuri Bilge Ceylan.<br><br>This movie is a gritty and somber version of the clash between a \"city mouse,\" Mahmut, played by Muzaffer Özdemir, and a \"country mouse,\" Yusuf, played by Emin Toprak. <br><br>Both men are superb actors, and the plot allows them to demonstrate their acting skill. (Tragically, Emin Toprak died in an automobile accident shortly after the movie was completed.)<br><br>In most country cousin/city cousin tales, the contrast between rural and urban life styles is portrayed in a humorous fashion. In this film, there's little humor or even warmth. Both men have lost touch with human society. Mahmut 's work as a commercial photographer for a tile company gives him no satisfaction. He has divorced a woman he clearly still loves, and has no satisfying human relationships.<br><br>Mahmut has lost his job because of a factory closing in his small town, and doesn't have the skills or the energy to find work in the city. His human interactions are primarily confined to silent observations of the other people who cross his path. He's clearly a warm and caring person, but can't express these qualities in an urban environment.<br><br>The cousins don't relate well to the world, and they don't relate well to each other. Neither makes an effort to act in a way that would provide an opportunity for bonding or closeness. <br><br>In a sense, this film portrays an opportunity wasted. <br><br>Conceivably, each cousin could have provided at least part of what was lacking in the other's life. Instead, they steer parallel unhappy courses. The two men are distant throughout, which is a situation suggested by the film's title.<br><br>One of my friends mentioned the masterful way in which Ceylan builds detail upon detail. These details ultimately tell us more about the characters than we might have learned by simple exposition.<br><br>Uzak was shown as part of the Rochester Labor Film series. It's not a \"labor film\" in the traditional sense of that genre. It is a labor film because it demonstrates the harmful effects of unsatisfying work (Mahmut) and unemployment (Yusuf).<br><br>This is a quiet, absorbing, dark film. Although it doesn't make for happy viewing, I walked out of the theater realizing that I had seen a truly creative and important movie. This film is worth finding and seeing!","user":"Red-125","rank":[90,96]},{"title":"Outstanding film with a lot to say, not just about modern Turkey","rating":10,"date":"21 June 2005","review":"It's probably a year since I saw Uzak, but it has left strong memories of the two main characters, jaded photographer Mahmut and his naive cousin from the village Yusuf.<br><br>It's a long film with very little dialogue and a quite limited plot. This has evidently annoyed a fair few viewers. But the film constructs such a painfully believable portrait of Mahmut and Yusuf that there's just as much emotional tension as in the paciest thriller.<br><br>Just to be clear, there's no padding in this film -- in the long pauses where no one speaks there as much happening in the characters' emotions (and in yours, watching them) as you could bear. Go to see it awake and alert, and you'll be gripped rather than anaesthetised.<br><br>Uzak rings true in so many ways, and that sincerity is probably its greatest accomplishment. People don't grapple with events and problems, so much as with each other. In fact, in the whole film, there's probably not one point where the main characters (Mahmut, Yusuf and Mahmut's ex-wife Nazan) are not opposed.<br><br>Much of it is true the world over: country cousin Yusuf's perhaps wilfully naive expectation that a job on a ship will drop into his lap; Mahmut's urbanised cynicism and unwillingness to sympathise with Yusuf.<br><br>Other truths are more-specific to Turkey: Yusuf's incomprehension that Mahmut might be tolerating his stay with gritted teeth; Yusuf veering between macho ambition and wide-eyed awkwardness when he tries to get to know a woman.<br><br>Uzak is undoubtedly a pretty bleak film, and one Ceylan's strengths is not to beat us over the head with the themes he explores. For me at least, I believed entirely in the behaviour of his characters. All the little failed attempts to connect and petty cruelties ring so true. And yet I didn't leave with a message that \"The world is like that\", but instead I got \"This is how we sometimes treat each other.\"","user":"cine_rama","rank":[33,34]},{"title":"People must learn","rating":10,"date":"28 October 2004","review":"People must learn to watch what is up there on the screen. This is a great film that is based on a slow, careful gathering of details which serve to establish the personalities of these two men. The passivity of Yusuf (Emin Toprak), the country cousin, is well described by his fear of talking to women. He has at least three chances to start a conversation with a young woman and loses all of them. He has many decades of bachelorhood ahead of him, and maybe unemployment as well.<br><br>Mahmut is a different case. He got out of the small town by working very hard (we imagine), and his resentment of slackers like Yusuf is palpable (he leaves crumbs on the expensive carpet--the slob!). We are shown a group of friends talking about Tarkovsky among other things, and we note that Mahmut feels regret--but only slight regret--that his work has become commercial over the years. The gulf between the cousins just gets wider and wider. The mouse trap theme is wonderfully vivid, it brings out the compassion and confusion of Yusuf, and the cold-blooded problem solving of Mahmut.<br><br>I was reminded of two classic films of men driving each other nuts: Les cousins by Chabrol (the rich boy with Hitlerian pretensions played by Brialy is always in my mind) and Kiss of the Spider Woman (William Hurt can't figure out why everybody's so mean). Nuri Bilge Ceylan takes his place among the dozen important directors now active. I just hope that in future he will come to rely on collaborators, instead of directing, writing and shooting his films himself.","user":"bob998","rank":[80,89]}]