[{"title":"Amazingly accurate depiction of American adolescence","rating":10,"date":"9 February 2008","review":"I had one of the biggest shocks of my life recently. I proudly showed this film to my best friend from Europe. We normally have very similar tastes in movies.<br><br>I have to admit, I almost teared up a little around the end of the movie, but managed to keep my composure. Then the movie ended... to dead silence! I was waiting for my friend to say something, and what he said shocked me: \"What the hell was THAT?\" After discussing the movie a bit, I came to the conclusion that his experiences growing up were so different than this that it was like showing a futuristic Sci Fi movie to a person living in rural Zimbabwe. In the Czech Republic, where he is from, you don't commonly have these kinds of problems. Kids get along amazingly well. You may find this hard to believe, but in the Czech Republic, grade school and high school teachers routinely take their classes to places all around Europe. They have no trouble with kids not getting along. No one has any whiny special requests, and no one refuses to share a room with someone.<br><br>Guess that explains why this movie made no sense to my friend.<br><br>However, if you are an American, as I am, this movie is deeply touching, and may even bring back unsettling childhood memories of bullies.<br><br>Scott Mechlowicz is certifiably great in this movie, as is Josh Peck, who plays George, the bully. I look back at movies from the 1970's. Child actors back then were hilariously amateurish compared to these people. In fact, movies increasingly are showcasing young actors whose talents are absolutely astounding. (unlike the kid who played opposite Lucille Ball as \"Auntie Mame's grandson).<br><br>What makes this movie so compelling and memorable is that it is tragedy in the old Greek sense of the word: people bring about their own downfall. The bully George, as it turns out, has a good side, but he is socially inept, and so he lashes out in terrible ways. The kids are ready to like him and forgive him. Instead, George can't control his anger, and he verbally lashes out at everyone, until their newfound compassion (or at least pity) for him starts to evaporate.<br><br>The tragedy in this movie is that everything comes so close to working out fine for everyone.<br><br>I hope that will peak your interest. And speaking of interest, I have none in writing a \"spoiler\" review. This movie is best seen knowing as little as possible about the plot.<br><br>I think if I had to defend American movie making against all the criticism of how Hollywood depends on special effects, big name actors, and lurid story lines, I would choose this movie as proof that American movies are still the best in the world.<br><br>Addition added January 16, 2009: I have been writing reviews here for over three years. Sometimes years will go by without any indication someone read my review. So, please let me know if you read it. The thumbs up or thumbs down is entirely your choice. I'm just curious.","user":"pachl","rank":[45,49]},{"title":"Intelligent, superbly acted and thoroughly absorbing","rating":8,"date":"29 September 2004","review":"I knew next to nothing about this film when I went to see it. I knew it starred Rory Culkin, who was so good in 2000's best film, \"You Can Count on Me,\" and received some critical acclaim. But I knew nothing about the story and what a wonderful surprise \"Mean Creek\" proved to be.<br><br>This is an intelligent, engaging movie buoyed by some of the best acting by young actors this year. Writer-director Jacob Aaron Estes, who won a 1998 Nicholl Fellowship in Screen writing for his script, takes the basic premise of revenge against a school bully and turns it into a moving and gripping film. Incidentally, this is the second terrific movie to come out of that Nicholl class - the other was Karen Moncrieff's \"Blue Car,\" one of last year's best films.<br><br>Given the subject matter, \"Mean Creek\" could easily have been another after-school special masquerading as an indie feature. But Estes eschews the conventions of the genre to give his characters unexpected depth and create an engrossing morality play. None of his characters is a caricature; they're all flawed and unmistakably human. The moral issues they face are real and complex; the crises they create are dealt with expertly.<br><br>What's special about \"Mean Creek\" are its fine young actors. Culkin again is convincing as a skittish young boy being picked on by the school bully, but the two startlingly brilliant performances are by Josh Peck as the bully George, and Carly Schroeder as Millie, the young girl unexpectedly dragged into the plot.<br><br>Peck makes George captivating when he could just as easily made him a typical, one-note bully. Peck gives George substance and turns on the charm so well that we understand the others' reluctance to go through with exacting his comeuppance. George becomes likable, someone who seems to resort to bullying to hide inadequacies of his own. Peck draws us into his character; we feel sympathy for someone who is supposed to be unsympathetic.<br><br>The flaw in Estes' writing is that after making George someone who elicits compassion, Estes unwisely opts for an easy way out by forcing George to turn to his uglier side. Had George suddenly not turned mean, the moment would have been far more potent than it already is.<br><br>Young Schroeder is downright extraordinary. Her Millie is mature way beyond her years. She serves as the group's moral core and Schroeder's scenes in the immediate aftermath of a tragedy are so astonishingly raw, you're likely to forget she's a young teen actress. Hers is one of the best supporting performances the year. <br><br>\"Mean Creek\" is one of the best coming-of-age films. All teenagers and their parents should see this, despite its R rating. It's unfortunate the MPAA gave \"Mean Creek\" an R rating because despite the use of the F-word, \"Mean Creek\" is far less offensive than much of the PG-13-rated garbage - the more recent \"Charlie's Angels\" movies, for instance - and provides more enjoyment and insight into human behavior in five minutes than almost any mainstream movie playing right now.","user":"anhedonia","rank":[125,147]},{"title":"tight well made flick","rating":5,"date":"5 September 2004","review":"You're not going to leave the theater whistling dixie, and a box of Kleenex is not the best accessory, but this tight well made little movie is worth the effort. The actors, mostly all kids, are very believable, everyone of them does a great job, and maybe the credit should go to the director. As the movie bounces along you kind of expect that something is going to go wrong. And, of course, it eventually does, and after the big scene, it's like downer city, for everyone including the audience. But so what, if you want to go see a happy flick there are plenty of those around. This movie depicts kids in a very realistic light. The dialogue, their emotions, their reactions to a crisis, are very spot on. Good movies like this blow away so called \"reality\" TV. A friend with me said this reminded him of a Gus Van Sant movie, I don't agree with that, Van Sant movies always have some really weird scenes in them that detract from the overall cohesion of the movie. Mean Creek doesn't do that, check it out.","user":"samzpan","rank":[74,86]}]