[{"title":"I love love love this film!","rating":10,"date":"1 October 2014","review":"This is one of my all-time favorite films. I can watch it over and over again every year.<br><br><ul><li>it is insightful to the plight of chasing your call</li></ul><br><br><ul><li>it is encouraging in the pursuit of truly being yourself</li></ul><br><br><ul><li>it is a great road trip film with inspiring stops and killer music - top notch</li></ul><br><br><ul><li>it reminds you to love your parents while they are around</li></ul><br><br>(even if you don't have the best relationship with them)<br><br><ul><li>it is one of the best romantic comedy movies that isn't sappy.</li></ul><br><br><ul><li>Orlando Bloom is funny, impacting and emotional without being sappy.</li></ul><br><br><ul><li>Kirsten Dunst is authentic, charming, vulnerable and loving.</li></ul><br><br><ul><li>The entire movie has a nice mixture of stupid funny and heartfelt inspiration.</li></ul><br><br>Again, I love this movie. Watch i when you're not going to be interrupted. Put up with some of the silliness and get ready to be moved. You'll love it too!","user":"ericvr","rank":[23,24]},{"title":"Highly Underrated Movie With a Nice Feel to It","rating":9,"date":"12 March 2006","review":"Okay, I will admit up front that maybe Orlando Bloom doesn't do much for this movie but add a pretty face and certainly I am a sucker for Kirsten Dunst. Implausible plot - sure. But entertaining? I thought thoroughly so and with a good heart. The movie is very funny. Not slapstick, but funny. I laughed out loud often. The movie really doesn't take itself too seriously and that works for me. As for the acting . . . maybe I am being too hard on Orlando, because nothing he does is particularly bad, just forgetful I guess. But I will admit that I just felt like the cast wasn't particularly important to the movie. The movie has a feel to it that I connected with. The music, the visuals, the ease with which it flowed - just struck a chord. Overall, though it isn't that the cast is bad - they simply aren't noteworthy. In fact, I cannot remember a performance that was distracting or didn't mesh. It just seemed to me that the writing, the direction and the composition of the movie produced a feeling, triggered thoughts that made this movie a special event, time well spent ... who knows - I liked it.","user":"rbueing","rank":[16,17]},{"title":"How could so many critics have panned this amazing film?","rating":8,"date":"24 October 2005","review":"For the critics who say this film meanders and rambles, I have to say this: When your dad dies, your life meanders and rambles. I can't speak for everyone who has lost a father but I can speak for myself, and I thought it was spot-on in it's portrayal of the confusing roller-coaster that surrounds the death of a parent. Elizabethtown has all of the things you'd expect from a Cameron Crowe movie: a unique and personal story, great music, beautiful cinematography, surprising humor (I was actually choking from laughing so hard during the videotape scene) and very real and touching moments. I thought the acting was great. Orlando Bloom gave a touching and subtle performance. Kirsten Dunst's accent did go in and out a bit, but she and Bloom had such great chemistry that it didn't bother me at all. Susan Sarandon was perfect, Alec Baldwin was hilarious, the Elizabethtown residents were quirky and fun...if I have a complaint it's that the amazing Judy Greer was underutilized. Overall, this movie had everything that a great movie should have. Shame on the critics who panned it simply because it didn't follow the usual Hollywood plot mapthis film is about taking the scenic route and making the trip meaningful, and that's what it did.","user":"porterkelly","rank":[321,439]}]