[{"title":"A wonderful film -- what cinema is made for. But badly mis-marketed.","rating":7,"date":"2 January 2004","review":"I went into the cinema with friends and said: \"It's a Farrelly Brothers film; you can guess the level of humour.\" There's Something About Mary I love, but let's face it -- the humour is quite crass, even if the movie does have some heart. So I expected another movie with jokes in bad taste, and lots of humour at the expense of conjoined twins. At least this is how the film has marketed it.  However, it couldn't be further from the truth. What has been marketed is quite different to what the film is about.<br><br>Whilst the film does have humour -- some movements hilariously funny -- this film is at heart a light drama. And this is by certainly no means a bad thing. When I expected low-IQ humour, what I got was just a really engrossing tale of two brothers who just happen to be conjoined. The chemistry between Damon and Kinnear is just perfect, and the relationship between the brothers (no doubt written from experience by the Farrelly Brothers) was wonderful.<br><br>Fox's marketing treatment of the film is appalling. In the trailer, Matt Damon's character says: \"We're not Siamese, we're American,\" and the trailer plays it like he is stupid. Whereas in fact, when watching the film, the context is very different -- he's reacting with indignation, and in defence of their conjoined nature. This is indicative of the entire film. Never is their conjoined-nature used for humour in a bad way.<br><br>Throw away what you've seen in the trailers, or what you think the film is about. Go and see this movie that has its heart so very much in the right place -- a great antidote to so many Hollywood films that have the soul of a stone. I don't normally get sentimental with films. I'm the type of viewer that laughs when Jack dies at the end of Titanic. But I went away from Stuck On You knowing I'd seen a very special film indeed. Highly recommended.","user":"antony-1","rank":[110,124]},{"title":"Touching Comedy","rating":8,"date":"3 May 2004","review":"To be honest, I am still a little amazed at how much I liked this film. I resisted seeing it for a long time because the concept sounded so offensive. But offensive is the last word I would use to describe this movie. Hilarious would be more accurate. The conjoined twin thing never feels like fodder for cheap jokes. Yes, it plays prominently in the plot, but it just never feels like you are laughing at them, only with them. There is genuine affection for the two main characters, played expertly by Damon and Kinnear, that really shines thru.  To be absolutely honest, a lot of what makes this film so incredible is hard (for me, at least) to describe. All I can say is that it's funny, it's touching, it's a bit of Farrelly brothers magic. See it, you won't regret it.","user":"ivko","rank":[90,106]},{"title":"A surprisingly effective comedy","rating":7,"date":"25 February 2004","review":"This turned out to be a surprisingly effective comedy.  Okay, sure, you can say that a movie that pokes fun at conjoined twins is in poor taste, but there's nothing malicious about it -- it feels, if you can believe it, genuine.<br><br>You really get a sense of the tenderness and the bond that has developed between the two brothers.  Of course, as you'd expect from the Farrelly brothers, it's laugh-out-loud funny.  As you might not expect, there's not really any gross-out humor: it's more \"Hal\" than \"Mary\".  If you can't tell, I was pleasantly surprised by this movie.<br><br>Some gag highlights: Cher with her boyfriends, Matt Damon's stage fright, Greg Kinnear in a animal costume.","user":"ghonzo","rank":[30,33]}]