[{"title":"Alexander","rating":6,"date":"22 February 2020","review":"With such an epic story, you would think someone like Stone would produce an epic film. From the random accents of the characters (specifically, I have no idea what Jolie was trying to do), to some pretty atrocious acting from Farrell-he's capable of much better, but this was at the height of his grandiosity and ego. There are so many moments where it feels like the film is onto something, only to have it stop and spin off into another, pointless direction. Bottom line: a $155 mil film about Alexander the Great should have been iconic, but Alexander falls flat on its face from the weight of the egos involved.","user":"MR_Heraclius","rank":[37,38]},{"title":"My take on this","rating":5,"date":"5 December 2004","review":"At first, I didn't feel much of a need to comment on the film, since so many others have written and have said so many things. But I think there are some really important points to made, and I haven't seen anyone make them. So here I am writing.<br><br>In my opinion, almost everyone misunderstood the relationship between Hephaistion and Alexander. In the modern world, especially in the West, two men are either very close to each other, sleep together, and have sex, or they keep a good comfortable distance from each other and, if they're friendly, might punch each other on the arm. In this film, we see a relationship that is hard for most people today to understand, namely a passionate love relationship between two men in which sex is not very important and possibly even absent.<br><br>Aristotle essentially explained the whole film near the beginning when he told the young couple something like the following, as best I can remember it, \"When two men lie together in lust, it is over indulgence. But when two men lie together in purity, they can perform wonders.\" Or something like that. Given what I know of that culture, I am sure that \"in purity\" means no sex, or at least very little. That's why we never see them kiss. In the film, as in many older films, kissing is a metaphor for sex. Even when Alexander kisses his mother, it refers to the idea of sex. That's why Alexander kisses Bagoas, but not Hephaistion.<br><br>Now I'm not sure if the real historical Aristotle would have made that remark. That's not exactly what he says about homosexuality in the Nicomachean Ethics. But the remark is plausible enough since Alexander could easily have heard such an idea during his youth. Plato (before Aristotle) expressed that idea, and Zeno of Citium (after Aristotle) did too. So even if Aristotle never said this to Alexander, it is plausible enough that the idea was in the air and that Alexander heard it from someone or other.<br><br>Some have complained that the \"homosexuality\" (assuming that A's relationship with Heph. should even be called that) was thrown in their faces too much. But it's crucial to the plot. Stone is hypothesizing that Hephaistion was essential for what Alexander did. Further, it's a standard Hollywood convention to juxtapose a love story with some great political, military, or otherwise grand event. There are tons of examples. Titanic, Enemy at the Gates, Gone with the Wind, ... the list could go on forever. It really is homophobic to complain about Stone continually going back to this theme, because he has a perfectly good artistic reason to do it.<br><br>A few more details: Alexander's hair. I think that Stone was trying to make Alexander look like Martin Potter in Satyricon -- a nod to Fellini.<br><br>Alexander's accent and soft appearance. Another nod to a great director passed on, this time Stanley Kubrick. Farrel really looks a lot like Ryan O'Neil in Barry Lyndon. In fact, he really looks like a Ryan O'Neill / Martin Potter coalescence. I think it's deliberate.<br><br>The softness of Alexander's personality. In a lot of scenes it made sense. He was gentle enough to know how to approach Bucephalus and tame him without scaring him. He was open minded enough to adopt a lot of Persian culture and encourage intermarriage, while the other more \"he-man\" folks around him were less comfortable with the idea.<br><br>Yes, if you haven't figured it out by now, I do like the film. People's hatred of the film is hard for me to understand.","user":"bolender-1","rank":[740,1]},{"title":"Stone stumbles over Alexander","rating":7,"date":"14 December 2004","review":"When \"Gladiator\" stirred a latent interest in films about the ancient world I was so hopeful we would finally be able to enjoy some exciting cinema about my favorite time period. I have not been totally disappointed. USA Television network has given us Attila, Caesar, and Helen of Troy - not without flaws but solid efforts. Wolfgang Peterson's \"Troy\" did not resemble the Iliad I had studied but I appreciated the performances of Eric Bana and Brad Pitt. Brukheimer's \"King Arthur\" could have used more experienced epic direction but was loosely based on historical accounts of Sarmatian auxiliaries and their commanders in late Roman Britain and I liked the grittier result to the fairy tale legends of my childhood. Then I heard about Oliver Stone's production of \"Alexander\" and I was sure we would have a film of the caliber of \"Ben Hur\". Unfortunately, Stone managed to take what should have been a ready-made screenplay and solid performances by Angelina Jolie, Val Kilmer, and Colin Farrel and imparted as much insight into the character and charisma of the world's most famous conqueror and military genius as the images of shadowy figures thrashing about in the blinding dust of Stone's Gaugamela.<br><br>His opening sequence with Anthony Hopkins, as Ptolemy I, droning on about his memories of Alexander was more protracted than a prologue to a History Channel documentary. In fact, I heard a man behind me mutter something like \"I came to watch a movie not the History Channel!\" <br><br>Stone's next major error was to omit any scenes of Philip's military prowess. \"The Lion of Macedon\" was as much a military genius as his celebrated son but Stone leaves us with little more than an impression he was a drunken lout. The omission of the battle of Charonea was nothing short of a blunder since it epitomized the sharing of military experience between father and son with Philip masterminding the battle and Alexander, a mere 18-years old, leading the cavalry in a critical maneuver to assure the victory. Stone handles Alexander's tutelage by Aristotle clumsily as well. Instead of focusing on Alexander's insatiable curiosity about the world around him and how Aristotle nurtured his intellect, we see a brief scene where Aristotle is essentially defending Alexander's friendship with Hephaistion to a sneering Cassander. During Alexander's brief lifetime, Alexander maintained his relationship with his tutor for years, sending examples of plants and animals from the lands he conquered back to Aristotle for study.<br><br>Then to skip both the battles of the Granicus River and Issus totally left me aghast. I think the most damaging omission was the battle of Issus. It is at Issus that Alexander first confronts Darius himself and Darius flees from the Macedonian onslaught, leaving his wife and daughters to Alexander's mercy. When Stone depicts Darius running from Alexander at Gaugamela it is done in such a way that the audience doesn't perceive it to be a lack of personal courage but just an escape, especially without the knowledge that Darius had broken and run from Alexander before.<br><br>Furthermore, Gaugamela was not executed in a way that illuminated Alexander's strategy and daring. Stone should have watched \"Alexander: The Art of War\" produced by the Discovery Channel for better insight.<br><br>Stone treats us to only one last battle scene in India at the Hydapses River. Again, it looks more like a running jungle battle vis-a-vis Vietnam than a carefully strategized battle where Alexander had to execute a tenuous river crossing below the expected battle site to draw some of King Porus' forces away from the center and enable Alexander's infantry to be effective. <br><br>As for the near mortal wound, Alexander was wounded at the siege of Malia, a fortified town on the way back to the Indian Ocean. He dashed over the ramparts of the town before his main force could catch up to him and he wound up cut off and, with three other companions, cornered and fighting for his life. Two of his companions were killed and a severely wounded Alexander is protected by the last remaining companion bearing the shield Alexander had supposedly taken from the grave of Achilles at Troy - another missed cinematic opportunity!<br><br>As for Alexander's bisexuality, I objected to Stone's portrayal of Hephaistion as an eye-linered catamite walking around in billowing robes. Hephaistion was as skilled a warrior as Alexander and a successful commander in his own right. Maybe Stone could not bring himself to accept a deep relationship between two very masculine men.<br><br>Now, I can only hope that the vehicle starring Leonardo diCaprio is produced or HBO gives Alexander the treatment he deserves with a blockbuster miniseries like \"Band of Brothers\".","user":"mharrsch-1","rank":[154,220]}]