[{"title":"Gripping, moving and totally amazing. An amazing story that never fails to grip and is only made stronger by the dramatic recreations fuelled by Simon & Joe's recollections.","rating":18,"date":"18 January 2004","review":"In the mid-80's two young climbers attempted to reach the summit of Siula Grande in Peru - a feat that had previously been attempted but never achieved. With an extra man looking after base camp, Simon and Joe set off to scale the mount in one long push over several days. The peak is reached, however on the descent Joe falls and breaks his leg. Despite what it means, the two continue with Simon letting Joe out on a rope for 300 feet, then descending to join him and so on. However when Joe goes out over an overhang with no way of climbing back up, Simon makes the decision to cut the rope. Joe falls into a crevice and Simon, assuming him dead, continues back down. Joe however survives the fall and was lucky to hit a ledge in the crevice. This is the story of how he got back down.<br><br>Yet another reason to lament the closing of Film Four's doors, this film is the cinematic equivalent of sitting listening to someone tell you an amazing story in their own words. The film is acted out in dramatised scenes but it is Joe's and Simon's words over the top that really will keep you hanging on. The dramatised scenes though, are still wonderful, it is very easy to forget that this was not somehow filmed at the time, not only do they look very, very real but they also look spectacular; when Joe talks about the imposing crevice he was in, the pictures on screen did much better at translating that into visuals than my non-mountaineering imagination could have done.<br><br>The two actors in the roles of Joe and Simon do a great job; like I said, it is very easy to forget they are actors or that this is a replay for the camera. However the real people are more interesting and it is they that drive the film. To hear Joe talk about what he did and felt puts so much more bone on the story that any Hollywood version could have managed. He is a great guy and I can only imagine what he went through. Simon on the other hand is more guarded. He never really goes below the facts, whereas I know he has issues underneath as he apparently was not as calm as he is on camera during the making of the film. The film ends with some captions - one of which being that Simon came under great criticism for cutting the rope from other climbers. However the talking heads bit never even touches the surface of what Simon had to go through after they all got home - in a way that would have been just as interesting a part of the film as what Joe went through.<br><br>As the story unfolds it is impossible not to sit shaking your head in amazement. At the start I was like everyone else 'why would you do this stuff for fun' etc, and I still think that, but the story is so gripping that it is impossible to think of anything else. The running time is generous and allows Simon to tell his story properly, it is amazing and the sense of impossible odds and the sheer pain involved is brought to the audience very well - even with a handful of people in the audience gasps and 'ah's' were very audible. Overall this film is more dramatic than any Hollywood drama I have seen in a long time. It is not without flaw but it is difficult to sit and just watch it - I was enthralled by it, a true dramatic human story that never let me get bored or distracted. By the end, Simon has put forward his many emotions so well that I was very moved. The only think that would have made this film better would have been a bit more of searching inside himself by Joe in the final 15 minutes, in my heart I doubt if I could ever forgive myself and I wonder how he did or if he did.","user":"bob the moo","rank":[65,71]},{"title":"Breathtaking Andean photography ... and a will to survive","rating":9,"date":"20 June 2004","review":"Awe-inspiring work by director Kevin Macdonald takes us with a minimum of fuss to a corner of the Andes in Peru for this epic tale of endurance against the elements. After what appears to be a relatively rapid, routine conquering of a 22,000 foot peak, we are left contemplating what might be in store to fill out the rest of the film.  Suffice to say we are told that eighty per cent of climbing accidents occur on the descent. Harrowing times in the extreme soon present themselves, with amazing camera work accompanied by stark human emotions as life-affecting decisions have to be made in the harshest of conditions. There are only three actors in this reconstruction of an actual climb made in the 1980s.  The original climbers themselves personally add to the screenplay at appropriate moments, to what I believe is just the right extent for maximum effect.  We are made to wonder what drives a couple of fit 25-year-olds to climb to such heights, in such conditions, with an insufficient gas supply, no oxygen, and no backup team.  But that is sometimes the reckless nature of young people that age. <br><br>The viewer is left in no uncertain mind about the might of nature versus the insignificance of human effort.  This is reinforced in most spectacular fashion by the use of zoom photography, underlining the sheer size of the Andes mountains.  What does make the difference, though, is the strength of the human will, particularly when it comes to a matter of very survival.  In this case we are given to believe this is largely driven by the fear of dying alone, but I found myself trying to identify what other motives might have been present in such dire circumstances. Considering the semi-documentary nature of the film, and the conditions under which it was made, I cannot rate Touching the Void less than 9 out of 10.  It had me on the edge of my seat until the final credits.","user":"dkennedy3","rank":[32,34]},{"title":"Amazing: everyone must see this","rating":10,"date":"18 January 2004","review":"This film describes the true story of a climbing accident in South America in 1985, using dramatisation with voice-overs and interview excerpts from the three British men who were actually involved. It may sound boring, but I cannot stress this enough: this film is much more tense, and nail-bitingly gripping, than any Hollywood action movie - because you know that everything you're seeing and hearing really did happen to these guys.<br><br>The story itself is incredible. It will redefine for you the capabilities of the human mind and body. There is action, sadness, hope, and even brilliant humour in places.<br><br>Please go and see this film; you won't regret it.","user":"Anig-2","rank":[57,63]}]