[{"title":"You'd do the same. If you saw those kids on the street, you would do the same.","rating":8,"date":"30 June 2014","review":"The assassination of Dublin crime reporter Veronica Guerin in 1996 shook Ireland to the core, her murder saw a public swell of determination to rid the country of its drug peddlers. Joel Schumacher's film is an in depth interpretation of the woman, her beliefs, her family life, her complexities and her stoicism to root out the drug barons putting liquid death into the arms of the many.<br><br>Thankfully avoiding Hollywood clichés, it's often gritty and well thought out, Schumacher and his writers, Carol Doyle and Mary Agnes Donoghue, don't soft soap the Guerin image, her faults are laid bare alongside her searing strengths. The dangers of her work are very prominent throughout, leading to some suspenseful and fearsome scenes. Cate Blanchett as Guerin is inspired casting, an actress capable of covering all facets of the human condition, and in support Ciaran Hinds, Gerard McSorley and Brenda Fricker give powerful performances. 8/10","user":"hitchcockthelegend","rank":[15,15]},{"title":"Solid True-Story Irish Crime Tale","rating":8,"date":"19 March 2006","review":"Cate Blanchett has done it again - played someone you can't take your eyes off of, and not because she's a classic beauty but she's just a good actress and plays such intense roles. Here, she's the single-minded outraged Irish reporter out to expose the drug trafficking in Ireland in the mid 1990s. Yes, it's based on a real person, a very real Veronica Guerin, who took her life in her hands with her desire to have this problem taken care off so the kids in her country wouldn't have such easy access to harmful drugs.<br><br>According to the film story, the drug problem was ignored or the police were just ineffective in dealing with it, so Guerin goes after the mob as an investigative reporter. Her husband pleads with her to stop, knowing she could easily be killed. The gangsters were tough and realistically portrayed on film. There is no talk-now-shoot-later nonsense. You mess with them, you will pay. That's the message they give Guerin and you'll have to see the film to find out what happened.<br><br>Yup, this is an attention-getter from the start and especially with Blanchett in the lead. A good story and highly recommended.","user":"ccthemovieman-1","rank":[40,47]},{"title":"Cate Blanchett Exposes Hollywood","rating":10,"date":"15 December 2005","review":"Just as Veronica Guerin exposed Ireland's underworld drug dealers, Cate Blanchett's marvelous portrayal of Irish journalist-turned-anti-drug-crusader Veronica Guerin seemed to have the actress on a mission to prove that you don't have to look like a pop diva or act like a porn star to be a compelling female lead in a film.<br><br>Like many films with an ethnic flavor, we get a supporting cast of ethnic actors in slightly elevated roles from the norm. Most notable from that category are Gerard McSorley as the evil drug-lord, John Gilligan, and Ciaran Hands as street thug John Traynor, who plays both sides of the fence throughout the film.<br><br>The story is painful, not only because of what happens to Guerin, but in our knowing that her courage is a direct reaction to our general apathy towards wrongdoing, with so many of us looking the other way that the Veronica Guerins of the world are encouraged to fight evil after the fact, but left as sitting ducks or thrown to the wolves while they are still alive and making noise.<br><br>If there's one lesson every viewer of this film should exit with, it is that those of us who are not part of the solution, are part of the problem.","user":"ray-280","rank":[32,41]}]