[{"title":"Wretched from start to finish","rating":1,"date":"28 June 2005","review":"This movie is one sorry mess and its hard to believe it was ever made. There had to be some kind of tax shelter deal that enabled the birth of this monstrosity, because I fail to see how any rational person would ever willingly invest money into a script like this.<br><br>The plot involves a government-owned oil rig conducting secretive drilling operations deep underground. Something goes wrong and the crew from a tugboat delivering supplies to the rig investigates. Of course, there are government agents involved and higher-level military officers trying to keep the oil rig experiments a secret from the outside world.<br><br>This could have been a decent horror/thriller but the filmmakers obviously didn't care. Some scenes were so blatantly stupid that one would have thought of them as parodies of horror film clichés, but no, they were actual attempts at generating suspense and drama. Usually scenes are included in movies to move the story forward and to develop the characters, but the makers of \"Sea Ghost\" decided it would better to include scenes that made absolutely no sense in the context of the movie. To top it all off, the CGI was pathetic, I'm sure an eight year old using a Mac could have developed better effects, and would have saved the producers some money to boot. At least the no-name actors tried, although some seemed to be playing it as a comedy and others as a serious horror.","user":"jack_thursby","rank":[46,50]},{"title":"Nothing below","rating":4,"date":"4 October 2005","review":"*SPOILER ALERT* *SPOILER ALERT* <br><br>\"The Thing Below\" is a completely unnecessary movie. I didn't need to see it and no one needed to spend two seconds making it. In fact, I would dare say that no one should have even thought about making it. I rented it expecting a cheap \"Deep Rising\" rip-off. It's a sad day when your movie watching hopes are dashed because they weren't low enough. I thought mine couldn't possibly get any lower. A \"Deep Rising\" rip-off was asking too much? Yes. Yes it was.<br><br>\"The Thing Below\" starts off with the usual B-movie scientists doing stupid things in an isolated setting. This time they're on an oil rig and let loose The Thing Below. A cargo ship arrives to check out the situation. Then the movie spins off into oblivion as the monster is not a beast with fangs, tentacles and other cool monster appendages but some sorry telepathic creature that can read your mind and exploit your fears, hopes, dreams etc. This leads to a scene where the monster turns into Glori-Anne Gilbert so it can do a strip tease for one of the crew members and another scene where there's an Old West style shootout (?!). I'm sure once the filmmakers saw the quality of their monster special effects, (terrible, awful, etc), they decided to take the telepathic creature route. It didn't really matter which monster they chose because there's no suspense, no thrills and pretty much nothing below. Well, nothing worth getting excited about that's for sure. Any way you look at it, this movie needs to be tossed away and forgotten.","user":"Dr. Gore","rank":[14,14]},{"title":"worst use of CGI that I ever witnessed","rating":2,"date":"8 September 2005","review":"a drilling platform off the Gulf of Mexico raises the worst, most incompetent CGI sea creature that you're likely ever to see from deep under the ground. It breaks free of the containment that it's being held in and goes on a rampage. Apparently it can change people's perception of reality to (I have no clue either). The government is trying to keep this particular oil rig secret, if only the Producers of Jim Wynorski's latest in a LONG series of awful movies dating back to 1990 (when he made his last enjoyable film) opted to do the same thus sparing us 94 minutes of our lives that will never be returned. Avoid this incompetent trash like Paula Poundstone and you were an orphan. The thing is if it wasn't for the CGI it wouldn't be THAT bad. Don't get me wrong it would still suck, just not as much.<br><br>Eye Candy: Glori-Anne Gilbert dances topless for no reason whatsoever<br><br>My Grade: D-","user":"movieman_kev","rank":[24,26]}]