[{"title":"I knew Aileen.","rating":10,"date":"11 November 2006","review":"Why would someone want to be comment number 458? Because it might mean something to somebody. This movie meant a lot to me.<br><br>I spent about four hours, sole-to-sole, in the back of a pickup truck hitch hiking with her and a friend of mine in Florida. This was before she had killed anybody, I believe.<br><br>Years later, I saw the \"wanted\" drawing. It sort of rang a bell, but a lot of usual suspects look like that, don't they? What are the chances? Then, they caught her and showed the first photo, then gave both the nickname (like a cousin), and the real name (like another cousin, only spelled in Irish.) At the time, she mentioned the spelling with an \"A.\" I asked her if she was Irish and told her about my two cousins. What a small world, right? She either told me her last name and I assumed it, or told me she was Greek. The point being, the whole name aspect was the first part of a four hour life story discussion we had. And you don't forget four hours of a face like that either. The life stories matched. It was her.<br><br>The mood swings Charlize Theron portrays are perfect, as are the mannerisms, body language, clothes, teeth, complexion, hair, the body fat, manner of speaking, that strutting walk and just everything. It was absolutely uncanny. You never forget someone like that, and then when they pop up alive like that again. It was just unreal.<br><br>She was mood swinging, or perhaps \"cycling,\" the whole time I was with her. I imagine if that was portrayed realistically, the movie would be unwatchable. I remember thinking at the time, her behavior seemed like the popular portrayal of those \"possessed.\" <br><br>After I saw Monster more than twenty years later, I called the other guy that was with me. We have remained friends over the years. I told him \"Oscar this, Oscar that,\" blah blah blah, just out of the shock of reliving the experience of Aileen again. The fact that she was played by the glamorous, beautiful, Charlize Theron on top of it, was beyond all comprehension. What a transformation! Of course, my beloved, goof-ball buddy was sitting beside her sleeping most of the time in the truck. His head kept on falling on her shoulder and she would push it off. It was like Three Stooges. They shared the Doritos like it was the school cafeteria or something. Can you imagine, in hindsight? Yes, it is good for a few jokes, I admit it. She hadn't killed anyone yet, so far as I can tell from reading about her and piecing the time-line back together. This was the first and only time I had been in Florida in those college-age days, so putting that together was fairly easy.<br><br>I don't know if I ever met anyone, before or since, that I have felt more sympathy for at the time. She was very talkative, about herself and the hard times she'd had. She was believable. She wasn't scamming us or anything, as I first suspected, just shooting the breeze. I wanted to cry for her. I think I even did so later, in hindsight. She was unreal. She had, what I thought, were \"multiple personalities.\" Really just two, she would laugh one second, cry the next. She was like a big, tough hard-ass girl of eight years. She told me all about her childhood abuse, the horror of being a prostitute, and taking beatings and abuse from the men. She mentioned living in hotels. She didn't seem like too much of a drinker or a druggie. I just thought she was deeply, emotionally disturbed. In those days, we should have said \"mental.\" My friend and I were a couple of happy middle-class college snowbird guys on Christmas break. She had about the worst kind of life of anyone I had ever met. She was only about four or five years older than us, but looked twice her age. When I thought later about the hand she was dealt, compared to mine, you better believe the religious feelings and tears well up. They still do. I can't bear to watch the movie sometimes, or at least parts of it.<br><br>Yes, what she did was wrong, if not evil. I don't think she was evil though, at all. She had the innocence lost, naive but semi-funny sweetness portrayed in the movie. I don't usually contemplate these things, its just that you could see there was a good person there, just profoundly _____ed up. For some reason, I was proud of her when she wanted the execution. She was nothing if not honest. As an outside observer, I don't know how you feel sorry for someone like that, but if you knew what happened, you just might. I have no agenda in that regard. Watch this and ask yourself if monsters are made, or are they born? This movie captures my feelings perfectly. If you have read this far, you can see the conflict. The movie reflects that so well, I can not do it justice by praising it with words.<br><br>If you were a victim of her actions, I wouldn't blame you for hating what I'm writing. If I read something like this about Charlie Manson, I'd never believe it.<br><br>I just want to thank everyone involved in telling this bizarre story.<br><br>I would advise people to see this if they want to be challenged, not just entertained. I've read some of the headlines on the index. So should you.","user":"piXelpiXelpiXel","rank":[645,676]},{"title":"Gripping but incredibly depressing","rating":9,"date":"14 February 2004","review":"Based on a true story this movie is about Ailen Wuornos, a prostitute, who killed quite a few men who she \"serviced\".  She was convicted in 1990 and executed in 2002.<br><br>She's played by Charlize Theron who's just incredible.  It starts off just before she began murdering men and has met Selby (Christina Ricci), an adorable lesbian who loves her.  It basically chronicles their relationship and what led Wuornos to kill these men.  Also she reaccounts her childhood and how she became a prostitute.  It's more than a little depressing--it's a tragic story of a beaten woman who saw murder as the only way out.  Only three murders are shown and that's more than enough.  The violence is not glorified--it's bloody and sick and one is the most harrowing thing I've seen in years.  What's so fascinating (and scary) about this film is that I actually began to sympathize with Wuornos!  While I could never condone her actions you can see clearly what led her to it.  This is a rare film--it makes a serial killer look sympathetic.<br><br>Theron is a wonder in this--she became Wuornos (who was very unattractive). She gained weight, shaved off her eyebrows, colored her hair, used contacts and dentures to change her appearance completely.  Never once did I think I was seeing Theron acting--she BECAME Wuornos.  A great performance--she'll easily get the Oscar for this one.  Ricci is also good here.  She's been ignored in the press but she nicely underplays the role of Selby and is a perfect contrast to Theron's acting.  Also nice to see Bruce Dern in a small role.<br><br>Music is used very effectively here.  They play songs of the time it took place (1980s) so you know when this is happening and also nicely complements the actions on screen (especially with Journey's \"Don't Stop Believing\").<br><br>A very good movie but a very depressing one.  Proceed at your own risk.","user":"preppy-3","rank":[224,252]},{"title":"Lying Down With Dogs.","rating":8,"date":"18 December 2004","review":"An intense, depressing movie. It sticks pretty close to the facts but focuses chiefly on the relationship between Charlize Theron as Lee and Christina Ricci as Selby. The police are hardly there at all. In fact, neither is anyone else except for Bruce Dern who makes one or two short but welcome appearances.<br><br>It could easily have been a by-the-numbers TV movie. (Come to think of it, it has, hasn't it? With Jean Smart?) But the production values are good, and the time and money has been spent on this film that we usually associate with feature films.<br><br>The cinematography is outstanding. The shots of Lee near the end of her rope, hitching on a foggy blue nightime Florida highway look like a desktop theme from some arty horror/occult site. The script doesn't have many tag lines. No \"Rosebuds\" or \"I coulda been a contendah.\" Nor is it folksy or catching in some other way. The dialogue follows the story in being pretty straightforward and without much in the way of noticeable touches. The director should be commended on her handling of two things. One is the explanation for Lee's crimes. None is given. There is a short scene in which Lee tells one of her johns about her miserable childhood, but the abuse excuse is vitiated by Selby's mother, an orthodox and unimaginative woman, who says simply that lots of people have hard childhoods without growing up like Lee. And the men are not all turned into sadistic hogs, which must have been a temptation for the writers. The second virtue in the direction is its management of the murders. Instead of exploding heads, there are a few squibs, and usually not even that, before the victim yields to the fathomless, cool, enwinding arms of death. The themes explored here are not so much violence as love and desperation.<br><br>Ricci looks the part, with her broad forehead and tiny lips, but comes across more as a Valley Girl than the kind of outcast who would pick up and move off with someone like Lee.<br><br>Which brings us to Theron's performance as Lee. It's startling, of course, to see a glamor-puss like Theron so thoroughly deglamorized. It's the kind of performance that wins Academy Awards -- lesbians, the height-challenged, autistics, all have won awards in recent years. Theron deserves recognition for her effort too, but not just because of the makeup and wardrobe. They're all splendid. Makeup has shaved her brows to a Mona Lisa extent and turned her face just blotchy enough and given her a raggedy set of teeth.<br><br>But that's not all that has made her performance as the central character so memorable. (She's in almost every frame.) And it isn't the thirty or so pounds that she put on for the role either. What's so homeric about that? I can put on thirty pounds without blinking an eye, and enjoy doing it. Heck, I can put on forty or fifty if she wants to get into a peeing contest. No -- it's Theron herself who MAKES the character. She's great, particularly in her physical manifestation of Lee -- her body language, for instance. Instead of coasting through the role, she animates it. The way she struts around with her shoulders thrown back and her face down, emphasizing her several chins and the girth of her neck. Maybe it takes a profession ballerina to figure out these little techniques. Her voice isn't as coarse as that of a hooker who constantly puffs on cigarettes, but Theron does what she can with her own. She overcomes her native South African speech with no trouble and introduces us to a breathless bravado that she's never used on screen before -- not that I know of.<br><br>Her movements, her speech, her dreams, are filled with a desperate illusion that doesn't exactly make us feel sorry for her but does make us worry for her -- that she might, for instance, start screaming at any minute and never stop. A nerve-racking picture of a ruined soul.<br><br>Is it worth seeing? Absolutely. You won't learn too much about how Aileen Wournos turned into the person she did. Even the narrative itself is a little confusing at time, so that you can't be sure where Lee and Selby are at given moments. But it's Hollywood professionalism at one of its rare high points. It's made by a mature team for an audience of adults. Refreshing.","user":"rmax304823","rank":[112,129]}]