[{"title":"Surprisingly good","rating":10,"date":"25 June 2006","review":"I walked into the movie theater expecting to see Adam Sandler make a complete buffoon of himself. However, when I came out I was impressed. There was a depth to this movie I did not see coming, and it took me completely off guard. \"Click\" proved to be a powerful, emotional, and humorous piece of work. There was a certain philosophical message in this movie, in which I think, we all take for granted. Adam Sandler did a great job in playing a work-aholic. It is always great to see Christopher Walkin in any movie, and in \"Click\" he played the eccentric scientist who provides Adam Sandler with his life controlling remote.I Recommend this to anyone looking for a quality film with a good laugh. Definitely a 10/10 in my book.","user":"Lliao0211-1","rank":[483,658]},{"title":"Refreshing comedy gags meets heartfelt, reflective story to appreciate life's little details","rating":8,"date":"18 June 2006","review":"Going in to this movie I expected to have the normal 2 hour thoughtless escape from everyday life that these type movies normally deliver. Instead I laughed. I even cried. I left pleasantly surprised. Leaving the theatre I couldn't help reflect upon the need to really appreciate life's little moments and close friends and family more. Walken was outstanding. Sandler was effective and really funny in his toned down approach to this more intelligent comedy than the usual Sandler fare. Kate Beckinsale is very lovable as the wife and mother of his children and Hasslehoff couldn't have been more perfectly cast as the cluelessly self-absorbed exec/ boss. I liked it a lot and I'm not normally one to feel either way about these type of movies. I'd go see it next time with family and friends that I really should spend more time with anyway!","user":"nic-165","rank":[378,525]},{"title":"Surprisingly Fantastic...","rating":10,"date":"14 June 2006","review":"Being an Adam Sandler film I went into the preview expecting the same Adam Sander film which I do enjoy quite a lot, sometimes it's great to escape and not get too critical about the film you are viewing. I went in with this mentality to Click and I was surprised with how good this film really is. A lot of the time people that write comments will judge a film without seeing it and it gives the film a bad name. Ignore what you hear about this film and take a look, I'm sure you will be surprised with it also. Adam Sandler has shown that he is capable of playing a serious character in contrast o the aggressive and funny character he normally plays in his film, Click is no different, Sandler is both funny and serious at the right moments, Kate Bekinsale is great as Donna his wife, and Christopher Walken is excellent as always as Morty, the Bed, Bath and Beyond Employee. David Hasselhoff, Henry Winkler, and Jennifer Coolidge are funny in their supporting roles in this film. Australian audiences expecting to see Sophie Monk in a major role will be disappointed as she is honestly a very minor character in the film, in contrast to what the Comedy Chanel is running about her on Foxtel/Austar.<br><br>All in all I do recommend seeing this film, if not to learn a valuable lesson about priorities in life, but to have a laugh and to enjoy a film that is better than what was expected of it.","user":"uziallo","rank":[432,626]}]