[{"title":"Pretty Fun","rating":9,"date":"22 March 2005","review":"Despite a lot of complaints that non-Turks would not find this funny, I did. I have seen it twice now. I do quite enjoy it and find much of it funny, with some parts extremely funny. Granted, a few things were not especially original, or were pretty tired or crude without being humorous to me, but these were minor problems and films like this always have some jokes that don't appeal to everyone. I cannot say I don't like a movie simply because I personally don't like some of the jokes or gags. Overall, the film was quite well-done and most of the jokes or spoofs of culture and films worked quite well.<br><br>One fun thing is to see this sort of film made from a Turkish perspective, rather than American. It puts a new twist on some things, even jokes that we've seen before or which would have been in an American or other film.<br><br>In part, I am sure my enjoyment of the film is helped by the fact that, while hardly being fluent in Turkish, I do know some Turkish and am quite familiar with the country. Therefore, while there are a number of very Turkey-specific jokes, I was able to enjoy at least some of them. I would therefore agree that a decent understanding of at least Turkish culture and recent history, if not the language, will enhance one's enjoyment of the film.<br><br>Other humour in the film seems pretty universal. As a result, there are quite a lot of jokes and spoofs that I know many Americans and Western Europeans would get. Again, while some are tired or crude, many are really quite funny and pulled off quite well.<br><br>I think that my biggest complaint is that some themes were not taken far enough. For example, more could have been done with the carpet salesman thing since that part was really quite funny and had more potential than the film exploited.<br><br>In the end, this is a pretty well-made, funny, and entertaining film. It could have been better, but it works well and should provide quite a few laughs, especially if one knows much about Turkey. It's rather silly, but that is pretty much the point, and the silliness here is mostly quite entertaining.<br><br>Although not really relevant for my discussion, I shall add that this film is also a milestone for Turkish cinema in terms of the special effects and production values for a film of this sort. I think it's important to recognize this, even though I was primarily concerned with giving my opinion of the film's content, etc. Thus, while one may be able to criticize some visuals compared to some big-budget Hollywood films, the production values/special effects are pretty good, especially considering the context.","user":"Wulfstan10","rank":[137,150]},{"title":"A fantastic Turkish Space Movie","rating":10,"date":"23 November 2004","review":"A fantastic Turkish Space Movie !!!<br><br>Maybe my background has a big role that I find this movie the best movie at last time. <br><br>We are overrun all time with the US films and film industry.<br><br>There are only the best US films, US film makers and the view of US to all idea's. Forget it! <br><br>G.O.R.A. is a proof that the other people can make a good film, with a good view of the another angle.<br><br>I thank the maker and the actors/actresses of the film very much that they have given a good gift with this film.","user":"djef_lat","rank":[153,184]},{"title":"Turks in space","rating":7,"date":"19 May 2005","review":"Well, first of all, this movie is a good project. There is no science-fiction film in the history of Turkish cinema, and if you think about the budget, which was about 4 Mio. USD and nevertheless huge for Turkish proportions, George Lucas wasted a budget of 125 Mio USD for Star Wars Episode III, then it is the optimum of what has been created.<br><br>The story is no revolution, but no one ever expected that. Cem Yilmaz realised his vision of \"Turks in space\" and made his work well. His love for details is average.<br><br>To understand everything in that film, first you gotta be Turkish, since a big part of the humor is based on the street language that Cem Yilmaz is using perfectly. The second thing is, you have to know some US Science-Fiction movies like Star Wars, Matrix or Star Trek. Only the combination of these two requirements makes the movie really funny.<br><br>G.O.R.A is unusual to the Turkish public, so this is why some people didn't like it I think. I consider this work as new era of special fx in Turkish movies.<br><br>In the end, it is a solid Turkish space movie.","user":"rawkidd","rank":[62,80]}]