[{"title":"Two strangers mysteriously wake up to find themselves in a derelict basement. Together, they find out how to escape, and if they are really strangers...","rating":9,"date":"9 November 2005","review":"I have utmost respect for Wan. To my knowledge, he and his buddies were right out of film school. Instead of slowly building status by making mediocre films, he showed the world right from the get-go that he had something to prove.<br><br>Along with Silence Of The Lambs, Saw is the only horror movie that truly chills me. You see, I am not easily frightened by gratuitous bloodshed and screams that you might see in films like The Texas Chainsaw Massacre. The plot has to be coherent, and there can't be anything ridiculous like a monster. Saw evokes strong emotions of terror and fear, all the while remaining plausible. Well, the story is actually unlikely, but everything in the film is physically possible.<br><br>The scenes that are meant to be frightening don't require things that jump out at you every two seconds, or cheesy orchestral flailings. The situation is what frightens you, not the presentation. Saw does have some second-rate acting, but then again it is a low-budget film and I suppose they couldn't exactly afford Robert De Niro. The script is not fantastic, but one true redeeming quality of the whole film is the story. It is dense, complex, but so captivating. I can only think of a few mystery plot lines that can even compare to this one. The Usual Suspects is probably up there, but Saw stands alone.<br><br>I strongly recommend this film who appreciate good stories, and aren't easily scared by the garbage you see in theaters like House Of Wax. For people who get squeamish, steer clear of this film. It is very nice graphic, and very sadistic at times. A brilliant debut, and a terrifying ride. 9/10.","user":"ocelot-05","rank":[135,169]},{"title":"The best thriller in years","rating":7,"date":"6 March 2005","review":"Since \"Nattevagten\" I have not seen a thriller that has kept me on the edge of my seat as well as \"Saw\". Right from the beginning this original story sucks you in and doesn't let you go until the very end. Thrillers as gripping as this one have become extremely rare in times like these, where people have seen almost everything and can guess any twist during the first half of the movie. With \"Saw\" James Wan and Leigh Whannell, the creative heads behind this project, set new standards. Think you're hard-boiled? Think again and watch \"Saw\", a movie that will creep you out and surprise you beyond your expectations.<br><br>\"Saw\" has been advertised as the new \"Se7en\" and while both movies are definitely in the same tradition, \"Saw\" does a much better job at actually being creepy. Jigsaw is the most gruesome killer the cinema has seen in a loooong time. Wan and Whannel really came up with a monster that has no peer. Where many movies drift into ridiculousness trying to establish the villain as an almost superhuman evil being, \"Saw\" does never get anywhere near that trap. Sure, the cops are depicted way too stupid and the killer is unrealistically smart, outshining each and every opponent with his perfect plans, but hey, \"Se7en\" and \"Silence Of The Lambs\" didn't care too much about realism, either, did they?<br><br>\"Saw\" does have some flaws. Those sped-up tracking shots have just been used too many times by now, the structure of the script is weird and jumps from one period of time to another, some characters' lines are a bit clichéd. However, considering that this movie was made in only 18 days by two independent filmmakers with literally no budget at all, it's really inappropriate to be petty about technical subtleties, when Wan and Whannel came up with such an original and stirring movie.<br><br>I can't remember the last time I've been surprised by a movie's final twist, but \"Saw\" has an ending that I didn't see coming at all. This thriller is the most original piece of independent film-making since \"Cube\". I'm really looking forward to seeing how Wan and Whannell's career develops after this fine sleeper.","user":"Superunknovvn","rank":[179,239]},{"title":"The game begins","rating":9,"date":"3 November 2008","review":"Not since Se7en's John Doe has there been a serial killer with such a bizarre philosophy behind his actions (not that Jigsaw actually kills anyone; more on that later). Sure, in light of the increasingly deteriorating sequels it's hard to think of Saw as little more than a franchise- starter (something the writer and director never planned), but viewed on its own, astonishing merits, it's a good, nasty thriller, filled with solid scares and (especially compared to the follow-ups) quite well written.<br><br>According to the film's notorious back-story, it took only 28 days to shoot it. Not that strange, given most of the action takes place in just two locations: one is a bathroom where Adam (Leigh Whannell) and Dr. Lawrence Gordon (Cary Elwes) fins themselves with their feet chained to the wall, with no recollection whatsoever of how the hell they got there; the other is the lair of the mysterious Jigsaw, a serial killer whom Detectives Sing (Ken Leung) and Trapp (Danny Glover) have been tracking down for weeks.<br><br>The two facts are linked in a most ingenious way: Jigsaw doesn't really kill anyone, but \"plays a game\" with his victims. In the case of Adam and Dr. Gordon, as the tape recorder found in a dead man's hand tells them, each of them has two hours to free himself and kill the other, or they will both die. Problem is, the only way to get rid of the chains is to saw your foot off. And so, while the two unfortunate cell-mates have to choose who gets to live (that's Jigsaw's perverse logic: he offers you a choice), the police close in on the elusive psycho, whose previous deeds and MO are shown in flashbacks.<br><br>Whereas the subsequent Saw films use the messy chronology just for the hell of it (though they do get away with some neat narrative tweaks thanks to it), the first installment takes advantage of its non-linear storytelling to increase the suspense and provide some valuable clues to how everything fits together. It is to James Wan and co-writer Whannell's eternal credit that they, like Se7en writer Andrew Kevin Walker, went beyond slasher clichés and came up with something more. Okay, so Saw's philosophical undertones aren't entirely original, but what the heck, they do manage to keep the audience interested in what's going on. In addition, adding a little more depth to the killer ensures that the movie's more gruesome parts (and there are a lot of them) don't come off as gratuitous bloodletting (for an example of the latter, look no further than the countless sequels to A Nightmare on Elm Street or Friday 13th).<br><br>Furthermore, the intelligence behind the film's structure might also have had a positive effect on the performances, given the acting is more convincing here than in most post-2000 shockers: Elwes and Whannell's desperation is conveyed with an intensity that's almost too painful to behold, Glover plays the aging cop role resisting the temptation to do a Lethal Weapon in-joke (you know, the \"too old for this sh*t\" gag) and when Jigsaw himself appears... well, it's the horror equivalent of Keyser Soze - chilling and impossible to forget (and, for once, not played by Kevin Spacey). Just like the movie.","user":"MaxBorg89","rank":[62,79]}]