[{"title":"Cute and Corny","rating":8,"date":"2 October 2006","review":"It took me a long time to see this movie, but I finally did when my sister got it as a gift. Although the movie had its incredibly corny moments, and the plot was obviously written to entertain a preteen audience, I did find the movie enjoyable. There will be times during this movie when you will just have to laugh, and there will be times that you nod as you remember similar antics of your own. The characters are lovable and realistic, even if some of the messes they get into may not be. Granted, there will also be times when you just have to roll your eyes at the cheesiness. Overall, I found the movie very cute and very entertaining;just don't send your boys to watch it.","user":"littleknight27","rank":[11,11]},{"title":"good!!!!!!!!!!!!!!!!!!!!!!","rating":5,"date":"6 August 2006","review":"this movie is very cool and funny in way but not to enjoyable not the best movie i had ever seen but is cool. All the actors were very good especially Alexa Vega And Kallie as Yancy the typical loser type girl who managed to find friends at a sleepover. The story is about a group of friends who join in at a scavenger hunt against popular Queens. They get things wrong at first but they make way Alexa Vega gets to dance with her prince in the end at the dance. This movie is ideal for teen girls who live in a fantasy.i also love to watch the prince and me and comedies so try the prince and me it is a bit soppy but if you like other things watch like this movie i like stuck in the suburbs i love it!","user":"wendy_williams39","rank":[5,5]},{"title":"Oh My God...","rating":1,"date":"26 April 2006","review":"I was recently sick with the flu and unable to move from the bed and because the movie channel repeats movies a certain amount of times in a twenty four hour period I ended up watching this movie 3 times.<br><br>It was the worst day of my entire life. If you wanted you could fashion a drinking game out of this movie - take a shot for every teen cliché they try to throw in (it comes to about 1 a minute)There were times when i had to literally squeeze my eyes shut to block out the all the stupidness.<br><br>Julie Corky is a fourteen year old girl who is 'blossoming' who complains about how awful her life and parents are because they wont give her a lock for her door, but they will provide her with a big ass house and trips to Hawaii - they're monsters i know. She decides to have a sleepover inviting 3 friends over, the redhead, the blonde and the fat chick thrown in to somehow give confidence to all the other fat chicks out there that they can get guys too, albeit chubby ugly guys while the skinny girls get the male models.<br><br>The next minute the popular girl (who wont hook up with her high school aged boyfriend - i thought the whole point to having a boyfriend was so you could hook up with him but whatever) is organising a scavenger hunt and as you can imagine, hijinks ensue. <br><br>Well the acting was completely awful, mika boreem who usually does so well is so completely wooden in this movie, Alexa Vega is only mildly attractive and unbelievable in the role of Julie Corky, the underage girl who manages to get the hottest senior in high school (and maybe the world) to like her after skateboarding past him in an unflattering semi squat position. The three skater dudes who so obviously have no idea what acting is, every time they are on screen you experience physical pain at having to watch them try to be funny.<br><br>After the scavenger hunt they all end up at the high school dance where Julie tries to inspire the girl taking the tickets to let her in by utterly insulting her - let me paraphrase \"I know you, you're the loser who has to sit at the dumpster and no one talks to you cos you're so plain and you're the ticket taker at the dance because no one in their right mind would ever consider being with you. ever and if you don't help me i could end up just. like. you\"<br><br>However this film had only one true intentionally funny part, when the jerk-for-even-thinking-of-kissing-his-girlfriend high school boyfriend and his new girlfriend are trying to win the dance contest, their slow jerky dance movements were the only bright spot in an otherwise idiotic film.<br><br>So potential viewers, stay away for the love of god stay away.","user":"I_can_get_you_a_toe","rank":[57,94]}]