[{"title":"a touch of reality makes this better than expected","rating":7,"date":"7 September 2002","review":"The best we should reasonably expect from a movie like `Blue Crush' is that we will be treated to some stunning footage of surfers riding the world's greatest waves (along Hawaii's Pipeline, natch) to personal fame and glory. We certainly get that in abundance - but what we have less right to expect, perhaps, is that the film will offer anything else of any real quality. After all, we've been to these kinds of movies before, harking all the way back to those halcyon Bleach Blanket Bingo days when Gidget, Moondoggie and the rest of those addle-brained, teeny-bopper cut-ups aspired to nothing higher than a life of eternal youth spent wallowing in the bleach-white sands of Santa Monica or Malibu.  In the case of `Blue Crush,' therefore, I am happy to report that the screenplay - by Lizzy Weiss (based on a magazine article by Susan Orlean) -provides just enough touches of realism to keep this new film both life-sized and interesting.  And the majority of the credit goes to the film's protagonist, Anne Marie Chadwick who, much to our surprise, engages our sympathies from first moment to last. <br><br>\nAnne Marie is no bubble-headed, bleached-blond bimbo with nothing on her mind but winning the big Pipeline competition.  Although that is, indeed, part of her life's plan, Anne Marie is, also, an intelligent, pragmatic young woman, fully aware of both her strengths and weaknesses and just trying the best she knows how to make her life work for her, the young sister in her charge and the two surf buddy girlfriends she lives and works with.  Anne Marie is also riddled with insecurities, as she struggles to overcome the fear instilled in her by a near-fatal accident in that very same spot a few years earlier.  Meanwhile, she and her pals work hard trying to eke out a living as maids at a posh hotel, earning just enough money to keep a roof over their heads and pay some of their bills so they will be free to head to the coast at the first sign of prime `Surf's Up' conditions.<br><br>\nThe acting in the film is really quite impressive.  As Anne Marie, Kate Bosworth lights up the screen with her subtly nuanced, poised and dignified performance.   She knows how to use understated facial expressions to convey the thoughts and feelings of the character she is portraying.   Equally compelling are Michelle Rodriguez and Sanoe Lake as her fun-loving buddies, Mika Boorem as her little sister, and Matthew Davis as the professional football quarterback who becomes her love interest.  Director John Stockwell, to his credit, manages to keep the majority of the scenes intimate in tone and realistic in nature, rarely allowing the narrative to wander into overwrought melodrama or teen-movie farce.  Even the obligatory fight scene is kept restrained and believable.<br><br>There are occasional weaknesses in the film  a gaggle of snooty football wives and groupies who snub Anne Marie for being too lower class for their tastes are the primary offenders  but, on the whole, `Blue Crush' turns out to be a much better film than its subject matter would ever lead us to expect.  That comes as a particularly pleasant and un-looked-for surprise here in the shank of the summer movie going season.","user":"Buddy-51","rank":[58,64]},{"title":"A \"must have\" DVD if you also have a surround sound system with subwoofer.","rating":21,"date":"21 April 2003","review":"Critic Ebert has a very complete and accurate review, and I will not repeat any of it here. I bought \"Blue Crush\" as a used rental DVD, real cheap, and it is a perfect disk. The basic story has been told many times, but it is done here better than many. However, there is one thing that moves it from the \"ordinary\" to \"outstanding - the cimematography and the sound.<br><br>After most of the first hour of the film sets up the characters and the situations, we are treated to surfing the Hawaii \"pipeline\" by surfers. One DVD extra shows how they do \"face replacement\" so that the pro surfer appears to be star Kate Bosworth. With many cameras in the waves, and sometimes under them, we get a unique perspective of being on top of a giant wave, or being inside the wave as it is breaking.  All the while a very aggressive sound mix makes you feel like you are there also.  This is definitely a good DVD to have for demonstrating the quality of your digital 5.1 surround sound system with good powered subwoofer.<br><br>I suspect anyone who saw \"Blue Crush\" at home, on VHS or DVD, with sound fed into the TV speakers has seen a different movie. That's because the sound track plays such a key role. This isn't a great movie, but a very good one. I believe its most realistic IMDb rating is somewhere around \"7\" or \"8\".","user":"TxMike","rank":[34,43]},{"title":"Lighten up, this film rocks","rating":27,"date":"27 January 2005","review":"For all you wanna-be critics out there trying to be negative about the directing and cinematography, lighten up! This film is excellent in the fact that it does not try to be more than it is... a surf flick. Its obviously not trying to win an Oscar or a bafta. cant any of you simply enjoy a feel good movie? the filming of the waves and the surfing was top class and even though the acting was not Oscar worthy in any way shape or form i think it was impressive that they embraced the surfing culture and used local people in this film.<br><br>For all of you out there who like to just enjoy a films and don't feel that you need to be completely baffled, shocked or made to think you will enjoy this. Yes it is predictable but who cares its just a bit of fun.<br><br>For all of you who hated this film just because the plot was predictable and the acting was substandard i draw your attention to a gentleman named Sigmund Frued; \"Some times a cigar is just a cigar\"","user":"Mrs_Greenleaf","rank":[39,52]}]