[{"title":"Better than expected","rating":6,"date":"17 August 2004","review":"Dario Argento's new thriller about a serial killer who forces the police to play video poker against him in order to save the lives of women he has kidnapped doesn't rank with the director's best work, but it is fast paced and entertaining if you aren't expecting too much.<br><br>After the disastrous Phanton of the Opera Argento made Sleepless, which was a self-conscious attempt to duplicate the success of his 1970's giallos, down to giving long defunct group Goblin credit for the soundtrack. Sleepless was certainly watchable, but it felt more like an Argento rip-off by an inferior director rather than the real thing, like the master had somehow turned into Antonio Bido or Luigi Cosi.<br><br>This time around Argento makes a movie that is less obviously grounded in his own previous success--The Card Player is far more generic than Sleepless, but since Argento isn't trying so hard to recapture past magic the film tends to work much better.<br><br>Unfortunately plotting and characterization have always been his achilles heel.  Classic Argento films are about set-pieces and style, not plot. Stendhal Syndrome suffered because it turned into a character driven psychological thriller, which didn't play to his strengths as a filmmaker. The Card Player is largely plot-driven, lacking the stylistic flourishes and memorable set-pieces that defined his classic films and also offset his weaknesses as a writer.  The Card Player generally feels like a made for TV crime thriller or even a pilot for a potential television show.<br><br>But while The Card Player isn't great or even mildly believable it is pretty fun on a cheesy B movie level, and the finale involving a handcuff key, a racing train and a lap-top manages to capture the delirious goofiness that came easily to the director back when he made Phenomena and Deep Red.  It's not hard to imagine Argento giggling when he came up with his climactic scene and the sense of fun is infectious.<br><br>Most fans have probably accepted by now that Dario Argento isn't the filmmaker he was twenty years ago and that he will likely never make another classic thriller, but The Card Player is at least good enough not to disappoint, given the lowered expectations that now inevitably greet one of his movies.  For me this was easily his best since Trauma.  It also offers reason for optimism:  Sleepless was a huge improvement over Phantom of the Opera and The Card Player is better than Sleepless, giving fans a reason to look forward to his next film.","user":"jhs39","rank":[28,34]},{"title":"Not as bad as people say","rating":7,"date":"22 January 2004","review":"After getting almost unanimously negative reviews, I was dreading watching IL CARTAIO. It turns out that the film is not bad at all. No, it's not another SUSPIRIA, but nor is it a PHANTOM OF THE OPERA, thankfully. People keep going on about the absence of Argento's trademark style. Well, I want to know what style that would be? Suspiria's? Phenomena's? The Stendhal Syndrome's? I think you get my point. Argento doesn't have one single style -- he had many, and I think that Il Cartaio's style is different rather than absent. I personally liked the camerawork and the cold look of the film. The use of shadow is really good, and I think this has got to be the only film Argento has done that is obviously set in the winter. It gave everything an eery look.<br><br>It's a tightly constructed little thriller with a lot of very tense set-piece scenes. The lack of gore confused me a bit, but everyone seems to forget the impalement of a certain character. That, to me, was pretty gory although admittedly not flamboyant. In many ways it seems a lot like the antithesis of Non Ho Sonno, which was extremely over the top in terms of violence.<br><br>I think Tenebre was the last film Argento did that received almost unanimous critical acclaim on its initial release. All of his other triumphs since then have grown on people over the years. I don't think Il Cartaio will be any different.","user":"whiggles","rank":[26,34]},{"title":"A different Argento, to be sure, but that's not bad Argento!","rating":6,"date":"2 April 2004","review":"I have read the reviews complaining about that Dario has abandoned his style and all the gore to produce a tame TV-thriller. Far from the truth, according to me! I really think that this is the best he has done since \"Opera\". Granted, his stylish touch might seem to be muted compared to the baroque thriller of the 70s and 80s, but this cold and bleak atmosphere that he conjures up this time along with very brightly lit camera-work for most of the scenes, is something I enjoyed throughout! Sure, the gore is almost totally absent (apart from one scene), but as a whole this picture is much more efficiently done. The pace is fluent and unlike most of his other movies, there is actually no point where the characters just stand around and talk (and sometimes his players have been involved in some truly atrocious conversation) to fill out the time.<br><br>*MINOR SPOILER* And in \"Il cartaio\" the three main actors are actually very good! They are people you can care about and when they are in danger or die, you feel sorry for them. *END OF SPOILER* Like I mentioned before, I enjoyed the bleak look of the movie...as always classy camera-work in every frame of an Argento picture! And Claudio Simonetti's score is his best in years even though you might be just a little bit tired of it by the time the movie reaches it's conclusion. And talking about the finale, I found it both interesting, but at the same time also maybe a little bit of a letdown. However, the endings have been a bit weak lately in Dario's films. Not since \"Tenebrae\" has there been a really powerful conclusion. And two minor complaints finally...it was too easy to guess who the killer was. This has been mentioned before and I think it is true. The killer's identity could have been better camouflaged without a \"certain scene\" (you will know which one). And the card scenes went on too long on two occasions. The constant screaming from the victims became annoying in these scenes and I almost wanted them to die just to make them shut up! Otherwise, his best work in years and a film where he is not just content with repeating an old formula (like in \"Sleepless\" which I liked anyhow), but is actually trying to find a whole new path in his art.","user":"jangu","rank":[15,20]}]