[{"title":"Charming and fun","rating":9,"date":"24 December 2004","review":"Shortly after Dreamworks screwed up with the uninspired \"Shark Tale\", Pixar contains its remarkably success story with \"The Incredibles\". And while I have to say that I liked \"Finding Nemo\" a bit better, \"The Incredibles\" is still an amazing movie.<br><br>First of all, this is because it's funny. It's not so funny that you're constantly laughing out loud, but there are more than enough good jokes in the movie to keep you entertained, and it's full of good observations about superhero movies (note all the ridiculous superhero and villain names) and references to other movies. It's also a brilliant James Bond spoof/homage, containing all the gadgets, secret island bases and crazy schemes that made early Bond movies so much fun.<br><br>Secondly, this movie has heart and charm in droves. It's full of memorably and likable characters you can really identify with and care about. Characters like Edna are instant classics. The voice acting is universally excellent, but Holly Hunter steals the show as Elastigirl. This is a movie that doesn't need toilet humor, characters modeled like celebrities, or a \"hip\" soundtrack...it easily succeeds on charm and style alone.<br><br>Also, I found it to be a surprisingly good action movie. The plentiful action sequences are full of energy, extremely fast-paced, and exciting, and put many a live-action movie to shame.<br><br>Finally, I also liked the tone and message of the movie. \"The Incredibles\" basically makes a plea against mediocrity, breaking with the politically correct idea that \"everybody is special\" (and thus nobody really is), and encouraging people to use the talents they have been given. I think this couldn't be more true. Not all people are equally talented (just compare Pixar to Dreamworks), but this is no reason to keep the talented people from not reaching their full potential just because it makes the less talented ones feel bad.<br><br>\"The Incredibles\", while maybe not as hilarious as I had hoped (though it's still very funny), is nonetheless an extremely entertaining movie, that manages to charm you wit its combination of great characters, lots of style, tongue-in-cheek attitude and good message. Highly recommended.<br><br>****1/2 of ***** stars","user":"basrutten","rank":[269,320]},{"title":"Wonderful, beautiful to watch, all in all, incredible.","rating":10,"date":"21 November 2004","review":"WOW! What a movie. I can honestly say this is in my top ten movies of all time, how do Pixar continue to out do themselves at every movie release?<br><br>The Incredibles is a fantastic story, wonderfully scripted and with the most stunning animation you have ever seen, it provides a perfectly rounded story with plenty of action, laughs and (almost) tears.<br><br>Basically, this is a story of a man encountering a mid life crisis and leaping headlong into it without a care or a thought for his family, proving exceedingly selfish and failing to see the good in his life. Meanwhile the wife is left to try and look after the family. Really, that's the story. Now, what Pixar have done is drop in the idea that the parents are Superheroes, banned from being Super many years previously by the Government and the people, trying to live a normal life. Add to the mix that some of their children have inherited their own powers and that the Super villains are planning a comeback, and you have this wonderful movie.<br><br>I can't begin to convey how wonderful the animation is, it's perfect. I mean you'll always be looking at it knowing it's animation, but when the story takes you along you'll suddenly realize you're still watching animation. The subtle difference is that you forget, and there are parts (for instance when the father is cheering his son during the race) that you actually think it is real. The effects for water, fire (two of the hardest things to recreate in animation) and lava are wonderful to watch and caught me drawing a breath when I first saw them.<br><br>The characters and acting are wonderful, and you will find yourself caring about them as real people. At some points I could feel a big swallow coming up and a wavering adams apple, obviously due to the food earlier, nothing to do with the movie.<br><br>I often find that movies aren't paced well, that they either have too long or too short an introduction to the characters, or the events that lead up to the pivotal point of the movie are unbalanced against the climax, all sorts of combinations. Not here, this move is perfect and well balanced, the story takes you along just when you are ready, and there were no points where I wished we could move on, or something could happen quicker. My only frustration were at the kids, and this was only because they were behaving exactly as real kids would.<br><br>It was interesting to see the comparisons and links to other famous Superheroes through comic-lore. Definitely with nods to The Fantastic Four, Silver Surfer and huge nods to The Watchmen. My only concern is that there is so much similarity to The Watchmen that those who haven't read the graphic novel will be saying \"That's the Incredibles movie\" when Watchmen finally comes to fruition.<br><br>The short film showing before this was wonderful in itself, and had the audience laughing out loud loads. Excellent, and once again, outdoes every short that they've produced before. Boundin' was beautifully animated and wonderfully told. Guaranteed to bring a huge big smile to your face.<br><br>All in all I think this movie is perfect and truly incredible.","user":"Rich B","rank":[359,450]},{"title":"My favorite film from Pixar in over five years- Bird and company produce a triumph of a family film","rating":10,"date":"5 November 2004","review":"Writer-director Brad Bird here has something that I was caught off-guard by just a bit. I always expect Pixar films to be above-par, family entertainment, the kinds of films that can have an appeal to adults on a satirical, jab-in-the-side effect by having the characters reacting to each other as they would on a film with a higher rating, whilst giving the bright colors, action, and silliness that appeals to kids. Watching The Incredibles, their sixth feature-length offering, I wasn't so entertained and amused since their 98 film A Bug's Life, and it almost brought me back to the emotional impact I felt when in the theater for the first time getting Toy Story into my system. <br><br>It's a film that takes on a type in society that we all know well (in the past they've done toys, bugs, monsters, undersea life, and now comic book archetypes) and transforms it superbly to the imaginative computer-animated landscape. This is also in credit due to Brad Bird, who proved five years ago with his sleeper The Iron Giant that he could transcend the genre and appeal with heart and vigor for almost every age bracket.<br><br>So what little touches make The Incredibles so appealing? How it starts to deconstruct the idea of a superhero, perhaps, as well as how the family unit is shown in the usual conventions under unusual and funny circumstances. As an example, one of our heroes Mr. Incredible, a.k.a. Bob Parr (voiced wonderfully by Craig T. Nelson), goes to visit a woman who fixes and creates the uniforms of superheroes. In one scene she explains why a cape is not a good idea. This is the kind of scene that might not make it into most Hollywood movies, and would sometimes if not often be discredited as being too 'smart' for kids to get. But by appealing to a kind of level late teens and adults can relate to, it reaches a higher, far more intelligent plane. In fact, many of the best scenes in the film take on what we all know in films displaying the 'family unit' and morph it with the power and imagination of superheroes.<br><br>I won't go too much into the plot as some may already have, except to say that what makes the story in and of itself appealing is how it is a fully formed story, and doesn't try and sell itself short like other animated films (i.e. Sharktale for example). It also uses it's PG-rating perimeter wisely, and Bird and company create action sequences that are as exciting, if not more so, than in the action films that have been released this year (in fact, some of the scenes in the climax, for my money, could rival a couple of those in Spider-Man 2). By setting up the right emotional bases with the characters- Bob, his wife Elasti-girl (Holly Hunter), their kids, and with supporting characters voiced finitely by the likes of Samuel L. Jackson and Jason Lee, by the time the high-charged, internally fantasy scenes take off, they take off with great conviction and excitement.<br><br>Overall, The Incredibles is a film that is, in a way, what audiences wish they could get and rarely do- it's a film with wit and observance, a kind of video-game where the results are not as expectable as can be. Some kids may not get it as much as adults might, which is just as well, as it sometimes operates on a level like Antz did, only through the sphere of Disney. In other words, if you say the teaser trailer, which involved the out-of-shape Mr. Incredible trying with all his might to buckle his tights, you'll know what the film could bring. Personally, I can't wait to see it again.","user":"Quinoa1984","rank":[249,311]}]