[{"title":"Definitely one of the best animated films I've seen...a guy's review","rating":10,"date":"21 August 2012","review":"Let me start by saying that I'm an 18 year old male, and was kinda dragged into watching this by my girlfriend, who is a big fan of the Disney princess movies. I finally gave in the other day, and I've very glad that I did. <br><br>The movie looked gorgeous, the animation was spot on; all while holding on to the classic Disney feel. <br><br>The main characters are extremely likable. Repunzel is your typical Disney princess style character: sweet, funny, etc. Eugene, aka Flynn Rider, kinda stole the show for me, but maybe that's because I'm slightly gender biased. Nonetheless, you can't deny his wit and humor. Maximus the horse fills the role of animal sidekick perfectly; just as good as Donkey was to Shrek even though he doesn't talk. <br><br>While the plot is relatively predictable, it was still quite an enjoyable movie. I didn't find myself to be bored at only of the parts, and I was laughing a lot more than I had expected to. This movie is an instant classic, and a near perfect example of what animated fairy tales should be like if they want to appeal to a wide range of viewers, not just tween girls. The ending was sweet and should leave everybody happy. <br><br>I think there's enough fun in this movie for all ages, including an 18 year old guy like me.","user":"dylanhook","rank":[82,87]},{"title":"Tangled","rating":10,"date":"15 February 2020","review":"A wonderful movie! I had forgotten all about Tangled, and am so glad I got to see it on the big screen. A great story with fun characters and beautiful animation that still looks new.","user":"MR_Heraclius","rank":[38,39]},{"title":"Couldn't Have Been Better","rating":9,"date":"5 January 2011","review":"I will start off by simply saying that this movie is excellent. No, the word excellent doesn't even describe this movie well enough, because it is better than excellent. I could not take my eyes away movie for the hour and a half of the film. Even if the movie was seven hours long my eyes would still be glued to the screen for the whole time. Along with Up, this has to be the best animated movie ever made.<br><br>The animation was outstanding, and I was amazed at all of the little details in all of the characters, objects, and backgrounds in every frame of every scene. The film is full of breathtaking and amazing images. The scene with all of the floating lanterns was one of the most beautiful things I have seen in a movie. Nothing could have been done to improve the amazing visuals and animation used.<br><br>Before first seeing the movie, I hadn't realized that it was a musical, so that was a pleasant surprise for me. I have heard people say that the movie was great while the music was only average or not that good. I, on the other hand, thought that the music was wonderful and fit perfectly with what was happening, whether it be the action and fighting scenes or the calmer scenes like the lantern scene.<br><br>Also, this movie actually made me laugh, and I don't laugh much during most animated movies. Personally, I thought that the dialogue was great and all of the characters worked well together. I especially loved the relationship with Rapunzel and Flynn, because it could be comical at one point and then touching at the next. And not only was the dialogue be used for comedy, but it also was used to create beautiful and touching scenes. Even thinking about the line were Flynn told Rapunzel she was his new dream and when she told him that he was hers gives me chills.<br><br>I really hope that this movie gets an Oscar. True, Toy Story 3 and How to Train Your Dragon were both outstanding movies, but I think Tangled is the most deserving in the animated film category. Every aspect of the film was perfect. The animation, the story, and the score all were excellent and when combined they made a movie that couldn't have been better.<br><br>Congratulations Disney, you've got me tangled. I wish I could see it again, but unfortunately I think I'll just have to wait until it comes out onto DVD. I hope to see more movies like this in the future.<br><br>Oh, and by the way, I'm a guy. A teenage guy. So really this movie should appeal to all audiences. If you love a good movie that is charming, funny, beautiful, and touching, then go see the movie Tangled. You won't be disappointed.","user":"SGuy157","rank":[43,45]}]