[{"title":"I cant believe some of the comments...","rating":10,"date":"24 September 2004","review":"I think this movie was great. It has hilarious humour and its almost an unique growth story of a man that has grown tired of his miserable life and finds something worth fighting for.<br><br>The thing that bothers me is that some people criticize the film cause it has too bad language. In my opinion the used language is important part of the film. I wouldn't find the characters very \"authentic\" if they wouldn't use the kind of language they do. <br><br>Maybe its part of modern trend. People are shocked if somebody swears or shows a breast in TV and after that they go see some idiotic TV series or action movie where they kill 1000 people and not even blink.<br><br>Is the message \"violence is OK, but sex/nudity and swearing is not\" somehow logical? I think in the real life its quite the opposite.","user":"mazingol","rank":[369,481]},{"title":"Crude,Rude and Surprisingly Touching","rating":8,"date":"8 January 2005","review":"I avoided this flic when it first came out due to the reviews which concentrated on the 'cynicism'and 'edgyness' of the effort. It is crude.It is rude.And is is filled with enough 4-letter words to be its own zone of bad taste. Know what else? Billy Bob Thorton is masterful as is the rest of the cast.There are no 'heroes',but Billy Bob is not exactly an anti-hero either.He portrays a broken,dysfunctional loser who holds nothing in contempt so much as himself.Desiring nothing so much as extinction,he rambles through life hating EVERYTHING. But it's Christmas,and even for losers third,fourth,fifth,or 50th chances sometimes show up.Watching Billy Bob's character 'grow-up'during the film is surprisingly heartwarming.For a broken man,he does the best he can once he allows himself to 'give-a-damm'. See this for his performance(and the rest of the cast),and be surprised.","user":"trickydicky","rank":[114,149]},{"title":"The perfect Christmas antidote","rating":10,"date":"23 December 2004","review":"Hilarious from start to finish, this movie covers the story of an alcoholic safe cracker who works as a shopping mall Santa to steal money from the mall on Christmas eve. The concept of the movie is simple and the script is razor sharp with well drawn characters enhanced by faultless performances throughout. As with all good comedies, the material is inspired but it's the delivery that makes it unforgettable. Thornton proves that when it comes to Dead-pan comedy, there's no one better! His performance alone would be enough to make this film good but the fact that his high standards are maintained by the rest of the cast elevates it to a classic.","user":"idiopath","rank":[159,213]}]