[{"title":"Classic Christmas spirit.","rating":7,"date":"3 October 2019","review":"This is the kind of Christmas movie you should be watching every 25th of December apart from your usuals. It's a wonderful story, with a strong Will Ferrell, playing an innocent, child-like, distracted elf who has no idea how the real world functions, as he is on the quest to search for his real family. He is willing to spread the Christmas spirit on a city which apparently hasn't got the spark in its eyes, so there is a hard task on his hands.<br><br>The rest of the cast is wonderfully completed by Zooey Deschanel, James Caan, Mary Steenburgen, Daniel Tay, with Peter Dinklage and Bob Newhart in small roles. Ferrell definitely steals the movie; and his troubled relationship with his father (Caan) provides some funny and touching moments as well. Jon Favreau did quite a good job from the director's chair, turning this seemingly childish film into a marvelous choice for your Christmas movies of every year. Some even regard it as a classic, but well, I will let you be the judge of that.","user":"patriciogl10","rank":[10,10]},{"title":"A really nice, funny movie for Christmas despite a little bit of the inevitable smaltz","rating":16,"date":"16 November 2003","review":"Accidentally finding his way into Santa's bad once Christmas Eve, little baby orphan Buddy ends up in the north pole, where he is raised by the elves as one of their own.  As he gets ever bigger and less and less suited to the elf lifestyle he is told about his real father and decides to go to New York to find him.  However Buddy's natural smile and elfish enthusiasm doesn't really fit in with New York, not to mention a father who rejects him.<br><br>When I first saw the trailer for this film I laughed slightly but I also thought that it could easily be just awful.  Despite this fear I decided to go and see it on the basis of seeing Ferrell in the Reloaded MTV spoof on the DVD and being very funny.  I was glad that I did as the film was refreshingly funny very enjoyable despite the weaknesses inherent in a seasonable film of this nature.  The jokes are a mix of adult and children - but not separately, the humour is of a nature families can all enjoy rather than being of a `one for me and one for the kids' type.<br><br>The film does get a little sweet towards the end, but it manages to avoid this usual trap for the majority of the film and can't be expected to not be all Christmas cheer at some point!  The fish out of water stuff is pretty funny and Farrell makes his character funny without being annoying to the audience (as he feared he might be from the trailer).  Caan is good but has to work with the `scrooge' character of the film and thus gets fewer laughs. The support cast is good with fun turns from Newhart, Asner and Steenburger.<br><br>It does get a little sickly sweet towards the end and the fish out of water jokes do wear a little thin towards the end but mostly it is very funny and refreshingly fun to watch.  The film is made better by a performance from Farrell that is perfectly pitched without being annoying and full of spark and wit.","user":"bob the moo","rank":[71,87]},{"title":"Unexpected out of nowhere against all odds classic","rating":9,"date":"8 January 2016","review":"This was my 4th viewing and now ready to review.<br><br>The story is insane. This film should not have worked. But almost as a tribute to the X-Mas miracles it tries to riff off, it is an astonishingly entertaining film.<br><br>Behind the camera Favreau, Mr Money Shot, who has quietly without fanfare turned into one of the hottest directors in Hollywood history. In front of the camera Farell who I usually don't care for but may just give the performance of his career here. A script to die for. Probably the best use of Zoey D's looks in her career to date.<br><br>Way under rated and unappreciated.<br><br>As in my other reviews, most \"recent\" X-Mas films (since about 2000) are Canadian B-movies shot on a budget which would barely cover a reno on THIS OLD HOUSE What an unexpected treat See it","user":"A_Different_Drummer","rank":[42,50]}]