[{"title":"Good Film, Great Performance","rating":10,"date":"20 April 2004","review":"Before you let the advertising fool you, understand that \"Willard\" isn't exactly your normal horror flick. I know that the marketing people tried to put all the scary bits into the trailer and such, but I urge you to reconsider your views on it.<br><br>The movie itself is more of an in-depth character study. It follows the events that lead one man into the pits of insanity, taking you along for the ride. Forget \"Psycho,\" (Which was an awesome film in its own right) though the movie does have Norman Bates/Hitchcock elements. We're taken from lonely, shy, and sad, to hollering, glaring, weeping, and finally, silent. Only one man was tailor-made for this role...and that man was Mr. Glover.<br><br>\nThrough every blink, every wide-eyed stare, the audience is drawn into the character. We believe in his connection with the rats, and marvel at his ability to train them. And when he gets even with Mr. Martin, we celebrate.<br><br>\nAnd I loved the undoubted sexual frustration that Willard is feeling. It's more apparent in one of the deleted scenes on the DVD. But the writer didn't succumb to this frustration; he let it build.<br><br>All of this combines to form one of the greatest character movies I have ever seen, and probably will ever see. I must say that this is one movie I will not soon forget...","user":"trying_to_act","rank":[38,42]},{"title":"Devilsihly dark remake is a fresh breath of air...","rating":7,"date":"11 September 2003","review":"Crispin Glover gives a splendidly dark and evil performance in \"Willard,\" a performance that creeps you out more than any idea of killer rats ever will. The movie feels like a Tim Burton Lite, and a few times throughout the film I came close to imagining how Tim Burton would have directed the film. He probably would have gotten Johnny Depp for Willard, though, and I'm not sure if Depp would have been able to pull it off as well as Glover, who has always been a very strange character, even back when he played the shy and quirky George McFly in \"Back to the Future.\"<br><br>If Crispin was odd in \"Back to the Future,\" then he's part of the Manson family here. It seems to be an almost tailor-made role, one fit just for him. His character, Willard, is a mix between Anthony Perkins' Norman Bates and Adam Sandler's Barry Anderson from \"Punch-Drunk Love.\" I half-expected to see Willard's mother jump out in front of the screen at some point in the film, only for \"her\" to be Willard. <br><br>Anyone familiar with the seventies should remember \"Willard,\" and perhaps even its sequel, \"Ben.\" I didn't know quite what to expect walking into \"Willard,\" as I had never seen the original. It is a very dark and creepy movie, perhaps not for everyone, but I enjoyed it. It's quirky. It's creepy. It's dark and brooding. And it has a sly sinister side to it. When Willard retreats to his basement every night to train a gang of rats to carry out his evil deeds it's not really scary but rather strange in execution. Given another director this could have been another summer horror flick like \"Jeepers Creepers 2,\" but it turned out to be a bit more than a scary movie - it's more of a freaky movie.<br><br>Willard (Glover) is a grown man who lives in a large, creepy home with his bitter old mother. He cares for her and goes to work to help support her, where he works for \"Mr. Martin,\" a gruff old guy who claims that the reason he drives a Mercedes is for the company's benefit. He relentlessly picks on Willard, who bites his tongue in return and counts to ten.<br><br>Extremely lonely, Willard retreats into his mother's basement one night to try to get rid of some rodent infestation. Once there, he finds that he has caught a smart little white rat in one of his traps, which he frees from the sticky paper and names Socrates (because the rat is smart). Soon he finds that Socrates can understand him, as do all the other rats. He also realizes that the rats will do whatever he wants, whether it be attacking Martin's Mercedes or eating Martin to death. And so he uses them at his psychopathic will; that is, except for a very large rat named Ben, who is about the size of a small dog. Ben is smart, and tries to win Willard's attention, but Willard ignores Ben (one can understand why), and pays all the attention to Socrates. Ben doesn't like this, and so he starts commanding the gang of rats against Willard. The film ends in a strange showdown between rats and man, to say the least. <br><br>I used to have a little white rat just like Socrates, which I named Socrates, and I used to have another big, black rat, which I named Ben. (Yes, I named them after the rats from the old film.) Rats are kind little creatures but you get the idea that they are a very smart species, always scheming. Watching the \"real\" Ben from \"Willard\" is funny, because as he sits there scheming it is in all truth very honest - rats are smarter than they seem.<br><br>Willard seems to have a psychic connection between the rats. It's like the story of the dog that followed his master all the way across the Atlantic ocean, running up to him in the middle of a WWII battlefield. Some experts say that animals have boundaries with their masters that they can somehow feel, relate to or are attached to psychically. By charming Socrates, it seems that Willard opened up a sort of psychic connection between the rats, and the way he carries them around on his shoulder, and says to Socrates, \"You are the only friend I've ever had,\" is strangely disturbing.<br><br>I wasn't sure what to expect going into \"Willard,\" and I'm still not sure if the film used up all the potential it had. They could have spent more time focusing on Willard's development into a psychopath, more time on what the rats did, more time showing the audience that Willard is the bad guy. It seems that they go wishy-washy - are we supposed to root for Willard or not? I don't really know, but I enjoyed the movie. It's not an incredible achievment in any regard, and I left feeling a little empty but I'm glad I saw it.<br><br>3.5/5 stars -<br><br>John Ulmer","user":"MovieAddict2016","rank":[25,27]},{"title":"A Weird Tale About Loneliness, Friendship, Greed and Revenge","rating":8,"date":"28 March 2004","review":"Willard Stiles (Crispin Glover) is a lonely and deranged man living in an old mansion with his sick mother Henrietta Stiles (Jackie Burroughs). His father committed suicide after losing his own company to his former partner and friend Frank Martin (R. Lee Ermey). Due to a clause in the selling contract, Willard can not be fired from his job while his mother is alive. However, Frank abuses of Willard,  humiliating and spending a horrible treatment with him in front of his colleagues. The basement of Willard's house is infested of rats and mice, and Willard capture a beautiful white mouse in a trap. Willard rescues the mouse, calls him Socrates and becomes his friend. Socrates is a leader and the other rats obey him, except the huge Ben. The animals are trained by Willard, who uses them for his revenge. This weird tale about loneliness, friendship, greed and revenge has the same style of most Tim Burton's movies. It is a black comedy very dark, quite gothic, having weird characters, but great performances and good effects. Although dealing with a nasty theme (rats and mice), it is not a disgusting film. It is not recommended for all audiences, but I liked it a lot. My vote is eight.<br><br>Title (Brazil): `A Vingança de Willard' (`The Revenge of Willard')","user":"claudio_carvalho","rank":[27,32]}]