[{"title":"Don't understand the bad reviews...","rating":8,"date":"15 February 2019","review":"I don't know if it's because I didn't watch the TV Show, but I really don't understand why those 2 movies are discredited this much. Yes it's not realistic (at all), the stories are very exaggerated, and not very perfectionists, but I don't watch those movies for realism, I watch them to spend a good time, to clear my head, because I love the actors, and everything is so light! It does not sell more than what it is, and for that I really enjoy watching the 2 movies whenever I am in a bad mood!","user":"clotildevernyidrac","rank":[41,51]},{"title":"Exhilarating! Just pure fun!","rating":9,"date":"14 July 2019","review":"I remember being very young, using an old mac computer, waited for the trailer and saw this with my family. I wasn't reviewing back then; I loved it a lot though. Some very epic action, stunts, gorgeous cast, great jokes and memorable moments just like the first one, just under par. This has a measly 4.9 I think it deserves at least a 9.2 maybe I am just weird! I love the cast: Drew Barrymore, Cameron Diaz, Lucy Liu, Demi Moore, Justin Theroux, the late great Bernie Mac R.I.P., Shia Labeouf, and Robert Patrick. All around blast always fun to watch!","user":"UniqueParticle","rank":[12,14]},{"title":"Quite fun but the total lack of substance is a real problem","rating":6,"date":"6 July 2003","review":"The Angels rescue Marshal Ray Carter from Mongolia but leave without what they presume to be his wedding ring.  Later they find out that the ring is one of a coded pair that, once combined, unlocks the data for the location of the entire witness protection programme.  The other ring has also been taken from it's holder and the holder murdered.  The Angels are charged to bring back the rings but along the way they encounter secrets from the past including a violent old flame from Dylan's youth seeking revenge and an ex-Angel striking out on her own.<br><br>It was with a heavy (but open) heart that I went to see this film.  I had enjoyed the first film (for all it's flaws) but I didn't really want to see a film that just went over the same ground.  Happily CA2 didn't just make the same mistakes as the first film did  it actually went beyond them!  One problem with the first film was that the plot had too many scenes that just seemed to happen without reason or consequence (the race cars scene for one).  However here the majority of the scenes seem to exist outside the plot.  It's like they knew that they wanted to repeat the essence of some scenes from the first film and, if they couldn't fit them into the plot, then they just dropped them in anyway.  Scenes that were enjoyable in the first film were just not quite as funny the second time round.<br><br>The plot is so disjointed that it really does feel very episodic and I struggled sometimes to see the narrative flow  mainly because for large sections of the film there wasn't one.  Characters are dropped in for little reason, scenes occur that are wedged into the plot simply because someone had the idea in isolation and got it added to the film etc.  However I won't waste time debating this here as I think many agree that this film was never meant to provide substance.  Which leaves us with style.  McG is aptly named as he is responsible for a mass produced product that seems to lack invention or spark of it's own.  It was possible to look at the first film as a tongue in cheek satire of blockbusters  but to do the same thing all over again made me realise that he wasn't satirising the cult of excess  he is actually part of it and worse, he hasn't got ideas of his own.<br><br>Hence we have scenes that are more like music videos.  The soundtrack pretty much covers the whole film, lest we should have a quiet moment to think! Also the action scenes are sub-par Matrix rips  once he may have gotten away with it but the joke has worn thin.  The action is just silly and makes it very hard to get excited or involved.  The opening sequence is just laughable and sets the tone  it's a shame as some of the fights are well choreographed and could have been good if they hadn't been pushed to being OTT.  The constant use of slow motion and linger shots of the girls' asses or blowing hair also gets quite tiresome in the end.  The film has quite a few good references to other movies (eg Cape Fear &amp; Sound Of Music) however these only work if they exist as scenes themselves and not just as references.  To show you what I mean, `The Simpsons' spoofed Cape Fear, but the episode stood in it's own right.  In CA2 some references seem only to exist as references and not part of the film.  The constant use of in-jokes and styles from other films stopped feeling like clever fleeting references and started to feel like McG just plundering for things to fill his film  I mean, doesn't even the concept of a quest for a ring sound familiar to anyone, never mind the Matrix effects?!<br><br>The cast is amazing and it is to McG's further shame that he makes poor use of the majority of them.  The lead trio are good but (as the outakes show) seemed to have had more fun making it than I had watching it.  Liu comes out the best for my money as she is the most convincing fighter and is the sexiest!  Moore is alright in the support but she is poorly used  she really does have a very small role, most of which is to show off her new body.  Mac is a major let down  from the trailer he had looked funny but the truth is that he gives a poor minstrel performance at best.  He has a few funny lines but he is not as funny as I've seen him  his failure makes the loss of Bill Murray feel 100 times greater.  Theroux is physically impressive but has a terrible accent that wonders from Northern Irish to Southern Irish to some sort of flat Scots at times.  The support cast is deep and mostly wasted - Bruce Willis has about 3 words and 1 minute of screen time, Fisher, Patrick, Eve, LeBlanc, Wilson, The Olsen's, Smith, Forster and Pink (to name a handful) all have very little to actually do and it just turns their scenes into a game of `oh look it's '.  The biggest waste is Cleese who is given nothing to do but do bug eyes over cheap innuendo and whisper `ferret'.<br><br>Overall I'm aware that to make these points is a waste of my time as many fans of this film will acknowledge them and say `so what?'.  Hell  I half enjoyed the film as a piece of fluff for a Sunday afternoon with mindless action and sexy ladies  but it's hard for that to totally suffice and, try as I might, I couldn't help but feel like I wanted something more from it.","user":"bob the moo","rank":[50,77]}]