[{"title":"As bad as a sequel can get!","rating":4,"date":"4 June 2004","review":"In the past few months, a bunch of direct-to-video sequels to highly successful movies have been released. There has been WILD THINGS 2, there has been CRUEL INTENTIONS 3, there has been THE SKULLS 3, and now there is STARSHIP TROOPERS 2: HERO OF THE FEDERATION, a disappointing follow-up to the science fiction classic STARSHIP TROOPERS. There was really no reason for this movie to exist. A sequel was not necessary, but for some odd reason, this sequel was made. <br><br>The original STARSHIP TROOPERS was a big-budget extravaganza with a budget around $105 million. STARSHIP TROOPERS 2: HERO OF THE FEDERATION has a budget of a around $6 million so naturally the special effects in this one look like crap. The special effects are not the only poor-looking aspect of the movie. In fact, the whole movie just looks terrible. The cinematography is awful as is the acting, writing, and directing. This movie is as bad as a sequel can get. No stars.","user":"jellyneckr","rank":[157,211]},{"title":"Not even particularly good for a B-movie","rating":1,"date":"20 August 2004","review":"From the very first frame of this film to the very last, it's completely obvious that it's a B-movie. A modern, low-budget, direct-to-video no less, action-B-movie. As a follow-up to the first, it's very bad. It turns the plot and theme of the first completely around. The plot is lame, and very unoriginal. The acting is horrible; there were times when it felt like a comedy, or a parody of the first. The characters are badly written cliches, derived from war movies and other B-movies. The cinematography is amateurish and lesser than that of the typical level of early film-student test film(believe me, it really is that bad). The director(or possibly the director of photography, or maybe the cameramen) seems to have a fetish for pointless and very quick zooming shots, and there seems to be quite a lot of camera angles that are zoomed much too far in. I also hated a few of the pan shots, but there were not as many as the zoom shots, and they were somewhat far between. The special effects are quite awful, though there were one or two effects that looked decent. The heroism and stereotyping of the main character/hero is ludicrous. I couldn't stop laughing at the scenes where he tries to look heroic. The whole film is quite laughable. The attempts at humor are cringe-worthy, and almost every scene that is supposed to inspire fear, tension or horror, inspired laughter and mockery instead. The dialog is ridiculous, and very badly written. The action is tame and never really intense. The horror elements are derivative of several much better movies, and generally don't work like they're supposed to, for various reasons(bad special effects,bad acting, bad camera angle). I know that this was direct-to-video, low-budget, and was possibly even intended as a B-movie, but come on, you can do better than this. Almost anyone could. I would guess that, given the same budget(about six million dollars, I think), I could have supplied a better, more interesting 90 minute flick. None of the limitations can be used to excuse how bad the film is. Direct-to-video? Please. So was Children of the Corn IV and American Psycho 2, and at least they were somewhat entertaining and much more professionally made. Low budget? Two words: El Mariachi. B-movie? Honestly... there are plenty of much more entertaining B-movies out there. Take Barb Wire, for example. All in all, a pretty bad film, but fans of B-movies might enjoy it. I recommend this only to fans of B-movies, and people who wished the first had been more like a B-movie. Fans of the first should stay away. I don't regret watching this, though. It was good for a laugh, and knowing that it's so bad is better than wondering about it. If you somehow, as a fan of the first, see this movie, try to think of it as comic relief, a spoof of the first. It'll soften the blow. 1/10","user":"TBJCSKCNRRQTreviews","rank":[127,173]},{"title":"They somehow managed to screw up everything.","rating":1,"date":"12 June 2004","review":"This movie is unwatchable. I found every single feature of it to be revolting.<br><br>For one, we have the effects. Every single bullet shot is a lame CGed blue pulse.<br><br>Two, they obviously didn't have anybody research military tactics. When the bugs are about to attack, instead of holding out inside the base and killing the bugs in hemmed-in territory (a la Sun Tsu), they move outside the base and massively expand their front. When the troops send a runner to inform someone that the bugs were coming, they send a heavy weapons operator, complete with his heavy gun.<br><br>Moreover, the behavior of the General is completely stupid. He acts like a Corporal at BEST.<br><br>The music is VERY poorly chosen, and never fits the scenes. Foreshadowing is very overt. Even the directing is shoddy... when the psychic fellow hallucinates, they use very ambiguous effects to signify it.<br><br>Please, avoid this movie at ALL COSTS. I swear, it couldn't have cost more than $50,000 to make...","user":"mendaliv","rank":[146,207]}]