[{"title":"Better than average drama that shows firefighters as real people","rating":7,"date":"11 October 2004","review":"It was thirteen years ago that Ron Howard's ode to firefighters hit theaters with 1991's Backdraft. This was before Howard went on to direct such popular fare as Apollo 13 and A Beautiful Mind. This was before Kurt Russell figured that Captain Ron might a good idea, and most importantly, this was before September 11, 2001.<br><br>To say that our impression of firefighters changed that day sounds, well, awkward. Firefighters have always been held in high regard. They run into burning buildings while everyone else is running out. They put their lives on the line to save others. It is a courage that most of us would like to think we have, but few of us are ever put into a position to test.<br><br>On September 11, we watched in awe as the buildings collapsed and 340 firefighters were taken from us prematurely. Although the loss of lives that day included thousands of innocents, we warmed to our heroes and it brought their efforts and incredible bravado back to our attention. Immediately after the tragic events, it was not uncommon to see people wave or salute firefighters in the most remote regions of our country. On CNN we began to hear stories of the personal lives of these men. Their support. Their sacrifices.<br><br>It is not surprising therefore that our newly energized interest was translated into big screen emotional powerhouses. In 2002, Anthony LaPaglia and Sigourney Weaver played a firefighter and a writer to prepare eulogies for those fallen in the attacks in The Guys. Now, in 2004, red-hot Joaquin Pheonix and John Travolta have teamed up to bring us the highly effective Ladder 49. <br><br>Ladder 49 starts with a fire in a large Baltimore factory where multiple firemen have charged to look for survivors and extinguish the posing threat.<br><br>Lead by seasoned veteran Jack Morrison (Pheonix), the firemen are able to rescue a helpless employee before the floor gives way trapping Morrison within the building inferno. As Jack lays there helpless awaiting the rescue from his peers, we are sent back in time via the Hollywood standard flashback to understand what brought Jack to his present peril. We see Jack as he enters the fire hall for the first time and meets Captain Mike Kennedy (John Travolta) who takes the new probie under his wing and over the years develops a bond that includes being there when Jack gets married, has kids and steps into the shoes of a search and rescue firefighter who perishes when a roof gives way during a routine house fire. We learn how the firemen bond, how they drink together rather heavily and regularly and how when they lose one of their own, the emotional impact on them and their families<br><br>Don't get me wrong, all the above drama plays out while buildings burn, people are rescued from skyscrapers and people are saved from what would be sheer death if not for the charging brave souls of the local Fire Department. There is enough action to keep the younger audiences looking for the quick rush occupied while enough firemen running around in tight t-shirts to keep the women equally transfixed. <br><br>But it is the story that sets this film apart from any other firefighting film in memory. We get a good glimpse into the lives of the men and portrait of a young man learning the ropes and growing within the culture and environment that can be sometimes loose and playful only to become serious and deadly at the sound of a bell. Director Jay Russell (My Dog Skip) packs an emotional punch that doesn't try and suck it out of the audience with an unexpected end. Instead, we see Jack being trapped in the opening sequence and we can pretty much see the writing on the wall before the tragic events play out before our eyes.<br><br>For all the focus played to the rising star Pheonix, it is the supporting cast that really stands out within the confines of the 105 minute running time. Travolta seems comfortable in playing a supporting role and is effective and powerful in his portrayal as the Captain of an efficiently run firehouse. Also standing above the average fare is Jacinda Barrett who plays Jacks wife. Yet another beautiful Australian actress, Barrett has the largest load in the film as the anchor that questions why her husband and father of her children would risk his lives for others ignoring his own well being. She both shows anxiety and support in her understanding of his passion and it is her strength that gives the film its heart.<br><br>To compare Ladder 49 to Backdraft would be unfair. Backdraft did little to bolster our impression of the firefighting community while Ladder 49 shows them for what they deserve to be recognized as  heroes who at the sound of an alarm will put themselves in harms way to help others.","user":"gregsrants","rank":[126,155]},{"title":"The life of a fireman - the sheer bravery is in the simple straightforward delivery of the movie, almost a documentary without talking heads - a family movie alright","rating":7,"date":"10 October 2004","review":"For analogy, this is your basic regular American hamburger - not a whopper with added cheese. No spice. Not peppered up. The movie \"Ladder 49\" is brave in itself that the straightforward script included no foul language, no cliff-hanger action sequence, sappy melodrama or moral preaching. It's telling the life of a fireman as it is through simple everyday vignettes, the rookie fireman, the camaraderie at the firehouse, the family anguish - the profession of a fireman that many of us might have taken for granted. This can very well be a simple telling of the life of a policeman or a soldier in active duty overseas. Unless something disastrous really happens and drastically affects us close to home, we can be unaware of how lucky we are, being able to go about our everyday life, 'safely and peacefully' living in America, with local law enforcement, firefighting emergency services and homeland security efforts available to us. <br><br>There are visual effects of fires a-blazing and fire fighting scenes inside and outside of buildings, but there's no dramatic build up to 'glamour' dazzle you like other Hollywood (blockbuster) movies. The initial sequence of the movie suggests a 'hanging' question: will Joaquin Phoenix's character (Jack) survive? But the diverted flashbacks keep our interest: how this rookie fireman came to be a firefighter in action, building a family, the family strife around his dream of a 'riskier' role on Engine 33 team, the loss of lives, the saving of lives. The pace may be leisurely at times and the plot may seem mild to some. We get to see Joaquin Phoenix in a 'lighter' less demanding role (vs. \"Gladiator\" 2000, \"Buffalo Soldiers\" 2001 or \"Clay Pigeons\" 1998). John Travolta is in a supporting role (Captain Mike), giving lightness (smiles) and dignity to the fire chief he portrays.<br><br>This is not like \"Backdraft\" 1991. The apparent danger and risks of the life of a fireman and family is the crux of the storyline. This is a family fare for all - a tribute to the firefighters whose bravery we are grateful of. I appreciate the fact that death is treated as part of life and that we do not go about laying blame on others or beat ourselves up (we learn, stick together and go on). Ah, the firm gentleness in his direction, Jay Russell (who directed \"Tuck Everlasting\" 2002, \"My Dog Skip\" 2000) doesn't thrust anything in our face, yet subtly provides short gem moments, and the noteworthy words coming from Travolta, we would remember, won't we?","user":"ruby_fff","rank":[70,88]},{"title":"Climbing, Climbing, Climbing........","rating":27,"date":"27 October 2004","review":"A terrible blaze traps a firefighter (Joaquin Phoenix) in a Baltimore building. As his co-workers (led by chief John Travolta) try to figure out a way to help him escape, Phoenix thinks about the last 10 years of his life. Through those years of fighting fires he experienced triumph (meeting and marrying the love of his life, Jacinda Barrett) and also living through several tragedies (deaths and injuries to fellow firemen). \"Ladder 49\" is comparable to a legendary athlete, it is not always great but it is great when it has to be. The movie has many shortcomings. There are dead spots galore and watching firefighters getting drunk in wild bars and playing silly pranks on one another do not always put them in a favorable light. However, the film's final act is excellent as we learn what Phoenix's fate is. In many ways an homage to those brave individuals in New York who sacrificed all during the terrorist attacks of 9-11 and also a deceptively smart character study. Travolta is excellent and Phoenix is nearly as good. Members of the supporting cast all have their moments and by the end \"Ladder 49\" climbed high enough for me. 4 stars out of 5.","user":"tfrizzell","rank":[51,64]}]