[{"title":"Why the twist at the end was disturbing","rating":9,"date":"1 September 2005","review":"I thought this movie was great because of the twist at the end. I have seen this movie a few times and 2 out of 3 people miss the most creepy and disturbing part of the whole movie. The funny thing about this movie is that the sacrifices all started with the children of the wealthy banker. Papa Justify and Mama Cecile took over the children's bodies during the party and then the people at the party hung and burned the children thinking it was the servants. That in itself was disturbing. They then shot the wealthy banker and his wife and took over the house and lived there until they took over the new couples bodies in 1962.","user":"olin2359","rank":[24,25]},{"title":"They Do that Hoodoo that they Do so...eh, Relatively Well","rating":7,"date":"14 August 2005","review":"Horror movies have become a dime a dozen in the past few years. The watchable ones seem to fall into two categories of late: misguided psychological thrillers headlined by a consummate actress (witness Naomi Watts in \"The Ring 2\" or Jennifer Connelly in \"Dark Water\") or over the top slasher/gore-fests with serious kitsch value (witness Romero's enjoyable zombie flick \"Land of the Dead\" or Rob Zombie's sadistic \"Devil's Rejects\"). All of the rest have pretty much been unbearable cliché-ridden hack jobs (\"White Noise,\" \"Darkness Falls,\" etc...) <br><br>Oddly enough, \"The Skeleton Key\" doesn't fall into any of these categories and it comes across as a breath of fresh air, an old-fashioned throwback to the traditional Gothic mystery thriller, where a pretty female outsider (Kate Hudson acquitting herself rather nicely here as the hospice nurse traveling deep into the Bayou to care for an apparent stroke victim) moves into a big old house/castle that just might be haunted. The director and screenwriter start things slowly, and do a nice job of creating a realistic setting before letting all the mumbo-jumbo slowly and effectively creep in. Gena Rowlands and John Hurt (immobile and mute for most of the film) are fairly good in their respective roles as the married couple with more than just skeletons in their closets. We've seen this stuff all before, but it's done fairly well here with no sense of flash or pretensions, and as silly (and potentially offensive) as all this Hoodoo in the Bayou stuff is, the audience is treated to a twist ending that makes perfect sense in the context we have been given. This isn't a twist ending for twisting sake, but a fitting conclusion to the story.<br><br>\"The Skeleton Key\" tries to remind people of classics like \"Rosemary's Baby\" and \"The Others.\" It may not ultimately hold a candle to those films, but it's a very entertaining way to spend a few hours.","user":"WriterDave","rank":[182,216]},{"title":"Well Spun Southern-Gothic Horror Tale.","rating":10,"date":"23 April 2006","review":"I saw \"The Skeleton Key\" back in August 2005 during it's theatrical run, and I can say it was one of the better horror/thrillers of the year. <br><br>\"The Skeleton Key\" is about a young hospice worker named Caroline Ellis who decided to take a caregiving job outside of New Orleans deep in the bayou. She will be working for Violet Devereaux, and will be taking care of her bed ridden husband, Ben. Caroline senses something eerie about the old plantation house, and begins to uncover a strange chain of events and incidents after opening a secret room within the attic. In the attic are all kinds of strange things, and strangest of all and old record called 'The Conjure of Sacrifice'. Caroline begins to suspect something isn't going right within the home. She asks her friend Jill who explains that the attic is probably a Hoodoo room, and tells Caroline that Hoodoo is folk magic, and it can't hurt you if you don't believe in it. But if Caroline dares believe in what she has been exposed to, it can ultimately destroy her. Could there be ghosts within the old home? Or could something else even more sinister be going on? <br><br>I can't say a whole lot about this movie, but trust me you will be pleased with it, and the ending will surely shock you. It has to be one of the greatest twists I've seen in a movie, and came completely unexpected. When you think you know what's happening, everything is completely reversed, and I have much respect for the writer of this film, who incidentally wrote 2002's hit \"The Ring\". I think this film is by far better though.<br><br>The movie sets a very creepy tone and atmosphere, with all the imagery of the Spanish moss, etc. Director Softeley uses lots of southern imagery to add a certain texture to the movie. Also the record featured in the film, 'The Conjure of Sacrifice' is very creepy, listening to it can give you the chills. Kate Hudson is excellent as our main character, and Gena Rowlands was perfect for the shadowy yet friendly old woman. John Hurt is great too, speaking hardly one word throughout the whole movie, yet giving a perfect performance by mannerisms and facial expression. How many actors can do that? <br><br>I think one of the reasons this movie appealed to me so much was because it took place in the South, and I've always been fascinated with places like that, but overall I think anyone can enjoy the movie - it has great acting, an excellent story, and some pleasingly creepy moments. But don't expect some blood and guts horror film, this movie builds tension and suspense rather than drench us with blood, it isn't that type of horror film. \"The Skeleton Key\" is an excellent Southern-Gothic mystery, compelling all the way through. They don't make many of 'em like this. 10/10.","user":"drownnnsoda","rank":[54,64]}]