[{"title":"I've waited a long time for this . . .","rating":1,"date":"1 September 2004","review":"In reviewing the incredible annoying House of the Dead, I wrote, 'Why flirt with the concept of overkill when you can make it say 'whose your daddy?' Torque does not flirt with overkill; Torque *is* overkill's daddy, and it was fun. <br><br>Just a few hours before I watched Scary Movie 3 and that film barely managed to summon a chuckle from me. Torque had me in stitches before the first sixty-seconds were up. After years of watching 'serious' films with ridiculously over the top chase sequences (especially lately), finally a movie comes along and puts them all in their place. I have waited a long time for a racing-movie to recognize its own lameness and just (knowingly) go for all the over-the-top stunts it can possibly collect in a loosely strung together plot about a bunch of stereotyped misfits no one really cares about.<br><br>As stated above, the key was the fact this film does not take itself seriously. Take for example the MTV quick-cut commercial editing style, its overly colorful nature in sets and props, the comic-book-ish camera angles, the overused CG for impossible camera/bike moves, and the lighting which left the high-contrast shadows in mid-day. Want more? How 'bout when a bike speeds past a road sign, making it do a Looney Toonsesque-spin, and if you look carefully you can see the words 'Cars Suck?'<br><br>Everything perfectly matched the goal this film set out to hit, which is basically a tongue-in-cheek XBox game on the silver screen so commenting on the characters and plot seems virtually pointless. It's about as well developed as most action films-characters and plot serve enough purpose to get the bikes from chase scene A to chase scene B while poking fun at characters/lines from other racing films. No more no less.<br><br>I personally loved Torque. Would I recommend it to friends, family, or Joe-Shmoe who happens to pass me by in the video store? Well . . . for those who watch films with an anal eye and point out, 'That's not a logical plot point. That defies the laws of physics. That's the single stupidest thing I've ever seen in cinema?' No. Heck no. Don't even pick up the box. However, for those who can watch a film where the comedy lay not in punch lines rather in the style -- a film that's a celebration of all things lame in all of cinema's over-glorified chase scenes? Have a blast and join in with Torque's mockery of the genre.","user":"jaywolfenstien","rank":[89,117]},{"title":"C'mon, it's a B-movie! Lighten up! (***)","rating":7,"date":"1 February 2004","review":"A lot of people think that I love the \"Charlie's Angels\" movies because I think they're \"so bad, they're good\", when that's actually not true. On the contrary, I think they are pretty smart (especially in the precise way they constantly reference pop culture in clever and heartfelt ways). And yes, they are totally silly and unrealistic and goofy, but what I like about that is that it's completely intentional (which is what most people don't get, and is so obvious to me).<br><br>\"Torque\", on the other hand, is a perfect example of a movie that is TRULY so bad, it's good. Or at least enjoyable in a surreal, lunatic sort of way. This movie seriously doesn't have a brain in its head.<br><br>In every sense a B-movie, it most resembles those gleefully exploitive, low-budget movies that Roger Corman and Russ Meyer made decades ago, where biker gangs did battle with their switchblade-toting girlfriends at their side. And it's every bit as silly as it sounds, which could be either good news or bad news for you, depending on what kind of filmgoer you are.<br><br>\nPersonally, I knew it was crap the whole time, but still had a blast watching it. The story is ridiculous and the dialogue is ludicrous (these characters exist in a world where when a girl says \"Nice bike\", the guy says \"Nice a**\" and she LIKES it). But I cannot fully resist a movie in which two improbably beautiful biker chicks stare each other down on their bikes in a photogenic, deserted alleyway (both of them in front of huge product logos, for extra giggles), one of them yells \"Bring it on, b****!\", the other whips out a switchblade, and then they charge! As a classic B-movie enthusiast, I offer no apologies for having fun watching a scene like that.<br><br>\nIt's really not all bad, either. Martin Henderson and Monet Mazur have some genuinely nice and tender scenes together, and the great, color-conscious cinematography makes everything look so shiny you could eat off the screen. Jamie Pressly is an absolute hoot as the evil biker chick, and Adam Scott scores some laughs as a conceited F.B.I. agent.<br><br>Also, several of the action scenes are pretty amazing, once you get over the idea that this movie is obviously not taking place on planet Earth, but rather some video game universe or a 12 year-old's dream.<br><br>\nI wish Ice Cube was off doing the kinds of good movies he used to make (like \"Three Kings\", the original \"Friday\", \"Boyz N The Hood\", \"Higher Learning\", \"Ghosts Of Mars\"...), but he contributes some laughs as one of the heavies here. I do wish he had changed his expression at least once, though. You know the one where he grits his teeth and curls his upper lip so that he look like he hates your guts and steam is about to come out of his ears? That's the one that he has throughout the entire movie.<br><br>\nBasically, I'm not gonna fight for this movie or anything, I realize it's of essentially no value. I'll just say that it made it easy for me to shut off my brain and I enjoyed it, and maybe you will too. I give \"Torque\" 3 stars the same way I would give \"Switchblade Sisters\" 3 stars. They're awful and cheesy, but a hell of a lot of fun, and that counts for something, doesn't it?","user":"Ronin47","rank":[80,112]},{"title":"Pretty as cotton candy being spun at a fair...","rating":14,"date":"14 February 2004","review":"...And just about as nutritious for anyone seeking a coherent story or serious characters.  But being an aficionado of low-rent B movies, I took TORQUE for what it was -- a video game on film that had no relationship to the laws of physics.  Roger Corman would be proud of this puppy.<br><br>I loved the look of it.  I hate the desert (where it seems 75% of this film was shot) but it seemed so lovely, I almost wanted to visit the locations.  Martin and Monet are beautiful to look at and almost pull off their \"tougher-than-thou\" attitudes.  Ice Cube was dope (meant in the good way, not the dumb one) and the bad boys (and grrrrl) were just too much fun.  Joseph Kahn shows promise as a director (if someone will please put him on Valium); his quiet moments were just as nice as his non-stop action ones.<br><br>What's bad?  I can't say the script was because it's obvious there really wasn't one except in the loosest sense.  The editing was so in your face, I got lost a few times and still cannot figure out how one character died except he went BOOM on his bike in downtown LA.  I was a bit offended at how all the black guys were portrayed in a stereotypical \"bad-assed-muthaf**kah\" way as opposed to the cool as cucumber confidence of \"the lead three and she\" and the \"we're refugees from MAD MAX\" baddies.<br><br>Let's put it this way -- cotton candy is probably the worst thing you can put in your body in the way of anything edible, but if you got a craving for it, nothing else will do.  And that's TORQUE, to the \"max.\"","user":"jemmytee","rank":[28,38]}]