[{"title":"Beautiful !!!!!","rating":10,"date":"10 May 2005","review":"I've read the comments on this movie, and my opinion is that most commenters did not really get this movie.<br><br>This is an Enki Bilal movie, which means it is a Graphic Novel (i deliberately do not use the word \"comic book\") in cinematic form. If you get the chance to check out some of Bilal's work, you will understand this movie all the better.<br><br>The movie is a mix of live action and lots of CGI, which may make it confusing for some at times. If you must, think of it as an animated movie using live actors.<br><br>The movie is an audiovisual treat, but, like much of Bilal's work, is heavy on symbolism and portrays a very bleak vision of the future. <br><br>If you want to see a mainstream scifi spectacle, don't see this film. If you want to see something that is out of the box, go see it, rent it,or even better, buy it!<br><br>As a whole, the movie best compares to Japanese anime, more specific movies such as Ghost in the Shell.<br><br>I absolutely adored it. The Baudelaire poetry was an unexpected surprise (in retrospect, however, it should not have been)<br><br>As a result of seeing this film, I went out to buy some of Bilal's graphic novels.<br><br>If you:<br><br>loved the ambiance of The Fifth Element adore the darker side of Japanese anime wanted to walk through the streets in Blade Runner want more out of a movie than simply action love the work of Charles Baudelaire want to see that even Egyptian gods are flawed<br><br>See this film!!<br><br>Some points of notice:<br><br>At times, the amount of visual information is staggering. i had to rewind a couple of times to get everything. It compares to reading the page of a graphic novel a couple of times to get everything.<br><br>The mixture of CGI and live actors is strange at first, but you get used to it.<br><br>My one negative point about this movie: the Egyptian gods were too static. they should have been a bit more lifelike. As it is, they look like barely animated statues. It adds to the graphic environment, but comes off strange in a movie. I would have liked to see more of them as well.","user":"jandalf","rank":[187,222]},{"title":"This not for kids and less for empty minded adults","rating":5,"date":"5 December 2004","review":"One of the most surprising and disappointing things I read on other peoples comments were the comparison with PIXAR and of course the quality of the computer generated images. It seems, that US public, values ART according the technical resources of the artist more than the spiritually of the work.<br><br>Cinema is art. In USA, that art has become almost absolutely dependent on business. The main reason I am anxious for digital (not film) movies and projectors in every theatre; it is because I will be able to see real artist working not just moneymaking customer oriented factories. Productions will become less expensive, and everybody would be able to create and be judged for their work. In the mean time, luckily in Europe (mostly in France), there are still people interested in art and this movie had a go; something should never happened in USA. A brief description of the argument follows.<br><br>HORUS (the god of the sky), about to be executed by his peers, is given 7 days to visit Earth for the last time. He spends his time searching for a particular woman he wants to impregnate. To do that he needs a human body to act as his vessel (or container). An accidentally escaped terrorist (or we can call it a rebel) becomes it. The woman herself is having mysterious body changes and a complete lost of past memories. A lot of small events and characters are involved in the whole situation.<br><br>IMMORTEL (ad vitam) is a strange movie; full of religious and philosophical bits. Do not expect more explanations than these. The mystery is part of the movie poetry and is really up to you to understand or feel it. The answers (if any) are pretty hidden inside the movie.<br><br>Technically, there are moments (not always but a good average) were the merge of human characters and digital images is credible. The BLADE RUNNER style background scenery is perfectly crafted. The few action scenes are OK but not spectacular; as this is not really an action movie you could accept that.<br><br>Final advise; spend a couple of hours with this movie. It would not change your life, but it would make your brain work; and sometimes that is a lot.","user":"abisio","rank":[257,335]},{"title":"Baffled at the low ratings","rating":9,"date":"7 December 2004","review":"I usually just stick to voting or info-retrieving when I visit IMDb. But my amazement at the low rating that this movie received is making me type these words down. I'm not much of a sci-fi fan but this movie yesterday at the art-house theatre and loved it. Powerful and convincing main characters (I'm not acquainted with the comic book series which are supposed to be better) , great characters (nice to see Charlotte Rampling doing something different), thin story lines but you know what you want to see: Egyptians Gods excerting their will in the not so distant horrid future. Simply loved Horus. Didn't experience a dull moment. And thus: 9 out of 10, partly to counterbalance the low ratings.<br><br>Go see it.","user":"Pulsewidth","rank":[181,234]}]