[{"title":"No Lemons In This Snicket","rating":31,"date":"31 October 2005","review":"Some movies are just plain fun to watch. This is one.<br><br>It's funny, it's dramatic and it's a great visual treat with Tim Burton-esquire wild images throughout. This is a superb job of combining great visuals, special effects and an entertaining story.<br><br>The two kids, played by Emily Browning and Liam Aiken, should get top billing since they are in every scene while Jim Carrey is in about half. <br><br>Everyone in this film is a hoot, especially Carrey who plays \"Count Olaf\" and then disguises himself by pretending to be other people throughout the story. Whomever he was playing he was hilarious. With his crazy persona, Carrey was good choice for this role. The lines he delivers are so hammy they make me just laugh out loud. I appreciated his work even more on the second viewing.<br><br>The kids are likable, good-looking and decent actors and the \"baby\" is given the funniest \"lines\" in the movie - all in subtitles.<br><br>This film is too dark for the little kids but fun for adolescents on up. There is almost no profanity in here and no sex. The sets are particularly strange and interesting, from the various houses to the clothing to the computer-enhanced scenery, with gorgeous colors. Make no mistake: this is a very pretty film with so many fascinating objects in here to view that even multiple viewings can't possibly pick them all up.<br><br>Obviously, there is a lot to like. I hope there is a sequel.","user":"ccthemovieman-1","rank":[76,86]},{"title":"Dark but compelling fantasy adventure","rating":8,"date":"1 January 2005","review":"Having read none of the Lemony Snickett books, I was unsure of what to expect from this film.<br><br>The film begins with a gentle introduction that quickly turns into a humorous, but noteworthy, disclaimer that the following film has dark underlying themes. The main characters are introduced (the three children) and almost instantly we are subjected to the news of the first in a series, or unfortunate events. The film is fast paced and sends the children from one unfortunate situation to another, with Jude Law doing a splendid job of narrating the story along the way. The children a likable and resourceful characters with good chemistry between the actors. You genuinely feel they care about each other and have a great desire to help each other out of these incredible situations.<br><br>The real star of the show of course is Jim Carrey. This film provides the perfect platform for Mr Carrey to do what he does best, goof around and play over the top and outlandish characters. In this role Jim Carrey excels, never goofing off to much to undermine the credibility of the character, but being suitably over the top to convey the eccentric old count.<br><br>Visually, the film is stunning, the sets look straight out of a Tim Burton film, the costumes are fantastic, the direction is splendid and does a fine job of progressing the story. The visual effects are tremendous and fit in with the tale perfectly, never distracting nor undermining.<br><br>This film is quite dark for a children's film, but not dark in a sinister way, but dark in a spooky hallowe'en sort of way that kids love. Watching the film reminded me of reading Rhoal Dahl books as a child, with the over the top characters and out of this world situations.<br><br>The plot of the film is fast paced, but contains good character development and plenty of action and adventure. I would recommend this film to children and adults alike.","user":"theantigaz","rank":[107,127]},{"title":"Much better than expected","rating":7,"date":"14 December 2004","review":"In the wake of Harry Potter the popular Lemony Snicket books have been rushed into production and considering the less than promising prospect of Brad Silberling directing and Jim Carrey starring, I didn't really hold out much hope. It turns out that the film is surprisingly good and apart from The Incredibles this was the only big budget Hollywood film I truly enjoyed this year.<br><br>Like Harry Potter, the Lemony Snicket books appeal to adults as well as to children but they are darker, funnier and more eccentric, making them more of a cult than the mainstream success of the Harry Potter series.<br><br>If you've read the books, you may miss the clever word play and you may feel that the two older children are miscast. Unlike in the books, the boy doesn't come across as particularly brainy and the girl looks just a bit too sexy as Violet, reminiscent of a teenage Anjelina Jolie. Still they are better than some of the child actors in the Harry Potter series.<br><br>On a visual level the film is simply stunning. True, some of it is reminiscent of Tim Burton as both Burton and Daniel Handler are strongly influenced by the work of the writer and illustrator Edward Gor ey. The look of the film is a highly stylized mixture of Edwardian times and the 1950's and convincingly brings to life the parallel universe of the books, where death is ever present and where the whole world has conspired to make the Baudelaire children's life a misery.<br><br>Folding books two and three into the storyline of the first one, the plot feels episodic but it stays consistently entertaining. Not being a Jim Carrey fan I was worried about his involvement (I still think Richard E. Grant would have been the perfect choice) but he nails and certainly looks the part of evil, failed thespian Count Olaf and thankfully he doesn't end up dominating the film, turning it into the Jim Carrey show.<br><br>The section involving Meryl Streep's fearful Aunt Josephine is the best part of the film. Taking place against backdrops reminiscent of Masaki Kobayashi's stylish horror classic Kwaidan, Lake Lachrymose is as beautiful as it is nightmarish. <br><br>Make sure to stay for the beautifully animated credit sequence.","user":"Boris_Day","rank":[247,309]}]