[{"title":"Refreshingly Non-Mushy Romantic Comedy","rating":7,"date":"7 January 2005","review":"Sandra Bullock and Hugh Grant hearken back to classic screwball comedies in a very engaging if somewhat shallow romantic film that accentuates laughter above sentiment and succeeds wonderfully - even when it's not especially witty or gut-busting.<br><br>Bullock plays Lucy Kelson, a committed left-wing attorney with an immaculate Ivy League background who fights the good fight against the heartless developers of lower Manhattan and the outer boroughs. Complications ensue when she finds herself working for one such figure, George Wade (Grant) in exchange for his preserving a Coney Island landmark near her childhood home. Wade's not a bad guy, but he's frightfully dependent on Lucy for everything. When it seems possible she might at last get clear of him, she begins to have second thoughts about letting him go.<br><br>Two things I really, really like about this movie. One is the chemistry of Grant and Bullock. Bullock takes to being the butt of assorted slapstick with a gusto rare for a gorgeous screen star. She seems to have inherited the Doris Day mantle from Julia Roberts and Meg Ryan, though in a better way than either of those two screen stars. It's a pity she's since shown no interest in maintaining it. Grant plays off her very well in a role he could perform in his sleep - and sometimes seems to do just that, albeit in a good way. He has a casual way with a line that reminds me of Roger Moore or David Niven at their best, and shows he is growing comfortably into a solid on-screen presence after years of coasting on looks and charm. If IMDb.com is correct, he got paid $12.5 million for this, which if true is way too high, but he is probably the one guy who could make Wade so enjoyable, to the point where you're happy at his shenanigans for keeping Lucy by his side.<br><br>The other thing is the NYC backdrop. There's some eye-popping visuals courtesy of legendary cinematographer Laszlo Kovacs, like the bridges lit up like Christmas trees in the background while Bullock has a drunk moment with Grant aboard his yacht. Another scene features a helicopter shot of Manhattan by the Hudson, with a nice nod at 9/11 that doesn't impose itself on the viewer but is there for the noticing. (This was the first film shot in the city after the tragedy.) You can compare \"Two Weeks Notice\" with classic romantic comedies like \"What's Up Doc?\" or \"Bringing Up Baby.\" Not that it's as good, but the goal is similar in that it strives to entertain more than play with one's heartstrings.<br><br>Alright, the story is shallow. We never really get a sense of Kelson's duties with Wade except when it comes to being pulled out of weddings to pick out ties. Her absentee boyfriend is barely established. The supporting cast is not well developed, except Robert Klein and Dana Ivey as Lucy's parents. (Klein especially is wonderful.) Alicia Witt is spellbindingly gorgeous as Kelton's would-be replacement, and she plays wonderfully off the main pair, but she's suddenly thrust into the role of the heavy simply for plot convenience, and it's jarring. Too many other secondary roles are like that, too.<br><br>The script, by director Marc Lawrence, has its share of lame one-liners, but it keeps a steady, merry tempo that distracts from the film's shortcomings at least somewhat while focusing on its key strengths, Bullock and Grant. Lawrence's direction is similarly solid. I like the little bits of business between Bullock and Grant, like when they pick off each others' plates at Fraunces Tavern, or when she refuses his offer of a sidewalk kebob, calling it a \"flesh popsicle.\" The scene that sticks out most is of her at an outdoor party, wearing a lovely tulle gown and a clown nose. This is one film that makes a serious point of being goofy and glamorous all at once, and it works. If all romantic comedies were so committed to being entertaining, it would be a lot easier for us guys to sit through them.","user":"slokes","rank":[57,64]},{"title":"Cute!","rating":6,"date":"1 May 2003","review":"\"Two Weeks Notice\" tells of the romantic misadventures of a playboy tycoon (Grant) and a \"greenie\" attorney (Bullock) who can't seem to get along until they finally realize what they can't get along  without is each other. On the downside, the film is the usual romcom fare with nothing in particular to distinguish it from a panoply of peers. On the up side, the flick is chock full of Lawrence's humor which made \"Miss Congeniality\" and \"Forces of Nature\" so enjoyable. Entertaining stuff worth a look for Bullock or Grant fans and romcom junkies. (B-)","user":"=G=","rank":[29,37]},{"title":"Didn't like it much the first time but Enjoyed it a whole lot more during the second viewing","rating":1,"date":"1 May 2008","review":"I saw 'Two Weeks Notice' some years ago and didn't like it much. It seemed like a passable romantic comedy. I mean, the acting was overall good, the story a little old... it just felt like it lacked something. However, after having revisited it today, I actually liked it a lot more than before. Once one is passed the first half hour or so, I think he/she can really enjoy the film.<br><br>What makes the first half hour or so annoying is it's dragging pace and Hugh Grant. His character just comes across as extremely needy and perhaps it's not Grant's fault but the actor doesn't add anything new to his role. This is the kind of role that made him a star but he seems to have forgotten that there are other genres outside romantic comedy. Perhaps he wants to stick to a safer formula but I wonder how long people will continue watching him in the same kind of films playing similar roles. Anyway, after this initial half hour, he does decent in the acting department as he shows George's growth. We see his He shares a good chemistry with Sandra Bullock.<br><br>'Two Weeks Notice' belongs to Sandra Bullock and I think it is her acting and her character that make this film more likable. The woman is naturally beautiful and her comic timing is impeccable and it is no surprise that she's known as one of the finest comedy actresses (and she's great in other roles too). she has some of the best lines and she delivers them with complete ease.<br><br>I also loved the dialogues. There are some hilarious one-liners such as the barking chilli dog and the bobcat pretzel. After the dragging initial reel, the story moves at a good enough pace and gets funnier. Lawrence's screenplay and direction are good as the end result looks polished but some editing could have helped to tighten it up.<br><br>Overall, I think this funny film deserves a second chance as I liked it a lot more during the second viewing. I'm glad that I chose to watch it again.","user":"Chrysanthepop","rank":[18,22]}]