[{"title":"A film biography that's complex, like its subject","rating":8,"date":"3 October 2007","review":"Haynes' adventurous biopic of Bob Dylan, which uses six actors of both sexes and several races ranging in ages from 11 to 50, is both exhausting and fun to watch. It's also hard to describe. But let's start with those six and the characters or facets they portray. Arthur (Ben Whishaw) is the Dylan who incarnated Rimbaud and serves as a kind of narrator whom we see smoking and giving ironic answers to some kind of inquisition sporadically throughout the film. Woody (the wonderful young Marcus Carl Franklin, an amazing a singer and actor) is a precocious rail-hopper with a guitar (labeled like the real Woody's, THIS MACHINE KILLS FASCISTS) and tall tales that start with his claim that he's Woody Guthrie. Woody's scenes show him rescued by a black family and a white family and performing with country black musicals. He represents the early shape-shifting Dylan in search of an identity and telling a lot of lies along the way.<br><br>Jack (Christian Bale) is the Dylan who became a hit in Greenwich Village and went into the South and sang \"The Ballad of Hattie Carroll\" and other protest \"folk songs,\"the high-profile \"political\" Dylan who spearheaded a movement and became famous with his brilliant early LP's. But Jack doesn't want to be typecast and \"betrays\" his adoring public and his lover and folksinging champion Alice (Julianne Moore), a Joan Baez stand-in seen in later \"interviews.\" Jack disappears and his place is taken by Robbie (Heath Ledger), a young actor in New York who becomes famous for starring in a 1965 film depicting the vanished Jack. Robbie meets Claire (Charlotte Gainsbourg) in a Village coffee shop and falls in love, and a turbulent ten-year marriage follows, winding up painfully at the time of the Vietnam War's end.<br><br>If Jack represents the cast-off early style and Robbie represents Dylan's family life, Jude (Cate Blanchett) is Dylan the artist, quintessentially as seen in the mid-to-late Sixties when he toured England (an event notably chronicled by two Leacock-Pennebaker documentaries)and shocked his audiences, some of whose members felt betrayed and shouted \"Judas!\", when he shifted from solo guitar and harmonica to more personal songs with loud rock accompaniment. Jude's segments are partly borrowed from Pennebaker, but largely consist of gorgeous black and white scenes deliberately and \"churlishly\" (Haynes' word) imitative of Fellini's 8 ½.<br><br>Jude's new style is admired by Allen Ginsberg (David Cross) and underground groupie Coco Rivington (Michelle Williams) and he becomes internationally famous. But he continues to be misunderstood by the protest music old guard and conventional journalists like the British TV host Mr. Jones (Bruce Greenwood)who's incorporated into a music video for Highway 61 Revisited's \"Ballad of a Thin Man\": \". . .something is happening here /And you don't know what it is, do you, Mister Jones.\" . .<br><br>Jude and Arthur articulate the early Dylan's challenging, ironic stance to the public, but Jude is exhausted on tour and his nihilism leads him to an existential crisis.<br><br>He's reborn symbolically in Pastor John (Christian Bale again), who's moved to Stockton twenty years later and become a born-again preacher, singing his own gospel songs. Finally the last version of Dylan appears in Billy (Richard Gere), in full retreat from the worldtill threats to destroy his town of Riddle cause him to enter public life again. This sequence evokes a Sixties historical western in which Pat Garrett (Bruce Greenwood) is a character.<br><br>This is only the barest outline of the two-and-a-quarter-hour film, in which various \"Dylan's\" are woven in and out. Maybe the reason why I found Woody's sequences delightful and Billy's colorful but wearying has to do with the latter's coming two hours later. But Gere and his sequences evoke Dylan less well and are puzzling to interpret. Blanchett's in contrast are, of course, the most conventionally straightforward. She's the only one who successfully mimics the physical appearance and the speaking voice of the artist (unless Whishaw does a better job with the voice). But Blanchett's mimicry is intentionally undercut (and the biopic conventionality of films like Ray avoided) by having Jude be played by a womanwhich was planned by Haynes in his screenplay before he even chose his actor.<br><br>The method Haynes has chosen avoids cliché. This is still a biopic, but it's a sophisticated one; and the fractured portrait is well justified by the nature of its subject. Dylan has always been a shape-shifter; some of his permutations were left out, such as the period of the orthodox Jew and JDL supporter. But it's intelligent to see Dylan the man, the husband, the artist, the political being, and the religious being as completely separate entities because no simple biopic sequence can really dramatize the complexity of such an artist and such a protean existence. Haynes' film makes you think about biography itself, as well as giving imaginative shape to aspects of Bob Dylan no non-fiction account can really provide.<br><br>Maybe it's the daringly experimental methodology that led Dylan himself, approached through his eldest son Jesse,to grant Haynes both the musical rights and the biographical rights. Haynes has chosen a multifaceted and original way of using Dylan's songs. Only Franklin actually performs them with his own voice. Otherwise the soundtrack mixes original Dylan recordings with existing covers, new ones by people as widely various as Ritche Havens, Iggy Pop, John Doe and Sonic Youth, and other music, including, appropriately for the 8 ½- esquire sequences, Nino Rota. There is a voice-over narration by Kris Kristofferson. Haynes worked on the screenplay for years, and then collaborated with Oren Moverman.<br><br>Not for mainstream audiences or be prime Oscar bait, but a challenging, fun watch. <br><br>Shown in the press screenings of the New York Film Festival at Lincoln Center 2007. Haynes was present fort a Q&amp;A afterward with J. Hoberman of the Village Voice, which revealed that the director is an intelligent and articulate man and who knows his Dylan.","user":"Chris Knipp","rank":[237,271]},{"title":"Disjointed mess","rating":5,"date":"25 April 2012","review":"First and foremost, Bob Dylan is a genius and a perfect subject for interpretation. A great idea with mixed results in I'm Not There. Cate Blanchett opens as Jude Quinn, a mid 1960s era Dylan getting on stage but quickly shown in a motorcycle accident. The British actress looks uncannily like the folk singer, especially in silhouette. <br><br>Marcus Carl Franklin portrays Woody Guthrie and the eleven year old boy proves to be a major talent. He travels the country by train and in a time shift travels to a hospital to perform a song for the real Woody Guthrie. <br><br>Christian Bale is in a documentary style portion as fans praise the great artist as the voice of a generation as he treats and reporters with contempt. Bobby does not come off to well as a human being.<br><br>Later on, Bale reappears as a born again pastor, which showcases Dylan's brief Christian period , preaching to a congregation and singing the gospel tune \"Pressing On\" from the album \"Saved.\"<br><br>Heath Ledger is in a film within the film as an actor playing the Christian Bale character in the least interesting part of I'm Not There. <br><br>The second unnecessary segment is Richard Gere as Billy the Kid looking for his dog and meeting Pat Garrett and a convoluted storyline with a funeral, a jail break and back to the train once again. I found the whole experience a disjointed mess with some fine acting. I love Dylan's work, so this is a wasted effort.","user":"billcr12","rank":[10,10]},{"title":"Multi-faceted Dylan","rating":9,"date":"14 September 2007","review":"'I'm Not There' Todd Haynes, 2007<br><br>The biopicture can be a difficult kind of picture to picture. Even more so when you have no intention of divulging the name of your subject. And dare I say it, yet further still when you insist on casting at least six people to play the lead role. This is the charm behind 'I'm Not There' - Todd Haynes' tribute to the life and times of Bob Dylan that recently lit up the Festival di Venezia. Biographic cinema is a frightening beast, some films are stuffed full of information while others attempt to exactly mimic their respective studies. There are however very few that play with their quarry, flitting from fact to fiction so quickly that in the end we know not what to believe. In reality, the life of Robert Dylan was exactly this mess of lies, grandeur, childishness, arrogance and genius. One of almost unbelievable occurrences that when whispered about long enough become carefully set in stone. Todd Haynes understands this fact and so goes after it with a stance of almost awed respect, yet as an onlooker - crafting a mockumentary that is so rich in character and love and attention to detail that we can't help but be drawn in. I've heard early reviews stating that 'I'm Not There' will make the Dylanites gush and the normal folk sleep. The fact is this couldn't be further from the truth - being a person that is indifferent to the music appears only to heighten the enjoyment.<br><br>Somewhere during the last five years, writer/director Haynes came upon the slightly trampled idea of conducting a Bob Dylan biography movie. Nothing original in itself, though with one idea to make it slightly different from what the likes of Scorsese had attempted a few years back. He would use multiple actors for 'I'm Not There', six in fact - to portray the iconic figure. And what an inspired decision it is. The unrecognisable and slender form of Cate Blanchett steals the show, melting into her eye-rubbing, nose-twitching, lip-conscious take that is only too quick to lash those in proximity with a witful tongue. Almost as idiosyncratic is Ben Whishaw's sarcasm-laced drawling poet Dylan. Who prompts guffaws when tiresomely declaring his name as \"R-I-M-B-A-U-D\" to an arresting police officer. The eccentric duo are displayed primarily in overexposed black and white, and complementing this in Technicolor are the equally impressive Christian Bale and Heath Ledger. Whom fall upon the unwashed, shaded rocker Dylan with equally strong performances. To complete the musical sextuplets are Richard Gere and the delightful Marcus Carl Franklin, these two are the tall-tale Dylans. A jaded western cowboy and a blues-singing black child respectively, both adding another more fictional dimension to the character. They are almost opposite ends of the Dylan-spectrum, and are introduced at the opening and closing of the film to further embolden this point. Franklin in particular impresses, tugging at the humor strings again with his dry recollections of a life on the musical road.<br><br>The host of supporting actors/actresses in 'I'm Not There' do well to further the films themes. With Charlotte Gainsbourg and Julianne Moore taking up the posts of drama and documentary accordingly. Each plays one of the two most important women in Dylan's life, with Gainsbourg (Sara Lownds) cooking up a memorable on-screen chemistry - or lack thereof - with Ledger's character. She is instantly attractive across a smoky diner, yet this attraction soon wanes as romance stagnates. Never-ending tours take their toll and the once exciteful, scooter-riding relationship crumbles. Moore's character (Joan Baez) is more reflective, playing her whole part as if interviewed enthusiastically many years on. My only problem is with the later segments of 'I'm Not There'. Particularly those featuring the bearded and bespectacled Richard Gere. Many know the story of Pat Garrett and Billy the Kid, and this part is essential when regarding the plot. My qualm is that it feels almost tacked on as an afterthought, trotting outside the clear themed borders that the film has laid out so meticulously. This only adds to the ballooning length of the film, and so did begin to drag during these Wild-western plot points. That said, this hardly takes away from an experience that is both visceral and enlightening. Comedic and pensive. Wild and tender. A life, in all possible senses of the word.<br><br>9/10","user":"JediMoonShyne2","rank":[150,194]}]