[{"title":"A waste of time","rating":1,"date":"25 June 2005","review":"Despite all the nice things that people have to say about this film, the \"plot twist\" in it makes it an utter waste of time.<br><br>Spoilers follow, although I doubt I can spoil the movie any more than the director already did. Although I doubt it makes a difference because my complaint has to do broadly with the plot of this film, my review is based off the US theatrical release.<br><br>It starts off as a fairly standard chainsaw massacre type of flick, which to be completely honest, has never been my favorite genre, and ends as something I didn't think existed: a slasher flick with a plot so awful that it loses any value it may have had as a simple gore fest. It turns out that the main character has multiple personalities and is also the killer, or something to that effect. It's very hard to say exactly what happened in the movie because after that revelation, it is obvious that 99% of the movie must be dismissed as nonsensical.<br><br>If this trite twist is done in a clever way, it can make piecing together the plot preceding the revelation an interesting endeavor, but this movie didn't bother with being clever. The main character would have to be in two different places at the same time in the film so many times that there is no point in trying to put it all together. There is a car chase with vehicles driven by different aspects of the personality; one aspect rides to a remote house with her friend, the other drives a souped up murder wagon there. Obvious holes such as one personality getting an injury which persists through the remainder of the film in a car wreck which wouldn't have happened if she were actually in the other unwrecked vehicle the whole time, plague this film.<br><br>This is laziest attempt of a director springing a twist on the audience that I have seen. Picture some dimwit introducing their self to you as Chuck, having a conversation with you, then proudly revealing their name is actually Aja and that they really outsmarted you. Yeah, quite a zinger there, Aja. When the rest of a movie becomes completely nonsensical due to the addition of a plot twist, perhaps that twist could have been left out. <br><br>The film looks as though they decided to appeal to the psychological thriller market ( a genre where this sort of stunt is painfully common) so they filmed an extra scene or two and tossed it in to let the audience sort it out. It's obvious the director didn't try.<br><br>In the end, nothing fits together. The events as depicted in the movie obviously didn't happen the way they were shown to the audience. What did happen? Did anything actually happen or was it a psychopath's delusion? What was the point? A film that leaves itself open to interpretation is not a bad thing in itself, but in this case the audience has nothing to interpret because they are given nothing to work with and there is little incentive to bother.","user":"druid3","rank":[176,272]},{"title":"A very stylish, tense film, truly a suspense-thriller-horror","rating":9,"date":"3 May 2005","review":"Oh my god. Without a doubt I have not been affected by a movie this much since watching the original Texas Chainsaw Massacre when I was well under age and the movie was certainly more than dodgy. I couldn't sleep after watching that and was very uneasy, multiplied a gazillion times by the imagination of a kid. This certainly had a similar affect on me, it scared me and horrified me, it even surprised me more than any other movie has of late.<br><br>If you have any preconception about foreign cinema being weaker to Hollywood then you have hardly spent enough time watching foreign cinema and too much time engrossed in poor romantic flicks with Clooney et al. You really need to get out and grab some of that Japanese, Spanish and French cinema action. It's easily had and there's a lot to it, far better movies...anyway, I find myself digressing again.<br><br>From the outset this movie pitches itself as a hard horror, it isn't going to pull any punches and it's going to show you like it is, harrowing and horrific. That said, the story then turns to a slower pace and you find that it's mixing the suspenseful thriller in with the moments of full on horror, and it's done so well. Too well in fact, and watching the psychotic at work is sometimes shocking.<br><br>It rides a fine line between schlock horror and suspense horror, it manages to combine the two without falling into a complete gore flick. It is gory mind you, very gory. I was eating a couple of biscuits during the movie and I stopped until it was finished, even then I wasn't sure.<br><br>That's where this movies strength lies, it really pushes the boundaries of between those two types of movies but keeps its feet firmly in the suspense, and tension area. The film is exceedingly tense, and it's raised slowly to begin with, but creeps up at every set piece, and it's not long before the shocking and surprising final set piece is upon you. That in itself is terrifying, and as it unfolded on me I was stunned.<br><br>Part of me thinks that this movie could have done much better without all the horror, but I'm not sure that the film would have carried on the tension and suspense alone, it's the very presence of the horror that adds to and heightens the pressure.<br><br>A very stylish, tense film, truly a suspense-thriller-horror to be proud of from the French. Please Hollywood, don't remake it.","user":"Rich B","rank":[142,221]},{"title":"Hearts will bleed...","rating":8,"date":"22 June 2005","review":"...and so will faces, slashed throats, dismembered hands, decapitated heads, backs, arms, feet, stomachs, chests... In fact, just about everything that can bleed does bleed in this movie, and does so copiously.<br><br>High Tension, aka Switchblade Romance (much better title) is the best horror movie I've seen come out in theaters in years. After so many times hearing \"this is the movie horror fans have been waiting for\" and then being horribly disappointed by Cabin Fever, The Ring, Malevolence, Darkness, The Grudge, and every single other one, I am throwing my full weight behind this one. Switchblade Romance is the movie real horror movie fans have been waiting for. It's a bloody, merciless, no-humor and no-holds-barred homage to the classic slasher pics of the 70s, and yet it surpasses almost every movie it draws its inspiration from. We get an unstoppable but definitely human killer, far more interesting than, say, Jason or what Michael Myers has now become because of his obviously being human and because he makes some undeniably smart decisions and operates in a continuously logical, inescapable way. The arsenal on display is impressive, as it should be in any decent slasher movie. We get the basic straight razor, the butcher knife, shotgun, axe, and, in an incredible and deliciously violent nod to Texas Chainsaw Massacre, the power buzzsaw.<br><br>Every aspect of this film is in place. The plot is simple and straightforward, the acting, even dubbed, is interesting (and despite complaints of why only parts of it were dubbed, if you watch closely and pay attention to who speaks French and who is dubbed, it actually makes perfect sense and fits with the movie), the cinematography is strangely artistic, almost gialli-like, the bloodletting stylish and gruesome, the sound design incredible, the tension almost unwavering. The initial horror set piece, the arrival of the killer and the slaughter in the house, is bound to become a well-remembered and oft referenced classic scene of horror. The sheer brutality and stark reality of it ranks it up there, in my mind, with the gut wrenching finale of \"Odishon.\" A quick word on the performances. There's minimal dialogue, but what there is is at least two steps up from most horror films. Its meant to build character, whereas most slasher flick dialogue is there just to drive the plot. Here, we care about the characters, even those who don't get much of a chance to talk, because the situation is so much more real than your average flick and so is the acting. Cecile de France's physical performance is stunning, the fear on her face, the tension in every limb, the breath rate, the pain, everything, and the sheer madness that Maiwenn's character endures is perfectly conveyed by the utter despair she is able to convey even with a gag in her mouth most of the time.<br><br>An, of course, a quick word on the ending. Quit complaining! The ending of this movie is great, not only does it take an extremely well made but somewhat shallow gore pic to a whole new level with some interesting things to say about... well, I won't say on account of not spoiling it, but yes, it actually does make sense if you've watched the movie carefully and have enough intellect to think about it on your own rather than just taking at face value what you've seen. I halfway wonder if the twist wasn't in part a snobby French joke Aja decided to play to see if we lulled, summer blockbuster-fed Americans could figure it out and realize that everything works without being spoon-fed exactly how it works.<br><br>8 / 10 - which makes it twice as good as the next best horror movie to come out in theatres in a decade. The only thing that keeps it from attaining a perfect 10 is that, although the tension is cranked up high for most of it and the scares are a thing that will haunt you more after walking out of the movie than when you're watching, the suspense does kind of flag unexpectedly in a few key places. Still, given the other 80% of the movie is extremely suspenseful and effectively brutal, this is a small flaw. If you like horror movies, GO SEE IT.","user":"RainWeirdo","rank":[107,168]}]