[{"title":"Bloody Brilliant! Literally!","rating":10,"date":"5 June 2004","review":"\"Shaun of the Dead\" is not only the best zombie flick I've seen in a long time, it is simply the best film I've seen in a long time, PERIOD! Clever, witty, sweet and nasty and, at times, gory and horrific, SOTD has it all. Of course, I didn't think I could go very far wrong with a film that George Romero himself said he enjoyed.<br><br>Shaun (Simon Pegg) isn't having a very good week. His co-workers have no respect for him, his uptight stepfather is on his back and his beloved girlfriend Liz has had enough of his laziness and inconsideration. Really, Shaun isn't such a bad guy, but he has no ambition and seems to prefer the company of his unemployed, flatulent, video-game obsessed slob of a flatmate Ed to anyone else. And as if this were not enough, the dead have risen and are walking the earth in search of human flesh to feast upon. Shaun doesn't notice this fact as quick as he should, but Shaun is somewhat of a zombie himself, lost in his own world and distracted by his own thoughts as he strolls right past the rotting cadavers that now fill the streets of Britain. Not even news flashes can get through to Shaun, as (in an incredibly hysterical scene) he channel surfs rapidly, every station finishing the sentence of the one before and giving everyone but the oblivious Shaun the grim news of what is happening in the world. When Shaun and Ed finally do realize what is happening, it quickly becomes a race against time: save Shaun's mum, rescue Liz and go to the pub where they can wait out the zombie infestation with a pint and a smoke. <br><br>Of course, not everything goes as smoothly as planned. There's undead flatmates to deal with, \"bitey\" zombies along the way, petty arguments between friends and Ed's cell phone going off at inopportune moments. But Shaun, armed with a cricket bat, is determined to save the woman he loves and nothing is going to get in his way!<br><br>This film should be seen side by side with Romero's \"Dawn of the Dead\" as both films cleverly and sarcastically comment on our zombified society and virtually show no difference between the living and the living dead. There's not much gore here, but there is one very unexpected and Savini-worthy moment in \"Shaun\" when the zombies rip a living man to shreds, yanking out intestines and tearing off limbs. I really hadn't seen such a gory scene coming and was too stunned to look away. It's truly graphic and nauseating...and, though I usually hate gore, very well done. For a low budget film, the zombies are pretty menacing looking and there are some genuinely scary moments to be found in \"Shaun.\" There's also several touching scenes between Shaun and his mum and dad...sorry, I mean stepdad. Shaun himself is forced to grow up and take charge as the zombies close in around them. <br><br>I don't want to give away the incredible ending of \"Shaun\" except to say that the living dead are not immune from pop-culture commercialization, and though loved ones may die, video games are forever. <br><br>SEE THIS FILM!!! You do NOT have to be a fan of horror movies to appreciate the sublime satire that is \"Shaun of the Dead.\" I haven't seen a movie this good for a very long time. 10 stars.","user":"Gafke","rank":[280,336]},{"title":"Instant cult status.","rating":10,"date":"17 April 2004","review":"Shaun of the Dead is quite a surprising and brilliant piece of work which I suspect will achieve the accolade of instant cult status as word of mouth snowballs this film to richly deserved recognition.<br><br>Simon Pegg, both the joint writer and the main star of the film, has been a comedic force for some time, most notably in the fantastic BBC2 series 'Hippies' (which inexplicably bombed in the ratings) and the cult Channel 4 series 'Spaced'.  Both programs hinted at Pegg's saliently dead pan comedic manner (and writing skills) which comes to full fruition in 'Shaun of the Dead'.<br><br>In a nut shell, this film is a romantic comedy with zombies (or zom-rom-com) who appear for no good clear reason (although some tantalizing clues are offered).  The film is an amazing blend of the funny, the violent and the poignant.<br><br>Pegg has cast himself as one hell of a serious loser in this film.  And not in the 'American' form of: 'I am a loser but I work in TV and have Jennifer Aniston as my wife'  kind of loser as portrayed in tripe such as 'Bruce Almighty' or dozens of other US 'loser' films.  Pegg's Shaun is a genuine loser and extremely recognisable too, he's an everyday man who works for an electrical retailer and his life is just plain dull and disappointing - and this is where all the comedy comes from in this film.  There are two scenes in the film which seem to summarise this (and also shine a light of Simon Pegg as a very clever and funny writer) and both scenes simply involve Shaun walking to the nearby corner shop.  The first time Shaun plods semi-comatose to the store we simply get the feeling that he is a loser.  However, by the time the film shows him making the same journey again we realise that there is a lot more going on!  The scene is played with such exquisite subtleness that it has to be one of the funniest scenes I have ever seen in any film! Not that this film is subtle however, there is a stunning array of visual comedy, one liners and (best of all) some digs at other films from the horror genre. The funniest being a very subtle snipe at Boyles `28 days later' - see if you can spot it!<br><br>The only problem with reviewing this film is that there are so many funny moments in it that it is hard to pick any to write about without spoiling the film.  All I can say is that I cannot remember a film ever being this consistently funny with probably five or six serious laugh-out-loud moments. It was a joy to watch and my only disappointment is that I can never watch this film for the first time ever again - every viewing will forever be a repeat viewing.<br><br>Shaun of the Dead is not very everyone though - the language from the beginning is strong and the violence was quite surprising for a 15 certificate film (in the UK). This film is definitely going to be most appreciated by horror fans who know a huge back catalogue of horror films. It will also be enjoyed by teenagers (who filled the cinema when I viewed this film which was terrific, as they laughed loudest).  Finally, I do have some criticism of this film and that is there is some wasted talent in the movie.  Black Book's (channel four) star Dylan Moran seemed a bit wasted and so was Martin Freeman (from BBC2's The Office) - who would have made a terrific zombie!  Also, did I spot Matt Lucas (from BBC3's 'Little Britain') in this film? I am not sure as I was laughing too hard maybe!<br><br>\nThese problems however are so minor and can easily be forgiven.  My suggestion is to go and slowly shuffle down to your local cinema to see this film and give Simon Pegg the money and recognition he deserves so that he can go on and make more films that are this good including what the UK papers have suggested as his next project - `From Dusk 'Till Shaun'.","user":"Damian_Piesse","rank":[345,438]},{"title":"You'll laugh till it hurts!","rating":16,"date":"16 April 2004","review":"Shaun Of The Dead isn't your typical zombie movie. In fact, the zombies don't truly enter the story until almost a third of the way in. So what's it really about? A man named Shaun, played by Simon Pegg, who lives in London and is a bit of a loser. He works in a dead-end job at an electronic goods store and spends most of his spare time at the local pub or playing video games with his unemployed roomate, Ed. One day Shaun's girlfriend, Liz, decides she's had enough of his lazy attitude and decides to leave him. When the city suddenly gets taken over by the living dead Shaun finds the perfect opportunity to prove himself to Liz, so he sets out to save the day, win his girlfriend back and keep his mum, Barbara, from being eaten by his step-dad who's slowly turning into a zombie.<br><br>Don't let the title and premise fool you, this isn't a simple spoof of Dawn Of The Dead, it's more a romantic comedy that just so happens to be littered with the undead. The film is also very clever, with a clear social commentary running throughout. The jokes that stem from this are absolutely hilarious but will probably be lost on any non-Londoners. It's actually quite unlikely that this film will translate to anyone outside the UK and this is a real shame and perhaps the films biggest flaw. But if you do get it, then good for you, because there is a lot of great stuff to be seen here. The script is wonderful and throws up many comedic moments, such as when Shaun and Ed are looking through Shaun's LP collection for a suitable vinyl to throw at two oncoming zombies, \"Dire Straits?\" \"Chuck it!\", or when Shaun and his friends beat up an elderly zombie in the pub using cricket bats, all to the rhythm of Don't Stop Me Now by Queen. The humour comes thick and fast, never have I laughed so consistantly during any film before, it only pauses briefly for a few dramatic scenes, all of which work surprisingly well. In fact the film tends to genre-hop quite a lot, and while some find this unappealing I think it works in its favour. One minute it's a comedy, then it's a drama and then it's a full blown horror. In fact some scenes are quite jumpy and certainly violent. One extremely gory part in particular is a clear homage to another famous horror film that shall remain unamed, but if you know what I'm talking about when you see it then good for you. That's the thing about this movie though, you don't need to be a horror fan to enjoy it. You just need to have the right sense of humour. Can I explain it? Well, no. You'll just know if the film's for you when you see it. I can assure you that most will like it. If you don't, then I really am sorry for you as this is about the most fun I have had in the cinema since Kill Bill . Ok, that wasn't long ago, but before that I don't think there was a film that was so rip-roaringly funny and then unashamedly brutal at the same time. There is nothing subtle about this movie, and yet it will simply go over the heads of most people. I urge you to watch the film and decide for yourself if you love it or hate it. It's not without its faults though, losing its spark slightly during the third act but it comes back with a vengence and gets in some really good jokes just before the credits roll.<br><br>Shaun Of The Dead is a great film. It's funny, it's clever and it's got zombies in it! Just when the British film industry appears to be dead this gem pops up and shows us what someone with a sense of humour and a real passion for the media can achieve. Go watch it, you'll laugh till it hurts!","user":"erolsab","rank":[242,307]}]