[{"title":"An extremely moving, touching, thought-provoking movie","rating":9,"date":"7 November 2004","review":"Leland Fitzgerald (Ryan Gosling) is sent to jail for the murder of an autistic kid. When pressured with the question 'Why?' he doesn't have an answer. While in jail he meets Pearl (Don Cheadle), his teacher, who decides to take matters into his own hands and helps Leland figure out why he did it. Throughout this film we learn all about Leland's troubled life, including his ex-girlfriend Becky(Jena Malone), his famous father Albert(Kevin Spacey)and his whole sad life. <br><br>This film is Matthew Ryan Hoge's second movie, and it is spectacular in nearly everyway. This is one movie which will leave you thinking in the end, and wondering about how it all works. The movie is quite dark, but if you can handle that then you will realize just how good a film it is.<br><br>In this movie, there is no bad guy. There is no one you can blame for anything that happens. There's no stereotyping, and the audience does not try to prove Leland guilty. Instead, we sit back, relax, and watch this boy's life unfold throughout the corse of the movie. All the problems depicted in the story are very real. Drug addiction, parental expectations, overwhelming sadness; they all exist in our world.<br><br>Ryan Gosling gives one of the greatest performances of his career in this movie, as the depressed teenager Leland. His father lives in Europe and doesn't really care much about his son. The only person he loves is Becky, but she has problems of her own. He knows exactly what he did, but as he says in the film, 'You want a why, but maybe there isn't one. Maybe this is something that just happened.' There is a why, but we don't find out about it until the end. As you watch the movie, the audience finds themselves amazed that such a young person could know so much about the world. Leland notices things that people tend to ignore. <br><br>A particular thought-provoking scene which really affected me was during one of Leland's conversations with Pearl. Pearl just cheated on his wife and when Leland asks why, Pearl replies that he's only human. Then Leland says something which never really occurs to anyone: \"Why do people only say that when they've done something wrong?\"<br><br>Another fantastic acting job was provided by Chris Klein. In the film he plays Allen Harris, the boyfriend of Becky's sister Julie (Michelle Williams). Although he is not one of the main characters, I found myself amazed at how deep his character was. You can relate to Allen a lot. You know how much he cares for the Pollard family. It's as if they were his own flesh and blood. By the end of the movie, you realize just how far he would go to help them. <br><br>Overall, this movie is a masterpiece which has been overlooked by quite a few people. If, however, you take the time to watch it, you will most likely see that everything I've mentioned above is true. And once you're finished watching it, you'll never look at the world the same way again.<br><br>9.5/10","user":"Macadamian-Nut","rank":[83,96]},{"title":"The critics failed to grasp the meaning of this one","rating":10,"date":"2 January 2007","review":"I was looking at the external reviews (Ebert, etc.) for this film and they were all pretty much negative. However, after reading many of them, I noticed that they all made the same point. Critics were upset that the film centers around what appears to be a senseless murder of an autistic child. Certainly, this is a disturbing image. Critics like Ebert want a traditional detective story that uncovers why the killing happened and squarely places blame on the guilty. They want blame to be cast and resolved. Well, that status-quo theme is kind of what the movie is parodying. Just like society, the critics wanted a very quick resolution so they could move on to their next tragic opera. Perhaps there is no simple question to be answered here? There is a whole lot more to what happened then what is on the surface. The film does not seek to rationalize what happens, but rather understand the why. What also steams me so much about these inane reviews is that all they look at in the way of performances is Spacey and Cheadle, who were both great (and generally are). But there are other great performances at work here other than just the two current icons of Hollywood. Gosling gives an incredible performance that really only somebody of his extreme talent could deliver. Somehow, Gosling is able to make the killer of an autistic child sympathetic. This irritates many, I am sure. However, if one watches the film, they see what Leeland's motivation is, it is wrong, but it is not evil. Malone is also on top of her game as yet another confused young character. Basically, the killing of the child in this film is not the main theme of the movie. The main theme is life itself and how people go about dealing with it, the highs and lows, and how they attempt to sometimes help others deal with their lives (which does not seem to work out very well). There is a lot of good and bad in this world and how we handle each has direct impact on how much more good and bad will take place, and sometimes a confused attempt at doing good, can lead to a whole bunch more of bad. I think this is one of the more memorable films in sometime and has an ending that is as touching as anything in recent movie history. I strongly believe people should view this film, with an open mind.","user":"Tecun_Uman","rank":[81,98]},{"title":"Inspiring movie...","rating":8,"date":"24 July 2005","review":"Don't let any reviews (critics, IMDb users or mine) influence you seeing this movie. I read only the plot premise and became intrigued. After watching, this movie, in my opinion, is definitely worth seeing. It gives a perspective on life that many have probably not contemplated. Its is not however, as Leland himself says, a movie that \"can be wrapped up in a neat package with a bow and everything.\" Other user reviews on this website claim to have a psychological background and imply that the story is not feasible. Quite obviously they missed the entire point of the movie, which is disappointing. to say the least.<br><br>In short, it is a well acted, well directed movie. The story is not a feel good one, but I feel if you don't come away from the movie feeling good, you may just have missed something. To characterize it as \"art house\" is unfair, in my opinion, but as our society likes labels, this is probably the one that fits. If you find you know everything there is to know about the world... I'd suggest skipping this one. If you feel movies should be a form of escape \"from the world\"... you won't find it here. But if you do watch it... you just might find something in yourself.","user":"Gunz-2","rank":[66,85]}]