[{"title":"Meet me in Montauk...","rating":10,"date":"26 March 2004","review":"How happy is the blameless vestal's lot! The world forgetting, by the world forgot. Eternal sunshine of the spotless mind! Each pray'r accepted, and each wish resign'd. -- Alexander Pope<br><br>==&gt; I confess to being an idealist and a romantic. This type of film appeals to people like me... the ones who believe in love at first sight, soul mates, destiny, yada yada yada. The Charlie Kaufman penned 'Eternal Sunshine of the Spotless Mind' is as fresh and original as some of his other screenplays (Being John Malkovich, Human Nature, Adaptation), but adds a romantic depth that makes this one of the most complete film going experiences I have ever had.<br><br>There was an exchange during the film between our two leads, Joel and Clementine, played with poignancy and nuance by Jim Carrey and Kate Winslet, that echoed what I was feeling about the film.<br><br>Clementine: This is it Joel. It's going to be gone soon.<br><br>Joel: I know.<br><br>Clementine: What do we do?<br><br>Joel: Enjoy it.<br><br>Luckily for me, I knew I was going to be able to revisit the film many times in my life. The depth of the film manifests itself in the fact that the soul mates, Joel and Clem, both know that their time is running out and that they will never be able to meet again.<br><br>Most films might choose to highlight this type of heartbreak with the death of a loved one or a bittersweet farewell at a train station. But not Charlie Kaufman. He is bored by clichés. Rather, he chooses to dazzle us with the complexities of the human mind and all of its glorious possibilities. He is a master storyteller that is unlike any other I am aware of.<br><br>Joel (Carrey) is socially inept. He has had girlfriends, but none that really meant anything. It is as if he has never had a significant relationship of any kind. But, one day, he meets Clementine. \"Don't make any jokes about my name\", she warns him. She is wild and kooky, changing her hair color from red to orange to blue to green depending on her current mood. She seems the polar opposite of Joel, but they click. They click in ways even they can't pinpoint. But from the moment they meet, they know there is something special there.<br><br>However, after a silly argument breaks up their relationship, Clementine decides to visit Lacuna Inc., a company that specializes in wiping troubling memories away forever. She has decided to erase the memory of Joel. When Joel hears this from some friends, he angrily decides to do the same to Clementine, erasing her completely from his mind.<br><br>The erasing process involves a mapping of the memories and an all night process of erasure that is \"technically brain damage\", according to the doctor. The bulk of the film takes place during the process, inside Joel's mind. The most recent memories are first to go and we watch as they slowly disappear into nothingness. Those recent memories are bitter as we witness the arguments and the boredom of their relationship. But as the time rewinds, the memories get better. We travel backwards and watch Joel and Clem during their best moments, loving life and loving each other. As this happens, Joel desperately regrets his decision. He wants the inevitable erasure to stop, but he is completely powerless. Soon she will be gone and he won't even remember that he forgot her. The film focuses on his attempts to foil the process and retain some of her in the recesses of his mind.<br><br>'Eternal Sunshine' is directed by Michel Gondry who also helmed 'Human Nature'. He has a flare that accompanies Kaufman's words with perfect symmetry. This film bounces around on its timeline almost hysterically, but the director never lets us get lost. We always feel in control of our senses and our emotions. It is a tribute to Carrey and Winslet that they were able to do the same.<br><br>Jim Carrey has pulled off a rather remarkable transformation that I would have deemed impossible a decade ago. He is becoming a brilliant actor with qualities that resemble Jimmy Stewart and Tom Hanks. He is a fabulous everyman who is sympathetic and knowing, interesting and kind. He deserves tremendous praise for this role. Kate Winslet is consistently brilliant in every film. She is easily one of the very best actresses we have. Here she plays against type, and embodies a fascinating woman who craves attention but needs intimacy. Hers is a beautiful performance that will go overlooked. It is easy to understand why Joel falls in love with Clementine.<br><br>I think fans of Charlie Kaufman will be thrilled with this brilliant entry in to his collection. I think the film will appeal to those who loved the recent masterpiece 'Lost in Translation' or Tom Tykwer's recent beauty, 'Heaven'. It is a romantic fantasy with real emotions and real characters that will resonate with the viewer who isn't entirely closed to sentiment. When Clementine whispers \"Meet me in Montauk\" into Joel's ear... it's hard to hold back a tear.<br><br>This will easily be one of the best films of 2004. It is the antithesis of the typical romantic Hollywood fare. I loved every minute of its refreshing originality. The film has passion and flare and brilliant wit, all framed by an intelligent script that deals in absurdity while managing to maintain an intimate realism. These characters feel real. You root for them. You want them to meet again and give it another chance. It is a film that will only get better over time, as our memory of it waxes and wanes its way into our hearts.<br><br>TC CANDLER","user":"tccandler","rank":[925,1]},{"title":"\"Eternal Sunshine of the Spotless Mind\" is a bizarre but wonderful movie, a very strange and remarkably tender experience.","rating":10,"date":"2 June 2004","review":"\"How happy is the blameless vestal's lot! The world forgetting, by the world forgot. Eternal sunshine of the spotless mind! Each pray'r accepted, and each wish resign'd.\" - Alexander Pope<br><br>Michel Gondry's \"Eternal Sunshine of the Spotless Mind\" is a bizarre but wonderful movie, a very strange and remarkably tender experience, which I suppose is only to be expected from screenwriter Charlie Kaufman, the man behind \"Being John Malkovich.\"<br><br>The film was produced by Focus Features (\"Lost in Translation,\" \"21 Grams\"), a company which strives to offer original, quality films to the true cinema lovers. If the company keeps producing films this good, they may become hugely successful in the future, if not already.<br><br>The previews portrayed the movie as a bouncy, cheery comedy in the vein of \"Adaptation,\" the last film written for the big screen by Charlie Kaufman, when it is really a tender movie about love and romance. This is Jim Carrey's best performance to date, and may open the eyes of his prejudiced haters who have only imagined him as Ace Ventura and a certain cable guy for his entire career. No snippy quotes, outrageous humor or bizarre antics in \"Sunshine\" -- Carrey plays a true, realistic, three-dimensional character named Joel Barrish, who plans to have memories of his girlfriend, Clementine (Kate Winslet), erased by a new company called Lacuna, after he discovers that she herself has had the procedure performed only a week before. Joel meets with the company's founder, Dr. Howard Mierzwiak (Tom Wilkinson), and is informed that the procedure -- although \"technically\" brain damage -- is on par with a heavy night of drinking. \"Nothing you'll miss much,\" he is told, as he plunges into a bizarre world of long forgotten memories.<br><br>The entire process of the operation is quite fascinating, really, if a bit reminiscent of an idea founded by none other than one of Kaufman's favorite writers, Philip K. Dick, who wrote the source short story for the Ah-nuld movie \"Total Recall.\" All items relating to the person you want erased from your brain are assembled together, and the technicians at Lacuna (Mark Ruffalo and Elijah Wood) then \"map\" an outline of your memories, which are supposedly stemmed together. I have my doubts about the seriousness and remote possibility of such a procedure being performed, and the explanation is quite simply utter bull, but we don't care because the entire erasing of Joel's memories serves as a backdrop for a deeper meaning: If you could forget about past romances, would you really want to? And if so, would you be willing to sacrifice all the good ones, along with the bad ones?<br><br>The conclusion that \"Sunshine\" arrives at is, to be totally truthful, as honest as can be. During the procedure, Joel's subconscious realizes that it doesn't want to let go of its memories of Clementine, and so begins a strange labyrinth of fragmented memories, constantly changing surroundings, and mental materializations of Clementine. The movie is like a very bizarre dream, when you're trying to interact with people, but they're not responding, and you shout and try to get their attention but they don't seem to notice. Joel's entire odyssey of the interior of his mind makes \"Being John Malkovich\" look normal -- but as I didn't like \"Malkovich\" very much, and thought its strangeness was unjustified, it fits perfectly in \"Sunshine\" -- there are some great special effects, such as when Joel is wandering through his own memories, drifting in and out of sleep, hearing the voices of the technicians erasing his memories and watching as objects and areas around him vanish and deconstruct. It's so bizarre but yet also so beautiful. Gondry was a former music video director (his complete works are available on DVD) and he is the perfect candidate for this project, having worked with Kaufman before on the 2001 flop \"Human Nature.\" It seems that he has finally found a unique directing style that ties in perfectly with the underlying themes of the movie.<br><br>There is a very deep message in \"Sunshine,\" and it is arguably Kaufman's deepest film to date. Love and romance and memories of both have rarely been examined as thought-provokingly and tenderly as they are in this wonderful motion picture. The movie has a very profound message that all viewers should pay attention to. There are many small intricacies in the film, surely picked up on more thoroughly on repeat viewings, and the entire construction of the movie is completely enthralling and intelligent. I saw two people leave the rather empty theater during the screening I attended. It tanked in the US and I predict it will do the same in the UK, which is a shame, because this is the smartest film of 2004 and has the most to say about our lives than any other film this year. While everyone flocks to see the new Denzel Washington action movie, \"Eternal Sunshine of the Spotless Mind\" is forgotten, which is quite depressing -- people would rather spend their money on forgettable entertainment than view something unique that has something important at its core.<br><br>I think what the movie finally asks us after its long, emotional journey, is would we want our own memories erased? And if so, what would the consequences be? A lesser film might examine this idea poorly -- \"Sunshine\" is not. It is perfect in almost every conceivable way, and anyone who complains that it is not original must be joking -- in my entire lifetime, this is one of the most unique film experiences I have ever had.<br><br>\"Eternal Sunshine of the Spotless Mind\" is a beautiful movie, eloquently voiced by Gondry, firmly constructed and rooted in an eerie nightmarish fantasy land where anything is possible. It's beautiful, it's bizarre, it's exceptional, it's funny, it's lovely, it's touching, it's witty, and it's one of the best movies I have ever seen.","user":"MovieAddict2016","rank":[798,927]},{"title":"Interior Landscape","rating":22,"date":"22 March 2004","review":"Of all Kaufman's screenplays that delve into the interior landscapes of its characters, Eternal Sunshine is the most fully formed and moving story of the bunch, a rumination on the possibilities and consequences inherent in making the process of removing unwanted memories from your consciousness as easy as going for a checkup.  Kaufman here plays on our desire to forget the bad things that happen to us and what happens when we are given the power to forget those things permanently, and the conclusion he arrives at is that it ultimately creates as many - if not more - problems than it solves.  At the very least, it can result in making the same mistakes again (\"Those who ignore history are doomed to repeat it\"); at the worst, it eliminates the possibility of our ever reconciling and coming to terms with our life experiences, the way we relate to the people who help to shape our lives and whose lives we shape through ours.<br><br>The film explores these ideas in a novel and engaging way: by taking the audience inside the mind of Joel Barish (Jim Carrey), a man who, after breaking up with his girlfriend Clementine Kruczynski (Kate Winslett), discovers later that she has had her memory of him wiped clean from her mind.  He finds out how she had this procedure done and, despondent not only about the breakup but even more so about her having completely erased him from her mind, searches out the doctor who performed the procedure and signs up to have the same procedure done to him, so that he may also have no memory of her.  He is rendered unconscious for the procedure but his subconscious is still active.   Once the procedure is initiated and he becomes aware that his memories of the woman he loved - and still loves - are vanishing from his brain, he starts having second thoughts and wants the procedure stopped.  His challenge then becomes to figure out how to protect as much of his memory of her as he can, and to find a way stop the procedure despite the fact that he is in an unconscious state.<br><br>The manner in which he comes to realize and confront his dilemma is played out entirely within his interior landscape, a realm which (as anyone who remembers their dreams upon waking from sleep can attest) is a very surreal extension of our day-to-day experiences.  Michel Gondry's visual style and direction works exceptionally well here in conveying the slippery, chaotic unpredictability of the worlds we construct from our memories and experiences; the clever interplay between this interior world and the goings-on of the outside world helps keep the viewer off-balance just enough to illuminate the fuzzy line of demarcation separating the two worlds and the peculiar manner in which they play off one another.<br><br>Jim Carrey and Kate Winslett do an exceptional job of bringing this abstract story concept to life with characters that are endearing, poignant, believable and utterly human.  The supporting players are equally impressive: Tom Wilkinson as the mind-eraser doctor, Mark Ruffalo and Elijah Wood as the technicians, Kiersten Dunst as the receptionist all have relationships to the main protagonists and to one another that come to light as the story unfolds and help to propel the plot; as friends of Joel and Clementine, David Cross and Jane Adams are hilarious as a couple who seem to be stuck in the same rut that compelled the protagonists to break up and have each other erased from their respective minds.  Kaufman juggles all these relationships masterfully and in such a way as to ensure none of them are superfluous to the ideas he is trying to get across in this story.<br><br>While there are elements of the plot that seem to place this movie in the realm of science fiction, the focus of the movie stays on the interior states, emotions and relationships between the characters.  As such, the film is more of a romantic comedy than anything - albeit unlike any other romantic comedy you're ever likely to see.  I saw a late showing of this movie with my girlfriend the day it was released at a local multiplex and there were only 20 or so people in the theater, yet at the film's conclusion everyone broke out in a spontaneous round of applause.  This gives an idea of how compelling this movie can be.  If you give this film a chance to creep under your skin, you will likely find yourself reflexively thinking about your feelings toward the important people in your life, as well how you relate to those feelings, as well as your memories and how you relate to them.  A thought provoking, moving and entertaining film - I can imagine that a working title of this film might have been \"Warts And All.\"","user":"doctec","rank":[266,313]}]