[{"title":"Extremely Funny","rating":8,"date":"12 September 2004","review":"Steve Tobias (Michael Douglas) is an undercover and efficient CIA agent, supported by the lower-ranked CIA agent Angela Harris (Robin Tunney), and assigned in a dangerous and secret international mission. He is trying to retrieve a nuclear submarine and arrest some international drug dealers and smugglers. Steve is also a reckless and absent father. His son Mark (Ryan Reynolds) is a lawyer, who is going to get married with Melissa Peyser (Lindsay Sloane), the daughter of the housewife Katherine Peyser (Maria Ricossa) and Jerry Peyser (Albert Brooks), a conservative podiatrist of Chicago. Jerry is the opposite of Steve, being afraid of airplanes and living a routinely life. When the two families meet for a dinner in a Vietnamese restaurant to celebrate the forthcoming wedding, Jerry is mistakenly identified as a secret agent, turning his life upside-down. I found this movie extremely funny. The combination of Michael Douglas and Albert Brooks was amazingly (and even surprisingly) good. The performance of David Suchet, as the gay French drug dealer and criminal Jean-Pierre Thibodoux, is also excellent and very funny. KC and the Sunshine Band playing an old hit is also great and completes a highly recommended comedy. My vote is eight.<br><br>Title (Brazil): 'Até Que os Parentes Nos Separem' ('Until the Relatives Get Us Apart')","user":"claudio_carvalho","rank":[26,35]},{"title":"Modest script but Suchet, Brooks and Douglas are funny","rating":22,"date":"22 February 2009","review":"'The In-Laws' has a mediocre script but the actors successfully elevate the material. Albert Brooks in particular is very good as a neurotic podiatrist. Michael Douglas gives an energetic performance and the two work work well off each other. There are some consistent laughs throughout the film. David Suchet is fine as (MINOR SPOILERS) the gay international arms smuggler who falls in love with Brooks. The script is a gentle spoof of spy films and works well as long as you ignore the various plot holes. Douglas's family is shortchanged by the script, his relation with his estranged wife specially feels incomplete. Still watchable.<br><br>Overall 7/10","user":"long-ford","rank":[8,9]},{"title":"A new \"odd couple\" is born with a new spy-film twist.","rating":8,"date":"15 May 2003","review":"A new \"odd couple\" is born with a new spy-film twist.<br><br>Michael Douglas is Stephen Tobias, a rugged deep-cover CIA agent, who focuses more on his work that his life with his son, Mark (Ryan Reynolds) or his now ex-wife, Judy (Candice Bergen).<br><br>It turns out that Mark is about to get married to beautiful Melissa (Lindsay Sloane) but has yet to meet Mark's parents. Mark assures her that is a good thing. But Melissa's parents, Jerry (Albert Brooks) and Katherine (Maria Ricossa) insist on meeting at least Mark's father.<br><br>During the first meeting between Mark's father and Melissa's parents, mild-mannered foot-doctor Jerry stumbles in on one of Stephen's spy plans and finds himself swept up in Stephen's mess on the eve of his daughter's nuptials. How will this revelation effect the up-coming marriage and will the two fathers live long enough to get back to the wedding?<br><br>\"The In-Laws\" is one of the biggest surprises I have seen this year. I never thought in a million years that this film would be as funny as it is. The odd pairing of Brooks and Douglas pays off tenfold. Their odd pairing and hilarious antics made me think some of the classic film, \"The Odd Couple\". The film also reminded me a little of the 80s comedy, \"Real Men\" because of its off-beat way of bringing the audience into the story.<br><br>Brooks hasn't been this funny in years. His neurotic schtick, which is probably more famous when played by Woody Allen, gives his character such innocence. There were so many priceless moments involving Brooks and how he relates to the spy-world.<br><br>Douglas seems to have journeyed back to his Jack Colton character, which he played in \"Romancing the Stone\". There is definitely some of Colton in Tobias. You can really see it when Douglas allows Tobias to put his guard down. That was always the funniest part of Colton and it is the same for Tobias.<br><br>Another great thing about this film is the caliber of people who are in the cast. You have some great upcoming comedy actors like Reynolds and Sloane and on the other side veterans like Bergen and Brooks. I wanted to see more of Reynolds since he is such a great comedic find. I have high expectations for that guy. I also really enjoyed Sloane when she was in the short-lived WB series, \"Grosse Pointe\". I so miss that series. She to has a great potential to be more if given the chance in comedy.<br><br>This film knows where its strengths are and it continues the laughs over and over. I just wish we could have had more time with the supporting cast.<br><br>The film also has some interesting uses of music in its soundtrack. For instance the opening scenes involving Michael Douglas escaping from one of his spy missions involves a great car chase and a gun battle but the whole scene's overture is accented by Paul McCartney's infamous James Bond theme, \"Live &amp; Let Die\". It is a great addition as it seems to help build the spy feeling of the scene. Throughout the film there are interesting musical additions, which help put interesting slants and accents on the various scenes.<br><br>\"The In-Laws\" was such a surprise and is by far the funniest movie I have seen this year, thus far. (4 out of 5) So Says the Soothsayer.","user":"Dkish","rank":[28,40]}]