[{"title":"An homage to the old Disney and a hoot for the viewer","rating":9,"date":"16 August 2003","review":"I've been wanting to see this film since the trailers started playing many moons ago. I saw the Jody Foster version when it first came out in 1976 and like that one, the 2003 version is an excellent all ages movie. It reminds me of the great flicks Disney use to release all the time during the 60's and 70's so it was no surprise they reached to the vault to redo \"Freaky Friday\".<br><br>Jamie Lee Curtis has her best comedy role since \"A Fish Called Wanda\". She was having fun with the part and many of the teen mannerisms she did as Annabell were dead on. Curtis is one of the most underrated actors in the world. Just based on her performance \"Freaky Friday\" was a great ride.<br><br>Lindsay Lohan made the movie better with her take on Annabell. I have liked Lohan since \"The Parent Trap\" and if she decides to stay with acting she might go on as long as Jody Foster has in the business. Lohan has one thing that actors like Tom Hanks and Julia Roberts have and that is an expressive face. Acting is so much better when the actor can add to their part through the expressions in their face and Lindsay can do that.<br><br>Watching the movie was a delight for me. I never got the feeling that 35 year old men wrote the script (they didn't) like I do with some of the \"teen\" movies out today.<br><br>The music used by the movie band \"Pink Slip\" was above average and the other soundtrack music fit the film as well.<br><br>Now if they would just do a big budget \"Herbie the Love Bug\" feature, I would be even more happy.","user":"cadfile","rank":[29,30]},{"title":"What, me cry?","rating":9,"date":"16 November 2003","review":"Look . . . I'm mainly into sci-fi, fantasy, action-thriller, and special effects movies (i.e. Matrix, LOTR, Identity, Star Wars, etc.) and generally try to avoid chic flicks and warm-fuzzy feel-good movies.  After watching the current Freaky Friday starring Jamie Lee Curtis and Lindsay Lohan now I understand why.<br><br>See, I'm a guy, and guys don't cry, well, that's what we've been told.  On top of that I'm 48 years old so I'd better have my maturity act together. So, what happened?  Besides laughing my butt off at the truly funny scenes (my wife and I caught a few stares from other movie-goers), I had to strain every muscle in my body to keep from bawling like a, no, it can't be true .. . girl.<br><br>I might have to consult a therapist (Jamie Lee can certainly fill that role anytime) to understand why this movie had such a profound effect on my emotions.  Maybe it's because my parents never really understood me (I certainly understand them now) or maybe it's because I have a couple daughters and I've rarely tried to put myself in their shoes.  This movie accomplished that for me, big time . . . the ultimate exercise in empathy.<br><br>\nThe interaction between mother and daughter was superbly acted and very believable especially with the switched roles.  Moreover, the supporting characters, from the little brother, to the fiancé, to the grandfather, to even the detention monitor at the school were also outstanding and made this story a real winner.<br><br>I can honestly say that this is in my top 20 favorite movies of all time and I will most certainly buy the DVD when available.  I can't believe I've been saying all this about a movie way out of my usual genre but here it is, in writing.  Please watch this movie, and then tell me I'm not losing it. Enjoy!","user":"WCBrown","rank":[96,112]},{"title":"Want a Freakishly Good Time?","rating":10,"date":"16 August 2003","review":"I admit, I was dragged to this movie by my 12-year-old cousin. At first I thought, \"Lindsay Lohan? Who's that? And Jamie Lee Curtis? Isn't that the 'scream queen'?\" I didn't want to go, but that was that.<br><br>\nWithin the first few minutes of the movie, I rolled my eyes. I thought it was just a cliche movie about a mom and a daughter that fight a lot. I was bored. But ten minutes later, the magic began. I found my eyes glued to the massive screen, I found myself \"shushing\" anyone that interrupted my connection with the two stars. I was hooked, and that was that.<br><br>\nLindsay Lohan and Jamie Lee Curtis work wonders together. They have wonderful chemistry on screen that make you believe that they have, in fact, switched bodies. Both actresses were brilliant in their roles of switch reversal. Their acting was so real, their expressions so priceless. Awesome, too, was the movie's supporting cast. Enough said. The script was amazingly well written, the directing extraordinary.<br><br>To sum it up, this movie was \"freakishly good.\" Pure magic, I tell you.","user":"v0dchey","rank":[98,115]}]