[{"title":"An Unfinished Journey","rating":27,"date":"27 December 2008","review":"I am among those who have not read the book and I found it to be initially confusing and boring but the film picks up after Lyra is taken into Mrs. Coultier's lavish house. The pace picks up but it may seem a little too rushed. The ending was sort of continuous, requiring a sequel. I would have liked to see the second movie but unfortunately, there is a rumour that it may not happen which is quite a pity because I thought 'The Golden Compass' was going somewhere. It is not the best movie of its kind but I thought it was not so bad either. The special effects are good. The characters are lively. I loved the daemons. It's got quite a stellar cast but only Nicole Kidman gets enough screen time to be noticed. Gorgeous, glamorous and deceitful, could not picture anyone else for the part of Mrs. Coultier. (I am almost sure that the rest were promised a lengthier role in the sequels). Daniel Craig only has about 15 minutes but he makes the best of it. Sam Elliot is funny. Dakota Blue Richards is a confident young actress and she carries off Lyra well. Overall I enjoyed the world that was created in this movie and the characters. Too bad that it's left incomplete.","user":"Chrysanthepop","rank":[76,88]},{"title":"Entertaining, but missed opportunity","rating":6,"date":"6 December 2007","review":"His Dark Materials: Northern Lights, the original name for the book, in the UK. What a poignant, mysterious title for a book. The Golden Compass? Well, it doesn't quite have the same impact, does it? The use of the American name of the book for the film really didn't bother me at first, but as early warning signs come, it doesn't get much more obvious than this; we should have guessed from the off that this was going to be a very different beast to the book.<br><br>As a huge fan of Philip Pullman's epic trilogy, I had been eagerly anticipating this film adaptation for at least a year. I had fallen in love with the books a while back; not due to the fantastical elements, but due to the way it introduced this fantastical parallel universe to the reader in a slow, subtle, familiar way and made it feel real and tangible. The books are gritty, rugged and at times violent, and the stories' themes are philosophical and even spiritual in a way. It grieves me to say that the film misses the point; concentrating instead, on the fantasy, the action and the giant talking polar bears (panserbjorne).<br><br>The story is the same: it follows the exploits of a young orphan girl, Lyra, who lives among scholars at Oxford's Jordan College, in a world parallel to our own, in which every human is joined to a physical manifestation of their soul (daemon). One day Lyra hears hushed talk of an extraordinary particle which is rumoured to possess profound properties that could unite whole universes. But there are those who fear the particle and would stop at nothing to destroy it. Children are also being kidnapped left, right and centre, and Lyra's best friend, Roger, is among them. Catapulted into the heart of a desperate struggle, Lyra is forced to seek aid from witches, gyptians, and formidable armoured bears, to help her save her friends from these evil experiments.<br><br>But the soul of the story is all but gone. Gone is the mystery; the slow, developing understanding of a person's bond with their daemon; and the gentle, calm introduction to each character and their entwining relationships. Granted, such a complex story was always going to be difficult to adapt, but surely restricting it to such a short-time span (114 minutes) to tell the story just increases that difficulty. By ripping out the very things that made the novel so spell-binding and original, we're left with an ultimately quite hollow, shallow and self-conscious movie, which is more interested in showing off it's (admittedly breathtaking special effects) than telling an interesting story.<br><br>The problem isn't that I've read the books. The problem is that this film is very nearly a complete disaster, even as a film unto it's own right; there is no character development, some of the dialogue is awfully contrived and the pacing is all over the shop. Virtually everything from the book is in there, in fact; it's just every scene flies by at a ridiculous pace. The characters are given no time to breathe or grow and concepts such as the daemons, Dust and the magesterium are explained to you via convoluted exposition rather than simply shown to you. The result is a rather detached feeling and thus you never care about any of the characters, which is a crying shame, considering the source from which the stories came.<br><br>Oddly, despite nearly being a disaster, the film could have gone the other way - some of it teeters on perfection even. For one, it is visual eye candy, with the design departments each paying extraordinary attention to detail in their creation of Lyra's world and it is not their fault that Weitz's (or New Line's) vision differs so wildly from Pullman's description. Also, the acting itself from almost everyone is very strong, with each actor portraying the characters from the books superbly. Daniel Craig owns both scenes he's in, as Lord Asriel does in the book; Nicole Kidman's magnetic, seductive beauty is perfect for Mrs Coulter; Sam Elliott charms and delights as Lee Scoresby; and Dakota Blue Richards is every bit the lovable rogue of the Lyra of the novel. (Had there not been the need for her to be so pleonastic, the audience might even have actually cared about her).<br><br>As far as entertainment goes, the whole film is actually pretty high up the scale; captivating and engrossing the audience throughout, who barely have time to catch a breath. It's a damn good spectacle, that's for sure. It's just an utter shame how great this could have been on many levels, and how as it is it's only a little better than your average family adventure film. Children from about 8-14 WILL love this, but it doesn't have the depth or layers of, say... The Lord of the Rings (the comparison was always inevitable), to not only entertain, but to excite, thrill, shock, scare, move, and even inspire viewers of all ages, like it could have done.<br><br>As far as summaries go, you need just watch the film, which is over in an instant and in fact runs very much like a summary of the book. It's worth watching for the entertainment value but you'll probably have forgotten about it by tomorrow.<br><br>It sounds like a pretty scathing review, but I still think the quality of the story shines through in the end, and most people will find something to enjoy on some level. It is certainly unlike anything you've ever seen: so very good and yet so very, very unsatisfactory.<br><br>Must do better.","user":"JerusalemFace","rank":[509,634]},{"title":"Pretty good movie","rating":7,"date":"17 September 2019","review":"The golden compass is a pretty comparable children's movie. The acting is well done, both from the kids and adults. The cast ensemble is made up of some fairly prominent names. I quite enjoyed watching, though I'm still not sure I get what dust is, or why the college let Nicole Kidman take the girl \"as an assistant\". It was all fairly good, watching ioryek slap the jaw off a polar bear was a highlight. But my main grievance is that they set up for a sequel that never happened, leaving the ending lacking.","user":"Calicodreamin","rank":[8,8]}]