[{"title":"A sports movie worthy of non-sports people","rating":9,"date":"7 December 2004","review":"This movie is not what you might expect. It is not your typical sports movie, where a disparate team comes together to triumph over adversity as the music swells with a dumb sense of pride. This is a movie about people, kind of like Seabiscuit that way, except less happy and with no horses.<br><br>This movie is about Odessa, a medium-sized town in Texas with no economy and nothing to do besides obsess about high school football. It is a town where they pay the football coach twice as much as their teachers, where a boy's best chance out is to get a football scholarship to a faraway college, and where these boys are under so much pressure to win because the town seems unable to succeed at anything else.<br><br>A movie like this depends on its actors, because it is a character drama at its core. Much noise has been made of Billy Bob, and how he gives a great performance, and this is very true, but he is not the only star in this movie. The boys all do a great job too, especially Lucas Black. I have never noticed this actor before, but he is so intense as Mike Winchell that he makes you really feel for him. The other boys, including Derek Luke and Jay Hernandez, are also note-perfect.<br><br>There is a great moment at the end, after their final game, when they talk about what they are going to do next. They haven't graduated yet, but it is already over for them. There is a sense that nothing else matters. Subtitles tell us what happens to everyone. It is sometimes funny, often tragic, and always ironic, and you leave the movie feeling like you've met some new people who are very real.","user":"trillian28","rank":[92,119]},{"title":"The Real Varsity Blues","rating":9,"date":"9 February 2005","review":"This is a very dark sports movie. It's about fanaticism, the great weight of importance certain people place on sports. Sports fans often regard their teams as extensions of themselves. In \"Friday Night Lights,\" the entire town of Odessa, Texas collectively puts their town's reputation on the shoulders of a high school football team. It's basically the same exact plot as \"Varsity Blues,\" except a serious version of high school football in small town Texas.<br><br>One thing the movie does extremely well is taking hackneyed plots of the individual players (because it's all been done before) and putting them all in the background. So the plots play out not in a cheesy, inspirational, in-your-face way. Instead, they are just there with only as much attention as the viewer wants to put on them. The great aspects of sports are enough to keep us interested and makes the movie incredibly real.<br><br>The only character whose plot is really focused on is Boobie, the cocky running back who is injured and tries to defy his own injury. This is a plot in sports movies that has been focused on somewhat - the injured player. But never before has the pain been so real and so powerful.<br><br>This movie is heart-wrenching. Sports movies usually have so many moments of redemption and cheesy happiness that often feel false. This movie only has one such moment and it is incredibly powerful. Nothing about this movie is Hollywood. Billy Bob Thorton gives a great, understated performance as the coach, a man who is simply internal, who can do nothing but sit back and watch events unfold, knowing full well the impact that each game has on himself and his family. All the actors playing the football players do a good job, especially the guy who plays Boobie.<br><br>Don't expect this movie to uplift you. But it will show you an interesting side of sports you may have never considered. And, in the end, it shows exactly what is great about sports, and it has nothing to do with winning or making a career out of the game. It's about giving all you have for a teammate.","user":"zatz-1","rank":[58,80]},{"title":"The Best Sports movie ever made","rating":8,"date":"10 October 2004","review":"This movie was phenomenal in every way. It had incredible performances under a great director with a fantastic story to back it up.<br><br>It tells the story of a high school football team in Texas through the course of their 1988 season. Billy Bob Thorton played the coach of the team and give the best performance I've ever seen him give. The film was directed by Peter Berg who gave it a unique film style. He managed to tell this story in a very beautiful way.<br><br>Tim McGraw gives a great debut performance of an ex-high school football player who has become the drunken abusive father of one of the players currently on the team. He was almost unrecodnizable in this role and he portrayed it well. He, and the rest of the cast for that matter deserve a lot of credit.<br><br>This is the only football film I have ever seen that has done justice to what it feels like to play football in high school. I played under Friday night lights myself, that time of my life ended just a year ago and it still holds fresh in my memory. And because of that I can tell you how accurately this film portray's the sense of brotherhood and friendship that is felt by every team, at least every good football team.<br><br>Whether you ever played under Friday night lights yourself or not anyone should be able to appreciate this film.","user":"espenshade55","rank":[75,111]}]