[{"title":"Review: Ensemble cast delivers top-notch performances in reflective drama","rating":10,"date":"11 September 2004","review":"In a drama strikingly reminiscent in style and tone of P.T. Anderson's film Magnolia (1999), the narrative in Crash shifts between 5 or 6 different groups of seemingly unconnected characters, whose relationships to each other are only revealed in the end.<br><br>Not to be confused with the David Cronenberg feature of the same name, this Crash is the feature-length, studio-released directorial debut of veteran Canadian TV writer/producer/director and two-time Emmy-winner Paul Haggis. An in-depth exploration on the themes of racism and prejudice, cause and effect, chance and coincidence, and tragedy, \"crash\" is a metaphor for the collisions between strangers in the course of day-to-day existence. Set over a 24-hour period in contemporary L.A., it is a social commentary on the interconnectedness of life in the big city.<br><br>Crash features a top-notch ensemble cast which includes: Sandra Bullock, Don Cheadle, Matt Dillon, Jennifer Esposito, Brendan Fraser, Chris \"Ludacris\" Bridges, Loretta Devine, Thandie Newton, Ryan Phillipe and Larenz Tate. All put in superb performances in a tight script which is at once gritty, heartwarming, shocking, tragic and witty, and which will ring true with viewers of all demographics.<br><br>Centering around two disturbing car accidents, a carjacking, vicious workplace vandalism, and the suspicious shooting death of one police officer by another, the drama is set against the backdrop of a racist LAPD and Los Angeles justice system. Action shifts between the various characters, whose lives collide with each other in unpredictable ways as each faces their own moral dilemma, and tries to cope with the consequences of their resulting decision made or action taken. Each of the dozen or so main characters undergoes some type of a personal metamorphosis as the various story lines head toward a striking, common conclusion, which succeeds at being both cathartic and unsettling.<br><br>Crash is backed by a solid and varied, original soundtrack and excellent cinematography. Sweeping, wider shots alternate with disjointed camera angles which convey the chaos and confusion of the characters and the unpredictability of life. Occasional lingering close-ups -- on occasion without sound -- capture the actors' facial expressions, which suitably detail key moments of the characters' aching pain, fear, anger, bitter anguish, remorse or grief, far better than any dialogue could.<br><br>This breathtaking film is destined to be a critical smash and box-office hit. Five stars.","user":"Brambo","rank":[848,1]},{"title":"Volatile Redemption","rating":10,"date":"13 May 2005","review":"\"Crash\" is a complex movie with a simple premise: set in Los Angeles it follows 8 main characters (and many, many more supporting) from all walks of life and races whose lives intersect at some point during one 24 hour period. These people are all different yet all alienated, to the point of breaking, so much so that when they come together, things explode.<br><br>The complexity of the film comes from the encounters between characters and their tangled lives and worlds. Haggis' screenplay is so intricate and delicately written I couldn't begin to try to summarize the actual plot line (which destines this article to be kind of vague), but everyone meets everyone else at some point in the film (and there are a whole lot of characters). Sufficed to say these meetings are variably intense, casual, fleeting, dangerous, but they all effect the participants in profound and provocative ways, causing lives to find enlightenment or swerve violently, and watching it all unfold is mesmerizing because Paul Haggis (Oscar Nominated writer of Million Dollar Baby) made the film meaty with messy characters and topics and stories to chew and hurtle along with.<br><br>The all-encompassing theme of the film is racism, and it is dealt with bluntly, honestly, and without reservation. Every single character participates in the perpetuation of the ugly cycle but also suffers because of it. Where racism makes for an interesting enough subject for an already provoking and fairly experimental film (I was surprised to see this get wide release), it's only the catalyst for a deeper, resounding story of redemption and the universality of our lonely situation which the movie becomes during its second hour (what you could call Act II). It switches from a somewhat depressing contemplative amalgamation of moments about racism in everyday life and how destructive it is, to a throbbing, intense web of choices and consequences -- life and death, vivifying or soul killing -- and the chance at redemption.<br><br>Following their actions in Act I, everyone meets a fork in the road or is given a second chance of some sort. Some take it, some don't, but regardless, by the end of the movie everyone has changed. This is what gives the movie wings during its second hour, makes it interesting, keeps you guessing and on knife's-edge. It also gives the characters depth and souls and shows that despite perceived and upheld differences, when it comes down to it we aren't different (which we see in a shattering scene between Ryan Philippe and Larenz Tate after Tate notices that he and Philippe have the same St. Christopher statue), in fact we desperately need each other. It's one of the few films I've seen where everyone is at fault somehow and yet there are no villains. It makes it hopeful, particularly with something as ugly as racism: everyone's fallible, but everyone has the capacity for good and nobility. That said, each of these character's inner struggles makes for all the conflict and resolution you need.<br><br>A talented ensemble drives the film, sharing almost equal amounts of screen time, but the folks who really stood out and had my full attention each time were Terrence Howard (plays a TV director), Matt Dillon (as a patrol cop), Sandra Bullock (a rich housewife), , Don Cheadle (a detective), and Michael Peña (a locksmith). These five gave deeply, deeply felt performances portraying a wide range of emotions and personal situations, giving souls -- alone, yearning, and searching in a world that doesn't seem to care -- to shells of imperfect people. But the actors triumph in little moments of human contact: a glance, an embrace, a pause, a smile, a wince, things that breath the film to life and with simple visuals give it profundity. This is beautifully illustrated in a small scene between the downward spiraling Jean (Sandra Bullock) and her maid after she's begun to realize all her problems may not be about the two black guys who car jacked her, but her own life.<br><br>Some closing notes: it's obvious it's a debut. At times the dialogue and acting can be stilted and unnatural; some of the initial \"racial\" situations seem forced; certain scenes could have used some editing or fine tuning, but by the end I didn't care. It also may be helpful to know that the first hour spends its time setting everything up for Act II, although it will seem more like a photo essay on racism than a setup. But by the time Act I ends you're ready for something substantial to happen, and at the perfect moment, stuff happens. I was entirely satisfied with this movie, I couldn't have asked for anything more. Still it's impressive, with his debut Haggis made a film that magically maintains a storytelling balancing act about people's lives that almost seamlessly flows, takes an honest look at racism with an understanding of mankind, a belief in redemption, and even hope. As I walked out of the theater into the rainy night it resonated with me and colored my thoughts as I made my way through the crowds of unknown fellow people filling the cinema. That's about all I can ask for in a film.","user":"mercybell","rank":[664,980]},{"title":"Roller-coaster of emotions","rating":10,"date":"1 May 2005","review":"Like Altman's classic Short Cuts, and Anderson's Magnolia, Crash, by writer/director Paul Haggis weaves a tale of multiple characters through the web of streets we have come to know as Los Angeles. Unlike those other two films this one has a very specific theme to explore. From the opening line uttered by Don Cheadle we know this is to be a film about how people relate, and from the interchange that follows between Jennifer Esposito and Alexis Rhee (pretty sure she plays the Korean female driver who rear-ended her) how people relate tends to be ruled by first impressions or prejudice.<br><br>Race is paramount in this film, and all our preconceptions of who people are get twisted and turned through the intricate plot. With each new additional character we find another assumption, another stereotype, and then watch as that preconception is obliterated as the character develops. It is a credit to the deftly written script, tight direction and exceptional acting talent that every one of these many characters is fully realized on screen without ever feeling one-dimensional.<br><br>I would love to discuss some of the details of what happens to explain how well it is done, but part of the magic of this film is allowing yourself to be taken on this ride. Mind you, this isn't a ride of pleasure. The first half of this film is unrelentingly in its ferociousness. I could literally feel my rage at some of the characters forming to a fever pitch. The fear and hatred I was confronting wasn't just on the screen, but in the pit of my stomach. And in one absolutely brilliant moment I was literally sobbing at the expectation of horror unfolding, only to be cathartically released in a most unexpected way.<br><br>Mr. Haggis was in attendance at the screening I saw and explained that the idea for this film came to him one night sometime after 9/11 at about 2a.m. when his own memories of a car- jacking experience from 10 years before wouldn't leave him alone. Clearly this film was his way of relieving those demons of memory, using the catharsis of his art to unleash them and in doing so has given to all viewers of cinema an opportunity to examine our own preconceptions about race relations and how we treat each other and think of ourselves. He mentioned in the discussion after-wards that he likes to make films that force people to confront difficult issues. Films that ask people to think after the film has ended and not just leave saying: \"that was a nice film\".<br><br>This isn't a \"nice\" film, and I would expect that it will provoke many a discussion in the ensuing weeks when it opens nation-wide. It's a discussion long overdue for this country, and it took a Canadian to bring the issue to the fore in this brilliant, thought provoking film.","user":"Vitarai","rank":[676,1]}]