[{"title":"This movie caught me by surprise","rating":9,"date":"2 August 2006","review":"Monster House was a perfect combination of kid-friendliness, horror, action and adventure. When I first walked into the theater I thought it would be \"kiddy\" because I went to see it with my younger cousin. You know how most animated movies are somewhat funny and about teamwork and working together or teaches life lessons or morals but I actually came to find that this movie was more scary than comical or ethical. I actually got into it. I actually ended up liking it more than my cousin. Some of the content is for older kids but it's non-stop action and the momentum of the story line never stops. And the characters seem so real. 2 thumbs up. I definitely recommend it.","user":"ryandouglassw","rank":[125,144]},{"title":"Scary fun","rating":8,"date":"6 July 2006","review":"Well, I think if I saw this movie when I was ten years old, I would have been totally scared and could not sleep for weeks. Now it seems time has changed: ten-year-old children are playing horror-video games so probably what was too scary for them in the eighties is just right and fun now. Actually this is just what you could expect from a movie about a monster house: funny, spectacular, sometimes frightening. Quite a well-developed story - even if it is full of clichés, or should I say homage? - with the usual \"two boys, one girl\" trio as seen in Star Wars or Harry Potter. The animation is strange at first: they seem like rubber dummies, but thanks to the motion capture, their movement and expressions are first rate. While they look like having plastic hair, there is a great development since Polar Express in one field: their eyes are constantly moving - full of life. And the whole movie is just a typical and fun Spielberg-Zemeckis production with elements of Hitchcock. Besides the extraordinarily dark scenes it just feels like those very entertaining Spielberg productions of the eighties.","user":"laci-5","rank":[105,122]},{"title":"Quite the enjoyable movie!","rating":8,"date":"16 June 2006","review":"I just saw this movie at the Seattle International Film Festival. I didn't know what to expect, but I must say I found it quite enjoyable. There was a lot of talk before the movie. People were saying that it will be too scary for the little kids, but not adult enough to capture older kids attention.<br><br>I can see it being quite frightening at times for the little ones, but of the kids in the theater its not like I heard any of them screaming mommy. I don't know how well the movie will do with kids, but from an adult's perspective, its definitely worth a viewing.<br><br>The best part of the movie definitely has to be the characters. Each were extremely well thought out and put together. They did a fantastic job of matching right voices with the right characters. Characters facial expressions were amazing. You'll find yourself laughing at things they say and do quite a lot.<br><br>The animation looks great. They certainly aren't ground breaking. But they fit the movie well. However, I will say that some scenes looked quite amazing.<br><br>If you are looking for a fun, clean movie with plenty of laughs and chuckles, this is definitely one you don't want to miss!","user":"cokerbl","rank":[123,148]}]