[{"title":"Splashy chronicle of a generation in revolt against tradition (worth watching)","rating":24,"date":"24 January 2005","review":"Head On (Gegen die Wand), winner of the top prize \"Golden Bear\" at the 2004 Berlin Festival, is occasionally interrupted by a panoramic shot of a singer performing in front of a small Turkish orchestra on the banks of the Bosphorus across from Istanbul. It's a simple, at first incomprehensible, little device that provides punctuation and clarity amid the chaos and melodrama that otherwise dominate this story of a Turkish man in his forties and a twenty-year-old Turkish woman who meet in a psychiatric facility in Germany when both have attempted suicide -- he by crashing his car into a wall (\"head on\"), she by slitting her wrists. Cahit Tomruk (the sublimely attitudinizing Birol Ünel) is a purposeless rock 'n' roll loving boozer with a dead-end job collecting bottles at a club, and Sibel Güner (the wiry, intense Sibel Kikulli) is a young woman with conservative Turkish parents who wants to escape family pressures.<br><br>Both are total drama queens and both are German-born Turks. Cahit is more assimilated; his Turkish isn't even good. Sibel figures if he'll agree to marry her that'll get her away from her family. This is the irony of their situation: she must capitulate to the conventions of their culture in order to gain some freedom from it, and he must capitulate to society in order to get some sense of purpose. So they do get married -- he somehow passes muster with the stuffy family, baulking all the way -- and they eventually even fall in love. Her joie de vivre is exactly what he needs, and she's essentially just as wild in her way as he is in his -- but his nihilism and violence continue unabated and so does her promiscuity, and his brutal attack on one of her one night stands leads to jail and scandal, which in turn forces her to go to Istanbul. While he's incarcerated she writes him sustaining letters from Turkey -- their relationship, like the staid orchestra on the Bosphorus, is a stable element amid the surrounding chaos -- and after jail he goes to Turkey to find her.<br><br>To say this turbulent, brightly colored, lurid story is a \"realistic picture of Turks in Germany\" would be a total distortion of the truth. But somehow the situation of Cahit and Sibel reflects the unstable moods this half assimilated, half alien population experiences, and however melodramatic and unresolved the saga is, the two main characters are very well realized. The actors are strong, especially Birol Ünel, whose charismatic brooding and ravaged good looks make him irresistibly watchable. Both feel real to us -- he sardonic and gloomy, she dangerously spirited and full of life-- despite her dramatic suicide attempts, of which there's more than one. The story, as much as the images through which it's told, is both dark and vibrant.<br><br>We need the Brechtian, Greek-chorus device of those orchestral interludes on the Bosphorus, though: without an occasional break the drama and darkness would be too much. We also need to go with the flow of this movie, and not expect it to be more polished or more organized, or even better looking, than it is. It looks unlike most films we're seeing now, but that doesn't mean the cinematographer hasn't done the best possible job. What it has is life, tumultuous with incident, strong personalities, and a milieu we've not seen before. There's also a loud, authentic-feeling rock-pop soundtrack and a cunning contrast between Cahit's punk-rock sensibility and Sibel's love of good grooming and dance. Arguably the movie is too long, but that length gives it the feel of a saga, which it must have, because that's what it is, the confused, tawdry epic of a generation. Like all first films by a whole subculture, it has a lot to talk about. When Sibel and Cahit discover they still love each other, after everything, it's the Turkish Germans discovering that they have self-worth. The last scenes are open-ended: this generation's future is anybody's guess.<br><br>Seen in Paris 17 September 2004. Opening in the US in January 2005. First German film to win a Golden Bear in Berlin in eighteen years.","user":"Chris Knipp","rank":[144,168]},{"title":"A Thrilling Roller Coaster Ride of Love and Loss","rating":8,"date":"16 February 2005","review":"\"Head On (Gegen die Wand)\" is a completely original love story and shames conventional Hollywood romantic comedies with its fresh take on love and loss as rich as Rhett and Scarlett.<br><br>The closest I can think of a dysfunctional couple meeting so oddly cute and playing out an unusual relationship is in Christopher Fry's \"The Lady's Not for Burning\" which shares self-destructive lovers. The German literal title of \"Against the Wall\" is more resonant of how they feel, but the American distributors probably thought that had too much political implication.<br><br>The completely self-involved he and she here are innately off-kilter because writer/director Faith Akin sets them within a diverse Turkish immigrant community of Germany, so that their personalities are circumscribed by cultural expectations and restrictions, she chafing against binds on women and he lost in the nihilistic punk rock underground.<br><br>The rocky journey of how they find their own individuality within their sexual and emotional needs and ethnic identity and what each means to the other is an unpredictable thrill ride as each unexpected action leads to tears, laughter, poignancy and regret of bad timing. This is a baldly brash and frank exploration of the meaning of love and marriage, as individuals and within a web of family, friends and culture.<br><br>Craggy-faced Birol Ünel is riveting as the older, burned-out case whose past we only glimpse. Sibel Kekilli at first seems like just another pretty young thing, but brings spunk and sympathy on her maturing roller coaster ride. Evidently, deleted scenes that are available on the European DVD help to expand on the hints as to what her closing motivations are.<br><br>Dependant on the English subtitles, I'm sure I lost some significances as I wasn't sure when characters were speaking Turkish or German, let alone able to discern their fluency in either, with the added fillip of recognition of globalization with a sudden concluding discussion in Istanbul in English of their future.<br><br>The chapter introductions by an ethnic band playing a traditional sad love song adds to the timeliness of the tale that is reminiscent of old folk ballads of tragic love stories. In between, the punk rock and contemporary world fusion selections are terrific, including the moving closing song.","user":"noralee","rank":[81,95]},{"title":"Bitter, Sad, Heavy, Unpleasant  But Also Original and Realistic Non-Hollywoodian Love Story","rating":8,"date":"17 January 2006","review":"In St. Pauli, Hamburg, the alcoholic, drugged and hopeless German with Turkish roots Cahit Tomruk (Birol Ünen) lives like a pig in a small dirty apartment and survives collecting empty bottles in the night-club \"Der Fabrik\". One night, he gives up living, and hits his car against a wall. However, he survives the crash and is sent to a clinic, where he meets Sibel Güner (Sibel Kekilli), a younger German Turk, with suicidal tendencies. Sibel is the younger daughter of a conservative Turkish family, and proposes a fake marriage to Cahit, in order to permit her to leave her family; in return, she would share the rent of the flat, and she would cook and clean the place, and they could have independent lives. Cahit accepts, but while living with Sibel, he falls in love for her, until a tragedy happens.<br><br>I saw \"Gegen die Wand\" yesterday and I am still very impressive with this powerful German movie. It is bitter, sad, heavy, unpleasant  but also an original and very realistic non-Hollywoodian love story. The location in St. Pauli, close to the famous Reeperban Street, could not be more perfect as the environment for such depressive story of losers. The precise direction of Faith Akin (obs: IMDb dictionary does not allow to write correctly the name of the director) is stunning, and the performance of Birol Ünen and Sibel Kekilli are outstanding and deserved nominations to the Oscar. When the character Sibel reaches the bottom of the well in Istanbul, Sibel Kekilli shines with a mesmerizing performance. Unfortunately we will never see Hollywood shooting this type of story, which is recommended for very special audiences. My vote is eight.<br><br>Title (Brazil): \"Contra a Parede\" (\"Against the Wall\")","user":"claudio_carvalho","rank":[64,75]}]