[{"title":"A 10-star 2-hour movie screaming to get out of a 7-star 3-hour movie","rating":7,"date":"17 January 2006","review":"Let me be the first to admit that there's nothing wrong with a long movie, nothing at all. \"Titanic\" was a long movie that was as exactly as long as it needed to be. \"Gone with the Wind\" was a really long movie that was exactly as long as it needed to be. \"Dances with Wolves\" was a long movie that I wish had been even longer when I saw it in the theater. But \"King Kong\"? Phhewww...this sucker clocks in at least 30-60 minutes longer than it needs to be. While it played, I kept inadvertently thinking to myself, \"Boy, we really should be out to sea by now...they haven't reached the island yet?...man, are they EVER gonna find Ann?...jeez, when are we gonna go back to Manhattan already?...\" and so on. Hand to God--I actually yawned twice during the last third of this movie. I even closed my eyes for a second before I realized, 'hey...you can't just rewind this when you wake up!'<br><br>Sure, many scenes in \"King Kong\" were thrilling (e.g., LOVED the T-Rex sequence) and, yes, I even teared up a little a couple of times. And I must say, Kong himself was beautifully realized--he looked and acted like a REAL gorilla (albeit a tiny bit anthropomorphized)! But I gotta tell you...I was more relieved than exhilarated when this movie ended. (If I saw one more flyover of the native village, I was gonna scream!) Peter...baby...why spend so much time developing all these extraneous secondary characters if you don't really have much closure with them by the end. For example, the ship's captain and Jimmy...once we leave Skull Island...pfffftttt...we never them again. Why all the backstory scenes about them? As with the original version, Jackson should have concentrated simply on the four main characters throughout: Kong, Ann, Driscoll and Denham. Period.<br><br>The problem is Jackson tried to make an epic out of a thriller, when these two approaches are generally exclusive to each other. The original \"Kong\" MOVED because it was simply a thriller and content to be so, but Jackson's remake starts and stops, and starts and stops, and starts and stops, merely frustrating the thrillseeker in us that wants to keep going every time Jackson establishes some momentum. But instead Jackson pauses to \"delve\" or \"explore\" or \"elaborate\" a la David Lean or something like that. One can excuse Jackson for shooting so much material for the \"Lord of the Rings\" trilogy--consider the rich source material . But how anyone could have taken the 100-minute original and nearly doubled it for a remake has far too much memory on his Mac. He should have saved all the extra footage (and I'm betting there's a LOT more we didn't see in the theatrical cut) for the DVD release as he did for LOTR. Mr. Jackson's first priority as a filmmaker (well, all filmmakers) is to present the most appropriate cut for THEATRICAL audiences during the film's initial exhibition in theaters. In this case, more WAS less. Much shorter movies in the past have had intermissions!<br><br>Honestly, though I certainly enjoyed \"King Kong\", I really have no desire to see this movie again--I just couldn't bring myself to sit through all the filler just to get to the good parts. How I wish Jackson and/or Universal would consider releasing a 2-hour DVD version. Hey, it's happened before, so what's the harm? Inside of a year there'll be 17 versions out on DVD anyway...what's one more? But having to sit through a 3-4 hour DVD version someday? I'll take a pass.<br><br>Do I recommend seeing \"King Kong\"? Of course. You'll probably enjoy it immensely, despite it's overlength. But if you do go, by all means lay off the Jumbo Coke until at least 90 minutes in! You'll thank me later.","user":"BuddyBoy1961","rank":[685,1]},{"title":"Beauty Killed the Beast","rating":10,"date":"10 January 2006","review":"If the LORD OF THE RINGS trilogy cemented Peter Jackson as a director of the highest order and made him the new king of the world, KING KONG seals his position as a Director and eliminates any trace of doubt that he may have been a one hit wonder.<br><br>Bringing what has to be one of the most known and greatest adventure story into a new configuration, and doing so successfully, is a tremendous gamble. Dino de Laurentiis tried to do so thirty years before, and while the film is watchable, it was considered a major disaster. An unrelated sequel, KING KONG LIVES, proved even worse. Peter Jackson, who has called KING KONG the reason he decided to get into film-making, wanted to make this film before LORD OF THE RINGS was thrown into production, but circumstances prevented this in happening, and thus his career went into high gear as we now know. Maybe it's just as best that things went this way: the sensitivity and emotional power that his saga of Middle Earth makes its way into the Modern Age and elevates this incredible action-packed adventure into the spiritual heights that its climactic sequence requests.<br><br>The argument, which resembles a massive Stephen King novel in epic proportion and in the way it introduces each of its characters, is as follows: Carl Denham (Jack Black, channeling Orson Welles) is trying to get his movie off the floor, but producers aren't quite backing him up with his latest project which is to be set in the distant Skull Island. On top of this, leading ladies are scarce, and one who would have been available (Fay, in a nod to the late Fay Wray) is working for an RKO production. Ann Darrow (a radiant, multi-faceted Naomi Watts) is a vaudeville performer who is nearly destitute: the theatre where she works has closed and she is practically stealing to eat. Darrow and Denham cross paths in the Depression era Times Square, and envisioning her as his muse, he convinces her to join his production team as his lead actress. At the same time, Denham bamboozles playwright Jack Driscoll (Adrien Brody) to join his team as screenwriter, and with Captain Englehorn (Thomas Krestchmann) on helm, off they sail to Skull Island (while the entire crew believes they are heading to the more exotic location of Singapore).<br><br>As they arrive they get glimpses of the island's forbidding nature: stone faces in the style of Christmas Island's, but savage and menacing, are all over the place, and the island at first seems deserted. A little girl catches their attention and in trying to ingratiate themselves to her they are assaulted by bloodthirsty savages that all but decimate their crew and capture Darrow for the purpose of sacrificing her to (whom they believe to be) the ruler of the island, a twenty-five foot gorilla named Kong (a brilliant Andy Serkis). Not wanting to leave Ann abandoned in the island the crew comes back to rescue her and in the process discover that Kong is the least of their troubles: the island is infested with prehistoric life.<br><br>It's at this point when KING KONG bursts into non-stop action and Peter Jackson pulls out every hat trick into an hour of chase sequences and truly gory moments involving gigantic insects and man-eating worms. The only moment when the action in the forefront seems somewhat divorced from the background is the sequence where the entire crew faces a stampede of brontosauruses and raptors, but even then it is mind blowing in its sheer scope and is only the set-up to what will be the film's finest hour and the very reason moviegoers know Kong: the return to New York City and the inevitable, symbolic climax atop the Empire State Building in which the New World clashes with the Old World.<br><br>Even so, KING KONG is equally excellent in establishing its mood in four quiet moments. Who could have thought Ann could charm a beast like Kong? Here is the fulcrum of the story, not a love story but a story of kindred spirits. Ann, after fighting Kong, wins him over with her vaudeville act seen at the film's introduction. Witness his facial and body language: Kong is not a beast but an overgrown child full of wonderment and laughter at seeing her dance. Later, after a physically exhausting moment when Kong fights off three T-Rexes, both share a sunset atop a cliff, mirrored in the sunrise they witness, together, at the Empire State Building later on. But by far, the most magical moment is one in which Kong, in New York, slides through a frozen lake in Central Park, Ann in tow, both laughing. Genius at its best. Kong at his most tender.<br><br>KING KONG is a testament to movie magic that action films, even those which remake classics, can benefit from an emotional center. In reconstructing what was a one-dimensional story from its 1933 version with his evolving Ann Darrow's relationship with Kong from hostage to friend and even kindred spirit who sees the beauty within the beast, his version is the more complete, and its length brings the rewards of a fascinating film. I only imagine what he would do in re-creating the world of THE WIZARD OF OZ despite the shrieks of purists who would see such a thing as celluloid blasphemy, forgetting that remakes are necessary, and if done with an expert vision, can create transcendental beauty. And this is absolute beauty.","user":"nycritic","rank":[226,342]},{"title":"When Kong got to the top of the Empire State Building, at least for a few minutes, he was the king","rating":8,"date":"29 March 2006","review":"It was the most powerful connection, I think, between a structure and a city and a fictional character that the 20th century had ever seen <br><br>Of all the \"King Kong\" films that exist, Peter Jackson's new Kong is, without any doubt, the best The film won 3 Oscars, for sound editing, sound mixing, and visual effects It is set in 1933 where America was facing economic troubles unlike any seen before <br><br>Jackson wanted 1933 New York to be very, very authentic He recreates a chaotic, crazy, busy city bustling and vibrant The streets were absolutely jam packed with cars, trams, buses, crowded with hawkers and thousands of people  The Empire State Building had just been built <br><br>Jackson goes in the heart of New York and describes the Depression by showing private security forces raiding buildings; mass evictions of people who simply could not pay their rent; people winding up as squatters; and long line of people waiting to be fed<br><br>He gives a little hint about the Prohibition: police busting up an illegal still; Carl Delham getting a box of whiskey to take upon his trip and it's labeled \"Lemonade.\" And oddly enough, he presents the end of Prohibition, when we see some liquor advertising at the climax of the movie that wasn't there at the beginning <br><br>Jackson also introduces vaudeville... Vaudeville was a variety show, a string of acts put together to form a complete bill of entertainment Ann Darrow (Naomi Watts) was one of vaudeville good-looking actress who loses her job due to the lack of money <br><br>Skull Island was another very important location for Jackson The amount of imagination and creativity that went into the ideas behind it is quite amazing The zoology, the flora and fauna, the cultural history of that impossible island is thrilling It was, indeed, a huge work to rebuild a hellish place of inexhaustible mysteries <br><br>We are talking about small group of desperate souls eking out the barest existence possible Natives who have come to worship a giant gorillanamed \"Kong\" by them as some sort of god, practicing human sacrifice to appease his anger <br><br>We are also talking about a lush jungle and tropical rain forest with giant reptiles with very large feet to cope with the uneven and broken terrain of the island We are talking not only about dinosaurs but also beasts just as terrible, or even worse We're talking about a natural predator trap full of rotting carcasses and scavenger creatures We are also talking about giant, parasitic, warm-like creatures which are much more than active predators and scavengers We are talking about perils resided not only in the depths of the island but in the skies as well, where terrifying flying creatures ruled<br><br>\"King Kong\" delivers a fantasy-adventure piece, with its balance of peril and romance in much the same way \"Titanic\" did The romance part is not where one would expect it, but involves a beast with a beautiful and fragile creature who experience a tender if unexplained bond And this union is the finest moment of the film Ann looks into the ape's eyes and sees something impressionable there And the audience notices it too Jackson has done something emotional here In addition to the ape's beastly character, Kong gazes at Ann and shows true, endearing traits We are struck by his protective nature as we can understand the desires of each to protect the other Ann can't escape this fateful meeting that changes everything It's as if her whole life has been a prelude to this moment<br><br>Jackson's \"King Kong\" is a grandiose thrilling adventure, sufficiently magical and colorful whether it's reverently watching a sunset, or doing some ice-skating","user":"Nazi_Fighter_David","rank":[119,184]}]