[{"title":"Leo's Masterpiece","rating":10,"date":"19 January 2005","review":"There is no doubt that THE AVIATOR is the masterpiece of both director Martin Scorsese and actor, Leonardo DiCaprio. DiCaprio becomes Howard Hughes. The actor is so profoundly absorbed in the role that the DiCaprio we know from other films cannot be found in this film. It is a bravura performance of great depth and magnitude. DiCaprio richly deserves his first Academy Award.<br><br>I have never know much about Howard Hughes. This film opened my eyes to him as a personality, a businessman, aviator and his lavish lifestyle. DiCaprio no longer is the \"pretty boy\" from other films. The expressions he takes on are not handsome, the deeply furrowed brow, one could actually watch him, as Hughes' character, think his way through challenging situations, the mark of a highly gifted actor. Watching DiCaprio evolve into the paranoid schizophrenic Hughes in the latter part of the film is a stunning example of pure acting. Leo deserves recognition for recreating a most difficult personality.<br><br>Though the film is long, it never slows down nor gets boring and it commanded my attention from start to finish. It is masterpiece cinema for these two men and for other actors too. Cate Blanchette must be commended for her role as Katherine Hepburn. Every role was played by first rate actors.<br><br>If you want to understand a piece of American history from the 30s through the 1940s, this film will illumine you. It may not be the greatest film ever made but it sure is cinema to the max and worth seeing, without a second thought.","user":"drplw","rank":[136,166]},{"title":"Falling Short of Greatness...Again","rating":8,"date":"21 December 2004","review":"Scorsese has such an encyclopedic knowledge and understanding of cinema that every shot, however inventive and daring, is effortlessly composed. The direction, editing and cinematography are all the first-rate work by individuals who are clearly masters of their profession and the production design, costumes and makeup are the best you'll see all year. Their efforts combine to create a world of rich and lavish color, of excitement and glamour. Who wouldn't want to visit THIS Cotton Club in 1935? It's hard to imagine who could trump the technical team for Oscars this year.<br><br>With such a perfectly realized world in which to perform, the actors universally do an outstanding job. Despite the criticism of the hardcore DiCaprio-haters, the unprejudiced will observe an excellent performance that takes genuine risks and convincingly conveys the passing of more than twenty years. Importantly, DiCaprio more than holds his own when paired with Cate Blanchett and especially Alan Alda, who both give equally note worthy performances. Blanchett's interpretation of Katherine Hepburn seems spot on, and anyone familiar with the late actresses mannerisms will appreciate the hard work that clearly went into the recreation. Alda, one of the most consistently underrated actors around, delivers another masterclass in restrained character building as he oozes ambition and political dishonesty from every pore.<br><br>And yet, despite the obvious talent of all those involved and Scorsese's ability to effortlessly fill three hours, something about The Aviator fails to completely satisfy. Without wanting to sound like a film student, movies should, ultimately, be ABOUT something; love, honor, courage, redemption, the BIG ideas and themes that are the fuel of the plot. What was the drive of The Aviator? A rich guy recklessly spends lots of money to indulge his personal obsessions and gets away with it. We're never told how his experiences change him, and without change there's no journey. Considering the screenplay was written by John Logan, who usually displays a keen interest in showing the emotional evolution of his characters, the oversight is inexplicable. Ultimately then, much like Gangs of New York, The Aviator is simply the sum of it's parts, and however brilliantly those parts are realized, there doesn't seem to be a bigger theme to underpin and drive them.<br><br>The Aviator is a perfectly realized recreation of the era and one well worth experiencing. But the lack of a real emotional journey suggests 'all gloss and no substance', and ultimately prevents the movie from being truly great.","user":"Rathko","rank":[673,934]},{"title":"A GREAT American TRAGEDY","rating":10,"date":"17 December 2004","review":"This is an astonishingly beautiful and moving film. Martin Scorcese has created a seminal work -- one that brings the harrowing, big-studio, adult movie making of the 1970's and totally reinvents and reinvigorates it for today's audience.<br><br>The story traces the rise and demise of billionaire Howard Hughes as he struggles to find meaning and purpose in a life unfettered by concerns of money, talent or opportunity. Whether trying to get a plane off the ground or a young starlet into bed, Hughes attacks life with a fierce gusto -- plagued and prodded by obsessive compulsive germphobia that constantly threatens to consume and defeat him.<br><br>DiCaprio is amazing! It's the performance no one thought he was capable of. It is a dynamic, smart, funny, articulate, intense, mature and ultimately harrowing performance that relaunches his career as one of American's finest actors. At the end of the film, you just want to take him in your arms and sob. It's really that good.<br><br>Cate Blanchett is incredible as Katherine Hepburn. At first, I was a little thrown by how bravely she attacked the Hepburn trademark voice, but I was completely won over by the second line. It is a tender, funny, incredibly convincing star turn that supplies the heart for the first half of the film. The scene where she takes Howard home \"for dinner\" with the family is a classic! Kate Beckinsale does a surprisingly fine job with Eva Gardner -- conveying the slow burning passion of this Hollywood icon without ever lapsing into mere mimicry.<br><br>But, in the end, this isn't a love story -- it's a war story -- a war between Howard's unstoppable will and his fierce inner demons battling for Howard's soul. It is the major relationship in the movie and the true heart of the film -- one that fuels his eccentric genius and yet constantly threatens to rip his life apart. He tries to ignore it by sleeping with every beauty in town. He tries to outrun it, building faster and faster airplanes. Yet, it is his one constant companion from early childhood to his ultimate, inescapable end. And it is this relationship that leaves you devastated at the end of the film.<br><br>Brilliant!","user":"Mister1045","rank":[504,702]}]