[{"title":"Maximum Silliness, But Still Fun","rating":8,"date":"19 April 2004","review":"First things first:  this is a very silly movie with a cardboard plot, hackneyed characters, and some atrocious dialog.  BUT - nobody goes to see a movie like this for its iconic \"film\" moments.  You go because it looks utterly ridiculous and you're in the mood for just that sort of fluff.  On that basis, the movie delivers a lot of entertainment - many out-loud laughs and a variety of entertaining songs.  <br><br>Toni Collette's talent reservoir seems bottomless - she can act, sing AND dance.  Nia Vardalos also sings sufficiently well, and her easy, comic manner nicely leavens the somewhat hysterical character played by Collette. Together, the actresses are genuinely entertaining as they work their way through the list of Broadway standards.  David Duchovny, in a role that could have been painful to watch in less competent hands, instead brings an unusually light and friendly touch to the role of Vardalos's love interest (Aside:  where's he been?  He's cuter than he's ever been in his life - stop languishing at home with Tea and Madelaine!).  <br><br>Yes, the ending is silly; pay attention - I already said the whole movie is silly.  But did I laugh loudly several times?  Yup.  Hysterically a couple of times?  Uh-huh.  Did I enjoy the musical numbers?  Definitely.  Will I ever feel the same way about the song \"Mame\" again?  Not hardly.  Did I get my money's worth?  You betcha!","user":"Skeptic-8","rank":[45,49]},{"title":"Lots of Fun","rating":9,"date":"19 April 2004","review":"If you go looking for an Academy favorite, you'll not enjoy this film.  If you want to laugh yourself silly and just have a romp with fun, this will be a blast.<br><br>Toni Collette is perfect as a woman pretending to be a man pretending to be a woman.  From the moment she catches herself NOT lowering her voice followed by an attempt at a drag queen's overdone smile, she wins you over. Her silly and girlish character is a winner....especially after opening an unknown package in the car.<br><br>Nia Vardalos will never win an acting award, but still has fun developing her own roles that she clearly writes for herself.  She exudes self confidence, taking on the leadership role of the friendship.  She allows us to see the weaknesses of her character here, however, making it a happy departure from My Big Fat Greek Wedding where she was so full of self doubt.<br><br>\nYou'll be hardpressed to find better on screen chemistry between any two people that will be beat Collette and Vardalos in Connie and Carla.<br><br>David Duchovney and Stephan Spinella are also highly effective in the role as anguished brothers, ultimately proving the well known theory about blood and water.  Duchoveny, within moments can make you hate his character and then go doe eyed for him again.  Spinella came close to making me cry.<br><br>These four are surrounded by a wonderful ensemble cast, who were gratefully not over stereotyped.  They were not portrayed as bitchy, fingernail weilding mockerys of the drag queen stereotype, but rather as caring individuals who feel they have a common bond and love enough to go around, regardless of your orientation, job description, or gender.<br><br>Go see this one.  Even is it's just for the music, which by the way, is awesome!","user":"Campdmg","rank":[43,48]},{"title":"very funny, likeable cast","rating":10,"date":"31 March 2004","review":"I just saw this yesterday, and thought it was excellent. The first half hour is a little slow and predictable, but once the movie gets going it is very funny. Yes, there are drag queens and when we saw it a few people walked out. But most of the crowd - a few kids, college students, and mostly older retired people - loved it! There are many funny scenes, and the movie itself could be called a musical, as there are plenty of renditions of broadway songs with the ladies dressed in drag. It is a cute story, the drag queens are very likeable and the movie makes some attempt to understand why they dress in drag, and to be understanding about the rest of the world's perception of them. Not everyone is ready to see a movie starring some drag queens, but for those that can look past that, it's a heartwarming story about friendship and acceptance :o)","user":"charys","rank":[33,38]}]