[{"title":"A wonderful fantasy film","rating":8,"date":"23 September 2003","review":"After the wild but fully justified furore surrounding Spirited Away, Studio Ghibli's next production is a much lower key affair, clearly aimed at a younger market. Having said that, this cynical thirty-something loved it to bits. Ghibli purists seem to be somewhat snobbish about the studio's output, but If this is an example of one of their films designed more for harmless family entertainment, I can stand to see a lot more of it.<br><br>\nThis is a wonderful fantasy film, cute and funny, and full of remarkable and memorable characters. The animation is solid and detailed, occasionally even breathtaking, and the soundtrack is gorgeous. The brisk running time ensures the light story doesn't outstay its welcome. In fact, I could easily have watched more, and I'm already looking forward to Ghibli's or Miyazaki's next flight of fantasy.","user":"Mike Astill","rank":[40,42]},{"title":"Another gem by Studio Ghibli","rating":9,"date":"20 May 2006","review":"'The Cat Returns' is yet another treat produced by Studio Ghibli, the company which brought us masterpieces such as 'My Neighbour Totoro' and 'Spirited Away'.<br><br>The story of this film is much simpler than previous Studio Ghibli productions/epics with a typical modern teenage girl Haru as the heroine. When walking home from school one afternoon, Haru rescues a cat from being ran-over by a lorry only to discover she is responsible for saving the life of Prince Lune, the heir apparent to the Cat Kingdom. Lune's father, the King of Cats, promptly decides the best way to repay such a favour is for Haru to marry his son. Naturally, our heroine is horrified at the prospect and must seek protection from enigmatic Baron, founder of the Cat Bureau, for help before she is carted off to the Cat Kingdom by the very determined cats.<br><br>As a cat-lover, I found this film utterly adorable. The scene where the cats from Cat Kingdom descend on Haru's street in the middle of the night was had a very wondrous aura to it and the scene where the cats try to make Haru laugh at her feast was hilarious. The characters, as always, are solid from the refreshingly normal teen-aged Haru to the grumpy Muta to the suave Baron (even though he's an animated cat, the charisma of the character will leave many females empathising with Haru's little crush on him!).<br><br>Although the plot of 'The Cat Returns' is a simple affair so it will easily appeal to young children, there is much humour in the film that will keep older kids and adults amused. Also, those who love cats can't help but fall in love with the many feline characters we come across in the film. Now, I'm off to track down 'Whisper of the Heart', which is a 1995 Studio Ghibli film that features the character of Baron.","user":"cosmic_quest","rank":[28,29]},{"title":"Simple but entertaining","rating":8,"date":"19 April 2006","review":"Short but sweet- is probably the best way to describe this movie. Unlike other epics created by studio ghibli, such as Nausicaa of the valley of the Wind and Spirited Away, this movie has a very simple story and feels more like a really long episode of a TV show rather than a movie. The characters are somewhat developed but there just wasn't much time to do so since the story felt rushed. However, this is still a very entertaining film full of subtle humor.<br><br>The only gripe i have with this film is that the Disney DVD is DUBTITLED. Disney forgot to translate the movie and tries to pass the script for the English dub as the translated subtitles.","user":"swordplanet","rank":[40,44]}]