[{"title":"It's good. But Underrated.","rating":9,"date":"24 September 2008","review":"I really enjoyed watching this. There are 2 Inspector Gadget movies, the first one was made in 1999. This is the second one, but it doesn't continue from the 1st since it is a different director and it was released straight to DVD. This film is an alternative to the second film. If you didn't like the first film and wanted it to be more like the cartoons, then this one is for you. I liked both IG movies. This film introduces a new robot - IG2. The movie has an entire different cast, and Dr Claw's face is hardly ever seen like in the cartoons Nice special effects too, with a cartoon-like \"let's stop the bad guys\" ending. I find it funny and enjoyable.","user":"mariomurderer111-1","rank":[11,12]},{"title":"MUCH more faithful the the cartoon!","rating":8,"date":"12 March 2003","review":"Although IG2 is a bit sillier than the first movie, it's MUCH more faithful to the cartoon - once again Gadget says \"wowsers!\" (compared to \"wowser\" in the first one) and Dr. Claw (called both Claw and Dr. Claw) is faceless again.  There is also no \"John Brown\" - it's just Inspector Gadget. Penny, although she has different hairstyles throughout the film, often wears her hair in her trademark pigtails of the cartoon.<br><br>At first I thought that Elaine Hendrix would be awful as G2, but she proved me wrong.  She played her part extremely well.  Although French Stewart doesn't have the boyish charm of Matthew Broderick, he acts more like the Inspector Gadget of the cartoon.  (And don't worry - he doesn't try to play Mr. Magoo!)<br><br>This movie is also amazingly cartoon-like.  The best way I can describe it is a \"live-action cartoon\".  It's live action, but with all the silly stunts of an animated cartoon.  (Such as a scene involving Gadget getting his head stuck in a toilet.)  Although the CGI wasn't as good as it could have been, it wasn't too awful.<br><br>If you're looking for a film that's true to the cartoon, IG2 is definitely worth seeing.  Be warned, though, it's quite silly!  :)","user":"DesertHedgehog","rank":[17,23]},{"title":"more of a cartoon turned movie then sequel","rating":5,"date":"20 January 2004","review":"if u look at this movie and you are a fan of the cartoon you will notice that this movie is very closer to the cartoon then the first one. that said it is just an avarage movie funny but too stupid and the lead actor French Stewart is bad but to be honest makes a better gadget them matthew broderick. claw is protrayed better by the director and writer.. for exsmple in the cartoon you never see claws face and he always escapes...<br><br>all in all so bits of this movie should have been in the first one and if they had it would have turned the first one into a better movie... it is fun but dont watch it as a sequel watch it as another adventure.","user":"Ash-Attack","rank":[8,10]}]