[{"title":"A Brief History of Mine","rating":9,"date":"17 April 2004","review":"The story of young Stephen Hawking's doctorate - starting with his 21st birthday in 1963, shortly after which he was diagnosed with motor neuron disease. The story continues with Hawking going to Cambridge to gain his doctorate, during which he fights to come to terms with his illness, grows ever-closer to young student Jane Wilde, and has to figure out something to write his thesis on... ...All this is told in flashback by Nobel Prize winners Bob Wilson and Arno Penzias (Tom Hodgkins and the marvellously irascible Michael Brandon, respectively), talking in 1978 about their discovery - the \"3 degree hiss\" of microwaves that is the echo of the Big Bang, which is the proof of Hawking's remarkable and evolutionary theory that he formulated for his doctorate thesis. Hawking didn't come up with the idea of the Big Bang, but he did show mathematically that the prevalent theory of the time - \"Steady State\", in which the universe was thought to be unchanging and to have existed forever - was wrong.<br><br>The performances are uniformly excellent, with Benedict Cumberbatch in the lead role making for a very convincing Hawking, capturing his brilliance and vulnerability well and portraying his physical deterioration sympathetically and convincingly. Other standout performances include Tom Ward as Roger Penrose, giving a superbly confident and energetic portrayal of the young professor who was Hawking's friend and mentor; John Sessions as Dennis Sciama, quiet and intense as Hawking's supervisor; Peter Firth as a triumphantly and permanently bad-tempered Fred Hoyle, with whom Hawking locked horns over their contradictory theories on the origin of the universe; and Lisa Dillon as Jane Wilde, who gave Hawking the strength to overcome his illness and realise his ideas.<br><br>Is this a sanitised or oversimplified story? Undoubtedly, but these things always are. That doesn't matter; the main characters are engaging, and the science is extremely well-handled. Hawking's \"eureka\" moment, when he literally falls off a train and desperately explains his idea to Penrose by drawing with chalk on the station platform, is powerful and moving and believable in equal measure. This drama shows that it's not just the great artists, the painters and composers and musicians, who have led remarkable and fascinating lives - science, in its own way, has just as much power to move and intrigue, and scientists have just as many great stories to tell.","user":"Kasterborous","rank":[34,35]},{"title":"Hawking in the early 1960s -- delightful","rating":9,"date":"25 October 2010","review":"For those perhaps shy of this film thinking it may be grim or depressing -- it's quite the opposite. It's about Hawking in his early years -- getting his doctorate at Cambridge in the early 1960s, long before incapacitation set in.<br><br>This is Hawking in his green and wide-eyed youth, when he was just starting to wrap his mind around the amazing theories that changed theoretical physics and astrophysics. The film is joyful and uplifting and engaging and intriguing. It's not esoteric, and can certainly be followed by non-physicists such as myself.<br><br>And in case you've been under a rock lately, Benedict Cumberbatch is the finest young actor in the UK, and gives an unmissable performance, as usual.<br><br>Highly recommended for everyone!","user":"angelofvic","rank":[39,42]},{"title":"Entertaining and Insightful","rating":8,"date":"8 March 2012","review":"Initially thought it'll feel like a documentary. But was pleasantly surprised. Not many of us know of how Hawking came to be and how his formative days were. Hence from a biographical point it was very insightful, though it covers only the first few years of his professional life. And the various facets showed in the series is what keeps it from being a documentary and more of an entertainer. The direction is quite good and so is the editing , considering how much they could show and how much they actually had time for. One of the first times I saw Cumberbatch and he is really great,he has the ability to take on any role and make it his own, the energy and passion he shows in this one is no less,wonder if there's a lot of method acting training in his past or he is naturally gifted. Overall a great watch, so see it.","user":"pavanratnaker","rank":[15,15]}]