[{"title":"Great scenes, great setting, decent story, mediocre direction...","rating":6,"date":"30 June 2012","review":"Rum Diary (2011)<br><br>If you're looking for the craziness of later Hunter S. Thompson, you'll find shreds of it here. In a way this is a more cogent movie than say \"Fear and Loathing\" but it's also a bit prosaic beneath the wilder stuff that peppers the surface. Johnny Depp stars and runs the show in his usual strong if uninspired way as a new, hard-drinking reporter with a failing English language newspaper in Puerto Rico.<br><br>There is a true surface here that's pretty amazing--the cars, the low down rot of the apartments, the racism between the rich white Americans and the indigenous Puerto Ricans. The depth you might expect and want here is slim, however, even though all the pieces are in play for a great drama--a charming troubled writer in a land filled with prejudice and violence and great natural beauty. It pushes the clichés too hard, and it's generally agreed (even by Thompson) that the material is weak and \"rambling.\" The movie doesn't rearrange it enough to make it work.<br><br>You can in a way watch this for those surfaces, if you don't need too much more. There are several secondary characters who do their best to be a bit insane, including Giovanni Ribisi as a drugged out waif of a reporter, something like what Thompson himself might have become later in life. (See of course the Depp in the imperfect 1998 \"Fear and Loathing in Las Vegas\" for a sense of the famous freewheeling selfish addled sometimes brilliant Thompson.)<br><br>The director here also adapted Thompson's book and if he gets the credit for the nice ambiance of the film he also gets the burden of how clunky, choppy, and sometimes slow it is, even with such exciting material. It's not a horror, it's watchable, but you'll flag here and there. Even the end, without giving a thing away, is a bit deflating.","user":"secondtake","rank":[30,38]},{"title":"'Heres to Pretty women, with dirty thoughts'","rating":9,"date":"15 November 2011","review":"I adored the novel, The Rum Diary and as an aid worker I related to many of the character's struggles. Although the film does stray quite a bit from the book itself, I think it's a perfect homage to Hunter S Thompson. The language still reeks of his Gonzo fury writing and manages to transport the audience into a drunken rant, as well as secretly educating them on the struggles of a free press. It had me laughing out loud on more than one occasion, as well as the packed out cinema that I viewed it with. <br><br>I rated this movie a 9 and the last film I rated that high was The Shining. I personally think this film was perfect. The leading actress/actors were perfect and the supporting cast phenomenal, especially Giovanni Ribisi. The only problem with this film in my opinion is that if you are not a fan of the gibbering, artistically nervous tone of most of Thompson's work, this film may be too heavy for you. Although it's easier to follow that Fear and Loathing (which scrupulously stuck to the dialogue from the novel Fear and loathing), many would find the dialogue bizarre.<br><br>Personally I loved every minute of this film and think it's already truly underrated.","user":"nells_place","rank":[75,104]},{"title":"bad representation of an amazing book","rating":2,"date":"2 November 2011","review":"If you have had the pleasure of reading the great book from Hunter S. Thompson, \"The Rum Diary\" this film is not for you. And even if you did not read the book, this film lacks drama, cinematic style, character arcs, a hooking intro, and satisfying end. I am not sure if the writer/director Bruce Robinson spent the time to really READ the book. It's a DARK comedy, not a lighthearted love story. Hunter S. Thompson (played by Johnny Depp) was very depressed at the time, getting wasting, working minimal amounts, and having sex with any Puerto Rican girl that was interested. None of this was portrayed accurately in the film. <br><br>One key factor that Bruce Robinson screwed up was eliminating the character of Yemon, which was crucial in the book. Instead this Robinson combined three characters into two, which isn't true to the book and does not work on screen. Another factor missed was the bar Al's which played a big role in the book. This was the local bar in which all the works at the newspaper went to everyday and got wasted at. Besides the two lead characters in the film, all the workers were alcoholics and Robinson failed at exposing the working environment of the newspaper.<br><br>The ending of the book was tremendous; the boss Lotterman has a heart attack and dies when he thinks one of the employees was going to beat him up. Instead of using this great ending handed to him, Bruce Robinson steered away from that and it fell flat at the end. <br><br>All in all, when adapting a book like \"The Rum Diary,\" you have to stay true to the heart (balls) of the story. Bruce Robinson missed the dark tone of the book, did not develop the characters and the environment to its fullest extent. On top of that did a terrible job of exposing the beautiful landscape of Puerto Rico, shooting everything much too tight not allowing the viewer to get a true feel of the surroundings and native people. Instead of wasting your ten bucks at the cinema sit down relax and read an amazing book by Hunter S. Thompson, \"The Rum Diary.\"","user":"jeremypb","rank":[74,105]}]