[{"title":"xXx","rating":4,"date":"8 March 2020","review":"Hollywood should know by now that if you dumb down a dumb film in the sequel you are heading for disappointment, There was lots of action and explosions but I found myself very bored and fading in and out of the film, The dialogue and acting was even worse this time round, The story was so predictable I had no love for it, I didn't mind too much that Ice Cube took the main role but he does nothing to make this a good movie, The first was goodish because it was dumb fun but this one is just dull and unimaginative.","user":"MR_Heraclius","rank":[39,47]},{"title":"xXx2: Coma State","rating":2,"date":"30 April 2005","review":"A film that should be retitled xXx2: Don't Say We Didn't Warn You.<br><br>Opening with an impressive first 7-8 minutes, this film moves into cookie cutter territory at a frightening speed and continues to derail any opportunity for the audience to engage in the ridiculous plot or heavily computer generated action sequences.<br><br>Ice Cube will never be thanking the academy (he at times look like he would struggle to play himself), but the Razzie committee should be on the lookout for this up and comer, this type of dribble is the cinematic equivalent of being run over repeatedly by a truck with the stereo cranked up to 11.<br><br>The first xXx was at least assure of itself, popcorn action with the acknowledgment that it was bang for buck and nothing more. State of The Union takes itself far too seriously with a plot so absurd you swear it was written by a focus group of 13 year old boys after a binge at McDonalds. Action sequences are spaced every ten minutes or so as bookends to move Cube onto the next dilemma, each new sequence becoming further and further detached from reality (the final twenty minutes is utter insanity that makes films like Charlie's Angels: Full Throttle seem like documentaries). A sequence involving a train should be parody material, not a serious plot device.<br><br>Samuel L Jackson cashes in his paycheck and plods through the movie looking as though he just read the script and realized what he has got himself involved in. Scott Speedman's looks too immature to play a senior NSA agent and is largely in the film so the white folks don't feel left out. Willem Dafoe typecasts himself as the overacting bad guy yet again and X-Zibit pops in so he can possible audition for the lead in the next sequel xXx3: Turkey Season.<br><br>Women are treated as fodder to either slap around or grind up against (sometimes at the same time) all to a soundtrack of nameless rappers inserted at appropriate moments so that the white kids can know what its like to be African American.<br><br>My only positive comment on this whole debacle are the cars used in the film, not being a car enthusiast even I had to be quietly impressed by the rides in this film. Also this film is under the 2 hour mark a sign of a film that does know when its wearing out its welcome.<br><br>Hopefully with the resoundingly negative response xXx2 has currently received another sequel looks unlikely, as films like this are about as satisfying as a having your nose broken.","user":"pkeevers","rank":[210,286]},{"title":"Much funnier than \"Johnny English\" - too bad it's not supposed to be a comedy.","rating":2,"date":"2 May 2005","review":"\"xXx2: The Next Level\" (Revolution Studios and Columbia Pictures changed the subtitle from \"State of the Union\" for international territories, for obvious reasons) comes from the director of \"Die Another Day,\" which was terrible; producer Neal H. Moritz, whose last credited project was the dire (and thankfully now-cancelled) \"Point Pleasant\"; is a sequel to the dreadful \"xXx\"; and comes equipped with Samuel L. Jackson's stated dislike of making movies with rappers. On this showing, you can't blame him.<br><br>Trading in Vin Diesel (his character is written out by someone saying that he got killed in Bora Bora) for Ice Cube is no improvement; not only is he not the most expressive actor, but he's not that convincing in action (when he's being chased by Scott Speedman you just KNOW that Speedman would catch him like that (snaps fingers) in real life). In fairness to Mr. Cube, he's far from the only thing wrong with this; Simon Kinberg's screenplay seems not only to have been aimed at emotionally and intellectually stunted 13-year-olds but written by them as well, with the plot starting idiotically and continuing from there - the villainous Secretary of Defence played by Willem Dafoe is so pantomime villainous that when he makes a speech to Jackson you're surprised he doesn't laugh maniacally.<br><br>Suspending disbelief is one thing, but when you have a movie that expects people to believe that tanks can be handled like motorbikes... and which works in such daft plot turns as characters having their deaths faked just so they can be around for the climax (why not just kill them there?)... and that has a finale which depends on a car and a Presidential bullet train being able to fit on the same track despite the car being a compact if speedy sports car... in this case it's just impossible. Admittedly it doesn't help that said scenes are incompetently executed thanks to shockingly bad special effects and shoddy direction; some of the miniatures are glaringly obvious, and I particularly hope that lead effects house Industrial Light and Magic didn't do the CGI bullet train shots. And as for the way some of the shots go from film to what looks like video and back again...<br><br>The cast isn't much good either, although it's fun to see Peter Strauss as the President (in spite or because of his not sounding like he believes a word of this); Xzibit not only helps parts of this seem like \"Pimp My Ride: The Movie\" but he can't act, Dafoe is Special Guest Villain level, and Jackson phones it in. As for the female characters, Nona Gaye and Sunny Mabrey are pretty much defined by their cleavage and by the fact that one's good and the other (the one who looks like a cross between Nicolette Sheridan and Rachel Bilson) isn't. (The movie can't even be laddish properly; for some reason the sexiest woman in the movie (Masuimi Max, who plays Xzibit's girlfriend and who helps out with the robbery of the artillery-carrying cheese truck) isn't listed in the credits.) And the tiresome, crowbarred-in rap numbers don't help, certainly not compared to Marco Beltrami's score. (Ironically, at one point on hearing the female string quartet Bond our hero complains about the music; they are not to blame for the aural wrongs.)<br><br>\"xXx2: Whatever\" is so unexciting and so absurd that despite its stabs at relevance (our hero claims Dafoe is hatching \"World War IV\"), the only way to get through it is as a laugher; the sight of Ice Cube in a suit and tie (with umbrella!) is funnier than his intentional attempt at comedy later in the same scene. To make it worse, the last scene leaves the door wide open for a third movie... if it does happen, why not cast Scarlett Johansson or Charlotte Church as the new Triple X? It's not like realism is a key factor here.","user":"Victor Field","rank":[65,90]}]