[{"title":"Good stuff","rating":7,"date":"16 July 2005","review":"Having watched the film (more than once)i must say that i think that the person who wrote the comment \"A Stupid and Extremely Disappointing Movie\" is being silghtly childish. You cannot watch a film like Van Helsing with out taking it with a pinch of salt - it is a movie with vampires, werewolves and the frankenstine monster in at all at once for goodness sake. So you cannot go in to it thinking in a literal sense. You have to accept that it is not going to be some ground breaking epic and that it is just a bit of fun - but at the end of the day that doesn't matter, because if you go in with the right attitude and you enjoy it, then what does it matter that it is a bit \"off\" in places. I thoroughly enjoyed the film and would definitely recommend it to any one who likes action/fantasy films and is up for a bit of fun!","user":"georginaashdown","rank":[231,302]},{"title":"Silly, lacking in plot, but good fun","rating":7,"date":"21 November 2004","review":"It's big, it's dumb, it's cheesy as hell, but I found it to be enormous fun. This was made to be a roller-coaster ride and by that token it should be judged.<br><br>Actually after the opening pastiche of the Boris Karloff Frankenstein movie, I thought this had the potential to be a 5 star movie. It was very atmospheric and had me hooked. However the film never really captures any sense of magic from there onwards.<br><br>The main body of the movie does go on a bit, and it could have done with some attempt to create engaging characters. Plot and story are not always necessary for fun movies, but you do need characters with a level of interest to capture the mind, otherwise you tend to find yourself not giving a s**t. I felt Van Helsing did verge into this territory, but for the most part it's so fast paced this doesn't matter so much. The points where it does try to introduce plot are the moments where it really does fail. In fact there is too much going on that is never really explained, and I think it would've been better not to have bothered at all, than use the nonsense Sommers resorts too. For example the attempts at backstory to Van Helsing. Better to have one of those interlude chatty scenes you have in the Indy films, where it establishes he's a dude, rather than the poor attempts at angst and pathos. Really bad was the moment he gets upset over Frankie's Monster. What the hell was that all about?<br><br>Hmm maybe I took that a bit seriously, but the movie knows what it is, why try be something else. I also thought that that masked ball sequence was a natural conclusion, the eventual finale at the castle felt like an add on, which lacked any real punch.<br><br>Far better was Van's introduction to Transylvania, with the benefit of some neat angles and panning shots, the crossbow battle with the brides was cool. The coach chase was exciting without being exhilarating, but kept the flow going, so it's a shame some more bad plot gets thrown in, especially when it was involving the underwritten Velkan. That's the film's main problem - overkill of characters, with little space given to any of them to evolve.<br><br>Finally a word on the CGI. I thought it was very good, especially the morphs that were used. The very first moment Drac starts to turn made me jump a touch, and when the vampires turns into their fanged, contorted state it looked pretty scary to me. The wolfman transformation, with the ripping flesh looked genuinely painful. At this point I was thinking the CGI was genuinely stunning. I'd have preferred the finale if it had just been Van vs Drac though, having CGI characters fight felt uninvolving, and Drac in snarly state was far better than the beast he turns into.<br><br>This is a movie to genuinely switch of the brain and enjoy. At times there's too much going on and perhaps a bit too much swinging about for my liking, but it's an adrenaline filled ride. I'd probably give it 7 out of 10.","user":"Axel-9","rank":[171,236]},{"title":"It's Just Camp","rating":6,"date":"11 January 2005","review":"I'm really baffled at the hateful negative response to this film. No it's not Oscar material, it's just good campy fun. If you're a fan of old monster movies, James Bond and Indiana Jones flicks, and over-the-top humor in an action/horror movie, then you get it. I guess if you're looking for a summer action flick that takes itself too seriously, then you're out of luck with this one.<br><br>I admit that the film runs a little to long, the chemistry between Beckinsale and Jackman leaves something to be desired, and the Frankenstein \"monster\" (though well-intentioned to give a nod to \"Young Frankenstein\") is really annoying. But the entertainment spawning from the hokey fun that \"Van Helsing\" is all about, makes these flaws so forgivable.<br><br>For me, I'll take the over-acting screaming Brides of Dracula, the silly homages to dozens of classic action and horror movies, the cheesy one-liners, and the not-so-convincing special effects. Isn't that what monster movies are all about?","user":"Bastard Out of Carolina","rank":[240,340]}]