[{"title":"The politically correct version of the flight of the phoenix!","rating":7,"date":"26 December 2005","review":"Almost 40 years after the original the 2005 version shows how much the world has changed. To start off with there is a woman passenger in this film unlike the original where the only female was an exotic Arabian dancer (although a mirage). In this version the frail girl passenger is a foul-mouthed oil driller who wears the obligatory tank top and spandex pants once the boiler suit has been discarded.<br><br>In addition to this we have two black men, one who is the co-pilot. In the original the Mexican dies in the ill-fated march through the desert however in 2005 the Mexican survives. (The writers are probably sensitive to the many Mexicans who die trying to cross the Arizona and Texas border in hot conditions). In fact he defies almost certain death when the wing of the new construction collapses on top of him but survives. In 1965 the cocky Scotsman survives but in the 2005 the Scotsman perishes in the shoot out with the nomads. Interestingly, we are still aloud to use nomads as the cruel bad guys, again in the original it was the Arabs who were the barbarians, that won't cut today, so it's probably why outer Mongolia was chosen.<br><br>However, the writers slipped up with their choice of the anti-hero. In the original the blond hared blue eyed bespectacled trouble maker was a German called Dorfman, who menacingly portrayed the stereotype of Nazi arrogance and superiority who audiences back in 1965 (20 years after the war) could easily hate; yet he turned out to be the hero in the end.<br><br>To bring it up to date and really be politically correct they should have used a Muslim. We all could have hated him but then hailed him as a hero in the end too. All in all a pointless remake and for die-hard fans of the original they may have a hard time swallowing this one. The original, which is a longer movie, is superior in portraying the hopelessness of their predicament as well as the underlying tensions between the survivors. Cowardice and bravery are on show in the 1965 version, but in this one ---, just stupidity!","user":"dgrahamwatson","rank":[105,139]},{"title":"The Flight of the Repeat","rating":5,"date":"12 October 2006","review":"Comparing this new version to the original would be comparing a farm horse to a thoroughbred from the Kentucky Derby. This version has new actors filling the shoes of established characters, and yet none have the quality to hold the story on course, causing it to crash like their airplane. The original had James Stewart and Richard Attenborough, both with performances worthy of academy awards and established the foundations of a true classic. In addition, the rest of the cast stood of themselves and even Ronald Fraser gave a most stirring performance as Sgt. Watson. Superior veteran actors like Peter Finch, Hardy Krüger, Ernest Borgnine, Ian Bannen, Christian Marquand, Dan Duryea and George Kennedy, all gave the original solid star power and allowed the Phonix to rise from the screen into the memory of it's viewers. This new version has Dennis Quaid as Frank Townes, sympathetic enough, but far less convincing of his character. All in all, the new version falls, like most remakes, well short of the original. Sorry, but this film should have been left in the desert with the remains of the fallen airplane. **","user":"thinker1691","rank":[37,53]},{"title":"ho-hum remake","rating":4,"date":"6 January 2005","review":"\"Flight of the Phoenix\" is at best a so-so remake of the fine Robert Aldrich adventure classic from1965. The plot in both films is fairly simple and straightforward. After a plane crash lands in the Gobi Desert, the survivors hit upon the notion of rebuilding the damaged vehicle in the hopes of flying it back to civilization. Dennis Quaid assumes the role, originally filled by Jimmy Stewart, of the pilot who, against all odds, endeavors to lead his passengers to safety.<br><br>Although the new version follows the original fairly closely in terms of both character delineation and plot development, the story doesn't seem quite as fresh today as it did when we first encountered it close to 40 years ago. Perhaps what's missing is the guiding hand of a master craftsman like Aldrich to really deliver the goods (John Moore, a far less distinguished director, is manning the controls here). This \"Flight\" feels awfully predictable and rote, as we plow our way through each of the various survival threats, rescue attempts and internecine personal conflicts that are standard in all such tales of survivors stranded in a hostile environment. Each of the characters steps out of the shadows to have his or her own Moment in the Sun (yes, in this version, there is actually a woman aboard), before receding dutifully into the background to allow the next person to do the same. About the only intriguing element in the story is the fact that the main character, the pilot of the plane, has to actually be talked into participating in the Quixotic rescue plan. Thus, he is a leader and a hero more by default than by design.<br><br>Although the crash itself is fairly impressive from a technical standpoint - despite a rather phony-looking, computer-generated sandstorm that brings the plane down - once we end up on the desert floor, the movie doesn't do a particularly effective job conveying the truly grueling nature of the predicament these individuals are facing. We never really get the sense that they are just a few water droplets away from dying of thirst or heatstroke. Moreover, the feat that they are able to accomplish seems barely credible - from a sheer mechanical engineering standpoint - given the lack of resources and expertise with which the group has to cope. The main weakness with a film like \"Flight of the Phoenix\" is that, when the plane goes down, we're stuck in the desert right along with the characters, and if they don't have anything particularly interesting to say to one another, we can feel just as stranded as they.<br><br>Thus, despite a few quality moments, this \"Flight\" never manages to get off the runway. Check out the original instead.","user":"Buddy-51","rank":[128,204]}]