[{"title":"A powerful film about loss and being alone resolved into belonging through a Football Firm (gang).","rating":16,"date":"16 March 2005","review":"5 Stars; A truly great film, with a powerful story. Beautifully photographed, in London, Wow! The audience was quickly involved, and laughed, started, and gave a standing ovation at the end. Truly a complete film, thank you for having a real ending to the film, which is so rare these days. Never apologize for this film, it is loving, stark, caring, hard, honest, violent, and beautiful. It touches the emotions, and the feeling of not belonging that exists within many of us, and that longing for love and brotherhood, that is not available without some dire costs. The characters were so clearly human, powerful and conflicted one was drawn to care for everything that happened to them and cheer at their triumphs and sit in horror at their losses.<br><br>I have recommended that everyone see this film during SXSW. My wife and I were expecting an audience award for the film, which it easily won, however the Jury Award was also won and we were give true appreciation for the jury system at SXSW.<br><br>Beautiful photographed, with outstanding music, this production hits all the marks out of the ballpark and should be studied for how powerful film today could be. This is the level of film making I aspire to achieve.","user":"sbarcik","rank":[187,258]},{"title":"SXSW'05 Best Narrative Feature (Jury and Audience)","rating":9,"date":"28 March 2005","review":"As one of the privileged few who saw the world premiere at SXSW (even badge holders were turned away), Hooligans is sure to be one of the most talked about films of the year.<br><br>Lexi Alexander, who, according to her Q&amp;A answers at the premiere, grew up amongst the type of men depicted in Hooligans. The choice to use an American as a central character was deliberate, to quickly get into the story and see the lifestyle from an outsider's perspective.<br><br>As a wrongfully expelled Harvard student, Matt (Elijah Wood) decides to stay with his sister in England, and is reluctantly befriended by his brother in law's brother Pete (Charlie Hunnam). Wood deftly plays the passive introvert ripe for the seduction of group-bonding violence Hunnam's charismatically surly Pete, who introduces him to football (aka soccer) and the 'firms' who are known for their violence against rival teams' fans.<br><br>Without glorifying the violence, fully realized and likable characters explore how easily someone can be drawn into hooliganism. Instead of using broad strokes, Alexander demonstrates through Matt how even the most unlikely people get caught up in mob mentality and violence, through the bonds of friendship and belonging.<br><br>With an edgy soundtrack and strong performances, Hooligans leaves a lasting impression.","user":"mysticwit","rank":[83,110]},{"title":"HOOLIGANS is the best of this genre so far","rating":10,"date":"10 March 2005","review":"First of all there hasn't been a good film about English Football Hooliganism. Both ID in 1995 and last years FOOTBALL FACTORY either failed to convince or just went down the familiar exploitative road of glamorising the buzz and thrill of violence.<br><br>HOOLIGANS as the title suggests depicts what these aforementioned films centre upon with the added value of having a story and characters you care about. There's no avoiding the cliché's as the ranks of these organised gang members are portrayed as gangsters.<br><br>Similar to BBC's Gary Oldman drama THE FIRM broadcast in 1986 it also show the characters as normal members of society, family men with respectable jobs. FOOTBALL FACTORY took the extreme and unconvincing scenario that these weekend animals are florist's during the week which might be amusing but the subject matter of organised territorial football hooliganism needs to be given a serious look at.<br><br>Fortunately HOOLIGANS portrays this more realistically, sure there's the stereo types in designer clothes (The Chavs) as we call them now where loyalty, respect, revenge, dignity and pride are what they live for, not the enjoyment of the actual sport. This simply acts as the excuse to fight in a traditional gang warfare environment. The prospect of West Ham's cup tie with Millwall brings joy to the faces of both sets of fans.<br><br>Casting Elijah Wood is a bold move, he looks like a Choirboy but this adds to the films main storyline of innocence corrupted. The acting is better than average, despite letting his cockney accent slip on occasions, Gang leader Charlie Hunnam shows a genuine mix of anger, aggression and compassion which holds the film together.<br><br>This won't win awards but it's refreshing to see a film finally tackling the subject matter that unfortunately has been a shameful factor of Britain's attitude towards football as we are constantly under threat of being disqualified from International tournaments due to the bad behaviour of soccer hooligans.","user":"pitz42","rank":[212,305]}]