[{"title":"A great, great movie even for those (like me) who don't like golf!","rating":8,"date":"25 April 2006","review":"Bill Paxton has taken the true story of the 1913 US golf open and made a film that is about much more than an extra-ordinary game of golf. The film also deals directly with the class tensions of the early twentieth century and touches upon the profound anti-Catholic prejudices of both the British and American establishments. But at heart the film is about that perennial favourite of triumph against the odds.<br><br>The acting is exemplary throughout. Stephen Dillane is excellent as usual, but the revelation of the movie is Shia LaBoeuf who delivers a disciplined, dignified and highly sympathetic performance as a working class Franco-Irish kid fighting his way through the prejudices of the New England WASP establishment. For those who are only familiar with his slap-stick performances in \"Even Stevens\" this demonstration of his maturity is a delightful surprise. And Josh Flitter as the ten year old caddy threatens to steal every scene in which he appears.<br><br>A old fashioned movie in the best sense of the word: fine acting, clear directing and a great story that grips to the end - the final scene an affectionate nod to Casablanca is just one of the many pleasures that fill a great movie.","user":"themcquade","rank":[58,63]},{"title":"Impressed","rating":8,"date":"26 February 2007","review":"I was extraordinarily impressed by this film. It's one of the best sports films I've every seen. The visuals in this film are outstanding. I love the sequences in which the camera tracks the ball as it flies through the air or into the cup. The film moves well, offering both excitement and drama. The cinematography was fantastic. <br><br>The acting performances are great. I was surprised by young Shia LaBeouf.He does well in this role. Stephen Dillane is also good as the brooding Harry Vardon. Peter Firth, Justin Ashforth, and Elias Koteas offer able support. The film is gripping and entertaining and for the first time in my life actually made me want to watch a golf tournament.","user":"suessis","rank":[26,29]},{"title":"A movie you can watch with the whole family.","rating":10,"date":"8 September 2006","review":"This movie gives golf a high mark, it was well acted and well directed. Giving you a view of history that some non-sports fans will enjoy. The historic factor alone gives it a high rating, the Brookline golf course was really done well. I am in the northeast and have seen Brookline as a fan, and as someone who loves the game. The movie was well done on all levels. A MUST SEE 5 stars. The acting was superb, Disney has another winner in its bag of Great movies. If for no other reason watch the film to give hope and encouragement to young people whom may not see the hope in their life. I would tell you that the setting, while in the late 1800's and early 1900's is very realistic. The costumes and dialect were right on the mark as well. Above and beyond the call of duty for a golf film. A Must see for fans and non-fans alike.","user":"wtsimmons","rank":[28,32]}]