[{"title":"spoiler.who really directed the ending?","rating":27,"date":"27 February 2004","review":"SPOILER ALERT a very good movie all the way through the 2 hours plus...until the killing of tom robbins's character.all he had to say was \"let me take you where i threw the child-molestor's body\".if he w a n t e d to die,then that was not made clear.after that, we don't see any confusion or grief  in sean penn's face when he hears they found the real murderers.the discussion with kevin bacon is so underplayed,like they do not really care or they are relieved the movie ended.what about arresting him?or okay if he doesn't  want to, what about bacon's partner laurence fishburne?he was the driving force trying to find the murderer and questioning bacon's priorities.what happened to him?he disappears leaving sean penn's character almost smiling at the end.where is the grief for killing his friend or for his daughter?and laura linney?i am sorry for what they did to you.such a talented actress.but who could pull it off, the monologue she gives at the end when we do not know anything about her character and what made her react like this.all the psychological journey we are experiencing through out the movie from a director who seems to value the human condition prepares us for a climax,a purge (of some kind at least).instead, we are left with an ending with full of questions and more important with a \"who cares\" mentality that destroys the prior two hours.it could have been a great movie.will the dvd have an alternative ending?(not a \"good\" one necessarily,but a better one).just joking.i am sorry for any grammar errors but english is not my first language.but movies are.","user":"expe67","rank":[162,189]},{"title":"Second time around","rating":8,"date":"8 November 2005","review":"I must admit that when i watched this movie for the first time i didn't really think that much of it. Sure the acting was amazing, but that was expected. But then something happened. I got a chance to read the book by Dennis Lehane and suddenly all the pieces fell into place. I watched the movie again and this time it was amazing.<br><br>I don't know how i should interpret how my feelings toward this movie changed after reading the book. Is it a good adaptation if i like it more after reading the book? Should a movie stand so well on it's own merits that the book is not necessary? I don't know myself, all i know is that it all became so much clearer after reading the book.<br><br>First of all the acting was amazing even the first time around. But still, after reading the book it was as if the characters gained one more level of depth. I have always felt that Tim Robbins is the true gem in this movie. His pained portrayal of the lost soul Dave Boyle is pure magic, seldom has an Oscar been so well deserved. Sean Penn is predictably great in his portrayal of Jimmy Markum. It's a difficult character, a person you really don't know what to think about. In one respect he is a worried father, in another respect he is a cold-blooded man with few things to like about him. The rest of the cast is solid, with Kevin Bacon the brightest star among them.<br><br>When it comes to the plot itself this was where much was changed from reading the book. The trick is not to watch this as a crime-drama. Rather it's a movie about behavioral patterns, about humans. What they are capable of and what dictates their actions. There are huge amounts of sadness and melancholy to this story. Of people unable to break out of the path it seems life has chosen for them. This i think didn't really break through to me that well when i watched the movie for the first time. But the book is much more clear on this and when i watched the movie again i saw it there as well.<br><br>In the end this is a triumph of two things really. First the great acting of some of the finest actors in Hollywood today, second the sensitive and thoughtful directing of Clint Eastwood. He manages to bring out Dennis Lehanes story in a way that is so understated and minimalistic at times i didn't even catch on the first time around. But if i look closely all the elements are there and it is truly a great adaptation as well as a great movie.","user":"Antagonisten","rank":[137,168]},{"title":"Falls sort of greatness but superb nonetheless","rating":30,"date":"30 November 2004","review":"Lovers of great acting had best not pass up 'Mystic River,' Clint Eastwood's powerful, award-laden adaptation of Dennis Lehane's best-selling novel. Sean Penn, Tim Robbins and Kevin Bacon play three working class Bostonians forever bound together by a mutual childhood tragedy that has since gone on to define the kind of people they've become and the kind of lives they've led. The film begins with a brief prologue as we see the three youngsters - Jimmy, Sean and Dave - out playing in the street one day, when they are confronted by a pedophile who, posing as a policeman, tricks one of them, Dave, into getting into the car with him and another man. Fast forward to the present as we pick up the trio as grown men who have, for all intents and purposes, gone their separate ways. Penn is Jimmy Markum, a former petty thief who spent two years in the slammer but who has since turned straight and now owns a neighborhood liquor store. When Jimmy's daughter from his first marriage turns up murdered, the three men's lives intersect in ways they could never have imagined. Bacon is Sean Divine, a homicide detective assigned to the case, and Robbins is Dave Boyle, a sporadically employed man who may be a prime suspect in the murder. Dave still lives with the trauma of that earlier soul-shattering experience, while Jimmy and Sean wrestle with why they managed to escape the cruel finger of fate that pointed so grimly at their hapless playmate. The film is about how the events of our early lives (and, in the case of Jimmy, it doesn't stop at this one incident) can end up coming back to haunt us later down the road.<br><br>The Brian Helgeland screenplay makes the pain that each of these men experiences vivid and palpable. The grief Jimmy feels over the loss of his beloved child, the psychological torment Dave suffers as a result of his abuse, and the bewilderment and loneliness Sean experiences from a failed marriage all become integral to this dark tale of bitterness, revenge and attempted healing. At times, we do find ourselves wishing that the script would concentrate less on the details of the murder investigation and more on the inner workings of the three main characters. Too often we feel as if we are only scratching the surface of the roiling psychological torment taking place deep in the bowels of these men. The plotting, particularly towards the end, often feels more contrived than it needs to be, with heavy-handed ironies and obtruding parallelisms that don't seem to know when to leave well enough alone. Laura Linney, as Jimmy's second wife, has a key Lady Macbeth moment late in the film that might have been effective had we been more fully prepared for it and had her character been more thoroughly developed throughout the course of the film. As it is, the scene seems to come out of nowhere and leaves us both bewildered and hanging.<br><br>Still, these are minor quibbles when it comes to a movie as finely acted and directed as this one is. Penn hits all the right notes as a man facing the worst experience life could possibly throw at a person - the murder of one's child - trying to make sense of a tragedy that defies any rational explanation. Robbins beautifully underplays the role of a man scarred forever by what happened to him in his youth, now endeavoring to function as an adult when he was robbed of any semblance of a childhood. Bacon is excellent as the man who attempts to put all the pieces together, not only of the case but of the shattered lives he and his two buddies have been living all these years, and Marcia Gay Harden is outstanding as Dave's loving wife who struggles with what is perhaps the greatest moral dilemma faced by any character in the movie. Linney, Lawrence Fishburne and Tom Guiry offer fine supporting performances.<br><br>As director, Eastwood allows his superb cast ample time to develop their characters, never hurrying the proceedings along and always allowing the conversations to play themselves out. He recognizes the quality of the material and feels no need to gussy it up with self-conscious camera angles or fancy editing. He also uses the bleak settings of blue collar Boston as an effective backdrop to the stark, chilly tale he is telling.<br><br>Perhaps it is just an odd coincidence that three of the very best movies of 2003 - '21 Grams,' 'The House of Sand and Fog' and 'Mystic River' - all suffer from the same tendency on the part of the filmmakers to move away from reality and towards melodrama and contrivance in the final act. Of the three, '21 Grams' and 'The House of Sand and Fog' are harmed less by this than 'Mystic River' because they have a somewhat deeper thematic base and richer character development than does the Eastwood film. Still, 'Mystic River' is a mighty impressive achievement for those who made it and a rich, memorable experience for those who see it.","user":"Buddy-51","rank":[228,304]}]