[{"title":"I Honestly think the Hype Killed this Film.","rating":7,"date":"18 October 2005","review":"Before Cabin Fever came out.. the word in the horror world was that Cabin Fever is one of the most gruesome, bloodiest, scariest, funniest, craziest horror movie ever. So when it opened in theaters, everyone's expectation was sky high ..even mine. Yes, I was kind of disappointed with Cabin Fever because it was hyped so much. I mean you had Peter Jackson the director of Lord of the Rings saying in the trailer this is one of best horror movie he's ever seen. Now if I did not go in with such huge expectations, I could had enjoyed it for what it was. I really started enjoying Cabin Fever once it started playing on cable. Every time it comes on I watch it and I begin to love this film a lot more.<br><br>Cabin Fever is directed by up and comer Eli Roth. He's a guy that loves horror films and mentioned in several articles this movie pay homage to his favorites like Evil Dead.<br><br>Cabin Fever is about 5 college kids who had just finish test finals and are enjoying some relaxation and fun in a cabin in the woods but the fun is cut short when they learn a flesh eating bacteria disease is around. The main character Paul is played by Boy Meets World actor Rider Strong. Rider was surprisingly good in this movie and Paul is the character you root for the most to not get the disease.<br><br>The movie is funny. The funniest movie ever? Hell no! This movie is scary. The scariest movie ever? Hell no! This movie is bloody. The bloodiest? Hell no! So I'm finally enjoying the movie for what it's worth and it is and has a potential to end up being a horror movie classic. There are tons of films that people hated when it first came out and then come to love it semi years later. Cabin Fever I believe is one of them.","user":"sunset-at-night","rank":[134,185]},{"title":"An unfairly judged cult flick","rating":8,"date":"14 October 2005","review":"This film has been unfairly judged! It is in fact a very good 80's style, Splatter, B-movie. It shys away from the self referencing humor plague that Scream started and succeeds in being a very strange splatter/comedy. Several reviews have been posted that say the characters are unlikable and do illogical things through the course of the movie. The characters are very good representations of the youth of the late 90's. The hunting squirrels joke is a perfect example. When asked why he is hunting the squirrels, the character replies, \"Cause their gay\". How many times have you heard a teen respond to a question in such a manner? Eli Roth has captured very well the essence of of being a teenager in this very cynical society.The actions the characters take are, in context, very believable. Ask yourself, if you were in a situation where you had to deal with the very likely possibility of becoming infected with a horrible flesh-eating disease, would you be the first to lend a helping hand to the infected? Another thing that has been trashed by many reviews is the strange sense of humor the film has. The pancakes scene in particular. The humor in the film is the strange sort you would more likely find in a Troma film (not the sex/toilet variety, though)While it's not for everyone, the sense of fun the movie has about itself is more suited to hardcore B-movie fans than mainstream audiences. Eli Roth hearkens back to a time when movies weren't always about psychological thrills,bad twist endings, and pretentious artistic \"meanings\", when they were about fun. It's a great movie to sit around with some friends and watch. So please, don't judge it so harshly, just because it's a movie to be taken straight with no shocking hidden meanings or twists. Hopefully this film will find it's audience with the cult movie crowd. Highly recommended to anyone with a love of B-Movie cinema.","user":"ReelSplatter","rank":[150,236]},{"title":"What's up with this movie?","rating":1,"date":"22 September 2003","review":"I wasted 5.75 to see this crappy movie so I just want to know a few things:<br><br>What was the point of the dog being split in half at the beginning of the movie, the disease had nothing to do with being split in half.<br><br>What was the point of dragging Karen into the shed, she already totally infected her room, they could have just locked her in there where she would have been safer.<br><br>Why would the Hermit be running around the forest asking strangers to help him when he could have just asked his relative, the hog lady, to take him to the hospital?<br><br>Why didn't any of the characters bother to walk into town to get help when things started getting bad, are they all really that lazy?<br><br>Even if Paul was threatened by the guy w/ the shotgun for peeping on his wife, Paul could have just sent Jeff or Bert back to the house to ask for help. the girl he loves is deteriorating.<br><br>What was the point of the box?<br><br>Why did Jeff go back to the cabin after he left when everyone else was getting infected, if he was that big of a jerk to leave in the first place wouldn't he have just gone back home?<br><br>If the police went to all the trouble of gathering up the kids and burning them on the fire pit, why did they throw Paul halfway into the river, it wasn't even necessary for the plot because the water was already contaminated.<br><br>Who makes lemonade out of river water, that crap has dirt leaves and bugs in it. Why couldn't the two kids have just use the tap water, it was contaminated too, so the stupid ending would still work.","user":"Sizzle007","rank":[65,102]}]