[{"title":"I laughed, I laughed some more, I almost threw up, and laughed some more.","rating":10,"date":"2 August 2003","review":"I gave this movie a 10 out of 10 because for a comedy it made me laugh continuously.  Not a minute was wasted.  Even if the situation was totally absurd, as many were, the conviction of the actors in their roles was enough to keep it going.  Stiffler and Finch's rivalry reached new highs and lows in this one as they compete for the affections of Michelles virgin little sister Cadence.  Fred Willards addition in this third movie was welcome, even if his role was subtle.<br><br>I can't think of anything bad to say about this movie. The plots were simple but believable.. How complex can a wedding story be anyways.  It made sense, it was funny, it was definately funnier than the second american pie movie.. im not going to say it was funnier than the first but I definately laughed longer and harder in this one.  Well done. Plus Alyson Hannigan is somehow getting hotter as the movies progress.","user":"Professor Chaos","rank":[11,12]},{"title":"Long Live the Stifman!","rating":9,"date":"9 May 2004","review":"There's one thing you have to say for `American Wedding': like the two `American Pie' films that came before it, it is unapologetically unashamed of its shamelessness.  Here's a film that doesn't try to hide its gleeful perverseness under a bushel of coy double entendres; instead the film revels in its frank and openhearted treatment of sexuality and lust.  `American Wedding' is clearly a comedy about sex and it doesn't pretend to be anything but.  Whether this is a good thing or a bad will, I suppose, depend on your own affinity and tolerance for jokes and images that routinely push the boundaries of common decency and good taste.  In fact, the film wears its tastelessness almost as a badge of honor.  And just in case you're unfamiliar with this series and its brand of humor, subtlety and wit are not considered virtues in an `American Pie' world.<br><br>In `American Wedding,' Jim and Michelle - he a self-described pervert and she a self-described nympho - have finally agreed to tie the knot.  The film centers around Jim's attempts to convince Michelle's square, uptight, sexually repressed parents that he is indeed husband material for their less-than-innocent daughter.  The problem is that his efforts are consistently being undermined by the inane, out-of-control antics of Steve Stifler, the foulest-mouthed, dirtiest-minded professional adolescent this side of Bluto Blutarsky.  Seann William Scott, in fact, steals the show as Stifler, providing an over-the-top manic energy that is both endearing and infectious.<br><br>Indeed, without Stifler, there would be precious little to recommend this particular `American' outing.  The jokes and setups, for the most part, are crude and graphic without being very imaginative, and writer Adam Herz and director Jesse Dylan, even when they hit on an inspired piece of silliness (as when Stiffler winds up dancing mano a mano with a guy in a gay bar), end up diluting the humor by letting the scenes drag on well past the point where they're truly funny anymore.   This is not to say that there aren't a few good laughs in `American Wedding,' just that they don't come often enough to really lift the film much above the ordinary.  Luckily, the funny moments increase a bit in the final stretches of the movie.  In the film's defense, I would also add that, like its two predecessors and unlike many sexually charged teen comedies, `American Wedding' conveys a certain affection for its characters.  In addition to Stifler, Jason Biggs as Jim and Eugene Levy as Jim's befuddled but strangely tolerant and supportive father come across as decent, well-meaning and likable individuals.<br><br>The film itself may be uneven, but as a character actor who makes an indelible impression on the material at hand, Scott is the genuine article. He transforms what is essentially cinematic rotgut into sweet-tasting vintage wine.  All hail the Stifman!","user":"Buddy-51","rank":[34,45]},{"title":"Hahahaha","rating":10,"date":"7 August 2003","review":"I loved the first american pie, but was so dissapointed with the second. it was too direct, lacked creativity, and got old. (sorry to anyone who loved it). but ii was delightfully surprised with American Wedding. The sexual jokes flowed much better, it was all situational as opposed to 'hahaha look at my wang', and in general just got more laughs. It is a great movie to see in the theater while your in the mood for something like that, and a lot of fun. although half the original cast is now gone, the remaining few are a good mix for the last of the american pie trilogy. stifler is kinda crazy and unbearable in the beginning but bear with it, it eventually works with the story and gets better. This is such a cute movie.. and yes i use the word cute. Its hilarious, but not so over the top that it looses the sweetness of it, being the fact that the main point of this movie is the wedding of jim and michelle. What a great, mindless piece of entertainment!","user":"bretta23","rank":[18,25]}]