[{"title":"Greengrass's style for these kinds of movies is just perfect","rating":8,"date":"21 December 2008","review":"Bourne is an intelligent guy He's not Bond who relies on potential gadgetHe has that cleverness to think on his feet, improvise, make up a plan, and execute it with unbelievable talent, using nothing but what's in front of him <br><br>Matt Damon has got all the Bourne elementsgreat actions, really cool ability, a great sense of immaculate timing and a little bit of understanding thrown in too Demon's instincts are profound where the given character is actually very gloomy <br><br>Jason Bournean ex-CIA agent infused with violence, is a man who's killed people in cold bloodAnd yet you feel he's at war with himself Jason, is above all, emotionally truthfulThat's what director Paul Greengrass have done hereIt's that feeling of realism, of truthfulness <br><br>The car chase is magnificent It is about desperation Jason has got to get to his young woman's apartment to say sorry That was his only aim in that moment <br><br>Joan Allen brings that cool, cerebral intelligence to the part of Pamela Landy She's a worthy opponent for Bourne <br><br>\"The Bourne Supremacy\" takes us to real places in Europe like Berlin where the East-West conflict was focused; to Moscow, a place of uncertainty and peril and good fortune and to Goa, India's most charming of state capitals","user":"Nazi_Fighter_David","rank":[60,75]},{"title":"Excellent movie with a disappointing touch...","rating":7,"date":"13 February 2005","review":"I was torn while watching Bourne Supremacy. I'll just go ahead and say this before I mislead. I loved this movie! Unfortunately one key aspect just about dragged this film under the water. The camera was far too unstable. It was obviously done intentionally by design choice, but it was excessively overdone. Through action scenes that had you at the edge of your seat, you'd just come to realize that you were only trying to see what the heck was going on. This made these scenes a little hard to enjoy. But not only was it the action scenes; even during quiet still scenes the camera would always seem to be moving, and eventually was giving me a headache. Just to serve as a warning, it's pretty much like that throughout most of the movie, so brace yourself for an adventure of epileptic proportions.<br><br>-- However -- The acting was close to brilliant in my opinion. I don't think the casting for Jason Bourne gets any better than Matt Damon because he fits the part perfectly. The rest of the cast all pretty much played their parts well, so I am pleased to announce that there aren't any exceptionally bad actors or actresses. In addition of the immersive storyline, it created a much enjoyable film. For a sequel, this actually surprised me because I enjoyed this movie as much as I did the first. If you're into action flicks, this definitely will not bore you. If you liked the first movie, then you'll most likely be very pleased with the conclusion.","user":"gravfire","rank":[247,336]},{"title":"More of the same, but it's welcome","rating":8,"date":"27 December 2004","review":"The Bourne Identity was one of those films that some people will love for being different to the average action film, but others will hate for it daring to be 'too' different. Unlike the majority of action movies before it, the first Bourne film, despite having stunts and explosions never put it's emphasis on them, as the focus was always on the central characters and their use of brains, rather than brawn to accomplish their goals. The sequel is basically more of the same, but it's a welcome return in my opinion, as cinema needs films that are different to the majority. It's also a good thing as I'm a big fan of Matt Damon. It's unfair that he should continue to get lumped in with Ben Afleck due to their friendship as he has a lot of talent and I think that the fact he's gone for more art orientated films as opposed to the dumb blockbusters his friend was drawn to like a moth to the light shows that he has a genuine respect for cinema. He stars as the title character; Jason Bourne, who, like the film itself is hardly your average action fare. He doesn't utter one liners shortly before or after blowing someone away, nor does he spend most of the movie trying to look cool; espionage is the order of the day and it works very well in the context of the film.<br><br>Because it's plot heavy, The Bourne Supremacy requires the viewer to watch, and the large amount of talking goes some way to distancing this from most other action movies. However, this could also be seen as a bad point as it can, at times, hinder the movie in the excitement stakes and make it difficult viewing for those that do like their action. The movie spans across Europe to a number of different countries including Germany, Britain, France and Russia and this keeps it exciting as it allows the landscape of the movie to change constantly and the film doesn't dwell in the same area. In fact, the film is very efficient on the whole and it never overindulges in anything, which compensates for the amount of talking and allows it to be exciting. Despite it being more stealthy than most, time is still found for a number of high-octane sequences including fist-fights, explosions and a great car chase that looks as if it could have been lifted straight out of Grand Theft Auto.<br><br>Overall, I would say that this is a slightly lesser film than the original, but there is still much to like about it and fans of Bourne will no doubt enjoy themselves. It's also recommended if you're sure that every action movie since 1988 is a Die Hard clone...","user":"The_Void","rank":[153,210]}]