[{"title":"A cut above the normal...","rating":3,"date":"3 February 2006","review":"With Green Butchers (aka: De Grønne Slagtere) we are in the territory previously marked out by Sweeney Todd, Eating Raoul, Delicatessen and the like: art house cannibalism. The peculiar flavour of writer-director Anders Thomas Jensen's film is partly explained by this choice of subject, as well as his involvement in the Dogme film movement, having contributed scripts for Mifune (1999), The King is Alive (2000), as well as Open Hearts (2002). The Dogme movement has made a virtue of making films to a strictly naturalistic series of rules, the severity of which, whether entirely serious or not, was intended to \"force the truth out of characters and settings.\" Green Butchers is not a Dogme film, but some of its characteristics owe themselves to an artistic manifesto which instructed its adherents to make films by all means available, even \"at the cost of good taste\" if necessary.<br><br>It's Jensen's second feature film after the well-received Flickering Lights (aka: Blinkende Lygter, 2000 - a film which also starred Mikkelsen and Kaas), another comedy-drama. Jensen's sly, dry humour is much in evidence here, too, as we follow the business of his two misfit butchers, 'Sweaty' Svend and pot smoking Bjarne, into the path of making meals out of unwanted humans. As critics have observed, this is a film with two intertwined threads, with much overt, and grisly, dark comedy revolving around Sven, a man who \"has never been loved.\" He's apparently unable to show anyone the inside of his freezer without adding them to the chilled cabinet for the customers next morning, prepared as his speciality dish 'Chicky Wicky'. Bjarne's story brings to the narrative more in the way of pathos and sweetness as, while struggling with the predations of his increasingly erratic partner in butchery, he also has to come to terms with the sudden revival of his brain damaged twin brother, as well as burgeoning relationship with the slightly naïve Astrid.<br><br>Playing both Bjarne and twin Eigil, Nikolaj Lie Kaas is remarkable in giving entirely separate performances throughout, so much so that I was going to make him a name to watch, but a quick look at his filmography reveals that he has already made 28 (including one related to his portrayal here, the notorious Dogme film Idiots of 1998) of which no fewer than 20 will have appeared in the last five years! The Walkenesque Mikkelsen, who is perhaps most familiar to British and American viewers as Tristan in the recent version of King Arthur, is also memorable, offering up Svend's characteristic, sweaty, culpability whilst sporting an unnaturally high, damp forehead (an on-screen effect gained, we learn, by a watering unit ingeniously devised by the special effects department).<br><br>In the interviews which accompany the film on disc, Jensen mentions how keen he was to \"make something better than farce\" out of his subject matter and, if it has a fault, it is that his film occasional teeters too far in the opposite direction, refusing some obvious opportunities to show the comedy of panic or grim humour. Instead, Dogme's metier means that Green Butchers unfolds slowly, with more natural pauses and silences, and an unforced lunacy all of its own. Such deadpan absurdity frequently pays dividends (one especially relishes Svend's quiet words to the newly returned Eigel, soft toy under his arm, that he should \"point the giraffe somewhere else, so that we can talk calmly again\") although there have been complaints from some that a sharper edge to the bloody proceedings, other than those demonstrated by Bjarne and Svend's knives, would have been welcome. To be sure, some cannibalistic movies, such as Romero's Dawn Of The Dead bring an apt comment on consumerism. Instead Jensen's film relates slaughter back to interior matters such as Svend's compulsive, murderous need to be loved and successful - a result he eventually achieves through his marinade - or even by placing the act of butchery in a entirely different context outside of society altogether. For instance the comment by Holger, famous for his deer sausages, that \"It's mythological to kill an animal and then mock it by sticking it in its own intestine.\" Outraged by the role that nature played in provoking the death of his parents, Bjarne sees his work as specifically an act of revenge on animals, not people, a logic that places him apart from such characters as Sweeney Todd. While the eager consumers of Chicky Wickys queue up outside the shop eager for their next portion, obvious satire is played down. In interview, the cast and writer see the film's focus elsewhere, on \"coming to terms with one's fate,\" or learning to live at peace with oneself.<br><br>Of course interior states are always subjective rather than objective. And if the Dogme creed values strict naturalism, then Green Butchers is a film which, although related to the movement by eschewing overt dramatics, it never the less inhabits a separate, almost fantasy world of its own - another point acknowledged on the DVD's accompanying interviews. It's a place not unaopposed to the fertile and dark imaginations of Caro and Jeunet (to whose successful Delicatessen it has sometimes been compared) if without their Gallic flamboyance, and whose odd elements gradually fit into a weird whole. Indeed the last scene of the film makes the point succinctly, drawing together the principal characters in a moment that is both playful, absurd and unifying at the same time. Given the unique nature of Green Butchers (how often does one see a Danish cannibalism movie?) as well as uniformly excellent performances, it can be recommended.","user":"FilmFlaneur","rank":[29,31]},{"title":"A very dark, sober and realistic comedy","rating":8,"date":"25 December 2004","review":"De Grønne slagtere or The Green Butchers as it is called in English is a very dark comedy about two losers who work for a popular butcher. They are fed up with their bosses criticism and decide to start a business on their own. Their shop is expensive and it doesn't even have electricity all over the place. And to make things worse, they haven't got any customers (as their former boss predicted). When the man pays them a visit in their shop, he challenges them to provide the meat for a dinner party he organizes.<br><br>Than a tragic accident happens. One of the butchers locks the electrician into the freezing chamber when he closes the shop. The man dies and the neurotic one of the two butchers decides to cut fillets out of the electrician's thigh and serves it to the dinner party instead of calling the police. It's an incredible success. All at once every person in the village wants to taste that incredible \"chicken\". Overwhelmed by his sudden success the butcher sees no other option but to kill more people, who he can sell as chicken.<br><br>I guess that the subject cannibalism may not be enjoyed by everyone, especially not because it is shown with a lot of humor. Personally I liked it a lot. It shows perfectly how far some people would go for some social acceptance and to get out of their isolation. It may sound a bit far-fetched, but I'm sure you would be surprised to see how people in real life sometimes act.<br><br>Next to the original subject, I was also pleased by the actors' performances and the humor. There is no overacting, as you might expect in this kind of movies, it's all very sober and realistic (I guess that's typical for the Scandinavians and Scandinavian movies). The same for the humor. I'm sure I wouldn't have liked it as much as I did now if the humor had been over the top, or with a lot of farting, vomiting,... like you see so often in American movies. I loved this movie and I give it an 8/10.","user":"philip_vanderveken","rank":[39,45]},{"title":"Funny, well written, directed, acted and full of charm","rating":8,"date":"8 October 2005","review":"If you don't mind subtitles, you like comedy and truly interesting characters, along with a taste of something different from mainstream American cinema, then take a chance and rent this film.<br><br>Two contrasting friends, (one very neurotic sweater, the other the strong quiet loner type) working for a jerk butcher in a smaller danish town, decide to strike out on they're own together and open a butcher shop themselves. Not successful at first they incorporate something new to they're recipe and become an instant hit with the village.<br><br>That being an interesting story in itself, this smartly humorous film is laced with even more, (friendship, romance, crime, death, personal tragedy) that makes this film so funny yet riddled with numerous subtle interests that make it so interestingly funny yet warm and fuzzy.<br><br>A must mention is the characters created and the actors making them believable. You can have the best script yet if the characters aren't believable it can sink a film and with this, the directing, acting, character believability and story all mesh so well they make this a very entertaining film.<br><br>So, if your in the mood to stretch a lil, want to see something very good yet done a bit differently, then I suggest you rent this film while I'm on my way out to find more by director writer Anders Thomas Jensen.","user":"FilmFan777","rank":[21,23]}]