[{"title":"Me piaze (I like it)","rating":8,"date":"23 July 2004","review":"Very funny film composed by six short stories just like \"Miranda\", \"The Voyeur\" all by Tinto Brass and some of their habitual cast or crew.<br><br>You can find an excellent use of the came, light and the red color that is seen in nearly the six stories, and the nasty/loose girls ready for pleasure. Do you like being observed?  Another interesting matter that this movie includes. The last story is definitely the best of the movie. The name: Dime porca que me piaze!!! To conclude. It is Definitely a movie for Tinto Brass fans.<br><br>Non fans: Your choice.  8 out 10. Andres.","user":"Andres24","rank":[23,36]},{"title":"Brass is always Brass","rating":5,"date":"22 April 2004","review":"Fistful of erotic short films, just like \"P.O. Box Tinto Brass\" (1995). Half porno, half comedy - but really stupid comedy with strong flavor of italian 70-s movies. Now maestro Brass absolutely spitted on psychological stuff like \"Miranda\" or \"Voyeur\". Actresses looks like real \"girls next door\" - with cellulite and unshaved arm-pits. Don't look \"Fallo!\" if you waiting something from this film - it's for Tinto real fans only! So, Brass is always Brass! By the way, 'Fallo!' in italian means 'Oops!', not what you've just think.","user":"Shuyskiy","rank":[17,32]},{"title":"not sure what this film is supposed to be","rating":16,"date":"16 January 2012","review":"I thought this was an X rated movie when I picked it up. The erections are real enough, but if you're expecting anything like what you see in a regular porn film, you'll be sorely disappointed. Nudity, yes, but actual sex, very very little, probably .001% of the film. The woman's hair gets in the way of viewing what is actually going on in one scene. In another, the steamy shower door obscured most of the view. I think my two favorites both involve the guy on the bed. Each has a boner, one is partially covered by a towel and the woman gets dressed to go out. In the other, it is protruding mightily from the opening in his boxers and she rolls off the bed to sit on the edge and answer the telephone! What is the point of this film? I don't know. (on the handsome Morrocan waiter guy's erection in the first vignette, he can be seen rolling on a condom! He appears to and is briefly shown to be having sex with the wife, probably is, but we the audience don't see anything conclusive. He might not be. Who knows with this crazy movie!) It is far too much for regular TV and not nearly enough for a porno. Too bad because some of the guys really had the equipment and muscular bodies to do a really good show.","user":"jaroslaw99","rank":[6,9]}]