[{"title":"Lots of silly laughs,action and adventures in a funny movie","rating":6,"date":"22 February 2007","review":"The film talks about a trio friends(Seth Green,Dax Shepard,Matthew Lillard),later the death a childhood's friend ,they propose the making a hick by canoe into woods of Oregon territory.Their aim is the looking for of D.B Cooper bounty for carrying out the promise they made when were little boys .Cooper was a mythic high-jacker(nowadays famous by character played by Muse Watson in ¨Prison Break¨)who jumped from the airplane(1971) and parachuted,disappearing posteriorly,although his bounty was partially found.The misfit group fulfill a canoeing along the Columbia river where find numerous risks,rapid streams,waterfalls and get worse, besides in the surface encounters dangerous animals like a bear and a drug-cultivating rednecks.But also they know a beautiful girls(Rachel Blanchard and Christina Moore) living on a tree and an older mountain man(Burt Reynolds).<br><br>The picture mingles comedy,adventures,action,cynical sense of humor and is pretty bemusing.It's a crossover among ¨Deliverance¨even with the presence of Burt Reynolds and ¨City slickers¨as a Philadelphia young people who are going to countryside excursion.The movie displays several ingredients for the entertaining as glimmer outdoors,stirring canoeing,sexy-girls and thrilling pursuits.The humor is intelligent and bold though sometimes is gross-out.Most of the laughters and sight gags galore work acceptably,especially the jokes between the three friends,as when they flee of the dangerous rednecks and dropped underwater or when the damp trio sleep gather together.Wonderful landscapes are splendidly reflected by the cameraman Jonathan Brown and appropriate musical score by Christophe Beck.The motion picture is professionally directed by Steven Brill. Rating : Passable and amusing.","user":"ma-cortes","rank":[21,22]},{"title":"Absolutely hilarious!","rating":23,"date":"23 January 2005","review":"Okay folks, now, I am not the type of guy that enjoys toilet humour in films, but this one I am a sucker for. This is just a hilarious movie! I guess it just reminds me a lot of the times that friends and I used to go camping.<br><br>The story is about 3 childhood friends, who are brought together after the untimely death of another childhood friend. Going back to the treehouse that they used to hang out at, they find a treasure map from their dead friend, and decide to go on the trip to find the money. Along the way, they encounter everything from a bear, tree-hugging hotties, and a couple of pot growing rednecks.<br><br>This film has some of the funniest scenes that I have seen in a long time. Again, a lot of it is toilet humour, and people looking for a serious comedy, may not get the humour and walk away in disgust. The scene with the paper bags had me rolling on the floor. One of the funniest scenes in a long time. Plus, there are a lot of Star Wars references in this film, and that is always a plus from me! Check out this film, you will be pleasantly surprised! I guess I have not lost all hope in newer comedies as previously thought.","user":"croatiansensation29","rank":[61,75]},{"title":"A fun time","rating":7,"date":"4 September 2004","review":"Without a Paddle was a good movie if you're looking for nothing more than a laugh. Going to see this movie will pretty much guarantee a night well spent and a good time out. Although, this movie is pretty cheesy. The plot is cheesy. The laughs are cheesy. But, luckily it has some genuinely funny moments too to bring the movie through to its end. The acting is mediocre at best, but great acting isn't necessarily needed for a movie of this kind.<br><br>Nobody expected it to be an Oscar winner. Also, this movie doesn't need to get its laughs from raunchy moments and attempts at teenager humour like some other \"road trip\" movies. Overall, this movie is pretty good for its kind and would be a good date film or a good movie to see with friends.","user":"jordanandashley","rank":[79,99]}]