[{"title":"The 3-D thing didn't work for me but there is still enough style and silliness to amuse both kids and adults","rating":2,"date":"2 May 2004","review":"Juni Cortez is no longer with the OSS and is now a private detective, taking work where he can get it.  However, the President himself requests Juni return to service as his sister is in danger.  She has entered, and become trapped in, a deadly video game called Game Over which has been designed by the Toymaker.  In it he ensnares children's minds forever.  Juni is sent in to rescue her and team up to stop the Toymaker's evil plot.  Enlisting his grandfather's help, Juni sets out to win the unwinable level 5.<br><br>I usually don't enter a film series in the middle simply because it is often difficult to appreciate the third instalment of anything without having seen what has gone before.  However, when it comes to a kids' film, I was pretty sure that I could managed to battle through the labyrinth-like plotting of the Sky Kids series!  I started watching this film in 3-D (I had a 2 dvd set) but the glasses were a little uncomfortable and the colours looked funny all the way through.  After seeing a few items sort of float vaguely around my television I was quite unimpressed and decided just to go with the 2-D disk.  The plot is pretty thin (it's never really clear what the attraction of the game is or what the Toymaker even wants) but it sets up a colourful and enjoyable little ride through a computer game - which is delivered pretty well despite all it's silliness!<br><br>The main weapon in the Spy Kids' cannon is it's stars - both actors and director.  Rodriguez is a very good director when it comes to style and action and his influence makes this film a lot more fun than others likely would.  He is slick but also fully aware that he needs to make it `fun' and not just colourful and noisy.  It's all a bit silly of course but the 3-D gimmick is a little bit heavy at times (like the old films in the 50's that had actors punching at the screen) but it isn't that bad.  The reason the silliness doesn't really damage the film is because the actors seem to play to it - and a very fine series of performances these are.  Pretty much all the cast are good fun and their performances are about as hammy and fun as you can imagine.  Sabara is great fun - a cool kid without any of the horrid cutesy stuff that can happen.  I found Vega less fun as she was a little too smart for my liking, but she was still fun and the rest of the kids were suitably fun with not a bad performance between them.  The adult cast will provide much of the fun for the adults watching - there is a large number of Rodriguez regulars in the cast who all overplay to suit the sense of fun the film has.<br><br>Montalban is great fun. Forever Khan in my mind, he has a great voice and screen presence and he heavy makes the message of forgiveness work reasonably well and not just being mawkish like it should be! Stallone hams it up and has good fun even if his multiple personalities don't totally work.  Clooney has fun in his small role but the rest of the cast are all cameos some of them are used pretty well and got a giggle but others just show their faces.  However, they don't detract from the film and it at least will amuse parents to see people like Martin, Trejo, Cumming, Shalhoub, Buscemi, Paxton, Wood and Hayek.  The out takes at the end made me realise how good the performances were - it just never dawned on me that, although I knew it wasn't real, that 95% of this was shot on greenscreen - making acting to anything that little bit harder.<br><br>Overall, this is a silly film but it is one that kids will love.  The sheer sense of fun that Rodriguez brings to it is infectious and makes for a great 90 minutes with the kids.  The star cast made it more enjoyable for me and helped the sense that everyone was just enjoying themselves.  It is hardly a great film but it does just what you expect it to do and who can ask anymore than that? On the basis of this I will definitely be watching the first two films when I cross their paths. Sad - but true!","user":"bob the moo","rank":[26,32]},{"title":"irredeemably stupid","rating":5,"date":"28 August 2004","review":"What a mess. There are clever ideas here and there, a few laughs, the occasional decent special effect (I saw this on TV so didn't see it in 3D, which perhaps would have made the generally disappointing effects more impressive), but the lame, tossed-together script and the lack of any cohesion to the final product make this only barely watchable. This movie seems to just be going through the motions; you can't even call it formulaic because it barely attempts to even stick with any formula, it's more like random stuff thrown in here and there. As for the ending, well, it's main purpose was to create an excuse (and not a very good one) to have cameos by everyone who was in the first two movies (allowing them to list Bandaras first in the credits even though he's on screen for only a couple of minutes), and the final showdown is so utterly moronic that words fail me.<br><br>At the same time, I didn't actually hate it. I wasn't in pain watching it. It was a mindless Saturday afternoon movie and I watched it as mindlessly as I could and occasionally enjoyed it. But after the very fun second movie (which I thought superior to the first), this was a great disappointment. I'd advise skipping it.","user":"cherold","rank":[28,43]},{"title":"fun for the little ones, but the series is getting stale","rating":30,"date":"30 July 2003","review":"Get your little ones ready for the game of their lives, cuz `Spy Kids 3-D: Game Over' will tickle their little bitty funny bones. This third installment of the popular `Spy Kids' series is like its predecessors in that it's high-tech, high-energy, high-fun, and high on the pro-family moral messages. What's more, it's in 3D, which requires disposable glasses, handed out at the theater. On the downside, the Spy Kids theme seems worn out, the actors have out-grown their roles, and the strong family-values messages are disingenuous and schmaltzy. In short, the cow's been milked for all its got.<br><br>But, anyway, back to the fun.<br><br>In this new adventure, Juni and Carmen Cortez find themselves on a mission to stop the release of a virtual-reality video game, aptly titled, `Game Over'. It is purported to be the best video game ever, and lines outside toy stores are growing around the country. But, the ISS has learned that the infamous `level five' captures the mind of the player, entrapping him eternally within the game. The threat, of course, is that `The Toymaker', played by Sylvester Stallone, is really out to control the minds of our youth, and thus, our future.<br><br>It turns out that The Toymaker himself is already entrapped in the game, so the only way to stop him is to actually play it. The movie begins when Juni, eager to be an `independent PI' at the age of 10, is called back to duty to the ISS to enter the game and find his sister Carmen, who had already tried to invade it, but was suspended in level 4. Juni catches up to her with the dubious help of a few experienced beta test players, who are determined to reach the 5th level on their own.<br><br>The true essence of the film is to simply show the video game, and with the 3D glasses, the 80% of the screen time that game consumes is definitely fun and worth the ride. The funny thing is, `Spy Kids 3D' makes no attempts to hide the fact that the only reason for the film is to show game. To wit, the plot points are meaningless, even to the point where the script itself acknowledges it: Juni asks why the Toymaker is caught in the game, and the answer is a humorous hand-wave, `Oh, it just happens.' The plot and characters are hurriedly scooted along to the start of the game, which then goes on and on and on, till the end, when scores of famous cameo appearances pepper the screen, all having fun and making statements about the importance of family, and yada yada yada.<br><br>Oh, it's not that there is anything wrong with such pro-family messages. But conspicuously downplayed are the genuine circumstances and feelings that were the impetus in the first, and best, of the Spy Kids trilogy.<br><br>The 3D aspect of the film involves wearing glasses that give depth to the objects on the screen. There are two ways to do this, and unfortunately, Spy Kids 3D uses the old-fashioned way, from the 1950s, where one lens is red and the other blue. The film is shot with the two colors shifted in opposite directions, and depth is perceived by the distance of the shift. Unfortunately, this mutes colors so much, that the beautiful and surreal colors expressed in the digital photography are lost. I can only assume that this was intentional, so as to give the video game its own sense of other-worldliness, which again, was nice.<br><br>With all its wild-riding and fun, Spy Kids 3D is just a movie for kids, unlike the first of the series, which was much smarter and hence, enjoyable by adults, too.  So, best to drop off the little tykes at the theater with a baby sitter, and go shopping for a while. But, don't buy anything that's red and blue plaid, or your kids just may throw up on you.","user":"argv","rank":[10,13]}]