[{"title":"Melts noir and sci-fi in an animation blender (my 200th review!)","rating":7,"date":"19 October 2006","review":"A Scanner Darkly, Minority Report, Blade Runner, Sin City and Sky Captain and the World of Tomorrow  if you are a fan of any of these then this will be well worth checking out.<br><br>French animation project 'Renaissance' took seven years to make on a shoestring budget and tonight I finally got to see it at a private screening for the International Film Festival in Stockholm. My spontaneous reaction is awe; my further reflection is 'huh, neat' and closer analysis regrettably gets a resounding 'meh'. It is a gorgeous science fiction triumph on the surface, but scratch it or even poke it a little and its unnecessarily complex plot becomes glaringly apparent, as do the flat characters. <br><br>Nevertheless it is clear that the people at Onyx films have done something spectacular with the aforementioned surface. The visuals are staggering. They have used live action motion capture fitted into key-frame animation, with stark jet black and bright white contrasts and a heavily shadowed rotoscoped background. For those of you who are not down with the 'technical lingo', the film looks like a fully-animated Sin City. Its fluid, transparent, dark and stylized template is complemented by great lurid lightning. It's a vision. Yet much credit is also due to the crisp sound effects that take the form of humming futuristic weapons, suspenseful music, heavy raindrops and glass shards breaking. It's every tech-nerd's wet dream...<br><br>The film zooms in on an eerily-lit, bleak, futurescape Paris in which a major corporation called 'Avalon' has begun to interweave in the lives of the citizens with surveillance (think the fluid transparent screens from Minority Report) and genetic engineering. The latter leads to a mysterious kidnapping of young researcher Ilona (voiced by the lovely Romola Garai). Cut to our hard-boiled cop-on-suspension and protagonist Karas (Daniel Craig)  a man who takes the law into his own hands  who is assigned the case of finding and retrieving Ilona. During this case, he is being aided by Illona's sister with whom he also begins a love affair. A very half-assed love affair, if I may say so.<br><br>The world of Renaissance is remarkable. Director Christian Volckman takes a fair jab at melting the noir themes and the result is an urban jungle filled with cads, rats, femme fatales and lonely detectives that hide in the shadows of the seedy slum. The problem is that the creators undoubtedly felt the need to have extremely clear and spelled-out archetypes in the story, or the film would have been \"too surreal\" for mainstream audiences, owing to its lurid animation format. It follows then that we have a multitude of clichéd characters such as evil-laughing villains, sleazy crime bosses and butch tough-chicks who blow smoke every chance they get. It shoves noir in our faces, and it isn't necessary.<br><br>What is worse is that the dialogue is a little contrived. It seems as though every line exists for the sole reason of propelling the plot. This is nothing fatal because the plot is so complex once it gets going that it needs some clear direction. Daniel Craig helps here too by bringing a no-nonsense attitude to his hard-edged cop character. At one point in Renaissance, he is seen in a vivid car-chase that surely is one of the most adrenaline-pumping and top notch sequences of the film. Unfortunately, the novelty of the sci-fi visuals have worn off post this car chase and 'Renassaince' could benefit from being slightly shorter. In summary, a very interesting but flawed futuristic comic book experience.<br><br>7 out of 10","user":"Flagrant-Baronessa","rank":[69,73]},{"title":"Breath taking graphics, great story","rating":7,"date":"4 February 2006","review":"I've seen this film in avant-premiere at Imagina Festival in Monaco.<br><br>I saw the first trailer four years ago, and from this moment, I was waiting to see the final result. I haven't been disappointed.<br><br>It is a full 3d movie with a high contrasted black and white render. Clearly inspired by some comic books, such as the ones from F. Miller. In this optic, it goes one step further than the excellent \"Sin City\" adaptation from R. Rodriguez. This time, (almost) no Grey or any middle color, but a graphic style never seen before in a realistic animated film.(can't wait for scanner darkly)<br><br>The massive use of Motion Capture gives a lot of life and credibility to the characters and we forget really soon the technical aspect to concentrate on more classic elements, such as direction or plot. The direction stays sober and controlled despite the infinite possibilities of the medium, and that is a really good surprise.<br><br>The futuristic story (Paris 2053) makes it a classic sci-fiction movie and maintain the viewer interested till the end. Despite a classic base plot (an investigation that goes far beyond initial expectations)the atmosphere and some interesting recurring themes (genetics, absolute power of certain firms...)gives this movie a great interest.<br><br>Despite it is an animated film, this one is obviously not made for children. You won't find here any funny pet or any stupid family moral, only the cold reality. It is far closer to a good film noir.<br><br>I found that the setting is one of the best aspect of the film: we still feel the well known Paris, but it is morphed by a fine touch of futurism.<br><br>Nevertheless, I regret a few mistakes. The montage is sometimes a bit flat, one or two very cliché slow motion effects and some poor dialogs. Even though the technical is excellent, it shows its limits in some romantic sequences (a bit like \"final fantasy\" did). Those little things makes it a 7/10.<br><br>Altogether, it is a successful artistic challenge that you have to watch if you can. The director, Christian Volckman, knows how not to fall into potential traps (luckyly, they didn't ask John Woo to do the job!).<br><br>To conclude, it is a film with blasting visuals, an intelligent story and a wonderful art direction. Watch it if you can!<br><br>Please excuse me for the spelling mistakes.","user":"dixyfifi","rank":[109,123]},{"title":"Superficial but superb nonetheless","rating":7,"date":"18 September 2006","review":"One reason Pixar has endured so well, and been so successful, is that while their films remain technical marvels and visual mosaics, they have a story to match their style. And often very moving style at that: affecting, charming and cross-generational. That a lot Anime (speaking in broad terms) and a great many other animations fail to match their technical virtuosity with real substance is, I think (and I might be wrong) partly because either the makers aren't bothered with character and plot and focus far too much on sound and image, or the sheer effort that goes into making some animations is so enormous, so enervating that they don't have the energy to create a really engaging story.<br><br>That same cannot be said of Renaissance. There are flaws in its plot, but I'll get to that later. Those same flaws, however, are not reflected in the visuals - Renaissance is nowt short of stunning. The ultra-high contrast images (sometimes so high-contrast that is nothing but one face or one beam of light visible) and incredible detail are always impressive, always a joy to behold. The futuristic Paris on display is the grim offspring of Blade Runner and Brave New World; dark, murky, quite affluent and even clean, but shrouded in intrigue, corporate malfeasance, obsessed with beauty (capital of the catwalk, after all) and disguising the squalor and neglect of its labyrinthine passages with a veneer of monumental, sophisticated architecture.<br><br>It's a compelling environment, not entirely original, but great all the same. The film's much-touted 'motion-capture' technology and incredible attention to human and design minutiae result in images a black-and-white photographer would die for. Not that the detail prevents entertainment, because Christian Volckman crafts some superb action sequences: a hell-for-leather care chase, a couple of gruesome(ly imaginative) murders, several tussles in the dark and a nasty dust-up in a gloomy apartment. The locations are great, too (I want to visit the nightclub). While the central character of Karas is your regular off-the-shelf maverick cop, the other two female characters (who are sisters) are the real motors of the movie. Coming from war-torn Eastern Europe, products of a war, diaspora and a family spat, they're a compelling metaphor for Europe as a whole.<br><br>The film is tremendously atmospheric, its dizzying, swooping faux-camera moves and adult tone making for a very engaging experience. However, the plot... It never becomes more interesting than the initial hook, in which indefatigable plod Karas must find Ilona Tasuiev, a drop-dead gorgeous and pioneering scientist, after she's snatched from the street. The sinister corporation Avalon (is ANY corporation ever not sinister?), which she was working for on 'classified', projects are hell-bent on her retrieval, and soon Karas is up to his neck in official reprimands, dead bodies, cigarette-smoke and narrowly-missed bullets, and falling in love with Ilona's sister Bislane (very sympathetically voiced by Catherine McCormack), as he plumbs the depths of the city's sordid underbelly (and his own past).<br><br>Text-book noir, in other words, but while I enjoyed the film a lot more than Sin City (to which it bears a passing visual resemblance), the plot and resolution are dull, the theme of immortality being raised but never examined, and the shenanigans of high-rolling Avalon CEO Paul Dellenbach are also dull , undercutting a lot of the dramatic tension. The basic ideas are familiar sci-fi genre materials, and there's a nagging sense that the visuals and atmosphere are disguising the mundane material.<br><br>However, the film as a whole is lucid and perfectly coherent, even if some of the scenarios the characters get into occasionally feel like excuses for displays of technical wizardry. But it's the projection of life in Paris circa 2054, the vision of community and creation of another city from the ground up that makes this film something to behold. I may be taking it too seriously, and if that's the case I can at least say that it's superbly made, extremely entertaining (and pretty mature, too), and with an ambiance like no other.","user":"RolandCPhillips","rank":[67,80]}]