[{"title":"A so-so film that will please young children but not many others","rating":23,"date":"23 October 2005","review":"It has been many years since Kermit has been home so he gets on his scooter and heads back to the swamp. Driving down the road to the swamp Kermit reminisces about the first time he saw that road. He was only a small frog when he and his friends ventured out onto it for the first time  only for two of them to get picked up by a driver in a red truck. Kermit and his other friend were forced to set out after the truck to try and rescue their friends from the terrors of the outside world.<br><br>Using the hook of the famous Muppet character in his early years, this film delivers a version of Toy Story where Kermit is forced out into the unfamiliar world to rescue his friends (although where this leaves Muppet Babies in the Muppet universe is beyond me). The plot is basic though and lacks any real emotion or intelligence in the way that Toy Story was and the total film is pretty basic. It has a few laughs along the way for adults but mainly this will appeal to younger children who will be amused by the puppets and engaged by the bad guy of Dr Krassman. I doubt very much though that such basic antics will appeal to older viewers  certainly not to adult viewers who have fond memories of the wit and energy of the Muppet Show.<br><br>The voice work is all fine, with Whitmire doing a good job as Kermit, while Barretta, Goelz, Mazzarino and others all fill in well enough. The human cast are so-so; Haggard's not great and try as he might, Hostetter isn't that great a bad guy and can't pull of genuine menace and comedy  so he ends up doing neither particularly well. The tone of the film is overly comic and it does prevent it do anything of significance. Overall a so-so film that will please young children but doesn't do anything else well enough to be of greater value.","user":"bob the moo","rank":[6,6]},{"title":"a bit morbid...","rating":4,"date":"28 October 2006","review":"There are some very cute things about this film (especially the 'out-takes') and the usual Muppet humor prevails overall. There were some good jokes for the grown-up's as well. (My husband loved the tire tracks on one of the frogs.) However, I was a bit disturbed with the fact that the frogs were going to be dissected. My 3-year-old loved the Muppets, and I think the exaggerated acting was appropriate for her. But the repeated posing above these friendly frogs with sharp knives gave me a chill and frightened her. We talked it through, and she was okay in the end, but couldn't there have been a better climax for what is obviously a young children's movie?","user":"rlkrumland","rank":[5,5]},{"title":"Pretty fun Muppet film for kids.","rating":6,"date":"10 December 2005","review":"stars: Steve Whittemire as Kermit and other. Bill Barretta as Croaker and D'fly. John Kennedy as Arnie the alligator and others. Dave Goelz as Waldorf. Jerry Nelson as Statler.<br><br>Interesting little movie about Kermit when he was little. The good things about it were the great look the movie had due to the cameras they used to film it. It had funny references to the Muppets as they are today, including Kermit mentioning that he doesn't like pigs, an appearance by young men Statler and Waldorf and Arnie the alligator which was a character that appeared on the show and was in the Muppet Movie. The plot was that Kermit and Croaker the frogs are going to be dissected for a school project, but escape. Meant for little kids, but adults will enjoy it too.<br><br>My rating: B minus. 81 mins.","user":"TOMNEL","rank":[4,4]}]