[{"title":"IF you think you might like this, trust me, you will!","rating":12,"date":"12 November 2004","review":"Towards the climax of \"Seed of Chucky\", Chucky himself manages to subvert the ENTIRE concept of the ENTIRE series so far, and thus most films of its kind, by using simple reasoning. I have been dying to hear that from a \"slasher villain\" for, well...since the birth of slasher villains.<br><br>What a great time this movie is! \"Bride of Chucky\" reinvented what had become a dull, unscary franchaise as black comedy. \"Seed\" takes that ball and runs with it. Don Mancini, who created Chucky many years ago, finally gets a chance to direct and I think this film will get him jobs outside the series. He not only makes the fifth take on Chucky feel fresh- a major accomplishment in itself for any series that has gone on this long- but shows a flair for satirizing movie clichés (a certain object flies upwards towards the camera at one point and it's a gas considering how overused that shot has been in action movies of recent years)and has a strong visual sense- check out the floor of Jennifer Tilly's foyer for an unexpected laugh. And I've got to hand it to Ms.Tilly- the girl's a trooper for sure,letting herself be the butt of jokes, both cruel and crazy. This is balanced by a great scene- a lot of directors would have left it for the DVD- where she reveals that she's not the one note Hollywood caricature she's been built up to be. Add that to a gender confusion subplot, and a piss take on twelve step programs, and you've got something a hell of a lot smarter than most horror films. Hell, than most comedies.<br><br>Speaking of Hollywood, the refreshing thing for a movie that takes place there? It isn't married to tired in jokes- save for one great one for B-Movie fans- the name of Chucky and Tiffany's child- which I will leave you to discover for yourself. <br><br>\"Seed\" has the over the top humour of the best obnoxious comedies (\"American Pie\" comes to mind, but better examples probably escape me), and a surprisingly graphic amount of gore- this thing doesn't skimp on the blood. For the latter reason, no way will it cross over to a mainstream audience. It is what it is and is the most entertaining version of what it is, I think, possible.<br><br>What it all comes down to is, if you're on this page, reading reviews, you're probably a partial convert to a movie like \"Seed of Chucky\", and if you're wondering if you'll like it, I have to tell you, this movie doesn't skimp. It's got all the slasher movie essentials like gore and nudity, married to a crude, black, very funny sense of humour, and even some semblance of humanity. <br><br>What I'm saying is, you'll like it.","user":"belialprod","rank":[86,117]},{"title":"Stuff for fans","rating":10,"date":"2 May 2005","review":"Give it up, if you didn't like Chucky before, you are absolutely going to hate Seed of Chucky. I read many negative reviews prior to watching this movie and was quite ready for a major disappointment. However, it did not happen. In my opinion, the movie is the crown of the entire series, an ode to Chucky, the star of popular culture. Look how he refuses to become human ...superb! For a lover of camp, gory flicks, horror and parody, there are so many delightful moments in the movie. However, it is not horror as such,nor any other particular genre for that matter. Chucky is not even the main star of the movie! I have already declared myself as a fan, and maybe my view is not entirely unbiased. Still, here are some things I particularly enjoyed:<br><br>1. The appearance of John Waters as an actor. Need I say more? Big +<br><br>2. Glen/Glenda who speaks with British accent, resembles David Bowie from his Ziggy Stardust phase and has sexual/personality identity issues. How cool is that? Big +<br><br>3. Very clear references, notably to Psycho, Shining, Rosemary's Baby (and some other movies by Mr. Polanski, but more in the form of allusions), and even Pinnochio. I am sure there are many more. Big +<br><br>4. Jennifer Tilly, one of the sexiest, most sensual, intelligent actresses I have ever seen. Ideal for all sorts of subversive films. Of course, she is wonderful in this one too. Mmm... Jennifer I love you. There, I have said it. Big +<br><br>5. Directing, music,setting, costumes. Yes, I liked them all... Thank you people, well done. <br><br>9/10","user":"sinco","rank":[80,114]},{"title":"Not a disappointment.","rating":10,"date":"31 March 2005","review":"I am a big fan of Chucky, i have been a fan on him ever since i was 6 years old. When I first saw this movie was going to be made, i thought it would be terrible. This film can just go to show you how wrong thoughts can be. I heard Glen was going to be in it. I thought he was going to be stupid at first, but i was wrong again. <br><br>Chucky was only in this movie for 30 mins. But, that didn't worry me at all. The other characters were interesting as well. No bad characters. just about everything you could ask for. Don Mancini did a great job at directing this movie. <br><br>This film had everything you could ask for. Glen was a very lovable character. Tiffany came back into it again. And Of course, Chucky! It had great actors in it. Jeniffer Tilly really helped this movie along with this movie. She plays a great part. And Introducing Billy Boyd. He played a great character. And Brad Dourif returns as Chucky again! This film is definitely for the Chucky fans. If you are not a Chucky fan, then you should not watch this film under any circumstances. This movie also had hilarious bits in it. Such as Britney Spears getting rammed off a cliff. If you are a humungous Chucky fan like me, you will not be disappointed at all.","user":"oldman007","rank":[63,89]}]