[{"title":"The Comeback starts here!","rating":9,"date":"3 November 2004","review":"I am a huge movie buff, and have enjoyed IMDb.com for years. This is the first time i have bothered to register to voice my opinions- and it is with good reason. I am a huge Van Damme fan, but i am also a realist. His last few films have not been great - particularly Derailed &amp; Knock Off. However credit to Jean Claude for TRYING to do other things such as IN HELL and WAKE OF DEATH. Unlike his co-action hero's Steven Seagal who can't even be bothered hanging around to loop his on voice on his movies- VAN DAMME is making a comeback. <br><br>This film marks a great, stylish, action movie- driven by revenge in a yakuza environment. It reminded me of early John Woo movies, Seagal's Hard to Kill and early dirty harry films. JCVD's acting is only getting better with age, the action is short,sharp &amp; powerful. Bloodsoaked action scenes &amp; being hardcore (women shot in the head/guy is shot in head by shotgun) shows this is ANYTHING but \"standard/watered down/pg action\" that is all to common today. Do yourself a favour and SEE IT THEN OWN IT! If you are a JCVD fan &amp; have been disappointed by his recent films, give this one a go- you will enjoy. Cheers, Dan","user":"realhiphop","rank":[78,90]},{"title":"Wake of A New Career","rating":9,"date":"24 January 2005","review":"\"Jean-Claude Van Damme is back\", we all have probably heard this statement about hundred times ever since his career took a turn for the worst. Ever since then Jean has been trying to resurrect a career that saw him at the top of Hollywood's revenge, action films of the 80's and early 90's. Trying to win back fans Jean has been going the straight to video route hoping that one of the films will strike gold. And I believe Jean has just found that with Wake of Death. Van Damme IS back and this time he has the acting chops to go along with the cool action. Why this film is rated so low in this site I will never know. This has to be one of the best straight to video releases of last year. The action is great, Van Damme is in it, and the story is pretty good. It's not just your run of the mill revenge movie, it has a great story to it and the film is a success when it comes to the revenge plot. It did it better then some of the big budget Hollywood movies that came out this year, one that totally comes to mind is The Punisher. If your looking for a great action film with Van Damme and this movie is not at your local Blockbuster I suggest you spend a few extra bucks a purchase the film, you will not be let down.<br><br>I have read that some people were let down by the films climax stating that it's far too quick for some. What I like to tell those people is that they need more of an imagination. This film is great because of factors like that, the film doesn't sit back and explain every little thing like most movies do now a days. This movie leaves you do use some imagination and that's what made the movie so good. It made the viewer feel more apart of the film and not like a complete idiot that needs everything explained and told to them.","user":"metallik1984","rank":[52,64]},{"title":"Not as good as I'd hoped, but better than I expected.","rating":8,"date":"7 January 2005","review":"\"Wake Of Death\" is no master piece. But it's easily the best Van Damme movie since \"Hard Target\" and probably his best performance ever. I was pleasantly surprised to see that he does know how to act. Especially in the scenes right after his wife's death. Granted, he's not going to win an Oscar anytime soon. But his performance was definitely worth more than a direct-to-video release. Also the directing was a lot better than I thought it would be. Phillipe Martinez has actually put together a pretty nice package of a movie. We get pretty much everything: Gun play, car chases, nudity and a solid performance by Van Damme. But I would like to have seen a bit more story. It seems that the movie is mostly driven by the action scenes. If only we'd learned a little more about the characters, the movie would have had that last touch that would make it great.","user":"Ramden","rank":[29,35]}]