[{"title":"I liked America's Funniest Home Videos until I saw this.","rating":2,"date":"21 February 2006","review":"The Long Weekend does itself no favours by blatantly ripping off the worst bits of the American Pie franchise and infusing it with some of the most nauseating and unfunny scenes filmed for this genre.<br><br>Gross-out sex comedies have been on the rise since the success of American Pie and its spawns like Not Another Teen Movie, Eurotrip and Van Wilder have thrived at the box office while being panned by many in the process. Although distasteful for many, these movies have always found advocates in younger viewers with many of its plots set in schools. Following the recent straight-to-video release of American Pie Presents Band Camp, audiences are now subjected to The Long Weekend, a crass sex romp through a city involving 2 brothers and the women they encounter.<br><br>In a story as old as time, the uptight and sexually repressed brother, Ed (Roswell's Brendan Fehr) is urged by his playboy brother, Cooper (American Pie alum, Chris Klein) to embark on a weekend of debauchery. Ed, a reserved and artistic advertising wunderkind, has hit rock bottom. His ideas hit a creative slump when he finds out that his philandering ex-girlfriend is now married to his former best friend cum roommate. Threatened with the thought of losing his job, he has a weekend to create a new advertising concept for his firm's biggest client, an insurance company that's on the verge of seeking another ad agency's service. Unfortunately, this weekend coincides with his birthday and his dolt-of-a-brother has something up his sleeves.<br><br>As the 8th most recognisable Western face in Japan due to a successful advertising campaign for the country's leading sake (a Japanese alcoholic beverage made from fermented rice) manufacturer, Cooper's the quintessential Lothario actor who beds the most promiscuous and attractive women that he's able to get his hands on. With the best of intentions, he's determined to get the reluctant Ed back into the dating scene as he drags him to different locales where desperate single women gather. With each scenario turning into 1 awkward situation after another, a resolute Ed is finally unwavering in his pursuit to have sex by the time his weekend ends.<br><br>The formulaic plot involving a tense and asexual character that suddenly becomes dogged in his pursuit of sex while facing obstacles that humiliate, maim and ultimately fortifies him is utilised till the end. A lack of originality is just one of the many reasons this film falters as there's none of the comic unpredictability we've come to expect from recent sex comedies such as The 40 year old Virgin. The film's gross-out factor hits pretty high up on the charts when we start to see bodily fluids being digested, faecal matter and scenes that border on bestiality. These scenes seemed to have been tacked on for the sole purpose of keeping viewers remotely interested in the lacklustre script and cringeworthy dialogue.<br><br>long weekend 2While it aspires to be a low-budget version of the Wedding Crashers or Swingers (both outrageously funny and highly recommended Vince Vaughn vehicles), it fails to engage viewers due to its unlovable and pathetic characters that have the misfortune of being badly played as well. Fehr seems grossly miscast as Ed as he comes off as a potential sociopath more than a sympathetic and lovelorn chump. Klein's Cooper is the less likable 'Stifler', being more obnoxious and ignorant to those around him even when he expiates his shortcomings in the end. As a film that appeals to a younger and less discerning audience through its gross humour, its story is unevenly set in situations familiar to adults and those accustomed to the workplace, decreasing its appeal.<br><br>The only fresh aspect of this film that made it bearable was its unique use of genuine home videos that feature folks getting hurt while in embarrassing situations and animals oblivious to the camera. These videos were used to accentuate a character's emotional state. Probably guilty Schadenfreude at its worst but it lent a distinct style to the film that managed to become part of the climax. No surprise then that 1 of the production companies involved in The Long Weekend is Vin Di Bona Productions, the company behind America's Funniest Home Videos.<br><br>Even a cameo by Lost's Evangeline Lilly was absolutely wasted as a dead body at a supermodel's funeral. Copious amounts of female nudity, distasteful visuals of animal parts and scatological humour are heaped in its short runtime of 85 minutes, a favour to the audience that the film's producers didn't count on. With inflated ticket prices these days, this trite and foul effort is a waste of money and time even when it eventually becomes available for rental.<br><br>Rating: 1 out of 5 stars","user":"movedout","rank":[18,24]},{"title":"Funny SEX Comedy","rating":8,"date":"29 November 2005","review":"While the main drawing card of this movie seems to be the assortment of raunchy sex gags and I'll admit they do make you laugh (I actually laughed so hard at one point I spit out a mouth full of pop). But what really helps this movie is the likability and earnestness of the two guys. You can't help but sympathize with Ed and everyone's has a friend who is something like the Cooper character. <br><br>The plot mainly deals with Cooper and Ed's \"quest\" for sex over one long weekend. That is all it is, and all it was ever billed to be. And it goes over great. I admit, I was not too excited about it at first but now I am glad I saw it. If you don't like raunchy stories who flaunt sex jokes shamelessly, and if you didn't like Porky's or Fast Times at Ridgemont High, or American Pie don't go see it. Otherwise, go see it and laugh your *ss off. <br><br>Any guy will appreciate The Long Weekend full tilt, and girls will realize just what hoops guys jump through in order to get their attention, let alone in their pants. <br><br>What added to The Long Weekend is that I liked both the characters. I didn't know Chris Klein could act until I saw this film, this is the first time he's stepped out of his usual character and I have to say he steals the show. I was glad that they didn't make them the stereotype one nice one sleazy Ed ain't perfect and Cooper isn't all bad. The brothers have some genuine moments on the screen which adds to the film as a whole. <br><br>Dude, go see this if you want to laugh...I saw this in Europe when is it coming out in the States?!!","user":"GregFOX201","rank":[31,49]},{"title":"Fart Joke The Movie","rating":3,"date":"15 March 2010","review":"Don't be fooled by some of the posters. This movie does have a plot! Boy loves to make home movies. Boy becomes man. Man has woman. Woman eats best friend's cum and films it. Man finds woman and friend. Man throws away camera. Now man can't get laid. Because man can't get laid man loses creativity and will lose job. Brother vows to help man get laid. Brother gets laid, man ends up in prison... and almost gets laid. People fart. A lot.<br><br>The two leads are likable and as in any decent fart 'n sex movie there are loads of pretty chicks. Some do gross stuff. Others look at man doing gross stuff. Insert the odd joke. More often than not the jokes are lame, pathetic and just disgusting.<br><br>Must admit I did chuckle a few times and laughed out loud at least once. The best part in the movie are the unrated home bloopers, but not all of them are fun to watch. Some should just be deleted permanently from this world. All in all an OK watch, but the movie is plain bad by any movie standards. Still can be a guilty pleasure and will probably sell with testosterone booming youth.","user":"p-stepien","rank":[6,7]}]