[{"title":"The Big Bore","rating":3,"date":"9 February 2005","review":"Jack Ryan (Owen Wilson) has a tendency for bad decisions and bad luck, including ending up on the wrong side of the law, so he's fled to Hawaii. Unfortunately, his luck is going just as badly there. He hits his boss, loses his job, and is thrown in jail. After he gets out, he sees Nancy Hayes (Sara Foster) and falls for her, even though she's the mistress of an island bigwig, Ray Ritchie (Gary Sinise), and then some. Together they hatch a scheme to rip-off Ritchie, but how many people are involved, and how? <br><br>Was it that this large, talented cast was just looking for a paid vacation in Hawaii? I've liked most of the cast's previous films--I've seen tens of them from each principal cast member, and think there have only been a few I would pan. I've liked all of the adaptations of writer Elmore Leonard's work that I've seen so far (although admittedly, I haven't seen anywhere near the majority). But The Big Bounce is just a big, boring mess. I haven't seen any of screenwriter Sebastian Guiterrez or director George Armitage's previous work, so maybe we can blame them.<br><br>The biggest problem is that nothing much happens in the film for over half of its length, and when something does happen (primarily at the very end of the film), it is so poorly constructed that it's not very clear what's going on. Most of the film is more of a realist drama about, well, nothing, where Armitage seems to have directed his cast to say all of their lines with bizarre pauses, like they're severe asthmatics, and where Guiterrez' dialogue seems to primarily consist of banalities and non-sequiturs. There were a few moderately funny bits (the break-in at the cop's house, Bob Jr. (Charlie Sheen) visiting Nancy at an awkward time), but even those weren't laugh-out-loud hilarious when they should have been, and more often than not the script's attempts at humor fell flat, as did its attempts at realistic dialogue, intrigue, and just about everything else.<br><br>The large cast is primarily wasted. The only person not cruelly underused is Owen Wilson, and Wilson seems to be at a loss with the material. There are some nice shots of scenery, even if a lot of them are composites. I also thought the soundtrack songs were okay to good.<br><br>I haven't read Leonard's book yet, but I can't imagine that it's as uneventful, dull and ultimately confusing as this film. Even if it were, surely a script could be constructed out of the material that gradually weaves the various main characters' threads in a compelling and humorous way, leading up to an exciting twist ending. But such a script isn't to be found here.<br><br>Even if you're a big fan of the cast or Leonard, The Big Bounce is only worth watching to demonstrate that talented ingredients will not necessarily produce a successful film.","user":"BrandtSponseller","rank":[49,60]},{"title":"A Shaggy Dog?","rating":7,"date":"19 July 2004","review":"This is one of those movies that will slip through the cracks, but it's really not \"bad\". It's actually pretty GOOD, right up until... it doesn't have an ending. The ending seems to imply yet another twist - but it makes NO sense, and leaves more questions than it answers. The ending seems like they ran over-budget or over-time, and just stopped. The ending, it must be warned, SUCKS.<br><br>Maybe they couldn't afford a real ending; but the movie is pretty good up until then. It's a fun ride to a dead-end. Morgan Freeman settles into his part like he'd been waiting for it. Gary Sinise has a stifled role, but delivers his lines beautifully. Charlie Sheen is very nearly perfect as a slightly-dim, slightly confused henchman, and playing subtly against-type. Bebe Neuwerth appears as a boozy wife and gives far more to the part than is on the page, also against type, and perfectly-acted. Vinnie Jones stands-out too... <br><br>This movie could NOT fail - but it does. When it ends, you want to kick someone - the director or producers or studio financiers - for stopping what COULD have been so great! This movie has a painfully tiny scene with Willie Nelson and Harry Dean Stanton playing dominoes... I'm only a fan and don't know him personally, but I just KNOW that Elmore Leonard himself would stop any plot just to listen-in and watch to listen to those two guys play dominoes! <br><br>Owen Wilson is actually quite brilliant with the intricacies of the Elmore-dialogue that survive in the script! Don't say I'm wrong until you watch his scenes with Morgan Freeman in this movie. NOBODY was carrying anyone, and that's the truth. See the scenes with Charlie Sheen too - and there's a bouncing something there they keep between them. Someone on IMDb wrote \"Charlie Sheen looks fat and stupid and like an ass\" or something equally blind. What he DOES is play a different kind of self-effacing part, a *character* a bit of a boob - but also good and a bit \"whipped\" - do yourself a favor, and watch how NOT \"Charlie-Sheen\" he plays it - you might recognize a thing they call \"acting\".<br><br>Ahem, Sara Foster was the femme fatal, and the camera followed her far too much. She's gorgeous and who can blame the camera, and she gave a perfectly creditable performance; really, she was fine. Given something over a dozen better actors constantly on-hand (and the seeming final plot!) her time could have been cut a bit... but with this cast, and the first 80 minutes, this really could have been GREAT. Ignore it as the Sara Foster swimsuit video. There are some great performances hidden here. See this movie, and pretend the sequel is coming - or something. <br><br>Or don't see it - because you'll just wish it ended better.<br><br>As a shaggy-dog-story, this should end with a punchline. I'll end it the way movie ends instead, with build-up and seeming logic and then just stopping.","user":"bbishop37","rank":[35,45]},{"title":"Forget the Critics...","rating":8,"date":"20 March 2006","review":"Whether it was intended to be viewed this way or not, this movie was exactly that, a movie(which are supposed to be fun). It didn't make you think too hard(or at all), It had a beautiful cast in a beautiful location, a great soundtrack, and a quirky fun story. Sometimes these type of movies are just what the doctor ordered. So what that it has no deep and meaningful theme, or that there are spots in the movie that make absolutely no sense!!!! It suffered severely in the box office due to very poor marketing prior to its release as well as a nation full of people suffering from groupthink, and the critics are the ones pulling the strings. I found the movie extremely refreshing, a nice break from deep thought, and i chance where i could just sit down, fix my eyes on the TV, and smile :D","user":"tkachunh","rank":[57,78]}]