[{"title":"Absolutely fantastic. Easily the best film of the year.","rating":10,"date":"19 November 2004","review":"There are four scenes that I will treasure forever:<br><br>1) The ferry ride, and the subtle ways you can tell they're both heartbroken, lonely, frustrated and angry. The way she discusses the \"little details\" that compose a person, and what she missed most in him. \"Like I remember the way your beard has a bit of red it in, and how the sun was making it glow that...that morning right before you left.\"<br><br>2) The scene in the van, where they finally unburden themselves. One of the most emotionally raw and honest interplays I've seen on celluloid. The way she reaches out to touch him, but holds back at the last second. Much different in tone from the way Hawke reached out to brush her hair aside in the first film.<br><br>3) Celine's song. So simple yet so endearing. The way her voice fades to a whisper as she sings, \"My heart will be yours until I die.\"<br><br>4) The ending, which is in all ways **PERFECT**. The slow fade, the utter charm of her Nina Simone impression, the ambiguity, and the wonderful look in his eyes as his youth, hope and happiness come rushing back to him while watching Celine dancing and singing (foreshadowed in the opening scene). This is, perhaps, one of the ten best endings in the cinema.<br><br>Hawke and Delpy are sublime, of course. This film requires incredibly subtle acting, and these are Oscar worthy performances that will not be recognized because they are not showy. Much of this film, like life, is acted with the eyes. Witness how Hawke stares at Delpy as she discusses her failed relationships on the ferry, or the sadness and longing in Delpy's eyes as she sings her love song. <br><br>As in the first film, the chemistry between them is indelible. My candidate for best on-screen couple ever.<br><br>This film is better than the first, because it provides a more unique perspective. In Sunset, we see the sobering effects of age and disappointment etched in their faces and clouding their lives. There is more at stake here, for they are nine years older, have made their share of mistakes, feel imprisoned by responsibilities, and must confront their shortcomings and problems. It's comforting to believe that hope and love will prevail in their case.","user":"FilmBuff77","rank":[391,418]},{"title":"The only problem...","rating":10,"date":"13 December 2004","review":"...is that it ends. This is a fantastic film. It joins the handful of movies where I think I liked the sequel even more than the original, although I liked 'Before Sunrise' as well. Where Sunrise captured the immediacy and urgency of perfect youthful love, Sunset reflects beautifully on the aftermath of that perfection. I remember a line that says \"nothing that is complete breathes\", and I think that is what we see in this film. A perfect connection with another human is a blessing and a curse; having experienced perfection a part of us stops breathing, unable or unwilling to mar the perfection of that memory.<br><br>The dialogue is amazing, the acting is spot-on; this is a great film. In some ways it felt more like reading a great novel than watching a movie, in that I really felt like I knew the characters and was sad the movie had to end. Kind of like saying goodbye to an old friend. If you are an action movie kind of person, skip this flick because it will bore you to tears. If, on the other hand, you like good dialogue, well formed characters, and aren't quite jaded enough to have given up completely on the idea of true love, don't miss this film.","user":"ivko","rank":[535,586]},{"title":"How do you make a sequel to \"Before Sunrise\"? This is how.","rating":10,"date":"29 October 2004","review":"I'd been longing to see this one as I'd always thought 'Before Sunrise' was one of the most honest, most real films I'd ever seen, but at the same time I held off seeing the sequel from fear of disappointment. For all of you in the same position, fear not ; Linklater, Hawke and Delphy (for it has surely been a joint effort and labour of love for all three) have done us and themselves proud. I've just seen the film and despite being male and 38 I feel like Roberta Flack must have felt when she penned 'Killing me Softly' after hearing Don McLean sing 'Vincent' in concert; this is - once again - just so close to what it's all about. You want technicalities? The acting, superb; Hawke and Delphy slip right back into their characters, their mannerisms, their sometimes gauche repartee, the way they seem to fence around each other, seeming to go in for the kill then feigning, drawing backExquisite. And then the details, the echoes of the first film in the settings but now with a world-weariness, an autumnal note and yet with still that fundamental freshness and optimism that revives the memories of Sunrise's youthfulness and reminds us, as our heroes discuss, that though time changes people, there remains an unchanging core. Just see it; this is about as good as it gets, folks.","user":"johnnyb-16","rank":[219,241]}]