[{"title":"Ferpect Black Humor","rating":9,"date":"31 October 2005","review":"This Spanish film, Crimen Ferpecto, doesn't sound so appealing based on its fairly typical plot. Rafael, a women's department manager at a Spanish clothing store, is a womanizer concerned only with his own personal advancement and achieving what he believes to be a perfect life, is thwarted by Lourdes, a sales clerk in the same store, and a rather unattractive woman, blackmails Rafael into a relationship, after discovering a secret Rafael cannot have revealed.<br><br>However, I was pleasantly surprised at how often I laughed out loud. Crimen Ferpecto moves at a fairly quick pace with lots of entertaining situations.<br><br>First off, both Guillermo Toledo, as Rafael, and Monica Cervera, as Lourdes are convincing in their portrayals. What makes their performances enjoyable is their mutual ability to create interesting dynamics within their characters. Rafael, is, essentially a boorish lout, yet Toledo manages to make him sympathetic at times especially as his entanglement with Lourdes get more and more complicated. By the same token, Lourdes, the \"ugly\" sales clerk, proves, as a twist on the character type, to be just as ugly on the inside. They are constantly sparring, as Lourdes tries to rope Rafael into marriage, and he tries to remove her from his life. While amusing, the sparring, as the film reaches its climax, does get a little wearing. The first half of Crimen Ferpecto working better then the latter half.<br><br>Also, a standout is Luis Varela as Don Antonio, Rafael's rival in becoming store manager. Without giving too much away of the plot, his character gets a surreal treatment and haunts Rafael as he attempts to deal with Lourdes. I thought some of the interplay between Rafael and Don Antonio were among the best in the film.<br><br>Crimen Ferpecto is light entertainment at it's best. It offers some genuinely funny moments that are well conceived and executed. Guillermo Toledo and Monica Cervera also give stand out performances in their roles as Rafael and Lourdes with Luis Varela, as Don Antonio, backing them up admirably.","user":"kasserine","rank":[27,28]},{"title":"How can anyone in the universe not LOVE this film?","rating":8,"date":"22 January 2007","review":"It's hilarious. It's poignant. It's artistic. It's even philosophical at times. I can't imagine anyone not liking this film. \"Crimen ferpecto\" is a great surrealistic comedy along the lines of \"Being John Malkovich\", \"One Night at McCools\" or even the masterpiece \"Brazil\".<br><br>The plot begins bizarre, and from there it gets ever bizarrer. Set in a department store (the perfect metaphor for the human condition!), this film brilliantly weaves the themes of glamorous/plastic life versus the mundane/real. Trapped between worlds and desperately trying to achieve the former is our hero Rafael, a man whose entire life exists within the ladies' clothing department. Somehow he gets wrapped up in murder, blackmail and ectoplasmic visitations from lovable corpses. Yeah, I told you it gets bizarre.<br><br>But despite the zany plot, there's a very poignant &amp; sober message that runs just below the surface. It's subtle, but it comes to fruition during the magnificent climax when we realize exactly what this whole wacky movie is about. If you've paid attention to symbolism, metaphor, allegory and all that intellectual jazz, you'll get it, and you'll see how everything fits into place. If not, fine, you'll enjoy the picture anyway because it's just plain funny. The beauty is that you can take it at your own pace. Great film. Damn near perfect. Er... ferpect.","user":"rooprect","rank":[23,24]},{"title":"A wickedly funny and original black comedy/thriller","rating":9,"date":"11 September 2004","review":"I saw this film at the 2004 Toronto International Film Festival. I knew I was going to enjoy this film from the moment a large rumpled man in a Misfits t-shirt lumbered onto the stage to introduce himself. \"Hola, amigos. The person who is supposed to introduce me is not here. I am here but she is not here. She is in the bathroom.\" Director Álex de la Iglesia had us laughing even before the first frame of his film. While admitting that Ferpect Crime was just about the worst title for a film ever, he told us that this film was about a man who was so obsessed with living a perfect life that it was bound to cause problems. It's no surprise to learn that the director has a degree in philosophy.<br><br>Rafael works as a salesman in the ladies' wear section of an upscale department store. He's very popular at work, especially with the ladies, and he's very very good at his job. So good, in fact, that he considers himself a lock for the position of floor manager. But after losing the promotion to his hated rival Don Antonio, things take a turn for the worse and pretty soon Rafael has a dead body on his hands. His only help comes from the one woman he hasn't already bedded, the unattractive Lourdes. Before long, Lourdes has Rafael wrapped around her finger and his life is far from the model of perfection he has always pursued. As the plot thickens, the comedy becomes much darker and the film almost turns into a thriller. There is also a strong element of satire, making this much more substantial than the laughs would indicate. The conclusion (\"lesson\" seems too strong a word here) is that it's only after we give up our unrealistic expectations of living a perfect life that we can really begin to live at all. But if that's too heavy for you, then go just to see the scene where Rafael goes to meet Lourdes' parents. This film makes me want to see every other film by this warm and wickedly funny director.<br><br>(9/10)","user":"mcnally","rank":[43,48]}]