[{"title":"Masterly and Commanding","rating":9,"date":"9 December 2004","review":"Few films manage to capture the era in which the original work was set and often rely on clichés of the particular genre at the expense of the core story. This film manages to avoid these pitfalls but more importantly serves as a worthwhile historical document. Anyone who is new to this period of history will not go far wrong keeping a copy of this movie as the attention to detail is excellent and adds to the experience as a whole (teachers take note). <br><br>This movie manages to tread a fine line between gritty realism and Boy's Own, portraying the pursuit of an elite French warship by an older embattled British frigate. The production values are very high and the dialogue and length allow the director a better than average framework for character development. The predominantly unknown British supporting cast (some aged as young as 12) are expertly handled and provide a counter balance to the excellent performances of Crowe and Bettany. Crowe's delivery is very reminiscent of Richard Burton, exuding a measured screen presence without overpowering the dialogue.<br><br>It would have been easy for the director to read through the salty notes of previous period pieces and deliver the usual tale of ocean going brutality and scurvy encrusted woe but Peter Weir's version of order through respect and camaraderie is far more believable especially when you realize that the sailor's greatest enemy was the ocean itself.<br><br>I found little to dislike and much to admire. Highly recommended.","user":"Buckster69","rank":[329,350]},{"title":"Masterfully Done","rating":17,"date":"17 December 2003","review":"\"Master and Commander: The Far Side of the World\" is half swashbuckling action movie, half detailed examination of life in the 19th-century British navy, and all entertaining. Director Peter Weir has created an intriguing film that nicely balances fierce battle sequences with quiet, intimate scenes.<br><br>Nearly all of the film takes place aboard the HMS Surprise, under the command of Captain \"Lucky\" Jack Aubrey (Russell Crowe). The captain's orders: to intercept and disable the French privateer Acheron, which is troubling British vessels off the coast of South America. The two ships clash early on, and the Surprise is thoroughly routed--the Acheron is larger, faster, and more modern. But Aubrey, with a determination that might not entirely be due to his sense of duty, is not one to give up, and the Surprise chases the Acheron--and/or vice versa--down the Brazilian coast, around Cape Horn, and to the Gallapagos Islands.<br><br>That's the action part. The intimate part involves Aubrey's relationship with the ship's surgeon, Stephan Marutin (Paul Bettany). Stephan is a quiet intellectual and devout naturallist, whose train of thought is foraying into the territory that would make Darwin a household name later in the century. He's also the only one among the crew who's either willing or able to call Aubrey's decisions into question. He provides a grounding force for the captain, and the friendship between these two dissimilar men is the emotional heart of the story.<br><br>I've yet to read any of the Patrick O'Brian series upon which \"Master and Commander\" is based, but the movie shows every evidence of being derived from a painstakingly and meticulously detailed work, one which has gone to great lengths to re-create the world and environment of these men. The details on screen are wonderful, depicting the sort of harsh conditions that make the contestants on those \"reality\" series look like the overglorified wimps they are. The crew of the Surprise (many of them not older than twenty) lives in claustrophobic and none-too-clean quarters--at times it seems as if every inch of the screen is crammed full--and sleep in hammocks that may very well end up serving as their shrouds. Battles are chaotic, with cannon fire ripping huge holes in the ship and sending shrapnel in every direction. The weather seems to exist only in extremes: still heat, raging tempests, even snow as they drift down near the Antarctic circle. Good service is rewarded with extra rations of grog and brandy, insubordination is punished by the whip. It's a place where both close friendships and deep resentments can grow, and the tension in the air at times feels like a living presence.<br><br>Crowe dominates the production, once again proving himself one of the best leading men working in movies. In his hands, Jack Aubrey is a natural leader of men: clever, courageous, determined, and capable of what nowadays is called \"thinking outside the box.\" He is frequently confronted with difficult choices, but takes his responsibilities and the consequences of his actions unflinchingly. Bettany turns in an equally good performance as Aubrey's emotional and ideological opposite; the two men play wonderfully off of each other. Most of the rest of the crew tends to blur together (the exceptions include a young officer who's right arm gets amputated early on, and later takes command of the ship), but \"Lord of the Rings\" fans will be amused to notice Billy Boyd among the ranks.<br><br>The combination of action and introspection in \"Master and Commander\" at times seems like an odd mix, but the film succeeds on both levels. Definitely a voyage worth taking.","user":"divaclv","rank":[234,250]},{"title":"A chance to relive the British Navy's Golden Age","rating":10,"date":"10 May 2005","review":"The British Navy ruled the waves throughout the nineteenth century and this film captures some of that spirit rather well. The cast is excellent, Crowe in particular shining as the captain. The battle scenes between Anglo-French vessels are very entertaining, the cannons blasting great big holes into enemy ships! The story itself is not going to set the world on fire, but its all done very nicely. The film offers a glimpse of what life at sea was like during the Napoleonic Wars and anybody with an interest in history should catch the film. A few more battles would have been nice, but there you go! It's over 2 hours long, but doesn't drag. One to watch definitely.","user":"Corky1984","rank":[20,20]}]