[{"title":"Spoiler: Sarah is a woman, not a machine","rating":29,"date":"29 May 2004","review":"I saw the movie today. I think Sarah feels that everybody sees her as an object, not as a woman with sexual longings and desires. (You know, the same way we think of our parents or grandparents.) I don't think she ever had an affair with John. John simply seems as the only Male (sexual) Connection she has in her life. She gets jealous of the new writer, because he is flavour of the week with the publisher John. She craves for some attention, not as a money making machine, but as a WOMAN. She leaves for France, and tries to leave the mother-side of her womanhood behind (even if just for a little while) She finds it hard (because she still phones her father to see if he is all right, but only once in the beginning.) She doesn't want to be seen as a mother, but as a woman. She feels weird getting in touch with her sexual side. Our true selves always come out if there is no one watching over your shoulder, but there always is. That is why she removes the cross from the wall, because she feels uncomfortable going on this journey with God watching over her shoulder. <br><br>She meets Marcel and Franck. She finds Franck attractive, but she is so used to the way that people see her and she actually sees herself, that she doesn't make a real effort to flirt with him. She forms this fantasy alter-ego named Julie. Julie is everything Sarah longs to be. Everyone sees her as an object of desire. Julie is the manifestation of the journey that Sarah is on. Julie is free and very in touch with all aspects of her sexuality. Many woman find it hard to get comfortable with certain aspects of sexuality, because they are brought up that only \"bad girls\" do certain things. Things like abortion, masturbation and oral sex are often things that woman battle with. Julie has scars that seems to have connotations to childbirth, but I think it is a visual way to lead the viewer to think of another element associated with \"bad girls\" namely abortion. Therefore, Julie is the one masturbating, having oral sex and maybe having abortions, not Sarah (but Sarah is in fact the one making peace with these (foreign) concepts. Julie attacks Sarah as a moral prude that is too scared to do the things she writes and thinks about. This is merely a personification of the battle raging within Sarah. <br><br>Sarah and Julie then become friends, which shows that she is making peace with herself. The killing of Franck doesn't actually happen, it merely shows that she is reaching the end of her journey. She is now willing to do the things she writes, thinks and fantasize about. The burying of \"dead Franck\" symbolises the burial of the \"old\" Sarah. That is when she tries out the NEW Sarah on old man Marcel. He was about to dig up the \"old\" Sarah, and the \"new\" Sarah wouldn't let that happen. Also, he won't reject her, because he can't believe his luck. Julie gives her a book that her mother wrote. This just shows that the fantasy of Julie resulted in a new book, as well as a new chapter in Sarah's life. The viewer can clearly see a transformation in the way Sarah is presented. In the beginning she is stern and her clothing is very unflattering. She drinks whiskey early in the morning, even when the man at the bar is drinking coffee. She is more of a man than he is! During the movie you can clearly see that Sarah's clothing becomes more and more feminine. <br><br>At the end she is dressed very pretty and ladylike. She goes to John and proposes her new book, but he shoots it down. However, Sarah now has the courage to offer herself to someone else who will look at her differently, since John makes it clear that he feels more comfortable seeing her as a money-making machine in stead of a sexual object. The waving at the end is simply a way of showing that Sarah does not need Julie anymore. Sarah now feels free enough to truly live as a multi facetted person.<br><br>So Fantasy Julie never exists as a real person, neither does any of the men she has sex with. They simply personify emotional, sexual and spiritual concepts Sarah encounters on her journey to sexual freedom. She actually met the person named Franck, but he merely became part of her fantasy. John has a daughter named Julie, and her mother was probably killed in an accident. But the person Julie has nothing to do with fantasy Julie. Sarah resented John for not seeing her in a sexual way, and that lead to the creation of a persona that shared her resentment towards John's sexuality. Julie said he was the king of orgies. So he (John) will shag everyone, except lonely Sarah.","user":"big-16","rank":[76,84]},{"title":"Anything but dull","rating":8,"date":"23 March 2005","review":"Swimming Pool is a first rate film from French genius François Ozon. This thriller makes best use of everything that makes cinema great, and it is therefore a delight to view. Swimming Pool follows Sarah Morton, a British author that travels to her publisher's dream home in France in order to have a rest while she works on her new book. However, her tranquillity is soon disturbed when her publisher's daughter; a sex-crazed, good time girl, turns up out of the blue and turns Morton's rest into something quite different. One criticism that could be, and has been, made of this film is that not a lot a lot happens. That, however, depends on your viewpoint; the action is stretched, but the relaxed tone of the film blends magnificently with the beautiful French scenery, and Ozon's attention to detail with the characters ensures that, although slow, Swimming Pool never descends into boredom and there's always something on offer for it's audience to enjoy. I, personally, was completely entranced from start to finish.<br><br>The casting of Charlotte Rampling as the uptight British novelist really was an inspired move. She's absolutely brilliant in the role, and you can't imagine anyone else playing that character to such a degree. Speaking of great casting choices, Ludivine Sagnier is similarly brilliant as Rampling's sexy co-star. She brings just the right amount of insecurity and lustfulness to her role, and it's not hard to see why Ozon continues to cast her in his movies. The film is very melodramatic, but never overacted; and this is a testament to the quality of acting on display. Swimming Pool benefits implicitly from a haunting soundtrack, which perfectly accents the happenings on screen, and certain points in the movie where the soundtrack is used are truly electrifying. François Ozon is truly one of cinema's greatest assets at the moment. This is only my second taste of his work (the hilariously fabulous 'Sitcom' being the other), and if his backlog and future releases match the quality of the two films I've seen from him so far; he may well become one of cinema's all time greats.","user":"The_Void","rank":[102,119]},{"title":"Well made and literate.","rating":7,"date":"13 January 2004","review":"Swimming Pool contained good symbolism, acting, and especially great cinematography.  The movie was really too slow for me for the first 70 mintues, however, and I kept wondering, what is the point of painting us a pictures of this dour and unhappy author's interactions with a lustful irresponsible bratty young woman?  Although I admired the character portrayal and felt the movie visually artistic and even brilliant at times, I was not emotionally invested in Sarah Morton enough nor in Julie's to care.  However, the ending changed all of that.<br><br>*** SPOILERS BELOW!***<br><br>The twist at the end reminded me of Fight Club and and Sixth Sense, where all of a sudden the viewer realizes he percieved everything through the wrong lens.  When the twist reveals that the Julie we've seen never existed, all of a sudden everything in the story takes a deeper meaning and we can appreciate all the time it took to create a detailed character study of Sarah Morton.<br><br>I really enjoyed how literate this movie was, the symbolism very well constructed. It's funny how people either critisize or praise all the nudity and sexuality common in European film, however here nudity and sexuality were intrinsically necessary because they were such a crucial component underlying the mechanics of Sarah Morton's personality.  She was so repressed! I really liked how Julie's appetite for sex, rich food, and swimming in the \"dirty\" pool was a mirror for just how badly Sarah lacked all of these things.  I especially loved the scenes where Sarah eats yogurt and wheat germ.  Here we have a woman, who although she is super wealthy and can afford any type of food, instead chooses to deprieve herself of such a basic source of pleasure as eating appetizing food.<br><br>It is a nice contradiction that Sarah is very wealthy on the outside yet starving (for good food, sexuality, a zest for living, creativity) on the inside.  This movie further gives evidence to the fact that fame and wealth are not a guarantee of genuine happiness in life.<br><br>The ending to this film made it all worthwhile, however and it is very exciting when we feel we need a 2nd viewing of a movie to really absorb it all.  I will watch it again and who knows? I might not find the first 70 minutes too slow after all.","user":"Bright_Night","rank":[26,28]}]