[{"title":"Politics Aside","rating":10,"date":"16 July 2004","review":"I have never been a fan of Canadian cinema because it was generally soaked with the sort of contrived politically correct sexual and social attitudes of which the conformist majority was already a proponent. Thus, Canadian films tended to be \"pop-Canadian-culture\" films about political correctness.<br><br>Of course there were exceptions: Atom Egoyan's \"Exotica\" or \"The Sweet Hereafter,\" or some of Cronenberg's more experimental films like \"Naked Lunch\" possessed some of that existential starkness that attracted me to those films. Nonetheless my expectations generally remained low, which is why Denys Arcand's great \"Barbarian Invasions\" was such a pleasant surprise.<br><br>The film is about three things: the disillusionment with socialism, the growing disillusionment with capitalism, and the death of a man who happened to have been a socialist professor in Montreal, while his son a millionaire.<br><br>Remy is dying of cancer. He is dying in a Montreal hospital, which in a five minute scene is established as the horror of socialist Canadian health care. Remy's ex-wife calls upon his estranged, well-off son, Sebastien to come visit and take care of his dying father. What follows is both a comic and a touching critique of the achievements of socialism. The film also suggests that the increasingly nihilist capitalism, or money, seems to be the only way to get around in this world. Money gets Remy out of an overcrowded ward, it gets him the most accurate medical tests and the \"painkillers\" he needs to survive. <br><br>But \"Barbarian Invasions\" is critical of both systems: there is a beautiful scene where an auctioneer visits an old Montreal priest who takes her to the basement where he apparently has statuettes and chalices he wants to sell. The girl examines them and tells him that they would be of more value to the people at the church than on the world market. The priest remarks starkly: \"In other words, they are worthless.\" Capitalism, consequently, is as anti-spiritual as socialism was. <br><br>However, there are far more levels to \"Barbarian Invasions\" than mere politics. In fact, the film's goal is really to scream \"Politics Aside!\" so that we can make room for the man who is dying. Because Remy is not a quiet, subdued man. He is a lusty man a la Sabbath from Roth's \"Sabbath's Theater\" who loves life, women, wine and radical socialism. But now, that all those things are distant from him, he is forced to question his life, his relationships with his friends and his estranged children.<br><br>\nWhat follows is a profound and touching elegy to the stupidities of youth, the mistakes in life, the regret and acceptance of old age - in other words of humanity. In the end, though Remy may be disillusioned with socialism, and definitely not all-too-happy with capitalism, facing death somehow robs politics of their significance. Not to say that politics aren't significant in life, because they pervade everything we do and see and so on, but bare, unadulterated life shines through for Remy. In the end, \"Barbarian Invasions\" is about death, and dying with dignity and how that dignity is achieved. While neither capitalism nor socialism offer it, it can be found at a more basic, human level. <br><br>It's ironic, as a side-note, that this film came out roughly at the same time as Bertolucci's \"The Dreamers,\" which is essentially a contemplation on the idealism and romanticism of French socialism and the \"free love\" culture of the 60s. I found Bertolucci's film much less profound than his greater ones - it used an affair between two siblings and an American closed off in an apartment for several days as a metaphor for the sixties. It ended rather tragically, but unrealistically - it tried to convince us that people got out from their cloistered \"apartments\" (read mentalities) and went to the streets to protest. What \"Barbarian Invasions\" tells us is that the protesters on the street were still really in that apartment, cloistered from reality.","user":"canadude","rank":[128,159]},{"title":"Who are the invaders and who is being the invaded?","rating":10,"date":"11 November 2004","review":"There are many invading barbarians in this film. The reference to 9/11 is made explicit. Another example are the cancer cells that are destroying Remy's body. But there are many other more subtle examples. The general metaphor is this; we develop tidy definitions of who we are and who we are not. Life then deals us changes. Change is experienced as a violation(invasion) and the source of change feels foreign and evil(barbarians).How we are ultimately changed by these invasions defines who we are.<br><br>Each character in the movie faces such an invasion. First and foremost is Remy. At the beginning of the movie he faces the worst of possible situations. He is terminally ill, has wasted a promising life, is alone and buried in the horrors of the Canadian health care system. He is then invaded by a legion of most of the important people from his life. By the end of the movie he is able to die peacefully, in a place of natural beauty, with the people he cares most about, at the time of his choosing, having achieved closure around everything which is capable of being closed. The final scene at the lake is one of the most extraordinary sequences that I've witnessed on film.<br><br>But who are the the invaders and who is being invaded? By the end of the film we realized that this movie is as much about Sebastian and Nathalie, Remy's two unlikely guardian angels, who have been changed as deeply by the experience as Remy was.","user":"rserrano","rank":[64,79]},{"title":"a gem","rating":6,"date":"6 October 2004","review":"I recently watched this film and was very impressed. The screenplay, acting and directing were all top-notch. It was at times funny, sad, tragic and thought-provoking. It touches on everything from drug-use, Canadian medicare, the child-father relationship and of course, past intimate relationships- not all they were cracked up to be! Denys Arcand is so very astute on all these fronts and wrote a fantastic screenplay for the wonderful cast of characters.<br><br>It has to be one of my all-time favourite DVD's of 2004.<br><br>I highly recommend it to anyone who wants to see a riveting, quality film made in Canada. It deserved the Oscar!","user":"natirolese","rank":[41,51]}]