[{"title":"Worth A Look","rating":7,"date":"21 December 2003","review":"\"In Hell\" is a prison movie -- and as we all know -- prison movies come with their own set of clichés. You know the type... the ruthless head prison guard, a corrupt warden, inmates of various nationalities and tendencies complete with their own stories all within the worst of living conditions. \"In Hell\" couples this with an utterly brutal and ultimately dehumanizing set of fight pieces set inside the corrupt lifeless Russian prison that come together to form the latest opus from Ringo Lam and Van Damme. Now you'll either look past these clichés maybe even embrace them and enjoy the movie as-is or you won't and should turn back now. Those heeding the warning will venture to find a movie akin to the 'been-there-seen-that' trait, but with a Van Damme twist and shaped by the dark foreboding hand of Ringo Lam.<br><br>\"In Hell\" finds Kyle LeBlanc (Van Damme) living in the former people's republic. Married and working at a steel mill, we get the notion pretty fast that his marriage has taken a few bumps because of his job's placement. He promises to make things right, but before he can his wife is systematically murdered. In court justice is corrupt and Kyle has to find vengeance in the form of a guard's firearm just outside the courtroom as he kills his wife's murderer in a fit of cold blood. The next we see of Kyle he is a torn weary man on a bus in handcuffs on his way to his new life inside the worst prison man has ever seen. A prison where there is no escape and men fight to the death. This is the premise of \"In Hell\".<br><br>The prison itself is this cold, dark, violent and repulsive rat trap of a place. It feels almost too real. You feel the coldness, the destruction of mankind happening within it's walls through Kyle, the subhuman food and lodging, everything. It's there. You see it, hear it, feel it. Kyle wants out and so will you.<br><br>Let me just say that Van Damme's latest efforts have been a mixed bag (and that's being kind). The truth is he's fallen quite a ways from his \"Universal Soldier\" days and that's what makes \"In Hell\" such a striking success. This isn't a patterned Van Damme movie. This isn't Van Damme playing Van Damme. The fighting scenes don't even display the usual Van Damme-ish feel to them and that's definitely a good thing. They aren't highly complicated or choreographed. There is no video effects or weird camera angles of any sort to highlight the fighting. It's just raw primitive fighting. No mastering of the martial arts just fisticuffs that are brutal and short to the point.<br><br>If you watch your share of b-movies some familiar faces in the supporting cast help things along too. Names like Juan Fernández, Robert LaSardo and real life ex-pro footballer Lawrence Taylor (Any Given Sunday) aptly named prisoner \"451\" that you'll have to see the film to fully understand why.<br><br>\"In Hell\" is a real nice chance of pace for Van Damme and for that reason alone, I recommend this movie. Don't get me wrong. I'm not a big Van Damme fan myself and \"In Hell\" is not striking movie-making, but for a DTV prison-farce starring Van Damme of all people if anything it's at least decent.","user":"refinedsugar","rank":[39,42]},{"title":"My goodness, is that Van Damme acting?","rating":8,"date":"21 May 2006","review":"Firstly, can I just say that this has to be one of the most unoriginal movies I have ever seen. It steals from just about every prison movie ever made, especially \"Midnight Express\", \"Lock Up\", \"The Green Mile\" etc, and with a bit of \"Shawshank Redemption\" thrown in for good measure. So, if this is the case then why have I given the movie 8 out of 10? Because it's the best Van Damme movie I've ever seen.<br><br>Jean-Claude's films are made to appeal to fans of the kind of action film that disappeared from cinemas about 10 years ago: the unthinking, violent, easy-on-the-brain popcorn fodder that he, Arnie and Sly used to churn out by the bucket load. These days, Van Dame is much like Seagal in that all their films go direct-to-video (or DVD, as it now is). However, where as Seagal's post-fame efforts are united by their awfulness, Van Damme has, with \"In Hell\", made a real effort to do something a bit different.<br><br>So, he has no real martial arts skills, and no cheesy one-liners. Instead, he actually acts, and it's quite something to behold. Okay, he's never going to win any awards, but it's nice to see he's making the effort. Director Ringo Lam shoots the movie brilliantly, making it look a trillion pounds when in fact it probably cost about 50p to make. The supporting cast are quite good as well, with no terrible performances rearing up to ruin the film. I must admit, too, that I was quite moved by certain sections, and you could really feel for the prisoners trapped 'in hell' (what a title!).<br><br>So, in conclusion, give this movie a watch, and enjoy it- just ignore that you probably know where the plot is going long before it's even got there.","user":"justiceforall","rank":[68,77]},{"title":"brutal prison drama","rating":8,"date":"22 February 2004","review":"I was really surprised at how much I enjoyed this film, as it was a very hard hitting and brutal drama, which I didn't expect from a Van Damme film. Certain scenes I found profoundly disturbing, but also very gripping and compelling. I think this film deserved more praise than it recieved on it's release, but fans of Van Damme will like it anyway!!! It may also come as a surprise to a more varied movie goer, like it did to me.","user":"RFred666","rank":[57,65]}]