[{"title":"Journey to the center of my hurting eyes","rating":7,"date":"29 October 2008","review":"I know that title sounds a bit rough, but i did not hate this movie. quite the opposite in fact. i'm actually surprised in how much i enjoyed this movie. i really only rented it for the 3-D, but you know what? i had a lot of fun. and honestly, that was the best movie i've seen Brendan Frasier in since \"the mummy\". Brendan really is a lot better in action films then he is in comedy or romances. he should stick to action.<br><br>The film was a good time all in all. The characters weren't annoying as hell, it was a cute PG plot, and it taught some fun lessons.<br><br>I've been looking on the board and seeing that there's a lot of \"that couldn't happen!\" and \"this movie is childish!\" OK. look. it's a PG movie called \"Journey to the Center of the Earth\". It isn't a political documentary. Suspend your disbelief, sit back and enjoy it. Unless of course you want to hand me your 30 page dissertation on why Doc Brown's time machine is an impossibility. If you're not one of those sad lonely people, you'll find this movie quite a lot of fun. Not an epic masterpiece, but a lot of fun.<br><br>If i had to voice one problem is that they need to stop giving anaglyph glasses. it kind of hurts your eyes after a while. They have good 3-d glasses, don't they? they give them out in Florida for Terminator and the Muppet show, so why don't they include those? that would definitely make the movie better in my opinion.<br><br>Other than my hurting eyes though, this movie was a nice break from monotonous depressing dark plot based films.<br><br>With a fun premise, tongue in cheek humor, and decent 3-D effects, Journey to the center of the earth gets 7 glowing birds, out of 10","user":"vegeta3986","rank":[38,45]},{"title":"Silly, but surprisingly enjoyable anyway","rating":9,"date":"13 July 2008","review":"The reviewers of \"Journey\" are probably all correct: the logic is spotty, the premise is silly, and the requirement of the audience to suspend disbelief is beyond a typically successful film. However, despite all of that, I liked it! I went to see it because in my small town the offerings are rather slim, and I had seen everything else (is it me, or did this summer's films seem a bit clichéd and lame?).<br><br>Brendan Fraser has always been a great actor, with an agreeable presence. That he was the star here helped a lot. As did the newcomer actor, the Icelandic lady- Anita Briem. Somehow, one never seems to think of film stars as coming from Iceland. But she is comely and interesting to watch, and she looked good with Fraser. The supporting cast (and there wasn't much of them, as it was mostly CGI stuff, and not really populated with many humans, except for brief appearances) was also adequate, albeit they had little to do.<br><br>Overall, then, this was science fiction with an emphasis on the \"fiction.\" Little here was even remotely believable. Yet taken together, it made an interesting visual contemplation of \"what if?\" and an enjoyable couple of hours at the cinema (for example, the characters free-fall to the \"center of the earth,\" which would be 4,000 MILES down. Allowing for the rather slap-dash explanation of \"magma envelopes\" and all, we are nonetheless asked to believe they fell thousands of miles in a few seconds. The lava tube they fell down, fake as it was, was kind of evocative--- it did bring to mind a sense of mystery, and the powers of nature that are WAY beyond our everyday experiences, even if it was rather silly).<br><br>Oh, BTW, an obvious logic flaw--- if there really was a magma envelope surrounding the interior ocean and lush tropical paradise--- why didn't the free-fall take them through that, it being a sphere and all? Don't even think about it! Just enjoy the fairy tale.","user":"bopdog","rank":[117,175]},{"title":"A Fun Movie For Kids Mainly","rating":6,"date":"2 November 2008","review":"Plain and simple: this is a kids' movie. If you're an adult and you saw the previews with some genuinely-scary looking scenes and thought, \"Wow, this looks cool\" - be warned. Some of it is cool, but most of it isn't.<br><br>Most of it is Brendan Franser doing his \"George Of the Jungle\" routing of yelling and screaming, either trying to find this teen kid or in terror as he falling for being chased by something. In fact, the last half hour of this film will give you headache with all the yelling by all three major parties.<br><br>I didn't realize this film was out in 3-D. I saw it on a regular DVD and the special-effects, in 2-D obviously, looked so cheesy. Some of these scenes looked like they were right out of the Tarzan movies of the 1930s with the obvious screen in the background and the actors on a stage in front of it. So, see this 3-D, if possible, otherwise expect it took look pretty bad.<br><br>Teen girls in the audience will like Josh Hutcherson (\"Sean\"), a handsome young kid who looks ad sounds good, until he gets excited and his voice cracks. Ah, the joys of puberty. Meanwhile, teen boys will get an eyeful with Anita Briem (\"Hannah\"), a very attractive new face. Actually, Anita has a lot of credibility in this role, playing a character living in Iceland who, in real life, was born and raised in Iceland before moving to England at the age of 16.<br><br>As for the story, it's a re-make of the famous Jules Verne story about discovering a whole new world (without people) in the center of the earth, complete with amazing birds and frightening animals and fish. Despite the dumbness of the dialog, the first hour was watchable. As with many adventure stories, though, it gets totally carried in the final third of the film.<br><br>In all, the movie is fairly entertaining to the degree that adults wouldn't be bored if they took their kids. It's not really offensive except for one stupid play-on-words which is totally unnecessary. Other than that, this is a very clean film safe for kids of most age. There are parts, however, that are way too scary for the real young ones.","user":"ccthemovieman-1","rank":[36,50]}]