[{"title":"Could have been stupid, but was actually very funny","rating":8,"date":"16 May 2003","review":"Yet another variation on the \"switching bodies\" theme (Freaky Friday, Like Father Like Son, etc). This one was different, though, in that it involved a transgender switch and that, along with convincing acting by Rob Schneider, made it work. A little slow to start, but once it got going, I found myself laughing repeatedly throughout. A comedy well worth watching for lots of laughs.","user":"cine-11","rank":[68,82]},{"title":"Underrated!","rating":9,"date":"5 July 2003","review":"This movie is so like the other movies with Schneider and Sandler.  It's funnier by far than \"Waterboy\".  You'll love the warmth and message that's in every Sandler film.  The actress who played the hot chick is soooo funny as Rob Schneider.  She's not getting the credit she deserves. <br><br>\nThe hot chick's little brother, her boyfriend (perfectly played by Matthew Lawrence!), and all the side characters from Ling Ling, Ling Ling's mom, and the hot chick's best friend are just fun to watch.  This movie is funny, and I will end in saying Rob Schneider is sooooo good in this film.  You'll get a lot of laughs!","user":"dlozano","rank":[10,10]},{"title":"Surprisingly funny comedy","rating":8,"date":"26 June 2003","review":"First off let it be said, I'm a pretty big fan of comedies. I rather enjoyed Schneider's 1st film Deuce Bigelow, but gagged at the supreme awfulness of the Animal. The script to the Hot Chick is surprisingly good and well-organized (though it's premise is basically a raunchier riff on 80s body switch movies like vice-versa and freaky friday without any moralizing). It may not be original (similar to my other favorite comedy so far this year, old school) and it may not win any oscars , but it's funny, follows an established formula well, and doesn't deteriorate in the third act like a lot of comedies I've seen as of late into moralizing or seemingly tacked on drama. Rob Schneider and Anna Farris are incredibly funny together. Watch for a cameo by Adam Sandler. If youre in the mood for citizen kane or next year's oscar winners, look elsewhere. If you're in the mood for good, dumb, fairly raunchy fun to watch with a couple of friends - this movie's great.","user":"miguelsanchez69","rank":[68,86]}]