[{"title":"On the fence","rating":7,"date":"16 April 2005","review":"If you completely ignore anything and everything that has to do with the Amityville stories, then this is a pretty decent horror flick. Ryan Reynolds turns in a very effective performance, reminiscent of Jack Nicholson in \"The Shining.\" By the end of the flick, i was scared of the dude. The rest of the cast was solid, as well. Lots of scares throughout the film, but a little too much of the \"MTV style\" editing, especially in the last fifteen minutes or so. But all in all, a decent effort, just like i said.<br><br>HOWEVER.<br><br>If you're going into this expecting any resemblance WHATSOEVER to the book, the original film, or any of the stories told over the years, you're going to be severely disappointed. The filmmakers have pretty much left out the events that transpired in the novel and the previous film, and instead they take an extreme amount of liberty with the story and turn it into a series of stylized Hollywood scare tactics. Don't get me wrong, this is still effective, but if you're going to release a movie and promote it as \"Based on the True Story\" then you might wanna make sure that the movie at least RESEMBLES the original story.<br><br>In fact, George Lutz is currently in litigation with MGM films over the content of the movie, claiming that it shows his family in a potentially damaging light. When you see the flick, you'll understand why he's upset. I can't fault the guy.<br><br>If they had left the Amityville name off of this one and just released it as some generic haunted house movie, then i wouldn't have so many issues with it. But to even associate it with anything Amityville-related just seems wrong to me, because they have completely screwed it up. I would still recommend the film, and just caution potential viewers to forget everything you've ever seen or heard about Amityville. Otherwise you'll walk out of that theater just as annoyed as i was.","user":"brent_hankins","rank":[70,83]},{"title":"Decent enough for Amityville and haunted house film fans, otherwise approach with caution","rating":8,"date":"25 April 2005","review":"A remake of the film by the same name from 1979, which was based on Jay Anson's book about a supposedly \"true\" haunting, Amityville Horror begins in familiar territory by showing us Ronald DeFeo, Jr. (Brendan Donaldson) murdering his family. A year later, newlyweds George (Ryan Reynolds) and Kathy Lutz (Melissa George), with three kids from her previous marriage in tow, buy the vacant house at a steal, although they hesitate a bit once they learn why it's so cheap. Strange occurrences begin not long after they settle in. George becomes increasingly impatient and hostile, daughter Chelsea (Chloe Moretz) begins seeing the dead DeFeo girl, and so on. The film recounts their very brief but tumultuous stay at the home the Lutz's believed would be their dream home, but which turned into a nightmare.<br><br>After seeing the remake of The Texas Chainsaw Massacre (2003), which had the same production team, principal scriptwriter and visual effects team, and which I loved--I gave it a 10--I was completely psyched for the Amityville Horror remake. After all, unlike my view of the original Texas Chainsaw Massacre (1974), which I also gave a 10, I think the 1979 Amityville has more than its share of problems. I like the original in spite of that, but producer Michael Bay and crew had plenty of opportunity for improvement. Unfortunately, although some aspects of this remake are better in my view, it suffers from a host of new problems. Like the first, the assets are good enough to transcend the flaws so that it squeaks by with a very low \"B\", or an 8.<br><br>In my view, there are two primary problems, with at least one a bit ineffable. The more effable problem is that relative newcomer director Andrew Douglas (his previous effort was 2003's relatively little-known documentary Searching for the Wrong-Eyed Jesus) instructs cinematographer Peter Lyons Collister to shoot the film using way too much close framing. I repeatedly felt the urge to take a couple steps back so I could better discern the action, the settings, the staging of scenes, and so on.<br><br>The second problem lies more in the realm of writing and editing--the film just doesn't seem to flow right. The transition from scene to scene often feels almost arbitrary. Even though Reynolds does a great job in his transformation as George Lutz (and the acting is superb all around), there was a sense of buildup in the original that this remake is missing. Further indicative of the transition problems, although seemingly minor, is the fact that the date, or the day of the Lutz' stay at the home, is sometimes given as a title and sometimes not. It seems like they just forgot to add the day titles for half of the scenes. Overall the final cut gives an impression of being hastily put together.<br><br>And that's a shame, because there is a lot of potential here. The house itself is impressive, as it needs to be, and the overall style of the film is nicely atmospheric. I was also impressed with the production design by Jennifer Williams, which among other assets tends to have the period setting spot-on. For example, I was a huge Kiss, Alice Cooper, etc. fan during this era (and I'm still a fan). Williams has a number of Kiss and Cooper images in the film. She very carefully ensures that none are anachronistic. <br><br>Even though scriptwriter Scott Kosar disappointingly expressed a lack of enthusiasm for Anson's book and the original film, he reintroduces a number of elements from the book that work well, but which were left out of the original film. He also introduces new scenarios that in some cases are among the best material of the film--such as a breathtaking sequence on the roof of the home, and the extension of the mythology behind the \"haunting\". He also greatly improves on sequences such as the babysitter. But on the other hand, he inexplicably changes core elements of the story, like the kind of being that Jody is.<br><br>Anyone frustrated with the typical horror style of the later 1990s and early 2000s may find this remake troublesome. As one might expect with Michael Bay producing, Douglas is encouraged to use \"MTV-styled\" cinematography and editing. There are a number of extended techniques that have become somewhat clichéd in recent years. Douglas has characters do that fast headshaking movement ala Jacob's Ladder (1990). There are sections shot in a cinema vérité style. There are instances of quickly changing film stocks and processing methods, and so on. Even though I usually love all of that stuff, and I'm actually a fan of Bay's work, I have to agree that it's not exactly the most natural fit in this case. But for me, it's not something I would subtract points for either.<br><br>Maybe the most surprising fact is that this version of Amityville Horror is so close, structurally, to the original. There is nothing here that is a big surprise, and anyone who has seen the 1979 film a number of times will know exactly what's coming next, or close enough to it. Whether this is positive or not depends on your opinion of the original film, and just how highly you cherish originality for its own sake. Big Amityville fans and big haunted house film fans will probably enjoy the film enough. Everyone else should approach with more caution.","user":"BrandtSponseller","rank":[76,115]},{"title":"Take it from me -- root for the ghosts","rating":5,"date":"21 April 2005","review":"In terms of cinematic legacy, the original \"The Amityville Horror\" managed to foreshadow both \"The Shining\" and \"Poltergeist\" while swiping a few nods from \"The Exorcist.\" But time has not been kind to the hit 1979 horror film, once considered spooky but now considered at best a camp classic.<br><br>The remake opens in the late 1970s, with George Lutz (Ryan Reynolds) and his new wife Kathy (Melissa George) getting what appears to be the deal of a lifetime. A colonial era Long Island home that is within their price range has just come up for sale, and the two decide the place would be perfect to raise their children, all from Kathy's previous marriage.<br><br>Little do they know that the house comes with loads of supernatural baggage. The previous owner had killed his entire family within 28 days of moving in, claiming there was a demonic presence in the home that drove him to do so. It's not long before strange things start to happen with the new family as well.<br><br>Chelsea (Chloë Grace Moretz) starts seeing the ghost of the previous little girl who occupied the house, Billy (Jesse James) and Michael (Jimmy Bennett) see supernatural activity while also being blamed for the trouble it causes, and George begins to go mad, taking increasingly drastic steps to maintain order and discipline the children. It's not long before Kathy begins to suspect that all is not right in their quaint little home.<br><br>\"The Amityville Horror\" is such a mediocre film, you can't help but wonder what was once considered so shocking about the original story. In truth, with all the negative reviews the original movie received, it's obvious that that film (and its numerous sequels) is merely famous for being famous. The thing that most people seem to remember is the front of the house itself, which actually is scary looking. It's just a shame there's never been a horror movie filmed in the house to do its spooky appearance justice.<br><br>The other thing to note is that the remake still claims to be based on a true story, which is partially true. The real life Lutz's account was eventually proved to be a hoax to cover up the fact that the family couldn't pay their mortgage, but not before the family made millions on everything from talk show appearances to the movie rights.<br><br>The movie never really lets you into the horror that is occurring, and director Andrew Douglas does a very workman-like job directing the story, never really doing anything to interest us in the characters or situation. Special effects run amok, like walls that ooze blood and jack-in-the-box scares like decomposing ghosts jumping out at you, but it's all for naught. The movie can only scream \"boo!\" at you so many times before you start booing back.<br><br>Acting-wise, the movie is decent but not terribly inspired. Just like Jack Nicholson in \"The Shining,\" Reynolds seems to lose his sanity just a tad too early for the rest of the story to be believable. As Kathy, George manages to be the emotional anchor holding the film together and does a good job, however her character puts up with far too much stress before she finally acts. The child actors all do okay, but they merely exist to be put in danger.<br><br>So, what was the purpose of remaking a horror movie that hasn't aged very well over the last quarter of a century? The main reason I can think of is the house itself, which still manages to scare people. Other than that, there's a big market for remaking classic horror films right now, though hardly any of been able to justify their own existence, including last year's \"The Texas Chain Saw Massacre,\" also produced and written by the same team behind this film. \"The Amityville Horror\" is likely to join that undistinguished canon, ultimately being a horror movie about a group of people too dumb to leave a house just because the script requires them to stay. It's movies like this that make you want to root for the ghosts.<br><br>5 out of 10 stars. It's hard to feel sympathetic for characters in a movie who have to stay in a stupid situation just because the script says so.","user":"filmbuff-36","rank":[83,135]}]