[{"title":"Painful","rating":1,"date":"16 June 2006","review":"The final arc in the X-Men franchise has finally landed. Let me start this review by saying that X2 was and is a hard act to follow. In my humble opinion, it might be the best comic book movie ever made. Even Bryan Singer would have had a hell of a time topping that bad boy. So does X-Men 3 live up to the hype? The short answer is, of course, no. There are some extremely fundamental problems with this film's script which should have been addressed long before one bit of celluloid started to roll.<br><br>The story opens with flashbacks of a young Jean being recruited to the school by a young Xavier and Magneto. This scene lulled me into a feeling that maybe this would be an awesome movie. The next scene, a young Warren Worthington trying in vain to slice off his wings, also works well. However, when his character amounts to little more than a glorified cameo, this scene becomes completely pointless. We're led to believe that this is a character we should care for, and then he gets tossed out almost immediately. After the set up we are thrust into the meat of the story. The X-Men are still reeling from Jean Grey's sacrifice in X2 and are training a new group of muties to fill out the leather uniforms. We get to see precious little of them working as a team, however. I thought the point of a team story was to show how they interact? Apparently, along with Halle Berry's upgraded role came the stipulation that she can only share the screen with one mutant at a time. Since most people are familiar with the plot line here's a super-short rundown. Magneto and X-Men clash and a small war breaks out. There's a mutant cure and a few members die. Boredom ensues. I've never felt so utterly detached from a movie. It could have to do with the overdone musical score, terrible dialog, or countless errors and goofs. It's a movie that utterly ruins a perfectly viable franchise. I felt pained after watching this.<br><br>WHAT WORKED- Multiple Man! This guy had like two minutes of total screen time, but he ruled both of them. He's a cocky, sarcastic mutant who is literally his own best friend. I learned more about him in two lines than I did from Storm in three movies. - Iceman/Pyro. I've always loved the way these two interact, from the first hint of rivalry in X-Men to the museum scene in X2. My only complaint was that there is no real resolution. Iceman head-butts Pyro, end of story. The entire fight was in the trailer. If there had just been a few more seconds of dialog, or perhaps a Pyro death scene, this would have been perfect. - Beast (sometimes.) Kelsey Grammar did a fine job. I dug his look and overall approach to Beast. The scene in which he meets Leech is very well done. -Fastball Special. Any comic geek will tell you that this is a classic comic book moment which is a joy to see in action.<br><br>WHAT DIDN'T WORK-Halle Berry. We get it, you're a star. Get over yourself and share the stage with someone else. Miss Berry may be an Oscar winner, but she also did Catwoman. In my opinion, two movies with storm was enough, kick her ass out and bring back... -Cyclops. Hey, here's an idea! Let's take the X-Men team leader and emotional anchor of the phoenix storyline and kill him off in ten minutes so storm can do more. Yeah, that worked real well. If his death had served a purpose I wouldn't have minded. But it seemed to me that they were killing him off just to punish James Marsden for doing Superman Returns. -Juggernaut, Bitch! Wow, talk about misused. juggernaut is a cool character and I love Vinnie Jones, but that is quite a miscast part. And he spends most of the movie looking mad and making stupid one-liners. And his big finish? Hitting his head on a wall! -Beast (Mostly.) The hook for Beast in the movie is that he's conflicted. When he first sees what Leech is capable of there is a beautiful moment where we can see his conflict. Then, like nothing has happened, he makes his choice and stands with the X-Men. That was wrapped up way too easily.<br><br>ERRORS/PLOT HOLES -In X2 the phoenix entity was fiery and red when Jean accessed it. In this one she just turns dead looking...how's that work? - The X-Men fly from New York to San Fransisco very quickly. This is, I guess, plausible because they have a super-sonic blackbird jet. However, Angel shows up in the thick of the fight as well. We can assume he wasn't on the jet because they didn't show him. Are we to believe that with his little feather wings he can fly the same speed as the blackbird? - Magneto is shown playing chess all by his lonesome in the park at the conclusion of the movie. This plot hole was so huge I didn't even pick up on it at first. Shouldn't he be, like, IN JAIL!? They spend half the movie looking for him, then when the entire U.S. army is only feet away from him, and he loses his power, he is somehow able to slip away? **Here's the grand-daddy plot hole of them all** -Jean has such a powerful mutation that she cannot control it. She claims the only way to stop her is to die, as she is constantly begging Logan for death. However, her power is a result of mutation and in the movie they have rendered a cure for that. You see where I'm going with this? Why don't you geniuses just cure her? That is the epitome of crappy writing. How a plot hole that big even made it into a second draft of the script is mind boggling.","user":"colby_park","rank":[83,103]},{"title":"How to ruin a trilogy.","rating":1,"date":"25 May 2006","review":"<ul><li>MASSIVE SPOILERS AHEAD -</li></ul><br><br>Last night I went to watch the German premiere of what I hoped would be the triumphant finale in the X-Men trilogy. I had purposefully ignored all early reviews and news about the film, I didn't even know that Bryan Singer had left the project - believe me, after ten minutes of the movie, I knew he had.<br><br>I won't bother to go into the story here, as in fact, there are almost five or six story lines from the comics collapsed into this movie, none of them working at all. It almost seems as if three different movies had been made and then just cut together. Jean Grey as Phoenix is so badly developed that it amounts to an insult to any fan of the comic book. During the final battle she just stands around in the background for -literally- twenty minutes until she decides to annihilate San Francisco, obviously for the sole purpose of creating a \"cool\" FX sequence. To see just how much the production team obviously disrespects the intelligence of the audience, watch how day turns to night from one shot to another after Magneto moves the Golden Gate Bridge to Alcatraz. My jaw dropped at witnessing such a massive continuity error.<br><br>Brett Ratner obviously has no love or respect whatsoever for the comics or even the previous films, as is displayed by the following creative disasters that riddle this movie:<br><br><ul><li>Nightcrawler, who was a visually entrancing and emotionally interesting character in the last installment has mysteriously disappeared from the X-Men...</li></ul><br><br><ul><li>Rattner introduces new Mutants left right and center without developing their character or even their motivation one bit - something Singer paid great attention to. The best example is the prison breakout, where Magneto frees Multiple Man and the Juggernaut, both of whom agree to join his cause without even knowing who he is or what his cause is.</li></ul><br><br><ul><li>The costume design of the Juggernaut is indescribably ridiculous and makes every scene featuring him unintentionally funny. Think Hercules meets the Flintstones.</li></ul><br><br><ul><li>Gone is the subtle, inventive dialog from parts 1 and 2. It is replaced by clichéd phrases that are delivered by a visibly unmotivated cast, Hugh Jackman being the best example, a mere shadow of himself. For every funny one-liner in this movie, there are at least ten that will make you wince.</li></ul><br><br><ul><li>Cyclops is killed off like a character from a bad soap opera in the first ten minutes of the movie. It is inexcusable to remove such a vital character in such a disrespectful manner and I feel sorry for James Marsden for having to go out on a whimper like he did.</li></ul><br><br>The list goes on and on.<br><br>This movie is the sudden demise of what Brian Singer turned into one of the great franchises and I can only imagine how he must feel at seeing what the producers are willing to do for a quick buck.<br><br>Anybody who liked the first two movies, likes the comic book, or has any respect for decent film-making - I ask you to save your ten bucks and not hand it to the makers of what is a failure of character and creativity in every respect.<br><br>Thanks for reading.","user":"yesfan-1","rank":[699,949]},{"title":"Just BAD","rating":21,"date":"21 June 2006","review":"This contains spoilers, but nevermind since the movie is bad and you shouldn't go see it.<br><br>There were two good things about X-Men III. First, we arrived a bit late so I actually missed all the advertisements. Second, at one point in the movie they show a family trapped in a car in front of Magneto and his army of mutants, and the woman actually locks the car thinking it's going to make a difference. That would have made me smile if I hadn't been busy listing the best ways to kill the movie director at that point.<br><br>I don't even know where to start, so I'll begin with how Brett Ratner deals with the characters. Cyclops is killed. Professor Xavier is killed. Jean Grey is killed. Mystique is now a human. Rogue is now a human. Magneto is now a human (although a little doubt remains, see \"the worst ending sequence in the history of mankind\" paragraph). Now you may be wondering \"who the hell remains except for Wolverine and Storm\" (you may also be wondering why Ratner is still living)? Well, Director Stupid introduced a new group of totally uninteresting mutants, with absolutely no personality. Juggernaut and Multiple Man agree to join Magneto not knowing who he is or wtf he is planning to do. Kitty Pride looks like she's twelve, Angel is apparently only in the movie for advertisement purposes (he has almost as much screen time as in the trailer), Callisto is the needed 'ghetto' black character (seriously, listen to how she speaks... or don't, actually don't), there was even some emo/Gothic girl, I'm still trying to figure why Magneto didn't slap her for getting that haircut. Beast first appears as a scholar then fights with the other X-Men at the end, not much to say about him. Wait, there's not much to say about any of those characters except \"die in a fire\".<br><br>That brings us to the actual plot and storyline. When a sad Cyclops tells Wolverine \"Not everyone heals as fast as you do\", I knew this movie was going to suck. I can easily imagine the writers patting each other in the back for three hours after finding that line. Way to go, too bad everyone in the audience almost puked when he said that. Anyway, Cyclops dies like a punk less than twenty minutes into the movie, and guess what we don't even see his death. Apparently they felt they were going the right way since the script just keeps getting worse. I guess they tried to bring in as many things from the comics as possible and mix them, but instead of actually developing each element they rushed the movie (it's one hour forty minutes long), which ruined everything. Rogue taking the cure is not exploited enough, Jean turning into the Phoenix is a big joke, she just stands there doing nothing after Magneto recruits her. She eventually decides to annihilate the universe at the end, which is a pathetic excuse for a thirty-seconds FX sequence. When she asks Wolverine \"Are you willing to die for them?\", he answers \"I'm willing to die for you\". Any writer that comes up with such a line should be shot dead. No trial, just shot. Don't even get me started on Xavier's death or the fact that there are no flames around the Phoenix (Jane), they couldn't even get the stupid flames right. What the hell does she do anyway? Make confettis? Can her power look any less impressive? \"Oh no, she's making confettis, nevermind that Magneto just made the Golden Gate Bridge levitate and let's RUN FOR OUR LIVES!!\". The only good thing about her is that she killed the emo/Gothic guy.<br><br>Pyro is a stupid arrogant kid, who keeps acting tough because he can throw flames. Wow, you were born with your power and you can actually use it, that's like bragging about knowing how to walk. Get a job elsewhere than in a circus and I might be impressed. He can't even use his power properly, I mean he ignites cars thrown by Magneto. Maybe next time you could actually think of, I don't know, throwing fire AT YOUR ENEMIES and not at stupid flying cars? Everything is so rushed that you stop caring anyway.<br><br>The worst ending sequence in the history of mankind: <br><br>The ending sequence features Magneto sitting at a chess table in a park. Now Magneto only started a mutant vs human war, ruined the Golden Gate Bridge, launched an attack on the Alcatraz Island that resulted in the complete destruction of the place and the death of dozens of soldiers, you'd think he'd maybe get a little prison time. But no, apparently everyone is happy in stupid land, they all kissed and hugged and he's forgiven. But that's not the worst thing, we also actually see Magneto move a chess piece without touching it, meaning that his power is not completely gone, meaning that EVERYTHING IS MAYBE NOT OVER! Arggghhhh, stop it already! It was announced that this would be the last X-Men movie (and believe me, it's for the greater good), end it like a man and don't imply something else might happen. Magneto is free and his power is not completely gone. WTF has changed since the beginning of the movie except that the X-Men have lost so many members that they have to fight with twelve-year-olds and Magneto doesn't have stupid Pyro following him anymore? The credits come up directly after we see the piece moving, with a sound supposed to make you go \"wow!\". Well I did go \"wow!\", and by \"wow!\" I mean \"let's hunt Ratner down and send him to the one place where he belongs\", which is the nearest black hole. X-Men 3 is terrible, don't go see it.","user":"Frankie_Wilde","rank":[165,215]}]