[{"title":"Tough, Touching, Sometimes Funny Encounter With a Big Taboo","rating":9,"date":"30 May 2004","review":"Kids - of whatever age - do not want to know about their parents' sex lives. And grown-up children are often seriously baffled and disconcerted by any evidence that aging parents possess an active libido.  Lastly, many moviegoers are very uncomfortable watching a dowdy, frumpy widow who would pass unnoticed almost anywhere discover her aching capacity and need for raw passion with a handsome man half her age.<br><br>\"The Mother\" is a provocative look at a scarcely filmed reality - a woman who isn't ready to stay home, watch \"the telly,\" and vegetate after her husband of nearly three decades, and a controlling, dominating chap at that, packs it in with a massive heart attack.<br><br>May (Anne Reid) and her husband have two children, each dysfunctional in his or her own way.  The male son lives with a beautiful wife who may well be driving him to the Bankruptcy Court with her extravagant commercial venture. Paula (Cathryn Bradshaw), is a teacher with aspirations of succeeding as a writer.  She's attractive, not pretty, and she seems to have a close relationship with mum - at first.<br><br>Back at her house after burying her husband, May determines to not stay there.  Rejecting typical widowhood with its legacy of boring days and no adventure, she goes to stay with Paula who has a young son.  Paula's boyfriend, Darren (Daniel Craig), is a ruggedly handsome contractor who seems to be taking an awfully long time to complete an addition to May's son's house.  May is quite taken with hard-drinking, coke-sniffing Darren whose treatment of Paula ought to have alerted May that he was, for sure, a Fellow of the Royal Academy of Cads.<br><br>What follows is a torrid affair between Darren and the besotted and now bubblingly alive (dare I say reborn?) widow.  The love scenes are graphic but take second place to amateur artist May's pen and ink sketches of their trysts which then play a role in the enfolding drama (or debacle, take your pick).<br><br>The theater in Manhattan was packed for today's early afternoon showing with well over half the audience in the range of May's age.  That some were shocked or disturbed to see her disporting herself with erotic abandon in the arms of a much younger man is an understatement.  <br><br>This blindingly honest look at an older woman's awakened passion after decades of dutifully obeying her husband's desire that she stay at home and raise kids (she also mentions he didn't like her to have friends-what a guy) surfaces a number of issues.  While May's dalliance with Darren doesn't constitute incest, there are real psychological dimensions, and issues, with a mother bedding her daughter's lover.  And Paula isn't made of the stoutest stuff to begin with.  The affair, once disclosed, allows the peeling open of the mother-daughter relationship which, from Paula's viewpoint, left something to be desired. Ms. Bradshaw is excellent in the role of a daughter who wants her mother's support as well as her love-she hasn't been dealt a terrible hand by life but it isn't a bed of roses either.<br><br>May is strong in her resolve to both acknowledge her sexuality and expect, indeed demand, a future of happiness.  But she is also inescapably vulnerable. She's fishing in uncharted emotional waters. Who controls her relationship with Darren and why are difficult issues for her to understand, much less resolve.  In her sixties, she's still a work in progress.<br><br>\"Something's Gotta Give\" recently showcased mature sexuality but in an amusingly antiseptic way assuring no viewer would be discomfited.  After all it's Jack Nicholson and the always beautiful Diane Keaton cavorting in the world of the rich.  And to insure that no serious psycho-social issues were explored, Keaton's young girlfriend, Amanda Peet, daughter of Keaton, not only blesses the match but insures that the audience knows she and her old(er) would-be lover never hopped into the sack.<br><br>No easy out here.  Anne Reid's inspired performance forces discomfort on some while drawing respect from others.  Her naked body bursts with sexuality for some and appears absurd as an object of physical attraction to others (the comments of audience members leaving today reflected all these views).<br><br>Kudos to director Roger Michell for tackling a fascinating story with verve and empathy.<br><br>9/10.","user":"lawprof","rank":[70,75]},{"title":"Shockingly Intelligent","rating":9,"date":"30 January 2005","review":"A fierce, shockingly intelligent piece of work from the gifted British writer Hanif Kureishi who wrote \"My Beautiful Laundrette\", (this is the best thing he's done since then). It's about intelligent people whose lives don't add up to much. They've squandered what they have been given and are largely empty vessels. The only character on screen who is alive is the mother of the title yet she feels dead inside until a rough handyman shows her some affection and awakens her to the joys of sex. He has his own motives but Kureishi treats him with a good deal of compassion. This is a film in which people and places feel familiar, where characters exist beyond the confines of the screen. In some respects it's a bit like \"Sunday, Bloody Sunday\" but it's an altogether tougher piece of work. The director, Roger Michell, allows scenes to build instinctively. And it is beautifully acted.<br><br>As the eponymous mother Anne Reid betrays her wasted life in every gesture. There is not a false note in her extraordinarily lived-in performance, and that very fine actor Daniel Craig displays shadings to his character than even Kureishi hasn't tapped into. If the film strikes a false note it is, perhaps, in the character of the talentless daughter, caught up in a messy affair with the man her mother seduces (or should that be the other way round) and even messier life, but she is so well played by Cathryn Bradshaw she hooks you in nevertheless. The film is also extremely beautiful to look at (DoP Alwin Kuchler) and must rank, unhesitatingly, as the best British film of the year.","user":"MOscarbradley","rank":[38,40]},{"title":"Daring, powerful and often harshly candid","rating":8,"date":"4 August 2004","review":"[WARNING: CONTAINS SPOILERS]<br><br>I have this adult friend for whom the notion that her parents have sex makes her terribly uneasy. She came to mind when I reflected on the audience's reaction to \"The Mother.\" <br><br>People gasped when May (Anne Reid) writhed passionately in bed with her younger hunk lover, Darren (Daniel Craig) or later saw sexually explicit drawings by May. I doubt the audience was aghast at the nudity or the drawings' content as much as feeling uneasy at seeing a woman in her 60s rapturously enjoying sex.<br><br>Screenwriter Hanif Kureishi (\"My Beautiful Laundrette,\" \"My Son the Fanatic\") again proves why he's among the most trenchant storytellers on either side of the Atlantic. His story's not easy to take. This searing family drama isn't a film you can claim you enjoyed watching because it's raw, complex, and often makes us very uncomfortable. Nevertheless, it's powerfully good stuff.<br><br>Kureishi and Roger Michell (who directed \"Notting Hill,\" of all things) craft an unsentimental, wrenching and superbly-acted portrait of an older woman who realizes, after all these years, she can and should still enjoy all of life's pleasures. In a wonderfully epiphanous moment, when her son, Bobby, asks her not to be difficult, May shoots back, \"Why not?\"<br><br>\nWhy not, indeed.<br><br>Anne Reid deserves an Oscar nomination for her turn as May. It's subtle, restrained, powerful and sad, often all at the same time. Watch Reid when May observes Darren and Paula (Cathryn Bradshaw) in a seemingly passionate clutch in a pub. Or, when she begs Paula to open the front door after a disastrous date. Reid's eyes and face reveal all of May's anguish and despair. In the film's most devastating moment, May drops to her knees before Darren, willing to do anything for him, only asking him to be kind. This is a tremendously gutsy performance by a remarkable actress.<br><br>I enjoyed Michell's use of natural sound, especially when May and Toots first arrive at Bobby's place. It perfectly illustrated the cacophony around May and Toots, the flippant manner in which their own family welcomes them.<br><br>This film, at times, reminded me of the honesty and rawness of Mike Leigh's work, except \"The Mother\" hangs on to a slight sense of optimism to keep afloat.<br><br>My one quibble: Michell's decision to give May and Darren's first love scene an almost cheesy sensibility. The lovers remain out of focus while, in the foreground, a white curtain flutters gently in the breeze. And the only sound is of May in the throes of passion.<br><br>The problem with Michell's approach is that both Reid and Craig, who completely envelops the role of Darren, plough their way so fearlessly into these roles that it's unfair to hide their characters' almost primitive energy from the audience. Especially since Michell has no qualms about making later sex scenes visceral.<br><br>This film doesn't have immensely likable characters. We sympathize with May, but she, too, causes her daughter's suffering. But I doubt Kureishi intended to people his story with likable folk. His point, I believe, was to unmask a family that's already cracking when something emotionally cataclysmic happens. It's unflinching in its candor and ultimately unforgettable.","user":"anhedonia","rank":[27,28]}]