[{"title":"A Mediocre Remake for Our Mediocre Political Times (SPOILERS)","rating":2,"date":"1 August 2004","review":"(SPOILERS for both the original and the remake) <br><br>This was not a bad movie on its own terms. Good cast, stylish direction by Jonathan Demme (though now in his trademark style: huge close-ups of people looking right at the camera), some nice suspense. <br><br>But everything  and I mean everything  that made the original 'Manchurian Candidate' an unforgettable classic has been forcibly removed or revamped into dumbed-down mediocrity for our sped-up, sound-bite-ridden, politicized times. <br><br>Part of the problem, indeed , is that we can't make a 1962 movie today. We're way in the future now, and the quiet, rather straightforward simplicity of the original could not be put on the screen today (Van Sant tried it with his shot-by-shot 'Psycho' and it didn't work.)<br><br>So instead of beginning (after a brief prologue) with a brilliant credit-sequence and David Amram's deeply sad and aching score, the new one begins with a herky-jerky burst of loud rock music and a helter-skelter barrage of images of war. It's 2004, kids, enough of that quiet emotional crap. <br><br> From the start, the original had emotional resonance via its music and credit portraits of the pensive lead players alone. From the start, the new movie has no emotional resonance at all. The biggest shock is how the emotion has been sucked out of the story, entirely. <br><br>In the original, when Raymond killed the Senator and his daughter, the daughter was Raymond's new wife, the woman he deeply loved, the only person in the world who might possibly save Raymond from the pre-programmed horror of his life. Raymond's killing of those two people was the turning point of the entire film  and filmed by John Frankenheimer as a dazzling Wellesian cinema sequence with the symbolic wit of the film's dark comedy (the milquetoast liberal Senator dies shot through a carton of milk, his bleeding heart bleeding the milk of human kindness.) <br><br>All gone now in the remake's bizarre attempt to merge the murder scene with Raymond's great 'jump in the lake' scene from the original. The Senator's daughter (who looks oddly like Marilyn Manson) barely cares about Raymond anymore. His killing her is of little emotional pain. <br><br>The karate fight is gone, which means the new film is action-free, but something else important is missing: <br><br>In the original, Raymond sees his 'houseboy,' and doesn't recognize him as the man who betrayed and tortured him. Marco sees the same 'houseboy,' recognizes him on sight, and launches his furious payback attack.<br><br>There was a POINT to that. Raymond was weak, controllable. Marco was tough; his brainwashing didn't take. The contrast of tough Marco and sneering, weak Raymond, and their bonding as fellow brainwashees, was emotional and meaningful. The new Marco and Raymond prove, near the end, essentially interchangeable. <br><br>The simply magnificent 'garden party' dream sequences of the original have been removed and replaced with generic herky-jerky mind-bend sequences (we saw just last week in 'The Bourne Supremacy.') <br><br>The wonderfully symbolic playing cards/Queen of Diamonds theme has been replaced by the old microchips-planted-in-my-brain canard (we saw just last month in 'The Stepford Wives.') There is no longer a visual linkage between the Queen of Diamonds and Raymond's mother. <br><br>The wonderful trigger line: 'Why don't you pass the time by playing a nice game of solitare?' has been replaced with a banal 'Sergeant Shaw. Sergeant Raymond Prentice Shaw'  so that when Streep utters the words, she had to bark them like some sort of nutcase drill sergeant (Lansbury simply offered the chilling invitation to her son.) <br><br>Classic movies bring the right actors together in the right combination. As good as they are, none of the four leads here  Washington, Streep, Schreiber, Elise  make the emotional connection that their four forbears made. <br><br>Streep is the worst, indulging her usual tics and self-referential mannerisms to make Mrs. Shaw a one-dimensional political ogre rather than the grand monster that Angela Lansbury was (here,the Manchurian Global baddies look at Steep near the end as if thinking 'We hired this idiot politician to front us?') Times being what they are, Streep will get an Oscar and mumble speeches like \"For little old me? I don't deserve this.\" She doesn't. <br><br>Washington is a highly skilled actor who captures this version of Marco well  but Sinatra's Marco was a tougher character (that karate fight) rendered far more sad and soulful in Sinatra's best performance. Sinatra was always a great singer of lost loves and causes  he carried that emotion forward to his work as Marco. Washington can play tough, but doesn't really get to, here. Washington's fierce intelligence also neutralizes his emotional connection to the story. It's not whether Sinatra or Washington is the better actor (both won Oscars), its Sinatra's fitting the tale better.<br><br>Liev Schreiber has it in him to match Laurence Harvey's singular performance in the original (so unlovable  and yet so sad; a killer beyond his ability to control it), but the new script doesn't give Schreiber a chance.<br><br>And yes, Rosie is explained in this movie  as a character we've seen in 100 movies and 1,000 TV shows. The mystery is gone. Kimberly Elise is given nothing new to play. And she is not the star -- yet -- that Janet Leigh was when she played the role. Identification with Leigh (right after \"Psycho\") was more intense. <br><br>The ending of the new film mangles the meaning of the original. The switch of assassins requires the elimination of the tragedy of the original, and forces a expository epilogue in the modern 'gotta explain it all\" tradition.<br><br>And the loss of Joe McCarthy, World Communism, the Chinese, the Russians, and the Koreans in favor of gutless Hollywood PC villainy (an evil corporation, white guys smoking cigars, and a South African white scientist) is standard issue. We've seen this movie before  and it wasn't 'The Manchurian Candidate.' <br><br>That the new 'Manchurian Candidate' is worth seeing at all is because the source material is so good they can't totally wreck it, and because the star actors are interesting enough even if they never soar where the original took its characters. <br><br>It's a three-star movie of four-star plus material, and in destroying virtually everything that made the original such a special film and great classic, the new 'Manchurian Candidate' deserves a drop of at least another star.","user":"ecarle","rank":[187,257]},{"title":"Less powerful, less edgy, and less intelligent than the original.","rating":30,"date":"30 November 2004","review":"Three months ago I watched the original Manchurian Candidate on DVD. I was amazed on how good this movie is, and how well it holds up after 42 years of its release in movie theaters. <br><br>So, yesterday when I watched the 2004 version directed by Jonathan Demme it was impossible for me not to compare the two films. <br><br>Without the existence of the original, Demme's effort could be defined as a good (not outstanding) political thriller and it's easy to think that this definition is compatible with the general opinion of today's audiences. <br><br>But (a big but) in reality there is an original, and it is so good, so brave, and so well written that this new version almost feels pointless.<br><br>In adapting the story to modern day Jonathan Demme made more wrong choices than good ones diminishing the power and intensity of the original.<br><br>This remake took out some key dramatic elements that work marvelously in the original film inserting some new and poorly written plot twists changing and damaging the dramatic resolution. <br><br>This version is inferior in almost every level (the only exception is the acting). It is less powerful, less edgy, and less intelligent.<br><br>Fortunately for Demme the original picture is not as well known as classics like 'Casablanca' and this will allow his film to find a moderate positive acceptance.","user":"ramirocardozo","rank":[40,56]},{"title":"Meryl, you're no Angela Lansbury","rating":17,"date":"17 August 2004","review":"While the 2004 remake of \"The Manchurian Candidate\" is ensemble acting at its finest, Meryl Streep seems to be having a bit too much fun playing the villainess Eleanor Prentiss Shaw. She doesn't have the same blood-curdling constitution as did Angela Lansbury.<br><br>\"What was I supposed to do, call a MEETING?\" she exclaims as her wimpy male colleagues in the shadowy Manchurian Global upbraid her for ordering someone killed without consulting them. Problem is, she was radiantly glowing when she uttered the line, which produced laughs in the NYC theatre I was in.<br><br>When she showers Liev Schreiber with overly affectionate kisses and hugs, one again suspects Meryl was having a bit too much fun on camera with someone she finds quite attractive -- don't we all? -- in real life.<br><br>On its own, the 2004 remake is fine cinema. But the problem with all remakes is the inevitable comparison with original. And sadly, as much as I like the 2004 version, my vote goes with Angie Lansbury and Laurence Harvey.","user":"jeffgramny","rank":[24,33]}]