[{"title":"Not as bad as everyone says!","rating":7,"date":"11 August 2005","review":"When this movie came out critics and audiences were saying how rubbish it was and it was a waste of time and money, but as i have a keen interest in the paranormal i still wanted to see it anyway and i glad i did! This is a family film but there are elements of adult horror here such as suicides, murder and even zombies! The story is of a typical workaholic dad who neglects his family and decides to take them away to make up for this, but when he receives a call asking him to sell a mansion he can't refuse so off he and his family go.<br><br>Once there they meet the creepy butler Ramsley and the owner Mr Gracy who are obviously ghosts, and from then on all the supernatural events follow one-another from zombie reflections to levitating around a psychic in a crystal ball called Madame Leota. And i thought she was the best character in the film, not just because i'm a Jennifer Tilly fan but because she is very funny and has a strong personality for just a head.<br><br>The effects are as amazing as the sets with the green glow of Madame Leota, the zombies and more even the people who didn't like this film can't deny that the effects are excellent. As i said the sets are also some of the best i've seen the mansion is absolutely breathtaking.<br><br>The only thing that i think is bad with this movie is the child actors, they just look bored going round the mansion with straight faces even though they follow ghostly orbs into unknown places. But apart from this the rest of the film is great fun for kids and for the adults who aren't afraid to turn their brain off for 90mins. WATCH IT!!!!","user":"PsychoKlown","rank":[45,59]},{"title":"Better than I expected.","rating":8,"date":"10 October 2006","review":"First of all, I am a Disney kid that grew up going to Disneyland in CA every year. Since I am a fan of the ride, \"The Haunted Mansion\", I guess I expected this film to be good. When I heard the mediocre reviews, I backed off from watching it until I just bought it on DVD this past weekend. I was very surprised to find it a lot better than I expected. My kids loved it and have watched it about 3 times.<br><br>The sets were beautiful and intricate, the costumes and make-up are gorgeous and the special effects are amazing. Rick Baker \"Monster Maker\" is so talented and has done an impressive (as always) job creating a vision from the Haunted Mansion ride that he also admired.<br><br>If you are a fan of the ride, I would imagine that you would enjoy this movie as much as me.","user":"belva0308","rank":[28,37]},{"title":"Actually not half-bad.","rating":8,"date":"14 October 2005","review":"'The Haunted Mansion' got a lot of bombs thrown at it by critics, and almost nobody liked it. Well, guess what: I did. It's a faithful homage to the ride, the actors are interesting, and the horror side of the story is appropriately creepy. The plot is partially based on the French version of the ride, and it's decent. Although the movie never answers the question of why Master Gracey (Nathaniel Parker, who's really good here) couldn't marry his sweetheart Elizabeth (who was black), the hints are pretty obvious. And I liked the whole concept of the curse (even though it doesn't make any sense). The little nods to the ride throughout the movie are fun, especially Jennifer Tilly as Madame Leota, a disembodied head inside a crystal ball who speaks in riddles. Tilly can do this husky-voiced role in her sleep, and I liked her (the special effects involving her are pretty neat too). Although Eddie Murphy is miscast, and there are zero laughs in the movie, his mugging for the camera doesn't hurt the movie. The kids are OK, and Marsha Thomason does what she can with a thankless role, but it's Terence Stamp who steals the movie. He is Ramsley, the sinister butler of Master Gracey. With his deep rumbling British accent, Stamp gives a deliciously over-the-top performance, and he does here what Johnny Depp did for 'Pirates of the Caribbean'. Back to Eddie Murphy for a minute: Although he earns no laughs, he plays noncomedic scenes well, and he has some good banter with Stamp. The production design of the mansion and the ghostly special effects are very cool, particularly a zombie attack that pushes the PG rating to it's limits. Is 'The Haunted Mansion' a great movie? Absolutely not; they could have punched up the comedy aspect of the movie. It's not a bad movie, though. I thought it was very entertaining, and it's certainly better than the awful trailers. Not as good as 'Pirates', but a fun ride nonetheless.","user":"crowrobot","rank":[33,46]}]