[{"title":"I have no idea why Superman Returns has such a bad reputation. This is actually really-really good!","rating":8,"date":"27 March 2016","review":"I was totally surprised and blown away by this movie! First of all, Superman Returns takes you back to the original cinematic universe of Superman 1 and 2. When the movie started and I realized that, I was pretty skeptic, I didn't believe that it could work 26 years after Superman 2 (actually it was 36 years, when I was watching it). Then when Clark Kent returned to the Daily Planet, and I saw that the actor (Brandon Routh) is actually doing Christopher Reeve's Clark Kent, I was like \"Oh no, this will be bad!\". The same thing with the young photographer, Jimmy Olsen - the actor was playing the exact same character. I didn't like the concept. But then I said to myself, okay, I'm gonna go with it, so I kept watching the movie, and very shortly I had to realize that it actually works! It was funny, it was exciting, it was emotional - it was everything that a classical Superman movie needs to be! Kate Bosworth as Lois Lane was amazing! She was actually not trying to copy Margot Kidder, she was doing her own thing, but still remained Lois Lane. I would say, as far as acting goes, Kate Bosworth was the best thing in this movie. <br><br>A couple of things I didn't like: <br><br>1. In the first half of the movie there were some pretty bad CGI moments. There were some scenes where Superman almost looked cartoonish. Thankfully it was only 2 or 3 scenes, the rest of the visuals and CG were pretty good - especially considering that the movie was made in 2006. <br><br>2. Kevin Spacey was not a good Lex Luthor. He probably was told to do Gene Hackman's Lex and it just didn't work. At least in the first half of the movie. In the last hour or so, it seemed like he started to adjust the character to himself a little bit, and that did make him more believable as Luthor.<br><br>In the last half an hour the movie was flying! There was action, there was suspense, drama and a lot of emotion - but not too much! It was just perfect. I was actually in tears, which doesn't happen to me very often.<br><br>By the way, I did like Man Of Steel too, I didn't mind that DC eventually took the franchise in that direction. But I have to say, I did like Superman Returns even more. This one I loved! This is not the kind of superhero movie that fans expect from DC and/or Marvel in 2016. This rather takes you back 20-30 years in time and helps you feel what it was like when as a kid you were cheering for Superman. <br><br>Thank you, Bryan Singer and whoever else was involved in it!","user":"Reznik_T","rank":[92,103]},{"title":"Superman","rating":6,"date":"24 February 2020","review":"To me, Man of Steel was way better despite the controversy. Superman Returns was an okay film. I am really happy to see Brandon Routh as Kingdom Come Superman in Crisis On Infinite Earths.","user":"MR_Heraclius","rank":[38,42]},{"title":"Underrated Movie","rating":8,"date":"22 April 2016","review":"I became curious enough to re-watch this movie after seeing Brandon Routh's performance as Ray Palmer/A.T.O.M. in Arrow, Flash, and Legends of Tomorrow. <br><br>I feel that it is a highly underrated film and gets an unnecessary bad rap. Brandon Routh's portrayal of Clark Kent/Superman, I feel, is second only to Christopher Reeves, whom he does a great job of capturing. <br><br>The action scenes are top-notch and fun to watch. It even has one of the most brutal fight scenes in any Superman movie which could be a bit hard to watch. Yes, even more than the Zack Snyder movies.<br><br>This movie is far from perfect, but it is a lot better than what it's given credit for. I do recommend checking it out.","user":"joelelvers","rank":[64,74]}]