[{"title":"fine film-making overcomes flaws","rating":3,"date":"3 October 2004","review":"'The Dreamers' is Bernardo Bertolucci's bizarre and fascinating (if not altogether successful) distillation of the radical '60's mentality. Since the film is set in Paris in 1968, the radicalism naturally takes the form of perverted sexuality and extreme cinephilia. Leave it to the French to be exploring l'amour in all its myriad possibilities!<br><br>In terms of plotting, 'The Dreamers' is much like an incestuous version of Truffaut's menage a trois classic 'Jules and Jim,' with the new film's subject matter as shocking today as was the earlier film's in its own time. Time and culture sure do march on, and it always seems to be the French leading the way. In 'The Dreamers,' Isabelle (Eva Green) and Theo (Louis Garrel) are twins who have developed a rather 'unnatural' attraction to one another, becoming 'one' in virtually every way imaginable - physically, spiritually, psychically. Matthew (Michael Pitt, who looks for all the world like Leonardo Di Caprio) is the young American in Paris whom they pull into their strange little world of sexual intrigue and emotional games. Matthew is a product of his time, a young man who is not very experienced in the ways of the world but who is willing to partake in the moral relativism that is permeating the culture. Thus, he becomes the perfect candidate for Isabelle and Theo to work their magic on. Their power of attraction proves overwhelming and irresistible for Matthew, for they are both exotically beautiful creatures, seemingly in tune with the trendy radicalism swirling around them. Yet, Mathew eventually discovers that they are really only passive observers paying little but lip service to the cause, too obsessed with their own twisted relationship to actually step out and participate in those grand social movements they talk so freely about. Isabelle and Theo are 'radicals' to be sure, yet their radicalism seems to be channeled in a self-destructive, ultimately futile direction. Only over time does Matthew awaken to this realization.<br><br>Due to the extremely sensitive nature of the subject matter, Bertolucci often seems more interested in shocking than enlightening us. Isabelle, Theo and Matthew are so insulated and cut off from the outside world that the points Bertolucci seemingly wants to make about the times - as reflected in protesters marching in the streets, the references to Vietnam, Mao and Jimmy Hendrix - feel tacked on and superfluous, not particularly integral to the film as a whole. He is never quite able to bring these background elements and the foreground story together in any meaningful way. What Bertolucci does capture well is the obsessive love the French have always had for the cinema as both entertainment and art form. His characters live, breathe and think films, often acting out favorite scenes while the director intercuts snippets from the movies themselves. The beautiful thing about the French is that they have always had such an eclectic taste in film, embracing both American studio and French New Wave products with equal passion. And this artistic open-mindedness Bertolucci captures with gleeful abandon. The film, in many ways, becomes an homage to Chaplin and Keaton, Astaire and Rogers, Samuel Fuller, Truffaut, Godard, Greta Garbo and many other icons of movie history.<br><br>'The Dreamers' doesn't entirely hold together and the sum of its parts is better than the whole. Still, the acting is excellent and Bertolucci has lost none of his skills as a director, making each beautifully composed shot stand for something - a real treat for audiences bored to tears by the kind of by-the-numbers film-making we get so often today. Bertolucci is a true film artist and it is a joy just to sit and watch what he does with his actors and his camera, like a master painter working wonders with his canvas.<br><br>As for the much-vaunted sexual content of the film (it is rated NC-17), certainly those who are easily offended by nudity and provocative sexual themes had best avoid subjecting themselves to this film. Those, however, with a more open mind will find little that is overtly offensive about what is shown here. In fact, if Isabelle and Theo weren't brother and sister, there would be little controversy at all generated by the film. My suspicion is that Bertolucci and writer Gilbert Adair made their film about incest because an ordinary love triangle would have seemed just too commonplace in this day and age to serve as a successful plot device for a film whose very theme centers around radicalism. They really needed to shake the audience up and this was as effective a way as any to do that. Whether it repels more people than it compels is something only time will tell.<br><br>As it is, 'The Dreamers' is not an entirely successful film, but those impressed by fine film-making had best not pass it up.","user":"Buddy-51","rank":[304,343]},{"title":"Sex, Cinema, Politics - A True Molotov Cocktail","rating":20,"date":"20 July 2004","review":"The decor for The Dreamers, Bertolucci's sensual and narcotic film is represented by effervescent moments that took place in Paris in 1968. In the same manner in which the house inhabited by the three main protagonists represents a character, so do the Parisian streets, with their trepidation and demonstrations. Contrary to other films directed by this director - who has promised much and delivered even more throughout his career - The Dreamers opens in a fast-paced and provocative manner. The director establishes the cinematic convention precisely, eloquently, and elegantly. It becomes clear that the film deals with furious and beautiful young people who live through the films they devour. In the first five minutes, the heroine of the picture (played impeccably by Eva Green, a theatre actress reminiscent of Isabella Rossellini) announces that she was born in 1959. Logically, it is impossible, seeing that the year is 1968 and she seems to be at least 19 years old. Therefore, she explains further: 1959, Champs-Elysee, where she yelled \"New York Herald Tribune!\" Suddenly the film cuts to a scene from the classic Breathless (A bout de soufflé) by Godard, where Belmondo's feminine partner sells American newspapers on Champs-Elysee. Consequently, Bertolucci's feminine character believes that she has not been alive until seeing the afore-mentioned film, considered by many the beginning of the New Wave. The idea of interposing images and references to classic films is augmented in The Dreamers. It becomes a means of communication between the characters and in fact it ignites the entire \"action\" of the film.<br><br>As in The Last Tango in Paris or Stealing Beauty, sex and sensuality also represent means of expression on which the director relies heavily. Yet The Dreamers rejects the desperation of The Last Tango through a seductive irreverence that indeed characterizes the so-called \"enfants terrible\" of 1968 Paris. It should be noted that The Dreamers contains various sexual and nude scenes, but that these are by no means as shocking as the sex scenes in The Last Tango were, when that film was released in the 1960s. Since then, video and Internet pornography have occurred and shocking audiences through nudity has become something of a moot point. It is only the MPAA that hasn't grown up. It gave The Dreamers basically the same rating that The Last Tango got, 30 years ago.<br><br>Undoubtedly, the angles of the shots in The Dreamers are what impresses the most. As in other films by Bertolucci, practically every shot could be cut out and studied hours at an end for its elegance. The three main characters (all played beyond reproach) live their menage-a-trois through concrete gestures and attitudes, as well as through emotions that are suggested by the sublime cinematography.<br><br>The ending of the film, considered by some critics a weak point, is in fact quite accomplished. American viewers (including some critics) are used to American films, in which the build-up leading to the climax is essentially dynamic, suspenseful or tragic. But the European cinema is different. It often shows how feelings are condensed in a quiet but explosive mixture. This description fits The Dreamers like a glove.<br><br>Finally, a note for film buffs. In the initial scenes, at the demonstration in front of the Cinematheque, Bertolucci used news reel footage from the '60s with Jean-Pierre Leaud si Jean-Pierre Kalfon (known actors of the New Wave). They are seen giving speeches and throwing paper leaflets to the crowd. In 2003, when shooting the film, Bertolucci got Leaud and Kalfon, now aged, to \"reenact\" the images from the news reels. The end result is a mixture of new and old images, the former in color, the latter black and white. It is such tricks that Bertolucci uses throughout this nostalgic film that celebrates a certain period, during which the young generation had more meaningful things to fight than computer-simulated monsters.","user":"Alex_52","rank":[177,211]},{"title":"All dreamers must eventually wake up","rating":6,"date":"10 March 2004","review":"My rating:  6/10<br><br>There are two types of dreamers in `The Dreamers':  the three main characters, who create their own interior world and prefer to view the outside world by watching classic 1930s cinema; and the socialist street revolutionaries of riot-torn 1968 Paris, who attempt to overthrow the political and economic power structure.  `The Dreamers' focuses more on the former than the latter, and Bernardo Bertolucci is careful to leave his film open to interpretation, but ultimately the dream world of the three main characters is shattered by the realities of life.  The film ends before resolving the outcome of the second set of dreamers, but we all know our history.  Some may think it a shame that the dreamers fail, but others like myself will view it as something that has to happen, if the dream is unrealistic and unsustainable.<br><br>The relationship between the three main characters is unlike anything that I've ever seen portrayed on film.  The twins, Isabelle and Theo, are almost as close to each other in young adulthood as they were during the nine months they spent together in their mother's womb.  Matthew, a U.S. student studying abroad in Paris, inserts himself into the middle, and when he receives early indications that portend the depth of the relationship between the twins, he does not run away.  To me, this required too much suspension of disbelief, but I'm certainly aware that others have different proclivities.  If Bertolucci's intent was to show a high degree of separation between his three dreamers and the rest of society, he certainly succeeded.<br><br>The three dreamers have some, but ultimately too little, awareness of their separation from reality and the unsustainable nature of the world they create.  While sympathizing with the revolutionaries in the street, they actually are the ultimate materialistic consumers:  they produce nothing that they consume (neither food nor art), and when the money their parents provide runs out, and they've drained most of the wine cellar, the harsh realities of life set in.  Rooting through trash heaps isn't the answer, and the choices that they leave themselves in the end (self-annihilation or nihilism), I believe, show just how flawed their ideal world is.  My interpretation is that this lesson also applies to the other set of dreamers, the street revolutionaries, but those who even today sympathize with the views of those revolutionaries will reject this interpretation.<br><br>`The Dreamers' is very voyeuristic, and Bertolucci puts his three leads through some incredibly intimate moments.  All three leads are quite good, with Eva Green in particular deserving special notice for a completely uninhibited performance (at least the two male leads had each other's example to follow).  It's hard to come up with an accurate overall rating for this film, because I think there will be a widespread variance in how different people react to both the storyline and the images.  Read the reviews carefully, and if it sounds like something that interests and won't shock you, then give it a try.  My middle-of-the-road rating is mainly due to my not being terribly interested in the type of relationship formed by the three main characters.","user":"cs100","rank":[168,213]}]