[{"title":"Took Me By Surprise","rating":8,"date":"23 November 2005","review":"This film blew me out of the water. I was expecting an amiable, slight comedy, serving more than anything else as a launching pad for Katie Holmes's career into the Hollywood big time. But instead, this movie is a substantive and very moving story about a young girl who desperately wants to make a nice Thanksgiving dinner for a family from whom she feels somewhat estranged. It's extremely warm but extremely sad, and left me with a huge lump in my throat.<br><br>Katie Holmes is winning and sweet as April, and whether or not you like Holmes, I bet you'll be rooting for her by the film's end. For one day, her whole world becomes about planning one successful dinner party, and her lack of skill forces her to fall back on the kindness of neighbors she's never taken the time to meet. Meanwhile, her family (mother, father, brother and snotty sister) are on their way into the city to April's apartment, whining and complaining about having to visit a crummy part of town and missing no opportunity to criticize April, while trying to ignore the white elephant in the room, the fact that their mom has cancer and may not live to see another holiday. Of course, the conversations they have with each other communicate heaps of back story and clue us in to the family dynamic, and we learn that April's biggest critic, her mom, also happens to be the most like her daughter.<br><br>Patricia Clarkson has become one of my favorite actresses, and her Academy Award nomination for her performance as the mom in this film was richly deserved (I think she should have won). She beautifully plays this role with just the right amount of sarcasm and wit to prevent the movie from ever getting bogged down in sentimentality. When she finally is reunited with April at the very end, what could have been an icky, maudlin ending instead knocked the wind out of me with its simplicity and honest emotion.<br><br>\"Pieces of April\" just feels like one of those movies that is based on actual events in the life of its writer or director. It's full of tiny details of behavior that make the characters feel completely authentic, rather than creations. And there's a total understanding on everybody's part of the dynamics at play in a family that doesn't always get along and of that tendency of families facing some sort of crisis to latch on to one thing that's pretty mundane in order to avoid dealing with something else that is too big for the individual family members to deal with on its own.<br><br>Grade: A","user":"evanston_dad","rank":[54,61]},{"title":"Outstanding","rating":9,"date":"16 January 2005","review":"From the initial scene of the ordeal of getting April up in the morning to the final shots, this was one of the most enjoyable movies I've seen in a long time. And it's enjoyable on many different levels -- it's funny, charming, weird, intelligent, and it has a real honest heart to it that isn't nearly sentimental or gushing. The psychological depth of this movie is astounding; and the characters, though there are many of them, are well realized. It is very clear that this film was made with a lot of care and compassion. With the possible exception of Wayne (overdone by a miscast Sean Hayes, reminiscent of the cringe-inducing Mickey Rooney in Breakfast at Tiffany's), you felt real emotion from every character. Katie Holmes is great as the disaffected daughter and Patricia Clarkson is just fantastic in a very complicated role. Well made and well acted. Highly recommended.","user":"stills-6","rank":[67,80]},{"title":"funny and moving little film","rating":11,"date":"11 April 2004","review":"Written and directed by Peter Hedges, `Pieces of April' is a droll little comedy with deadly serious overtones.  April is the black sheep of the Burns family, the one child of whom her mother has no fond memories.  Although from what we see of her, April seems to be a pretty decent young lady, it is obvious that her parents and her brother and sister harbor deep resentments towards her (her earlier involvement with drugs and drug dealers seems to be the primary cause of bitterness).  Well, it's Thanksgiving Day and April is attempting to mend some bridges by hosting this year's dinner at her cramped New York City apartment.  April is terrified of failure and her family members have little faith that she will be able to pull the event off. Complicating matters even further is the fact that Joy, April's mother, is suffering from terminal cancer.<br><br>As a narrative, the film basically runs along two parallel tracks.  One involves April and her frantic attempts to get her dinner cooked despite the fact that her gas oven has suddenly stopped working.  This forces her to go up and down the hallway of her apartment building throwing herself on the mercy of her colorfully eccentric neighbors, some of whom offer their assistance and some of whom don't.  Hedges mines his richest vein of humor in this section, capturing the offbeat nature of both the people and the situation.  The other plotline - involving the family's reluctant trek from suburbia into the city - naturally carries with it far more serious overtones, dealing as it does with death, recrimination, family dysfunction and despair.  But even here, Hedges is able to inject some moments of wicked black humor into the proceedings.<br><br>Oddly enough, of all the characters, April is one of the least fully developed in the film.  She remains basically a passive observer and most of what we learn about her comes from comments made by various family members. We have to take it on faith that she is such a loser and a troublemaker because we see very little evidence of it with out own eyes.  Certainly the most intriguing character in the story is the ironically named Joy, ironic because, even though her terminally ill status should elicit sympathy from the audience, her often-nasty disposition makes it difficult for us to like her.  This is Hedges' boldest touch, this refusal to sugarcoat or sentimentalize a person just because life and the fates have been unkind to her.  Also quite fascinating is the character of Beth, April's younger sister.  We see how Beth thrives on the positive attention she receives simply by being the `good' daughter of the family, and how she jealously and ever-so-sweetly guards her own position while subtly sabotaging any effort on the part of April to make amends and to find her way back into the fold. It's a fascinating portrayal of sibling rivalry carried to destructive proportions.<br><br>`Pieces of April' features wonderful performances by Katie Holmes as April, Oliver Platt as her father, Alison Pill as her sister, and Derek Luke (from `Antwone Fisher') as her boyfriend.  Particular praise should go to Lillias White, as the neighbor who supplies April with a stove at her greatest hour of need, and to Patricia Clarkson as Joy, who achieves the Herculean task of making her pain-wracked character both abrasive and sympathetic at the same time.  It's an award-worthy performance.","user":"Buddy-51","rank":[50,59]}]