[{"title":"A World Unto Itself","rating":9,"date":"2 March 2005","review":"I recently saw this film after seeing Green's George Washington. While that film was interesting it wasn't fantastic...Undertow is fantastic and more. The plot is simple enough, just a story about two boys and their father living in the backwoods of America when their world is interrupted. The boys' uncle comes to visit, recently out of prison, and life quickly changes for them all and the true beauty of this film comes out. Where many movies fail is in focusing too heavily on the main characters or the action of the story. Undertow makes no such mistakes. In between the more intense scenes we are introduced to the world around our heroes. We meet fully developed characters each of whom could easily fill a movie of their own. Rather than creating a world for us to watch, Green has instead allowed us into a living, breathing world as observers. We don't get explanations for everything, only what we see on the screen. Miraculously, none of these characters slow down the film. They add humor or romance or suspense before we are snapped back to the main story. On top of all that the film is beautifully shot, perfectly acted/cast and the music fits the moods in each scene. There is finally a movie that can thrill us, but still take time to make sure we care and believe in it's world. I cannot recommend it enough, you will not be disappointed.<br><br>I'm not sure what world Green will next allow us to enter, but I can't wait.","user":"thatoneguychris","rank":[68,83]},{"title":"Intense, brooding, grimy  this is the best film I've seen in a long time","rating":9,"date":"26 July 2006","review":"Director David Gordon Green's critically acclaimed Undertow is a strange but gripping experience. I don't know any other film quite like this. We've seen the slow pacing build up tension in the plot before in films, but it's so much more than that in Undertow  it's the pace of a family's life in the deep backwoods of Georgia and it it patiently lets us absorb everything. Maybe I was in a sensitive and impressionable frame of mind when I saw it, because I remember being so shaken and touched by this fare that its visuals and mood still haunt me.<br><br>But this patient, slow pace is the calm before the storm as it comes to an end when the brother of the father of the family comes to visit, newly released from prison. Josh Lucas is this brother, and he captures the shady nature of his character with effortless conviction. His presence is felt in scenes he is not even in. Upon arriving to the family, the film just takes a completely different turn and we follow the two brave kids in the family on the run in the south from their uncle.<br><br>This is further emphasized by attention-grabbing frames that freeze whenever intensity builds up. This may seem anti-climactic, but it's extremely effective and it makes the chase sequences very exciting and 1970s-influenced. So it essentially shifts between chase mode and (eerily) quiet South-paced calm in a genius way. If you like your films fast-paced and action-filled however, its brilliance may be lost on you  but if you give it time, Undertow will surprise you as it's unpredictable, even in style. This is just how meticulously-crafted it is.<br><br>The film is grimy, dense, brooding and realistic and it zooms in on the deep necks of Georgia, featuring some gorgeously striking visuals, making you feel the dirt and heat of the deep south as if you were right there, breathing the murky warm air from the brown rivers. Some say Green's directing style is reminiscent of Terrence Malick (it is very visually-driven) but I don't think so  rather it is an insult to the former; Green clearly knows what he's doing and lets nature visuals facilitate the story he tells, while Malick lets the story facilitate his pointless nature visuals.<br><br>I loved Undertow more every minute it progressed and am now prepared to give this film a 9 out 10. I also have it firmly stapled in my top 10 films of all time list and that is quite a feat for such a low-key dark horse. <br><br>9/10","user":"Flagrant-Baronessa","rank":[31,44]},{"title":"The \"Dukes of Hazzard\" Go to Hell","rating":7,"date":"9 July 2005","review":"Taking a pop-culture icon and flipping it on its head is a favorite pastime of young film directors. In 1986 David Lynch took his boy-scout memories and essentially, in his own words, sent \"The Hardy Boys\" to hell with \"Blue Velvet.\" Likewise, with a bit of Terrance Malick inspired poeticism, director David Gordon Green sends the good old Duke Boys to hell with \"Undertow.\" Josh Lucas is effectively menacing in a \"Night of the Hunter\" kind of way as the recently released from prison brother of the stoic Dermot Mulroney, who has secluded himself and his two sons from the rest of the world on a hog farm following the death of his wife (whom was previously involved with Lucas' character). Some family folklore involving a hidden stash of gold coins sends Lucas' ex-con on a rampage that ends with the tracking of the young brothers on the run through rural American Gothic hell on earth. There's a lot to fault in a film like this, but also a lot to treasure if you give it the time. Jamie Bell and Devon Alan as the two brothers are very convincing and easy to route for, and some directorial flourishes from Green and nice character acting from Lucas keep the film fresh and original even as it channels past classics from Malick (\"Badlands\"), Lynch (\"Blue Velvet\"), and the \"Night of the Hunter.\" There's also a score from my favorite minimalist composer Philip Glass. All in all, not a bad way for a film buff to spend their evening.","user":"WriterDave","rank":[23,33]}]