[{"title":"Teenagers!","rating":9,"date":"4 January 2006","review":"Don't know about you all, but I've sort of had it up to here with teenagers. Walter Salles' *Dark Water* flopped because of teenagers. The geniuses up the highway from me at the Walt Disney Company tried to market this psychological drama -- in SUMMER! -- to teenagers as a slasher film . . . OOPS. When the teenagers discovered that the film's primary concern was with a troubled single mother, fresh from a nasty divorce and currently embroiled in a custody fight, they lost patience with it (the screen offering no steaming entrails oozing from savagely slashed pregnant abdomens and such) and commenced downloading ring-tones from Katazo on their cellphones in the darkened theaters. The epilogue to the sorry saga of this film's release? The teenagers infest this website with their 1-star reviews and poor grammar and ALL CAPS SENTENCES. Look, I've got an idea: I think it's high time that the folks at IMDb create an entirely separate website -- let's call it \"IMDbTeen\" -- in which the children can vent their spleen and leave THIS site for the rest of us to discuss movies. And no, banishing the youngsters to the discussion boards won't cut the mustard -- the Ritalin-addicted kids, thumbs sore from their PSPs, have obviously found their way to the review pages. Or perhaps IMDb, which is owned by Amazon, can follow their corporate parent's lead and force teenagers to identify themselves as such -- the rest of us can then ignore their comments.<br><br>Pardon the W.C. Fields rant, but *Dark Water* is too good a film to be hijacked by walking pimple sacks, sorry. Here is a great work of art that has been virtually disowned by its director because of the poor box office returns. Hey, Salles, if you're reading this, there's no reason for you to hang your head in shame over this picture. I, for one, appreciated your baroque homage to Polanski's *Repulsion*, and can even state that the performance you get out of Jennifer Connelly actually surpasses Deneuve's work in that earlier film. Connelly thoroughly inhabits the role -- an unglamorous one that asks this beautiful actress to dress in ratty clothes while suffering from constant migraines. She convinces us as a desperate case, both financially and emotionally, and also convinces us that Dahlia is an honest-to-goodness mom (Connelly has a couple of kids in real life, which not only helps, but is a necessity on an actress' resume if she presumes to play this part). And it's not just Connelly who scores in the acting department: John C. Reilly as the superintendent delivers an immortal monologue (mostly improvised, according to the DVD extras) as he offers Dahlia and her daughter a grand tour of the hideous housing project on Roosevelt Island that is the setting of the movie. \"Where's the living room?\" asks Dahlia. \"This is it,\" effuses Reilly, \"It's both bedroom AND living room! It's what they call a DUAL-USE room. Look at it -- it's huge!\" Anyone who has ever dealt with a real estate agent will recognize Reilly's canny mix of friendliness and utter untrustworthiness. A-class talent such as Pete Postlethwaite and Tim Roth also make significant contributions as the building's janitor and Dahlia's lawyer, respectively.<br><br>But the prime virtue of the film is in the photography and set design. *Dark Water* is that rarest of horror films: it's set in the city. Roosevelt Island, to be precise, that run-down spit of land across the river from Manhattan, encrusted with Soviet-bloc inspired tenement housing. (\"The Brutalist style,\" as Reilly would have it.) Salles' DP has a field day in this environment, getting some nice aerial shots of the brick and cement rat maze, as well as some low shots pointing up toward the tenement towers' imposing height. The weather is usually rainy (the incessant leitmotiv of the film is water, obviously), the sky is gun-gray, smokestacks dominate the horizon, the overall color palette consists of institutional gray, poverty-row brown, icky black, depression blue. The interiors, specifically of Dahlia and Ceci's apartment -- along with the mysterious 10-F directly upstairs -- is a fond homage to Catherine Deneuve's greasy, miserable apartment in Polanski's *Repulsion*, with some nods thrown towards the Coens' *Barton Fink* along the way (especially in regards to the peeling plaster and moist dry-wall and overall dilapidation).<br><br>But is *Dark Water* really scary? Presumably, this would be the point. It's probably not scary enough to scare the pimple sacks, but it's scary enough for those who've had to deal with life's most fundamental problems, such as raising a child alone, or finding oneself crippled by either physical or mental handicaps, aggravated by an unhappy past, WHILE raising a child alone. In other words, it's scary enough for grown-ups, who can find terror in watching their children cross a busy intersection. And in any case, Salles delivers a few choice jolts along the way, which I won't spoil. But the genius of the film is in its atmosphere: an unrelenting brooding menace that feeds off of urban misery. *Dark Water* is depressing and scary.<br><br>And splendid. 9 ardent stars out of 10.","user":"FilmSnobby","rank":[177,238]},{"title":"Good character-driven human drama; I blame the teenagers for the low rating.","rating":9,"date":"26 July 2005","review":"Once more, a great injustice has been done by IMDb voters. Dark Water currently has a rating of 5.4, with 16% of the voters giving it a 1! Note that 16% is 251 users, so it's not that a lot of people thought it was bad, it just that not many people saw it and/or voted.<br><br>It's quite obvious what happened. In what must be the most idiotic marketing move of the century, Dark Water was promoted as a horror movie. Not only is the original Japanese version not that scary to begin with, and focuses more on the drama and the human aspects of the story, but in the remake, the horror element completely gets thrown out the window in favor of an intelligent, mature human drama. I can say that 75% of the people who were with me in the theater had no idea what kind of movie this is going to be. Needless to say, about an hour into it they began shifting in their seats, chatting or giggling. Most of them were teenagers, who came looking for cheap thrills and got a \"bore-fest\" instead. The same kind of teenagers who, I bet, later voted it a 1.<br><br>True, the movie could have been edited a little tighter, and some sequences could have been left on the editing room floor, but it's not boring. It does take its time establishing and developing the relationships and the characters, but since the movie is all about the characters, that's a good thing. It's quite an ambitious drama, and as such, it doesn't always strike home. The script, I think, is the main problem. Since it presents us with very real people with real problems, but doesn't seem to know where to take them from there. As a result, the plot is thin. It's certainly not an event-driven movie. It remains unclear what the main conflict is for the heroine. The writer wasn't fine tuned on what he wanted to say, or maybe the director, Walter Salles, mishandled the material. For me, the story was about learning to let go, and the difference between loving someone and wanting them to be happy, and loving someone so much that you want that person to belong only to you. It's the difference between being willing to sacrifice vs. a selfish and possessive kind of love. I think the movie should have put more weight on that.<br><br>Other than that, the film does strike the right chords more often than not, and provides a lot of touching, sad moments. The acting is wonderful and three dimensional. All of the cast does an excellent job, but especially Jennifer Connelly, who proves once more she is the best American actress working today. The cinematography and the art design are beautiful, with a lot of attention to atmosphere. Also, Walter Salles shows some neat directing techniques in playing with the viewer's minds, making us doubt what's real and what's imaginary, and giving visual expression to the heroine's ever deteriorating state of mind.<br><br>All in all, I'd rate this movie a 7.5. But 5.4?!!!! That's lower than Fantastic Four, for crying out loud. I just hope that it finds the right audience when it's released on DVD.","user":"Potty-Man","rank":[297,417]},{"title":"Beautiful","rating":14,"date":"14 October 2019","review":"Ye the story is amazing, the neo noir atmosphere and gothic sequences surpass anything one could imagine and the science fiction plot works, but I was referring to Jennifer Connelly. is there a more beautiful woman playing a more beautiful character than hers in this fabulous masterpiece? i don't think so. She is super thin, ravishing brunette with lips with a million dollars. Well done.","user":"jakobialvi","rank":[12,13]}]