[{"title":"Great cast, (below) average movie","rating":4,"date":"4 February 2006","review":"A movie is about Malcom King, a spoiled tycoon, who treats people like dirt and acts funny. I think the character was quite good for the comedy genre, so bad the writers of the story weren't bit more creative. The core of the comedy is, that at certain situation, three different groups or individuals mastermind and want to execute the kidnapping (including Mr. King himself). This situation brings a lot of confusion and fun, but I was very disappointed at the laughable material in this comedy. It definitely isn't the type of comedy where you have problems to catch on breathing. Quite reversely, you'll hardly laugh at this flick. It's a kind of light movie you can stare at, and smile for the most part. I expected much more, but it didn't hurt.","user":"maros612","rank":[11,13]},{"title":"This movie should have been straight to DVD. It was SO damn bad!","rating":1,"date":"15 October 2009","review":"This movie was probably the crappiest movie I've ever seen. I watched it in Winnipeg, at my friend's house. I found it on my friends' coffee table, and had to see how bad it was. Critics all over were panning the film, and I had to see for myself. It was even worse than I thought it would be, with a god damn ridiculous and stupid plot, unimaginative jokes, and nasty characters.<br><br>Here's the plot.: King's Ransom is about an arrogant rich king named Malcolm King. His wife is angry with him, and wants him to pay her alimony or somethin. I don't know what it's for, but I think alimony. When she wants him to pay, he plans his own kidnapping so he doesn't have to pay her. At the same time, other people are planing to kidnap him, too! When one of the kidnappers DOES kidnap Malcolm, he thinks the kidnapper is following his ridiculous plan, but he's not! I'm not saying anymore for the plot.<br><br>The deleted scenes were better than the movie, which was crap. Take my word for it. I'd rather get punched repeatedly in the face than watch this again. Ugh! A ONE out of ten for King's Ransom. I would have gone with zero, but you can only go a minimum of one. Please never watch this!","user":"TorontoLiver","rank":[8,9]},{"title":"Painful To Watch","rating":1,"date":"25 August 2005","review":"Anthony Anderson is Malcolm King, a rich and cocky businessman who tries to get out of being robbed blind by his ex-wife in a divorce settlement by planning his own kidnapping. But someone else already has gotten the same idea, and now King is caught up in a game of \"who has the millionaire?\" <br><br>King's Ransom takes a harmless premise and turns it into a torturous experience. It is one of the worst attempts at comedy and it may be the first comedy ever that has failed to make the audience laugh at least once. It was like they weren't even trying to entertain the audience. I have to ask, what was the point? There was some potential in the premise and the cast wasn't terrible. However, the script fails the film at every turn and it was probably written by a five year old. It's just too bad this film wasn't meant for kids since they would have gotten more entertainment out of it. I would also be more forgiving if this was a kid's film.<br><br>The semi decent cast is wasted in this mess and nobody gives a good performance. Anthony Anderson gives a really bad performance as Malcolm King. He overacts like crazy and just ends up being really annoying. Regina Hall over did the airhead role and it got tired fast. Sadly, she probably gave the best performance out of everyone. Jay Mohr tried way too hard to be funny and it didn't work. Donald Faison and Kellita Smith should be ashamed for agreeing to appear in this piece of crap.<br><br>I believe the blame shouldn't only go to the screenwriter but to the director as well. Jeff Byrd does a really poor job at directing and he seems to be trying too hard. He sets up all these situations of different people trying to kidnap Malcolm on the same night. There was like four different attempts and none of them were funny. Also, all the subplots are weak and none of them are good enough to save the movie. I will cut Jeff some slack since this is his first real film. However, this isn't the way you should start off. Also, he has to work with a very weak script and an obnoxious lead. I really wish I was joking here but there is not one funny moment. It's really just 95 minutes of pure boredom and there is no point in wasting your time to watch this movie. In the end, this light comedy may end up being the worst movie of 2005. Rating 1/10","user":"christian123","rank":[15,23]}]