[{"title":"Un-Bee-Lievable","rating":9,"date":"11 February 2019","review":"The \"Citizen Kane\" of bug movies. My only regret in life is that I cant see this movie for the first time again, and yet upon each re-viewing I find myself peeling back more and more of the metaphysical layers to this enthralling epic of tragedy and redemption.<br><br>Jerry Seinfeld delivers an Oscar worthy performance as Barry B. Benson, local hive schlub and opportunistic apis mellifera, he aims to please both his personal needs for love, passion and adventure, as well as his parents wishes for stability and success. The results can bee bittersweet, and downright hilarious at times, and ultimately enriches the audience with its tantalizing charm and wit.<br><br>As far as political agendas go, \"Bee Movie\" dares to not shy away from allusions of eco-fascism and the socialist working class struggle, and faces the globalist honey collecting hordes head on through judicious and peaceful means. The political influence derived, serves as a peek into a Beewellian realm, governed by a beenevolent dictator aiming to seize the rights of honey distribution worldwide, yet maintains a clear social hierarchy, both in hive and out. Fascinating audiences worldwide, \"Bee Movie\" is nothing less of a manifesto, and a warning of what to bee prepared for in a hypothetical future. As far as I'm concerned, I welcome the thousand year hive with open arms, and think we'd all bee better off sticking one to big honey.<br><br>Black and Yellow! Hello! I give this instant classic two antennas up.","user":"StGabriel97","rank":[46,49]},{"title":"Truly a masterpiece","rating":10,"date":"22 June 2019","review":"This cinematic motion picture has some of the most relatable characters such as Ken but it also has the most funny jokes as<br><br>soon as I heard the joke \"Do you like jazz\" it made me crack up and fall down on the floor laughing and laughing and laughing and laughing in conclusion Bee Movie is a true masterpiece and I know there are a lot of memes (is that what they call it) about this movie which I do not understand beacause the film is a true cinematic masterpiece and it beats the great skills of Scorsese and Tarantino.","user":"crazymaningarage","rank":[36,38]},{"title":"Great movie!","rating":10,"date":"21 January 2019","review":"Not a fan of Jerry Seinfeld, but this movie is hilarious! Watch it everytime its on!","user":"avaannie","rank":[16,17]}]