[{"title":"Back to the Days of Disney","rating":3,"date":"3 September 2004","review":"I took my granddaughter to see Benji, Off the Leash yesterday and was reminded of the fun movies I used to go see as a child. Disney, Kurt Russell, Fred MacMurray, Dean Jones and Suzanne Pleshette. While Benji gets the credit in the title, the story is really about how our lives are intertwined and the wrongness of hurting others (especially animals) for any reason. My granddaughter and I also discussed how you can't always assume to know a person until you really get to know them. For example the two \"bumbling dog catchers\" turned out to be the nice guys, showing tremendous love and compassion for \"Puppy's\" mom. <br><br>I had the op to meet Joe Camp and Benji this past summer at CBA. The sweetest dog EVER! I was given a card with her paw print, which I put in a scrapbook for my granddaughter. These are the movies our childhood should be made of...not the basic trash we see everywhere else.","user":"PenNhnd","rank":[10,10]},{"title":"Best Benji movie of all!","rating":10,"date":"8 August 2004","review":"I have seen all of the Benji movies, including this latest one at a premier showing prior to release, and loved this one the best. It instills a variety of emotions in the viewer - laughter, sadness, sympathy, and anger - but I promise you that you will walk out of the theater with a big smile on your face and in your heart. Take a tissue with you, but your tears will be happy ones. The movie also sends a strong message about puppy mills and backyard breeders. I am an animal shelter volunteer and know that there are too many people out there who are uneducated about such topics. Thank you Joe Camp for bringing Benji back to us again along with that important message to the public.","user":"doxiedi","rank":[6,6]},{"title":"*Beloved Benji... A class act... Then, now and always*","rating":10,"date":"12 April 2006","review":"Benji &amp; Joe Camp did it again! No one does animal movies like them, and I recommend all of their movies highly all the time. Joe has a way of melting Benji (and now newcomer Shaggy!) straight into our hearts... and makes sure to leave us wiser along the way. If I had any criticism of this movie at all it is that it didn't play in our area when it was out in the movie theaters. It seems that it didn't play in many areas. Therefore, we had to wait for it to come out on DVD. But, thankfully, it did finally come out, and we can now enjoy it along with the other people who were lucky (blessed!!!) enough to see it on the big screen. Thank you Joe and Benji for coming back to us. The world is better for the both of you, and we hope to see more!!!!! Benji... I loved him then... I love him now... I will love him always.","user":"Shilohbloo","rank":[4,4]}]