[{"title":"Acting Up A Storm","rating":7,"date":"20 June 2005","review":"Tom Sturridge in a lovely performance as Roger, Julia's son, puts it beautifully in a soft confrontation with his mother. \"You're playing, mother, or playing wife...\" Yes, acting as a way of life as a way of being. Tricky. Ronald Harwood can write the ins and outs of theatrical life better than any living soul - remember \"The Dresser? - This is not any way near as good or as insightful but is charming and fun. Lilli Palmer played the part back in the 60's in \"Adorable Julia\" and she was adorable indeed as is Annette Bening in a tour de force performance with regular interruptions to give plenty of space to the trade mark Bening giggle. Shaun Evans plays the young man, the object of Julia's desire, her frustrating emotional holiday and I must admit, that's the one element that should have sizzle instead of fizzle. Shaun Evans is a good actor but it doesn't have anything that would make us understand the folly attraction that awakes in Julia. He plays an American but appears bland, as bland as a British actor can be when he's bland. I longed for a Billy Crudup or someone younger, a Brad Renfro. Can you imagine what the movie would have been like with a Heath Ledger in that part? Unless, of course, the whole thing was intentional to underline Julia's absurdity. An actress on the verge of a nervous break down. Comparasions with \"All About Eve\" are ridiculous. That would be like comparing \"One Flew Over The Cookoo's Nest\" with \"The Couch Trip\"","user":"terrygiu2000","rank":[62,80]},{"title":"A One Woman Show, if not a one woman actor's workshop.","rating":6,"date":"26 December 2004","review":"I approached this film strictly by way of word of mouth. Reviews and blurbs went over my head. I haven't read Maughm (sp?) in years and forgot what I may have read. I went into the theater with a clean slate. Ms.Benning displays an awesome range of technique, but that doesn't describe her or the film. She was able to draw me within her to sense her triumphs and doubts, and challenges, all of which appeared and felt quite real to me.<br><br>In the hands of others this picture might easily have fallen into soap, surely with its \"come-upance\" finale, all quite expected and predictable, I thought. Still, having said that I was totally absorbed by Ms Benning and her surrounding players all of whom added to the vitality of her performance without negating or diluting their own. I am not an actor yet I felt I understood the lessons she was displaying and the courage to so open herself in such a revealing way.<br><br>She is the film, with respect to the director and writer, and the film is her, not a great film, but one worth while seeing on its own, but more so for the opportunity of truly witnessing great craft and talent.","user":"mooseman01","rank":[36,47]},{"title":"Julia, Julia, Julia","rating":8,"date":"18 October 2004","review":"You don't have to be a fan of Annette Bening (or Jeremy Irons) to enjoy this high-spirited tale of theatrical life - or rather, Julia Lambert's life, to be specific. <br><br>Based on a novella by my one of my all-time favorite authors, W. Somerset Maugham, Being Julia is sort of like All About Eve, except not as stage-y. It's a period piece, taking place in England in the '30s, where burnt-out Diva Extraordinaire Julia Lambert is moaning and groaning about her tedious, boring life to anyone who will listen, including her weathered and weary husband (Irons, drolly pipe-puffing his way through the film as only he could). She meets a young, handsome, American fan/opportunist (Shaun Evans, highly effective) and together they rekindle Julia's lust for life.<br><br>This is just the first half hour - it gets better and more and more outrageous (and of course more FUN) as it goes on. Needless to say, you won't be bored; in fact, you might very well leave the theater smiling and shaking your head, as I did.","user":"Rogue-32","rank":[89,126]}]