[{"title":"Good fun if you're in the right mood!","rating":7,"date":"19 September 2006","review":"Dead or Alive is a film that is so exploitative and atrociously bad, that somehow it ended up being a whole lot of fun. However to view this as a fun film, it must be viewed as intended: With brain switched off, and ol' Mr McDong taking control of your functions for 80 minutes. Yes, this may be a film with a predominantly female cast, but ladies need not turn up to watch this, cause they probably won't enjoy it, unless their sexual barometer is registering the opposite end from \"hetero.\" This film is total gratuity in every regard, from the scantily clad, sexy ladies, to the barrage of testosterone pumping action. This is hot chicks doing high kicks! So with that, and having this the pre-conceived idea when I bought my ticket, I knew I'd enjoy it. Hell the film was marketed right. It's about a video game and has the subtlety of said game, which is in the button bashing, short attention span of the games spectrum. It's a simple movie for a simple movie going experience. IF anyone goes into this film and comes out having not enjoyed it, then they SHOULD have known better! I think only those who want to see this kind of film, who are in the mood, will watch, and they'll get a kick out of it like me. Critics will despise it cause it represents a film they have to watch, but probably don't want to.<br><br>So DOA is essentially a non-interactive video game, an FMV if you will. It's got an awful script, mediocre acting, and all the efforts of the filmmakers have gone into perfectly capturing, glistening, bouncing boobies amongst the martial arts mayhem. The plot essentially is nothing more than little set-ups to all the fights, taking place at a secret fighting tournament set up by Eric Roberts, in grade-A scenery chewing mode. Roberts to me is a tragic waste of talent, who in the early 80's looked a great prospect and to some, me included, has more talent than his over-rated sister Julia (who now of course takes all the plaudits). Roberts is consigned to doing DTV movies now, or TV movies and on the rare occasion he appears back in the multiplexes, it's in another B-movie that usually is awful. However at least Eric is enjoying himself here, relishing his return (somewhat) to the limelight. or to put it another way, to remind people Julia wasn't an only child! The rest of the main cast, who register any interest, are the hot ladies. There's the rather bizarre, yet strikingly attractive looking Devon Aoki and then there's also Holly Valance, Sarah Carter and Natassia Malthe too. However it's Jaime Pressley who steals the show, not only with her performance, that delivers the most laughs (intentional ones that is), but also she has a bod to die for and considering some stiff competition from Valances sculpted physique in particular, that's no mean feat.<br><br>Overall though this film will go down as a classic bad movie. The filmmakers never intended making anything beyond what they deliver. This is bad, it's cheesy and it's forgettable. But it's outrageously fun while it lasts and it most certainly requires the wearing of loose fitting underwear to allow for Sgt Schlong to stand to attention every now and again. I feel guilty having enjoyed it, but I had a good idea of the film that would be delivered and it was delivered as I imagined. ***","user":"supertom-3","rank":[192,244]},{"title":"Tongue in cheek action film is action packed and very silly and perfect for those who want mindless action with just enough plot so as not to be totally mindless","rating":8,"date":"7 July 2007","review":"Corey Yeun's mindless video game movie is just what the doctor ordered for those days when you've lost your brain and can't find it. This is high class trash cinema that should be high on your popcorn list.<br><br>The plot of the movie has a group of the world's best fighters all being chosen to go to an island for the DOA contest where they will compete for a 10 million dollar prize. The main characters are women so we get to see lots of beautiful woman fighting and frolicking on a tropical island. The contest is a cover for Eric Roberts to use his computers to take all of their fighting information so he can be the worlds best fighter thanks to a program which he intends to sell to the highest bidder(or something similar).<br><br>So un-serious from the get go its a wonder that people dislike the film for being silly. The trailer and most of the promotional material let you know going in this is a silly western martial arts movie with its tongue through its cheek and lots of unreal wire work. The action riffs on every martial arts film you've seen and does so in such an inoffensive way that you just go along with it. This is form and substance over meaning and its all a great deal of fun. Its silly in the right sort of smile producing way. If you go in expecting mindless (really mindless-but intentionally so) entertainment you'll enjoy yourself a great deal.<br><br>I really liked the film. If I have any misgivings its that the film loses focus in the final half hour as plot lines are dropped or hurried through. At some point the film gives up real plot for action leaving only a sketch of where its going. Thats fine since by then the film is just nonstop action of the highest (well not highest, most entertaining) order. this is one of those films destined to become a guilty pleasure once it hits cable, you know the ones where you stop every time its on and watch it to the end.<br><br>You will want to rent this at some point since its a blast.<br><br>(The Chinese DVD I saw had about 9 minutes of deleted scenes. You'll want to see them. Some were rightly removed but a few others really should have stayed in.)","user":"dbborroughs","rank":[16,18]},{"title":"An entertaining action flick - especially for blokes","rating":8,"date":"28 December 2007","review":"Some great fight sequences - many of which took more than a week to film. Excellent stunts. Gorgeous costumes and scenery. A Cock rock soundtrack. What is not to love about DOA? Based on the popular Dead Or Alive video game series (last seen as DOA 4 on the XBox 360) this movie is a lot better than the previous attempts like Street Fighter. Many of the on screen stars resemble their in-game persona's in an uncannily realistic way too.<br><br>The girls are all gorgeous yet could really kick your butt. The strenuous training they need to \"seem real\" never seems to show too much. The beach volleyball scene is an added bonus for fans of the series. No wobbly boobs from what I could tell although they were always exaggerated were they not? Great Saturday arvo entertainment for blokes - but girls check it out as you can really kick arse with the best of them.","user":"Darth_Guybrush","rank":[15,17]}]