[{"title":"Creepier than having someone stare at you in a bathroom stall!","rating":21,"date":"21 October 2004","review":"According to The Grudge, there's a Japanese belief that when someone dies in a powerful grip of rage, then a curse is left behind. It's a \"stain\" that forever becomes a part of the place where the death occurred, and it will kill everything it touches. All I can say is if that were true then the movie-going public better hope I never die in a theater. The audience at this movie was probably the most obnoxious crowd I've ever had the displeasure of watching a movie with. Talk about being in a powerful grip of rage. More on that later.<br><br>Jump scenes rule the day here. That's right, this baby is stocked with jump scenes! If you're having a hard time deciphering my complicated terminology, then let me explain that a \"jump scene\" is one in which something startling happens to catch you off guard and makes you jump in your seat. Some people think jump scenes are cheap ploys to get a scare from the audience, but they're really well done in this movie. And they're manufactured frequently and shrewdly enough to keep you in a constant state of unease.<br><br>Unfortunately, when most moviegoers get scared they like to scream and then laugh and talk about it for 2 minutes afterwards. If you're gonna scream then scream. But then SHUT UP and WATCH THE MOVIE! This ain't a comedy and it certainly isn't a coffeehouse, so quit killin' my atmosphere.<br><br>Some of you might be a little agitated to know that The Grudge does follow some clichéd horror movie conventions, such as a character investigating a creepy noise in a dark attic with only a cigarette lighter to illuminate the way. And of course, one character has to slowly follow a strange figure that shouldn't be there in the first place. But it's forgivable. Keep in mind, characters aren't necessarily supposed to know they're in a horror movie. I'm sure we've all explored strange noises before, except rather than a horrific, disfigured ghost producing the noise, in real life the sound is usually coming from Uncle Larry's bathroom excursion. Never underestimate the horror of a night out at the Taco Bell.<br><br>Comparisons to The Ring are inevitable, so I'll just say that I personally feel The Grudge is the creepier of the two. This is a movie that's heavy on atmosphere and freaky imagery. The Japanese ghosts creeped me out even more than the time I caught some pervert staring at me in the men's bathroom stall back in my college days. Lucky for him, he took off before I had a chance to demonstrate what happens when a person is caught in a powerful grip of rage.<br><br>But The Ring has the better story and a much better ending. The Grudge does a great job of keeping you guessing. You never really know where it's going, and since the story isn't linear you really have to pay attention. I know a lot of you have the attention span of a goldfish (about 9 seconds, you just learned something today, thank me later), so this may be problematic. I think it works fairly well, but one of my complaints is that near the end everything is wrapped up and explained rather quickly.<br><br>As a result, I wish the movie had been longer. A longer running time could've produced more in-depth character development, a more clever way to explain what was going on, and maybe even a better ending. And there's my biggest complaint. Why do so many horror movies feel the need to use the I Know What You Did Last Summer-esque \"look, there's gonna be a sequel\" ending? Come on, how about some closure? It's similar to if you're waiting for me to close out my review in a witty and funny fashion, but instead, for some reason I just decide to end the review in mid sent...<br><br>THE GIST<br><br>If you're looking for some Halloween entertainment, then The Grudge will give you some good jumps and surround you with creepy imagery. But I strongly recommend that you see it at a time when there won't be a big crowd because I know I would've enjoyed the movie a lot more had I not been surrounded by a lot of stand-up comedians who felt the need to crack jokes at the most tense and inopportune times. Folks, this is a horror movie. Tension and atmosphere are a big part of it, so please keep your laughing and talking to a minimum. I look forward to watching the DVD in peace and quiet one day where the only idiots I'll possibly be surrounded by will be friends and family. <br><br>Rating: 3.75 (out of 5)","user":"TheMovieMark","rank":[276,410]},{"title":"I was pleasantly shocked","rating":10,"date":"24 October 2004","review":"I went to this movie expecting an artsy scary film. What I got was scare after scare. It's a horror film at it's core. It's not dull like other horror films where a haunted house just has ghosts and gore. This film doesn't even show you the majority of the deaths it shows the fear of the characters. I think one of the best things about the concept where it's not just the house thats haunted its whoever goes into the house. They become haunted no matter where they are. Office buildings, police stations, hotel rooms... etc. After reading some of the external reviews I am really surprised that critics didn't like this film. I am going to see it again this week and am excited about it.<br><br>I gave this film 10 stars because it did what a horror film should. It scared the s**t out of me.","user":"merrittjr","rank":[176,263]},{"title":"Just as good as the Japanese films (but with an ending rant against remakes of foreign films)","rating":9,"date":"4 February 2005","review":"Karen (Sarah Michelle Gellar), an exchange student in Japan who is just beginning to do some social work, is sent to aid an elderly semi-catatonic woman, Emma (Grace Zabriskie), after her previous caretaker, Yoko (Yoko Maki), disappears. Karen soon learns that something is not right in Emma's home, and she attempts to \"see how deep the rabbit hole goes\".<br><br>Maybe it's a delayed influence from the success of M. Night Shyamalan's films, but slower-paced, understated horror films are a recent trend. In some cases, such as Hide and Seek (2005), the approach works remarkably well, and in others, such as White Noise (2005), the pacing tends to kill the film. I didn't like The Grudge quite as much as Hide and Seek, but this is still a very good film--it earns a 9 out of 10 from me.<br><br>The Grudge has a couple significant differences from other recent examples of that trend, however. One, it is well known that this is a remake based on the Japanese film series that began with Ju-On (2000) (in particular, it's extremely close to the first half of Ju-On: The Grudge, aka Ju-On 3, from 2003). Two, as with many Japanese horror films, the slower pacing here isn't so much in the realm of realist drama as with surrealism. As is also the case with a large percentage of European horror, The Grudge should be looked at more as a filmed nightmare.<br><br>Director Takashi Shimizu, also the director of the five Japanese entries in the Ju-On series to date (the fifth is currently in production), and writer Stephen Susco have largely dispensed with linearity and are not overly concerned with logic or plot holes when it comes to the horror behind the story. The idea instead is to present a dreamlike sequence of scenes, with dream logic, where the focus is atmosphere, creepiness, the uncanny, and for many viewers--scares. How well the film works for you will largely depend on how well you can adapt yourself to, or are used to, this different approach to film-making (although admittedly, some of the seeming gaps are filled in by previous entries in the Ju-On series). Traditionally, American audiences consider as flaws leaving plot threads hanging and abandoning \"rules\" for the \"monster\". A more poetic, metaphorical, surreal approach to film isn't yet accepted by the mainstream in the U.S.<br><br>However, even if you're not used to it, it's worth trying to suspend your normal preconceptions about films and give The Grudge a shot. This is a well written, well directed, well acted film, filled with unusual properties, such as the story interweaving a large number of \"main characters\" (which is done better here than the more episodic Ju-On 3), good cinematography, subtle production design touches (check out Gellar's clothes, which match the color and texture of the exterior of Emma's house, when Gellar first approaches), and beautifully effective horror material.<br><br>Even though it is more slowly paced that your average horror film of the past, the pacing usually enhances the eeriness, and there is no shortage of bizarre events to keep horror fans entertained. The supernatural premise of the film is absorbing, and based on interviews on the DVD with Shimizu, have prodded me to pay more attention to Japanese beliefs and folklore. Although the most interesting subtexts would probably arise with a more intimate knowledge of Japanese culture, it's interesting to ponder why so many Japanese horror films feature scary children and adults who look like scary children.<br><br>I subtracted one point for the film slightly veering into clichéd mystery/thriller territory with a \"here's what really happened\" flashback, but even that was fairly well done, and otherwise, this would have been a 10 out of 10.<br><br>Now that I've said all of the above, let me finish with a mini-rant: It's not that I'm anti-remake, but it is ridiculous that U.S. distributors and studios feel that we need remakes of foreign films to make them appropriate for consumption. The original versions of these films should just be playing in U.S. theaters in wide release. There is no need to present an almost identical film but just substituting white American actors for non-white or foreign actors. Yes, The Grudge is a fine film, but ultimately, I'd rather see something original using this talent, and be treated to the latest foreign horror films--not just Japanese, but also Indian, Spanish, Chinese, etc.--at my multiplex. In the hope that someone with some pull at the studios reads this, it is also more cost-effective to do this, as (1) you can completely avoid production costs, and simply make domestic distribution deals from which you receive profit, and (2) you can make money off of fans like myself who otherwise pick up the foreign film DVDs in foreign manufactured or even bootleg versions.","user":"BrandtSponseller","rank":[118,176]}]