[{"title":"The Better Half","rating":8,"date":"24 September 2004","review":"It's a matter of some debate which volume of Quentin Tarantino's \"Kill Bill\" is better. Let's end the argument right now: David Carradine doesn't even appear in \"Volume 1.\" Hasn't the Academy mailed him his Best Supporting Actor Oscar already?<br><br>In the first volume of \"Kill Bill,\" released only a few months before \"Vol. 2\" in the tail end of 2003, we met Uma Thurman, one peeded-off super-assassin taking out some folks from her past one at a time, with the occasional mega-posse thrown in for interest. \"Vol. 1\" had a lot of blood, violence, and wisecracks, and galloped across the screen like a rap video on steroids.<br><br>\"Vol. 2\" is way different. It makes sense it's a separate movie; the tone is such a departure from \"Vol. 1\" in two ways. One is style. Director Tarantino has fun stylistically quoting Sergio Leone and chop-fu cheapos from the late 1960s and early 1970s. Cinematic sampling is something he's good at and enjoys, but in \"Vol. 2\" he doesn't go as overboard as he does in \"Vol. 1.\" He pulls back and lets the plot breathe, rather than filling every spare second with a homage-cum-parody that maybe a dozen lucky fans will get. Maybe some here wish he'd pile it on a bit more, but they have to make do with the goofy Pei Mai sequence, which is a flashback and hence not jarring in its \"Vol. 1\"-style comic-book treatment. Throughout \"Vol. 2\" the emphasis is on storytelling and character-building, which is where it should be given we are now being asked to deepen our commitment of interest to these people. \"Vol. 1\" is okay for what it is, but its flash and action are no match for the depth and nuance of \"Vol. 2.\"<br><br>This gets to the second different tonal difference between the films, which is emotional. It all comes back to the characters. They don't quite become real people here, but they get close enough to get under your skin. Admittedly, the opening part of \"Vol. 2\" tests the viewer's patience a bit, there's some long bits that show the director hasn't really mastered self-discipline, like with Thurman's graveyard struggle, but the meandering usually has a purpose. Tarantino is building toward something here that has its payoff when Thurman's character finally has her face-to-face showdown with Carradine's Bill.<br><br>From that moment forward to the end, this is the best Tarantino has ever been.<br><br>Carradine and Thurman dominate the proceedings with two of the finest performances I've seen, certainly the best Tarantino has directed, playing off the mythology we've been taught in \"Vol. 1\" and developing resonances with the viewer both together and apart which will surprise those expecting a casual butt-kicking affair. We finally find out what Carradine means in the first line of \"Vol. 1\" where he tells a whimpering victim he is being masochistic, not sadistic, and its a powerful revelation, that this sinister baddie may have a heart buried under that cold exterior. Carradine is perfect in his phrasing, his pauses, the tired glint in his eye, or the way he says \"Kiddo.\" You can't ask for a better veteran performance. For her part, Thurman presents a brilliantly conflicted character who can not stop either hating or loving Bill, and brings us not into a world of cartoon anguish, but real human pain.<br><br>\"Kill Bill Vol. 2\" is slow-moving, and needs \"Vol. 1\" in a way few sequels do, since it assumes you know nearly all the characters coming in. That's a weakness. So are some undeniably pointless bits, including the entire sequence with Bill's father figure, Esteban Vihaio, and some business at a bar involving Michael Madsen, who plays a former assassin now gone to seed.<br><br>Madsen's good, though, and so's Daryl Hannah as another rather mouthy assassin, Gordon Liu as Pei Mei, and especially Perla Haney-Jardine as a girl named B.B. The nice thing with Tarantino is for every scene that strikes a bum note, there's four or five that hit the right mark, and some manage to do much more. My favorite scene involves a Mexican standoff in an L.A. hotel room between Thurman's character and an anonymous hitwoman, at once grippingly suspenseful, hilarious, and life-affirming. Still, it's the final moments of this film that will stay with you, as Bill and his former pupil work out their \"unfinished business\" and we are left to ponder the results of their decisions and actions.<br><br>\"Kill Bill Vol. 2\" may not reach the heights of cinema to which it aspires, the level of \"The Good, The Bad, And The Ugly\" quoted in its score, but it's a fine film that will make most viewers glad they stuck around for the second installment. I am.","user":"slokes","rank":[258,367]},{"title":"Glad to see the split.","rating":20,"date":"20 January 2005","review":"When I first heard that this film was going to be split into two movies instead of being presented as one as originally planned, I was angry. I accused the powers that be of trying to squeeze two box office triumphs out of a single project. But after having seen both 'Kill Bill' and 'Kill Bill Vol.2', I am glad because both films are extremely different even though the stories are tied together with primarily the same actors and having the same director. Containing less action than 'Kill Bill', volume 2 is intelligent, bizarre and extremely engrossing. It absorbs all of its elements equally and David Carradine's performance as Bill is the best thing to happen in movie villain history since, well, I'll leave that up to individual interpretation.","user":"WalterFrith","rank":[132,191]},{"title":"A Tarantino Masterpiece","rating":10,"date":"5 July 2006","review":"Over the last 40 years, I've seen a lot of movies. All types. Some great, some good and some mostly inedible; most left my breath with a sour smell. Westerns, sci-fi, comedies, dramas, etc. After seeing Kill Bill Vol I, I assumed that any sequel would pale to its predecessor. I, of course, was premature in my prediction. The movie was, by all means, a classic. I feel Taratino was really trying to make a great movie versus making money for his producers. To build his tasty sandwich, he took the lessons he learned from life as a movie maker and cleverly managed to meld some slices of meat from Sergio Leone (subtly), Akira Kurosawa (very subtly) and, I'm stretching it here, Ridley Scott, to create a great sequel to an excellent first movie. He used some great, almost forgotten actors (Daryl Hannah, Micheal Parks, and David Carradine to create a memorable meal. It was only a sandwich, but what morsel it was. I was full and wanting more. Very rare to find this type of film in our corporate world. He must wield some real power in the movie world. I don't know of anyone who has saw this movie who hasn't given it great feedback. And I know all types of viewers. My wife, who really doesn't like anything that is not overly melancholy or dripping with sentimentality, actually liked the whole movie. That in itself is an endorsement. Well done. Mr. Tarantino, you will be hard placed to match this gem.","user":"abacus24","rank":[144,222]}]