[{"title":"Watch \"Firefly\" first to really appreciate it!","rating":8,"date":"21 July 2006","review":"My husband and I first saw this movie after just reading these excellent reviews and not knowing anything else about the movie or characters. We are both sci-fi fans.<br><br>I must say, we were a little puzzled about the great reviews. We thought the one-liners were kind of cheesy, the acting a bit poor, and we weren't at all impressed (except for maybe the fight scenes with River). The cowboy theme music didn't sit well with us either.<br><br>However, I have heard only excellent things about the series Firefly and the following movie Serenity. Were we missing something? We even watched Serenity again giving it a second chance. It still didn't click with us. I was very confused.<br><br>We were going to give up when a friend loaned us the Firefly DVDs. OK, I'll give it another shot since clearly we *must* be missing something! And that did it.<br><br>After just a couple episodes I was really enjoying myself. When I re-watched Serenity again after seeing the TV series, I thought it was excellent. I really appreciated it. The characters were more 3D, the one-liners were amusing, the music didn't bother me a bit (I was starting to like it), and I really liked all the nuances from the actors (I changed my mind - not bad acting). I felt like I knew the characters and story so much better and I really loved how they tied some loose ends together. It was also nice to see the characters again after the series ended (even on DVD).<br><br>So bottom line - if you didn't watch Firefly, you probably won't get it, may not like it very much, and you might be confused why there are such great reviews. If you did watch Firefly first (and liked it), you'll love Serenity and you'll have a great ride!","user":"kari_d","rank":[72,86]},{"title":"Extraordinary","rating":10,"date":"17 August 2005","review":"The others do a good job gushing about the movie. Sure we're fans and bound to like the movie more than the usual fare, but those looking for an original and thrilling movie experience, this will shock and amaze. The Firefly world introduced a fantasy home for many of us, with characters we truly cared about and dilemmas we could get behind. The best way to describe it is to take the best aspects of the Han Solo elements of the original Star Wars, and build a world around that. There's no grand theme or clear cut good and evil. There's just a band of fugitives trying to make their way in a dangerous sky. It's something folks can relate to, although most of us won't be in a space battle or fighting psychotic creatures anytime soon. The point of the name Serenity is the name of the ship, though in a deeper sense that's what our characters are in search of. Finding freedom and a home, and that's what the ship represents to them, and to the fans. So you understand why so many are so excited about this dinky little scifi flick. <br><br>The movie captures that beautiful feeling but takes us on a ride that there's no turning back from. In my opinion, the one thing that makes for a truly GREAT movie is if you walk out of the theater a different person than when you walked in. This movie takes you on such a journey I didn't know if I would leave the theater at all. Sure the visual effects are stunning, but even the unfinished effects I saw meant nothing to me because it was the characters I cared about (and note that the digitally created ship itself is one of them, and I cared just as much for that than any of them). The humor is probably better than anything in the theaters this year, and the action is even greater. My screening actually came a week after Episode 3 was released, and I immediately washed my hands of Mr Lucas, and months later when I saw Fantastic 4... well let's not even talk about that one.<br><br>This movie really does have something for everyone, and even in the core of the geek fandom, the range of people is total - men and women split it at least 50/50, uber-geeks and \"cool\" types, and a surprising amount of attractive people of all ages. Seriously though, don't trust the rants of the fans. Check out the movie for yourself. Give it an honest chance and I promise you will be taken on a journey that will turn you into a fan as well.","user":"manosdvd","rank":[1,1]},{"title":"Intense","rating":10,"date":"21 August 2005","review":"From start to finish there are no wasted moments. All your emotions will be engaged. You'll laugh, you'll cry, you'll gasp in shock. What you won't be is bored. Don't plan on being able to take a bathroom break or get more soda and popcorn. You won't want to miss a second of this one.<br><br>There's plenty here for everybody: Good writing, humor, excellent acting, plot, action (that actually makes sense in terms of the plot), excellent cgi, eye candy. And it's a movie that needs the big screen for the full effect. Watch it in theater; don't just wait for the DVD.<br><br>If you saw Star Wars (the original) in the theater way back when, then this movie will evoke a similar feeling of awe. Once you see this movie, your perceptions of the movie-going experience will be changed. No other movie I've ever seen has hit me with the intensity of this one.","user":"jmoffitt","rank":[1,1]}]