[{"title":"Clichéd, illogical, unscientific but the first hour really delivers even if the second hour is like the 1970's never happened","rating":31,"date":"31 May 2004","review":"After years of warning about global warning, Jack Hall is horrified to find all his predictions coming true much faster than he could have imagined. Hail stones the size of footballs decimate cities, typhoons destroy Los Angeles and New York becomes flooded. As the big freeze crosses the northern hemisphere, a small group of survivors try to fend off the cold as the world prepares for a dramatic change in the world order.<br><br>This film may be a modern blockbuster but in almost everyway it is a 1970's disaster movie where an event happens after some build up and we then spend the rest of the film watching the survivors trying to, well, survive. In that regard the film carries all the usual problems that the genre carries but happily benefits from the fact that the effects are much better than 1970's movies could manage. For this reason the first hour is great  it has dramatic pace, is involving and looks fantastic even if we have seen it before in different variations (how many times has New York been destroyed now?). However after the sheer global terror is pretty much finished we suddenly become much more small scale and the film looses much of it's impact and it's pace. After the initial danger has passed the film uses illogical and silly plot devices to put the survivors at risk  a cold eye of a storm, blood infections, creeping ice and wolves are among the problems. While this is OK on a genre level it doesn't compare to the first hour and it gets a little dull and plodding at times.<br><br>The clichés are all present and correct: the politicians, the upright scientists, the sacrifice, the daring rescues and so on. It's fair to say that if you are looking for more than a basic script then you will be looking in the wrong place here. All this film does is to provide spectacle and moments of dramatic action  if you want to think about it then you will only hurt your enjoyment of the action. The film tries to deliver an environmental message but in a way this film will not help the environmental movement because it is too exaggerated to be taken seriously (like the idea of Celtic and Man Utd reaching the Champions League final  during this season? Please!), however it does include several surprisingly barbed attacks on the US administration (could the VP look any more like Cheney?). Just a shame that the film message is delivered with all the subtlety that Segal showed when he did something similar in his environmental action film On Deadly Ground.<br><br>The script doesn't really create characters either and it means we don't care that much about what happens to them in the final hour (countless millions are dead for goodness sake!). The dialogue in the first hour is nicely gruff and scientific and very genre but the second hour is more human and the lines aren't suited for that  not even in the hands of an impressive number of good actors. I like Quaid and he is a good lead here, he gets the good scientific stuff and only is lumbered with the rather silly notion of walking to New York from Washington. Gyllenhaal must have upset legions of cult fan boys by appearing in a big budget movie but he does OK with the role (despite looking too old to be in school). The rest of the cast are fairly mixed but, as with the genre, they are just filled even if some are good. Welsh is good even if he was cast for his similarity to Dick Cheney, Holm adds a small bit of dignity in his role as well as being supported by the very fine actor Lester in a minor role. Faces like Sanders, Mihok and a few others don't really matter as they are merely victims waiting for their turn to be used for dramatic effect.<br><br>Overall the first hour of this film is good on a blockbuster level, but it blows it's wad too early (don't ya hate it when that happens?!) and is left with a second hour that is right out of the 1970's with all the weaknesses that that entails. Generally I enjoyed the film because I was just expecting a big noisy movie to pass a few hours  bad script, no characters and lots of clichés? Why would I be surprised by that? It's par for the course and you should not watch this if you know these aspects will annoy you. As it is, it's an average film but one that is noisy and spectacular enough to pass muster in the summer blockbuster stakes.","user":"bob the moo","rank":[288,419]},{"title":"ALL TIME FAVE DISASTER MOVIE.","rating":9,"date":"30 March 2019","review":"I don't get it why this film just got 6.4, maann the visual effect alone was amazing. The tension is so high especially the new york scene. Maybe the science isnt accurate but I found this film is very entertaining. I watched this when I was 9 or 10 yo, now I'm 24 and this film still my fave disaster movie. The tsunami, tornado etc was perfect. Good job for the writers, director, producer especially the cast.","user":"andrewchristianjr","rank":[19,23]},{"title":"Come on people.","rating":8,"date":"18 November 2019","review":"How many times do I need to read other's reviews on disaster films before I remember most people on here writing these think they are actual film critics? It is a disaster movie. Yes, the science is terrible. Yes the coincidences are fantastical. If you watch these for ground breaking stories with rich plots, or for an Oscar worthy performance by one of the actors, then you are watching these for the wrong damn reasons.\nThis movie shows a future where due to the rise in global temperatures, a modern ice age is triggered. How it is ushered in is by these violent, giant hurricane-like storms that cause flash freezing, and bring in a myriad of disasters with them. These include tsunamis and blizzards that drop so many feet of snow that people are walking level with the signs on the interstate that you would normally drive under. It also tries to throw in a lot of relatable human elements, such as the struggle of a man that is an absentee parent because of his job, trying to connect with his son, a lonely boy dying of cancer, and just the human death that this kind of disaster would bring.\nDo not watch this for the science, though I do feel that they had the causation of another ice age correct. Do not watch this for deep plot. Watch this for the enjoyable ride on which it takes you.","user":"acedj","rank":[13,15]}]