[{"title":"Decline, and maybe even fall, of the Garfield empire","rating":7,"date":"13 June 2004","review":"After engaging in an effort to find a good review - much harder than I ever imagined it would be - and finding the movie listed at the bottom of the barrel, I felt almost an obligation to go see this on opening day - either to prove the critics wrong, or to get fodder for a scathing letter to Jim Davis. I ended up with neither.<br><br>The problem, admittedly, is what some critics have said: Garfield is old and busted. A walk in the theater revealed the new hotness: Harry Potter. The movie is, sadly, 10 years overdue. Just look at the long listing of Garfield TV specials, most of which are 1982-1992, and \"Garfield and Friends\" began in 1988. It was delayed, I read, because Jim Davis believed the technology wasn't there. It was; it's called regular animation. Garfield is a 2-D medium, either on the comics page or on animated cels. But, I guess, since no one does that anymore, 2004 couldn't have a 2-D Garfield.<br><br>The problem is not necessarily with the CGI Garfield and his actions, although some of the characteristics displayed are not those I associate with the cat. The problem is with the supporting cast who look, by and large, not like their animated counterparts. Who made Odie a wiener dog with talent? Why is Nermal Siamese and not the \"world's cutest kitty-cat\"? Shouldn't Arlene be a lot nicer to Garfield? (By the way, since Odie has no speaking lines in either the strip or show, the movie's similar lack is accurate.)<br><br>The set design, in bright hues, can't decide whether it's in the real world or in a real-life comic strip. Breckin Meyer (\"Inside Schwartz\") is just not the right fit for Jon. He's too likable to be our comic-strip loser. While I can accept the whole high-school-crush of Jon and Liz on each other (something definitely not in the comic strip), the payoff would have been better had the tension not vanished prematurely.<br><br>The plot arc is not necessarily departed from all of Garfield. It fits more in the mid-1980s, when the strip actually did have week-plus-long plots. In one series, for example, Odie DID leave home, and Garfield DID follow him, and they ended up running away from the circus together. Those citing ripoffs from \"Toy Story\" and other similar movies should note the 1982 TV special \"Here Comes Garfield\" shares many elements of both movies and so this movie doesn't take from Pixar, but rather from itself 20 years ago.<br><br>The comments that the strip has declined are not off-base. It's times like this that remind me where I got my sense of humor. It came from the politically neutral wit and social commentary of the late 1980s - Garfield (both newspaper and television), Calvin and Hobbes, even the Teenage Mutant Ninja Turtles. That's why I can't disagree with this line from the Chicago Tribune: \"He's been declawed; the swiping humor and Monty Python meanness of his early years have been surgically removed for a PG audience, and with it, most of his appeal.\" And that hurts.<br><br>Today, Garfield is trapped in a one-day-only three-panel set of running gags that still make me laugh, but don't capture the same attitude of years past. However, I still prefer it to the overtly political commentary that you see today, found in strips like \"Boondocks\" and others. The Garfield calendar on my desk still gives me laughs.<br><br>As for the product placements, yes, they were a bit much, but at least part of the time they were well integrated. To those smacking the \"dated\" references, it was a relief compared to \"Shrek 2\" to see them come naturally instead of chock-full and fast-pitched.<br><br>Had a full-length movie been released around 1994, done by the same animation team that did \"Garfield and Friends,\" with Lorenzo Music doing the voice, it might have been wonderful. Live action does not suit the characters; the departure from 25 years of what we have known is too much. The animated half-hour shows of the 1980s work so much better that they might have been able to make more money simply by scrapping the film and putting out DVDs. I hear \"Garfield and Friends\" is going to be out on DVD, a TV show that captured the essence of the strip at its peak so much better than this movie did. Those that liked the show should buy that, and only rent this movie.<br><br>I wish that the networks would put \"A Garfield Christmas\" and some of his other specials back on the air; it would build more interest in him. I still love the character. The movie doesn't deserve to be ranked as low as it is by the critics. At the same time, though, it reminds you of how good it might have been. As Garfield has attempted to extend its \"brand\" by licensing to Cub Scouts and 4-H, you can't help but think it's grasping for an audience that never became fans like the previous generation did.<br><br>6/10, because I can't bring myself to demolish a character that still makes me laugh, even if his best work was from when I was young enough to be in the target audience. And even that rating is being nice compared to those who want this cat and its empire put to sleep.","user":"Jeff M.-3","rank":[53,69]},{"title":"Cute, lovable and funny","rating":10,"date":"2 June 2005","review":"The comic strips comes to live in better ways than I could have hoped for.<br><br>There are plenty of cute and lovable characters.<br><br>Jon was not as boring as he was in the original cartoon series.<br><br>Liz isn't as ugly and I can see why Jon would want to date her.<br><br>Though in the case of Liz it's probably a good thing, there aren't that many characters that look like they did in the comic strip.<br><br>The story was good, and I really liked the pictures you see of Garfield as a kitten at the start.<br><br>Also the love/ hate relationship between Garfield and Odie.<br><br>Not to mention I'm craving Lasanagne right now.<br><br>If you love the comic strip you'll love this.<br><br>Oh and Garfield also looks realistic.<br><br>10/10","user":"robhigg2203","rank":[10,11]},{"title":"Not so bad, but....","rating":5,"date":"22 July 2006","review":"As a huge fan of the laziest cat on Earth, I confess that I was really expecting too much of this movie, but when I watched it, I got a bit disappointed... \"Garfield\" is not a bad movie at all, but is far away than all the fans expected, for some reasons in particular:<br><br>First of all, this movie is basically for children. Anyone who read the original Garfield's comic books knows that his sarcastic humor is for all ages, not just for kids. <br><br>The second problem in my opinion maybe can divide some opinions, but let's go: Garfield is lazy, as we all know, but this is an action movie...and nothing is more anti-Garfield than action! I think that a comedy of situations based on all Garfield's countless books could be more interesting, his loyal legion of admires will certainly agree with my point of view. <br><br>But, after all, if you just want some fun for a while, this movie will entertain you. Bill Murray is great doing Garfield's voice, very faithful to his shameless and ironic personality. The rest of the cast is OK; a bit affected sometimes, specially Breckin Meyer (Jon Arbuckle), he looks a lot like the cartoon version of Garfield's owner, but I really think that he is exaggerated, always trying to look goofier and goofier... Well, whatever, I think that I must getting older and complaining about things that are not so serious. Kids will love \"Garfield\" and adults with child's heart will like it as well...at least, if you're not so hard to please as I am...","user":"luciano_cirne","rank":[5,5]}]