[{"title":"Harmless and Enjoyable","rating":5,"date":"13 July 2005","review":"The Lizzie McGuire Movie is a nice film to watch if you have nothing better to do as its harmless entertainment. Lizzie McGuire and her pals Gordo, Kate and Ethan all pack their bags on a class trip to Italy. Once there, Lizzie is mistaken for pop star Isabella and begins to falls for Paolo, who is Isabella's ex-boyfriend. When Lizzie's mom, dad and brother Matt get wind of this, they all jet their way to Italy. While, Lizzie is transformed from a normal teen to a beautiful pop star. The plot follows the last episode of Lizzie McGuire and this film is pretty much just another episode. I do watch the TV series sometimes and its not a great show but it isn't terrible either. Hilary Duff stars as Lizzie and she does a good job of playing her. Many people claim that she is a terrible actress but she does have some charm in the roles she plays. Most of the cast from the show appear in the film except for Lalaine. Adam Lamberg plays Gordo and I think he does a good job, kind of an annoying character though. Robert Carradine and Hallie Todd play Lizzie's parents. They both do a good job but don't really appear in the film very much. Some other characters that appear are Matt, who is Lizzie's brother and Kate, who is Lizzie's ex-best friend. There are a couple of new people in the film as well, like Alex Borstein. She steals the film and gives a funny performance. Yani Gellman plays Lizzie's love interest and I thought he did a poor job but it was his first major role. Jim Fall directs this film the same as if it had been a regular episode so don't expect anything out of the ordinary. While, I did enjoy the movie, at times it felt like it was just made for money purposes and not entertainment value. It does feel sitcom-Ash which isn't surprising. Though that sometimes does get annoying. It was predictable but that was expected. It was kind of cheesy at times but its still good fun. It wasn't made to win Oscars, it was made so its audience could have some fun and I think most people will. It's a short, inoffensive film and just don't expect too much. So if you like the show then you will probably like the film since it's the same. If you hate the show then you should just skip this movie. In the end, this is harmless entertainment that wouldn't hurt you if you watched it. Rating 7/10","user":"christian123","rank":[24,31]},{"title":"Underrated","rating":7,"date":"24 March 2008","review":"Why is the rating for this movie only 4.8/10? Yeah, it's not exactly first-class entertainment, but it definitely deserves at least a 7/10. It's good, clean fun, and very entertaining for children and adults alike. It's Lizzie McGuire (probably the only decent programme on the Disney Channel - oh why did they stop it?) and her pals having an adventure in Italy! But whilst this is just an ordinary Roman history trip for everyone else, Lizzie gets whisked away to stardom when she meets Italian popstar, Paolo Valisari. Full of friendship problems, other catastrophes, Matt and Melina's usual (international) shenanigans and a little bit of (clean) romance, the Lizzie McGuire movie fails not to entertain. It's the perfect film to watch on a rainy day (or whilst driving through hot, remote areas of Turkey in a coach - that's how I watched it).","user":"onurish","rank":[19,24]},{"title":"Sick of people cutting down lizz and nice Hillary!","rating":4,"date":"4 May 2004","review":"I am writing this message on all the bad negative bashing on Lizzie Mcguire. First off I want to say I have a pretty good and diverse taste in films. I am into mostly classics of the 60s and 70s such as Chinatown, the Godfather and other movies of the time peroid. But like other genres also like horror, sci fi, good dramas. And every now and then a good old fashioned family film is fun to watch. I had read about Hillary Duff and that her show lizzie Mcguire was a big hit which my little niece watches it so I was like what the hell try it out. I loved it! It was real cute and fun with a little message behind it-what family film doesn't. I think Hill is so much more nice and sweet then all these other sleazy trampy young girl stars out there. Hell I have to admit even the songs weren't that bad, kind of catchy. That girl from Mad TV was great! I laughed my ass off as soon she came into the picture. She rules!<br><br>So anyway about all these bad messages posted about this film and Hillary. I know people have the right to their opinions but come on it's a family film! What do you expect Chinatown! Disney makes makes movies for everyones viewing. Can't expect something deep and disturbing. You can't review this film to heavy because it's family oriented. And as far as Hillary goes come on she's only what 16, 17? Can't expect her to do academy award work-esp for Disney! Maybe she will get better when she is older, if not who cares! She seems like a real smart down to earth gal with a good head on her shoulders. She is smart to not stooping low and cutting down Avril like she has been doing to her, saying things like she's such as mommys  girl and belittling her. With all the violence and hardcore language in films today sometimes it's nice to watch a nice, feel good light family film which is is what Lizzie Mcguire has to offer.<br><br>Hill if you are out there I am behind you 100%! Keep up the good work! Dave from PA. PS just ignore Avril. You are above that","user":"beatles1","rank":[57,85]}]