[{"title":"Explores issues of man's loneliness","rating":8,"date":"20 December 2004","review":"Japon, a film by first-time director Carlos Reygadas, is a sensual meditation on death and the possibility of transformation in which a gaunt middle-aged man comes to a remote Mexican village with the stated purpose of killing himself. We are given no information as to his name or background except that we later surmise that he is a painter who has come from the city to seek solitude for his final act of self-abnegation. The man with no name and no past is the quintessential existential anti-hero, a character that could easily have wandered in from a Wim Wenders movie or a novel by Albert Camus.<br><br>Reygadas has said that he admires spectators who go to the movies to experience life, not to forget about it. In Japon, Reygadas largely succeeds in engaging those who wish not to forget, showing nature in all its ragged beauty. His images of an unseen pig crying out as it being slaughtered, horses copulating while children laugh, and a bird being decapitated push viewers out of their comfort zone and challenge us to engage life at a deeper, more honest level, similar to the work of Bruno Dumont. Though I found parts of the film to be abrasive, I was pulled in by the stark beauty of the desert landscapes, the authenticity of its non-professional actors, and its willingness to explore issues of man's loneliness and relationship to the natural world.<br><br>After an opening sequence on the freeway that, in its drone of dehumanized images, pays homage to Tarkovsky's Solaris, a tall man (nameless) with a weather-beaten face played by the late Alejandro Ferretis makes his way down the canyon to a small village in a remote part of Mexico. Limping with the aid of a cane, he tells a man offering directions to the canyon floor that his purpose in going to the remote village is to commit suicide. The man shrugs and tells him to get into the van. Since there are no hotels in the area, he is offered lodging in a barn close to an old woman's shack. The woman is named Ascen, short for Ascension which she says refers to Christ ascending into heaven without help.<br><br>Japon is a work of mood and atmosphere; the director's static takes and long periods of silence achieve a tone of somber intensity. Ascen, remarkably played by 79-year old Magdalena Flores, is generous and loving, leaving her house guest confused and not sure that he knows what he wants. He fails at a suicide attempt and then settles in to the routine of living in the desert. He drinks Mescal and gets drunk in the village, smokes marijuana (offering some to the old lady), and masturbates while dreaming of a beautiful woman on the beach. It is only when Ascen's son-in-law attempts to cheat her out of her house that he comes alive and asks a strange favor of Ascen that made me decidedly uncomfortable.<br><br>Little by little the depressed man seems to be engaging more in life and connecting with the people around him. Japon uses an amazing seven-minute circular tracking that employs both natural sound and the sublime music of Arvo Part's Cantus in Memory of Benjamin Britten to end the film on a note of transcendence. Although Japon is at times vague in its delineation of character and feels derivative of Kiarostami and Tarkovsky, it is a promising first effort and I am eager to follow this audacious director's career.","user":"howard.schumann","rank":[41,49]},{"title":"A good reason for cinema to persist","rating":9,"date":"12 June 2003","review":"Japón is not a film about Japan. It is a Mexican film, but not a film about Mexico either. For me, it is something really grand: a film about cinema and why it still exists. The story is rather simple and not at all world-shattering: a man, determined to kill himself, walks into a canyon in order to commit suicide in peace and tranquility. He moves to an old woman's house and, impressed by her attitude to life and somehow inspired by what is going on in the beautiful Nature around him, falls in love with or, or at least unfolds the desire to sleep with her. Telling the rest wouldn't take long but still spoil a lot.<br><br>The important thing is not the story (including logical character development) but the way it is told. The movie has the air of grandezza sometimes, it is the opposite of naturalism, but thus it is much more like reality` than a couple of Dogma-style films. When you are alone in nature, well, what else will you do but admire the wonderful landscape and small events happening therein for a couple of minutes, trying to absorb it as intensely as possible? As a result, there are quite lengthy moments in the film, which might repel some people but that's a pity because it means that they are unable to enjoy the immediate experience of beauty.<br><br>In a review I read the author charged Reygardas with being pretentious and cheap, and I guess he referred to the very last shot (which, by the way, could be the most astonishing technical achievement a cinematographer has ever performed!). I understand what he means, and in a way he is right but I find that what we see makes up for this oh so terrible lack of modesty. Seldom have I heard so little noise in a theatre after the last image of a film - it was completely silent (except for one person in the audience who couldn't help applauding). And this experience has confirmed me in two opinions: First, movies are not made for intellectual critics in the first place. And second, cinema will always have a reason to persist. Nothing like a television or DVD set can give you the same feeling as a movie like Japón on the big screen. Of course, there are a lot of films that need the big screen to be worth their money but, as opposed to them, Japón is something really, really great, touching our hearts AND senses AND also (it is not a silly movie!) brains.","user":"Mort-31","rank":[26,35]},{"title":"A dream","rating":10,"date":"9 September 2004","review":"One of my favorite movies of the last couple of years. I happened to see it in a movie theater in Argentina, so I have no idea whether it plays well on a smaller screen. That said, it's a haunting meditation on the transitory and ineffable nature of life, on the tiniest of joys that in the end are all we can rely on to make our existence meaningful. The cinematography is breathtaking and does justice to the desolate beauty of the canyons of northern Mexico. Don't expect a rollicking narrative. This movie invites you to enter a lingering dream.","user":"Pisolino","rank":[22,30]}]