[{"title":"Interesting adaptation, quite different from Grisham's novel","rating":18,"date":"18 September 2004","review":"This review is targeted at those who have read John Grisham's novel and might want to know how the movie compares to the book.<br><br>The largest and most controversial difference between the two is that while the trial in the book was about holding tobacco companies responsible for cigarette advertising, addiction, and lung cancer, the trial in the movie is a case of holding firearms companies responsible for encouraging guns to be sold to criminals. While the book centers around the law, as all Grisham novels do, the movie centers around gun control. Therefore, the movie can be quite political. Those who do not appreciate political statements in movies beware.<br><br>The movie spends a lot more time on Wendall Rohr and Rankin Fitch, the plantiff's lawyer and the defendant's jury consultant. While Rohr is a flat character hardly mentioned in the book, the movie characterizes him as a man who still possesses some sense of the ideal practice of law. Fitch, pitiable and even slightly likable in the book, is shown as an utterly malicious man in the movie. The members of the jury are definitely not shown much in the movie. We don't get to watch exactly how Nicholas Easter befriends each one individually, and we are told less about each jury member. The psychology that is in the book is largely absent from the movie and replaced with a few scenes of dramatic flair.<br><br>The casting of the movie was GREAT. When I heard there was a Runaway Jury movie, I immediately imagined John Cusack as Nicholas Easter. Rachel Weisz, Dustin Hoffman, Gene Hackman, and the actors who play members of the jury are almost as I pictured them as well! Because of this change in theme, the movie is much darker than the book. Extreme violence and arson make their way into jury manipulation. Fitch becomes a much more malevolent character. The ways in which members of the jury are bumped or released from jury duty are much darker than in the book. Little details that were altered to adapt to gun control instead of tobacco are interesting and appropriate. The movie is a different but well-done adaptation. Even if you don't enjoy the movie, it is interesting to compare it to the book.","user":"jeannie-","rank":[23,25]},{"title":"clever, well acted and entertaining","rating":7,"date":"24 July 2005","review":"SPOILERS Hollywood loves adapting popular books. Whether it's classics, modern stories or the collective works of particular authors, films are forever being produced with adapted screenplays. One author who seems to be used a lot is intellectual writer John Grisham. Normally setting his stories in American courtrooms, his stories are often complex and twist based with strong resolutions. 'Runaway Jury' is no exception and in 2003, the film was turned into a feature film starring Gene Hackman and John Cusack. Well acted by everyone involved, it is an entertaining piece of work which leaves you thinking throughout before sticking on a conclusion you might well have predicted beforehand, but which you still enjoy seeing it reach.<br><br>In a landmark trial, a woman is taking the gun companies to court for compensation after a major family loss. Leading the defence for the gun companies is the constantly victorious Rankin Finch (Gene Hackman). A regular at fixing juries in his favour, Finch finds himself facing a challenge this time when a couple, one a jury member (John Cusack) and one working behind the scenes (Rachel Weisz) decide to make money out of the same skills Finch employs so successfully.<br><br>Whether Hackman, Cusack or Weisz, you don't see many moments in this film when the acting isn't superb. Regaining a form not seen for a fair few years, Hackman in particular is brilliant as a man who exploits the system for his own gain. He is closely challenged however by both Cusack and Weisz who give admirable performances in their respective roles.<br><br>The film as a whole is also incredibly clever. Leading you in multiple directions, the constant game of 'cat and mouse' is brilliantly played out with some noticeable surprises as well as some rather unexpected ones.<br><br>It's true that there are moments when the story drags slightly and you find yourself feeling a bit bored, but the majority of the time the story is fast flowing and incredibly entertaining.<br><br>Anyway, whatever your complaints about the script, the story is mostly entertaining and well acted. Led by a superb performance by Gene Hackman, when it's on a high the film is up there with the finest thrillers around in years. It's well worth watching, even if you normally can't stand this sort of film.","user":"TheNorthernMonkee","rank":[26,29]},{"title":"His Own Hubris","rating":7,"date":"25 February 2008","review":"John Grisham's novel Runaway Jury is based on the simple proposition that hacking into the jury pool system is an easy matter. Nobody wants jury duty, people simply just do it because it's an obligation like paying taxes. Minimal safeguards are on that computer.<br><br>In New York State the rule is now ten years. I just got called in October, promptly and exactly ten years after I'd been called previously. You can't serve, in fact if you are called any time before 10 years prior to your last service, you have the clerks look it up and if you're correct, out you go. But if I said nothing, no one would be any the wiser. So maybe what happens in Runaway Jury might have some basis in fact.<br><br>Gene Hackman is more than just a jury consultant. Breaking all laws of privacy, he's on retainer from the gun manufacturer's lobby who are worried about a rash of lawsuits breaking out and somebody collecting on one. Whatever it takes to fix the jury, Hackman's up to it.<br><br>But there are a couple of people, one a juror played by John Cusack, one an outsider played by Rachel Weisz who seem to have a game plan all their own. It might just surprise you to find out just what it is.<br><br>All this revolves around a wrongful death suit filed by Joanna Going and her attorney Dustin Hoffman about the death of her husband, Dylan McDermott which is shown during a brief prologue. Never have the wheels of justice been so greased by so many different hands. <br><br>Nice performances all around in Runaway Jury. Like another author Edna Ferber, it's impossible to make a bad film out of a John Grisham work. Grisham writes so the average lay person can understand and his characters are flawed, but flawed in a way you care about them. See what drives Cusack and Weisz and you'll know what I mean.<br><br>Acting honors however go to Gene Hackman. Imagine the outlaw head in The Quick and the Dead running a jury consulting firm and you'll get the idea of what an amoral person Hackman is. It's his own hubris that takes him down though.<br><br>Good drama by a good cast, you can't go wrong with Runaway Jury.","user":"bkoganbing","rank":[15,16]}]