[{"title":"So Lame, Illogical and Trash that Becomes Funny","rating":3,"date":"7 January 2017","review":"In the Isla Damas, a group of soldiers lands on the island and are attacked and murdered by a Komodo dragon. Two men, Hanson (Ted Monte) and Jason (J.P.Davis), leave a building surrounded by an electric fence to seek out survivors. They run back to the building and a woman, Rebecca \"Becky\" (Glori-Anne Gilbert), who is the daughter of the scientist. Nathan Phipps (William Langlois) deactivates the fence. Phipps and his assistant Dawn Porter (Gail Harris) contact the Chief of a Naval Base at Hawaii, Foster (Jay Richardson), to discuss the dragons that are genetically-engineered by them to produce food that have turned into war machines by Foster. Meanwhile, a casino is robbed in Hawaii by the thieves Drake (Paul Logan), Tiffany (Melissa Brasselle), and Reece (Cam Newlin) that flee to Damas using the pilot of helicopter Jack (Tim Abell). Soon they meet Phipps and Dawn shooting at a Komodo dragon and they learn that they need to team-up with the scientists to survive. Further, the contact with a Komodo turns the person onto a zombie. However the fuel of the generator is finishing and Foster does not have the intention of rescuing the group that knows too much about his project Catalyst. How will they survive from the dragons?<br><br>\"The Curse of the Komodo\" is one of those movies so lame, illogical and trash that becomes funny. The plot is absurd and stupid. Why the soldiers have come to the island? If fuel is primordial to keep the protection against the dangerous creatures, why there is not enough fuel and a backup generator? If bullets do not affect the dragons, why the group insists in shooting at the Komodo? In addition the ham acting is hilarious inclusive with the participation of soft-porn actress. My vote is three.<br><br>Title (Brazil): \"Criaturas\" (\"Creatures\")","user":"claudio_carvalho","rank":[7,7]},{"title":"Probably one of the worst movies of the kind...","rating":1,"date":"12 May 2005","review":"The only thing i can say about this film is that it's awful in every aspect. The script is terrible. The story is a poor excuse and the dialogs are very badly written. The actors look like amateurs. Two actresses were selected probably because they have large breasts (and only because of that), since their acting skills are as good as the Komodo's. And even the visual effects are surprisingly bad, since this film is quite recent. There is almost no interaction between the Komodo and the actors. The result is a movie with not a single point of interest to show for.<br><br>Even if your are fan of this genre of movie, my advice is look elsewhere.","user":"KenVeryBigLiar","rank":[22,28]},{"title":"If you want to feel psychic . . .","rating":17,"date":"17 March 2004","review":"Watch Curse of the Komodo, and guess what the next line is going to be; you'll be amazed how frequently you not only get the gist of the coming dialogue, but predict it verbatim.  But wait!  It gets better!  You can also quite easily predict what will become of essential items such as the generator keeping the electric fence going, all the vehicles, most of the communication devices, the thoughts of the higher up personnel.<br><br>I personally loved how the Komodo just stood there whenever it was in frame. It opened its mouth and roared with its 1950s-ish monster movie look and stock-sound-effect roar that's been used in such intimidating places as Scooby Doo (side-note, do Komodos roar?).  Might as well make the movie about an oversized Chihuahua that just bounces up and down barking. People shoot at it.  It stands there, not even bleeding.  People fire more rounds, it still stand there.<br><br>At this point I think at least one person would try something a little different like aiming for universal soft-spots such as, I dunno, the eyes? We have to assume that they're not standing their firing randomly, but the director fails to communicate that idea.<br><br>They get into a truck and drive, and now the thing decides to move and try to dine.  Why not charge while they're all just standing there? Characters and creatures do what the plot needs them to do when the plot needs them to despite the fact that the plot defies logic on so many levels that it can't be ignored (this coming from a fan of low budget horror films which always defies logic).<br><br>Let's think about this, guns going off and bullets hitting a Komodo is going to provoke it to take a little more action than standing and roaring.  If it hurts or confuses the thing, it's probably going to go away.  If it doesn't hurt it, it's probably going to p*ss it off which means its going to attack. You know what?  Even if it is hurt/confused, it might still attack, actually.  I'm no expert on Komodo dragons; maybe they would just stand there and smile . . . but would they still be around then (Komodo . . .dodo bird . . . hmmm).<br><br>Anyway, logically, wouldn't we see a more curious creature investigating these people before it started eating?  And if the answer is `because the creature mutated, it would be more aggressive.'  Okay fine . . . so why didn't it show this aggression during a logical moment like being shot at?<br><br>And to answer the above question - well, the Komodo effects were not well designed.  In cinema, creature effects become an actor requiring a performance which requires a high degree of articulation (not present here). After all, we are creating organic beasts with a wide range of expressions, gestures, that would communicate its intentions.  The plot needs the thing to roar and run, so that's all it does . . . hey wait, that's not far off from what the cast has to do - talk and run.<br><br>I waited through the whole film for an intelligent decision, and found only one - \"Let's backup our data so we can let the world know the truth.'  Too bad I couldn't get an intelligent decision *and* an unpredictable plot element, but maybe I'm asking for too much.  Especially in light of the final few scenes involving an air strike, which I'm assuming was cut together with stock footage since the planes changed from shot to shot.<br><br>The high point of the film was the character Jack thanks to the actor. All the actors played this quite stale like they realized they were making a goofy monster movie and just wanted their paycheck so they could get out of there.  Kinda strange that the actor to breath some life into his role was the character stuck in a place he didn't want to be in and just wanted the hell out of there.  Maybe I just detected a hint of ironic honesty in the performance.  Go figure.","user":"jaywolfenstien","rank":[10,12]}]