[{"title":"wonderful holiday film","rating":8,"date":"18 December 2004","review":"So it was with much trepidation and even utter fear in my heart that I went to see this movie. After all, the last time I went to see a full-length adaptation of a favorite Christmas story, what I got was Ron Howard's absolutely God-awful \"The Grinch\". Having grown up with the book \"The Polar Express\" (according to my mom, I cited it as my favorite Christmas present when I was seven), I did not want to see this story bastardized in any way. Honestly, I was prepared for \"Polar Express\" to be a complete wreck. But instead <br><br>It soared. Completely. What makes the film such a success is not so much even the story itself, but an execution which somehow manages to inject every frame of the film with a feeling of childlike wonder and exuberance. In addition, there are so many clever touches and details added throughout that a feeling of mystery and excitement just fills the viewer. Among these are the waiters dancing and singing while serving hot chocolate to the kids on the train (a very funny scene, as well), the factory where the presents are prepared, and a ghost-like hobo who is never really explained, but is incredibly crucial to the feel of the film. At one point, three of the children wander lost through the empty streets of Santa's North Pole town. As they wander, various old Christmas recordings are heard playing on phonographs throughout the town. The music provides a pleasant and nostalgic ambiance to the scene. It's touches like this that absolutely make the film.<br><br>I'll never understand why films seem to be required to be at least 90 minutes long. I would pay money to see a 40-minute film, as long as it were good. And even if it sucked, I would have at least wasted less time. What I'm getting at is I have no idea why a 32-page picture book needed to be a 99-minute movie. What this means is that the original story is VASTLY expanded upon. However, what is added in actually fits quite well with the essence and spirit of the book. Some of it is just sheer entertainment; the train track is like a roller coaster, characters ski on top of the cars, danger lurks around every step of the journey to the North Pole (but admittedly fun danger). Other aspects further illuminate and expand upon the book's basic theme of the virtue of belief in the implausible. So I have no idea why this was made into a full-length, but in the end, I'm glad it was. It didn't even feel too long (and I think everything is too long).<br><br>Much criticism has fallen on the look of the characters in the movie. I can agree to a point. While there is incredible visual detail in the faces, they usually seem void of expression. In general, a lot of the motion seems rather wooden, as well. The scenery, on the other hand, is gorgeous. Overall, the minor problems in animation (which really boil down to a matter of taste anyway) are certainly not enough to diminish what is an overwhelmingly successful movie. Score: 8/10","user":"madpenguin41","rank":[193,244]},{"title":"Enchantment, thrills, spectacle...looks great on DVD...","rating":9,"date":"22 November 2004","review":"On the one hand there are many delightful moments in THE POLAR EXPRESS, not the least of which is the entire look of the film--appealing in a way that great illustrations of children's books always are to young and old. Tom Hanks and the others enter into the spirit of the whole thing with gusto--and all the performances are right on target.<br><br>On the other hand, much of the film is an excuse to dazzle with roller-coaster-like rides on the express train that roars across various landscapes making wild leaps and turns, all the while thrilling us with a sense of adventure and excitement. For the very young, the ride might be a scary one, especially when the daring young hero rides atop the train during a blustery snowstorm.<br><br>Things barely quiet down once the destination is reached at the North Pole. Still there are dangers lurking and the thrills continue with some amazing photographic tricks that can only be done in this new process of computer generated animation.<br><br>And to add a cozier touch to the proceedings, certain famous Christmas songs are interjected at intervals to give the North Pole--and the film--a warmer glow.<br><br>All in all, quite an imaginative and innovative achievement--impressive enough to assure its place among future Christmas favorites with unlimited appeal for the young in heart. The message of Christmas is lightly hinted at but when Tom Hanks as the train conductor tells the little boy, \"The true meaning of Christmas is in your heart,\" we can be assured that children everywhere will definitely \"get it\".<br><br>Visually, it's a stunner. I didn't see it on the IMAX screen where I imagine it really knocks your socks off, but at a multiplex where picture and sound were impressive enough to convey just how advanced special effects technology has become. There is much artistry involved here, especially when the night scenes of the train's fast-moving travel through a blustery snowstorm capture some rich winter landscapes, including a frozen lake that threatens to demolish train and passengers before danger has passed. The camera-work is continually fascinating as is the artwork involved.<br><br>A pity there couldn't have been more of a story in the children's book which is the source--but the artistic visuals are the main source of entertainment here and they are superb. The busy background score by Alan Silvestri is reminiscent of works by John Williams. Although none of the sprightly song tunes are particularly memorable, there is a wistful quality to one of the new Christmas ballads sung by the children.<br><br>P.S. - I have just watched it on DVD, a year after writing the above review--and it's definitely a keeper--just as wonderful as you could want, an amazing technological achievement that should delight all ages who can still hear that bell! Tom Hanks, as the conductor, is my favorite character--brilliant job.","user":"Doylenf","rank":[120,152]},{"title":"Will Become A Christmas Classic","rating":9,"date":"20 December 2004","review":"I have to say that I adored 'The Polar Express'. It was just the sort of film I needed to truly get me into the Christmas mood. The story revolves around a young boy, who is coming to an age where he is doubting Santa Claus' existence, until the Polar Express- a magical train destined for the North Pole- takes him and a group of other young children on a journey to Santa and to reaffirm their faith in Christmas.<br><br>I had reservations about the use of CGI animation since I felt it really only worked for stories about cute animals but having seen the film, the CGI was the best way to capture the spirit of the film. It really wouldn't have worked as well in live action, the sense of other-worldly magic would have been lost. And as it was, the artwork was beautiful, especially the snowy mountainous scenery that the train passes through.<br><br>This film took me back to my childhood and that tingly-feeling every child gets on Christmas Eve in anticipation of Santa's visit. The story was sweet and innocent without being nauseating, and I think every one of us can empathise with the boy who wants to believe in Santa but is growing away from the innocence of early childhood and faith in magic. Much like Raymond Briggs' 'The Snowman', I predict 'The Polar Express' will go down as a Christmas classic. It certainly makes a pleasant change that this year's Christmas film was actually about Christmas and I hope they make the re-release of this film an annual Christmas event.","user":"cosmic_quest","rank":[99,125]}]