[{"title":"From a life that's hard to swallow, to drugs that are hard to swallow.","rating":8,"date":"14 December 2004","review":"I really liked this movie a lot. It's refreshing to come across a compelling human drama that is told in such an incredibly honest and unexaggerated fashion that it ends up feeling wonderfully real and completely believable. The rather straightforward story only makes the movie feel more convincing - not at all contrived.<br><br>Maria Alvarez, played by previous unknown Catalina Sandino Moreno, is a seventeen year old who falls into the sticky-sweet trap of seeking a quick escape from the drudgery and hopelessness of her mundane existence. She turns to drugs. Not using them, though - smuggling them. Working as a drug mule offers her the chance at easy money. But, like most young people, she dives into it headlong - without fully realizing the risks and possible consequences. In fact, this movie really is all about young people stumbling over their own poor judgements (yes, it can be painful to watch at times).<br><br>Given all the hype that surrounded this movie when it was released, I found it to be not quite as harrowing as I had expected. Perhaps I'm just too jaded and desensitized. In truth, there were moments where I felt genuinely afraid for Maria. Mostly, though, there was just a real sense of the despair and desperation that fills the lives of these young Colombians. Perhaps this movie will, after all, not be the centerpiece of the Colombia Tourism Board's upcoming marketing and public relations campaign.<br><br>In the spirit of keeping it genuine (aka believable), all the acting in this movie is right on the mark - all the actors deliver. Of course, Catalina Sandino Moreno (Maria) is so graced with natural beauty and she projects such a gentle and humble manner that one can't really help but feel empathy for her character. In fact, if there is anything to find fault with in the casting of her as Maria, it's that you're left wondering why her boyfriend would be such a God-damned idiot as to pass her up. If he had even an ant's worth of common sense, he would be madly in love with her. Not? So, that's the one element that doesn't gel so well.<br><br>The moody and melancholic music throughout this film - with plenty of beautiful acoustic guitar playing - supports the emotional content of the movie perfectly. Thankfully, it doesn't overtly bang you on the head with \"feel sad here\", and \"feel scared here\", and \"feel relieved here\". It sinks back a bit to find its harmony with the other elements. Nice.<br><br>The cinematography is beautiful in its simplicity and its understated manner. The word \"modest\" - in its best sense - serves well in describing this movie. Overall, it's just not as heavily stylized as other the-perils-of-getting-involved-with-drugs type movies - such as \"Requiem For a Dream\", \"Traffic\", \"Blow\", and \"City of God\", to name but a few - and with little of the annoying moralizing that tends to poison movies of this \"genre\".<br><br>In conclusion, most of us have already learned in life that one shouldn't be an ass. What this movie teaches us is that it's also not a good idea to be a mule.","user":"tomkidding-dot-com","rank":[56,63]},{"title":"Compelling, with one of the most memorable performances of the year","rating":8,"date":"26 August 2004","review":"[WARNING: CONTAINS SPOILERS]<br><br>There's a moment in \"Maria Full of Grace\" where the tension's so palpable you'd think Joshua Marston had made a genuine suspense-thriller, not an independent character-driven drama about someone seeking greener pastures.<br><br>The scene takes place aboard an airplane. In the bathroom, Maria (Catalina Sandino Moreno) grapples with putting two drug-filled pellets back into her system, while in the gangway, Lucy (Guilied Lopez), another human drug-mule, faces the sickening reality about one of her latex pellets. There are a couple of equally tense moments later, too.<br><br>This story's ripe for overblown clichés and stereotypical characters. But what makes \"Maria Full of Grace\" so engrossing is Marston's nonjudgmental and unsentimental look at his protagonist's life so that we understand and, in a strange way, appreciate, why she decides to become a drug mule. True, she freely decides what to do, but it's really Hobson's choice.<br><br>Marston peoples his film with original voices and makes them authentic. He lets us into Maria's life long before she ever decides to transport drugs in her belly, turning her tale into a riveting character study of a hard-working young woman forced to seek a more fulfilling, safer life.<br><br>Moreno gives 17-year-old Maria dignity, sweetness and innocence. Yet, she's no pushover, but a strong, determined woman who wants desperately to better her life. When her boyfriend wants to fool around, Maria would rather be more adventurous and climb to the roof of an unfinished building. When her mother orders her to give up her wages to pay for her medicine for her unemployed sister's kid, we feel Maria's rage and frustration.<br><br>Marston makes something grim and menacing out of a simple story. Yet, his story unwinds with tremendous restraint and intelligence. He eschews melodrama in favor of insightful, deeply moving, compelling scenes of personal struggle.<br><br>Even when the second half of the film could have easily been mired in conventional storytelling, Marston keeps this a gripping character study. This movie reminded me of Michael Winterbottom's 2002 docudrama, \"In This World,\" which dealt with the torment some Afghan refugees endure to escape to the West, and Gregory Nava's \"El Norte\" (1983).<br><br>These films crystallized the West's allure for impoverished people and the often-harrowing lengths to which they will go for a chance at a better, more secure life. I suppose that's one reason why Marston opts for an optimistic view for his heroine. But, in fairness to this talented filmmaker, he neither paints an entirely rosy picture nor implies there are more Marias than Lucys in the drug world. The predicaments Marston creates for his characters are, at times, positively gut-wrenching.<br><br>This film's strength lies in Marston's neo-realist approach. He pays meticulous attention to detail, whether it's Maria's life at home, the prickly work at the flower factory, her unconventional independent spirit, her throat exercises to prepare becoming a mule or the creation and ingestion of the latex pellets. The latter is done so matter-of-factly it makes it all the more horrifying.<br><br>If Hollywood does in fact seek and honor originality and real talent, then Marston should wind up with a multi-picture deal and Moreno a much-deserved Oscar nomination for best actress. I, for one, would be thrilled if she wins the statuette.","user":"anhedonia","rank":[19,20]},{"title":"A riveting human odyssey that transcends simplistic messages","rating":10,"date":"9 August 2004","review":"In Joshua Marston's small budget film Maria Full of Grace, a headstrong Colombian girl of seventeen (Catalina Sandino Moreno), determined to escape from a country where the average annual income is about $1700 US, seizes an opportunity to earn $5000 by ingesting and transporting illegal drugs to New York at considerable risk to herself and her unborn child. Inspired by a woman in his Brooklyn neighborhood who told him her story of swallowing capsules of heroin and boarding a plane for the United States, first-time director Marston has escaped the clichés of social realist films to offer a riveting human odyssey that transcends simplistic messages of good and evil. Shot in documentary style with a hand-held camera in Ecuador and New York, the film's authenticity is greatly enhanced by its use of Colombian actors speaking in their native Spanish language. <br><br>Maria Alvarez along with her best friend Blanca (Yenny Paola Vega), works at a job stripping thorns from roses in a village near Bogota, Colombia. Despite low wages and deplorable working conditions, her pay provides support for her grandmother, mother, sister, and infant nephew to sustain their meager household. After she has words with her boss, she quits her job and soon discovers she is pregnant by a local boy Juan (Wilson Guerrero) whom she does not love and refuses to marry. Feeling trapped, she quickly accepts when Franklin (Jhon Alex Toro), a friend she recently met at a dance, offers her a huge sum of money to smuggle drugs into the U.S. The trick is that she must swallow up to 100 heroin pellets sealed with latex and dental floss, knowing that certain death follows if one of them bursts.<br><br>\nThe lovely Ms. Moreno, in an Oscar-worthy debut performance, is no cardboard character but a fully developed human being who epitomizes the desperation of people who are willing to do almost anything to better their life. The tension is almost unbearable as we follow Maria's odyssey into danger. She soon meets drug kingpin Javier (Jaime Osorio Gomez), who explains the operation, and in secret, talks with Lucy (Guilied Lopez), who shares her experience in carrying drugs to America and allows her to practice by swallowing large grapes. <br><br>After barely escaping the probing of  U.S. Customs Officers in New York, things begin to go wrong and Maria and Blanca must rely on their tremendous resolve to survive in a confusing and lonely environment. Winner of the Dramatic Audience Award at Sundance and two major awards at the Berlin Film Festival, Maria Full of Grace is not only a hard-hitting jab at a global economic system that allows exploitation of the poor to satisfy the pleasure of the rich, but a richly nuanced coming-of-age story that delivers its hard-edged message with understanding and compassion. One of the best films of the year.","user":"howard.schumann","rank":[95,123]}]