[{"title":"Guilty Favourite","rating":9,"date":"18 April 2019","review":"Can't argue about my love for this film. It is funny and not super serious. You can leave your brain at the door. Won't impress the critics, but combining this film with drinks is a must.","user":"nicholls905-280-546911","rank":[9,9]},{"title":"A Welcome return to Reckless Abandon","rating":9,"date":"9 February 2003","review":"Caught a preview showing last night, and I'm a little surprised myself to report that the aptly named Old School is actually a welcome return to a formula all but abandoned by Hollywood for much of the past couple of decades - that of the unapologetic, raucous, cheap laughs for cheap-laughs sake, male-bonding fraternity picture. It is Animal House. It is Porky's. It is every cliche one comes to expect from such a picture - from wild frat house parties to girls wrestling in KY jelly. And, strangely enough, it delivers... with a good cast and a fresh twist. For the group of guys that assemble to start the fraternity that is the heart of Old School are all in their early to mid thirties. They are family men. They are husbands. They are fathers. They are boyfriends involved in serious relationships. They have all grown up.<br><br>Or so thought Mitch Martin (Luke Wilson), the \"Godfather\" of this return to the dorm comedy. When Mitch returns from a business trip to find that his girlfriend (Juliette Lewis) has been hiding from him a rather unnerving secret sex life, the guy begins to question the choices he's made in his life. And his friends are there to help. Best friend and self-made successful businessman Beanie (played with perfect comic timing by Vince Vaughn) suggests they take advantage of Mitch's new found freedom and start a fraternity. And it isn't long before every disillusioned and disenfranchised thirtysomething wants to join - to either recreate their days of reckless youth, or finally belong after years of being an outsider.<br><br>Among such misanthropes is Frank the Tank, a character that Will Ferrell makes his own. Literally baring all for the camera, Ferrell, like Saturday night live alum John Belushi before him, plays the wild but affable frat brother - the sad clown, the loveable loser. Ferrell gets all the best lines, but a few are reserved for the sardonic Vaughn. Wilson, to his credit, plays it straight, and the supporting cast (including Leah Remini, Artie Lange, and even the usually annoying Andy Disk in a hilarious cameo) is quite good.<br><br>Certainly, Old School is not Oscar material. It's not meant to be. And it makes no pretension to comedy of the kind that My Big Fat Greek wedding brought back into vogue. This is not a feel-good romantic comedy. But it is also not to be dismissed as some insipid throwaway college romp. Old School is intentionally sophomoric (all the more so, as it is director Todd Phillips' second big studio comedy). It is genuinely funny in parts, and a healthy hour and a half return to those days of reckless abandon that many of us dreamt we either had back - or had had in the first place.","user":"2blackcats","rank":[70,89]},{"title":"Raunch Supreme","rating":7,"date":"14 March 2003","review":"Much like the tradition of the raunchy flicks of the 80s, Old School encompasses the age old tradition of tactless and tasteless film creation. Buy the oddity of the situation, this is one of those films I can tolerate. Mid-life malaise couldn't have been drawn better in the lives of Mitch, Frank and Beanie. Men who serve no purpose in society, especially to their significant others. But that's the significance of the frat house. No, it isn't about being drunk and hitting on 19-year-old girls, its about reaffirming your role in society and making the inner soul feel good and relaxed. So, say what you want about the random nudity and cussing, this film is a life affirming film for all men hitting their 30s.","user":"Agent10","rank":[67,93]}]