[{"title":"A film (not only but especially) for all daydreamers, searchers for meaning in life, and eccentrics...","rating":10,"date":"5 November 2018","review":"I am a fan of many fandoms and have seen many films which include elements of or are about fantasy, dreams, and/or imagination. But ever since The Secret Life of Walter Mitty came out, it has been my favorite film of all times. I can't quite say why this film appeals to me to such an extent. I suppose because I myself have spent a lot of time daydreaming about all kinds of stuff, and have, at times, felt a bit out of place in the world we live in. What I have found most enchanting about this film is just how very ordinary and relatable Walter Mitty is. And then he stumbles into this odd adventure... but it's not just your ordinary hero-on-quest, great-adventure story. It is so much deeper than that. Please watch this film! You won't regret it!","user":"ellinmara","rank":[52,53]},{"title":"An Utterly Mesmerising Spectacle","rating":1,"date":"1 July 2014","review":"'Tropic Thunder', 'The Cable Guy', 'Zoolander'... Ben Stiller has created some entertaining comedies, but 'Walter Mitty' is by far his most audacious piece of direction so far. The story is solid and the cinematography is stunning, Stiller has created an utterly mesmerising spectacle that follows the same basis of the 1947 classic starring Danny Kaye. Whilst I found the majority of the film charming and entertaining, it's the beautiful cinematography from Stuart Dryburgh that really sells this flick, and in my opinion should have been worthy of an Oscar- nomination at the least. One of the most entertaining comedy-dramas I have seen in recent years, a film that Stiller should be proud of.","user":"CalRhys","rank":[212,241]},{"title":"Brilliant and motivating","rating":8,"date":"20 July 2018","review":"Ben Stiller is Walter Mitty, a man who looks as if he does nothing, is nothing and is perceived as nothing. Except for during his little fantasies in which he is a hero, but during these weirds moments in which he dozes off, others write him off.<br><br>Until he finds a goal in life, which puts in him adventurous situations by accident, which transform him in the man he always was. A unique individual, an adventurer, a dreamer who fulfills his dreams and finds the appreciation he needs and deserves. But the appreciation doesn't come from other, but from himself.<br><br>What the movie does brilliantly, is make the watcher feel connected to Walter Mitty and feels with him. You'll find him goofy, but likable. Your respect for him will grow with every minute, and at the end of the movie, you'll love him. Maybe you even recognize your own milestone moments, mountains you have climbed, seas you have sailed, so we all are bigger than we are perceived, as long as you have that respect and confidence from within.<br><br>Props to Ben Stiller. Jim Carrey had his Truman Show, Will Ferrel had his Stranger Than Fiction. Ben Stiller's Walter Mitty should be in that group.","user":"CountJonnie","rank":[26,27]}]