[{"title":"the definition of \"funny\".","rating":10,"date":"6 November 2007","review":"This movie is simply funny, it aims to make you laugh and no more. Anyone who dissect the plot and put the acting and screenplay of this film under a microscope is missing the entire point of this movie.<br><br>This is a comedy, not a documentary or an historical saga, this is plane humor, dumb with a bit of a slapstick taste... The entire situation is fictional of course and that's what so funny about it. I've read some comment about this movie here and the people who wrote these comment are way off, talking like those big-shot movie critics. <br><br>This is a fun movie to watch with a \"stupid\" yet hilarious story, simple comedy and a lot of what some people call \"toilet humor\" (which is always funny) - it's nothing more than pure entertainment and it leaves you with a smile on your face which is never a bad thing, right? I've seen this movie 5 times and I still laugh my heart out! :-D","user":"gnakash","rank":[204,276]},{"title":"Highly Recommended For Days When You Are Down and Trouble","rating":7,"date":"13 May 2007","review":"After an unsuccessful mission, FBI agents Kevin Copeland (Shawn Wayans) and Marcus Copeland (Marlon Wayans) fall in disgrace in the agency. They decide to swap their bad position with his superior Section Chief Elliott Gordon (Frankie Faison) working undercover in an abduction case, disguised in the two spoiled white daughters of a tycoon, Brittany and Tiffany Wilson, getting in hilarious situations.<br><br>I like the silly and funny movies that Keenen Ivory Wayans directs. His formula, mixing gross, low level and racist jokes are hilarious and highly recommended for days when you are down and trouble. My soccer time lost the game in the afternoon and I was very upset. While watching \"White Chicks\", I laughed a lot and I really liked this comedy, which will never be nominated to an Oscar or to Cannes. But it is delightful to shutdown the brain and feel amusement and joy with this type of silliness to improve the humor. My vote is seven.<br><br>Title (Brazil): \"As Branquelas\" (\"White Chicks\")","user":"claudio_carvalho","rank":[102,150]},{"title":"Absurd + Unbelievable= HILARIOUS!","rating":25,"date":"25 October 2004","review":"Okay, I was dragged kicking and screaming to this movie. I made my friends pay for my ticket in protest when the majority voted to see this and I was stranded at the movie theater without my car. When I first heard of it, I thought the premise was absurd, the make-up laughable and the jokes seemed racist. I was right about the first two things. Yes, you are not fooled for one minute that Marlon and Shawn are actually either of the 2 pampered princesses they impersonate. Yes, you can't imagine anyone else being fooled either. But for one moment, just suspend your disbelief and take this movie for what it is... a comedy. A gut-busting, rolling on the floor laughing and quotable one-liners kind of comedy. This was the funniest movie I have seen in a long time. This movie makes fun of everyone-- black, white, rich, poor, dorks, cool people... no one is safe. And the brother who falls for Marlon in disguise had me pee-ing in my pants! And there's even bit of commentary about social and racial stereotypes. All in all, an enjoyable experience.","user":"CGMAETC","rank":[153,233]}]