[{"title":"\"Terabithia . . . enthralls and absorbs the viewer in the magic of imagination and the reality of every-day life.","rating":10,"date":"3 March 2007","review":"Review: By Morgan Stewart<br><br>It is hard to put into writing just how marvelous and wonderful Bridge to Terabithia really is, yet as I attempt it, I can't help feeling disturbed at how ridiculous people are being about the marketing of this film. Thank goodness most real critics have looked past the agreeably deceptive marketing, into the heart and beauty of this film, which, with or with the misleading advertisements is impressive. After seeing it, I struggled to think of a better way of marketing this film, without giving away its ending or taking away the only audience that still seems to watch PG movies, kids.<br><br>After watching it, however, I couldn't imagine taking anyone under ten to see it, nor could I imagine anyone under ten enjoying it as much as young adults, or even older audiences would. So, as deceptive as the advertising was, I myself realize that the fascinating story, the charm and skill of the actors, and the good direction of newcomer to live action film-making, Gabor Csupo, more than makes up for the slightly skewed first impressions. And I am eternally grateful that it did not turn into what everyone seemed to want, a cheesy Narnia rip-off. If anything, the movie was a lot better than the preview made it seem to be, and I was pleasantly surprised.<br><br>Instead of the brash and rude approach to filming movies, that seems to be the standard today with effects driven movies, Terabithia focuses on the characters, the story, and the heart when telling this beautiful tale. Which, is part of the reason why I enjoyed it so much. Too often now days the story is built around the effects, not around the characters. A rather cumbersome and annoying way to tell a story, or be told a story, if you ask me. Instead, Terabithia uses the talents of both the amazing young actors, and its adult cast to enthrall and absorb the viewer in the magic of imagination and the reality of every-day life.<br><br>The story focuses on young Jess Aarons, whose school life and home life aren't all that ideal. He deals with bullies at school, and four sisters at home. Josh Hutcherson, who I haven't particularly enjoyed before, plays the part of Jess perfectly, his emotions and reactions spot on, throughout.<br><br>What is a school without the new girl? Leslie Burke, played by AnnaSophia Robb, takes on the part of the imaginative and friendly new girl and brings to Jess gifts of imagination and friendship. Robb truly does a superb job in bringing to life the thoughtful and imaginative Leslie Burke.<br><br>All of the supporting cast was also brilliantly portrayed. I especially enjoyed the performances of Robert Patrick as Jess's father, and young Bailee Madison as Jess's little sister May Belle.<br><br>Together, Jess and Leslie create a world to call their own. A place that no one else can get to, a place in their imaginations. Terabithia, a land of beautiful creatures and dangerous enemies, springs forth from their imaginations, and becomes a place to call their own, away from the bullies and monotony of everyday life.<br><br>What really struck me as brilliant was the limited, yet still perfect number of glimpses into the children's' imaginations. We don't see a lot of Terabithia, which is good, because it is more about the journey of the characters, than the land of Terabithia. That said, it still has quite a few more scenes of adventure than the book by Katherine Patterson, all of which add to, not take away from the story.<br><br>The writing, also is quite good. David Patterson, son of the novel's author takes great care when adapting the beloved work of his mother into a screenplay. Most of the lines from the book aren't there, but there are a few which make it in, revealing the care and love that was put into the scripting of this movie. Personally, I enjoy the screenplay of the movie more than the words of the book, but that is just my opinion. The movie's script greatly aided in the believability of the characters, and the motion of the scenes, which were crisp and well-planned.<br><br>The movie touched on my every emotion, bringing me to tall peaks of happiness and leaving me teary-eyed and disconsolate, but still had a perfect and satisfying ending. I also, personally thought, the scenes and situations were more powerful, poignant, and realistic, than the book, which surprises me. Usually, the movie can't live up to the book. In this case, the phrase seemed switched around. The book didn't live up to the movie. As weird as it is for me to say this about a movie, Terabithia touched my heart like no film has ever before. And I doubt any film will give me quite the same feeling, ever again.","user":"balaenaglacialis","rank":[357,407]},{"title":"Story over effects.","rating":7,"date":"24 April 2007","review":"When I sat down to watch Bridge to Terabithia, I did not know quite what to expect. From what I had seen in the trailers, I thought the movie would be about two kids that end up in some magical world, similar to the Chronicles of Narnia (clearly, I did not read the book). Needless to say that I was surprised when actually seeing the movie. I shall not spoil the story for those who have yet to see the movie, but I will say that, in my opinion, this movie is for a more mature audience than one would think. Rather than being a fairytale for youngsters, the movie actually gives the viewer an inside look in a young boy's life and all the troubles he faces, concerning school, family and friends. The setting overall was a lot darker than expected as well. I can be short about the acting. The child-stars that play the lead roles did a great job and really brought the characters to life. On this subject I must give some credit to the director as well, as it is very difficult to work with children and to get them to play the part exactly the way you want them too. One final aspect of the movie that deserves mentioning is the fact that it does not lean on special effects. Although there is a fair amount of nice CGI present in the film, the story dominates. Which in my opinion, is a lot better than the other way around. Overall, I found the movie very enjoyable, but I would advise parents of young children to find out more about the movie, before deciding on whether or not you'll let your kids watch it.","user":"Nez-Alpha","rank":[128,144]},{"title":"Touching story","rating":8,"date":"15 March 2007","review":"A very well mastered family movie with a positive message that addresses topical themes for children in a poignant, focused manner. The children depicted are very real and likable (well, except for the ones you're supposed to dislike, that is), and easy to identify with. The movie is a faithful and touching adaptation of the beloved children's classic book.<br><br>The two main characters, Jesse and Leslie (splendidly played by John Hucheson and Annasophia Robb) are typical pre-teens, steering their way through the routine ups and downs kids everywhere deal with, and they develop a friendship/first crush due to their common interests and challenges. They find an old tree house, and create a fantasy castle type kingdom complete with magic, and populated by creatures based on people they know. Unlike so many other fantasy movies, this world is just an amusement for them, not a refuge that they actually \"enter.\" The animation effects of this fantasy kingdom are skillfully executed in such a manner as to point out the reality that exists alongside the fantasy. For example: a tree begins to move, comes to life and performs an action, then relaxes back into its \"real\" position.<br><br>The relationships of all the characters, and what they learn from their experiences, are the true focus, with the fantasy sequences only spicing what's happening. There are many themes touched upon: friendship, tragedy, adventure, creativity, bullies, competition, family life, even making an enemy to a friend. I liked all the characters and the actors that played them; each person helped build the story. Emotional, even heart wrenching in one case, this movie is a gem. Highly recommended.","user":"MartianOctocretr5","rank":[107,125]}]