[{"title":"You don't know how lucky you are...","rating":25,"date":"25 November 2005","review":"I bought this DVD second hand from Amazon when I realized that the DVD drive on my PC is slightly more promiscuous than the one on my TV, and can be teased into playing Region 4 DVDs, because for some reason I can't quite fathom, this movie isn't available in the Region 1 format of my adopted home (California.) I don't know if it ever got a cinema release here, but it's certainly not available on DVD or video. Possibly they thought it might need subtitles? But I'm glad I tracked it down because it definitely brightened up my week! <br><br>This is basically a classic Cockney Crime Caper, fairly old fashioned in concept but beautifully scripted and acted, and exported to Australia. Instead of the dull streets of east or south London, we are treated to the eye candy of Surfer's Paradise (and I freely admit I have no idea whether that's a real place or not) where the azure skies, blonde beaches and palm trees suggest a luxuriant, idyllic, sybaritic lifestyle. Which is a nice twist given the reality of the story-line of down on their luck ex-cons of varying intelligence levels, trying to escape their dodgy pasts. Other reviewers have outlined the story, so I won't repeat it here. It's a little clichéd in places (cute ex-con redeemed by love of a good woman, new found sense of responsibility for baby brother and amazing ability to cook lean cuisine, a skill he apparently picked up while chopping carrots in jail. I mean really?) but Getting' Square's heart's in the right place and it's entertaining and funny, and boasts a wonderful cast, including Sam Worthington, Timothy Spall, Freya Stafford and David Wenham.<br><br>David Wenham steals the show completely as Spit, the touchingly hopeless druggie. He is quite possibly the only actor around capable of making a drug addict appealing (cold sore and all) and as many others have said, the court scene is a classic, and the screwdriver and ski-mask robbery of the gas station totally cracked me up. Also not to be missed, the sight of Spit hot footing it down the street in ill-fitting briefs and flip flops. If only the junkies I've met were in such good shape! This is exactly the kind of entertaining, blackly comic movie which is not seen here in the USA, and which makes me nostalgic for British and Australian humour, which I think are pretty similar. I'm quite surprised to read some of the criticisms of this movie on IMDb. Given the standard of so much of the Hollywood dross that dominates cinema screens everywhere, you Aussies should be really glad you still have easy access to something as good as this!<br><br>Addendum: since writing this a friend has come back from Australia and informed me that Surfer's Paradise is not only a real place, but just like the movie. Perfect!","user":"isabelle1955","rank":[35,37]},{"title":"David Wenham needs a shower","rating":7,"date":"11 April 2004","review":"A solid example of an Aussie crime/comedy caper - but more than that, it's a brilliant display by David Wenham, who deserves much applause (and a good shower) for his portrayal of Johnny 'Spit' Spiteri.<br><br>Many things come together to make this a great Aussie film. The cinematography is clever and fresh, the script is, and the acting is superb.<br><br>Sam Worthington is Barry, recently out of prison, who lands a job as a chef in a struggling restaurant, run by Darren (the wonderful Timothy Spall), an ex-con trying to stay straight. When Darren runs into trouble with a suspect $200,000, and Barry's friend Spit runs afoul of the local gangster (Gary Sweet), they team up for a double-cross - but it's much more complicated than that.<br><br>The script is smart and devilish, but while it twists and turns, it never approaches ridiculousness. Written by prominent criminal lawyer Chris Nyst, you wonder who much is fact and how much is fiction - something here seems plausible.<br><br>That might be just the superb acting. Worthington is solid and believable, but Wenham utterly steals the show as the hapless, mullet-wearing Spit. One scene where Spit goes before a court hearing is one of the highlights of Aussie cinema of the last decade. It's stunningly scripted, brilliantly acted - and very funny.<br><br>'Gettin Square' isn't as good as 'Two Hands' - it's uneven at times, slightly plodding early on, and takes 40 minutes to really get into the script - but it's still well worth the entry price.","user":"lynton","rank":[19,21]},{"title":"Gettin' Square hits its mark","rating":10,"date":"5 October 2003","review":"This is the second feature from director Jonathan Teplitzky (Better Than Sex) and his spunky, slightly off-beat direction doesn't disappoint.<br><br>Barry Wirth (Sam Worthington) has just been paroled and wants to get square (go straight) but finds that his shady ex-acquaintances and past are harder to lose than he thought.  Barry and his mate Johnny \"Spit\" Spitieri (David Wenham) and new employer Darren Barrington (Timothy Spall) and find themselves pitted against the high-tech resources of the newly formed Crimes Investigation Commission (CIC) and old enemy Chicka Martin (Gary Sweet) and his cronies.<br><br>The cast (and a couple of excellent cameo appearances by Ugly Dave Gray and Gretel Killeen) is virtually flawless and David Wenham is hilarious (his court appearance for the CIC is likely to go down as one of the most hilarious misadventures in court, ever).  Slick writing, excellent direction make this a very easy film to watch and thoroughly enjoy!","user":"strangie","rank":[19,21]}]