[{"title":"Michael Jai White IS The Movie","rating":7,"date":"13 September 2009","review":"What can you say? 'Blood and Bone' is a pleasant martial arts/drama surprise that handles us a pretty enjoyable ride during it's 90 minutes and a Michael Jai White in top form.<br><br>Directed by the one who wrote the infamous failure that was 'Dragon Ball Evolution', Ben Ramsey, the movie tells us the story of Isaiah Bone, an ex-con that takes the world of underground fighting by storm, in order to keep a promise to his late friend in prison.<br><br>With an interesting plot that explores the martial arts world combined with the underground fighting game and a 'surprise effect' sustained until the last twenty minutes of the film, Ramsey achieves to maintain the spectator on his chair until the end of the movie, mixing action and drama.<br><br>The fighting scenes are awesome, and not only Michael Jai White knows how to act, knows how to fight: he kicks ass (and also Van Damme's and Segal's ass too).<br><br>This is one of the best low budget action movies you can possibly watch in your life and if you're a martial arts fan then this will serve you well. It has excellent underground fighting matches that will blow you away. Michael Jai White rocks, and he IS the movie.<br><br>7/10.","user":"JoaoPovoaMarinheiro","rank":[72,75]},{"title":"Finally...a real martial artist on screen!","rating":8,"date":"15 September 2009","review":"Isaiah Bone (Michael Jai White) is released from prison and immediately enters the world of underground fighting. With the help of Asian manager Pinball (the super annoying Dante Basco), Bone wins several fights easily and attracts the attention of local crime kingpin James (Eamonn Walker). James is suitably impressed and wants Bone to fight for Mr. McVeigh (Julian Sands). Of course, the avid chess player/head smasher Bone has been planning all of these moves carefully as he has his own agenda. <br><br>With a three word title, cliché story and style that sends me back to the early Steven Seagal flicks, BLOOD AND BONE is about the best early 90s action flick made in 2009. The plot is straight up Van Damme territory (it actually resembles Jean Claude's LIONHEART quite a bit) and the film more than delivers in the action department. Jai White, an incredibly talented martial artist, is given lots of time to show off his moves. Thankfully, director Ben Ramsey allows for some long takes that really highlight his flow. The final battle against \"Pretty Boy\" Price (BLOODFIST 2050's equally talented Matt Mullins) is probably the film's highlight. Acting wise, Jai White is very good as the stoic Bone. The film's top acting honors, however, go to Eamonn Walker as the gangster who loves his dogs and refuses to curse. He is a real revelation. Julian Sands puts in about 10 minutes as the stereotypical \"evil white guy\" and he has quickly morphed into mid-to-late 90s Malcolm McDowall. The supporting cast is rounded out with lots of MMA fighters including Maurice Smith, Gina Carano, \"The Beast\" Bob Sapp and Kimbo Slice, who will surely get a nod for Best Supporting Actor for his turn as jail house thug J.C.. It is really a shame to see Michael Jai White only getting a chance to shine in lead roles in low budget action flicks. Ryan Reynolds gets big films, but this guy can't?","user":"udar55","rank":[49,57]},{"title":"Bad to the Bone","rating":8,"date":"7 September 2009","review":"\"Blood and Bone\" is one of the best low budget martial arts films I have ever seen. This was a perfect movie to showcase the talent of the very underrated Michael Jai White. Great fight scenes throughout that are really shot well. None of that shaky camera stuff where you can't tell what is going on. I just happened to watch this movie after watching the movie \"Fighting\" and I have to say that \"Bone\" is ten times better. The fight scenes, the music, and even the acting is better. \"Fighting\" had very little fighting and the little it had wasn't that great. The camera was too close to the actors and too shaky to tell what was going on. They could have been playing poker for all I know. \"Bone\" should have been released in theaters instead of \"Fighting\". If you are a fan of martial arts films and like fight scenes where you can see all the moves, check this one out.","user":"ericthered01","rank":[74,90]}]