[{"title":"Brave Women","rating":7,"date":"7 August 2016","review":"In Minnesota, the newlywed Kathy Clifson (Penelope Ann Miller) is happily married with Chief of Police Doug Clifson (Reed Diamond) that wants to adopt her son Brian from her first marriage. When she sees Officer John McCrane (Andrew Jackson) near the local high-school, she recognizes him as the man that raped her thirteen years ago when she was seventeen years old. Kathy decides to tell Doug the incident and her friend Carole Bakelin (Liisa Repo-Martell), who was also raped by McCrane, also tells to her husband Todd Bakelin (Joel Keller) that she was raped by McCrane two weeks before Kathy. Doug seeks out McCrane's chief to request an investigation but the officer is protected by his colleagues. Further Kathy, Carole and Doug learn that their alleged rape case has already expired in accordance with the law. They decide to look for other women that might have been raped by McCrane more recently and they meet the dyslexic waitress Camille Fenton (Shannon Lawson) and the Police Officer Lynn Jordan (Marnie McPhail) that were forced to do oral sex with McCrane. Further, they find that they need a lawyer to defend them and they hire Scott Miller (Matt Craven). Will they win the process against McCrane? <br><br>\"Scared Silent\" is a surprisingly good TV-movie based on a true story. Kathy and Carol are brave women with enough courage to confront the police force of a small county and a dangerous man. The conclusion is frustrating despite the victory of the women since there is no direct punishment of John McCrane. My vote is seven.<br><br>Title (Brazil): \"Força Silenciosa\" (\"Silent Force\")","user":"claudio_carvalho","rank":[6,7]},{"title":"A Relentless Pursuit of Justice","rating":27,"date":"27 October 2019","review":"In the year 2019, the story of \"Scared Silent\" would take a different course than it did for a group of Minnesota women who were raped by police officer, who then covered his tracks and was backed up by the power elite. Made in 2002, this film is still worth watching for issues that it raises and a story that must not be forgotten.<br><br>One of the most important characters in the film is a psychologist, Dr. Nancy Tobin, who carefully explains to a mock jury the dynamics of sexual assault and the trauma that lasts a lifetime for the victims in a \"code of silence.\" The way the psychologist framed the mindset of Kathy Clifson and the other victims led to victory in a civil suit after the criminal misconduct case ended in acquittal for the cop.<br><br>Led by Penelope Ann Miller as Kathy, the performances in the film were first-rate. The actor playing the husband was especially good in the empathy provided to his wife by breaking from his co-workers on the police force in order to take a stand.<br><br>Still, the film belongs to the character Kathy, who is relentless in pursuing justice and courageously fighting the \"system\" without flinching. It was an unforgettable character portrait.","user":"lavatch","rank":[1,2]}]