[{"title":"See the french Original","rating":1,"date":"9 May 2007","review":"And just to make sure you get it right, i'll repeat myself: Watch the french original! It's so much better, starting from the cast (Queen Latifah is so miscast, it hurts), straight to the story/humor (it's just not right)! <br><br>The best scene (to at least have one good comment about the title) is a scene involving Jennifer Esposito and Gisele Bündchen, which had a sort of \"tension\" to it, that was funny and sexy at the same time! Funnily (or maybe not so funny) enough, with the cast here, you'd be excused to think that it would be more often like that. But it's neither funny nor sexy ... and I'm not talking at the same time, at all! Except the one scene ... but that doesn't save the movie, which just is too long and has nothing going for it! It's a shame, because Jimmy Fallon can be funny, but here he's just annoying!","user":"kosmasp","rank":[63,84]},{"title":"Man, this movie is utter and complete load of crap","rating":1,"date":"12 March 2006","review":"Like Roger Ebert once stated about a movie, I'll use his words to state this one: (This movie)isn't even the bottom of the barrel, it doesn't even scrape the bottom of barrel. It doesn't even deserve to be mentioned in the same sentence as barrels. When you have a movie where Queen Latifah is the most experienced actor in the film, you know you are in trouble.The debut appearances of Giselle and Jimmy were awful. They did not get into character and made no connection between the the audience and the movie. It surprised me that such amateur actors in the movie business (jimmy is quite good in Saturday night live) were given such large roles. Also, the whole plot was ludicrous. Brazilian supermodels robbing a bank? In New York? Yeah, right. BS. Still wanna watch this movie? Watch it at your own risk!","user":"boyfrombrazil89","rank":[28,36]},{"title":"Weak remake of 3 classics","rating":3,"date":"11 October 2004","review":"This is the American version of the French Taxi films and it suffers in comparison.<br><br>I'm not kidding when I say that this a remake of the three French films since although the film is mainly a poor remake of the the first film, it lifts sequences from the second and third films. <br><br>Its a mess, a real mess. I'm a huge huge fan of the French films, and for me there was no real point in my seeing this since anything that worked came from the originals. <br><br>Why did they bother? They changed the sex of the lead (though the Queen is excellent), combined others and rewrote the cops mother to the point of stupidness. They lost any sense of timing and connection...they should have started from the ground up.<br><br>Its not the painfully awful film that some reviews made it out to be, but it is a waste of time. If you can find the originals and watch those. That should take you the better part of 5 hours and in the end you will not feel as though you've wasted your life.<br><br>3 out of 10.","user":"dbborroughs","rank":[103,149]}]