[{"title":"Deep, with a contemporary resonance","rating":8,"date":"8 January 2017","review":"This splendid use of the BBC's Play for Today slot, finally released on DVD, still stands as a classic. Certainly, as one reviewer has pointed out, the pace is slower and more reflective than a modern film would be, in accordance with the style of the day.<br><br>Stephen is on the cusp of adulthood in the idyllic English village of Pinvin, blessed with absolute and martial certainty about the world and his role in it. His public (i.e. private and posh, in the English system) school has given him a classical and religious education and a role in the Combined Cadet Force, a British youth organisation based in schools conducting military training as an out-of-hours activity, sponsored by the Minstry of Defence. It is usually seen as a precursor to the Officers' Training Corp in universities, and then the army. His favourite piece of music is Elgar's 'Dream of Gerontius', a major choral work which follows a dying man's journey through his death to his judgment. He is appalled at the arguments of Arne, a left-wing writer who lives in the village. His traditional views mark him out from his schoolmates, teachers and parents.<br><br>In the UK at the time (1974), politics were very polarised between left and right - at the time of broadcast, a modernising, business-oriented Conservative Prime Minister (who had taken the UK into the European Union), had just been brought down by industrial chaos induced by a series of strikes. Stephen's traditional politics, which had been dominant a decade earlier, were fast seeming irrelevant in the modern world.<br><br>Stephen is rooted in place; Elgar is not only the quintessential English composer, but also strongly associated with the city of Worcester and the nearby Malvern Hills, where Stephen lives. Stephen ticks off a signwriter who has spelt 'Pinvin' incorrectly, horrified by the error.<br><br>But this seemingly minor event causes Stephen's world to unravel. The name 'Pinvin' is derived from 'Penda's Fen', Penda being the last pagan king of the Anglo-Saxon kingdom of Mercia (which contained the Malverns). Like Gerontius, Stephen's journey includes encounters with angels and demons, and indeed Elgar himself - who turns out to be a lonely outsider too. One by one, Stephen's religious, political, artistic, familial and sexual convictions are unpicked, as he mistranslates the Greek maxim \"know thyself\" as \"discover thyself\" - a much more dynamic understanding of the aphorism.<br><br>At the close, Stephen confronts the conflicting forces, alternative histories and complex power relations of England at the time, and a final encounter with King Penda himself hints at dark times ahead. The world cannot be grasped from a simplistic point of view. Stephen's final lesson, perhaps even more relevant now than in 1974, is that conviction is hardly an appropriate tool for understanding the multiple identities that resonate within oneself and one's community.","user":"kmoh-1","rank":[15,15]},{"title":"Stunning and accomplished TV play that they just done make any more with a beautiful restoration.","rating":8,"date":"7 August 2016","review":"Made for the BBC 'Play for Today' series in 1974 and written by visionary David Rudkin, this is a film that still manages to have a massive impact even after the passing of so many years. It is about Stephen Franklin who is the son of a rather profound Reverend. He is about to turn eighteen and is going through a rites of passage crisis. This is both spiritual and sexual.<br><br>He is unintentionally spurred on by the left wing views of a Socialist writer who is now living in the small rural village and he is smitten with the music of Elgar. The film tracks his spiral towards finding who he really is, his nature as opposed to his nurtured self. His posh school is the sort that has Greek and Latin mottos everywhere, one such being 'discover thyself' but his discoveries lead him to be seen as 'not one of the team. <br><br>The film is replete with imagery and ghosts or dreams of the past which reflects the journey that Stephen is going on but also helps to expand the stories behind the story and is often done in an iconic fashion. It is also beautifully framed and shot and the musical score helps to elucidate more meaning from seemingly simplistic imagery. This is one of those films that will make you think and is the sort that will give you more on subsequent viewings. I am already wanting to see it again as there is so much here to drink in with both your eyes and mind that I a bound to have missed some on my first viewing. Absolutely recommended to anyone interested in this time in TV development or those who love a stunningly well made, written and directed film.","user":"t-dooley-69-386916","rank":[12,13]},{"title":"Engaging coming-of-age tale","rating":7,"date":"21 March 2017","review":"Very formal in its presentation of religion and politics, from the school system on up, but still manages to interject new (and far older) ideas in counterpoint to the period and setting. What at first came across as something that might be strict and stodgy turned into an engaging coming-of-age tale in the form an older teenager, on the verge of manhood, who is troubled by questions of spirituality and god, while at the same time coming to terms with his own sexuality, and how all of this affects his understanding of his place in society.<br><br>The story is helped along with phantasmagorical imagery, both dark and light, by way of the young man's dreams and imagination. But ultimately these become set pieces in the greater story and its resolution. Pretty bold fare, I would think, for what was then a 1974 TV movie originally airing on British television.<br><br>If you can get past (I did) the guiding formality of time and place and its deeply religious nature, it's an interesting and at times intense exploration.","user":"Mike_Olson","rank":[6,6]}]