[{"title":"A Powerful and Risky Story to Tell","rating":10,"date":"10 November 2003","review":"Since this movie was based on a true story of a woman who had two children and was not very well-off, it was just scary as to how real it really was! The acting is what gave the movie that push to greatness.<br><br>Diane Keaton portrayed the main character, Patsy McCartle who had two sons whom she adored.  Her performance is what made the real life story come to life on a television screen.  It was very hard to watch some of the scenes since they were so real as to what happens when one becomes addicted to drugs.<br><br>Just watching this very loving mother go from sweet to not caring at all was hard, but so true.  I have known people who have gone through withdrawl and it was very much like what happened in this movie, from what I remember.<br><br>\nI also thought that it was very risky for the director to want to make a movie out of what happened to this woman.  Yet it was done so well.  I applaud the director for making this movie.<br><br>I highly recommend this to anyone who has known someone who has ever been addicted to drugs or to just learn what can happen to you if you do become addicted to them.","user":"theatre81","rank":[21,27]},{"title":"True and sad and well done.","rating":23,"date":"23 February 2004","review":"It was very well done, all around.  Keaton gives a stirring performance. And yes, a risky performance that ultimately pays off. It was very well directed.  I would highly recommend this film to anyone interested in the serious subject of drug addiction.  There's alot of lessons here to be had. As well as a lot of truth.","user":"BlueJulia21877","rank":[17,22]},{"title":"Movie to Watch","rating":8,"date":"24 July 2005","review":"I got to see the movie \" On Thin Ice\" on the television in India.. I must say the movie was really well done, and really sent a chill down my spine.. the basic story makes me ponder what makes certain addicts decide to move on where as others still remain addicted...<br><br>however, I felt that Diane Keaton was at her best... the scene where she has cravings, and begins rummaging her home for cocaine... was the best... the two boys are good, and Lynda Boyd also showed what a good actress she is....The script is well done as is the cinematography and direction.. and casting<br><br>A must must watch movie..... for everyone","user":"deepthy-shekhar","rank":[16,21]}]