[{"title":"An engaging and thought provoking drama","rating":6,"date":"6 April 2017","review":"This film tells the story of a middle class family in the a United States of America in the sixties, when there were political turmoil and social unrests. A teenage girl turns radical, leaving behind a trail of destruction and regret.<br><br>I often have not liked films that are directed by actors or actresses. Hence, I have not expected \"American Pastoral\" to be so engaging. The interpersonal dynamics in the film are closing and convincing. I five myself trying to interpret how and why the girl turns out the way she dies. It is also a great plot point that the psychiatrist does know her stuff, and sees what is happening before other people figure it out. The contrasts between the reactions of the father and the mother after the tragedy, and also the contrasts between the speed of the subsequent recovery are astounding. I think this film is an engaging and thought provoking drama. I enjoyed it.","user":"Gordon-11","rank":[28,32]},{"title":"Very dark, very real, very tragic, very powerful story","rating":8,"date":"23 February 2017","review":"I guess I liked this movie more than most, based on the ratings. I think it may have been a bit too real, too tragic, too literal for most. Very well written, of course, being based on such a classic novel. Really great performances. Mcgregor, Connelly, Riegert, Fanning, and the always great Strathairn. Great direction, gorgeous production, editing, and sound. This was a very tight production. It was completely believable, in it's Shakespearean level of tragedy. <br><br>The story follows Seymour \"Swede\" Levov (Ewan McGregor), the pride of the Jewish-American community in Newark (which nicknamed him \"Swede\" because of his Nordic good looks). By the looks of it the Swede seemed to have it all! He was a star high school athlete (really, a hero and a legend in his hometown), he married the catholic Dawn (Jennifer Connelly), a beauty queen, he took over his father's thriving glove business), he had a house with a nice spread, he and his wife had a loving, beautiful daughter to care for. What could go wrong? Everything. <br><br>At the 45th high school reunion of Swede's younger brother, Jerry retells Swede's story to an old classmate, Nathan Zuckerman (David Strathairn), a journalist who was overseas during the 1960s. He tells him how Swede's life became difficult after high school - and went downhill from there. Swede had to struggle to get his very traditional father (Peter Riegert) to accept the Catholicism of his wife, Dawn, he struggled to keep his business viable in the face of declining customer demand (and being at the epicenter of the 1967 Newark race riots), and he struggled mightily with his daughter, Merry, who dealt with a bad stutter, which clearly affected her confidence and self-esteem (besides the \"problem\" of having such a beautiful mother, as pointed out by Merry's psychologist, Sheila (Molly Parker). But Merry's problems (and her parents' problems with Merry) had just begun. As she grew up, Merry became disillusioned with the world which she saw on TV as seemingly coming apart. She strongly sympathized with the Civil Rights Movement (especially its more radical elements) and the Vietnam anti-war movement (especially its more radical elements as well). She went from spewing hatred at President Johnson's image on the family's TV set to regularly taking the train into New York to commiserate with like-minded radicals. She rudely rebelled against all authority figures (including her own loving parents) and started talking openly about the need for a revolution in the U.S. <br><br>One day, a local post office exploded, killing one man, and Merry disappeared. Her anguished parents insisted that Merry couldn't have done such a thing unless she was brainwashed and forced by others. The first half of the film is exceptionally well done and captures the essence of why the second half feels like a total loss of everything Swede thought he had. <br><br>It is refreshing to see the film explore the relationship between father and daughter. The Rita Cohen (Valorie Curry) character, was a bit bizarre, as a shrink. Swede's determination and unconditional love for his daughter was true to life, and it was quite depressing to see what those admirable qualities did to his previously promising life. As a director McGregor captures the era, the times, the setting, and the difficulties of raising a child. <br><br>This is a very somber film. It could have been better. But, it made some good points. It made me very grateful that I decided not to have children. Most just assume peaches and cream. Not so this time around!","user":"latinfineart","rank":[19,23]},{"title":"the end of idealism","rating":6,"date":"20 October 2016","review":"Greetings again from the darkness. Tackling one of the great American novels is a difficult challenge for even the most seasoned film directors  and a dubious undertaking (at best) for a first-timer. Philip Roth won a Pulitzer Prize for his 1997 novel \"American Pastoral\", and there have been rumblings of a Hollywood production for more than a decade. It's somewhat surprising that the screen version is directed by first time director Ewan McGregor  with the Scottish actor also taking on the lead role of local Jersey boy and sports hero Seymour \"Swede\" Levov.<br><br>The story examines the cracks behind the façade of a seemingly perfect family  the sports hero marrying the beauty queen. Of course, there is always more going on within a family than most care to admit (at least that was the case in the days prior to Facebook). There's an early scene where Swede has introduced Dawn (Jennifer Connelly) to his father (Peter Riegert), and the philosophical and religious differences perfectly capture the changing times and mores from one generation to the next. Never has this been more true than the late 1960's and early 1970's  political and social upheaval were daily occurrences – and sometimes quite violent.<br><br>The first half of the movie is exceptionally well done and captures the essence of why the second half feels like a total decimation of everything Swede thought he had. He and Dawn's daughter Merry is beautiful and feisty and stutters  something that only enhances the anger she expresses and anguish she causes for her parents. Her innocent questions as a young child evolve into radical political beliefs and affiliations as she grows up.<br><br>Merry (ironically named) is by far the most interesting character in the story, but with the focus on Swede, Dakota Fanning only has brief moments that are worthy of her talent, and Dawn has only a few emotional moments that allow Ms. Connelly to flash the acting depth she hasn't shown in years. So much time and attention is devoted to Swede that the second half is a bit of a letdown and leaves too many details and questions unanswered.<br><br>John Romano's (The Lincoln Lawyer) adaptation of the American classic took a different direction than we might have preferred, but it's a thankless job since so many have considered this as unfilmable. McGregor shows a good eye as a director, though it's obvious this material needed a more experienced filmmaker at the helm. The great Alexandre Desplat provides a classy score  the piano pieces are especially well suited. Supporting work is solid from David Strathairn as narrator Nathan Zuckerman, Rupert Evans as Swede's brother, Molly Parker as Merry's therapist, Uzo Aduba as Swede's employee, and Valorie Curry as a misguided revolutionary. It's a reminder that family dynamics may be the most complex organism, and when blended with the volatile times of the Vietnam War, a generational gap should be expected  even if it's difficult and emotional to accept.","user":"ferguson-6","rank":[55,76]}]