[{"title":"Best example of \"See the Director's Cut\"","rating":9,"date":"2 August 2012","review":"Many of the reviews above I agree with, but I also saw the theatrical version and was very disappointed (6 out of 10). When the Director's Cut came out it was 45 minutes longer, so you fear the worst, MORE of the same. In this case, the story line is filled out and the motivations and characters are fleshed out. Eva Green went from, \"why is she in this movie\" with virtually no screen time and less dialog to a major character who moves the plot, as you would hope given her billing. The opening scenes in France are greatly expanded and meaningful. The action scenes are better, but not substantially. The Director's cut should have been the official version of the movie, the theatrical cut is a poor excuse.","user":"Pete-235","rank":[130,136]},{"title":"Great","rating":10,"date":"4 February 2020","review":"A exceedingly good film, it was true, dramatic, and amazing. the cast was perfect in their roles, espically Edward Norton. This movie had an amazing plot, characters, and historical accuracy. On the bonus the action was awesome too, Kingdom of Heaven is a must see.","user":"MR_Heraclius","rank":[44,46]},{"title":"Some history...","rating":15,"date":"15 May 2005","review":"Kingdom of Heaven is an entertaining and spectacular film, to say the least. However, being an enthusiast of the history of the crusader states, I would like to mention some historical facts and accuracies that generated the film.<br><br>For a start, all the main characters of the film are historical figures, from Balian to the unfortunate Baldwin IV (oftenly referred as \"Baldwin the Leper\"). However, the only connection of Balian and Sybilla was that he indeed helped her defend Jerusalem and negotiated its subsequent surrender to Saladin. However, he was not only a political opponent of her husband (Guy de Lusignan), but also of HERS.<br><br>You see, Sibylla actually loved Guy enough as to fight to make him a king, even if the barons of the kingdom were against him. She actually tricked them: She agree to divorced him before her coronation, with the only term to choose herself her new husband. When the barons accepted, she just chose to remarry Guy and established him in the throne of Jerusalem. Balian was married with her stepmother, mother of her half sister Isabella (completely ignored in the film). He conspired with Maria to have another noble, Conrad of Montferrat, marry Isabella, giving Conrad a stronger claim to the kingdom.<br><br>Sibylla actually succeeded her son from a previous marriage (Baldwin V), not her brother, as the film suggests. He was a child-king that succeeded his leper uncle but lived only for one year. Indeed Guy was captured in the Battle of Hattin. When Saladin was besieging the Holy City (and Sybilla personally led the defense) and she was permitted to escape to Tripoli with her daughters. However she died of an epidemic 3 years later in Tyre, the only city in the kingdom that did not fall. Her daughters also died of the same epidemic, and Guy (by now released) lost the kingdom of Jerusalem and was compensated with the Lordship of Cyprus by Richard the Lionheart.<br><br>Balian died 3 years later. He NEVER retired from the politics of the kingdom as the film suggests.","user":"pmitsi","rank":[91,106]}]