[{"title":"A good concept but a mediocre flick----5/10","rating":5,"date":"13 March 2005","review":"I have always been a Robin Williams fan. From watching him goof around in Mrs. Doubtfire when i was a kid to seeing him actually creep me out in One Hour Photo, probably his best movie to date. So i am willing to see anything he has to offer. I got a chance to see The Final Cut for free, so i took it. The plot seemed real interesting and it was a first. Later into the movie though, the plot was getting cut more than people's memories. Williams romance with Mira Sorvino (which was gag-worthy to begin with) doesn't have any closure, and the \"cutting\" procedure and the whole \"chip in the brain\" thing didn't seem too thought out. Robin Williams is good as always and he tries his best to keep you interested, and the opening of the movie was promising. I even think with a little work that director Omar Naim can make some really quality flicks. This one, however, seems like it was cut together from a better movie. Which is a shame because it was a really cool idea. 5/10","user":"Sfpsycho415","rank":[67,84]},{"title":"A lot of unfulfilled promise, but still worth watching","rating":7,"date":"25 April 2005","review":"Set during an unspecified future era, or perhaps an \"alternate universe\" present era, The Final Cut posits a world in which \"first person viewpoint\" computer chip implants are possible for those who can afford it. These record a person's entire life from a first person viewpoint--the \"camera\" sees what the person sees, hears what they hear. The intention is to have an accurate, documentary-like record after the person dies. These are presented as films at their funerals. Citizens known as \"cutters\" (just a slang for a film editor) pare down one's life to a feature length presentation. There are also those who protest the implants. The Final Cut is the story of the latter days of a cutter, Alan W. Hakman (Robin Williams).<br><br>While The Final Cut is enjoyable enough, it has tremendous squandered potential. As one would expect, Williams turns in an incredible performance, but the script, by writer/director Omar Naim, could have used a lot of work.<br><br>The premise is fabulous. It opens many philosophical and psychological cans of worms. Some are dealt with, but only cursorily. Surely cutters go through a lot of emotional trauma as they vicariously experience the lows and the mundanities of other person's lives. Naim shows us this briefly with a recording of someone who was an abuser. But as soon as he shows us this material, he drops it. The film is advertised as a thriller. How much more exciting would it have been to embed Hakman in the middle of some grand, suspenseful plot, the details of which became known to him through data from an implant? As one of the opponents of the implant technology remarks, the implants have changed the way people relate to each other. That is a good point--it would have a profound impact on that. So why aren't we shown instances of this in the film? This could have been another hinge for a very intriguing, tense plot.<br><br>There are also issues of invasion of privacy, surveillance paranoia, consent (the implants are shown being put into infants and being permanent), and \"misuse\" of the data. Most of these are barely touched. Often they're only broached with a single comment, or a protester's sign.<br><br>Other fascinating issues brought up by the idea of the technology are not even mentioned. Surely, such technology would prove to be invaluable as evidence in crimes. And surely many people, especially victims, would voluntarily offer a \"tap\" into their implants so they can be witnesses. Why not comment on these kinds of possibilities? The Final Cut is also oddly understated with such a far-reaching sci-fi premise in this era of rubber reality films. A number of plot points, such as the one involving Louis Hunt, have almost disappointingly mundane resolutions. For that matter, for a sci-fi film set in the future or an alternate reality, there isn't much that is different about the world except for the implants. Probably the lack of differences was due to budget. It costs a lot of money to build alternate realities.<br><br>This might sound far too negative for the film to warrant a 7 out of 10 from me, which is equivalent to a \"C\" letter grade. Much of the film is saved by the performances. In combination with direction that is more often than not interesting and unusual, it's easy to focus on the promise of the premise rather than the unfulfilled extensions of the same.<br><br>Hakman, and presumably the other cutters, have odd dispositions. Their task is to make everyone look good--like a mortician making up a mangled body so it's \"presentable\" at a funeral. They spend hour upon hour as voyeurs. They are something like archivists, but also have to play detective. It makes them strangely aloof and dour. It's difficult for them to have relationships. Naim gets in a couple cracks that portray the cutters and their social relationships as similar to geeky \"Internet addicts\". This is all good stuff, and it's excellently played by Williams.<br><br>The flow of the film is a bit odd, and especially the ending (which I praised for its relative nihilism) is eventually abrupt in a way that doesn't exactly work (and I usually love abrupt endings). Being generous, we could take the wonky flow as a \"level-removed\" kind of self-reference. Of course Naim was faced with cutting the film to make it look good, but it's a bit awkward and arbitrary-feeling, just as a cutter's work would likely be when faced with having to produce a coherent 90-minute film out of 80 years' worth of material. Being less generous, Naim simply needs to learn how to better tell a story, and there was no intention of real-world reflexivity with his fictional material.<br><br>The Final Cut is worth seeing, especially if you're a Robin Williams fan as I am, but it's a disappointment considering what it could have been.","user":"BrandtSponseller","rank":[86,114]},{"title":"Great Idea, Great Story","rating":20,"date":"20 September 2006","review":"I tend to like watching sci-fi movies even though most are really bad. What a wonderful surprise it was to come across this movie. The movie is well written with believable characters, dialog and plot. The concept alone is fantastic and the story does a wonderful job of exploring the many implications and aspects of it - both at a social and personal level. Although the movie seems like it might be slow-paced, it opens with a zinger and eventually ends up giving us surprise after surprise. In conjunction with a lot of intellectual intrigue, there is a lot of strong emotion that goes along with many of the scenes.<br><br>It isn't perfect - there are some arguable problems with aspects of the story and characters, but for what one gets, I'm willing to focus on the positive here. Definitely worth checking out.","user":"Vic_max","rank":[16,19]}]