[{"title":"Very good movie, quiet scary.","rating":8,"date":"30 December 2011","review":"Okay, this is a scary film actually worth watching.<br><br>I've seen quiet a lot of vampire/zombie movies, and this one stands out to me, because even though it sometimes uses a bit of gore, that's not what makes it scary.<br><br>It's the tension. You just don't know what is going to happen next, the atmosphere is very creepy and the movie just gets through to you, like you can almost feel the Alaskan cold. Most scary movies I see end really badly, this one sort of did as well, but with a bit of romance.<br><br>The thing that scared me the most about it is the vampires, I mean, you wont want one of them coming into your room at night.<br><br>Overall, very good and worth watching..<br><br>8/10","user":"DaRetroChick","rank":[22,27]},{"title":"Best Vampire Movie in Over a Decade","rating":8,"date":"23 October 2007","review":"As night begins to fall for a thirty day spell over a small Alaskan outpost village, a motley crew of vampires comes waltzing in for a feast in David Slade's adaptation of the graphic novel, \"30 Days of Night.\" Ever since \"Interview with the Vampire\" vampires have been depicted in films as something hip, cool, and sexy. Recently the idea of becoming a vampire is like making a fashion statement or becoming a Scientologist. In \"30 Days of Night\" the vampires are nameless, cunning, animal-like bloodsuckers and far from mindless zombies (which have been more popular of late). Finally, vampires are restored to film as monsters to be feared and not as some sympathetic and alluring subculture.<br><br>The film grabs you from its opening shot of a man walking through a desolate snow covered landscape away from an ominous boat docked in the ice and never lets go. Director Slade wisely avoids many of the seizure-inducing trappings of recent horror films. Sure, there are the prerequisite quick-cuts in the intimate scenes of carnage, but there are also haunting wide-angled shots and one expertly staged bird's-eye-view crane shot when the vampires first begin dragging people out of their houses into the street. While successfully adapting some of the great imagery from the graphic novel, Slade is fully aware that this is still a film and shies away from CGI and overly-stylized lighting and effects that would detract from the sense of realism necessary in a far-fetched horror film such as this.<br><br>Slade also makes good use of his cast. Danny Huston is perfectly creepy as the vampires' leader. Josh Hartnett, who is typically miscast and emotionless, actually fits well the role of a wooden Sheriff of a remote Alaskan town. Ben Foster, who always overacts, is used effectively here in a bit role as an over-the-top Reinfield-like character who ushers the vampires' arrival in town. Melissa George is pretty and sympathetic as Hartnett's estranged wife. Like many serious horror films of recent memory (\"Dawn of the Dead\" or \"The Descent\") the film attempts some character development that is often \"emo\" but never overplays its hand.<br><br>Aside from being better directed and better acted than your run-of-the-mill horror flick, \"30 Days of Night\" is also fantastically gory. Decaptation aficionados will especially rejoice. Refreshing, too, is the way it takes its gore and action dead seriously. There are no silly one-liners or graphic sight gags. The characters are deeply affected by what they witness and what they have to do to survive. This is pure horror, and it's relentless.<br><br>Yes, there are some missteps with the film's pacing and some huge leaps of logic in the amount of time that passes between events. However, for the shear originality of its central conceit, the intensity of the gore, and the haunting quality of many of its signature shots, David Slade's \"30 Days of Night\" is the most exhilarating horror film since Danny Boyle's original \"28 Days Later\" and the best vampire film since Francis Ford Coppola delivered \"Bram Stoker's Dracula\" back in 1992.","user":"WriterDave","rank":[264,404]},{"title":"One of the most effective horror movies I've seen in a long time","rating":9,"date":"27 October 2007","review":"\"30 Days of Night\" is easily one of the best horror movies I've seen in a very long time mostly because everyone involved seemed to know exactly what it takes to make a decent horror movie. It's not obscene amounts of gore or monsters jumping out at the camera that make a movie scary. It's creepy atmosphere that makes a movie particularly scary, and this movie does a great job at creating the kind of atmosphere that fills the viewer with the kind of dread that so many movies fail to achieve. It's not perfect, but it's still better than just about every horror movie I've seen since \"The Descent\" (which also relied on a creepy atmosphere to fill the viewer with a sense of dread and hopelessness).<br><br>This movie is set in the small town of Barrow, Alaska, the northernmost town in the U.S. Because it is so far up north, there comes a time every winter where the sun doesn't rise for 30 days. The fact that this translates into a month without sunlight attracts a group of vampires who attack the town and spend the month feeding on its citizens. Eventually only a handful of humans remain in town, and they must survive the month without starving, freezing, or being killed by the vampires. It's a fairly simple concept, yet the director makes it work incredibly well. There is a sense of dread and hopelessness that permeates this entire film. Barrow is a town that appears to be cut off from the rest of the world. It seems to be surrounded by a sea of white on all sides, and the citizens seem to be stuck in a state of depression. Barrow seems to be the worst place in the world to be, and that's before the sun sets and the vampires show up. When the vampires do make themselves known, that sense of isolation and hopelessness turns into a feeling of dread that doesn't go away. One really gets the sense that there is no escape for the small group of survivors. This feeling is made all the more real by the long periods between the vampire attacks. Normally I consider long periods where not much happens a bad thing, but here it works in the film's favor. We may not always see the vampires, but their presence is always felt. At any given time in the movie one can see blood splattered onto snow and hear the distant screams and occasional gunfire of yet another one of Barrow's citizens getting killed, and it's easy to get the feeling that any of the main characters could be the next to die. The vampires themselves are also unlike any we've seen in movies for some time. They aren't the kind of seductive and charming vampires that seem to show up in every other horror movie. These vampires are feral, ruthless, and sadistic, with sharp crocodile-like teeth and bloodstained clothes. There's nothing romantic about them or their actions; they just want to kill people and drink their blood. It helps that they get far less screen time than the human characters; normally we only see them as shadows in the background stalking their prey. When they do attack, it's incredibly vicious and horrifyingly violent (the first large-scale attack on the town is a particular highlight of this film). This viciousness adds to the hopelessness and vulnerability of the humans while making the vampires seem like some of the scariest movie monsters to come along in a while.<br><br>If I can find any fault in this movie, it's that the ending seems a bit contrived and cliché. It doesn't take too much away from the movie though; to complain about it is really nitpicking more than anything. Overall it's one of the best horror movies I've seen in a long time, and easily the best vampire movie to come along in years. I would definitely recommend it, especially since it's a good alternative to the endless \"torture porn\" we've been seeing from this genre for the last few years.","user":"TJ1380","rank":[187,286]}]