[{"title":"The Price We Pay","rating":10,"date":"12 December 2005","review":"\"Syriana\" is a blistering, powerful film about the degree to which governments and corporate conglomerates place the ambition to control the world's oil supply above the well being of their citizens and employees. In this game, there are only bad guys, and what separates the villains from the protagonists is not a question of who's good and who's bad, but rather how bad each is willing to be.<br><br>So maybe \"Syriana\" doesn't tell us anything new. But that doesn't mean its points aren't worth making again and again. And though it is complicated, and I'm not going to pretend I followed every detail of its intricate plot, it's not *that* hard to follow. Stephen Gaghan is a good writer, and he provides a nice summary of the film's action in its final moments.<br><br>What emerges from this tangled puzzle is a web of corruption and self-interest, all fueled by the need for oil. In one plot thread, the men behind two soon-to-merge oil companies will stop at nothing to make the merger go through, since the new company will be one of the most powerful in the world. In another thread, the law firm representing the company proves that it's eager to cash in on the company's new economic success. Meanwhile, a power struggle between the two sons of an aging king in an unspecified Middle Eastern country (though Saudi Arabia is obviously suggested) has attracted the attention of the American government, operating through the CIA. America (read American business) has a vested interest in which of the king's sons succeeds him to the throne: It doesn't want the reform-minded eldest son, whose priorities will be building a country to benefit his own people; it wants instead the younger son, who will continue to relegate his country to a cosy spot in America's hip pocket and take its orders directly from the president of the USA. And in the film's most chilling plot strand, we see how the struggle for oil feeds the radical Islam movement in the Middle East, providing young men with a feeling of brotherhood and righteousness in the face of a region they feel has turned its back on them in favor of big business and Western corruption.<br><br>\"Syriana\" is tense, fast and furious. Following it can admittedly be somewhat exhausting, but if you pay very close attention to the first hour or so, as each story is introduced and the relationships between characters become clear, the second half of the movie is easier to digest.<br><br>I disagree with other comments here that the characters aren't developed or that the acting is unimpressive. On the contrary, I think all of the actors create extremely nuanced, compelling characters, a challenging task given the fact that none of them are allowed more than a minute or so at a time to feed us information about themselves. A movie like this could easily fall prey to filling itself with a bunch of stock villains, all cocked eyebrows and facial mannerisms rather than full-bodied characterizations, and the fact that it avoids this is a tribute to both Gaghan and the cast. And hats off to the editor on this movie, who had perhaps the most daunting task of the year.<br><br>2005 has been full of terse, important films, fresh in their immediacy. There have been a small number of sensational, tough, thought-provoking films instead of a larger batch of more mediocre ones, as has been the case recently. \"Syriana\" is one of the best movies of the year: it's angry, yet it's not hopeless. I hope Americans see this movie. At this time of year, when people are trampling each other in malls in order to be first in line for Christmas sales, I hope they remember that the vast wealth of America frequently comes at the sake of people all over the world who will never have a fraction of the comfort those in our country take for granted.<br><br>Grade: A","user":"evanston_dad","rank":[672,841]},{"title":"A thesis on the culture of corruption","rating":10,"date":"29 December 2005","review":"Stephen Gaghan penned Traffic, which was the best film of 2000. Now with Syriana, he has developed a companion piece, with the oil industry as the backdrop rather than the drug trade. The irony of this is that the films show that both industries are corrupt to the core, but only one is legal.<br><br>In fact, by the evidence of these two films, one could argue that the drug trade is the less sleazy of the two because it does not exist with the facade of legitimacy that surrounds the oil industry. If I was to make a list of the 10 best films of the decade so far, these would both be there.<br><br>It is tough, if not impossible and perhaps even foolish to try and apply one thesis to this film, but for me, it is that what we as civilians call corruption is simply the culture of the oil business, one supported and nurtured by government, business, traders and lawyers. No-one knows why it exists, but it does, and if you cannot wade in it, you are out of the game.<br><br>Syriana does not have a plot or a storyline, but it throws character and story and information at you by the bucketful. There is no warm up time. Gaghan goes out of his way to show that the people involved in this business are surrounded by a normal world with normal hopes and dreams. This is evident from the opening shot. A title card tells us we are in Tehran, but not a some stereotypical open market selling figs. It is a hip hop club.<br><br>The main story of the film involves a possibly corrupt merger of two major American oil firms. From there, everything else fans out. THe story of Jeffrey Wright, the government official investigating the merger, George Clooney, the CIA operative with missions with no apparent goal, the Arab Emir from an unnamed oil producing country, and his two sons each wanting to take over his reign, the industry analyst (Matt Damon) who will use any situation to advance his firm, and the young, broke angry Arab youth who look for meaning in life and find it in the most dangerous way.<br><br>Syriana is not a left wing movie, it is surprising a-political. It is not anti-American, but it most certainly lays blame on the US and the west for putting oil ahead of all other priorities. It is not sympathetic to terror, but its most compelling plot line tell us how a terrorist can be made from a bad combination of hopelessness, unemployment, anger and poverty.<br><br>If you are looking for a neat and tidy ending, you will be frustrated. The film ends like a truck running into a brick wall, with all but one or two plots left hanging. It does not answer any questions because I believe that Gaghan is trying to show that no-one is really in charge and that no-one really knows what is going on.<br><br>The acting is near perfect from everyone in the cast, including a small, two scene brilliant cameo by William Hurt and Oscar worthy work from Clooney and Alexander Siddig as the frustrated Arab prince.<br><br>This is an important film and it is not to be missed. **** out of ****.","user":"DanB-4","rank":[332,442]},{"title":"A political slap in the face reality check","rating":10,"date":"14 December 2005","review":"I walked out of this movie feeling pretty depressed. As a historian, I always knew there have been forces at work in our society that act against the best interest of the average citizen. This film does an excellent job of illustrating just how politics and big business conspire to preserve the status quo which also protects their power and profits. The global interaction depicted in this film shows how all actions have consequences. The thirst our nation has for oil drives the kind of political and business policies that cause anger and hatred towards our nation. This oil addiction has led to an unjust war that was started on lies and disinformation. The result has been the deaths of over 2000 US servicemen and women, thousands more injured and tens of thousands Iraqi dead and wounded. This act has been the best tool Islamic terrorist groups have ever had in attracting followers and money to their cause. Those that attack this film obviously buy into the fantasy that America is involved in Iraq and the Middle East due to our sincere desire to spread \"democracy.\" Anyone who is willing to have an open mind will find this film to be chilling for the implications of the storyline. This film is a must see for those who care about how the behavior of our government and big business impacts us in our everyday lives and how it will contribute to further terrorist attacks for decades to come. A well researched story with excellent actors for the numerous roles. I will buy this as soon as it comes out on DVD.","user":"nolarobert","rank":[585,827]}]