[{"title":"A Wonderful Film Not Just about Vermeer, but Artistic Motivation","rating":8,"date":"17 May 2004","review":"Johannes Vermeer was a silent man. Being equipped with immense talent, brush and palette, there really was no need for words. Such philosophy is greatly dwelt upon in Peter Webber's adaptation of Tracy Chevalier's novel. <br><br>The film is breathtaking alone in the fact that the production team, led by cinematographer Eduardo Serra, production designer Ben Van Os, and art director Christina Shaeffer, manages to capture Vermeer's filling, oil-based colors, and light into every scene. <br><br>The story is exemplary as well. We are taken into a brief era in Vermeer's life in 17th century Delft. Much of the film's premise is true: Vermeer was a reticent and brilliant painter who attempted to balance his genius and deep-rooted, innate calling to art and solitude with the often overbearing demands of a bourgeoisie, Venetian society, as well as the malignant pressures posted by a sadistic commissioner, and the pressures of being the head of a massive household (when he died in 1675, he left behind his wife and 11 children). <br><br>In 1665, however, he painted a mysterious masterpiece. It's mysterious because much scholarship has since been dedicated to uncovering the identity of the model who posed for it. It has been suggested that the subject is one of his daughters, although this theory is met today with much skepticism. And this is where the film spends most of its fictional focus: that of creating an imaginary story to help speculate on what we know as factual about Vermeer's life. Enter a young, beautiful servant girl, Grit (Scarlett Johansson), who through no fault of her own, finds that her classic beauty attracts Vermeer's sensibilities-as a man and as an artist-to such a degree that he has no choice but to capture her on oil and canvas.<br><br>Vermeer (Colin Firth) spends a lot of time in this film standing quietly in the shadows and peeking around corners. There's great symbolism in many of these shots-his body is often half-covered, half-exposed, representing the dichotomy he must have felt in his life-that of being in perpetual conflict with his spiritual, artistic longings and the more human qualities of a man.<br><br>Whereas Vermeer' silence is a result of his being reluctant to communicate with the external world, mostly due to artistic self-absorption, Griet similarly is cut off from humanity, but rather out of innocence, naivety, beauty, and the unfortunate side effect of being at the low end of a rather oppressive Delft caste system where she has little voice outside of the disturbance her beauty stimulates in others. Together, the two characters find an unspoken solace, a type of kinetic energy that can only be conveyed through Vermeer's art. Indeed, one of the film's more touching moments comes when the artist reveals his portrait of her and Griet replies, 'You've seen into me.' Another memorable moment, if not altogether breathtaking, comes when Vermeer is instructing Griet in how to hold her face at the proper angle in order to catch the appropriate reflection of light on her mouth, and also when he is instructing her in how to mix his paints and their hands, for a split second, brush together. It is in such moments that Firth brilliantly conveys the tormenting dissonance present in a man not in whose base desires are overshadowing his artistic being, but rather the opposite-as a virtuoso experiencing a rare moment of temporary carnal pleasure. <br><br>All philosophy aside, is the film any good? I'd say it's extraordinary, although if you're not one to gravitate toward the biography of an artist, this may not be the film for you. However, I do believe that the human story element her is valuable, entertaining, and worthwhile.","user":"jkeats1","rank":[189,211]},{"title":"Not without flaws, but beautifully presented","rating":7,"date":"4 May 2006","review":"Young woman in Holland circa 1665, innocent and wide-eyed but hard working, leaves home for job as scullery maid to a painter named Vermeer and his family; soon, she becomes the artist's secret assistant and muse, eventually posing for Vermeer's famous title-named portrait. Stunning art direction, lively pacing and an absorbing narrative all make up for a few key performances which seem too modern, and minor instances where the editing isn't as sharp as one might hope. The maid's many entrances and exits are repetitive, but Scarlett Johansson proves to be an intuitive actress who excels in a role with very little dialogue. Quite good overall, and with a finale that smartly leaves the breathless viewer wondering...asking...wanting more. *** from ****","user":"moonspinner55","rank":[49,52]},{"title":"A cinematic homage to 17th Century Flemish painters (not just Vermeer). (minor spoilers)","rating":9,"date":"27 April 2004","review":"Girl with a Pearl Earring is based on the novel by Tracy Chevalier, who tells the story of a forbidden love affair (pardon the cliché) between painting master, Johannes Vermeer (Colin Firth), and the only woman who seemed to appreciate his work, a timid young maid named Grit (Scarlett Johansson).<br><br>Grit is hired to work in the Vermeer household. Had you not known anything about Vermeer prior to viewing the film, it seems as though he is some deformed creature the family wishes to keep secret. The family always linger near the door to Vermeer's studio, as though something dangerous was contained within. And, as the story goes along, you might get the impression that he is a nasty fellow, the way everyone approaches the studio so delicately, careful not to disturb anything. Says one maid to Grit, he doesn't like people bothering him when he is working.<br><br>In a way, Johannes is a real bastard to his wife, children, and mother-in-law. As a painter, they're never sure whether he is going to get the commissions from the arrogant, but jolly rich patron Van Ruijven (Tom Wilkinson), or whether they'll be escaping debtors by fleeing in the middle of the night.<br><br>Grit is curious, and at the same time, smitten with Johannes Vermeer, probably because of the initial mystery. She gains an interest in Vermeer, and in a way, also becomes his painting apprentice, helping him to mix paints, making creative suggestions about the paintings, and so forth. Vermeer introduces her to a rather different world that Grit has never known. And the two for a silent bond, a love for each other. Johannes appreciate's Grits company as a comfortable contrast to his mother-in-law, children, and especially his wife, he only seem to try to discourage his silly hobbies.<br><br>But, Johannes and Grit cannot act on their feelings for each other, at least not aloud. Divorce was highly out of the question, for one thing. But second, Johanne's was dependent on the arrogant Van Rijn for his commissions, and Van Rijn wanted Grit. Disgusted as Johannes may have been, and only slightly able to protect her (you'll see what I mean in the finale), he can't totally reject his financer. Plus, there is the barrier of master and maid, presenting a rigid social structure. And for Grit, she can only play out her affair with Johannes vicariously through her boyfriend, the Butcher.<br><br>Even if the story is not grounded in fact, or is based on little fact, the story of how Vermeer's painting, The Girl With a Pearl Earring came to be is one that presents a little mystery and romance to a painting. You can find something to appreciate it, beyond just consideration of the artistic elements of lighting or coloring, etc. In fact, art is always more fun with an intriguing story behind it (consider the controversy behind Whistler's 'Peacock Room').<br><br>I thought the movie did a fantastic job of recreating 17th century Netherlands. But what you may not know without having seen many 17 century painting, is that nearly every scene in the movie is constructed from 17 th century paintings, of Vermeers, Frans Halls, Van Dyke, and many others. The entire movie is, as one other viewer coined it, a \"cinematic painting,\" but not just because it is a movie about the beauty of one painting, but because it is a movie entirely constructed from paintings. It was really incredible how precise everything is. Lighting, placement of figures. The actors would have to walk around a room and then at one point, hit their points precisely (props and all) to capture that one moment reflected in the painting from which it was taken from. This is really a great film for the art direction alone.","user":"vertigo_14","rank":[105,125]}]