[{"title":"World War II from the European View","rating":8,"date":"27 March 2006","review":"Writer and Director John Duigan has added to his cinematic stature with this recent film about the interrelated responses of three countries - England, France, Spain - to the early phases of WW II and in doing so gives some inadvertent insight into how the continent was so endangered by the little known bad boy Hitler in the years leading up to the horror of a second World War.<br><br>The title seems very appropriate - taken from the quip of 'Head in the clouds, Feet on the ground' - as the lead character Gilda (a radiantly beautiful Charlize Theron) seems to float above all of the reality of warring struggles in 1933, focusing her life on paramours, expensive clothes, and 'dangerous liaisons' with a varied assortment of men, all the while keeping a firm stance on needs of her strangely disjointed life. Indeed, the opening of the film finds Gilda in need of shelter from a night's fling with a Cambridge lover and she knocks on the door of a poor struggling Irish student Guy (Stuart Townsend), thus beginning a lasting affair that coasts through the entire story.<br><br>Guy eventually follows Gilda to Paris where she is a popular photographer living with her gallerist, but also living with her lesbian lover Mia (Penelope Cruz). Gilda, Guy, and Mia become a triptych and it is only the impact of the rise of fascism in Spain (Mia's home) that separates the ménage a trois: idealistic Guy and compassionate Mia are off to fight Franco while Gilda is left behind to admit to the encroaching threat of Nazis in France and enter into her own version of involvement.<br><br>How these three weather the war and resolve their varied degrees of complicity provides the film's finale. The cast is strong, the settings are gorgeous (in all three countries) as captured by cinematographer Paul Sarossy, and the musical score by Terry Frewer introduces a potential talent for film composition (while borrowing heavily from French cabaret songs, symphonic music by Edward Elgar, and pieces of Francis Poulenc). But the overall reason for enjoying this rather long film is the interplay of Theron, Townsend and Cruz in a variety of richly sensuous vignettes. Well worth watching. Grady Harp","user":"gradyharp","rank":[52,58]},{"title":"A Major Movie - A Must See - How did I not hear of it?","rating":9,"date":"9 July 2006","review":"Given the wonderful quality of Head In The Clouds I don't know how I never heard of it until I stumbled over it on the Netflix web page and decided to rent it.<br><br>This is a major movie. It is an emotionally powerful movie. It has a huge scope both in time and space, historical accuracy, an excellent, and at times complex, script, outstanding performances by all concerned, great direction, and superb cinematography. I loved it and I cried at the end.<br><br>Charlize Theron was fantastic as Gilda. I have known people such as the character she played and she had it just right. With her body language she told us she was rich, talented, cynical, very loyal to her real friends, and in the end so very brave. Her voice is such that sometimes I think she is channeling Theresa Russell.<br><br>Stuart Townsend played his part of a quiet underclass Belfast Irishman, Guy, perfectly. Some reviewers were disappointed that his performance wasn't stronger. Hey, Rambo wouldn't have survived long as a British operative in Nazi occupied Paris. Townsend triumphs in subtlety and his character narrates some of the story.<br><br>Penelope Cruz was perfect as Mia, who had been physically injured by Fascists in Spain when they came to take her brother away, presumably to be executed given that the time immediately preceded the Spanish Civil War of the 1930's.<br><br>Thomas Kretschmann is brilliant as Frans Bietrich, the personification of Nazi evil: educated, urbane, thoughtful, and completely ruthless when torturing and murdering.<br><br>The repartee among the three friends, Gilda, Mia, and Guy, during the prewar period is very realistic. I've participated in similar conversations. There are several back referencing jokes. You have to pay attention. In addition we see the best presentation of a three way sexual relationship I've ever seen on film. These three people love each other and this is beautifully communicated.<br><br>World War II was a cataclysm that shook the world. The free peoples were fighting for the life of their civilizations against what was one of the most evil regimes to ever exist through all of history, the German Third Reich. The story starts well before WWII and we are shown the good life of a wealthy young woman and her friends in Paris. We are then taken to the Spanish Civil War and on into WWII. The things portrayed in this movie HAPPENED although maybe not exactly as in the story shown; however, similar things are well documented as occurring during WWII. If one doesn't have much knowledge of the history of that period the story may seem far fetched. It isn't. For all I know the story is factual even though there is the usual statement at the end about it all being fiction.<br><br>More about Kretschmann: Toward the end of the movie there is a scene in which his character is supervising the torture of a young woman member of the French Resistance. The torturers are using the near drowning method, waterboarding is what the CIA calls it today. He is seated with his back to his underlings and gives the order to immerse her, then plays with a loose thread on his shirt cuff while timing the immersion. He fiddles with his cuff links. He is clearly bored. Just another day at the office. When he decides she isn't going to talk he gives the order to put her under and and never orders her to be raised. I have heard it phrased: \"The banality of evil\". Kretschmann and Duigan bring it off to perfection.<br><br>This is a must see movie. It will stick with you. Parts of it will come back to haunt you for at least several days. As I said before, this is powerful stuff.","user":"bgc-4","rank":[34,40]},{"title":"Sexy and stylish!","rating":9,"date":"14 February 2005","review":"5.5?! I cannot believe some of the reviews on this movie. I really thought that \"Head in the Clouds\" was a great movie. It has accurate history, remarkable acting, very cool costumes, and a interesting story. Charlize and Stuart are in their second film together and bring so much excitement to the screen. Penelope Cruz does great as the supporting role as well. I would highly recommend this movie for a good watch. Please, do not base this movie on the rating from IMDb. I'm telling you right now, this and \"Casino\" are the ratings I'm really disagreeing with. They deserve higher, especially \"Head in the Clouds\". Give this movie a chance, you won't regret it.<br><br>9/10","user":"Smells_Like_Cheese","rank":[105,139]}]