[{"title":"An indie piece that explores daring new ways to suck","rating":2,"date":"18 August 2005","review":"One user comment asked if they'd seen the same movie as everyone else, because otherwise he couldn't account for all the positive reviews. My theory on that is that this was a labor of love for the people who slogged through $100k to get this made, and they all came on here and wrote good reviews to pump it up. There's just no other possible explanation for the overwhelming good buzz this Gigliesque movie is getting.<br><br>MASSIVE SPOILERS from here on out: <br><br>The negative reviews you read are pretty much right on. There are plot holes, pointless characters and unfinished subplots galore, and you're expected to suspend disbelief to the point where it snaps and breaks. The killer being the widow is utterly ridiculous. Her motivation supposedly is that her husband and daughter were killed working on a dam project, so she went after people involved in building the dam. In one year she goes from ordinary wife and mother to raving psychopath who not only strings up naked babes before she guts them (something middle aged women just don't do), but keeps the bodies in her parlor until they have to be held up with wire and fish hooks. The sheriff wanders in at one point and he's only a room away and yet doesn't notice any kind of stench. I had a dead mouse trapped behind my wallboard once and had to hire a guy to come in and fumigate.<br><br>I don't agree with heaping praise on this flick because the cinematography doesn't suck as bad as a typical $100k movie. So what? The technical stuff should be a given. It's not what makes a movie good to anyone other than tech-dweebs. I also don't agree with the comment someone said that nobody goes to see a horror movie expecting a decent plot or depth. I do. Without those things the gore is like watching one of those evening news magazine shows about surgery--gross, but hardly frightening. That comment actually sums up this movie pretty well. <br><br>The gore in this film is excellent, but has no punch whatsoever because it lasts too long. Over and over we see the Bloody Boy until his presence begins to elicit a sigh. At the end where he feels around in the widow's throat, yeah that was pretty nasty but then he does it for so long you start wondering if maybe he lost his wallet in there.<br><br>I watched this on DVD, recommended by a friend who now owes me her firstborn child, and I caught the last minute of director commentary because I wanted that zombie thing that tore out Bloody Boy's heart at the very end explained to me. The director declined to explain it at all, merely saying he liked that people didn't get it. Let me translate for anyone who doesn't speak arrogant artiste: \"I cannot write a coherent plot to save my life and when someone calls me on it I will pretend I find it tres amusing that they are too stupid to understand.\"","user":"Andela","rank":[67,78]},{"title":"I truly hate to say it but...rather disappointing","rating":27,"date":"27 July 2004","review":"I saw this a few days ago at the Fantasia Fest up here in Montreal. Quite a few members of the cast and crew were present, including the writer/director. The movie was made for a 'very low budget' which is why I hate to pan it but... I had heard this was a very different and utterly terrifying movie, but not much else. I love going into movies not knowing a thing about them so I was primed for this one. Now, for a low budget movie this thing looked great. The cinematography and lighting were really surprisingly good. The actors as well were mostly okay. However, this thing was not scary. For frights, the whole thing relies way too much on simple sound and music cues, the cinematic equivalent of someone sneaking up on you and yelling Boo! Some visuals were rather creepy (such as the young boy covered with blood) but were overused (that young boy is seen over and over until you start to forget that that's supposed to be blood all over him). The main problem with the film, however, is the script. It goes all over the place, introducing characters here and there and sending others on too-long treks which lead to very little. NOW, I'M GOING INTO SPOILERS HER SO STOP IF YOU CARE. For example, the sheriff running off into the woods seemed interesting and had potential...at first. But ran too long. The entire bus scenario was cool visually but served no purpose to the story other than to keep the deputy busy till the city-bloody-boy could get there and kill him. Then there were those laugh-out-loud moments: the deputy figuring out the cut-and-paste nature of the bloody-boy after staring at those photos for five minutes or so. And those burial grounds the cop dug wouldn't keep a Terrier from unearthing those corpses. But the script's biggest weakness is this: the killer. Why did she strip her victims and hang them from a tree before actually killing them. This has many sexual overtones, something you wouldn't expect from a little old woman acting out of revenge. And then...why in the hell did the bloody boy go to the sheriff's office? He is there to avenge the deaths of those he 'represents,' he knows who the killer is, so why does he not go find her rather than wasting his time sitting in the sheriff's office waiting for them to figure this muddled plot out? Sorry, I truly am...but this simply didn't work. Hell, it looked pretty though, and that was enough for Haute Tension to get picked up (Haute Tension had a much higher budget, though still pretty low by Hollywood standards, and so looked even better but its script, though fine and straight forward at first, falls flat at the end). It might make it on the cinematographer's obvious skills alone.<br><br>--Oleander Flimus","user":"oleander_flimus","rank":[33,41]},{"title":"Godawful boring tripe","rating":1,"date":"29 July 2006","review":"This movie had one good thing going for it: it ended.<br><br>The plot was a haphazard collection of clichéd overdone trendy horrorflick schlock. The writing reminded me of some things my classmates wrote in 8th grade English. The acting was passable...barely. Though, to be fair to the actors, I don't know how they made it through the drudgery of a script. Even the basics were awful. For instance, the sound of a gentleman removing his gun from his holster is FAR louder than the sound of someone getting cracked in the head with a rifle butt, or a car crashing into a tree. Logic is entirely absent. A girl hits a bump in her suv, the suv STARTS to go off the road, and she is already unconscious before the suv strikes anything...and I'm not talking continuity slip here- I'm talking, there's a shot to show you hey look she's knocked out...BY NOTHING. The movie is just BAD. Look at this, I'm ranting; THAT'S how bad this movie is. None of the plot \"twists\" are surprising, they're flat as a board. None of the characters are engaging, they're trite and tiresome. The soundtrack felt like I was being violated with a violin bow throughout the whole movie. Hint: When nothing is happening THERE IS NO NEED FOR LOUD-ASS SCREECHY STRINGS. SO STOP.<br><br>God, I'm so irked at this steaming puddle of drivel that I can't even write a coherent review.<br><br>Some movies are so bad you can't help but laugh. Then, there's some movies that are worse than that, and you just turn them off. Then, there's the next level down, where you can't stop watching, just to see if it's really as bad as it seems, and you always hate yourself for it in the end. This is one of the latter.<br><br>This movie was so bad that it managed to bring GORE down. That's right. A \"gore\" movie that made gore unenjoyable. And I don't mean \"gross out\" unenjoyable, I mean painfully dull unenjoyable. Think about that for a while. If there are mutilated corpses on screen and you are rolling your eyes - SOMETHING IS VERY VERY WRONG.<br><br>I could go on, and on, and on- don't even get me started on the Director's funny little preoccupation with a naked teenage boy. I understand the attempt at a gimmick, but mr. director included wayyy too many shots of \"glistening\" adolescent buttocks in the forest. Sketchy. Perhaps the most disturbing part of the film. Yeah, I said glistening. I thought I was watching a Roman Polanski or a Victor Salva film.<br><br>Speaking of said teenage boy, what a joke. The bloody kid shows up at the sheriffs station and is supposed to terrify us by just standing there. \"OMG HE ARE COVERED IN BLOOD OH NOES!\" All he does is make these faces that are supposed to look dramatic and scary (all accompanied by yet another godawful string hit), but in reality they look like the poor kids trying to pass a kidney stone. Fail. Finally after x number of hours handcuffed to a chair, he starts talking in an effects laden voice. Again, fail. If this kids back from the dead to avenge, why wouldn't he just get right to it, why go to the sheriffs station and chill. I'll tell you why - because the movie sucks, and we needed a half hour/45 minutes of constipated faces and blood randomly shooting from orifices while tired cutout characters stumble around vomiting awkward dialog and behaving senselessly as bloody writing appears on the walls(\"no one leaves\", Oooo spoooooky.) This isn't plot development, this is tedium. At the end, we find out the \"kid\" is after one or two \"bad people\" in the town. So, uh, why is he hassling the sheriffs station, and writing things like \"no one leaves\" and \"our fate is yours\" on the walls there? It's beyond senseless, it's pitiful. I'll say it again: FAIL.<br><br>I've seen people criticize that this movie is style over substance, and with all due respect, I have to disagree. The reason being that this movie HAS no style. Seriously. It tries really really hard to be gimmicky, and falls flat on it's face. Good style can carry a movie, even if it's bad. This movie had NO style whatever. There was nothing artful present. Nothing.<br><br>While on the topic of \"artfulness\", I've also seen people say that the camera work was passable, some even went so far as to say good. Again, I'm inclined to disagree. SO many shots were poorly composed, visually flat, skewed at an angle, boring, showed nothing, etc etc etc.<br><br>If you like good horror flicks, intelligent horror flicks, or even a good gore flick- Save yourself. Avoid this at all costs. It's a tired rip-off collection of clichés that tries really hard to be Evil Dead and fails miserably.<br><br>However, if you like smoking weed in your parents basement while you listen to Rob Zombie and Marilyn Manson, you think that \"trent is kewlies\" and you dislike showers and thinking, this one may be for you.<br><br>It wasn't even worth the rental fee, let alone the time it took to watch. I want my four dollars back. :[","user":"juggerquick","rank":[20,26]}]