[{"title":"Sandra saves the mess...","rating":4,"date":"11 January 2009","review":"\"Miss Congeniality\" was a very funny and entertaining light romantic comedy that delivered funny moments because of it's creative plot and of course, the sexy-funny performance of the always talented Sandra Bullock. Heck, Sandra delivers one of the best moments in cinematic history when she walks with that tight mini dress in slow motion... God I love women.<br><br>But this sequel is a total mess with a clichéd plot, predictable situations, and not so funny characters. The addition of Regina King as a sidekick for Sandra Bullock worked most of the time but it wasn't vital to make the movie work.<br><br>The situations are not funny at all and it truly made me think I was watching an episode of ..I don't know, any standard sitcom.<br><br>But the best thing about the movie is Sandra Bullock's performance. She's always funny, SEXY, smart. She's the perfect franchise actress that can save the day ANYTIME. Even if the movie is a total crap like this one.<br><br>Please only watch it if you are a huge, die hard fan of Sandra Bullock and you can stand trash like this; otherwise, please avoid it.<br><br>It's the attack of the bad sequels.","user":"insomniac_rod","rank":[19,23]},{"title":"Sandra Bullock just knows how to make stupidity so cute","rating":23,"date":"23 March 2005","review":"\"The reason for a sequel,\" says Bullock, \"is that Marc (Lawrence, writer and producer) and I found ourselves on numerous occasions imagining what Gracie would have gone on to do after her big triumph at the pageant and how all the media attention would have affected her.\" Yeah. I'm gonna take a wild one and say the fact that the original made over $300 million (including domestic AND worldwide gross, rentals, and DVD sales) probably had a little something to do with it as well.<br><br>Let's be honest here, do you really need a review to convince you of whether or not you want to see this? Seriously, if you watch the trailer and read this review and STILL see the movie, then I don't want to hear any complaints. Walk out of the theater with a smile on your face or I'll put one there, OK? Otherwise, don't see it. Come on, you're not really expecting something fresh and original are you? Have you read the plot line? Miss Congeniality 2 obviously runs a predictable path. Gracie is originally reluctant to become Ms. FBI Barbie, but then she embraces the role and becomes a wee bit too wrapped up in it. But wait! William Shatner and Miss America are kidnapped! So it's off to Las Vegas to run a little PR. Enter Treat Williams as the Las Vegas FBI supervisor (Collins) who has ambitions of writing his own book and doesn't care for Gracie coming in and stealing his thunder. You might as well have cued the sinister music and given him a Cheshire cat to pet and a handlebar mustache to twirl.<br><br>It'll come as a shock to approximately three sub-70 IQ viewers that Collins disregards Gracie's attempts at helping and begins to steer the investigation in the wrong direction. You know what that means, right? Time for Gracie to shed the FBI Barbie image and go back to her old ways! Somebody call up Memento, and let it know that a new master of unpredictability is here and its name is Miss Congeniality 2: Armed and Fabulous! OK, so not really. But who cares? The movie ramps up the cheese, the stupidity, the silliness, and the camp, and it revels in it. The best thing I can say about this sequel is it knows exactly what it is, it knows exactly what its audience wants, it knows exactly how ridiculously over-the-top everything is, and it doesn't care one whit what the critics think. There's no shame to be found here, and for that, I tip my hat.<br><br>I'll be honest, if you try to put a movie like this on the shoulders of Julia Stiles or Kirsten Dunst then I'm running screaming for the exit like I'm Haley Joel Osment at Neverland Ranch. But I love Sandra Bullock, and she has the charm and the personality to make me smile at the stupidest stuff. She trips about 24 times, dances at a drag club in a ridiculous outfit, lays a beatin' on a 6'7\" behemoth to the tune of Spiderbait's Black Betty, and she forces me to be entertained by it. Admit it, she has a knack for making insanity absolutely adorable.<br><br>Oh, and who can forget the addition of a partner! Regina King (the girl from 227) is an FBI transfer with anger management issues. She's assigned as Gracie's bodyguard, and she has a bad habit of overextending herself physically. Yep, you guessed it, they don't initially get along. Can you see hijinks and shenanigans ensuing? I think you can! Is this a great movie? Not by any means. It's not even as good as the original, a big reason being that William Shatner is regretfully underutilized (although he does have a great line about his friend being run over by a milk truck). Oh, and go ahead and make sure you bring your little yellow bucket to puke in during the final scene. A producer somewhere obviously spoke up and said, \"Hey, we're one aww-inducing scene short of our quota,\" and thus the final scene was born.<br><br>But you just have to accept that and the fact that this is a comedy that'll have you shaking your head and rolling your eyes more than once. In fact, I should be ashamed to admit that I let myself enjoy it as much as I did. But if you go into the movie expecting to have a good time then you should walk out satisfied. The screening audience absolutely loved it. Granted, proclamations such as, \"That is the best movie I've seen this year!\" are a bit much, but this is indeed a movie that knows its audience and plays to it effectively.<br><br>Are you expecting high art? If so, then you really need to learn how to better analyze movie trailers. You also need to learn how to better analyze movie titles. Armed and Fabulous? One of the great absolutes in life is any time a movie tries to be cute and makes a play on words with a common phrase (in this case, \"armed and dangerous\") in its movie title, then you better have a tent with you because mama, it's time to set up camp! The only thing missing here is a cameo by Adam West.<br><br>I think I'm gonna follow the trend. I'm gonna write a script about baseball called America's Pastime where the home team loses the championship. However, they will get their revenge in the sequel - America's Pastime 2: Payback's a Pitch. It's gonna rule. You know it, and I know it.<br><br>Bottom line, America - how often in life will you get the chance to see Sandra Bullock in boxers and a t-shirt, all while sportin' some long, shiny, straight hair? At the very least there is entertainment value in THAT! *sighs wistfully* Rating: 3 (out of 5)","user":"TheMovieMark","rank":[89,129]},{"title":"Bullock shines in a comedy that lacks laughs","rating":5,"date":"28 June 2005","review":"Sandra Bullock returns as Gracie Hart, the federal agent who went undercover at the Miss United States pageant four years ago. When the pageant emcee Stan Fields (William Shatner) and Miss USA (Heather Burns) are kidnapped in Las Vegas, Gracie needs to put aside her cushy lifestyle on the talk show circuit to go back into action, taking on a very unhappy new partner in Sam Fuller (Regina King).<br><br>Miss Congeniality 2: Armed and Fabulous isn't as good as the original but it still manages to deliver some funny scenes. The original was a fun, harmless movie though nothing memorable. The sequel falls under the same category but it's not nearly as much fun as the first film. Actually, the fun factor is only seen in Bullock and King everything else was poorly handled. Sure there were some fun moments but certainly not enough to sustain the really long running time. Also, Michael Caine and Benjamin Bratt don't appear in the movie. I miss Caine since he was pretty funny in the first one. I don't really miss Bratt because he's not that good of an actor.<br><br>The acting is pretty good and it's the best thing the movie has to offer. Sandra Bullock gives a funny and enjoyable performance as Gracie Hart. Her charm is what carries this sequel and she proves to be a delight on screen. Regina King also gives a funny performance and she's a nice addition to the series. The chemistry between Bullock and King is great and their scenes together is what drives the movie. William Shatner and Heather Burns don't really do anything special. Diedrich Bader gives an annoying performance as Joel. Treat Williams and Enrique Murciano just play their roles as much as the screenplay allows it and they don't really do anything special.<br><br>I think the main reason why this sequel isn't as good as the original is because the premise is nearly the same. They could have been a little more creative with the story. Also, the original movie wrapped up nicely and it didn't demand a sequel. So, this movie seems like a cash in on a popular film and little time was actually spent on the script. The running time is 115 minutes and this could have been edited. There were a bunch of pointless scenes and the movie just doesn't contain enough fresh material to keep the film funny or interesting. Also, the film is very predictable and sitting through a long, predictable movie wasn't that much fun. I need to question the point of making a sequel. It seemed like a lazy attempt and the film was only average because of Bullock and King. In the end, this unnecessary sequel isn't really worth watching unless you're a fan of Bullock or King. Rating 5/10","user":"christian123","rank":[29,39]}]