[{"title":"Another excellent superhero movie","rating":10,"date":"24 February 2020","review":"This is a movie that surpasses the original one on many different levels! It has a better villain, a better story and, most of all, a better message. The movie is about Peter Parker who loses faith in what he does, so he loses his powers. Tobey Maguire is magnificent in this movie and he plays so well off of all the other actors in the movie. Alfred Molina is great as the villain and, as always, J.K. Simmons steal every single scene in which he is present. This is really one of the best superhero movies that has ever been made.","user":"MR_Heraclius","rank":[46,50]},{"title":"This movie has a criminally low rating","rating":10,"date":"4 January 2019","review":"7.3/10? Seriously? Most mediocre MCU films get a better rating than that. This movie is up there with The Dark Knight as one of the best superhero movies. This movie was loved when it came out, now it's cool to hate on the trilogy. Spider-Man 2 improved on all aspects of Spider-Man 1. Peter is struggling to be Spider-Man, and the movie illustrates that very well. The action is better than lots of movies today, most notably the train fight scene. Danny Elfman provides an unforgettable soundtrack. This movie and the trilogy shouldn't be overlooked as some cheesy 2000s movies, because they paved the way for the MCU as we know it today.","user":"ditkovich_rent","rank":[192,227]},{"title":"A Fan's Dream Come True","rating":10,"date":"30 June 2004","review":"I went to the midnight show last night and was completely blown away !! I am 30 years old and had begun reading the Amazing Spider-Man back when I was 11 and leaving the theater last night, I felt like I was a kid again- I was amazed, I was in awe, I really felt... satisfied.<br><br>Every scene crackled. There was an energy, there was an effort put into every moment of the movie. No scene went on too long, no plot holes fell through. It was the comic, come alive.<br><br>Sam Raimi and Tobey Maguire did a great job of making Peter Parker sympathetic, you feel for him, you wince with him, he is the boy, becoming a man, and you watch it, and you keep watching it.<br><br>Even as a long-time fan who knew where some of the story lines were going- with MJ, with Harry Osborne- to see HOW the movie chose to play out these stories, provided great surprises for me, I almost wished I didn't know... I can't wait to see the reactions of my friends who haven't followed the Spider-man comics, the twist of the story and the hints at what is to come...<br><br>A great movie. Great fun. Great story. Great action. A blockbuster movie. You leave the theater, definitely feeling like you got your money's worth !","user":"RPruitt","rank":[349,444]}]