[{"title":"This really sums it up","rating":10,"date":"6 May 2008","review":"This was a spectacular depiction of the life and times of Miami in it's criminal hay day. I witnessed the carnage first hand as a member of federal law enforcement and this documentary hits the nail squarely on the head. What made this really enjoyable for me is the way the director conveys the story. It is flashy and all over the place... just like Miami at that time. This was one of the few documentaries that told the stories of both sides of the struggle. The makers of this film were also able to do something very difficult. They assembled interviews from both sides of the fight. Anyone that is or was in my line of work knows how difficult it is to pull that off. Most documentaries are steeped in biased rhetoric and never give the viewer the chance to form an opinion based on all the facts. For those of us who remember those days and can be honest with ourselves and others about the gravity of that situation, it stirs up a long stored emotion. I can understand why people may find this documentary offensive or cheap, politically correct agendas have a way of skewing reason. That mentality is probably why this behavior has gone on so long. I wish I could take some of the misinformed back in time to see the reality of those times. It makes the nonsense of today look like Disney World. This documentary was an excellent depiction of the times.","user":"bishop24312000","rank":[36,39]},{"title":"Excellent documentary","rating":10,"date":"15 February 2005","review":"Although I had the opportunity to see the unfinished version of what is sure to be an award-winning film, I was thoroughly impressed by Cocaine Cowboys. Without giving anything away, let me just say that this film refrains from the type of overly preachy or overly glorified view of the cocaine business in the late 1970's and 1980's. A nice balance of character analysis mixed with an abundance of archival data kept my interest throughout the experience...and I walked out of the theater feeling as though I really learned a great deal, not only about historical occurrences, and their impact on a few central characters or society as a whole; rather, I left the cinema with a grasp of the time period from many different perspectives: Columbian drug lords, Cocaine transporters and dealers, special task force members assigned to find the aforementioned groups, local media then and now, land developers, vacationers, car salesmen, and your average Miamian. Perspectives offered were not limited in scope. I highly recommend this film.","user":"phlnthrpy","rank":[91,112]},{"title":"Miami's real vice","rating":8,"date":"28 June 2008","review":"Life was good in Miami in the 70s. You could blow into town with $500 dollars in your pocket, and the next things you know, you are burying millions in your bag yard, driving the hottest cars, have two or three cigarette boats, a string of race horse, and land all the way up to horse country in Marion County. You didn't think twice about dropping $20,000 on food and drink because you had so much. The Miami skyline was booming with two dozen construction cranes operating, cars were selling like hotcakes, and there was no trace of the recession that was occurring elsewhere in the US.<br><br>But, then came the 80s and there were 100,000 illegal Colombians in Miami and Castro had just flushed Cuba's toilet and dumped his criminals into the city in the Mariel boat lift. War began between the drug dealers on these two sides, and it came to the attention of Reagan and Bush that there was a problem in Miami that affected the whole country.<br><br>Long before I got attracted to Carl Hiaasen's fiction, I was reading his columns from the Miami Herald. Forget Scarface, this was the real thing. Shootouts with shotguns and automatic weapons on the streets in broad daylight. Miami had become Dodge City and Chicago during Prohibition to the tenth power.<br><br>This is the story of those two decades in Miami and the results today - a booming international city built on cocaine. The truth really is more exciting than what you see on Miami Vice.","user":"lastliberal","rank":[36,43]}]