[{"title":"A traditional, well-made western","rating":8,"date":"20 March 2004","review":"A traditional, well-made western - suitable for most ages, features good guys herdin' cattle, bad guys tryin' to steal the cattle, codes of honour, a corrupt sheriff, a fantastic shoot-out, and Annette Bening being lovely in the wings. Open Range doesn't do anything particularly new, it just does it particularly well. For actor/director/producer Kevin Costner, it seems to have been a labour of love and one that has paid off handsomely. The characters are well fleshed out, it has plenty to appeal to adults (men and women) rather than being just a boys-with-guns film. The qualities of the main heroes are likeable - they value the trust, respect and confidence that is given them and realise the value of these things. Open Range is no high and mighty moraliser however; there are plenty true-to-genre one-liners, such as \"You're nothing!\" (grim-faced, cornered bad guy) - \"Maybe so,\" (good guy pointing a gun at him), \"but I'll still be breathing in another minute!\" Towards the end of the film they also battle with their own inner demons. What starts out with all the flavour of a Boys' Own adventure (complete with cutesy dog) turns out to be a well-rounded minor classic. Long live the Western!","user":"Chris_Docker","rank":[96,106]},{"title":"Duvall steals the show with a charismatic portrayal of a man who exudes kindness","rating":8,"date":"27 March 2006","review":"In \"Open Range,\" we are drawn to two men running from their pasts, an aging lonely cowboy, Boss Spearman (Duvall), and his long time second hand man Charley Waite (Kevin Costner). They drive their herd of cattle from a vast prairie to another with their two young helpers: the giant Mose (Abraham Benrubi), a gentle fellow who mostly works as wagon driver and cook and Button (Diego Luna), a teenaged orphan eager to prove himself to his elders <br><br>The plot is launched when the four free-range cowboys encounter the town boss, the merciless Denton Baxter (Michael Gambon), a menacing Irish immigrant who actively hates free-grazers, and wants their herd vanished from the territory one way or another <br><br>To make his feelings known, Baxter and his henchmen severely injure the two young cowboys<br><br>Boss treats the boy's wounds himself, and then takes him, with Charley, to the town's doctor where Sue Barlow (Annette Bening), the doctor's middle-aged sister, cares for him There, in their confusion and anger, the duo realize that they're now on their way for a high noon gun battle, not only for revenge, but to protect their way of life as well<br><br>Costner's character, Charlie Waite is an enigmatic, sensitive type who does not show much emotion He has been taking orders from Boss for a decade, but their coming confrontation with Baxter and his thugs begins to reshape their relationship Charlie has a troubled violent past of which he's not proud, but it's a past which will help him in the bloody fight to come<br><br>As the story goes relentlessly toward the clash between Baxter's brutes and the two cattlemen, Sue unexpectedly catches Charley's eye She is a strong capable woman who discovers exactly what Charley is when she first meets him Charley was more than a little worried What if Sue sees his malicious side, it might scare her off<br><br>Duvall is exceptional as usual He is strong and flexible He steals the show with a charismatic portrayal of a man who exudes kindness as expressed in his concern for the wounded young boy In one of the movie's few striking moments, Boss buys an expensive Swiss chocolate from the town's general store and then offers the storekeeper a piece of it when he finds that he has never tried it himself because he can't afford it Duvall handles this scene relaxed and with all the graciousness and warmth <br><br>The film's cinematography is superb, due in part to the green, forested mountain slopes against the stunning snow-capped peaks, marked with occasional torrential thunderstorms","user":"Nazi_Fighter_David","rank":[111,126]},{"title":"One of the best","rating":10,"date":"22 December 2016","review":"I never get tired of this movie and I don't even want to count the times that I have seen it. Beautifully written, great acting, costumes, scenery. I cannot think of anything I didn't like about it. Annette Bening is definitely one of my favorite actors right along up there with Robert Duvall. Costner was great in this too. I was drawn into this from the opening and maintained the same level of interest until the end credits. I think this is one of the must see westerns and rate it up there along with such classics as The Searchers, Shane and High Noon. I am a huge western fan and when I come across a great one, I can be entertained by watching again as though it were the first time because with great writing, there is always a small part you might pick up the next time you see it that you missed the first time.","user":"dave_martin2008","rank":[15,15]}]