[{"title":"wonderful","rating":10,"date":"10 May 2003","review":"I can't believe there is not one comment or even rating for this film. This must be a real obscurity, even among anime' afficianados (which I'm not necessarily, but I've seen a fair amount) This was one of the most beautiful sword and sorcery animated fantasy films I've ever seen, right up there with \"Laputa\" and \"Nausiica\" Why has this film not received more attention or for that matter any type of domestic distribution (on DVD) or otherwise? I don't understand it, I basically will have no one to talk with about this film because NOBODY's seen it!! At least not in this country.","user":"Pookie-10","rank":[22,24]},{"title":"Boring","rating":4,"date":"4 January 2016","review":"I really, really wanted to like this movie. And don't get me wrong, I understood the themes of the story, and I actually do like slow- paced animated movies. But Princess Arete was to slow! <br><br>In the first hour of this movie nothing at all happens. It only takes place in a handful of boring a dull settings that don't really immerse you in the world. And it seems like all the characters do nothing but sit around and talk about things. The animation is good, but very uninspired, it doesn't take risks, or do anything spectacular. And besides, animation is the pinnacle of visual storytelling, and its the best way to express imaginative and to tell immersive stories. When I see an animated movie that has such a dull atmosphere, I feel sorry for the people who worked on it.<br><br>Now the movie is not all bad. Like I said earlier, I did understand the theme of isolation and oppression, and at the very least the last twenty minutes actually had something happening, but its not enough to make up for the ninety minutes of nothing that came before it. I'm sure some people would like this movie, but I don't think I could recommend it to anyone.","user":"stagedlined466","rank":[7,10]},{"title":"decent fantasy","rating":8,"date":"18 February 2007","review":"the movie has a very deliberate pace and really sets into a mood of its own. the princess is courted by suitors at a young age by knights or princes who are determined to win her hand in marriage for the wealth they would gain. they were tasked to retrieve certain magical items. the princes/knights all proclaim their greatness and she sees through them and calls them out for what they are -- thieves and liars. a sorcerer fools the king into allowing her to marry him and he takes her to his castle and locks her up in the dungeon because it is prophesied that he shall fall because of her. it's a definite fantasy that fits in well with medieval europe around the 10th century give or take a couple of hundred years. the animation is extremely fluid and detailed. the characters don't have the typical anime face and everyone has noses. the backgrounds are gorgeously painted and the use of computer animation is very limited and none of it is too obvious unless you're an animation aficionado or professional. it seems slow in spots but all in all, a solid story with little to offend anyone.","user":"uptonogood-1","rank":[5,7]}]