[{"title":"Jamie IS Ray","rating":7,"date":"19 December 2004","review":"If someone had nudged me about 15 minutes into 'Ray' and asked what I thought of Jamie Foxx in the title role, it would have been time for a blank stare. After all, what is this (fictitious) person talking' about? That wasn't Jamie Foxx up on the big screen. That was Ray Charles. This is one of the best performances by anybody in recent years. Like the soundtrack, Jamie as Ray is flat-out brilliant.<br><br>The blind Genius of Soul (who took a revolutionary step of mixing gospel with R&amp;B) died during production. The movie about his troubled life is good, not great. Taylor Hackford's direction and James L. White's script follow the well-worn biopic outline. Super-talented youngster battles adversity, achieves greatness while also self-destructing, then picks himself up out of the gutter for a happy ending. The film shows Charles' flaws (heroin abuse, chronic womanizing, persistent bastard-fathering) even as it sucks you in with his beautiful music.<br><br>Kerry Washington and Regina King play the main women in Ray's life, one his long-suffering wife and the other his longtime mistress. Both actresses match Foxx stride for stride. What takes him to a different level, though, is his deep understanding and uncanny impersonation of the great musician. The entire cast is effective, especially Sharon Warren as his headstrong mother and Curtis Armstrong as a music exec. Hackford's stars are likely to be rewarded with trophies and---better yet---more starring roles.<br><br>I was not a Ray Charles aficionado before 'Ray'. Apparently, the film has left out a lot (as do all biopics), but this picture functions as both an old-fashioned crowd pleaser AND a dark investigation of a brilliant/troubled man. For those who whine that Foxx doesn't actually sing (as if that somehow diminishes his performance), take a hike. No mere actor can sing like Mr. Charles anyway. You can't have everything. What the talented star does in this picture is about as close to \"everything\" as we'll probably see for a while.","user":"flickershows","rank":[123,139]},{"title":"Unexpectedly Brilliant Performance","rating":29,"date":"29 October 2004","review":"Given that Jamie Fox's former leading credentials not that long ago were limited to the Fox comedy series In Living Color and the atrocity of film, Booty Call, this is a truly pleasant surprise break-out performance. Jamie Fox is Ray Charles in this movie. You never question it or even think of him as Jamie Fox. It truly is uncanny. He physically looks like him, especially with the glasses, but the true magic of the performance is that he acts just like him. He walks around and performs like him, smiles like him, and just does everything like him. This is the best rendering of a real-life character in film since Jim Carrey's depiction of Andy Kaufman in Man On The Moon. However, I'd venture to say that Fox's rendering of Ray is even better. The film itself is good too, though it fails to make a smooth transition in several parts of it and lulls in some parts, while not lingering long enough in others. Of course all films of this nature that are essentially biographies to some extent tend to suffer somewhat from things of this nature. It's hard to pack 70 years into 2 1/2 hrs. Thus, the script mainly traces his early days starting out in music up into the late 60's, with a few flashbacks into his childhood and a brief jump to a single event in 1979. This is the only film I have ever seen in which the entire audience, myself included, stood up and gave a standing ovation after the last scene. It's a celebration of the life of Ray Charles that must be seen by all of his fans. The film doesn't pull any punches though. Two of the main dramatic focuses of the picture are Ray's infidelity on the road and his heroine addiction. All-in-all, a good movie, a great Oscar-worthy performance, and a good way to spend 2 1/2 hrs. This movie held my attention so well throughout its entirety that I really couldn't believe it was nearly as long as a lengthy epic like Titanic. A few quick notes: Jamie Fox spent a lot of time with Ray Charles in preparing for this role. Jamie wore prosthetics during the entire filming of the movie that made him unable to see, so if you wonder why he acts like he's blind so well, it's because he was for the movie. Also, he did all the piano playing himself, as he is practically a professionally trained pianist himself. However, for the singing, Jamie lip syncs perfectly to Charles' vocals. Overall, 8/10 movie...10/10 Jamie Fox performance.","user":"8ofem","rank":[171,203]},{"title":"One incredible performance, one worthwhile movie","rating":8,"date":"1 February 2005","review":"Let's get the flaw out of the way right off the top - the movie should have been much longer. Ray Charles was a brilliant, fascinating man who lead a complex, challenging life. There was simply no way to fit it all - or even touch on it all - in a standard length movie. Given that, the makers of this film did an admirable (and I'm sure quite agonizing) job of putting together a film that could not tell the whole story yet managed to set forth a representative sampling of the man and his music. Ray Charles' strengths were evident throughout the film and his weaknesses were neither amplified nor sugar-coated. We could have wished for another hour chronicling his life after 1980, but I suppose that would have tended to turn the film into an homage and, while it would have also allowed for the resolution of several things that were left hanging at the end, on balance I guess it was better as presented.<br><br>Now for the big question: what are the criteria for an Oscar? The wife and I have seen untold numbers of films in our years, but we immediately agreed that we have never seen a performance the equal of Jamie Foxx's. The line between actor and character was not blurred - but rather it disappeared completely. We had heard much of the hype before seeing the movie, but this was uncanny. Foxx WAS Ray Charles. You didn't watch the movie with the feeling that you were watching Foxx do an outstanding job of portraying Ray Charles - you watched it somehow believing or understanding that you were watching Ray Charles himself. I don't know how else to put it. We were completely blown away. I'll admit that we haven't seen all of the other performances up for an Oscar this year, but that really doesn't matter. Foxx took this to a whole nuther level, one which we've never witnessed before and doubt that we may ever see again. I can think of no other movie I've ever seen in which a person playing a part so completely and convincingly became the person portrayed. We salute you, Mr. Foxx. We understand that the awarding of an Oscar has to do with much more than the performance, but whether or not you win, we want you to know that you have done something that is in a class absolutely by itself and you should take enormous pride in your unparalleled achievement.<br><br>P.S. The music was naturally great. I remarked to the wife that if there is one moment in the history of music to which I wish I could have been witness, it would have been the genesis (in Kansas City, wasn't it?) of What'd I Say? The film did a wonderful job with it - just wish I could've been there!","user":"bmcdannell","rank":[70,81]}]