[{"title":"If you can push the original out of your mind, you'll love it.","rating":9,"date":"5 February 2005","review":"On entering the cinema, I did have my doubts. I'd watched the original Magic Roundabout from a very young age, and one false step could have ruined both versions for good.<br><br>However, the filmmakers managed to make a perfect balance of \"old\" and \"new\" to bring out a whole new film, featuring characters that reminded me of the originals, but didn't try to take their places.<br><br>The storyline was fun, bearing in mind that it was aimed at young children, and included the token jokes (aimed at both children and adults), teary moments and interesting yet predictable twists. The graphics were excellent, and most of the older viewers were \"Ahhh\"ing throughout at the sight of the big, sweet eyes. Looking around, I could tell that the young 'uns were enjoying it too, and that's what really matters in a film like this.<br><br>Overall, a brilliant transition from a simple, sweet television show to an enormous, exciting movie.","user":"Mia_Moose","rank":[24,31]},{"title":"Time for bed for a new generation","rating":10,"date":"13 February 2005","review":"All is quiet, it's teatime and before you know it Zebedee says those immortal words: \"Time for bed children.\" But 'Boing' Suddenly, as if by magic Kylie Minogue is telling you that they're \"coming to get ya\"  a talking sugar addict dog, an opera singing cow, a stoned bunny and a wacky wizard with a spring instead of legs, man I think I've been eating too much sugar myself It's true though  just when you thought it was safe to take a trip back 30 years to a place of innocence and fun  here comes the super slick all singing, all dancing, all action CGI Magic Roundabout. Yes, some brave filmmakers have taken on the daunting task of updating the British teatime favourite (originally from France) which was once the 2nd most popular show on the BBC  behind the news!! How on earth could this work? And who invited the lovely Kylie to not only voice Florence but also knock out a catchy Magic Roundabout single for the soundtrack? A genius team of Dave Borthwic, Jean Duval and Frank Passingham actually  and they've pulled off a minor miracle here. Aided by the superb voice cast of Tom Baker (Zeebadee), Jim Broadbent (Brian the snail), Lee Evans (Train), Joanna Lumley (Ermintrude), Ian McKellen (Zebedee), Bill Nighy (Dylan) and Robbie Williams (Dougal). And there's even a plot of sorts: the Magic Roundabout lies in ruin after an evil ice sorcerer Zebadee has escaped to freeze the world. Step up some unlikely heroes, Brian, Ermintrude, Dylan and Dougal to challenge the chill by recovering three magic diamonds. Okay, so the plot might as well have been from a computer game and it is all a bit far removed from the genteel original but it's just mad to see Dougal and crew trekking over fiery volcanoes, jungle temples and snow-capped mountains. Plus McKellen manages to instill the spirit of Gandalf into Zebedee and even gets a heroic 'fall from a high pass' scene after battling his icy nemesis Zeebadee. This leads to Dylan almost quoting Pulp Fiction with \"Zeb's dead babe, Zeb's dead\"; this and some of the original's trippy substance references will keep adults of a certain age smiling. What can I say? I was amazed at how much I enjoyed this slight bit of nonsense, maybe it was sheer nostalgia but then my son Luke loved it too which I wasn't expecting.","user":"cleric20","rank":[17,23]},{"title":"Nice!","rating":7,"date":"21 February 2005","review":"My friends dragged me to see this with them for a joke. The cinema was full of kids and I was really embarrassed! But I definitely don't regret seeing it.<br><br>The plot was, unfortunately, the weakest part of the movie. It was just so Saturday-morning-cartoonish (complete with evil twins, magic diamonds and walking skeletons) that anyone in the cinema over the age of nine is unlikely to be interested. But anyone under that age will be delighted from start to finish.<br><br>It's the cast and music that really did it for me. Robbie Williams, despite his complete lack of experience as an actor, pulls off his role as Dougal with natural skill and emotion, which is pleasantly surprising. Jim Broadbent and Joanna Lumley seem to have great fun in their roles (as Brian the snail and Ermintrude the cow respectively) and Bill Nighy, well, lets just say there's no one else in the world who could've done Dylan the drug-addled bunny like he did (\"no way man! I'm in, like, a higher state of unconsciousness...\"). Kylie Minogue did well enough, but she only has about three lines. Tom Baker and Sir Ian Mackellen also seemed to enjoy giving very camp performances as the arch rival jack-in-the-boxes Zebedee and Zeebad (though Sir Ian sounded a little too much like Gandalf). The music, which seems to include vocal performances from Kylie and Robbie, is fantastic and well above average for a kids film today. If you've seen the film, I think you'll agree the soundtrack is a must-buy! But still, it's not all great. The plot is full of gaping holes, and while it mostly works with a very young audience in mind, the jokes aimed at adults are not laugh-out-loud funny, they just raise a knowing smile. There are some rather strange movie references too. It features references to Pulp Fiction, LoTR, and The Matrix (courtesy of some unexpected kung-fu fighting on Dylan's part) and I'll be damned if I saw a Dragon Ball Z reference in there! (Watch the scene where Zebad fights Zebedee for the first time - then again maybe it was just cheesy...) I never saw enough of the original 5 minute episodes to be a fan, but really, it seems very different from the original, so old-time fans may be disappointed, or maybe they'll appreciate seeing their old favourites in some new action-packed situations. It's up to them.<br><br>Yes, it falls flat in MANY places, but it's also got a childish, endearing charm that may make you wish you were seven again.","user":"xshadowhawkx","rank":[11,14]}]