[{"title":"Stupefying and hilariously terrible film","rating":3,"date":"9 August 2005","review":"Stealth is the best movie of the summer. And when I say best, what I mean is that it's the most hackneyed and predictable 130-million dollar piece of crap action flick of the year. Stealth has no intentional redeeming qualities whatsoever, and plays into every single textbook stereotype of the genre. Thus, if you're the kind of person who loves Mystery Science Theatre 3000, you must, must go see Stealth immediately.<br><br>Stealth follows the exploits of three Navy pilots in a top secret program involving, well, experimental stealth fighters. There's Lt. Ben Gannon (Josh Lucas): the white-bread pretty-boy with a smarmy attitude with a history of breaking rules and taking too many risks, played like a twisted caricature of 'Maverick' Mitchell of Top Gun. There's Kara Wade (Jessica Biel): the obligatory Caucasian hottie pilot who spouts clichéd feminist rhetoric and sports an \"I can do anything you can do, better\" attitude aligned more with the Spice Girls than Andrea Dworkin; the pink teddy lingerie and frilly bra she apparently wears under her LuLu Lemon flight suit don't help her cause either. Finally, there's Henry Purcell (Jamie Foxx) the black male who listens to rap music, has indiscriminate sex with as many women as possible, and poses for imaginary photographers in his bedroom. For no apparent reason he's also a mathematician and numerology nut who later expounds that \"one is a prime number\".<br><br>The fourth character is \"Tin Man\", the artificially intelligent experimental stealth fighter assigned to the squadron. Its brain uses \"quantum computation\" and processes \"20 terabits per second\" which is pretty impressive until you realize the number doesn't make any sense. Having a computer as sympathetic character is a pretty cool idea. At least it was in 1968 when Kubrick made 2001: A Space Odyssey, though Tin Man's inflective voice and bizarre penchant for rock music suggests a closer relation to Max-- the shipboard computer in Disney's Flight of the Navigator-- than HAL 9000. This doesn't stop the writers from making bizarre homages to Kubrick's space opus; in fact one major plot point centers on the computer overhearing a conversation in a scene shot much like HAL's famous lip-reading in the Pod. The computer also has a big red eye, which is dumb because it doesn't need to see anything with it, but cool because it helps the computer emote more effectively.<br><br>After a minor sortie in Rangoon (where \"three terrorist leaders\" are meeting in \"a building still under construction\" (which is important because now they can implode the building without killing any civilians-- go America!)), and then an extended Thailand vacation sequence where the pilots engage in tedious ham-fisted metaphysical discussions about whether Tin Man is actually alive, the computer predictably goes nuts and decides to attack a fortified terrorist camp in Tzadzikistan or something that just got access to some old Russian nuclear warheads and SCUD launchers. (We know they're terrorists because of the turbans and the fact that they're moving the warheads around on carts pulled by mules.) The nukes get blown up but radioactive dust falls down the mountain side and kills \"thousands of innocent farmers\" which I guess is bad but they don't spend too long worrying about it because they have to catch the psycho stealth.<br><br>Usual stuff happens after that-- a pilot hits the side of a mountain, another one goes down inexplicably in North Korea, and the remaining one has to avenge his friend's death and rescue the other pilot from the Koreans' evil clutches. The ability of these planes to be in Rangoon, Tzadzikistan, Russia, Alaska, and Korea on just a few tanks of gas is explained by their ability to hit hypersonic speeds exceeding Mach 5 which is cool because it's like warp speed on Star Trek-- they punch a button and the planes zip away in a bullet cone of displaced air and end up in a new locale more suitable for extreme aerobatics. They also get to fly against the Russians which is funny because the Russians obviously haven't built any new planes since the fall of the Soviet Union, which begs the question: why do the stealths have such trouble with them? Why don't they just hit the Mach 5 button and get out of there? Is there something about the shocking yellow and brown paint job on the anachronistic Migs that impedes the functioning of hypersonic engines? The plot isn't really important-- what is important is that the movie contains a wealth of brain-dead inaccuracies for geeks to make fun of. From bizarre phrases like \"the Stealth has firewall-ed the transponder!\" to the fact that the Stealth's brain is made alternately from quantum hardware, neural networks, and DNA sequences depending on which one looks coolest for the effects sequence, and was apparently programmed by hand by one man using a futuristic language reminiscent of Matlab, to the way that the naval command is powered by transparent lexan PC cases decked out with coloured LCD cooling fans, this movie just stinks of technical naivety due to lack of research as opposed to creative liberty.<br><br>Stealth is a movie that begs its own drinking game. It should be watched with a group of people in an environment that engenders snarky comments. Stealth is not a good movie in any way, shape, or form, but it is a film that is so stupefyingly bad it absolutely must be seen to be believed.","user":"mike-verdone","rank":[146,208]},{"title":"'Short Circuit' meets 'Top Gun'.","rating":7,"date":"11 December 2010","review":"'Short Circuit' meets 'Top Gun' in Rob Cohen's CGI-packed action-fest Stealth, in which a trio of ridiculously attractive elite US fighter pilots (Josh Lucas, Jamie Foxx and Jessica Biel) must do battle with the latest in aeronautical warfare technology—an Unmanned Combat Aerial Vehicle (UCAV), flown by a computer called EDI, which goes haywire after it is struck by lightning.<br><br>Tearing out of the stratosphere at Mach Impossible to blast the crap out of anything that looks even the slightest bit foreign, the hi-tech aircraft in this film are about as stealthy as a herd of stampeding fluorescent pink elephants blowing vuvuzelas; they sure are cool looking though, and provide action fans with plenty of moments of spectacular mid-air madness, Cohen's virtual camera whipping in and around the state-of-the-art aircraft with as much speed and agility as the planes themselves.<br><br>Anyone looking for realism need not apply (the film's corny plot is about as believable as an email from a Nigerian businessman), but with endless huge explosions, a psychotic A.I. jet plane, Foxx ploughing into the side of a mountain, and gorgeous Jessica Biel in a bikini, those after some slam-bang, big-budget popcorn trash to give the old brain cells a rest could do a lot worse than Stealth.<br><br>6.5 out 10, rounded up to 7 for IMDb.","user":"BA_Harrison","rank":[27,34]},{"title":"This means war","rating":1,"date":"5 January 2006","review":"(Spoilers ahead)<br><br>My brother in law must hate me, and I cannot let this pass. I mean, I might have been able to let it go if his disdain for me had manifested itself in a more civilized manner, like him sucker-punching me in the balls and calling my kids ugly. But no, his hatred for me runs so deep, he chose to exact his villainy upon me in the form of this hell-spawn stupidity know as Stealth. <br><br>Each grating second of the film was like another twist of Lucifer's fiery trident in my face. Hours after this holocaust was but a distant memory to my TV screen, the horrific imagery was still burned in my retinas. I could still hear Satan's demonic host laughing at me, lead by my brother-in-law.<br><br>Stealth, which easily charges past XXX and The Fast and The Furious in its unwavering quest to be the stupidest movie of all time, was directed by Rob Cohen, who, in exchange for fame, is obviously bound by some unholy pact with the devil to assault all of his viewers' senses. And yes, I mean all my senses: this movie looked, sounded, felt, smelled, and even tasted like week old sushi. <br><br>The movie's plot starts by introducing a trio of hotshot pilots who fight hard, play hard, and have perfect hair and teeth while doing it. You have Ben Gannon (Josh Lucas), the fearless leader who is wild, unpredictable, and doesn't like to follow orders, but, gosh dangit, he's the best darned pilot they have. Then there's his love interest, Kara Wade (Jessica Biel), a woman whose skills surpass most men's, especially when it comes to filling out a bikini. Last, and certainly least, is Token Blackguy (Jamie Foxx), the promiscuous, hip hop listenin', basketball playin', and doomed-to-die comedic relief. <br><br>After completing a dazzling training mission filled with enough fast cuts to induce a seizure, our trio is informed by the evil military commander that a fourth member, piloting a new prototype plane, will soon join their group. But the new pilot is no ordinary pilot. No, it's actually a computerized, talking Times Square New Year's Eve Ball! And his name, obviously ripped off some budding porn star, is \"Extreme Deep Invader\" or EDI for short. EDI is the heart of the military's latest and greatest weapon, the Unmanned Combat Aerial Vehicle (UCAV). He was also designed and built by idiots, because instead of being programmed to behave methodically, predictably, and controllably in the battlefield, he actually learns on the fly, picking up such useful skills like how to download illegal MP3s on the internet.<br><br>EDI is, of course, rushed into service during the hotshots' next mission, and before you can say \"HAL900\", he gets struck by lightning, goes all \"Skynet\" on them, becoming sentient. Luckily, his programmers equipped him to display a graphical representation of a DNA double helix being split for just such an occasion.<br><br>Soon afterward, the super team is scrambled to destroy some baddies holed up in a castle in the middle-east before the arrival of some ox carts bearing nukes (no, I'm not kidding). Despite orders telling him to stand down due to a high collateral damage assessment, EDI lights up the terrorists, spreading radioactive dust over the whole region. Not satisfied, EDI decides to off and kill several targets programmed in his hypothetical war scenario system, thrusting the plot forward into the man versus evil machine story. I could swear I heard my 3 year old say, \"Saw that one coming.\" <br><br>From this point, the movie leaves the land of popcorn-movie incongruity and spirals into complete and utter implausibility. I won't go into too much detail, but one of our heroes dies, one manages to invade Russian airspace, shooting down 2 Russian jets sent to defend their homeland (ensuring the start of WWIII), and the other somehow crashes down in North Korea, requiring a rescue attempt that murders dozens of North Korean border patrol. And what about evil EDI? What else; he develops a conscience and sacrifices himself for the team, supposedly leaving you with a heart warming feeling. It left me with heartburn. <br><br>The abominable movie closes with the typical happy Hollywood ending where Ben Gannon and Kara Wade exchange love vows. Ah, nothing like true love to help forget about the impending apocalypse they just ushered in by invading Russia and North Korea. <br><br>You know, there are many ways to creatively describe hate. But the best one in this case, unfortunately, is not entirely my own. I couldn't help but think of one particular line in the cheesy dialog that, with a little modification, could perfectly describe this movie. At one point, in charge of maintaining EDI's brain, our stereotypical computer geek with bad hair, clothes, and, most likely odor, describes EDI as a \"quantum sponge\" that can learn at a geometric rate. Well, this movie is like a \"quantum vacuum\". The longer you watch, the more it sucks at a geometric rate.","user":"dejfatman","rank":[96,141]}]