[{"title":"Psychedelia, Incoherence and Quirky Charm","rating":5,"date":"10 May 2005","review":"Woh, like pass the bong, dude! This is a bizarre film, to say the least. 5 out of 10 is usually my \"so bad, it's good\" rating. The Passing isn't exactly good, it's more that it's so freakin' weird that you've got to watch it if you're into oddities. But be forewarned that technically, and especially in terms of storytelling, this is a complete mess. It's also fairly disturbing in some ways, but not because of gore or graphic violence. It's more disturbing because of the gritty, extreme white trash feeling it captures, the fugly people who resemble those folks you only see appear in public when they visit county and state fairs (and a couple of them appear in full frontal nudity here), and the ideas behind some character actions.<br><br>The story gradually combines two disparate threads. In one, a violent, deranged man, Wade Carney (John W. Huckert, Jr.--who may be the director/writer/producer/editor/gofer/etc.) is shown (out of sequence) abusing his wife, raping a man, accidentally killing him, and later killing others in self-defense. Because of what can be proved about his history, he ends up on death row. But he's not a serial killer, despite what some descriptions of the film say--maybe director John Huckert (without the \"W\" or the \"Jr.\") intended him to be accused of being a serial killer in the story, but I don't remember anyone calling the character that.<br><br>In the other thread, two elderly men, Ernie Neuman (James Carroll Plaster) and \"Rose\", or Leviticus Washington (Welton Benjamin Johnson), are living out their last days together in a small isolated house. They were buddies from World War II, and now they only have each other. They're relatively poor and in ill health, but good spirits.<br><br>Ernie's doctor hooks him up with an unusual \"geriatric center\". That's where the two threads end up coming together, after a brief brush at merging in a jail, and that's where the film ends up turning most strongly into sci-fi psychedelia. Note that prior to the one-hour mark, there's nothing sci-fi about the film. Wade is spared execution if he agrees to be a \"guinea pig\" in an unusual medical experiment at the same time that Ernie is given the promise of a figurative reincarnation. One other reviewer said that he believed the threads were asynchronous (happening at different times). I disagree with that. Rather, the threads show how the two relevant characters ended up in the same place, and the final scene involves a look of recognition from a principal character, not a depositing of the viewer at the beginning of a scene we witnessed earlier.<br><br>For the first hour, at least, The Passing feels more like we're toggling between two completely different films. Surprisingly, the Ernie and Rose film is pretty good, even if the technical aspects are awful--it's the \"quirky charm\" aspect of my review title. If Huckert would have stuck with just this material, he could have easily had a legitimate 8 on his hands. Plaster and Johnson turn in good performances. Huckert and co-writer Mary Maruca created a poignant story with good dialogue and even effective narration, which is one of the more difficult things to write. The Ernie and Rose segments are often funny, and the humor is not usually unintentional. There is even a fair amount of interesting religious and philosophical dialogue in the Ernie and Rose story, with the regular comments about reincarnation becoming the theme of the film.<br><br>The Wade Carney segments, on the other hand, are the disturbing ones, and they're also occasionally incoherent. Long stretches of the Wade segments go by with no dialogue. But as a director, Huckert is no Sergio Leone, so these mute sections do not work. Some of the shots are far too dark to see what's going on, and we're not told what happened in Wade's story--we have to piece it together ourselves. Unpleasant looking people get nude, and in both of those scenes, the action is disturbing. Both involve rape and sexual abuse. Maybe the acting isn't horrible in the Wade segments, but it didn't exactly get these actors more work, either (although one can also imagine them not wanting to pursue more film work after enduring these experiences).<br><br>The psychedelic and incoherent scenes arrive at the hour mark, when Wade and Ernie both head off to the medical center. There is a very long stretch of Huckert trying to channel Stanley Kubrick ala 2001: A Space Odyssey (1968), but the reception is fuzzy. For a few minutes, The Passing begins to more resemble some crazy music video (except that the accompanying music is extremely amateurish synthesizer-oriented stuff; the nostalgic songs used elsewhere are much better and they're well-integrated), but I suppose to his credit, Huckert still manages to convey the gist of the sci-fi section in images rather than dialogue. Some of the effects, including the early computer graphics, are surprisingly good to passable, but as we learn in the credits, the most impressive stuff appears to have been taken from educational software about the brain, authored by a doctor. The main problem here may be that Huckert was trying just a bit too hard to be psychedelic. Scenes were beginning to feel arbitrary, and I felt my attention waning. That's hardly the emotional effect one wants for the climax of a film.<br><br>But if you're a connoisseur of the weird, as I am, this is a pretty important film to check out. In some respects, it resembles the tone and technical qualities of Sweet Sweetback's Baad Asssss Song (1971), just that this is white-trashsploitation instead of blaxploitation. The Passing had been difficult to find on VHS or DVD, but Brentwood/BCI Eclipse recently released it on DVD in their \"Ancient Evil\" set, and usually the films they've licensed end up on other compilations, too.","user":"BrandtSponseller","rank":[15,17]},{"title":"A recondite and very personal science-fiction oddity.","rating":19,"date":"19 May 2003","review":"This film presents two seemingly unrelated narratives...one concerning a young death-row inmate awaiting his execution, the other centering on a pair of aging war buddies who are out of step with modern times and contemplating suicide. These characters merge for a bizarre and unexpected final curtain.<br><br>Despite the observable indicators of a piggy-bank budget, this is an interesting and unusual indie project. Don't expect a marvel of special effects magic or edge-of-your-seat action...this is a quiet, meditative, and curiously spiritual film focused more on the characters than the fantastical situation at hand. As spotty as it may be in execution, THE PASSING is a poignant, thoughtful effort which demands greater regard.<br><br>6/10","user":"EyeAskance","rank":[10,13]},{"title":"Much better then I thought","rating":8,"date":"27 September 2003","review":"*****************SPOILERS******************* Weird movie about two elderly army buddies who, after living together and looking after each other for years, come to the realization that the end is near and how their getting too old and sick to look after and help each other as the thought of death or suicide starts enter their minds. <br><br>The movie then cuts to an unnamed big city where we see a brutal murder and the man who committed the murder is later brought to justice. It then strikes me that the movie plot takes place in the future when it turns that one of the men in the beginning of the movie, Ernie, James Plaster, has submitted his name to a state program that takes the soul of a terminally ill or dying person and somehow puts it into the body of a healthy executed convict. <br><br>Ernie is worried about his friend Leviticus, Walton Benjamin, who's already tried to commit suicide and because of Ernie's failing health he feels that if he's not around to take care of Leviticus the worst would happen to him. It seems that during WWII Leviticus saved Ernie's life in Europe an Ernie feels that he owes Leviticus at least that much. <br><br>Ernie gets his \"Body change\" but when he returns back home to Leviticus as a different and much younger person he finds that what Ernie thought it, the body change, would do wasn't exactly what he expected or hoped for.<br><br>Very good story about a subject that's been done before with bigger budgets and top actors about dying and coming back as someone else, but not under the same conditions as the movie \"The Passing\" has with a more realistic outcome. Too bad this movie is almost impossible to find in the video stores and I doubt we'll ever see it on TV because it's a lot better then most movies about the same subject are.","user":"sol-kay","rank":[9,12]}]