[{"title":"A guerrilla for non violence","rating":14,"date":"14 December 2002","review":"`Bowling for Columbine,' is a very thought provoking film.<br><br>Perhaps the first thought it provokes in any US resident is that the most sensible thing he or she could possibly do is move forthwith to Canada. It's nearby, they speak English almost indistinguishable from standard American, it feels `lighter over there,' you get government health care, there are plenty of guns but very little killing, and you don't even have to lock your doors.<br><br>The fundamental question `Bowling for Columbine' asks is:  What's responsible for the exceptionally high level of killing in America?  Not a lot of guns, Moore points out, because other countries have that.  Not a violent history, because other countries have that.  Not a love of violent movies, video games, and so forth, because other countries love all that too. Not poverty, unemployment, and ethnic diversity, because lots of countries have more poverty and Canada has as much ethnic diversity and more unemployment. Two things, according to Moore, are primary causes:  the US media, which, as he shows, fans up fear constantly among the American populace; and the government in Washington, which solves everything by bombing people somewhere. There's a third thing that emerges more subtly: a gun culture, which leads to the absurd notion of self-defense, perpetuating the violence and the fear and the racism. In this the leading force is that powerful lobby, the National Rifle Association. The result of this lethal combination delineated by Moore, particularly since 9/11, is that Americans aren't very happy people: they live in a constant state of rage, perturbation, and fear, when they're not disolved in tears for the dead who're falling in the houses and streets and schools of the country on a daily basis.<br><br>`Bowling for Columbine' isn't ultimately very cheery or uplifting stuff. True, it has lots of laughs, but most of them are ironic - a little sick-making, when you think about it -- and at American expense.  Those of us who live in the USA and don't actually regard moving to Canada (or somewhere else) as a real option, aren't walking out of this polemical documentary feeling any too cheerful.  One may quarrel with Moore's style, though it seems questionable that so many reviewers have expressed disapproval of his personal appearance (what's sloppy dressing got to do with it?). One can hardly quarrel with most of Moore's basic facts or the urgency of his subject or his commitment to it.  Because of its significance to Americans on both personal and national levels, \"Bowling for Columbine\" has to be considered the most important (and it's becoming the most watched) US documentary film in many a year.  This is being recognized in all sorts of ways, first of all with the special jury prize at Cannes. We shall see what the Academy has to say.<br><br>It's impressive that Moore and two young men seriously injured at Columbine were able by their confrontations to shame Wal-Mart into taking handguns and ammunition out of their stores - and Moore appears to have been surprised and impressed by this result himself.<br><br>Moore has seemed crude and simplistic and confrontational in the past. His methods have not radically changed, but they've modulated into something subtler and less self-serving, such that he has an ability to talk more easily with potential adversaries --  bank employees giving out rifles with new accounts; Michigan militiamen; even Charlton Heston, the haughty President of the National Rifle Association, who invites Moore into his house to film a conversation.  True, Heston ends up walking out of the room after a while, but he doesn't have Moore thrown out.  Nor does Wal-Mart. This is significant.  One is tempted to call Moore's methods (as he wields them today) not crude and simplistic and confrontational, but direct, simple, and honest.  There's something unimposing and Middle American about his overweight slouch and scruffy baseball cap crowned head.  If he lives in a house worth close to $2 million in New York now, you can't tell it from looking at him, and that consciously maintained persona, if we choose to see it thus, aids him in moving through Littleton, Colorado and Windsor, Ontario, and the other places where he got the footage for this devastating, yet simple film. For credibility among US gun-toters like Heston, Moore has an ace in the hole:  he's an expert marksman and a lifetime member of the NRA.<br><br>Heston walks out because he hasn't good answers; in fact he really hasn't any answers at all.  His explanations for why the USA is so violent are ones Moore has already discounted, and he can't justify his brazenly fronting for the National Rifle Association in Colorado and Michigan right after the child murders by children in those two states.  Marilyn Manson (the artist accused of complicity at Columbine because the young killers liked his music) in contrast has not only good answers, but also the greatest zinger in the film.  When asked what he would have said to the youth at Columbine after the murders, he says:  `Not a word. I'd have listened to them. That's what nobody has been doing.'  In between telling interviews, Moore has various ways of documenting contexts:  an animation, recited statistics with images, and astonishing film clips like the Fifties one of cops admiring how realistic some kids' toy guns are, and the one from a metal-detector company pushing for dress codes in schools, showing a boy with baggy pants unloading a whole arsenal.  What's laughable are all such solutions that don't even begin to get at the problem - that are just profiteering from chaos and insecurity.<br><br>It's encouraging that so many people are seeing and commenting on this movie.  When it was over, I wished the lights would go up and there'd be a discussion group held right there in the auditorium.  There was a lot to talk about.  Not everything was by any means clear, nor were all the facts to be bought without question.  But in one way or another, `Bowling for Columbine' brings up all the most central issues in America  today. Michael Moore makes you laugh and cry; but most important, he makes you think.","user":"Chris Knipp","rank":[183,264]},{"title":"A movie that should be mandatory for all politicians","rating":10,"date":"16 March 2004","review":"Yes Mr. Moore may lean left, and yes he may not be the most objective documentarian.<br><br>However the facts stand: America has many, many more deaths attributed to guns than any other nation. It's a sad truth.<br><br>Unfortunately Mr. Moore has been vilified for asking why. And typical of the \"head-stuck-in- the-sand\" mentality of the far right, they are angry for his work, not at the facts.<br><br>This movie is well done and if you're left, right, in-between, gun nut, or responsible gun owner it is definitely worth viewing.<br><br>I suspect most of the negative comments posted about this movie at IMDB and similar sites are by people who haven't seen the movie. They're just angry at what they perceive the movie to be.<br><br>It isn't a movie about gun control. It's a movie that merely ask why so many deaths.<br><br>Enjoy.","user":"octomagneto","rank":[170,256]},{"title":"What's wrong with America?","rating":10,"date":"8 January 2003","review":"Bowling for Columbine is perhaps the most honest and truthful documentary I have seen in a longe time.  Michael Moore manages to debunk the myth that Americans are a righteous people.  He does this by pointing to numerous references in American history where the government has overthrown regimes in favor of dictators and other militant groups.  At the heart of his argument, however, is gun control.  Moore poses the question: Why does Canada have a much lower death rate due to gun violence than the United States when Canadians seem to have the same obsession with guns?  Moore points out that roughly 12000 deaths occur in America as opposed to the few hundred in Canada.<br><br>To answer this question, Moore goes to Canada, where he talks to ordinary citizens.  As one student remarks, Americans seem to want to fight over everything instead of talk things out.  Perhaps, as Moore suggests, there is something wrong with the very framework our country is built upon.<br><br>\nAn interview with Charleton Heston, the President of the NRA, is shocking. What he answers to Moore's proposed question will astonish many.<br><br>\nOverall, it is satisfying that rational and clear-headed individuals such as Moore still exist.","user":"saxman429","rank":[17,21]}]