[{"title":"The Secret to Sucessful Kid's Movie","rating":29,"date":"29 April 2003","review":"Its not often one sees a movie that really seems to understand what its like to be a kid.  Too often, children are portrayed as precocious twenty-somethings trapped in the bodies of fifth graders: children whose wisdom and goodness would make Socrates look like Homer Simpson.   (For further study see Jerry Maguire and Contact).  On the other hand, movies made for the ten and under crowd often take place in a world free from violence and pain, where the worst thing that could happen to a kid is a stolen bike or a serious grounding.  Holes makes neither of these mistakes. The kids and teens are just as dumb as I was, and the world they live in, while not being seriously naturalistic, is, at least, properly serious.<br><br>The movie gets going as Stanley Yelnats (Shia LaBeouf) is mistakenly accused of stealing a pair of valuable shoes, and is sent to a boy's correctional facility.  Except, this juvenile camp feels like Boy's Town if it was run by the guards from The Shawshank Redemption.  There Stanley is indoctrinated by the gruff Mr. Sir (John Voight with crazy hair and a brilliant performance).<br><br>\nThe only activity this camp provides for these wayward youth is digging holes.  The camp's philosophy on this matter is `You take a bad boy, make him dig holes all day, and it turns him into a good boy.'  Whether or not this theory works is doubtful, because Stanley soon experiences many cruelties and humiliations at the hands of his fellow reprobates.  Don't let the cutesy nicknames fool you (X-Ray, Zig Zag, Armpit, Zero), these kids are just like your friends in the sixth grade, or to quote Rushmore, `With friends like you who needs friends?'  Not that the other campers are as bad as all that, nor does the movie focus on the cruelties of youth.  The kids come around, but never completely, and the movie (like Stanley himself) doesn't worry about them too much.  Both of them have bigger things on their mind.<br><br>The story of Holes switches back and forth between the present and the past. Like the palindromic name Stanley Yelnats it begins at opposite ends chronologically and works toward the center.  Where the end of the past story and the beginning of the present story are explained.  The transitions are gentle enough that the viewer does not feel jerked around too much. Even though the transitions are entirely organic, I can excuse the random transitions because, like I said earlier.  The filmmakers actually have something on their mind.  They really do have a story to tell. Furthermore, Louis Sachar, the writer of the book and the screenplay seems to have gotten the tone just right for a movie for kids - just enough silliness and just enough bitterness.  Stanley's father job is unreal (he is seeking to find the cure for foot odor), but Stanley's emotions are very real.  As someone in the movie says (see the movie to find out why), `Peaches and Onions! That's the secret.'  Holes isn't the most brilliant movie of the year, but it is funny without being offensive, and sweet without being maudlin. Most of all, it goes further in capturing what it is like to be young without portraying it as too horrible or too saccharine.  The bitter and the sweet together is the secret of Holes' success.","user":"phishbreath","rank":[113,121]},{"title":"What was Disney thinking? It made a great movie.","rating":10,"date":"28 May 2003","review":"Holes is a fable about the past and the way it affects the present lives of at least three people.  One of them I will name, the other two are mysteries and will remain so.  Holes is a story about Stanley Yelnats IV.  He is unlucky in life.  Unlucky in fact characterizes the fates of most of the Yelnats men and has been since exploits of Stanley IV's `no good-dirty-rotten-pig-stealing-great-great-grandfather.'  Those particular exploits cursed the family's men to many an ill-fated turn.  It is during just such a turn that we meet Stanley IV.  He has been accused, falsely, of stealing a pair of baseball shoes, freshly donated to a homeless shelter auction, by a famous baseball player.  He is given the option of jail, or he can go to a character building camp.  `I've never been to camp before,' says Stanley.  With that the Judge enthusiastically sends him off to Camp Green Lake.<br><br>Camp Green Lake is an odd place, with an odd philosophy, `If you take a bad boy, make him dig a hole every day in the hot sun, it will turn him into a good boy.'  We learn this little pearl of wisdom from Mr. Sir (John Voight) one of the camp's `counselors.'  We get the impression right away that he is a dangerous man.  He at least wears his attitude honestly; he doesn't think he is nice.  The camp's guidance councilor, Mr. Pendanski (Tim Blake Nelson) is a different matter entirely.  He acts the part of the caring sensitive counselor, but he quick, quicker than anyone else in authority to unleash the most cruel verbal barbs at his charges.  The Warden has a decided capacity for meanness, but other than that she is a mystery.  These three rule Camp Green Lake, a place that has no lake.  It is just a dry dusty desert filled with holes, five feet deep and five feet wide.  Its local fauna, seem only to be the vultures, and dangerous poisonous yellow-spotted lizards.  Green Lake seems is, in many ways, a haunted place.<br><br>Holes works in spite of the strange setting, and the strange story, because it understands people.  Specifically because it is honest in the way it deals with the inmates of Camp Green Lake.  The movie captures the way boys interact with one another perfectly.  It captures the way boys can bully each other, they way they can win admiration, the way they fight with one another, and the way boys ally themselves along the age line.  It is this well nuanced core that makes everything else in the film believable. What is also refreshing about this film the good nature of its main character. He does not believe in a family curse, he is not bitter about the infamous exploits of his `no good-dirty-rotten-pig-stealing-great-great-grandfather.' In fact he loves hearing the story.  Stanley IV is not bitter about the past, and determined not let it affect him in the way it has affected his father and grandfather.  There is at times a lot of sadness in the film, but not a lot wallowing angsty silliness.  And that is refreshing.<br><br>\nHoles is an intelligent, insightful and witty family movie.  It entertains, and not in any cheap way.  It is not a comedy, though it has its laughs. It dares to be compelling, where many family movies tend to play it safe and conventional.  As such it transcends the family movie genera and simply becomes a good film that everyone can enjoy. I give it a 10.","user":"driffma","rank":[126,142]},{"title":"Much better than \"Not Bad\"","rating":9,"date":"13 August 2006","review":"I couldn't keep from commenting after reading the very short \"Not bad\" commentary. This movie is much better than just not bad. The acting is stellar, even from the children in the cast, who don't play cute or anything else but act just like my son's friends. The movie is smart and expects it's audience to be as well. The double back flash story lines are imaginative and contribute to the story rather than act as time filler. I watched this movie with my kids and then I watched it again by myself a few days later. If you have kids and are sick to death of movies that inspire a diabetic coma with their syrupy sweetness, then check out \"Holes.\" My 6-year-old enjoyed it as much as my 11-year-old, and my husband and I enjoyed it as much as the two of them. How many movies can you say that about?","user":"galaescobar","rank":[54,61]}]