[{"title":"words cannot convey just how bizarre this movie is...","rating":3,"date":"3 January 2004","review":"The premise- a demon falls in love with a maiden and assumes human form in order to make love to her. She dies as a result of this preternatural union, and the mournful demon cries tears of blood upon their carnal bed. The blood is absorbed, bestowing the bed with a predatory animate existence. Nestled within a ramshackle guesthouse, it lies in wait through the ages...a bloodthirsty canopy bed which consumes anyone unfortunate enough to rest upon it. A strange concept for a horror film, indeed, but the presentation is far, far stranger...<br><br>This no-budget oddity was composed with a very peculiar artistic finesse...not so much pretentious as self-consciously esoteric, it merges trash cinema sleaze with flourishes of oneiric surrealism(it's largely narrated by the spirit of 19th-century nouveau illustrator Aubrey Beardsley, helplessly imprisoned within a painting on a wall opposite the killer bed). This eccentric admixture doesn't really gel perfectly, but that is certainly not to imply that DEATH BED is a bad film, just that it's very bizarre and obvious of its restrictive budget...I personally consider it one of the most original and inventive amateur horror projects I have ever seen. <br><br>Opinions about this one will be all over the board, but there's no denying that DEATH BED is unique. I recommend it strongly to all fans of outré cinema. 7/10","user":"EyeAskance","rank":[54,60]},{"title":"Death Bed: The film from another universe","rating":8,"date":"17 August 2006","review":"I'm not sure what I can add that hasn't already been said in some of these other fine, and quite hilarious, comments, but Ill try.<br><br>So you know the plot: there is a bed possessed by a demon that \"absorbs\" and selectively disintegrates the bodies of whoever (or whatever) lays on it with its orange soda-filled body. We have the man, in some scenes looking uncannily like Robert Smith of The Cure, hanging out inside the wall commenting on the goings-on, and we have our various victims that just cant resist the comfort of this mystical bed.<br><br>This is no ordinary bed. No sirree Bob! Not only does it eat people, but it cleans up after itself, draws the covers back, and it even makes itself. Who wouldn't want a bed like that? It can even use its sheets as a rudimentary \"lasso\" to wrangle escaped victims back in (especially if they're taking up half the length of the film to try and escape).<br><br>Our \"main\" story (if you can call it that), is about these three girls who go out to this remote area to house-sit(??). I don't recall exactly, but it doesn't really matter though as there are plenty of things that defy convention that you just have to give in and accept. The dialogue in the film is like no other; the characters talk to each other seemingly by telepathy as their mouths never seem to move and there is a constant echo. One of our girls believes she isn't liked by the rest of \"the gang\" and makes sure to tell us all her feelings on this matter through an echoey voice-over, but we don't care; character development was thrown out the window a LONG time before in this film so why start now? There are scenes when the bed laughs, snores, crunches, and makes various other noises that we assume judging by our cast's non-reaction to said noises, cant be heard. This and the telepathy makes the issue of diegesis very difficult to ascertain...but thats OK....this is Death Bed: The Bed That Eats and it defies all logic so its OK. It makes for a lush dreamy quality to this most bizarre film If you buy (hehe buy...did I say \"buy\"?) this DVD, make sure to check out the introduction by the director. He explains that the filming of this \"flick\" started in 1972, didn't wrap up until 1977, he shopped it for a few years with no luck, and then fast forward 26 years to 2003 it gets released on DVD. Supposedly someone somewhere had a print of this in some other country and made bootleg after bootleg of it and it was quite by chance, on a message board no less, that our director found evidence that people knew, and gasp! cared, about his little-known film. Its from there that he decided to give it a shot and release it. I'm glad he did. Once you've even so much as heard the title to this film, you MUST see it. I for one am going to buy this and I'm going to preach its gospel around the world...starting with this comment","user":"rivethead808","rank":[38,43]},{"title":"You Already Know If you are going to Like it....","rating":7,"date":"29 May 2004","review":"It's really rather Simple. The Name of the Movie Is Death Bed, The Bed that Eats. If you are anything like me, You already know if you are going to like this movie. I stumbled across this gem at Best Buy the other day and picked it up for Ten Bucks. I got ten bucks worth of enjoyment out of the title, and the box alone.<br><br>I'm a huge fan of B movies. This is in my opinion one of the greatest B movies i've ever seen. Now, it's not for every one.<br><br>Granted, it's not even for most people. As a matter of fact, i suspect their are only going to be a handful of us who truly enjoy this movie.<br><br>For those of you who like B movies though, this film is a Diamond in the rough. It has a great premise, A bed... That eat's people. It doesn't walk, it doesn't move, it doesn't have a siren call to attract people. It pretty much relies on people wandering by and sitting on it.<br><br>I loved every inch of this movie and have already seen it three times in the scant weeks i've owned it.<br><br>Like I said, After reading the title of the film, You already know if you'll like it. If you laughed or smiled, Then give it a go. it's worth it.","user":"Bloody-Thumb","rank":[42,52]}]