[{"title":"A Sobering Look at Gambling","rating":11,"date":"11 February 2005","review":"This film appeared on cable television under the title of \"High Roller.\" It is a well-crafted biographical portrait of three-time world champion poker player Stu Ungar. In life, Stu's nickname was \"The Kid,\" and the film chronicles the descent of an intelligent young man with great promise, who becomes addicted to gambling and ruins all of that potential. As Stu, Michael Imperioli delivers an engaging and credible performance, capturing the essence of a life spiraling out of control from the craving of high-stakes gambling. The cast surrounding Imperioli is excellent, especially veteran actor Pat Morita, who plays a Las Vegas gambling impresario. The film's production values fall somewhere between a competent made-for-television movie and a workmanlike low-budget feature film, attempting valiantly to convey the period styles of the final four decades of the twentieth century. There is one revealing scene with documentary footage of the classic Las Vegas Sands Hotel being imploded and crashing to the ground. That moment vividly sums up of the sad life of Stu Ungar.","user":"lavatch","rank":[20,25]},{"title":"Recognize yourself?","rating":8,"date":"17 May 2005","review":"What is it about certain films that generates such polar opposite reactions?<br><br>Some people here have called High Roller \"disgusting.\" Some have called it \"extraordinary\" (as would I, actually).<br><br>Why? I think it's because films like this don't make heroes out of jerks, or glamour out of degeneration, and some people just can't deal with that emotionally. They NEED a hero. And I'd also add that if they're gamblers or poker players, they might feel personally betrayed when their existence isn't justified.<br><br>High Roller in NOT a poker movie. It's a PEOPLE movie. It's not perfect, but it looks good, is well-written, and wonderfully acted. And best of all, it generates an emotional response and inspires reflection.<br><br>And maybe that's what makes some people so damn mad.","user":"filmflam-1","rank":[19,24]},{"title":"play me in gardena","rating":1,"date":"11 April 2005","review":"An insult to both poker and cinema, this movie manages to make the most dynamic, brilliant, and fascinating figure in poker history into an utter bore. Still a fun film to make jokes about, from the lame gangster movie clichés of the first half to the incomprehensible nonsense of that second hour. Hilariously, Stu Ungar wins all three of his World Series titles without playing a single hand on screen. His infamous dealer abuse? 1 scene. His coke habit? 1 scene. His incredible memory? 0 scenes. They couldn't even get any real poker players. What did they cover? A lot of high angle shots from inside a house in the suburbs. Oh, and a montage of Stu waking up every day and shopping for meat which doesn't come anywhere close to making sense. Why do I care so much about this little Sopranos summer camp trying to cash in on the poker craze? Because I think there's still a great film to be made about Stu Ungar waiting for someone willing to do it right.","user":"kawalsky","rank":[22,29]}]