[{"title":"Finally a film that doesn't assume you're an idiot","rating":9,"date":"28 December 2006","review":"After enduring trailer after trailer with endless stings of explosions, ridiculous CG-assisted stunts and mindless action, I felt very rewarded with an intelligent and intriguing film that defies the status quo of bigger and louder is better. <br><br>The Good Sheperd doesn't insult your intelligence, it stimulates it, sometimes confuses it, and forces you to look several layers beneath the surface. It feels like a throwback to another era of films when the complexity of a character was of greater importance than spectacle. <br><br>De Niro took a page from his producer's best work, Francis Ford Coppola, emulating films like The Godfather, The Conversation and Apacalypse Now. The drama rises not from the usual blatant conventional devices but rather by raising questions because of what we're not told and not shown. It requires a great deal of courage to use this style as films have gravitated more and more toward assuming the average moviegoer is of substandard intelligence. The scope of the film is enormous, yet the point of view is narrowly focused to be seen through the eyes of one man. There are a dozen of subplots, but all are carefully tied into the through-line of the story to match the main character's progression. <br><br>The film may require some understanding of American history from WWII through the Kennedy administration. It starts with the later years of the story, The Bay of Pigs debacle, and traces the steps that lead to it, one of the more embarrassing moments in the history of U.S. foreign policy. I found it a bit annoying that Matt Damon's character, Edward Wilson, barely seemed to age in the film while others around him did (the best way to determine his age is whether he's wearing wire-rimmed or horn-rimmed glasses), but it didn't ruin the film for me. <br><br>Overall though, definitely one of the best films of 2006. A rare film that makes you want to think and understand, rather than forget.","user":"deanmasters","rank":[416,513]},{"title":"The spook who stayed in the cold: an epic critique of the American espionage game","rating":9,"date":"22 December 2006","review":"A gray winter day was a fitting time to see one of the first public screenings of a film called \"The Good Shepherd,\" whose chilly hero Edward Wilson (Matt Damon, in a role modeled in part on CIA founder, James Jesus Angleton) is not so much all things to all men as nobody to anybody. A composite figure in a portrait of the birth, rise, and moral shriveling of the American CIA, Matt Damon's disturbingly shut-down Wilson would be one of recent film's most tragic figures if he were not such a hollow, unappealing man. Directing a long-contemplated project using a screenplay by Eric Roth (who penned \"Munich\"), Robert De Niro has forged a \"Godfather\" of Yankee spy-craft, a heavy, solemn epic about betrayal and loyalty in the world of espionage and counter-espionage dominated not by Italians as in the original \"Godfather,\" though Coppola produced, De Niro directed, and Joe Pesci has one of the liveliest on screen moments, but by uptight, stony, patrician WASPs.<br><br>Indeed as seen here the world of American intelligence is a privileged and exclusive and deeply conflicted one where Irish, blacks, and Italians need not apply; fathers are absent; privilege grows out of Skull and Bones at Yale, wives are betrayed; sons labor desperately to measure up, and the leading practitioners are ridden with guilt and suspicion. There is no one to trust and nothing to believe in  not family or tradition, or even music  only America, which Edward Wilson says belongs to his class. All others are just visiting.<br><br>Into this demoralizing story, damning in its picture of the world of white privilege and of intelligence itself but nonetheless intricately involving and at times genuinely disturbing, are woven some of the major incidents and personalities of the period from from before the Second World War  after which OSS morphed into CIA till after the failure of the Bay of Pigs invasion under JFK, from hot war to cold war. You have Philbys and fake Russian turncoats, CIA execs siphoning off money to Switzerland in guise of chocolate boxes, and through it all you have a Cuba mole investigation that smashes Wilson's own family.<br><br>Wilson's true penchant was for a deaf girl named Laura (an excellent Tammy Blanchard); and with her is the only time Damon seems to develop human warmth. He is forced to marry the more elevated Margaret Russell (an uncomfortable Angelina Jolie) sister of one of his Skull and Bones colleagues who remains Wilson's Old Boy link to privilege ever after. Traumatic embarrassment, revelation of closest held secrets, and doubt of loyalty are seen as inborn elements of the espionage world. The very qualities that make a good spy, as seen here, also make a man untrustworthy.<br><br>Do spies ever have fun? Not much, as seen from the angle of Damon's character. Dr. Fredericks (Michael Gambon), a randy gay pseudo-intellectual who turns and turns again, is naughty, but he pays for it. Another Brit, Arch Cummings, played gamely by Billy Crudup, similarly wears a smile that turns to dust. A good professional of the lower ranks like Staff Sergeant Brocco (John Turturro), Wilson's OSS assistant in England, is a stern sadist whose use of LSD for an interrogation backfires fatally. Nasty sabotages are devised to spoil the left's Latin American agricultural schemes. Big foul-ups like the Bay of Pigs invasion lead to vicious internal purges. And through it all Wilson's son cringes and his wife pines; the marriage had dried up after his six-year absence during WWII; and his imploded selfhood is symbolized by his only hobby, building ships inside bottles. As the film bluntly puts it, the spy-master must choose either family or country; he can't have both. And is it all worth it? The Russian on LSD declares his country's armed might a myth perpetuated by America to justify its ongoing pursuit of world dominance. Is intelligence a needed quantity, or are its organizations self-perpetuating shams? The movie never gives a positive answer. This may be the cruelest picture of the spy game ever put on film.<br><br>Many fine actors play small unappealing roles as spy-masters or cold operatives. These include De Niro himself, Alec Baldwin, and William Hurt, all creditable, but unlikely to get Oscar nods for their tightly held back performances. Damon can be accused of the same limitation, though if his Wilson bothers you, he's done his job better than you may think. And young Eddie Redmayne, as Wilson's grown son, has one of the most gut-wrenching roles in a story notable for its devastating picture of the effects of career on family life.<br><br>Despite its epic scale and length (it's 160 minutes long), \"The Good Shepherd\" is more troubling than flashy, more thought-provoking than moving. Ultimately it may be somewhat an artistic failure. The criticism that it is either too long or too short, that it needed to be pared down or expanded to a mini-series, has some merit. But nonetheless as a work that considers big issues and asks big questions, it's one of the more serious and intellectually stimulating mainstream American films of the year.","user":"Chris Knipp","rank":[335,437]},{"title":"An incredibly complex work and one of 06's finest...","rating":8,"date":"24 December 2006","review":"The Good Shepherd 3.5/4 4/5<br><br>The Good Shepherd is an incredibly complex work and one of the finest films of a quality ripe 2006. Oscar winner Eric Roth continues his brilliant work with this original screenplay, named one of the best unproduced scripts in Hollywood in the late 90's. A film about one of the CIA's founding officers isn't a dream project commercially for a studio but thankfully, the quality of the script was too great to ignore.<br><br>Shepherd follows the life of Edward Wilson (Damon) through his college years at Yale to his ascension as one of the CIA's founding officers and trusted veterans. His extraordinary dedication to his work comes with an unbearable price as he must sacrifice his family to protect his country. At one point in the film, Wilson faces an enormous choice- does he abandon his ideals for what he believes is right? Would this abandonment render his life, almost solely devoted to his country, meaningless? This, as well as a depiction of the result of Wilson's decision, are just two of the moments of brilliance in The Good Shepherd.<br><br>Wilson inhabits a world of betrayal and secrecies only enhancing the irony of the biblical quote inscribed on the CIA's wall- \"And ye shall know the truth and the truth shall make you free\". While we are given a glimpse into the life of a younger, more vital Wilson, the world he occupies creates the characteristically stolid, humorless man we come to know.<br><br>With its vast emotional core, the film seemingly effortlessly navigates one of the most volatile periods in the history of American intelligence while remaining character based. At 165 minutes, it is overlong but remains engaging for the vast majority of its running time. Had a few relatively insignificant scenes been cut, Shepherd could have retained the thrilling and energetic pace it often possesses. However, the length is justifiable as the scope of the film is incredibly large and very few scenes can be deemed unnecessary or dull. <br><br>Robert DeNiro's direction far exceeds that in his debut, 1993's \"A Bronx Tale\". Normally portrayed as a brute, here, DeNiro assuredly handles every moment with an innate tenderness we rarely see in his work. He appropriately treats Shepherd with a precise attention to detail often attributed to some of the greatest directors of our time.<br><br>A silently haunting Matt Damon carries the film on his shoulders. Edward Wilson is completely introverted and while Damon internalizes his thoughts, some of the films greatest moments are when emotion unknowingly pours out of Wilson through a mere flicker in his eyes. Angelina Jolie and Michael Gambon deliver very strong turns amidst a one of a kind cast topped off by the return of Joe Pesci, whose last acting stint was 1998's \"Lethal Weapon 4\".<br><br>The Good Shepherd is a film that demands to be seen. It is surprisingly apolitical as Wilson's life and its disintegration are the true story of this epic. While some call it \"unsentimental\", exactly the opposite is true. It is a testament to Roth's script that a film with such an introverted protagonist provides such a visceral, affecting experience. Shepherd is an intelligent, poignant look at the cost of blind dedication and constant secrecy. The effect this has on Wilson's life is irrevocable as we are taken on a remarkable cinematic journey, one that should be remembered as one of 06's greatest.","user":"HhH43089","rank":[285,371]}]