[{"title":"This picture did what it was intended to do.","rating":10,"date":"1 March 2004","review":"A lot of critics I have heard disliked or even dismissed this movie.  They seemed to think that the movie should have focused on Christ's ministry and his teachings, and not on the crucifixion and the events leading up to it. These critics miss the point of this movie.  As with all movies, The Passion was directed at a target audience, in this case Christians.  The point of the movie was simply this: to make Christians understand, in a visceral way, what they knew intellectually from reading the bible: that Christ endured a horrible and brutal death in order to save us from our sins.  It was completely successful in this, and was, perhaps, the most powerful movie I have ever seen.","user":"efenster-2","rank":[189,233]},{"title":"Emotional experience and cried like a baby","rating":10,"date":"9 March 2020","review":"To this day, the most powerful and emotional, moving movie I have ever seen. Raised a Catholic, I realized that this movie was basically everything I expected it to be. My eyes were so swollen from the crying and tears I shed. I gave my life to Christ in 2011 and this movie sent one clear message - the only way to God is through Jesus. Never have I ever cried and sobbed during a movie than I did for this one because it all happened and One Man endured all that viciousness, torture, pain and death for all of our sins. I applaud Mel Gibson on this film, the cast and the crew for giving us this once in a lifetime movie!","user":"driveboy","rank":[27,31]},{"title":"The cause of confusion","rating":10,"date":"18 May 2015","review":"I've seen a lot o people talking trash about this movie - even a lot of christians -, and I find it hard to understand why. Philosopher Peter Kreeft called it the \"most beautiful movie ever made\", and when I think about it in the light of the Christian faith, it's hard to disagree.<br><br>First of all, passion means suffering, and for all those people that complain about the violence in the movie, I think it's because they don't get Christ's Passion at all. The emphasis on violence is fundamental, as it's what reveals how much God suffered because of what I did. So I, the spectator, am experiencing with all my emotions what I can only imagine and reflect about when reading the Gospels. And I'm not the kind of person that reads about Jesus crucified and direct relates it to all the bad things I did to contribute to that moment, and even when I do, it's more like in a lucid, almost indifferent way, while the movie forces me to feel the burden that I've put on My Lord's shoulder.<br><br>This is of course from my Christian perspective, and I wouldn't even try to talk about what's great in the movie from a secular perspective. The lens through which one watches it it's what define its greatness. And that lens is faith. So I really don't think it's a big deal if an atheist doesn't like it; but if a catholic doesn't like it I'll be confused.<br><br>The way Jim Caviezel plays Jesus is so powerful. He seems very humble, very vulnerable, very soft, yet very strong and confident. When he talks to the people, you feel so much goodness in his tone; when he is accused of blasphemy you can feel his innocence even if nothing is spoken. When he is carrying the cross and falls, Mary runs to him and it's such a symbolic scene of how much she loves her Son, and how much she wants His suffering to end, even though she accepts the will of God.<br><br>Mel Gibson did a great job with all the symbolism in the movie: Mary's obedience; Judas' desperation; all the people shocked by Jesus' mere presence. There's so much of it, and it feels so natural.<br><br>I can only assume that christians that don't like The Passion of the Christ are those that didn't actually take their time to think about the Passion of Christ. The movie is a chance to do so. It's ugly and repulsive? Yes, but only for a moment. When you realize that it captures the essence of God's love for humanity, it becomes eternally beautiful. Jesus didn't have to do that. He did because of me, because of you; because He is the good shepherd that lays his life for the sheep.<br><br>So what if the reality of the Passion is full of gore and tears and injustice? We are the cause of that, and sometimes we better realize it by having it thrown on our faces, however hurt we may end up feeling. Just remember that our pain is nothing compared to our Lord's pain. I can only speak for myself when I say that my love for my Savior is very small; but I know very well that He loves me with a heart that is ready to bleed without hesitation, even though I'm not worth it.","user":"diddykv","rank":[97,126]}]