[{"title":"An exhilarating thrill ride!","rating":8,"date":"13 September 2004","review":"Awesome flick! Kept me on the edge of my seat from start to finish. The plot twists were surprisingly convincing and I didn't have to stretch too far to suspend disbelief. It way outshone my expectations and I found myself swept right up in the action. The acting was superb and the direction kept us moving from nail-biting suspense to laughing at the stereotyped ignorant store clerks, nasty lawyers and others that are encountered at various points in the script. What a great balance of believable and amusing! We had the greatest time enjoying this film. The parts that weren't so believable were very satisfying and the parts that were believable were incredibly suspenseful. The point is, the whole thing made for a terrific package. No, you won't go home a better person for having seen this. And you won't carry the images with you or ponder great philosophies because of it. It's not a To Kill a Mockingbird of Of Mice and Men, but it is a wonderful escape from all you problems for a couple hours and you'll feel like you've been on the most exhilarating thrill ride you could find in the park! All thumbs up for this one!","user":"lquisp","rank":[181,245]},{"title":"Very enjoyable","rating":13,"date":"13 September 2004","review":"My husband and I saw this movie last night, and were extremely pleased by it. The movie starts with a bang immediately and keeps going! We found it well written, well acted and well directed. It's suspenseful and quite thrilling. I thought the actor's characters were right on target - the self centered young man, the distraught and frantic mother, the tired cop waiting for a retirement he's not quite sure he wants, and the baddies - whooo boy! In this movie, the baddies are without any redeemable features - the kind that you yourself would like to beat the tar out of!! Speaking of beating the tar out of someone, wait until you get a dose of the lawyer - egads. The movie is fast paced with nary a dull moment. The action scenes were great, and the building of the tense moments was very well done. Drama, suspense and with a touch of comedy - what more are you looking for in a movie?","user":"belleek78","rank":[165,231]},{"title":"Keeps you on your toes","rating":8,"date":"5 May 2006","review":"I happened to catch this movie during a free-preview weekend on Starz. I had never heard of it, so I did not know what to expect. For the whole duration of the movie, about 90 min., I was at the edge of my seat. The plot takes several unexpected turns and is packed with continuous action, while the characters are very believable. O.k., fine, it does not deal with deep moral issues, if you want a movie that will make you want to go out and change the world this is not it. But if you want an entertaining movie that will give you a big dose of adrenaline, will have you raise yourself from your seat, I strongly recommend it. By the way, I am not a big fun of horror teenage movies like Scream, I just don't find them believable, and find the characters shallow. The best part about this movie is that you actually feel sympathy for the victims, the plot is probable, and the action scenes do not require that the actors possess superhuman strength. At the end of the movie the only thing I could think of was \"holy cow\", a response I usually associate with a great roller coaster ride.","user":"stepenwolfgr","rank":[50,68]}]