[{"title":"I didn't expect the Ten Tigers of Kwantung!","rating":8,"date":"30 May 2005","review":"Around the World in 80 Days (2004), starring Jackie Chan, currently has an IMDb user rating of 5.7. And they say it's one of the biggest flops in history, having failed to recoup more than a fraction of its (estimated) $110 million budget.<br><br>I say, give it time! Overseas box office plus rentals and DVD sales - this movie will turn a profit in the end. As I understand it, movie companies now make most of their money off the rental market, so I am rather mystified to hear that a movie flopped just because it didn't earn back its cost at the U.S. box office in the first couple of months of release. Doesn't seem like a fair and complete calculation to me.<br><br>Anyway, I go to the trouble of wondering about this because I thought this was a great and delightful romp of a comedy, and I believe posterity will be much kinder to it than \"5.7\". The movie is witty, beautiful, well-acted and contains virtually everything any kung fu adventure fan's heart can desire. Before watching it, I thought it would be more faithful to the original book, so I was surprised to see the Ten Tigers of Kwantung, and let me say the surprise was 100% positive. This movie is, absolutely first and foremost, a comedy. And it is something so rare as a literate one, which does not ridicule the premise it is based on. The movie makes the only right choice, namely to update the classic story and add new levels and new ideas, which keeps it fresh and adventurous. Let's face it, Jules Verne's science no longer holds up in the present day, so we have to make modified versions of the stories for a modern audience (hence also the very entertaining updated version of Journey to the Center of the Earth: The Core).<br><br>To see this movie as a remake of the 1956 movie - which seems to be the position that many reviewers take - is completely faulty. This is a riff/homage to the original novel, having nothing whatsoever to do with any previous movie version.<br><br>I thought Jackie Chan's part in this movie was great fun, and I was very entertained throughout. I can't think why it bombed in the U.S. I'm gonna get it on DVD very soon.","user":"sarastro7","rank":[89,109]},{"title":"Decent entertainment, but forgettable.","rating":6,"date":"8 July 2004","review":"Jackie Chan has had a mixed time of late in Hollywood. There was the good fun of Shanghai Knights and around that was the poor duo of Tuxedo and The Medallion. This falls somewhere in the middle. Around The World is good fun. It's not great but it has charm and energy and is the sort of mindless, competent movie making that is hard not to enjoy watching. It's forgettable, could have been much better, but all in all not a bad way to spend a Saturday afternoon.<br><br>The look of the film feels very Disney. It is all very much orientated towards satisfying children. It's almost a cartoonish realism with the set design and costumes, clearly evident with Philleas Fogs gadget laden home. The action in the film and the looks could probably have been more gritty but in any case it looks very colourful and the various settings all catch the eye. It is clearly evident that the film had a lot spent on it, although some of the CGI effects are not of the standard expected from a $110 million film.<br><br>Cast-wise, Jackie Chan as ever is good. He's a comical genius and as usual performs his own stunts. The fight scenes are good. Nothing compared to Chan's Hong Kong stuff but far superior to much of his Hollywood action. Steve Coogan is someone I am a big fan of. He is the dog's hairy things as Alan Partridge. He is a comical genius. He doesn't seem as entirely natural here though and the character he creates doesn't always work. It seems too cartoony at times especially the accent. Cecile De France is very good as Coogan's love interest. She is attractive, in a cutesy sort of way but she has a charm and a likeability that works very well and the three leads seem to have a good chemistry. The rest of the cast are all excellent with a huge list of supporting parts and cameo's including an excellent Jim Broadbent, a great part for Ah-nuld Schwarzenegger, and it was great to see him on screen with Chan, also Rob Schneider, Luke and Owen Wilson, John Cleese, Kathy Bates, and particularly exciting to me as a Hong Kong action fan, Sammo Hung. The best supporting part for me was Ewan Bremner as the accident prone police sergeant.<br><br>Overall it's worth watching and is entertaining enough but don't expect it to blow your socks off. ***","user":"supertom-3","rank":[62,75]},{"title":"Three Screenwriters Named Dave","rating":6,"date":"16 June 2004","review":"The credits roll, and I sarcastically turn to my friend, and whisper, \"Dude, 3 screenwriters, and they're all named Dave.\"<br><br>Oddly enough, that turned out to pretty much sum up the whole movie.<br><br>It's not BAD.  It leans toward good, except it's not so much a remake as it is a Disney-fication.  Like 'Cinderella' and 'The Little Mermaid' before it, Disney takes the title of the story and a few major characters, and just turns it into a theme-park attraction with emotional and dramatic resonance to match.<br><br>Frank Coraci is solely responsible for making Adam Sandler's star stick. \"Happy Gilmore\" was cute, but it didn't have the style of a REAL movie, like his two films with Coraci, \"The Wedding Singer,\" and \"The Waterboy.\"  Those films work as FILMS, not just Adam Sandler vehicles.<br><br>I had high hopes for this one, and for that reason, it splatted.  Amusing lines here and there, and great kung-fu choreography ruined by the same poor photography that screwed up \"Rush Hour.\"  This is martial arts.  DO NOT shoot your actors from the waist up.  Things happen too fast, people are moving in too many directions.  So in \"80 Days,\" like in \"Rush Hour,\" I had a sense that there was martial arts taking place, but could barely see it. Coraci does pull the camera back a few times, down to the ankles maybe, so a few scenes are reasonably well-shot.  But not as well as they could have been.  In fact, the entire movie feels rushed, like they're trying to cram the whole script into the alotted time frame.  Some \"Indiana Jones\"-type pacing would have worked wonders, even if it made the movie 30 minutes longer.  We're still talking about the book 100 years later for a reason, you know.<br><br>What could have been fun for everyone turns into Disney-video wackiness that will barely appeal to anyone over 13, and not at all to any fan of Jules Verne.  And thus the old rule applies once again.... the more screenwriters, the worse the film.  Even if they're all named Dave.","user":"Quicksand","rank":[43,58]}]