[{"title":"A pleasant surprise; heartwarming and wholesome in the vein of \"My Girl\".","rating":7,"date":"11 February 2006","review":"Going into \"Daltry Calhoun\", I really didn't know what to expect. I've been a long time fan of it's star, the likable Johnny Knoxville, and knew it was something of a comedy, but that was about it. I surely wasn't expecting the type of movie that I got, but it was by no means a let down either. \"Daltry Calhoun\", While named after Knoxville's character, is actually more the coming of age story of Calhoun's daughter, June, as she's reunited with her father. The story is told from her point of view and is very pleasant, heartwarming and damn near a \"family\" type of film, save for a bit of bad language (probably the only time you'll hear \"family\" describing a film with Quentin Tarantino's name on the cover). It almost reminded me of a more contemporary and far less cheesy version of \"My Girl\", which will leave most of it's audience going \"awww.\" as oppose to \"haha\". But for the kind of movie it was, a light sentimental comedy, I found it quite enjoyable.","user":"reynolds3000","rank":[22,23]},{"title":"A forgotten gem...seriously.","rating":9,"date":"15 March 2006","review":"Johnny Knoxville gets slammed for his acting, and it would be fair to say he isn't the best actor in the world, nor is he ever likely to be - this coming from someone who is a massive fan of his. But this film proves, certainly more than the 'actually better than it should be' Dukes of Hazzard that he can actually act.<br><br>This movie didn't do much for me on the first viewing - Which doesn't sound like much of a recommendation - but I would urge people to give it a chance. I found with each subsequent viewing, it just gets better and better. Everyone is the cast, from Knoxville to the supporting cast members, plays their parts brilliantly and makes their characters believable. For me, Knoxville really shines when in his scenes with Sophie Traub who plays June. There is a very endearing awkwardness to his character and he is very likable in this role. The other actors - especially the aforementioned Traub and the criminally underrated Juliette Lewis help to round out a solid cast. I would say that there do seem to be rather too many plot threads going on at one time, and perhaps the film would benefit from a few of them being trimmed and the film just concentrating on Daltry and June's relationship, but other than that, this film is actually well worth your time and effort to watch.<br><br>This isn't the best film in the world, nor is it ever likely to become so, but if you just want to see a sweet, well acted 'Sunday afternoon' type movie then give it a chance. Not every film has to be 'The Godfather', not every film has to change your life or make a difference. Sometimes all you want is to be entertained, and this film certainly does that.","user":"mariegeorge","rank":[13,15]},{"title":"A beautiful, poignant film. Don't miss it!","rating":10,"date":"24 September 2005","review":"\"Daltry Calhoun\" is a tall refreshing drink of pure spring water in the sewage that's spilling out of Hollywood today. A beautiful, poignant, sweet character drama about a father who reunites with his 14 year old prodigy daughter. Johnny Knoxville is both funny, sweet, and endearing, but the real star is Sophie (I forget her last name) who plays June. Her performance is so powerful, funny, and magentic that you feel you're watching someone who will be a major star in a few years. Katrina Bronson's script and direction has that delicate but surehanded touch that I felt when I first saw \"Lost in Translation.\" If you want to go to a movie to feel good and have something truly tug at your heartstrings, go see it.","user":"eliroth","rank":[31,47]}]