[{"title":"If stoner comedy has a place in the satire canon, this is one of the best.","rating":30,"date":"30 July 2004","review":"If two chicks sitting in stalls playing 'Battleshits' while the two Indian and Asian 'heroes' hide between them suffering the sounds and smells of scatological low humor sounds funny to you, then you should consider seeing 'Harold and Kumar Go to White Castle.' My last stoner movie, the remake of 'Starsky and Hutch,' was indeed Sunday school by contrast.<br><br>Director Danny Leiner ('Dude, Where's My Car?') has taken this genre and made a classic, not just because it exploits every possible ethnic stereotype with zeal equaled only by 'Bad Santa's' decimating the Christmas formula. 'Castle' has such fun imitating the roguish good will of the Hope/Crosby road pictures while commenting on the egregious weaknesses of parents and police that almost anyone who doesn't mind a breast or two bared in the name of satire can laugh heartily at modern adult pretensions and youthful indiscretion.<br><br>Harold and Kumar are trying to find an all-night White Castle after experiencing the sudden yearning that afflicts almost anyone who has had a 'slider' burger. Like that little square of fat and calories, the pot and girls are just too good not to indulge now and then. The two early twenties students, one a serious stock analyst and the other a lazy pre-med genius, are like Hope and Crosby in their witty repartee and canny ability to escape harm. Being delivered from the wrath of seriously deformed 'Freak Show' and his siren wife doesn't deter them from considering the affections of the battling babes or idolizing Neil Patrick Harris in a cameo playing himself as a lethal womanizer.<br><br>More serious is the multicultural subtext about stereotyping (Asians are nerdy number crunchers and Indians are overachieving medical doctors, for instance) overturned by, for instance, morphing a seemingly 'Joy Luck' club gathering into a raunchy party or exposing a gang of mouthy skinheads as 'girliemen.' It's all pop-cult fun at our own expense, something akin to actually enjoying the articles in 'Playboy' even if they weren't our reason for buying the mags.<br><br>My grandson Cody and I bonded once again, this time just laughing at the silliness, enjoying the satire, and figuring how we could get his dad to allow his young brother to see it, despite the lurid spots that give spice and lend naughtiness to our increasingly dangerous lives.<br><br>If stoner comedy has a place in the satire canon, this is one of the best.","user":"jdesando","rank":[220,252]},{"title":"Jim Blesener and Cat Stevens Go to Black Shack","rating":9,"date":"31 July 2004","review":"I haven't laughed that hard at a movie in a long time. Being a fan of White Castle and the talents of John Cho and Kal Penn, this movie was a sure fire hit. Normally I would think a script about two stoners on a quest for White Castle sliders would be boring, if not retarded, material... but this movie just works. <br><br>Let's face it - the stoner angle may not appeal to everyone, but their quest is just too good/funny to pass up. There are more wacky moments than most \"buds hit the road\" comedies can muster. Imagine Neil Patrick Harris (NPH!!) playing himself - well, he flippin' does here, in a very funny, if slightly disturbing, role. The comradeship between John and Kal is fantastic. They'll probably remind you of two old buds from college - or maybe even hit closer to home.<br><br>I'm not sure if it's the great delivery by John/Kal, maybe the writing, or a both - this movie is really a great time. The whole theater was laughing - I haven't heard that in A LONG TIME. Did \"Bruce Almighty\" do that? No. Did \"Envy\" do it? Hell no. Did \"50 First Dates\" do it? Ummm, no.<br><br>Bottom line - this is a good movie that actually delivers the laughs.","user":"MaxZorin","rank":[100,117]},{"title":"Hilarious Stoner Comedy...Everything \"Dude Where's My Car\" should have been","rating":9,"date":"9 September 2004","review":"\"Harold And Kumar Go To White Castle\" is an amusing, hilarious comedy not to be taken too seriously and not to be dismissed as just another silly stoner comedy. Certainly there are plenty of elements which appeal to those dophamine, \"good times\" movie-goers, yet there are also some classic instances of comedic greatness. Aside from chronicling two inane potheads on a quest to satisfy their appetites, \"White Castle\" offers a great coming-of-age and funny coincidence premise, which reminds us of the heavy, sadistic curveballs life hurls at us, sometimes when we merely desire something simple and cannot attain it. Here is a story of a simple goal by two simple minds: to find a White Castle hamburger joint and fulfill the lasting effects of \"the munchies\". Yet, as these two stoner friends come to realize, even the seemingly simplest of goals in life can be impossible to achieve, due to such disturbances as irony, circumstance, error, and misfortune, as they are all encountered in this journey. The comic elements are listless: stoner instinct-gone horribly awry, catastrophic error, not-so-pleasant raunchy surprise, near-death escapes in the most unlikeliest of ways, and the eventual finesse of overcoming all obstacles to finally enjoy a binge at a hamburger joint. This is a fresh, original, and satisfying comedy, and though it is nothing of a brilliant production or a cinematic masterpiece, there are plenty of the elements here which constitute for a barrel of laughs and a genuinely entertaining experience at the movies. ***1/2 out of ****","user":"CurtMan@LVCM.com","rank":[133,167]}]