[{"title":"Uh, Honey, Where'd the Boat Go?","rating":6,"date":"24 August 2011","review":"A short and sweet gimmick movie about two people who are stranded in the middle of the ocean when their scuba diving boat leaves without them and then face the ordeal of slowly dying (of dehydration and/or exposure) or quickly dying (gobbled up by sharks).<br><br>The obvious question of course is: can a director pull off a visually interesting film when the bulk of it consists of two people sitting immobile in the water? The answer is yes, mostly. The film does a good job of creating a dreadful feeling in the pit of your stomach, not because we care all that much about these particular people (the characters aren't developed enough or likable enough for that) but because the situation they find themselves in taps into any number of visceral fears that just about anyone could relate to.<br><br>And kudos to the writer and director for having the guts to go for the grim, nihilistic ending.<br><br>Grade: B","user":"evanston_dad","rank":[22,26]},{"title":"\"We Paid to do This.\"","rating":10,"date":"13 March 2005","review":"This has to be the angriest line in the entire movie (\"We paid to do this!\"), uttered in a furious, hopeless growl by Daniel (Daniel Travis) as he and Susan (Blanchard Davis) float and drift aimlessly in the calm waters of the Atlantic after being left behind by their cruise and slowly yet inexorably lose any hope of being rescued by anyone. Because it sums up the way reality becomes a surreal nightmare -- young yuppie couple pay for a vacation getaway in the Caribbean and find themselves being shark bait, and who really is to blame? Them? The crew's carelessness for not doing a name count? They could have gone skiing (no sharks there) and not been stuck in this quandary. What have they done to deserve this? <br><br>There are no answers to these questions, only open sea and the mounting dangers just below the surface. To know that these dangers are there, but not to see them, is just as bad -- even worse -- than to actually see them. Chris Kentis, thankfully using the less is more approach and shooting the film in an anti-conventional form (no artificial lighting, no backdrops, no CGI sharks, no large water tanks substituting for open sea for close-ups, digital video), creates a visceral experience with this short movie that relies on so much since almost an hour is spent in the water. Never does a moment go by feels like filler: the events feel real, the mounting desperation as Susan and Daniel slowly realize just how dire their situation is feels right (even though sometimes the delivery feels too flat -- but this is perfectly fine, since this is how people actually talk instead of talking in speech), and the timing from when the fake shark head which Daniel ironically sticks his head into in the marketplace, from the mention of sharks about 20 minutes in, to the actual, split-second appearance of a shark's fin and tail 30 minutes in is great and its quiet yet horrifying conclusion in many ways, outdoes JAWS. No swelling music, just the vague, grey outline of the animal beneath the surface, and that alone is enough to create moments of incredible dread, especially in the best sequence in the film: its night sequence, where all we see is what they see, darkness and each other once lightning flashes, drowning their screams and implying another shark attack.<br><br>However, OPEN WATER is not a movie about fear in itself. It's more about this vast, stomach-turning emptiness of how suddenly meaningless our lives become when put into a (pun intended) fish-out-of-water situation. It's not only knowing that the waters are infested with sharks, but knowing that the end will come.","user":"nycritic","rank":[108,154]},{"title":"Didn't do it for me","rating":3,"date":"19 May 2007","review":"I thought the \"meat\" of this movie was fair, it was the parts leading up to it and the ending that were awful. This might have done a lot better as a much shorter film. Even at only an hour and 20 minutes, it was about 30 minutes to long.<br><br>The character development is *weak*. If you're not going to bother doing some real character development, don't do it at all. For the first 25 minutes, I could have been watching my girlfriend and I go through our daily ups and downs. If I wanted to watch that, I'd just video tape any random couple for a day and have all the footage I needed. The acting was fair at best. The chemistry between these two never worked for me. The bedroom scene was really a mystery to me. Here's our lovely female lead, nude in bed. Boyfriend jumps in, they kiss, she wonders aloud if she's in the mood, they kiss, she decides she's not in the mood but wants to talk. He rolls over and they go to bed. I very much felt the only reason scenes like this were in the movie was to make it long enough to turn into a \"feature\" picture and put in theaters. Some of the deleted scenes reinforce this point as we're subjected to a scene that shows the alarm going off, the characters laying in bed, struggling to wake up, and then a 30 second shot slowly closing in on the ceiling fan. That's right, 30 seconds of ceiling fan action. Dramatic! I thought the ending was hacky as well, as if the writer had no idea how to end this movie. Techncailly, they didn't, as it was based on a true story and the true persons who experienced this are, of course, dead. Boyfriend has bled out from a shark bite inflicted late the previous day. Girlfriend pushes him away and he is quickly devoured by sharks. The last scene shows girlfriend commit suicide by drowning herself. First off...it's hard to drown yourself without weights. The body is naturally buoyant and it would take a heck of a lot willpower to keep from jerking your head above the water. Drowning hurts. A lot. The vast majority of the population would surface to stop the pain.<br><br>Secondly, how do we know this person committed suicide? Why not show the final image of the girlfriend adrift by herself? For me, that would have been a lot more dramatic than seeing her commit suicide in suspect fashion.<br><br>Had this movie started as the couple boarded the boat and ended with the camera slowly pulling back from girlfriend, alone in the water, I would have given it 6 stars. Combined with the hackey front \"half\" of the movie and the cop-out of an ending, I was pretty unsatisfied.","user":"metsisme","rank":[40,59]}]