[{"title":"I enjoyed this movie","rating":8,"date":"23 February 2020","review":"I don't know why so many people say that this oneis not good enough like the first movie. This has some better made actions than the first and very good job by thedirector who makes many great scenes whichmake more ..... the movie.","user":"MR_Heraclius","rank":[39,40]},{"title":"Viva Pirates!","rating":8,"date":"10 July 2006","review":"Well, first of all, when I read the review for the movie in my hometown paper, I was a little scared that Pirates might be a let down. The trailer and the movie clips, it seemed, didn't really let on that there was much of a story line -- that it just kind of goes on and on and on, like the Matrix 2, with no storyline -- just fighting. Plus, most people do agree: sequels are hardly ever as good as the originals. And in this case, it's true... Pirates of the Caribbean: Dead Man's Chest isn't the original. But, its an awesome movie in its own right! There are a few surprises in this movie. A few characters come back from the first that you wouldn't expect to see in the second. but... um! that's all I'm saying. This movie is definitely a lot more violent and gory than the first one. Don't bring the little kids to it. But, trust me -- this is not a Matrix-type movie... There is an actual storyline. And a good one at that. Capt. Jack Sparrow is back as well as Elizabeth and Will, who are forced to find him and obtain his compass, or else they will face the gallows. Well, actually, Will has to find him. Elizabeth escapes, and yes... as you've seen in the trailers, she does dress up like a man for this movie. Making it all the more comical. (you'll see what I mean).<br><br>The comedy was superb in this movie. Of course, it wasn't as good as the first, but you can't expect it to be. Yes, there were a few instances were they could've shortened the fighting scenes, but it was very well shot and scripted.<br><br>I wish they would've changed a few things about the movie, but you can't have everything. And don't expect everything to be resolved at the end. No! There's a cliff-hanger ending that leaves you wanting the watch the next one the moment the credits start rolling.<br><br>If you like the first movie, you'll like the second... And that's all I'm saying.<br><br>Jack Sparrow: \"Why is the rum *always* gone?\" (he stands up and staggers) \"Oh... That's why.\"","user":"skyblueangel-1","rank":[67,87]},{"title":"Great fun, perfect visuals","rating":8,"date":"8 August 2006","review":"This movie has everything a good blockbuster should have: star cast, special effects, a healthy dose of drama, romance, a villain (so to say), sadly also a rather weak story, with an ending just calling for \"part three\" (just like the last second in the Matrix trilogy) I didn't get that feeling, that the adventure is finished somehow, more like a soap opera ending. On the other hand some dialogs are really funny, and the whole movie is more like a parody on pirates. <br><br>All and all: go and see this, sit down in that cinema and have a good time with friends, but if you are more into \"heavy for the mind\" stuff, this is not a must-see for you.","user":"baelara","rank":[72,95]}]