[{"title":"Not for the casual moviegoer","rating":9,"date":"24 May 2003","review":"It's 1962 New York. Barbara Novak (Renee Zellweger) has written a book called \"Down With Love\" convincing woman that they don't need a man or love or sex to succeed and be happy with themselves. Womanizer Catcher Block (Ewan McGregor) is determined to prove her wrong.<br><br>This is many things--an affectionate remake of those silly Doris Day/Rock Hudson movies; a sweet sendup of them at the same time; a perfect example of 1960s sex comedies with a 2000s twist; a huge barrel of laughs for film buffs with its perfect remake of a 1960s film and an examination of sexual mores and stereotypes of the 1960s.<br><br>The movie look like a Day/Hudson movie right down to the fashions Zellweger wears, the VERY colorful sets, the obviously painted backdrops from penthouse apartments and the crappy back projection in cars. There's also a hysterical (and very dirty) use of split screen during a phone conversation between Zellweger and McGregor. The movie even opens with the old Cinemascope logo used in films of that era!<br><br>The cast is right on target--Zellweger and McGregor give their all to the performances--they wink at the audience all the time...but not TOO much. David Hyde Pierce (doing Tony Randall) and Sarah Paulson are also very funny with the dreaded best friends role. The only real problem is the script. It is sharp and funny but occasionally bogs down and some of the twists are too obvious.<br><br>Still, I enjoyed it. The casual moviegoer will probably hate this--unless you get the inside jokes all throughout the film you'll think you're watching a badly dated sex comedy. But it's not--it's a parody and an affectionate sendup. This will be most appreciated by film buffs or students.","user":"preppy-3","rank":[87,124]},{"title":"An underrated gem - glowing pastiche with a post-feminist twist","rating":17,"date":"17 May 2004","review":"I'm surprised to read so many user comments which indicate that Down With Love received some critical acclaim - I recall a very different response, where critics seemed hugely and almost unanimously underwhelmed (maybe this was a UK response?) and consequently, I wasn't expecting too much. This only enhanced my enjoyment - what an underrated gem this movie is!! <br><br>I rarely like Zellwegger, but here she was pertly perfect, and McGregor was simply fabulous - dashing, charismatic, loathsome, even vulnerable, especially when he occasionally slips from his duplicitous fake self (when he notices a lash on her cheek, for example), and always delivers his lines with exquisite (and surprising) comic timing. The support cast were also excellent, especially Hyde Pierce, although he was not a 100 miles from his decade-long stint as Niles Crane. <br><br>The set, costumes, production design and cinematography were also outstanding in this movie, evoking the brashly-coloured, kitsch, fluffy-light ambiance which pervades the early 1960s New York screwball romance movie genre, but the snippy script and slick direction removed this pastiche away from its potential as mere enchanting, screwball fable to a witty, post-feminist send-up of this Hudson/Day romcom genre - and indeed, the battle of the sexes. To its credit, Down With Love doesn't collapse completely into mawkish sentimentality with Novak (Zellwegger) suddenly capitulating into the cult of domesticity, tamed by her man, which is often the fate of modern post-feminist heroines - instead, the couple compromise, and we can be sure that she won't be confined to the suburban purgatory she comes to dread. <br><br>In all, a fun, fab and brilliantly executed movie, which has been clearly (re)created with due love for the genre it so skillfully parodies, yet in the light of postmodern sensibilities by adding a much-needed post-feminist twist.","user":"garboventures","rank":[78,111]},{"title":"Down And Then Some","rating":3,"date":"6 June 2009","review":"I loved the Doris Day/Rock Hudson pastiches and some of the comedies that followed with the extraordinary Doris and a varied but terrific succession of leading men. In particular with James Garner in \"The Thrill Of It All\" The secret there, I believe, was a smart and knowing script an unmistakable chemistry between the stars and performances that were solidly based on reality no matter how \"out there\" they seem to be. Here, the whole thing is so self conscious that we are never allow to go beyond it and actually enjoy the whole thing. Rene Zellwegger is a very good actress but not a natural comedienne. She's at her best when she's thoroughly thorough as in \"Nurse Beatty\" where she was very funny mostly because her conviction was so convincingly strong. Here she plays it like in a SNL sketch and could have worked if it had had the length of one of those sketches. In \"Down With Love\" she's downright annoying. Ewan McGregor, one of my favorites, is not even there. Let me explain. Think of Rock Hudson's commitment to those roles. The charm he was able to emanate and how naturally he became the foil for Doris Day. Here Zellwegger and McGregor don't play opposite each other but against each other. No chemistry whatsoever. Ewan McGregor so wonderful, powerful and beautiful in \"Velvet Goldmine\" \"Shallow Grave\" not to mention \"Moulin Rouge\", is kind of insignificant here. Yes, I'm amazed myself. Doesn't have a hint of the romantic manliness of Rock Hudson, isn't that funny? I didn't like either the on the nose production design, the silly costumes, the theatrical make up and hair nor the unimaginative lighting. Other than that, David Hyde Pierce is, almost, worth the price of admission.","user":"littlemartinarocena","rank":[48,68]}]