[{"title":"Indiana Jones","rating":7,"date":"6 March 2020","review":"Many will definitely argue this addition to the 'Indiana Jones' saga was unnecessary and somewhat confusing. But as another film, you can't deny Spielberg's crisp direction and Harrison Ford's slick leading performance. Kingdom of the Crystal Skull is visually a blockbuster success, though potholes could be avoided in its story and plot, it's still stable nonetheless.","user":"MR_Heraclius","rank":[42,48]},{"title":"The weakest of the Indy films","rating":21,"date":"21 May 2008","review":"Before I start my review let me say I am a huge Indy fan and have been waiting for this movie for 19 years.<br><br>Bad news first : Number 4 is the weakest of the Indy films. Good news : It is still good entertainment.<br><br>Let me explain further :<br><br>The Good : <br><br>Harrison Ford still IS Indiana Jones. He still has the magic to impersonate this character. You really see his efforts to make this film work. Great camera work and sets. Shia LaBoef is actually quite good and not annoying at all, he has some funny lines and scenes. I never regretted that he was in the movie. Some really good action scenes, esp. in the first half of the movie with believable stunts and not too much CGI, e.g. the motorbike chase or the Warehouse battle. Great! Humor was OK and many jokes worked for me (best : the quicksand scene).<br><br>The Bad :<br><br>John Hurt as Oxley looked like Dumbledore on Ecstasy. I didn't like his character very much and was glad when he finally became \"sane\" again. Problem was by then the movie was almost over. Sorry guys, Karen Allen. She was overacting too much, smiling and laughing all the way even during the deadliest action sequences like a soccer mum. We know she is tough and so but it never felt believable. Also her interaction and reunion with Ford seemed a bit forced. The Villains : Blanchet was OK, but not very menacing or intimidating. You never felt she was a threat to Indy. She was always behind him. Russians? Give me Nazis as adversaries any day. Ray Winstons character (forgot the name) was confusing and underdeveloped : \"I am on your side, no wait I am a traitor, oh wait I am CIA, never mind I am a traitor again\". WTF? Ant scene : Stolen straight from \"The Mummy\". Shame on you, Spielberg.<br><br>The Ugly :<br><br>Sorry, but the last third of the film was the pits. The jungle chase was far \"over the top\" action, I thought Indy and Mutt were human beings, not supermen. They pulled off moves and jumps that even Spiderman couldn't do. Indy not using his gun once. At least he didn't carry a walky-talky instead. Nuclear explosion scene. OMG. How embarrassing, who came up with this idea? What was supposed to be funny only got howls of disbelieve and \"Yeah right\" from the audience. Indy survives a nuclear explosion in a fridge (!) and then is whirled away miles through the air, exits the fridge and walks off? Was Spielberg on drugs when he filmed this? Who on earth could survive such an explosion? I couldn't believe it! The plot : Not very suspenseful. Parts of it even boring. Aliens? They waited 19 years for this script? I believe almost anything would have been better. At least the Aliens only appear during the last minutes.<br><br>All in all a small disappointment but still a watchable Indy movie. I think \"less would have been more\" in this case. More believable stunts, less CGI and a better script and the movie would have rocked. I blame Spielberg and Lucas. Kudos to Ford. Should have made Indy IV 10 years earlier.<br><br>I give it a 5/10 despite all the negative points. First third of the movie 8/10, rest 2/10.","user":"wittmann73","rank":[750,1]},{"title":"A good Indiana Jones film not as good as the trilogy, but still a good fourth installment sequel","rating":7,"date":"16 October 2015","review":"Indiana Jones and the Kingdom of the Crystal Skull (2008) isn't a bad film -- there are a few dazzling sequences, and a couple of good performances -- but the unprecedented blend of comedy and action that made the movies so much more fun than any other adventure series is mostly gone. It is one of my personal favorite adventure movies even tough is a bad sequel but it is still good in my opinion. <br><br>Yes I like this film it isn't greatest film of all time, but for 2008 film? Yes I will take it. Yes the film has more mistakes and flaws but what ever. Indiana Jones and the Kingdom of the Crystal Skull will may not be the greatest film of all time, or bad ass like Riders and The Last Crusade but it is still a good film, it is the weakest entry but still a worthy sequel. I love all the tree films and I like this one a lot. <br><br>STEVEN SPIELBERG and GEORGE LUCAS bring you the greatest adventurer of all time in \"a nonstop thrill ride\" (Richard Corliss, TIME) that's packed with \"sensational, awe-inspiring spectacles\" (Roger Ebert, CHICAGO SUN-TIMES). Indiana Jones and the Kingdom of the Crystal Skull finds Indy (Harrison Ford) trying to outrace a brilliant and beautiful agent (Cate Blanchett) for the mystical, all-powerful crystal skull of Akator. Teaming up with a rebellious young biker (Shia LaBeouf) and his spirited original love Marion (Karen Allen), Indy takes you on an action-packed adventure in the exciting tradition of the classic Indiana Jones movies!<br><br>In regards to the \"nuking the fridge\" scene, the thing about Indiana Jones is that there are not some good things in all of the previous three Indy films, especially Temple of Doom, so it's not fair to criticize Crystal Skull for having aliens or the fridge nuke scene without also acknowledging all the dumb stuff in the original trilogy, such as Indy either flying off a cliff on a tank and walking away from it without a scratch, or dropping out of a plane on a rubber raft and sliding down a mountain slope without sustaining any whiplash. Obviously, Spielberg and Lucas were inspired by the James Bond books by Ian Fleming, where the main character always escapes near-death situations.<br><br>As far the \"aliens don't belong in an Indiana Jones movie\" argument goes, Indiana Jones has always been about fantasy and science fiction. I mean, Indy has dealt with ghosts that come out of an ark and spontaneously melt people's faces, voodoo dolls, beating hearts being ripped out of chests through use of magic, and a seemingly immortal knight from the 12th century guarding the Holy Grail, but it's not OK to have aliens?<br><br>Also, everyone seems to forget what the Indiana Jones franchise was originally about in the first place; it was created as a tribute to old b-movies and adventure serials. This is defiantly my least favorite out of all of the Indy films but its still a lot of fun even though the cgi was kind of bad and although I was kind of interested in the whole alien I thought the ending was kind a stupid when they show the flying saucer but overall I really like it.<br><br>Famed archaeologist/adventurer Dr. Henry \"Indiana\" Jones is called back into action when he becomes entangled in a Soviet plot to uncover the secret behind mysterious artifacts known as the Crystal Skulls.<br><br>Indiana Jones and the Kingdom of the Crystal Skull is a 2008 American science fiction adventure film. <br><br>The rating I give to this film is 7.5/10. Anything under 7 would be ridiculous, as anyone claiming this isn't at least a GOOD action film claiming this isn't at least a GOOD action film (it is sure as hell better than all the comic movies that get high scores) needs their head examined. 7.5/10 Grade: B+","user":"ivo-cobra8","rank":[121,165]}]