[{"title":"Worthwhile!","rating":9,"date":"27 May 2005","review":"Splendid performances by Dennis Quaid, Topher Grace, and Scarlett Johannson.<br><br>Dennis Quaid plays the 51 year old ad executive whose company has been taken over by mogul Teddy Kay. Topher Grace is the hot shot who is sent into the mix to shake things up (fire people).<br><br>The interactions among the three stars is wonderful. I also enjoyed the genuine affection the family members had toward each other. It is nice to see family life portrayed in such a positive light.<br><br>The movie engaged me from beginning to end. The characters grow into their parts as the movie progresses.<br><br>By the unexpected ending I was totally engaged, caring about each one of these people.","user":"pied","rank":[54,63]},{"title":"Charming","rating":9,"date":"30 November 2004","review":"I was able to see a pre-screening of this movie last night, and I was extremely excited because I have been anxiously waiting for its release. I have to admit that I was not disappointed in the least with what I saw. The movie had a good solid story of a middle-aged man dealing with both supporting his family and keeping his job (bordering on a mid-life crisis), and a young man dealing with a new job, being alone, and finding what he actually wants to do with the rest of his life. Sure, it sounds like a pretty typical \"finding yourself\" movie, but the characters develop the plot into something special. Topher Grace was excellent in this film. I found him very charming and believable, and he was sincere in his role. However, Dennis Quaid was really wonderful. His character was likable, and you found yourself routing for him throughout. His interactions with his family were endearing, and his relationship with his daughter Alex (Scarlett Johanssen) reminded me of my own father. I highly recommend this movie. 4/5","user":"flotsom1","rank":[109,136]},{"title":"Surprisingly VERY good","rating":7,"date":"7 December 2004","review":"Got in to see one of those audience recruited screenings. I was expecting sort of vanilla type movie, but was VERY PLEASANTLY SURPRISED...it is GOOD! Not superb, but definitely fun, original and very very topical! Dennis Quaid plays an ad exec whose company is taken over by a big conglomerate. Topher Grace, who is half Dennis' age, becomes his boss, and we see the dramatic and comedic dynamic (too may \"ics\") of the two men as they try to cope with an in flux work and home life. Dennis Quaid and Scarlett Johansson are very good, but Topher Grace is the body slam surprise performance here. Also, as a bonus for the audience, all the supporting cast is filled in with great character actors. I hate spending ten bucks on a ho-hum movie, but this one is definitely worth it. Story-9, Acting-8, Humor-9, Drama-8....OVERALL: 8.5","user":"berisky-1","rank":[144,191]}]