[{"title":"Actually, it's quite good..","rating":7,"date":"15 February 2005","review":"I have to put my hand up right now and say that the whole Spongebob thing had passed me by up until I saw this movie. I have no kids, no Satellite TV and therefore no legitimate reason to have caught any episodes of SBSP. However, I did see some of the trailers, and being a submarine nut I loved them. I also got the low down from a friend with a youngster who watched the DVD constantly, day after day, and he confessed to loving the show too. What the hell, I thought I'd see the movie.<br><br>What do you know, it's actually quite good! It looks almost exactly like an episode on TV, there doesn't appear to have been any attempt to update, enhance or otherwise movie-fy the series. Fair enough. As for the story and characters, while it's obviously geared to a younger audience I'd have to say that at least half of it would only be understood by the more adult viewer, and there are more than a few nods to other movies that no toddler will have seen. For instance, the silent, motorcycle-riding, super-tough assassin is a dead ringer for the silent, motorcycle-riding, super-tough assassin in Raising Arizona, and just as funny. There's a certain amount of slapstick and visual gags, but the dialogue and situations are fine too.<br><br>Overall I enjoyed the movie, it's funny and engaging and although it does start to lag a bit in the third act it's still rewarding. I'm not sure if the live-action was a good idea, but it's always fun to see The Hasselhoff do his stuff on screen, even if it's poking fun at his persona. There's laugh out loud moments, annoying songs, cameos, Hasselhoff and all the other things that a one-off special episode should have, and that's fine by me.","user":"axeman-9","rank":[50,52]},{"title":"It's SpongeBob, 'nuff said","rating":10,"date":"28 February 2005","review":"I didn't quite know what to expect when I walked into the theater to watch the movie of one of my favorite cartoons. Nickelodeon has a really nasty habit of \"big-budgtizing\" movies of their shows (changing the look, etc.). However this is not the case with SpongeBob. Whew, one less thing to worry about.<br><br>Next was the story. Could Steve Hillenburg live up to what had been laid down by the series? Yes. Basically it's like watching a 1 1/2 hour episode of SpongeBob (and who couldn't like that). Lot's of visual gags and typical Sponge brainless-ness. I was quite impressed.<br><br>If you're a SpongeBob fan, you'll love this movie. If you're not, eh, watch it anyways, it'll do you good ;-).","user":"bro25sibs","rank":[91,102]},{"title":"Better than I expected!","rating":7,"date":"3 February 2006","review":"Okay, I admit it! I'm a big fan of SpongeBob SquarePants TV-series. And when the movie came out, I was more than suspicious. Most movies that have been made out of TV-series have been big disappointments. But I can assure you, this one is not.<br><br>If you have ever seen an episode of SpongeBob and liked it, you'll most probably enjoy this film. Even though the movie is mainly directed to kids, as is the TV-series, it will definitely keep adults interested just as well.<br><br>Something I especially love in this movie are the characters. In their own way, they're all fun and original. The voice actors do a brilliant job in bringing the characters of Bikini Bottom to life. All the voices fit perfectly and make the movie even funnier! Watching SpongeBob SquarePants the Movie is like watching a long episode of the TV show. And I believe that's just the way we like it! I was scared they were going to make some kind of weird changes to make it more appealing to a wider audience, but I'm glad they kept the spirit of the show.<br><br>If you have doubts about whether to see this movie, take my advice; go see it, now!","user":"Candy-Holic","rank":[35,38]}]