[{"title":"Nicely done story of hard times in 1950s Arkansas","rating":28,"date":"28 April 2003","review":"In Arkansas during the Korean War, 10-year-old Luke Chandler lives with his parents and grandparents on a farm where cotton is the primary crop.  To pick the cotton, the family must hire 'hill people' and Mexicans.  The hill people do not get along particularly well with those who look down on them, and sometimes they get into fights.  Hank Spruill is especially prone to getting in trouble.  One day in the house, he makes demands of Luke and, figuring Luke looks down on him, points out that at least his house is painted, while to Luke's family, paint is a luxury.  Later in the movie, part of the house has been mysteriously painted.  The prime suspect is Hank's disabled brother Trot, who can't work in the fields.<br><br>Luke witnesses a fight Hank gets into that results in a death.  He is afraid to tell the truth since Hank doesn't like him anyway, but the police officer who investigates appears satisfied with the explanation of self-defense. Hank's teenage sister appears to be falling for Luke at first, but later she is seen with Cowboy, one of the Mexicans, and Hank already despises Cowboy.<br><br>The hard life on the farm is made even worse by several weather events during the second half of the movie.  The promise of better times ahead is suggested when Luke's cousin shows up in a brand new Buick (Luke has never even been in a car, only trucks). His spoiled rich wife can't believe people have to live like this and is horrified by having to use an outhouse (This was one of my favorite scenes; Kiersten Warren is so good in roles like this). Also, the whole town is excited by a new thing called television and the idea of actually being able to watch the World Series.  Luke is a Cardinals fan, but he gives up his dream of a Cardinals jacket for something more important.<br><br>This is almost a family movie.  There are two violent scenes that result in deaths (both witnessed by Luke; the second time, the person responsible threatens Luke's mother if he tells).  People get into fights a lot in this environment, but the others are no big deal.  Other possible red flags for parents:  the birth of a child to an unwed mother, and the identification of a possible father.  Other than these incidents, this movie could be acceptable viewing for the entire family.<br><br>This movie was well done, and I thought the performances by many of the actors were good.  I especially liked Luke's grandfather, who could be stern but tender.  Not everyone has an easy life, and those of us who had it too soft can learn a lot from a movie such as this.","user":"vchimpanzee","rank":[13,16]},{"title":"Little House on the Cotton Fields","rating":6,"date":"6 November 2003","review":"I read John Grisham's novel over the summer and have to say that this movie is just too watered down.  The book was grittier and should have been made into a theatrical movie, instead of becoming \"Hallmarkized.\" With the music, the stiff acting and the script, I felt like I was watching The Waltons or a certain Michael Landon/Melissa Gilbert '70s show. Nothing wrong with a family movie, but the book had more of an edge and I think was closer to Grisham's real life experiences than this watered down version. Examples (SPOILERS ALERT): 1. Hank's sudden source of income.  In the book he earned it gambling and spent a lot of time at the carnival.  In fact, the entire carnival/wrestler segment, which stood out in the book, is missing from the movie. 2. The conflict between Hank and Cowboy seemed staged and silly.  Cowboy didn't have a \"West Side Story\"-like switchblade in the book, either.  It was a large buck knife, as I remember. 3. Tally was barefoot, indicating the poverty level of the Spurills.  She was not wearing Keds. 4. The segments in the book between Tally and Cowboy were a little more intimate than just embracing in the fields. 5. The Latcher subplot was just an aside.  In the book, it is a lot more significant.<br><br>You get the point--this should have been a hard, PG-13 movie instead of a Hallmark Hall of Fame presentation (which will probably get a PG on video as there is a little violence, albeit very muted).  In fact the only reason I watched this was because of Scott Glenn, who was perfect as Pappy.  Maybe they'll try it again, for the theater!","user":"Katz5","rank":[5,5]},{"title":"Maybe sometimes, we forget","rating":6,"date":"24 February 2006","review":"Maybe sometimes, we forget, with our plush life and current definition of \"poverty\", what things were like for rural \"working poor\" even as recently as the 50's. Survival, even for a man who owned the land, took a different strength of character. Is it good, or is it regretful those times have passed? More money yes, but were better times up North in the auto plants? I suppose, but this is nostalgia, and not bad either.<br><br>It was a good family movie, narrated like the Waltons, I kept waiting for \"goodnight Luke-boy\". Yah, Little House on the Prairie too, a bit more reality, but did other commenters really expect this to be as complete as the book, any book? Personally, I'm tired of hearing book-readers whine about \"what they left out\". Don't watch movies if you read the book. <br><br>This is certainly wandering reminiscences, but that's another type of literature too, isn't it? Why does every story have to be going somewhere special? To me it's a pretty good coming of age movie and worth the hour and a half at least, and always a pleasure watching Scott Glenn, when he gets good parts.","user":"newmans","rank":[7,8]}]