[{"title":"The Best of Reunion Times","rating":10,"date":"12 March 2003","review":"There are many kinds of reunion shows.  One kind is where old actors are taken out of mothballs and set to recreate characters they haven't played for twenty or thirty years.  These have mixed results.  `Return to Mayberry', despite some silliness, was okay;  `Return to Green Acres' as execrable (Eddie Albert used a word for the script I won't repeat here, but both it and the movie stink);  `Rescue from Gilligan's Island' filled in a necessary gap in the story of the castaways, though the show itself was silly even from a `Gilligan's Island' viewpoint.  In most cases, the scripts are weak; sometimes a silliness appears in the scripts that is too knowing  and in comedy it's nearly always fatal for the characters to know they're being funny.  New characters are introduced who don't fit the mix.  In the main, these reunion shows are pretty weak.  A second sort of `reunion' show is the kind where the cast lays its past aside but sits around, telling stories, reminiscing, interspersed with flashbacks from the shows.  Then there are movies based on the shows, which are rarely good; and movies based on the history of the show (`The Brady Bunch' has had both of these happen to it, with various results).<br><br>`Return to the Batcave' uses nearly all the above, with a wonderfully twisted viewpoint, which makes it the best of the reunion shows, and has raised the bar for the others.<br><br>Adam West and Burt Ward and summoned to a showing of the original Batmobile. While they are there, the car is stolen. <br><br>The Adam West of the movie is a man demented.  He called Jerry, his butler, `Alfred'.  He opens a bust of Shakespeare in his apartment and reveals a hidden pole to slide down to the parking garage.  He's obsessed with being a crime fighter, when in fact he's merely a washed up actor.  When the Batmobile is stolen he not only believes it's his duty as a crime fighter to recover it, he drags and unwilling Burt Ward in as his assistant.<br><br>The pursuit is largely loquacious, with West and Ward reminiscing about the old days.  It is broken by `flashbacks' with actors playing West and Ward in the old days.  The modern scenes and the `flashbacks' both have the wacky lack of reality the show maintained.  There are also running gags that show West is able to make fun of himself: in Ward's book about his time on the show, he spoke frankly about West's libido and also his being a skinflint (West makes Ward pay for everything in their pursuit, down to tips and bus fare).  The clues they follow, the characters they meet (even in flashback) all fit the mentality of the old series, and there are several homages, including a fist fight with written sound effects.<br><br>The whole thing is extremely funny and done with great panache. There are also cameos by Julie Newmar (looking like she's had one facelift too many) and Frank Gorshin, reminding us why he has such a cult following.  Gorshin will be the Riddler when Jim Carey, his obvious successor, is long forgotten.  The movie builds to a fairly obvious but funny climax.<br><br>\nThis show is a model for reunion shows  unfortunately, there are few that can fit the pattern.  This show had actors replaying their old characters; young actors playing a movie about the making of the show; the actors West and Ward reminiscing; and a modern-day movie with the real Adam West playing the demented Adam West.  It has everything.  If you loved the old show, this is the stopper on the bottle.","user":"vox-sane","rank":[29,30]},{"title":"Delightful, campy romp for BatFans of all ages!","rating":9,"date":"9 March 2003","review":"Okay, I'll admit it: Reunion movies don't always work. They're almost always missing that special something that makes them pale in comparison to the original. That's what I was expecting when I tuned into this, but that's not what I got. \"The Misadventures of Adam and Burt\" is a BANG! POW! WHAM! gasser, especially if you're a long-time BatFan like me!<br><br>First, there's the cast. If there is any justice, Adam West and Burt Ward should be nominated for Emmys for their delightfully funny, wickedly self-parodying performances. Ditto Jack Brewer and, especially, Jason Marsden as their younger incarnations. All four of them truly seemed to be having fun with the roles. And that's the sort of enthusiasm that quickly finds its way to the audience. Sort of like the original series, come to think of it.<br><br>As to the other visitors from the series, Lee Meriwether has a delightful cameo as a waitress with at least one surprise up her sleeve. Julie Newmar still looks stupafyin'-ly super in her walk-on, and can still heat up the tube. If time has been a bit less kind to Frank Gorshin, he more than compensates with the sheer enthusiasm and good humor which has always been his trademark.<br><br>It's my hope that Fox will bring this out on VHS and DVD soon, ALONG WITH the original \"Batman\" series. I know BatFans would eat up both like BatBurgers.<br><br>God bless Adam and Burt, always heroes in the hearts of their many fans.","user":"BobLib","rank":[18,19]},{"title":"Holy Hysterics, Batfans!","rating":10,"date":"10 March 2003","review":"This wild, wooley and wacky look back at the evolution of the 1960's camp classic is a lighthearted romp through a lot of memories for fans of the series, as well as an interesting expose for those who were unaware of the true lives of the stars.<br><br>Hosted by the originals, Adam West and Burt Ward, their hunt for a missing Batmobile (George Barris' 1955 Ford Futura), is filled with rememberances of the lives of the dynamic duo in and out of their tights. The plot is peppered with actual Batlore, including Mickey Rooney's turning down the part of The Penguin, Lyle Waggoner's original screen test as the Dark Knight, et al.<br><br>Appearences by Frank Gorshin, Julie Newmar, Lee Meriweather help round out the cast that are superbly lead by West and Ward, taking a step backwards from ego and attitudes and goofing it up with the rest of the gang, with great impersonations of younger versions of West, Ward, Gorshin, Burgess Merideth, Meriweather, Vincent Price, Yvonne Craig and a Ceaser Romero Joker that will knock your socks off.<br><br>Another amazing bit of trivia is that Dawn Wells, \"Mary Ann\" of Gilligan's Island fame was an executive producer for the show.","user":"redbeard_nv","rank":[11,11]}]