[{"title":"An hilarious American view on Europe","rating":8,"date":"21 December 2004","review":"First of all: Greetings from a guy living somewhere in between the Brussels sprouts, hahahaha. That's right, I'm from Belgium, you know the place that no-one really knows, not even the Europeans...<br><br>Even though I expected to really hate this movie, I have to admit that I had a lot of fun watching it. I loved to see how they magnified the stereotypes about the French, the English, The Germans,... and made fun about the Catholic church. Some people pointed out that it was clear that the makers really don't know anything about the countries they were making jokes about. Possible, but it didn't bother me once. It's a comedy, not a traveler's guide!<br><br>This is how the story goes: A teenager is dumped by his girlfriend on the day of their graduation. He has contact with a German girl, called Mieke, but he thought it was a guy called Mike. Knowing this and after he has seen her photo, he decides to pay her a visit in Berlin. But of course they don't just end up in Berlin. They start their trip in London, going to Paris, Amsterdam and Bratislava before getting to Berlin...<br><br>The movie's script or the plot were probably the least of the director's concerns. It's clear that they just wanted to go to Europe, have some fun and film one hilarious situation after the other. I've got the feeling that most of the European viewers didn't mind being the subject of the movie. Yes it's crude and yes it doesn't show anything about how Europe really is, but it's also incredibly funny. I give it an 8/10 for that.","user":"philip_vanderveken","rank":[228,292]},{"title":"Much much funnier than you would ever expect","rating":9,"date":"22 February 2004","review":"I know, I know, the trailer looks supremely dumb, so why go see this movie? Certainly not because it was from the people who gave us such gems as Road Trip or Old School, that's for sure, and it's not like I even recognized anyone in the cast (other than Michelle Trachtenberg, best known as Buffy's little sister Dawn). I guess I went because I found the trailer mildly amusing and I still had $9 on an AMC gift card that I had been given for Christmas. I've seen movies with less provocation, I suppose.<br><br>Eurotrip follows the adventures of four teens, Scott (Scott Mechlowitz), Cooper (Jacob Pitts), and twins Jamie (Travis Wester) and Jenny (Trachtenberg) as they backpack around Europe between high school graduation and beginning college. There's sort of a plot driving the film as Scott wants to meet up with his e-mail pen pal Mieke (Jessica Boehrs), whom he thought was male but finds out is actually a very attractive female. But really the movie is an excuse to have fun with typical American Euro-stereotypes.<br><br>Naturally the four fresh-faced kids get into all sorts of hijinks as they make their way through London, Paris, Berlin, Rome, and so on. And the foursome are your basic group: Scott is the well-meaning lead, Cooper the sarcastic wise-ass, Jamie the uptight planner and Jenny - well, my first indication that this wouldn't be a typical dumb teen comedy was when the other three guys all treat Jenny as one of the guys, and of course she's uber-cute Trachtenberg. They repeatedly refuse to think of her as a girl despite the filmmakers really showing off Trachtenberg's budding assets, which continues to play as funny through most of the film.<br><br>It may sound hard to believe, but I don't think I have ever laughed as hard or as long at another film as I did at this one. Maybe it's because my expectations were pretty low, but this was a hysterically funny film. From the opening moments where Scott is dumped by slutty girlfriend Fiona (Smallville's Kristin Kreuk, in a terrific cameo) to the very end of the film, I pretty much laughed the entire 90 minutes. Not only is there clever verbal play and uproarious sight gags (the arrival at Bratislava was so funny I almost fell out of my seat laughing), but the writers were masters of the recurring gag - the best of which is a song about Scott's breakup with Fiona (it makes sense in the film) constantly popping up as they travel throughout Europe. One particular scene involving English soccer hooligans traveling to France (led by the smashing Vinnie Jones) had me laughing so hard I had tears rolling down my face.<br><br>Everyone gives a game performance. Scott Mechlowitz is perfect as Scott, with just the right mix of leading man humor and straight guy stiffness. Jacob Pitts' Cooper is surprisingly low key for the smart-ass; usually this kind of character is way over the top, but Cooper manages to be funny without ever taking it too far. Travis Webster plays his nerdly Jamie well; we never look down on the guy, even though he's the more uptight one in the group. And Trachtenberg seems right at home being one of the guys even while attempting to transform herself into an object of teenage lust. The cameos - Matt Damon as a punk singer, Lucy Lawless as a Dominatrix, Kreuk, and so on - are all well cast and well used. You'll recognize a lot of the bit players from other places (Guy Ritchie films, SNL, etc) but they all work very well.<br><br>I didn't expect this film to be so repeatedly and exceptionally funny, and I guess it caught me off guard. I can't recall laughing this hard at any film in the last five years, and maybe ever. I hesitate to call it the funniest movie I've ever seen, because I've seen some great comedies, but I was still chuckling at this film more than a half hour after I was out of the theater. As far as movies performing above expectations this is one of the tops in that category. I guess some people would be put off by the European stereotypes, but the film was so inventively humorous and excessively clever<br><br>(they do a great parody of the Indiana Jones 'moving around the map' bit) that I was blown away. This is a movie I fully intend to see again, maybe a few times, and I'm already clearing off space for it on the DVD shelf. But don't take my word for it - go see it yourself and see one of the funniest movies in years.","user":"oshram-3","rank":[202,265]},{"title":"Excellent Absurd Comedy: Funnier Than American Pie","rating":8,"date":"17 August 2004","review":"This movie is hilarious &amp; a must see for those who like American Pie, Scary Movie, Senseless &amp; similar types of comedies. Eurotrip uses almost every single cliché or stereotype regarding Europe &amp; exaggerates it enormously in an unbelievably funny way.<br><br>Surprisingly the acting, which is done mainly by unknown actors &amp; actresses, is very good. As for Michelle Trachtenberg, she is just plain awesome. Her acting deserves real praise. Plus, the film features several pretty successful cameo appearances. Lucy Lawless as S&amp;M dominatrix is particularly hilarious.<br><br>Though the story itself can't be considered particularly original, the movie is interesting, cause of unstoppable flow of hilarious jokes. The theater was almost torn down with the viewers' laughter, when I watched the film. The scene with The Pope is an instant classic in my point of view, I haven't seen something this hilarious since the first Scary Movie came out. Some satirical aspects also take place in the movie: especially funny was the scene, when the characters arrive to a club in Slovakia &amp; hear a techno remix of a song 'Scotty Doesn't Know'. Awesome moment.<br><br>In general, I think the film is underrated. In my opinion it is better than the first &amp; the second American Pie, the second Scary Movie &amp; a great number of less famous comedies. Go see it &amp; have fun.","user":"Killa_Cam","rank":[183,243]}]