[{"title":"Cinematic and psychological study of adolescent cruelty","rating":16,"date":"16 December 2003","review":"I wonder, as I write this, why a film like Ondskan hasn't received commercial distribution in the States. Perhaps distributors assume Americans are too removed from the world of mid-century upper class boy's boarding schools in Sweden to relate to the film, which is our loss. Ondskan presents a microcosm of cruelty, status, and one-upsmanship - one might say evil - that exists in such an institution. Every year we read another horror story of a hazing gone too far. Children trounce their playmates. There's plenty of physical aggression among boys. The latest discussion concerns what among girls is called relational aggression, in which an individual is harmed through the hurtful manipulation of peer relationships and/or their friendships. .Neal LaBute has taken the idea of sadistic relationships to the American workplace in 'In the Company of Men' and to the suburbs in 'Your Friends and Neighbors'. There have certainly been other films tackling this particularly subject of sadism in boarding schools, Young Torless  (Der Junge Törless) in 1966, comes especially to mind. What is captivating about Ondskan ('Evil') is both cinematic and psychological. The world of this o-so reputable boys school is painted in earth tones and fine wood with muted light rendering its cold emotions. The set design by Anna Asp (who's has done some other great looking films) lets us feel as though we have lived in this space. The lead character, Erik Ponti, at first we think will be the embodiment of the 'evil' of the title. He is regularly and systematically strapped by his stepfather. He transfers that frustration to his own classmates, which is what gets him sent to the boarding school in question. There he is ritually brutalized by the upperclassmen, which is, we are led to understand, the expected behavior in this hierarchy. To the administration and faculty this is apparently part of school tradition. Eric's initial unwillingness to fight back, despite a similar unwillingness to bend to arbitrary, sadistic, and unwritten rules, is relentlessly frustrating. As an audience we really want him to act. But his honor, his fortitude, and the fact his mother has hocked some heirlooms to pay tuition, keep him from lashing back. We are thus submitted to the same unremitting abuses with no real payoff. I will refrain from revealing the end, but it is not when or what you might expect. The result is a great ride and an elating experience. The audiences at Harvard, where I saw the film, applauded afterward. It's not a perfect film. There are clichés and expected set-ups. Still the mushy adolescence of the actors cast in these parts is consistently smart. The music is tasteful and well used. The direction is subtle and the violence is felt more than seen, but when it happens it is as ugly as it deserves to be.","user":"tjackson","rank":[103,113]},{"title":"A Very Decent Film","rating":9,"date":"4 August 2006","review":"I would recommend Ondskan to anyone who is interested in coming-of-age films. American cinema has always been expert at such portrayals, and it is good to see so accomplished an example out of Sweden. I liked especially the fact that the director never wavers as he unmasks the unwholesome face of an angst-ridden, violence-prone, socially intransigent Swedish society of the not so long ago . Set in the fifties, mostly at a posh boarding school for the upper-class, where the sixth-form boys, led by an effete Swedish aristocrat, go about enforcing their arbitrary and violent rules while the faculty turn a blind eye, this film cleverly avoids the hooks, punches and triumphs of the underdog come to grips with the jack-booted status quo via his fists alone by allowing him to prevail to justice through the implementation of Swedish law. There are enough fisticuffs along the way, however, to satisfy the blood-thirsty among you. Well-acted, good script, beautiful cinematographic moments.","user":"julioecolon","rank":[33,36]},{"title":"Beyond the Limits of Cruelty","rating":9,"date":"18 February 2005","review":"In Sweden, Erik Ponti (Andreas Wilson) is the son of a remiss mother, and his stepfather gives sadistic beatings on him, using the most futile pretexts, without any interference of his mother. His dysfunctional family makes him a very violent teenager, culminating with his expulsion from the public school system in Sweden, due to a fight and aggression against another pupil. His mother sells some belongings of her and sends him to the elitist private school of Stjärnberg, as his last chance to complete his basic education. However, behind the name of the expensive and conservative school, there is a code of (dis)honor among the students, where the younger and those who belong to the lower social classes are humiliated by the veterans and those who belong to the high social classes without any questioning of the director. Erik feels like in hell while studying in Stjärnberg. <br><br>\"Evil\" is a stunning movie, which shows the danger of the power in wrong hands. Indeed, it is a psychological study of violence, which leads to cruelty. It explains the social behavior of, for example, street children in Brazil, who are sent very young to state reformatories and become cruel criminals when adults. The story is very engaging and the performance of the cast is outstanding, highlighting Andreas Wilson and his greatest opponent, the sadistic Otto Silverhielm (Gustaf Skarsgard). This movie shakes the viewers and in the end, we are cheering to Erik's revenge, wishing him to kill his aggressors, in a total inversion of the moral values. The DVD released by the Brazilian distributor VF Vídeo Filmes shows also a total lack of respect with the Brazilian consumers: in the Extras, there is an interview in Swedish with the director Mikael Häfström and the making-of, both without sub-titles, as if Brazilian people could understand this language. My vote is nine.<br><br>Title (Brazil): \"Evil  Raízes do Mal\" (\"Evil  Roots of Evil\")","user":"claudio_carvalho","rank":[71,87]}]