[{"title":"Johnny Depp is fantastic!","rating":10,"date":"23 February 2020","review":"Awesome action and swashbuckling adventure, great music from the likes of Hans Zimmer, good visuals and Johnny Depp's hilarious improvisational performance as Captain Jack Sparrow (the other performances are good as well but Depp's the highlight and you damn well know it) make the first Pirates of the Caribbean adventure a fun action flick that's not only a great first non-Touchstone/Hollywood Pictures/pre-2006 Miramax &amp; Dimension PG-13 Disney movie but also a much better movie than a movie based off of a THEME PARK RIDE has the right to be.","user":"MR_Heraclius","rank":[49,50]},{"title":"Depp for Emperor?","rating":10,"date":"27 November 2005","review":"I am nearly fifty years old. A sober grown man. With children. Children with whom I have now sat through hundreds of movies. Many of which I have enjoyed. And I am not completely hardened in my sophistication. The opening music to The Lion King brought tears to my eyes when my little ones were but wee tots. But still, these are after all just children's movies. In another life, I would never have seen them. And, really, one can't take such movies too seriously, can one?<br><br>And so, this summer, after the ritual badgering, I dutifully trudged into yet another Disney \"adventure\" movie. Named after that tired old ride in Anaheim I first went on in 1965. I mean really, how much can you expect?<br><br>And then, it happened. The swirling intoxication. The stunned feeling. What? Who? How? Was this a movie? Or a religious experience? Perhaps more like an addictive experience...<br><br>I cannot remember ever willingly paying to see any movie not starring a relative of mine more than twice, and I can count those movies on one hand. I have now seen \"Pirates\" four times. The only thing keeping me from seeing it again is the sense that this whole thing is just getting out of hand. I cannot get enough of it. It's like walking into a painting that you never want to come back out of. My children ask, with a note of concern in their voices, \"Dad, you really like Pirates of the Caribbean a lot, don't you?\"<br><br>And that Depp fellow. My God. I never had any idea who he was, but his name sounded like something created for a pubescent cover-boy for magazines published to hook thirteen year-old girls on make-up and bad music. Wasn't Depp the name of some hair-goo product back in the 60s?<br><br>I am a straight male. I have several good friends who are gay, but have never fantasized about any gender but the female. But now I understand how women can experience swooning crushes on male film stars. He is simply extraordinary. So sly, so seductive, so canny! I read an interview in which Depp said he went through a slight depression when he had to stop playing Captain Jack Sparrow. I can see why. His inventiveness and sheer pleasure in inhabiting the character come through in every frame. How can I admit to my children that I now troll through fan websites about a former teen heart-throb?<br><br>I often don't even watch the Academy Awards, and I certainly never have any emotional investment in who wins.<br><br>Except for this year.<br><br>Go Jack.<br><br>And, in a time when many big-budget movies are little more than a hodge-podge of loosely- connected \"money shots\" this movie puts all the pieces together, with a sense of fun and light-heartedness in special effects that are simply dazzling. I find myself laughing with dizzy appreciation when Barbossa barks out, \"You'd best be believing in ghost stories, Miss Turner, you're in one!\" and the grinning skeletons come into view, with Badelt's pounding score keeping time to the beat of their maniacal deck-swabbing. And then there's the scene of the pirate-ghouls slithering up from the darkened sea on the mooring cables of the Dauntless, like infernal cats stalking their prey.<br><br>And now to the music. I can just hear the effete aesthetes dismissing this score, as Mr. Zimmerman anticipates with his winking \"overproduced by\" credit on the cover-liner. \"Bombastic.\" \"Overdone.\" \"Absurdly Stupendous.\"<br><br>Well, perhaps it is, for those who spend their lives evaluating such things. To me, it is absolutely transporting. I first listened to it while doing a work-out on a rowing machine and found that I tripled my usual distance. It was like mainlining some hazardous tachycardic amphetamine.<br><br>Once again, the children were wondering, \"What's up with Daddy? Is he OK?\"<br><br>Perhaps I am just losing my grip, having an adolescent movie get to me this way. But when those final credits roll, and Captain Jack narrows his eyes and says, \"Now, bring me that horizon. Drink up me hearties, yo ho\" and the music swells ... it is difficult to put into words the effect it has.<br><br>At this point my children have to yank me forcibly from the theater, lest I persist in watching the credits to the bitter end, and bid good-bye to the little monkey once more, wiping tears of exultation from my eyes.<br><br>This is not just another \"entry\" in the summer blockbust sweepstakes. It is an exquisite work of fantasy and inventiveness, a true classic, on the order of \"The Wizard of Oz.\" I do hope Depp's performance garners not just awards, but a place in the pantheon, something we old fogies -- and our gently fogeying children decades hence -- will show to our children and grandchildren like a revealed treasure. I cannot recall any movie having such an effect on me.","user":"eak-1","rank":[803,923]},{"title":"Terrific!","rating":9,"date":"29 September 2005","review":"You will always remember this as the movie that made Johnny Depp a superstar and almost got him an Oscar.The fact that he didn't win isn't a problem,since thanks to him this is the best pirate film ever made.<br><br>The opening concept is a clichè:a beautiful woman(Keira Knightley)is kidnapped by a bunch of filthy pirates(led by Geoffrey Rush's Barbossa)and the man(Orlando Bloom)who's desperately in love with her decides to track them down.From now on,things get unexpected,as he asks another pirate for help.And it's no ordinary pirate:it's Captain Jack Sparrow(Johnny Depp),a lying,cheating,but charismatic scumbag,the hardest man on Earth to predict,not to mention quite unlucky and clumsy(\"You are,with no doubt,the worst pirate I've ever heard of\" \"But you HAVE heard of me!\").<br><br>It's got all the elements of a classic pirate movie,elements that would give this flick a 9/10.<br><br>So,why am I giving it a 10/10? The answer is simple:Captain Jack.From the moment he makes his entrance,justly included in the Empire Top 10 Entrances of all time,we know he's the reason people will keep watching the movie.He 's Depp's best non-Tim Burton-character ever,and I can't wait 'til he returns.<br><br>See you next summer,Captain!","user":"MaxBorg89","rank":[150,184]}]