[{"title":"Not perfect but interesting at times","rating":10,"date":"10 November 2004","review":"When 'The Singing Detective' was first produced as a TV mini series in 1986, it had a cumulative running time of well over 400 minutes. In this theatrical remake, the story has been pared down to no more than 106. I haven't seen the original - which enjoyed almost unprecedented critical acclaim in its time - so I have no idea how much of its quality has been lost in its currently truncated form. Hence, I will only be talking about this expurgated version, which stars Robert Downey Jr. and Mel Gibson, both in virtually unrecognizable roles. It should be noted that the screenplay is credited to the late Dennis Potter, the author of the original work, so we can assume that director Keith Gordon simply cut and pasted - though a less charitable person might say 'bowdlerized' - the much longer teleplay. <br><br>'The Singing Detective' tells the surrealistic tale of a writer of detective fictions who is suffering from a horrifically painful and disfiguring skin disease. As he lies in his hospital bed, his mind drifts back and forth between reality and fantasy, a hallucinatory condition brought on by fever and his own author's imagination. At times, Dan is acutely aware of his miserable situation in the here and now, with all its attendant physical and psychological agony. At other times he becomes lost in re-enactments of key scenes from his gumshoe fictions, memories of his miserable childhood, and elaborately staged song-and-dance numbers in which the characters lip-synch to musical standards from the '40's and '50's. <br><br>Because its style and subject matter are somewhat off-putting at first, 'The Singing Detective' takes a bit of getting used to, but eventually the themes and stylistic elements begin to come together and the film takes off. The irony is that, for all the razzle dazzle of its form and style, the film is at its most intriguing in its quieter, subtler moments when the embittered hospital patient is forced to confront the demons of his own tormented psyche. Dan Dark is a man who obviously prefers the world of fantasy to the cold harshness of an often excruciatingly painful reality. In addition to his debilitating disease, Dan is also haunted by a failed marriage and an often tragic childhood that he tries to 'correct' by entering the world of idealized fiction, one that he can manipulate and control. As the bombastic hospital psychologist figures out, Dan's illness is essentially psychosomatic in nature, one rooted in his inability to accept the realities of life in his own skin. In fact, Dan ultimately discovers that his disease is as much a product of his imagination as the scenarios and characters that make up his fiction. The illness becomes his way of not having to deal with his inner torments. Somewhat paradoxically, his writing becomes a form of therapy for him, helping him to deal with all that unresolved bitterness in his soul. The film is as much about psychological healing as it is about physical healing. Oddly enough, Dan's confrontations with his wife, psychologist and other hospital staff are actually far more interesting than what is happening in his rather puerile imagination. Still, towards the end of the film, when Dan starts to make some profound psychological breakthroughs, the fantasy scenes actually do begin to work and the complex structure pays off. <br><br>Downey does a fantastic job bringing Dan to life, conveying both the physical and emotional anguish the character is undergoing. Gibson has a great deal of fun playing the part of a paunchy, balding psychiatrist whose unorthodox methods wind up getting to the root of his belligerent patient's troubles. Robin Wright Penn, Jeremy Northam, Adrian Brody, Katie Homes and Alfre Woodard among others all deliver top notch supporting performances. And special praise must surely go to the large makeup staff whose work here is nothing short of miraculous.<br><br>'The Singing Detective' will probably not satisfy die-hard fans of the original lengthy mini series. But for the rest of us who have seen no other version than this one, the film's audacious style and complex themes help the movie ride up and over its not inconsiderable flaws.","user":"Buddy-51","rank":[54,68]},{"title":"Could have been great, but.......","rating":5,"date":"8 July 2004","review":"I picked this movie up because I read the story on the back cover and found it interesting and because I like Downey. I was prepared to watch something different (from most movies I watched this year) and in that regard I was not disappointed. The movie was indeed different, the story was interesting, acting was very good (in most cases) the soundtrack was excellent....so why didn't I enjoy it?<br><br>When the movie finished I was left disappointed. I couldn't find any real flaws in any aspect of the film (direction was above average, acting was great, music was very good and appropriate) but still I did not feel like I have just watched a great movie. I did not hate it but I didn't like it either. More than a couple of times I was tempted to hit fast forward.<br><br>And after a while I realized what was the problem with this film. Every character (except Downey's character - and then only to some extend) is left undeveloped and every relationship in the film is also left undeveloped. Most parts of the story are left unfinished or are presented in so little detail that they become uninteresting or irrelevant. It almost feels as if the original duration of the film was 4 hours and they had to cut bits and pieces to make it shorter. <br><br>All in all, I feel this could have been a great movie, but something happened along the way and the result was an average film. Worth watching it once, if only for Downey and an out-of-character Gibson, but that's it.<br><br>P.S. Please excuse any spelling or grammar mistakes. I'm not used to writing in English.","user":"prod74","rank":[47,63]},{"title":"An imperfect film for an imperfect world","rating":8,"date":"12 July 2004","review":"Hey, I liked it.  There were good things:  Gibson unrecognizable as the shrink, Downey at his best, whacky story, pastiches of film noir, mind mystique, Touches of Freud, Jung... but it's not perfect.  Some confusions persist:  Downey as the frustrated, nonintrospective, horny writer whose imagination has taken over his life is often whining.  His round-heeled mother has few redeeming features, the shifts between real and irrealis is jerky..., and so on. It's easy to find fault with a complex tale and one in which there are so many loose ends and ravelings but what do you take away with you when it's all said and done? Reading through the comments here, I came across the usual \"I didn't like this...\" and \"I didn't like that...\" comments.  OK.  Not every one likes pistachio ice cream.  I love to see, hear and consider other views because it makes me reexamine my own impressions.  Of interest to me was the recurring theme of confusion in these commentaries.  I shared much of that because of the less than smooth transitions in the switches to irreality and the flashbacks.  In films where the observers are given admittance to the inside of the performer's head, must be a melange of images, themes and mini-scenes because, alas, that's the way the mind works.  So, from an audience perspective, it works for some and won't for others because, alas again, that is the way OUR minds work. Sorry to wax so psychiatrically but films like this one, as imperfect as it is, can tell us a lot about ourselves.","user":"artzau","rank":[35,48]}]