[{"title":"a genuine charmer","rating":12,"date":"12 December 2004","review":"Thomas McCarthy's 'The Station Agent' is a joyous and wondrous tale of three rather unique and quirky individuals whose lives intersect at an abandoned train depot in rural New Jersey. <br><br>When a dwarf named Fin inherits the station from a business partner, he moves there, hoping to find a place where he will finally be free from all the prying eyes, pointing fingers and knowing smiles he's been subjected to all his life. However, Fin finds that, even in isolation, it's not always easy to be alone. As soon as he takes up residence in his new abode, he meets up with Olivia and Joe, two people with whom he seems to have little in common, but with whom he manages to forge a lasting friendship. Olivia is a struggling artist who lost her young son two years earlier in a freak accident. Grief-stricken and trying to put the pieces of her life back together, Olivia experiences major mood swings that make it hard for others to get close to her, no matter how hard they try. Fin, likewise, is a shy, taciturn young man who has pretty much given up the possibility that he will ever be able to have a 'normal' relationship with other people (let alone women). Thus, he turns inward, throwing up barriers in an effort to keep people out of his life, hoping that, by doing so, he will avoid getting hurt any further. Joe, on the other hand, is a garrulous young Cuban who runs a hot dog stand right outside Fin's station, a man who chatters on endlessly about any subject and sees nothing wrong with forcing himself into Fin's life, blithely unaware that his company is the last thing Fin wants. Yet, Joe is so openhearted and good-natured that even Fin, though desperately craving privacy and silence, hasn't the heart to dampen the young man's desire for companionship and friendship. Somehow, through the trials and tribulations of daily living, these three strangers develop a bond of friendship, love and mutual support.<br><br>The set-up for 'The Station Agent' could have led to any number of serious pitfalls, given its potential for unbridled quirkiness and feel-good sentimentality However, McCarthy has managed to walk that fine line between preciousness and charm, contrivance and originality, calculation and spontaneity. He has fashioned an adroit screenplay filled with likable characters, rueful humor, clever one-liners and restrained slapstick. The film is less concerned with storyline and plot than it is with tone, mood and character interaction. Throughout the film, we seem to be eavesdropping on the lives of these people, understanding that we will never fully know all the life experiences that have gone into making them the people they are today, but happy to spend just this little bit of time with them anyway. <br><br>'The Station Agent' is a masterpiece of fine acting, with Peter Dinklage, Patricia Clarkson and Bobby Cannavale delivering pitch-perfect, bell-ringing performances. As the reticent dwarf, Dinklage is particularly brilliant at creating a character out of little more than body language and facial expressions. His work here offers definitive proof that some of the greatest acting and character development can be accomplished with a minimum of dialogue.","user":"Buddy-51","rank":[217,234]},{"title":"A note-perfect little film that draws you in with the slightest of touches to produce a wonderful little film that is well acted, well written and well directed","rating":29,"date":"29 September 2004","review":"Finbar has lived all his life with dwarfism and has carved out a pleasantly quiet living working in the back room of a model train shop. When the owner dies suddenly, Fin finds himself without a place of employment but with the inheritance of a patch of land and an old railway depot. Moving up there, he finds the usual pointing and staring and just continues his shut off existence. However a literal run-in with woman suffering loss and an overfriendly coffee stand vendor mean that he is forced to do something he has never really done before  have friends.<br><br>Maybe it is because its plot-lite, quirky nature is aimed at the same crowd that was still busy talking about Lost in Translation but The Station Agent seemed to be gone from the cinemas almost as quickly as it entered it. Not unusual even in a big city like Birmingham  generally non-blockbusters are only given a week, two at most before they are shunted off the screens by something else; but for it to happen to a film that easily matches Lost in Translation for sheer quirky humour and genuine emotional involvement is a real shame because this is a film that I will recommend (but not hype) to anyone who will listen to me. In terms of story, not much happens but three rather solitary souls come together, becoming friends but also bringing all their issues, baggage and problems with them. In terms of substance this is where it is at as the well written script allows Fin's seclusion to be part of him, Joe's innocently friendly nature to be as real as his speed to be wounded while the complexity of Olivia's friendship with Fin is never as simple as it would seem if I were just to state it here. It slowly draws you in with its gentle nature but it really does deliver an engaging and touching story.<br><br>The quirky touch and the gentle humour is very well observed even though at points it was rather obviously delivered with the use of 'quirky' music and strange looking shots. It is this that sets a very nice foundation for the deeper stuff that is to come and helps us buy into the characters early on so that we are there when we need to be. This quirky tone goes across the whole film and I think the only way I can describe it is to call it 'lovely'; it was lovely and it produced a delightful film that is easy to settle into and really enjoy. Dinklage is excellent; he is almost silent at times but gradually grows and you can see in his face his issues but also him struggling to come to terms with this sudden acceptance he appears to be being given as well as his own desire to trust people where he has never had a reason to before. It is very easy to praise Clarkson for strong performances but she has done it yet again with a performance that makes her character so layered but also so revealing without ever being obvious. Cannavale is given less story and character to work with but he makes the most of it and effortlessly avoids the 'yaw bro' cliché that he could easily have been and produces a sensitive, likable and sympathetic character with comparatively little material. The film has others in it but these three are the core and, with three wonderful leads how could the film have been anything less than it was?<br><br>Overall this is a very slight film that ends as quietly as it began and has little in the way of plot in between. However it has a wonderful mood delivered by unfussy direction, a unobtrusive and fitting score, wonderfully written characters and three wonderful lead performances. Missed by many on its cinema release, this is a wonderful little film that I hope will continue to surprise those that come across it during the coming years on DVD, cable and television.","user":"bob the moo","rank":[148,168]},{"title":"Size matters","rating":8,"date":"16 June 2004","review":"\"The Station Agent\" is a slice-of-dwarf-life character study which takes a long, hard look at little person Fin (Dinklage), a train buff who inherits an old, inactive train depot where he takes up residence and then becomes involved with the locals. This poignancy packed flick spends its full 88 minute run with a sometimes cheeky, sometimes plaintive and always human development a handful characters who all have problems of their own. An extraordinary first outing for writer/director McCarthy, this little indie received raves from critical corners and applause from the public at large making it an almost sure thing for potential viewers. A wonderful film which makes the point that size does matter when it's size of character and not stature. (A-)","user":"=G=","rank":[100,117]}]