[{"title":"Go Team Slapstick!","rating":7,"date":"27 September 2004","review":"Once every few years, you're presented to a slapstick comedy so hilarious you instantly forget how LOW this form of entertainment actually is. I can't give a scientific explanation to state how come it's funny to see someone (preferably wearing glasses) getting hit in the face by a ballit just is. Dodgeball is vulgar, crude and without substancebut your stomach will hurt from laughing and don't we all need that from time to time? In case you really want to defend this film, you can always say it features tons of unsubtle criticism towards modern American image of exaggerated health-obsession. Ben Stiller's character is the personification of the obnoxious fitness guru: 'We're better than you, and we know it'. Opposed to him, there's Vince Vaughn as the chilled-minded, lovable guy who owns a fitness center for the underdeveloped wimps. Due to his financial situation, he risks losing his gym to Stiller except if he and his teams of misfits manage to win the world-famous dodgeball tournament. The film is a series of cheap chuckles, eccentric characters and outrageous one-liners. It's pretty funny to hear Stiller yell out lines like: 'You're a skid mark on the underpants of society'. Or the always-amusing Rip Torn encouraging his team with the words: 'you're as useful as a cock-flavored lollipop'. The acting is great as it can be with Ben Stiller and Rip Torn who go delightfully over the top and lots of enthusiast cameos (Chuck Norris, David Hasselhof, William Shatner and even Lance Armstrong). It sure isn't Schindler's List but Dodgball is great entertainment and stress releasing.","user":"Coventry","rank":[119,153]},{"title":"Forget the Nay Sayers!!, This is a Damn Funny Movie!!","rating":12,"date":"12 December 2004","review":"I just watched Dodgeball last night and I can't remember laughing so hard at a movie in years, from Vince Vaughn finally being cast as a person you can like to Rip Torn who is always at his best as the sarcastic coach who is full of colorful one-liners, and I didn't start out as a Ben Stiller Fan, but his movies have seriously picked up in quality lately<br><br>From the supporting cast and the cameo's everyone does a top notch job, Gary Cole is especially amusing as the sports announcer and his always missing the point sidekick, The Dim bulb Chris Klein type Dimwit on Vince Vaughns team adds to the hilarity, and Missy Pyle(What A Babe!!)<br><br>Forget what all the Negativity from the other reviewers state, this is a comedy, a comedy is meant to entertain, it is not Casablanca or the Producers, but it is not meant to be<br><br>(****) Out Of (****)","user":"MCETXCEM","rank":[120,163]},{"title":"superior slapstick comedy - tightly scripted, it gets immense mileage out of the flimsiest of gags","rating":7,"date":"3 October 2004","review":"Go and see it. It's one of the best comedies of the year and a lot funnier than it should be given the flimsy premise. Ben Stiller has a big 'Globo' health club worth millions (it even includes cosmetic surgery facilities - they know that 'fatness is genetic, like baldness or necrophilia'). The lovely Christine Taylor is his lawyer, charged with getting rid of the 'Average Joe' gym across the road so they can build a parking lot for Globo customers. She takes a liking to the 'underdog' owner of the Average Joe gym though, and helps them in their plan to win a Dodgeball contest in order to get the money they owe. Dodgeball is an 'obscure' sport that mostly consists of throwing a ball to hit your opponent (look it up on the Net - Dodgeball fans take it quite seriously!) Even when I describe the film, I think 'it sounds awful' - I probably would have avoided it if it hadn't been recommended so highly - and I recommend you stay till the *very end* of the credits for one of the best scenes (which also takes a swipe at the US film-making industry!)","user":"Chris_Docker","rank":[65,87]}]