[{"title":"Light comedy with some good laughs","rating":5,"date":"5 February 2006","review":"In previews and early reviews this movie was called \"one of the funniest movies ever\" and I was eager to see it. But after a while it began to get called \"the worst Jim Carrey movie ever\". I still thought I should see it, being a big Jim Carrey fan, plus I haven't always agreed with the critics. After seeing it I can't say it's the funniest movie ever, but it definitely isn't the worst.<br><br>I have not seen the original version, but I'm sure there are some modern plot twists and of course original jokes. There are plenty of gags and funny situations that kept me entertained throughout and some really good ones that made me laugh hysterically. Many comedies are very silly which makes them so funny, but people have said that this movie is just silly and not funny at all, I can't agree. While there are some small parts that are just silly, the rest are not.<br><br>Acting wise it is quite good. Jim Carrey does his trademark craziness well in this one. The rest of the cast do well too.<br><br>Overall it's a funny, entertaining movie. If you feel like a light comedy with some good laughs, ignore the harsh critics and go and see it.","user":"roddick-1","rank":[40,51]},{"title":"A Fun Movie with Great Physical Acting","rating":7,"date":"3 June 2006","review":"Have we lost our humor in America? This is a very funny movie. In many ways it's a dark comedy with a happy ending. But it moves quickly, is a parody on timely issues and has some of the best physical acting you'll ever see.<br><br>Jim Carrey and Tea Leoni work very well together. And while the 1977 original had two of my favorite people (whacko politics aside for Jane Fonda because she was a hoot in Barbarella), I think this version was more light hearted and more up to date.<br><br>I have a strange feeling that younger people didn't understand the concept, 20-30's thought it implausible for them and people above were frightened by its premise.<br><br>7 out of 10 for an entertaining time.","user":"dublin9","rank":[61,87]},{"title":"\"Fun\" with Dick...and Jane","rating":9,"date":"25 December 2005","review":"I'm a huge Jim Carrey fan; I've found with most people that you are or you aren't. If you aren't a Carrey fan than this film may not be for you...<br><br>I was very anxious for this film to come out once I heard it was in production; however, after I saw a couple of reviews on TV it appeared to be another clichéd holiday flick that featured a toned down version of Carrey.<br><br>I made sure to keep my hopes low for this film just in case Carrey was not in pure form; however, I was delightfully surprised. Carrey lights up the screen once again with his zany antics and rubberface slapstick comedy. The film, by far from my favorite Carrey movie will definitely be added to my collection for not only Carrey's comedic stylings, but also for its good acting (Baldwin, Leoni) and message.<br><br>Although I never did see the original, the present day story hits home with current collapses of major corporations such as Enron, Worldcom, and many others. Although this updated script seemed a bit unfinished it was definitely worth the $6.00 ticket.<br><br>Teà Leoni, while at times was a bit hard to swallow made a good match for her high energy movie spouse, Jim Carrey. She was able to come up to Carrey's intensity with her constant anxious energy, yet throughout most of the movie he out shined her as he does most of his movie co-stars.<br><br>Another unmentioned quality that the movie has is its clean content. The cussing is kept to a minimum and there is no graphic or violent content; making it a great choice for a family film. My 6-year-old niece saw it with me and she was laughing throughout and it kept her attention! <br><br>Although I did not give the movie a perfect rating mainly due to the script and emphasis on plot, I would give this movie 3 out of 4 stars. I would liken the film to Liar Liar with a watered down script. I would definitely check out this one out - you're guaranteed to have Fun with Dick, and maybe Jane =)","user":"Trinity3777","rank":[146,231]}]