[{"title":"A Calm, Engaging Mystery","rating":8,"date":"11 September 2019","review":"Edward Norton, by most film fans, has been and will always be known as one of the best actors out there. Appearing in classics like Fight Club and more modern masterpieces like Birdman, he's never been one to pick a bad project on purpose. Motherless Brooklyn marks his latest leading role, while also directing and writing. As ambitious and difficult as that is, he has pulled it off quite well. Motherless Brooklyn is a very well-made period piece.<br><br>Set in the 1950s, this film follows Lionel(Edward Norton) after the murder of his closest friend and colleague. Hellbent on discovering who the killer is, he finds himself on a paper trail across Brooklyn, never giving up on his plan. Being someone who also happens to suffer from Tourette Syndrome, he is a character that has a lot of depth to get behind. Personally, this particular character needed a great performance in order to be authentic, which is where this film shines the most.<br><br>It's been a while since I've seen Edward Norton this committed to delivering a powerful performance. There are hardly any instances where he feels like he doesn't actually suffer from this condition. His devotion is what kept me engaged because the overall story does slightly meander at times. At nearly two and a half hours, this film can feel its length at times, but that's simply due to the fact that this movie cares about its characters and spends a lot of time on long conversations, some of which do lead to revelations though.<br><br>Based on a book, this screenplay here definitely feels inspired and the voiceover work by Norton calms the viewers throughout, making for a sort of relaxing experience. In addition to that, the use of classical and jazz music is so much in the forefront that it nearly became a character of its own in the film. I really admired that aspect. Still, the overall movie doesn't leave too much for the audience to figure out, since the narration does lend a hand.<br><br>In the end, Motherless Brooklyn is a really, really solid crime mystery that has the perfect setting and feel for this sort of premise. I found myself completely engrossed in this world and was eager to see where the movie ended up. Edward Norton gives an award-worthy performance and his direction only adds to that, making for a great overall movie. Motherless Brooklyn may be meant for a more mature audience as it is quite niche in terms of the nature of the story, which may lend itself better to an older crowd. Even so, I quite enjoyed myself.","user":"kjproulx","rank":[182,216]},{"title":"Gorgeous depiction of '50's New York in color & music despite dense plot.","rating":7,"date":"4 November 2019","review":"If you couldn't keep up with Chinatown's and LA Confidential's plot and continuous placing and connecting of characters' names associated with civic and political corruption then Motherless Brooklyn will have you drowning in it.<br><br>That's why I give it a seven rating. It's almost 2 1/2 hours of figuring out what's going on and who's doing it, but at least the look and sound of the movie provides a huge respite with the best sounding Bee Bop jazz and lush background theme soundtrack I've ever heard in a movie.<br><br>As a photographer I thought the cinematography was stunning in color and composition, less film noir and more '50's style New York street Kodachrome photography with compositions of odd reflections and angles interspersed smoothly with the flow of the narrative master shots in a style similar to Winogrand and Vivian Maier.<br><br>The variety of vintage '50's automobiles in pristine and brand new condition with the rich look of Kodachrome color is another treat. The sound of the rattle of car doors slamming is even accurate.","user":"tlooknbill","rank":[57,69]},{"title":"A tight and gripping movie","rating":10,"date":"12 October 2019","review":"The movie recreated the 1950s NY in an amazing way. Great cast who portrayed their roles with authenticity. It had a nice leisurely pace but held on to the suspense till the end. Saw during the NYFF premier ... it was a great choice to end the 2019 festival. Would recommend the movie for anyone who can appreciate good meaningful cinema.<br><br>Motherless Brooklyn is the kind of movie Hollywood almost never makes anymore, and a complexly conceived, robust evocation of a bygone era of New York that speaks to our present moment.","user":"rakeshroy31","rank":[120,159]}]