[{"title":"A film from which i didn't expect much but that impressed me","rating":10,"date":"20 March 2005","review":"\"Kumo no mukô, yakusoku no basho\". I saw it without knowing much about the plot and it pleased me a lot. The film tells a story of fiction of three friends and of how time changes them.<br><br>It is very interesting how many Japanese films (not only anime) represent in a much more realistic way how human relationships are. And this is what happens with this film: although the story is fictive, the relationships are like real ones are.<br><br>This film is art. It is fantastic how the characters are drew. The ambient that you smell from the first image, the music... everything.<br><br>At the end, I felt something that I've only felt very few times: it was satisfaction. I felt satisfied although I didn't comprehend the plot completely. And that feeling, that from the very first moment invades you is unpayable.<br><br>I recommend it to you and... enjoy ;). I'm sure that although I don't write in English very well, and this comment didn't impressed you much, you will like this film.","user":"ljl16","rank":[77,90]},{"title":"Beautiful","rating":10,"date":"8 June 2005","review":"This is an anime movie done by a relative newcomer to films: Makoto Shinkai, whose only previous directorial work was a half-hour short called \"Voices of a Distant Star,\" in which he did all the animation himself on one laptop (even for Japan, a nation of workaholics, that was unheard of). It made him so famous that they gave him a full studio to work with for his next project, and when Makoto Shinkai doesn't have the constraints that a solo project would bring, look out.<br><br>The style of the film and its sci-fi and fantasy themes is equal parts steampunk and cyberpunk, with the film taking place in an alternate timeline of post-war Japan, only a few years from now. The main differences are the division between the North and South sides of Japan, and the research into parallel universes that has sprung up, resulting in the construction of a massive tower in Ezo (Hokkaido), which understandably captures the imagination and curiosity of the surrounding world.<br><br>Though the film is ostensibly a science fiction work, the plot involving a tower and alternate realities and so on plays second fiddle to the romantic drama, about three high school kids torn apart by war. The emotions blend with the fantasy elemts in a way that is handled with incredible elegance, care and sensitivity, and Makoto Shinkai's trademark poetic touch.<br><br>But what is more impressive is how the film shows that drama can be achieved through implausible situations. You see, too many directors think that in order to make a film \"dramatic\" and \"touching,\" it must be about REALISTIC people in a REALISTIC setting having REALISTIC problems with REALISTIC resolutions, but Makoto Shinkai realizes a way around that, and uses a science fiction element not as a platform for action sequences, but rather as a way to achieve a kind of drama that you really couldn't get in a film that takes place in the \"real world.\"<br><br>The film is aware that the sci-fi is playing second fiddle to the character drama, and doesn't waste any more time than it needs to trying to explain the film's bizarre sciences or justify the contrivances, rather leaving it up to the viewer to interpret and decipher what the fantasies of the film mean or symbolize. In other words, Shinkai wisely avoids the deathtrap of \"Movie Science,\" and instead allows the audience to take things as they come and explain them ourselves.<br><br>The part about two teenagers building a plane that could get past a government-built radar system does seem a bit incredible, but this film does reflect on the incompetence of governments and how easy it is to get past them, so the required suspension of disbelief isn't really that big (I wish I found it hard to believe that a couple of teenagers could get past a bureaucratic governmental system in this day and age at all).<br><br>Also, the brief violence and \"thrilling\" assault on the tower are treated with perfect sincerity. The brief fight scenes are breathtaking in their realism and how they show that when someone gets punched, they get hurt. There are no legendary martial arts techniques or complex laser-rifle technology here, this film is about how people feel about each other and what they do when they are in trouble.<br><br>The ending is slightly abrupt and somewhat open-ended (although it is happy), but that is a theme in many anime. A lot is left up to the audience's interpretation and imagination, and the film only answers the questions that really matter.","user":"StarAxis","rank":[46,54]},{"title":"Makoto Shinkai creates another beautiful film","rating":7,"date":"20 March 2005","review":"After seeing Voices of a Distant Star, I eagerly awaited Makoto Shinkai's next work. This movie exceeded my expectations. It is as visually captivating as Voices, contains beautiful music, and is longer and more complex.<br><br>The plot (which twists and turns considerably) follows three high school kids through a period of war. There is a giant tower visible from where they live, a huge white structure that reaches up through the clouds. They all long to go to the tower one day. Over several years, they build a plane to fly to the tower, but certain complications prevent them from making their flight. The plot becomes slightly confusing in the middle, as it involves talk of parallel universes. But the movie ends triumphantly, with the three friends, separated for years, meeting again to fly to the tower. But, for reasons I will not reveal, their flight will have a deeper impact than they thought.<br><br>Overall, the movie is beautiful. It is a joy to look at. Every scene, from the lighting to the vivid colors, captures a certain place and mood perfectly. The animation alternates between standard anime and fluid, computer-generated eye candy. At times the film feels like a play, with characters delivering heartfelt soliloquies that evoke feelings of loneliness and sorrow. Many of the emotions in Voices of a Distant Star are carried over to The Place Promised to Us In Our Early Days. But here, with many characters and a longer, more involved plot, the emotions resonate more deeply.<br><br>Though Makoto Shinkai's style is different from most of today's anime directors, the quality of his work is comparable to Hayao Miyazaki.","user":"gershwin921","rank":[24,28]}]