[{"title":"It wears its sentimental heart firmly on its fetlock.","rating":9,"date":"30 March 2009","review":"As the depression era kicks in, Americans were grasping for any sort of inspiration they could get, enter equine supreme, Seabiscuit. Considered broken down, too small and untrainable, Seabiscuit went on to become a bastion of great racehorses and in the process bringing solace to those closest to it.<br><br>Back in 2003 upon its initial release, critics were very divided as to the merits of Seabiscuit as a picture. Some were concerned that this adaptation from Laura Hillenbrand's highly thought of novel missed too many crucial elements, others were merely touting the tired old charge of the film purely baiting Oscar (something that is levelled at every film in history about hope and second chances), the more astute critics of the time however lauded it as the delightful and inspiring piece that it is.<br><br>It would be churlish of me to not agree that Seabiscuit is laced with sentiment, rookie director Gary Ross barely wastes a chance to tug the heart strings and paint an evocative sequence, but if you have got it in you to accept this true story for its base emotional point, then it is one hell of a wonderful experience. Seabiscuit is not just about the equine beauty of the picture, it's also a fusion of three men's personal wavering, who for one reason or another need the horse for far more important crutches than those provided by financial gain, make no bones about it, Seabiscuit is a very human drama. Knowing how the picture will end never once becomes a problem, because the historical accuracy in the story makes one yearn for that grandiose ending, one to gladden the heart in the way it must have done to thousands upon thousands of Americans back in the depression era day.<br><br>Ross wisely chooses to filter in as much realism as he possibly can, archive stills and narration serve as exceptional points of worth to the narrative structure. Then there is the first rate cast to fully form the emotional complexities that Seabiscuit provides. Jeff Bridges, Tobey Maguire (waif like), Chris Cooper, Elizabeth Banks, top American jockey Gary Stevens and a splendidly jaunty William H Macy, all can rightly feel proud of their respective work on this picture. Yet it's with the thundering race sequences that Seabiscuit really triumphs best, magnificent beasts hurtling around the race track are excellently handled by Ross and his cinematographer, John Schwartzman, whilst a nod of approval must go to the sound department's efforts, for this is definitely one to give your sub-woofer a work out.<br><br>Seabiscuit was nominated for seven Academy Awards, winning none, perhaps the Academy also felt like those critics who thought it was trying too hard for a Golden Statue? But now after the dust has settled some years later, it pays to revisit Seabiscuit and judge it on its own emotional terms, for it's a tremendously well crafted picture that is of course as inspirational as it most assuredly is tender, a fine fine picture indeed. 9/10","user":"hitchcockthelegend","rank":[43,47]},{"title":"This movie is just Ratatouille, but in reverse!","rating":2,"date":"4 December 2019","review":"If you think about it, this so-called film is just the Pixar classic Ratatouille, except in reverse (i.e. instead of an animal (in the case of Ratatouille - a \"rat\") piloting a human, this movie is a human piloting an animal (in this case, a \"horse\").<br><br>I did not enjoy it!","user":"freddiew-62584","rank":[65,75]},{"title":"An old-fashioned winner all the way","rating":9,"date":"13 August 2003","review":"It's fitting that a film about underdogs giving it all they've got has been released among the standard summer action fare. No other movie this summer has capitalized upon the David vs. Goliath theme so thoroughly and effectively as `Seabiscuit' has.<br><br>The story of `Seabiscuit' is actually the tale of four long shots: Charles Howard (Jeff Bridges), a wealthy self-made man and natural salesmen who's suffered both personal and financial loss through the Depression, Tom Smith (Chris Cooper), an aging horse trainer unsure of his place in the world with the ending of the frontier, Red Pollard (Tobey Maguire), a short-tempered jockey with various handicaps against him, and Seabiscuit, an undersized mustang whose been mistreated his whole life.<br><br>It's the Depression, and times are hard on everyone. The assembly line philosophy of business is starting to squelch independent spirit and people are looking for anything to help escape the dreary day-to-day of life. During this maelstrom of hopelessness, horse racing quickly gathers favoritism among those wishing to witness a spectacle in otherwise bleak times. It's under these circumstances that the film's four main parties come together. Howard, seeking a new business venture in horse racing, hires Smith as his horse trainer and Pollard as his jockey, and upon Smith's insistence, purchases the ill-tempered Seabiscuit.<br><br>It's not long before Seabiscuit becomes the `little horse who could,' gaining favor among the sporting fans on the West Coast. But despite the popularity the mustang and his team gains, they are seen as just a cheap novelty by the East Coast horse racing elite, led by Samuel Riddle, owner of the 1937 Triple Crown Winner War Admiral. This mushrooms into a media circus as Howard tries to gain public favor in order to force Riddle to put his money where his mouth is.<br><br>The story should have felt cliched and by-the-numbers, but a funny thing happened: the film makers took a nearly forgotten moment in time and managed to invest it with immediacy and suspense. The near mythic meeting of Seabiscuit and War Admiral on November 1, 1938 at Pimlico is an extension of the movie's overall theme; Seabiscuit, the representative of underdog hopes and pioneering dreams, and War Admiral, the recipient of champion breeding and training, a product of assembly line thinking.<br><br>Bridges and Maguire give spirited performances, with their characters forming a father and son bond that both men desperately needed. Cooper, who won this year's Best Supporter Actor Oscar, can give this kind of performance in his sleep, bringing a quiet, stoic depth to the Smith character. The supporting cast is top drawer as well, especially William H. Macy as `Tick Tock' McGlaughlin, the initially skeptical radio sports commentor who becomes a full blown Seabiscuit supporter.<br><br>Director Gary Ross captures the time period marvelously, with broken human beings slowly recapturing their dignity and pride against a landscape of barren ruin. The conflicts are fought not on traditional battlefields, but atop magnificent beasts along a circular track, and Ross wisely utilizes this metaphor to full effect.<br><br>Many film goers this season will most certainly pass on `Seabiscuit,' choosing instead to see standard fare like `American Wedding' and `Tomb Raider: The Cradle of Life.' Others will undoubtedly avoid it because it looks to artsy to be entertaining. For whatever reason, it will be a shame that this film will not do well financially; the horse race scenes are some of the most intense I've ever seen, and the animals are pure poetry in motion.<br><br>9 out of 10 stars. A nearly flawless motion picture.","user":"filmbuff-36","rank":[66,78]}]