[{"title":"\"I'm just a guitar player. That's all.\" - Bob Dylan","rating":10,"date":"29 September 2017","review":"Think about this - the Dylan 30th Anniversary Concert took place in 1992, that's already twenty five years ago! And this year, 2017, Dylan has released a new triple disc album. That's fifty five years and still going strong! Wow! And you'll say Wow! to the incredible lineup showing up to pay tribute to Dylan's first thirty years of writing and recording with this Concert Celebration. The list of performers reads like a Who's Who in the world of Rock 'n' Roll with some additional unexpected faces also on hand to lend their support. Like the Clancy Brothers from the Irish folk scene, and Johnny Cash with wife June Carter. Actually, Johnny Cash wasn't that big a surprise. Cash held Dylan in high regard as a poet and musician, and Dylan was his very first guest on the debut of 'The Johnny Cash Show' in 1969. So a bit of professional payback there.<br><br>The evening at New York's Madison Square Garden on October 16th, 1992 got off to a rocking start with John Mellencamp performing 'Like a Rolling Stone'. Other favorite performances of mine included the Cashes on 'It Ain't Me, Babe', Neil Young on 'All Along the Watchtower', Chrissie Hynde doing 'I Shall Be Released, Eric Clapton with a great bluesy version of 'Don't Think Twice, It's Alright', and of course the great finale with everyone joining in on 'Knockin' on Heaven's Door'.<br><br>The only downside of the entire evening occurred when the audience met Sinead O'Connor with sustained booing, a reaction to her tearing up a photo of The Pope on 'Saturday Night Live' a couple of weeks earlier. When the band began playing the song she intended to sing, she waved them off and went into a screaming rant of Bob Marley's 'War', the same 'song' she did on SNL. Afterward, she was escorted off stage by Kris Kristofferson who had introduced her.<br><br>I thought about O'Connor's display of disrespect and had to wonder what would have happened today if she had turned in a similar blast against the current Pope. With the amount of liberal vehemence expressed against Christians and Catholics in particular, she might actually be cheered today, except for the fact that the current Pope leans toward Socialism. In which case one might expect her to get booed all over again. Isn't it interesting how perceptions change with the times? O'Connor maintained her personal disdain for the fans during the 'Knockin' on Heaven's Door' number by standing stone faced with her arms crossed and not joining in. Her presence really was quite embarrassing, though the performers who followed her took things in stride and were not affected by her behavior.<br><br>If you have the program on CD you'll have a little over three hours of concert video with additional backstage and rehearsal footage, along with three more songs performed by Mellencamp, Nancy Griffith with Carolyn Hester, and Booker T and The MG's. It really is one of the best concerts you'll ever experience, while catching many of your favorite artists in one place at the same time. Can't beat that.","user":"classicsoncall","rank":[3,3]},{"title":"Amazing!","rating":10,"date":"22 February 2008","review":"I love this concert so much! And I was only 6 years old when I watched it on Television. What a great collection of amazing music legends... Tom Petty did an outstanding job on this, \"License to Kill\" is probably by favorite performance on here. Not to mention \"It Ain't Me Babe\" performed by June Carter and Johnny Cash is some pretty amazing stuff. Every performer brings something unique to the stage. Truly a concert that is all about the music and not about the light and appearance. This is one of those concert I wish I could have gone to. I can watch this over and over and never get tired of it! A must see for Bob Dylan and old music lovers! Check it out!","user":"swt-phr","rank":[5,7]},{"title":"One of the greatest concert films","rating":10,"date":"19 December 2015","review":"One of the greatest concert films.<br><br>16 October 1992, Madison Square Garden, New York. A concert to celebrate Bob Dylan's 30 years in the music industry. The list of performers, all performing Dylan songs, is amazing: Dylan himself, John Cougar Mallencamp, Kris Kristofferson (who was also MC), Stevie Wonder, Lou Reed, Eddie Vedder &amp; Mike McCready from Pearl Jam, Tracy Chapman, Johnny Cash &amp; June Carter Cash, Willie Nelson, Johnny Winter, Ron Wood, Richie Havens, Neil Young, Chrissie Hynde, Eric Clapton, The Band, George Harrison, Tom Petty &amp; The Heartbreakers, Roger McGuinn. Supported by Booker T and the MGs.<br><br>Great versions of great songs, sung by phenomenal artists. <br><br>Brilliant.","user":"grantss","rank":[2,3]}]