[{"title":"I don't want to live anymore.","rating":1,"date":"1 April 2004","review":"And I only watched the first 25 minutes. It is inconcievable to me that anyone could make a film this hopelessly, endlessly, mind-meltingly bad. This is not a bad movie - it's a war crime. Somehow the producers actually managed to cast supporting players bad enough to make Kelly Clarkson and even the talent free Justin Guarini seem good by comparsion.<br><br>The alleged \"choreography\" ammounts to nothing more than frantic flailing of limbs. Accents come and go with wild abandon. The songs are, to put it charitably, forgettable. I'm surprised \"American Idol\" judge Randy Jackson isn't credited as a writer, because the dialouge is that witless and badly phrased.<br><br>This is the worst thing humanity has ever done.","user":"tipplerunkus","rank":[369,393]},{"title":"Awful. Simply awful.","rating":1,"date":"7 July 2004","review":"Yes, it finally came on cable. And, in order to keep up my credentials as an expert on badfilm, I had to deal with this monstrosity sooner or later. So, without further ado... <br><br>Oh...my...God... <br><br>Who thought this was a good idea? Trying to make a quick buck off of a flavor-of-the-week TV show I can understand, but who thought this had any chance of success? Too retarded for anyone over 14; too campy and too much like a \"Gidget\" remake for the 9-14 set; too much skin for the \"Barney the Dinosaur\" crowd. Not enough plot for a 30 minute sitcom, and every teensploiter movie cliché ever, without either the humor (the saving grace for the good ones) or the nudity (sometimes, the saving grace for the bad ones). Anyway, a few random notes: <br><br>1. One of the first songs was Kelly Clarkson's remake of \"Vacation\" by the Go-Go's. I always considered this to be a light, bouncy pop song. That was, of course, until Kelly and her overproduction team sucked the life out of it. Now as bouncy as a Complin Service, this one made me wish for a brief return of the early, punk, Go-Go's, who probably would have roughed up anyone who did one of their songs this badly. <br><br>2. Justin, teen heartthrob? He is so thin I might be able to tie a string to him and fly him on a high wind day! With that 'fro, he looks a little like a pipe cleaner. Note to the Director: having Justin wear a black shirt when all the other guys in a song set are shirtless is not hiding anything; he sticks out like, well like a black pipe cleaner in a sea of artificial tan.<br><br>3. Aw, look: the obvious backstabbing friend/ nemesis slut girl with the hee-haw southern accent is trying to steal Kelly's scenes away from her by overacting in contrast to Kelly's underacting! Sorry, young lady obviously chosen for your ability to pack a small swimsuit: nobody who cares is watching. <br><br>4. Justin's \"nerd\" friend/ sidekick: you can almost see the lineage trace lines, going back through far superior nerd/ sidekicks (\"Better off Dead,\" \"Ferris Bueller's Day off\"), all the way back to the early \"Beach Party\" movies and Rebel Without a Cause. In fact, his clothes seem to be lifted from the outfits from the early \"Beach Party\" movies' nerd/sidekick wardrobes; if they actually date from the early 1960's, they might be considered retro/cool in some circles and thus worth more than the rest of this film. <br><br>5. Oh, the intense chemistry between Justin and Kelly... Really, I am serious. Oh, yes. Alan Rickman and Kate Winslet, in Sense and Sensibility, were an overflowing cauldron of unrestrained sexual passion compared to these two. If Justin was trying to dispel those \"man's man\" rumors, this did nothing to help. <br><br>How to get the movie to go from sluggish to dead in the water: Justin and Kelly, alone, in a scene for more than five seconds. <br><br>6. Kelly's nice black friend is being taken to a ritzy Latin nightclub, which is located in...an abandoned corrugated metal shack??? I need to check that abandoned building on the next block; the Cotton Club might have started a branch there. Mitigating factor: the Latin dancers were way more talented than the blandly white beach dancers in the other scenes.<br><br>7. OK, Kelly, so you admire Bjork. I can see you appreciate her independence, willingness to go her own way, and most of all given your situation, her career longevity. If you want to do a homage to Bjork, altering your bland, middle-of-the-road song delivery would be a good place to start. Your hairdo was, in fact, not a good place to start.<br><br>8. Hee-haw girl does a bad impersonation of Madonna's \"Material Girl\" video. Which means, of course, she is doing an even worse second-derivative impersonation of Marilyn Monroe. This has no purpose other than to satisfy some requirement in her contract that she got to be the lead in one song number. <br><br>9. Telepathic singing? Oh, no- \"Glitter\" flashbacks! <br><br>10. Justin in a game of hovercraft dodge-ball? The stunt double must be a girl to get the sizes right. Oh, look, the danger: he has lost control of a motorized inflatable hovercraft in three feet of warm water!<br><br>11. Hee-haw evil girl is proud of notching up various studs, and now she is hitting on- Justin??? <br><br>12. THAT was how evil hee-haw girl's plots were discovered? Did the budget get pulled, and they needed a way of wrapping up the plot faster than you could say \"Deus Ex Machina?\" <br><br>13. The final massive musical number: a K.C. and the Sunshine Band cover! While deeply painful on so many levels (including watching nerd-boy dance), at least they mangled an already bad song, rather than torture a once respectable song. <br><br>Anyway, yes, this movie is just as bad as you have heard.","user":"CTS-1","rank":[236,264]},{"title":"Oh. My. God.","rating":1,"date":"12 February 2004","review":"There are bad movies. There are really bad movies. And then there's this one. Morbid curiosity compelled me to seek it out, just so I could see for myself exactly how dreadful it was. I got about eight minutes into the 'film' before I suddenly developed an overwhelming urge to run around hitting things very, very hard. Still, 'From Justin To Kelly' really is a must see flick if you have any dreams of breaking into the movies, because believe me, if utter garbage like this can be solicited, then quite literally anybody's got a shot.","user":"beerslayer80","rank":[143,159]}]