[{"title":"Mission Impossible","rating":8,"date":"13 February 2020","review":"Easily not the best mission, but thanks to JJ Abrams direction and an absolute menacing performance from Philip Seymour Hoffman this movie is more than deserving of repeat viewings.","user":"MR_Heraclius","rank":[34,34]},{"title":"Fast-paced action thriller","rating":7,"date":"28 July 2014","review":"If you are craving a non-stop action movie with a decent plot and acting, go no further than MI-3. Tom Cruise reprises the role of Ethan Hunt, IMF agent extraordinaire who is attempting to leave the IMF field work to others as he takes over training of new agents. Can he stand it? Of course not! or the movie would've ended in 10 minutes!<br><br>He's engaged to marry Michelle Monaghan as his fiancée Julia. I think their chemistry was pretty good. I recently watched her in Source Code and she's a terrific actress. At an engagement party, Ethan gets a call and next thing you know, he's back in the field. He just has that itch and needs to scratch it. Cruise does a decent acting job of a guy torn between two worlds, where he wants to be just another normal guy, but his whole team is telling him that he can't have a normal life. <br><br>His team delivers, particularly Ving Rhames, who is so Mr. Cool. Also Maggie Q has a unique ability to blend in as nobody special, but be made to be very sexy when needed. Jonathan Rhyss Myers was standard. I saw him in Bend it Like Beckham, and he's OK as an actor. Laurence Fishburne delivers as a mega boss type guy who takes no crap or bs from anyone. And finally Billy Crudup as Cruise's mission chief who aids and abets Cruise outside the authority of officialdom. <br><br>The plot is pretty simple, good guys against bad guys. Phillipe S. Hoffman absolutely delivers as evil, sadistic, feelingless arms dealer Owen Davian, who sells anything to anyone for a price with no concern about anyone. Hoffman, RIP, has some tremendous scenes with Cruise, where they go toe to toe in life or death struggles. Whoa, those scenes are really intense emotionally and physically.<br><br>The action spans the globe from the US to Germany to Italy to China and back. At a little over 2 hours, the film is nicely paced. There are no real down moments where you feel the movie drags - it's non-stop. At the end, you don't really care about the Rabbit's Foot as much as you do about how it's going to go down. Just strap yourself in and enjoy this fine installment to the MI series. Enjoy.","user":"jb_campo","rank":[19,22]},{"title":"Thrilling, Entertaining and Occasionally Smart.","rating":8,"date":"8 May 2006","review":"J.J. Abrams, creator of Lost, takes on the third instalment of the action franchise, which sees human yo-yo Ethan Hunt (Tom Cruise) in rare human mode as he plans on making an early retirement to be with his nurse wife (Michelle Monaghan), only to be go on another impossible mission as he plans catching sadistic arms dealer Owen Davian (Philip Seymour Hoffman). To aid him are Ving Rhames, Jonathon Rhys-Meyers and Maggie Q, and, this being a third, there are gadgets, explosions, sets and plot twists like now other.<br><br>You've got to hand it to Abrams  he certainly knows how to keep an audience on their toes. Drawing on a few of his popular plot devices from Lost (flashbacks, a crescendo to the turning point), he sets us up neatly into his little world, where Ethan Hunt is now a man trying to live a normal life. Whilst that scenario may be a hard to buy, this is redeemed by the many action scenes in the film which are each exhilarating. To go into detail would be spoiling it, but let's just say there is an extremely breathtaking sequence involving a fulcrum, an amusing one involving Tom Cruise disguising himself as someone, and lastly, but by no means least a helicopter chase which is utterly awe-inspiring and barely lets the audience pause for breath. All this, and you get a Michael Giacchino score that perfectly blends action, anxiety, fear and anger.<br><br>The cast in themselves are a treat. Tom Cruise, though not given the most trying of tasks in playing an action hero, does a good job with his usual intensity. In the action scenes, his facial expressions are concentrated and focused and utterly convincing. However, Cruise fails in having any genuine chemistry with Michelle Monaghan, for and the romance comes across as rather bland. This is not aided with the poor writing in these scenes. Ving Rhames, Jonathan Rhys-Meyers and Maggie Q merely look cool as his helpers, and Laurence Fisburne and Billy Crudup successfully bring that edge of moral ambiguity to their characters. And Philip Seymour Hoffman is excellently malicious as the elusive and extremely dangerous Davian, shining in his lizard-eyed role and bringing some genuine terror to the villain. His scenes aside Tom Cruise are superb, as they practically tremble in tension and quiet hatred on both characters parts.<br><br>You will go to see Mission Impossible III expecting some grand-scale set pieces, and you will not be disappointed here. Each one of the four is masterfully executed, with a breezy slickness that is both cool and exciting. We're talking non-stop action, occasionally interspersed with those corny Hollywood love formulae, cruising as \"emotion.\" Its big, its bombastic, and it could be the Summer blockbuster of the year.","user":"PizzicatoFishCrouch","rank":[172,251]}]