[{"title":"Best Saturday afternoon, nothing to do movie!","rating":7,"date":"17 January 2007","review":"I have watched this movie at least 5 times since it was released on video. It is one of the movies that is constantly entertaining. The soundtrack is great and I also agree that the chemistry between the actors was perfect. I would watch this duo again in another film. I'll put this movie on when I am cleaning the house or doing laundry. Every time I end up sitting down and watching most of it. As another viewer commented it is a lot like National Treasure(which I also give high mark). They are both easy to watch, they wrap things up nicely and leave you feeling like you went on the adventure! What else could you ask from a movie...","user":"ceecat1","rank":[59,64]},{"title":"A fun time for all","rating":8,"date":"10 April 2005","review":"I'm extremely perplexed at the lukewarm and especially the bad reviews this one is getting from the professional critics, because my husband and I both found it a very enjoyable romp. Yes, you have to suspend your disbelief during some of the action sequences, but I don't remember people complaining about the lack of realism in the Indy Jones or \"Romancing the Stone\" series. The dialogue (especially the buddy banter and William H. Macy's character) is amusing, the plot easy to follow despite its complexities, and the action virtually nonstop. I also found it refreshing for the sidekick to look like a doofus, but actually more than hold his own during crunch time.<br><br>I can only assume the negative reactions are from fans of the book (I have never read any Clive Custler, so it may well depart from it in tone or otherwise.) But judged solely on its merits as a light-hearted adventure movie, it more than met my expectations.","user":"SmithWrite","rank":[186,246]},{"title":"Silly adventure movie fun... with a heart","rating":6,"date":"14 April 2008","review":"My Take: James Bond meets Indiana Jones with silly yet exciting action, crackling wit. <br><br>Although it was credited as a \"Dirk Pitt Adventure\", SAHARA seems more in kin with James Bond and Indiana Jones than Clive Cussler. I haven't read any of Clive Cussler's books, but I'm absolutely certain that this would be Cussler's visualization. It is, indeed, a B-level adventure film, complete with heroes in top gear (complete with winning grin, no less), the sexy heroine, the sidekick, and the bad guys who want to rule the world (or simply get whatever it is they want). Not to mention the series of stunt play and gunfights done the old-fashioned way. This is the look (and feel) of an action picture they no longer make, which provides most of its appeal. I enjoyed SAHARA on the level many think it doesn't work, and that's being a traditional old-fashioned brainless adventure. It's not great at the field, but at least it has its heart on it.<br><br>Its tag line states \"Adventure has a new name\", it's without question or doubt that Dirk Pitt, Cussler's brainchild hero played here by Matthew McConaughey, will be a new James Bond or Indiana Jones. The charisma given to him is good but obvious. He's calm over tension, and never loses his cool even at extreme measures. The other supporting characters have nothing in them, their there, but practically, their hardly anybody but characters in a movie. If characters in adventure movies could be quite as interesting as those featured in the INDIANA JONES series, couldn't we deserve to get the same on other entries in the genre, including knock-offs.<br><br>Still, what you've come to expect from SAHARA are here anyway. The implausible plot involves the quest for a lost Ironclad in the middle of the Sahara desert (!) by the dashing Dirk Pitt (McConaughey), his sidekick Al (Steve Zahn) and a daring Dr. Eva Rojas (Penelope Cruz), who trek through the blazing desert landscape with camels, vans, boats, you name it. Along the way, they are trailed by the bad guys and get into situations that could only mean more action movie fun. What's in store? Helicopter chases (my favorite!), gunfights, boat chases and even a train chase with camels (who even knew that you can still come up with a fun action movie sequence with camels!). If you don't think this stuff is any fun, you may wanna have to check with your doctor in case your sugar's a little low.<br><br>Is SAHARA any great? No it isn't. But did I get exactly what I wanted from it? It surely does. Even if this genre, which includes films like NATIONAL TREASURE, will never live up to its superior INDIANA JONES ancestors, they will still nonetheless offer the action and adventure it promises. And in that level, SAHARA delivers.<br><br>Rating: *** out of 5.","user":"vip_ebriega","rank":[21,24]}]