[{"title":"Beautifully done","rating":10,"date":"26 January 2005","review":"I just saw this at Sundance. Alice Wu is a first-time director, yet this is one of the best movies I have seen in some time. It is funny, yet tells a beautiful and complex story about communication, traditions and love. It did not look like a low budget independent film at all. The acting, cinematography and music were all beautifully done. One could tell this was an important story to all those involved and that they worked very hard to get it to the final product. The characters are not stereotypes but honest portrayals of Chinese Americans dealing with older traditions in modern America. We are all immigrants, we are all human and make mistakes while struggling for acceptance in society. Sometimes it is what we don't say that effects our lives most.","user":"dennisjlee","rank":[107,116]},{"title":"Two women fall in love. They have to deal with cultural and family and professional issues.","rating":9,"date":"18 April 2005","review":"This first time director/author has made a movie that will have universal appeal. Although the main part of the plot centers on two Chinese women who are successful professionals and are love with each other, the movie is not \"about\" Chinese people or \"about\" lesbians. The story concerns how two interesting people deal with cultural taboos, with their places in the culture and in their families, and with the demands of their respective careers (surgeon and ballerina). But, even with this serious backdrop, the story is told with humor; there are more laughs and smiles than tears. When you see the movie, note how beautifully the romance between these protagonists develops.<br><br>It's likely that this movie will have limited distribution, at least at the the beginning. Look for it. You will be glad you did.","user":"gershuny","rank":[62,68]},{"title":"Exceptionally well done movie","rating":10,"date":"12 May 2005","review":"While this movie has a Chinesse-American lesbian theme, it goes under the same category of \"My Big, Fat Greek Wedding\": you don't need to be one to REALLY, REALLY like it! The writing is extremely humorous and intelligent. It reminded me of the \"Kissing Jessica Stein movie\" in terms of the wit that the writer (who also happens to be the director) brings forth in the script. I was not sure what to expect from a movie that I was seeing at a film festival. I was pleasantly and extremely surprised! The actors were quite believable in their roles and did a fine job. The production quality of the movie was quite noticeable from the start of the movie and was very good and enjoyable to watch. The lead characters are likable and sweet, while not Pollyannish. The story itself is also full of scenarios that most people can relate to regardless of their sexual orientation or race. So, if you're looking for a fun time, out go see this movie and enjoy!","user":"yogasong44","rank":[63,70]}]