[{"title":"Why is this movie getting such bad reviews?","rating":8,"date":"11 February 2007","review":"I've heard a lot of reviews saying this was a bad movie. I disagree! I don't know if any of these people have read any of the books, let alone Hannibal Rising, but I loved the movie. Given, it seemed like Thomas Harris wrote the book strictly for the movie, but I felt this movie was made to have people understand how Lecter, \"the monster\" was created.<br><br>Yes, Lecter is irrational and that's the point. Hannibal Lecter is suppose to be distant because he's a psychopath. He's suppose to be apathetic. Some people mistook that for bad acting.<br><br>Comparing the movie to the book...they were about 85% compatible. Minor changes were made, but nothing too critical.<br><br>I think some people are quick to make this movie out to be horrible because they really are milking the Hannibal Lecter story, but I felt it to be a decent movie.","user":"egodominustuus","rank":[301,457]},{"title":"Tasty Flick","rating":8,"date":"13 February 2007","review":"Isn't it interesting that most critics of this film whine that it didn't measure up to \"The Silence of the Lambs\"? If you merely want a reworking of Lambs, go rent Lambs and watch it again. Frankly, anyone who goes to see \"Hannibal Rising\" hoping to have the same response and emotions engendered by \"Lambs\" is a boob of the first magnitude.<br><br>The fact is, \"Red Dragon\" and \"Lambs\" are psychological thrillers, \"Hannibal\" is an action flick and \"Hannibal Rising\" is a biopic/action flick. Of the four Lecter films, \"Hannibal Rising\" is second only to \"Lambs\" in overall quality. (\"Red Dragon\" was spoiled by Ed Norton's astoundingly robotic performance; \"Hannibal\" was a visual masterpiece but was ultimately tainted by the the screenwriters' obvious desperation to concoct an ending that bore no resemblance to the novel's very cool conclusion.) \"Hannibal Rising\" has it all. 1) Superb direction (Lecter's riverside encounter with Paul Momund is stunning in its ballet-like choreography); 2) a perfectly paced screenplay; 3) beautiful art direction and design; and 4) powerful performances.<br><br>Li Gong's Lady Murasaki is actually as I pictured her in the novel: beautiful, mysterious and not-to-be-trifled with. But it's Gaspard Ulliel who steals the show. It amazes me that he successfully played someone who's simultaneously a sweet, vulnerable youth victimized by the Nazis and the Soviets and a calculating, coldblooded murderer. Ulliel's finest moment is when Lecter unleashes his unhinged wrath in the climatic scene aboard the river barge; it was thoroughly disturbing.<br><br>Don't listen to the critics. Go see this movie.","user":"ecoli8","rank":[145,226]},{"title":"Satisfying.","rating":7,"date":"8 February 2007","review":"'Hannibal Rising' faces many of the problems that will beset any prequel. When the audience already knows how the larger story arc is going to resolve itself, how do you make the new prequel engaging? With a charismatic enigma like Hannibal, there is also great risk of the new young version seeming like a hollow parody of the older more familiar version played by Anthony Hopkins. I believe that 'Hannibal Rising' is largely successful. It didn't strike me as a stand out film but I was satisfied with it overall and do think that it has more value than just to enthusiasts of the Thomas Harris books. I'd rate it a comfortable second place out of the five films with Hannibal as a character (I count 'Manhunter').<br><br>'Hannibal Rising' does seem a bit choppy and for a plot that explores what drives a character into psychosis and lust for revenge, it didn't really spend much time trying to flesh out the Hannibal character. You get the brush strokes and the gist of things but a lot of the minutiae seems glossed over. I guess my point is that the audience curiosity for this film would be, I suspect, about what things turn Hannibal INTO Hannibal -- the internal process-- and not just solely about watching him hunt down and destroy those who have crossed him. A minor point perhaps but it struck me as odd in watching this that a series of films devoted to one of cinema's richest characters wouldn't really get in depth character exploration in the prequel for the series.<br><br>This is not intended to criticize what I thought was a well directed and tensely executed film. It is a violent film -- no kidding, right? -- but a lot of the violence is implied, in the background or off-camera. I really commend this decision as my imagination is much more vivid when things are suggested and not shown. 'Hannibal' worked not through terrorizing the audience but more through horrifying. I was balanced on the edge of trepidation and distaste as Hannibal entered each show down with characters he wanted to extract vengeance from. I love sitting through a tense thriller that offers no relief and this was almost the case here. My fellow Canadians and I were in tears of laughter when it was announced that a character had fled 'to a village outside of Saskatoon.' Surely unintended humour, and almost certainly audience specific.<br><br>What interested me most was the discussion I had with friends after we finished watching the film. I asked them when they felt sympathy for Hannibal was lost in the film -- and make no mistake, the events in the opening act are very much designed to put you behind Hannibal. Some said after the first killing. Some said the moment he transforms from child to youth. I think it comes later. Hannibal is rooted for almost out of default initially. His antagonists are just that much more evil and repellent that you throw your sympathy to him. This changes when a policeman asks Hannibal to help him track down these same antagonists. Hannibal has the choice of doing or not doing this. His response and subsequent actions for the remainder of the film decided my sympathies for me. Lesser acts of evil, might be used to purify and cleanse greater acts of evil, but are still evil in themselves when the motivation and the cost are the substitution of salvation and justice for corruption and revenge.","user":"A_Roode","rank":[81,124]}]