[{"title":"Do you like thunderstorms?","rating":8,"date":"3 July 2006","review":"Wow. Movies like this are for me both a big surprise and a guilty pleasure to watch. At first, I was doubtful that the Rock had the screen presence or the acting ability to pull off a movie like this, since I had only known him before as \"the eyebrow guy from wrestling\". This movie proved me wrong and has rapidly moved up into my list of favorite films.<br><br>Beck (The Rock) is somebody who chases down people that have irritated the mob, be it financially or socially. This is not his job of choice, however; he would rather own a restaurant. His bosses give him one final job: bring Travis (Sean William Scott, in a refreshing departure from the \"horny idiot\" style of movies) back from South America to the States. Beck finds Travis, but immediately runs afoul of Hatcher (Christopher Walken), who owns the mining town Travis lives in and wants something valuable that Travis has been looking for in the jungle. Then there are fights, running around from evil guys, more fights, monkeys, hallucinogenic fruit, and other such entertaining things.<br><br>Scott brought some well-done comic relief into the film with his quirky upbeat character. I could not stop laughing when Travis really tries to take on Beck in a contest of physical strength. It's like watching a caterpillar try and beat a Mack truck. Christopher Walken, as always, is a pleasure to watch. The man makes a perfect psychopath and I always brighten up when I see him on screen.<br><br>\"The Rundown\" is an excellent film which I would recommend to anyone who loves kinda-brainless (in a good way) action films. Bravo to the Rock. May he have a long and fruitful movie career.","user":"bfreilly","rank":[83,97]},{"title":"Put Your Brain On Hold & Enjoy The Stylish, Wild Ride","rating":8,"date":"20 January 2007","review":"Yup, this is way hokey and one of the dumbest movies I own in my collection, yet it's very likable and mostly a fun film with great style and scenery.<br><br>An adventure story, played strictly for entertainment value, it mostly succeeds because Dwayne Johnson, better known as \"The Rock,\" is a very likable hero. He's clean-cut, well-spoken, modest, etc. Supposedly this film was supposed to be The Rock grabbing the action mantle, so to speak, from the king - Arnold Schwarzenegger - who will no longer make movies. They even have Arnie make a quick cameo, wishing The Rock good luck! That was a good touch.<br><br>Meanwhile, Rock's cohort in this film, Seann William Scott, gets by with his sense of humor. It almost plays like one of these \"buddy movies\" except that these two guys (\"Beck\" and \"Travis,\" respectively) are not on the same page about anything. In no other film can I recall two characters getting beat up and annihilated like these two guys....but they never seem the worse for wear! Unbelievable!<br><br>Rosario Dawson adds some female sex appeal and Christopher Walken adds his normal entertaining take on being the villain. His dialog was very good in here. <br><br>I didn't realize until the second time I watched it (which is where I stand now) just how stylishly this was filmed. This movie reminded me of many made by either Robert Rodriguez or Quentin Taranatino with the gimmick photography. It makes it all the more fun to watch. Add some excellent sound, tremendous Hawaiian scenery simulated to look the the Amazon jungle in Brazil......and you can put up with the stupidness of the story and have a good time.","user":"ccthemovieman-1","rank":[44,52]},{"title":"Surprisingly Good","rating":8,"date":"29 May 2004","review":"And very funny.<br><br>I can honestly say I seriously doubted I would like this film and I only went to see it because it was on and I was there. I'd never seen a movie with The Rock before or even watched any wrestling so I was kind of dubious as to whether or not he would be any good. <br><br>In fact he was a great actor, full of personality and charisma, willing to make fun of himself and was great with the action. The Rock is definitely the next Arnie. Vin (Donald Duck) Diesel is the next Jean Claude Van Damme.<br><br>Seann William Scott was also pretty funny in a rare NOT Stifler performance. As an actor he does have genuine talent that's usually wasted in low-brow teen sex comedies. <br><br>The Rundown is a sort of Indiana Jones-lite movie. The Rock plays a bounty hunter/chef who is sent to track down Seann William Scott south of the border. Against his will The Rock ends up on a trek through the depths of the Mexican jungle looking for some ancient artefact. Unoriginal it may be but director Peter Berg keeps it moving with plenty of stunts, action and laughs. Christopher Walken's villain is a bit of a cardboard cut-out but how evil are you allowed to be in a PG-13?<br><br>I look forward to the next movie starring The Rock. With talks of a third Conan movie I can only imagine him being the best choice. And keep a lookout for Arnie in the nightclub at the very beginning. 'Have fun' is his only line. And fun The Rock will certainly have as the next BIG action hero.<br><br>Keep a lookout for Scottish actor Ewan Bremner (a zillion times the 'star' Ewan MacGregor is) in a funny role as a slob pilot.","user":"CuriosityKilledShawn","rank":[80,102]}]