[{"title":"A formulaic cliché, true. But also a colourful, honest, and straightforward entertainment. I liked it.","rating":7,"date":"31 July 2005","review":"I liked this movie. Sometimes a 'simple' movie can be colourful enough, and entertaining enough, without having to be great or artsy. 'Kicking and Screaming' was very formulaic. I actually found myself predicting each step and outcome as the plot unfolded--- the adult abused child, his dad, and his son, and the three generations colliding. The re-play of the overbearing father thing, the adult man vowing to never be like his father, but then getting accidentally caught up in the same dynamic himself. then the sports movie redemption, etc., etc.<br><br>It sounds like a cliché, and it is--- but, oddly, I found myself more surprised than annoyed as each cliché denouement surfaced. I kept thinking, as the cliché loomed--- 'Nahhhh... they wouldn't do that. There must be some slick tricky twist coming up.' Nope. No twists, no tricks--- all the clichés play through exactly like you expected them to. But there was a certain courage and honesty about that, which I greatly admired. They had a simple, straight-forward, no-nonsense formula story, which they played out exactly as that. It was very honest.<br><br>Robert Duvall--- always great. Will Ferrell, always funny. Mike Ditka, as an actor--- he's a great football coach.","user":"bopdog","rank":[28,35]},{"title":"Hilarious sports film...","rating":7,"date":"21 March 2007","review":"Watching this film made me remember when Mike Ditka was on the sidelines shouting and swearing off his own players when they didn't meet his demands. Will Farrel's performance was wacky and funny considering the fact he was competing against his dad (Robert Duvall in a nice spot). Anyone who likes soccer will find this film entertaining for a change along with Bend it Like Beckham. The kids on all the teams did their best on and off the field. If there would of been better props, we could say this movie could equal Little Giants(1994), another good comic sports film.Between a one two ten, I give a seven and a half thanks to the director's effort to bring in Mike Ditka to help out.","user":"mtr0118","rank":[5,5]},{"title":"Decent, but not Anchorman or Elf","rating":7,"date":"9 May 2006","review":"Kicking and Screaming was decent. Will Ferrel plays the son of a dad who WILL NOT lose to ANYONE (Robert Duvall). He takes over coaching his son's Little League soccer team and goes nuts trying to win at all costs.<br><br>Kicking &amp; Screaming seemed like it wanted to be the Anchorman of kid's movies, but it just lost me. There were some really funny parts, one involving the team needing to help out at the Italian kids family butcher shop, but overall, it just tried to hard to be a quirky movie that adults and kids would enjoy.<br><br>All in all, not Will Ferrel's best movie, but definitely not horrible. A good saterday night rental.","user":"FordPrefect-42","rank":[22,31]}]