[{"title":"Either you're gonna love it or you won't.","rating":8,"date":"5 April 2004","review":"I just watched this movie in the theatres as it was released just a few days ago overhere. What can you expect from it? You've seen the trailers... It looks pretty much like Dead Poet's Society doesn't it? But with women instead? :-D.<br><br>Well, I had that feeling indeed. It felt like Dead Poet's Society during some periods in the movie. But overall, it was still different. The surface story isn't that complicated and easy to follow. It's nothing new either. But it was displayed very well.<br><br>Sure, it's about a teacher... her passion to teach and the way she outwitted the students to get the best out of them... It also shows the way a good teacher cares for their students and so forth... and the way contradicting ideas may blind one's ideas and actions, towards those who they are meant for. Did that sentence sound weird or what? :).<br><br>You can't go wrong with the cast here. You've got Julia Roberts, Kirsten Dunst, Julia Stiles, Maggie Gyllenhaal, Ginnefer Goodwin, etc. They played great in the movie.<br><br>Julia Roberts is just great at playing these emotional roles. It was believable as well. I at least could feel the frustration which she had. Her character is more of a confused type. She reminded me of Michelle Pfeiffer in Dangerous Minds... There was basically a mixture of confusion and dedication... thus as a teacher, despite how sure of she may be of her teaching methods, you also sense a nervousness in her... a feeling of uncertainty as to whether her methods of getting the messages across to the students or not will work. I thought Julia Roberts did a great job in that area.<br><br>Kirsten was just excellent. You could feel the internal turmoil going through her throughout the movie. One might argue that she had a pretty wack role and that she overacted etc. but I don't agree with that. She's practically a heartless b**** through the movie, but you can't help but understand why. The same goes for Julia and Maggie. Just the way they were depicted in the movie, you really felt for them. Ginnefer Goodwin's character was also funny and emotional to watch.<br><br>Marcia Gay Harden, as Julia's friend was great. She was a pretty funny character to watch, but at the same time, you just can't help but feel sorry for her.<br><br>Times have changed... from those times and now. Many might watch this movie and go, \"Uhm, okay, what's the big deal?\" But the problem is that women have gone through a great ordeal and struggle to get to where they are today in society. Even today, they still fight to gain respect in many areas in the world today.<br><br>I've heard many bad comments about this movie. And funnily enough, most of them come from guys... whilst the females found it a bit better. There were some negative comments but many said that they loved it, but felt that it wasn't a movie for everyone.<br><br>The movie tackling the issue of feminism only touches upon a small part of it all of course. One cannot tackle the whole aspect of feminism in any one single movie at all, and I found the focus to be good enough. There are many stereotypes here and I found them necessary to get the points across. If it were not for the stereotypes, people would be wondering what the point really was. But now that there are stereotypes, people will complain about them.<br><br>I thought that it was a bit too short. It could have focused a bit more on the other characters in the movie... i.e. the girls in school. A few more subplots and build ups may have been better. There was a little foreshadowing in the movie but one couldn't help but wonder where the movie was going. But what overcame this, from my point of view, was that you just felt that you wanted to get to know the characters in the movie more. The more you knew about each character, the more the characters knew about one another. I thought that was quite nice.<br><br>I would advise everyone with an open mind for dramas to go watch this movie. If guys see this movie as a \"chick flick\"... they really won't know what to expect cause this would be \"the most THE chick flick for chicks\" if you get my drift. I'm a guy and I found it entertaining... Whether it was insightful or not, I wouldn't say it was, due to experiences and stories throughout my life.<br><br>The movie isn't without flaws... There could have been even more character build up if only the director's were given more film to record the picture. But do watch this if you can :). It'll be worth the time, if you're patient enough :).","user":"pancakes27","rank":[86,104]},{"title":"Finally, a film that doesn't insult our intelligence!","rating":20,"date":"20 December 2003","review":"I didn't expect much going into \"Mona Lisa Smile\". I figured it was going to be a rehash of all the movies ever made about teachers. You know, from \"Goodbye Mr. Chips\" and \"The Prime of Miss Jean Brodie\", to \"The Dead Poets' Society\" and \"Mr. Holland's Opus\". But \"Mona Lisa Smile\" pleasantly surprised me, especially the uncompromising, principled ending.<br><br>Another thing that pleased me was the film's assumption of an intelligent, educated audience that does not require any dumbing-down of art and culture. \"Mona Lisa Smile\" rattles off names of artists and their works as if it fully expected moviegoers to be conversant with them. In at least one case, the film names neither the artist nor the work (Picasso's \"Demoiselles d'Avignon\"). All of these things are taken as givens, as part and parcel of a sophisticated audience's cultural baggage -- quite a change from the usual pap that Hollywood spoonfeeds us!<br><br>Moreover, the film sometimes speaks volumes by what it doesn't say but simply shows, taking for granted that we will fill in the blanks from our knowledge of the history of the period (that is, the early 1950s). There is one oblique reference to McCarthyism. A photo of an atomic explosion reminds us of the post-WWII, Cold War era. A game show on TV triggers a memory of the payola scandal. Again, \"Mona Lisa Smile\" credits us with brains rather than insulting our intelligence.<br><br>Mercifully, the title of the film is not simply a reference to Julia Roberts' famous beestung, collagen-enhanced lips. As Kirsten Dunst's character explains toward the end of the movie, Mona Lisa's smile is not necessarily an indication that she is happy and content -- any more than the women of the 1950s with their dream homes and seemingly perfect lives. \"Mona Lisa Smile\" is ultimately an indictment of those in society who perpetrate and perpetuate secrets and lies, and a tribute to those through whom the truth prevails.","user":"Shakespeare-2","rank":[48,56]},{"title":"A well-made Wellesley College period piece.","rating":4,"date":"4 July 2004","review":"I liked Julia Roberts less in her earlier movies, I like her more now that she is playing older and flawed characters, like the new professor of Art History in 1953 Wellesley College in \"Mona Lisa Smile.\" And the title does not refer to her, instead it is embedded in remarks in the screenplay about the actual painting of The Mona Lisa. Not everything turns out well in this movie, it more closely reflects real life than do many of the modern romantic comedies. This one is NOT a romantic comedy, although it does include several romances, and there are some funny parts. It is more a serious drama about life and growing up, both from the perspectives of the undergraduates, and the new professor. I bought the DVD, the picture and sound are fine, and there are several interesting extras on the making of this movie, and the work done to get the period correct. <br><br>I don't share the many negative comments about this movie. It is a fine drama, one that merits repeat viewings once or twice a year. It is NOT simply a 'Dead Poet's Society' for the girls. To call it that is to overlook all the fine, unique points about this movie.<br><br>Update: Saw it again March 2013, I enjoyed it as much as the first two times.<br><br>Update: Saw it again June 2017, I enjoyed it as much as the first three times.","user":"TxMike","rank":[95,118]}]