[{"title":"actually entertaining","rating":6,"date":"4 March 2005","review":"\"After the sunset\" is surely not a demanding film...and none of us expected to be one. Take Pierce Brosnan - a great showman and a guy with asense of humor, add sexy as she's ever been Salma Hayek, add Woody Harrelson in good form, top it off with decent screenplay that does not take itself too seriously or risk falling into pretentious or shallow territory and you have yourself a very entertaining little piece of movie-making. There's not much to discuss about After the sunset. It has a lot of funny moments, at times it's silly and implausible but you don't really have time to think about that. It's without doubt not the best movie Pierce, Salma or Woody have made, but it's far from the worst either. If you're looking for an hour and a half of casual entertainment with solid performances, script and directing go see it...you'll feel pretty good after you do :)","user":"cocoshell","rank":[70,88]},{"title":"Enjoyable Heist Film","rating":5,"date":"27 November 2004","review":"Pierce Brosnan and Salma Hayek are a pair of diamond thieves fighting an endless cat and mouse game with an FBI agent (Woody Harrelson) until they decide to retire and move down to the Bahamas. When a cruise ship arrives carrying a priceless diamond, the chase begins anew.<br><br>After the Sunset is a pretty ordinary movie with some entertaining moments and a lot of gorgeous scenery. It won't challenge the viewer at all but it will offer a pretty enjoyable ride. The premise is fairly simple and it is nothing really new. Brett Ratner keeps things easy and safe as he moves the film at a nice pace. The opening scene is pretty funny and nicely done. The middle is also pretty good yet a little dull while the ending is just plain disappointing. I was expecting a nice payoff but the ending was so simple. This didn't ruin the movie but it doesn't warrant a viewing either.<br><br>The acting is pretty good and there are a few characters that keep the film interesting. Pierce Brosnan stars as Max and he gives a good performance. He sometimes looked a little tired but he usually seemed to be having fun. Woody Harrelson is great as the FBI agent and he looks to be having a great time. Salma Hayek offers great eye candy and a decent performance. She doesn't really do anything special except look very beautiful. Don Cheadle gives an okay performance though he doesn't get a lot of screen time.<br><br>There are a few reasons why After the Sunset would make for a good rental. First, the scenery looks great and eye candy never hurts. Second, the chemistry between Brosnan and Harrelson is surprisingly good and it is fun to watch them on screen. Third, those looking for some escapist fun should find it with this film. Last but not least, Salma Hayek looks amazing. I would have preferred a little more substance but the movie proved to be entertaining. In the end, After the Sunset isn't worth checking out in theaters but it could make for a decent rental. Rating 6/10","user":"christian123","rank":[80,110]},{"title":"Entertaining","rating":7,"date":"2 June 2006","review":"After the Sunset sees Pierce Brosnan play an ex-jewel thief in a simple \"will the old pro come out of retirement for one last job\" movie that is far more entertaining than its unoriginal premise sounds.<br><br>Pierce Brosnan takes to his dressed-down James Bond role very well, and the jokes and his style make him a very likable character. Woody Harrelson, the rival FBI agent, puts in a similarly enjoyable performance, and his inept bumblings around the island create some unexpected comic situations between the cop and the thief. It's the relationship between these two (and the compromising situations they find themselves in) that makes the film, as they antagonize each other and almost become buddies toward the end. Their encounters add something fresh and unexpected to the movie's simple formula and make it really entertaining.<br><br>Oh, and special mentions have to go out for Don Cheadle and Salma Hayek. Don's character is very funny, and he plays both sides of it well, and as for Salma...let's just say the directors are aware of what their male audience wants to see.<br><br>All in all, it's funny, quick, easy to follow, and contains enough little quirks to make After the Sunset an enjoyable and entertaining experience.","user":"snow0r","rank":[37,49]}]