[{"title":"11:14 Edgy, Smart, Terrific","rating":9,"date":"5 September 2003","review":"Festival.  Based on what I'd read, I was expecting some sort of Tarantino rip-off.<br><br>Instead I got run over by a very fast, very clever film.  Directed by 27 year old Greg Marcks, the film is populated by up and coming young stars including Colin Hanks and Rachael Leigh Cook.  It's actually 5 stories that all take place in a small town in middle America at around 11pm on a random night.<br><br>Characters keep running into each other and bad bad things happen, but the stories are all strung together in really clever, often darkly funny ways. The dialog is sharp and real, and Marcks has a real skill with his young cast. There are some really excellent performances, especially by Rachael Leigh Cook, who as the trashy Cherie is just the right combination of evil and desperate.<br><br>Although even in her trailer park costume she's breathtakingly beautiful! Also look for Ben Foster, who surprised me with a very realistic performance, after something REALLY bad happens to him.  Hanks is also good, as is Shawn Hatosy.  I was blown away!  And the strangest part of the Premiere screening?  It finished at exactly 11:14.","user":"JigShaun-2","rank":[156,171]},{"title":"Bad decisions make for good entertainment","rating":9,"date":"8 August 2003","review":"Half an hour or less of one night, two traffic accidents, one severed body part, several crimes or felonies, one silly dog, at least one spectacularly bad decision per character and two deaths make for 90 minutes of pure high-adrenalin fun. And smart fun at that! Of course, it's a bit like, say, Pulp Fiction on Vodka/Red Bull, but hey, I've been rarely entertained so well by other people's fiascoes.<br><br>The stories of about a dozen American small-towners intersect at 11:14 one night. Everybody has their own agenda, be it vandalism, fast money, sex, protecting the reputation of their daughter, or just to do their job, and most of them have had too much too drink - which leads to the aforementioned bad decisions. Some great acting (Shawn Hatosy and Patrick Swayze stand out), dynamic camera work and fast pacing keep 11:14 moving and viewers on their toes. And of course, there's always one more twist...<br><br>I saw 11:14 pre-release at the Fantasy Filmfest, and it was received very well. If film distributors are just a little smarter than the characters in this film, this should be a smash!","user":"amvogeldc","rank":[118,130]},{"title":"Worthwhile - Can't believe it's not more widely known","rating":9,"date":"29 January 2006","review":"This is one of those movies that you really ought to see. We rented it based on the back cover, and we were glad we did. 11:14 has been compared to Crash and Memento. We haven't seen Crash, but it looks like we should, and while I thought that 11:14 was not quite as terrific as Memento, I felt it was definitely in the running with it.<br><br>I came to IMDb to see what else this guy, Greg Marcks, has done and was surprised to see that the only other entry is a 19 minute short film. How on earth did he get stars such as Patrick Swayze and Hillary Swank? If you do decide to see this movie, DO NOT WATCH THE TRAILER FIRST. What a rotten trailer. The trailer gives away virtually the entire plot.","user":"wunderwood","rank":[71,81]}]