[{"title":"Surprisingly chilling performance from Elwes as Bundy...","rating":9,"date":"7 September 2004","review":"I didn't know what to expect when I began watching this movie. I was immediately intrigued once it began going, however. This is the true story of how Ted Bundy (Cary Elwes) actually helped to find the Green River Killer back in the early 80's in his attempts to get a lighter sentence and avoid the death penalty. Although this movie is not about Ted Bundy it does go into his crimes a little bit and you get to know a little bit more about Bundy's twisted psyche. The performances were great, but the one that stands out is Elwes portrayal of the serial killer Ted Bundy. I didn't know if he could pull it off, but he did an excellent job and was very believable and his performance was chilling. I give this movie a 9/10.","user":"WitheringSage","rank":[22,25]},{"title":"Superb acting by Cary Elwes and Bruce Greenwood","rating":10,"date":"2 September 2005","review":"I just saw this on TV from about the halfway point only, but was familiar with the plot from my reading. I'm anxious to see it again. I thought Cary Elwes BECAME Ted Bundy in a way that was eerie and absolutely impressive. Bruce Greenwood had a part that could have been mundane, but his tremendous depth as an actor turned it into a disturbing and memorable role. And I thought their joint scenes were .. well, completely intense -- contrary to the lead-in review from IMDb. Greenwood has always been one of my favorites, but I found Elwes a bit more of a surprise. Would recommend this to acting classes everywhere and to anyone who can withstand an in-depth look at psyches that are way outside normal boundaries.","user":"skyprice","rank":[15,17]},{"title":"Only if you have a lot of interest in serial killers","rating":5,"date":"6 September 2004","review":"First I must say that Cary Elwes did a very convincing portrayal of Ted Bundy. I thought he looked a lot like him and did a good acting job.<br><br>This movie is for those who want to go deeply into the killer's mind and perhaps discover new things about Bundy and his childhood. (For instance in one part he tells the detective that as a child his mother threatened to send him to stay with his grandfather if he wasn't good and that he would try to be good but she would send him there anyway; then his grandfather would lock him in a closet). It also caused me to think about how much more useful it would be to keep people like him alive to analyze, study and try to understand what triggered his heinous psychology. <br><br>This is a dark movie and not entertaining; not something I would watch for entertainment or fun in any sense. It was more like watching reenactments and felt sometimes more like watching a documentary than a movie.<br><br>The film also goes into the psychology somewhat of a serial killer known as \"The Green River Killer.\"<br><br>I think of this as more of an educational film. Women for instance could watch it with an eye to learn tricks Bundy and the Green River Killer used to catch their prey (both seemed to like the trick of pretending to be disabled and in need of help for example). The film also highlights what it is like for those who interviewed Bundy hoping he could help them get into the mind of another killer they were trying to apprehend -- how dark and freaky it is. All around, as is its subject, the movie it pretty grisly. Definitely not a \"date movie,\" haha.<br><br>Some people are fascinated with learning more about serial killers and for those people this is probably a film they would like to see; but for most of us, I think we would rather be spared all the grisly details.<br><br>Good acting all around and good cinematography, etc.; slow moving, graphic photos of murdered women I would rather not have seen. I personally would not recommend this movie to anyone other than those I mentioned above -- who like to study this sort of thing and are always hungry for more details. Lots of creepiness here!<br><br>And please, mothers, fathers and others: don't lock the kid(s) up in the closet!! I gave this a 5 rating.","user":"starring-1","rank":[17,20]}]