[{"title":"Hey, this was really fun","rating":8,"date":"6 March 2005","review":"Okay, sometimes I think the critics are all single \"non-family\" people. I just got back from viewing this movie with 7 adults and 11 children. It was wonderful to watch the kids giggle and hurrah at Vin Diesel, tough guy, nice guy, real softie routine. Whether he was kicking bad guys or changing diapers, he was great. While there were many clichés and material we've all seen in other forms, we sometime forget that this stuff works. My child is 8 and this is fresh to him. I'm so please that we were able to bring 18 people of varying ages who all had a good time. I say forget the negatives and focus on what we sometimes forget, an afternoon or evening with you kids is the best pacifier.","user":"jmdstern","rank":[186,256]},{"title":"Surprisingly entertaining.","rating":2,"date":"2 March 2005","review":"I was fortunate to win tickets to a preview of this movie from a local radio station,for myself and my three daughters (9,11 and 14). I did not expect to enjoy this movie, and was simply glad to be there for their sake. It was very entertaining and Vin Diesel did a great job, especially considering it was a comedy. Often when an action star attempts comedy it fails miserably. I rate this movie 8 out of 10 stars, and my daughters all loved it as well. We talked and laughed about it all the way home. I am certain that a few of the catch phrases will be with us for a while. This movie was a blast. Disney did a great job with this one.","user":"2hender","rank":[82,123]},{"title":"I thought it was pretty good.","rating":6,"date":"6 March 2005","review":"Okay, first this movie is great for what it is meant to be, a family friendly comedy romp. It has funny moments, touching moments, it gives you chuckles and even a few laughs. It isn't trying to win awards or stun the audience with special effects. You sit down, watch it, laugh a little, think about how cute the kids are, then go on with the rest of your day. A lot of action stars have taken a turn at comedy to soften their image, Stallone and Arnold S. to name a couple, so Vin Diesel is in good company there. I think it is a decent, light movie worth at least a matinée viewing. The kids are charmers, Vin Diesel doesn't seem to mind being the but of jokes, and most of the acting is good. And ladies, he spends most of the movie in tight t-shirts, and according to my wife has a nice posterior region. Guys you have to settle for Lauren Graham's sweet smile.","user":"tenn-noodlehead","rank":[113,175]}]