[{"title":"Wonderful!","rating":10,"date":"6 November 2006","review":"In a time when most movies turn out to be a waste of my time, what a pleasant surprise to find this gem. On the surface, it might look like just another romantic comedy. But there was a depth to this movie that surprised and captivated me. A lot of good messages for young girls, 13, 30, and any age before or after. And what an interesting commentary on society. Through the eyes of an innocent 13 year old, who just happens to have the body of an adult, we see just how shallow, false, and empty modern society can be.<br><br>Jennifer Garner is adorable. She exudes a fresh innocence that makes it very believable she is a 13 year old in a 30 year old body. And Mark Ruffalo! He was a surprisingly wonderful hero. I have since seen him in other movies, but this was the first time.<br><br>A definite keeper, and one my whole family enjoys watching, over and over again.","user":"mercywriter","rank":[31,32]},{"title":"Delightful and Sweet Fantasy","rating":7,"date":"4 October 2005","review":"On her thirteenth anniversary, the teenager Jenna Rink wishes to be a successful single woman of thirty. Her dream comes true, and on the next day she wakes up older and powerful. However, she becomes disappointed with herself, since she is an awful colleague in her work, she has no friends and no contact with her parents, and her best friend is going to marry another woman, and tries to be thirteen again and rebuilt her life.<br><br>I like this type of fantasy-movie, and I immediately recall \"Peggy Sue Got Married\", \"Freak Friday\", \"Mr. Destiny\", \"Big\", all of them charming movies. \"13 Going on 30\" is a delightful and sweet fantasy about a teenager that makes a wish, and once accomplished, she does not like what she sees. Jennifer Garner is simply perfect in the role of Jenna Rink, and the story has some great funny moments, being a forgettable but also great entertainment. The chemistry between Jennifer Garner and Mark Ruffalo is amazing and helps this romantic comedy to work. The music score is also excellent. My vote is seven.<br><br>Title (Brazil): \"De Repente 30\" (\"Suddenly 30\")","user":"claudio_carvalho","rank":[65,73]},{"title":"Garner shines, Ruffalo's wonderful and that makes all the difference","rating":7,"date":"23 April 2004","review":"Having criticized the writer of \"Connie and Carla\" for not recognizing the writers of \"Some Like it Hot\" in the credits, I'd be a hypocrite not to fault the writers of \"13 Going on 30\" for not thanking the writers of \"Big\" (and probably \"Vice Versa\" and all those switch-comedies of the 1980s).<br><br>But unlike the wretched and dreadfully unfunny \"Connie and Carla,\" which featured two horrible performances by the male and female leads, \"13 Going on 30\" is helped immensely by an utterly charming and winning performance by Jennifer Garner and yet another wonderful turn by Mark Ruffalo, who's fast becoming one of the best actors of his generation.<br><br>Garner has a smile that would melt the heart of the severest cynic and she uses that to great effect. She brilliantly captures the awkwardness of a confused teenager stuck in a 30-year-old body and is thoroughly believable as Jenna. There's a captivating sweetness to her performance that's lovely to watch. Ruffalo plays Matt with understated grace - there are scenes in this film that could easily have been played over-the-top, but it's his low-key approach that makes them all the more convincing.<br><br>The story, itself, is awfully conventional. There's nothing new or unexpected here. Even the odd twist in the plot provides nothing unpredictable. So it's up to the actors to elevate this above the ordinary and mundane. This film pours on the schmaltz at times, but it's Garner and Ruffalo who help take the schmaltzy plot and somehow make it work. This film succeeds solely because of their performances. Garner proved she could do action with TV's \"Alias\" and the dull \"Daredevil,\" and now she shows she's a damn fine comedic actress, too.<br><br>Romantic comedies are inherently predictable. It's the nature of the genre. And, more often than not nowadays, they're also incredibly dull, uninspiring and make for tough viewing. And \"13 Going on 30\" being a Hollywood, not independent, film, you know the writers aren't going to take any risks with their story. <br><br>But somehow thanks to Garner and Ruffalo, \"13 Going on 30\" has undeniable charm. It may not leave a lasting impression, but you leave the theatre smiling and that's more than what can be said of most romantic comedies these days.","user":"anhedonia","rank":[47,55]}]