[{"title":"Why were the critics so harsh on the film?","rating":9,"date":"30 January 2006","review":"I thought \"The Island\" was fantastic and just was a movie worth watching. Ewan and Scarlett were just great together in this on the seat thriller, the story was just very exciting. Especially since cloning is such a huge debate right now, I know that it is going to get more intense in the future. That's the story's main plot, cloning and wither it's right or wrong of playing God.<br><br>The story itself just keeps you guessing and thinking with some very great effects. I would without a doubt recommend \"The Island\" for your viewing pleasure. It's a lot of fun, it's got excitement, romance, action, and a plot that actually worked coming from Michael Bay. :D My only complaint is the ending, which I choose not to give away, but it leaves some room for questioning. Other than that, enjoy! <br><br>9/10","user":"Smells_Like_Cheese","rank":[182,236]},{"title":"Underrated!","rating":7,"date":"3 August 2005","review":"I found The Island to be highly enjoyable - a great Summer blockbuster that isn't quite mindless. It raises a number of very interesting questions...<br><br>Plenty of eye candy in every form, the two leads, the scenery, explosions, action sequences, the cinematography, everything you would expect from Michael Bay and Co. <br><br>The pacing to begin with is somewhat slow as the premise is set up (though disappointingly the trailers give it all away), but once it launches into the first action sequence it doesn't let up for some time. Yes the story has a number of plot holes but you can easily overlook them and get swept away in the fun. I've never seen Johansson on film until now and WOW, now I know what all the fuss is about. Her and McGregor display enough chemistry to make their relationship believable but only just. I'm sure this will only propel them onto bigger and better things.<br><br>My one and only gripe was with the ending scene complete with cheesy choral accompaniment - blech! Maybe Bay just couldn't help himself. I suppose no film is perfect..<br><br>7 out of 10, solid, fun entertainment, what more can you ask for?","user":"qball_82","rank":[323,445]},{"title":"Original, Intriguing and Scary View of Science, Ethic and Future Society","rating":8,"date":"10 December 2005","review":"In 2019, Lincoln Six Echo (Ewan McGregor) and Jordan Two Delta (Scarlett Johansson) are best friends in a repressive and intriguing society, where everybody expects to win the lottery. The prize is to move to a paradisiacal island outside the domes that protect the dwellers against the contaminated environment. Jordan wins the lottery, and Lincoln accidentally finds the scary truth behind the utopist award.<br><br>\"The Island\" is an original, intriguing and scary view of science, ethic and society in a near future. Using elements of \"Logan's Run\", \"Matrix\", \"Gattaca\" and \"The Thirteenth Floor\", among other sci-fi movies, and non-stop action, it is a surprisingly great film. I liked very much the amoral behavior of Dr. Merrick (Sean Bean), with a total lack of ethic, and the possibility of replacement parts raised in the story. Scarlett Johansson and Ewan McGregor shows a good chemistry, and watching this sci-fi / action movie is worthwhile, even to think how cloning process shall be discussed by the society and controlled through well-studied laws. My vote is eight.<br><br>Title (Brazil): \"A Ilha\" (\"The Island\")","user":"claudio_carvalho","rank":[208,285]}]