[{"title":"Along Came a Good Laugh","rating":6,"date":"27 June 2004","review":"The story's not overly engaging, but for some reason Along Came Polly is fun. Ben Stiller just has that knack of being able to embarass himself and we love him for it. You can't help but laugh. But the film is worth a look for Philip Seymour Hoffman, too, as the child actor still looking for recognition -- and work. The basketball court scene is great, but the best is his performance with a community theatre's production of Jesus Christ Superstar. If you've ever been in community theatre, or you've hung out with actors, you'll appreciate this.","user":"brooke-25","rank":[63,89]},{"title":"Harmless and funny","rating":9,"date":"10 June 2004","review":"I heard this movie was a hard sell, which is probably why I ended up enjoying it so thoroughly. The movie is far from perfect  the talented cast is somewhat misdirected - but it's their talent, along with the hilarious circumstances that unfold throughout the film's neat 90 min running time, which keeps the film moving and the laughter rolling. Ben Stiller and Jennifer Aniston strike a nice contrast as the fated couple united by a hysterical comedy of errors. Philip Seymour Hoffman is wonderful as Stiller's pitiful (and only) friend and confidant. And Alec Baldwin steals every scene in which he appears (would love to see him do more comedy).<br><br>I am not easily offended by bathroom humor  quite the opposite, I think it's funny when pulled off right. Whenever I read viewers complaining about so-called 'gross-out humor' or \"toilet bowl comedy\", I am genuinely confused. When the hell did we get so uptight? Fart jokes and bedroom humor have comprised some of the funniest scenes ever filmed (Jeff Daniels in \"Dumb &amp; Dumber\" or \"Chris Tucker\" in Friday, for example). I'd recommend this harmless and enjoyable movie to my mother (toilet humor, and all!).","user":"biggusdickus76","rank":[17,21]},{"title":"Along Came a Mediocre Rom Com","rating":5,"date":"15 February 2019","review":"Ben and Jen do their best to overcome an unengaging story and a lack of forward momentum in Along Came Polly. There are some decent laughs throughout, but nothing that stuck with me after the credits. It's not awful by any means, but it's pretty forgettable.","user":"cardsrock","rank":[5,5]}]