[{"title":"Now THIS is more like it!","rating":10,"date":"7 May 2004","review":"The idea of the Matrix is so full of potential and could be taken in so many, many directions. The movies decided to go in the direction of pretension but the Animatrix goes EVERYWHERE the movies don't. It is so far superior and well worth the time. It's a shame that most audiences don't consider Anime or any form of animation to be 'real' or something that they should take seriously (sadly even Matrix fans feel this way and won't watch it simply because it's animation) because they're missing out on something very special here.<br><br>It's not original to review this DVD by going thru all the shorts so I'll just stick to what I like best (which is most of it). First of all, 'The Second Renaissance Parts 1 and 2' is absolutely VITAL as backstory to the first Matrix film. And it's a zillion times more interesting than the sequels in terms of drama, irony and subtext. 'The Final Flight of the Osiris' takes place before Reloaded and leads us into story of the machines beginning to drill down to Zion. And it's very cool. 'Detective' is a story of a private eye trying to find Trinity and discover what exactly the Matrix is. But Agent Smith comes after him to put a stop to that. It's in black and white and has a wonderful atmosphere of 1950's dime novel pulp fiction. 'Matriculated' is the story of a captured machine who is taught/hypnotized into feeling what it's like to be human. It's a very clever story that manages to provoke feeling for the characters (and even the captured machine), something the movies never did. 'Kid' is about the kid from Revolutions who takes over the Mech at the end and manages to open the doors to Zion. Apparently, before being freed, he was a schoolkid who met Neo online and wanted to 'wake up'.<br><br>But the best one is 'Beyond'. A magical tale with an atmosphere so solid that it's almost tangible. It's about a girl who goes looking for her cat in an old abandoned factory with some other kids. But in this factory the Matrix is having problems and 'reality' for the characters doesn't quite work properly. It's a very interesting tale that really makes you think.<br><br>There are numerous extras on this DVD, all of them more interesting that the other Matrix DVDs. All 9 of the shorts are presented in 2.35:1 anamorphic widescreen with Dolby 5.1 sound. It's truly for all fans and non-fans of the Matrix universe.","user":"CuriosityKilledShawn","rank":[124,140]},{"title":"Art comes to life on this \"enhancement\" of the Matrix","rating":10,"date":"8 June 2003","review":"This was the most brilliantly interpreted, scripted and thought provoking thing I have seen in a very long time. The DVD gives you background filler for what the Matrix is and the Wachowski brothers allow some of Japan's best anime artists to interpret the 9 different stories on their own. I think, just like art, each viewer will have a different type of experience. You have 9 wonderful compelling stories and the visual style is so different that it adds much value to the telling of the stories. The brothers had a vision and clearly the Matrix affected many people and, what a wonderful gift they gave by incorporating the world of anime into the telling of their vision. But not only is it visually stunning and stylish, but the music is dead on. There are all sorts of morals in the stories. From SECOND RENNAISSANCE'S man's destructive nature and his down fall, to the sort of, don't-play-with-fire nature of MATRICULATED and the playfulness and joy of BEYOND. Plus the DVD special features take us into each director of each piece explaining his \"art\" and how the film the Matrix affected them. We even get a little history on the origins of anime. It was just really enjoyable to watch people who are so passionate about their craft and about the Matrix. I think you will enjoy this immensely and take something out of it yourself.","user":"cafesmitty","rank":[56,65]},{"title":"do you need to watch Animatrix to understand The Matrix Trilogy?","rating":8,"date":"8 April 2004","review":"First off, the Animatrix is not a movie, but a collection of nine animated shorts (one being CGI based) which basically delves into the world that is The Matrix. Animators come from Japan, Korea and the US and include many world renouned animators (the first animation, Final Flight of the Osiris, was made by the same team who created the Final Fantasy: The Spirits Within movie). Below is an outline of each animated short and what relevance it has in the Matrix world.<br><br>1. The Final Flight of the Osiris: CGI based animated short involving the discovery of the machine army and the delivery of the evidence to the drop point noted in the Enter The Matrix video game.<br><br>2. The Second Renaissance Part 1: One of four of the nine animated shorts written by the Wachowski Brothers and details the creation of artificial intelligence and the rise of the machines<br><br>3. The Second Renaissance Part 2: Continuation of the previous short film based on the war against the machines and the enslaving of the human race.<br><br>4. Kid's Story: Remember the Kid in Reloaded and Revolutions? this animated short is about how he came to be in the real world, including his encounter with Neo.<br><br>5. Program: This animated short is set in a training simulation and focuses on betrayal and escaping the real world back into the matrix, just like Cypher tried to do in the original Matrix movie.<br><br>6. World Record: Based on the idea that exceptional people with exceptional skills can in effect wake themselves up without being unplugged from the matrix, this short focuses on an American sprinter who runs so fast he escapes the rules of space and time and sees the real world.<br><br>7. Beyond: A glitch occurs in the Matrix and weird things starts to happen, time slows down and one girl is caught in the middle of it.<br><br>8. Detective Story: A private investigator is hired by Agents to track down Trinity, but he soon realises that he is a pawn in a conspiracy which ultimatly will lead him to see the truth.<br><br>9, Matrixulated: This animated short is about a team of human resistance which captures sentinals and uses the sentinals to fight for them. They, however, do not reprogram the sentinals but mearly show them an alternative choice and let the sentinals make up their own minds.<br><br>Every animated short is well made and really pushes the boundary of animation. Also, the script for each one is great and the whole experience really does make you feel part of the Matrix World and does answer questions as well as raise some more. But, does it infact help the understanding of the Matrix Trilogy? Basically, yes it does, however, not all the animated shorts do, only a few. The rest are just extra stories, opening up a whole new can of worms and filled with philosophy which made the original Matrix great, but are still worth seeing. The Animatrix develops the story of the Kid in Reloaded and Revolutions and Morpheus' speach about the human/machine war in the original Matrix movie. So, only very slightly does it actually alter your view or answer any questions on the Matrix Trilogy, but that is not the reason why you should see the Animatrix, see it because it is simply an amazing ride through the Matrix and should be watched by fans of the Matrix and animation alike.","user":"deepion","rank":[53,63]}]