[{"title":"The best Peter Pan to date, unfortunately at the wrong time.","rating":9,"date":"20 July 2004","review":"Up front I will say it: this is the best Peter Pan adaptation yet, and in what follows I will tell you why. Despite the film's quality, it failed at the box office, and for good reason. Insight into that shall be revealed as well. Such sage wisdom ye shall not find in other reviews. Read on.<br><br>The main thing that sets this adaptation apart from previous attempts is sexual tension. Yes, sexual tension. If you've read other reviews, no doubt it has been mentioned. Many people seem to take offense at said tension. Such people seem to forget what it was like to be in the age bracket of 12 - 14. The makers of this film don't dance around the fact that Wendy has just met the boy of her dreams, and he is ready to whisk her off to fantasy land. Much is made of the fact that they meet in the bedroom and play father and mother to the lost boys. The relationship of these two pre-teens is as complex as any two adults in any other movies. And the young actors handle the relationship with grace and authenticity. <br><br>The production itself is beautiful, albeit stylized. The filmmakers do not mask that neverland is a fantasy world, and it stays that from beginning to end. Every frame in this movie is beautiful. There are some moments that are literally breathtaking.<br><br>Ultimately what makes this film excellent is that it tells a story. And this story is centered on Wendy, and the boy of her dreams: Peter Pan. Except he cannot be the man of her dreams, and that is truly tragic. Captain Hook is the opposite: a man who cannot be young. A man who is \"old, alone, and done-for\" according to Pan. We end up exploring Wendy's psyche throughout the film, and it is almost perfectly achieved.<br><br>But why did this film fail at the box office? Competetion. Who can possibly defeat Lord of the Rings or Harry Potter, two bigger and much more commercial adaptations of fantasy books? This film deserves to be a classic and is one of the best fantasy movies to date. All should see it, young and old. It is rich, beautiful, and exciting.<br><br>9/10","user":"shaquanda36","rank":[293,311]},{"title":"A glorious retelling of the J.M. Barrie tale","rating":10,"date":"6 January 2004","review":"Tradition be damned! I HATED the Mary Martin, Sandy Duncan, Cathy Rigby productions of Peter Pan! There, I've said it. I realize I'm in the minority on this point, but I have NEVER been able to accept the idea of some actress dressing up in silly green tights, singing equally silly songs, while pretending to be a prepubescent boy pretending to fly on silly piano wires. I fully admit that it's a pet peeve of mine and not meant to denigrate those who have delighted in this tradition. As a long time lover of the J.M. Barrie stories and play, all I can say is that P.J. Hogan's \"Peter Pan\" is the Pan movie I have waited my entire life for. It is simply a glorious retelling of the J.M. Barrie tale. After Spielberg's dreadful 1991 abortion, \"Hook\" I was convinced that the story had been buried forever as far as big budget film-making was concerned. I thought all there would be was the 1953 Disney animated film, which unfortunately is more Disney than Barrie or worse, that I was condemned to a lifetime of endless reruns of Mary Martin and Cyril Ritchard. Boy, was I wrong. Taking its visual cue from the wondrous illustrations of Maxfield Parrish, Edmund Dulac, N.C. Wyeth and Arthur Rackham, this new film recreates the storybook Never Land on a level that has never been achieved before, nor will ever be again.<br><br>But the film is not simply a special-effects fest a la \"Star Wars\". The effects, dazzling as they are, are just the icing on the cake. Hogan understands it is the characters, and our need to care for them, that must carry the film. And this film has a wonderful cast. Jeremy Sumpter is a great Peter Pan. Gifted with a luminous smile and physicality, he captures all the radiant cockiness, the self-delighted impishness of undefeated, indefatigable youth. One almost feels sorry for Hook for having such an adversary. Rachel Hurd-Wood in a very impressive film debut does a marvelous job as Wendy, the young daughter of the Darlings now at the beginning of young womanhood. Hurd-Wood is both child and woman, and she and Sumpter have very warm and charming screen chemistry in their scenes together, capturing the potentially dangerous under-current of adolescent sensuality without ever hitting you over the head with it, or becoming too cloy. Olivia Williams as Mrs. Darling isn't given much to do, beyond being the mother everyone wishes they had, but she does that very well, and she serves the story beautifully. And she is absolutely gorgeous. In the double role of Mr. Darling/Captain Hook, Jason Isaacs finally comes into his own as the cinema's most perfidious villain since Basil Rathbone crossed swords with Errol Flynn. Isaacs is simply magnificent in a role he was born to play. With a sneer and a swash of his buckle he obliterates forever the image of Hook as a buffoon, the mere butt of Peter's jokes. This is a dangerous, deadly Hook, a figure of Satanic dignity, who one can believe might actually best Peter some dark, unlucky night. Lynn Redgrave plays the role of Aunt Millicent, a character created for the film and not in any of the Peter Pan literature. While the new part doesn't really add anything to the story, it doesn't really take anything away either. And Redgrave is always a joy to watch. Finally the performance of the great Richard Briers should be noted. As Smee he steals every scene he is in. It is a delightful comic turn. <br><br>The one performance I questioned was Ludivine Sagnier as Tinker Bell. While I loved the concept of Tink as a bitch-sprite, capable of murderous intent, I felt at times her performance was a little broad. This may have been the outgrowth of having to play a purely physical role without the benefit of any spoken lines. On the other hand I thought she was vastly superior to Julia Roberts who played the same role in \"Hook\". Nor was she a Marilyn Monroe wannabe from Disney. Sagnier to her credit never plays the part for easy sentimentality. <br><br>Hogan and company have brought the Barrie work to the screen and have rightly restored to it a child's sense of awe and wonder, of both beauty and terror co-existing side by side and for this reason alone it is the definitive film version of Peter Pan","user":"GulyJimson","rank":[186,199]},{"title":"The definitive version","rating":10,"date":"20 July 2004","review":"When I was very young, the first version of Peter Pan I saw was the annual televised production of the Broadway Musical starring Mary Martin. It was delightful in its own limited way because after all, when Mary as Peter took to the skies you could definitely see the wires. Not to mention that Peter's shadow looked suspiciously like female hosiery sewn together in the shape of a boy. Some years later, when it was first released on video, I finally was able to enjoy the animated Disney version of J.M. Barrie's classic story. The songs, the animation, the characters were all first rate. Later, I caught a special showing of the Broadway Peter Pan again, this time with Cathy Rigby filling the shoes of Mary Martin. She was full of spunk and energy, and certainly had the physical frame for the role but you could still see the wires. Then Stephen Spielberg tried his hand at it, bringing us Robin Williams as a grown up Peter Pan, Dustin Hoffman as Captain Hook and even Julia Roberts as Tinkerbelle. Spielberg called his film Hook, and it's the first time that character was ever given star billing. I like Julia Roberts, but the beam of light used for Tinkerbelle in the Broadway production gave a better performance. Of course, being a Spielberg film you couldn't see the wires, but surprisingly Spielberg somehow forgot to make his film either interesting or magical. I'd rather have had the magic and seen the wires. The question is, just how many versions of the story does one need? Please don't despair, as it turns out, the latest may just be the greatest of them all.<br><br>In late 2003, Director P.J. Hogan brought to the screen his vision of the boy who would never grow up and having just viewed it on DVD, I can proclaim with all honesty that it shall forever be the definitive version of Peter Pan. Well, at least for me it will be. Through the spectacular use of CGI, Hogan brings us a wondrous and beautiful Neverland never before realized on film. From the opening scenes in London and the flight to Neverland, to the snow encased ship of Captain Hook and his Pirates, each scene is rendered in illustrious detail. In one of the more humorous bits in the film when Peter loses his shadow, the shadow takes on a life of its own and it sure isn't unused panty hose. When Peter Pan flies, he does so unimpeded by any laws of gravity, twirling, bouncing, and floating, in a whimsical way that not unlike Superman, will convince you that with the help of good thoughts and fairy dust, a boy can indeed fly. With each movement, Tinkerbelle emits a shining sparkling cloud of fairy dust that fills the screen like a thousand Independence Day Sparklers. When Peter, Wendy, John, and Michael first arrive in Neverland, they land on puffy pinkish clouds, which are quickly bombarded by Captain Hook and his cannons. In one of the most compelling and touching scenes in the film, Peter and Wendy are witness to a fairy dance, and then take to the skies themselves in an airborne ballet. When Pan takes flight to engage in swordplay with Hook and his pirates the scenes are nothing short of amazing. These are just a few of the many magical, charming, and energizing moments throughout Peter Pan.<br><br>As for the story, it pretty much sticks to previous incarnations we've seen in the books, films, and on Broadway. Wendy tells stories, Pan listens and loses his shadow one night, the dog Nana makes a mess of things a few times, Papa tells Wendy she has to grow up, Pan comes back to retrieve said shadow and off we go!<br><br>There is however, something inherently different about the relationship between Pan and Wendy than anything previously seen. We are made well aware of the fact that Wendy stands on the threshold of womanhood, and all indications are that the process has indeed begun. Peter, on the other hand, had run away from home with Tinkerbelle, before the rites of passage from boyhood to manhood had commenced. It is well within Wendy's ability to love, whereas the concept of true love is a foreign concept for Peter. He cannot love, and will not love, and is firm in his resolve to stay a boy forever. It sets up a much more tense conflict between Wendy and Peter and adds an emotional depth to the story never before realized.<br><br>Much of the success of Peter Pan also has to go to the young actors portraying Peter and Wendy. Jeremy Sumpter, who shined in Bill Paxton's haunting film Frailty, will make you forget any previous portrayal. For most of the film he is as he should be, the carefree rascal who sees fighting Hook and his crew as the ultimate in playground merriment. Late in the film, as he discovers the darker side of his emotions, he handles the transition as well if not better than many adult actors.<br><br>For Wendy, Hogan chose English Actress Rachael Hurd-Wood. As far as I can discover, this is her first film role of any kind, yet one would hardly believe that would be possible from watching this film. When she discovers she is on the verge of entering womanhood, she is able to portray both the fear and loathing of the prospect, but yet she depicts a wide eyed curiosity of what is to take place. Later, her anger and frustration in dealing with Peter's vow of perpetual childhood, has the same believability of someone twice her age dealing with the same conflicting feelings.<br><br>Most of the adult actors are no slouches either. Jason Isaacs does a duo role as both Mr. Darling and Captain Hook. How good is he? I didn't realize he was playing both roles until referencing the credits on IMDb. As Mr. Darling, the timid banker, he reminded me a lot of David Tomlinson's Mr. Banks in Mary Poppins. His Hook is as dastardly a hook that has ever taken the screen. Let's just say that when this Hook does away with someone, they pretty much stay dead and you won't see that kind of ruthless in the Disney animated film. Olivia Williams as Mrs. Darling is perhaps the weakest link in the film. She seems not to be able to portray the deep sadness that comes when one's children are missing, and likewise her joy at their return home is equally unimpressive. She is clearly overshadowed by Lynn Redgrave as Aunt Millicent.<br><br>And what about Tinkerbelle? I certainly can't leave her out. She is played with a lot of panache by an actress named Ludivine Sagnier. She does it with a lot of spunk, a little sass, and a ton of energy. She will quickly make you completely forget the fact that Julia Roberts made a mockery of the same role in Spielberg's Hook.<br><br>And most importantly there's the biggest surprise of all. Having seen the trailer several times before the film's release last years, I was under the assumption that as it always seems to be the case these days, most of the really good stuff was shown in those few minutes of advertising. I couldn't have been more wrong. Let's just say that if you saw the previews in the theater or on the internet, what you saw is just the tip of the iceberg of the discoveries waiting for you within this film.<br><br>One may come to the conclusion that perhaps I am going overboard in my praise. Yet, whether you are young or just young at heart, or wish you could fly away from your troubles to the wonderful place called Neverland, there is something in Peter Pan for even the most cynical film-goer. For an hour and fifty three minutes, it certainly made me feel younger than my years, and when a film does that I have no choice but to give it my grade and it's an A sprinkled with a healthy dose of fairy dust.","user":"clydestuff","rank":[118,129]}]