[{"title":"What an artistic movie","rating":10,"date":"30 April 2011","review":"The Movie Coraline is an animated film well worth watching more than once. SPOILER ALERT The movie starts out introducing Coraline, voice actor Dakota Fanning, who is new to the Pink palace and is soon introduced to the black cat, voice actor Keith David, and Wybie Lovat, voice actor Robert Bailey Jr., who both are stalking Coraline. We then meet her mother Mel Jones, voice actor Teri Hatcher, and her father Charlie Jones, voice actor John Hodgman. Corallines' new life is shown to be less than wonderful as she meets her other tenants and is unable to realize her dream of gardening. Soon she discovers another world, which is much better in every way tailored specifically to Coraline based on information gathered by a spying Coraline doll carried by Coraline unknowingly. The other mother quickly turns villainess, as she is unable to get Coraline to do what she wants. With the help of the black cat, Coraline is able to escape the other mother and return home saving other children's souls who were less fortunate than she was. As well as her parents who were trapped to lure Coraline back to the other world.<br><br>The movie end with Coraline now happy with her real world and realizing she had everything she needed there all along. The theme of wanting more than what you already have and not seeing how good you have it is common among films today. However, the creative imagination of Coraline takes a spin and makes a very unbelievable situation seem plausible. The motif of the movie is seen often as the theme is drawing on what is real and what is too good to be true. When the sound and lighting are as controlled as in Coraline the Director can really impress upon the viewer a believable world that you can see yourself involved. The songs used make the world's first the regular world and then the other world seem like a place of dreary and boring plainness and then a world of pure imagination yet also terror. When the other world is dissolving the technique of fading the edges into white is pure genius. <br><br>The angle also helps you see through a subjective viewpoint in the majority of the scenes, even though it is not truly the camera angle but how the slides are drawn to show certain angles. The theme is so crucial in Coraline because few people would think the way Coraline is acting at the start of the movie might even be bad but as the movie progresses you see how she is flawed in her original outlook and judgments of her parents and new neighbors.","user":"dwarfrunesmith","rank":[33,35]},{"title":"Amazing and unique!","rating":10,"date":"10 June 2010","review":"I am eleven years old and I absolutely loved this movie. Every bit of it was fantastic. I read the book before I watched the movie and was quite satisfied. I, for one did not have any nightmares of such. I think adults are completely overestimating what children can't handle. This was a fine movie. But maybe some of the elements weren't appropriate for younger viewers, like when Miss Spink and Forcible were performing in the other world. I may be different then other children because I can tolerate more scary elements. This was creepy and very original. I loved how twisted and strange it was. The movie was very good and I do suggest some of you actually allow yourselves to enjoy it without criticizing the moment you see something that seems inappropriate. I am a huge Neil Gaiman fan and trust me if I can endure The Lost Boys, I am pretty sure I can endure this. Parents, stop being overprotective and allow yourself to see the good things.","user":"mooitoy","rank":[36,40]},{"title":"Coraline.","rating":10,"date":"10 February 2009","review":"As a Neil Gaiman fan, I was, of course, very happy with the book \"Coraline\", and was extremely excited to hear that a movie was being made for it. I had very high expectations from director Henry Selick after seeing 'The Nightmare Before Christmas' and 'James and the Giant Peach'.<br><br>I was not disappointed.<br><br>It followed the book surprisingly closely, though there were a few anomalies (the character of Wybie, for instance, didn't exist in the book). It had that Tim Burton-esquire feel about it; terrifying, but in an entertaining sort of way. There were one or two scenes which were a little over-the-top for younger children, but that's to be expected.<br><br>You could just tell from the opening scene alone that you were in for a treat. Hauntingly beautiful, well choreographed, and, plain and simple, a bit terrifying; it really hooked your attention and promised a good time.<br><br>However, there were two problems throughout the movie that I could spot:<br><br>One was that some scenes were a little choppy in the animation; almost like they hadn't quite taken enough pictures to make it run smoothly. Unfortunately, with stop-motion animation, this is difficult to avoid, and it isn't overly distracting anyway.<br><br>The other was Coraline's mother was a little... angry. Yes, she's supposed to be constantly frustrated and such, but I think she went a little overboard. Fortunately, Teri Hatcher redeemed herself with her portrayal of the Other Mother, which was brilliant.<br><br>Coraline earns a 9.5 out of 10.","user":"DoctorWhy","rank":[88,105]}]