[{"title":"Perfect Simplicity","rating":17,"date":"17 November 2004","review":"Perfect Simplicity<br><br>My review of this film should end with those two words. However, the 10 line minimum requirement that IMDb requires of all reviews belies the differences between my world and the world shown to me in Spring, Summer, Fall, Winterand Spring. I understand why IMDb does not want 1000's of (apparently) useless two-word reviews in their database. However, I would hope that they could make an exception for this film.<br><br>Perfect: The film is as close to perfect as a film could get. No shot is presented to us, nor a line of dialog uttered that does not make us ponder and understand at the same time. The film is also beautiful. (Like the previous reviewer, I am a fan of Asian cinema and never tire of the stunning ability of Asian directors to capture beauty on film.) This film exceeds most other Asian films I have seen in the cinematography regard. However, its beauty is surprisingly deceptive. Like most great films, it surpasses the 'cinematography' level of beauty and delves into the beauty of existence through its story. For example, the Old Monk has a different pet during each 'season' of his life. This is not discussed by the characters nor shoved in our face by the director  as would have been done if Hollywood had done this film. It is merely background we experience and come to understand. Two days after viewing the film, I am still finding new reflections in my mind that encompass the cinematography, the literal story and the underlying context of the film.<br><br>Simplicity: This film approaches a level of cinematic Haiku. While I don't recall the entire dialog with any specificity, I am sure you could print the script on one page of paper. The amazing part is that while you are watching the film, you don't notice this. Every shot moves the story along. The simplicity of life as shown by the story is reflected in the simplicity of the film. After the film ended, I had a strong urge to move away from civilization and live  or die  in peace with nature. I enjoy (and have come to be too dependent upon) modern inventions, so I will stay at home. However, this film will remain in my heart. It does exactly what good story-telling is supposed to do: Take us completely out of our world and put us in another. There is no wonder that this film was selected for so many film festivals.","user":"grahamers","rank":[231,256]},{"title":"This is not only a Buddhist idea but one of the facts of life.","rating":10,"date":"16 June 2004","review":"In \"Spring, Summer, Fall, Winter ... and Spring,\" Kim Ki-duk, a South Korean director whose past films were often fueled by violence, does a complete about-face. <br><br>This film is a pastoral poem about the changing seasons and a meditation on the cycle of life. In a tranquil and timeless setting of a temple floating atop a man-made lake in a forest, surrounded by mountain spires that cut the monastery off from worldly concerns, an old monk teaches his young disciple the wisdom of Buddha over the many seasons of their lives.<br><br>But don't let the movie's mysticism fool you: This South Korean/German production has created festival buzz here. Sony Pictures Classics snapped up the picture in the second week. As it is chosen to be South Korea's entry into the foreign-language film Oscar competition, \"Spring\" should become an art house hit in North America. <br><br>Set against the background of this floating monastery, the picture's only set, the film follows the lives of a child monk and his master through four different seasons of their lives. Kim infuses these episodes with Buddhist principles, which teach kindness toward all forms of life and the goal of inner peace. Yet the world does intrude into the serene hermitage, bringing with it life's pleasures and sufferings. <br><br>Under the watchful gaze of an old monk (Oh Young-su), a little boy (Seo Jae-kyung) learns what sorrows his own cruelty can cause. As a teen, the boy (Kim Young-min) experiences the power of love and of lust when a young woman (Ha Yeo-jin) enters his life. Turning his back on the hermitage, he joins the world of man only to return years later, in anger and terror, when his desperate need for possession has turned to murder. Before police can arrest him, his master sees that penitence has cleared his heart and soul of all hatred. <br><br>In winter, the old monk makes his funeral pyre. Then his disciple, now a mature man (played by the director himself), returns to the sanctuary of his youth. He seeks peace and quiet so he might fulfill his destiny. When a woman brings a male baby to the temple, the monk undertakes a journey of atonement to place a holy statue on a frozen mountaintop. Now he is ready to raise and instruct a new monk. <br><br>Much of the movie is steeped in Buddhist mysticism. Each of the five episodes features a different animal -- a dog, a rooster, a cat, a snake and finally a turtle. For each season, Kim Ki-duk observes the change of weather and the relationship of man with nature. The film emphasizes the power of meditation and, in the episode concerning the murderer who seeks enlightenment, the need to perform a sutra to cleanse the heart of all jealousy and anger. <br><br>Kim Ki-duk keeps dialogue to a minimum and actions simple in what is virtually a two-character piece. Humor arrives organically, often resulting in hearty laughs. Backed by a terrific South Korean/German production crew, Kim Ki-duk is in total control of his material, its rhythms and its tone.<br><br>Spring - Child Monk takes life of animals out of innocence<br><br>A child monk ties a stone to a back of fish. Same plight awaits a frog and a snake. The child monk roams the brook in search of the fish and the frog as his punishment allotted by the old monk. <br><br>Summer - Boy Monk in love learns obsession The monk is now 17 years old. To the lonely hermitage, a girl comes to convalesce. Before long, warm feelings towards the girl sprouts in the boy's heart. Their ripple in the water turns into an act of love.<br><br>Fall - Young Monk in agony of malice The boy returns to the hermitage in the mountains as a young man in his thirties after committing a murder. The old monk whips him finding the young man attempting suicide in front of the statue of Buddha. Old monk order him to etch the Pranja-parpamitasutra, meanwhile he finds peace in his heart.<br><br>Winter - Mature Monk in days of enlightenment The monk, now in his full maturity retraces his steps to the abandoned hermitage in the mountains. A woman wearing a veil visits the hermitage with a baby. She leaves her baby behind and runs away. <br><br>And then spring - Another child monk : cycle of four seasons The old monk living with another child monk is having a peaceful time in the hermitage...the circle of life keeps on. <br><br>Kim Gi-deok(b) has been known for making films that are involving but often difficult to watch. In his eight previous works, which include ''Som (The Isle),' ''Nappun Namja (Bad Guy)' and most recently ''Haeanson (The Coast Guard),' Kim has taken on such controversial and agonizing topics as the life of a prostitute, the love-hate relationship of a woman and a pimp who kidnaps her, and a soldier slowly going insane. <br><br>For his new film ''Bom Yorum Kaul Kyoul Kurigo Bom (Spring Summer Fall Winter... and Spring),' Kim says he tried to change the pace and outlook of his films and show a different side of himself. <br><br>''I feel like I've been living my life in a rush, so I wanted to slow down a little and make a movie like this,' Kim said after a press screening.<br><br>The film traces the life of a Buddhist monk as he goes from being a young orphan to an adult monk. Kim uses the passing of the seasons to parallel the monk's development and his experiences of desire, jealousy and rage.<br><br>With a small cast, all of ''Spring' takes place in and around a temple on Chusanji Lake located in Mt. Chuwang National Park, North Kyongsang Province. A 30-ton set built specifically for the film, the temple floats like a wayward raft on the lake, accessible only by a small boat.<br><br>With the construction of the temple and the logistics of filming on water, Kim says there were a lot of people behind the film that made it possible. ''They made something that it seemed could not be done work,' he says.<br><br>The floating temple was used to show ''the speed in which life can change, the way that one can wake up and find that East has become West and West has become East, that irony of life,' Kim said. <br><br>''Spring' also shows Kim making his debut as an actor. Kim portrays the older monk in the film's winter scenes, a role he originally conceived for the veteran actor Ahn Sung-ki or renowned scholar and philosopher Kim Yong-OK. Both were unavailable due to schedule conflicts.<br><br>After deciding to take on the part himself, Kim made the already physically demanding role, which included meditating in freezing temperatures, even more so. In one scene Kim climbs up a steep mountain with a large stone tied to his waist while carrying a stone statue of a Buddha with both arms, something he admits he wouldn't have asked another actor to do.<br><br>A devout Catholic _ Kim at one point in his life seriously considered priesthood _ the director says the film in part was driven by his relationship between his own religious values and the culture around him.<br><br>''All Koreans have lived surrounded by Buddhism and Buddhist culture is the foundation, which we acknowledge and accept,' he says.<br><br>And though the changing of the seasons in the film is to show the life of one monk, Kim says it reflects the cycle of life in general.<br><br>''If we were able to remember life's lesson from spring we wouldn't repeat them,' Kim says, ''but like winter which rots away the leaves and freezes over everything, like the seasons' patterns, our patterns in life will make us forget and repeat our past mistakes. <br><br>''This is not only a Buddhist idea but one of the facts of life.'","user":"info-2513","rank":[110,120]},{"title":"When she finds peace in her soul, her body will return to health.","rating":13,"date":"13 September 2004","review":"The circle of life is everlasting. We, as busy humans, sometimes miss the opportunity to see it in full effect. The modern day conveniences of life and the hustle and bustle of work sometimes fog our eyes to the constantly moving world. Thankfully we have films like Spring, Summer, Fall, Winter  and Spring, to help guide us back to our roots. Through each season, director Ki-duk Kim shows us the journey of one young boy as he learns life through the hands and mind of an older monk. Through events that are beyond his control, this young boy learns about love, lust, jealousy, hatred, and eventually rage. He makes choices that ultimately effect his life causing turmoil and distress, yet somehow continually finds his way back to the floating house on the lake where his journey began. It is during his final visit home he learns of his final journey in life. As a new soul is handed to him, he embarks on a final journey using his master's lesson, to pay homage to the life he has lead. <br><br>When I watched this film the first story that came to mind was that told by Trina Paulus in 'Hope for the Flowers'. It is the story of two caterpillars that embark on a journey into butterflies. Along the way they experience a full range of emotions that are attached to life and death. In the end, they become two of the most beautiful creatures in the world. This is how I viewed this entire film. I felt as if I was watching a young caterpillar (the young boy) experience life and journey along the path to become the beautiful butterfly. The beauty of the scenes and the simplicity of this story not drenched in words only kept this image vibrant. The spiritual themes of this film are present, but not bold. They are not hitting you in the face and forcing you to understand, but instead showing you and demonstrating the power of those willing to believe. This is a quiet film that leaves much up to our imagination. We never leave the valley that surrounds the lake, we never know what year is currently going on outside of the forest, and we are meant to understand that this story could take place anytime. Kim gives us themes that can be used to express any period of time and is especially poignant in today's terror filled world.<br><br>I loved everything about this film. From the simplicity of the opening doors to introduce each scene to the stunning and hypnotic ending that makes you believe in the human spirit. If you walk away with anything from this film, I hope it is hope. Hope for everything on this planet, and especially a hope for our fellow man. Mistakes are made to learn by. Take these errors and accept them to move closer to the world you have always dreamed about. Be that young boy that is able to transform into the man he desires.<br><br>See this movie, and feel a warmth like no other. This is quite possibly one of the best films of the year. Amazing!<br><br>Grade: **** out of ****","user":"film-critic","rank":[145,162]}]