[{"title":"A True Cinematic Gem","rating":10,"date":"21 December 2004","review":"FRANKENFISH is one of those lovely B-films you always walk by at your local video store and laugh as you point out the cover to your friends. This film is so funny I can't even begin to explain it. From the ridiculous and unexplained plot, to the over-the-top, undefined characters, this film is a riot. You know you have a great film when there are giant, mutant fish beasts, naked people, house boat tailer parks, turtle soup, biologists, lesbians, Chinese Mofia, bloody gore, propeller boats, shotguns, and lines like, \"I'm gonna git you, you dumb motherf*cker!\" At a breezy 80 minutes in length, this film will have you crying for the must anticipated sequel. If you love B-Films that are truly ridiculous than this is the film for you.","user":"otter_noodle","rank":[70,88]},{"title":"Greatest giant snakehead fish movie ever made","rating":19,"date":"19 December 2004","review":"*SPOILER ALERT* *SPOILER ALERT* <br><br>My friend and I watched this one the other day. Three cheers for \"Frankenfish\"! Wow. We needed that. Most B-movies we see end up causing us much distress. This one got a standing ovation. Bravo \"Frankenfish\"! You made our night.<br><br>I can't tell you how many times we rent a monster movie hoping to actually see a monster and then get ripped off by the lying video box cover. Fraud on a video box cover is a recurring theme of mine but I wish it wasn't. We often wonder why they put a monster on the cover and then don't bother to show one in the movie. \"Frankenfish\" has learned from other's mistakes. The fish monster is on the box and in the movie.<br><br>\"Frankenfish\" also gives us the return of China Chow. I always wondered where she went to after \"The Big Hit\". That was a pleasant addition to the horror flick. But the real stars of \"Frankenfish\" are the giant snakehead fish monsters. China and company go into the swamp and are pinned down by the Frankenfish on a couple of houseboats. The Frankenfish are ruthless beasts who relish the opportunity to chew on anyone they can nail.<br><br>Very fun monster flick. Good stuff.","user":"Dr. Gore","rank":[14,16]},{"title":"Finally A Decent Sci-Fi Channel Movie!","rating":7,"date":"10 February 2006","review":"I came upon \"Frankenfish\" on the Sci-Fi Channel on a night when there was literally nothing else on TV and thought to myself \"With a title like that it's got to at least be worth a look.\" I half expected to laugh myself silly but I was pleasantly surprised at how well done \"Frankenfish\" really was. Plenty of gore (even in an edited-for-TV version!), neat set pieces (I've never seen a \"town\" of floating house boats before) and man, when you say that \"it hits the fan\" in \"Frankenfish,\" it LITERALLY hits the fan, as in a bad guy being splattered by the business end of a Bayou fan-boat. The creature effects are pretty obviously CGI in the long shots but aside from that minor complaint, I thoroughly enjoyed \"Frankenfish\" and wouldn't mind adding it to my video collection. Fans of Joe Dante's classic PIRANHA, the JAWS series, and other killer-aquatic-creature films should have a blast with this one. No, it's not a GREAT movie by any means, but it is a fun one. Give FRANKENFISH a try!","user":"MetalGeek","rank":[25,31]}]