[{"title":"3-in-1 Film: Romance, Thriller, and Social Realism!","rating":1,"date":"1 September 2005","review":"\"The Constant Gardener\" seeks to juggle three film stylesthe romance, the thriller, and provocative social realism. On all three levels, the film succeeds, especially with the latter.<br><br>Much credit should go to director Fernando Meirelles, who has synthesized a virtual textbook of different film techniques. The uses of set-ups, location filming, lenses, film editing, and close-ups were simply dazzling. While the panoramic scenes of the African landscape were breathtaking, there was a starkly contrasting approach to the close-ups in the scenes in the city. The jittery, hand-held camera sequences added to the dramatic tension and underscored the urgency of coming to terms with poverty and disease.<br><br>The romantic portion of the film was anchored by the two characters played by Ralph Fiennes (Justin) and Rachel Weisz (Tessa). Their first meeting was dynamically presented as Tessa was a social activist heckling Justin as he was making a political speech. When the hall was cleared, however, it was Justin who was actually comforting Tessa after her outburst. The juxtaposition of the placid, passive Justin versus the fervent, hyper-kinetic Tessa was brilliantly established in that opening scene. <br><br>The strands of thriller and social realism are inextricably tied together in the film. As a whodunit, \"The Constant Gardener\" seeks to uncover what actually happened to Justin and Tessa on their African journey. At the same time, the main culprit that emerges is the heavy hand of greed as the pharmaceutical companies exploit helpless victims of tuberculosis for the purpose of testing and marketing an experimental drug. At one point in the film, it is disclosed to Justin that the pharmaceutical industry is no different than \"arms dealers.\"<br><br>Another British film entitled \"The Girl in the Café\" appeared recently on American cable television. That gem of a film is a low-budget version of \"The Constant Gardener.\" Both films seek to raise consciousness about the tragedy of world hunger and disease. The title of \"The Constant Gardener\" is an important one because of the time and care taken by Justin in his garden both at work and at home. In the process, however, he has ignored the urgent pleas of his wife, and he has lost touch with the world crisis to which he is arguably a contributor. <br><br>The eighteenth-century French writer Voltaire ended his famous novel \"Candide\" with the slogan \"One must cultivate one's garden.\" This film would appear to suggest that instead of tending our gardens, we need to follow the lead of Justin and Rachel and see how we all might work to help others right now.","user":"lavatch","rank":[269,373]},{"title":"Thought Provoking and Beautifully Stirring Political Potboiler","rating":10,"date":"6 September 2005","review":"Ralph Fiennes stars as a British diplomat whose complacency is challenged when he is forced into a soul searching quest for the reasons behind the tragic death of his activist wife (Rachel Weisz) that uncovers a sinister pharmaceutical company in cahoots with British and Kenyan governments testing a new TB drug on expendable HIV+ Africans.<br><br>Fiennes gives his most humanistic and endearing performance ever, perhaps even topping his Oscar nominated turns in \"Schindler's List\" and \"The English Patient.\" Rachel Weisz is an illuminating revelation, turning in the performance of her career. Her character develops and becomes even more compelling after she dies and we learn her secrets through expertly paced flashbacks. Director Fernando Meirelles takes the amazing style he honed with \"City of God\" and adds a heart with \"The Constant Gardener,\" a big heart that bleeds a beautiful cinematic poeticism onto the screen.<br><br>This film truly rewards its audience as it works on so many levels. Like this year's earlier word-of-mouth and hot-button issue sleeper, \"Crash,\" you won't be able to stop talking about it after you leave the theater. The politics here are engaging and bound to stir up even the most complacent viewer. What's even more amazing is that all of the timely political discourse and subsequent thriller aspects of the film (courtesy of the source material, John Le Carre's novel) are wrapped up in a timeless romance. We the audience join Fiennes on his journey, and we rediscover the love story between he and his wife that anchors the film in a poetic realism usually reserved for movies with much less on their minds.<br><br>To top it off, it's all delivered in the maddeningly genius Meirelles style that took critics and audiences by storm in his debut \"City of God\". We have the shaky hand-held camera darting through vibrant and colorful third-world locales juxtaposed with jaw-droppingly gorgeous aerial photography of Africa in all its blazing glory. Meirelles again shows us he is a true artist willing to show both the shocking beauty and abject horror of the people and places that populate his films. Again he delivers a message that people are doing horrible things to other people the world over (be it in the form of wishy-washy governments turning a blind eye, greedy corporations putting a price tag on a human life, local thugs preying on the misfortune of their neighbors, or friends betraying friends). With \"City of God\" he seemed to be saying the only hope is to document it. With \"The Constant Gardener\" he makes that argument again and takes it one brilliant step forward. We may not be able to stop a war or a huge global injustice, but we do have the power to help one person at a time. It takes a courageous film to make such a statement, and a brilliant film-maker to deliver it, and that's just what \"The Constant Gardener\" does.","user":"WriterDave","rank":[101,136]},{"title":"Rachel Weisz truly gives an Oscar worthy performance.","rating":10,"date":"10 August 2005","review":"Crisp and heartfelt thriller that gives you the right shot in the arm with an Oscar caliber performance by Rachel Weisz and an equally Oscar worthy performance by Ralph Fiennes. This is a film about the horrors of big business and the way they are willing to experiment on the poor to achieve their goals. Rachel Weisz plays Tessa, A feisty activist who uncovers a conspiracy by a pharmacy company to test experimental drugs on the poor natives of Africa. She then tries to fight them and expose the conspiracy until she is brutally murdered. Her husband, a quite diplomat then begins to take up her cause and try to give his departed wife justice while trying to uncover the hard truth of what is going on.<br><br>Fernando Meirelles Follow up his masterpiece \":City of God\" with an equally satisfying journey of self-discovery, love and Justice. Ralph Fiennes owns the role of Justin and he takes you into the center this thrilling journey and into the center of his soul as well. The real showstopper here is the performance of Rachel Weisz, who gives the right balance of self-righteousness, heart and determination with her role. Weisz makes you believe in the film and makes you equally as determine as Justin and she was in uncovering the conspiracy and uncovering the true about what had happen to her.<br><br>This is one of the best films of the year and if there is any justice in the world, this baby would be nominated to the hill with Oscars and Rachel Weisz would get one as well because her performance is easily the best performance of any actor we have had all this year.","user":"firstcallandy","rank":[337,486]}]