[{"title":"A R-rated slasher flick, with a storyline, what more could u ask for?","rating":6,"date":"29 July 2005","review":"I can't believe that people are trashing this film! If it's not the PG-13 horror film haters, which I'm one of those myself, it's people who expect some much from the little guys. This film wasn't handled by a multi-million dollar studio, it was handled by a true student of horror like, hmm, ourselves, with a little bit of money and an idea. I totally respect Mena for paying homage to films like: \"The Town That Dreaded Sundown\", \"Psycho\", and yes \"Halloween\", but folks give me a break! This film was good, violent, scary and had a storyline, two different plot points to be exact, along with a back story coming soon to theaters. Stay off these guys, they are one of us, one of the little guys who are trying to make Hollywood into what it used to be, to what we dreamed of, not what it has become.<br><br>\"Malevolence\", is a true horror film that everyone should watch! No it's not the best acted film I've ever seen, or the most horrific cinematic experience I've witnessed, but it's a true visceral, surrealistic film, that only the old 70's flicks could approach. Forget the lavishing special effects, with the beefy soundtracks packed with the latest heavy metal hits and hot models turned actresses. If you want to see a true gritty horror film, with big scares, large knives, synthesized effects and a potato bag wearing maniac, rent this puppy, she will deliver, I promise!","user":"shane-168","rank":[42,51]},{"title":"A homage to grindhouse eighties slasher films","rating":10,"date":"26 April 2005","review":"First off I have to say that I rented this at Blockbuster thinking it would be a piece of crap. I'm a huge horror buff so I pretty much rent anything genre related, even if it is a turd. Especially if it has Anchor Bay on it. I've seen my share of slasher films so I immediately felt like I was in familiar territory.<br><br>The film starts out with a little boy being forced to watch a young lady stabbed repeatedly. Then the film gets into a bank robbery that doesn't turn out and has the criminals fleeing to an old abandoned house. One of the hostages manages to escape and leads them into an abandoned slaughterhouse where a demented serial killer is shacking up.<br><br>One thing I noticed about this indie flick that sets it above others is that you can watch it on your plasma screen TV in HD. The sound is great when you blast it on 5.1 and just feel the vibrations from the bass heavy score. It makes you feel very unsettled. The camera work on this is a lot different from most other horror films, more than once I was treated to beautiful scenic lingering shots. You can tell a lot of work went into the sound and atmosphere.<br><br>The acting is a little hammy in spots but the cast of unknowns are very believable. I was relieved that the newest twenty something teen/TV star wasn't running around acting scared and spouting catch phrases. The acting is mature and serious. There's no self referential humor that is usually found in horror flicks these days. The whole thing is dead serious and reminded me a lot of another great slasher film I saw recently called Wrong Turn. A solid horror film looking to make you squirm and jump from what you see &amp; hear. That's what I used to love about grindhouse horror films, they didn't try to be hip and make you laugh, they went for the throat. Malevolence is a return to this style of film making. That's not to say there aren't clichés but it blends them into such a provocative cocktail, it is kind of like reliving the good old glory days of horror.<br><br>With all the PG-13 teeny bopper nonsense doing so well these days Malevolence is like a breath of fresh air. The slaughterhouse location was creepy as hell and all of the stuff you see in the slaughterhouse was found on location and utilized on the set. This gives it a visceral punch, none of the sets look fake ala the new TCM remake.<br><br>The horror in Malevolence exists on a lot of different levels, the characters themselves are not purely \"good\" or \"evil\" and it is sometimes hard to feel for some of them. I found myself conflicted over if I was scared for some of them to die or if I wanted to see them gutted like a deer. The characters are anything but cardboard that's for sure.<br><br>Easily said that if you like Halloween, the town that dreaded sundown, Just Before Dawn, The Prowler, The Burning or Madman you will definitely love this. I have seen my share of slashers and this is the best of the recent pack. I know the genre has been done to death but there's still a lot of meat on the bones and Steven Mena does a great job of proving this.<br><br>For all the real horror fans out there, open your mind and give it a shot. I think you will be pleasantly surprised. My only regret is that I didn't go watch it in the theater when it was playing here in Toronto.<br><br>I look forward to the director's next effort.","user":"burstbloom","rank":[25,36]},{"title":"More frustrating than entertaining","rating":5,"date":"22 April 2005","review":"I've been wanting to check this out since learning that it won Best Feature at the 2003 NYC Horror Film Festival. Now after watching it I'm guessing every other film it was competing against must've REALLY sucked.<br><br>Malevolence is in no way a bad film, yet it's just not that good either. The concept of mixing a robbery-gone-wrong story with a slasher film is pretty original, but this only makes it's heavy use of slasher clichés drag it down into mediocrity. What would be perfectly acceptable idiotic behavior from stupid teenagers in a fun slasher film, becomes unbearably frustrating because one would expect more from the unconventional characters portrayed here.<br><br>As the film stumbles forward through all the usual \"scares\" of the genre, I only became more and more frustrated by how a good idea is just thrown out the window in order to fall back on things that have been done to death (and much better) 25 years ago. All this is topped off by a soundtrack that was obviously intended to be \"old-school\" yet comes off as just really annoying and repetitive.<br><br>Still, as far as low-budget indie horror flicks go, Malevolence is decently shot, and while it does bring in a new mix to the formula, it immediately waters it down by simply not doing anything worth-while with it.","user":"Bel_Ebih","rank":[21,32]}]