[{"title":"different from the barbershops, but still holds its own","rating":6,"date":"4 April 2005","review":"More of a spin-off movie than it is a sequel to 2002 and 2004's Barbershop movies; Beauty Shop comes to us as the female rendition of the popular franchise. Beauty Shop gives us the return of Gina, played by Queen Latifah, from the second Barbershop movie. Gina has moved away from Chicago to Atlanta so her daughter can attend a prestigious music school. She has made a name for herself at a posh European-style salon owned by the famous hairstylist Jorge. After a scuffle with her boss, Gina decides to quit her job and achieve her dream of owning her own beauty shop. She brings with her, a few loyal customers along with another worker at the salon. With the help of her family and the electrician slash romantic interest who lives above the shop, Gina finds success with her beauty salon.<br><br>The cast of Beauty shop follows the same formula as the barbershop movies. There's the obvious ice cube parallel with Queen Latifah's Gina. The older and wiser stylist, the male form of Cedric the Entertainer's character, played by Alfre Woodard who quotes the wisdom of Maya Angelou to her customers. The token white worker is present with Alicia Silverstone, and the one opposite sex worker played by Eve in the barbershop has her counter part with Bryce Wilson's James. Also included in the film is everyone's favorite Huxtable, Keisha Knight Pullian, famous as Rudy Huxtable. And lastly, quite possibly my favorite part of the movie and funniest character in the movie, Kevin Bacon is hilarious as the egocentric Jorge. The cast works very well together and the fun they had while making the film shows in each scene.<br><br>While the cast is fun to watch, I still felt as though something in the film was missing. When watching Barbershop, that classic old town feel emits throughout the show. The characters are so fun to watch as we see their relationships with each other and their own personalities work and clash with each other. While watching Beauty shop, while the characters were fun to watch interact with each other, that feeling just isn't the same when you walk out. I left feeling somewhat unfulfilled.<br><br>However, after more reflection on the matter, I realized, that the mood of a beauty shop is no the same as the mood of a barbershop. Maybe I didn't feel the same, because, well, I'm not a woman. As with any television spin off, a movie spin off should be able to hold its own ground. It doesn't need to be a complete reference to its predecessor. Think of Frasier. One of the things that made the show so great was the fact that it held its on ground separate from Cheers. The same goes with Beauty Shop. Yes, it relies on a few references and relations to the barbershop movies, but other than that, it completely holds its own. Which, as I thought about it, made it more enjoyable to know that I wasn't watching the same movie in female form.<br><br>Beauty Shop is a fun movie to watch with a very solid cast. Queen Latifah does a fine job as Gina and makes and, more or less, makes up for her involvement with last year's Taxi. If for anything else, see the movie for Kevin Bacon, you wont be disappointed. Beauty shop is pretty enjoyable and is the closest to a hair cut ill come to. I give it 3 stars.(out of 5)","user":"flashbeagle","rank":[25,33]},{"title":"I love Queen Latifa!","rating":6,"date":"9 April 2005","review":"VERY mild spoilers.<br><br>This movie has some great funny parts. The friends I was with kept saying \"where's the plot?\" Well, the plot was done in, well, chick-flick style - plenty of relationship touchy-feely stuff, and not much action. But that's what I expected.<br><br>For me the strength of the film was in the development and interaction of the characters. The writers spared no silly jokes in virtually any conversation - which is why I wanted to see the film in the first place.<br><br>Kevin Bacon as a fake German gay hair-salon owner was a bit disappointing; when we actually saw him try to work he didn't seem to know anything about the how to do hair - which contradicts the premise of his character. He could have been a competent hair-dresser and still been a total jerk.<br><br>Queen Latifa, as usual, was wonderful, witty, funny, delivered her lines perfectly, and simply knows how and when to do things just at the right moment. I'm sure the editors, director and others also deserve credit for her performance, but she shines in whatever she's in.<br><br>OK, I don't mean to make this out to be a great movie; it isn't. It's entertaining, touching and funny - but it's mostly just \"there\" and doesn't really move me beyond the moment. When it was over I was ready to go home.","user":"sidunrau","rank":[25,34]},{"title":"A Fun Comedy!","rating":7,"date":"23 December 2005","review":"This movie is a spin-off sequel to Barberer Shop 2: Back in Business. Gina is a hairstylist who opens up a beauty shop full of employees and customers more interested in speaking their minds than getting a cut.<br><br>Latifah does it again! Her charm lights up the screen. Gina's business starts off bad. Her own shop just looks bad. Luckily, her friends help her clean up the place and that's where she hires employees. She gets one of her white friends in the other shop to help her work there. Some of her black friends comes to help.<br><br>This is one of those comedies that doesn't uses f-words. The acting from Latifah, Woodard, Silverstone, and Bacon are great. Actually, I've never seen Bacon act like that in his entire film career. It's funny to see that. Bacon's character then gets jealous because Gina is doing much better than he has expected. The jokes are funny in this film.<br><br>If you just want to see a feel-good film, here it is!","user":"moviewizguy","rank":[16,22]}]