[{"title":"I've been waiting for this movie...","rating":10,"date":"22 June 2004","review":"********BEWARE OF POSSIBLE SPOILERS!*************<br><br>The Land Before Time was one of my favorite movies when I was around 4-5. It actually taught me about death. It's a cherished childhood memory, therefore I'd like to see it treated with a little respect. Instead I've seen it abused over the years, milked for sequels whenever the studio goes broke. Each one is worse than the last, chock full of fruity singing. So wasn't I surprised when I saw LBT X!<br><br>Honestly, it's like a breath of fresh air after being stuck downwind from a fart. Where do I begin? <br><br>First of all, the voice acting is better. Instead of paying some homeless guy with a sandwich and a roll of toilet paper, some actual celebrities were hired. And who should be supplying the voice of the most important character, but Kiefer Sutherland! This is a big thing for me, I'm a huge Kiefer fan. So much that I don't really give a toot about other important people voicing other important longnecks.<br><br>Second of all, the plot of the first movie ties in with this one. In all the other sequels, Littlefoot is just happy as a clam and never mentions or even thinks about his mother. For the love of cake, people, she died in front of him! If your mother was shredded apart by a vicious dinosaur and you were left to survive yourself, would you be frolicking around singing songs? I don't know about you, but I'd be cowering in my \"safe corner\". Not to mention Littlefoot's home is rife with morons. But not in this movie. Here, a series of dreams leads Littlefoot to a place where he meets his father. Finally he's forced to take off his rose-colored sunglasses and remember his past. The result is a movie that's at least somewhat mature.<br><br>A nicely thought out plot (parts actually mirror a fan fiction story I wrote), Kiefer Sutherland voicing Littlefoot's father, and I really don't think there were quite as many songs. All together I'm more than satisfied with this movie. Granted, there are better cartoons out there to entertain you. But if you were a fan of the first movie and are disgusted with the sugary sequels, I think you'll find Land Before Time X pleasantly refreshing.","user":"wolfofmoonandsun","rank":[6,7]},{"title":"The Great Longneck Migration","rating":7,"date":"2 April 2009","review":"The Land Before Time X: The Great Longneck Migration, the tenth installment in the Land Before Time series. This is the best sequel I have seen so far! Seriously, this is a really good animated film and deserves a higher rating. Again, I am so confused, when I started watching these movies I was expecting nothing but trash from what the users have been rating them. But I always try to give my best honest feedback on the film and honestly this was a terrific story. The animation is getting a little bit more computer which I agree is sort of taking away from what the original was giving us, but it's a new generation and still the bright colors and characters were still a pleasure to watch. We finally get to meet Littlefoot's father and also more Longnecks for Littlefoot, so we get to see what his life could be like if he grew up with his mother.<br><br>Plagued by mysterious dreams, Littlefoot, his grandparents and all the other Longnecks depart the Great Valley, joining up with other Longneck herds as they travel to a single location; with Cera, Petrie, Spike, and Ducky following the herds to an enormous crater, which they believe is the culmination of their journey. Littlefoot learns that long ago, that the sun was going to fall. However, a number of Longnecks came together to this very spot and raised up their necks, lifting the Circle back to where it had been. According to this myth, this stretching of their necks is how the Longnecks got their long necks. History is about to repeat itself, and so the Longnecks have returned to the crater in order to save the sun once more. Littlefoot's friends miss him though and decide to travel to find him and take him back home meeting another Longneck along the way. However, another surprise is in store, as Littlefoot meets his father, Bron, for the first time in his whole life. However, Bron isn't alone. Since parting from his now deceased wife, he has become guardian to another young brachiosaurus, Shorty, who becomes jealous of Littlefoot since Bron is spending more time with him. One dawn, Shorty tries to run away, but Littlefoot stops him and convinces him to rejoin the migration, he even goes as far as to suggest they become brothers. At this point, Littlefoot's friends arrive. Soon after, following a Sharptooth attack there is a furious battle that the group must face.<br><br>The Land Before Time X: The Great Longneck Migration is the best sequel that I've seen so far of the series. I can't wait to see the next sequel which I do have to wait for sadly, so a comment will be coming soon. But I have to tell you the humor is much more for the kids as the adults, I even laughed a few times, which I have with the previous sequels, but not as much as with The Great Longneck Migration. I mainly loved watching Littlefoot's friends going on their own to find Littlefoot, especially Ducky and Spike, they are so cute together. This was a touching story as well with Littlefoot discovering his dad and the relationship they could have together. I highly recommend this movie, if you are going to watch one of the Land Before Time sequels, I suggest this one.<br><br>7/10","user":"Smells_Like_Cheese","rank":[3,3]},{"title":"I'm amazed!","rating":9,"date":"11 September 2004","review":"As a loyal L.B.T. fan, I swooped on this &amp; was amazed. Littlefoot sets out with his grandparents to discover the meaning of a dream. His friends can't resist following and soon get into trouble. Meanwhile Littlefoot makes an astonishing discovery. <br><br>This milestone film has quality animation, talented guest stars, cute songs and sympathetic new characters. Olivia Newton John lends her fantastic voice to the end credits. Grease is my favourite musical so this was a real thrill. My only quibble is that Ali, the female longneck from IV did not return. Opportunity lost.<br><br>And if they make XI, I'll be first in line. 9/10","user":"Growlyted","rank":[6,10]}]