[{"title":"Expected Trite, Got Surprised!","rating":6,"date":"8 November 2005","review":"THE PERFECT MAN is another one of those fluff romantic comedies that just keep recycling - single mom and pseudorebellious daughter make everything work after plotted plans go astray. This is one of those films that you rent because the video store is closing and you need a somnolent-inducing DVD. But in the case of THE PERFECT MAN there are some nice surprises!<br><br>Jean Hamilton (Heather Locklear) is a 40ish single mom who bakes specialty cakes and can't land a man. Whenever she gets close to a commitment or when she is passed by, she runs, family in tow, to a new city, new friends, new opportunities to find a man before she is too old. Her daughters Holly (Hilary Duff) age 16 and little Zoe (Aria Wallace) go along with the transplanting moves, understanding and supportive of their mother but yearning for some permanence. The newest move is to Brooklyn: Jean is welcomed back to a bakery of friends, Holly finds reasons to like her new school (friends female and male) and Zoe starts on a run toward a spelling bee. Since Jean is so desperate for a man, she is swept off her feet by a fellow baker who is sweet but otherwise fairly low on the food chain. Holly and her new friend Amber (Michelle Nolden) plan a way to capture Jean's attention from a created secret lover, their information comes from Amber's restaurateur Uncle Ben (Chris Noth) who tells them the secrets to winning a woman's heart.<br><br>Let the games begin: first flowers, then gifts, then letters, then email, then I'm, and Jean feels as though there really is someone special out there who loves her. But as all games go, this one has its successes and major failures and as Holly grows to understand her mother's dilemma, she finds her own in her reluctance to accept the fact that her friend Adam (Ben Feldman) has fallen for her and wants her around. From that point it is a comedy of errors until the final frames where, as expected, all works out for the best for everyone.<br><br>Shallow, yes. Been there, done that, yes. But the surprise is the growth of Heather Locklear as an actress! She has come along ways from her 'Dynasty'/'Melrose Place' days as basically set decor and has accepted her age gracefully, coupling that with a nuanced acting ability that makes her a welcome 'newcomer' to the screen. She is worth sitting through this little yawner, making it come alive every time she is on screen. Grady Harp","user":"gradyharp","rank":[28,36]},{"title":"Good effort from Hilary","rating":27,"date":"27 August 2006","review":"Hilary Duff once again steps into her comfortable role as the good girl next door, this time as Heather Locklear's daughter. Tired of her mom having a breakdown and moving every time she gets dumped by another third rate guy. To prevent going on another \"adventure\", and to save her mother's self esteem, Holly concocts a plot for the imaginary perfect man for her mother.<br><br>The film is charming. Although it's no Oscar contender, this film exists to entertain and make audiences laugh. There are some cheesy moments and lines, but it doesn't hurt the film. Hilary Duff has improved her acting even more since 2004's \"Raise Your Voice\" and Heather Locklear adds a certain flair to the story not always seen in a Hilary Duff movie. The sub romantic plot between Holly and Ben is sweet, and you get some scenic views of New York, all of which helps to make a pleasurable movie that should've been a hit but instead got swallowed up by blockbusters at the box office.","user":"flippensweet88","rank":[18,23]},{"title":"Must see for divorcees and their children. Puts things into perspective.","rating":8,"date":"18 June 2005","review":"Tonight I saw a \"Perfect Man\". While there were a few inconsistencies such as bad Brooklyn Accents and that Holly (Hillary Duff) was 16 and driving in NYC, you must be 18 to drive within the city limits, the movie itself was great. I am the daughter of divorced parents, as so many of us in today's world. I always resented that my mother changed my sister and my lives to benefit her own. However we saw this movie together and after we both had a really good cry. She related to Jean (Heather Locklear), a single mother who moved over a man. And I related to Holly (Duff) who didn't want to move and had to leave her friends behind. Although it's not clear if the mother was divorced or never married, this movie was an amazing account of the divorcée and her daughters attempts to get things right.","user":"FreebieProof","rank":[43,62]}]