[{"title":"Watered-Down Gilliam Is Better Than No Gilliam","rating":7,"date":"26 August 2005","review":"Rather than fight yet another war with Hollywood (see: \"Brazil\", \"The Adventures of Baron Munchausen\", and \"The Man Who Killed Don Quixote\"), Terry Gilliam took off his gloves and allowed the Weinsteins and Miramax to force their will upon him. With his new film \"Tideland\" coming out soon, Gilliam chose to focus his efforts on molding it, while allowing \"The Brothers Grimm\" to go wherever the studio wanted to take it. The result is by far the most commercial film to Gilliam's name, but in this case watered-down Gilliam is better than no Gilliam, and his first film in seven years (\"Fear and Loathing in Las Vegas\" in 1998) is a fun one.<br><br>\"The Brothers Grimm\" certainly looks like a Terry Gilliam movie, loaded with extravagant visuals and wide angled shots, although the $80 million budget did allow for his first use of CGI (it really isn't too bad, though), and it does not have the incredibly surreal feeling to it that most Gilliam films have. It takes a bit of time to get used to Matt Damon (as Will Grimm) and Heath Ledger, moreso Damon, as Ledger is surprisingly good as Jacob Grimm. The film was much more humorous than I had expected, and has plenty of subtle Gilliam humor. Many will find Peter Stormare' Cavaldi character to be extremely annoying, but I thought he was hilarious, and one of the highlights of the movie. Jonathan Pryce returns to another Gilliam movie as Delatombe, and does a decent job, although his character was a little overly obnoxious at times. Lena Headey is good as Angelika, and Monica Bellucci also pulls off a good performance, although unfortunately she does not get a significant amount of screen time.<br><br>The plot of \"The Brothers Grimm\" wanders a lot, and I actually thought the movie was winding down at around the 90 minute mark, but this works somewhat to the film's advantage, as it makes a fairly straightforward plot seem slightly less predictable. The film is much sillier than the promos may lead to believe, and that probably will not come us much of a surprise to big Gilliam fans. Unlike previous Gilliam movies, however, there really is no substance behind what we see on screen, so what we get is really the first 'popcorn flick' with Gilliam's name on it. Like all Terry Gilliam movies, the reaction will be mixed, and there will be some people who absolutely love it, and some who name it their worst film of the year. As far as I'm concerned, \"Grimm\" does not hold a candle to Terry Gilliam's previous films, but it is one of the better 'big summer movies', and I certainly felt my time was well spent watching it.<br><br>3 stars (out of 4)","user":"Vulcan91","rank":[228,312]},{"title":"not bad","rating":7,"date":"26 August 2005","review":"Well, my friends, I have just returned from the earliest possible showing of \"Brothers Grimm\" in my area, and I can assure you it was well worth getting up a few hours earlier than usual to watch. However, I would caution anyone who doesn't like Terry Gilliam's work, Matt Damon and Heath Ledger, or the REAL brothers Grimms' stories that this is not your average fantasy. The story is set in french-occupied Germany in the 1700s, a real time in which real people actually lived. Even some of the magical aspects of the story are explained by real events (I won't spoil it for you). So quite a bit of the plot deals with the realities of the day and age along with the fantastical aspects of the forest and its inhabitants.<br><br>That being said, the story also deals with the opposite side of unreality-- the dark and unnaturally gruesome. This is where I think the writer hit on a brilliant point; while the real brothers' stories have happy endings and some lighthearted moments, most if not all of their stories involve some degree of blood and gore. My hat is off to Ehren Kruger for being true to that aspect of their work.<br><br>The only aspects of this movie I disliked were the unresolved ending (which I won't spoil, either) and some of the acting. Lena Headey's performance did not impress me, but it could just be lack of material to work with (a very overdone character) and the fact that I've never seen any of her other work. Matt Damon is interesting to watch as usual. Peter Stormare and Jonathan Pryce are wacky to the point of annoyance as an Italian torture specialist and a French general. The only truly wonderful performance, however, is that of Mr. Ledger, whose bumbling, scholarly, tag-along Jacob was both a sympathetic character and a side we rarely see from this multi-talented actor.<br><br>This is not a movie for everyone (I wouldn't bring children with the tendency for nightmares or irrational fears, for example). It's not a movie you'll learn from or probably want to see hundreds of times. But for the moviegoer looking for beautiful cinematography, a few good laughs, and a fairly suspenseful story, look no further.","user":"moonstarly","rank":[247,343]},{"title":"Gilliam does Hollywood ...","rating":6,"date":"5 September 2005","review":"Being a fan of both good old-fashioned fantasy movies and of director Terry Gilliam, I was really looking forward to this one. I was slightly put off when I heard Gilliam's complaints about the constant interference of the Brothers Weinstein, but the director does have a history of being dissatisfied with the production of projects which actually turn out pretty good in the end, so my hopes were still pretty high.<br><br>Rather than being a historical biography of the famous authors, this is a fantastic make-believe story of the possible inspirations behind the stories of the Brothers Grimm. The brothers travel around Europe working as con artists, fooling simple peasants into believing they are witch-hunters and monster slayers. However, when they are captured by a French general and sent to investigate a town which is believed to have been targeted by similar con-men, they discover that there may be some truth behind the fairy tales. The very woods surrounding the town seem to be alive, a big, bad wolf stalks through the darkness and an evil power seems to emanate from a mysterious ancient tower ...<br><br>So, Gilliam tries his hand at doing a commercial summer blockbuster. And the results are, well, interesting. Primarily he shows that he can produce some great action sequences, and there are some really great visual ideas here, many of which I'll admit are entirely thanks to top-notch CGI work. These are the moments when the director's creative magic appears to shine through, and there's enough of them to make this movie worth watching. Overall it does feel strangely derivative for a Gilliam movie, but I suppose that's to be expected when he sacrifices creative control to the studio. In the past I've heard that Gilliam simply sees himself as a \"hired hand\" on such projects.<br><br>However, where it fails is in the mixture of action and drama, in repeatedly placing it's characters in peril whilst also making us care about them. Unfortunately this has been a problem in a lot of these big-budget fantasy/action movies lately, including last years equivalent -- \"Van Helsing\". The other movie with which this shares a lot in common is Tim Burton's Gothic horror \"Sleepy Hollow\", which was far superior to either. The main problem with the \"Brothers Grimm\" is that there's little to no character development in the first hour of the movie, and then almost all of the conflict between the characters is suddenly introduced in one scene. This is what we call bad pacing. And the way the characters are written seems somewhat inconsistent (although both Damon and Ledger manage to turn in decent performances all the same), and we never really get a \"feel\" for their personalities.<br><br>For your average light-hearted Hollywood fantasy, this is perfectly fine. But from a director with a history of making fascinating, important works of surreal art, this is somewhat short of what you'd expect.","user":"Teknofobe70","rank":[164,227]}]