[{"title":"Well-played act with a well-screwed ending","rating":5,"date":"31 July 2009","review":"I have this film for a while, but I've never seen it until today. I haven't known much about it, I just picked it because of Christian Kane, 'cause I adore that man since I've fell in love with twin shows Angel and Buffy. I love his looks, his voice, his act - he's the real deal. So I thought it will worth a shot. And today I wanted to watch something in the evening, and I hadn't got anything I haven't had seen yet besides this one. So I started to watch it, and while it started, I'd dropped by to IMDb to see what other people think about it. After some really low points and really bad reviews I almost dropped it, but after ten minutes it got my attention right away. The only reason I'm not mad because of the bad opinions that almost got me not to watch it is that this way I had a feeling all the way through the film that there will be a lame ending. And this way I wasn't so disappointed when it turned out that I was right. I don't want to spoil anybody's experience with the film, so I won't write anything about why it was bad. That's not the point anyway. The point is that Keep your distance could be a very good film if it had an another ending. It has an interesting story, for starters. It's not the most original one in the history of movies, but a quite good one. There was good directing, very good actors who played very colorful, vivid characters, not commonplace, black-and-white, boring persons like in most of the Hollywood films, and there was a well-adjusted tension in the film. And then, int the end, in about 5 minutes, they ruined it all with a petty, cheesy closing. I got the feeling like the makers had got bored in the end or had ran out of time, and they had just thrown the first thing they got in mind to the end of the film. So yes, it's not a good film, but in my opinion it's just because of the ending. Whitout the last 5 minutes I would've given 7-8/10 to it. But this way it's not more than 5. Anyway, it was worth to be seen, and I kinda liked it even this way, but it could've been so much better. (And and least Christian Kane had some pleasant singing-scenes, and one always should appreciate him singing...)","user":"lousha-1","rank":[4,4]},{"title":"Keeps you interested and then....","rating":5,"date":"12 November 2005","review":"takes you nowhere! There were enough plot elements to keep me watching, but nothing happens in this movie. Keach and Pena have cameos and that's it. Coulda used anybody for either role and it would not have detracted from this film so don't watch this movie to see either one of these two show their considerable talents.<br><br>The 'bad guy' is not even really bad. I mean there's a jilted lover and a disgruntled employee - two characters that had the potential for some cool action/revenge and they both go out with a wimper! There's a great storm, in a house, in an isolated location and NOTHING HAPPENS! Obviously, Pollard had a decent budget for this film because it's well done but it just rather pointless.","user":"joelholio","rank":[8,10]},{"title":"Superior character-driven independent showcase","rating":9,"date":"29 November 2005","review":"I'll begin by saying that this is the best American movie I have seen in 2005, which may not say much since I try to steer my viewing habits to things of greater merit than mind-numbingly insulting garbage that comes out of Hollywood these days. Other outstanding American films of the year so far include SIN CITY and CRASH.<br><br>KEEP YOUR DISTANCE is hailed as a mystery thriller, which is somewhat misleading considering the mystery is secondary to the primary focus of studying the characters' psychology in modern society by looking at their public and private lives.<br><br>The spontaneous, down-to-earth performances is the film's greatest asset. No moment stands out as showy, as popular blockbusters would try to impress us with badass personalities, or as experimental art films would consciously pile layers upon layers of subtleties. This type of independent film has the perfect balance in the spectrum, in my humble opinion, which another review has mentioned that it \"tries\" to look like mainstream, and I'll just add that it offers more depth. In little moments like Melody's spontaneous yet helpless laughter in response to David Dailey's awkward line \"I've been there (Chicago),\" it's obvious that the film isn't trying to sell its stars, cool characters, or edge-of-your-seat action. All it's doing, is offering a realistic character study, taking in issues that have become central to society only recently, for example the drive for workaholism and its consequences on personal life, the long term devastation of marrying the wrong person, as well as maintaining the right distance in relationships, as the title suggests. If art is to imitate real life, then KEEP YOUR DISTANCE is an outstanding work of art.<br><br>Several themes gradually unfold in parallel situations, such as the parallel between the Lentz scandal and David Dailey's own problems, and common dissatisfaction in the relationship of Melody and Sean paralleling that of David and Susan. In Melody's case, marrying the wrong man phased out her trust for everything. When she checks into a hotel room, she routinely looks under the bed and behind the shower curtain, as if not doing so will jeopardize her security. Such insecurity distances her from her new boyfriend Sean, who has a habit of spying, and even sets up a secret camera overlooking his band mates. As a side note, I think Sean probably inherited this habit from his wealthy father, whom we see paying people to keep an eye on other people. As for David, his wife Susan has been calling the shots since their marriage. They have had a lot of luck, and all can be attributed to her initiatives. David finally realizes that their marriage isn't about two people, but about one person, which cannot be sustained.<br><br>The ending is a bit of a letdown because the solution to the mystery is not earth-shakingly complicated. However, this is in tune with the rest of the film's down-to-earth approach, which still manages to play out impressively captivating (and in my opinion is a case of simplicity bearing superiority).<br><br>Inevitably, this kind of character study film will always trigger criticism for being boring or \"nothing happens\" (case in point: THE LIMEY, another personal favorite). In my opinion, such accusation is a lame move generally coming from viewers that have been trapped in mainstream blockbusterland. Needless to say, many such viewers are handicapped by short attention span and lack of exposure to the other end of the spectrum (namely films bearing more complexity, originality, sophistication, depth, boldness, and imagination).<br><br>KEEP YOUR DISTANCE is a fine film because it aims to impress us by delivering elements fundamental to the art: strong performances, interesting storytelling, and thorough characterization. Most mainstream blockbusters cannot touch a genuine independent showcase like this one because there's hardly any substance underneath their star power and high tech tricks.","user":"PiranianRose","rank":[10,14]}]