[{"title":"no reason for this to have been made","rating":17,"date":"17 January 2007","review":"An unnecessary sequel if there ever was one finds bumbling dentist Oz (Perry) now happily married to Cynthia (Henstridge), until she's kidnapped by vengeful mobster Lazlo Gogolak (Pollak) and his Hungarian crew who know that former associate Jimmy Tudeski (Willis) is still alive. Not capable of getting her back by himself, Oz enlists the aid of Jimmy and wife Jill (Peet); she's anxious to get back into the game, but unfortunately he's put the old life behind him in favor of staying at home and obsessing over the cleanliness of his surroundings. The same cast that brought so much life and energy to The Whole Nine Yards flounders in this embarrassingly unfunny follow-up where the film's ridiculous story throws out one silly plot twist after another and an abundance of desperate gags. At times the actors appear as if they're begging for help. *","user":"Special-K88","rank":[30,38]},{"title":"Abysmal","rating":1,"date":"24 May 2005","review":"Absolutely terrible. Unbelievably bad. Not the least bit funny. Moronic, extremely lame jokes, terrible acting, no plot at all worth mentioning, a perfect example of the decline of Hollywood films. After 10 minutes you will be pulling out your hair. The lines are so bad Ernest wouldn't have used them.<br><br>The first movie (Whole 9 Yards) was witty, humorous, and surprisingly good. Everything worked. Perry was particularly effective as the bumbling dentist whose wife is out to get him. Willis was great as a serious hit-man who doesn't want to be sequestered away in Canada. And both Peet and Henstridge were effective in their roles as an enthusiastic yet green hit-woman, and a mobster's wife (respectively). But this movie??? It had none of that. There was not a single memorable moment, nor anything that would even evoke a chuckle. The physical comedy was very forced, and incredibly obvious. The jokes were just plain terrible. There was no direction, this movie meandered all over the place. The whole bit with Willis pretending he liked to keep house? That was simply idiotic.<br><br>This movie was so bad it makes Charlies Angel's 2 look like a masterpiece, and that is really an impressive feat. It is hard to imagine how after the first one which was such an effective comedy, the same team could churn out this complete and utter crap. It boggles the imagination. It is actually hard to think of worst sequels, or at least ones that were so much more terribly bad than the original actually good film (if both stink, that doesn't count); CA2 is the best example I can think of but then again the first one was nothing to write home about. How about Jaws 4? Friday the 13th 27? I really can't think of a more disappointing film, particularly after the promise of the first 9 Yards.<br><br>Terrible, absolutely terrible. Should be retitled \"The 3 stooges get Lazlo\", except that would be an insult to the stooges. My advice? Rent the first one and pretend this one was never made.","user":"Rooster99","rank":[41,54]},{"title":"Step back nine yards","rating":4,"date":"12 September 2007","review":"After the fun time I had watching The Whole Nine Yards, I was looking forward to seeing The Whole Ten Yards. But I watched it last night and I was pretty much disappointed with where they took the story. It just seemed like they took the characters and turned them into something completely different. For me, I'm such a Bruce Willis fan, so when I saw him growing and acting like a bull while he was drunk in one scene, I didn't laugh, I actually wanted to cry for him, it was pretty pathetic what they did to this cool, smooth, charismatic hit man that we knew and loved in the first film. The script and story was just up to par like the first film was, in fact, I would've appreciated it if they just left The Whole Nine Yards alone if they really felt like this one had a chance for a great comedy.<br><br>Jimmy has changed from this tough guy hit man to a Martha Stuart and Jill is not happy with it. Oz and Cynthia are in a quiet life in hiding from the gangsters. Lazlo is out of prison and wants revenge, so he \"kidnaps\" Cynthia and now Jimmy, Jill, and Oz get together to save her only to find out there are more twists and turns than they expected. But Jimmy has to go deep back into his roots of being the tough guy, not Mr. Clean.<br><br>Now don't get me wrong, The Whole Ten Yards has a few laughs here and there, but for the most part I just actually felt bad for Bruce Willis with the silly attempt to be a soft like Martha Stuart type of guy, he's just such a great tough guy, it's hard to see him as anything else. Matthew Perry wasn't as fun as he was in the first movie and neither was Amanda, it just seems like everyone lost their magic and chemistry with each other in this film. I really wish that I loved this film, but I'm having a hard time, I'm sorry.<br><br>4/10","user":"Smells_Like_Cheese","rank":[22,28]}]