[{"title":"'Volcano High' with added emotion","rating":7,"date":"5 June 2005","review":"Version: Korean audio, English subtitles.<br><br>I enjoy watching random Korean movies. I don't do it very often, but when I do, I come across such awesome movies like 'Volcano High'. Did I say 'Volcano High'? I meant 'My Boss, My Hero'.<br><br>Young gang leader Gye Do-shik (Jun-ho Jeong) finds that other Korean mob leaders don't take him seriously because he did not complete high school. Do-shik is then ordered by his boss to pose as a student and complete high school. He finds his new school rife with corruption, and he has the power to save his new friends but he won't stop in for fear of not finishing high school again.<br><br>'My Boss My Hero' is part action movie, part comedy, and part 'Volcano High' with a serious tone and more emotion. I watched this with some friends and they didn't agree with me comparing it to 'Volcano High' but there are elements of 'My Boss My Hero' that remind me of 'Volcano High'. Both have a similar story - although 'Volcano High' is much more outlandish - and both are spoofs on the action genre, even if 'My Boss, My Hero' frequently switches between fun and serious.<br><br>I can't really comment on the current state of the Korean education system, but considering 'My Boss, My Hero' and 'Volcano High', there must be a message in there between all the martial arts. When 'My Boss, My Hero' wants to be funny, it is very funny. As a spoof on action movies, it is entertaining, and the serious action scenes were compelling enough to keep me watching.<br><br>'My Boss, My Hero' is an entertaining action / comedy. It should appeal to fans of 'Volcano High' and maybe even 'Arahan', or Korean movie fans in general - 7/10","user":"AwesomeWolf","rank":[3,6]},{"title":"Jopok=Yakuza=Mafia=(God)Father=Teacher?","rating":6,"date":"22 May 2002","review":"Another fun flick about Korean gangster's fictitious actions. \"Jopok\" is a Korean neologism, literally meaning \"Organized gangster group\". It used to be \"Gondal\" or \"Hyupgaek\" for self-esteem, sometimes, however,  called \"Ggangpae\" for despisal. Jopok is now identical to Yakuza of Japan and Triad of China. They do as all other gangsters do- brawl for territory, manage some adult business, and administer all kinds of under-table money. However, other than these two different asian organized gangster group, Jopok is more loosely based on blood-tie and has more naive code of honor, at least in movies.<br><br>This movie has added one special thing to this everyday life of Jopoks - a mandatory requirement of an educational certificate. One promising head of Jopok family has succeeded in acquiring a nugget of profitable territory, but his crew members cast a jealousy on his achievement with a good excuse of his uneducatedness. His senior boss orders him to enlist in a secondary school and all hilariousness begins here.<br><br>Director did try to reveal some serious problems in education system of Korea- corrupt principal, extracting and torturing among students, sexual harassment, employment of minors in adult business, even abuse of teachers by students and their parents. Our hero just tried to stay calm to get a certificate, but he finally uses his own skills to solve these rooted problems.<br><br>The totally untolerable in this movie is that the method of solving problem is another upgraded version of the same problem. Jopok's way of life is not taught in school, but an acquired modus vivendi, extremely far from the moral code of traditional education. Taking a metaphor that Jopok boss equals teacher equals father is totally nonsense!! However, the main point of this movie is not a matter of sensibility but that of non-sense, and it is why this movie is regarded as one of most successful comedies of current trendy genre of Korean gangster.","user":"luke-35","rank":[2,8]}]