[{"title":"Secret Window","rating":8,"date":"8 March 2020","review":"This movie should be paying huge debts to much better psychological thrillers like PSYCHO or MISERY (coincidentally, the latter is another Stephen King book adaptation), but nevertheless, SECRET WINDOW is creepy, disturbing and haunting. Not to mention it benefits from a strong performance from Johnny Depp.","user":"MR_Heraclius","rank":[40,46]},{"title":"A Writer With Problems","rating":31,"date":"31 January 2009","review":"Johnny Depp plays Mort Rainey, a writer with wife problems. Mort secludes himself in a wilderness cabin to write. Soon, he gets a visit from a strange Southern mountain man named John Shooter (John Turturro). Throughout most of the plot, Mort tries to deal with this threatening man who won't go away, and confronts his wife and her new lover.<br><br>\"Secret Window\" is a moody, Hitchcockian thriller with a major story twist. Pacing is slow. There's lots of waiting for something to happen, which enhances a sense of foreboding. And Depp's performance is terrific.<br><br>With hair that looks like a mop, and a delightfully slovenly appearance, Mort mopes around the cabin, talks to his nearly blind dog, and tries to placate Mr. Shooter. He also spends a lot of time on the phone, mostly with Shooter and with his disconsolate wife.<br><br>Casting and acting are fine. Production design is great; love that cabin where Mort lives. Camera work, lighting, special effects, CGI, and editing are all quite good.<br><br>Although I liked the film's twist, some viewers will be disappointed with it, perhaps because the underlying idea is not terribly original. The risk for the director is that the entire story hinges on this one twist. If a viewer discovers the twist ahead of time, or finds it unsatisfying for any reason, the viewer likely will render a negative verdict on the entire film.<br><br>My only serious complaint with the film is that, at times, the plot discards logic so as to maximize gratuitous violence, the result no doubt of the film's source material, a horror story by Stephen King.<br><br>Overall, \"Secret Window\" is a generally fine thriller, enhanced especially by the splendid performance of Johnny Depp. Just be aware that one's reaction to this film likely will depend on one's perception of the story's major plot twist.","user":"Lechuguilla","rank":[44,54]},{"title":"More to appreciate than some people realize.","rating":8,"date":"8 June 2005","review":"This is one of the few movies that you will either love or hate. There is no middle ground. The people that have slammed this movie must not have understood a lot of the symbolism. Seriously, some of it is obvious but a lot of it would require you listen to the Director's commentary to catch.<br><br>While aspects of the story are predictable, you will never see the last couple minutes coming. Koepp made a film that HE believed in, with a finale that may not sit well with the general public. For this, I applaud him.<br><br>As I've noted on the message board, Koepp borrowed a page from Hitchcock's book and relied on our imagination to fill in the gaps during the violent sequences. Some of it is shown but certainly not all. Without question this film tested the limits of the PG-13 rating but Koepp did not take the easy way out and turn this film into an R-rated gore fest. This film proves that PG-13 films can be gritty and poignant.<br><br>Depp's performance is amazing, as can be expected. The cinematography is awesome. Watch this film with an open mind, taking to heart each character's motivations.<br><br>If you've already seen the film I would strongly suggest you watch the Featurettes and listen to the Director's commentary on the DVD. You may find this to be quite an eye opener.<br><br>My Score: 8/10 stars","user":"rjsuno","rank":[171,238]}]