[{"title":"Unusual. That's why it's great.","rating":10,"date":"13 September 2006","review":"wow, a serial-killer movie WITHOUT blood and action and wild chase sequences and stuff like this.<br><br>People who are used to fast Hollywood Movies certainly won't be satisfied with this movie. It's really unusual, as the novel is. It's generally difficult to convey something like a SMELL in a book or a movie, and it's also difficult to create a satisfying adaption of a novel. So my personal opinion is that The Parfume Movie is one of the few good adaptations, because it eagerly tries to convey the complicated world of smells and the world of Grenouille and also achieves it in many ways. There are of course some parts missing or changed if you compare novel and movie, but that is always the case with adaptations.<br><br>I saw the movie one hour ago and have just read some comments. Some of them are \"disappointed\" or \"boooring\", but most of these opinions are really not well founded, so I couldn't make out what EXACTLY was so boring and disappointing... However, I'll keep on dwelling in the magic of the movie, looking forward to other more positive comments...","user":"matheistin","rank":[374,483]},{"title":"The critics are wrong - Brilliant!","rating":8,"date":"13 September 2006","review":"With \"The Perfume\" it's like with any blockbuster movie: if the critics praise it, it's horrible - if the critics hate it, it's brilliant.<br><br>I had the chance to watch a preview of \"The Perfume\" tonight and I was very surprised: this movie is really good! Okay, it can't actually make you smell all the scents and odours, but the images and the music allow you to experience the atmosphere and the emotions Grenouille is feeling when he takes in the scents of his environment. You couldn't have done this much better without the use of real scents at theatres.<br><br>Although much of the story is told by a narrative voice (mostly quotes from the novel), the movie is still thrilling and exciting all the way. It's a very good adaption of Süskind's novel, sticking to the original plot concerning the major events, leaving away unnecessary subplots (although it's a pity that funny \"lethal gas\"-plot was cut out!) and shortening long passages. The result is well-constructed movie that is worth seeing.<br><br>The actors, especially Whishaw who plays Grenouille, have done a very good job. Like in the novel, Grenouille is an ambivalent character and you never know whether to love him for his genius talent or to hate him for his cruel murders. Whishaw's half-crazy, scary gaze made me shiver. Dustin Hoffman as old and unsuccessful parfumeur Baldini was very convincing... I loved the way he talks to Grenouille arrogantly although he recognizes how much more talent the young man has. Baldini is always good for a laugh.<br><br>The only thing to criticize is that the movie is not as brutal as the novel. I think they wanted to avoid the FSK 16 rating and so didn't show much violence, which in my opinion would have been necessary if you wanted the movie to have the same shocking impact on the audience as the novel. For example I was really shocked by the end of the novel - in the movie you hardly see what happens.<br><br>However, it's really a thrilling story visualized excellently - go to the movies and watch \"The Perfume\"! You won't be disappointed.","user":"Naurya","rank":[497,647]},{"title":"A sensual experience","rating":9,"date":"14 September 2006","review":"To my dismay this movie has been accused of dealing with the addressed subjects only on the surface and just trying to shock the audience with extreme imagery. I strongly have to disagree with that. \"Das Parfum\" may be a lot of things but shocking sure isn't one of them. Of course it is visually overwhelming and not only with pictures of pretty flowers and sounds of the wind softly shaking the trees on a warm summer night but what is this movie, if not a piece about the sensuality of the human being? Yes, it is about smells but smelling is just simply not one of the things you can experience while sitting in a movie theatre. This motion picture however comes very close to it. We see close-ups on maggots crawling around and fish getting their heads chopped of but also human bodies in all their perfection and people declaring their honest love for one another. It might be impossible to make the audience fully understand the world in which Jean-Baptiste Grenouille lives but it does manage to create a similar vibe that brings us close to what Grenouille \"feels\" when he smells. Tom Tykwer beautifully achieves to always put the audience in the right mood, with the help of an amazing soundtrack and great camera work.<br><br>One could criticize that Ben Wishaw is too good looking for the part but we have to keep in mind that this story is supposed to be about the character of Grenouille and the way he himself sees his live. Since to him, the smell is the soul of every being, his appearance does not matter to him. So we might as well thank Tom Tykwer for casting an actor who is pretty decent to look at for two and half hours.<br><br>Please watch this movie without any prejudices. Open your mind to images and sounds and try to imagine what your feeling could \"smell\" like. And even if that does not work you can still just enjoy a beautifully told story. Either way, you will be touched.","user":"Spinelli_86","rank":[374,487]}]