[{"title":"Great documentary - but it hurts","rating":10,"date":"6 April 2005","review":"This is probably the first documentary about Metallica that didn't make you feel good. All of the older documentaries show a band that was personable and fun-loving, rocking like no one else can. They showed us the Metallica we were proud to call ourselves fans of. But with Some Kind of Monster , we see a band full of weather-beaten rock stars, burned out (an understatement), tired, desperate, and aggravated. It broke my heart to watch this, but it was a damn fine documentary.<br><br>Frankly, I'm glad this was released. Because the average semi-informed fan of Metallica (like myself), has only seen the headlines over the past ten years - which served to make the band look like they were becoming complete pricks. I love Metallica. But the wall of negative stuff that was thrown at us in the past decade has tainted our view of the band. This documentary straightens some of it out. While I don't believe that was the goal of the film, it is a fortunate side-effect.<br><br>I know the Metallica of the 80's is gone - beer flying, 9-minute epic metal songs, and the long hair - but hopefully, our favorite rockers still have the fire within to bring us a few more great albums. Metallica showed the world that heavy metal (and I mean *heavy*) didn't have to use gimmicks and make-up to be mainstream. All it needed was the right attitude and talented musicians to play it. I've seen them live nearly 20 times. Nobody can do it like Metallica. Nobody.","user":"Jeddia","rank":[75,86]},{"title":"Definitely a must see for anyone with only a casual interest in Rock music","rating":9,"date":"23 March 2005","review":"I don't know how they do it, but although Metallica lost me as a fan many years ago (sometime in the mid 90's), they still manage to release DVDs that are totally intriguing. \"Cunning Stunts\" was an intense concert movie that let you feel the energy of a Metallica gig, where even songs from \"Load\" and \"ReLoad\" sounded good. Now, \"Some Kind Of Monster\" is something even more special. Really special. As far as rock films go, this one is right up there with \"The Kids Are Alright\" and \"The Last Waltz\".<br><br>Joe Berlinger &amp; Bruce Sinofsky are always there in time to catch the most important facial expressions, quotes and actions. The movie almost runs too perfectly, as if the whole thing had been scripted. The emotions of the band members and those around them seem so genuine, though, that it's hard to have any doubts about the movie's authenticity. It must have been a terrible stressing for the band - especially in a situation like this - to have cameras around them all the time. Throughout the whole movie you feel like you're in the room with one of the biggest rock bands on the planet and the cool thing is, that you really get a look behind the image, behind that Rock 'N' Roll dream. What you find are three guys that are just as unsure about themselves, their friendship and their career as everybody else is. Hetfield, Hammett and Ulrich try to be honest throughout the whole documentary and everybody comes across as a more or less normal person (Ulrich and his ego are more than just a bit annoying, though, and it's sad to see that the band still doesn't seem to have the tiniest bit of respect for their former bandmate Jason Newstedt, who had to put up with a lot of crap for almost 15 years). A whiny appearance by former band member/Megadeth frontman Dave Mustaine sticks out as the most moving/funniest moment. It really must suck to feel like he does, regretting everyday that you've been kicked out of one of the biggest bands on earth. Respect for such an honest statement in front of the cameras, though.<br><br>\"Some Kind Of Monster\" entertains for more than 120 minutes (and there's more on the DVD) without ever getting boring. The weird thing about this documentary is, that it's never about the music, but more about the process of a band recording itself. Whoever said that this one is a must see for Metallica fans, documentary fans and anyone in between got it right. It's more than your usual VH1 special. This one REALLY takes a look \"behind the music\" and a very exciting one at that.","user":"Superunknovvn","rank":[39,46]},{"title":"The Monster lives","rating":9,"date":"1 September 2004","review":"First of all, let me say I'm a Metallica fan so this review is unevitably biased. But then again, what review isn't? We all know Metallica are great business men, so the first question that arises is: is this movie a marketing tool? Even though I'm sure the movie will be a commercial success, my answer to the question is no. <br><br>Metallica's record company wanted the movie to accompany Metallica's 2003 release St. Anger as a weekly series of 30 minute reality TV to get the word out about the album. Metallica not only rejected that idea, but even decided to buy out the record company and release this a year later as a movie instead. We can only thank them for it.<br><br>This movie is certainly not a commercial for Metallica. We get to see the ugly side of Metallica. And it's ugly alright. We see Lars calling James a dick, shouting 'fuck' right in his face and getting drunk while selling his millions of dollars art collection. We see James yelling at Lars, slamming the door, checking in for rehab and after that demanding everyone to only work from 12 to 4. We see Kirk being a sissy the entire movie.<br><br>The title of the movie refers to James; he explains how Metallica has been a beast to him over the years. But Metallica has undoubtedly been a beast to others as well. Dave Mustaine is one of the most successful musicians in heavy metal with his band Megadeth, but apparently is still haunted by him being fired from Metallica. Nevertheless, the movie is ultimately about James' 'coming of age', changing from an angry alcoholic to a man who has managed to balance his personal life with the life in Metallica.<br><br>I have one beef with the movie. Around the end Lars says Metallica have proved that it's possible to make an angry record through positive energy. While I believe him when he says that, I do have to say I hardly saw any of that energy in the movie. In fact, it's a small miracle they managed to finish the album at all.<br><br>Even though not everyone is a fan of Metallica, I can recommend everyone to see this movie. See, this movie is not about the music. It's about people. People who struggle with themselves, with each other and with the outside world. It's also a unique look inside the workings (and non-workings) of a world class band and into the lifestyles of the rich and famous. This documentary is a landmark that upstages the album which creation it was originally supposed to document.","user":"ikremnietvoorfrankdeboer","rank":[30,35]}]