[{"title":"For those who rather see the characters waxing philosophical for an hour....","rating":20,"date":"20 September 2004","review":"Ghost in the Shell 2: Innocence. I went to this movie worried that it would end up like just about every Peter Framptom Album after Frampton Comes Alive; they were all pitiful albums only because Frampton comes alive did not leave much room for improvement. The original Ghost in The Shell is a classic. It was a good action film that had some deep undertones. Well made to say the least, full of memorable characters. <br><br>Ghost in the Shell 2 was so different that there could be no comparison. As opposed to an Action film with deep undercurrents, this is a philosophical film that occasionally had some action sequences. The basic plot is very simple: Android created for pleasure killing their owners. Cyborg cops trying to get to the bottom of these strange crimes. The cops, section nine operatives Batou and Togusa spend more time quoting everything from Bazooka Joe to Milton as long as it serves a purpose. This is not Ghost in the Shell. This is a Mamorou Oshii original, with his own ideas and philosophies not being bound by the original manga. <br><br>I venture to say that I actually prefer Innocence to the first one, because it struck chords in me the first one did not. Somebody who has a different outlook on everything, however, would disagree. If you have seen the first one, remember how there is more or less a quest for humanity? THis one takes an opposite spin on things. As well as takes a look at how humans feel this need to immortalize their own image. <br><br>The animation was enough to prove that traditional and computer animation could work together and create a beautiful picture. However, the underwater and in air scenes seemed to rely too heavily on the computers, which then completely made up the world. The world itself was not the world I remember from Ghost in the Shell. THis was a whole new futuristic world as opposed to a slightly more advanced modern setting. This film also focused a lot on the relationship between Batou and the now 'missing' Kusanagi.<br><br>This film seemed to be lost on many. There are many scenes of complete silence, which are intended as 'breathing time' and and other points really to build tension. The film also slows down at a few points so that the audience can absorb the scenery, and gives extra time for the audience to catch the symbolism. The film ended with so many angry groans. It would seen that the film was lost upon those who wanted to see a sequel to Ghost in the Shell with the same themes and ideas. The only similarity to the first film would be that most of the story is superficial, and what the film is really about is the deeper meanings.<br><br>This was an excellent film, and though it can be seen as superior, it will never be as well known and recognized as the first film. Though this is not just a sequel: This is a whole new Ghost in the Shell altogether.<br><br>**** out of ****","user":"Newski_the_Hippie","rank":[134,154]},{"title":"Visually Stunning, Brain Recommended But Not Required","rating":10,"date":"26 September 2004","review":"On the same page, this movie is called both \"Intellectually Weak,\" and \"In love with its own intelligence\" by different IMDb users. Clearly, that alone makes this film worth your time and worth forming your own opinion about.<br><br>The thing is, this is not a stupid film by any means. 'Visually stunning,' it is constantly called, but it's not just that: It's an assault on the senses (in a good way), both visually and aurally. The sound is incredible, the images stick with you. Even a simple, seemingly underthought image like the final two shots of the movie will stick with you long after the closing credits roll.<br><br>But how is the story? I haven't seen the original in years, but this one held my attention, and kept my brain engaged. I remember not liking the first one when I first saw it (too many scenes of nothing moving, while we listened to voice-over), but I give this one an enthusiastic thumbs up, plus a wink and a smile. It FEELS like the middle chapter in a story... there is too much left unresolved, and while seeing the first one isn't necessary to understanding this one, there ARE many references the original \"Ghost in the Shell.\" It's not so much a continuation of the story, as it is a continuation of the characters. Which I think is the better call.<br><br>Constant quotes from literature is not a sign of intellectual weakness, I don't think. People accuse the movie of not having a brain of its own, but I think any movie that engages the brain of its audience needn't make apologies. This one remains interesting on all levels; I just hope it doesn't take them another nine years to produce part three.<br><br>10/10","user":"Quicksand","rank":[82,99]},{"title":"Strong sequel that stands on its own","rating":9,"date":"2 January 2005","review":"I agree with an earlier reviewer that both hardcore Oshii fans and narrow-minded American viewers are missing the point by not viewing this movie on its own terms. In many ways, it's more thoroughly conceived, and less action-justified (more thoughtful) than Ghost in the Shell. For me, it progressed naturally from its predecessor: Where Ghost in the Shell asks questions about the nature of human individuality, Innocence asks the next set of questions, about human existence. And it asks them in ways so much more directly pertinent to our own lives than utterly fantastic treatments like the Matrix films and silly diversions like The Butterfly Effect.<br><br>The ideas of the story are genuinely original, and thoroughly conceived. I don't think I've ever seen a science fiction film that was as true to the real spirit of the genre as this pair; Japan in general seems to take science fiction much more seriously than any western film-culture, and so out of Japan we get real, serious attempts to tell science-fictional stories, filled with real ideas and real characters, instead of the Bat-Durstonized monstrosities we get in the west.<br><br>For me, the integration of 2D and 3D elements was jarring; but the story stands on its ideas and the strength of its plot.","user":"escoles","rank":[86,107]}]