[{"title":"Lighten up, really","rating":7,"date":"12 February 2011","review":"Cut the pretentious crud. This film is obviously intended to entertain a younger audience, and it does a good job at doing that, while somewhat tactfully putting in some jokes for the parents. No, it's not spectacular. If you watch this movie expecting something \"Grade A\", you're not going to get much out of it.<br><br>The plot: generic, predictable. But obviously so, considering it's called \"Gnomeo and Juliet\".<br><br>The cast is an oddball compilation of respectable actors, with the exception of the obscure addition of Ozzy. But what is really keeping this movie going is the cuteness of it. That is the selling point, and what makes it most appealing. If you go into this movie expecting something more, you will be left disappointed. So I suggested you loosen up, look for a laugh, and you'll enjoy it more. It's not a bad film.","user":"Fang_33","rank":[74,100]},{"title":"My boys LOVED it!!!","rating":8,"date":"10 February 2011","review":"I took my twins (age 5) to see this today and they were THRILLED to bits!! I disagree with the reviewer that says it's a \"girls'\" movie! My Hot Wheels/Bionicle loving sons, loved it and they didn't think it was girly one bit and neither did I!<br><br>I also did not think it was a Toy Story rip off as there have been a ton of movies featuring toys that come alive long before Toy Story anyway. Yes, garden gnomes and decorations come to life but that's were the similarity between the two ends.<br><br>I did not go in expecting to see a cartoon version of Romeo and Juliet so I was not disappointed one bit and thankfully, this story does not share the tragic end of the original tale. I did like the characters quite a bit, I LOVED how the gnomes were fragile, I loved the clay clinging sounds they made, how realistic the textures were.. it did not feel like a \"dime a dozen\" animation at all!! It was bright, it had a solid plot, and it was going somewhere (unlike let's say, Alpha and Omega or Happy Feet).<br><br>My boys were begging as soon as the titles rolled to watch it again so we just might be returning to the movie theater with some friends this weekend. I wouldn't mind seeing it myself and I was glad we did go see it because after I read the previous review, I had my doubts if it was going to be any good but it was!!! My boys \"got it\" much better than say, Shrek... so it will appeal to a younger crowd as well in my opinion...","user":"tina-175","rank":[41,53]},{"title":"Funny as!","rating":8,"date":"25 February 2011","review":"Okay, so I bought myself a pack of 10 movie-tickets from Hoyts and thought \"what the heck\" lets see a movie with the family. So, we went for Gnomeo and Juliet and we really, really enjoyed it. Yes, the movie is predictable from start to finish, but I say: \"So what!\" It's supposed to be a family/kids movie and we all know that this movie is not going to end like the real Romeo and Juliet. The characters are funny, the voices are great, the flamingo(s) even better. The Terrafirmanator is cool - I would like to order three and have them delivered within the next 5 minutes. Mixing in the music of good old Sir Elton John makes the movie even better - it becomes so English! Mmmm... the end-scene did remind me of Shrek a lot (just a lot softer, which makes sense them being a bunch of garden gnomes - they are quite fragile), but it's still very, very positive. Yeah, I believe Gnomeo and Juliet is a must see for the family - you won't regret it. Oh, please observe the sound when the gnomes happen to touch each other - I think the sound artists have done a fantastic job!","user":"Mork_the_Borg","rank":[30,40]}]