[{"title":"Very pleasant surprise","rating":8,"date":"13 February 2006","review":"Here I am, taking my 2 year old to a movie expecting to be bored stiff. Much to my surprise, my 8 year old also enjoyed it, and my 2 year old sat enraptured and watched the entire movie without a peep. And then talked non-stop about it for the next couple days. That is enough for a positive rating, but I also found myself enjoying this cute movie. Usually for that to happen the movie makers have to put in scenes just for the parents that the kids don't get at all, not here, I found myself chuckling at the same things my daughter did. Just simple innocent monkey business and a bumbling Will Ferrel, it needs no more. I even thought the additions by Jack Lullaby Johnson added to the movie, not just to put the parents asleep. We will definitely end up with this movie on our shelves for the kids, and even the parents can watch it one or 2 more times without going out of our minds with the typical substitute stupid for cute fare that usually passes for children movies.","user":"manicgecko","rank":[65,71]},{"title":"Amazing","rating":10,"date":"13 February 2006","review":"My eight-year-old son said to me on the way out \"Mom, that was the best movie I've ever seen\".<br><br>Myself? I had my jaw dropped, tears in my eyes, and my spirits were soaring.<br><br>Finally - a movie you can take your kids to see with no \"adult humor\" that may or may not fly over your kids' heads. No farting or potty humor. A TRUE children's movie that does beautiful justice to the beloved books.<br><br>Outstanding traditional animation. Loved all the primary colors! Great soundtrack - just went out and bought it today. I am taking my kids to see this one in the theater again (a first for me), and we can't wait for it to come out on DVD.<br><br>Thanks Ron Howard - you have a winner here.","user":"kathryn-behm","rank":[51,57]},{"title":"A sure bet for preschoolers and kids at heart.","rating":9,"date":"20 February 2006","review":"Anymore animated movies are trying to appeal to adult audiences with crude humor, and double meanings. If I wanted to see an adult movie, I would get a babysitter. This is a movie FOR CHILDREN. I took my 2 and 3 year old girls to see it. It is a visually stunning rendering of the classic children's books. George is wholesome, endearing, and charming. The whimsical animation style breathes life to the character we remember fondly from our youth. He exudes youthful exuberance and energy and mischief.<br><br>It is a true G rated movie. I would say it reminds me of Classic Disney but even Cinderella had its wicked stepmother and Sleeping Beauty definitely had its scary moments. There is nothing here to frighten even the smallest children. Only delight them!","user":"alane8500","rank":[31,35]}]