[{"title":"Surprisingly Good","rating":9,"date":"9 February 2005","review":"What - a Will Smith movie with nothing blowing up? I was all prepared to hate this movie. I mean c'mon, a chick flick with Will Smith? It seems Will Smith can only play one character - himself - but in this one he tones that down and comes across as a real human being.<br><br>I was so surprised by this movie. I ended up laughing through the whole thing and came to care for and relate to all the characters.<br><br>There was NOTHING about racial stereotypes. It wasn't about a black guy teaching a white guy to dance at all. It was about a bunch of characters who legitimately grow from the first scene to the last.<br><br>Take you girlfriend and go!","user":"rossjharvey","rank":[294,366]},{"title":"Pleasantly surprised...","rating":3,"date":"3 February 2005","review":"I saw this movie screened last night, and you know what? I liked it. For the most part, it's a by the numbers 'chick flick', but makes no pretensions to be more than that, and in fact, is very good for what it is.<br><br>The easy thing to do would be to take potshots at this film; throw out things like 'Fresh Prince', 'getting jiggy with it', and even throw around the whole 'black dude making a white dude cool' angle; but that's too easy isn't it? Like shooting fish in a barrel.<br><br>No, this isn't a Wes Anderson film. The humor is rather broad, though much it very funny. Of course you won't see it up for an Oscar (what a tired joke that is); nor does it contain Quientin Tarantion-esquire dialogue or groundbreaking visuals.<br><br>But taken for what it is, a romantic comedy, it really is very good. Great chemistry between all the leads. Eve Mendes is gorgeous. And Kevin James steals nearly every scene he's in. It gets a bit sappy towards the end (don't all mainstream romantic comedies though?), but if you're looking for a above average date movie with more than a few belly laughs, this is your film.<br><br>A solid B+.","user":"botner","rank":[209,262]},{"title":"Very Entertaining, Funny, Pretty Original Story","rating":8,"date":"12 February 2005","review":"This was a movie that, at the end, I thought \"Now that was an enjoyable 2 hours!\" I hate spending around $20 (not including baby-sitting $$) for my husband and myself to have that \"It was OK\" feeling.<br><br>I think I like Will Smith better as a comedic actor than an action hero. He was well cast in this. His character was very likable, as was Kevin James'. <br><br>There were several laugh out loud scenes. It's also a romantic movie, so guys, if you want to impress the lady in your life, take her to this. Women will like it as much as any chick-flick, but I wouldn't categorize this as one. There is plenty of guy humor in it for men to enjoy. I think that's one of the reasons why this movie is so perfect as a date movie. It has romance AND slapstick. I don't usually like slapstick that much, but it wasn't overdone and I can't think of any those scenes that didn't deliver laughs.<br><br>I definitely recommend this movie. The first thing my husband said to me after it was over was \"I want to see it again!\"","user":"ltclark","rank":[211,268]}]