[{"title":"A 'black' film with a soul. It can be done","rating":10,"date":"10 July 2004","review":"When I first saw the plot and cast for this movie I was filled with little hope that this film would be any more than a stereotypical look at black/urban culture with the characters rhyming words for supposed comic effect ad the scriptwriter fitting a screenplay around the jokes. It us easy to forget that the film's protagonist, Ice Cube (who gave a fine performance) had just come off making the awful 'All About the Benjamins' which fell into the trap of so many of these comedies based around black people. Added to the fact that 'Barbershop' was released when there had been a spate of these sub-standard pictures such as 'How High', Friday After Next' and 'State Property', you can understand why I approached this movie with no expectations.<br><br>Thankfully I was proved wrong as 'Barbershop' followed a simple structure to work. It had solid direction, a commendable screenplay, was well acted but more important than any of that, it was a story worth telling and that is the one thing that good films have in common. However, this does not mean that this movie followed the conventional ways of Hollywood and 'sold out' to appeal to a mass audience. If anything pleased me most about the film it was the fact that it retained a true sense of representing the black community and credit for this goes to the high standards of dialogue and acting. People who live in the suburbs can watch in the knowledge that they're getting a window into another culture, while people in urban communities can watch this with a comforting sense of familiarity. Another reason for this is that the screenplay is informed enough to not 'pigeon hole'. The characters are well rounded, with both positive and negative traits and the movie is not surrounded by guns,single mothers and drugs. This is not not to say these issues are ignored, as they are connected with one the film's major plot strands but despite the mass media sterotype (to which not all black people are unaccountable) the 'ghettos' of America are primarily filled with honest, hard-working people who just trying to make the best of an unenviable situation. While previous urban films have made a point of blaming 'whitey' and 'the man' for the troubling issues surrounding black people, 'Barbershop' looks closer to home and encourages black people to take responsibility for themselves and to break away from nature of 'frontin' that is slowly paralysing urban communities. One of the films best quotes is 'Dont buy yourself a Benz when your living with your mama! And black people; please can we be on time for something other than free before 10 at the club'. I think this is a wonderful statement and it encourages black people to reject the notion of style over content as that is what the film does as well.<br><br>Added to this the well-rounded nature of the film is a diatribe from Cedric The Entertainer (who's performance is almost as hilarious as his stand-up act) about black icons such as Rosa Parks, Jesse Jackson and Martin Luther King. This is probably the most provocative section of the film and initially made me question the validity of these icons but after reflection, it made me realized that even Martin Luther King was a human being with flaws but that doesn't take away from his legacy. Regardless what's been said about Jesse Jackson he's still the first black man to run for President and nothing will ever take that away from him.<br><br>While Cedric the Entertainer took most of the acting plaudits, this was a great ensemble piece that was well acted all round. My only gripe is that why can't other films of this nature stay true to black culture but also have a cinematic soul","user":"shanethomas190","rank":[21,24]},{"title":"One Funny Movie","rating":1,"date":"1 April 2003","review":"This is definitely one great film.  This film pretty much tells it like it really is in most barbershops in predominantly African-American neighborhoods.  I remember what it was like when I would go with my dad to get my hair cut and it was pretty much like it is in the film.  The barbershop I went to  was the gathering for African-American men of all ages to not only socialize, but to gossip as well.<br><br>Also, about the controversy.  I see no harm in what Cedric the Entertainer's character, Eddie, said.  If some people were offended by it they really should go to a real barbershop and find out what people really say, especially Jesse Jackson himself.","user":"Sargebri","rank":[21,26]},{"title":"A low-key comedy-drama worth checking out.","rating":7,"date":"26 January 2003","review":"I thought this was a pretty decent flick. I laughed out loud at least twice, which is OK, because this film is not really supposed to be hilarious, just sardonic, mostly. Cedric the Entertainer was good, but not truly believable as an elderly man. Ice Cube turned in a quite good performance. In some of his previous films, I had thought he was pretty good, but rather one-dimensional. (\"Anaconda\" \"Three Kings\") Here, he definitely extends his acting range enough to be taken seriously. And wherever the one-named \"Eve\" came from, she nailed her character. There's a lot more to this movie than the controversial lines from Eddie (Cedric). It was interesting to see some black characters be aware of, and concerned about, the pathologies in the black community. But I guess this is spoken of only in barbershops, or elsewhere away from whites. Overall, definitely worth a look. Grade: B+","user":"smatysia","rank":[6,6]}]