[{"title":"Very well shot drama with touches of black humor","rating":26,"date":"26 February 2005","review":"The movie is very good, very well shot and the director deserves praise for his work. Kaye gives a memorable performance. The story is good, with a strong melodramatic theme, as the film is not so much about Djs than about handicapped hearing impaired people. It is sad and sweet at moments with very moving moments. Some touches of black humor, very British, a bit of swearing and two macho crass jokes don't spoil the overall feeling of despair and total compassion you feel for the human beings portrayed. The music is good not so much the dance music but the score. The picture is superb knowing it was shot on digital. It's a low budget movie which looks like a 10 million dollar film. And a meaningful film. Not to be missed. A true achievement.","user":"Marion88","rank":[77,94]},{"title":"It's All Gone Pretty Well","rating":7,"date":"8 June 2005","review":"Considering the beating this film got in some reviews, I went to see it the other day, not expecting much from it. Surprisingly though, the film was pretty damn good! Paul Kaye (some of you will remember his often hilarious Dennis Pennis taking the mickey out of celebrities at film premiers) plays Frankie Wilde a mega famous DJ who's bringing dance music to Ibiza. All's going well for Frankie, he's rich, successful, has a wife and a string of sexy ladies on the side. All this goes down the drain when Frankie starts to lose his hearing, which of course, is not that good for a famous DJ. Kaye delivers some funny, upbeat lines throughout the film and so long as you don't mind his gurning for laughs, you'll enjoy the flick. Despite his arrogance and dirty coke and drink habits you find yourself cheering Frankie along and when he meets Spanish lip-reader Penelope you almost want him to get his hearing back for good. Although a gag-fest, filled with dirty humour and teenage-boy jokes, It's All Gone Pete Tong is a funny, witty film which will happily fill an hour or two in the coming summer months.","user":"stereoplaysjunk","rank":[19,21]},{"title":"Pete Tong premiered at Aspen fest!","rating":10,"date":"14 February 2005","review":"This amazing movie just won the grand prize at this weekend's US Comedy Arts Festival and it totally deserved it! I normally would have written this movie off without ever seeing it because I figured I'd hate it since I'm not into the DJ thing, but the audience in attendance, myself included, at the two screenings were floored! I even went back the second night to see it again and Ben Stiller had volunteered to introduce because he loved it so much and wanted to give it some extra attention. I think they said it's coming to theaters around April but I'm not sure. Anyway, you MUST go see it. Paul Kaye (he won best actor for the film, too) was supposed to be there but I never did see him. Too bad... This film wouldn't have been the same without his spot-on portrayal of DJ Frankie Wilde and I'd like to have seen his acceptance speech.","user":"vonclap","rank":[57,76]}]