[{"title":"Ah, Biker Boyz. Where to start...","rating":30,"date":"30 May 2004","review":"Well, to start off, I have to say that Biker Boyz isn't a good movie. However, it is better than the other recent bike movie, Torque, if only because it tries to do something with itself.  But it fails none the less, perhaps for being too ambitious.  The bike crowd watches the movie hoping to see realism and some good racing. Instead they get straight-shot drag style races, which in real life involve little to no actual talent on a machine. Also, they'll be racing 160 mph one minute, and dead stopped the next.  It takes some time to come down from speeds like that.  The movie also frequently ignores the force of wind that would be present at high speeds, with the racers hardly tucked in at all.  The final race, much like many in Torque, takes place on a dirt road.  Apparently they aren't aware that these high end bikes are often called street fighters.<br><br>Despite all that, there's actually an effort to tell a story.  It's an admirable effort, but many of the parts just slow the movie down.  It's often a painfully slow movie. Odd, since it's about a bunch of guys that race at speeds in excess of 100 mph.  The story is a coming of age one, for both Kid and Smoke.  They are both forced to confront issues, and in the end reconcile them.  The biker clubs are set up to mirror, I think, a sort of community, and therefore Kid's efforts to rise in the clubs are supposed to represent his finding his place in society.  The pieces are there, they were just poorly assembled. Folks most likely were expecting a quick, guilty pleasure like the Fast and Furious movies, and instead got a slow movie with mediocre action sequences.<br><br>The acting isn't nearly as bad as most are saying. It's not Fishburne's finest moment but it's not like it stained his reputation or ability, just look at his fine work in Mystic River.  The writers made an effort to have three-dimensional characters.  For example, After Dog's dirty racing forces Kid to drop his bike at the track, he lends him his own bike to take on Smoke. Granted, it's for his own reasons, but it's not like he's the evil villain parody going \"mu-ah-ha-ha\" off in the corner.  I have to agree with another user that said it portrays black Americans in a positive way. They're not all stereotypes, they have their own personalities.  Smoke is confident, but level headed. Soul Train seems the stereotype, but we see a totally different side of him when we find he's a lawyer. <br><br>\nSo, it's not a good movie, but it makes an effort to be one, which counts for something.  For all it's lack of realism, it gets points for not having the absurd stunts that Torque did, like flipping a huge street bike (with a helicopter jet engine, mind you) mid air, and riding on top and through the passenger sections of moving trains.  Biker Boyz isn't good by any means, but it's not quite that bad.","user":"ParanoidAndroidMarvin","rank":[31,40]},{"title":"Clunky dialogue, MTV visuals and average performances rob it of the potential shown by the very occasional good moment","rating":4,"date":"4 August 2006","review":"Kid is the son of Tariq aka \"Slick Will\", engineer to Smoke, who is the leader of the Black Knights motorcycle group and a legend on the streets. When Tariq is killed in a motorcycle accident, Kid drops off the scene for six months but returns determined to become more than just a prospect. His ultimate aim is to challenge Smoke himself and make his mark by taking down the biggest dog there is but first he must go legit and set up his own motorcycle gang with friends Stuntman and Primo.<br><br>Opening with a really nice tracking shot (or series of shots, I'm not sure) this film had my interest early on but very quickly blew it. With an obvious and predictable establishing scene, the narrative arch is established and thus I began my weary trudge from start to finish, through countless music video scenes, unconvincing dialogue scenes and loads of motorcycles. It is very basic stuff and it never aspires to much. The characters are cut out of cardboard and the dialogue is awful, this might cut the mustard if the film was an out and out action film but it isn't. Instead it is supposed to be a character driven film and thus it is a big problem for it to not have characters or convincing dialogue. Sadly it is a mess in regards the writing and plotting and only the forgiving will find the material worth two hours of their time.<br><br>The action is pretty weak. I didn't think any of the races were exciting and although they are well done, all of them could have sorely used the emotions of the characters to feed into them. As it is the failure of the plot means that much of the film is lacking and feels rather pointless. Occasionally it hints at depth and humanity but the occasional spark is totally drowned out in a sea of noise. The music video goals of the film are met but personally I'm glad not to be in the demographic sector that is tricked into thinking that this makes for a good film.<br><br>The cast are mixed, containing people that I expected better from and people that deserve stuff like this. Fishburne may well have expected more from the film because at times you can see him reaching, sadly he cannot achieve the impossible and any glimmer of a good performance is swamped. Luke struggles from the start. He is pretty and charismatic here but he can't deliver emotion and understanding that isn't in the script and his narration is terrible. The support cast are roundly average with obvious performances from Jones, Hounsou, Fehr and others. Good is sexy but pretty vacant while I'm not sure why Bonet bothered to turn up for so little.<br><br>Overall then a fairly pointless film that shrugs off any character potential it may have had in favour of MTV visuals, clunky dialogue and mostly average performances at best. You can see the potential in the story but across several aspects the film fails to deliver this potential and just churns out a totally unnecessary film that doesn't deserve any of your time.","user":"bob the moo","rank":[11,13]},{"title":"Half-decent plot buried under a squidfest","rating":3,"date":"3 February 2003","review":"I'm sure there's a Greek tragedy or Shakespeare play with the same basic premise: Son aspires to be one of the great princes instead of a courtier, son loses father, son disappears, only to return as the heir apparent to the Prince's crown and all that....  such a plot has such promise.<br><br>But when you bury it under a bunch of expensive sportbikes, T&amp;A shots, and juvenile stunts... blech!<br><br>As a moviegoer, I thought this was barely worth the matinee price.  As a Shakespeare fan, I thought it overdone, washed out.  As a motorcyclist, I thought it shameful (Passengers in shorts, spaghetti-strap tops, and heels? Racing w/o helmets?  Stunting on a public freeway, in traffic, at night? These are NOT the role models you were looking for...)  I will point out that a FEW lines in the movie did hint to the dangers of riding, especially 'extreme' riding.  The crashes were definitely hopped up (not sure if a 500 lb superbike would sail spinning thru the air like a frisbee...) but no punches were pulled as to how badly you can get hurt on these things if you're not careful and FOCUSED.  And Fishbourne's character, although definitely the most bad-ass in the whole bunch, showed how far skill, finesse, and restraint will go beyond blind luck, guts, and adrenaline. That is to say, he was on top the whole time, even to the last frame.<br><br>With the budget this film had (pretty much, the bikes alone are each worth 20G's or more) they COULD have made something with more emotional impact, more story, and a LOT less gratuitous teenage hormone inducer.  So, if you see this movie, resist the impulse to go out and get a bike.  The real world ain't like this at all.  Riding like this in the real world will get someone (probably YOU) killed.","user":"dcnblues-2","rank":[11,13]}]