[{"title":"Hard to criticize a comedy that doesn't want to be anything clever","rating":6,"date":"21 April 2011","review":"I assume Malibu's Most Wanted is a parody of the lifestyle and career of Eminem taken in an over the top, silly format. There isn't really a message to be said here either come to think of it. It's one of those late night comedies that you watch for the hell of it. There really isn't a whole lot to criticize.<br><br>A white boy, wanna be gangster rapper from Malibu nicknamed B-Rad (Kennedy) is the son of his Governor candidate father who needs to hatch a plan to get his son out of the way so he can win the election and not be made a mockery of. He decides to send his son with two actors (Anderson and Diggs) who are told to fake carjack him when with a girl (Hall) and take him into the real hood to show him life isn't what it's made out to be.<br><br>Naturally, B-Rad still wants to pursue his gangster rapper image which proves to only land him in hot water with people at clubs and real gangbangers. I think we know the direction the film takes after that.<br><br>The film relies entirely on clichés and traditional good/bad life lessons. It's hard to review a goofy comedy like this and it's even harder to lengthen a review of it because there is only one complaint; it's too cliché.<br><br>Lots of one liners are dropped, all hit or miss, with several hitting. Still a comedy based off of one liners usually isn't a good comedy. But if the film has a great duo like Chris Farley and David Spade, the antics speak for themselves.<br><br>I did get a kick out of seeing Anthony Anderson in the movie, but sadly, he doesn't add too much here either. Jamie Kennedy is a likable character, and Kal Penn makes a cameo in the film as well. Numerous little perks here, but ruined by the storyline used one too many times. Malibu's Most Wanted isn't too impressive.<br><br>Starring: Jamie Kennedy, Taye Diggs, Anthony Anderson, Ryan O'Neal, Blair Underwood, Damien Wayans, Kal Penn, Bo Derek, and Regina Hall. Directed by: John Whitesell.","user":"StevePulaski","rank":[6,6]},{"title":"Silly but Funny","rating":7,"date":"14 April 2003","review":"MBW is one of those movies that is humorous because the characters are kinda stupid but funny.  Kennedy plays the seemingly stereotypical role of \"black-wannabe-gangsta-trapped-in-white-boy's-body\", but i think we've seen this role in movies quite too often (actually Mitch Mullany did a better job in The Breaks). The definitely could've done a better job w/ the plot line, but I suppose they did a good job by using the equation character stupidity = loads of laughs. I think they made Kennedy's character more stupid than he deserved to be.  Then again, the whole movie I think was just a big tease about how a lot of kids nowadays (whether from the 'hoods of Compton or Malibu) are trying to emulate the lifestyles/persona of real hip-hop stars. It was a silly yet funny movie, I think more of the \"crack-up-laughing\" kind of movie vs. lighthearted humor (like Sandler's Anger Management). So yes, don't expect a strong story but go there for the laughs. One note though, they should've made Snoop Dogg's dialogue more like the way he really talks/raps...it seemed a bit \"censored\" to me...perhaps they did it to make the PG-13 cut. For shizzos, my nizzos. Don't be hatin'!  :)<br><br>** out of 5 for storyline ***** out of 5 for laugh factor","user":"missan2net","rank":[14,18]},{"title":"Don't be hatin","rating":10,"date":"5 August 2006","review":"OK, so its not the shiznits. Its just funny. I give it a 10 because: 1. Jim Howell from Michigan can't like it because it failed to be \"an examination of the racial issues pervasive in our society\". What the @$&amp;*! are you talking bout Jim. They learn you that stuff in film school, Jim? 2. Bo Derek. 3. Kumar. 4. SOme other guy says its only for rappers or J Kennedy fans. Huh? I never heard of JK before &amp; I hate rap/hip-hop/etc. Get real. It is for people who know how to laugh at other people. 5. Its not for people who take themselves soooooooooooooo seriously. You still there Jim? Go give a \"10\" to some poorly-made film about deep-thoughts. 6. JK was OK, but A Anderson and T Diggs were great. Shondra, who I think is the girl from Scary Movie, was good &amp; so was R Oneill. As for Bo? Oh yeah!","user":"badtothebono","rank":[41,65]}]