[{"title":"Disturbing, disgusting, offensive, and better than I expected","rating":7,"date":"19 March 2006","review":"When I first saw previews for this movie, I expected a soulless comedy about restaurant staff messing with customers. Although some people may feel that way even after seeing it, I was pleasantly surprised. From the introduction of 'the game' near the beginning of the movie, I knew this was going to be more interesting and even more disturbing than the previews.<br><br>Despite what appears to be rather thin characterization, 'Waiting' succeeds at being a good character-driven movie. I am not sure why this is. Perhaps what seem to be just childish antics add depth to the characters without us realizing it. Some people complain that 'the game' is a 10 second gag stretched out for the entire film, and on the surface, this is true. However, the game is really more of a mechanism for developing characters than anything on its own. The result is a set of very flawed, but surprisingly likable characters. Also, the ending, though a little abrupt, is entertaining largely because the movie does a good job of setting up the characters and situation.<br><br>This movie is not for everyone. If you do not like 'stupid' humor, then you will probably not be able to overlook that to enjoy the more subtle aspects. However, once you get past that, this movie is more than the sum of its parts.","user":"jbanet","rank":[73,82]},{"title":"Austin Movie Show review","rating":10,"date":"12 October 2005","review":"I hated (HATED!) being a waitress, but this movie is so hilarious and so ballsy that it almost makes me want to go back to the summer of 1999 to work one more shift at TGI Fridays. Waiting is the best, most accurate, most honest, and most riotously funny movie ever made about the service industry. Here's how I see it  the world is divided into two groups of people: those who have waited tables and those who haven't. Those who have never worked a day of their lives in a restaurant may find this movie amusing, but they'll think it's too absurd to be real, and they'll probably never give a second thought to this movie ever again.<br><br>But those of you who have felt the pain, degradation, and humiliation of waiting tables will p**s your pants laughing at how PERFECT this movie is. First-time writer/director Rob McKittrick has created a dead-on depiction of 24 hours in the restaurant biz. The movie opens at a late-night party with lots of underage drinking, smoking, and sex. Then we see the wait staff hung-over at work the next day. The restaurant they all work at is called \"Shenanigans,\" but it looks an awful lot like the TGI Fridays I worked at.<br><br>All the characters in Waiting are based on the real people who work in every restaurant. There's the hot/slutty/underage hostess, the fat and ugly cook who somehow dates a really hot waitress, the stoner/punk bust boy, and the manager with the chip on his shoulder. All the customers in this film (the cheap red necks who don't know how to tip, the b****y women, the drunk and horny men) are all customers I've waited on. And no filmmaker has ever so accurately portrayed the complex and irreconcilable tension between the wait staff and kitchen staff.<br><br>But at the end of the night, no matter what drama unfolds, no matter what dishes brake, and no matter how much money you make in tips (or don't make), everyone gets wasted and parties together, and you all know you're in it together. Waiting simply tells a story about a profession that most people never give a second thought to. But it tells that story flawlessly. Can't wait for the DVD.","user":"leilapostgrad","rank":[216,282]},{"title":"Therapy for Restaurant Employees...","rating":9,"date":"15 October 2005","review":"This movie was everything I thought it would be and more. It'll make you laugh, it'll make you cringe. Most of all, it'll make you think twice about eating at another restaurant or even working at one. Each character is throughly enjoyable as is each interaction between them. It's extremely well-written and realistic. As a waitress, I found it completely therapeutic, because even though I'd never do anything to a customer's food, seeing someone else do it to someone who is deserving of it (even in a movie), is enough to make me feel better. Ryan Reynolds is hysterical in this movie, as is Dane Cook and Luis Guzman. There are so many one-liners that you'll hear for a long time, especially in the kitchen of any restaurant. It ends slightly abruptly and you find yourself wanting more...but I guess that means the writer has done something right. Go see it, and enjoy. Just remember never to break the cardinal rule: \"Never, ever, f*ck with someone who handles your food.\"","user":"tiramisuc","rank":[129,167]}]