[{"title":"An excellent film with Redford and Freeman in fine form. Not to be missed.","rating":10,"date":"4 October 2005","review":"An Unfinished Life may be the sweetest movie you'll see this year, and certainly the most beautiful. Take yourself to the theater, then look forward to the DVD. <br><br>We are treated to watch Robert Redford play a perfect curmudgeon, crusty, craggy, a rancher named Einar Gilkyson, in his 60's who has a lot to do every day. His first duty is to take care of his best friend and long time cowboy buddy, Mitch Bradley, played by Morgan Freeman. Then he gets to milk the cows. Their friendship carries the film through the ups and downs of life, with Mitch as the guiding light to Einar's disgruntled reality. <br><br>Unable to pull her own life together, Einar's daughter-in-law arrives with Einar's granddaugther in tow, needing a temporary place to stay. Jennifer Lopez plays Jean, and her daughter, Giff, is well played by Becca Gardner. The daughter-in-law is immediately rejected by Einar, still feeling the loss of his son and blaming her for it. They stay any way, and the story develops their lives as the four of them work out their differences while living on the ranch in a stunningly beautiful valley. Josh Lucas plays the local sheriff, a handsome man that reminds one of the younger Robert Redford. He gives spark to Lopezs character while being a complete gentleman. <br><br>An Unfinished Life brings a man and a bear together to acknowledge each others strengths, and brings an unhappy, bitter man to realize that he still has an amazing family right in front of him. Appreciation and forgiveness, along with some adversity, show us that unity is still possible even given previous misunderstandings and alienation's.<br><br>Every one in the film does a good job, and you feel like you have just visited the ranch and had dinner with these characters, and you want to go back for breakfast. The relationships in this film are realistic and intelligent, not sappy nor Hollywood glossy.<br><br>This is a wonderful film and it is a great delight to watch Redford, Freeman, Lopez, Lucas and Gardner play their parts in such gorgeous scenery. There is plenty of humor in the film, and an honest look at how we work out our emotional dilemmas and hang ups and eventually bring out the best in ourselves, often by being around someone else's best. <br><br>You will feel bested yourself, for watching this fine film. Compliments especially to Robert Redford and Morgan Freeman, a dynamic duo. They are a perfect compliment to each other, and their maturity is a great bonus to the film.","user":"CelesteDavison-1","rank":[106,121]},{"title":"Redford's finest hour","rating":10,"date":"17 September 2005","review":"Some films are able to capture subtleties in a pretty straightforward manner, and this is one of them. With the very capable support of Morgan Freeman, a quite good Jennifer Lopez, and masterful work by Robert Redford, we're treated to a special film, a study of family relationships where things don't appear contrived or staged.<br><br>People carry grudges and live with demons for many years; some are unable to even get rid of them. That's the case of Redford's character. Without a way to release himself, he has managed to create a pretty miserable existence for himself. The only redeeming moment arising from the relationship with his best friend.<br><br>Things are bound to change with the arrival of his daughter-in-law and the granddaughter he never knew existed. The drama unfolds quite nicely and our hearts are touched along the way. It's a quiet movie, full of lovely vistas and some intense drama. It doesn't pack the punch of \"Million Dollar Baby\", a film which it's bound to recall because of the Freeman's character dynamics. Give yourself a treat and enjoy Redford in the comeback film of his career.","user":"aharmas","rank":[101,121]},{"title":"Healing Wounds  A Tale of Forgiveness","rating":8,"date":"6 September 2006","review":"In order to escape from the abusive boy-friend Gary Winston (Damian Lewis), Jean Gilkyson (Jennifer Lopez) moves with her young daughter Griff Gilkyson (Becca Gardner) without previous notice to the ranch of her father-in-law Einar Gilkyson (Robert Redford) in Wyoming. Jean and Einar are disaffected, since he blames her for the death of his beloved son in a car accident. Einar is taking care of his friend Mitch Bradley (Morgan Freeman), who was attacked and seriously wounded by a bear, and he does not know that he has a grand-daughter. While Mitch heals his wounds and forgives the bear, Einar also changes his feelings regarding Jean, finally understanding that accidents happen and accepting her and loving his grand-daughter.<br><br>\"An Unfinished Life\" is a beautiful tale of forgiveness, with the lead characters healing their wounds  Mitch, the ones provoked by a savage bear, and Einar his innermost feelings of loss. The cast has amazing performances, showing the importance of a director of the weight of Lasse Halltröm: Robert Redford and Morgan Freeman are unanimity, but I myself like a lot the versatile Jennifer Lopez and strongly believe that even the viewer that dislike her as actress must admit her excellent performance in this touching film. Josh Lucas is a great support actor and the favorable surprise is the performance of the young and unknown Becca Gardner. Although being a predictable story without any twist, this sensitive movie is highly recommended. My vote is eight.<br><br>Title (Brazil): \"Um Lugar para Recomeçar\" (\"A Place to Restart\")","user":"claudio_carvalho","rank":[46,53]}]