[{"title":"Guest and Levy orchestrate a nice tribute to the 1960s folk groups.","rating":11,"date":"11 February 2004","review":"We have a duo, a trio, and a group of 9. These three fictitious 'folk' groups from the 60s reunite for a concert in this mockumentary. What makes it so interesting is (1) I was a young adult in the 60s and vividly remember the folk group wave and (2) Guest, Levy and the others do their own singing and playing of songs they wrote for the movie. I think its IMDb ratings which cluster around 7 and 8 are about right. Not everyone will like 'A Mighty Wind' (song from final concert), it has improvised humor and many of the same actors from 'Best in Show'. But for fans of the humor of Guest and Levy it is a very nice little movie. The DVD has interesting extras, and the commentary track by Guest and Levy discuss how, for example, Levy had to take lessons to get is guitar skills back, and how O'Hara learned to play the autoharp for this role.<br><br>The movie is 92 minutes long, which includes the 7 minutes of end credits. Of the 85 minutes of actual movie, the first 60 sets up the characters and groups, shows them in rehearsals, covers several back stories, then the final 25 minutes are the concert itself, actually performed before a live audience. There were a few truly outstanding folk groups in the 1960s, but there also were a whole bunch of mediocre ones.  The three groups featured in this movie are as good as many of the 1960s groups that actually made a living entertaining. And, as at least one critic said, that's part of the problem with 'A Mighty Wind' - the groups are good enough, and the final concert is real enough, that much of the impact of the humor went away during the last act. The lampooning was gone, replaced by a legitimate set of performances.<br><br>Still, I found it thoroughly enjoyable, and my favorite of the 'Guest/Levy' movies.","user":"TxMike","rank":[40,43]},{"title":"I thought I was the only one who saw the joke here!!!","rating":8,"date":"5 April 2004","review":"In the '60s and '70s, I was a MAJOR folk music fan, and a (very bad) would-be performer; I still have my old Yamaha guitar tucked away in a closet. For years now I've been a second shift engineer at the local PBS TV station... I'm the guy who runs the videotape while the SANE people around here are at home.<br><br>EVERY time we run a Pledge (or, as I refer to it, \"The Big Beg\"), it seems that they come up with ANOTHER nostalgic music reunion program... Doo Wop folks, Rockers, Surfin' music groups, and lately, Folkies.<br><br>The folk reunions have been, IMHO, sort of sad. The spirit is willing, but the flesh isn't quite up to recapturing the old glory days.<br><br>Judy Collins tries to sing the songs she did when she was 19, and her voice just can't come within a half tone of the high notes she used to hit.<br><br>Barry McGuire was an angry, fiery young poet, but now he just goes through the motions with dated stuff like EVE OF DESTRUCTION. It's hard to take him too seriously.<br><br>Even my favorites, Peter, Paul &amp; Mary, have seen better days. Peter Yarrow looks like he should be running a pawn shop somewhere, Paul Stookey resembles a college professor who's just counting the days until retirement, and unfortunately Mary Travers hasn't aged very well at all... I remember her as a woman who used to OOZE a sultry, steamy sensuality, but nowadays, on high definition TV, she bears a very unfortunate resemblance to a bulldog!<br><br>Just the same tho, I have to admit that Peter, Paul &amp; Mary's musical talent HAS lasted over the years.<br><br>When I discovered A MIGHTY WIND I thought I was going to die laughing with absolute joy... SOMEBODY besides ME saw these tries to capture the past in a bottle as a lost cause!!!<br><br>Ed Begley is MAGNIFICENT as Lars Olfen, the \"PBN\" executive producer; he has the Yuppie pseudointellectual pompousness of PBS paper shuffling executives down PERFECTLY!!! I KNOW Lars Olfen VERY well; I happily work the second shift just to AVOID these rancidly arrogant characters, who thankfully LEAVE the station every day at 5 PM!!!<br><br>The New Main Street Singers are a mix of THE NEW CHRISTY MINSTRELS and the squeaky clean, Stepford Wife - like automatons of the old UP WITH PEOPLE cast... but with a delicious touch of gameyness that we ALL knew was just below the surface, added by the past exploits of Bohners.<br><br>The Folksmen are a hybrid of the old Chad Mitchell Trio (which, incidentally, was a foursome until they dumped Henry John Deutchendorf, later better known as John Denver!), and the Limelighters.<br><br>The PBS reunions sort of tacitly ask the question \"Whatever happened to...\", and A MIGHTY WIND answers it... EXPLICITLY.<br><br>LIFE is what happened to them. They became part of reality, just like the rest of us.<br><br>I have to admit that the musical performances in the film are EXCELLENT; for a lot of people who weren't really part of the '60s commercialized folk music scene, they do a VERY creditable job with the material. They could have been folkies for real!<br><br>The only joker in the deck tho; the musical material, if you listen very closely to the lyrics, is ABSOLUTELY RIDICULOUS!!! Almost ALL of it, especially the song I NEVER DID NO WANDERIN', is a brilliant parody of the stuff we listened to and loved back in the '60's.<br><br>For anyone who knew the glory days of Bleeker Street in New York, or Old Town in Chicago, this is a film that will be an absolute joy. It shows both the GOOD parts of those days, and also shows up the silliness of some of the idealism in what we believed.","user":"Gavno","rank":[12,12]},{"title":"Doesn't have to be mean to be funny","rating":9,"date":"11 February 2005","review":"Some felt that this was too close to reality to be considered a parody, but I thought it was beautifully done - made fun of the cloying smugness of some \"folkies\", but mixed it with genuine pathos. I have a feeling Eugene Levy may have lost a couple of friends to bad acid trips - his portrayal was hilarious, but not cruel. Christopher Guest continues to amaze me with his light touch; most comedies put people in bad situations and make them squirm their way through; instead Guest takes apparently mediocre characters and puts them in situations that stretch their personalities. <br><br>Contains the single funniest comment I've ever heard about model trains.<br><br>Suggested double feature: This is Spinal Tap, Waiting for Guffman, or Bob Roberts","user":"alana-dill","rank":[37,42]}]