[{"title":"Male fantasy kung-fu. Great fun!","rating":8,"date":"16 February 2005","review":"A word of warning: don't see this expecting intellectually challenging cinema. Naked Weapon is any man's wet dream- gorgeous female assassins go to exotic locations and take out high profile baddies (with mandatory sexy dancing before the kill). <br><br>The action might seem a bit tame for hardcore kung-fu fans (lots of wires and floaty camera moves disguise lack of fighting talent on the actors' parts), but for those of who just want to see some mindless violence, it does the job nicely. Unfortunately the plot has no direction (one set piece after another), and the dialogue is laughably bad. Thankfully, the cheesy lines are so bad they are actually quite entertaining, and blend in nicely with the whole B-movie feel of the film.<br><br>Far better than I expected- slick and escapist scenarios, high production values, and the action is great fun. I must however warn potential viewers that Daniel Wu is unspeakably bad as the earnest CIA guy on the tail of the killers- all he has to do is fill the audience in on the plot every now and again and get his ass kicked once. How hard can that be? Anyway, he messes that up nicely.<br><br>To conclude, Naked Weapon is the perfect film if you've been out drinking, come home at about 2.00 in the morning, and want to see a film where brain power is not expected from the audience. Two thumbs up!","user":"taxidriver_448","rank":[39,47]},{"title":"Dumb but fun action yarn","rating":28,"date":"28 January 2003","review":"Charlene (Maggie Q) is a young girl who finds herself imprisoned and trained to be an assassin, along with a group of other girls including Katt (An Ya) and the psychotic Jing (Jewel Lee). Six years later, these three girls are the only ones left alive to pass the grade, and are sent out into the outside world to become assassins, working under the control of the sinister Madame M.<br><br>What follows is a pretty much non-stop fight scene, big explosions, blood and death. It's totally cool in a way that western films try so hard but fail to be (mentioning no Ballistics). It doesn't even matter that a lot of the fighting is weak and/or doubled, the lead girls  for all their inexperience  look and move great. There's lots of wirework and plenty of camera trickery, but it gets away with it by being far more fun than it has any right to be. I loved it, and if you like girls with guns, looking cool and shooting people in slow motion, you will too.","user":"Mike Astill","rank":[17,20]},{"title":"Hot Babes, Matrix-style fight scenes and an idiotic script","rating":16,"date":"16 July 2004","review":"What can I say about this movie. It was recommended to me by a friend with a warning: don't take it seriously. And he was right. This is a very entertaining movie if you can get past some very serious flaws, like an extremely bad script and some lousy acting.<br><br>What was good about the film: The soundtrack was very good and supported the movie well. The overall story was rather good and interesting. The women were beautiful and sexy. The fight scenes were superb - a little over the top, but still nicely done. Besides, the concept \"hot women using their bodies as weapons\" is really cool.<br><br>What was bad about the film: The acting leaves a lot to be desired in many occasions. The script was lousy, sometimes even stupid. The love story was badly portrayed and it was a bit out of place.<br><br>To sum it up: This movie is not Oscar material, you won't be thinking about it afterwards and it's not going to be in your list of all time favourites. Still, it's an action packed, highly entertaining film that will provide for a pleasant evening. I give it 7 out of 10.","user":"prod74","rank":[27,36]}]