[{"title":"Fair","rating":6,"date":"4 July 2005","review":"This horror/thriller/(maybe)supernatural movie is nothing really remarkable, or anything that you haven't seen before, but it's quite watchable. After the suicide of his wife, Robert de Niro's psychologist character withdraws to an isolated rural location as therapy for his traumatised daughter. Things start to get creepy when she develops an imaginary friend who has a decidedly vicious streak.<br><br>I've been complaining for some years now that de Niro really needs to pay a bit more attention to the sort of parts he accepts: he's been in far too many stupid comedies. Here we finally see him in a dramatic role, and whereas he pulls it off professionally, it's not really an inspired performance, and you have to wonder where his next classic role is going to come from.<br><br>That aside, 'Hide and Seek' is a suitably creepy and dark movie. Its major fault, at least as far as I was concerned, is that its crucial 'secret' was obvious by about half an hour from the end. I still held out hopes that I was wrong, but I think anyone who's seen enough films of this sort would work it out by a process of elimination, and besides, the movie blows its own cover completely a good 10 or 15 minutes from the end, which leaves you with a rather disappointing and predictable run home.<br><br>The DVD includes four alternate endings, three of which the directors eventually decided were too 'dark', and that the audience deserved some kind of positive 'reward' after having sat through so much traumatic stuff. I disagree. At least two of the three 'dark alternate endings would have improved the film by giving it a sting in the tail. Good god, go through a mental list of great horror movies, and you won't find many that shy away from endings that are 'too dark'.","user":"Lupercali","rank":[76,93]},{"title":"Come out wherever you are.....","rating":6,"date":"12 February 2006","review":"As a psychological thriller, or a horror film, \"Hide and Seek\" doesn't break new ground. In fact, once it's over, the viewer feels somehow manipulated by what we have just witnessed. There are, supposedly, four different alternative endings for the movie, but unfortunately, the one being shown, doesn't add anything to what we have already seen.<br><br>Although the film has some interesting moments, director John Polson has gone for the Grand Guignol effect. Ari Schlosberg's screen play gives us hints about what to expect, yet, when we realize the mystery at the center of the story, we keep scratching our heads.<br><br>Suffice it to say, this film doesn't add anything to Robert DeNiro's brilliant career. Mr. DeNiro's last choices in films puzzle us, as well as his fans because we know he is capable of doing much better. Yet, as shown with this film and \"Meet the Parents\", and its sequel, \"Meet the Fockers\", \"Analize This\", and \"Analize That\", the actor keeps us wondering about his choices.<br><br>Dakota Fanning is a young actress who shows an uncanny sense of how to upstage Mr. DeNiro in most of their scenes together. As Emily, in this film, this girl shows an enormous range in what she is capable of doing. One can see Ms. Fanning growing to be another Jody Foster in later years.<br><br>The rest of the cast is completely underused. Amy Irving is only seen in flashbacks, which is a shame since she is a valuable actress. Famke Janssen has a few key scenes. The same goes for Melissa Leo, Elisabeth Shue and Robert John Burke.<br><br>The only consolation was it was shown on cable and we felt lucky not having spent the price of admission.","user":"jotix100","rank":[55,74]},{"title":"Good Thriller, With an Excellent Very Dark Alternative End","rating":7,"date":"16 July 2005","review":"After the suicide of his wife, the psychiatrist Dr. David Callaway (Robert De Niro) decides to move with his traumatized daughter Emily (Dakota Fanning) from New York to the country to give more attention to her. In their huge old house, Emily finds a new and violent invisible friend called Charlie, making David very concerned with her mental state.<br><br>\"Hide and Seek\" is a good, but predictable thriller. Dakota Fanning has another outstanding performance, on the contrary of in the just-released \"War of the Worlds\", where she is histrionic. Robert De Niro is too old to act as the father of Emily, but in the end, this movie is enjoyable. The DVD shows three alternative ends, and there is a very dark one, which is excellent, with Emily in an institution. Unfortunately, the commercial end prevails and becomes the \"official\" conclusion of the movie. My vote is seven.<br><br>Title (Brazil): \"O Amigo Oculto\" (The Hidden Friend\")","user":"claudio_carvalho","rank":[67,103]}]