[{"title":"Could have been better","rating":5,"date":"23 October 2006","review":"This move had potential, but didn't quite make the grade. I was hopeful when I read the cover of the DVD case. But, unfortunately, the directing was kinda bad. Some scenes had nothing to do with the movie at all and was a waste of time to even include. Such as the Joe Torry part. Maybe Joe simply wanted a more prominent part so they threw him a bone. But in doing so, it messed up the flow of the movie. Not that the flow was all that great before. I really hate to see a potentially good movie go to crap simply because of mistakes like bad editing and directing. I really feel this movie could've been good, otherwise. Instead, it ends up being so-so.","user":"jennycococure","rank":[14,17]},{"title":"Excellent comedy, good date movie","rating":8,"date":"23 July 2006","review":"The story starts by an introduction of Andrea Collins (Vivica Fox). This woman is depicted as preppy, shallow and self-obsessed (chliche) Hollywood actress. Despite of that, due to the funny - at times even parodying way of using this character makes this girl somewhat lovable. Later on, Andrea meets two of her friends and they start a twisted challenge : silly competition in seducing (almost) randomly selected stranger. (Suprisingly, no actual prize was at stake)<br><br>Getting played is a romantic story that won't get you disappointed. The movie is perfectly written (the plot is great for the comedy genre) and acted, the scenes are warm and music well chosen. The part where mark strips was rather unique and unpredictably funny. I loved Stacy Dash here - she was very appealing and no less shining than Vivica Fox or Carmen Electra. <br><br>Overall this story is a great movie, its smart and original humor suited me very well. Great alternative to senseless teen comedies (about losing virginity), overgrown weed-smoking losers living with their mums and the like. Getting played is no tough art or deep story but simple, well executed romance/fun flick that shouldn't make its audience regret their choice. <br><br>This movie can easily find decent place on my shelf, since It's very charming, delightful and entertaining piece.","user":"maros612","rank":[6,8]},{"title":"No Redeeming Features","rating":4,"date":"21 October 2007","review":"While there are other movies that represent these actors in a better light I did get a few laughs viewing this movie. My adult children watched with me and they could name a few ladies who fit the bill of the three characters---and that's too bad. The sound track was enjoyable, the costumes (clothes) were realistic and the comic was funny. The friend Josh is entertaining. But,there certainly will not be even a little rush to the DVD rentals by many to get this movie. The movie obviously was an attempt by the director to rush through a project--let's hope he is not remembered for this one. And, let's hope the actors/actresses did not count on this one to be the big one for their careers.","user":"aa4353","rank":[6,9]}]