[{"title":"Moral of the Story: Divorce Is Tough","rating":8,"date":"22 November 2005","review":"A friend of mine was hesitant to see this movie, because she'd heard that it pushes the agenda that divorce is never a good option for dealing with marital problems. I don't really know who told her this, and I hope this same reason isn't keeping others from seeing it. This isn't at all what I took away from the film. It certainly communicates the idea that divorce isn't easy, on either the parents or the kids, but I don't feel that it pronounces judgement on those who turn to it as an option.<br><br>\"The Squid and the Whale\" is a sad--though at times very funny--look at what divorce does to one family in 1986 New York. Jeff Daniels plays the dad, a pompous, arrogant writer whose feelings of commercial failure (he teaches literature at a university) cause him to act intellectually superior to everyone he meets. Daniels is almost too good in this role; he reminded me way too much of people I actually know who are like this. He's the kind of guy who would be deadly at a dinner party, because there's no such thing as a casual or flippant remark in this guy's presence. He analyzes everything to death, and isn't content until everyone's opinion matches his own.<br><br>Laura Linney plays the wayward mom, blamed for the break up of the marriage by the dad because of a string of affairs she carries on. Her guilt keeps her from being able to discipline her sons, especially the oldest, who treats her horribly. Linney's role is smaller but in some ways much more complex than Daniels'. Her character has to take responsibility for her infidelity but still make the audience sympathize with her.<br><br>Caught in the middle of this mess are their two boys. The oldest quickly allies himself with his dad, and walks around regurgitating his father's opinions on every subject, rarely pausing to form any of his own. The younger son, more sensitive and tired of being intellectually brow beaten by his father and older brother, sticks closer to the mom. No one is totally to blame, yet no one is completely innocent either in this honest and frank film.<br><br>Noah Baumbach has made no secret of the fact that it is based on his own adolescent life, and it has that confessional feeling that movies in this genre frequently do. There are awkward moments when this doesn't totally work. The ending for one is rather ham-fisted, and a scene between the oldest son and his school therapist seemed awfully pat to me. But the acting and the sharp writing make up for these weaknesses, and the movie manages to be poignant without ever becoming maudlin or overly sentimental.<br><br>See it for the performances of Linney and especially Daniels, who has been proving his versatility as an actor over the last few years.<br><br>Grade: A-","user":"evanston_dad","rank":[192,225]},{"title":"One Turtle would have made it Better","rating":8,"date":"30 October 2005","review":"Greetings again from the darkness. Writer/Director (and Wes Anderson collaborator) Noah Baumbach presents a semi-autobiographical therapy session where he unleashes the anguish and turmoil that has carried over from his childhood. The result is an amazing insight into what many people go through in a desperate attempt to try and make their family work.<br><br>The casting of Jeff Daniels forces us to view him as the grown up Flap from \"Terms of Endearment\". He has become a bitter, unfocused, pompous ass of a person, father, husband and professor. The inability to recapture the magic of his early writing success has caused him to look down on all other writers ... whether they be Fitzgerald or his own wife. This is Daniels' best work ever on screen and is at once, painful and a joy to behold.<br><br>Laura Linney plays his wife as a woman who loves her kids unequivocally and has a zest for life that her downbeat husband no longer shares. Her new found success as a writer sets her off on a trail of confidence and joy, all the while understanding that her family still needs her very much.<br><br>The kids really take the film to the next level. Jessie Eisenberg (brilliant in \"Roger Dodger\") and Owen Kline (son of Kevin Kline and Phoebe Cates) are both scene stealers as they struggle in their own distinct ways with their separated parents and their continuance through adolescence. Watching Eisenberg's worship his dad and subsequently realize the truth is just amazing stuff. Kline's outbursts on the tennis court and at the ping pong table are nothing compared to his discovery of alcohol and self-pleasure. The angst and pain these two experience is felt by millions of kids in divorce situations.<br><br>Other outstanding performances include William Baldwin (the one from \"Backdraft\"), Holly Feifer (as Eisenberg's first girlfriend) and Anna Paquin (underused, but still very effective). Baldwin provides some comic relief with his incessant \"my brother\" narrative and Feifer is extraordinary in capturing teen adoration as she lusts after Eisenberg. Thanks to her distinct similarity in looks to Linney, I laughed outloud when Daniels tells Eisenberg \"she's not my type\".<br><br>Listening to Daniels try to manipulate everyone he communicates with causes immense dislike among viewers, but we can't help but feel some empathy for him as he seems to believe he is doing all he can do put his family back together. His fatherly advice is not to be missed (or followed!). Watching him look for the perfect parking place is really his search for his place in a world that has deserted him.<br><br>Baumbach has created a terrific film and probably exorcised some personal demons along the way. Definitely not a film for the whole family, but it offers much insight and many messages. Also the use of the soundtrack is downright brilliant including key music from Pink Floyd and Loudon Wainright.","user":"ferguson-6","rank":[147,184]},{"title":"depressingly refreshing","rating":9,"date":"8 November 2005","review":"More acutely than I've experienced in a long time, this film captures the process of personality inheritance within families. The interaction/influence between Bernard and Walt is almost painful to watch at times, but it's completely rich. Beyond just that father/son dynamic, the story is so poignant without ever getting sappy - a true accomplishment for a family drama involving divorce. Nothing hits you over the head. Nothing seems too forced. While there's plenty of confusion, discomfort, and alienation, a sense of love shines through, and I couldn't help but get attached to all of the characters. I recommend this film unconditionally.","user":"gdsoul","rank":[83,111]}]