[{"title":"It's just a little fun.","rating":7,"date":"30 December 2005","review":"Okay, it's not Spielberg, but it's a little movie that's a lot of fun. Competent performances by Basinger and Corbett certainly help sell the premise, but it's a screwball comedy a la \"The Russians Are Coming\". Besides, how bad could a dark comedy be whose focus is on an Elvis impersonator convention? Help comes in many forms including appearances by Denise Richards, Angie Dickenson, Pat Morita, Richard Kind, and Annie Potts. Other cameos spice things a bit. If don't mind spending 90 minutes on a little quirky movie that delivers a few good laughs and a lot of amusing moments rent the DVD. It's worth it. This last line is in here because IMDb makes you write ten lines.","user":"dlitt-1","rank":[18,22]},{"title":"Very SillyBut I Laughed a Lot","rating":6,"date":"20 January 2006","review":"The successful Pink Lady cosmetics saleswoman Harmony Jones (Kim Bassinger), who uses lipsticks of her competitor to protect her lips, is very connected to Elvis Presley since she was seven years old and met him. She presently wishes to have a boy-friend and raise a family of her own, being lucky in business and unlucky in love. While traveling nearby Las Vegas, she accidentally kills three Elvis Presley impersonators, and she believes the police is chasing her. Meanwhile, she also meets Miles Taylor (John Corbett), who works in an advertising agency in New York, and is traveling to Las Vegas to finalize his divorce process with his former wife, Belinda (Denise Richards). She wants her Elvis Presley clothes back as the final condition to sign the divorce papers. Harmony sees the clothes in Miles' hands and believing he is another Elvis impersonator, she avoids him, afraid of hurting him.<br><br>My wife is a great fan of Elvis Presley (but she is not an Elvis impersonators), and I bought this DVD for her. For me, the great attraction was the always sexy and gorgeous Kim Bassinger. Denise Richards, Angie Dickinson, John Corbett, Tom Hanks and other names completed a really good cast, and we have just watched this movie. \"Elvis Has Left the Building\" is a very silly romantic comedy, with a quite ridiculous script near to the non-sense, but with lots of black humor. Although alternating good moments with very bad ones, I really laughed a lot. There are really funny situations and although very irregular, it entertains. My vote is six.<br><br>Title (Brazil): \"Elvis Ainda Não Morreu\" (\"Elvis Has not Died Yet\")","user":"claudio_carvalho","rank":[18,23]},{"title":"funny, funny, funny","rating":8,"date":"15 September 2005","review":"This movie was a delightful surprise. I laughed all the way through it. Although it poked some gentle fun at Elvis impressionists and a number of other things, it left the memory of the King alive and well. I wish I had seen it on the big screen.<br><br>I enjoyed seeing Kim Basinger in this movie and she was quite funny. She is still looking good.The romance in the movie was a bit predictable, but didn't take away from it at all. You just need to be in the mood to watch something silly and enjoy it for what it is. The cameo appearances by some well known actors added to the film. I had to check the credits to make sure I was seeing who I thought I was seeing in one scene.","user":"reliles","rank":[17,24]}]