[{"title":"They're all Gonna Laugh at You\"","rating":15,"date":"15 December 2002","review":"I have read the book and seen the original 1976 movie, numerous times. When I saw this advertised and heard that it followed the book, I knew I had to see it!  It was interesting to see the book brought to life in a film. Even though it was modernized with Carrie making references to the internet, Chris using a cell phone, etc.  I really enjoyed watching it, even though I still have to say that the original 1976 movie is still a classic!  For some strange reason, during the prom scene where the blood is poured on Carrie, I was actually waiting to hear the famous line, \"They're all gonna laugh at you!\"  That was such a nice touch in the original, but very difficult to duplicate. I also noticed in the credits that Jasmine Guy was in this film, but I looked and was not able to see her anywhere. The only thing I did not like is the fact with it being on regular television, the commercial breaks interrupted some of the good parts. Just when I was really into watching it, a commercial appears! Overall this movie was enjoyable to watch and to see a classic book and film come back.  I am not much on remakes, but this one was not that bad. Still, nothing can hold a candle to the original!","user":"Jimmy-154","rank":[22,26]},{"title":"In The Shadow Of A Masterpiece","rating":6,"date":"6 November 2002","review":"It seems to make as much sense to remake a great movie like Brian DePalma's 1976 horror/suspense masterpiece CARRIE for television as it did to make a sequel of it in the form of THE RAGE: CARRIE 2 three years before, but that's what has been done.  A lot of bells and whistles have been added to this television remake, but in the end this CARRIE is still in the shadow of the DePalma original.<br><br>Angela Bettis (GIRL INTERRUPTED) has the unenviable task of stepping into the shoes (and the prom dress) of Sissy Spacek in the title role of a New England teen tortured at school by cruel classmates (because she doesn't belong) and at home by her religiously fanatical mother (Patricia Clarkson, in the Piper Laurie role).  Soon, she discovers she has telekinetic powers; and when the most gruesome of gags is played on her on prom night, all bets are off.<br><br>Though looking much more glazed in the eyes than Spacek ever did, Bettis gives a fairly good performance as Carrie; and Clarkson's portrayal of her uprighteous mother is much more low-key, but no less threatening, than Laurie's portrayal.  The special effects, however obvious they might be, are also quite good.  But in the end, the reputation of the 1976 original, with its combination of psychological horror and teen-angst drama, still hovers over this remake.  Nowhere is this more apparent than in the pig's blood scene.  It doesn't have the same jarring emotional impact this time around--not so much because we've seen it before, but because here it looks slightly laughable when the blood gets poured onto Bettis.  Because of DePalma's use of slow-motion in the original, the blood hits Spacek like a tidal wave.<br><br>I give the CARRIE remake a '6' just for trying.  I only regret that its shortcomings as a film have less to do with its execution as a film than the fact that the original movie still resonates much more fully.","user":"virek213","rank":[32,41]},{"title":"Not as bad as I expected, but no replacement for the original.","rating":7,"date":"7 November 2002","review":"To state that this new version of Carrie doesn't remotely compare with the original horror classic is to belabor the obvious, so I will leave that issue aside.<br><br>However, I expected this movie to be simply garbage, like the recent \"Rose Red\", or dull and mediocre, like the TV remake of The Shining, and surprisingly, it was better than that.<br><br>Making a remake of a classic film is usually inadvisable, but under the circumstances, this was an honest and decent rendition of Carrie. TV movies tend to be endlessly drawn out, with low proudction values, and this was better than average. Most of the credit goes, however to the casting. Most of the cast were a very competent group of actors who I think really gave it their best shot in creating a new angle on the Carrie story. Particular mention should be made of Angela Bettis in the title role. She tackled the daunting task of taking a part made very famous by someone else, and making it her own. Her Carrie is less a neurotic mess than Sissy Spacek', repressed and unhappy but still  strong and with some guts. She was very sweet and vulnerable, and was often very touching, as when she was suddenly, out of the blue, asked to the prom by such a handsome, nice boy.<br><br>\nOne big disappointment was Patricia Clarkson as Mrs. White. The part was really reduced in scope in this version, and the actress played her in a very restrained and bland fashion. I can well imagine that it was decided that to replicate Piper Laurie's over the top baroque performance was inadvisable. The idea here was to have a more low key sinister approach. But the result was completely dull and uninteresting character that had less relevance to the story than it should have. <br><br>So for a TV remake of a horror classic, I give it A for effort, with some very good elements to it. However, this is still a movie you will probably watch only once. The real Carrie, Brian DePalma's 1976 classic, is one that is always fun to watch again and again!","user":"bilahn","rank":[14,17]}]