[{"title":"Terrrrrrible","rating":21,"date":"21 January 2002","review":"***SPOILERS***   ***SPOILERS*** Most of the time, I prefer a movie that is realistic. Every now and then, particularly when I sit down to watch an action movie, I let some realism be sacrificed for entertainment's sake. However, the keyword here is SOME realism.<br><br>THE PRESIDENT'S MAN: A LINE IN THE SAND, sequel to THE PRESIDENT'S MAN (which I have not seen), sacrifices ALL realism. So much realism is sacrificed, in fact, that about ten minutes (no exaggeration) into the movie, I stopped thinking about the plot, or lack thereof, and just kept on thinking how impossible the storyline was.<br><br>\nTo give you an idea of how unrealistic this film is, read the following: (NOTE: I'm listing these assuming that the film never airs again or never comes out on video. This list might contain spoilers.)<br><br>~In the opening scene, Deke manages to outrun an entire band of machine-gun-armed rebels who have the worst aim I have ever seen.<br><br>~The terrorists manage to sneak enough plutonium into the United States to build a bomb big enough to destroy an entire city through two small (as in desktop size) statues.<br><br>~The bomb, which, in order to destroy an entire city, would have to be at least 1 megaton, is about as big as a toaster oven.<br><br>~Navy F-16s drop \"smart\" bombs on the terrorists' headquarters that miss.<br><br>~The terrorists shoot down an F-16 using surface-to-air missiles (where did they get those?).<br><br>~Deke manages to parachute down into the terrorists' headquarters and kidnap their leader SINGLE-HANDEDLY. He is unharmed.<br><br>~The President manages to keep Chuck Norris and Co. secret and nobody really even cares how the President can do that which elite Marines can't.<br><br>~Chuck Norris actually figures out the terrorists' code language to the letter.<br><br>~Chuck Norris and Co. can use satellites to see what happened at any spot on the earth at anytime day or night.<br><br>~Chuck Norris and Co. have access to any and all top secret equipment they want or need.<br><br>~Chuck Norris and Deke alone manage to stop the terrorists' plot.<br><br>~Chuck Norris and Co. can call the FBI or any other government agency like they are their own personal watchdogs.<br><br>~Chuck Norris is not only strong and fast, but smart enough to know which wire to cut when diffusing a nuclear bomb.<br><br>\nI hope you get the idea. If you don't, find somebody who taped this movie and tally how many unrealistic things you see. If you get a number less than 1,000, count again.<br><br>As for all you filmmakers out there, words to live by: Reality can be sacrificed to an extent. But the keywords here are \"to an extent.\"","user":"DrEbert","rank":[7,9]},{"title":"You can't be serious","rating":1,"date":"25 February 2002","review":"Oh dear, Oh dear. I started watching this not knowing what to expect. I couldn't believe what I was seeing. There were times when I thought it was a comedy. I loved how the government's plan to capture the terrorist leader is to air drop in one man, who is unarmed, and expect him to capture him and escape with a rocket pack. If only it were really that easy. I've finally found a movie worse than \"Plan 9 From Outer Space\".","user":"SirAndyL","rank":[8,12]},{"title":"This was really bad!","rating":21,"date":"21 January 2002","review":"You know, as much as I like Chuck Norris and the charity and motivational work he does, this made for TV movie really reeked of bad writing, directing and event action...I can tell as most here would agree that this \"show\" was made as cheaply as it could have been with a lot of high-tech archival footage from NASA, the U.S. military, and a few other sources like CNN and the like, for a current events style appearance to what has happened in this country over the last 6 months since September 11th...This show made no real point, it had unrealistic action, and it wasn't even really funny if they had tried to make it as such??? Who could tell that, unless they were part of the crew...<br><br>I have to say that this also looked like they tried to get it \"in the can\" as soon as they could to release it to the network to \"fill-in\" some time slot after the playoff games, and even had to get the color announcer on the CBS affiliate to say something to the effect of: \"I bet Chuck will kick some serious butt, tonight!\" I knew from right there this was going to be really bad...So we went over to a friends house that evening hoping to avoid it after the game, but their kids got hooked into it...sigh...Too bad...But after watching it for a while, it got me to thinking \"how bad could this really get...???\"<br><br>But that is why I had to post this...Anyone who sees this in the up coming years will know this to be true if you got hooked into it...Sorry, we couldn't warn you before hand...<br><br>My advice to Chuck...Love your style man, but your programs really stink...If I were you, I'd drop those hack you work with, and get back to what you know about...<br><br>Good luck! NT4U","user":"nativetex4u","rank":[5,8]}]