[{"title":"Here's a rather non-committal review!","rating":25,"date":"25 April 2005","review":"So, is the Hitchhikers' movie any good?<br><br>Yes and no.<br><br>It is great to finally see one of my favourite stories finally get the big screen treatment. There are moments where the budget has clearly benefited the overall experience, with some breath-taking CGI sequences. Two particularly spring to mind: An impressive backwards zoom out from earth's surface, past the Vogon demolition charges before the planet is so hastily disposed of, and Arthur's journey onto Magrathea's staggeringly colossal factory floor, which is simply overwhelming. Both illustrate, to great satisfaction, the dramatic readjustment of scale Arthur Dent has to undergo in such a short space of time in a stark manner that is just not possible in any medium other than cinema. The on-screen format of the guide itself is an appropriate update of the format developed for the television series, and it's highly enjoyable to see such delightfully silly animations grace a giant cinema screen.<br><br>Cinema is a different experience, and that is the nub of the matter. We are dealing with a radically different medium from any of the other that Hitchhiker's has materialised in, and not only does that offer new opportunities to explore Douglas Adams' marvellous universe, it also necessitates dramatic changes. Most noticeably, and perhaps most important for a two-hour motion picture, there is more effort to form a conventional plot than is present in the original incarnations and this change is accompanied by major changes in character motivation. This is interesting, because (here analysis becomes problematic since it is impossible to know which changes were instigated by Adams and which were down to Karey Kirkpatrick), none of the characters in Adams' earlier material really had any significant motivations that would lend them to becoming interesting protagonists in a more conventional setting.<br><br>Previously, Narcissist Zaphod wanted his ego stroked by fame and fortune, Ford was content with the prospect of a decent party to go to and Arthur's only desire was a palatable cup of tea. Trillian didn't really do anything. Although they are far from unrecognisable, the introduction of tangible drives into most of the characters alters the pattern of events in the story to accommodate what begins to resemble a more conventional story structure. One of the first casualties of this is that the principle players overshadow others, who are introduced, half-heartedly expanded upon, and then almost entirely dropped in deference to the favoured few. It never goes the whole way towards a standard structure though, as half of the principle story is seemingly abandoned in favour of a concentration on the romantic subplot and an overall resolution that is at least reverent to the previous formats. The result is a mixed bag. I found Arthur much more likable and Zaphod funnier than I ever have done, but it never actually occurred to me until the film that Arthur was a bit of a whinger and Zaphod quite boring, because I was too busy paying attention to what happened to them, rather than what they happened to do.<br><br>The other major objection, which may or may not have been inevitable, given the time that must be given over to visuals in cinema, is that the filmmakers appear to try and get too much into a two-hour film. As a result, some brilliantly funny lines are missed and key explanations fudged and both are replaced by a general silliness, which appears to be a compromise between the demands of hardcore Hitchhiker's fans and those of the cinema-going public. A lot of the new material is funny, but some of it doesn't really fit with Adams' universe and sticks out like a sore thumb. Whether this is the consequence of those responsible being caught between the rock of Adam's inventiveness and the hard place of the medium they were working in is hard to say. Perhaps someone braver could have produced something more appropriate, or perhaps this is the best that there could ever be. I suppose we'll never know.<br><br>To summarise: It's very different.","user":"ianrickard","rank":[404,548]},{"title":"By appealing to masses, it fails.","rating":4,"date":"8 May 2009","review":"I can see what they did.--- They wanted to make a movie that was still H2G2 in a sense. \"Wacky, zany, bizarre\" etc. But then they wanted it to appeal to the masses. Trillian and Arthur end up in a love story, Zaphod's turned into a prick, the plot is changed a bit, and the inclusion of slapstick humour. Even some new characters where made by DNA for the movie. <br><br>You need to remember that H2G2 in every version has contradicted itself. Each form is a different entity, so this movie should be regarded in that sense. I can see what they did.---<br><br>I personally don't like the movie much. I am a dyed in the wool fan of the books. To be fair, there are some things I do like in this. I think Zoe was exceptional as Trillian. I thought some of the visuals of the movie were brilliant. It is these parts, and the 20year slog, that gets me to a 4/10<br><br>There were moments of greatness, and it's in that that I am most upset. The greatness shows what COULD have been. A H2G2 movie could have been brilliant, but with the changes to the source; for fans of the original, it's average.<br><br>The movie I feel was tailored to a new audience. The humour feels closer to American humour than British. I'm not sure if this was intended or not. The changes where made to make it a stand alone 2hr movie with enough 'normal points' to keep non-fans happy. I don't know if it worked. I don't know if new audiences, that had never read the books (or played the game, listened to the radio, or watched the TV series), will enjoy the humour.<br><br>What really worries me is that people will see the movie, think it's terrible and than write off every other format. That would be the ultimate disgrace to DNA.<br><br>Fans will find this from average to terrible. Everyone else I only pray they seek the source.","user":"jgrayson_au","rank":[21,24]},{"title":"Hollywood butchers another great story","rating":4,"date":"30 April 2005","review":"Are you kidding me? After 25 years of waiting, this is what they come up with? Giant fly swatters smacking Arthur, Ford, and Zaphod in the face while they scream \"Waaaaa!\"? Apparently the story had to be dumbed down for mainstream audiences: just replace the wit with slapstick. And how about the unnecessarily inflated love story between Arthur and Trillian? Good grief. <br><br>Some other notable failures: 1) the very flat deliveries of some of the actors (Zooey Deschanel, Mos Def). In fact, none of the actors seemed particularly adept at comedy (except MAYBE Martin Freeman), or to have bothered with any background reading to figure out how to deliver their lines. 2) the rearrangement of Zaphod's physique (WHY?! They managed to give Zaphod 2 heads and 3 arms 20 years ago on a low budget BBC show...but they can't pull it off now?!). 3) the pointlessness of the John Malkovich character. 4) the chopping of so much funny narration and dialogue to make room for the unnecessary detours (Humma Kavula, Vogosphere). 5) Sam Rockwell's annoying accent. 6) the film makers don't even seem to know that the Restaurant at the End of the Universe is at the end of TIME, not SPACE. 7) the rare presence of the Guide itself in the film. 8) And on and on.<br><br>It was even a little bit offensive that they had the BBC cameos (Marvin, Simon Jones, the music from the opening credits) in a shameless attempt to win over the more hardcore Hitchhiker fans. I have to admit, I fell for it. For at least 10 seconds of the movie I wasn't thinking, \"Wow, this is not very good.\"<br><br>A couple things WERE good: the Vogons themselves, the Magrathean \"factory floor.\" Marvin was passable.<br><br>Watch this movie and then go see the BBC version. If you still think getting whacked in the face after stepping on a rake is funny, or seeing someone slip on a banana peel leaves you in stitches, you'll probably like the movie version better.","user":"dafamcas","rank":[141,196]}]