[{"title":"Subtley impressive","rating":10,"date":"27 January 2006","review":"I did not expect to like this film; the reviews were lackluster, and many seemed to think the leads were mediocre at best. I found the performances riveting and highly engaging. While I do not know the actual historical story, I found the storyline highly captivating.<br><br>I thought James Franco played Tristan brilliantly - broken hearted but not brooding, he seemed to only come to life during battle before meeting Isolde, and then afterward only in their stolen moments together. Many of the reviews I've read seem to think that he played the role flatly, but I thought the subtlety of expression in his eyes and body language was impressive. Confident as a warrior, but almost innocent in intimacy, I thought he walked the thin line between adult and youth effectively.<br><br>Sophia Myles captured the fire, vulnerability and desire of Isolde with fervor - and that's not easy to do. Myles delivered her lines subtly, tinting words with emotional depth -scorn, joy, passion, frustration, disappointment - that was understated and yet passionate. She, too, managed to portray a delicate balance between the innocence of idealistic youth and the realities of a woman who found her self in an unenviable position.<br><br>Rufus Sewell was fantastic. As king, he had to walk the thin line between diplomacy and his own frustrations; as a man, he came alive when with Isolde, and so her betrayal was all that more heartbreaking, a scene which he played with focus and power.<br><br>I thought the fight scenes were very well done, except for the excess of cut shots, jumping from person to person, which moved the action almost too quickly, occasionally resulting in a jagged flow of action. Overall, however, the battle scenes were very well done.<br><br>The costumes were incredible - not period realistic (especially Isolde's wedding gown) but they were beautiful and overall well designed to intimate the period but still have some glitz. The locations shots were awe-inspiring. <br><br>I LOVED these characters very shortly after they each came on screen. I rarely feel such a strong connection to characters, especially of period pieces, but each of the leads played their roles with finesse. I deeply cared about these people, seeing hope and joy rise in their eyes, only to see events quickly turn that joy to sorrow, and hope to forceful determination. Their moments of happiness are so brief, their heartbreak so complete that I found myself profoundly moved by their experiences. As deeply invested as I became with these characters, I nearly sobbed at the end of the movie. A 5-hankie tear jerker.<br><br>I eagerly await the release of the DVD, and expect to enjoy this film many times over.","user":"acts2120","rank":[150,168]},{"title":"A Timeless Love Tale Beautifully Retold!","rating":13,"date":"13 January 2006","review":"One of the great love stories from the medieval courtly romances, \"Tristan and Isolde\" has received many different treatments from medieval poets such as Gottfried of Strasbourg to the haunting opera by the nineteenth-century German composer Ricard Wagner. In each of the versions of the story, there are new and different plot details in this tragic love story.<br><br>In Kevin Reynolds' film adaptation, the most intriguing new twist from the traditional story is the way in which Tristan and Isolde meet. In this version, Tristan is given up for dead following a battle in Cornwall and washes ashore in Ireland in a boat only to be discovered by Isolde. She then uses her magical herbs to cure him. In Gottfried's medieval tale, the two young people drink a love potion from a goblet of wine. In this film, the young people fall instantly in love without any need of an elixir.<br><br>In two touching performances, the young lovers are played by James Franco and Sophia Myles. Their on-screen chemistry is electric, and their scenes together are filmed effectively by Reynolds in beautiful location settings. The film also explores themes of medieval chivalry and honor. Rufus Sewell delivers an excellent performance as King Mark caught in the love triangle that recalls the famous story of King Arthur, Lancelot, and Guineviere. <br><br>There are also great action sequences in \"Tristan and Isolde,\" including battles, tournaments, and medieval siege warfare. But the most memorable scenes are the intimate moments with Tristan and Isolde. Their fateful meeting and the unfolding of their relationship make this film worthwhile for audiences both familiar with the legend and for those being introduced to this timeless love story for the first time.","user":"lavatch","rank":[183,207]},{"title":"Tragic Lovestory with plenty of Action","rating":13,"date":"13 December 2005","review":"Tristan and Isolde is one of the most enjoyable films I've seen this year. I saw it in a preview screening without knowing anything about the film or the myth. I expected a mediocre romance, only hoping that it would be set in an interesting medieval setting and that my girlfriend would enjoy it. Well it is a story of love, but also so much more. The film has a dark undertone to it and every character is torn between hard choices of power, loyalty, friendship and in Tristan's case, love. There is plenty of both tragedy and love and although very dramatic I never felt it was being too sentimental. The battle scenes are very well done. Although realism is sometimes sacrificed for dramatic impact, this works very well for the film. Most importantly there are no invulnerable heroes. Everyone is in immediate danger of mutilation and death, making the fight scenes more intense. The casting of Tristan, Isolde and Lord Marke is perfect and most of the supporting cast do an equally great job. The absence of any Hollywood superstars makes the film all that much better. Enjoy.","user":"Calus","rank":[393,470]}]