[{"title":"An excellent movie if you can take wanting more when it's over.","rating":10,"date":"13 June 2005","review":"I just finished the movie and it really is a great piece of work. No futuristic crap mixed up though you might expect it. Miss Knightley really does a great job playing the part, though her role seems to have been kept a bit too far in the background.<br><br>The whole idea of changing the future has been brought up before, but this time instead of changing the future by altering the past it brings new perspective by altering the present by adding new info from the future. At first it reminded me very much of Butterfly Effect. If you like that one, you'll love this one.<br><br>It also shines new light on the subject whether or not you can change your own destiny which hasn't been brought up in a while.<br><br>It surely is a \"must-see\".","user":"brauner","rank":[234,299]},{"title":"Artsy Twilight Zone","rating":9,"date":"5 March 2005","review":"\"The Jacket\" has gotten some bad press because the plot has a lot of holes in it, but if you suspend belief and just enjoy the movie, it is a lot of fun.<br><br>Any film that involves time travel requires that you suspend belief, and \"The Jacket\" is no different. What makes \"The Jacket\" better than most sci-fi thrillers is the production quality. The scenes in the hospital are done in muted colors which look like hand painted black and white. The scenes in the future are done in super saturated colors. I thought the super close-ups added to the disorientation and claustrophobia of the protagonist.<br><br>The acting is first rate. Adrien Brody is convincingly haunted. Kiera Knightly does an acceptable American accent.<br><br>Fans of \"The Twilight Zone\" should like this one. It is rated \"R\" for language, nudity, sex, violence, and disturbing images in a mental hospital; so you are getting your money's worth. If you like good production quality and want to go for a thrill ride, check this one out.","user":"brenttraft","rank":[216,276]},{"title":"Jacob's Ladder meets One Flew Over the Cuckoo's Nest","rating":10,"date":"6 March 2005","review":"Jack Starks (Adrien Brody) is pronounced dead during the Gulf War. Moments later, he shows signs of life again. He's discharged and tries to get back to his normal life in Vermont. But he had a severe head injury, he had amnesia for awhile, and he has periodic blackouts and maybe hallucinations. When he winds up being blamed for a serious crime, he is sent to a psychiatric prison. While there, he is subjected to a bizarre treatment involving a straightjacket. Starks begins to learn dark secrets about the hospital and surprising truths about his life. Can he emerge from his predicament unscathed? <br><br>This is a high concept film--it's basically Jacob's Ladder (1990) meets One Flew Over The Cuckoo's Nest (1975), with touches of similar \"rubber reality\" and mental institution flicks thrown in for good measure--a dash of Donnie Darko (2001), a touch of 12 Monkeys (1995), and so on. That it resembles a high concept amalgamation of modern films may be more surprising in light of the fact that the basic idea is adapted from a 1915 Jack London novel, The Star Rover, which was published as The Jacket in the UK.<br><br>It might also be surprising to some readers that I'm giving a film that is so strongly derivative a 10. But I don't rate higher or lower based on originality or a lack of the same. To me, what matters is how well the film works, how well it is constructed for its ambitions. The Jacket is a fine piece of art.<br><br>The performances are excellent. Adrien Brody in particular is amazing. His turns in what amounts to an \"isolation chamber\" are breathtaking. All of the principal actors, including Keira Knightley, Kris Kristofferson, Jennifer Jason Leigh, Laura Marano and Kelly Lynch, produce finely nuanced work. The characterizations are demanding, as The Jacket requires them to play multiple realities, with different knowledge, relationships and attitudes to each other in most of the major scenes.<br><br>But as good as the performances are, what really stands out is the direction. This is the first John Maybury film I've seen, and if it's any indication of his other work, I can't wait to see more. His direction is constantly inventive and challenging. For example, The Jacket begins with grainy war footage like the typical CNN almost \"real-time\" footage that was so popular during Operation Desert Storm. Maybury cuts it to enhance the chaos of war. When he moves to a more \"normal\" technique, he still exhibits a strong but subtle and unique touch.<br><br>He is fond of unusual close-ups, frequently filling the screen with a character's mouth, eye, one side of their face from the cheek up, and so on. He also employs a lot of intriguing and bizarre inserts, and frequently constructs scenes with unusual pacing, often slower than other modern directors, or at least pulled like taffy on certain beats. But it's always right for a particular scene. The Jacket has a complex timeline structure that could easily fall apart in lesser hands; Maybury keeps the film easily coherent, and provides just the right amount of clues to the rubber reality aspects at just the right time. Echoing the unusual, contemplative, directorial temporal manipulations is a fine score (as if we could expect anything else) from Brian Eno.<br><br>As a rubber reality film, it's important to not watch The Jacket expecting a neat, linear, tightly-wrapped and transparent plot. As is typical for the genre, multiple interpretations are encouraged, with little pushes and prods to help along audiences who might be reluctant to embrace hermeneutics. For example, in one scene, a character says, \"We're all dead\". And for less overt subtexts, it's worthwhile to note how Jack often tends to be handled throughout the film more like a slab of meat. But whatever your interpretation, an important and relatively clear subtext is that of using one's life from this point forward to the best of one's ability to effect the kind of world one would like to see. Maybury makes sure to convey a disbelief in strong determinism, although freedom from fate in the film comes at a cost, and it may not be able to completely circumvent destiny.<br><br>Like Renny Harlin's version of The Exorcist: The Beginning (2004), The Jacket is really a \"difficult\" film that is likely to be approached with inappropriately philistine expectations that lead to complaints that it is boring or in some other way inadequate, pointless or non-entertaining. It deserves a more serious look than that. This is an excellent film.","user":"BrandtSponseller","rank":[229,295]}]