[{"title":"A Parallel","rating":10,"date":"1 February 2005","review":"I wasn't sure what to expect when I watched this movie. I was sure quite how it would fit with the Dirty Dancing title, but once I turned it on I was enraptured. I couldn't turn away and when it was over and watched it a second time.<br><br>I was uncertain at first what I would think because I'd heard it was a Sequel, I'd heard it was a Prequel and I'd heard it was a remake. But when I came out of watching it, I felt it was a movie in it's own right. If anything it was a Parallel. It present the same kind of feelings and emotions as the original Dirty Dancing. Other than that it was it's own movie.<br><br>Romola was fabulous and Diego was just so easy to watch. They had great chemistry that made the whole thing believable and realistic. I could watch them dance all day. And the music made me want to dance myself if I knew how.","user":"jaywriter","rank":[77,95]},{"title":"I had the time of my life again!","rating":9,"date":"22 March 2005","review":"Katey moves to Havana with her family in 1958. Her family expect her to date a rich buy, but then she meets the Cuban waiter Javier, he introduces her to the sensual Cuban dance'n'music. When he loses his job, indirectly because of Katey, she asks her to enter and win a dancing competition with her, so that he can take his family to America. They meet secretly and dance right in each others hearts! When the revolution breaks out, the young couple tries to prove that their love is worth fighting for. I would have liked them to just call it Havana Nights, instead, because many people have high expectations about it because of the title. If you liked the first Dirty Dancing you will love this. It is a beautiful movie about how dancing brings to young people together and mix the afro-Cuban rhythms with ballroom dance and it looks fantastic! I LOVE this movie, and the music is absolutely amazing! It makes you want to dance and I feel alive when I see the movie. If you want to have a big musical experience filed with love and drama, then enjoy every minute of this film! I hope you will let yourself flowed away to the Cuban music!","user":"Markussen_malene","rank":[33,41]},{"title":"I LOVED Dirty Dancing Havana Night's","rating":9,"date":"12 February 2005","review":"I loved this movie! It was really good. Yes it was a chick flick and a teen movie, but it was SO good and romantic! Javier (Luna) was SO hot and good. The way his body moved was amazing! The only reason I rated this movie a 9 was because I didn't like the way it ended. I thought it could have been done a little differently. But I still went out and bought the DVD!! This may sound a little crazy, but almost every night I watch it! If I could learn to dance the way they do...I would pay to learn how to dance so Cuban! It was a really good, adorable, romantic, and dramatic Movie. It had everything and more that I like to see in a movie. Many people say that they didn't like it but, I thought it was awesome.","user":"Soccer_800","rank":[68,92]}]