[{"title":"Story-driven action film with a touch of originality","rating":6,"date":"15 October 2008","review":"Wesley Snipes fans expecting a fightfest will probably be disappointed with \"Unstoppable\" / \"Nine Lives\", since the martial arts quotient is very limited. But those who prefer their action films to be driven by their stories and have a touch of originality in them will probably like this more. The originality comes mostly in the form of the hallucinogenic effects of the drug that Snipes gets injected with, and the ways director David Carson merges illusions with reality. Snipes is believably haunted by his war memories, just as he is believably disoriented by the drug; an action star like, say, Steven Seagal, would hardly be able to handle this role. Playing a police detective who is also Snipes' girlfriend, Jacqueline Obradors is uncompromisingly tough, foul-mouthed and occasionally even unpleasant, and she handles it all with conviction. And Kim Coates always makes a dependable villain. The film also contains one of the funniest lines I've heard in a long time, precisely because it's so unexpected: \"Hey, have you seen my pony?\" (**1/2)","user":"gridoon2020","rank":[14,16]},{"title":"Not a bad movie","rating":6,"date":"29 August 2004","review":"I like almost all Snipes' action movies. This one is not exception. Not a bad movie. Film tells us about some CIA guys who create some drug which affect human brain in a special way. People who take a shot of this drug starting see hallucinations And these guys lookin' for a FBI agent, and wanna interrogate him with this drug. They give an injection to Cage (Snipes) by mistake, as they thought that he was FBI agent. They just didn't know that he is not an agent, he is ex-military man. Cage starts seeing his illusions and thinks that he is still at war. Now he is trying to stay alive Not a bad movie. I like the plot, but it seems to me, that the script could be much better. I got a feeling that the screenwriter did this script during couple of days. But if you like other action movies with Snipes, I guess you'll like this one too. It's worth seeing, but only once. 3 of 5.","user":"drmkeeper","rank":[24,33]},{"title":"average plus B movie","rating":7,"date":"26 November 2005","review":"This movie was made by a team of beginners, almost everybody is unknown in the team, with the exception of Wesley Snipes. It seems to be done on a low budget, but it is ambitious, well paced, and frankly speaking I do not understand the negative reactions of many of the viewers who commented on this film. The story is in the post-war trauma genre, with the principal hero getting caught into a mistaken identity case, involved in some psychotic drugs exchange, and injected himself with the drug, which leads to personality control and is fatal if an anti-dote is not found in the next few hours. Sure, there are a lot of coincidences around to enable the story, and the film has its dose of incredible gunshots and violent fist punching, but it's not worse than in most of the blockbusters in recent years. What counts and is good in my opinion is the fact that the story is well-filmed, characters are credible and the relationship between the main character, his girl-friend including the follow-ups of the war experiences of the hero are human and credible. Acting is OK, no good special effects to mention, but the interest on what is going on is kept awake all over. The film does not seem to have been released in cinemas in the US, may have gone directly to video and DVD, and I am wondering why. Anyway, for action films lovers it's an average plus installment, not to be avoided.","user":"dromasca","rank":[11,14]}]