[{"title":"The Movie [0/10] The Experience [10/10] A TRUE CINEMATIC PARADOX!","rating":19,"date":"19 January 2019","review":"Okay - quality of the movie [0/10]\nEnjoyability of the movie [10/10]<br><br>Total paradox, right?<br><br>This is the absolute pinnacle of bad story, bad dialogue, bad editing, bad plot.. I mean, I'm saying 'bad' like there actually is any of these elements within the film. The editing makes no sense, it seems randomly cut with continuity errors, there are lines like 'What's going on with the candles and the music' when there ARE NO candles or music.. The entire thing is absurd. But what makes it truly unique is that it was done entirely seriously, this is not a tongue in cheek production like low budget bad movies that know they are catering to an audience who expect to laugh at the poor effects and story.. No, this man, Tommy Wuseau, honestly, genuinely thought he was crafting his magnum opus, masterpiece of cinema.<br><br>Is it good? Absolutely, definitely not.<br><br>However - as a movie EXPERIENCE. I watched this with some of my family, warning them it was terrible, but we had one of the funniest, most incredible bonding experiences in cinematic history - As we collectively picked apart every camera angle, wobbly set, insane use of props, costume, music that skips, repeats, continuity, edits, plot and dialogue. There is not one redeeming moment in the entire movie. Even if there is a single well crafted line (there isn't) it would have to be spoken by either a terrible actor or by Tommy himself, who's accent sounds like it was in a European car crash . We all laughed until it HURT, and for that.. I have to give the experience a 10/10. I've never enjoyed a movie more with friends and family more than this one.. EVER.<br><br>I head that the experience is similar in theatres that still show this film for precisely this reason. Everybody dresses up as their favourite character, recites every line and throws spoons at the screen every time one inexplicably ends up on screen (it's a lot.. is there a reason behind this 'artistic' decision. No. There is no reason for anything)<br><br>There is more and more to notice about this film every time I watch it.. Most recently, how the architecture of the building makes no sense whatsoever. They appear to be on the ground floor, but exiting from the other side causes them to end up on the roof - at night. It's things like this that could inspire a PhD in studying the intricate insanity and entirely non sequitur values of every moment in The Room.<br><br>Do I recommend it? Well.. how can I not. Everyone needs to see this movie at least once, after a couple of drinks and with friends. It's even funnier than Weekend at Bernies after taking magic mushrooms.<br><br>I almost died laughing from a hypoxic brain injury, unable to catch my breath - narrowly avoiding giggling myself into a coma.<br><br>The finest abdominal workout video ever made.","user":"tom-2979","rank":[73,75]},{"title":"It's like sitting on an atom bomb that's about to explode","rating":10,"date":"12 January 2004","review":"I have now seen Mr. Tommy Wiseau's cinematic tour-de-force, 'The Room'  three times. With each viewing, 'The Room' becomes more complexly  entangled in and inseparable from my own life. I no longer know where  The Room ends and I begin.  It is, without question, the worst film ever made. But this comment is in no way meant to be discouraging.  Because while The Room is the worst movie ever made it is also the  greatest way to spend a blisteringly fast 100 minutes in the dark.  Simply put, 'The Room' will change your life.  It's not just the dreadful acting or the sub-normal screenplay or the  bewildering direction or the musical score so soaked in melodrama that  you will throw up on yourself or the lunatic-making cinematography; no,  there is something so magically wrong with this movie that it can only  be the product of divine intervention. If you took the greatest  filmmakers in history and gave them all the task of purposefully  creating a film as spectacularly horrible as this not one of them, with  all their knowledge and skill, could make anything that could even be  considered as a contender. Not one line or scene would rival any moment  in The Room.  The centerpiece of this filmic holocaust is Mr. Tommy Wiseau himself.  Without him, it would still be the worst movie ever made, but with him  it is the greatest worst movie ever made. Tommy has been described as a  Cajun, a Croatian cyborg, possibly from Belgium, clearly a product of  Denmark, or maybe even not from this world or dimension. All of these  things are true at any one moment. He is a tantalizing mystery stuffed  inside an enigma wrapped in bacon and smothered in cheese. You will  fall in love with this man even as you are repelled by him from the  first moment he steps onto screen with his long Louis the Fourteenth  style black locks and thick triangular shoulders packed into an oddly  fitting suit, and his metallic steroid destroyed skin. Tommy looks out  of place, out of time and out of this world. There has never been  anything else like him. Nor will there ever be.  The Room begins with 'Johnny' (Tommy Wiseau) and his incomprehensibly  evil fiancée 'Lisa' (played by a woman with incongruously colored  eyebrows and a propensity for removing her shirt) engaging in some  light frottage, joined by, Denny, (played with a deft sense of the  absurd by Phillip Haldiman), their sexually confused teenage neighbor  who is clearly suffering from a form of aged decrepitude. When Denny,  who looks like the human version of Gleek the monkey from Superfriends,  says, in a slightly creepy yet playful tone of voice, 'I like to  watch!' as Johnny and Lisa roll around the bed in a pre-intercourse  ritual revolving around rose petals, you know you are in for a very  special movie.  After a lengthy lovemaking scene (not to worry if you miss it the first  time, they show it again in its entirety later in the movie) in which  Tommy's bizarre scaly torso and over-anatomized rear-end are lovingly  depicted over and over again as he appears to hump Lisa's hip, we  discover that Lisa, for no particular reason, has become bored with  Tommy's incessant lovemaking and decides to leave him.  Just when you think the movie might lapse into an ordinary, pedestrian  sort of badness, Johnny's best friend Mark, a man who's job seems to be  to wear James Brolin's beard from Amityville Horror, shows up and  electrifies the screen with a performance so wooden that it belongs in  the lumber section of Home Depot. Incidentally, Mark is played by Greg  Sestero, who, in addition to being described as a department store  mannequin, was also the line producer on 'The Room' and one of Tommy  Wiseau's five (5!!!!!) assistants on the movie. Lisa forces Mark, amid  his paltry, unconvincing protests, to have an affair with her on their  uncomfortable circular stairs. For no apparent reason Lisa decides that  she is made of pure evil and wants to torture her angelic and insanely  devoted fiancé, Johnny.  Lisa receives pointed advice from her mother who casually announces  that she is dying of breast cancer and then never mentions it again.  But Lisa is determined to make Johnny's life a living hell, in spite of  the fact that she, according to her mother, \"cannot survive on her own  in the cutthroat 'computer business'\". But not before they recycle the  sex scene from earlier in the movie where we get another bird's eye  view of Johnny's ludicrous naked body. Denny gets into trouble with a  drug dealer. Mark shaves his beard. Tommy gets drunk on an unusual  cocktail made from mixing whiskey and vodka. Lisa lies and tells  everyone that Tommy hit her in a drunken rage.  A balding psychologist appears out of nowhere, offers some advice, then  apparently dies while softly falling on the ground in an attempt to  catch a football thrown by Mark.  All of these seemingly disparate events build up to two cathartic  moments. The first is when Tommy expressively yells at Lisa with the  line 'You are tearing me apart Lisa!'. You will cheer at this line as  you realize that the film has been tearing you apart the whole time.  And the second is at Tommy's birthday party where the worst actor that  has ever been born plays a unidentified man wearing a silk shirt who  utters a phrase that perfectly describes the experience of watching The  Room,  'It feels like I'm sitting on atom bomb that is going to explode!'  The shocking ending will leave you pleading for some kind of sequel.  See this film at all costs. See it twice. Or three times. Or as one kid  that I met from Woodland Hills has, 12 times! See it until you can  recite every precious line of dialogue this movie has to offer. Let The  Room become your new religion and Tommy Wiseau your prophet preaching  the gospel according to Johnny.  My dream is to someday buy a theater and run The Room 24 hours a day, 7  days a week until the print disintegrates. I hope it becomes your dream  as well.","user":"brickyardjimmy","rank":[2,2]},{"title":"The Best Movie....EVER!!!","rating":29,"date":"29 February 2004","review":"OK, that may be a stretch, but I have inside knowledge into the facts. You see, I was fortunate enough to have worked on the film. As I read the reviews here, especially the last one, which I am sure was written by our amazing Director/Actor/Producer/Writer, I felt I had to respond. Having the dubious honor of saying I worked on this film, has also brought with it the responsibility of telling the truth about what happened on set. Apparently Tommy had a lot of money sitting around and decided he needed to make a film. Not being able to decide what to shoot, film or video, we shot both. Side by side. Both cameras on the same head, being operated by one camera operator. We shot almost the whole thing in the parking lot and back storage shed (read- sound stage) of a camera rental house in Hollywood. I got the call to work on the show after they had already tried to start with another crew that ended up all being dismissed. I believe that we ended up being crew 2 of 4. The show never had much organization to it from the start. We were told it would be a 3 week shoot. At the end of 3 weeks we were exactly 1/2 way done. Crew calls were usually 8 a.m. tommy would show up around 10:30 or 11. Because he would take the HD video camera home with him every night, we had no choice but to wait for him. Since we were only in one room or outside the door in the parking lot, we did not have anything to do but sit around and wait every day. When Tommy arrived we would have to see if he was in actor mode or director mode. If he was in actor mode, you were not allowed to talk to him so he could \"stay in character.\" Since he was in almost every scene, he was always in his \"actor\" mode. This also meant that he could not direct. Noting the huge delays every day and the fact that we were never seeming to get anything done, our wonderful script supervisor stepped up and became the director...at least he tried. One day he had to go off and do another show and asked if anyone else wanted to step up and direct and keep some script notes. When nobody volunteered, I stepped up. I loved it. It was my directorial genius that had tommy bump into Lisa as they were taking the bad guy off the roof! I will also take credit for the now famous line \"You are tearing me apart, Lisa!\" In the first 10 takes, tommy kept saying \"You are TAKING me apart!\" As the crew tried to keep it together, I felt I should right the situation and corrected the line. The crew was also instrumental in keeping the chicken line in. \"CHEEEEEPPPPPPP, CHEEP, CHEEP, CHEEP, CHEEP!\" We begged our scripty/director to keep him doing it take after take. Though the crew ultimately followed the original DP out the door and quit, we are all proud to have taken part in the making of this film. Amongst the film crew realms, we are minor celebrities. \"Dude, you worked on that thing?\" is a phrase that is often heard when The Room is mentioned.<br><br>I have the pleasure of driving through Hollywood every day and still seei ng the billboard for the film up and Tommy glaring at me as if to say, \"I telled you I could make movie.\" For those looking for a photo op, it's on Highland, a few blocks south of Sunset. I know that tommy took out an ad in the trade papers asking \"For Your Consideration\", I only wished that I could see him on stage accepting an Academy Award. It would be well earned. Rumor has it that he has a vampire film in the works... let's hope so... I only hope I get the opportunity to work on it. I can only hope that The Room becomes a cult classic with midnight showings. I'll put my tux on and bring a football. Perhaps I'll stand up for a Q&amp;A afterward and tell the stories I have so fondly tried to burn from my memory. My other dream is for the DVD. There are 100's of hours of behind the scenes footage out there. The camera for the behind the scenes material was always recording. ALWAYS! It will be awesome to see what took place on our set. I hope he puts it out there. I know I would buy several copies for all my friends and family.<br><br>Any questions?","user":"houndog5","rank":[593,681]}]