[{"title":"DON'T MISS THIS ONE","rating":3,"date":"3 December 2004","review":"As an old codger who doesn't usually express himself on the internet this comment is a bit out of character. We saw the film recently while holidaying in NZ, nothing to do one Sunday evening and thought a local film might be interesting. Came out gobsmacked and argued and discussed it with my partner late into the night. Wanted to see if I could get a DVD, not realising it hadn't been released in the UK, and fell into this site.<br><br>The film is a bit like a jigsaw, at first it has no shape but as bits are added it starts to make sense and the enormity of the problem Paul has inadvertently got himself into becomes clear. The story is totally believable and all the actors, even the bit parts, are brilliant and convincing. The discontinuity of the story line means you have to work to understand it, but that adds to the interest.<br><br>The scenery is great (well, it is NZ). There is a little swearing and small sex scenes but they are also well done and not overplayed, and are necessary for the plot.<br><br>Am looking forward to seeing it again","user":"alan-burnell","rank":[94,101]},{"title":"Brilliant","rating":9,"date":"18 January 2005","review":"Having had to do NZ fiction at school over a decade ago and hating it, I was not sure what to expect with this film. It has made me want to go and buy the book and get back into the wonder of my country's literary heritage... but that's another story.<br><br>This film is beautiful. It's tense, funny (some of the cameos for kiwi's to look out for additional fun!)... it takes you into the heart and soul of the characters. The two main characters are portrayed so wonderfully, you feel you're an extension of them.<br><br>Not knowing the story probably helped as I was not expecting everything that comes to pass (don't want to spoil anything). The movie, though desperate at some times, makes you feel somewhat uplifted. Hope. By the way, does anyone know who did the painting? I loved it.","user":"suze-16","rank":[46,48]},{"title":"The premiere at the 51st Sydney Film Festival","rating":13,"date":"13 June 2004","review":"Last night I was privileged to see one of the most emotional, sensitive and highly enjoyable films I have seen in many years. \"In My Father's Den\" both premiered and opened the 51st Sydney Film Festival, which is no mean feat for a New Zealand feature film.<br><br>The film is of world class standard and I predict will easily join the ranks of other noted NZ feature films such as \"Once were Warriors\", \"The Piano\" and \"Whalerider\".<br><br>The storytelling is sophisticated, delicate and richly layered in such a way, that it easily deserves a second viewing. The performances from the entire cast are compelling, but none so as extraordinary as the lead performances by newcomer Emily Barclay (as Celia) and Mathew MacFadyen (as Paul Prior). The scenes between these two are simply mesmerizing. A pure joy to watch. This film achieves what few films can claim to, and that is, to create characters, which you totally believe are living flesh and blood.<br><br>I predict from this point forward, many an accomplished actor will be beating a path to Writer/Director Brad McGann's door.<br><br>Mathew MacFadyen plays a war zone photographer returning to his former his home town to attend his fathers funeral. Set in a small township in a remote area of the South Island of New Zealand. The film beautifully dramatizes the world weary Prior against the next generation who look to leave the town and experience the world for themselves. Paul's very presence creates a ripple effect across the close knit community. Some positive, some negative. Old family wounds are opened, youthful loves remembered, new relationships are forged and dark truths revealed.<br><br>The film plays it's cards slowly and steadily at first, gradually drawing you deeper into it's web. Before long you are captivated and unable to prevent yourself from becoming emotionally involved. The audience around me were drawn deeply into this beautiful film and many moved to tears. Attendees included Director Phil Noyce, Actors Geoffrey Rush, Hugo Weaving, other luminaries and several thousand of Sydney's film fraternity.<br><br>This is one of those films that successfully stays with you after you leave the cinema. I can wholeheartedly recommend it to you.","user":"almax-2","rank":[35,39]}]