[{"title":"Great idea, but...","rating":3,"date":"9 April 2006","review":"The idea of a mockumentary on creating a stereotypical low-budget martial arts movie is great. This movie definitely had some potential - some of Lew's lines on the aspects of these martial arts movies are great! But the whole thing is just too corny to be genuinely funny. Silly celebrity sound-alike names really take away from the celebrity impersonators (\"Steven Seafood\"? Why not just like, \"Steven Seagull,\" or just use his real name? I think laws on parody would have had them covered). <br><br>Add to that very poor editing, with lines obviously recorded afterwards and edited in (they even overlap what the on screen character is saying) and a \"fart fight\" scene, and the whole thing just goes down the chutes.<br><br>It's really unfortunate that some of the best scenes are in the trailer! It opened promisingly enough (\"I'm Deadly Thug #1!\") but just couldn't keep up. Worth a rent maybe, but that's about it.","user":"Invader_J","rank":[7,7]},{"title":"Shoot me now","rating":1,"date":"12 April 2006","review":"This movie is absolutely horrible. Let me clarify, the first 20 minutes that I forced down were absolutely horrible. This movie is about as interesting as air. It's sad that it compares itself with Kung Fu Hustle. Using the same font and graphics layout as the Kung Fu Hustle DVD did. Don't be fooled. This is just a wanna-be decent movie hiding beneath a decent cover and some huge martial artists who aren't even given decent rolls. If you want to see a good funny martial arts movie check out: Kung Fu Hustle, Shaolin Soccer, or any other Stephen Chow film. This movie doesn't even compare to Kung Pow: Enter the Fist. I like stupid movies, but the movie still needs to be entertaining.","user":"krabbit","rank":[13,18]},{"title":"The worst movie ever made to date","rating":1,"date":"25 August 2006","review":"I went into seeing this with no idea of the concept &amp; no notion of what I would be watching.<br><br>It was 4 house-mates &amp; friends, along with myself. Total 5 people, all with vastly differing movie tastes to say the least. However there is one thing were were all unified on for once, it took us less than 30 minutes to decide to turn this movie off &amp; save what few braincells we had that either thankfully slept thru this torture or didn't succeed at committing suicide in a rage against me for forcing them to acknowledge this trash.<br><br>Since I cant submit a rating of 0 for the movie, I was forced to give it a rating of 1, which in my opinion is 2 more than it deserves.<br><br>Save yourself the time wasted &amp; the mental anguish &amp; AVOID this movie!","user":"y2john","rank":[9,12]}]