[{"title":"People seem to be missing the point","rating":10,"date":"10 July 2012","review":"This review gives everything away, so see the movie first.<br><br>It is neither allegory nor satire, the two finest categories in both fiction and cinema, and yet it approaches perfection anyway. It is of a nature I have no name for, but it is a nature that reveals truth and undermines falsehoods. <br><br>Nothing is more cloaked in falsehood than the victor's depiction of past wars. It is especially true of the children of the victors--especially the children of US WWII veterans, like myself.<br><br>We get our view of the war from movies like Audi Murphy in To Hell and Back or Saving Private Ryan. Nothing but praise for our heroes and cheers for killing the enemy. <br><br>But QT exposes this hypocrisy by engineering a film where we are disgusted first by the excesses of the enemy and then by the excesses of our heroes. That is the first instance. The hypocrisy is slammed home in the second instance where we are first disgusted by the sight of American after American being shot dead by by a German sniper hero and secondly brought to revel in the butchery of several hundred enemy at the hands of our heroes. Tit for tat.<br><br>It fits the pattern of praise for our heroes and cheers for killing the enemy, but because it is presented both ways the hypocrisy becomes self- evident. This is why so many people hate the movie--even if they fail to realize it. High art, true art, 10 of 10.","user":"ablewuzi","rank":[256,356]},{"title":"Who the hell is Christoph Waltz?","rating":10,"date":"25 August 2009","review":"That's what I thought, when I heard about the cast of Inglorious Basterds. And I'm both from Germany and into movies.<br><br>That guy is older than 50 and so far he almost only played in mediocre TV series - and even there he didn't play the main parts. Obviously nobody ever noticed, what he's capable of. Now, thanks to QT, he got one shot to change that - and - let's put it this way - that was a bingo! He is the living proof of what a great caster Tarrantino is.<br><br>By the way: I think it's a great privilege to watch the movie as a German - being able to understand everything. And the German dialog is written almost as good as the English.<br><br>Now I could repeat, what many others have written here before. I'll put it short: Finally, QT is back.","user":"paulmuehlendahl","rank":[571,859]},{"title":"153 minutes of patches","rating":5,"date":"24 August 2009","review":"After watching Inglorious Basterds i was really surprised when i saw ratings on IMDb. Didn't expected high ratings and top 250 place. If we can only isolate and rate Christoph Waltz's acting performance i would agree that this movie deserves 10. But he is not alone, and his performance can't cover horrible plot, boring conversations, unfunny characters, alternative QT WW2 fantasy and Eli Roth as Jew bear. <br><br>The opening scene with Denis Menochet as farmer and Christoph Waltz as SS officer is best part of the movie. Only part that have same quality and connects tension from that scene with the rest of the movie is a basement scene. Basement scene was crossroad for me. Michael Fassbender was great in role of British spy and his character adds some new layer of logic and realism in movie. In moments you can actually see some plot finally breaking through the rubbish you watched after the farm scene. After the basement chapter, movie is going nowhere. <br><br>Empty space. A lot of empty space for movie that last 153 minutes. Long and boring scenes with boring characters and conversations. Childish fantasy mixed up with Spaghetti western movies and some atmosphere that don't belong to WW2 period. Thats why we have basterds to fill everything else and patch the rest of movie. They failed. Basterds are weakest/undeveloped and most boring part of movie. Movie is named by them, yes - Brad is on Movie poster ... but they are horrible. Worst role of Mr Pitt and i hope last one from Eli Roth. <br><br>Cinema/Shosanna story with David Bowie music was just another QT patch v1.1 to fill huge empty space between farm and basement. Extremely boring scenes with Mélanie Laurent (taking off cinema letters, red dresses, secret love Marcel...) will blast your brain. Yes - headache is a must. <br><br>Beside 2 good scenes, i really enjoyed listening smooth gradient of German, French and English language. But again, this is connected to Waltz and Fassbender and their personal knowledge that Tarantino used for his fantasy. <br><br>Inglorious Basterds is Hybrid movie where gangsters are replaced with Nazis adding them wild west background layer with Brad Pitt on movie poster just to sell tickets. It doesn't work in this case.<br><br>5/10 - only for Christoph Waltz and Michael Fassbender.","user":"VaultBoyX","rank":[920,1]}]