[{"title":"Well-paced fun","rating":8,"date":"8 October 2005","review":"I was astonished at the dismal rating for this film, which at the time of this writing was 4.8. Into the Blue never demonstrated any pretense of becoming the next academy award winner, and instead faithfully executed its focus -- beautiful ocean scenery, beautiful bodies, and a significant degree of tension and action to carry the plot. I found the characters believable, especially given the target audience of the movie: the dialog was fairly cleverly humorous, but serious when it needed to be; the characters were adequately conceived, including the intentionally unlikeable 4th party woman who \"wasn't family.\" Most of all, I enjoyed the pacing of the movie. Some slow underwater scenes were accompanied by peaceful music belying the increasingly perilous situations the characters found themselves in. Halfway through the movie, the tension never fully dissipates, as each event flows into the next as the stakes rise. The badguys are dealt with intelligently, and there are enough twists to convincingly carry the instability and danger of the situation.<br><br>I went into this movie wanting to enjoy it, and I wasn't disappointed. Though its premise wasn't the most intellectual of premises, I don't feel as if it were dumbed down as much as many action movies do, and instead carried out is plot with due respect given its expectations. I'd recommend this movie as a good post-summer adventure flick!","user":"Spellvexit","rank":[167,207]},{"title":"Visually stunning in every respect","rating":7,"date":"14 January 2007","review":"Fou young divers come across a legendary shipwreck that is rumoured to contain millions in gold, but nearby to their lucky find is another more sinister mystery. As rival treasure hunters begin to suspect their discovery, their friendships and loyalties are tested; and they must make haste before they become the hunted along with the treasure.<br><br>The story is solid enough, and in truth it was well above my expectations, captivating my interest very early on and remaining suspenseful and intriguing enough throughout the picture. The cast are all good enough, although they were probably chosen as much for their looks as their acting abilities, but who can deny that Jessica Alba and Ashley Scott did add a sexy feel for the male audience, and i guess Paul Walker and Scott Caan did the same for the ladies.<br><br>What really made the film for me was the truly fantastic scenery and the underwater camera work; it was flawless and stunningly beautiful in a way that is rarely captured on film, three cheers for the direction and the film crew for that.<br><br>7/10","user":"mjw2305","rank":[49,59]},{"title":"call me crazy","rating":8,"date":"22 October 2005","review":"I'm pretty critical of most pop films, but I thought this was one of the best ones to come out in awhile. The underwater cinematography was amazing - totally worth the matinée price and cheaper than diving- the kind of film you need the bigscreen to enjoy. <br><br>Sure I love much more clever crafted films , but for the MTV generation this film had just enough, maybe the fact that I am an ocean person, have a thing for treasure, the romance of lost properties and jessica alba- i was totally enjoying it. <br><br>I thought the casting was great- sure Paul really cant act, but he reminded of more than a handful of people I went to highschool with - so I could believe it- his obnxious pompous buddy was classic and some of the underlying subplots of human greed are so universal that I actually felt something for these morons. <br><br>The real star is the ocean here and the good guy/ bad guy looked like my step brother and fit the bill. Anyhow i doubt this film will do very little justice on a small screen, but overall the script was solid and the sea animal work was mind blowing. <br><br>Maybe I was just in the mood - but i enjoyed it and watching alba swim, god she is gorgeous. Didn't change my life, but I was entertained to the end.","user":"cody-63","rank":[155,209]}]