[{"title":"Clean, fun fairy tale","rating":6,"date":"21 August 2004","review":"How refreshing to attend a non-animated, G-rated movie and enjoy it!  As a 41-year-old woman attending with an 82-year-old friend, I expected a light, pretty, romantic fairy tale, and that's exactly what I got.  Never saw the first movie, but the \"catch-up\" work at the beginning made that a non-issue.<br><br>Surely, no one would go to this movie expecting to find the meaning of life portrayed on the screen.  Come on, folks, this is a Disney princess flick with Julie Andrews and a G-rating; is anybody expecting deep philosophy?<br><br>Chick flick?  Of course!  Especially appealing to young (under 18) chicks? Definitely!  Enjoyable to other adult women and men who just want a happy trip to fantasy land with no worries about sex, blood, or blue language? Absolutely!<br><br>Take this film at face value and you'll enjoy it.  If you can't do that, don't bother seeing it.  There are plenty of other \"profound\" movies out there to inspire, teach, or depress you!  Go for a good time and you'll have it.","user":"kellychitwood","rank":[62,75]},{"title":"A feel-good movie","rating":7,"date":"26 July 2005","review":"I remember seeing the first movie not expecting much from it, but when I walked out I was pleasantly surprised! When I saw the previews to this movie I thought \"Oh god! Another movie ruined by a sequel!\" I was slightly wrong in my thinking, because this was in fact a cute, light-hearted, feel-good movie. Maybe it's not as good as the first, but I still thought it was rather enjoyable. Anne Hathaway is a great actress and I'm so glad her talent was discovered and recognized. Julie Andrews gave a great performance as the former Queen of Genovia. This movie may have been predictable and a big ball of fluff, but what do you expect to a sequel to a Disney movie where Pixar wasn't involved? I would recommend this movie to anyone, just as long as you go into it knowing it's different from the first. I'm just praying there won't be a third movie.","user":"lilcutie18613","rank":[33,40]},{"title":"Princess Mia grows into her power, adding bite to this tween rom com","rating":6,"date":"10 December 2004","review":"What does it mean to be a princess? Besides wearing tiaras and twin sets, dancing at ballsattracting fame and fortune simply for being beautiful? A princess is stuck forever in extended adolescence  she only has the trappings of power. Symbolically, at least, a queen has real power, and does not necessarily need to be beautiful. <br><br>For hundreds of years, fairy tales have filtered through our consciousness to involuntarily fuel our dreams. In the last century, what began as cautionary tales to lecture children have been sugar-spun into a Disneyfied notion of desire. But with Disney's latest, Princess Diaries 2: Royal Engagement, the recent trend of recasting fairy tales to reflect modern ideals continues, albeit with a gentler hand than yesteryear's feminists. <br><br>Simply, it's not enough to be a princess anymore. Although ostensibly a conventional tween romantic comedy, Princess Diaries 2 features a heroine who is more independent than Drew Barrymore's character in Ever After (1998) and less frustrated than Julia Stiles' Mary Donaldson clone in the The Prince and Me (2004). And, even better, in Princess Diaries 2, there are no handsome princes, just boys on the side.<br><br>I'm not a fan of much of director Gary Marshall's work  although Pretty Woman's a classic, Runaway Bride, Raising Helen and the original Princess Diaries are very ordinary films. But in this enchanting sequel, he and screenwriter Shonda Rhimes give us a character who's not just beautiful, klutzy and funny. Mia Mignonette Thermopoulos Rinaldi is growing into her power.<br><br>Princess Diaries 2 begins five years after the original at Mia's 21st birthday party. After the schemings of John Rhys Davies triggers an ancient Genovian law, Mia has one month to marry, otherwise she will forfeit the throne. As two very different suitors court her, Mia relies on her now affectionate relationship with her grandmother, Queen Clarisse (Julie Andrews), to guide her. Meanwhile security chief Joe (Hector Elizondo) woos the Queen.<br><br>There are hackneyed moments, the worst of which is a pajama party featuring dozens of little princesses who are designed to reflect their aspirant audience. Although enjoyable, this scene serves no dramatic function, except perhaps to showcase Julie Andrew's expertise in mattress surfing. The change in Queen Clarisse's character is also unexplained  she's transformed from being an acerbic biddy in the first film to being the dream grandmother. However, this film is entertaining, humorous and has a positive message. The cast and characters are also strong, particularly Anne Hathaway as Mia, and there's plenty of chemistry between her and Nicholas (Chris Pine). Heather Matarazzo and Fat Louie the cat also make brief appearances.<br><br>Princess Diaries 2: Royal Engagement improves on the original, and will be a particular hit with its target audience: tween and teen girls. But this film's got enough substance to appeal to an older audienceif you let it. ***/***** stars.","user":"colettesplace","rank":[41,56]}]