[{"title":"....","rating":10,"date":"10 November 2004","review":"One thing that people often overlook is how different the viewpoints of westerners or non- Chinese and Chinese are when watching the same film. Zhang's Hero was panned by a lot of Chinese film critics, and HOFD has been the target of several withering attacks as well, by man on the street as well as film critic. <br><br>There are some nuances to the film that only Chinese viewers can appreciate--such as the dialogue, which in translation might seem perfectly reasonable, but which makes Chinese people laugh. We've seen enough costume dramas and period pieces, and have good enough sense of our history, to know what is believable and what is not. The way they wrote the dialogue, which is literary Chinese, but not quite, came off just hokey, especially when coming out of the mouths of Kaneshiro and Andy Lau. It's not just their mandarin is not what we are used to, but perhaps because in our minds they are part of pop culture, and thus you get some of the Keanu reeves doing Shakespeare kind of effect. It just falls short.<br><br>And this is not to mention how unbelievable the love story is. I can't fathom why people consider this top-notch acting. The most popular actors are not necessarily the best actors--there are plenty of underrated Chinese character actors out there that could have burned a hole through any of these roles. Somehow, some people believe that just because set up the right premises--love, honor, loyalty, etc etc that will you automatically achieve something profound. <br><br>Chinese people love martial arts and wuxia novels to be sure, but many of the people I talked to found Zhang Ziyi's xiao mei character dying and then seemingly reviving to be just silly. I would argue that in a movie that is patently a \"fantasy\" movie of sorts that you have to be fair and suspend disbelief, and they do say that she never pulled out the dagger in her heart, which is why she could stay alive long enough to utter some more hokum.<br><br>I also agree with others that a final showdown between the House of Flying Daggers and the government police would have provided more of a sense of \"closure\" for the audience. I say this because whenever you have a premise like the end of a Chinese dynasty, outlaw groups attempting the overthrow of the government, you've got a great set up for a story, especially it is precisely the end of eras and beginning of new eras (dynasties) which capture the Chinese imagination. In the chaos of a crumbling order, men are men, both the best of heroes and worst of villains is likely to appear. The bonds that tie human beings together are strained, put through the crucible of a cruel death for being on the wrong side.<br><br>Which is why it would have been nice if this so called romance or love story could have embedded in the larger framework of a story of the battle between the mysterious House of Flying Daggers and the remnants of the tang Dynasty.<br><br>one more note: the whole spy, double double crossing thing is getting kind of old, considering infernal affairs and all the other new cop movies coming out of Hong Kong. I see that cinematic ally, there are always more CG effects to use, to bring us into the wuxia world...but intellectually, HOFD shows that these mainstream Chinese films have already pumped the well entirely dry.","user":"peijin","rank":[119,150]},{"title":"Following on from HERO with another visually arresting feature...","rating":9,"date":"20 November 2004","review":"After absolutely loving 'Hero', I couldn't wait for Zhang Yimou's latest Wuxia Pien feature to arrive on DVD. After watching it, I'm happy to say I wasn't disappointed, as it is another sumptuous, stylistic feature, which deserves all the accolades it is likely to receive.<br><br>The plot of the film is told in a more linear narrative when compared to that of 'Hero', but that is not to say it is any more straightforward. Set in the Tang Dynasty, the basic premise is nothing to write home about, featuring government officials on the trail of an underground rebel alliance 'The House of Flying Daggers'. However, there is enough characterisation and depth to hold your attention, while the (sometimes predictable) plot twists keep you guessing. Unfortunately, there is nothing entirely new about this story and it's probably familiar ground to fans of the wuxia genre. Nevertheless, it flows at a decent pace and is punctuated with enough stylistic action sequences that the 2-hour running time is quickly exhausted.<br><br>As with Yimou's impressive previous feature, Tony Ching Siu-tung takes over the action direction, producing another sterling performance. In my opinion, he is currently the top fight choreographer around after spending so many years being considered second fiddle to the likes of Yuen Wo-ping and Sammo Hung; he now deserves to be considered above them on his current output. In this instance, much of the overt stylisation evident in Hero is played down in favour of more grounded, natural martial artistry. There is still plenty of wire work and a spattering of CGI to aid the sequences, however, it is plain to see that much of the action displayed is a mix of genuine swordplay and actual technique. All the performers acquit themselves well considering none of them are formally trained in martial arts  especially Zhang Ziyi who performs impressively from start to finish.<br><br>As you would expect from a Zhang Yimou film, the visuals are majestic, with primary colours and panoramic landscapes making up much of what we see. Unfortunately, many people do not seem to take to this artistic approach, and will label the film another case of style over substance. I would disagree, as I believe it contains plenty of both with a strong cast, interesting characters and high quality action to provide the foundation for the kind of bold, sumptuous visuals, which are rare to find in modern film.<br><br>Overall, I personally prefer 'Hero' but know of plenty who would disagree. As a result, I recommend it as a definite purchase to any fan of films from this genre.","user":"tpr007","rank":[129,169]},{"title":"A feast for the senses, a fully satisfying cinematic experience.","rating":8,"date":"20 April 2005","review":"Shi Mian Mai Fu belongs to a growing body of work that embodies a clearly Asian aesthetic packaged just as clearly for Western consumption. It is no coincidence that, each time I paused the DVD for whatever reason, the still image on the screen was as beautiful as any classic wood block print by Hiroshige or Hokusai. Xiaoding Zhao's elegant cinematography imbues every scene with haunting beauty. Think Tak Fujimoto times ten, with no disrespect meant to Fujimoto, who shoots Western movies and still manages to inject his refined visual sense into such great films as Silence of the Lambs and Sixth Sense.<br><br>Director Yimou Zhang's work in Hero was more epic, more heroic, but SMMF has a more refined sense of story. The cast, the scenery, the music, including vocal performances by the legendary Kathleen Battle; all elements conspire brilliantly to convey subtle and nuanced meaning in moments. The story, as do all good stories of this genre, revolves around a delicate interplay of love, betrayal, deception and heroism of many different kinds, and, oh yes, those stunning ballets of combat layered with evocative sounds and effects.<br><br>In a nutshell, the plot goes something like this. A beautiful blind showgirl is captured as a spy. Her captors conspire to trick her into leading them to her leader. Along the way, both hunter and quarry become entangled in a web of subterfuge and deception. Add in a beautifully tragic romantic story line, again, as all such movies must have, and never forget that the essence of all truly great tragedy is inevitability.<br><br>This movie is also known as Ambush From Ten Sides, and in that more literal translation of its title you will find its essence. A worthy successor to Hero, though not as magnificent as Crouching Tiger Hidden Dragon, in which Ziyi Zhang gives the performance of a lifetime and the one against all her other roles will be judged, and in this case, fall short, House of Flying Daggars is nevertheless a feast for the senses and a fully satisfying cinematic experience.","user":"budmassey","rank":[57,73]}]