[{"title":"A Nutshell Review: The Myth","rating":8,"date":"22 September 2005","review":"This film was pretty hyped up for many reasons. Jackie Chan, after the relatively successful return to HK movie industry with the release of New Police Story, teams up once again with Stanley Tong (Rumble in the Bronx) for starters. Tong wrote the story of The Myth, casting Jackie Chan in a never seen before role (yes, audiences are tired with his cop roles already) as a Qin dynasty general. What's refreshing too is that the role requires the use of a real weapon (a sword in this case), rather than having JC's character improvising with tools from his environment.<br><br>As most would already know from the trailer and poster, JC plays Jack Chan (about time they come up with better names too), an archaeologist who dreams about a Korean princess whom he's escorting to the Qin emperor as his new concubine. It's a recurring dream, and before you can say \"Indiana Jones\", he's off to locales he sees in his dream world to try and unravel its mystery, while research companion Tony Leung (The Lover) irks him along the way with tomb raiding in the name of scientific studies.<br><br>The story, while it might be original for a Jackie Chan movie, seemed a little cliché. It plays like a young boy's fantasy of snagging that exotic oriental princess, enjoying the support of the troop masses, having utmost loyalty to the king, and blessed with good fighting skills topped with a signature sword. And with the Qin dynasty, you're usually reduced to plots which may include the Great Wall, beautiful consorts, or the pill of Immortality.<br><br>The Myth looks and feels like a classic JC movie in terms of production values, like the familiar fight-with-the-baddies-acrobatic-stunts scenes, and physical humour injected at certain points. However, I guess with JC's age, the number of fight scenes have been reduced, and somewhat slowed down deliberately. The fight at the Rat Glue Factory stood out for being a combination of both brawn and injected situational humour. On the other hand, The Myth signifies new developments in a typical JC storyline, with the introduction of drama-mama romance (nothing much romantic though, with being comatose in all the good bits and lots of lingering stares), and a surprise(?) epilogue for his Qin character. And the \"No blood no sex\" unofficial clause goes out the window too.<br><br>Despite its huge budget, the special effects were not refined, which was a pity. The \"blue screen\" effect is obvious, even to the untrained eye, and there were a tad too many \"lazy extras\" who, in wide angled, supposedly big epic fight scenes, just stood, danced, moved around, anything but fight realistically. The original Highlander perfected the art of transitioning between flashbacks and present time, while The Myth falters, looking seemingly forced and contrived at times, or opted for the cheap way out - the blackouts.<br><br>As with most JC films, the women here play \"flower vases\". But I'm not complaining. Kim Hee-seon was beautiful in her role as the princess, and in the blooper reel, she was actually speaking Mandarin, and having a hard time remembering her lines. Mallika Sherawat was sizzling as she dandied around in flimsical dresses, while executing those high kicks, and I guess the entire run up to the Rat Glue Factory might turn out to be a fan favourite.<br><br>Many in the audience were surprised when the characters started speaking in Cantonese (for settings in modern day Hong Kong), and the local censors had no issue with that, instead of dubbing over the lines with Mandarin. Now that's a thumbs up.<br><br>So enjoy The Myth for what it is, just don't expect too much from a simple predictable storyline, and for some illogical and improbable scenes (I can't stand the horse back-kicking bits) that plays out like Michelle Yeoh's The Touch or even JC's own The Medallion.","user":"DICK STEEL","rank":[58,68]},{"title":"brilliant jackie chan movie","rating":11,"date":"11 April 2006","review":"This is a much better movie than previous jc movies made in Hollywood! There is more of a story and more drama. The scenery is excellent. It really brings out the beauty China and India has to offer. After reading several comments from reviewers i can not understand that they did not like this movie. Yes it's more serious, yes it is not typical JC action. But people forget JC is not up to his stunts because of his age. Still he kicks ass like the martial artist he is. I am a Jackie Chan fan since i could watch movies (5 years old)! And i have always liked his movies until he made real bad ones in Hollywood! Since his return in Hongkong you can see the improvement (maybe freedom he has making this movie)! The use of CGI was fitting for this kind of story.Honestly i really was moved by the story. People who love action you will get what you want,amazing stunts and the best martial arts! Also you romantic lovers will not be disappointed! I have only one point of criticism and that is the abrupt ending! But overall one of the better (Jackie Chan) movies made these last years.","user":"chrichtonsworld","rank":[34,42]},{"title":"Worth it for the rat glue factory scene alone","rating":7,"date":"28 November 2005","review":"It's worth seeing the movie just even for the rat glue factory scene. It's a wonderful Jackie Chan physical comedy combined with a really nice striptease from the super hot Indian actress. Sure to become a classic scene.<br><br>The rest of the movie constitutes of a historical \"Hero\" like war martial art action with some modern Jackie Chan slapstick. The plot is very tenuous and was probably written after someone wanted a story with Chinese history combined with a modern drive towards the nascent Chinese scientific and technological resurgence.<br><br>Jackie Chan plays an Indiana Jones like archaeologist which spirals into a Lara Croft style adventure of finding very strange but mindbogglingly powerful things. Meanwhile a very hazy parallel story runs of a concubine who falls for a general played by Jackie Chan a few hundreds years in the past. There is anti-gravity devices and immortality pills thrown in as well.<br><br>Though it does get really cheesy and maudlin at times, it's a really fun movie to watch.","user":"MosHr","rank":[30,38]}]