[{"title":"A Victory for Game of Their Lives","rating":8,"date":"23 April 2005","review":"First and foremost, I'm hardly a soccer expert and barely a soccer fan so this commentary comes strictly from a movie fan and a fan who enjoys critiquing films. That said, I found The Game of Their Lives to be a solid film. It's a product of the same mind that brought us \"Rudy\" and \"Hoosiers\" and one can expect similar results. It tells the tale of the 1950 US World Cup team that shockingly beat England (though did not win the World Cup itself) It begins in St Louis, providing backgrounds and insight into the lives and families of the St Louisians who later will be on the World Cup Team.<br><br>Strong performances from Wes Bentley and Gerard Butler lead this film to the final victory. Bentley and Butler portray the leaders of the team (Walter Bahr and Frank Borghi, respectively) with likability and believability. The supporting cast that rounds out the team also turn out performances that will keep you involved with wanting to route for this team. Don't expect an electric atmosphere, however, as this story is told from a reporter reminiscing. <br><br>The Game of Their Lives offers character development for the team members without ever straying from the subject at hand. Through their actions on and off the field, the audience can get a taste for who these men were. Much homage and respect is also deservingly paid to England for their magnificent history in the sport. This is not one of those ports films that serves to make the United States seem over glorious and under mind the greatness of England, as many assume it will. I for one walked away from this film with a greater respect for England and what they've done, and continue to do, for the sport","user":"JenUF","rank":[22,24]},{"title":"This will be more than a just soccer movie.","rating":17,"date":"17 May 2004","review":"This film records the most unlikely upset in World Cup history, the 1-0 United States defeat of England in the Brazilian mining city of Belo Horizonte (\"Beautiful Horizon\"), 300 miles north of Rio di Janeiro, on June 29, 1950. The United States was a team of part time amateurs who were drawn against the mighty English squad, playing in its first World Cup and determined to show the world their mastery of the game they had invented. Football fans who saw the score reported assumed the score line was a typographical error, as it was unthinkable that the US could even stay with, much less defeat, an English side which featured some of the games all time great players, including Billy Wright, Sir Stanley Matthews (who sat out the match), Stan Mortenson and Wilf Mannion. London bookmakers offered odds of 500-1 against such an preposterous event. The New York Times refused to run the score when it was first reported, deeming it a hoax. <br><br>The US team was a collection of first generation American soccer players drawn mainly from club teams on the east coast and included five St. Louisans, four of whom grew up in the \"Hill\" neighborhood of South St. Louis: goalie Frank Borghi, fullback Frank Colombo, forward Gino Pariani, and midfielder Frank \"Pee Wee\" Wallace, and also the long time St. Louis University soccer coach, halfback Harry Keough. The US had only one full time professional player on its roster, Hugh McIllvenny from Scotland. They had played together only two weeks when they departed for Brazil. They'd lost to Italy in a World Cup warm up by the score of 9-0, and had been defeated by Spain in the World Cup opener 3-1.<br><br>It was reported that the American players were so confident that victory was unlikely that several of them were out late the night before the game enjoying themselves and sported hangovers at the opening kickoff. Borghi was quoted afterwards as saying he was hoping to hold the English to five or six goals. The English team poured forward, firing shot after shot at goalie Borghi, but could not score. Six minutes before half time, U.S. center forward Joe Gaetgens, a Haitian born dishwasher living in New York, redirected with a lunging header a shot by half back Walter Bahr, who is himself, incidentally, the long time Penn State soccer coach and the father of NFL placekickers and former Penn State soccer players Chris and Matt Bahr. The misdirected shot beat England keeper Bert Williams, and the single goal stood up through a second half where the Americans withstood constant English pressure and numerous near misses, including three shots off the woodwork.<br><br>The Brazilian crowd thoroughly enjoyed the failures of the pretournament favorites and carried the US team off the field after the final whistle. The game was noteworthy for the complete lack of interest in the result by the American press and public. The only American reporter at the game, Dent McSkimming of the St. Louis Post Dispatch, used his vacation time and paid his own way to Brazil to cover the game. <br><br>Author Geoffrey Douglas' book advances the premise that the victory was not a fluke when one considers the character and promise of the winning American players, as evidenced by the upstanding and honorable men they came to be.<br><br>Trivia: the English national soccer team has never again worn blue shirts they wore against the US in that game.<br><br>The film was shot on location in St. Louis and Brazil, and features former US National Soccer Team Captain John Harkes as a consultant and soccer playing extra.","user":"peterdunne02","rank":[62,74]},{"title":"Loved the look and feel of this film----","rating":9,"date":"25 April 2005","review":"\"The Game Of Their Lives\" lives up to expectations as a exciting underdog sports movie. I loved it. Saw it in a theater with only 3 other people - at noon, on a Monday, raining - but it didn't matter because I was engaged and wrapped up in the 1950's story of a bunch of ordinary guys who did something extraordinary.<br><br>Based on a real event with real, still living, people it is about heros of WWII who came home and went about their lives until asked to form a team for the World Cup soccer matches. They have only weeks and decide to get some players from the east coast and some from one area of St. Louis, MO. from the Italian enclave known as The Hill.<br><br>Frank Borghi (Gerard Butler) is the goalie and a leader of the group. The challenge is to get the whole group to pull together and mesh the different styles to make a team that may make a good showing. They don't expect to win as most of the teams they will play are more or less professionals and/or have played together for years.<br><br>The soccer playing is exciting even for this old gal who knows little about the game. The cinematography is very good and keeps the pace of the game and shots of the crowds and sports announcers ticking along and by the end when time runs out on the English players, and the Americans have won this great upset, I was ready to cheer too.<br><br>I disagree with most of the reviews I have read. This is a good sports movie and the performances and pacing are as good as \"Rudy\" or any other underdog film.<br><br>One thing I loved was the look of the people and homes and cars. It was the 1950's again and the music I danced to was just right. One for my movie collection. 9/10","user":"Ishallwearpurple","rank":[27,31]}]