[{"title":"On the Road to Becoming a Yakuza","rating":7,"date":"7 October 2004","review":"If one pays scant attention to the news in Japan, seen Iwai Shunji's _All About Lily Chou Chou_, or read short stories and novels by Murakami Ryu, one knows that Japan, like other countries, suffers from an escalation of violence in schools. This violence works in three ways: student vs. teacher, teacher vs. student, and, the most common, student vs. student. Although it is still rare, the newspapers and news programs are peppered with stories of bullies beating someone to death or the bullied killing his bullies. Murakami Ryu and Yu Miri have both focused on these subjects in their literary works. Toyoda Toshiaki, through his film _Blue Spring_ also touches on this controversial subject.<br><br>The kids attending the all boys Asahi High School would basically be considered the dregs of Japanese society. The school is rundown and the teachers teach such a drypan, apathetic manner that it is not surprising that the kids could care less. The only teacher who seems to actually care about any of his students is a dwarf who waters the flowers on the school grounds all day.<br><br>However, although the teaching might be unstructured, there is a rigid code of hierarchy enforced by the tough kids. A leader is chosen by a suicidal ritual in which a student claps his hands as many times as possible while falling backwards. After he claps a certain amount of times, he grabs the guardrail. Miss the guardrail, instant pancake.<br><br>At the beginning of this film, after the \"graduation\" of the senior class, Kujo, played by the extraordinarily handsome Matsuda Ryuhei, wins the contest. Kujo is a bit indifferent to his new found power, but goes along with it because he has the support of his friends: Aoki, Yukio, Yoshimura, and Kimura. <br><br>Although many of the students are not satisfied with the way their lives are shaping, they seem to basically concede that good jobs and college are not in their future and that they are either on the track to become either a menial laborer or a member of the Yakuza.<br><br>_Blue Spring_ is an interesting film that depicts individuals who are not on the \"normal road of becoming a good Japanese citizen\": i.e. Graduation, work, stable family. It shows the dregs, but the dregs also show that social hierarchy exists from the lowest to the highest.<br><br>I think that the film is quite well done. The filming is dark, but it fits the atmosphere of the film. The soundtrack is excellent.","user":"Meganeguard","rank":[22,24]},{"title":"Facing Reality, Growing up is tough","rating":23,"date":"23 October 2004","review":"With a Soundtrack from 'Thee Michelle Gun Elephant' that most English Indie Producers would kill for, and amazing cast and crew. Aoi Haru draws us into the lives of Japanese teenagers who aren't so lucky in life, who have to make their own destiny from the left over scraps of others who happen to throw them their way.<br><br>Aoi Haru is based in a public all boys school called Asahi High. <br><br>A extremely miserable place where teachers don't bother to encourage the boys to excel, gang graffiti tags are everywhere marking their turf, and the yakuza's frequently hang around outside the school trying to recruit young members. <br><br>The boys learn early on that if you don't fight for what is yours and what you want, then you better keep your mouth shut and stay out of the way. And even though these boys do act tough and dish out violence like a ice cube down the back of your shirt, the boys feel lost and confused due to the fact they cannot understand why they can not make their dreams come true. Almost feeling forced into the violence and self destruction they create because it will be their only real legacy they can leave behind before they enter the real world and pretty much dead end lives. <br><br>On the 25th Graduation ceremony at Asahi High a group of the new seniors head up to the Schools roof for a deadly tradition held by the boys who wish to rule the school. A initiation that involves the boys hanging off the side of the building and seeing how many claps they can do before they give up or just fall to their death when they can't grab the rail in time. <br><br>And this time Kujo wins the leadership, which does confuse the other boys abit because he is quiet and constantly deep in thought about things but accept it because he won fair and square. <br><br>Even though Kujo does seem to be harmless and gentle, when it comes down to it he can be the most violent member of his gang. Though Kujo is the leader of the gang and his Best friend Aoki adores him deeply, Kujo doesn't really want to change anything. He doesn't want to rip the school apart with violence unless he has to. He just feels lost about not knowing what the future holds and what is beyond High School, and constantly asks his friends what they will do after High School because he secretly doesn't know what to do himself. Which annoys Aoki greatly, because he has all of the power and he doesn't want to do anything with it. With this Aoki decides to break off and turn Asahi High into a living hell for everyone who is unlucky enough to get in his way, which in turn rips these Childhood friends apart. <br><br>But can they fix their friendship before it's too late?<br><br>In the end this Movie really is for all the Gofers, Wanna-bes, Dreamers and lost souls out there. Because everyone can relate to at least one of these characters in Aoi Haru","user":"fleur-kelly","rank":[19,22]},{"title":"Without a Doubt, My New Favorite Film...","rating":10,"date":"23 January 2004","review":"I read a review of \"Blue Spring\" on a movie festival page, and thought it sounded interesting at the very least.  I purchased it blindly, hoping it would live up to some of the rave reviews it received.  Not only did it live up to it's billing, it replaced Takeshi Kitano's \"Fireworks (Hana-bi)\" as my all-time favorite movie.<br><br>From the opening scene we get the feeling that this is not your normal highschool and these are not your normal students.  However, the students face problems that are extremely similar to the problems we have all had. However, we come to realize that the setting and the characters are not that different and that the story is in fact believable.  This above all else is the reason why \"Blue Spring\" touched me so much.<br><br>The main character Kujo wins a game of \"Clapping\" and becames the boss of a gang at an all-boy high school.  The idea of the game is to clap as many times hanging from a roof-top fence without falling to your death.  At first he finds his role mildly amusing as he deals out punishment to anyone who disrespects him or his best friend Aoki.  Eventually, as with everything, he grows tired of his role and begins to lose his control of the school.<br><br>Aoki is dependent on Kujo.  He needs Kujo to tell him what to do, how to act.  But when Kujo alienates Aoki, it sends him into a tail-spin of destruction.<br><br>The other members of the gang hit were very easy to identify with.  One member devoted his entire childhood to chasing the dream of taking the baseball team to Nationals.  However, when he blows their chance on the final pitch of a game, he can't get past it and is unable to move on with his life.  What makes this even more difficult for us to watch is the fact that he is a tutor of sorts to a freshman student who is beginning to take the game too far and is seemingly destined to live out the same fate.<br><br>\nAnother student has no absolutely no direction.  No clue as to what he wants to do.  As the time for him to decide begins to run out the pressure becomes to much for him and he commits an unbelievable act.  Perhaps my favorite character in the entire film.<br><br>Other kids include many who are controlled by the whims of the leaders, some who genuinely want to get out of there and go to school and one who is cruely called \"Ghost\" (even by teachers) because he has a terminal illness.<br><br>The direction is simply amazing.  Toshiaki Toyoda always manages to find the right angle.  Some scenes are absolutely beautiful.  One example is when a character waits on the rooftop after school lets out and the camera fast-forwards through the entire night and into the morning as he waits for the next day to begin. Another is when Ghost is seen running away from school, as other students contemplate his motivation.  Yet another example is one student's penchant for coloring things black and there is a quick shot of him standing atop the school, which has been seemingly been painted black over night, only to have a another cut back to reality shows the school is still white leaving the viewer thinking \"Did I just see that?\"<br><br>\nDramatic moments are intercut with shots of the beautiful cherry trees that border the school (one character takes care of them with extreme devotion), blooming flowers, clouded skylines ect.  Even in moments of extreme violence or desperation we are never allowed to forget that this is a beautiful film. The soundtrack is simply one the best I've ever heard.  The Japanese punk-rock fits in perfectly as it pounds our ears during slow-motion shots and equally well with chases through the school and acts of violence.<br><br>\nThe ending of the film is unforgettable.  It's one of those endings that - when the credits roll - you're just left staring and wishing it didn't end, but you know it couldn't have ended any other way.  I've never given a film a 10/10 before but I whole-heartedly believe this film deserves it.  It's not particularly easy to watch but it's undeniably moving and powerful.","user":"premiumcream","rank":[28,35]}]