[{"title":"beautiful","rating":10,"date":"14 February 2006","review":"This movie makes me cry every time. Perhaps the soundtrack does it's job, or the push-ins when the characters have their deep emotional revelations of the epitome of their personalities, but it's not what happens that makes me cry. It is the way the characters are relateable, not so much as the commonness of their ways, because they are very quirky almost to the extreme, but because there is a part of every person in each of them, or at least a part to strives to be. The language barrier just highlights the dialogue, as one watching tries to hear it from foreign ears and yet understands movements and emotions better than what is said. And that, I think, makes this movie perfect.","user":"princessariane","rank":[74,96]},{"title":"loved the movie and was pleasantly surprised","rating":14,"date":"14 December 2004","review":"When I heard the title and learned that Adam Sandler was in this movie, I had very low expectations. Boy, was I surprised. This is a wonderful film, not at all the low-level fluff film I expected. All the female actresses, young and old, are absolutely terrific, and Adam Sandler does a respectable job in a semi-serious role. The writing is very clever, and the film will elicit laughter as well as tears. I found my self still thinking about the movie the next day, something that all too often doesn't happen with today's highly forgettable films. One caveat: this is really a movie for teens and up, not a kids' movie. Aside from a bad word or two and a (hilarious) sex scene, the underlying themes are quite adult. Enjoy!","user":"sls3","rank":[175,252]},{"title":"A Mexican immigrant takes on a new job and the paths of both families collide","rating":8,"date":"21 January 2017","review":"I started watching this just hoping for a few laughs, this being an Adam Sandler movie. Instead, I found a deep story dealing with issues relevant to real life: what are the values that define you as a person? What is acceptable and what is not? Why one has to draw the distinction between what feels good and what is good?<br><br>Spanglish is a good movie backed up by some great performances by Paz Vega and Adam Sandler. Tea Leoni performs her role well and Cloris Leachman is an able support, at times adding a flavor of dry comedy. <br><br>I won't reveal the plot. All I'll say is it is worth your time. A funny movie with a solid story and something to take away later.","user":"anitiru","rank":[10,11]}]