[{"title":"movie review","rating":21,"date":"21 September 2004","review":"I had the fortunate pleasure of viewing The Libertine in Toronto on Saturday 9/18/04 and wanted to share my thoughts and feelings. Before doing so, in reply to those who have seen it and have made comments on things such as the sound, camera work, lighting, etc., it should be reminded that this film was shone at the festival in the \"Special Presentations\" category and was listed as \"a work in progress.\" The filmmakers were hustling to get the film edited as much as they could before the first showing, in hopes of finding a distributor. That said, minor details such as those mentioned need to be taken with a grain of salt. If released theatrically, or to DVD alone, it will be further \"cleaned up\" and edited. But I digress, because that wasn't what I was paying attention to while watching this movie. I go to see a movie for the story, the characters, and/or the actors; not the lighting, sound or costumes. Now, on to my review: In a nutshell, this movie was fantastic and the performance of Johnny Depp was nothing short of brilliant.<br><br>I was captivated from the moment Depp begins his monologue as the Earl of Rochester to assure the audience that \"You will not like me,\" to the very end of his epilogue where he asks \"How do you like me now?\" Depp impeccably captured the essence of a man who despised life, drank profusely, seduced women, condescended everyone from the King to his mother to his servant, and preferred to have his portrait done with a monkey rather than his wife. Hmmm, not too much to like, right? On the contrary. Mixed with his utter disrespect for life was his charm, his wit, his irresistibility, and his desire to do whatever he pleased. As such, I had conflicting feelings of hatred, pity, love and admiration for Rochester. This was due, entirely, to Depp's performance. As Rochester's fatal disease begins to take it's toll, Depp transforms into a creature almost too unbearable to look at. You will weep and shudder at the same time. It is without doubt Depp's best work to date and I'm convinced that no other actor could have portrayed him as brilliantly as Johnny. John Malkovich as Charles II, and Samantha Morton as Rochester's mistress are wonderful as well, and contribute nicely to a movie mixed with humor, sex, tragedy, and darkness. All said, it was a movie I would highly recommend and would love desperately to see again.","user":"jcd2girl","rank":[174,195]},{"title":"A personal synopsis of the Libertine","rating":10,"date":"23 September 2004","review":"The Libertine was a brilliant period piece. It was a tragically realistic yet witty and humorous look at the Restoration period in England, but more specifically depicted the latter stages of the life of the Second Earl Of Rochester, a poet, who endured a short and debauched life. Here was a man so highly intelligent, yet so bored with life that he thrived by consistently pushing his limits and the boundaries of his relationships.<br><br>Johnny Depp eloquently and emotionally portrayed the Earl of Wilmot. This has to be by far his most brilliant achievement in a long line of unique and amazing performances. Mr. Depp's portrayal of the Earl showed a range of emotions, incredible nuances and a depth of empathy never before seen on screen, best illustrated during the scene where The Earl addresses parliament - which has to be the most gut wrenching scene, rife with fervor but with credibility. Suffice it to say by the end of this movie I had been reduced to tears and cheers, both at times coinciding. This is definitely an Oscar worthy performance. The golden statue is a must.<br><br>The supporting cast was also excellent; most notably, the actor who played the Earl's servant, and who appeared to have a great rapport with Mr. Depp, on screen. Samantha Morton, also superb as Mrs. Barry, gave a lovely and unobtrusive performance as was required for this character.<br><br>Laurence Dunmore captured the atmosphere of the period exquisitely with simplicity yet with a keen eye to detail. The reproduction of the 'family' Portrait of the Earl with the monkey is an excellent example. The lighting, the sets, the costumes all added to the reality of the movie. The musical score by Michael Nyman beautifully augmented the spirit of the times and of this production.<br><br>The Libertine was a work in progress when I viewed it twice at the Toronto Film Fest. I cannot imagine a scene being cut; even the more risqué dreams are required to impart the true emotional state of the Earl at that time in his life. Before passing judgment on this film I suggest that one see it at least twice so as to appreciate the full impact of the movie  to fully identify with the meaning and the thought behind this production.<br><br>The Libertine is a wonderful piece of art, representing the true raison d'être of this poet with incredible wit and insight. Congratulations to all who graced the production of the Libertine.","user":"BraveBabe","rank":[257,297]},{"title":"Powerful, repulsive, compelling, magnificent","rating":10,"date":"21 September 2004","review":"This wasn't a glamorized period costume drama that Hollywood loves to overdo and it wasn't NC-17 for nothing! There was some technical roughness and lack of continuity but they were minor quibbles in what I considered a triumph. The mood, the sets and cinematography, the script and, most of all, the acting were all of the highest and most innovative caliber. Depp was in almost every scene and was fascinating beyond anything I'd ever experienced. His force and range of emotion and naturalness were exceptionally powerful and moving from first to last. You hated him and loved him, were repulsed by him and felt pity for him. You were drawn to him almost against your will, like a vortex pulling you in. All else paled in comparison. This was a Johnny Depp that I'd never seen before but so hope I have a chance to again. This performance is the crowning glory to date of his illustrious career and I see no limits to what he can accomplish in the future. Everyone else was uniformly excellent although Samantha Morton didn't portray the allure the Elizabeth Barry in the play had. <br><br>My primary recommendation for improving this work in progress before theatrical release center around clarifying motivations up front for why these people were the way they were. This could be done by a combination of edits and additions. I found I liked it even better and was more moved by it the second time I saw it when I wasn't concentrating as much on following the storyline. <br><br>This was a movie I loved and can't get it out of my mind. It was stunning and compelling beyond anything I've seen in a very long while.","user":"filmbuff2","rank":[190,228]}]