[{"title":"Worth watching if there is nothing great available.","rating":7,"date":"25 June 2007","review":"I enjoyed this film. It isn't life changing, deep or even particularly thought provoking, but it does draw you in and keep you 'entertained' throughout.<br><br>Many of the comments below extol the book and damn the film, you'd think they would know better to expect a fairly run of the mill film to outshine the fiction it was based on. I haven't read the book but I may now.<br><br>The story is compassionate and attempts to re-consider the wolf-person theme by treating them as an oppressed minority, I couldn't help but think that they were a metaphor for the Roma, a thought that bears scrutiny I think.<br><br>The cinematography was atmospheric and Bucharest became the star, lots of beautiful rococo buildings and a pleasantly eastern soundtrack. I kept wondering if the film wasn't a Hollywood offering because the characters all seem normal and manage to avoid behaving in the usual American manner (not an \"oh my god\" in earshot), but no, the ending isn't European.<br><br>I was really pleasantly surprised with the beautiful human to wolf transitions, the makers restrained themselves from fx to the benefit of the film, it reminded me of the early eastern European fairytale films (the singing ringing tree). Don't be concerned about gore or substance abuse as mentioned below, there is little more blood than a few cut fingers and bloodstained clothing, and the only substance that gets abused is absinthe (which may well be an illegal substance in your country as it is here), it gets drunk sparingly, injected once and burnt fairly often. See this film.","user":"tifrap","rank":[17,20]},{"title":"Surprisingly Good","rating":9,"date":"11 July 2007","review":"\"Blood and Chocolate\" is a surprisingly good movie. I was expecting it to be some terrible, low-budget horror-wannabe movie in the vain of \"Dracula II: Ascension,\" \"The Prophecy: Uprising,\" and \"The Prophecy: Forsaken\". Instead, \"Blood and Chocolate\" was a well-done film. This movie was nearly pitch-perfect. The acting, set design, score, cinematography and story were nothing short of wonderful.<br><br>Olivier Martinez gave an outstanding performance in what could have been a clichéd role. His portrayal of Gabriel was multi-dimensional and none of his screen-time was wasted. He brought all of the elements together as leader, father, and lover (even though there are no sex scenes, he is constantly smoldering with an animal rapacity). He gave a credible performance, especially in light of Gabriel's fate. (I also enjoyed his commentary on the DVD. He is a very thoughtful and funny person.) Agnes Bruckner's portrayal of Vivian was well done. Her acting was not robotic. Vivian's nature is pent-up and bland; she has no outlet for her inner turmoil other than running, and according to the rules of the pack, she must not form close relationships with humans. It is important to remember that this character is not the same as Selene from \"The Underworld\" series who seethes with vengeful ferocity even while she's strapping up her bustier. Hugh Dancy was adorable and believable; which is always a difficult feat in the role of romantic interest. Also, in the character of Aiden, the filmmakers were able to acknowledge their respect of the loup garoux storyline; they were practically screaming, \"This is not some cheesy werewolf story!\" Katje Riemann and Bryan Dick also gave nuanced performances as Astrid and Rafe. (The movie suffered from trimming Astrid's storyline. I strongly recommend watching the deleted scenes on the DVD. I think the fate of Astrid's storyline was the result of studio executives wanting to focus on the two younger characters more, but ultimately that decision hurt the overall movie.) <br><br>The soundtrack was nothing short of amazing! In my opinion, it suited this movie perfectly. The percussion was not overdone, nor were the synthesizers. Each drumbeat not only heightened the excitement, but also helped to intertwine the dual nature of the loup garoux (human and wolf). I felt it as if it were the quickening pulse of the loup garoux giving in to their wolf nature. I think the decision to stay away from gypsy music (which I love) was a good one. The synthesized music was good and helped to the ground the story in youth and freshness, rather than some overwrought Romanian folklore manner.<br><br>On the dual nature of the loup garoux, the transition from human to wolf was beautiful. I loved the notion of the \"leap of faith\" involved in the transformation and the mythical element of that transformation. Also, the coloring of the loup garoux eyes were spot on. The respect of the transformation from human to wolf translated to the great execution of this premise. The entire story could have been a cliché since the story is mostly \"Romeo and Juliet\" for the loup garoux set, but it was well-done and well worth watching.<br><br>\"Blood and Chocolate\" had a few missteps. Nothing in the movie makes this title appropriate, other than a short, barely-audible line by Astrid. Not until visiting this web site was I aware that the movie was an adaptation of a book. Whatever occurred in the novel to make \"Blood and Chocolate\" a suitable title was omitted from the screenplay and the movie suffered for it. As I have stated, Astrid's storyline should have remained intact in the film. My final criticism is that the story is so well-done, I would have liked to have seen an R-rated version of the movie. Meaning, I would love to have seen an even more serious treatment of this story. My understanding is that the novel is geared toward pre-teens which explains the light treatment of the storyline.<br><br>I highly recommend \"Blood and Chocolate\" to anyone looking for an interesting and well-crafted film.","user":"sewiltz","rank":[49,65]},{"title":"Old school werewolf","rating":8,"date":"3 September 2007","review":"The Matrix has a lot to answer for. Post Matrix every vampire or werewolf movie (Van Helseign, Underworld, Blade) seems to involve copious amounts of special effects, Martial arts and the main character decisions being whether they kill the bad guy with a gun, sword, falling building, poison that makes people explode, or giant stake improvised from the radio antenna on top of the Empire State building.<br><br>Blood and Chocolate follows the traditions oh movies from the 1980s (The hunger, Wolf, Cat people and even The Lost Boys).<br><br>Characters are not fighting over whether to enslave the human race (if vampires planned to enslave the human race, wouldn't it be easier to let everyone know, and 1.3 Billion people versus a few thousand vampires or werewolves will be a very short battle indeed).<br><br>Blood and Chocolate tells the story of a teenage werewolf who wants to escape what she is being told she should be and a young American writer/artist who has already escaped from his domineering ex-ranger father).<br><br>In this story, werewolves are blessed, not cursed, they are the best of man and the best of beast. Though perhaps that is what they should be, and some of them are the worst of both.<br><br>This is a human story at the human level. Some of the characters merely tend to turn into wolves. The movie is more about mood and excitement and action. The action is realistic, not modern son of Honk-Kong martial arts over the top stuff. I loved it, even though I also love the modern effects driven movies. In fact the special effects are so bad, it is likely that was a conscious choice (I think the transformation is a homage to Cat People).<br><br>If you like this movie, check out the old stuff from the 80s.","user":"flingebunt","rank":[27,37]}]