[{"title":"Hysterical!","rating":1,"date":"24 March 2004","review":"This is easily the worst movie I've ever seen, but it is the kind of awful that makes it oh so worth the price of admission. I have never witnessed worse acting all around as real-life couple Brandi Sherwood and Dean Cochran (how are those for porn names?) scrape the very bottom of the acting barrel to great comedic effect.<br><br>A summary of the plot is quite unnecessary, as it is really a horrible Jaws pastiche- think greedy mayor, disgruntled but ever-hopeful hero guy trying to protect his family and add a goofy subplot involving predictably nefarious Russian diamond-hunters and you get the idea. The film is basically a composite of pre-recorded shark footage from the Discovery Channel (in fact, most of these scenes are played SEVERAL times within a few minutes) meshed with fake looking death scenes. And oh, are there a lot of death scenes. I've never seen a higher body count in a shark movie, and I have made an effort to see as many as possible. Definitely a case of quantity reigning victorious over any semblance of quality, but I digress.<br><br>A more warranted review of this movie would detail the numerously ridiculous and consequently wonderful mistakes:<br><br>Wagner, a so-called shark expert, informs the mayor that these pesky sharks are related to the Jurassic sharks of 50 million years ago. News flash: The Jurassic period ended 145 million years ago.<br><br>Sharks do not growl.<br><br>It is rare to see Great Whites together, but I'll be damned if they aren't chilling with their bros all up in this Shark Zone in about every sequence.<br><br>During several of the attack scenes, you can see the flesh of some animal used as bait tied to a fishing line. Well, gee, no wonder Wagner is only batting about .010 in terms of saving the many hapless victims. I guess all of the budget was spent on erasing the Discovery Channel logo from the footage.<br><br>The final shark scene in the pool features a SURFBOARD with a shark painted on the bottom.<br><br>How could a Spanish ship crossing the Atlantic ocean sink in the Pacific outside of San Francisco? Must have been one hell of a storm.<br><br>During Wagner's dream, his wife is dragged out of the boat by a shark that has crashed through the bottom. She is dragged into the water but somehow manages to splash and drip water from her submerged hands and arms.<br><br>Overall, my feelings about this movie are mixed. While it offers countless thrills in terms of sheer laughable entertainment, the truly scrate-awful acting and egregious errors render it nothing short of the worst movie ever made.","user":"Moonbeam1980","rank":[9,9]},{"title":"Gluttonous sharks chow down","rating":27,"date":"27 October 2003","review":"*SPOILER ALERT* *SPOILER ALERT*<br><br>So there's a bunch of sharks in a zone. A Shark Zone. The mayor sends out the world's worst shark hunter to clean up the Shark Zone. His modus operandi is to look into his binoculars and make pained expressions as every living soul he knows gets chewed on by sharks.<br><br>There were a lot of shark attacks in this flick. The sharks were gluttonous pigs. They couldn't eat enough bathers at their beach buffet. Most of the shark attacks were film clips of real sharks swimming and then a lot of thrashing and yelling and red water to simulate the kill.<br><br>\n\"Shark Zone\" has its B-movie points. I always enjoy a good, bloody shark attack. Just don't expect much in the way of logic or originality. Expect shark munching and a clueless shark hunter.","user":"Dr. Gore","rank":[4,4]},{"title":"Instant Classic!","rating":1,"date":"22 October 2004","review":"The small town of San Francisco relies upon the beach for all of its business. A school of sharks roam near a ship containing diamonds which sunk many years ago. The mayor wants to keep the beaches open, the hero disagrees with him. Token Russian guy wants the diamonds and he wants the hero to help him find them. etc etc etc<br><br>Sounds familiar? Welcome to Shark Zone. A movie so terrible that thousands of people watching this may be sworn off movies. Cliché after cliché. Remember Jaw? Well its part jaws, part every other bad(and by bad I mean really really bad) movie you've ever seen. <br><br>This movie is a comedy of errors. There's lots of National Geographic and Discovery Channel footage, which if you've watch for just 10 mins, you will instantaneously recognise all the shark clips.The deaths are messy, lots of really really bad fake blood. There's plenty of errors in the movie to pick from. In one scene when they're throwing in chum for the sharks, you see jelly (jello) mixture. The sharks grunt for some reason (don't ask). The sharks devour everyone in sight, oo and my favourite - corny dialogue. Lots of lines to pick out from. My fav though-Dean Cochran saying 'Class dismissed!' (Doesn't sound funny out of context, but when watching the movie, it is definitely amusing)<br><br>If you notice carefully, you see the main character's father returns as the mayor, without a beard and no apparent dress sense. <br><br>Looking at the movie from another perspective, it is hilarious. Brandi Sherwood's acting is terrible, but funny nevertheless. As a former Miss Teen USA its obvious why she got the part. The whole screenplay is so bad, you'll be on the floor in riotous laughter. I mean sure, shark attacks are nothing to laugh about, but this movie, makes the attacks look so fake, you have no choice but to laugh. <br><br>This is definitely the Holy Grail of bad movies. This should be shown in film school as not what to do when making a movie.<br><br>The movie has so many faults, its unbelievable. Not really worth renting at all. Unless you have some friends around and you want to laugh, watch this!<br><br>The writer/director has another shark movie out next year,beware!<br><br>A generous 1 out of 10 Laugh factor- 8/9 out of 10","user":"moviefreakazoid","rank":[9,12]}]