[{"title":"Decent Sequel That Fans Of The Original Should Enjoy","rating":5,"date":"3 April 2005","review":"Barbershop 2: Back in Business is a decent sequel with some enjoyable moments. Ice Cube, Cedric the Entertainer and the rest of the guys at the downtown Chicago barbershop return for another round, but the usual sense of community and their outrageous discussions is threatened by urban developers who hope to replace the small barbershops with big national chains. Like its predecessor, Barbershop 2 is pretty much plot less as the characters are what people want to see. I thought the first one was decent but nothing special and that's exactly what I think of this one. Ice Cube, Eve, Sean Patrick Thomas, Troy Garity and Michael Ealy are all back and they are enjoyable this time around as well. The one person I couldn't stand was Cedric the Entertainer, he had some funny lines but most of the time he was really annoying also those flashback scenes he was in were really stupid. There's a couple of new additions including Queen Latifah. I thought she was very funny and I might check out Beauty Shop sometime in the future. The other addition is Kenan Thompson, he isn't very interesting in the film but also doesn't have a lot of scenes so that's nice. Kevin Rodney Sullivan directs this time around and he does a good job replacing Tim Story, who was apparently busy with Taxi and The Fantastic Four. Absent from the sequel is Anthony Anderson who isn't missed, in fact you probably won't notice. The film talks about a lot of different things like R Kelly, The Washington Sniper and others, you may not agree with what their saying all the time though. The sequel is a bit more warm hearted this time around but the dialog is still sharp and funny. Rating 6/10, In the end, if you liked the first one then you will probably like this one but if you didn't then its best if you avoid the sequel.","user":"christian123","rank":[10,13]},{"title":"Enjoyable, but not as much as the original....","rating":7,"date":"17 February 2004","review":"I wasn't as 'up' for watching Barbershop 2 as I was with the original.  Just the idea of a sequel existing didn't really excite me....although anyone with sense had to know the makers were going to cash in on another movie, seeing how much of a sleeper hit the original was.  Seeing the trailer for this months ago, it just didn't seem to have the same spark the original had.  After watching this last night, that feeling hasn't really changed.  I enjoyed Barbershop 2, but it's miles behind the original, especially in the comedy area.  The original was a 'cute' movie, it tapped into everyone's childhood neighborhood memories of the local barbershop that was a mainstay in the community....all while having a nice story behind it (Ice Cube not seeing the importance of the shop and threatening to sell it).  The sequel just seems to go with the motions; you can tell that its trying its best not to rock the boat, particularly with the jokes.  The story in BS2 is arguably more relevant than the one in the original:  a bigger, more attractive, industrialized barbershop chain comes into the neighborhood, threatening the 'mom &amp; pop' stores on the block who have to fight to survive.  As far as comedy, the movie on a whole isn't as funny as the original, as it takes a more serious tone.  Its obvious that the makers tried their very best not to step on anyone's toes or, if they did, not step on them too hard.  The success and exposure of the original, in this case, worked against them, as I felt the makers held back a little too much as far as the comedy goes. Nevertheless, I enjoyed Barbershop 2, but I just hope the franchise doesn't get too bland, with the seemingly inevitable spin-off coming (Beauty Shop). <br><br>\n*** out of **** stars.","user":"lotus_chief","rank":[3,3]},{"title":"Satisfactory sequel","rating":6,"date":"1 July 2004","review":"\"Barbershop 2: Back in Business\" is a logical and somewhat more expansive continuation of the original \"Barbershop\" film. However, it suffers from sqeuelness; a lack of appreciation because it can't be as fresh at the first. \"Barbershop 2\" also spends more time outside the shop with some backstory history, competition from a Nappy Cutz franchise across the street, Queen Latifah's salon for a heartbeat, etc. and less time with what made the original film special and charming; the good natured repartee between barbers, Eddie's (Cedric) racial worldview philosophy, barber/customer interaction, zingers, etc. Bottom line is simple. Watch \"Barbershop\" first. If you like it, give this film a try. If not, not. (C+)","user":"=G=","rank":[5,6]}]