[{"title":"What if God was one of us? It would be pretty funny.","rating":8,"date":"19 December 2003","review":"I really do not know what people have against this film, but it's definitely one of my favourites. It's not preachy, it's not anchored by it's moral, it shouldn't be controversial. It's just God. Any possible God, no matter the religion. And it's really funny.<br><br>Jim Carry plays Bruce Nolan, a TV reporter usually stuck on the lighter side of the news, desperate to prove himself (more or less TO himself) that he can be taken seriously and do a good job in an anchor job. This drive is what is slowly driving his beautiful girlfriend Grace (Jennifer Aniston) away. When the final straws are executed, he's quick to not laugh, but yell in the face of God, who in turn gives Bruce his powers. Bruce then makes his life better for himself, until he's guilted into helping others, where he then continues to miss the point of his powers. Meanwhile, his constant excitement about his own life makes him more selfish, leaving his relationship on dangerous ground.<br><br>OK, that was kinda long. But as a plot, it works well. The step-by-step fashion in which we meet the challenges of being God is much better than clustering his problems together, and is able to hide itself fairly well.<br><br>As you probably know from hearing about this movie in the first place, Carrey's pitch-perfect acting stays in character (which, luckily enough, is him), and controls and gives atmosphere to the movie scene by scene. Whether they would admit it or not, the role was written or rewritten exclusively for Carrey. Without him, the humour would turn flat, as humour is half execution. And the humour is very good in the first place. But without Carrey, it would kinda feel like a It's a Wonderful Life wannabe.<br><br>Jennifer Aniston is great and, no matter what some may say, does not act like the only excuse for the third act. At least, you don't think that when you see her. She gives a heartfelt performance and makes you forget you're watching a movie, she and Carrey feel very much like a real couple.<br><br>The movie feels ggooooodd (see the movie to understand), has a very nice feeling, tackles the idea appropriately and better than expected and overall should never have been called slapped together just to save Carrey's career (which wasn't goin' anywhere.).","user":"BlackX","rank":[47,59]},{"title":"Wait, you mean all I have to do is become God to solve all my problems? Why didn't I think of that before???","rating":9,"date":"9 July 2003","review":"Jim Carrey is back to much the same role that he played in The Mask, a timid guy who is trying to get ahead in the world but who seems to be plagued with bad luck. Even when he tries to help a homeless guy from being harassed by a bunch of hoodlums (and of course they have to be Mexican, obviously), his good will towards his fellow man backfires. In that case, it wasn't too hard to predict that he was about to have a handful of angry hoodlums, but I like that the movie suggests that  things like that shouldn't be ignored. I'm reminded of the episode of Michael Moore's brilliant The Awful Truth, when they had a man lay down on the sidewalk and pretend to be dead and see who would actually stop and make sure he was okay. The results were not very promising, so it's nice to see someone in the movies setting a good example.<br><br>Jim Carrey plays the part of Bruce Nolan, the nice guy mentioned above whose entire life seems to be falling apart. Or even better, it seems to be breaking up by the blows of bad luck like an asteroid entering the atmosphere (a little metaphor that comes up when Bruce miraculously finds himself a gigantic news story later in the film). Bruce is nearly 40 years old and all he has to show for it is a position as a news reporter of the sort that reports on such exciting news as the local bakery that's seeking to bake the world's biggest cookie. He's desperate to obtain the job of head anchor at the TV station, but he loses his cool on live TV when he hears that the job went to his rival colleague. You have to love how they time the revelation of this news to him seconds before his first live report. Needless to say, he loses his temper on live TV in one of the funniest scenes of the entire film.<br><br>Morgan Freeman delivers a fantastic performance as the Man himself, displaying a God whose infinite wisdom is somewhat reflected through Freeman's massive talent as an actor. He is the kind of God who takes his job very seriously, but in such a way as to advise his followers (as well as the viewers of this movie) that there are times when you need to slow down and do some manual labor in life. I love his line that some of the happiest people in the world come home smelling to high heaven at the end of the day. There are a lot of people in the world (maybe more than our share in America) who are so absorbed by their money and their possessions and their jobs and everything that they completely lost touch with the natural side of themselves as humans.<br><br>One of the biggest strengths is that the movie is able to provide great advice to people in general about improving their lives, and this message is clear and acceptable regardless of the viewer's religion. I, for example, tend to reject organized religion in all forms and I see God and Satan to be metaphors for different aspects of nature and human psychology rather than actual figures who ever lived or continue to live. But despite the fact that I don't believe that God exists as an entity overseeing the universe or as a janitor dressed all in white who mops the floors of his downtown office in his spare time, I was able to appreciate the messages that were delivered in this movie.<br><br>Jim Carrey's movies display this fantastic evolution that ties them all together and makes the newer ones look even better just because you can see how far he's come. If you compare Bruce Almighty with movies like Ace Ventura (both of which I loved, by the way) or a lot of what he did before he got into film, it's amazing how far he's come. He has moved from cheesy TV comedy to cheesy comedic films to comedies that are truly intelligent and meaningful like this film as well as others like The Truman Show, Man on the Moon, and The Majestic (easily one of his greatest films ever). Jim Carrey has unmistakably moved from the cheesy comedy of his past to become one of the most important comic actors working today.<br><br>Jennifer Aniston also once again provides an excellent addition to the movie (as she did in the side-splitting Office Space) as Bruce's girlfriend, who becomes increasingly exasperated by Bruce's growing stress about his life as well as his negligence to ask her to marry him. There is definitely some low-brow comedy in the film that doesn't really fit with the importance of the film's meaning or the quality of the delivery, such as the dog reading the newspaper on the toilet and the whole monkey scene, but it was definitely pretty nice to see Ace Ventura's friend Spike make a cameo appearance. As Stephen King very well knows, it's always nice to see familiar characters. It's almost like seeing family again.<br><br>\nBruce is endowed with the powers of God for a given period of time so that he can understand life a bit better, and he says a lot about himself when he uses the powers only for his own purposes rather than to help all of the people who pray to him. The thing I love about this is that, like I said before, religion is absent from my life, but I was able to watch this and learn a lot about myself as well by thinking about what kinds of things I would have done had I been endowed with such powers. The movie allows us to learn vicariously this way, which empowers the message even more.<br><br>\nThe scenes that involve the news station are easily the funniest in the entire film, such as the scene when Bruce loses his temper about the anchor position, the Jimmy Hoffa scene (who was conveniently buried with an original birth certificate and a complete set of dental records), the scene where Bruce's rival colleague is made to go nuts on camera, and my favorites, the ones at the beginning and the end involving the local bakery's cooking. The movie has plenty of time for Carrey to deliver some excellent jokes, such as when he says to God (who reveals that he's the janitor, the proprietor, the electrician, etc) that his Christmas parties must be real bashes, and to be careful about drinking, because on of him might need a ride home! I also loved the end when he says that behind every great man is a woman rolling her eyes. A little too true, and as Gallagher would add, behind every great man is also an amazed mother-in-law.<br><br>\nBruce Almighty is one of the more memorable comedies to have come out for quite a while, and is probably the only directly religious that I can remember seeing that I am anxious to buy on DVD to add to my personal collection. It is a comedy written and performed in good taste, but with enough relatively low-brow humor to keep the kids entertained. This is a meaningful comedy for the whole family, which is becoming rarer and rarer these days. In a world that is about to be flogged with yet another American Pie film AND another Scary Movie (which are only scary because of their sheer barbarous idiocy), it's nice to see that there are still people making comedies worth watching. Don't miss this one.","user":"Anonymous_Maxine","rank":[127,176]},{"title":"Jim Carrey delivers his trademark antics in this little comedy gem about the responsibility of playing God.","rating":9,"date":"23 April 2005","review":"Starring: Jim Carrey, Morgan Freeman, Jennifer Anniston I was really quite skeptical the first time I watched this movie. I mean, what a conceptual NIGHTMARE. Jim Carrey playing God? Nothing is sacred anymore.<br><br>Well, this movie is hardly sacred, but it also is not sacrilegious, at least not to any great extent. Yes, Jim Carrey has the powers of God for a while, but he is not God. Confused? I'll give you the low down.<br><br>Jim Carrey plays Bruce Nolan, a reporter who is down on his luck and feeling very unsuccessful with his life. He lives with his beautiful girlfriend, Grace (Anniston), and you can tell right off the bat that they love each other, but the relationship is on fairly shaky ground.<br><br>Then Bruce gets a shot at anchorman, only to have it underhandedly stolen by Evan Baxter. Obviously not please, Bruce shares his thoughts with the world through the television in a way which is comical and definitely worthy of getting him fired.<br><br>Much complaining and griping about God later, Bruce gets a page. After a while he gets tired of it calling, so he responds and goes to the Omni Presents building (heh). There he meets God (Freeman), who is the Boss, Electrician, and Janitor of the building. I found this highly amusing. God is the Boss, the Holy Spirit is the Electrician, and Jesus Christ is the Janitor. Think about it. Boss, obvious. Electrician, the guy who keeps everything running. Janitor, the guy who cleans up the mess that the world has left. BRILLIANT.<br><br>Anyway, Bruce is a little skeptical about having actually met God, but when God gives Bruce his powers and gives him a shot at playing God, he starts to believe a bit. Wonder why. Enter the flagrant abuse of powers for personal gain and to abuse the enemies.<br><br>Since this is Hollywood, Bruce obviously eventually smartens up, learns his lesson, and starts using his powers for the good of the world. In the end he cries out for God to take it away and prays that His will be done, not Bruce's.<br><br>Since it is Jim Carrey, the movie is quite amusing, and there are definitely some highly entertaining moments in it. The movie is not perfect theology, but for Hollywood, it is definitely a good attempt. Many statements in the film can be quite thought provoking and even challenging, and I applaud Tom Shadyac for his effort in this movie.<br><br>So, while far from perfect, definitely an amusing popcorn movie with a little bit of thought behind it.<br><br>Bottom Line: 3.5 out of 4 (worth a view or two)","user":"schmimic","rank":[91,124]}]