[{"title":"Its a great movie!!!!!!","rating":8,"date":"28 July 2013","review":"this movie is rated low just because its a comedy. If you check all the movies are comedies rated low (especially Eddie Murphys). Eddie Murphys is an actor who plays amazing and funny in many good movies. This comedy movie is good&nbsp; for the whole family and very fun to see it t in a family movie night. If you choose not to see this movie because of its rating then you make a big mistake (believe me it's not a waste of time).its music is great. and you will enjoy watching it. I loved this movie sow match i watched it like about four times. this movie is good for all ages and don't be afraid to show it to your kids because its just fine.","user":"avigailbenzagmi","rank":[20,21]},{"title":"Wholesome Fun","rating":7,"date":"27 August 2013","review":"This is just a funny and fun movie. And as one user wrote, the chemistry between all the actors and kid actors really makes the movie. We could use more movies like this. Nothing inappropriate either. It is one of those movies that you come away smiling. It's a feel good movie. I imagine if more people would support these kinds of movies maybe Hollywood would make more. I do wonder if there are more people than we think who secretly enjoy a good wholesome movie. And love Steve Zahn. Eddie Murphy is so good when he keeps it clean. He seems genuinely nice and, of course, love his voice for animated characters.<br><br>Everyone in the cast really makes this movie charming.","user":"mrso_ory","rank":[15,16]},{"title":"Good Family Entertainment","rating":6,"date":"29 December 2006","review":"Eddie Murphy and Jeff Garlin are two fathers who lose their jobs in product development at a large food company and decide to set up their very own day care centre. Using unconventional methods 'Daddy Day Care' starts to catch on, bringing with it the rivalry from Anjelica Huston who runs the Chapman academy and has already driven all the other competitors out of business.<br><br>Daddy Day Care really is fun for all the family and has a cast of characters that you will genuinely care about, Murphy, Garlin and Huston; along with the children all give fine performances making Daddy Day Care a hit.<br><br>6/10","user":"mjw2305","rank":[22,28]}]