[{"title":"over-the-top mess","rating":5,"date":"16 September 2006","review":"Anybody expecting to get a great account of the Black Dahlia case, even fictional, will be disappointed going in to this movie. Of course, I knew that it was a fictionalization of the case, but I had no idea the movie would present its own evidence and draw its own conclusions.<br><br>But the main problem here is not the lack of factual detail, so much as the confusion of plot that surrounds and overwhelms the Black Dahlia case itself. So much plot and character and sideplots and backstory are built around the central characters that the case itself seems like a distraction. A key plot point and character motivator is the fascination of the two detectives with the murder, but this is never elaborated enough in the film, and we're left to half-heartedly guess at the character motivations.<br><br>The tone is never consistently campy, but when the camp arrives it overwhelms the story. A dinner scene between a suspect and her family had the crowd in stitches (the only scene during which the audience laughed). The problem is that the scene is valuable to the plot and should never have been played for laughs. Hitchcock or even Lynch could have shot the same scene, with the same events and dialogue, and made it menacing and creepy, which it needed to be to function in the mystery.<br><br>Other problems: De Palma uses the lesbian angle of the movie (never a part of the case) to full exploitative advantage, and the actresses seem unable to master to the expressive 1940s style acting that would have come naturally to even a marginal 40s star.<br><br>Although the film brings a clearcut finale rather than a vague puzzle, too many loose threads come together too neatly and rather than bringing the film to a satisfactory conclusion, it leaves you scratching your head, is this what I spent the last 2 hours waiting to hear? Overall, there is too much plot, too little character development and a wildly uneven tone. The movie has its moments but it's a blinding mess all together.","user":"cornflakeboy20","rank":[376,464]},{"title":"Almost the Heaven's Gate of Film Noir","rating":1,"date":"16 September 2006","review":"\"The Black Dahlia\" is a long, bloated, confusing, self-important, self-consciously artsy movie undermined by miscasting, absurd plot turns, naive symbolism, an utter disdain for history and laughable overacting that make Robert Towne's ponderous, plodding \"Chinatown\" sequel, \"Two Jakes\" (1990), look like a taut thriller.<br><br>The most marked difference between \"Dahlia\" and other classics of the more recent genre is that although \"L.A. Confidential\" is firmly planted in the 1950s and \"Chinatown\" takes place in the 1930s, De Palma's film has shallow roots \"once upon a time in Los Angeles.\" Clearly, a movie nominally set in 1943-47 in which the lead characters attend a silent movie (\"The Man Who Laughs, \" 1928--note that the characters are sitting in the balcony, which was reserved for blacks back in the ugly days of segregation. Oops!) has nothing but contempt for the past, which is reflected in a thousand ways, from male actors' scruffy haircuts and inability to wear hats properly to a laughable lesbian nightclub scene featuring K.D. Lang in top hat and tails singing \"Love for Sale,\" which rather than depicting the classic film noir era is most evocative of \"Bugsy Malone,\" a far more accurate film.<br><br>One can find fatal flaws in virtually every area of this movie with little effortin fact the most difficult task in critiquing the film is remembering everything that's wrong with it.<br><br>First, there's Josh Friedman's dialog: \"She looks like that dead girl! How sick are you?\"not quite \"She's my sister and my daughter,\" is it? Then there's miscasting (at 31, Kirshner is much too old to play the 22-year-old Black Dahlia), opulent production design by Dante Ferretti (police officers lived like this on LAPD pay? Who knew?), music (Mark Isham in the entirely predictable \"cue mournful trumpet\" genre), odd costumingFriday casual for the men, fall collection for the women(Jenny Beavan), down to the crowd scenes, which are busy to the point of distraction. And I wish I had the cigarette holder franchise on this film. I would be a rich man.<br><br>Even special effects are misused, with an earthquake that serves no purpose except to underline an obvious plot turn. Granted, the overly complex story is almost impossible to follow, but in this instance, De Palma must assume the audience has an IQ of about 50. And unlike the shocking and painfully realistic nose-slitting scene in \"Chinatown,\" the far worse violence inflicted on the Black Dahlia is amusingly fake. If De Palma was hoping to make a slasher flick, he failed badly.<br><br>Nor does Vilmos Zsigmond's cinematography escape a rap on the knuckles for a ridiculous lesbian stag film (presumably made at a cost surpassing the combined budgets of all blue movies produced from the 1920s to the 1950s), and a self-conscious and overly elaborate shot in which partners Blanchard (Eckhart) and Bleichert (Josh Hartnett) engage in a shootout, followed by the camera slowly rising up floor by floor of an entire apartment building, proceeding to a befuddling shot of the building's roof before it at last discovers the Black Dahlia's body in a vacant lot in the adjoining block. As visual storytelling, this is a grandiose and miserable failure. <br><br>And then there's Fiona Shaw, who chews so much scenery that she must have been rushed to an oral surgeon to have the splinters removed.<br><br>For that matterand perhaps this is what makes the heart of the film beat so faintlythere is very little of the Black Dahlia in \"The Black Dahlia,\" who only surfaces far into the picture.<br><br>In fact, the first 30 or 40 minutes are devoted to boxing matches between the two detectives, nicknamed \"Fire\" and \"Ice\" from the Symbolism 101 school of writing. (I know it's in the book, but that's no excuse).<br><br>So where is the Black Dahlia in this confusing mess? She exists entirely on film. Of course in real life, Elizabeth Short never got a screen test or even appeared in a school play, but De Palma gives her one and Kirshner, trying her best at the impossible task of acting 22, makes it as pitiful as possible with an intentionally miserable reading of Vivian Leigh's famous monologue from \"Gone With the Wind.\" <br><br>The handling of the crime scene? Ridiculous even by Hollywood's lax standards. Vintage black-and-white police cars swarming the streets and detectives bellowing instructions like some shark-jumping 1970s cop show that any good investigator would already know. Ditto the morgue.<br><br>Then there's the contrasting love/sex scenes, and it's obvious De Palma hasn't a clue how to stage either one. The sex scene, between Harnett and Johansson, occurs in the dining room, when, overcome with passion, Bleichert rips away the tablecloth, sending dishes everywhere, and has his way with Lake. Isham's score is lushly romantic, an oddly contrasting choice of music, and amour like this is sure tough on the Havilland china and the Baccarat crystal.<br><br>The love scene, between Swank and Harnett, is just as amusing with Bleichert and Linscott having a little pillow talk while she's wearing nothing but huge pearl earrings and a long matching necklace with pearls the size of small onions, ensuring, I would imagine, a rather bumpy ride.<br><br>And about those crazy Linscotts. Bleichert knows exactly how to make rich people confess to murder: Use their valuable antiques for target practice. The last time I checked, police revolvers hold six rounds, so unless Bleichert was planning to fight off one of them as he reloaded I can't imagine what he thought he would do after his sixth question. Then again, not everybody can send a crystal chandelier crashing to the floor with one shotsome of us need two.<br><br>And while you're at it, Bucky, take out a couple of those clown paintings, please.","user":"lmharnisch","rank":[124,158]},{"title":"visually dazzling but ultimately disappointing","rating":3,"date":"28 September 2006","review":"Brian De Palma's so called \"film noir\" has all the aspects of a great film: detectives, guns, murder, a beautiful blonde, an Oscar winning brunette, and a boxing match. It involves violence, money, pimps, porn, and \"the most notorious murder in California history\". Sadly though, the movie just doesn't cut it.<br><br>The Black Dahlia isn't about murder, or guns, or pimps or porn. The Black Dahlia is about the new American dream: to sleep with Scarlett Johansson. The Dahlia isn't even introduced until a third of the movie is over, the longest 45 minutes I've ever experienced in cinema. A good hour of the movie doesn't have anything to do with the plot, and watching it is just like watching paint dry. Much of this wasted screen time is attributed to the relationship between Sgt. Leland \"Lee\" Blanchard (Aaron Eckert) and Officer. Dwight \"Bucky\" Bleichert (Josh Hartnett), where we see their transformation from enemies to partners to friends unrealistically fast, which is unrealistically cliché.<br><br>But the biggest downside of the movie is Josh Hartnett. What Hartnett is doing as a serious actor is beyond me, but his performance is a wooden as they come. It is unbelievable that he was considered for the role of Bleichert, and the fact that he was cast really makes me lose faith in Hollywood's mainstream actors. His noir-ish voice-over was like reading words off the script, making it feel less and less like the artsy film De Palma intended it to be.<br><br>The only redeeming feature of the flick was Mia Kirshner who had about one minute of screen time as the Dahlia, but was the most memorable character. Oh, yeah, and we do get to see Hilary Swank's ass.<br><br>But overall, The Black Dahlia is just another bad film to cap off the summer. It is extremely confusing with all its pointless sub-plots, and just gets annoying at the end. It's one of those movies you consider walking out of, and I counted down the minutes to what I thought would be a climactic finale, but was just a series of long monologues and unclear speaking. In the end, we learned little about the Dahlia, and were pretty much back where we started, except for a few missing comrades.","user":"soriano329","rank":[214,285]}]