[{"title":"interesting attempt to translate King's methods to the screen","rating":7,"date":"27 January 2005","review":"What makes this movie worth watching, and I would say it is indeed worth watching, is the way it zips in and out of its protagonist's mind. Scenes constantly veer off into grim fantasy sequences, but you often won't realize it's fantasy until it's over. One of the things books do better than movies is to get inside someone's head, but here you really do get pretty far into his paranoid fantasies and death obsession.<br><br>The movie is not, for the most part, a horror movie, but it does manage to generate suspense by bringing you into Alan's paranoia. The movie is weakest when it is most horror-movie like, and the last half hour feels way too much like an episode of the Twilight Zone (and even more like its wannabe cousin The Night Gallery). A stronger ending would have made for a better movie, but this one is still interesting. I give it a low 7.","user":"cherold","rank":[39,52]},{"title":"This is Your Red Herring on Drugs","rating":4,"date":"30 September 2006","review":"This is not one of the worse adaptations of Stephen King's work, but it's another one that makes the successful ones (De Palma's \"Carrie,\" Reiner's \"Stand by Me,\" and Kubrick's \"The Shining\" come immediately to mind) seem all the more remarkable. Jonathan Jackson does a fine job of playing a self-absorbed and death-fixated jerk. David Arquette does a fine job of playing a weirdo, which I know comes as a shock, but this one is threatening. It's nice to see Barbara Hershey and Cliff Robertson working, but the film is an incoherent, drug-trippy, red-herring-loaded road movie in which each succeeding segment and flashback builds to a huge.... mind-numbing yawn. If you fast-forward to long segments you may miss some details but in the end, you won't care.","user":"PDXozoner","rank":[32,43]},{"title":"Saw this movie last night","rating":7,"date":"2 August 2004","review":"Sunday, August 1st 2004 was the World Premiere of Stephen King's Riding The Bullet, which was hosted by DIRECTOR MICK GARRIS.<br><br>The story is set back in 1969. Alan (Jonathan Jackson) is a college student who learns that his mother (Barbara Hershey) has been hospitalized after a stroke. He must hitchhike across the state over the course of one night to be with her. Along the way he confronts his past, his future, his demons and fears - and a terrifying personification of death. <br><br>This film is brilliantly shot and the cast is fantastic!!! This film works so well because it has everything a TRUE Stephen King fan would be proud of. Excellent character development with thorough storyline added with a dash of fear and terror.<br><br>The movie is 100 min.","user":"jaycee21","rank":[72,108]}]