[{"title":"An unflinching look at society's expendables...","rating":2,"date":"2 August 2003","review":"`Dirty Pretty Things', Stephen Frears' latest film played last year in Europe, but the North American opportunity to see it only came yesterday. Much buzz, fortunately all merited, preceded it: an amazing Nigerian actor, Chiwetel Ejiofor, already acclaimed for his stage performances, makes his big-screen debut, while Audrey Tatou, the impossibly wide-eyed kook from 2001's `Amelie', tackles her first English-language movie role.<br><br>Frears' film details the story of those faceless, nameless human beings of a variety of ethnicities, who, for a multitude of reasons--all marked by desperation--sneak into England.  Then, until they wangle a way of getting a British passport, they lead the hunted, humiliating lives of the illegal immigrant.  The Nigerian Okwe is one such person: a pathologist in his home country, he is reduced to driving cabs by day and moonlighting as the sole front-desk worker in a London hotel by night.  During the day, he grabs a couple of hours of sleep on the couch of a Turkish co-worker, a hotel maid named Senay, played by Audrey Tatou.  As in most hotels in these straitened times, the night staff deals with the usual sordid emergencies that arise when the nocturnal creatures of the city are on the prowl.  Prostitution and drugs are routine phenomena, but when he finds a human heart clogging a toilet in one of the rooms, Okwe realizes that something far more sinister is afoot.<br><br>For the illegal immigrants portrayed in the film, it is an ongoing struggle to hold onto some semblance of integrity, humanity, and dignity, as the Society around them exploits and hounds them mercilessly, safe in the knowledge that nothing would be reported to the authorities.  Each character makes more compromises and greater sacrifices, all for freedom, which as the tagline of the film sums up, comes at a price.  Senay is a hair's breadth away from getting her residency papers, when she runs afoul of the law and has to go on the lam to avoid deportation.  Okwe, the cause of her problems, feels duty-bound to see that she remains safe.  But by persisting in his efforts to unravel the mystery of the heart in the toilet, he becomes increasingly exposed to those who would harm him and Senay.<br><br>\nInterestingly, though this film is set in London, none of the main characters is English:  there's Juliette, an ironically-named feisty West Indian hooker who plies her trade in the hotel; Ivan, the Russian doorman; Senor Juan or `Sneaky', another hotel employee who makes use of the hotel for his own money-making schemes; Gou Yi, a Chinese night porter in a morgue; a motley collection of Somali, Nigerian, and Kenyan men who work at the cab company, and the South Asian owner of a sweatshop.  Even the Immigration inspectors who make the dreaded surprise checks for illegal aliens are of color, but they have been elevated into a privileged stratum of society by their passports.  These people alternately help each other and prey on each other for another person's frailty is always a source of profit; while a person with knowledge of one's past is someone to be feared. The London we see through their eyes is unrecognizable--squalid, begrimed, crowded, sleazy, perilous--not at all the gleaming promised land of immigrant fantasies.<br><br>Part anthropological documentary, part thriller, and part tentative, unlikely love story, this film keeps one riveted throughout.  The unfortunates in the film live by their wits and survive by hanging on to their senses of humor.  But as one degrading or dehumanizing experience piles itself atop another, you see them question the worth of the Holy Grail that is the British passport.  However as there is no going back, they are forced to continue. Every now and then, they find it in themselves to hit back, making you want to applaud their diffident, costly bravery.<br><br>The film belongs to the lead pair.  Ejiofor, with his expressive dark eyes and handsome face, registers every affront to his humanity; he inhabits the character of Okwe completely and takes us along on the bleak, dangerous journey that Okwe is forced into. Likewise, Tatou breaks our hearts as she is exploited time and again; she is an actress of such luminous transparency and vulnerability that one empathizes with every tribulation of Senay's. This is a far more dramatically demanding role than `Amelie' and Tatou is up to its challenges.  Sergi Lopez, who's star-making turn in the French film `With A Friend like Harry' did not go unnoticed in North America, has created a charming whisky-guzzling monster in Senor Juan.  Juan is the ultimate amoral opportunist, a Brylcreemed, Mercedes-driving vulture, and Lopez does not shy away from showing himself at his worst.  Benedict Wong and Sophie Okonedo are first-rate, too, as the philosophical chess-playing morgue-worker buddy of Okwe and Juliette the rebellious prostitute respectively.<br><br>`Dirty Pretty Things', brilliantly written by Steve Knight, maintains its unpredictability right up to its surprise ending.  Stephen Frears--no stranger to the seamy side of human nature (`My Beautiful Launderette', `Dangerous Liaisons', `The Grifters' being cases in point)--has crafted the film with delicacy and intelligence.  A lesser director might have turned it into a sentimental morass, but Frears, with an unerring sense for a good story, abstains from making his characters too noble, too courageous, or too upstanding, rendering them altogether human and memorable.","user":"ilpintl","rank":[129,144]},{"title":"Worth seeing","rating":20,"date":"20 November 2002","review":"A thoroughly engaging film which I would have no hesitation in recommending. Other reviewers have given away the major elements of the plot which may mean that you may find that it takes time to \"cut to the chase\" if you read the comments here before you see it. You are better off seeing this film \"cold\" knowing neither the plot nor the players. It does tend to get a bit goarey towards the end, but not without reason. A well written, superbly acted (especially by the two leads) and expertly directed work that makes you continue to believe that cinema can still be political and make important points without hitting you over the head with a blunt instrument. My only minor crib would be the accents which can be difficult to decipher or in Tatou's case slightly off (her character is supposed to be Turkish but the accent is more Eastern European).","user":"Dubescfan","rank":[65,78]},{"title":"A Gritty View of London","rating":9,"date":"16 March 2005","review":"Organ trafficking is the central theme of this overlooked great movie by Stephen Frears which received little noise when it came back in theatres in 2003 but managed to receive an Oscar nod for Original Screenplay. While this might not sound like the stuff that makes movies, Frears creates a visually effective thriller about the constant state of anxiety and exploitation in which immigrants with no papers must go through in order to survive.<br><br>This is the reality as seen through the eyes of Okwe (Chiwetel Ejiofor) and Senay (Audrey Tatou) who work in a seedy hotel under the smarmy and vaguely psychotic supervision of appropriately named Sneaky (Sergi Lopez). Both are in constant fear of being discovered by immigration agents who pop up at the most inopportune moments, and to top this all, it seems the hotel where they work in is being the focus of something quite dirty; when Okwe makes a grisly discovery in a toilet after a call girl (recently Oscar-nominated Sophie Okonedo), he is blackmailed into participating in the illegal plot he uncovers, which later threatens to overcome Senay as she succumbs to the pressure of legalizing her papers.<br><br>Nice pacing, occasional dark humor brought in from time to time, DIRTY PRETTY THINGS never goes overboard with flashy chase sequences or explosions or implausible villains, but benefits from a grimier yet equally intense approach that conveys its message of the helplessness marginalized immigrants feel in a foreign country, compounded by the determination to survive at all costs, even when the situation seems grim.","user":"nycritic","rank":[26,30]}]