[{"title":"You Need to See the Uncut Version (DVD).","rating":8,"date":"1 February 2008","review":"Having watched the regular release version I was somewhat confused as to what was going on, though I was able to surmise the base elements of the plot, but when I saw the uncut version with the scenes left in, things made a lot more sense.<br><br>The plot seems a bit obscure at first; unless you're sharp, you're not going to be able to follow it. That is all I will say about that.<br><br>It's true the acting wasn't magnificent but I really don't know what everyone is complaining about. Plenty of action, yes, and Milla Jovovich looks great. I thought it was a pretty good watch myself, and I am in the minority there. I definitely don't think it's a waste of time, though it is a bit dark. It's now in my DVD collection, in fact.<br><br>Rent it, watch the uncut version. Though not my favourite movie of all time, I enjoyed it.","user":"matikalyere","rank":[44,53]},{"title":"Hot body, not much else going on","rating":3,"date":"3 March 2006","review":"Ultraviolet was embarrassingly terrible on so many levels. My husband and I usually really dig the comic book and action movies, so I think that our expectations were reasonable for the genre. The kinds of movies that Ultraviolet tried to channel were X-Men, The Matrix and Underworld. Unfortunately, this movie failed to do so.<br><br>1) Dialogue was laughably bad. One of Milla's lines was actually \"Because these beautiful moments turn evil when they're over.\" What?? This was regarding a romantic pass made at her. Totally incongruous with the setting. 2) Excessive use of CGI is a personal irritant. Additionally, the motorcycle chase scenes were only one step above TRON. I might as well have been watching my 11 year old neighbors play some video game. 3) Zero character development. I didn't care about Violet, the french guy, the scientist guy, the pretty boy, or the evil nose filter guy. I didn't care about their individual goals (mainly because they weren't very clear). I didn't care about characters dying, and I didn't care about the revelation at the end; the only indicator that I had that it was important was her somewhat awed reaction.<br><br>To be fair, Milla Jovovich has an incredible face and body and is well-suited for fight scenes. If all-CGI, all-the-time is your thing, then you'll be thrilled with the loads of glossed-over fight scenes involving Milla and hordes of green screen baddies. If you're like our entire theater, you're bored. Really, fake fights just don't impress me.","user":"Lithigin","rank":[354,539]},{"title":"Definitely not Equilibrium","rating":3,"date":"5 March 2006","review":"Kurt Wimmer who wrote and directed Equilibrium, which imho is a great movie, failed miserably to repeat his former success. The idea's behind the movie had visible potential but unfortunately the execution was extremely poor. Bad acting, a confusing and altogether nonsensical story line, and most of all bad writing really killed this one for me. This movie seemed more like a commercial for CGI than anything else. The CGI however was excellent (except for the last scene, I guess they ran out of money)and probably the most interesting part of the movie. The action which is why I saw the movie suffered from repetition: from the characters, to the setups (Violet is being attacked when she is out-numbered), to the moves, unnecessary sword fighting when they have guns with bullets, unnecessarily repetitive situations (big circle everyone attacks at once and violet wins with ease no challenging battle), and a lack of depth. Kurt really missed the mark, better luck next time.","user":"ultraelite","rank":[195,304]}]