[{"title":"Hard to find a better music documentary","rating":10,"date":"22 December 2004","review":"I am not a hard core Motown fan, but I have to give this film a 10, because it's the best music documentary I have seen. With just the right mix of interview footage, historical photos, and live performance, STANDING IN THE SHADOWS OF MOTOWN takes its place alongside THE LAST WALTZ as a cinematic cornerstone of music history.<br><br>Musicians will especially like some of the technical discussions, such as details about how legendary bassist James Jamerson produced his famous groove.<br><br>The live musical performances are inspired, with modern singers covering Motown classics, accompanied by the Funk Brothers themselves. I have watched the DVD of this film, and more recently, the high-definition version on ShowtimeHD. The 5.1 soundtrack is impeccably mixed. You can hear every instrument clearly, but the vocalist is not drowned out. With this type of mix, you want to listen to your favorite numbers over and over, concentrating on a different part each time. And, you can rest assured that there is no lip syncing or studio overdubbing. This is real music for real people.<br><br>All of the vocalists are superb, creatively interpreting each song, while at the same time paying respect to the style of the original recording artists. Viewers will have their own favorite performers, but mine is Joan Osborne, whose powerful rendition of \"What Becomes of the Brokenhearted\" brought tears to my eyes.","user":"Uthman","rank":[29,31]},{"title":"Finally the \"Funk Brothers\" get their overdue recognition.","rating":10,"date":"4 February 2004","review":"Having purchased, listened to and loved Motown's records in the 60's and 70's, I often wondered who were the masterful (and usually uncredited) musicians responsible for so many top 10 hits. With \"Standing In The Shadows of Motown\", I was able to finally put some faces with the riffs that I admired.<br><br>Although many of the \"Funk Brothers\" are no longer with us, their legacies live on with those disks by the Supremes, The Four Tops, The Temptations, Smokey Robinson and the Miracles, Marvin Gaye, Martha Reeves and so many other great artists. The Funk Brothers defined soul and R &amp; B music in its golden era. These guys played on records that sold in the millions and were being paid \"scale\" - sometimes as little as $25.00 per song at the time! Amazingly, most recordings were done in one or two takes; a testament to the talent portrayed in this movie.<br><br>If you love soul music, especially Motown's releases, this film is a must see. The recreations of the original songs by the remaining Funk Brothers and their guest performers are awesome!","user":"paulef121","rank":[21,23]},{"title":"Behind the music","rating":10,"date":"25 October 2003","review":"Forget VH1, forget MTV, this is the real deal. Even if you loathe documentaries, this film is different - it's about the music and the musicians that made it, and there's not a boring moment on film. If you ever liked the Motown sound, if you ever liked music for that matter, you owe it to yourself to learn how so many great recordings really came about. If you like what's on the radio right now, here's a rare chance to find out where it all really came from. A lot of the artists playing and singing today were heavily influenced by the Funk Brothers, whether they realise it entirely or not. So if you want to learn who created those sounds in the first place, you must see STANDING. I can't say enough about this film.<br><br>Now I don't want to belittle the talent that stood in front of the Funk Bros., because they deserve a lot of credit. But honestly, after seeing it the first time, I thought about how tragic it is that no one had really done it before. Maybe that's it's only flaw - this is a story we should have heard 30 years ago. I probably knew more than most being a musician myself, but there were many aspects that were revelations. To hear these guys play in a live setting again, is above and beyond what you could expect in this kind of work. But it's here - rent, buy, go see this movie!","user":"gravity3","rank":[21,24]}]