[{"title":"Not great, but it's good for a few chuckles and a two-hour break from reality","rating":6,"date":"14 July 2006","review":"Whenever a movie mistakenly thinks a bad pun of a tagline (\"Dupree's a crowd\" anyone?) is gonna rope in ye olde movie-going audience, there is officially room to be concerned with what you're about to watch. OK, so the tagline isn't as bad as some, but it is enough to raise a red flag. However, is it enough to indicate what's to come? <br><br>Welp, I'm happy to say that once again I'm gonna keep my distance from all your unfavorite (I'm makin' up words, baby!) stuffed-shirt critics out there who are giving You, Me and Dupree a merciless shredding because it doesn't meet the inherent level of pretension they so girlfriendlessly demand. That's right, folks. I, Johnny Betts, enjoyed You, Me and Dupree. I'm one of about three movie reviewers to boldly make that claim, but doggone on it, I'm sticking by it.<br><br>Granted, my enjoyment was heightened due to the fact that I kept my expectations low and didn't have to pay to see the movie, but I was entertained all the same.<br><br>It's only fair that I be perfectly honest and admit I'm somewhat easily amused when it comes to watching actors and actresses that I really like, and Dupree sports a great cast. Mileages will vary depending on your tolerance level of the actors involved.<br><br>Owen Wilson is one of my constant comedic favorites, once again displaying that crooked nose we all love and projecting child-like innocence with his signature charm. I also love his ability to sincerely deliver outrageous and cheesy lines in ways that make them seem not quite so outrageous or silly.<br><br>Then there's Kate Hudson, only the absolute cutest thing that Hollywood has going for it. She plays this role a little more low key than usual, but she's still irresistible, evidenced by her black bikini scene where she proves that she inherited what was always her mom's best *ahem* asset.<br><br>Rounding out the cast, straight-man Matt Dillon's cool as always, and Seth Rogen, though woefully underused, brings an impressive laughs-to-screen time ratio. Most of you will remember him from The 40 Year-Old Virgin, but he'll always be Ken Miller and Ron Garner to me. If neither of those names means anything to you then we need to have a serious talk about a couple of DVD sets you might want to consider acquiring.<br><br>Is this a film that'll find its way to the top of any of these actors' resumes? No. Is it a non-stop laugh-fest? No. Is it a film I can watch over and over and cry with laughter every time? Nah. Will you be disappointed if you're expecting something along the lines of The Wedding Crashers? Most likely.<br><br>After all, I never said the movie doesn't have its flaws. Some of the humor is a little too conventional and predictable, and the dramatic dialogue isn't exactly the most compelling to grace the screen, so no, this isn't gonna go down in the Book of Comedy Classics, nor do I feel a necessity to pencil it in as a future addition to my DVD collection (unless the special features are loaded with Kateness). But I found it to be a fun, light-hearted, silly way to take a 2-hour break from the real world. As I mentioned in the paragraphs above, its greatest strength is in its likable cast and their chemistry, and I appreciate the charm it displayed in never taking itself too seriously.<br><br>Plus, the majority of the screening crowd seemed to enjoy it. I've personally never had nor been a third wheel like Dupree, but those of you who can relate to such an experience might appreciate it on a different level.<br><br>I can't say that You, Me and Dupree is a film that just absolutely demands to be seen on the big screen, but it's certainly the kind of movie that you usually watch with friends and family where most everyone will walk away with a good chuckle, no one will be overly offended, Aunt Ella will comment on how \"it was cute,\" no one's life will be dramatically altered, and Uncle Larry's uninvited segue into some boring recollections about his own \"Dupree\" experiences will wake everybody back up to their nightmare reality.<br><br>All in all, if you think no one can bring seven different kinds of smoke like Owen Wilson, and you find Kate Hudson to be seven different kinds of smokin' then there's something here for you to enjoy. Be it at a matinée or as a future rental. It might just help you discover your \"ness.\" <br><br>THE GIST <br><br>You, Me and Dupree might not deliver two solid hours of nothing but out-loud laughter and the dramatic elements might falter at times, but there's no denying that the cast is great, and if you love those involved then you'll find some enjoyment here. I wouldn't pay more than matinée prices, and if you don't have a lot of spending money to throw around then just save it for a rental.","user":"TheMovieMark","rank":[97,129]},{"title":"Not really what I expected, but if you're a fan of Wilson it's mildly amusing","rating":6,"date":"23 July 2006","review":"I'm a big fan of Owen Wilson when he's in the right genre. He has proved to be a considerably good talent in drama as well, but comedy is his real niche. The whole \"Frat Pack\" sub-genre that is popular right now is where he most belongs, and as such \"You, Me and Dupree\" offers what one would expect from a comedy starring Owen Wilson as a slacker who leeches off of people.<br><br>What I didn't expect from this comedy was its dark side. Matt Dillon's character turns pretty nasty and his relationship with wife Kate Hudson gets rough. Likewise his confrontational scenes with Michael Douglas seem to betray the lighter attitude of the scenes involving Dupree (Wilson). The movie has a few twists and turns that I didn't expect - when I saw the ads I figured it would be an OK-but-forgettable movie about a guy crashing in a newly-married couple's house, end of story: but there's actually more to the story here. It doesn't necessarily make it stand out (it's not a very good film) - but the movie moves away from Dupree being a pest and actually begins to focus on Dillon's growing anger towards his friend as he believes him to be developing a crush on his wife. The whole subplot with Douglas' character (playing the father of Hudson) becomes quite prominent in the film as well. This is where it really takes a turn for the worse.<br><br>Whereas for the first hour or so is fun and predictable in the vein of Wilson's other films, once it begins trying to develop a \"showdown\" of sorts between all its characters it gets to be too much. The ending sequence involving Wilson being chased by a Samoan security guard is way over-the-top and betrays the realistic roots of the movie.<br><br>I also didn't care much for Dillon's character. I could relate to his frustration but he almost seemed TOO realistic for this film. You know when critics complain in these movies about how clichéd the \"nice guy\" characters always are? Well Dillson isn't a nice guy in this movie - he's got a hot temper and loses his cool a bunch of times in the movie. Towards the end he's like a mad, violent alcoholic and I started to feel like Dupree should end up with his wife instead.<br><br>Overall the first hour of this movie is fun and entertaining and has its fair share of humorous segments - I laughed a lot when Dupree burns down a house and at some of the early jokes involving his interaction with old buddies - but the movie obviously realizes this isn't enough of a plot for a 90-minute feature and tries to develop other plot lines 3/4 of the way through, and that's when it gets tiresome. The ending ultimately left a bad taste in my mouth and felt tacky. It seemed like a last-minute ending that was filmed after poor test screenings. A relationship crisis involving Dupree is never even resolved in the movie - as if the crew totally forgot about it.<br><br>I guess I would have left the theater feeling more fulfilled if perhaps the film had continued as a lightweight \"frat pack\"-style comedy rather than trying to rise above other genre entries. I acknowledge the film's attempts at becoming \"more\" than just another comedy of this type - but they chose the wrong path and just made it worse. In this case it's an example of a shallow movie trying too hard to be something else.<br><br>I liked it, and I was entertained, but it's better left as a rental and only if you're a fan of the actors. (By the way, it's worth mentioning that apart from Wilson's hilarious performance, Kate Hudson really impressed me and had more of a realistic role than women do in most of these sorts of films. You can't slam \"You, Me and Dupree\" for not at least trying.)","user":"MovieAddict2016","rank":[60,78]},{"title":"The critics are wrong, dead wrong","rating":7,"date":"16 July 2006","review":"Last night a friend coaxed me into seeing \"You, Me and Dupree.\" Even though I have liked all four of its principal actors for years, I hadn't planned on seeing it last night or possibly ever. The reviews have been uniformly terrible, so I was expecting the worst. I sat in a movie theater that was perhaps one-third full, and I was waiting for the boredom to set in, which the critics said was comingin spades.<br><br>Yes, Owen Wilson has bleached-blond locks, again, but that is probably the only accurate comment in any of the reviews that I saw, and I must have read at least ten of them, from various parts of the country. He was very good, as he was in the \"Wedding Crashers.\" Kate Hudson was perky as always, and did a splendid job; and anyone who has loved her mother over the years will find Goldie's \"clone\" just as lovely as ever.<br><br>Matt Dillon did a terrific job, and was totally believable comically; and Michael Douglas was very good too, playing his character with aplomb. In short, it was a very funny movie, and quite refreshing given the alternatives; namely, movies that are loaded to the gills with special effects, which jar one's cranium to the uttermost.<br><br>It seems like the critics were in lock step in panning this film, which may be driving away audiences unfairly. Indeed, this may be a perfect example of the critics being wrong, dead wrong. Go see it in a theater, or buy a DVD when it comes out, and my guess is that you will not be disappointed one iotaand may actually love it. All four principal actors are perfectly balanced, and they are strong enough to be wonderful foils to one another.","user":"TimothyDNaegele","rank":[123,191]}]