[{"title":"Just Like Heaven is a cute romantic comedy with some minor flaws, but you quickly get past them","rating":7,"date":"22 February 2006","review":"For a romantic comedy, I felt that this was one of the better one's. Reese and Mark are so adorable in this movie together and all you do is root for their characters for fall in love with each other because it's such a sweet story. I did have one problem that I felt was a plot hole, if Reese's character didn't remember who she was, how did she remember that she spilled cough syrup on her pillow? When you watch the film you'll understand. But besides that plot hole, I did enjoy watching the awesome chemistry between Reese and Mark. They are two great actors who make fun comedies. I would highly recommend this fun little love story, it takes me back into the unchained melody days. :D Seriously, folks, enjoy! <br><br>7/10","user":"Smells_Like_Cheese","rank":[70,78]},{"title":"Earthly and heavenly love collide, bringing hope to two lonely people.","rating":8,"date":"30 November 2006","review":"In a day of love = sex, along comes supernatural love at its finest. Just Like Heaven features Reese Witherspoon as Elizabeth, a well known but lonely doctor comatose from an accident. Mark Ruffalo is David, the widower renting the apartment Elizabeth lived in and now haunts.<br><br>Both are in different places in their love lives, David who is suffering from the loss of his wife to a stroke, Elizabeth suffering from the lack of love in her life. They are forced into a heavenly-type relationship where love prevails through daily interaction between the two. At first, this 'person that will not go away' drives David mad but it doesn't take long to see the power of love in each of their actions.<br><br>Elizabeth, who is there every time David turns around, shows her jealousy when a flirty apartment neighbor invites herself in to visit David. David tracks down the identity of his mysterious house-guest, which leads him to being chased by a knife and breaking into Elizabeth's hospital room to steal her body.<br><br>This supernatural love also affects the people closest to David and Elizabeth. Abby, Elizabeth's sister, decides to give Elizabeth her last wish to show her love for her sister and Jack, David's friend, agrees to break into the hospital with David to help him save Elizabeth, both attempting to do things not normal for them.<br><br>Just as Sam and Molly's supernatural love caused them to do unlikely things for each other in Ghost (1990), David does many unimaginable things to try to save Elizabeth's life and find love again. In the end, the never physical love takes shape as David allows his feelings to be expressed in his actions.<br><br>Photography is used wonderfully in the movie as shots of the San Francisco skyline and the Golden Gate Bridge are highlighted throughout the film, giving you a sense of looking down from heaven on the growing love between David and Elizabeth, through the earthly and spiritual realm.<br><br>This far-fetched romantic comedy shows the power of love in its most ideal form.","user":"jsaunders003","rank":[14,14]},{"title":"Wonderfully acted comedy; sensitive, silly and sweet","rating":10,"date":"8 September 2005","review":"Just saw a preview of this film last night, and I have to say, I can't wait to see it again. Usually, I'm not a huge fan of \"otherwordly\" type films, but this one is original and fun. Mark Ruffalo and Reese Witherspoon have great chemistry, and the script is smart. He's a depressed landscape architect trying to get his life back together; she's a disgruntled spirit, wondering what ever happened to hers. After their initial frustrations (she hates how he doesn't use coasters or pick up trash in HER apartment, he hates how she appears without notice in what he now considers HIS apartment) they try to piece together the course of events that have left her in this state of limbo. What I loved about this film is David and Elizabeth's progression from animosity to genuine affection, as they alternately pester then rely on one another. He becomes dedicated to trying to help her, despite appearing insane to everyone in San Francisco, except for a wonderfully quirky psychic bookstore clerk played by Jon Heder (aka Napoleon Dynamite.) Not since Patrick Swayze quarreled with a Whoopi Goldberg in \"Ghost\" have I been so amused by a spirit haunting a mere mortal. This is a great chick flick, but would work out nice for a date, too. Just have a tissue handy!","user":"paulala343","rank":[195,248]}]