[{"title":"Al Pacino is always worth betting on.","rating":6,"date":"2 April 2006","review":"Mathew McConaughey is Brandon Lane, a former football star recruited by Walter Abraham (Al Pacino), the head of a sports consulting firm to help them set the line for their sports betting business. Lane's ability to predict the outcome of games quickly turns him into a golden boy, but it soon becomes apparent that he's bitten off more than he can chew when his abilities start to falter.<br><br>Two for the Money is a forgettable, generic thriller that doesn't really offer anything new. The film does have some entertaining moments and the first half of the movie is actually pretty exciting to watch. But, the second half is really slow and very tedious. It just drags on and on and for no reason either. It could have been a nice 90 minute movie but the story is stretched out into a two hour film. Luckily, Al Pacino is in the movie and he keeps the film exciting. He gives a good, over the top performance and he pretty much raises the film up to mediocrity. Personally, sports betting isn't that interesting to me but Al Pacino makes it interesting. He can turn a bad script into an okay movie which is what he does with the film. Let's be honest, the script is not very good and the direction is weak. It's so obvious where things are going which is not surprising because this is the same guy that made Taking Lives.<br><br>Al Pacino is playing mentor to Matthew McConaughey and their chemistry together isn't very strong. McConaughey is a pretty weak actor and he can't keep up with Pacino. The lead role should have gone to someone else. Rene Russo is okay as Pacino's wife. She gives a decent performance but she was a little too bland to truly stand out. Another thing about the film that people may not like is that every character is unlikable. It's hard to care for these characters because they are either pretty mean or bland. It didn't really bother me because I watched the film to be entertained and I did get some entertainment value from the movie. In the end, if you like Al Pacino then you should give the film a shot, if you don't then just skip it. Rating 6/10","user":"christian123","rank":[54,65]},{"title":"Worth betting on, for the most part.","rating":7,"date":"2 April 2006","review":"Two for the Money is a decent, diverting picture. The material at times seems a little beneath these fine actors, but the film ends up hitting enough of the right notes to make it worth seeing.<br><br>Matthew McConaughey would seem a little out of his league on the same screen with Al Pacino and Rene Russo. By the end of the film, you will most likely feel that he's more than held his own, however. McConaughey plays a former college football star who sees his chances of a professional career destroyed by a serious injury. He quickly finds himself picking college football games for a low-rent betting line. With all of his past experience as a player, he does quite well with it. Well enough to attract the attention of Al Pacino, who runs a more up-scale operation in New York. By the end of the first half hour, McConaughey is picking all kinds of football winners, and making Pacino a ton of money. As you would expect, this success does not last very long as various egos spiral out of control and the betting gods turn on our heroes as they eventually do to all of us. The film is more of a character study about the minds of gamblers and lost identity than it is about the workings of an actual betting organization. Overall, it works on a couple different levels.<br><br>Pacino is fine, but not as out of control as you might hope. His character has a bad heart, so any typical Pacino tantrums are not really in order for him. He brings as much dignity as one could to the role of an addicted gambler, though. Rene Russo is terrific as his long-suffering wife and a former junkie. Pacino at some points seems to be trying to lose her to McConaughey. He being one of those terribly afflicted gamblers who only feels alive when he's just lost everything he wagered. The supporting cast is pretty good, too. Jeremy Piven is always appreciated, and so is the appearance by Armand Assante.<br><br>The best scene in the film takes place at a betting support group meeting that Pacino and his new protégé walk in on. Pacino, being a hopeless gambler himself shows empathy toward these degenerates, then has the nerve to pass out his business card to them!!! The logic I guess being that if you people have to lose, you might as well do it through a fellow degenerate gambler.<br><br>The biggest flaw I noticed was too many shots of McConaughey without his shirt on. Yes, the guy has great abs, but we don't need to see so much of them!! Overall this is a good film with some interesting things to say about people who bet. Notice how in the end, the \"experts\" are really just like the guys they take calls from. During the big games, we're all just sitting there with a beer in our hand, hanging by every first down or dropped ball.<br><br>7 of 10 stars.<br><br>The Hound.","user":"TOMASBBloodhound","rank":[36,43]},{"title":"Losing bet for viewers","rating":2,"date":"9 May 2007","review":"* Spoiler alert *<br><br>As astounding waste of time, talent and yes, money, \"Two for the Money\" varies from predictable to preposterous to unpleasant without pausing for entertainment.<br><br>A top-flight cast, plus Matthew McConaughey, tries to put a palatable spin on the saga of a sports betting firm preying on gullible customers who should instead be in Gamblers Anonymous.<br><br>Scriptwriter Dan Gilroy has a strong facility for finding old clichés in new settings, crafting a tale of boy-meets-boy, boy-makes-boy-money, boy-loses-boy-money, oh-who-cares.<br><br>McConaughey is a washed-up football player trying to rehabilitate an injury and making ends meet through a betting tips show. There's a surface plausibility that he has some insights into college football as a former player, which gets him customers.<br><br>In swoops Al Pacino as the owner of a high-flying betting service. He brings Matthew to New York to pick pro games, setting him up with a posh apartment and work-out room to offer beefcake shots of McConaughey for his fans of various lifestyles.<br><br>Gedde Watanabe stands in for all the hapless betters relying on the service. When McConaughey hits big with his initial picks, Watanabe gets gulled into anteing up more. Unfortunately, the power goes to Matt's pretty head. Immediately. He has one good week, and then is off to play golf instead of researching games.<br><br>Pacino is fine with this. Infatuated with his new boy toy, he fires long-time associate Jeremy Piven. Rene Russo plays Al's very tolerant wife _ you see, she knows that he's a gambling addict himself. There's no difference between Al and his customers, except that he's taking their money to enable his own bets. Always watchable, Piven gets out of the movie with his dignity intact, and Russo is her usual reliable self.<br><br>But Pacino is in full \"hoo-ha\" mode as he tries to inject some life into his empty character. At that, Gilroy gives him more to work with then the rest of the cast. As one of Al's employees, super-skinny Carly Pope stands around in the background of multiple scenes while getting perhaps 10 words of dialogue. Her big scene is sliding into McConaughey's lap to kiss him for his good work. One can't help thinking of Susan St. James snuggling up with Rock Hudson in \"McMillan and Wife.\"<br><br>Gilroy's script is so inept that he can't even realistically portray the ebb-and-flow of games. After things go wrong and McConaughey tries to get back on track, there's a scene where the football team he's picked goes up over the spread with two minutes to play. It's just the sort of situation in a real game where the other team would push for a quick score. But in Gilroy's world, Matt's colleagues immediately start celebrating their success, and then are stunned when the other team scores. (And of course, the teams playing are always \"New York,\" never Houston or Tampa Bay.)<br><br>By the end, after ruining Watanabe, getting threatened by mobster types, and (attention guys!) showing off more of his physique, McConaughey decides to return to oblivion, but not without leaving Al his very special Super Bowl pick. Will Pacino use it and keep his shell game afloat? Never has a big game seemed so small.","user":"jake87","rank":[6,6]}]