[{"title":"One of Van Damme's most enjoyable films in years.","rating":10,"date":"16 August 2006","review":"There is nothing perfect about this movie, but for what it is, it sure the hell is enjoyable. Van Damme just gets better and better in the acting department and pleases everyone in this one, new fans and old ones. The action scenes are way better then in Second In Command and much more martial arts oriented then Wake of Death, with some more trademark kicks. Vivica A. Fox is sexy and perfect for her role and the story involving a former heavyweight champ who needs security from a rap-mogul/gangster is very fresh considering its new territory for a Van Damme movie. Anyway fan of his or not, I would no doubt check this one out, its a pleaser.","user":"furiousneon","rank":[43,60]},{"title":"A step above generic and a LOT better than Second In Command","rating":8,"date":"25 August 2006","review":"The plot is simple, a soldier returning from Afhganistan becomes a body guard for a well known boxer who is loved by the community he restored, and hated by the man he put behind bars.<br><br>It begins typically with plot development and whatnot but where other straight to video movies fail this one succeeds, if you give the movie a chance you will feel the difference between this and anything else that has been released recently. The plot has more to it, the action pieces deliver what is expected but it is entertaining none the less and the humor and rap beats thrown in add what is needed to make this movie more entertaining than what i was expecting. treat yourself and get a hold of this for lazy nights where you just want to kick back and see Jean Claude do his best.","user":"IceSkateUpHill","rank":[29,41]},{"title":"Entertaining Van Damme/Lettich collaboration.","rating":6,"date":"30 August 2006","review":"Hard Corps reunites Jean-Claude Van Damme with frequent collaborator Sheldon Lettich for the 4th time.The first time was 1991's Lionheart,followed by the classic Double impact,until 2001's interesting,but flawed The Order.Hard Corps is a nice return to form for the talented director who should clearly be making more movies than he has.<br><br>On one side we have battle-traumatized soldier Phillip Savuage(JCVD) who lands a gig as a bodyguard to a head-strong(but well to due) Boxer named Barclay(Raz Adoti) all the while answering to his sister played by Vivica Fox.Tensions arise when a Gangster with an army of thugs put away by Barclay is released from jail wanting serious payback.Can Savauge rise to occasion?<br><br>The production looks like a medium-budget movie.Good photography and locations add to the \"american\" look of the movie.<br><br>We get a lot of character detail.Some nice fights.especially the Savauge/Barclay throw-down.Some nice humor involving rap music form critic Savuage.A rather Macabe scene that revolves around the \"feeding\" of Singleterry's dogs.<br><br>HCs gives JCVD a fully rounded character for once.There is a nice sub-plot that is handled very well involving his character's battle record and misplaced guilt.He still has the chops that developed very well at the start of Replicant and shined through WoD.He is a way more subtle here though.Why can't Hollywood see this?<br><br>Vivica Fox is very commanding and reactive.Charming as well.She has some nice Chemistry with JCVD.Shame she does not get to go Kill Bill for a few scenes though.Raz Adoti is very likable as the Boxer-turned-entrepreneur.He gets better in every movie he is in. As gangster Singleterry Viv Leacock gets to set on the sidelines and bark orders and does not make that imposing of a villain.That part is left to the imposing Ron Selmore.The supporting cast is good.<br><br>The only real fault is that the action scenes are far and few between scenes.At 110 minutes you would think there would be more.A lot of opportunities end up wasted.I was expecting a little more myself after some of the stand-out action seen in Hell and WOD.<br><br>However no bad CGI Trains,helicopters,Jets,Moths,or bad slow-motion is nice for once.<br><br>7.5/10","user":"argentobuff","rank":[20,29]}]