[{"title":"Ignore the critics, good film","rating":8,"date":"4 May 2009","review":"I was really surprised by how entertained I was by this. There were many negative reviews of this film and after watching the film I realised how many critics are actually quite lazy. They derided the plot as convoluted but actually I found it complex but understandable. To dismiss it as a heroes knock-off is also unfair. It's a sci-fi film but that doesn't mean all sci-fi films are the same. The film makes good use of its Hong Kong location more so than any recent film I've seen and the characters were memorable. The special effects were there for the story and not the other way around. I usually read film reviews but am glad, in this instance, I ignored them.","user":"sebbytong","rank":[273,377]},{"title":"Let yourself be Pushed.","rating":8,"date":"16 June 2009","review":"I don't see why this movie has been turned down by so many people or why such a bad word has been spread about it.<br><br>Push is one of the better modern superhuman-themed movies you will find. It won't be your top five of the year and you won't watch it a million times, but you should really like it. It won't blow you away, but it won't disappoint you.<br><br>I give my opinion on this movie not as a fully fledged movie expert, fully up-to- date, premier-going, Oscar-loving critic - but as an artistically natured, deep- rooted film lover. And I say this movie is worth watching. It has a bit of everything that is to be desired in a good movie. While a lot could've been different, and you could've improved it in many ways, it's still fine just as it is.<br><br>The story in this movie is excellent. How it is portrayed and told is great. The actors all fulfill their role, some with splendor. And no matter what anyone might have told you; this movie is greatly artistical.<br><br>I believe Push is quite unique in many ways, foremost for its unusual lack of hierarchy of the powers you see in the film. You're used to see a lot of people possessing powers, but only one of them - Magneto for instance - being the one standing above all else. But in Push no one is the obvious stronger one.<br><br>Push uses a lot of twists, and not in the first-Saw-movie way which blows you out of your seat, but it still manages to keep the movie interesting, even tough the twists are all quite predictable.<br><br>Push is also, as I said, greatly artistical. It has a lot of fantastic colors and utilizes lighting very well, it's set in very beautiful environments, and there are a lot of other great cinematic techniques being used. I especially like the choice of soundtrack in this movie. It reminds me a lot of the way they choose to use music in The Dark Knight. Instead of some really catchy, noticeable soundtrack there's been a very diligent work done with a subtle yet powerful soundtrack that emerges only when necessary and gives an indescribable force to the movie.<br><br>All in all, Push is a quite non-mainstream, entertaining, good movie worth watching.","user":"that-wierd-guy","rank":[163,235]},{"title":"Needs tidying up, but it's still good.","rating":9,"date":"16 March 2009","review":"PUSH is one of those movies which really got me excited after the first viewing of the trailer, and now that I've finally watched it, I'm glad that I did.<br><br>The storyline was rather good and believable, didn't leave me confused or bored at the end. Although more time could have been spent explaining certain things in detail instead of the constant scenes of standing around and pondering the next move.<br><br>The visual effects in this film are pretty good. And the acting isn't too bad either. Applause for Dakota Fanning and Chris Evans. Also, I really enjoyed the way the movie was shot, there was somehow this sense of realism to the whole thing.<br><br>However, I didn't enjoy Camilla Belle's acting. Although I did enjoy her performance in The Quiet, she just seemed really off in this movie. Either she wasn't given enough screen time, or she was outshone by Dakota.<br><br>By the way, those who are comparing this show to HEROES are preposterous. Telekineseis and all of these special abilities have been around long before then! Though I am a huge fan of HEROES, I think it's really nothing in comparison to PUSH.<br><br>By the way, this show had me glued to the sit even when I really had to use the toilet. In other words, I hope there's a sequel.","user":"obsidianskye","rank":[169,252]}]