[{"title":"Great Entertainment With Brilliant Moments from Bong Jun Ho","rating":10,"date":"16 August 2006","review":"The Host is a film that people have been talking about a lot during its production and the teasers and posters I'd seen to date had gotten me pretty interested. So when it was announced for the Edinburgh International Film Festival this year I had to go and see it.<br><br>I have to say I was more than impressed with what I saw. The Host is a film that provides something of everything from suspense to terror, from drama to a little touch of comedy, this film has it all. What's more surprising is that it delivers all of them very well and provides great entertainment on the way.<br><br>The opening of the film is perhaps one of the strongest I've seen. Starting with introductions to some of the main characters we instantly get a feel for who they are and what they are about, all the time with a healthy amount of humour. The first appearance of the creature is viewed quite satirically, or rather the peoples attitude and \"car crash\" mentality is.<br><br>Then when it races through a busy park attacking people, it's probably the best portrayal of group blind panic I've seen, and coupled with some excellent edge of your seat and distressing scenes. The shot of the girl standing in shock is one of the most disturbing scenes you'll witness, it's not something you'd expect to happen in a typical film and it's indicative of scenes to come.<br><br>Throughout the film you'll be toyed with, there are the usual straightforward scares, and one so effective I leapt out of my seat. There are also moments like the opening one at the park, where the unexpected happens and you really do get a surprise at the direction the story has just taken.<br><br>There are other similar incredibly strong moments that will hit you with a shock, and they seem out of place and going against what you believe should be happening. I felt myself looking at the screen in surprise thinking \"That's not fair!\", and that's a great response to illicit.<br><br>The frequent humour is an aspect of the story that is really well handled, it never detracts from other areas of the story, and often helps to relax a tense or distressing moment in order for the filmmakers to return to the situation and build it up again. Sneaky devils.<br><br>One of the oddest moments is when the family are mourning wildly in the school hall, this begins sadly and slowly, building in your uncomfortableness and sadness. Then something strange happens, they just manage to tip the performance into humour, just enough to lighten the situation and raise a few sniggers. Then photographers and film crews descend and we're presented with an interesting social commentary, yet you're still feeling the humour of the moment and just coming out from the sadness of the family. It's all wonderfully woven together.<br><br>The leads are good, particularly the young girl, Park Hyun-seo played by Ah-sung Ko, who is very convincing and strong in character. At times the emotions she shows are so natural and believable, you'll find yourself caught up in her scenes.<br><br>The other characters continually walk that fine line between comedic and serious performances. Each of them have their flaws which are shown throughout the film, but in the end each get their chance to redeem themselves and sometimes they get multiple chances, often they need them too.<br><br>That raises another interesting aspect, instead of following a standard route with the characters, their development follows the unusual turns of the film itself and we're treated to surprises and failures when we don't really expect them. Indeed you could almost say that these characters are more human than many fully focused dramatic character based films.<br><br>The creature effects in this film are quite superb. It has weight and a natural, organic movement. So often CGI creatures will appear to run over the ground or not properly interact and collide with real life objects, here though every effort has been made to address this, and it works superbly.<br><br>I don't believe I'm spoiling anything about the movie when I say that the ending seems slightly flat against the amount of entertainment that the rest of the film has managed to deliver. It wraps everything up incredibly neatly, with each character having had their shot at redemption. Yet it was a little too neatly tied up for me, although it didn't detract from anything else the film gave.<br><br>I'd recommend this film even for those not interested in Asian Horror, for this can't be classed alongside what you would expect from a typical Asian Horror, indeed there's not even a lot of horror. This is a suspenseful, thriller, drama, comedy, you're getting the idea. It's great entertainment with some brilliant moments of shock and terror. Well worth watching.","user":"whitecatus88","rank":[300,397]},{"title":"Funny, scary, emotional, intense, thrilling, sad. And then funny some more.","rating":10,"date":"18 August 2006","review":"What else is there to say? The Host elicits every feeling, every sense of urgency, dread, sadness and happiness with ease. And somehow it manages to cram all of that into the first fifthteen minutes. After that it speeds along and doesn't let up. I was with it till the end, laughing when I was supposed to, crying, and even cheering. It is one of those rare films that blends all the respective genres into one with an almost scary simplicity. I shouldn't be surprised, it is from writer and director Joon Ho Bong whose last films the equally brilliant Memories of Murder and the excellent black comedy Barking Dogs Never Bite featured a similar feeling. <br><br>How does the man do it? Like with his other films particularly Memories of Murder he manages to break the conventions of the genre by frequently poking fun at the rather stale \"monster\" genre and by taking a fresh, appealing perspective. It's funny at all the right moments and even in moments when you feel you shouldn't be laughing you cant help but laugh. It's full of vibrantly realized characters, who each have their \"moment\" that make you laugh at the ridiculousness or gasp at the coolness. It is written with care and love, the pace never stagnates and the dialogue is never forced. The CG monster effects are nice and appropriately unrealistic in appearance. Perhaps too unconventional for American audiences but it really works in the context of the films rather serious yet quirky atmosphere. The acting is excellent, Kang Ho-Song continues to impress, star in the making Ah-sung Ko gives a very good first performance, and the rest of the cast give great performances. All managing the frequent dips into serious and comical and even both at the same time.<br><br>The Host is a brilliant, brilliant film. I'm so pleased I had the pleasure of seeing it at the cinemas, the way it deserves to be seen. Despite fitting into a rather common genre, The Host is an original. It is a unique and refreshing film, full of charming characters, awesome action sequences and even an emotional poignancy that weaves itself into the film at the most appropriate of times.<br><br>The Host is undoubtedly my favourite film of the year and one of the most entertaining films I have seen in recent years. If you like your films to be highly enjoyable, but also smart and even emotional, you will love what The Host has to offer.","user":"Hoban-W","rank":[223,313]},{"title":"Best \"Monster FX\" in years!","rating":8,"date":"8 August 2006","review":"I just saw this film at the 2006 Melbourne International Film Festival. So invigorating to see a fantasy type film in a great setting on a big beautiful screen. Full house (aprox 400-500 people)Classic old theatre style of The Regent Theatre in the heart of Melbourne city.<br><br>What a great surprise to see a quality entertaining monster flick. You might begin to think as I tend to that the rest of your cinema going days will be spent avoiding such appalling Hollywood \"Crap-busters\" such as Godzilla or (enter current relevant movie here ;-) This film proves that adults can still be taken back...taken back to staring at the silver screen in wonder. It further proves, that a fantasy/adventure monster film can be a serious and funny film at the same time. Formula defying, original, intelligent... comical and sad. Comedy with pathos (just like real life refusing to fit neatly into categories)...very clever film making. Even with the alleged fear of subtitles, I would think there was a massive audience for this film amongst English speaking audiences...if only they would be given the chance to see it. Where's the mainstream distribution in Australia for a film like this? Best special effects and monster effects I've seen in years!","user":"denny-carr","rank":[169,238]}]