[{"title":"Brilliant and Extremely Timely","rating":10,"date":"8 October 2006","review":"Extremely few comedians are successful, even fewer for more than a year or two and the majority of those few that are still working the large venues, who prove themselves to be other than just some flash-in-the-pan dressed up in an ill-fitting suit of success by an aggressive publicity team and a gullible, entertainment starved audience; usually build their careers on one or two jokes that they've turned into their shtick: they have a quirky personality that is charming or, at least, familiar. Essentially they're one-trick-ponies with long legs. This isn't something I was really thinking about in much detail until I watched the exception to all these rules: George Carlin in Life Is Worth Losing. Here is a man who is nearing seventy years old (as of this writing), his fiftieth year in show business and he presents us with his finest, most polished work of all. He is one of those exceptionally rare breeds, in any given professional field, who not only improves with time, but substantially so to an extent that you clearly see all of his work until now has been the foundation for the masterpiece he offers us now. Not one to be particularly impressed by the vast majority of so-called \"great\" things, it took me a while after my first viewing of Life Is Worth Losing to absorb what I had seen and several repeated viewings shortly thereafter to understand I was witnessing a truly great comedian, a genius, THE master of his craft. In a world where the vast majority of \"great entertainment\" is hyped up bullsh*t and mediocrity, a passing fad at best that sours on your second taste if not turning bitterly toxic, George Carlin is a man who shows us what real, adult comedy should be: a mixture of cleverly constructed fun and intelligent material that makes you think about our comically tragic existence. This is George's best performance and material so far, his most thoughtful, thought out, thought provoking and heartfelt.<br><br>I really expected to see and hear universal applause and praise for this great work. Instead, I was surprised to hear and read so many negative reviews about this masterpiece. Surely these can't be the same George Carlin fans who loved his work before. Especially those who said this work was \"bitter\". If anything I found his latest offering to be a lot less angry than most of his previous work and more thoughtful. Then I realized what all the fuss was about: in this performance George is holding up the biggest mirror he's held up so far. He's forcing more Americans to look (and laugh if they have the courage) at themselves than he ever has before. He leaves very few stones unturned in his satirical offering. For a start he talks about a lot of Americans right off the bat when he discusses obesity, as a third of Americans are classified as medically obese and about half of those as morbidly obese, according to the latest American Medical Association studies. He also talks about mindless consumerism. Between these two subjects he's covered the vast majority of Americans. And since Americans are becoming more dimwitted and righteous, the bulk of them will not laugh at themselves, the purpose of intelligent humor but prefer the sadistic, mean spirited \"humor\" they see on television (which George satirizes in \"The All-Suicide TV Channel\") or read in those idiotic emails too many people forward to everyone in their address book with titles like \"10 jokes about rag-heads\" or \"Stop complaining you homeless person\". (Some of these atrocious emails that preach intolerance are erroneously attributed to George Carlin but in fact are written by other people, none of whom have the courage to take credit for these awful, embarrassingly written pieces. Sources: see www.snopes.com or www.georgecarlin.com) <br><br>If you watch \"Life is WorthLosing\" for just the opening and closing segments, you will see pure brilliance. The opening segment \"A Modern Man\" is a work of genius and you will be awestruck by George's mastery of the English language as well as his selection of timely material. The closing segment \"Coast to Coast Emergency\" is actually a very hopeful piece but I think too many people get confused by it because he's discussing the bitterness of the average person and is revealing that the solution to most people's unhappiness is to rid themselves of their own bitterness. Don't listen to the critics of this work, it's a fantastic piece. Typical of the vast majority of naysayers, they are really talking about themselves when they describe George as \"bitter\". It's why it is always a risk to tell the truth because most people want to kill the messenger that brings them bad news, especially when that \"news\" (intentional ignorance actually) is about themselves.<br><br>This is George Carlin at his polished, intellectual best. It is a masterpiece of comic genius that you will want to add to your library and watch again and again; especially after one of those too frequently increasing moments of realizing the dumbing-down of your fellow countrymen and women is an alarming reality.","user":"zippyflynn2","rank":[27,27]},{"title":"Carlin's most bitter and scorching stand up yet","rating":8,"date":"17 August 2006","review":"Many people on both this site and Amazon have claimed that \"Life is Worth Losing\" is George Carlin's worst comedy performance. One reviewer claims he has simply turned into a bitter misanthrope - but I don't think that's very fair. I thought \"Life is Worth Losing\" was indeed one of Carlin's harshest acts, but it was also very funny.<br><br>His opening, \"Modern Man,\" is a four-minute mind-bending string of words (similar to the opening of \"Complaints and Grievances\") which is hilarious and almost unbelievable - whoever hears this and thinks Carlin is \"losing it\" must be kidding! After this he begins dissecting American life and basically thrashing about the people of our nation with his words - labeling Americans as fat, mall-loving idiots. And some might be offended by this, but that's why he's George Carlin.<br><br>Carlin may be getting older but I really fail to see how he's \"falling apart\" as a comedian here - I thought it was a great show and although it's his most bitter act I've heard, a lot of it is also totally true.","user":"MovieAddict2016","rank":[18,19]},{"title":"Everything he says is still Absolutely Correct","rating":8,"date":"11 October 2006","review":"George Carlin remains the King of HBO comedy and refuses to relinquish his crown with GEORGE CARLIN: LIFE IS WORTH LOSING. Carlin continues to be the master observer of all that is good and evil and twisted in the world. He opened this set with an extremely long poem about himself, utilizing every pop-cliché that we have become accustomed to hearing these days and has a way of making most of these clichés sound banal and silly. Carlin also does something in this special that I liked that he rarely does: he referenced a joke from an earlier concert because he got mail from people who didn't understand it and chose to explain it here. You don't see that often. This show, like all of Carlin's shows, is scathingly accurate and roll-on-the-floor funny, but this one seems to have a darker theme floating over it than most of his shows. The majority of the material seems to be centered around subjects like death, dying, suicide, murder, and other cheery topics, yet, as always when watching George, I found myself laughing my ass off and agreeing with everything he says because after all these years of pushing the comedic envelope, one constant that has never changed with George is that everything he says is absolutely correct.","user":"Isaac5855","rank":[8,8]}]