[{"title":"Refreshing, sensitive and intelligent!","rating":8,"date":"22 July 2015","review":"I'm going to make it short. I'd rather not go into elaborate analyses and proper assessment the more so because I don't want to sound pretentious. Let me just say, that I thoroughly enjoyed the film. It is funny, thoughtful (but not overdramatised), clever and sensitive at the same time. Finally a film where love, a man and a woman and the relationship between them is treated with respect, gentleness and is elevating, and refreshing. The script is great, the acting is superb, the dialogues, those subtle gestures, looks, smiles are all in place. Nothing overdone just treated with natural care. What little glitches there are in this movie simply add to its charm. Watching this film is a great experience, it's great entertainment. I warmly recommend watching it.","user":"Balrogh77","rank":[225,236]},{"title":"You have to watch this beautiful movie, and read this after that","rating":9,"date":"20 March 2018","review":".\n.\n.\nSpoiler\nI was curious myself. I googled it but didn't find any useful answer. So I went to sleep and awoke with this possible interpretation in mind:<br><br>First, think back to the scene where they were drawing on the back of the artwork at the hotel. Remember that we never got to see what they drew/wrote.<br><br>In the end, as she is looking at the guest survey, and sees the arrow and instruction to \"turn over,\" she flips the card, and it looks like the word \"remember\" is there...<br><br>I think he's reminding her that he has a message for her behind the artwork at the hotel (which she would also have to \"turn over\" to read). And of course to retrieve the message would mean another trip back to NYC, somehow acquiring or getting into that exact room, and hoping the message is still there.<br><br>For two who seem to believe in serendipity, it's perfect. It leaves open the possibility of another adventure. And another adventure on top of that depending on what the message says.<br><br>I'm pretty sure she'll take him up on the adventure.<br><br>Anyway, that's my two cents.","user":"singhrobinpreet","rank":[109,113]},{"title":"Beautiful","rating":9,"date":"23 July 2015","review":"I haven't seen a movie like \"Before we go\" for a very long time. The script, the story the characters everything is just so charming and cute. I love that kind of \"intimacy\" on screen,it's intelligent and honest. I'm with a smile on my face after the movie. I think this is definitely not a commercial movie so if you need to see something different but at the same time very close to you. That will be not a waste of your time but a reason to questioning yourself and consume things in a different way<br><br>Very true, gentle... great directing work, light and acting at the same time Perfect place to chose New York City by night...applause to the cast +crew. If you need to see something smart,depth and sensitive... Enjoy:)","user":"stelfi","rank":[164,182]}]