[{"title":"This movie was pretty brilliant...right up to the end.","rating":8,"date":"22 February 2020","review":"The legendary book comes to life, in this Francis Lawrence adaption. A perfect decision in casting Will Smith as the main protagonist greatly improves the film. The movie's visuals are pretty good even though some people may say otherwise. All in all, it's a great adaption of a terrific novel.","user":"MR_Heraclius","rank":[45,47]},{"title":"I Am Legend: The Movie With So Much Potential That Was Ruined","rating":7,"date":"15 December 2007","review":"Normally I have an opinion on a movie when it's over, I can reflect on it for a few minutes and then I'm done with. It becomes cataloged in my brain as 'awesome' 'pretty good' 'worst.movie.ever.' or a host of other standard issue classifications.<br><br>Not so with 'I Am Legend.' I can't recall the last time I was this frustrated by a movie.<br><br>It had so much potential to be so great, and then just fell apart in the last third of the movie with every summer blockbuster/zombie movie cliché known to man, run one after the other.<br><br>The movie creates a fantastic atmosphere of post-apocalyptic New York and requires your patience as Will Smith's character begins to unravel as the monsters around him begin to become more aggressive and intelligent. Before heading out to see the movie, I did some research on the book the movie is based on and the reason it is such a well known classic story is because of the twists, perspectives and grim ending. What you find out towards the book is that Neville really is the last man on Earth, and the rest of society are now these zombie/vampires, and Neville's ability to walk around in the daylight and kill them has basically made him the monster. He is the one feared by them, he is the villain, and they will stop at nothing to eradicate this day walker who preys on them.<br><br>Keeping that in mind, I was super impressed by how the movie seemed to be heading in that direction with that head Zombie guy's heated animosity towards Neville as if it were personal (and perhaps the zombie Neville captured were his significant other, thus lending the zombies an actual 'society), and not merely 'meee hungry for flesh.' The movie basically went right down the tubes when Will Smith decided after he had to kill his dog that he was going to go on a suicide mission at the docks playing Destruction Derby with his Explorer. All of the haunting, edge-of-your-seat suspense and fear created brilliantly with the scene in the abandoned bank, and with the zombie dogs clamoring for the last sliver of daylight to cede, and creepy subtle atmospheric effects throughout went right out the darn window and we suddenly found ourselves in '28 Days Later.' With some random chick coming out of nowhere to somehow scare off 100 angry zombies (who had just blown his UV truck to hell mind you; but apparently she had outfitted a better one than an incredibly resourceful Military Soldier/Scientist), carry Will Smith, who weighs twice as much as her, into her car, and somehow drive them to safety.<br><br>So we find ourselves in an incredibly uncomfortable scenario with the Brazilian chick and her creepy Columbine son, and some Bob Marley metaphors laid on top of terrible dialog. Then, instead of a suspense-ridden in-the-dark atmospheric climax, with heavy breathing, flashes of gore, heart pounding scene, we're left with cheesy CG explosions, zombies body slamming people, no one keeping a gun on them when there's about 50 scattered across the house, and other usual stupid horror/action movie miss-steps.<br><br>We finally find ourselves with Neville, back against the wall, Zombie leader separated from Smith's neck by a rapidly deteriorating inch of glass and I'm hoping the movie will be somehow salvaged with a great twist, a grim conclusion, or at worst, a convoluted piece of foreshadowing from the first twenty minutes of the movie being pulled out of the scriptwriters pie hole to be played out here. (I personally thought he could have awakened the zombie girl he was curing and seen if the reaction of the intelligent zombie would have caused a reaction, or if some communication could have been made between Neville and his antagonist who at this point we've come to realize is moderately intelligent). I'm an idiot for expecting anything but 'yo, hide in the chimney while i blow myself up.' Don't even get me started on the Utopian Vermont safe-haven, seriously. You're going to tell me 1 million zombies couldn't overrun some 20 foot walls spanning what would approximate 2 miles of land? Christ. I could have written a better ending in 20 minutes on the back of a cocktail napkin.","user":"leoncielo","rank":[252,298]},{"title":"Should have been better","rating":29,"date":"29 December 2007","review":"The 1954 sci-fi/vampire novel \"I Am Legend\" by Richard Matheson has now been filmed three times: as \"The Last Man On Earth\" in 1964 originally scripted by Matheson himself (which I have never seen), as \"The Omega Man\" in 1971 without the vampire elements (which I have viewed three times), and now with the original title and expensive sets and special effects. This time the seemingly sole survivor of the worldwide pandemic Robert Neville is played by Will Smith who is an actor with real charisma and charm and considerable box office appeal who has beefed himself up for the role.<br><br>The main strength of this version is the location shots in a deserted New York City (a move from the Los Angeles of the book and earlier films) and, although the filming of these scenes apparently caused traffic chaos and much anger for local residents, they chillingly set the tone for this dystopian thriller. To see the silent streets around Times Square or South Street Seaport or the lone scientist fishing in the Metropolitan Museum of Art or playing golf on the \"USS Intrepid\" is to view this heaving metropolis as we have never experienced it before. The German shepherd dog who is Neville's sole companion deserves an honourable mention for showing greater thespian skills than most of the extras and stunt men.<br><br>The principal weakness of the movie, however, is the realisation of the surviving victims of the virus. The CGI characters are almost as silly as they are scary but, above all, they are presented as more animalistic than human. \"The Omega Man\" handled these characters much better presenting them as sad as well as scary. The other serious fault is the lack of clarity in the narrative - at times, it is simply unclear what is happening and why and a longer director's cut would be welcome. Finally the references to Ground Zero and God may play well with American audiences but will not be so resonant to audiences elsewhere in the world.","user":"rogerdarlington","rank":[308,428]}]