[{"title":"Entertaining","rating":8,"date":"22 September 2006","review":"Very Entertaining. I will recommend it. Attention to detail was very factual, such as filing the bullets so they wouldn't jam and the Spandaus having to be hand cocked. Drideckers, the three winged Fokkers; did not enter the war until the very end. There were also two lions; Whisky and Soda, who were later banned to the stables because they kept peeing all over the château. The characters were very well done and told a good story. I hope it makes people look up the fliers and read about them. There were quite a few men that made up the Esquidrille and all were very interesting. When fact becomes legend print the legend.","user":"coldevinc","rank":[92,121]},{"title":"The aerial combat was exciting, tense, and realistic","rating":8,"date":"19 September 2006","review":"(Synopsis) World War I began in Europe in 1914, but by 1917, the United States had still not entered the war. However, many brave young American men went to France to fly and fight for the Allied powers. They joined the Lafayette Escadrille fighter squadron. The Germans had better planes, weapons, and pilots. The average life expectancy for a fighter-pilot was three to six weeks. Why did these Americans volunteer to fight in France with certain death when their own country was not at war? This was a time when men were idealistic, but naive to embark on a great adventure. Blaine Rawlings (James Franco) was forced to leave his home in Arizona after the family ranch was foreclosed by the bank. Blaine sees a newsreel of fighter-pilots in France and decides that he has nothing to lose. Briggs Lowry (Tyler Labine) can't do anything right and is shamed into joining by his rich father. African-American boxer Eugene Skinner (Abdul Salis) had been living in France, a racially tolerant country, for many years, wanted to give something back to his new country. These Americans were under the command of French Captain Georges Thenault (Jean Reno) and American Squadron Leader Reed Cassidy (Martin Henderson). They were the world's first combat pilots.<br><br>(My Comment) The film was inspired by a true story. What that means is that the writers could write anything they wanted to about the pilots' personal lives. There were actually 38 American volunteers with an average age of 26 that joined the Lafayette Escadrille. Thirty were college educated and eleven were sons of millionaires. These men had a sense of adventure and romance of war, and they believed in \"dying with honor.\" The movie uses a composite of these qualities of the actual pilots, and yes, there really was a black pilot in the squadron. The movie does not shy away from the real aspects of war or the sordid aspects of life on the ground. After every mission there are some pilots who do not return, and we get to see their replacements, and how the pilots deal with the loss of their friends. The aerial combat was exciting, tense, and realistic with the attack on the zeppelin being the best scene of the movie. There is a love story that slows the pace of the movie, and it was a little too long. You will love the scenes with Whiskey, their mascot lion. I think the writers could have used the real pilots' stories and names, and it would have been a better movie by giving credit to those young men. If you like war pictures this is a movie to see. (MGM Pictures, Run time 2:19, Rated PG-13)(8/10)","user":"the-movie-guy","rank":[136,183]},{"title":"A fun adventure that plays loose with history","rating":8,"date":"22 September 2006","review":"When I first saw the previews and read the synopsis, I was expecting a horrible film like Pearl Harbor. Fighter pilots in love with a girl. Happily the love story is not sappy or sickening and actually helps create character development. And how the love story ends is a very nice non-Hollywood ending.<br><br>The Planes look magnificent, but could have been done better. The use of German Dr1's (the Fokker Triplanes) as the only German fighter is understandable as distinguishing friend from foe. However, making all of the Dr1's (except for the main villains ) solid red is extremely annoying. While it is up to some discussion if the Red Baron's Dr1 was all red or mostly red, it does not mean that all Dr1's were red, especially all red. The Dr1's came from the Fokker factory usually in an olive drab paint scheme with a light blue underside. The film makers could have added a red scheme to the planes but left a portion olive drab and blue underside, it still would have made the Germans distinctive without being clones of Manfred von Rictoffen.<br><br>The dogfights are fun to watch and are fairly exciting, however the planes fly highly unrealistically at times. Overall the CGI is excellent but at times it is noticeable as CGI. The planes that explode (Explosions are such a Hollywood staple :) ) are unrealistic. The planes are traveling 70 t0 100 miles per hour in reality, but the explosions react as if the plane is standing still, going up in a ball instead of being spread along the doomed plane's path.<br><br>Over all it was fun to watch and covers a historical period that has long been neglected in film.","user":"Wailwulf","rank":[69,92]}]