[{"title":"Slapstick south of the border ... in tights","rating":8,"date":"16 June 2006","review":"Much to my surprise, as I begrudgingly went to the movies with my 12 yr old son, I LOVED this film. I expected nothing, yet in return, I received a wonderful 1 hour and 40 minute respite from the real world, filled with slapstick humor and total silliness. Slapstick humor always walks a tightrope between bad taste and belly laughs. The Three Stooges are mind-numbingly inane: most laugh intensely and some never get the joke. Laurel and Hardy isn't for everyone either. Nacho Libre is not filled with Woody Allen irony, it doesn't have Christopher Guest's drollness, and it's not James Brook slick. It's not sophisticated humor! How can any film featuring Jack Black as a Mexican friar/fryer/wrestler/wannabe wooer ... all for the \"good of the orphans\" be taken seriously? It's simply for the 12 year old boy in all of us who laughs when Moe hits Curly and laughs when fat guys, even with over the top Mexican accents, are paired with skinny guys ... in a wrestling ring ... with stretchy pants.<br><br>I originally wrote this as a reply to a poster who asked if the mean IQ of people who liked this was 93, but the post was subsequently deleted. But to him I say, \"By the way, I'm a physician and my IQ is a tad over 93. But even if I had no job at all and even if my IQ was 93 ... who cares ... I laughed, with my son, eating popcorn, in the dark. And that's the joy of sharing a movie like this.\" No es?","user":"halincoh","rank":[324,380]},{"title":"This movie is racist...my a**","rating":17,"date":"17 June 2006","review":"Honestly people, get over it. Stop being so damn sensitive, suddenly people think everything is racist. People are so busy tripping over themselves trying to be politically correct all the time, it's ridiculous. Nacho Libre is not being racist. It's telling the story of a guy who lived in an orphanage and became a wrestler to save it. Take it for what is it...a movie. Yes, Jack Black's accent is annoying...but guess what...it's a comedy, it's supposed to be one of the things that makes people laugh. It's not supposed to be realistic so stop thinking that it has to be.<br><br>Go watch the movie. It's funny and Jack Black is priceless.","user":"dyslexiasoftware","rank":[447,590]},{"title":"very funny, if shallow","rating":8,"date":"14 June 2006","review":"Preface: I will avoid giving specifics on the movie in this review. There is nothing more damaging to a comedy that knowing the jokes before hand. Since I liked this movie, and it was funny. I shall shy away from spoilers. <br><br>Jared Hess shoots his movies like a funny David Fincher. His obsession with grime and dirt and everything looking old and decrepit, is almost fetishistic. But he has grown a lot since we last saw his work, (shooting extreme close-ups of steak and tater-tots in Napoleon Dynamite). Not to sound cruel, but I was surprised while watching his latest effort, Nacho Libre, because, wellit looks like a \"real\" movie. There is dynamic lighting, proper shot composition, and interesting camera movements. I guess a budget increase from $400,000 to about 38 million makes a difference. Oh, and by the way, the movie is very, very funny. I'm talking cola out your nose funny. Starting with the addition of (the brilliant) Mike White to his writing staff, Hess has crafted a much more cohesive and narratively satisfying film.Though it does keep the skit-ish nature of Napoleon Dynamite, stuff actually happens in this film. The movie, (apparently based on a real monk, though the end of the credits state that the film is totally fictitious) tells the story of Ignacio (Nacho for short), an orphaned boy who becomes a monk at an orphanage. Nacho is in charge of \"Cooking duties anddead guy duties\" and is generally looked down upon by the other monks and priests, though the children love him. After the orphans nacho's are stolen by a homeless man and the head priest humiliates Nacho for his pitiful meal preparation skills, Nacho--who's greatest love in life is masked luchador wrestlingdecides to enter a tag team match, with the thief as his partner. They lose, horribly, but discover that even the losers get paid. And with money, Esqueleto, the street urchin (and yes, those are his real teeth) can live comfortably and Nacho can buy better food for the orphans. Orphans who are hilariously always referred to as \"the orphans\", as if to constantly reminding them of their misfortune. Also, during all of this, Nacho is trying to woo the new girl, Encarnación, who just happens to be a nun with the same name he has. <br><br>Given the current battery the Catholic Church is taking in public opinion, it is nice to see a movie that never once mocks the religion. Sure, there are priests who have the hots for Ana de la Reguera. But the she is so dumbfoundingly gorgeous, it would be silly for any man, much less one who must be celibate, to not at very least look twice at her. The church here is played as a wholesome, good place. There is never any salacious undertone to the scenes between the priests left alone with small children, and nobody \"gets\" the girl in the end, so all the general morals are upheld. Also, it is nice to see a movie about Latin culture starringgaspLatinos! Everyone in the movie, except Black, (who is actually playing a white guy, not a Mexican as many IMDb posters have postulated) is of Hispanic origin. And the culture comes off well.<br><br>Beck does a few wonderfully fun songs for the soundtrack, and Danny Elfman's score is his best in years. (ironically, shortly after I wrote this, I discovered that he had taken his name off of the film because he was unhappy with the way his work was presented). There is a general irrepressible levity to the proceedings that is infectious. And though the movie meanders more than it should, you can't help forgive its shortcomings because it is so well natured. Oddly in contrast to this are the wrestling scenes. They come off as overly violent, and though this could have just been Mann's Chinese's killer sound system, I could hear bones crunch, and things looked painful. The action scenes aren't farcical like the rest of the film, though some of them are thrilling. <br><br>Parents should be aware that this movie could be a bit scary for children under 9 or 10, and though the film has a more positive role for minorities and women than any film I've seen in a while; it does seem a little bit inappropriate at times. There is nothing sexual, and there are good morals to be found, but the movie does have a strong line of toilet humor and Punch and Judy level slapstick throughout. However, this isn't really a kid's movie. It is just a movie, that happens to be rated PG. It is made for teens and adults, but there is nothing objectionable enough as to keep kids out. Overall, Nacho Libre is a pretty damned funny movie, with a good heart and lots of laughs. Jack Black even gets to sing, a few times! And while it is less instantly quotable than Napoleon Dynamite it is a better film overall. If you like Jack Black, Dynamite, Wrestling, or your kids have already seen Cars and you want to take them to something else, this movie is about as good as you could hope for. Though not especially deep, it is exactly what I want when I go see a big summer comedy. Now I just can't wait for the Tenacious D movie.<br><br>Post Script: Prepare to hear \"I only believe in science\" constantly after this film is released.","user":"tawdry_hepburn","rank":[184,257]}]