[{"title":"Don't listen to the naysayers","rating":5,"date":"5 January 2007","review":"I read the message boards before seeing the movie and wasn't really that excited to go see it. Yes, the general storyline has been done before...<br><br>I'm a male teenager and this movie made me cry. I can't remember the last time a movie made me cry... in fact, I don't think I have (teary-eyed doesn't count). Freedom Writers moved me.<br><br>It was so much better than I expected. All I can say is that it is definitely worth at least a matinée viewing. <br><br>The movie reminded me that all of America isn't like white middle-class suburbia, of which I am a part. Regardless of how many times the same movie has been done before, the white middle-class can use as many reminders as possible that education is not that easy to obtain everywhere. Even in America, opportunity is not equal, and I think it's important for people to see that.<br><br>Don't judge the movie without seeing it.","user":"bandislife-1","rank":[299,350]},{"title":"Truly Moving Picture","rating":15,"date":"15 December 2006","review":"I saw this film on December 13th, 2006 in Indianapolis. I am one of the judges for the Heartland Film Festival's Truly Moving Picture Award. A Truly Moving Picture \"explores the human journey by artistically expressing hope and respect for the positive values of life.\" Heartland gave that award to this film.<br><br>Woodrow Wilson High School is located in Long Beach, California. The school is voluntarily integrated, and it isn't working. The Asians, the Blacks, the Latinos, and a very few whites not only don't get along, but also stay with their own and are part of protective and violent gangs. There isn't much teaching or learning going on at the school. It is a warehouse for young teenagers until they can drop out or are kicked out.<br><br>With this background, an idealistic teacher (Hilary Swank) arrives to teach Freshmen English. She is very educated, pretty, middle class, non-ethnic, well-dressed, and smart. From day one, she doesn't fit in the classroom with these tough kids, and she doesn't fit in with the faculty, who have all but given up and resigned themselves to being the keepers of the student warehouse.<br><br>But our idealistic teacher will not give up. She slowly and painfully tries to teach by first learning about \"the pain\" the students feel. She encourages each of her students to keep a journal of their painful and difficult life, and then to share the journal with her. She also attempts to get the four ethnic groups to come together by getting them to recognize what they have in common; specifically, their music, their movies, their broken families, and their broken community surroundings.<br><br>While struggling with the students, she has to deal at the same time with two complicated and demanding male relationships. Her husband (Patrick Dempsey) is often supportive, but often jealous of her time commitments. Her father (Scott Glenn) is often disappointed of her career choice, but often proud of her courage and tenacity.<br><br>This story feels real. It is beautifully done. The acting of Swank, Dempsey and Glenn is professional and believable. More importantly the story highlights our society's challenges in schooling the children of poor and one-parent families. <br><br>The movie doesn't give miracle answers. But it does give hope. And in the end, sincere effort appears to count for something  maybe everything.<br><br>FYI  There is a Truly Moving Pictures web site where there is a listing of past Truly Moving Picture Award winners that are now either at the theater or available on video.","user":"tollini","rank":[176,213]},{"title":"Fine By Me","rating":9,"date":"5 January 2007","review":"I walked into the movie theater with the ticket in my hand thinking about how many other movies I have seen like the one I am about to watch. \"Remember the Titans\", \"Stand and Deliver\", \"Dangerous Minds\", and the list goes on and on. And so I sat in my comfy chair that rocks back and forth so my back doesn't get stiff. Of course, my theater has stadium seating so someone's big head doesn't get in the way of my movie experience. And of course, I had to sit in the row with the railing in front of it so I could put my feet up, because I wasn't going to be uncomfortable while I play critic for this movie...what are you, crazy? Then, the movie began. and it ran and I was quiet. I laughed a little and cried a little, but not for one second was I criticizing. As I saw the characters go through their horribly troubled lives and while I was reminded of little Anne Frank, I became somewhat guilty about silently complaining that I got the squeaky seat or that my friend ate all the popcorn five minutes into the movie.<br><br>Likewise, when the movie was over, I had nothing negative to say. It wasn't that I was biting my tongue, it was that I wasn't paying attention to the mistakes of the movie (wherever they were) because I was so engrossed in the plot...you know, the one I said had been done before. the movie made me realize that gang violence and racial intolerance are just as big issues today as EVER. And I decided that as long as people are isolated because of their race and as long as people innocently die in the midst of a gang war, it's okay for this plot to live on...it gives hope to those who go to bed with one eye open, and who go to school everyday wondering if they'll live to see their own graduation.<br><br>And for me? For someone like me who complains about hastily eaten popcorn? It makes me count my blessings just a LITTLE bit more frequently. And any movie with a tired, overdone plot that can do that...well, it's fine by me.","user":"wonkatania3","rank":[143,177]}]