[{"title":"A taught thriller","rating":8,"date":"28 October 2005","review":"Saw II follows on the heels of Saw, as another taught, tense thriller. The mark of a great thriller/shocker/horror movie is the number of twists and turns, and this is what identifies Saw II as one of the better members of its genre.<br><br>This is NOT a movie where people walk backwards into dark rooms. This is NOT a movie where people pull sheets off bodies. That's all too predictable for Saw II. In fact, there's virtually nowhere in this film, where you can say that you've got it figured out.<br><br>Few movies keep me on the edge of my seat. This was one of them. There was no one dozing off during this flick. And the number of folks who walked out to take/make cell phone calls was the lowest I've ever seen.<br><br>Like Saw, this sequel is more than a little bloody in some places, but that's to be understood. It was never promoted as a walk in the park. If you're in the mood for a thriller that will keep you on the edge of your seat, this is worth a try.<br><br>And this movie left more than a few folks in the audience waiting for another sequel.","user":"vmwrites","rank":[326,445]},{"title":"Less original, but still worth a look.","rating":7,"date":"15 June 2006","review":"The original Saw was probably my most favorite recent \"horror\" movie, so naturally I was excited when the second one came out. I saw it its opening weekend in theaters, and **THIS WAS IN PREVIEWS, SO I Don't CONSIDER IT A SPOILER** I see a man strapped to a chair, with this \"Man in the Iron Mask\"-like thing on with all sorts of pretty nails poking toward his face. If you've seen the first one, you can expect what it does. A TV turns on, and there's the puppet thing, and that creepy voice. I'm like \"Hell yes!\" and it seemed like a great beginning, and it truly does have a great idea going for it, but unfortunately it seems like they got lost in the success of the original and the new bigger budget and lost something. It became the traditional horror movie, with your typical predictable characters, and the innovation and claustrophobic feel of the original was gone. It wasn't scary, but then again I didn't think the first one was to be honest, I think they're more of a mental experience than anything. The weird acid-trip like camera shake still occurs, though thankfully less frequently, and it is like a bigger budget Saw. Think Land of the Dead. Still a Romero movie, but it didn't feel like one as much. Same thing applies here. The ending is cool for most people, but I honestly saw it coming. It gets a bit muddled, and by the end of it you really don't remember much except the very beginning and end. It's fun, and it's an interesting piece of this new Saw series, but it just doesn't seem to live up to the original for me. You watch it yourself and give it a chance. I give it a 6 1/2.","user":"Ledout","rank":[15,19]},{"title":"horrible","rating":4,"date":"5 November 2005","review":"OK, if you've already seen the first one, you will be absolutely disappointed. it in no way lives up to the first one at all. first of all, saw was great because it was two kids on a low budget writing a script. they had to make up for the lack of money with the plot and script. secondly, the plot was really good and thick and everyone was connected in some odd way. the ending had so many twists, it was just brilliant. OK, now for saw 2. they had more money, so they definitely used it. instead of the people being in one room, it was one huge house. having more money took away from the effect, and most definitely the script, the plot and the acting. the plot had an unbelievable amount of holes in it. the people were connected by one stupid little line and the ending was absolutely ridiculous. one of the characters is just a complete idiot and decides to just get mad about everything. so, when he finds out there are numbers on the back of people's necks, instead of just kindly asking them to turn around, he kills them! finally, someone points out that he has a number on the back of his head that he's going to need, so he can't kill everyone. first of all, he tries seeing it with his little knife, then he decides to just cut it off, as any logical person would do. then, the murderer, john some how came up with a lot of money between dr gordon and now. before hand, his technique was simple. the tools he used to murder people could be found at a yardsale. in this one, somehow he got surgical equipment, the brains to do surgery and about five places with 20 computers. at some point in time, the writers seemed to have decided that it didn't matter that he had cancer, he can still do all this stuff. however, when you see him, he's in pretty bad shape. OK, now for the ending. remember the changed druggy, amanda? well, apparently, after she was almost killed, she decided the entire idea was a good one. so, she comes to john as an apprentice and decides to take his place as jigsaw. john becomes her yoda and teaches her the way of murder. at the end of saw 1, john had the memorable line of \"GAME OVER\". it was so great because of his voice, his appearance, everything. at the end of saw 2, amanda comes in, looking like she just went shopping and got her hair done and put on make up, and in a very little girl voice says \"game over\". absolutely horrible.","user":"pirateonweekends","rank":[94,155]}]