[{"title":"From Sheepskin to Celluloid","rating":10,"date":"11 October 2005","review":"Breath-taking scenery, strong performances and an unexpected message come together in Sturla Gunnarsson's Beowulf &amp; Grendel. Forget the dusty, inaccessible saga that may have been forced upon you in High School or as a College Freshman in English Lit! New life is breathed into Beowulf, the oldest text of recorded English, first set to sheepskin in 1000 A.D. after 500 years of survival through oral tradition. The acclaimed Canadian director of Rare Birds stays true to the bones of what undoubtedly started as a campfire story of a battle between Man and Monster without resorting to CGI or other special effects. Instead, he relies on the talents of an impressive international cast and an intelligent screenplay against the backdrop of a stunningly primal Icelandic landscape upon which no human had set foot in 800 years. You won't need Cliffs Notes to understand this examination of who and what defines \"Other-ness\" and how it is treated. The knee-jerk fear factor response is as prevalent today as it was in the early Viking slice-of-life portrayed.<br><br>Beowulf &amp; Grendel owes as much to John Gardner's Grendel as it does to the Beowulf epic. The roles of Hero and Monster do not so much embody intrinsic Good and Evil as reflect qualities attributed to their assigned archetypes. How and why we assign those roles is at the heart of the first-ever serious adaptation of the anonymous poem. The movie systematically leads us through a labyrinth of History, Cultures, the psycho-social reaction to Outsiders and the unfortunate results of those actions to the inescapable conclusion that we are not so different from one another. The ensuing Logic would then dictate that War is merely a lazy solution to a problem better addressed by examining our own psyches.<br><br>Beowulf is portrayed with astonishing depth by the Scottish actor, Gerard Butler, who is accumulating an impressive array of credits from Attila (the highest-rated U.S. mini-series) to Phantom of the Opera (the lavish 2005 Musical) to Dear Frankie (the award-winning independent Scottish film), to name a few. As always, he throws himself whole-heartedly, thoughtfully, and more important, believably, into the role of Hero, which in less-capable hands might be one-dimensional. Even the screenwriter, Andrew Berzins, was both surprised and impressed by the levels to which Mr. Butler plumbed the character \"all in his facial expressions.\" Rising above his mastery of brooding good looks through tangled locks of hair, he manages to have us look through his eyes, rather than at his eyes - no mean feat for someone who is undeniably easy on the eyes! Beowulf emerges as the antithesis of the later Danish Prince, Hamlet, who is so introspective that he is paralyzed into inaction. In contrast, Beowulf willingly accepts the yoke of the traditional Hero and initially and immediately acts without thinking. He recognizes his Destiny in this life and beyond, stating, \"I'll go where I'm sent!\" He does not, however, stop there. Delving into the reasons behind his mission, he becomes a relentless, if uneasy, historical detective, needing to unearth the cause of the troll/monster Grendel's savagery.<br><br>The Hero's journey, punctuated by pre-destined acts of violence, is one in which we participate and evolve along with Beowulf, with the assistance of the witch, Selma (appropriately ambiguously played by the popular Canadian actress, Sarah Polley). Although she and Beowulf do pair off at one point, theirs is not really a romantic connection. She serves as a sort of conduit between Beowulf and Grendel, leveling the playing field between them.<br><br>Grendel is splendidly brought to heartbreaking life by Iceland's biggest Star, Ingvar Sigurdsson. Interestingly, his 4-year-old son makes a very credible acting debut as the young Grendel, orphaned in no uncertain terms at the start of the movie and laying the foundation for the carnage to come. Harking more to Gardner's Grendel than the unremittingly bloodthirsty troll of the original poem, Mr. Sigurdsson manages to express both the innocence and tragedy of Grendel with gusto, exploring his un-human characteristics without judgment. It is a tribute to his talent that rather than being horrified by a scene in which we see Grendel bowling with victims' severed heads, we identify with the spirit of pure Joy breaking through a monster's lonely existence.<br><br>Providing a context for the Hero/Monster mythos is a superb cast of supporting characters. Stellan Skarsgard is the alcoholic Danish king Hrothgar, not only unwilling to accept responsibility for the scourge of Grendel, but not even wanting to consider \"why a f***ing troll does what a f***ing troll does.\" Eddie Marsden plays the foaming-at-the-mouth crazed Irish Catholic priest, Brendan, heralding the advent of Christianity and the desire of a people to unburden themselves of any and all accountability for their actions. And Ronan Vibert embodies the equivalent of modern day mass media as the Bard, Thorkel, through whom the saga is transformed (over Beowulf's objections) into a revisionist history which does not bear close examination. As Martin Delaney notes as the young warrior, Thorfinn, what we are left with are \"tales of sh*t.\" The old Beowulf is not gone. The tone of the original oral tradition is maintained by Berzins' strict adherence to Anglo-Saxon and Norse root words and an ongoing thread of bawdy humor against a relentless musical score rife with tribal drums. The comic relief serves, as in Shakespeare's tragedies, to lighten and make palatable the raw impact of some harsh realities revealed. But a new Beowulf &amp; Grendel rises from the ashes. This blood and guts epic, with its undeniably spiritual undercurrent, balances swordplay with word play, and the audience is left to draw their own conclusions in the bloody aftermath. The tag line, \"Heads will roll!\" refers not only to the blood-soaked battle scenes, but to the thought processes set in motion that will leave you re-evaluating concepts of and motives behind Love, Loyalty, and War long after you leave the theater.","user":"callmomrad","rank":[172,209]},{"title":"Lovely film","rating":10,"date":"23 September 2005","review":"The first clue that this film is a different take on the story is the title. Rather than simply depicting Beowulf's killing of a one-note Grendel as metaphor for good triumphing over evil, it is the story of the intersection of two fully realized, complex characters. This retelling wants us to rethink the simplistic concept of good and evil. The first step is to give us a Grendel we can understand, and a Beowulf weary enough of war to try.<br><br>Beowulf is a man used to that simplistic concept of war as good versus evil  he's cool and efficient at killing, and when Hrothgar calls he's ready to put Grendel's head on a pole. But he's thrown off balance when Grendel won't engage. He becomes a sort of detective, not the warrior of legend but the imperfect man behind it, simply trying to get his bearings. With Butler's presence and nuanced performance, Beowulf may not be the mythically embellished warrior but is nonetheless wholly compelling, and on a human scale, heroic.<br><br>Skarsgard is amazing as King Hrothgar, a man self-destructing as he helplessly watches Grendel killing his people, consumed with hiding the fact that the catalyst was his own reckless action. Words like \"walks on water\" come to mind when describing Skarsgard's work. (His performance in \"Aberdeen\" is not to be missed).<br><br>Grendel, in an inspired performance by Ingvar Sigurosson, is a physically frightening brute with the heart of a small boy who loves his father and hates the ones who killed him. And he's smart  smart enough to make buffoons out of Hrothgar and Beowulf at turns. Even without dialogue, Sigurosson gives us that Grendel we can understand.<br><br>Selma, portrayed like the glassy calm surface of a deep river by Sarah Polley, is the conscience of the piece. Her gaze is wide open - holding no illusion about the goodness of human nature  and rather discomfiting to Beowulf. She's delicate and powerful, and as cool and efficient at surviving as Beowulf is at being a warrior. Beowulf goes to her for answers, but not the ones he ends up getting.<br><br>Andrew Rai Berzins' script is crisp and wry, and short on exposition, relying instead in great measure on the collaboration of the actors to tell the story, and they deliver. Hrothgar tells us with one subtle look exactly what he thinks of the blathering, apoplectic priest. Instead of writing a line of dialogue, Berzins allows Hondscioh (Tony Curran) to speak to us silently, his expression slowly reflecting the dread he sees on the faces of his mates as they realize he's just earned Grendel's wrath. And Grendel doesn't play around - much.<br><br>This film is truly a team effort, and this is the kind of team we root for. With Berzins' thoughtful and humorous script reflecting the real camaraderie of the talented cast, and Gunnarsson's direction reflecting his obvious love both for the story and for Iceland, we get a moving and beautiful film.<br><br>Usually warrior epics end with the hero vanquishing his foe in some brave and spectacular way. For this team's Beowulf, the real foe is thoughtless intolerance  something not even a hero can vanquish, except within himself.","user":"losdzez","rank":[49,59]},{"title":"Beowulf and Grendel: an Updated Classic","rating":8,"date":"26 September 2005","review":"This is a very updated version of the Anglo-Saxon poem \"Beowulf,\" using contemporary English.This movie still has the mythical, epic qualities of the poem that have inspired readers throughout the ages. In an excellent performance, Gerard Butler effectively captures the conflicted hero Beowulf as he endures the slow erosion of his military code of conduct. Beowulf &amp; Grendel is more than a story of blood and war. Themes of vengeance, loyalty and mercy are powerfully entwined with the beginnings of Christianity in southwest Sweden in 500 AD. Another theme which is explored is human inability to tolerate that which is different. Gerard Butler is extremely effective as Beowulf, but perhaps the best performance in the movie is that delivered by the tempestuous and weirdly beautiful land of Iceland. I think this movie is definitely worth seeing.","user":"beylim","rank":[123,157]}]