[{"title":"Linda Purl does a fine job","rating":8,"date":"18 January 2006","review":"Maid of Honor stars Linda Purl as Laci, an aunt to a widow's two children in a nice suburban home. Richard, the widow, is played by Linden Ashby, and he gives a decent portrayal of a loving father. Laci is the sister of Richard's wife who was killed in a car accident two years earlier. When Richard declares he and his love-interest, Nicole (played by Shannon Sturges), are to be married, Laci is silently enraged and things get worse as the film progresses.<br><br>Purl looks great and she really makes the most of her character. There is one scene that takes place in a hospital stairwell between she and Ashby that is quite good, where she showcases some of the best acting and emotion I have seen in a TV movie of this genre. This is a good movie.","user":"g404c","rank":[18,22]},{"title":"Surprisingly fun, well-acted and nasty suspense film","rating":7,"date":"24 June 2006","review":"I picked this up at the video store thinking \"this'll be a really bad, unintentionally funny melodrama about a Desperate Woman\" -- and I was only half-right. Yes, it is about a desperate woman, but it's actually very well done, powerfully suspenseful and develops all the characters to the point where they come across as real people you care about.<br><br>This movie fooled me at least three times, and I like to think I'm fairly quick on the uptake. Linda Purl is a wonderfully expressive and intense actress -- why isn't she famous??? I highly recommend this movie to anybody who likes good thrillers, and/or anyone who enjoys watching a superb actor like Purl as she crafts a brilliantly realized character (even if the movie isn't quite good enough to deserve her).","user":"marioncap","rank":[12,14]},{"title":"One Guess Who the Bad Person Is","rating":7,"date":"6 January 2006","review":"As soon as I heard the title of this TV film, I almost assumed who the bad person was going to eventually turn into. However, there are lots of twists and turns in this film and I believe a murder is committed that the killer actually got away with accomplishing. There is a father who's wife is killed in an auto accident, leaving the father with a teenage daughter and smaller son, both who loved their mom very much. The former wife's sister lives in the home and is sort of a housekeeper for the entire family. The film goes along rather smoothly until another woman makes an appearance and it upsets the entire household. Nice entertaining film and very good acting.","user":"whpratt1","rank":[18,23]}]