[{"title":"We have a winner","rating":9,"date":"23 April 2009","review":"SAW III in my opinion is tied with the original as the best in the series. For many reasons- one reason being that it keeps it simple. Instead of dealing with multiple characters that sacrificed any kind of character development like in SAW's II, IV, and V, SAW III, like the original, has much fewer characters, leading to a more intimate setting where we can connect to everyone. And while it does have sub-plots, they don't feel out of place, they're not just randomly thrown in to shock audiences. They feel organic, they all connect smoothly at the end and make sense as to why.<br><br>If you've seen a SAW film, you know the story is going to have twists, turns, and violence/gore to accompany them. But at least SAW III does it very well. It expands on characterization and back stories for these characters and ties up the loose ends as believably as this franchise can do. We also get a deeper look at the relationship between Jigsaw and Amanda, knowing more about how the two really look at each other. Jigsaw is the calm, cancer-stricken anti-hero who does these evil things to prove a moral standpoint. Amanda, on the other hand, doesn't seem to grasp this - instead using the traps to torture her victims as a way to get back at innocent people for the way she was tortured herself with suicidal tendencies and drug abuse. With these two extremes, we see how much Jigsaw is trying to mentor her in his vision while she struggles with her own demons. And when Jigsaw gets ill, we see that Amanda really isn't a fitting apprentice to carry on his legacy as her vindictiveness comes out.<br><br>SAW III is also supported by the fact that the two protagonists are developed deeply. Maybe not as much as our two anti-heros, but we understand where they're coming from. From Lynn's dour nature to devastated Jeff's situation. The subplot with Jeff by the way adds some great underlying messages to the film. These messages shows us that hate, vengeance, revenge, and complacency brings more pain than anything else, and does not solve anything. It ruins families, destroys relationships, clouds judgment, and at the end: self-destruction. Leigh Whannell, who wrote the first two films with James Waan and flew solo writing the screenplay for this one, does a nice job giving the spotlight to all the characters instead of just focusing on Jigsaw and Amanda. He makes SAW III more of a character study than any of the other installments and that's one of the essential reasons why this installment scores high.<br><br>Darren Lynn Bousman directs a much more subtle film than he did with SAW II and SAW IV. The quick edits are kept to a bare minimum (thank God) and the film has a lot of dread going for it. Very moody and darkly atmospheric. He focuses on the drama and emotion at hand, which was a vast improvement on SAW II and especially SAW IV. He lets the acting and the situations do the work for him instead of being extra-fancy with the camera work. Lastly, the cinematography is a plus. Darren shoots the film with a vibrant and kinetic feel and uses good, non-queasy camera movements. I love the lighting most of all though; he uses a wide arrange in the color palette (from lime green to icy blue). He definitely proves here that he knows how to grasp the material and visualize it. His direction of III ranks alongside James Waan's mindblowing direction of the original.<br><br>The acting is hardly an issue. It's usually good or better. Tobin Bell can play John Kramer in his sleep by now for gods sake! He shows excellent range and is always effective in the role because he gives the character more depth than what the script probably provides. Shawnee Smith is superb as Amanda, who will always be one of my favorite characters in the series. This is without a single doubt her shining moment, her most dramatic portion in the series. You really want to hate her but you just can't because you pity her. Smith could have easily played the character as an annoying nutjob, but she gives the character substance and unbelievable humanality. Angus Macfadyen as Jeff is superb in his role as well; he makes Jeff the most realistic and sympathetic character within the entire series. As far as I'm concerned, McFayden nailed the mourning father act. Bahar Soomekh was decent but always outshone by Bell, Smith, and McFayden. Her acting was a bit flimsy at times, but for the most part she gave a nice performance and made her character likable.<br><br>The suspense and tension, while not as impressive as the original, is still great. Hardly any other Saw film or horror film in general for that matter (with the exception of Eden Lake from last year and Inside from 2007) has been so edge-of-your-seat gripping, so exciting. The slow pacing allows you to gradually absorb everything in, and this makes it all the more better.<br><br>There is a lot of extreme gore in this film, but unlike some other installments like Saws IV and V, it's done very well and serves a purpose. Jeff's bloody trials are in a lot of ways cathartic. You're enduring these horrific scenes along with Jeff, and the relief at the end that the horror is over really fits with the theme of redemption through forgiveness. Moreover, the revelation that the horror isn't over, and what you feel as a result, drives home the Shakespearean tragedy in a very personal way because you the audience have to keep enduring it.<br><br>SAW III is clever, solidly written, has the best characters, succeeds with the emotional aspect it was going for, and ties up loose ends perfectly. For a third installment in a horror series, it's incredibly strong.","user":"LuckyMatt93","rank":[11,12]},{"title":"The Incomparable Trilogy","rating":7,"date":"27 October 2006","review":"I would like to start by saying that I am a huge Saw fan, and came into this movie with more hype and enthusiasm than any other movie in my life. Possibly I set the bar too high, leaving it hard for this third installment to complete a legendary trilogy in the horror genre. First of all, I loved the scenario. Very similar to Saw II, Saw III had multiple \"games\" being carried on at once. Amanda kidnapping Dr. Lynn in order to keep Jigsaw alive, so that he could put Jeff through a series of vicious and gut wrenching events. Events that Jeff alone chooses the outcomes of.<br><br>Sequel to sequel, these movies have progressed dramatically. Two ways would be the creativity, and the gore. \"We don't pull any punches this year. We start it with a kick in the balls, and end it with a kick in the balls.\" -Darren Bousman. Traps, weapons, and devices now include chains, bombs, acid, skin rippers, ice, pig guts, guns, and a very creative and sickly disturbing trap called the rack. It is similar to the previous sequel Saw II, but Saw III has even more scenes that will make you cringe or moan in disgust.<br><br>Unlike the subpar acting of Saw, this time around it was phenomenal. When more characters were explained, you got a good feel for the decisions they made, and why the story ended up the way it did. Tobin Bell did yet another extraordinary job with his role as Jigsaw, possibly making Jigsaw one of the most deranged and creative villains ever to step foot in a horror movie. Not only were there many fresh faces in Saw III, but some characters made a return. I wouldn't want to spoil it for you, but like Darren said, it kicks you in the balls, I would say pretty hard.<br><br>Overall, this movie was great, but for some reason it didn't completely blow me away like Saw and Saw II did. Many stones were left unturned, which always means that there could be yet another sequel, and the ending happened too suddenly. Will there be a Saw IV? Maybe, maybe not. But for now, go see Saw III, possibly the final chapter to one of the greatest horror trilogies ever made.","user":"JamesCanz","rank":[151,234]},{"title":"Saw III Not A Disappointment!!","rating":8,"date":"29 October 2006","review":"After seeing Saw III I have to say that I was surprised. Few films do good in their third installments but Saw does quite well. It's got more gore than the other 2, not tons more, but definitely enough to please a horror/gore movie fan. Above the gore though is some of the sounds of the film that make you go, \"That was INSANE!\" There is some crazy traps in Saw III that are very good but there's always room for more sick/twisted trap ideas. It's got better acting than Saw 2, but how important is the acting anyways. Most people just want to see some nasty traps. And NASTY they are! Saw III does have some noticeable actors who are good though they aren't really that famous. Its a well made horror film. Pretty good series for 3 years in a row. Hopefully if there is a 4 it wont ruin the series, but who cares. It's like throwing out Halloween 3 and loving the rest. This one also has good twists and like the other ones I was waiting to hear that Saw theme song music and sure enough, at the end, there it was. Good Film. Well done.","user":"rileymullins","rank":[11,13]}]