[{"title":"A Unique Masterpiece","rating":10,"date":"24 July 2007","review":"\"Disappearances\" is a film I'll show to as many friends as possible, and hopefully have many deeply stimulating conversations with others who are stirred and haunted  in a good way  by its magic and beauty. This has \"cult classic of the best kind\" written all over it, in the sense that it has everything you'd want from a ripping good yarn of a film, would appeal to someone who's favorite film was, say, \"Raiders of the Lost Arc\" or \"Rio Bravo\", but plays by its own rules and those *aren't* the rules that get a film a mega-promotional package. And that's exactly why fans looking for something new will love it, and why word of mouth on it'll spread. Writer-Director Jay Craven, working on a small budget, performs the tricky balancing act of capturing the excitement and suspense of the often over-the-top material, while maintaining a humble, understated, down-to-earth tone. Here we have bootleggers, drunken monks, drunken bootlegging monks, car and boat and train chases, a spectral witch who disappears and reappears in the damnedest times and places to offer wisdom, an undead whiskey-running pirate straight out of New England folklore with a gang of henchmen  seriously, what's not to like? -  and as an enthusiast and former resident of Vermont, if I told you how much of this seems plausible, you wouldn't believe me. <br><br>The film captured everything best in the rugged, feisty, often adventuresome spirit of the state of Vermont, depicting an outlaw culture that thrived on the fringes of a fading northern frontier, personified in Quebec Bill, a farmer in the Depression who must revert to his old whiskey running practices to save the farm after his barn is struck by lightning and burns down. This guy's my new movie-character hero. His dynamic with friends/partners-in-crime Rat Kinneson (William Sanderson) and Henry Coville (Gary Farmer), of how buddies together in an outrageous, sometimes dangerous situation, each surviving and making sense of things in his own way while putting up with each other - to some degree surviving each other - is spot-on. Particularly that whole scene in the tavern, and the delivery of the line \"Because I couldn't stand myself if I wasn't there to help you out of whatever you're about to get into.\" Kris Kristofferson is amazing as Quebec Bill, deepening my already considerable respect for someone who was already one of my favorite musical artists, as are Sanderson and Farmer in their respective roles. Years back, I had a chance to read the screenplay to this film before it was produced. As a fan of the TV show \"Deadwood,\" when I found out Sanderson was playing Rat, I thought, \"Damn, that's perfect!\" And it's interesting to find Farmer in both this and \"Dead Man\", as I found that film tonally and thematically similar, in its dreamlike quality and embrace of fantastical, metaphorical imagery and mystery, things that aren't always explained, yet actively invite the audience to participate with their own imagination and come to their own conclusions. \"Disappearances\" is, however, far less brutal, as well as warmer and more inviting to like and identify with its characters. Quebec Bill and crew are guys I'd like to hang out with. By the end of the film, I wished I could stay in their world with them longer. It left me longing for the things in the world that have *disappeared* -- SPOILIER WARNING -- as symbolized by Bill and Cordelia literally doing so  END SPOILERS -- under the weight of \"progress,\" even though only the ghosts of many such things have been around to know in my own lifetime. In that sense, I related to Wild Bill, and wanted to see where life takes him from there.<br><br>Also a delightful surprise is the film's handling of its demonic villain Carcajou, particularly Lothaire Bluteau in the role. In the novel and script, he was a far less developed, more hulking ogre-like monster, though clearly with a cunning brain. Here, he becomes something far more ambiguous and complex. I don't think I've seen this actor in anything else, though he should be seen more. Any time the character's on screen, you can't take your eyes off him. Moments like when he comes snarling onto the train waving that knife around were genuinely terrifying, yet there were other times when I felt a strange sympathy for him. I really wanted to see more of that character and learn more about him, though truthfully such a character is generally most effective when actually seen only in small doses, someone who becomes an ominous off-screen ever-presence, sort of like Dracula in Bram Stoker's original novel. And like Stoker's Dracula, Carcajou is in many ways a personification of unresolved things within the good guys, things they're not comfortable with, can't yet face within themselves, things they're running from, manifested as a physical boogie-man onto whom those fears become projected... someone from whom they must literally run. Such metaphoric exploration is what's always truly wonderful about the best fantasy in film and literature, light and dark. And \"Disappearances\" certainly ranks with the best!","user":"Matt-234","rank":[12,13]},{"title":"Your Best Mosher Interpretation So Far","rating":8,"date":"26 January 2007","review":"My wife and I watched a copy of \"Disappearances\" this evening. We both enjoyed it very much! We had both read the novel about a year ago and so were familiar with the Mosher story. This very expansive and in some ways too fanciful novel (the cloned abbot in the monastery comes to mind) was very enjoyable, but we think Craven did a fine job of translating it to the screen without having to include every aspect of the original text.<br><br>All performances were well done. Especially fine was the work of Gary Farmer (Henry) and Charlie McDermott (Wild Bill). Kris Kristofferson (Quebec Bill) was better in the latter part of the film, but (and perhaps this was intentional) was more caricaturish early on. He became more of a real character later as his situation became more serious. The smaller parts by William Sanderson and Bill Raymond were also enjoyable. The parts by Genevieve Bujold and Lothaire Bluteau were more problematic, both seeming lackluster in comparison to the others. The only real disappointment was Luis Guzman, whose part as Brother Hilliare was so reduced as to be inconsequential.<br><br>We feel an excellent job was done of handling what could have been expensive special effects by implying, without showing, such things as the train wreck. Too much emphasis is placed on graphic representation in today's films, when suggestion can be just as, or in some cases, more effective (as in special effects that don't work!).<br><br>If we have a serious objection to the film, it is the confusion that is generated in the earlier part caused by including many varied elements of the book without some sort of unifying dialog (perhaps a voice-over by an adult version of Wild Bill would help). This problem is relieved later in the film, but by that time a portion of the audience may be lost.<br><br>Our congratulations on a fine cinematic experience that deserves wide distribution.<br><br>We have also seen Craven's two previous Mosher adaptations, and consider this to be his best! One more thing  kudos to the cinematographer for the beauty of the production! Outside of our own Northwest, the Vermont Kingdom County is one of the most beautiful parts of our beautiful nation.","user":"wsterr-1","rank":[16,20]},{"title":"Open the mind","rating":8,"date":"21 November 2006","review":"I'm amazed by the comments posted about this film. God forbid a director make a simple attempt to create an environment that is not 100% realism. God forbid a director enter the world of the super-natural and surreal. I found Dissapearances a wonderful film, perhaps Craven's best, if you actually do a little work yourself. My favorite question about this film is, \"Well gosh. What the hell does it mean?\" It means whatever the hell you want it to! What about the owl? What about Bujold showing up at random times? What about this. What about that? My God, have we gotten become so moronic by viewing the films of Michael Bay that we NEED to be told what to think and feel? The film is an adventure. Sit back and try to figure it out. Kristofferson gives a fantastic performance as does Gary Farmer, who is the dry comedic relief of the show. The photography is excellent, maybe the best Craven has had since \"Rivers\" and the editing is perfect. Give this film a chance and if you don't get it the first time you see it (which I did not)watch it again. You will be pleasantly surprised.","user":"patmcma","rank":[20,27]}]