[{"title":"charming, uplifting","rating":8,"date":"8 February 2006","review":"I just saw a screening of this independent film at the Santa Barbara film festival. The screenplay is an adaptation of a novel written for juveniles, Brief Garland, by Harold Keith, which was first published in 1974.<br><br>The film focuses on the character of the coach of a girls' basketball team in a small town in western Oklahoma during his first years at the school in 1964-66. He arrives to coach the boys team, but is maneuvered into the coaching job for the girls. Over the course of the film, he learns how to coach the girls, and helps develop a competitive team at a school where girls' basketball had never been supported before.<br><br>I watched the film with particular interest because I played high school basketball in 1964-68 in Tennessee, where, as in Oklahoma, we played the six-on-six half-court game that most girls played until after Title IX was passed in 1972. I was disappointed to see that the girls in the film played the full-court five-on-five game, which is slower, messier, and lower-scoring than the half-court game we played. By playing with fewer players, the court was less crowded, and girls had more freedom to drive to the basket. Since defenders made long passes to move the ball upcourt to the offensive team, the speed from end to end was actually faster than the boys' game!! <br><br>Had the film's auteur truly appreciated the game that the heroines of the film actually played in the sixties, he may have created an even more exciting film, with less forced editing to simulate speed and grace. <br><br>I know, I know, you don't believe me. Oh well . . . .","user":"jredwolf","rank":[25,27]},{"title":"Great Movie","rating":10,"date":"14 June 2006","review":"I just saw this movie at the Jackson Hole Film Festival and I was impressed for the quality of the photography, the story and the acting. The storyline is very simple: in the 60's a young basketball coach moves to small town Oklahoma to coach the male team of the local high school but he's rerouted instead to the female team. He's totally against it but he has no choice, while he gains the respect and support of the girls, the town folks take a dislike for him because of his methods and because in their mind a girls team is not worth of interest. Through a series of victories, for the team and for the girls, he will make his basketball team a well respected one in town and among the competing high schools. I hope they will find a good distributor for this movie; this would be the feel-good movie of the year. Plus I met Robert (the Director) on several occasions during the festival and he's such a nice and heartwarming guy, I wish him much success (Hey Robert, I'm the one who drove you to the Casino Night from the Amangani ;-) ). One thing... I'm surprised that on IMDb men liked this movie more than women, very strange.","user":"windtalkers","rank":[17,18]},{"title":"One of the better \"based on a true story\" sport movie","rating":10,"date":"10 September 2009","review":"This is a great family movie and a great movie for teachers to see. It especially hits home for teachers, who are of course, coaches, but also those classroom teachers who have the same relational interactions as coaches like choir teachers (me), band directors, and the like.<br><br>The casting was excellent. I did not feel that I was watching actors, but actual people. Bruce Dern did his role so well, you really despised him. (I didn't realize he was THAT old already. I guess I'M that old already!) The girls were believable, the coach was well acted, the wife was a natural pairing for him--all very good acting. I, like you, can't stand cheesy \"docudramas.\" You will want to watch the \"making of\" special features. You will have a pleasant surprise about the winning shot in the movie.<br><br>I highly, highly, recommend this movie. I have been encouraging my colleagues and all my students to rent it.","user":"onthatnote","rank":[7,7]}]