[{"title":"Surprise and relief! Rocky Balboa is a winner","rating":10,"date":"14 December 2006","review":"Guys...<br><br>Stallone did it.<br><br>I went in cringing and walked out impressed.<br><br>The tone was closer to the first two Rocky movies, but it did it in a way that the fifth movie wasn't able to grasp. One key ingredient: verisimilitude.<br><br>They treated the boxing in the film the way boxing is in real life. I know, because I covered and followed the sport very closely for about three years.<br><br>Real life boxing personalities pepper the film's cast. For the fight scene, they got the current HBO announcing team of Jim Lampley, Larry Merchant and Max Kellerman.<br><br>They treated the build-up to the fight not unlike movie audiences are treating Rocky Balboa the movie: What, another Rocky movie/fight? There is some reminiscing of the past like in Rocky 5, but it's handled much better. It flows naturally from Rocky the character. It's not nostalgia for the sake of nostalgia the way some of Rocky V played out. In fact, I got choked up quite a few times throughout the film.<br><br>The writing is excellent. The monologue from the first Rocky teaser, that some people criticized, shows up in this movie. It plays WAAAAAAAAAAAY better, more powerfully, with more emotional resonance in the context of the movie. The teaser didn't do it justice. The movie does.<br><br>If you're a Rocky fan, you have to see it. If your girlfriend/boyfriend aren't Rocky fans or have never seen a Rocky movie, you have to take them.<br><br>My 19-year-old girlfriend thinks she has seen Rocky but only as a little girl, so she had a vague, if any, recollection of the series. So vague, in fact, that she even told me that Stallone the actor looked \"familiar\". And she loved the movie. She cheered, and when the fight started, she told me, \"I'm so nervous!\" In the end, she also loved the character of Rocky, proving to me that the character's appeal--despite his age and several decades removed from his debut---is still undeniable.<br><br>Stallone was great in the role, of course. This is obviously the part he was born to play.<br><br>Burt Young is great as Paulie. He gave a nice supporting performance with the right touch of humor.<br><br>I was impressed with Antonio Tarver as Mason Dixon. Tarver, as some of you might know, is a real fighter. In fact, I saw him fight once in Miami. He turned in a good performance, which I wasn't expecting since he's an athlete, not an actor. So Tarver deserves a nod.<br><br>The movie is inspiring---the winning quality in all Rocky movies.<br><br>Now don't get me wrong: I'm not claiming this is Rocky I all over again. This is the sixth movie in what was a tired series when we last saw it, but Stallone breathed new life into it and it's definitely a deserving addition to the Rocky series.<br><br>Lastly, there's a moment in the theater that I really, really want to share with you guys. Don't worry, it has nothing to do with the end.<br><br>The movie audience was pretty quiet throughout the first half. But when Rocky starts training to the Rocky theme, the crowd came alive and began cheering and clapping. I saw one guy throwing punches during the fight. Another guy was stomping on the ground from what I imagined was excitement of the fight, and nervousness.<br><br>I'm not sure Stallone could've made a better part 6 than this.","user":"konover","rank":[220,265]},{"title":"\"Rocky Balboa\" does not disappoint!!","rating":10,"date":"4 December 2006","review":"I recently attended a pre-screening for \"Rocky Balboa\" in Denver. This movie was so powerful, that I went through every emotion imaginable while watching it. There are some very humorous parts in the movie, there are some sad parts of the movie. However, the message of the film is moving. This particular \"Rocky\" movie focuses on Rocky's life after boxing. It really develops his character in ways that the other movies have not. The trailer that is out does not do this movie justice. If you want to see a movie with a deep message and a whole lot of heart, you will not be disappointed. Don't think \"Another 'Rocky' movie\" and brush it off. This movie is well written, the acting is great, the characters seem like real people. Even though I have already seen it, I will be back on opening day to see it again. It is an instant classic. So keep an open mind and give this movie a chance, you will be glad that you did!","user":"robin_r_hollenbeck","rank":[435,538]},{"title":"Balboa shocks the World","rating":10,"date":"14 December 2006","review":"Balboa is gonna hit so many people in different ways.<br><br>I suppose you can look at any great film and see a message in there, but the Rocky franchise is so inspirational, even the 5th one.<br><br>This new film has had me thinking, and though some reviews have said it's a trip down memory lane and a rehash of the 1st, well the point is, as reflected in the film, that Rocky IS living in the past, like so many of us do for one reason or another.<br><br>The message as stated in the film \"you gotta keep moving forward\", I don't know if its me or just pure genius, but if you LOOK you will find something that touches your soul throughout the franchise ..<br><br>So i wont drag this out...........<br><br>I left the theatre kind of stunned. Its been a long while since Rocko got back in the ring, and I, like everyone else, wanted a better film than Rocky V. Sly has wised up a lot over the years, and all I can say is....<br><br>THIS FILM DELIVERS BIG TIME !<br><br>The fact that its the 6th one, and to be honest, its no sci-fi film where you can really go to town on the plot, there is only so much you can do, and Sly has done it. Yeah, you could say that the plot mirrors Sly's life over the last few years, but all the Rocky's have done that in one way or another. This is Rocky back to his sweet and charming self, stunned with what life has thrown at him, and just going through the motions of, well, growing old, but still having that ambition to kick life in the balls and say \"it ain't over til it's over\". He looks great for 60, and doesn't over train for the final bout, he's kept it very realistic, and the fight itself is handled very well, and looks different to the recent wars we have been used to. The film isn't just about boxing, it's a drama, which will inspire you, if you can put your ego to one side and let it.<br><br>Paulie is fab, he calms things down and stops certain moments turning into what some people may call cheesy. Unfortunately people with no emotions call things cheesy, but they are the ones who have yet to learn what life can throw at you.<br><br>This film is up there with I &amp; II, and I need to see it again!!!!!!!!<br><br>Overall<br><br>A perfect ending to the saga, and an amazing turn around for the franchise.","user":"tonystalloney","rank":[221,271]}]