[{"title":"It isn't *that* bad.","rating":8,"date":"18 January 2006","review":"I don't see why everyone has such a problem with this movie - I thought it was okay, it wasn't the best movie I've ever seen, and it didn't have the best acting ever, but it certainly wasn't the worst movie ever.<br><br>The ending wasn't too good, but the movie wasn't too shabby, the storyline was good and it proved to keep me entertained for the full two hours. I learnt a lot about 50 cent during the movie, even though I'm not a fan of rap and/or 50 cent himself, I still enjoyed it.<br><br>The movie gives you inspiration, if 50 cent can go through a lot and come out of it a billion dollar rapper at the end, it makes you think that you could probably do something on the same level.<br><br>You don't have to like rap and/or 50 cent to enjoy this movie and read into it. If you enjoyed the trailer, don't let the bad reviews put you off, that's what I did, yet I liked the movie.","user":"katyiana","rank":[122,167]},{"title":"This film is underrated!","rating":7,"date":"10 July 2006","review":"I have read through all of these comments, and am astounded at the amount of negativity towards it. I cannot believe that any film within the IMDb database can be voted as 1 out of 10, thats just stupid. Alrite, i agree its not an Oscar winning film, but I enjoyed it! OK, 50 cent's acting is brilliant, but he pulls it off! The film boasts a reasonable story based on his life, and to be honest it wasn't amazing, but it was generally enjoyable! Lost's Mr Eko played his character well, as did Terrence Howard! And Bill Duke, as the Ghetto Godfather is astoundingly brilliant! 8 Mile was a good film, and this is as good! So please, ignore the negative views and watch this film!!!!","user":"mikeb_clifton","rank":[64,86]},{"title":"Think Outside of the Box","rating":10,"date":"5 October 2006","review":"I watched this movie for one reason: Terrence Howard. As always, Howard is brilliant. The other performances are solid, including Curtis \"50 Cent\" Jackson who, for people who don't seem to understand this, plays himself. (If 50 Cent were to \"act\", as some maintain, then he would not be portraying his true self, and the entire movie would self-destruct into a moot point.) The camera shots, angles, and lighting are superb, the dialog is genuine, and the plot line is believable. But this is not run-of-the-mill Hollywood fare. There is no seamless stream of canned emotional music to fill in the gaps for underactive imaginations. There are no handy-dandy humor scenes for fluffy feel-good filling. There are no flat characters to artificially ease the main character into some orchestrated epiphany. There isn't even really a hero. There is only a man who is trying to live as best as he can in a self-serving world, a man who finds a measure of strength even as he runs from his fears. In order to truly appreciate the message that this movie has to offer, you have to think outside of your comfortable movie-watching box. This movie is gritty, powerful and raw. This movie makes no excuses. This movie is about as close as the big screen can get to portraying real life. No, it's not a pleasant movie. Neither is life.","user":"seitanicvegan","rank":[42,55]}]