[{"title":"Natural Disasters Have More Laughs","rating":2,"date":"6 April 2007","review":"\"Are We Done Yet?\" Let's hope so. A phenomenally bad movie and, worse yet, a completely unfunny comedy that rips off \"Mr. Blandings Builds His Dream House,\" among a dozen other, better films. Oh, did I also mention it's a sequel to one of the worst movies of 2005, \"Are We There Yet?\" In that picture, former gangsta rapper Ice Cube (now flattened and mellowed down to a pathetic, bumbling caricature) was Nick, the idiotic boyfriend of Suzanne, mother of the most untalented and unsympathetic kids on the planet. No wonder his character hated children, with these horrid spawn underfoot, I'd have a vasectomy immediately.<br><br>In this version, he actually marries Suzanne, but four people living in a small apartment causes him to move to the country. Very far out in the country where there's no malls or cell phone reception.<br><br>Here he meets the wacky Chuck (John McGinley, \"Platoon,\" \"Wild Hogs,\" TV series \"Scrubs\") village Realtor/contractor/building inspector/idiot, who convinces Nick to buy a huge Victorian mansion (even though he could only afford to live in a small apartment in the city).<br><br>Of course, once the papers are signed, the domicile begins to fall apart; the electricity goes out, the roof leaks, floors collapse, walls crumble, and so does the marriage.<br><br>Meanwhile, Nick has taken out a big advance to start a sports magazine and is trying to woo Ervin \"Magic\" Johnson for a relevant cover story (didn't Magic Johnson retire from the NBA like 400 years ago?!).<br><br>Nick also seems to have an unlimited income for these repairs, and Chuck keeps bringing in more and more bizarre and not-at-all-humorous workers (a pair of huge Samoan dry rot specialists, a blind plumber, etc.) to fix the money pit.<br><br>Also, Suzanne is pregnant, and in a scene that has graced thousands of comedies in the past, she goes into labor at a most inconvenient time. And while this film is clearly for youngsters (as well as the severely brain-damaged), and should therefore not be judged like a Shakespeare sonnet, I nevertheless cannot abide comedies which do not make me laugh  at all.<br><br>We know what jokes and pratfalls will take place minutes before they occur (Nick falls through floors, roofs and walls, is struck by lightening and is attacked by bats, raccoons, deer and a crazed sturgeon.<br><br>Not one of these situations is even remotely interesting, let alone smile-inducing. Friends, I've seen funnier memorial services.<br><br>Ice Cube's talent peaked in \"Boyz in the Hood,\" (and he had funnier lines when he was singing with N.W.A.), while the other leads are absolutely abysmal, especially the two kids, who've lost any cuteness and most of their acting abilities since the first picture.<br><br>In fact, the only saving grace (and I mean that term in the loosest way possible), is McGinley. Sure, he was funnier as the syncophatic sergeant in \"Platoon,\" but his presence here is really the only thing that saves \"Are We Done Yet?\" from total burial in the dung heap.<br><br>His inclusion makes this one slightly better than the first, which is like saying that Lee Harvey Oswald was a better shot than John Wilkes Booth.","user":"editor-299","rank":[40,57]},{"title":"The Title Should Be Changed To Is This Done Yet","rating":3,"date":"9 April 2007","review":"I mean when I saw Are We There Yet, I thought it was finished from there but no. They had to do Are We Done Yet. I mean, if they know the first one was bad why are they making another one, what is wrong with these directors. They are making some bad squeals or remakes that are in the bottom and they still continue. Soon another one is going to be called Are We Having Fun Yet, well guess what, no. And for sure this movie would at least be better than the first, but it is worst. I should be stupid for watching this piece of crap. Let me tell you for all that didn't see this movie yet, you made the right choice. Soon, these dopes will make the third, then the fourth, then more. Make sure you will never see this, the only funny jokes are in the trailer. That's it.","user":"TEAQUIEMORO","rank":[85,137]},{"title":"Funny family movie","rating":8,"date":"27 October 2007","review":"I don't know why so many other people hate this movie so much. Some of them said outright that they didn't like the first one, so why would they watch the sequel? I enjoyed the first one, so naturally I wanted to see the sequel. Sure, it was a bit hokey, but a lot of family movies are. This movie was funny, and it had some serious moments too.<br><br>If you haven't seen this movie yet, here's my recommendation: a. If you didn't like the first movie, you probably won't like this one either, so don't waste your time watching it and then complain about it on this website.<br><br>b. If you liked the first movie, you'll probably enjoy this one as well, so go ahead and enjoy it, no matter what the complainers say.<br><br>c. If you haven't seen the first movie, watch it first, because it's a good movie and gives you the background on the story. Then watch this movie.","user":"froglady99","rank":[23,34]}]