[{"title":"Simply funny and smart","rating":9,"date":"19 August 2010","review":"It's a good thing that comedies are slowly coming out of the stereotypes like cliché characters, fake emotions and boring all happy too long meaningless endings. Don't be fooled that this is movie for teens only; there is lot more here going on.<br><br>Great transformation by Michael Cera, well developed main and supporting characters and very funny appearances by excellent and proved actors. The story is simple but goes through many changes in it making it unique in its genre, successfully escaping the traps set by the movies that have already told this story. This movie like the previous ones has hilarious situations and that is the only resemblance, but apart from them it has developed romance, real emotions, smart and funny dialogs and is more mature.","user":"dejan8378","rank":[32,41]},{"title":"I need to craft an alternate personality for myself now.","rating":8,"date":"11 January 2011","review":"Nothing is worse than knowing that you have met the girl of your dreams only to find out she has a boyfriend that is so unbelievably superior to you that you have no chance to win her over. That is exactly what happens to Nick Twisp (Michael Cera), but instead of meekly accepting his fate like a good little nerd he decides to fight back by creating a persona his French-loving would-be girlfriend cannot resist, Francois Dillinger. Francois appears periodically throughout the film to offer advice and, more often, take control of the situation by flagrantly defying authority or bringing his bad boy machismo into play.<br><br>I imagine Francois is what every stock French resistance fighter was like when he was sixteen with no war to fight; well dressed in gleaming white slacks and sandals, sporting a casual-looking button down shirt, but with a thin mustache and cigarette to add mystery and mystique. The very image of Francois makes me laugh. This also happens to be the only movie where parents are the unknowing consumers of illicit narcotics and it is actually funny.","user":"garyvanhorn","rank":[13,15]},{"title":"Nice, intelligent comedy","rating":9,"date":"24 March 2013","review":"Michael Cera is a great actor, and this movie is no different. Youth in Revolt is more subtle than you would think, given the title and premise. <br><br>Nick is a 16 year old with not many friends, a screwed up family, and worst of all, he is a virgin. Upon meeting Sheeni, he falls in love with her instantly, and will do anything to be with her. This involves creating an alter ego, and becoming an outlaw.<br><br>My only real complaint is that it seemed to me that they put just enough F-words in this to get it rated R. The swearing could have been cut down to make this PG-13, to appeal to a broader audience.<br><br>This is a simple teen comedy, but adults will like it too, it's very well written with a good plot, good actors that fit their characters, and plenty of laughs. Check it out, you won't regret it.","user":"canadian58","rank":[12,14]}]