[{"title":"Good Film For Adults Not for People with No Attention Span","rating":10,"date":"3 December 2016","review":"BEWARE OF BOGUS REVIEWS. SOME REVIEWERS HAVE ONLY ONE REVIEW TO THEIR NAME. NOW WHEN ITS A POSITIVE REVIEW THAT TELLS ME THEY WERE INVOLVED WITH THE MOVIE. IF ITS A NEGATIVE REVIEW THEN THEY MIGHT HAVE A GRUDGE AGAINST THE FILM . NOW I HAVE REVIEWED OVER 200 HOLIDAY FILMS. I HAVE NO AGENDA. I AM VERY FARE ABOUT THESE FILMS.<br><br>This is a nice little Christmas film that was part of the \"Hallmark Hall of Fame\" production banner. In this film a single father runs a Christmas Tree Farm with his 2 teenage children. Once a year they go to New York City and sell the trees. <br><br>Upon the latest Christmas the man gets into a physical fight with his son. The son who is only 16 years old but he is a gifted photographer. After runs away he become homeless but is surviving by getting work at a newspaper. He is the unknown photographer taking pictures in the \"LOOK UP CAMPAIGN\".<br><br>The picture works well. The film has a message that was well worth exploring. <br><br>This film however is not for people with no attention span. Men under 40 will hate this. Children will be bored.","user":"Christmas-Reviewer","rank":[16,16]},{"title":"One of the better Hallmark movies I have seen","rating":8,"date":"13 December 2012","review":"I enjoy all the Hallmark Holiday films, however, \"Silver Bells,\" was one of the better ones. A simple enough story that we can all relate with, Tate Donovan plays Christy Byrne a widower, who goes to New York a month before Christmas to hawk his Christmas trees every year, and he brings his two children Danny (played excellently by Michael Mitchell) and Bridget (Courtney Jines).<br><br>Problem is, Danny doesn't want to miss school, or take over his father's business as Donovan's Christy wants for him. He wants to go to college to be a photographer. And, one year, during this Christmas hiatus after an argument with his father about his life and future, Danny runs away in the big city.<br><br>The bulk of the story takes place the next Christmas. Christy has been looking for his son the past year - wants to reunite and make amends. However, unbeknownst to him, Danny is not only surviving, but thriving int he big city, and is being harbored and helped by Catherine O'Mara (one of Anne Heche's most likable roles!).<br><br>The story gets more involved when Christy and Catherine begin a potential relationship, and Catherine has to come clean to Christy about his boy. It's a wonderful and intelligent holiday film and I really enjoyed it.<br><br>8 STARS for this film. And, like all Hallmark movies, you can purchase this on DVD at most Hallmark stores. That's how I bought my copy of the DVD after watching it on T.V.","user":"danielwesthoff511","rank":[9,9]},{"title":"Pleasant holiday film","rating":1,"date":"1 December 2005","review":"Danny and Bridget Byrne, who lost their mother several years ago, are being raised by their father Christy, who runs a Christmas tree farm in Nova Scotia. Danny takes pictures for his high school yearbook and he has a deadline, but his father thinks the farm is more important because, after all, it pays the bills, and Danny is to take over someday.<br><br>After the harvest, the family delivers trees to New York City and sets up a stand to sell them. As usual, they stay with nice old Mrs. Quinn. As usual, widowed 'museum lady' Catherine O'Meara won't buy a tree. Danny visits her workplace with samples of his photography, and Catherine is impressed.<br><br>When the time comes for the family to return home, Danny is missing. A year later, he has been replaced on the farm, and Bridget and Christy return once again to New York City to sell more trees. Rip, one of New York's finest, still does not have good news for Christy, who has returned to the city several times hoping to find his son. <br><br>The 'silver bells' of the movie's title refer to a photograph that is part of the museum's 'look up' promotion. The Post is asking people to guess the location of the bells, and if no one does by Christmas, the paper will print the answer. Catherine's boss, a real estate developer, likes the idea, but his son thinks it's a waste of time.<br><br>You don't have to be Allison Dubois to figure out the rest. Though there is one unexpected development that could complicate things.<br><br>This is a pleasant family movie overall, but nothing really outstanding. It's at least as good as other Hallmark Hall of Fame presentations. I would say it is well-acted with the usual formula feel-good writing, though I like the formula. The only thing that might be considered offensive: a dispute between Danny and his father gets physical, which I found unnecessary.<br><br>Anne Heche is pleasant enough and attractive with long hair, though I might have been happier with a different actress.<br><br>It's a good film if you like this sort of thing. Which I do.","user":"vchimpanzee","rank":[15,18]}]