[{"title":"A LOT better than I expected","rating":7,"date":"29 April 2006","review":"The trailer does this film no justice. My family wanted to see it and I must admit it looked pretty stupid from the commercials. I've always liked Robin Williams though and went along for the ride. It turned out to be a vacation trip full of laughs.<br><br>The entire theater was howling throughout the movie. Williams was at his quick witted best and the entire cast just seemed to fit the film. Granted, this is a \"roll with the comedy\" kind of film. There may be a little bit too much \"potty\" humor, but it isn't anything raunchy like Wedding Crashers or other films aimed at teens. This is good for the entire family and will have them all laughing.<br><br>Some of the plot and a few of the jokes are telegraphed from a mile away but the strength of the performances and a troop of likable characters transform it from a film you merely wouldn't regret watching to one you'll actually enjoy.\"","user":"dougpaz","rank":[115,145]},{"title":"Better than Its Reputation","rating":7,"date":"30 April 2006","review":"I take my younger daughter to the movies every Friday night, along with another dad and his girl. The movies are chosen to be kid friendly. and so 'RV'was selected. This particular evening the other dad's girl friend was with us.<br><br>The adults were resigned to a glum two hours of tedium, but - surprise! Surprise!! - it turned out to be kinda fun. No one will confuse it with Citizen Kane, but it was lively, funny, and not at all boring. It is obviously a pay check movie for everyone involved - but they are all solid professionals and deliver the goods. I was particularly interested that Kristin Chenoweth, the Broadway star, was in the cast.<br><br>Sp we had a good time with this movie, which is really all you ever ask on Friday night. The entire case does an ensemble version of 'Route 66' over the closing credits, which is worth staying for.","user":"fdbjr","rank":[96,122]},{"title":"Give Robin Williams a break...","rating":6,"date":"1 May 2006","review":"R.V<br><br>My rating: 6.5/10<br><br>I went to see this movie with extremely low expectations, thanks to all the negative predictions which had been circulating for the past few weeks, and I have only one thing to say; DO NOT avoid this movie only because your favourite critic has said that it is an unprecedented flop, or because you think the title is unappealing  watch the movie for yourself first, and be the judge yourself without being influenced by any other guy who probably hasn't even seen the film. Only then you will realise the true significance of this movie.<br><br>First off, it's a great movie to watch with the whole family, which is saying something since most of the comedy movie nowadays are filled with raunchy jokes from start to finish (not that I don't enjoy those movies, but it's cool to watch a nice simple family movie every now and then  \"The Pink Panther\" is a good example of the latter). Contrary to rumours, Robin Williams does NOT let us down, in fact I think he is just as funny as he was in his previous flicks  and if some obsessively observant viewers do notice a change in his performance, then give the guy a break, he's getting older he isn't what he used to be 10 years ago!<br><br>I think it's a pretty good movie mind, it isn't a piece of genius but as I said, if you wipe out all biased thoughts from your mind before watching this flick and without the skeptical attitude, there's a good chance you will enjoy this movie as much as I did, just give it a try.","user":"Nearly_Headless_J","rank":[129,170]}]