[{"title":"A study, not a gun","rating":26,"date":"26 December 2011","review":"This is not quite as muddled as made out to be, but it's not any kind of Hong Kong pistol stuff that it may appear to be based on plot and cast either. It's the kind of film that presents itself as a thriller but is actually about people and the structure.<br><br>It's a two-part complex. The first part plays like an emotional upskirt peek at the tormented soul of this woman, who loved at the hands of a man who tossed and toyed her around for pleasure. She's played by Asia Argento who so effortlessly can channel sex mixed with pain - one of her early film roles after all was back in Italy for father Dario, where she falls victim to a serial rapist. We get some stuff about drugs, pistols are whipped out then forgotten again.<br><br>Now the French touch, our first pointer about what it's all really about; she becomes the character she has written about, a fictional sci-fi woman who controls men. <br><br>Tables are switched, and turns out she was really manipulating this whole time from inside the image he had been used to subdue. For the second part we fly down to Hong Kong where it threatens again to become a thriller. Pistols are whipped out again and forgotten once more. Here we come to understand that she's fallen prey to another lover controlling her for own purposes. There's another woman who is also vying for control of her strings, a sexual antagonist.<br><br>So having consummated one desire about revenge, she is not one step closer to being a free person. Her present suffering is still bound to that first violence that was a sexual desire; this is given to us as having been raped in her sleep, and so the horrible hurt of an unconscious drive, repressed, felt to be beyond any control and so any responsibility. Aptly enough, this second part is about self-discovery then; she's vulnerable for the first time, no more games or roles, conceding to flow where it may.<br><br>It is film noir as far as world dynamics go, make no mistake. To pursue desire is to be trapped helpless in a self-generating chimera.<br><br>Usually in noir that desire was codified as the femme fatale and who is here our protagonist but rendered as an image, a fictional guise, full of cracks suggesting the distraught person behind.<br><br>Finally she follows this second manipulative lover so that it can be revealed to us who was pulling the strings from behind all this time. She gets a second chance for revenge. The final image is one of poignant beauty, as blurry, out-of-focus for the world of plotting and machinations that we felt as the film, she ascends out of view liberated. She is literally no longer part of the film that was pure deceit from the start.<br><br>So for all intents and purposes, it should have been a great film about karmic cycles. It's not quite, but only because, for some reason, this was felt that should also appeal to a broad audience. So, it's filmed in a syncopated manner that is associated with TV, which makes sense in context because the camera is meant to be a frantic eye searching for things as she is, but which probably threw a curveball at those who usually expect a character study in long painterly sweeps and would be otherwise rewarded here.<br><br>It didn't help that it came out in the same year as No Country, another post-noir, much more overtly cinematic, and a host of other well-received films. So not a groundbreaking film, but see it if it shows up.","user":"chaos-rampant","rank":[12,12]},{"title":"Asia's Tectonics","rating":17,"date":"17 May 2009","review":"Two things are interesting about the film.<br><br>The first and most discussed is the actress, Asia Argento. She and Beatrice Dalle are similar I think. They both have the quality of fearless commitment - like Emily Watson in \"Breaking the Waves\" and never afterward. They both have fumbled around facial features. They both are known as sexy — only because of nudity and the roles.<br><br>But more fundamental to me is that they both know things. I believe that an artist has to both have talent and be truly an interesting person; they have to know things we do not. Asia does. In fact, you can see it even in her first movie just as she is hitting puberty. This woman shows us a character that has qualities that this woman understands. <br><br>Streep has talent but no knowledge. Asia has less talent but she matters. This is one of her best. Don't miss it. Don't miss how she breathes. The nudity and story is nothing compared the grace of her visible breathing.<br><br>Here, she plays a woman who does what we all do: make compromises for companionship which if it has what we want we call love. The missing bits always catch up with us and with her the writer maps these pretty deftly into components of a thriller.<br><br>The structure of that thriller is the second notable bit. Of all genres, the thriller is most plastic. Allowing many flows so long as tension and guns are involved.<br><br>The story here sneaks up on you. Almost nothing is predictable. It starts slowly, and then bam. It goes off in an unexpected direction. The interesting narrative device here is that we follow her and discover things as she does. But she knows things, many things, that we do not. She does get surprised as we do, but not always so. At the end, she is allowed to write the future, for her lover at any rate.<br><br>My guess is that if she had never gotten and displayed that labial tattoo, she would have been taken more seriously. And we would be better off cinematically.<br><br>This is a good one. Angelic.<br><br>Ted's Evaluation -- 3 of 3: Worth watching.","user":"tedg","rank":[30,36]},{"title":"Asia Argento is all you need to know","rating":7,"date":"9 August 2008","review":"If it weren't for the smoldering performance of Asia Argento, and I'm not talking about the parts where you get to see her tattoos, I would admit defeat and zero this one out. I don't know why the film is called Boarding Gate; the plot is thin and confusing; Michael Madsen can whisper and grunt all he wants and nobody is going to mistake it for good dramatic acting; the film seems to meander along in prologue mode for about forty-five minutes and then, BANG! somebody dies with great surprise; despite the fact that the location moves to a new country, the film doesn't seem to go anywhere; and not understanding the story won't prevent me from saying with confidence that the ending is lame.<br><br>Ms. Argento doesn't need to act. She lives the role of Sandra, relying on her naturally scary-cool charisma and complex heart to suck us in to her characterthe script isn't going to do it. She's transcendentally tough and vulnerable at the same time. From one moment to the next she is spitting razor sharp barbs and then crying but never weeping, never weak. The incomplete script works to her advantage here. It's not clear why she is attracted so deeply to either of her love interests with the net result that she appears twisted, courting danger and abuse to feel alive.<br><br>Contrary to what the movie posters might lead one to believe, Argento doesn't parade around the entire film in her underwear. There's one quick shot of her being thrown to a bed by her lover where upon she delivers the most authentic and erotic response I've seen in a movie, and there's an extended scene in Madsen's apartment where she's in and out of her dress a couple times. The latter is the best scene in the film, not for its limited display of flesh but for the warped cruelty in their battle of witsmirrored in stop/start kinky sex they never manage to get very far along with for one reason or another.<br><br>Boarding Gate is billed as a thriller and, given its writer/director's resumé, is supposedly about how selfishly cruel and inhuman the world of contemporary multi-national capitalists can be. Blah blah blah. Who's arguing that point? What emerges from the film is a portrait of a modern day neo-femme-fatale who doesn't dress nice or comb her hair trying to juggle a couple of corporate wackbirds (I stole that word from somebody) to her meager advantage and gets a lesson in betrayal along the way. The action parts of the film, the parts where people run around and shoot guns and stuff, aren't interesting at all. The thriller parts, the parts where mystery and suspense are supposed to propel the film, aren't articulated very well. It's the parts where the players settle down to talking smack on one another to gain psychological advantage that are red hot brutal good. If you are a fan of Asia Argento and like your eroticism dark and implied, or are interested in finding out what Argento is capable of as an actress, then check out Boarding Gate. If you are looking for a good thriller, or a film with a little action and good production values, look somewhere else.","user":"sitenoise","rank":[19,22]}]