[{"title":"Intensely Human","rating":9,"date":"29 March 2007","review":"If you are looking for a movie that confirms preconceived notions, don't go to this one. Rather than trotting out a character as a rooting interest in the second or third scene, the film presents four individuals who are definitely worthy of your interest and compassion.<br><br>The two men in this drama, Jacob and Jorgen, are each powerful in their own ways. Jacob in the power of his convictions, Jorgen in the power of money and commerce. The two women, Helene and Anne, and the decisions they make, are the characters that move the story and set up the very real personal tragedies that ultimately unfold. Rather than a recanting of the general plot, my recommendation is to go into this movie as cold as you can. There are twists to be resolved and lives to learn about -- they are not aided by hearing about them beforehand.<br><br>There are no special effects, no flashbacks, no grainy images, and resolution is provided without the use of gun-play. (When was the last time you saw a movie that didn't have a gun figuring in the outcome.) Like real life, it takes a while to learn who the characters are and confirm that first impressions may (or may not) be correct. The pacing of the movie seems to be a primary criticism on the message boards but it seemed to move at a breakneck pace to me. I was very sorry to see it end.<br><br>This is a human drama that the \"old\" Hollywood once made by the boatload. Highly recommended.","user":"GRMacE","rank":[113,124]},{"title":"Incredible acting, incredible story.","rating":9,"date":"30 January 2007","review":"As may be expected of Susanne Bier, and as may be expected of Scandinavian films in general if you ask me, this film is really great. The acting is so good it's hard to call it acting. Mads Mikkelsen (Jacob) puts up a terrific performance with acting that is as credible as it is subtle. Not the over-the-top stuff that we are familiar with from Hollywood, but acting that actually makes you think \"yes, this is how real flesh and blood people would react\". I was also pleasantly surprised by Sidse Babett Knudsen (Helene). She has a lot of scenes with little or no dialog, but the way she tells everything with subtle face expression is simply mind blowing. And let's not forget Rolf Lassgård (Jörgen) and Stine Fisher Christensen (Anne), who both remind us what real flesh and blood emotions look like in a way that really hits you in the face.<br><br>Anyway, I'm a fan of Scandinavian films for reasons mentioned above, and I'm almost ashamed to say that in that light this film was really nothing new, and luckily so: just more of the same wonderful stuff! What really stuck with me about this film however is the story. It is so ...human in all aspects. I won't reveal any spoilers, but as the story unfolds, it just gets so much more complex than you expect at first. In the first 15 minutes, I expected the movie was mainly going to be about the struggle between Jörgen and Jacob. The struggle between these two \"stereotypes\" really... one being the cool business man who solves everything with money, and the other being the idealistic but clumsy social worker. I was pleasantly surprised however that it got even better after that. What I mainly like about the movie, is that it doesn't offer any simple solutions. In the end, there are no perfect happy endings that solve every puzzle; the main characters have to make decisions, but it's not all black and white like we see in a lot of other movies. People have to do things they might not have done initially, but in the end, there may be upsides as well. You know... that sounds an awful lot like real life, and that's a good thing for a film if you ask me.","user":"RagingR2","rank":[128,146]},{"title":"another example of brilliant danish film-making!","rating":10,"date":"16 April 2007","review":"I greatly admired the previous films by Susanne Bier (\" Open Hearts\" and \"Brothers\"), so my expectations were very high.Luckily they have been fulfilled.Like the other two the film is a sociological and emotional experiment.It's about one's place in the world (the crucial phrase in the film is Jorgen's \"Can one expect from you help only on the other side of the globe\" ), about responsibility and the making of painful decisions.The film starts quite slow,but after half an hour it's getting more intensive,mostly supported by 4 extraordinary actors and actresses.While I already knew the qualities of Mikkelsen,Knudsen and Lassgard,I was really blown away by Fischer Christensen as the daughter.There were 4 real-life characters and I could follow their psychological turmoil.Some may find the script too constructed,but life turns out to be full of unexpected twists.The film is no popcorn-entertainment,but for anyone,who appreciates a human,deeply moving drama with the concentration on the characters instead of superficial action,I can only say: Go and watch this movie!","user":"herjoch","rank":[67,77]}]