[{"title":"After A Great 50 Minutes, film Flounders In Final Half-Hour","rating":7,"date":"8 February 2007","review":"At first, this appears to be a rip-off of \"Madagascar,\" with New York City zoo animals leaving the comforts of \"home\" for the wilds of Africa. However, it is a totally different story and feel to it, more serious and sentimental than \"Madagascar.\" Personally, I like \"serious and sentimental\" but not in animated movie, at least not to the degree it was in here. I preferred the other \"NYC zoo\" film to this one because \"The Wild\" lost almost all of its great humor in the last 20-30 minutes. <br><br>The first 50 minutes of this film was spectacular. I was thinking, \"Wow, another great animated film. How many is that in the past year or so?\" The jokes were excellent, the characters mostly funny and the animation superb. The dark, rich colors in here are magnificent. This is a beautiful movie! The minor characters are the best in here: the snake, koala bear and squirrel. Eddie Izzard, Richard Kind and Jim Belushi, in particular, are great in their voices of these characters. The two crocodiles that the wandering zoo animals meet in the sewers are hilarious. They produced the biggest laughs, at least with me. The major characters: the lion (Keifer Sutherland), his cub (Greg Cipes) and the giraffe (Janeane Garafolo) were all a little too much on the serious side.<br><br>Speaking of serious: the last third of this film totally switched gears. I wonder how this went over with very young kids and their parents? It got too serious, frightening in spots (for little ones) and then the usual corny Disney ending. It's too bad: this could have been super if they had just continued doing what was working the first 50 minutes.","user":"ccthemovieman-1","rank":[52,63]},{"title":"You're kidding...right?","rating":1,"date":"23 February 2007","review":"If the case on the DVD didn't say Disney, I wouldn't have believed it. Disney has been synonymous with quality in everything...but not in this case. This was so bad, my little girl asked if she could go to bed before it was half over. Go to bed! She hates going to bed, but she'd rather go to bed than be subjected to this piece of...trash. And a 'G' rating? Really? The adult humor and innuendos? All that violence and scenes of fright? A 'G'? Please. Whoever was in charge was trying to rip off other Disney movies with every new scene. In case you haven't gotten it yet, it stinks. There, I said it. And Disney, please don't even think about sequel here, it couldn't get much worse. Rent Madagascar instead. The Wild makes Madagascar look like an Oscar contender.","user":"jenn121298","rank":[36,45]},{"title":"Hey--I liked it! (No spoilers here!)","rating":6,"date":"26 March 2007","review":"The biggest hurdle for THE WILD is that MADAGASCAR beat it out of the gate, so MADAGASCAR got all the notice. This happens in Hollywierd all the time: remember when two asteroid movies (DEEP IMPACT and Armageddon), two volcano movies (DANTE'S PEAK and VOLCANO) or two bug movies (ANTZ and A BUG'S LIFE) hit the movie screens close together? With so many films always in production, you are inevitably going to have overlap. So quit griping about THE WILD! It's a lotta fun if you give it half a chance. I liked the LION KING and MUTINY ON THE BOUNTY references, and I found the humor more of the chuckle and smile variety than the guffaw type. The animation is beautifully rendered in a more realistic than overly stylized manner, which, unfortunately means the characters, for the most part, don't have big facial reactions. For myself, I would have liked the bigger, more cartoony expressions, but what they did worked just fine. The story of THE WILD actually has only a few plot points in common with MADAGASCAR, and when you see it you'll understand what I mean (no spoilers here!) And the voice talent was excellent: Kiefer Sutherland, Jim Belushi, Eddie Izzard, Janeane Garofalo, William Shatner (yes, Bill Shatner!), Richard Kind and the always welcome Patrick Warburton head up the characters and add their inimitable contributions to the comedy. So, don't go in to THE WILD with preconceptions: just enjoy. I did!","user":"LPCDwoman","rank":[7,7]}]