[{"title":"A lot more down-to-earth, and all the better for it!","rating":8,"date":"25 August 2005","review":"Lilo and Stitch was a nice surprise when i rented it out one day. It didn't look like your average Disney flick. It had a twisted reality to it, and what better combination than to have aliens from outer space and hula dancing Hawaiian girls? Surfice to say I bought Lilo and Stitch the next day! To me the film ended too quickly. But thats the problem with an origin film, even as the creators say in the audio commentary \"they didn't want it to end and wanted to show the true Pelekai family life that followed\" so thats why they did that wonderful end credits with the snapshots. But to me it wasn't enough. The creators must have thought so too, which is why Lilo and Stitch 2 is basically a small story about their daily lives and struggles. Nothing so dramatic, no antagonists, just family problems.. And it works brilliantly, finally getting to see how Lilo and Stitch work together as true family members. The story has a nice flow, showing the good and bad moments that would frequently affect such a \"Ohana\" as Lilo's. The highlight is Lilo's desire to be like her Mum and win the May Day Hula contest. Lilo bases her Hula on an ancient Hawaaiian story of a goddess and a handsome mortal, not realising that the events of the tale is slowly unfolding in her own life. Lilo is too busy asking Stitch to try and behave and help her, she neglects to try and help Stitch who clearly has a bigger problem. What follows is a truly heart wrenching moment in the entire Lilo and Stitch saga! And the same old animation from the first film really does the final scene in the film justice! Plus, you forget Dakota is Lilo! She's a perfect alternative. A must see for all Lilo and Stitch fans.","user":"dimestitch5","rank":[21,26]},{"title":"retains the irresistible charm of its predecessor...","rating":6,"date":"6 October 2005","review":"The original \"Lilo and Stitch\" was a wonderfully offbeat tale that took me by surprise (and even drove me to tears at the end!); the movie's take on the relationship between motherless Lilo (voiced by Dakota Fanning) and an accidental extraterrestrial visitor named Stitch was surprisingly compelling. This sequel is lighter, less spectacular fare--cute, not overly deep--but still entertaining. The story has Lilo entering a Hula competition...just as Stitch's circuits are beginning to go haywire, leading to a fair share of comic mischief and an ending that, once again, almost made me cry (for this, I give the movie an additional star).","user":"Jonny_Numb","rank":[7,8]},{"title":"Tons better than expected","rating":8,"date":"5 September 2005","review":"I saw Lilo &amp; Stitch 2 with my little brother while we were traveling in the car and I found that it was really good. It had a lot of funny moments in it and the ending had a really good message to it.<br><br>I thought that this movie would be kind of like Stitch the Movie which had the sole purpose of kicking off the series and not that great of a plot. I found however that the story was a lot better, they had some pretty good subplots to it, and it was both funny and poignant.<br><br>I would recommend this movie for many people, though it does have an appropriate \"PG\" rating, but I only give it eight out of ten stars because it just wasn't good enough to get the tenth star.","user":"topherwriter","rank":[13,17]}]