[{"title":"\"August Rush\" touched something buried deep inside my soul seventy six years ago.","rating":10,"date":"9 December 2007","review":"This movie \"August Rush\" really touched my soul. I was an orphan and identified with this child's yearning and searching for his parents. Near the end of the movie, I started to cry like a baby. \"August Rush\" touched something tender buried deep inside my soul seventy-six years ago.<br><br>My father was killed in a car accident three days before I would have celebrated my third birthday. My father was also Irish and looked a lot like August Rush's father. It was during the Great Depression and my mother gave me up to the county's foster care agency.<br><br>I am now seventy-nine years of age. How I yearned down through the years for my parents, especially my Irish father. My mother was French. I met her many years later in New York City when I was in my early twenties. She was cold and rejecting towards me. I could not understand why. I was abandoned a second time by one of my parents.<br><br>The movie \"August Rush\" was healing to my soul wounded since early childhood;and again, in my early twenties. I knew where he was coming from as he longed for his parents. Instead of music, I used my talent of writing to deal with the lost of my parents.<br><br>\"August Rush\" made me fantasize during the movie that my yearning and searching for my parents were like this remarkable child.","user":"bobinpr","rank":[211,243]},{"title":"This modern Oliver-style plot has some of the best music around! The \"artsy\" approach is often mesmerizing, and will hold your interest from beginning to end.","rating":9,"date":"18 October 2007","review":"I totally enjoyed this movie. The scenes have an appealing fantasy element, while at the same time, the plot manages to explore true-to-life human situations such as bullying of those who are different.<br><br>The music is incredible, and mostly consists of original scores. It includes gospel, rock and classical, seamlessly integrated in a new way that works extremely well.<br><br>The plot is somewhat predictable and possibly a little \"sappy\", but those elements are easily overcome by the moment-to-moment execution of the story. Think of a modernized \"Oliver\" with Robin Williams as Fagin to a group of homeless, musically talented kids...plus extra elements of romance and intrigue, and you will have a bit of an idea about this movie.<br><br>The three main characters are all physically \"beautiful\" people who manage to convey the story with a minimum of dialog. Additional characters, including Terrence Howard as the social worker, Jamia Simone Nash as the young girl in the church choir, and Leon G. Thomas as the young boy who befriends the musical prodigy, contribute strong performances and pizazz.<br><br>Someone sitting near me stated it is impossible for even a prodigy to learn music so quickly and at such a young age... However, this is not true. Check out Jay Greenberg, a young music student currently studying at Julliard. In the end, this movie is at least an endorsement and celebration of the significance of music in our lives and at most a transcendent, fun experience to watch.<br><br>I rarely like to see any movie more than once, but definitely want to see this again. Take the familythis is for children, teens and adults. Don't miss it is my recommendation!","user":"gailalong-1","rank":[252,309]},{"title":"Cynics Need Not Apply","rating":10,"date":"22 November 2007","review":"This is an urban fairy tale. If you go to AUGUST RUSH with the intention of poking holes in it, you can find little glitches and logic flaws. On the other hand, if you are looking for a movie that will sing to your soul (and show you some beautiful eye candy as a bonus), look no farther. The casting director and cinematographer should each get an award. This gem of a movie takes us on a journey, and the people we meet along the way are well worth the ticket price. <br><br>A trio of beautiful performances form the heart of this film, although the secondary characters are also crisply compelling. A day after seeing it, I find that specific shots of their faces still glow in mind like pieces of a mosaic. And the music is a genuine addition, as it should be in a film of this kind. I was genuinely moved.","user":"askjudyww","rank":[286,358]}]