[{"title":"One of the best Hindi movies that I have seen.","rating":10,"date":"2 September 2006","review":"I saw Lage Raho Munnabhai last night and it's still in my head today. I always go to watch sequels with a bit of trepidation but Mr. Hirani soon eased my fears with a wonderfully thought out comedy that is funny and has a message which he puts across without being preachy. Most of the same cast back again with only Sanjay Dutt and Arshad Warsi reprising their roles and playing the same characters again. This movie cannot be considered as a sequel as it is more of an episode in Munnabhai's life not unlike James Bond films or Charlie Chaplin's tramp.<br><br>Sanjay Dutt is just perfect as Munnabhai... i cannot imagine anyone else playing this role. It was said that Munnabhai was first offered to Shahrukh Khan, while i do like the King Khan i feel he would have gone overboard with this role. Sanju baba plays with a lot of conviction and i believe his true character and honesty shine throughout the film. He handles the comedic and emotional scenes with ease.... so naturally. Good rapport with the Bapu character.Arshad Warsi a.k.a Sarkeshwar a.k.a Circuit was also brilliant ...excellent chemistry with sanju and had some nice sequences. I liked him since the time he appeared in Tere Mere Sapne... and is coming into his own as a Bollywood star in his own right.<br><br>Vidya Balan was bright and chirpy... great teeth! Only disappointment was that Boman Irani did not have the same impact as he did with Dr. Astana but still a great performance. He makes the audience like and empathise with him even though he could be considered the villain of the piece.<br><br>Direction was excellent, song sequences were handled beautifully with most of the songs being situational all well shot especially 'Samjho ho hi gaya' &amp; 'Pal Pal Har pal'. This movie just proves that Bollywood movies can be just as good and entertaining as Hollywood while still giving us all the masala.<br><br>We should all follow \"Gandhigiri\" but first let's support this great movie by praising it and WATCH IT IN THE CINEMA!!!!!!!!!!!!<br><br>10/10.","user":"movie_freak_dubai","rank":[56,69]},{"title":"Excellent!","rating":10,"date":"2 September 2006","review":"Incredible movie! The comedy was expected, and having developed his characters so well, Rajkumar Hirani couldn't possibly not make people laugh in this movie, but the most inspiring aspect was the message which was conveyed in such a beautiful, unpreachy way, something the audience would connect to. Definitely, no documentaries or books about Mahatma Gandhi could have had such an impact on the audience, and after watching this movie, I respect him much much more. <br><br>The screenplay and direction was flawless. There was not a single moment when you wanted to take your eyes away from the screen, and the dialogues were as good as the first part, in fact better. Sanjay Dutt and Munnabhai are made for each other, and he couldn't have played the role better. But yeah, without Arshad Warsi, the movie wouldn't be half as good, and like the previous one, he's delivered. Vidya Balan really adds life to the movie, and if you really want to compare, I'd say she's done much better than Gracy Singh in the previous one. Incredibly beautiful, and she's got grace, I can only but praise her in this movie. Boman Irani, Diya Mirza and others have done there bit, and Hirani has very nicely used all these characters around the main ones. And last but not the least, Mahatma Gandhi, played by Dilip Prabhavalkar is something you will not forget. Throughout the movie, he wears this enlightened smile you fall in love with!<br><br>The movie does have technical glitches, for instance, if vidya balan works at worldspace, how did her show air on FM radio and things like that, but you don't really care much about these things when you've just been through 2 and half hrs of sheer entertainment, where you laughed, cried, and every possible emotion you can go through with a movie. The movie has an incredible feel-good factor to it.<br><br>So all said and done, the movie is a must watch, watch it asap! I doubt I'd find a single person around me who wouldn't like it.","user":"pradyumnaj","rank":[40,51]},{"title":"One of the best movies in recent times!","rating":10,"date":"2 September 2006","review":"This is one the excellent movie that refreshed me to the core. A classic Vinod Chopra production, this movie does not only fulfill high expectations of the audience, being a sequel of Munnabhai MBBS, but exceeds it.<br><br>A decent and hilarious comedy throughout, you can watch this movie with family and realize that superb comedy can be created even without vulgarity.<br><br>On acting front, it is difficult to rank the actors as everyone has made his role alive. Sanjay Datt (Munnabhai), Circuit (Arshad Varsi) &amp; Bomman Irani (Lucky Singh) have given their best performances.<br><br>Cinematography is excellent and songs are appropriate to the situations.<br><br>SO what is the best thing about this movie? Unlike most big-budget-glamorous Bollywood flicks, this movie entertains you, and still makes you think.<br><br>It carries a message for today's generation!","user":"shreerajca","rank":[43,56]}]