[{"title":"Suck it Reindeer Games!","rating":8,"date":"20 October 2012","review":"Role Models is directed by David Wain who also collectively writes the screenplay with Timothy Dowling, Paul Rudd and Ken Marino. It stars Paul Rudd, Sean William Scott, Christopher Mintz-Plasse, Bobbi'e J. Thompson, Elizabeth Banks and Jane Lynch. Music is by Craig Wedren and cinematography by Russ T. Alsobrook. <br><br>Two energy drink salesmen (Rudd and Scott) are ordered to perform 150 hours of community service as punishment for an offence that occurred when their company vehicle was about to be towed. For their service, the two men work at a program called Sturdy Wings that is designed to pair kids with adult role models.<br><br>Personally I avoided it until now because it just sounded like another lame American bawdy comedy about two slacker dudes who create chaos and then grow up by the end credits. This in spite of the fact that I rate Rudd highly and have often found Scott watchable in small doses. As it happens, the film follows the standard formula of plotting but rises above it with funny dialogue, a commitment to its characters and an avoidance of the sort of treacle thick sentimentality that is out of place in this type of comedy. It's also expertly performed by the cast, with the youngsters doing their shift admirably.<br><br>Yep, there's adherence to poignancy and type, while the odd scene just comes off as being too smug and clever. But there's so much fun to be had here it doesn't hurt the film, it's a true pick me up if you are feeling down, a splendid case of a cast finding chemistry across the board and delivering on the promise of the zippy script. 8/10","user":"hitchcockthelegend","rank":[15,15]},{"title":"So much funnier than I was expecting","rating":8,"date":"12 November 2008","review":"After seeing the trailer for Role Models, I thought it looked like a funny movie, but I wasn't expecting much, I was thinking they might have just shown the great parts in the trailer and that would be it. But I took the opportunity and saw Role Models the other day and I have to say this is completely opposite from what I was expecting, first off I was worried that there was going to be a lot of gross humor and the kids might be more annoying than funny, but it turn out that this was one of the funniest movies I have seen this year. I just couldn't stop laughing throughout this film, who knew that Sean William Scott could actually be really funny? I know there are a lot of Stiffler fans that will hate that sentence, but I don't remember a time that I laughed so hard at his character. He and Paul Rudd both worked so well together and were terrific on screen, this was the last duo on Earth that I expected such great laughs from.<br><br>Wheeler and Danny both work for an energy drink company, but after a very hard day for Danny he crashes their company truck on school property, but his ex-girlfriend, Beth, who is a lawyer is able to get them just 150 hours community service with two kids, one is a total dungeons and dragons nerd and the other is just a pain in the butt. You know how the story goes, Danny learns how to be happy and Wheeler finally grows up into a more father figure role.<br><br>Now the story is something we have seen a million times before, but it's still a great comedy. Jane Lynch who is becoming one of my favorite comedic actresses, you've also seen her in 40 year old virgin, she is just absolutely hilarious in this movie and has all the best lines \"You know what I ate for breakfast? Cocaine. You know what I ate for lunch? Cocaine...\" she is such a great and fun actress to watch on screen. I really loved Role Models, it turned out to be a great comedy and was an absolute blast to watch. I highly recommend if you get the chance to see it, take it, it's a guaranteed laugh.<br><br>8/10","user":"Smells_Like_Cheese","rank":[99,129]},{"title":"Do what makes you happy. This film actually believes it.","rating":9,"date":"8 November 2008","review":"Role Models - Two energy drink spokesmen, Wheeler and Danny (Seann William Scott and Paul Rudd) get in trouble with the law after Danny has a break-up with his girlfriend (Elizabeth Banks who is in everything these days). They are given the choice of jail or community service with troubled kids, and choose the latter. Danny is given a boy Augie (Christopher Mintz-Plasse of Superbad) who wears a cape and is into role-playing games. Wheeler is given a foul mouthed terror of a boy (Bobb'e J. Thompson).<br><br>Paul Rudd and Seann William Scott have good chemistry. Rudd has dry sarcasm to spare and Scott plays a sex-addled numbskull. Their interactions with the two talented young boys are funny and occasionally sweet. Bobb'e J. Thompson is one of the better child actors of his age and makes the nightmare of every teacher a cool often wickedly funny little character. Christopher Mintz-Plasse, or \"McLovin'\" as he's known throughout America, plays essentially the same character but sweeter and shy and, funny enough, less creepy. So yeah, he's pretty firmly typecast as \"dork\" at this point. But he's a very palatable dork and may help raise the image of dorks everywhere above the status of subhuman. I heard many girls in the audience very sensitive to his plight in the audience.<br><br>A few parts of the plot are contrived. But aside from a few film snobs, who goes to see a comedy for its original plot? The important thing is the laughs, and this is where the film delivers. Directed by David Wain, maker of The Ten (funny cult film), and written by Wain and Paul Rudd, this film is hilarious. The laughs were frequent and hearty. One of the films defining elements is the showcasing of role-playing games such as Dungeons&amp;Dragons (here it is known as L.A.I.R.E). Role Models takes a surprisingly even handed look at it. It pokes fun, of course (so easy). But there is also respect ingrained. The result is a case of \"so lame it's awesome\" where the absurdity of D&amp;D is given the gravitas of your average Hollywood blockbuster. It's hilarious, and does look terribly fun.<br><br>And it's here that the film makes it's stand. Do what makes you happy, no matter what your parents or anyone else tells you. It's been said in so many films that the message seems false at this point. But in Role Model's extreme example of people doing what makes them happy, it really does ring true. You got to give a bunch of people playing with foam swords in the forest their due. They're doing what makes them happy. Can you say the same for yourself? I can't right now.<br><br>This was a delightful film. It may be a bad year for movies, but it's a damn fine one for comedy. A-","user":"joestank15","rank":[120,167]}]