[{"title":"A decent genre mashup with lots of gore.","rating":8,"date":"8 December 2019","review":"I first saw this in 2008 on a dvd which I own. Revisited it recently.\nThis film is a genre mashup like From Dusk till Dawn.\nIts starts like a comedy n then after 45 mins changes into a gory horror film.\nApart from being inspired by TCM, it has also borrowed elements from Hatchet which came one year before this film.\nThe best part about this film is the gore. It has a nasty scene similar to the one from Antropophagus.","user":"Fella_shibby","rank":[15,15]},{"title":"Well worth a visit!","rating":8,"date":"24 February 2008","review":"British horror movies have always had a unique sense of humour, with \"Severance\" being a good recent example of savvy brit film-makers throwing laughs and gore together to great effect. This carries on that tradition, and in Reece Shearsmith they're blessed with an actor whose comic chops are well up to scratch. Andy Serkis is no slouch either, playing the straight man brilliantly as a mobster who's hard as nails but a little fuzzy on the inside.<br><br>The laughs are pretty reliable, and as the situation goes from bad to worse a lot of those laughs come from the (severe) misfortune of the poor souls on screen, and the blend of splatter and slapstick is well tuned. Jennifer Ellison does grate after a while, her constant use of swearing amusing at times but often a little irritating. Still, she has a fantastic body on her and that ball shrivellingly tough accent to fall back on, so her presence isn't entirely unwelcome. As a comedy it works extremely well, and as a gore movie there's some inventively wince-inducing moments, and with the balance just right \"The Cottage\" is well worth a visit.","user":"teresaband","rank":[43,61]},{"title":"Serkis in undeniably the star of this film","rating":7,"date":"12 February 2008","review":"Director Paul Andrew Williams wanted to \"write a film that cost no money and was all set in one place\". And the first sixty or so minutes stuck to this agenda pretty well; Two brothers kidnap the daughter (Jennifer Ellison) of a wealthy man, he sends out two crazy Chinese guys to kill them, nerdy brother Peter (Reece Shearsmith) looses the all important mobile phone and older hard-man brother David (Andy Serkis) swears a lot, all in the confines of a deserted cottage. The dialogue is just about snappy enough to keep this interesting. Not much to be said for the camera work  but it does kinda add to the atmosphere. And then they end up in another cottage and the blood bath begins.<br><br>It's pretty obvious why they cast Ellison: she has big bouncy boobs and her harsh liverpoodlian accent is juxtaposed perfectly with her blonde hair and Barbie doll face. No one really cares that her script rarely ventures beyond words too rude to publish here  the camera generally focuses on her chest/backside with the occasional headbut thrown in. Shame really; I was hoping she'd amaze us all with her diverse acting talent, but I guess it's a case of you can take the girl out of Brookside but you won't get an amazing actress out of a soap star.<br><br>Serkis in undeniably the star of this film. The perfect gangster with a heart, his sincerity and charm kept me watching throughout. I'm not entirely sure why he chose to do The Cottage  perhaps, like me, he was hoping this would be one of those rare things; a funny independent British comedy. But unfortunately it just felt like Williams had taken The Chain Sore Massacre and Hot Fuzz, cut out the best bits, stuck the leftovers in a blender and then forgot to cook it properly.<br><br>By all means go see this if you like blood, guts and rolling heads, just don't expect any intellect in the script.","user":"jess-154","rank":[46,67]}]