[{"title":"Watts and Norton present The Painted Veil in vivid, true to life colors","rating":7,"date":"24 December 2006","review":"The Painted Veil has all of the elements a viewer looks for in a period piece set during the time of British colonial rule. Beautiful scenery and costumes, a cast of thousands, and enough background information to make you feel you are more educated about a time and place than you were before you saw the movie.<br><br>What this film offers the fortunate viewer that many other movies of its kind do not, are lead characters you can actually empathize with and grow to care about. \"Walter\" and \"Kitty\" are far more likable and worth rooting for than- I don't know, let's say- Ralph Fiennes and Kristin Scott Thomas in the English Patient (see? I don't even remember their characters' names.) The movie's tagline- \"Sometimes the greatest journey is the distance between two people\" succinctly points to the heart of this film, and what makes it work so well; the journey of a couple who married for the wrong reasons towards true intimacy with each other.<br><br>On one level, the plot is so simple and straightforward that a one line summary gives the whole story away, and for that reason, I will refrain from providing that information as much as possible. It is enough to know that it is the story of The Fanes- Walter, the shy, bookish bacteriologist, and Kitty, the shallow, haughty young woman he becomes infatuated in and persuades to marry him. Walter takes Kitty to Shanghai, where he works in a government lab. Circumstances lead Walter to re-locate them to a more remote area of China in the throes of a cholera epidemic. It is in this setting that the parallel stories unfold; the story of a doctor and his wife living in the house of a dead missionary's family as the doctor tries to get control of the conditions responsible for the epidemic, and the story of the couple's journey towards re-discovering each other.<br><br>The impressive skill that Ms. Watts and Mr. Norton bring to their work truly makes you believe that that the first challenge- combating cholera amid colonial unrest and nationalist hostilities is easier than the task of repairing a damaged marriage, and with each uneasy glance and every unsaid word, you feel what these two people feel. And that is the beauty of The Painted Veil. Fans of Ms. Watts and Mr. Norton will have reason to rejoice- this is a performance unlike any I have ever seen Ms. Watts give. There is nothing of what was becoming her trademark \"emotionally fragile woman in shambles\" persona on display here. And what of Edward Norton? Well, after his turn in The Illusionist earlier in the year and now \"Walter Fane,\" all I can say is, move over, Ralph Fiennes- there's a new sexy \"repressed, stiff-upper-lipped, sensually simmering under the surface\" leading man in town.<br><br>The Painted Veil is an intelligently adapted, well-directed film with two charismatic, award-worthy lead performances and a strong supporting cast, including Liev Schreiber, Diana Rigg, and most notably Toby Jones as the Fanes' neighbor. It is also wonderfully entertaining, and a good introduction to the period piece/historical epic genre some viewers have been avoiding due to fear of suffocation.","user":"Margie24","rank":[266,303]},{"title":"Exquisitely Layered, Haunting, and Clever Period Romance","rating":9,"date":"14 January 2007","review":"John Curran's nearly pitch perfect film adaptation of W. Somerset Maugham's \"The Painted Veil\" begins slowly and patiently, with leisurely flashbacks that elliptically bring us to a singularly absurd predicament: circa 1925, a British doctor (Edward Norton in his second romantic lead following \"The Illusionist\") has brought his lovely young wife (an entrancing Naomi Watts) into the middle of a Chinese cholera epidemic purely out of spite. It's a wickedly clever little set-up that becomes increasingly more complex and absorbing.<br><br>The note-perfect and delicately layered performances of Watts and Norton, two thespians typically acclaimed for their edgy and independent work and playing against type, are anchored with the literary genius of Maugham and Curran's keen eye and steady hand behind the camera. It's all perfectly accentuated by the brilliantly subversive music score by Alexandre Desplat (doing his best work since \"Birth\"). These cleverly designed elements coalesce deliciously into a fully fleshed-out whole, and allow \"The Painted Veil\" to grow in your mind organically and slowly slip under your skin like an infectious disease.<br><br>Ron Nyswaner does a great job of translating Maugham's writing to the screen. Virtually nothing is lost. That keen British wit, the dramatic sense of irony, and the sincere exploration of many heady themes including loveless marriages, adultery, imperialism, charity, religion, and redemption are all captured beautifully by director Curran and screenwriter Nyswaner. Watts and Norton are given plenty to chew on, not only great lines, but great scenes full of lush scenery, and beautiful and textured visual details that serve as perfect backdrops for their complex and unpredictable relationship.<br><br>Back in the heyday of Merchant-Ivory, it seemed like this type of literary minded period-piece was a dime a dozen. There hasn't been a hugely successful film of this type since 1996's \"The English Patient.\" We haven't seen a worthwhile film in this genre since Neil Jordon's underrated \"The End of the Affair\" in 1999, which not coincidentally was an adaptation of one of the great novels from Maugham's fellow Brit and contemporary, Graham Greene, and addressed many of the same themes.<br><br>What \"The Painted Veil\" lacks in epic sweep it makes up for in scores with its nuanced performances and subversive outlook on romance and true love. Its finely landscaped images of China are transfixing, but it's the look on Norton's face when he realizes the woman his wife has become, and the glimmer of a tear forming in Watts' eye when she realizes what she's done that will haunt you.","user":"WriterDave","rank":[136,163]},{"title":"A most transporting film.","rating":10,"date":"30 December 2006","review":"I think is the tone of the film  and by that I mean everything from the cinematography to the dialogue the music and, most of all, the nuanced performances  which, because it is so consistent and so consistently sublime renders the film far apart from the ordinary. <br><br>I was interested to see that Naomi Watts and Edward Norton produced this film. No matter which of them (or, for that matter, any one of the film's fine cast) is on the screen, we are fully involved: they invite us into their story, they invite us to care. <br><br>Even if one were to strip away the performances and the story there is still the sheer beauty of the Chinese countryside, filmed to perfection.<br><br>Just go, and see for yourself.","user":"bellisland","rank":[185,225]}]