[{"title":"My Favorite Martian","rating":8,"date":"10 November 2007","review":"Martian Child will be one of those quiet movies that many people won't see. Those who don't see it will miss it. I can understand why it's sitting quiet: not much promotion, and who would it appeal to? There is no CGI, no car chases, no undue violence, only a brief kiss, and the movie isn't partof a trilogy. People who want plot that is not clichéd, and meaningful dialogue will search the movie out. It's aimed at the heart, and touches the emotions. It makes a person realize how important it is to have people in your life who will never, ever, ever, ever give up on you. Even when it looks like you are from Mars. John Cusack is not an actor I am drawn to, yet this movie changed my mind. He has depth, wit, and range I hadn't noticed before. Even if the movie doesn't get wild acclaim, it has a quiet understatement that I hope gets noticed. We all need to belong, and have at least one person believe in us.","user":"pdwebbsite","rank":[89,99]},{"title":"This film is adorable.","rating":4,"date":"4 November 2007","review":"I work in a cinema so I'm in the perfect job not to miss any film releases including minor ones like this film. I call this film a \"minor\" release because it was not advertised much, just a trailer here and there but it's the type of film that make me happy to work at a cinema otherwise i would have miss out on this little treasure of a film. The story is simple , a lonely widower, also a sci-fi best selling author , adopt a child who lives in a world of his own were he convinced himself that he's a Martian who was sent to earth to study the human race. The child's rather strange, he hates the sun and doesn't smile often. At first the writer he's not sure if he's up to the task to bring up a child with such big issues but little by little he realized that he was the perfect match for the boy. In a world were we have countless film about fart jokes and people getting tortured to death , I found \"Martian Child\" to be a breath of fresh air. It's a sweet film without being corny. The acting is great all around.John Cusack his wonderful as always but its the young Bobby Coleman who plays Dennis the young boy who's the real star of this film he is great but also likable and god knows how this sort of character could have turned out in the wrong child actor's hands. Joan Cusack bring much of the comic moments in this film and it's nice to see her with her real life brother , I love that woman , she always add something to any film she's in. The most interesting aspect of this film is seeing the character of Dennis progression throughout the film , from a troubled boy to a happy kid , it was really well done. Somme people might found this film \"overly sentimental\" but I believe it's because we live in a cynical world and a film like Martian child stand out more in a time when we are not used to see a film that doesn't show violence or gross out humor. The main purpose of the film is to introduced us to two character , make us love them and see them grow together and it does a more then decent job at that. I would recommend this film to anyone who has enough of a open mind to accept a film that just wants to grab hold of our heart for 1 hour and 45 minutes. I think this film is a nice little gem and I don't care about all the critics that found it just too sentimental.For the full duration of the film I was interested by the characters and at the end I was happy for them and thats all I ask for a film , that the character are involving.","user":"OliverGbyrne","rank":[105,122]},{"title":"Martian Child: are we all strangers in a strange land?","rating":9,"date":"30 October 2007","review":"What would be different about a child from the planet Mars than one born on Earth? No one knows, since for all practical reasons no one has ever meet a Martian Baby. David (John Cusack) a widowed science fiction writer, with writer's block decides to find out, by adopting an unwanted boy. The boy, Dennis, (Bobby Coleman) outwardly acts as if he is a child from our closest celestial neighbor, the planet Mars. David and Dennis appear well suited for each other because they are both living apart from society. David does so by living alone and writing science fiction novels up until the present time of his wife's death, now he is just alone. Dennis, avoids contact with everyone by taking on the guise of the child from Mars, an alien, a stranger, who acts differently than the norm, and therefore society avoids confrontation with what is unusual. This screenplay is adult in nature because it deals with issues that are unpleasant and upsetting. Taking on the responsibility of rearing an unwanted child, alone, having never actually been a parent, and never knowing if the love you give is going to be returned is a huge step! This is a film that will be appreciated by a very small audience. One must first be able to get past self indulgence and reach a certain level of maturity before one can consider taking on the total responsibility of another life form. Director Menno Meyies has created a very strong bond between David and Dennis in their scenes throughout his film. Unfortunately most of the people on this planet will never see their performances. Go out of your way, go alone if you must, but go see the Martian Child. If you are a parent it will remind you of raising your own children, if you are not yet a parent it will remind you of the childhood you had and the experience of raising your own Martian Child yet to come!","user":"mgoldhamer","rank":[78,96]}]