[{"title":"A dirge, but my god, a riveting one.","rating":9,"date":"25 October 2004","review":"On paper I can see the argument that there is little morally redemptive quality to a film like Dead Man's Shoes, no diamond polished by the end credits to reward an audience going through the trauma. But to actually sit through the film, and most importantly, to be subjected to another of Paddy Consadines' electric performances, is an extra-ordinarily vital, if viceral experience.<br><br>In 'A Room for Romeo Brass' Considines character shifted from comical to threatening in a truly unsettling way, although in the end his promise 'to go dark on you' is easily thwarted by the decisive action and confidence of a father-figure. In this film, again, there is some uncertainty on the audience's part as to how far the character will go, as until the end, we are uncertain of exactly what he is revenging. <br><br>Rest-assured, Considine delivers an absolutely convincing depiction of a man struggling to balance his desire for revenge and redemption, he invokes sympathy and fear from the audience in a performance to rival DeNiro in 'Taxi Driver'.<br><br>I judge a film on the value of the experience it gives you, and 'Dead Man's Shoes is more than worthy of your time.","user":"RePeelableDecals","rank":[231,260]},{"title":"Mind-blowing example of a damn good movie","rating":9,"date":"15 October 2004","review":"Well, you can probably tell from the summary that I thought this was a really good film. To be frank, from the first few minutes I felt that knot in my stomach that comes from deep apprehension and anxiety; I was being manipulated from the off, and it just got more and more intense.<br><br>The film is a straight revenge story - a man goes back to a small town in the north of England to take revenge on a group of people who abused and tortured his mentally-retarded brother. Richard has been in the army for several years and is trained as a mercenary, but he plays mind games as much as he resorts to violence. In fact, I had to ask my friend if this qualified as a slasher film (which is how you will probably see it advertised) and we didn't think that the term does it justice.<br><br>The script is superb, and reminded me of Almadovar in that it squeezes an incredible amount of detail about the characters without any clumsy exposition. For example, to gauge the relationship between Richard (an astonishing portrayal by Paddy Considine) and his handicapped brother Anthony (played by Toby Kebbel with skill and sensitivity, and not a little sensuality) pay close attention to the conversation where they talk about a childhood football match. So much said about their characters, their relationship and the situation, in so few words.<br><br>A film as violent, aggressive and discomforting as this has no right to be as funny is it is, but it gets away with it. The gang upon whom Richard takes revenge are at times touching, farcical, disgusting, pitiable but ultimately human. The worst of humanity laid bare, making you want to retch and laugh at the same time.<br><br>I am not going to spoil this film by going into the little twists and turns, the less you know about the plot the better. Although many of my reasons for being so impressed with this movie are personal, I think that the script, acting, cinematography, direction, editing and soundtrack are all brilliant. This film is on a limited cinema release, but search it out; it will take you on a hell of a journey.<br><br>\"God will forgive them and let them into heaven, I can't let that happen\"","user":"kim-morgan","rank":[177,204]},{"title":"How British Low Budget Should Be Done","rating":10,"date":"31 January 2006","review":"If you do not like dark, challenging films, don't bother.<br><br>If you are ready for something unlike anything you've ever seen, and are not afraid to confront difficult emotions, give this film a go, you won't be disappointed.<br><br>From the start the tone is set. A bleak town in Northern England, like many bleak towns in northern England. With petty, small time drug dealers, like petty small time drug dealers everywhere, vicious and stupid. Then into their lives comes a mysterious figure, in a green parka. And nothing will ever be the same.<br><br>It's difficult to describe the movie without spoilers, and I do not want to spoil a single second of what is possibly the most powerful and emotionally wrenching film I have seen for a decade and more (made all the more powerful by the haunting music). Paddy Considine (who wrote and stars in the film) is stunning as, for want of a better phrase, an avenging angel, albeit a fallen one. The menace and tension builds and builds (including perhaps the best depiction of a bad LSD trip ever set down on film - it's an extremely discomforting experience if you've ever been on the wrong end of a bad trip, believe me) until the harrowing climax. This is not a nice film. This is not a fun film. This is, however, an exceptional film, and perhaps more importantly it is an honest film, a true film if such a thing can be said of fiction.<br><br>If you want smiles, or empty action, or to put your brain on hold, this is not the film for you.<br><br>If, however, you want a film with genuine emotional depth, that makes you think and resonates far after the end credits have finished, then this may be what you're looking for.<br><br>Just don't expect an easy ride.<br><br>An overused word, but the closest I've seen to a masterpiece for many a long year.","user":"originalboojum","rank":[154,177]}]