[{"title":"A barking good time","rating":6,"date":"24 August 2012","review":"I'm almost ashamed to admit that I actually quite enjoyed \"The Breed\" and I'm sure there's more people out there who won't admit it. It was fun right from the opening with the horrendously bad actors, \"wood\" and the awful direction. However, then five new kids come on the island and they're more competent actors and strangely likable as the film went on. I did actually feel sorry to see some of them die which is unusual in a film like this. The characters weren't flat, which was a lovely surprise. Of course it is extremely clichéd with the group going into a cabin with a creepy basement and so forth. This is the type of horror film \"The Cabin in the Woods\" was warning us of! The dogs are also quite funny as I do not find dogs scary in the slightest, especially when they're as cute as these ones! To see a bunch of cute panting dogs slowly gather and surround the young adults like \"The Birds\" was quite an unintentional hilarious sight. There was also a surprisingly good pace with the group always trying to make some innovative decisions. All in all I found it to be an entertaining and fun film. You shouldn't take it seriously and if you don't then you might actually find yourself enjoying it!","user":"asda-man","rank":[15,17]},{"title":"A clichéd but effective horror film","rating":5,"date":"27 November 2006","review":"Movie concepts don't get much simpler than this: on a supposedly deserted island, genetically enhanced, rabid-like dogs attack five college kids who have gone there for a weekend of fun. It's kind of surprising that a movie like this, made in 2006, still gets theatrical release in some countries; this is usually direct-to-DVD stuff. With that said, however, \"The Breed\" is effective at what it sets out to do. What gives this movie an edge over other contemporary \"creature features\" is that the \"creatures\" are real, highly-trained dogs instead of fake CGI bats, crocodiles, snakes, spiders or whatever. This adds an element of realism to the proceedings, as does the fact that the characters behave rationally for the most part. Michelle Rodriguez looks great (what else is new?) and shows her physicality, and the rest of the cast may not be brilliant, but they're not bad, either. The movie does suffer from a terrible ending though - it was probably intended as a shock but it's so sudden that it looks as if the producers ran out of money or time or something. (**)","user":"gridoon","rank":[52,71]},{"title":"Intelligent teens vs intelligent dogs makes it above the normal","rating":7,"date":"18 September 2006","review":"Surprise is the word! After seeing the plot outlined here I thought this was another movie with a bunch of silly teens getting killed one by one by supernatural dogs. Instead, I watched a very enjoyable, solid and realistic thrilling and Sci-Fi film.<br><br>Five middle class teenagers fly to an uncle's private island for a party weekend. What it seemed a good time spent it turned to be a terrible situation when a big group of (intelligent) killer dogs start to \"plan\" the teens' capture and death.<br><br>The action starts at the beginning and then will start again at the middle of the movie. From then is always packed with some suspense and chases but everything very well shot and capable of arousing and holding the attention of the viewers. The movie's many attack sequences are really the best of it. The 10 to 15 dogs, (very well trained) are, undoubtedly, the 'cherry on top' of the movie. They really act normal off course and we can assist to their natural greatness of dreadful attacks.<br><br>The human cast actually does a good and decent job even if their characters are stereotypical due to flaws in the script lines. There's some moments when they drop to mediocre acting but that's because they following the script contradicting some of the action... but that's minor spots, no big deal and doesn't affect the admirable outcome of the movie.<br><br>I think I saw a reviewer here asking where the dogs came from... Near the end that's very explicit. I saw another showing his disappointment because the dogs were 'normal and not scary'. Don't expect genetically altered beasts with red eyes and acting like werewolves... no. The dogs were genetically altered at brain level, and that's why they're smarter than normal.<br><br>Nicholas Mastandrea does a splendid job directing it but he should have asked Screenwriter's Robert Conte and Peter M. Wortmann to put some original and not clichéd lines in the teens' dialog.<br><br>Great cinematography for a good weekend.","user":"jpgonc","rank":[33,44]}]