[{"title":"The Truth Hurts","rating":10,"date":"15 March 2008","review":"People did not like this movie for a simple reason: too negative. I can understand that this movie is so depressing in so may ways. <br><br>What it shows that Big Fish eats Litte Fish and none of us want to think about that anymore than most of us experience it in our daily life. It shows the battle between the evangelicals and the corporate business man. Or maybe even the battle between evangelicals of today and the non-religious people or atheists of today. Even worse is that this movie shows that religious people, priests are or can be as bad as a corrupt oil man. Maybe why people did not like this movie is because it might have offended them. Especially Paul Dano playing the priest. Both Daniel Day Lewis and Paul Dano are wrong and too extreme on their opinions. People are able to accept this. What people cannot accept is though that these same extremities and same misguided opinions from both characters are very much true in that they are heavily believed still today. Not all Christains are like Paul Dano's character and not all business man are like Daniel Day Lewis's character but many are like them. That is the world we live in.<br><br>Now is their any alternative or positive side? The answer is yes and that is H.W. the son of Daniel Plainview(Daniel Day Lewis). He epitomizes hope. He shows that despite being deaf and having a father who uses him as a ploy for better business he can still break free of the chains that he is being tied down by. What separates H.W. from the residents and evangelists of Little Boston? The difference is that he and his father are educated and they are not. That is how Daniel Plainview is able to manipulate and cheat them the Sunday family, even Eli Sunday(Paul Dano) the priest and preacher of Little Boston. From what H.W. sees and experiences he sees that much of what is around him is just wrong. He uses his experience that he had gained as a kid to break free of the corruption and chaos that could have taken over him. That is one aspect of the education I'am talking about: our experiences and understanding of what is happening around us. <br><br>Now to get to the technical aspects of There Will Be Blood. It is just truly spectacular in every way. First off the acting was amazing. Daniel Day Lewis gave arguably the best performance of his career playing Daniel Plaiview or ever since movies began to be made. He freaked me out and probably shocked many people. His thirst for power and money was at such a high level that it made me wonder about what people are really capable of. The deceiving, the greed, the thirst for power and the every man for himself attitude actually looked more real than ever to me. Without Daniel Day Lewis I don't think this movie could have achieved what it has. Paul Dano gave a great performance as Eli Sunday though people tend to disagree. I think he gave a great portrayal of an extremist evangelical priest of how he himself had his own thirst for power and how he was more blasphemous then respectful and gracious to god then how you would expect a priest to be. How could people not be shocked by these two characters, I was myself.<br><br>Why was the music for this movie not liked. I thought this was among the top five musical scores I have ever heard. The music perfectly gave you the feeling of the corruption and deception setting into the movie. It perfectly intertwined with the rest of the movie as the movie itself was ever growingly becoming more and more chaotic and surreal. Probably too shocking though.<br><br>Paul Thomas Anderson I believe gave the best directing job of the year. He was able to show the oil fields and its processes, the rise of an oil man, the way everyone can be bought even a priest and the hope that H.W. represented. This movie was never boring and it was as stunning of a directing job as Daniel Day Lewis gave as a performance for his role in this movie. The intensity of this movie was as high as a movie could possibly be and some of the credit for this has to go to the director. The cinematography and the music seemed to intertwine perfectly like the rest of the movie. It gave the sense of the time period and as said before the greed, deception, etc. The cinematography did not just give you a negative feeling but a feeling as if what you are watching is real.<br><br>You should not like this movie just because of the great technical achievements as you should not for any movie but for what it says and how it says it. I'm not even sure if you should enjoy this movie in general but you should not be blinded by your opinions. I applaud you whoever out there who can somewhat understand this movie and get past the lying and deceiving we do to ourselves. This movie really shows the humanity of human beings. Why is this rated-R?It has so many intense scenes that if you get inside this movie it is truly haunting. Now maybe this movie was too powerful for many people, it was probably even shocking for realists. Maybe though its not that surprising that so many people don't like this movie because the truth hurts. Not the truth about corruption or about people but the truth about ourselves.","user":"alexkolokotronis","rank":[394,498]},{"title":"One of my top five of all time, For Film viewers not movie goers","rating":10,"date":"11 January 2011","review":"There Will Be Blood. Chilling, Sublime, perfect.<br><br>First I must say the Soundtrack is amazingly disturbing and sets the tone of the film from the first scene. Many forget the amount of mood that sound sets. <br><br>The film held me enraptured from first to last second.<br><br>The story is perfectly displayed. Ever thing is laid out before the viewer in an intentional pace. <br><br>The film is for viewers with imagination and foresight who can see through the shams of modern movie plot and into the realm of literature.<br><br>The acting is simply stunning. Daniel Day Lewis can portray lines with a single expression and does in this film.<br><br>I'm sure many will not enjoy this movie and all I have to say to them is go watch Transformers 2 again.","user":"lamoreauxba","rank":[46,60]},{"title":"Remember Those Hollywood Studio Epics? Me Either. But We're Covered.","rating":9,"date":"14 January 2008","review":"The year I was born was the same year Predator and Robocop came out. When I was finally old enough to appreciate films, Little Nicky was in theaters. I know, believe me, I know; rocky start. And often I would watch older films, or specials on older films, and be dazzled. You know the ones. Remember when they made Spartacus? Remember sitting in the movies and watching Gregory Peck play Atticus Finch in To Kill A Mockingbird? Remember the first time you heard \"I could've been a contender\" through theater speakers? Well I sure as hell don't. But I'll tell you what, now I feel somewhat caught up. Let's begin with the obvious. Daniel Day Lewis. No one's arguing about this. The man is a veritable God among ants on the screen. He takes his role by the reigns and I don't doubt him for a second. In fact, at times, I was downright afraid of the man. Lewis gives what is easily, EASILY the best performance of the past five years. But let's get serious about it. Lewis' Daniel Plainview is the most convincing, awe-inspiring, and downright mortifying character to take the big screen that I can remember. Here, perfectly in his element and at his best, Lewis could go toe to toe with Brando and Kinski, playing a part that oozes enough skill and pathos to earn him a place among Hollywood's, and perhaps the world's, greatest performances of all time. He gives those of us who missed out on the craft, depth of character, and technique of classic cinema a chance to admire a tour de force portrayal of a memorable, identifiable, and completely despicable character, and it's so damned refreshing that I can't stop singing the man's praises. Paul Dano has been taking a lot of fire for this whole thing. People continue to spout their disapproval of the film's casting, saying that Dano has no business rivaling the seasoned Lewis on the screen. Listen, lay down your swords a minute and consider the obvious. The guy was cast opposite the performance of the decade, he's not going to outshine Lewis and you'd be crazy to expect him to. In fact, I think that he and Lewis' back-and-forths are the films highlights, as we see the juxtaposition not only in the characters themselves, but also in their acting techniques. And the cinematography? Welcome to the old days of film. The glory days of Hollywood. Anderson gives us one of the most beautifully shot and directed films in recent memory, truly at the top of his craft on this one. Every moment feels more epic than the last, until the film becomes such a towering cinematic spectacle that the end leaves the viewer exhausted. It's truly an experience not to be missed. Yeah, we missed out on A Street Car Named Desire. And Casablanca isn't gonna be in theaters again any time soon. But in the meantime, There Will Be Blood is just about as good, and will likely haunt our generation as much as the Hollywood studio epics of the past...","user":"DSampson612","rank":[855,1]}]