[{"title":"Carnage at Oxford","rating":4,"date":"20 December 2014","review":"Philosophy, mathematics &amp; logic, Oxford University, murder, intellectuals  all the components that one could hope for in a cerebral, cozy British murder mystery. I, like several others who have written reviews, had high hopes for what would be served up, but ended up disappointed.<br><br>The genuinely famous \"Fermat's Last Theorem\" mysteriously became \"Bormat's Last Theorem,\" which was somewhat indicative of much of the flimflam &amp; fakery that enveloped the movie. The whole production was buried in pseudo intellectualism, name-dropping (numerous mathematicians, logicians &amp; philosophers who would probably have preferred, like Fermat, that their names had been changed to protect their reputations) and contrived clues that depended on parsing a presumed mathematical/logical series. Beneath it all there was a plot that might have qualified for a mediocre episode of Midsomer Murders or Columbo, but would hardly engage the \"little grey cells\" of even Hercule Poirot. <br><br>Martin (Elijah Wood) and Arthur Seldom (John Hurt) spend a good deal of their time shouting at one another (and various other people) in ersatz academic one-upmanship, apparently on the assumption that the louder you are, the more convincing your dubious thinking must be. More alarming, Martin felt compelled to dash from pillar to post every few minutes, frequently colliding with other people carrying books or papers that went flying in the air. Rather unconvincing romantic couplings and consequent jealousies seemed totally disconnected from the rest of the story. Towards the end we were even treated to a rather tepid car chase and fiery bus crash in a vain effort to heighten the drama.<br><br>This is a case where less would have certainly been more. Too much was thrown in, in an attempt to elevate a trite and poorly concocted plot with a cloak of intellectualism and atmospherics. Too many unhinged and bipolar characters were floating about. It all seemed to be a hodgepodge of distractions aimed at concealing the absence of substance.<br><br>It just never came together.","user":"Suradit","rank":[6,6]},{"title":"Bland but Almost Saved by John Hurt","rating":6,"date":"13 November 2010","review":"I had high hopes for \"The Oxford Murders\", a new Straight-to-DVD film starring Elijah Wood and John Hurt, and most of those hopes were slowly let down as I watched the movie.<br><br>The film follows Martin (Wood), an American who travels to Oxford to write his thesis under the legendary mathematician Arthur Seldom (Hurt), and finds an angry, pompous old man instead of the wise and caring fellow he had imagined. Disillusioned, Martin is about to return home when he and Seldom find a dead body. The rest of the film covers Martin and Seldom's race against time to find the killer, using the mathematical theories that both are knowledgeable about.<br><br>The film is pretty bland. It's characters, save the amazing John Hurt, are one-dimensional. Martin is boring and unengaging and Elijah Wood does nothing to improve his script. The same can be said of Julie Cox and especially Leonar Watling. John Hurt is the only reason I finished, really. His acting skill is not at home in the world of blandness.<br><br>You could do better than \"The Oxford Murders\", but if you're not looking for too much it will suffice.","user":"Bob_the_Hobo","rank":[33,44]},{"title":"complete failure","rating":2,"date":"14 May 2017","review":"Rarely a film fails on so many levels. The film tries to say \"deep things\" but clearly neither the writer nor the director have a clue what they are talking about, so all the \"profound\" stuff is merely ridiculous (low point: Wittgenstein during WWI writing in his notebook, and that's only the introduction to the film). As a Monty Python sketch that might have been funny, but since the film is pretending to say something serious, it's just embarrassing. The acting is abysmal, the plot is silly and full of holes, for some incomprehensible reason there are two girls who suddenly fall in love with the main character, but there's no way to understand why (or how, since there's zero chemistry). For me, the worst part were the dialogues, though. At the beginning, the American student who just finds a boarding room with some woman who used to know a number of famous mathematicians, picks up a photo and then explains who the people on the photo are, why they are famous, and a short Wikipedia biography of their lives. Subtle. \"Well,\" says the woman, \"you did your homework\". If only the scriptwriters, the director and the actors would have done the same.","user":"machielkolstein","rank":[14,17]}]