[{"title":"At least 50% of the audience liked it.","rating":7,"date":"15 April 2007","review":"I went to see this film on my birthday with my friend Paul. There were low expectations from both of us and we came out pleasantly surprised. We were laughing throughout the movie and it turned out to be a good birthday for me.<br><br>The other two people in the cinema were not as impressed but there's no accounting for taste.<br><br>I honestly cannot understand why this film has been critically mauled. It doesn't pretend to be something it's not. It's a film aimed for laughs and it does exactly what it delivers.<br><br>To fully appreciate and understand this film you need an enlightened and intelligent sense of humour to comprehend the genius film that is Norbit. People like Paul and I are just very rare.","user":"junaidaslam","rank":[71,94]},{"title":"\"Well Raspucia, you have been eating so much lately...\"","rating":8,"date":"25 April 2007","review":"Wow, I don't no why this movie has received such low ratings! Okay, I understand that there really is no point to the movie. No climax, unforgettable conclusion, I understand. BUT IT WAS FUNNY! Lol, if you ever want to see a movie just to LAUGH, then you have to see Norbit. Eddie Murphy is Brilliant as usual and the characters he plays are pricelesss. I sure did ecjoy watching this hysterical movie. I highly recommend this movie to all ages! HAHHAHAHAHAHAHA, im laughing now thats how funny this movie was. WOW. But anywhoo,like i said before, if you want to watch a movie, not worry about anything else, then Norbit is a must see. LOl, I loved it and believe me, you won't regret it!","user":"claknoxville","rank":[60,81]},{"title":"For all you movie critics that hated this movie, YOUR WRONG! Absolutely Hysterical","rating":8,"date":"7 February 2008","review":"All the people that thought that this movie was crude, distasteful and horrid, You have no sense of humor whatsoever. I could not stop laughing throughout this movie. Norbit is a great comedy and it shows what a versatile actor Eddie Murphy is. I don't know why people think this movie is \" Crude\" or \"Racist\" . This is just reality. This is really how the media and the people in this world view these types of people. If it was racist against African Americans, I don't think am African American actor ( Eddie Murphy) and all the others would have agreed to make this movie. All you haters need to rethink your idea of comedy because this is comedic genius.","user":"anmcool","rank":[38,52]}]