[{"title":"Return of the Witches","rating":9,"date":"9 December 2005","review":"Legend of the Witches opened at the Charing Cross Road Jacey Tatler cinema in early 1970 and was widely (and for the most part favourably) covered in film, sex and occult publications at the time. A meditation on witchcraft from its pre-Christian origins, to modern day black masses and how its influence has subliminally filtered into mainstream British life, represented by fortune tellers, a man on the street thinking twice about walking under a ladder and children playing 'ring a ring a roses'. Although worlds apart cinematically there are comparisons perhaps to The Wife Swappers, in so much that both films had the good fortune to appear when public curiosity in their subject matters were at their highest. Both films' lurid ad-mats and stills were wholly successful in capturing the publics' imagination.<br><br>From the first striking images of the sun rising, deer running through fields, Stonehenge and a naked man on a rocky beach contemplating the sea its clear that director Malcolm Leigh was no hack though, and throughout the film Leigh demonstrates a true painter's eye for composition, vividly bringing his subject matter to life. Filmed entirely in black and white, most of the visuals qualify this as a 'horror film mood piece' (lots of crashing waves, full moons and deserted church yards) while the anonymous, velvet voiced, narration comes across as well-researched and offers fascinating insights into lesser known parts of British history. The films more livelier moments offer up black masses and a nude man lead blindfolded by a priestess through a forest during which he endures tests based on the elements of fire and water. A tour of a present day witchcraft museum in Cornwall is also included, with exhibits including cauldrons, rams horns and the skeletal remains of the last witch to be executed in England. Over shots of doll effigies with pins in them the narrator repeats 'hate, hate, hate', contemplating a doll dressed in a nurse's uniform he deduces without any hint of humour 'someone who suffered in hospital wants revenge on their nurse' another doll suggests someone has a score to settle with 'the women's branch of the armed forces'. Legend of the Witches final segment delves into the subject of hypnotism and has intense young people staring into whirling spirals, not unlike the 'dreamachine' sequence in Antony Balch's Towers Open Fire, as naked women and men wearing goats head hover around in the background. A long, serene shot of the sea closes the film.<br><br>You presume the censor must have considered Legend of the Witches to have a degree of artistic credibility and serious documentary worth, in that they seem to have gone lightly on the all the prancing around in the nude and people doing rude things on altars. Compared to say their banning and censoring of Virgin Witch at around the same time. (Though they might have had second thoughts had they known Legend of the Witches would be hyped as having 'more exposed flesh and genitalia per square than virtually anything in the sex film genre'). Strangely for a 1970 release that played mostly in sex cinemas, Legend of the Witches is most notable for having lots of full frontal male nudity as well as scenes of naked men being put into rope bondage, certainly a notable difference to the 'dolly bird on the altar' images rampant in the periods' story horror films like Curse of the Crimson Altar and the aforementioned Virgin Witch. Saying that there is lots of material in Legend of the Witches that simply isn't sensationalist in the slightest, leaving you to ponder what an audience expecting cheap titillation would have made of being treated to what amounts to a history lesson, mostly told in filmed olde worlde illustrations, in the process. It's the cinematic equivalent of the kind of books cum glorified pamphlets sold in little village shops which perk the imagination of younger readers with their tales of ghosts, witches and local folklore.<br><br>For such an off-the-wall, experimental film flavoured curiosity Legend of the Witches has deceptively solid connections to Britain's exploitation film industry. Like many of Leigh's films it was enabled by the Fanceys, a family with a long history in the lower-rung of Britain's film industry. Patriarch E.J Fancey had distributed hundreds of horror and B-films in his four decade career, given Michael Winner some of his earliest breaks in showbiz and did jail time in the 1940s for stabbing his accountant in the groin. A real family affair Legend of the Witches was produced and distributed by E.J's common law wife Olive Negus-Fancey and edited by their daughter Judith Smith. E.J's son from his first marriage, Malcolm Fancey was Leigh's assistant director. A few years after making Legend of the Witches, Leigh embarked on his only narrative feature Games That Lovers Play starring Joanna Lumley, the New Temperance Seven and lots of drag queens. Again enabled by the Fanceys, Games That Lovers Play concerned feuding brothel madams in the 1920s. Sex scenes generally play second fiddle to exceptionally lavish sets and photography, evoking the Roaring Twenties in a manner larger budgeted films would have killed for. Many predicted big things for Leigh; instead for reasons unknown he completely dropped out of commercial film-making and returned to making documentaries; later work Pillars of Islam being about Ramadan and Manifestations of Shiva concerning Hinduism. The lasting impression you get from Leigh's work is of a talented and thoughtful filmmaker who displayed respect and open-mindedness towards his subjects, no matter how far removed from the norms of his background they may have been. Until recently unseen for over thirty years, Legend of the Witches stands the test of time as an uneasy, yet compelling handshake between occultists and exploitation filmmakers.","user":"gavcrimson","rank":[15,17]},{"title":"Interesting excuse for nubile full frontals. B&W.","rating":7,"date":"17 May 2006","review":"This was obviously made in an era when full frontal nudity in the cinema needed an excuse. \"Now what can we use to get some pubics past the censor? I know! Witchcraft!\", seems to be what the director thought.<br><br>A quick trip to Wardour Street to hire a camera, 50 quid for a roll of neg, and off to the local church for some background shots. \"Let's make a movie (even if we can only afford black and white). Yippee!\" Next off to Hampsted Heath with some cronies from the local pub (note to self: make sure the girls don't mind taking their knickers down; pity I forgot to tell the blokes not to try covering up their naughties as they all look like they are playing with themselves, when in fact they are trying to stop the camera seeing who is the \"best man\"!) I must say the rostrum camera-work isn't too bad and it's a pity that the database doesn't have the crew named.<br><br>The commentary sounds, and let's face it is, straight from the 1970's. You can imagine creeping into a dingy cinema full of the Dirty Mac brigade who are only sitting there to see the tits and bums.<br><br>From the above you will think that I am taking the urine, actually this film is quite interesting, well researched and deserves a play to a wider audience if only for the lack of coyness. But comments such as \"The women's branch of the armed forces is a source of images\" is well, rather odd to say the least! Although I can't imagine a real coven having so many long haired, firm breasted 20 year olds who all look like singer Mary Hopkin, accompanied by slightly balding 40 year old men trying to copulate with them. What happened to all the wizened, warty old hags? Perhaps they didn't go down the pub that night! In short, it's all a bit staged.","user":"philpot-2","rank":[20,26]},{"title":"Let it all hang out","rating":6,"date":"13 September 2016","review":"The later part of the 1960s was a watershed in terms of censorship.The power of the Lord Chamberlain to censor the stage was abolished.Shortly after that the all nude revue Oh Calcutta was staged.At about the same time there was a furore about the showing of a females pubic hair.The film was shown uncut at the NFT.The censor,John Trevelyan wanted to keep in step with public tastes,so full frontal nudity was allowed.So all of a sudden producers were allowed to show everything,though there were and still are things they couldn't show.So give the audience a large dose of education and you could put in a reasonable amount of nudity.So that is clearly what happened here.It is actually quite entertaining.I think that the sonorous narration was by Valentine Dyall.Somehow I doubt that this was ever shown in any of the major circuits cinemas.","user":"malcolmgsw","rank":[5,5]}]