[{"title":"A hilarious movie","rating":8,"date":"17 January 2006","review":"As a teenage girl, and a fan of the first movie, I found the sequel to Cheaper by the Dozen to be above my expectations. Usually, movie sequels are a disappointment, I have found, as was with Shrek 2, for example, but I found that Cheaper by the Dozen 2 was hilarious and a really good movie outlining the importance of family and family values. Yes, it was slightly predictable, as these movies often are, but I found that was strongly over-ridden by the comedy and 'slap-stick' that happened throughout the film to make it so entertaining. All the family had matured since that first film and it was interesting to see what the children had grown up to be like, and how much they had changed since the first film. I recommend this movie to fans of the first film, or anyone who just wants to see a light-hearted, 'feel-good' and all-over great movie.","user":"little_miss_dolphin8","rank":[27,38]},{"title":"A family comedy series that really stands out","rating":24,"date":"24 December 2005","review":"Cheaper by the Dozen II, like most sequels, wasn't as good as its predecessor but was a safe movie bet, allowing you to fall back into a familiarity of the first and have some more fun with it. It picks up a couple years after the first installment with changes abound as the oldest daughter is now married and pregnant and with everyone growing up, the Bakers plan to vacation one last time at their old summer nesting grounds before sending off newly graduated Lurraine (Hillary Duff) to New York. Ashton Kutcher's out of the picture, while Eugene Levy enters the scene as Steve Martin's rival, providing some decent comic relief. Knowing full-well, they can't focus on all twelve kids, Tom Welling's newfound romance and rebelliousness are underdeveloped, while the unfortunate mistake is made of shifting the focus to Hillary Duff's character. Duff basically plays a caricature of herself (or at least her public image) as a teenage diva, who only worked in the first movie because she was distilled in small doses. There's also a side story with one of the younger siblings having her first crush. Like the first film, this installment relies on Martin's physical comedy for laughs with some very relatable moments along the way and in the end, the family wins out over all other forces.","user":"Okonh0wp","rank":[47,75]},{"title":"\"Honey you actually bought that shirt?\"","rating":4,"date":"2 January 2006","review":"I never saw Cheaper by the Dozen (the 2003 surprise hit), and I don't think you have to see it so get all you can out of the sequel. That is to say, there is little to get out of it, so don't waste your time \"preparing\" for it. Cheaper by the Dozen 2 is a formulaic family comedy where Steve Martin becomes a father possessed with a drive to outdo another father, only to be reminded that his family will still love him no matter if they win the big movie-contrived competition or not. Tom Baker (Steve Martin) and his wife, Kate (Bonnie Hunt) begin the movie by attending their daughter's graduation ceremony with his 11 other kids. Lorraine's graduation (Hilary Duff, no singing this time) motivates Tom to start thinking about how the family is moving apart from the customary tight-knit group he remembers, so he wants to take the family on one last vacation. So they load up the cars and vans and head out to some lake somewhere in the Midwest (or Canada, depending on the film's budget), a lake that has seen the evil Jimmy Murtaugh (Eugene Levy) buy up all of the land and build super lake homes on the shore. Jimmy and Tom have a history, one that is sort of dumb and is one of those back stories that can only be written for a story like this one. I really like Eugene Levy as a comedic actor, but I don't think he was right for this role. Levy excels in understated humor, where his character has no idea he's being funny. The role of Jimmy is over-the-top and cliché and I didn't think he fit the role well at all. Carmen Electra plays Jimmy's wife, and she's actually very good at playing the bimbo wife when given the chance, and the kid actors are generally good as well. The story is predictable and only mildly entertaining, but I guess families will enjoy the night out and there is a certain sweet charm to the final scenes of the film.","user":"ryan_kuhn","rank":[29,45]}]