[{"title":"Predictable but enjoyable","rating":8,"date":"26 April 2010","review":"I think people are being too hard on this movie. It's a big shiny explosions movie, with nothing especially new plot wise, to be sure, but who goes to action movies for plot? Not me! Clever repartee, good looking men (Saldana is hot, yes, but I'm female so ... Evans and Morgan, I'm lookin' at you), a villain landing somewhere between James Bond and Austin Powers, helicopter stunts, big guns, and big explosions. Good times.<br><br>Some great locations, good editing (also nice marriage of comic book style to live action style in the credits),decent soundtrack.<br><br>The Losers doesn't take itself too seriously, and neither should you.","user":"TechNoire","rank":[171,232]},{"title":"Mindless fun!","rating":7,"date":"13 July 2010","review":"The Losers are a 5 man team. They get screwed over, and then they go against their agency. So predictable. But it is a really fun movie to watch. The acting was really good, but I thought that some characters could have had a bigger role, like Cougar for example. All characters are believable, likable. There is some really good, but also bad sound and visual effects. The sounds of the guns did not seem very realistic to me, but the visual effects were absolutely amazing. The story is too predictable. the acting by some of the cast were plain right bad, like the guy that plays Max.<br><br>Keep this one for a rainy Saturday!","user":"mr_lazz","rank":[15,17]},{"title":"Underrated gem of non-pretentious intelligent fun","rating":8,"date":"4 September 2014","review":"Will someone please put Jeffrey Dean Morgan in more intelligent dark humor action leads? He is just amazing as a charming rogue leader of the marry band, and Chris Evans is an unexpected comic relief with nuanced performance and expansive range of acting. <br><br>Interesting take on comic book based action flick. It never looses a momentum or pace, it's through and through fun, but if you pay a bit of attention, you will see darker undercurrents and rather deep connotations. Well directed, well paced and entertaining all the way through.<br><br>There is no pretense here, but that's why the depth of characters and the story comes through in those shining moments. This would be action flick for cool guys and thinking girls.","user":"mairire","rank":[37,47]}]