[{"title":"~One of the Best Trilogies of All Time~","rating":10,"date":"27 May 2010","review":"I attended a special screening for Toy Story 3. I went in with HIGH expectations. I LOVED the first two Toy Stories movies. Toy Story is a beloved franchise that almost everyone that I know loves the first two films. Now how about the 3rd film? Well all I could say is that it lived up to my unbelievably HIGH expectations and then some. This is such a good film. It has the laughs, magic and best of all the entertainment. The new characters in the movie feel like they were in the previous two films, they were that engaging and really worked well in the movie. The best part of the movie has to be the ending, I almost cried and was moved to just about to tears. I truly believe that this is one of the best Trilogies of all time. It might even rival the Lord of the Rings Trilogy.<br><br>This movie has a real chance to become the First Animated Film to win Best Picture. I surely would not be surprised.<br><br>10/10 An Amazing End to a Fantastic Series Go Watch It","user":"The_Fifth_Echo","rank":[977,1]},{"title":"Best animated movies ever made","rating":10,"date":"15 February 2020","review":"Toy Story 3 in my opinion is by far the best of the trilogy! It is the most emotionally investing out of all the Toy Story installments and is an outstanding entry to the Pixar library!","user":"MR_Heraclius","rank":[38,39]},{"title":"An amazing third \"Story\"","rating":10,"date":"4 November 2010","review":"Lee Unkrinch directed \"Toy Story 3,\" the third and presumably final installment in the \"Toy Story\" movie franchise. One could argue that this is probably the best one yet (1999's \"Toy Story 2\" remains my personal favorite of the three), and I won't argue with those who think otherwise. I still hold onto \"Toy Story 2\" for deep personal reasons, but \"Toy Story 3\" does build upon events foreshadowed in the previous installment, which does gives this film a weighty emotional punch - a rarity in animated films these days.<br><br>As foreshadowed in \"Toy Story 2,\" Andy (John Morris) has finally grown up; he's 17 now, and is on his way to college in just a few days. His mom is putting pressure on him to get rid of his old toys, either by throwing them out with the garbage, donating them to other needy children, or simply putting them in the attic (a sort of gone-but-not-forgotten-and-within-reach-type of deal).<br><br>Woody (Tom Hanks), brave leader of the toys and Andy's favorite, manages to dodge a bullet somewhat, but puts himself in the line of fire when Buzz Lightyear (Tim Allen) and the other toys are accidentally thrown out but somehow or another wind up at Sunnyside Daycare, where they are welcomed with open arms by the resident toys there. This introduces us to Lotso (Ned Beatty), the strawberry-scented teddy bear who runs the place, along with the metro-sexual Ken doll (Michael Keaton) and others. As it turns out, this daycare center is actually a prison, and Lotso runs this place with an iron fist; of course, Lotso has a very tragic back-story that explains his evil ways, much like with Jessie (Joan Cusack), who first appeared in \"Toy Story 2.\" So Woody and the other toys must mount a valiant escape if they are to be reunited with their beloved owner before he leaves for college.<br><br>\"Toy Story 3\" is an amazing film, and a fitting end to a wonderful film series that started in 1995 with the first \"Toy Story,\" which also signaled the arrival of the very illustrious and extremely talented Disney-owned animation studio Pixar. They have yet another significant hit on their hands with this picture. The animation here is at its most life-like and real and it's damn-near flawless and strikingly beautiful, which signals just how far Pixar has come in the 15 years since their first hit with \"Toy Story.\" And every film since then has added significant amounts of realism, weight, and dimension to their animated stories.<br><br>While \"Toy Story 2\" had a high nostalgia factor for days long gone by, \"Toy Story 3\" is a film about the inevitability of children growing up and putting away their toys. There are also themes about the effect of loss, love, and friendship going in the proceedings here. In addition, \"Toy Story 3\" can also be an incredibly dark film at times - a bold move considering that this is a family film - but there's no need to worry because the fact is that it's all perfectly balanced out amazingly well with some very light-hearted humor, fast and furious action scenes, and stirring emotional moments that just might bring a few tears to your eyes.<br><br>\"Toy Story 3\" is a triumph of animation and imagination, and I say that as a die-hard \"Toy Story 2\" fan. What we get here, is a fitting closer (?) to an amazing film series that just continues to surprise again and again with each new entry. It's just a great reminder for all of us heartless adults of better days in our youth that have long gone bye-bye.<br><br>10/10","user":"dee.reid","rank":[44,46]}]