[{"title":"A \"G\" rated movie wrapped up as a \"R\"","rating":14,"date":"14 January 2005","review":"This movie has a plot line and story written for 10-14 year olds. Its perfect for them, and it could be a great family movie. Unfortunately the language is adult for no reason at all, and sporadically at best. There's no sex, and one scene of a very phony looking joint that was hardly needed to the story. They should have edited out the \"R\" parts and advertised it as a family movie. Its oriented that way.<br><br>Most of the actors were competent, no one really shined. You have trouble believing the 20yr old \"foxy\" reverend, but it's a nice twist. The soundtrack is pretty bland, as is the lip-syncing at the end of the movie. Its a movie with no market, too tame and sterilized for adults, but too adult for kids.","user":"thesociety","rank":[16,20]},{"title":"More hugs, less drugs","rating":2,"date":"2 February 2005","review":"This film's main strong point is that it shows a positive side of the 'urban' film. Rather than dwelling on a lifestyle of poverty, desperation and death it touches on themes of family and community. The colorful characters that populate Gas bond deeper through external and internal adversity to achieve a certain harmony that as a viewer make you want to be a part of. I enjoyed the celebration of life in Gas rather than death in many urban films about drugs and violence.<br><br>The storyline of the two brothers at odds is a staple of cinematic culture. This was the strongest point of the film. I especially liked how the uptight, smarter brother realized he was being judgmental of his younger sibling and found a way to help shine light in a way to help him achieve his dreams.","user":"nkdcain","rank":[3,3]},{"title":"What the other guy said +","rating":30,"date":"30 January 2005","review":"This is in the top 5, maybe top 3, worst movies I've ever seen.<br><br>It seems to have been a sad attempt at fulfilling or trying to reenact the market's past results with black (and multi-culturally social) 'comedies'...<br><br>I'm awful glad I never paid anything to see this.<br><br>To all the people who may have spent money on \"Gas\", to witness the official truth: that we live in an over-increasingly crap comedy era, run by heartless, unoriginal, networked individuals: I'm sorry...<br><br>I would have rather not watched this...<br><br>Don't take that wrong...","user":"scienott","rank":[4,7]}]