[{"title":"Outsourcing the dirty work","rating":7,"date":"3 January 2008","review":"Calvin Dexter, a lawyer, is a man whose life has been marked by tragedy. When his only daughter is killed by a greasy boyfriend, he leaps into action. Cal doesn't wait for justice, he deals with the injustices committed against him. He is a Viet Nam veteran, part of a special force, that were trained for risky missions. As such, he has had the experience to deal with whatever comes his way.<br><br>When Senator Stephen Edwards asks him to look into the disappearance of his son in Bosnia, where the young man has gone on a humanitarian mission, he finds that the man who was responsible for what happened to the boy is no other than the evil Zoran Zilic, a sanguinary man, responsible for much of the atrocities during the war in that part of the world.<br><br>Cal decides to track down this paid assassin, but little does he know our own government is involved in the usage and protection of this scum bag, now hiding in South Africa. CIA director, Paul Devereaux, upon knowing how Dexter has found out about the war criminal, sends his henchman Frank McBride to eliminate Cal Dexter for him. Little does this corrupt government official realize the former Viet Nam veteran is ahead of all the evil forces and how he will avenge the murdered youth.<br><br>The film, which was made for television, is based on a Frederick Forsyth novel. Director Robert Markowitz, working on the screen treatment by Alan Sharp delivers a taut action movie. This is by no means an original story, as we have seen before how corrupt public servants can be behind vile acts of violence in the name of democracy.<br><br>\"Avenger\" was tailor-made for Sam Elliott. His Cal Dexter shows this actor at his best. We have always thought Mr. Elliott was a great character actor that could have been given more opportunities in which to shine. This film seems to prove he can deliver. James Cromwell plays the heartless director of the CIA with verve. Timothy Hutton is seen as the gofer for the head of the spy agency. David Hyman appears as Zilic.<br><br>This television movie is action filled for fans of this movie genre.","user":"jotix100","rank":[12,14]},{"title":"This was a TV movie? can't be - it was too good!","rating":9,"date":"10 April 2006","review":"I happened to surf past this last night, and I have to say it surprised me. I was a big Frederick Forsythe novel fan years ago, and I did not realize this was based on one of his books until the credits rolled.<br><br>I missed the first half-hour (I'll watch it again sometime), but I was still able to enjoy every minute after that. I typically think about TV movies as being on a different scale - but this movie breaks the mold.<br><br>If you enjoyed \"Day of the Jackal\" (the original) you'll really like this one too. The main character \"Dexter\" had just the right mix of \"good guy, bad guy\" and the cinematography of the locations/background made me feel like I was on the mission with him. Heck, even my wife liked it!","user":"bostonkevino","rank":[19,29]},{"title":"jackal it ain't...fading of former glory","rating":2,"date":"20 April 2006","review":"I am actually not surprised that some people liked this movie, it's the same thing with the junk food, the more you eat it, the more you want it. The same principle applies here, and there will be some happy customers at the end. So, if you like generic, mindless movies, where unbelievable characters do unbelievable things, you'll like this movie. The premise of the movie is something that was recycled many times over. Forsyth is considered to be one of the most popular authors. However, being popular does not make you a good writer. Even in the 'Jackal', his much acclaimed book, the characters of the OAS are portrayed in a flat, one dimensional manner (you keep wandering why there are people who are willing to sacrifice themselves for a such a cause), but this was (mercifully) not the focal point of that story, and it did not stick out that much. (&gt;&gt;&gt;This part may contain spoilers&lt;&lt;&lt;) The 'Avenger', on the other hand, is focused on such a premise, and we learn very little about the main character and nothing about the main villain, or his fight, except that he is a psychopathic killer (together with his fellow Serbs, a fact speaking how much generic the script is). Forsyth uses the stereotypes left and right, to the point that there is no single original part in his story - first, you have a strong silent hero, who actually might be a hidden psychopath himself (considering his Vietnam past), played by Sam Elliott. Sam Elliott is a lovable actor, a perfect cowboy, but here he does not belong (least because he is over 60 and walks like he needs a hip replacement). His daughter is killed by a foreigner, who happens to be a Panamanian serial killer (because Americans are not capable of such crimes, or because we would relate in an unexpected way to an American serial killer? - no, in Forsyth's lack of imagination, this was a way to show a man beyond the reach of justice). Sam is out to avenge a man killed in Bosnia together with his girlfriend by psycho-killer Serbs (incidentally, there were also six children killed during the same incident, because this is how many children Serbs need to kill in order to be hated?). The girlfriend happens to share the last name with the former president of Croatia, showing the depth of the source of Forsyth's information (\"the research\", says Forsyth, 'there I was one day sitting in my living room, drinking tea and reading the newspapers, and bam!, there it was, in front of me, my new book!'). The plot never thickens, and the sequence of predictable events follows. The directing is mediocre and did not help in improving the experience (one of the most annoying things were the flashbacks with a 'whoooosh' sound). The action scenes are done without much thought or skill (first fight with the guard who actually ambushes the main character would be, in normal life, the end of the story). In all honesty, there are some bright moments - the CIA director, portrayed by James Cromwell was one of them. If somebody told me that he is, indeed, a CIA director, I might believe. He became an archetypal chief of a governmental institution and he is good at it. Timothy Hutton repeats his role from the 'Nero Wolfe Mystery', but with the sinister twist - that is, he twists arms here. Not enough for me to like the move, or even get close to it. On a good day, I would give it 3/10. But this is not my good day, and Mr.Smith gives it 2/10...","user":"pavor nocturnus","rank":[27,46]}]