[{"title":"Mourning Becomes Elizabeth","rating":9,"date":"16 September 2007","review":"A moment that may have felt like surrender to Elizabeth II is the most moving and powerful moment in a film filled with moving and powerful moments. Helen Mirren works a miracle with her characterization. When the Queen is forced by circumstances to address her people and mourn in public Diana's death, Helen Mirren doesn't forget that her character is a seasoned public speaker but not an actress. When she delivers her speech to her subjects, the real strength is in her commitment to her duty and not the meaning of her words. It is a chilling, masterful acting stroke. Stephen Frears uses the brilliantly structured script to reveal something that's always being in front of our eyes but we've never seen. The privacy of the most public people in the world. Michael Sheen is terrific as Blair and every piece of casting is truly inspired but it's Helen Mirren's film, oh yeah, one hundred per cent.","user":"littlemartinarocena","rank":[137,151]},{"title":"Helen The Great","rating":9,"date":"10 September 2006","review":"Let's start by saying that the film itself is a perfect reflection of the days we live in. A deep human drama with a tabloid sensibility. A tradition that's lasted over a thousand years shaken by a world who demands public spectacle. Humbleness or humiliation? Asks Queen Elizabeth to her Prime Minister. Talk Show audiences wouldn't know the difference and we are all, one way or another, talk show audiences. From Jerry Springer to Oprah Winfrey. How did it really feel like? We all want to know, we all want to see the sorrow, the confession or the denial on the catch of the day's face. Michael Sheen is a adorable, yes I think adorable is the right word, as Tony Blair, the labor link between the people and the monarchy. Helen McCrory as Mrs Blair is another standout. Just look at her walking backwards trying to to be true to royal protocol. I had to adjust to the fact that the Queen Mother was played by Sylvia Syms. Sylvia Syms! Queen Mom, a wonderful old battleship who's seen it all and fought her entire life for things to change so they could stay the same. It is however Helen Mirren, in a performance that could only be described as miraculous, that takes us body and soul through the painful ordeal of those seven days surrounding the death of Princess Diana, the \"people's princess\" a natural master in a world of tabloids and self humiliation disguised as humbleness. Helen Mirren gives us more than a glimpse into the hermetic heart of a living queen. Not a single false note, not a single cheap shot. A performance that is as poignant as it is entertaining. I was as besotted with Helen's Queen as her Labor Prime Minister was. I can't wait to meet her again.","user":"marcosaguado","rank":[394,454]},{"title":"An Acting God As A Royal Queen","rating":9,"date":"10 December 2007","review":"It was Meryl Streep no less to call Helen Mirren \"an acting God\" and she wasn't kidding. I saw \"The Queen\" again last night, a year after the hype, the awards and the masses of superlatives thrown Helen Mirren's way and you know what? It was all richly deserved. Her performance got an extra something along the year and I believe it will continue to grow like most wonderful true things. Helen Mirren is not an actress who \"dissappears\" behind a character , no, she is in total control and that's what makes her creation so moving. The illusion is fueled by her own conviction - the character's as well as the actress's. Last night I wondered, during the Queen and her Prime Minister's walk, how did the real Elizabeth II reacted to this portrait. I'm sure she's seen it and I'm sure that she must agree that nobody could have done it better or more fairly.","user":"arichmondfwc","rank":[108,121]}]