[{"title":"It's the politically incorrect version of \"Crash\".","rating":10,"date":"20 December 2006","review":"This movie makes most people uncomfortable. It's not an easy movie to watch. Its like watching a gruesome accident but not being able to stop. Edmond is a middle age man going through a crisis. His life is meaningless and boring but he is content to plod along until a series of chance encounters leads him to the decision that he must leave his life, including his wife behind. Having hidden his true nature all of his life, he suddenly releases his pent up frustrations and in doing so, takes himself down a path, not of redemption but one of degradation. He is searching for something or someone to fill a void in his life and with his new purpose of self, he becomes in fact dangerous. The transformation of Edmond from mild mannered and dutiful citizen to an angry, rebellious zealot is fascinating. I immediately went out to buy this movie after purchasing it from Redbox. I am not surprised that this movie was never released widespread. It would surely have caused a huge ruckus in our politically correct society. I know I am being vague. But if you want to watch a movie that is totally different from the standard fare, then see this movie. The big surprise at the end is the actor Bokine Woodbine, who plays a significant but very small role, that puts a fitting end to this thoroughly entertaining, disturbing and engrossing movie. William H. Macy, is superb, and who knew that he actually has a great body for a man his age.","user":"shaaronie","rank":[82,94]},{"title":"a hardboiled, sharp-edged, loud-mouthed catharsis","rating":8,"date":"21 December 2005","review":"Edmond<br><br>reviewed by Sam Osborn <br><br>rating: 3.5 out of 4 <br><br>Edmond is a hardboiled, sharp-edged, loud-mouthed catharsis. Pure, unabashed emotion spilled onto the screen. It's daring, provocative, and beautifully offensive. It's as if screenwriter David Mamet vomited the words onto the pages, expulsing them from his heart and guts in a gushing release.<br><br>Many wonder why Mamet himself, being a highly respected rated-R filmmaker, didn't direct his own work. Edmond's director, Stuart Gordon, stated that it was because the film would probably strike too close to home for him. Mamet wrote the screenplay immediately after breaking up with his wife in New York City. The actions seen in Edmond are clearly the manifestations of the rush of emotions he felt at that time in his life. But as all skilled writers do, he expands the personal experience into a universal experience. The extreme feelings he releases are felt by every member of the audience open-minded enough to see past their vulgarity. Many people deal with the same controversial thoughts as Edmond does (racism, bigotry, homophobia, chauvinism), but are too timid to voice them. Like Chuck Palaniuk's Fight Club, Edmond explores a kind of masculine catharsis. And like Travis Bickle from Taxi Driver, his repression eventually leads to explosive violence.<br><br>The film begins with Edmond Burke's (William H. Macy) split with his wife. Getting up from bed he announces he's leaving. Not just for the night, but for good. At first not taking the news seriously, Edmond's wife plays along as if it was a joke. But Edmond insists that, yes, he's really leaving her for good. Exploding, his wife bounces around the room in a shocked rage, announcing that, no, he's not leaving her, but she's leaving him. And he's not welcome to come home. Of course, that's fine with Edmond because, in his words, he's been bored with his wife for a few years now.<br><br>He then begins his night on the streets of New York City, first meeting with a man at a bar (Joe Mantegna), who essentially has the lifestyle Edmond's looking to lead: something with girls, power, and money, and he supposes that's all. And so upon leaving the bar, Edmond sets out to settle the first part of his new life: girls. Prowling the night clubs, strip joints, and \"masseuse\" parlors, Edmond takes a businessman's approach to it, negotiating each financial commitment to the women.<br><br>From there, it'd be unfair to reveal Edmond's moves. It's too little to call it a downward spiral, a description that reminds me of something you'd see on the Lifetime Channel. No, Edmond's night leads to much larger happenings; some problematic and some eye-opening. But with each step he takes, there's a twinkle of imagination going off in the back of our minds saying, \"do you think the film will actually make him do that?\" And unlike other films that, no, wouldn't take their character that far into oblivion, Stuart Gordon seems to have no problem doing so. Each step is exponentially farther than the last, leading somewhere that we initially don't expect, but later realize to be entirely right and satisfying.<br><br>Along with the screenplay and directing, some incredibly daring acting work is featured in Edmond. William H. Macy, as we've come to expect, steals the show. Instead of relying solely on his sad-dog face he's so irritatingly known for, Macy takes this performance through a dizzying range of emotions. Julia Stiles makes an appearance in one of the finest and most shocking performances in the film. Also, Joe Mantegna as the man in the bar does well as the pivotal spark to Edmond's catharsis. Every actor actually deserves mention for daring to work on this highly controversial film. That also goes for the producers. Stuart Gordon said before the screening that \"one of the biggest laughs in the film is when the credit for all the production companies comes up.\" The list is so long it really does evoke laughter.","user":"samseescinema","rank":[35,41]},{"title":"The story of one man's journey into the emptiness of his own soul","rating":8,"date":"24 July 2006","review":"At first glance, horror meister Stuart Gordon would not seem the obvious choice to direct an emotional psycho-drama cinematic rendering of a David Mamet play, yet with Edmond, he displays a deft touch for the material and allows the actors to carry the day.<br><br>Originally penned as a stage play, Edmond tells the story of namesake Edmond Burke (William H. Macy), a mundane white collar worker who has spent his entire life being a faceless cog in the big industrial machine. The rescheduling of a business appointment to 1:15 (a number which re-occurs in the film) propels him to idle away his time with a visit to a tarot reader who tells him he's not where he's supposed to be. From there he begins a slow spiral into depravity and insanity that begins with telling his wife he's leaving her and progresses to an outback-like dreamwalk into New York City's seedy underbelly of bars pimps and prostitutes.<br><br>Written in the wake of a divorce, Mamet infuses the script with racial discourse and epithets that are stunning in their caustic vulgarity as Edmond pours out years of pent up hatred on one of his muggers revealing a window into his shallow soul that only becomes more intensely evident as the movie reaches its conclusion.<br><br>In the scene where Edmond tells his wife their marriage is over, he explains to her that she hasn't satisfied him spiritually or emotionally for quite some time. Yet, after watching his progression trough the course of the story, it becomes clear that spiritually he has no soul, and emotionally he's a shallow but volatile cauldron of disjointed thoughts.<br><br>The film is a tour-de-force for Macy, who is in every scene and morphs from a character of Caspar Milquetoast proportions to unhinged bigoted psychopath and back again by the movie's end. Along the way he's complimented by solid performances from Joe Mantegna, Julia Stiles, Mena Suvari and Bokeem Woodbine. As if in a wink and nudge to his own work, Gordon even manages to insinuate longtime stalwart Jeffrey Combs into a small but telling scene during Edmond's descent into insanity.<br><br>By the time Edmond arrives at the end of that journey, however; at that place where he ought to be; I couldn't help but think he had merely wasted his life catching up to where his soul was long ago.","user":"Craig_McPherson","rank":[62,76]}]