[{"title":"Best kids movie ever.","rating":7,"date":"29 February 2020","review":"Puss In Boots may be a little cliche and the twist may not make a whole lot of sense, but that doesn't mean that this movie isn't entertaining, action packed and funny.","user":"MR_Heraclius","rank":[39,42]},{"title":"We must all prepare for Puss! In Boots!","rating":7,"date":"14 November 2011","review":"When I first rented Shrek a few years ago, I have to admit that I was a little disappointed, not that it wasn't a good movie, I just didn't think it was as big a deal as people were making it out to be. But I had also rented the second one and I couldn't stop laughing, one of the main reasons was the character Puss in Boots. A popular character in fairy tales, I loved their spin on him and with Antonio Banderas's voice, you just couldn't go wrong. However, Shrek 3 and 4 didn't hold up so well when they continued the stories. Even Puss seemed to be lacking interest. So naturally I was really nervous when I found out they were making a spin off with him as the star, Hollywood needs money and Puss would pull it in for them. Well I saw the movie today and I can honestly say that if Hollywood just wanted my money, I'm glad to hand it over because Puss in Boots is a very cute movie.<br><br>Puss learns that two murderous outlaws, Jack and Jill have the magic beans he's been looking for half his life, which lead to a giant's castle holding valuable golden goose eggs. Puss then meets his old childhood friend Humpty Dumpty, who introduces another cat as Kitty Softpaws, one of the best cat thieves in the world. They ask him to join them in finding the beans, planting them, and getting the golden eggs which lie at the top. Puss refuses to work with Humpty due to a past betrayal that left him falsely accused for robbery, alienating him from his hometown and adoptive mother. After Humpty explains to Puss that he wants a second chance, Puss agrees to help him obtain the beans, making it clear that he is doing it for the town and his mother and to win back the respect he once had.<br><br>I always loved Puss in Boots, but I didn't know that he could actually carry a movie. I wished he used his \"cute look\" more often, but I have to admit for the one they use during his jail scene was more than worth the wait and was way too funny. Kitty Softpaws was very nicely voiced by Selma, her character was a lot of fun and for an animated movie had great chemistry with Puss. Humpty Dumpty was the only character that wasn't that interesting to me, though his story was pretty good and I liked the bond that he and Puss shared. The animation was still great as usual, seeing it in 3D added the dimension and looked very nice, though the 3D is really not needed for this one.<br><br>The story worked very well and I'm glad that Puss turned into a strong lead character. Even if the story is predictable, I love seeing the hero rise tale, it's always so uplifting. I think it's a great movie for the kids and adults. It doesn't insult the kid's intelligence by making the movie too cute and there are jokes that even the adults could get into like how Puss is more a lover than a fighter. Though I thought it was kind of odd when he winked at a human lady, bestiality? Moving on, I really did enjoy Puss in Boots, I would recommend it and cannot wait to buy it when it comes out. This was exactly what the Shrek series needed to give it some life and I hope there is a sequel. Hollywood may be greedy at times, but at least with this film they got it right in giving us a great story with the most ferocious smooth talking cat on the planet.<br><br>7/10","user":"Smells_Like_Cheese","rank":[67,76]},{"title":"Fun Movie for Kids and Adults","rating":9,"date":"29 October 2011","review":"Puss in Boots was what I expected - interesting characters, some great laughs (including the Shrek-like humor for adults only), and an interesting backstory. Unfortunately, no cameos from major Shrek characters (I always get a kick out of Gingy).<br><br>Antonio Banderas does a great job voicing the \"hero\" Puss, and the movie provides Puss' history with some good laughs and great images. The big eyes look of the adult Puss is topped by the young Puss, and we learn how Puss received his name and his boots.<br><br>Humpty Dumpty is Puss' long-time friend, who becomes jealous of the young hero Puss and betrays him. But, Humpty Dumpty returns with a plan to achieve their lifelong goal - get the goose that lays the golden eggs. Humpty Dumpty has some funny lines and great visual humor. My favorite was Humpty wearing a golden egg costume.<br><br>Joining the adventure and rounding out the trio is Kitty Soft Paws, who transitions from Puss' nemesis to love interest. The pair has some great chemistry for animated characters. Their adventures include run-ins with Jack &amp; Jill (not what anyone will expect), magic beans, the beanstalk, and the goose that lays the golden egg.<br><br>Overall, kids and adults will love the movie for its humor, cute characters, and action. Puss in Boots is a worthy spin-off of Shrek. And, the movie has a great message about learning from our mistakes, retribution, and making good choices.","user":"CaptMTS","rank":[69,85]}]