[{"title":"Willy Beachum: \"I'm not going to play any games with you.\" Ted Crawford: \"I'm afraid you have to old sport.\"","rating":7,"date":"27 April 2007","review":"\"Fracture\" (2007) is directed by Gregory Hoblit who has also made \"Frequency\" (2000), \"Fallen\" (1998) both of which I like and \"Primal Fear\" (1996) - his feature debut that I love.<br><br>Crime /Thriller/Mystery /Court Drama are among my favorite genres and as long as the combination of these genres is clever, gripping, atmospheric, well acted, keeps me guessing and entertains me, I am happy. I know that many viewers were very insightful and figured out the twists and the ending within first half of hour or so but I did not and I was impressed by the way the disappearance of the crucial evidence had been handled - very clever. Besides being an entertaining crime movie, the most interesting element of \"Fracture\" is a struggle of wills and intellects between two main characters, self-made inventor - millionaire Ted Crawford (Anthony Hopkins) who shot his unfaithful wife in the face and put her in a coma and young, successful and smart assistant D.A. Willy Beachum (Ryan Gosling), who has a 97% conviction rate and is assigned to prosecute Crawford just when he is ready to accept a lucrative offer from the prestigious LA law firm. The game of cat and mouse that highly intelligent and malevolent Crawford plays with Beachum makes the film interesting and the scenes between Hopkins (in his \"playful Dr. Lector\" mode) and Gosling (whose character does change as he realizes what he is dealing with from the unsympathetic self-centered hot shot to the man who becomes obsessed by the case, vows to put the murderer behind the bars and makes it his priority) - riveting and joy to watch. I also would like to mention David Strathairn as Willy's boss, DA Joe Lobuto in yet another understated effective performance. Strathairn's Lobuto is so interesting that he could be a main character in another move. \"Fracture\" is not perfect. For example, Willy's affair with Nikki Gardner (Rosamund Pike), a beautiful lawyer and his perspective boss was lifeless - they did not have any chemistry together. I think that Nikki's purpose in the movie was to introduce Willy to her father, a judge, whose help he would desperately need in one of the later scenes. I'd rather prefer more scenes between Willy and Crawford but even the way it was, the movie kept my attention all the way through and despite the rather weak ending, I found \"Fracture\" quite good.","user":"Galina_movie_fan","rank":[167,203]},{"title":"Will keep you glued to your seat","rating":18,"date":"18 May 2007","review":"The tagline of this film sounds interesting, but also shows the movie's thin plot. 'I shot my wife. Prove it.' Ultimately, the film is smart and witty and keeps you intrigued the entire time as you try find a way to do what the tagline asks you to. However, that's it. Naturally, Anthony Hopkins can do now wrong and 'newbie' Ryan Gosling does really well. Together in a scene, these two are awesome. <br><br>What I like about this film is that it totally focuses on the Hopkins/Gosling story-line. In many other films like these there's always that the policemen/attorneys (in this case Gosling) fall in love and then mess it up/ruin their marriage because the case is tearing them apart, you know the drill. There's always some sub story-line involving romance. Gosling finds romance in this movie with Rosamund Pike's character, but it doesn't evolve into another story-line. It doesn't take Willy Beachum's (Ryan Gosling) eyes off the price and even when it falls apart, he doesn't appear to care much (it's all about getting Crawford behind bars) or to feel a need to make it right. I like that. I mean, I love romance in films, but this movie shouldn't be about that and it's not. <br><br>Also, the fact that Ted Crawford (Hopkins) is in complete control over everything and everyone in this film astonishes me. This man plays roles like these so well! He just keeps you glued to the screen. The way he is in charge of Willy for (almost!) the entire film is just enjoyable to watch, making the end of the film even more enjoyable when the story comes out and the roles change. <br><br>Another reason to praise Gosling for the way he portrayed Willy Beachum. Anthony Hopkins is a legend. He is what draws people to theatres and he is one of the most brilliant actors of all times. Plus, he portrays such a strong character here that I can't help but praise Gosling for holding his own in a very strong manner. Scenes with Gosling are entertaining to watch. You feel drawn to him in almost the same way you feel drawn to Hopkins, even though Willy is in a dark place for most of the film and is hardly in control. Gosling's got great timing.<br><br>The story-line might be a little thin and fragile, the outcome is worth it. The movie surprises in more than one way, not in the last place because of the pretty much brilliant performances of both actors. Gosling is going to be big. <br><br>8/10","user":"sdj88","rank":[145,179]},{"title":"Playing Games With The System","rating":9,"date":"9 December 2007","review":"Very elaborate and detailed production design contributes a sense of authenticity to this story, set in Los Angeles, about a highly intelligent and wealthy older man named Ted Crawford (Anthony Hopkins) who kills his unfaithful wife. He then dares the criminal justice system, in the person of assistant district attorney Willy Beachum (Ryan Gosling), to convict him. That Crawford likes playing games with the system quickly becomes apparent, and is the force that propels the plot forward.<br><br>The story has some believability issues. I question how Crawford can know all that he knows, with such certainty. There are also some problems toward the film's end that involve hospital protocol. And the overall plot progression depends on various contrivances that include, but are not limited to, police procedures. The entire concept borders on implausibility. But, if you don't pay too much attention to these annoying little details, the plot does roll merrily along with some good drama and suspense.<br><br>Anthony Hopkins is well cast as Crawford, and gives a predictably adroit performance. I would not have cast Ryan Gosling, with his boyish looks, as an assistant DA. Nevertheless, Gosling's performance is both lively and credible. And it's the back and forth verbal sparring between these two that make \"Fracture\" so entertaining.<br><br>The film's color cinematography is very good, and includes some unusual camera angles. I also liked the use of a wide-angle lens in the courtroom scenes. And sound effects, so often ignored in many films, further add to the realism of the settings.<br><br>Dialogue is generally effective, and includes some witty lines. When Willy's boss talks with him about being taken off the case, Willy responds: \"Even if I find new evidence?\" To which his boss retorts: \"From where, the evidence store?\"<br><br>Despite a seriously flawed script, \"Fracture\" is a highly absorbing movie, thanks largely to meticulous production values, and to shrewd performances from Anthony Hopkins and Ryan Gosling.","user":"Lechuguilla","rank":[60,71]}]