[{"title":"Hostel Part 2","rating":3,"date":"7 June 2007","review":"Eli Roth has learnt a lot of things from his mate Quentin Tarantino, but without a shadow of a doubt, how to talk was the one he learnt best. If you believed everything that came out of the Hostel: Part 2 director's mouth, you'd be under the impression that this was a new lesson in extreme cinema, pushing the boundaries of what is acceptable on screen to new and previously unheard of levels. Gore-hounds though will most likely walk out the multiplexes with the same aftertaste that the first Hostel left; it's violent sure, but it's not the harshest, most disturbing film ever made by a long shot. In fact, the only reason you should approach with kid gloves is because this time, it is girls that suffer. Young, nice and pretty girls with much to offer the world and whether or not dismembering them is more shocking than torturing and killing a horny male jock is a matter for feminist academics to debate.<br><br>The story this time focuses on a trio of art students studying abroad who decide to do some travelling during their holidays. Convinced by a local of the attractions to be had in a Slovakian spa (uh-oh!), tough girl Whitney (Bijou Philips), rich, confident lesbian Beth (Lauren German) and nerdish, murderer-magnet Lorna (Heather Matarazzo) set off for a few relaxing days in the former Soviet block, only to find themselves being splattered all over the walls instead. It's grim and it's nihilistic, but not without a vein of dark humour running throughout (the hell-spawn local brats play football with a severed head), but unlike the first film's bewildered hero Paxton (Jay Hernandez), it's difficult to cheer the protagonists on. Thankfully, we're spared the gratuitous, borderline-pornography of the last film, but the girls are so two-dimensional it's hard to care when their holiday starts to go wrong, Lorna for instance being so sweet, naive and childish that she might as well be a parody.<br><br>That said though, if you're after more of the same arcing blood sprays and annihilated bodies, Hostel 2 delivers. However, it neither matches nor surpasses the original. Claret still flies of course but in a bit more subdued way and surprisingly, the final act doesn't even come close to matching the frantic, battle for survival that Paxton went through two years ago. Much of the violence takes place off camera, where the audience imagination is set to run wild to the screams of the mutilated but only one scene towards the end is liable to make you wince. Considering the shock-value of the original lay in tendon slicing, fingers being severed, a girl exploding as a train hit her and the eyeball scene, it seems like a step backwards as far as gore is concerned. Instead, Roth goes for a dark psychological approach but woefully mishandles it. The shocking about turns of the plot are more predictable than the director seems to think and what should have been a tense, nail-biting conflict of wits misfires, giving us nothing but loads of shouting and a dramatic, but unbelievable personality shift. Roth may know how to do gore, but characterisations? Forget about it.<br><br>As a result, Hostel Part 2 is evidence of how far you can go if your self-belief is spectacularly high, but that is all. All talk of this being a doom-laden, intestine shredding nerve-jangler can do nothing to disguise the fact that it apes the masters but doesn't outdo them. Consider how good this would have been if Neil Marshal had directed it for example? Unfortunately, Roth and Tarantino were presumably too busy head-banging to men being torn apart by dogs, girls getting buzz-saws in the face and the gruesome 'Bathory' scene to notice. The Tarantino connection however is rather apt and had this not been a sequel, it could just as easily have gone under a different name and been attached to the Grindhouse project. Don't be surprised if future installments wind up going straight to DVD.","user":"ExpendableMan","rank":[157,253]},{"title":"Sadistic Sequel with a Great Twist","rating":7,"date":"20 February 2008","review":"In Rome, the wealthy Beth (Lauren German) and her college friends Whitney (Bijou Phillips) and Lorna (Heather Matarazzo) decide to travel to Prague to spend a couple of spare days. In the train, they meet the model Axelle (Vera Jordanova) after an incident with rude natives of Prague and their acquaintance convinces them to take a detour to the beautiful Slovakia and lodge in a hostel. While partying in the village, they are lured and offered in an international auction to sadistic members of the Elite Hunting under a contract that does not allow leaving the torture chamber in a hidden facility alive.<br><br>\"Hostel  Part II\" is a good sequel of \"Hostel\", disclosing the fate of backpacker Paxton that escaped alive from the facility in Bratislava, Slovakia, of the first movie and then following the tragic tour of three American friends. The story is quite similar to the first one, except the great twist in the last five minutes with the action and revenge of the clever and rich Beth. This violent and gore movie is recommended only for fans of the genre, and those that liked the first \"Hostel\" will certainly appreciate this sequel. My vote is seven.<br><br>Title (Brazil): \"O Albergue  Parte 2\" (\"The Hostel  Part 2\")","user":"claudio_carvalho","rank":[50,78]},{"title":"Truly a let down.","rating":3,"date":"8 June 2007","review":"Oh, Eli. What happened? Cabin Fever was a fun horror flick and the first Hostel had its moments, but this? My excitement over a Roth helmed Cell has just dropped dramatically.<br><br>Opening where the first film left off, things get off to a bad start as we meet back up with Paxton, with Jay Hernandez phoning in a curiously wooden performance. The first \"scares\" are very poorly handled and obvious.<br><br>After the pointless prologue, we meet our new gender swapped protagonists. Bijou Phillips's is the obnoxious, one-dimensional slut who just wants to sleep with Viktor Krum. Heather Matarazzo's Lorna should have been a good character. Matarazzo is a talented actress, but here she hams it up too much and Roth piles on the \"she's an introverted nerd!\" touches far too heavily. She's sorta the Josh of Hostel II, only Lorna is a cartoon where as Josh actually seemed like a guy you could meet in a college algebra class. Lauren Graham turns in a pretty good performance and Beth is the only one of these females who actually feels somewhat like a real person.<br><br>The new twist on the formula lies in Roger Bart and Richard Burgi's prospective killers. Here's where Roth could have gotten really dark and interesting. Everyone who saw the first Hostetl remembers Rick Hoffman's whacked out, creepy performance as the American Client. Bart and Burgi's characters could have been used to expand on that creepiness as well as bring in some genuine interest in Bart's character's reluctance, amping up the suspense. But no! Instead these characters are shallow, barely explored personalities and Roth uses them for some cheap plot contrivances in the third act.<br><br>For a horror flick, the movie has surprisingly little scares. Scratch that, it has no scares. There was not a moment in this movie where I didn't see the jumps coming and there is little in the way of suspense. The first Hostel had some genuinely suspenseful moments and Cabin Fever even had a few \"don't do that!\" moments. This film has gruesome moments for sure (that this movie got an R rating is the final nail in the coffin for the MPAA's credibility. If Shakespeare in Love and Hostel II share the same rating, something is seriously wrong). The first kill is undeniably effective in being unnerving, but it lacks suspense, which is the secret when a film is toeing the line of bad taste. This was simply inescapable murder on display.<br><br>Interestingly, the rest of the gruesomeness that ensues is much different in tone. Much of the third act has an almost slapstick vibe, but Roth lacks the grace and timing of splatstick alumni like Sam Raimi and Peter Jackson to truly pull it off. There is also a completely superfluous scene involving a man with a gun and some children that literally served no purpose. Roth was trying so hard to be shocking in that scene that it had the opposite affect on me: I just stared blankly at the screen. I couldn't care less about this completely pointless detour featuring Roth going \"look! Aren't I shocking!\"<br><br>One last complaint and boy is it a big one: Nathan Barr's score. This movie had one of the worst scores I've heard in years. Barr's music sounds like something someone would write if they were making fun of all the clichés of the horror score. That worked for the campy tone of Cabin Fever, but it completely destroys any opportunity for suspense in this film.<br><br>I know Eli Roth has a really good film in him. After Hostel II, I fear the wait for that movie will be longer than I was expecting. I hope he's finally scratched that itch for paying homage to his favorite horror flicks and his shock for shock's sake fetish. If that makes its way into his adaption of Stephen King's Cell, we'll have lost a great story ripe for screen translation to a promising young filmmaker whose head got too big too fast.","user":"moviedoors","rank":[210,373]}]