[{"title":"Truly Moving Picture","rating":10,"date":"14 October 2006","review":"I saw this film on October 10th, 2006 in Indianapolis. I am one of the judges for the Heartland Film Festival's Truly Moving Picture Award. A Truly Moving Picture \"explores the human journey by artistically expressing hope and respect for the positive values of life.\" Heartland gave that award to this film.<br><br>This is an inspiring story based on a legendary historical British Member of Parliament, William Wilberforce. During the late 18th century and early 19th century, a very young Wilberforce is elected to Parliament and over the course of several decades leads the fight to ban slavery.<br><br>Today this seems like an easy, obvious and intuitive decision. But this was not so 200 years ago. The film clearly explains the entrenched economic motives and the political motives for slavery. Wilberforce starts out as almost a force of one and slowly builds abolitionist momentum by brilliant oratory, political maneuvers, and appealing to his fellow man's better nature.<br><br>Ioan Gruffudd is totally believable in explaining to the audience the complexity and heroism of Wilberforce. Wilberforce over the course of his life is sickly and strong, religious and worldly, naive and romantic, and idealistic and practical.<br><br>During the course of this mostly political story, we get to see the immense cruelty shown to the captured Africans turned into slaves. We are shown the slave sailing ships where the captured are treated inhumanely and die of starvation, neglect, disease, and filth. Man's inhumanity to man was never worse.<br><br>Wilberforce is a great man of history even though mostly forgotten today. He respected his fellow man regardless of their station in life. He was always willing to sacrifice his life and health to help others. And his compassion and spirit was always masked by his humility. He is a hero for all ages.<br><br>This is a period piece and you are lost in it because of the attention to detail. The sets, art direction, and costumes allow you to totally suspend disbelief and be moved by the story.<br><br>FYI  There is a Truly Moving Pictures web site where there is a listing of past Truly Moving Picture Award winners that are now either at the theater or available on video.","user":"tollini","rank":[203,230]},{"title":"Great story, well told","rating":9,"date":"18 September 2006","review":"This is a lovely, moving and intelligent film. I did not detect any notably weak performances among a remarkable cast. The older actors though, Michael Gambon and Albert Finney, were shameless scene stealers, but one can hardly fault them for their excellence. There were many things to like about this film. It was gorgeous to look at, brilliantly capturing the look and sound of a sumptuous age. The pacing and editing were fine, though the device using flashbacks for most of the film occasionally led to a moments confusion about when a scene was supposed to be taking place. And the story itself is quite inspirational. A note for my Canadian readers and the Canadians who attended the TIFF screenings. The film mostly covered the struggle to outlaw slavery in Britain itself, though they did touch on Wilberforce's efforts to have it outlawed throughout the British Empire. This continued in the years after the conclusion of the film, and a Bill to do just that was passed in 1833, a month after Wilberforce died. So the film we watched was very much about our own history, and the story of the abolition of slavery in Britain directly affected the eventual abolition of slavery in Canada.","user":"vandergraafn2","rank":[135,153]},{"title":"Moving period drama","rating":10,"date":"5 February 2007","review":"I was well impressed with Amazing Grace; the period was superbly captured, and the interplay of the main action (the fight of William Wilberforce to abolish British slavery) with the other great events of his time (the American and French revolutions) was well presented. The film stirs the emotions but informs the mind. Ioan Gruffudd as Wilberforce is believable and depicts the tenacious Yorkshire MP with both his bodily weakness and great spirit well. Albert Finney as John Newton renders a moving portrayal of the ex-slave trader turned evangelical minister who influences Wilberforce's decision to remain in politics rather than entering the ministry of the church. Benedict Cumberbatch gives a strong representation of William Pitt, and the overall impression of the film is one whose history has been well researched. Well worth a viewing.","user":"colin-509","rank":[82,95]}]