[{"title":"You think you've failed at life? Buck Howard will show your path","rating":8,"date":"30 May 2009","review":"Houdini was once approached by a student who told him, \"I know hundreds of card tricks, how many do you know?\" Houdini replied, \"Five, and I have dedicated my entire life to learning how to entertain an audience with them\".<br><br>Buck Howard is a dried up celebrity struggling for his last gasp of fame. Almost forty years ago, Johnny Carson gave Buck Howard the title \"The Great Buck Howard\" and it stuck. Unfortunately, those years have left their mark and Buck is no longer 'Great'. Despite his tired jokes, sappy piano clap-along songs and magic acts he manages to attract small crowds at far-flung venues in the middle of America. The performances are always \"One Night Only\", as there would never be enough seat-fillers for a second. So what is exactly that keeps him going?<br><br>Colin Hanks plays Troy Gable, a law school dropout looking for a detour to finally get the answer to what he is meant to do in life. Will be able to counsel him a unbalanced magician -or mentalist-?<br><br>Nicely done, this film is funny and likable. A modern story about life dreams, the fierce entertainment industry, and the sadness that hides behind a bad temperamental person. Every well-known actor that appears in this film,even if they play short cameo roles, plays an important part.<br><br>It's quite a gentle, unusual comedy, so morals behind this movie are hard to get. However, this is a good film worth watching and definitely should be shown as an example of outstanding acting from Malkovich to Star Trek actor George Takei.","user":"la_fleur","rank":[31,32]},{"title":"Enjoyable story about \"B\" celebs","rating":6,"date":"8 March 2009","review":"This could be the story about so many \"B\" level celebrities, and is based on the life story of the \"Amazing Kresken,\" The Great Buck Howard tells us that once you enter the field of entertainment, you might do anything to stay on top.<br><br>Buck Howard (played wonderfully cheesy by John Malkovich) is a \"mentalist\" who was popular on Johnny Carson's \"Tonight Show,\" appearing 61 times. He is a classic 70s Vegas magician, doing fascinating tricks and metal feats of amazement. In all, he is a relic of decades past, entertainment without special effects and he still seems to think he is on top of the entertainment world.<br><br>Howard's career has has hit near the bottom, performing in such hotbeds as Bakersfield, CA and Akron, OH in front of partially filled small auditoriums. Still, he see's himself as a big time entertainer that is just not getting the break he needs to get back on top (much of which he blames on Jay Leno), in many ways he is a sad individual and does not get that the only people who enjoy him are almost as sad as him.<br><br>The story is told through the eyes of his traveling secretary, played by Colin Hanks, who is, himself, struggling with issues. He is battling his desires to become famous with his fathers (played by his real dad Tom Hanks)wish he become a lawyer. since he has no real talent (other than writing)he is breaking into entertainment the only way he sees possible.<br><br>This is a charming film, not something for those looking for action, a major love story (a minor one occurs between Colin and the beautiful Emily Blunt (best known as the 1st assistant in The Devil Wears Prada), or some major personal victory, although in the end, Howard does find what makes him happy.<br><br>This is a movie that likely describes the life of many \"B\" entertainers that are seeking to stay in a limelight that has moved away from them. it is simple and enjoyable.","user":"stuprince","rank":[44,48]},{"title":"I Loved This Movie!!!!","rating":8,"date":"26 March 2009","review":"This was a very good comedy, well written and acted. The dialog was witty, the plot kept the pace going, and the character development was very good. Buck Howard (John Malkovich) is an \"Amazing Kreskin\" type magician who hires an assistant named Troy (Colin Hanks)to help him out while on the road, playing small venues in small towns. Troy is a law school dropout who decides to pursue a career in show business, against the wishes of his father (played by Tom Hanks in a brief role). Buck Howard had been a bigger star in the past, playing on Johnny Carson 61 times, but recently had been down on his luck.<br><br>Troy tells the story (Nick Carraway like) of Howard's life on the road, his unlikely comeback, and his fall back to earth. Along the way, we are introduced to Valerie, a publicity agent, excellently portrayed by Emily Blunt. Troy and Valerie become romantically involved, which makes Buck jealous, of whom specifically is unclear. Everyone in the movie seems curious as to Buck's sexual orientation: is he gay or not? Nobody knows for sure.<br><br>There were numerous cameo appearances by notable celebrities throughout the movie and Steve Zahn put in a hilarious performance as one of Buck's devoted fans.<br><br>This was a very funny movie, and I enjoyed it a lot. I'd recommend it to anyone who appreciates a good comedy.","user":"J_Trex","rank":[42,51]}]