[{"title":"A very relevant movie for me","rating":9,"date":"30 December 2007","review":"As a husband who has a wife battling for her life with recurrent ovarian cancer, this movie struck very close to home. We a both in our late 20's and I am facing the possibility of burying my wife far to young, so suffice to say we both went to the movie and had a hard time keeping the eyes dry. There is nothing worse then prospect or actuality of burying your lover and your friend. I know this movie got a lot of negative reviews but when you see your life mirrored on the big screen you can't help but be moved by her struggle to move on and his undying love for her. I see another reviewer said to keep the boyfriends/husbands home, these people obviously have not faced such tragic circumstances. Usually I'd be the first to tear apart a click flick, but this didn't feel as cliché as most and I liked how the ending wasn't as predictable as click flick movies usually are.","user":"alan_oneill81","rank":[363,426]},{"title":"Helping Lost People Finding Where Their Hearts Are","rating":9,"date":"27 December 2008","review":"People change in time, relationships change in time; Love doesn't. A man expresses his feelings of his love to his wife, through several shocking surprises after his death. This movie would tell why love is the only power that connects people, if no one could tell anymore what it really means. Gerry and Holly's relationship is a good example of how couples bring their love to the end quickly. <br><br>Leading actors Swank and Butler accomplished wholeheartedly acting jobs. A true success with Harry Connick Jr.'s role playing Holly's first flirt, but poor acting from Jeffrey Dean Morgan(whom we'll see him in \"Watchmen\" next year) playing as her second. As a novel adaptation, the screenplay is effectual. Some parts of the script is totally noticeable that hold our attention continuously. I liked the editing job very well after I've seen the deleted scenes from the special features of the DVD. The music score is so relaxing and emotional. Everybody keeps telling this film is a tearjerker, which I disagree; it's only because of the sensational existence of Hilary Swank. Her talented way of expressing psychological trauma just catches eyes, that's all. <br><br>There are 5 of my favorite scenes which I rewind each time I watch: 1*One of the greatest opening scenes for a romance of all time. In that scene just in 2 minutes, we get what type of personalities each character has. Lovers find a quarrel over a straw. They yell at each other, and Gerry leaves Holly getting out of the door. A minute passes or not, Holly comes back from bathroom and Gerry back from the door. Then they wildly lock in a close embrace after running towards to each other into the middle of the living room... 2*After the funeral of Gerry, at a time when Holly's longing of him hits the top, she can't help herself calling the home-phone from her cellphone just to listen to Gerry's voice from his answering machine record; while trying to sleep... 3*Holly's receiving of Gerry's first P.S.I Love You letter and his true guesses of what Holly is going to say in respond after his each time of gaffes... 4*Gerry's calling to memory of their first meeting in Ireland, from his words... 5*And best of all, my best favorite scene: Holly's return to karaoke stage singing \"Love You Till The End\" and imagining as if he is there forming a lonesome audience. This scene is the one I burst into tears. I don't remember myself crying because of a movie, or because of someone else's sadness ever; including the end of Dr.Zhivago or Love Story or The English Patient. Yet it just reminded me of a photo of my fiancée with whom we were parted away. In that photo she was standing on a step of an amphitheater watching my mockery of a stand-up show at the stage, forming the whole audience herself. <br><br>This is a therapeutic relationship movie. Watch it with your partner and you'll be able to see the missing, lacking or the incomplete part of your unity. Strongly recommended for couples who used to be in love before. Find out why love is eternal.","user":"CihanVercan","rank":[62,71]},{"title":"Total tearjerker falsely billed as a romantic comedy","rating":7,"date":"26 January 2008","review":"I saw this movie on a girls-night-out to the movies, and we chose it on the basis of the previews, which had billed it as a romantic comedy. Wow, were they ever wrong! The basic plot is this: Woman loses husband far too early and tragically. Woman grieves for husband, hard. Husband, through a plan pre-arranged before his death, sends woman letters at set intervals, each one causing a fresh stream of tears to fall.<br><br>The acting was great. Hillary Swank was particularly good in her role, and let us see her vulnerability and conflicting emotions. The supporting cast was all excellent, and ladies, there is more than enough male eye candy in this movie to go around.<br><br>But - and I strongly warn all of you considering this as a light comedy or a date movie - it's sad. Very very sad. Even the happy parts are sad. If you go see this, wear waterproof mascara and bring lots of tissues. Don't say I didn't warn you.","user":"segacs","rank":[145,182]}]