[{"title":"80s set gangster film with top soundtrack","rating":7,"date":"3 September 2005","review":"I completely disagree with the vast majority of reviewers so far, this was a great film. Granted, it may be similar to other films of its genre, but the 80s settings were meticulous in my view. Spanish Guardia Civil with their feared (now banned) tri-corn hats, 80s cars, definitely NOT the modern Malaga airport, and the fashions and language used.<br><br>I left Cineworld feeling exhilarated - great soundtrack and good plot. I would recommend this film to anybody, Nick Love has done it again after the superb Football Factory. How can anybody call Danny Dyer Z-List?? Granted, he may be no Michael Douglas, but just because he is young, and obviously has a talent for the types of part he tends to play in movies, does not make him a bad actor at all, in fact, i think the exact opposite.<br><br>I will definitely be pre-ordering the DVD.","user":"gogogoadam","rank":[68,88]},{"title":"Glossy, sunny hedonism with a happy undercurrent of vicious crime","rating":7,"date":"7 September 2005","review":"Thatcher's 1980s heralded a new Britain where anything was possible  opportunities for undreamed-of wealth side by side with the emergence of beggars on the streets, and riots from unemployment and racial tension. 'Our Kid Frankie' (played by Danny Dyer) wants to 'be somebody' and not end up like his dad, so he does a little delivery job to 'Playboy Charlie' in Spain and gets hired as a driver at Charlie's lucrative nightclub.<br><br>Nightclub owners have a glamour appeal often shared by politicians, and this was particularly seductive in the 80s. Around Charlie, everything just 'happens'  you are out having a good time and he is the person who makes it all possible  effortlessly and continuously. 'Welcome to the pleasure dome,' croons the iconic pop song of the day.<br><br>From here on in, The Business is almost an homage to the decade. A scene on Charlie's boat  who is \"so cool his bed makes itself in the morning\" - recalls the famous Rio video by Duran Duran. Fashions, cars, dialect and attitudes are all mimicked with loving precision. Alan Durant once criticized music videos (which began in the 80s) for their tendency to glittery escapism, musical portraiture, and fixing the \"currencies of sounds\". Charlie fixes the currency of the world around him, particularly the currencies of crime, women and drugs, the three things Frankie's father had told him to avoid. But what else is there?<br><br>Soon they meet up with Charlie's partner Sammy, who is \"so hard even his nightmares are afraid of him.\" Sammy is the financial brains of the operation and his hobbies include a jealous obsession with his girlfriend Carly, and also killing people. The fact that Charlie largely keeps him under control not only maintains the light-hearted roller-coaster, neon-lit feelgood factor, but sets it apart from films like Sexy Beast where the grandstanding stars give in to their characters' nastiness rather more readily. The undercurrent of criminal activity, just as in real nightclubs, is one of those things you speak about as little as possible, and always second in conversation to the finer things of life, such as the latest cocktail or trendiest clothes. Naturally things tend to go up or down rather than stay still, and even though Charlie manages to buy off the local mayor, things occasionally get a bit nasty. The skewered head scene is particularly liable to spoil the taste of that glass of Bollinger.<br><br>Like the world it portrays, The Business can be criticised as superficial and derivative, but it accurately depicts the headstrong, cheesy, glamour of the 80s and both glamorises and exposes the drug dealing high-life. My guess is it will either turn you off in the first ten minutes or carry you along with an adrenalin rush of New Wave dance anthems and snappy one-liners. The slangy witticisms are so consistent, as is every other aspect of this blood, sex and smarm soaked poolside party of a movie, that you may just decide to let go and snort a full line of it as you identify with personalities you'd never dare to in real life.<br><br>The 80s had a self-confident brashness guiding how people presented and expressed themselves, embracing or rejecting the new political and social divides. The Marbella look was in vogue  Hugh Heffner, Bunny Girls and pop stars. Now it looks dated and a bit tacky. But have we learnt? If we could view ourselves now from 20 years hence would we cringe at how prevailing trends suck us in? Even the relatively 'normal' gangsters wives in The Business seem hoodwinked to accept the status quo unquestioningly. The pervasive ideologies of our society are often invisible except in retrospect.<br><br>Love it or hate it, The Business confronts us with bygone clichés many would prefer to forget, but on its own terms it's a devil-may-care joyride of a movie  slide the Ray Bans back and get hammered on it.","user":"Chris_Docker","rank":[45,57]},{"title":"OK, but nothing you haven't seen before.","rating":7,"date":"5 September 2005","review":"This is an OK gangster romp, very English, and not sure if it will translate well across the Atlantic.<br><br>Set in Margaret Thatcher's 80s, the storyline is pretty much the same as every other Gangster movie. Someone with nothing, works their way up the food chain, only to come crashing down again. Frankie starts out as a waster in South London, and becomes a big player in Spain's Costa Del Sol.<br><br>The location, costume, soundtrack and cars are fantastic, really transporting you back to the 1980s, but there are a few duff performances thrown in from some of the actors.<br><br>The are a few good lines and quotes in there, but nothing different from Nick Love's previous film, The Football Factory. Basically it is Football Factory in the sun.<br><br>It was enjoyable, but pales in comparison to something like GoodFellas.","user":"dj_taz_099","rank":[58,77]}]