[{"title":"Juno, one girl's story","rating":10,"date":"27 July 2010","review":"I rarely go the movies, I watch them on cable or rent them usually. When I heard about Juno I was interested but afraid it would disappoint. I Forgot about it and probably would have never seen it if I had not stumbled on it on cable one lazy Sunday afternoon. I think there are some very valid criticisms of the movie and of course there are some errors and questionable choices made, but the movie was filmed in 31 days which I find amazing.<br><br>One of the reasons I was afraid to see Juno was that I was Juno. Okay a little different but let's just say 17 and a senior in high school instead of 16 and a junior, everything else very similar. The biggest difference-I never met my child's adoptive parents.<br><br>I stupidly got pregnant though I knew better. Almost right away I realized abortion was not for me and that I was not ready to be a mom. No one ever talked about that 20 something years ago. You either had an abortion and no one knew or you kept the baby. At least that is the way it seemed to me.(not true I know but almost no one talked about adoption) Juno's character is quirky. I don't find her annoying in the least. She is a smart kid and she acts like one. While I can understand why some feel this movie showed teen pregnancy as having no consequences I disagree. The consequences are real for Juno. She has to deal with being pregnant, with finding adoptive parents she likes and trusts. She has to deal with school, her best friend Bleeker's emotions, her own emotions.<br><br>It is all done subtly and actually very realistically to me. Its a snapshot of what occurred. We don't know every moment of emotion and how Juno dealt with it. We do know at the end she was crying very heartfelt tears and that she felt she picked the best situation for her baby.<br><br>Its a gamble, there are no guarantees and she deals with that fact the best she can. I find her innocent relationship with Mark Loring very believable and the shaky marriage of Mark and Vanessa as real as it gets.<br><br>Yes Juno's parents seem to be over the top understanding. However you can tell they are simply accepting, loving people and are there for their daughter, why is that such a stretch for people to believe? I think this was well written, well acted, well cast and very real. The message is not that teen pregnancy and adoption is easy. To me this is one girl's story. It wasn't easy but she made the best of it and carried on with her life and gave her child a good start. As for a 16 year old knowing the references and music that Juno did, well in this day and age every one has access to old music, old TV shows, movies, etc. So its very plausible that Juno is a fan of the 1977 era and has been exposed to it via internet, cable and recordings.<br><br>It has flaws, and missteps but certainly in the end a great film and one I will watch again and again. As someone who has been through this I cried my eyes out and they were happy tears, to see that some one else saw it the way I did when I was where Juno was.","user":"freemoviesforme","rank":[19,20]},{"title":"about as indie as Avril is punk rock","rating":4,"date":"21 February 2008","review":"I rarely post things on internet blogs but this is a bit of a concern of mine. I am worried that beautiful films such as L'Infant are going to now be classified in the same category as Juno. I understand the mass appeal of this movie-- the mainstream audience being confused and thinking it's an indie flick by the gritty film used and the obscure references but Juno is in no way an independent film. I think why it is so ineffective is because the audience it was trying to attract (the movie fanatics who hate big budget Hollywood junk i.e. anything with Jessica alba in it) saw it for what it really was: Hollywood junk wrapped up in a converse shoelace bow. It was as indie as Avril is punk rock.<br><br>Furthermore it is (in my opinion) a tasteless, pointless movie. For the majority of the film I am more annoyed with Juno than I am sympathetic to her plight. I also have a hard time relating to her as she is NOT a 16year old but rather a 35year olds characterization of a 16 year old (does this make sense?) I have NEVER heard a teenager / young adult in my life ever utter ridiculous lines such as \"honest to blog?\" or \"yea I'm total for-shiz\". What the hell? I thought maybe a stripper turned blogger would have been a little more able to develop a story with characters that are down to earth but this Juno character is absurd.<br><br>Plus the rest of the film is completely underdeveloped-- you never see the relationship with her stepmother develop or understand why it is the way it is. Her relationship with bleaker has maybe 25 minutes but it is in no way a developed understood relationship. In fact he's barely even seen! The summary of the movie includes the words \"and with her beautiful friends help\" but in the movie there is absolutely no connection with her friends beauty and the relevance of it. Was there supposed to be some conflict? All these story arcs that were never completed.<br><br>I was very disappointed with this movie. Fox searchlight has produced many good films (notes on a scandal, little miss sunshine, the last king of Scotland, etc) but this is just an embarrassment. It wasn't as though the actors were bad-- Michael Cera as usual plays the adorable awkward adolescent and Ellen page, Jason Batemen, Jennifer Gardner, etc play their roles respectively but the whole premise of the movie was so over the top and unrealistic. Oscar worthy? It's ludicrous. This is a movie worth missing.","user":"ceburo","rank":[276,426]},{"title":"Manipulative and Simplistic","rating":13,"date":"13 January 2008","review":"Look, I do get it. I fully appreciate that a film about a girl who gets pregnant, has an early abortion, then manages to move on, would be a pretty short movie. In fact, so short it wouldn't get made. No one wants to know about reality. And certainly in 21st century North America, no one wants to portray abortion as a viable option. Very, very bad form currently.<br><br>But when I see this film reviewed as \"blazingly truthful\" and the pregnant 16 year old central character described as being 'in a pickle', as I did in one review, as if perhaps she'd forgotten a homework assignment and might get detention, I have to admit that the cynic who lurks in my soul gets full rein. This is basically a cutesy film about being pregnant at 16, where despite a few problems, everyone gets to live pretty much happily ever after. Gosh, girl in a pickle comes good! Ahhh!! And apparently everyone in the cinema where I saw it was quite overwhelmed by attacks of the warm fuzzies, except me. Two seats away, a woman slightly older than me was weeping joyfully by the end while behind me, young women were giggling happily as sweet Juno's bump grew. Good grief! Is this really a message we want to give to 16 year olds? <br><br>I'm beginning to think I'm something of an oddity. You see, I don't find it 'blazingly truthful' that a bright, resourceful and articulate 16 year old as Juno is portrayed, would be so dumb as to have inadequately protected sex then seem surprised to find herself up the spout. One point of the script is that Juno herself apparently initiated the sex, thought it through in advance in fact, because she was bored. I therefore assume the pregnancy was at least to some extent planned. And if she really had no idea that sex might lead to pregnancy, her parents (portrayed as bemused but supportive), should be excoriated for such inadequate parenting. And if I see one more review which describes Juno as a comedy about growing up 'and the bumps along the way.' (I'm prepared to bet good money on that having been written by a middle aged man), I swear I'm going to run amok in the local mall with a urine dip stick. Being pregnant at 16 isn't a sweet joke, abortion clinics (whatever you think of their morality - and I'm neutral on that) are not run by morons, and while Juno has some amusing one-liners, and a good central performance from Ellen Page, it is basically a deeply flawed, superficial movie which is trying too hard to be cute. It's extremely manipulative.<br><br>I'm going to be very controversial and suggest that far from being surprised by an unplanned pregnancy, Juno might actually be a very willful young woman who wants to add pregnancy/childbirth/adoption to her 'experiments-in-living' list. At everyone else's expense. It certainly makes her the center of attention. She wouldn't be the first girl to get pregnant for that reason.<br><br>I found the situation between the adoptive parents more convincing. Childless Vanessa (Jennifer Garner) is desperate for a baby. Husband Mark is not so sure, and does at least eventually face up to the truth of his uncertainty by making a break for it. He may be 40 going on 18, but he's being honest about it. And for me the most moving scene in the whole film was when Vanessa held the newborn child in her arms for the first time, having decided to go it alone as a mother anyway. If there is a message to be taken from this movie, it's possibly that becoming a mother when the time is right, is just fine. <br><br>A superficial, cutesy, lightweight movie. The fact it was written by a woman is no excuse. I am gobsmacked that it's been nominated.","user":"isabelle1955","rank":[659,1]}]