[{"title":"Sheesh... skip all the other reviews. Just read this.","rating":3,"date":"3 July 2011","review":"I've just wasted my time reading 20 IMDb reviews for \"Tree of Life\", both love-its and hate-its. They might as well be telling you how they feel about the colour blue. Subjective, subjective, subjective.<br><br>So let's try something different. I'm not going to tell you whether I loved or hated this movie. I'm just going to tell you what to expect. Without either praising or disparaging this film, I'd describe it as being a mix of Fellini, Kubrick, IMAX and \"Stand by Me\".<br><br>This film is presented in 4 distinct acts, each lasting between 30-45 mins. The acts are very disjoint, and although they are woven together by common thematic elements, the experience can be very disorienting. The director seemed to pattern this film after Kubrick's \"2001: A Space Odyssey\" with its 4 contrasting sections.<br><br>Act 1: Setting. The film begins with a peek into the life of a 1950s American family that suffers a tragedy. It leaps forward and back in time, setting up the individual characters and their roles in the drama. Though presented in a very fragmented way, this part should be easy enough to follow.<br><br>Act 2: Tone. The next sequence, lasting about 30 minutes, is a very impressionistic journey through space, time and evolution. Be prepared. There may be a few voice-overs, but otherwise it's completely without dialogue, actors or events. The best way to describe it is to say it's like an IMAX film with the narration turned off. It's somewhat reminiscent of the \"acid trip sequence\" at the end of \"2001\".<br><br>Act 3: Plot. After that, we return to the 1950s. This 3rd sequence makes up the body of this film. Having established the setting &amp; tone, the director gives us a story (more or less). It's presented in a series of vignettes focusing mostly on the love-hate relationship between a boy and his father. This mirrors the love-hate relationship that each character has with goodness. Both the father &amp; son are jerks struggling to become good, each in his own way. This portion of the film reminded me of a dark, disturbing version of \"Stand By Me\".<br><br>Act 4: Conclusion. We return to another impressionistic sequence, this time including the main characters and short bits of dialogue &amp; voice-overs. To some of the audience it may give closure &amp; satisfaction. To others, it may just plain suck.<br><br>For the sake of presenting an objective review, I'll withhold my own opinion. But I did want to mention some of the reactions I observed in the theater and in the parking lot afterwards. In an audience of about 100, I saw 4 people walk out. (Well, 5, but I think that guy just spilled lemonade on himself.) Most of the audience seemed attentive, but I did hear a lot of yawns and uncomfortable fidgeting. When the end credits came up there was dead silence as everyone filed out. It was pretty uncomfortable. In the parking lot there was a man who hated the movie so much I feared for my life. Seriously, this guy was about to plow his car through a storefront. Others praised the film's technical merits and cinematography but remained lukewarm, if not mostly negative, with their overall impression. Several people were intent on discussing the films philosophical merits, but this only infuriated the angry guy, so everyone just went home.<br><br>If I were to compare this to other films/directors, I'd say it's very Tarkovsky-like (Stalker, Mirror, etc). As I mentioned above, it's also much like Kubrick's \"2001\"--if you were to strip out the suspenseful parts about Hal and the Discovery. Perhaps it's also a bit like Wim Wenders' \"Paris Texas\" in that it wanders around a lot before coming to its destination.","user":"rooprect","rank":[1,1]},{"title":"A Bold And Epic Exercise","rating":1,"date":"1 July 2014","review":"Terence Malick's existential and experimental drama is truly something special. When I first started watching the film, I was trying to figure out what Malick was aiming to portray due to the film's somewhat convoluted structure, but towards the end, I took in every aspect of the film, the themes of family, of existence, of life in general. Many see this as a hit-and-miss film, but unless you truly focus your attention, you'll miss the point it's trying to make. Is it pretentious? Indeed, but it's equally an amazing picture.<br><br>We sit for 2 hours and follow Jack, a young child growing up in a dysfunctional house with Brad Pitt playing (extremely well) his strict and overwhelming father in the 1950s. The story feels inspired by the likes of '2001: A Space Odyssey' and the art-house feel of Von Trier, but despite this, 'The Tree of Life' has its own unique and bold style that works well in creating a haunting and emotional visual treat, accompanied with fantastic performances from Brad Pitt, Sean Penn and Jessica Chastain and stunning cinematography from Emmanuel Lubezki. 'The Tree of Life' is a bold and epic exercise from Malick that acts as a commentary on our society, a truly rewarding view.","user":"CalRhys","rank":[108,135]},{"title":"a very rare kind of film","rating":10,"date":"23 March 2014","review":"For a concise summary of what to expect from this film I can't do better than direct you to Rooprect's review.<br><br>When I saw Tree of Life I think I was fortunate in that I knew absolutely nothing about it beforehand. All I knew was the title, and I'd briefly seen the enigmatic poster for it. But who was in the cast or who directed it, etc, I knew not. So I went in completely open minded. <br><br>I also timed the cinema visit so I missed all the ads and trailers - I'm not saying this necessarily improved the viewing, but the nature of the movie is at a polar opposite to all that commercial stuff, and it was good not to be distracted by that crap.<br><br>Turned out: It really was a memorable film, and I won't forget that couple of hours in the cinema watching it, it felt like a rare treat. Very enjoyable experience, but a film completely outside the usual Hollywood fodder of an Odeon or Vue.","user":"xzcgb","rank":[43,59]}]