[{"title":"Though I speak with the tongues of angels, but have not love....","rating":10,"date":"24 December 2007","review":"\"The Great Debaters\" is a very fine film.<br><br>It reminds us of what it means to be excellent, to stand for something good, to love with all our hearts, and to shine.<br><br>The performances, or the cinematography, historical care, or directorship all lift it out of the ordinary.<br><br>And in its difficult subject: racial tension and the education and discovery of values by the three young debaters from Wiley College, one of the oldest colleges in America, it creates real excitement and interest.<br><br>But the real reason that this is a fine film lies in is its plea that in education lies the reasoning, the power, and the will to change history. That learning lies not just in knowledge but also in applying that knowledge to better yourself, your world, and all of humanity.<br><br>The very significant point of the film is at the end. I can forgive the slight drag here and there because the ending is magnificent and explains something crucial about American history by its finish.<br><br>From an era when bigotry, racism, and degrading behavior was a wretched norm to our era where values are mutable, where dumbing down has no limits, and taste little place; \"The Great Debaters\" stands out as being a story that stands against all of these things.<br><br>The rating says it all: excellent.","user":"intelearts","rank":[87,111]},{"title":"Exceptional Film, Extremely Talented Cast","rating":10,"date":"17 December 2007","review":"Although \"The Great Debaters\" does not open until Christmas, I had the good fortune of seeing it at a preview -- and I can recommend it without reservation. It is a great story, based on real events that most of us never heard of, about a debating team from Wiley College, a small black institution in rural Texas, that performs extraordinary feats because the kids are good and the team is taught by Mel Tolson, a real person, acted by Denzel Washington, who also directs. Forest Whitaker, like Washington an academy award winner, plays James Farmer Sr., the school president and the father of one of the debaters, James Farmer Jr. (yes, that James Farmer Jr.). The participation in this enterprise of Washington, Whitaker, Oprah Winfrey and the Weinstein brothers should draw crowds (provided the film isn't cursed by being described as \"uplifting,\" though it is). The revelation in this film are the performances of the three principal debaters: Jurnee Smollett as Samatha Booke (with an \"e\", as she proclaims when she tries out for the debate team), Nate Parker as Henry Lowe (also with an \"e\" as he announces in response to Samantha's declaration) and Denzel Whitaker as James Farmer Jr. (It's an amusing coincidence, but he is unrelated either to Denzel Washington or to Forrest Whitaker.) You may have seen Jurnee Smollett earlier in her career when she was a \"cute kid\" and a promising actress. This film could be her portal to stardom. In addition to being a gorgeous young woman, she's also an accomplished actress, ready for bigger parts in the future. You'll also be impressed with her colleagues, people whose names you may never have heard. You don't have to be black to find this film engrossing; I'm not. All you need to be is (a) a human being and (b) someone who appreciates a good movie. I hope it makes a ton of money at the box office but it is, above all, a quality film. It just happens to be about a difficult period in American history, the rural South in the 1930's. It just happens to be inspirational and uplifting and all that good, boring stuff that cause your eyes to roll when that's how the critics describe it. But it's better than uplifting. It's GOOD and it's REAL.","user":"gelman@attglobal.net","rank":[117,155]},{"title":"Great Sophomore Film by Denzel as a Director","rating":23,"date":"23 December 2007","review":"Two words perfectly sum up this movie - inspirational and uplifting. I have not seen Antwone Fisher, but I will be sure to check it out after seeing this.<br><br>Before watching this, I had never even heard about Wiley College or what it did in the '30s, so not only is it great entertainment but it is also educational. I don't know how closely the movie follows the actual events so I can't point out the flaws, but it doesn't matter because the movie is brilliant and moving. This is an underdog movie and you'll be rooting for the Wiley College team throughout the movie. The acting is marvelous by all the actors, but recognition has to be given to the three stars that portray the debaters, Denzel Washington, and Forest Whitaker. Not only is Denzel great as an actor, he is even better as a director. As other reviewers have said, out of all the actors Denzel Whitaker is the star. His portrayal of James Farmer, Jr. is outstanding and this role will certainly further his acting career. Forest Whitaker doesn't have a huge role to play, but he performs his parts beautifully (for example the hog and the sheriff scenes).<br><br>Overall this is a very inspirational and uplifting movie. I wouldn't be surprised if it gets a few Oscar nods. <br><br>9/10","user":"desiplaya","rank":[67,90]}]