[{"title":"Harold & Kumar do it again","rating":9,"date":"9 March 2008","review":"As a fan of Harold and Kumar go to White Castle, I really didn't think they could recapture the magic of the first film in the sequel. Sequels are, so often, horrible disappointments. But the World Premiere of Harold &amp; Kumar Escape from Gauntanamo Bay last night as Austin's SXSW Film Festival was simply awesome. The audience loved America's favorite slackers on their next adventure as their trip to Amsterdam goes incredibly wrong.<br><br>Whereas the first film challenged racism and stereotyping, this one continued the theme into issues of racial profiling and War on Terror paranoia. These multicultural slackers are becoming American every-men that we can all relate to. While there are times when Harold &amp; Kumar's antics are just plain silly, they are also incredible human characters who are struggling with real challenges around parents, romance, friendship, the law, and race. Harold &amp; Kumar make us laugh while they also challenge our perceptions and expectations of social and political reality.<br><br>Cho and Penn were wonderful reprising their original roles. Neal Patrick Harris was back again as a strange variant of himself. Rod Corddry provides a wonderful addition to the cast as the completely paranoid government agent. Overall, the film is perhaps a tad below the original, but a tad below excellent is still a wonderful comic romp that all fans of the original and many new fans should enjoy. Unlike the first film which gained a cult following on DVD, Harold and Kumar Escape from Guatanamo Bay will undoubtedly be a huge hit in the theaters. The audience here in Austin absolutely loved the two lovable anti-heroes. I look forward to many more adventures from Harold and Kumar.","user":"JustCuriosity","rank":[344,452]},{"title":"Donuts are awesome!","rating":8,"date":"30 April 2008","review":"I am getting so addicted to Harold and Kumar's crazy adventures, it's just pathetic, when I saw Harold and Kumar go to White Castle, I was hooked and bought the movie the next day. So obviously I was so excited to see Harold &amp; Kumar Escape from Guantanamo Bay, saw it opening day and it's non stop laughs still! Now, I do hate gross humor, it's disgusting and unoriginal, yet, somehow, Harold and Kumar make it so unbelievably funny. They're back and this time they are taking the world by storm! Kal Penn and John Cho are such a great pair and made this sequel so much fun to watch. I agree, it does get offensive at times, but if you don't take this movie seriously, I think you'll be laughing too. Harold &amp; Kumar Escape from Guantanamo Bay is one of the funniest movies I have seen this year in the theater.<br><br>Harold and Kumar are on their way to Amsterdam to visit Harold's love, Maria, but of course, Kumar just can't wait until they get to Amsterdam, so he smokes on a plane, but everyone mistakes the bong for a bomb and Harold and Kumar get thrown into Guantanamo Bay. When they have the chance, they take it. When they finally arrive back in America, they got to meet Kumar's ex girlfriend's fiancée who could pull some strings to get their charges clear, but the way to Texas is a long road and they have to face some interesting obstacles.<br><br>Harold &amp; Kumar Escape from Guantanamo Bay was so much fun to watch, I loved this sequel, the cast looked like they had the ultimate blast making this film. The scenes that got huge laughs from me was when the FBI agent offers grape soda to a guy to get information about where Harold and Kumar were, and some guy in the back round says \"How about some Kool Aid?!\", also the scene with the return of the weed bag with Kumar and his ex girlfriend was so weird, that it was actually funny. If you loved Harold &amp; Kumar go to White Castle, you'll love Harold &amp; Kumar Escape from Guantanamo Bay, it's a comedy not to miss.<br><br>8/10","user":"Smells_Like_Cheese","rank":[77,109]},{"title":"Beware! Its a comedy roller coaster","rating":10,"date":"29 April 2008","review":"Oh my god, I still don't know what hit me. I have been a big fan of the first part but this one is a different league guys. Not a single boring moment, very nice editing. And our favorite characters have done it again. They didn't leave a single stereotype and ignorance untouched in the movie.<br><br>Trust me it will not be fair to compare the White Castle part with this one, as this is just a different experience no less than a roller coaster ride of genuine comedy. This movie has taken what it did in the first one, to the next but different level. To point out, as pretty clear from the uncensored trailers, it was awesome to see NPH and G \"Dubya\" Bush. Cho and Penn are just non-stop fun and have some really hot girl friends. From Ta-Ta's of girls to bottom less parties, nothing felt out of place. We also get to know allot about H&amp;K's past.<br><br>It deserves a standing ovation and that's what it got from the audience in the theater. Oh man, I am so getting this on DVD when the extended unrated version comes out.","user":"prateekarora","rank":[119,196]}]