[{"title":"Woody Allen Goes on Vacation","rating":2,"date":"18 February 2011","review":"Vicky Christina Barcelona may be the laziest movie I have ever seen. Not necessarily the worst movie ever, but I don't think I have ever seen so many talented people put in so little effort (with the exception of Penelope Cruz). I mean, I fully understand why Woody Allen would want to spend several weeks in Barcelona with three beautiful women, but I don't know why he bothered to put film in the camera and call it a movie. <br><br>The central hope of the movie is that constant references to Gaudi, Miro, and how Vicky is getting her masters in Catalan identity (BTW, if you Google \"masters in Catalan identity\" EVERY result is about this movie, which tells you how bogus that is) will distract you from the fact that this movie basically recycles the two most tired clichés of late-nineties soft-core porn: Sexually conservative woman meets a tall, dark stranger who makes her question her life AND sexually adventuresome woman meets a tall, dark stranger who helps her experience increasingly exotic thrills including (gasp!) lesbianism. Strangely these two plots never really intersect, which is particularly odd since the tall, dark stranger is the same for both of them. <br><br>Other than the pretty Tourist Board shots of Barcelona, the main dramatic thrust of the movie is how Vicky thought she had her life planned out, but a tryst with the exotic Spaniard has made her question everything. How do we know this? Because Vicky actually says things like \"I thought I had my life planned out, but\" And not just once, but she says it to the Spaniard, she says it to Patricia Clarkson, and she says it to a classmate from her language class, who is introduced for the sole purpose of giving Vicky one more person that she can tell. Oh, and in case you still missed it, there is a ludicrously intrusive narrator who explains it all to you again and again. Why is Vicky suddenly dissatisfied with her entire existence after one quick roll in the grass with the Spaniard? No real reason is ever given, other than that the rule of the cliché is that intelligent American women are all sexually repressed with boorish husbands. <br><br>I'm sure that the stilted dialog is meant to make it feel \"theatrical\" and the oppressively obvious and distracting narrator is meant to be ironic (like the Greek Chorus in Mighty Aphrodite), but without any real plot, characters, or motivations, it just adds to the sensation that you're trapped for ninety minutes while someone tells you about a mediocre movie they once saw.","user":"NRiviera","rank":[37,47]},{"title":"A triumphant effort from Woody Allen","rating":15,"date":"15 August 2008","review":"Although this film has bizarrely been described as breezy summer entertainment by some top critics (which leads me to wonder if they saw the same movie I did, or just the first half hour), \"Vicky Cristina Barcelona\" is the closest thing to the sort of examination of relationships that Allen became famous for in quite some time (\"Anything Else\" counts, I suppose, but lacks the sharpness this film has), and although it is far from as weighty as some of his dramas or even some of his comedies, this is his first really inspired script in a while, featuring a cast of detailed, well-developed characters, some razor-sharp observations on relationships, and a wicked sense of humor.<br><br>Although I never thought Woody's work this decade was particularly poor (other than \"Cassandra's Dream\" and although I'm in a minority \"Match Point\"), it has mostly been completely inconsequential and almost entirely dependent on broad characterizations and heavy plotting rather than real people and awkwardly comic situations (which has always been Allen's strong suit). A career-best performance from Scarlett Johansson, a wickedly entertaining turn from Penelope Cruz, and the absolute revelation that is Rebecca Hall form a great cast along with Javier Bardem in a role that may surprise the majority of the American public (well, for most of the movie, anyway). You can feel Allen's mark on their mannerisms, but they all seem to disappear into these characters, that's how good they are.<br><br>I'm keeping this as spoiler-free as possible, because it's really worth going into the theater not expecting anything in particular and savoring the film's often unexpected but never contrived plot twists and turns. All you should know is that Vicky (Rebecca Hall) and Cristina (Scarlett Johansson) go to Barcelona for the summer and things get complicated when they meet a charming, mysterious, and rich painter (Javier Bardem) and he makes a rather upfront proposition to both of them. It's best if you know nothing of how Cruz' character impacts the film prior to watching it.<br><br>In relation to Allen's other work I thought it was interesting that he never attempted to analyze sex. The whole movie is in many ways about sex, and there is a lot of the expected philosophical and psychological examination of the relationships between the characters in the film, but sex itself is never analyzed as it is in much of Allen's work, and is instead treated as the impenetrable mystery it is. That said, Allen's script is extraordinarily nuanced, something that I haven't expected from his writing in a while. Sure, the characters still represent opposing romantic philosophies, but there's a spark in the writing that makes these feel like real people as opposed to mere characters. That spark, that chemistry is there throughout \"Vicky Cristina Barcelona\", it's there in the vibrant cinematography by Javier Aguirresarobe, it's there in the performances, it's there in the shot composition, and it's there in the editing, and in pretty much anything else I haven't mentioned yet. <br><br>The first forty minutes or so of \"Vicky Cristina Barcelona\" may be the sort of romantic comedy (very good romantic comedy, at that) that the advertising campaign seems to suggest it is, but for the rest of the film there's the sort of pessimistic optimism that colors much of Allen's work (if that makes sense, pretend you didn't read it if it didn't), and let's just say it doesn't end well for these characters. There's real complexity and intensity in this film, and all I have to say is this: Woody Allen is back, the perceptive, intelligent examiner of the human heart, that is, not what we've had for the past while. To say this is one of his best films would be ignoring the fact that through the 70's and 80's he pretty much made nothing but great films, but I can at least say that this is on par with some of his better work.<br><br>8.5/10","user":"ametaphysicalshark","rank":[247,362]},{"title":"Why the narrator? Why? Why? Why?","rating":6,"date":"16 February 2012","review":"Everyone acts very well, and the whole film would have been really good if it hadn't been for this weird narrator the whole way through who sounded like he was telling children a story even when saying things like \"they went to bed together\". It was weird. I also feel if it had been more dialogue based we could have got a greater grasp of the characters. I watched it without subtitles but understood the relationship of Juan Antonio and his ex-wife (mostly spoken in Spanish) than I did of Doug and Vicky which just seemed to lack a huge amount of depth. There needed to be some redeeming feature Vicky and Doug's relationship.<br><br>Anyway well acted but yeah the narrator ruins it. Javier Bardem is amazing as usual.","user":"lmjakob","rank":[16,19]}]