[{"title":"Austin Movie Show review - adorable and enjoyable","rating":8,"date":"22 January 2006","review":"I had no idea I would enjoy myself so much! Queen Latifah plays Georgia Byrd, a shy, quiet, insecure frump, with a secret passion for cooking and for her co-worker, Sean (the most endearing character that L.L. Cool J. has ever played!). After hitting her head and suffering a concussion, Georgia has a cat-scan that reveals several brain tumors. With less than a month to live, Georgia takes all the money she has and treats herself to the European vacation of a lifetime. She flies first class, stays in the Presidential suite, eats the finest food, and lives like she was dying. \"Last Holiday\" is pure fantasy and pure fun, and it never takes death too seriously. Gerard Depardieu plays the delightful world-famous Chef Didier who equates Georgia's appetite for food with an exquisite appetite for life. \"The meaning of life,\" he tells her, \"is butter.\" So go treat yourself to this fun little film, get a large popcorn, and don't skip on the butter.","user":"leilapostgrad","rank":[54,59]},{"title":"Our audience applauded at the end","rating":8,"date":"24 January 2006","review":"OK, \"Last Holiday\" is not an Oscar contender, but it is an uplifting and well-made film. Georgia, the main character played by Queen Latifah, was living a very dull and boring life and suddenly, she realized that there was more to life than working all day and eating microwave dinners. She was a woman who followed her dreams. Timothy Hutton is a wonderful villain and LL Cool J plays his heartthrob role very well. The Czech Republic provided a gorgeous (albeit COLD) backdrop. Yes, some of the plot points are implausible, but who cares? The scenery - and Queen Latifah's wardrobe - were breathtaking and most important, this movie was ENTERTAINING and these days, there are very few films that you can say that about. At the performance I attended, there were about 200 people in the audience and we all applauded at the end of the film. Go see it for a good laugh!","user":"almostoscartime","rank":[57,63]},{"title":"Cute movie","rating":8,"date":"14 January 2006","review":"I was pleasantly surprised with how much I enjoyed this movie. <br><br>Yes the plot has been done many times before. As with most romantic comedies, it's nothing deep, had some cheesy moments and was totally predictable (I figured out the whole movie in the first 10 minutes). <br><br>But I really enjoyed it all the same. I laughed a lot in this movie. Partly because I could totally relate to trying to live life under the radar as woman that doesn't look like a model. Plus it was refreshing to see an African American woman shown with some depth in a movie. Not just the mean black woman.<br><br>There was very little cussing, little sexuality, and no nudity. Truly refreshing these days. <br><br>If you just want to enjoy a movie without having to put too much thought into it, go see this movie.","user":"chnikki","rank":[93,111]}]