[{"title":"Wonderfully unique and charming (but perhaps too spare)","rating":8,"date":"4 June 2005","review":"I just saw this at a press screening. It's very smart, well-made and entertaining, directed with sure-handed control, full of quirky, funny moments and superb acting. The film pretty much avoids clichés, although it does rely a bit on the familiar \"Aren't Middle-Americans quirky?\" idea for its humor. But Jarmusch never goes too far with this, his restraint keeping the film propelled from beginning to end.<br><br>The only weakness for me is rooted in the film's strength: I feel like there's not quite enough here. <br><br>Murray's character is beleaguered and despondent, Murray plays him with perfect subtlety. This is fun and fascinating to watch; I found myself hanging onto every little expression on Murray's face. But, the combination of his passive, muted performance and the spare storytelling left me wanting more. It just doesn't have as much impact as I feel it could have. So, yes, it's wonderful minimalism, but perhaps a bit too slight of a movie to have any lasting resonance.<br><br>Bill Murray has added another very good performance to his career, and Jim Jarmusch has made another compact little gem (unlike some of his more recent films). Unique and entertaining. Definitely worth seeing.","user":"drjimmycooper","rank":[261,373]},{"title":"Completely open to interpretation","rating":6,"date":"11 April 2006","review":"Whether it was (shrewdly) planned or not, Bill Murray has become one of our greatest cinematic resources, just as comfortable doing dry comedy as he is acting in a mood piece; his whole melancholy being has become perfect for avant-garde comedy, and this meticulously-mounted and shaded 'dramedy' is a Bill Murray vehicle all the way. The loosely-structured plot deals with calling up the past, which it says you can't really do because it's gone, and not worrying about the future because it isn't here yet. Murray plays a computer businessman, a committed bachelor and \"over-the-hill Don Juan\", who receives news he might have fathered a child with an ex-girlfriend 20 years ago. The film, helmed under the more effective title \"Dead Flowers\", is an unintended journey of self-discovery which is purposely incomplete but not pointless; the screenplay leaves the scenario open for discussion, and writer-director Jim Jarmusch structures each sequence in such a cockeyed way that we don't really know where the movie is headed. This is perfect for audiences interested in something a little different, and even if the pacing is dryly solemn or slow, the picture delights in being anti-formula. A very good film, difficult as an entertainment per se and often puzzling or obtuse, though it continues Bill Murray on the path of an actor of incredible taste, decision and consequence. *** from ****","user":"moonspinner55","rank":[90,123]},{"title":"A snail's pace with no payoff","rating":3,"date":"20 August 2005","review":"After viewing the trailer, I was hopeful that Broken Flowers might prove to be a subtly humorous and sweet film such as Lost in Translation, which I very much liked. But by the end I, and my family, couldn't believe we had been made to sit through two hours of excruciatingly slow pacing for no seeming reason.<br><br>I am not a film buff, but am a theater person. Though I don't know all of Jarmusch's previous films, tactics, or techniques, I do understand some basic principles of storytelling, and I feel that this did not meet them satisfactorily. It is a beautiful and satisfying thing for the writer to leave something to the audiences' imagination, making them engage their imaginations to complete the story rather than remain passive viewers who are spoon fed answers and entertainment.But this can be taken too far, and I felt that the film left too much to the audience, without providing enough meat to sink our imaginations into.<br><br>The one really touching moment came,I thought, when at the end of his list of former girlfriends, he visits a graveyard and the gravestone of a former flame. A close shot catches Murray with tears welling in his eyes. This would have been a terrific moment...if we hadn't been made to wait so long that we didn't even care.<br><br>I agree with other comments that I saw little to no trace of the Don Juan that could have attracted so many women (including the four women in the film whom he supposedly bedded the same year). Even if he had had an incredible vigor in the past, why would he have a gorgeous girlfriend apparently 20 years his junior at present? And what does he want? I was never able to discover that. Without any seeming motivation and without the development of relationships or any type of build that culminated in anything significant, I felt cheated by the end. Any point that could be made in the film feels like it could have been made in the first 30 minutes. After that it was just more of the same. Whereas Lost in Translation made a statement about the loneliness of two people in a foreign country by its slow pace, it also interwove the pacing with a touching and unconventional relationship that gave the audience something to engage in and watch develop. Nothing seemed to develop here. Which raises the question, Why should we care?","user":"stephanie_lein","rank":[125,179]}]