[{"title":"Double take","rating":6,"date":"2 December 2010","review":"Watching this film, shown recently on a cable channel, and the reality of what is going on in Ireland at the present time, seems, in a way, a sort of metaphor for the boom the country experienced in the past two, or three decades. Sadly, what goes up so quickly has a tendency to come crashing down, as it is the case of the latest state of affairs, not only in Ireland, but in other countries as well.<br><br>Liam O'Leary is a successful entrepreneur that faces opposition to his latest project, a world class soccer stadium. Liam is living the kind of life of a new rich person. As we meet him, he is driving home stuck in one of those traffic jams so typical of big cities during rush hour. He must get home to change and go to a dinner where he is being given an award fro his achievements.<br><br>Home life is a mess. His wife, Jane, is bored with her husband, as well as with her life. The excesses have not given her the kind of life one feels she wanted. Connor, his teenager son, hates his father because he has given him the so many material things he is bored and has turned into liking communism, as a sort of protest against his self-made man.<br><br>Liam, who is edgy because of the turn of events in his financial world, one day discovers he is being follow by a man that looks just like him. That brings him to a visit to his aging mother to inquire about whether he was an adopted son. The revelation from his mother devastates Liam, who has been oblivious to some signs that would have given him a clue as to this part of his life.<br><br>John Boorman, the director, also wrote the screenplay. The film reunites him with Brendan Gleeson, a man that has done excellent work for the director. The film resonates because it shows the machinations behind a successful man that now has to pay dearly for what he built. He has wasted his life in the pursuit of wealth, not only for himself, but for his wife and son as well. Instead of the respect he feels he deserves he has to face a past he never knew, plus a man that is exactly a replica of himself, but with a somewhat criminal trait. Liam has ultimately to confront reality in order to move on, not before making peace at home.<br><br>Brendan Gleeson is the whole reason for watching \"The Tiger's Tail\". He is an actor who always delivers. He makes a tremendous impression in a double role which shows two sides of a personality. Kim Cattrall appears as Liam's wife, Jane, and Brian Gleeson, who is the lead man's own son, is seen as his son Connor. In the supporting cast, Sinead O'Connor shines. Ciaran Hands also graces the film with his valuable presence.","user":"jotix100","rank":[8,9]},{"title":"Enjoyed it","rating":7,"date":"21 November 2006","review":"I have read some of the different opinions here and I concede that some of the points made could be relevant to this film. Most modern films do very little for me (I've been filmgoing since the 1950's) but I really enjoyed this film immensely with the possible exception of the way the \"situation\" was resolved in the end. However, most people could probably think of a hundred ways to end this one so I accept the one chosen. The acting was first class, Seamus Deasy's photography was spot on and Stephen McKeon's wonderful score raised it all a notch or two. What a refreshing break from the ear-bashing, grossly offensive noise that passes for film music these days. I give it 7 because, quite simply, I enjoyed it and that's what counts in the end, not who didn't speak very well, who was or wasn't liked in it and how bad Irish society is today.","user":"patcal","rank":[24,34]},{"title":"Can't Put My Finger On It...","rating":8,"date":"14 November 2016","review":"I'm not sure whether this movie was good or not, but I kind of liked it. It was peculiar, but in a good way (not like Solondz's Wiener-Dog I saw recently).<br><br>The \"Celtic Tiger\" part was of no relevance to me - I wouldn't know whether it portrayed 2006 Ireland accurately or not; I was viewing this movie as a regular stalker flick, and, as such, it was quite engaging.<br><br>The acting was good, especially by the lead male. Kim Cattrall's role was not a major one, so her accent didn't bother me, especially since everyone in the movie had sort of a \"neutral\" accent. Having been to Ireland, I can say that none of the people in the movie sounded like the natives I met on my trip to Ireland.<br><br>The set-up was very good and engaging, but the movie declined significantly upon the doubles's entering the protagonist's house. There is no way something like this would happen in real life. It was just not believable. I was also sort of offended by the way they chose to portray the wife - as though they were trying to say that women are generally dumb and shallow, and the only thing they care about is for a man to pay attention to them. This is inaccurate and there is no way a wife would mistake a stranger for her husband of many years. Perhaps they were meant to imply that Jane knew all along that it was the double (if so, I must have missed it), in which case, perhaps, I would have seen it differently.<br><br>The ending was also kind of weird, but very original and somewhat satisfying and thought-provoking.<br><br>All in all, an enjoyable movie, and definitely superior to many a stalker flick I've seen lately. Would recommend.","user":"vip-danii","rank":[4,4]}]