[{"title":"Disappointing","rating":6,"date":"18 May 2008","review":"Last warning for spoilers:<br><br>After falling in love with \"The Lion, the Witch, and the Wardrobe,\" I was expecting an amazing sequel from the same people. \"Prince Caspian\" was a disappointment, however.<br><br>The changes made from the book were so many and extreme that Adamson (the director) completely altered the theme of the story. The character of Peter was so changed that one questions what exactly he learned from Narnia that he will not be allowed to return. From the fighting at the beginning of the film in England because he is upset about being young again to the power struggles with Caspian, his title of \"The Magnificent\" was sullied.<br><br>Caspian fared no better. In making him an adult and Miraz the Lord Regent, they made a crown Prince not even knowledgeable about the fact that the throne is his and that no other Lords who are suspicious of Miraz ever talking to Caspian about his birthright. That is unrealistic. Even worse, they turned Caspian into a vengeful man who jeopardized a mission to attempt to avenge his father's death.<br><br>What was worse, however, was that Adamson chose action and battle scenes to character development. There were so many characters introduced but none of them were rounded out. It felt as if the characters were background to the action. They did what they did because they were supposed to rather than any meaningful reason due to their personality.<br><br>As a Narnia book series fan, this was a major disappointment. It really felt like Adamson redid a mediocre medieval war movie adding Narnian characters for effect.<br><br>Bob","user":"A_Bob","rank":[117,143]},{"title":"it might have been better if i hadn't read the book","rating":6,"date":"16 May 2008","review":"I am a Narnia obsessed nerd, so of course I went to see it the night it was released. I had very high expectations because the first movie was so true to the book. However, with this film that wasn't the case. The screen play was pretty much completely rewritten and included only hints of the original story. I suppose Disney felt it necessary to add in lame typical movie elements that attract mainstream moviegoers. For example a sub-plot romance between Caspian and Susan and battles that never existed. This movie not only failed to develop the characters and events as well as the book, it changed the characters and situations that it did develop.","user":"lodijee","rank":[68,86]},{"title":"A Terrific Disappointment","rating":5,"date":"19 May 2008","review":"If you've never read the novel by C.S. Lewis, you will probably think \"Prince Caspian\" is a terrific movie. However, if you enjoyed reading the book, prepare to be disappointed.<br><br>The most beastly fault in the movie is the portrayal of several key characters. Peter is made out to be a whining, ego-centric child as opposed to his true character as the High King of Narnia. In the opening scenes, Peter is found fighting other children at a train station in London. You find out that Peter started the fight because he doesn't like being treated like a child, a theme which would continue throughout the movie.<br><br>Caspian is portrayed as a true adolescent; rebelling against Peter's decisions and seeking personal vendettas including a developing love affair with Queen Susan (what's that all about?). This move did a great job of making Caspian look like a pompous ass.<br><br>At one point in the movie, Peter decides to attack Miraz's castle against the council of Caspian and others. The plan takes a turn for the worse when Caspian discovers that Miraz killed his father and attempts to assassinate Miraz in his bed chambers. That goes badly, alarms are set off, Narnians retreat leaving several behind. Fingers are pointed at Peter for wanting some glorious victory and back at Caspian for not sticking to the plan. Meanwhile I'm sitting in my seat wondering if I'd missed a chapter or two when I last read the book.<br><br>The last atrocity I'll discuss is the meaning behind seeing Aslan. Faith and Christianity are profound points in C.S. Lewis's novels, and I'll just say that this movie missed the mark yet again.<br><br>It would be ridiculous to believe a movie could follow a book to the letter. However, what this movie did to the characters is cinematic murder.","user":"daniel_kuehl1980","rank":[42,54]}]