[{"title":"The Force is Strong with this one.","rating":8,"date":"25 February 2010","review":"\"Fanboys\" is a movie about, well, fanboys. Four childhood friends make a pact on Halloween night in 1998 to infiltrate the Skywalker Ranch in hopes of catching a rough cut of the long-awaited \"Star Wars\" prequel, \"The Phantom Menace.\" Together in a geeked-out van, armed with dozens of Rush cassette tapes, they make a cross-country trip where they battle with angry Trekkies (\"Star Trek\" fans, for the uninitiated), stumble into an \"all-male\" bar, evade an angry pimp and land in jail, while one of their own attempts to make peace with his fate.<br><br>The film was pushed back for so long and re-edited so much (re-shoots were done by hack director Steven Brill, which thankfully were dumped from the final product, as directed by Kyle Newman) that it's easy to let the problems that plagued \"Fanboys\" overshadow the movie. What the movie delivers, though, is an often hilarious, sometimes sentimental and utterly geeky send-up of geek culture. A valentine to \"Star Wars\" fans, perhaps, it's a film that pokes fun at its core audience without alienating it. There's a wealth of cameos , too, from the likes of William Shatner, Billy Dee Williams, Carrie Fisher, Kevin Smith, Jason Mewes and three (count 'em, three) roles featuring Seth Rogen. If one thing can be said about the film, it's never a bore.<br><br>Sure, the road-trip formula has been used many times before, and yes, the film rarely breaks from the expected, but its subplot revolving around a sick friend keeps it from being just some raunchy teen comedy with a geeky twist. \"Fanboys\" has heart, and combined with a solid young cast and hundreds of \"Star Wars\" and other nerdy references, makes it a film worth returning to again and again.","user":"Mr_Censored","rank":[40,47]},{"title":"Embrace your inner geek","rating":7,"date":"14 September 2009","review":"If you're a geek this movie is for you. If you're a Star Wars geek this movie totally is for you. Basically it's a movie about Star Wars geeks made by Star Wars geeks for a target audience of Star Wars geeks. If you are not into all things Star Wars this movie may well miss the mark with you. And even the most rabid of Star Wars fans would have to concede that the movie is certainly not anything spectacular. It's fairly charming and reasonably amusing but never really riotously funny. But it works. More or less.<br><br>The movie is set in the autumn of 1998, a time before Jar Jar Binks had been foisted upon the world. Four friends, major Star Wars geeks all, decide to drive across the country, break into Skywalker Ranch and steal a rough cut of The Phantom Menace. The major motivation for this journey is that one of the friends has cancer and will not live to see the movie released. But once that is established the cancer storyline is basically put on the back burner and this turns into a mostly predictable wacky road-trip comedy. Some of the wackiness works, some of it falls flat. There are a bunch of celebrity cameos thrown in, some of which are inspired and some of which are rather random and pointless. So it's a movie which has its ups and downs. But it's enjoyable more often than not and the movie breezes by in a nice, tight, well-paced 90 minutes.<br><br>None of the actors playing our gang of four really stand out in any memorable way. Dan Fogler's character is a little more outrageous than the others but that's about it. But the group works together well and they are ably supported by the varied cast of characters who pop up throughout. Seth Rogen's portrayal of a pimp is one of the standouts. Of course this ode to Star Wars fans wouldn't be complete without taking some shots at Trekkies. So there's room for another funny turn by an actor portraying Admiral Seasholtz, an uber-Trekkie. Who is the unrecognizable actor memorably bringing this character to life? You may have to wait until the closing credits roll to figure it out. And in this Star Wars geek universe there's room for one girl and Kristen Bell is both charming and funny in the role as her character gets swept along for the ride. Could the movie be a little more consistently funny? Most definitely. But the movie about Star Wars geeks will probably leave you with a smile on your face. Especially if you're a Star Wars geek yourself.","user":"hall895","rank":[28,35]},{"title":"Not Sure How Non-\"Star Wars\" Fans Will Like It, But I Had a Blast","rating":8,"date":"24 July 2009","review":"A surprisingly funny movie about a group of geeks who set off on a mission to break into Skywalker Ranch and view a print of the as-yet-unreleased latest installment in the \"Star Wars\" saga, \"The Phantom Menace.\" <br><br>This is a road trip comedy of the fairly standard variety, with trips to jail and Vegas, some drug use, some Internet hookups and some prostitutes thrown in for good measure. The film looks like it was made for about $20 and certainly doesn't break any new ground. But the cast of actors is game and look like they're having a ball -- there's an especially hilarious sequence that features Seth Rogen in disguise as leader of an army of rival Trekkies. I can't really imagine anyone who doesn't have a pretty thorough knowledge of \"Star Wars\" trivia enjoying this film, because virtually every shot and line includes some sort of reference to the George Lucas series. But since I'm a \"Star Wars\" fan, I thought it was a hoot.<br><br>Grade: A","user":"evanston_dad","rank":[34,46]}]