[{"title":"Linear Thriller, Avoids Pitfalls of Genre","rating":7,"date":"22 April 2007","review":"Amy (Kate Beckinsale) and David Fox (Luke Wilson) are returning from an arduous family reunion, on their way to Los Angeles. On their trip they encounter car problems and inevitably pull into a motel Norman Bates could feel right at home at. After some awkward exchanges with the owner, they reluctantly decide to spend the night. Upon viewing some tasteless horror films in the room, David begins to suspect their authenticity, and that these are actual murders taking place. Furthermore, he is led to believe the room that these events take place in is none other than the room they are currently residing. With this initial set-up, Vacancy wastes no time launching the audience into an engaging, gripping, and somewhat macabre story while borrowing sparingly from Alfred Hitchcock's Psycho and managing to side step many land mines other horror films fail to see. <br><br>Vacancy has both positives and negatives going for it, however the negatives don't seem to affect the narrative as frequently as in other films. The first thought that came to my mind was its running time. At eighty five minutes, the film may move at too brisk of a pace for some, and at times it feels like it should be part of a short horror film festival, rather than a stand alone feature film. The clichés are very apparent as well-the broken-down car, the mysterious stranger, the out-of-range cell-phone, and the creepy hotel are included, but rather than using them as a crutch for a poor script, the film seems to celebrate their existence. It epitomizes all horror films where the main characters are stranded, encounter mysterious people or creepy locations. The film also fails to successfully flush out the \"snuff\" film aspect that was so heavily advertised and anticipated. The screen time of these films is very limited and the focus on them is brief. They serve as an fundamental set-up, but after their initial appearance, they fall out of sight and out of mind.<br><br>What makes the film much more successful than the average \"teen slasher\" horror film is, ironically, the absence of teens in the film. In recent years the most successful horror films, in my opinion, like The Sixth Sense, What Lies Beneath, Stir of Echoes, and Hide and Seek all revolve around families, and in particular, the relationships between adults. In Vacancy, Amy and David are a married couple one argument away from a divorce and unlike an amorous, oblivious, teenage couple about to become mincemeat for an axe-murderer, the tension between David and Amy puts them on edge throughout the whole film and translates to tension in the audience while the film builds its suspense. The build of the film also differs from the main pattern set by modern \"slasher\" films. Winding like a key, the tension never lets down, and unlike the ups and downs of \"slasher\" films where there are multiple apexes of horror, there is a ratchet effect in Vacancy, where there is no relief and each scene is built upon the previous one. The other very obvious asset to the film is its relative lack of violence compared to most other modern horror films. In recent years, films such as the Saw series, Hostel, The Texas Chainsaw Massacre, and The Hills Have Eyes have lazily resorted to the shock factor to scare their audience rather than rely on the old saying \"It's not the bang that is scary, but rather, the anticipation to the bang.\" That's not to say that the film isn't violent free, there is some definite violence involved, but in comparison to other films it seems, dare I say, minimal or practical.<br><br>The references to Hitchcock's Psycho are refreshingly flattering rather than annoying. In Disturbia, a recent loose remake of Hitchcock's Rear Window, the similarities become annoying and the film loses its intrigue. In Vacancy, the nods to Psycho are very slight. The Pinewood Motel itself is the most obvious example which, like the Bates Motel, is in serious need of redecorating. The beginning credits also throw back to Psycho with its vertical bars violently moving around to forceful string instruments. There are similar references to Halloween as well, but the one thing the film lacks is the characters' emotional dilemma and their feelings of guilt involved in their situation. In Psycho it is Marion's (Janet Leigh) moral dilemma over stealing the money, and in Halloween it is Laurie's (Jamie Lee Curtis) feelings of social inequity. Amy and David do not share this external baggage-their troubled relationship is seemingly repaired through this trial that they are put through and not manifested by a killer such as Michael Myers or Norman Bates. There is no name given to whoever pursues them and there is no correlation that can be drawn between the characters and their tormentors. <br><br>All in all Vacancy hits a few high points and is a smart enough film to stay clear of areas where previous horror movies have failed (horrible twist endings such as in Identity). Vacancy has a decent build of suspense, the exclusion of gratuitous violence helps, and the characters are more likable than those of the average horror movie. The letdown is that the film doesn't take any substantial risks. It follows a very linear path, with no deviations, and stays almost exclusively at the motel. It is a film that will entertain, but won't allow for too much out of the box thinking.","user":"gswanson17","rank":[135,182]},{"title":"Now that's quite esnuff of that, thank you very much.","rating":7,"date":"21 January 2009","review":"Grieving over the loss of their son, David and Amy Fox are driving thru the night heading towards their destination...the signing of the divorce papers!. David unwisely leaves the interstate looking for a short cut and swerves to avoid hitting a raccoon, this causes engine trouble and eventually they have to settle for staying at a grotty roadside motel until the car can be fixed in the morning. Upon attempting to relax in their dirty and poorly decorated room, they are disturbed by loud banging on the doors to their room, this is merely the start of a night of terror as the Fox's will be forced to fight to stay alive in the confines of this Horror Motel!<br><br>Seen it before? Yes we all most certainly have, from proto slashers to Euro terrors, the couple under siege formula is as old as the hills themselves. But Vacancy has such a sense of fun and a unique use of its plot setting, that even a terribly formulaic cop out towards the end is mostly forgiven. The setting is one dirty hole of a motel, but the dirt is not merely confined to the structure and basic house keeping of the place, the worst dirt comes in a terrifying form that is fully formed from the moment we meet the creepy motel manager (a wonderfully cheesy Frank Whaley). From here our intrepid couple, very well played by Luke Wilson &amp; Kate Beckinsale, must use the most basic resources to hand, to hopefully escape the clutches of masked assailants intent on gutting them in the name of entertainment.<br><br>What follows is the usual jumps and perilous set ups, and a quirky line in labyrinth adventure. But then that ending that almost derails the whole picture, it does hurt it because we the viewers can only feel let down that the makers chose to not stay with what would have been an impacting turn of events. But for a film that's homaging films (and thriller maestros) from the past and clearly doing what it set out to do, it's to me a forgivable error. It's not taking itself too seriously, and you shouldn't too, just check in with the Fox's and get involved with the thrills. 6.5/10","user":"hitchcockthelegend","rank":[16,18]},{"title":"The Makers Trust Your Intelligence","rating":10,"date":"15 June 2008","review":"They don't make you feel stupid, they give you something that seems real. There isn't any sugar coating, no senseless nudity, just a claustrophobic atmosphere and tense build up that will have you on the edge of your seat, anxious to see what will happen next. It's the way a movie should be done, and makes for a satisfying late fright night.<br><br>A thrilling horror shocker that follows a quarreling married couple, David and Amy Fox (Luke Wilson and Kate Beckinsale) that end up breaking down in the middle of nowhere and have to walk a few miles to a gas station/motel. The strange and creepy manager gives them the \"honeymoon suite.\" The room is, of course, the worst motel room you will ever see, cockroaches, no TV channels come in, etc. With nothing to do, David begins watching the videotapes(snuff films) in the room. They both begin to discover that the films are real and were filmed in their room. They find themselves in a life or death situation and try everything possible to survive the night. If you liked the trailer and the synopsis or any of the actors, you will definitely find that you like this movie. When I first saw a trailer for the movie, I thought it looked good, but was a little hesitant because of the way that horror movies are made today (gore and bore). This film has a very good plot and is solid in structure. Even though you do not get the full back story of the characters, you get their painful story through the excellent writing. In the beginning, you don't quite get why they fight or seem to \"hate\" each other, but it doesn't take long to understand (maybe 15 minutes counting the beginning montage of credits). I was literally on the edge of my seat throughout almost the entire film, and found not one dull moment. Suspense and tension are the real deal in this movie, and it is done incredibly well. Lots of excellent camera angles and authentic startling sequences add to the tense nature of the film. The characters seem very genuine and real, the relationship between the main two characters is portrayed extremely well. Wilson and Beckinsale come off as a real couple with a history. Their acting is extremely believable, and the writing of the characters is done extremely well. Another great thing is that they aren't your typical brainless genre characters who get naked and drop to the floor when the killer approaches, they are much more real. They do everything that you expect that you would do if you were in their situation. They make good decisions, which make them much more realistic, winning sympathy rather easily. There are heart-pumping fight sequences, which were well executed and will make you cross your fingers for Beckinsale and Wilson. There are also tender moments that will add to your root for them. By the end you will want them to stick it to that manager for everything he's done and for a reconciliation between the two main characters. I enjoyed it ten fold, but you'll have to watch it to see whether they make it in the end. <br><br>Overall, Vacancy is an original psychological thriller that is heavy on suspense, while not so heavy on bloodshed.<br><br>The movie does contain a far amount of vulgar language. I would recommend this movie. Your missing out if you don't see it.","user":"piccolo300000","rank":[37,48]}]