[{"title":"Really good !","rating":9,"date":"4 August 2006","review":"I've seen it yesterday and it is very good! I'm french, so I've seen it in french, but I'll probably go see it in English too, because although I watched it in french, there's a lot of English parts (subtitled) so I guess the English version will also be subtitled for the french parts. It not hard to understand, it's completely hilarious, but there's also a very good story and I honestly suggest it to anyone (exept young children, there's a lot of swearing (haha) in both languages! ) The movie is not too long, it lasts about two hours but I never felt tired of any part. It talks a lot about hockey, our national sport, but the story is not all about it, which allows the less-informed viewers to understand easily (There are some inside jokes with our hockey reality, but only a few). Seriously, I laughed, I got scared, I jumped, I laughed again, and I simply loved this movie which I recommend to you all.","user":"Bawow","rank":[63,85]},{"title":"Extremely funny and yet suspenseful","rating":10,"date":"1 August 2006","review":"The chemistry between Huard and Feore is fantastic. I had thought the subtitles would be annoying but they are such an integral part of the humour that I didn't mind them at all.<br><br>There are moments in the movie that are shocking enough to make you squeeze your eyes shut, but the humour is retained all the way through.<br><br>Warning - I was part of a test audience. There were a lot of complaints about language and violence. I thought it was brilliantly done, however if you're sensitive to either, this movie may not be for you. I hope the film doesn't get changed because of the complaints. It is perfectly balanced as it is.","user":"tstmary-1","rank":[63,86]},{"title":"super","rating":10,"date":"6 August 2006","review":"Bon Cop Bad Cop had me in tears. The laughs are continuous, the suspense is consistent, the imagery is beautiful, the action is impressive... the chemistry is incredible. It's almost like Boondock Saints. fast paced and modern, while staying true to Canada and the abrasive feelings between Québec and Ontario, while centering around, what else, Hockey! Being bilingual, I can say I may have laughed twice as hard as anyone else in the theater; However, this half-English half-french movie is sure to please anyone regardless of maternal language thanks to perfect subtitles which only add to the amazingness of the film.<br><br>Highly recommended.","user":"quixoticlie","rank":[61,85]}]