[{"title":"Clever, polished, stunner with a lot to say about morality and fidelity","rating":9,"date":"8 January 2006","review":"Match Point just joined Brokeback Mountain and Cinderella Man in the top three films for me this year. Like Brokeback Mountain, however, it is almost impossible to write a reasonably intelligent review without writing a spoiler.<br><br>I have been a hot and cold Woody Allen watcher, but was only a fan during his comedic phase. So, despite hearing from a few reliable sources that this is Woody's masterpiece, I was skeptical and went in with few expectations. I am glad. Approaching the movie this way allowed it to creep up on me. <br><br>The NYC Jewish dialog is gone. The quirky sense of humor is nowhere to be found. the hypersensitivity is missing. Where's Woody? Well, he's in London, but the place and time, despite the opinions of some critics, are largely irrelevant in this film.<br><br>There is only one line in this film that indicates its origin - it has something to do with 'intertwined neuroses' and nearly made me laugh. <br><br>The first 3/4ths of this film is almost completely taken up with character development, but also contains all of the basics of the inexorable plot that truly unfolds near the end. The characters are all quite likable, and, if you're like me, you will yearn for a happy ending. Watch out! - you've just been hooked and Woody's about to reel you in! <br><br>Match Point draws its audience in quietly and slowly at first, defining its territory as a smart, hip, and sophisticated character study early on (in no way unexpected for Mr. Allen), but then it takes an irreversibly sinister turn as one man threatens to bring everybody we have grown to love and respect down with him. <br><br>The performances and cinematography in this film are all-around the best I've seen this year. Allen uses a lot of very close-in face shots, and his cast handles it with ease, performing their parts with accuracy and no lack of passion. Jonathan Rhys Meyers, Emily Mortimer, and Scarlett Johanssen are all excellent, and the rest of the cast lends excellent support. I found no fault in the pace or the plot - this is easily Woody's most plot-heavy film, and you can tell that he had a great time putting it together. <br><br>The story line of Match Point is powerful, disturbing, and exceedingly clever. Philosophical folks will likely want to talk about it afterward. Some will find it frustrating and others will find it pretentious. Still others will point to Woody's own life and claim that this film is some form of perverse confession. Well, from my perspective, it is simply damn good story-telling.<br><br>Highly recommended for adult audiences.","user":"mstomaso","rank":[388,519]},{"title":"a terrific film","rating":9,"date":"3 January 2006","review":"Match Point is a cool, classically elegant and concise film that addresses all of the big questions--love, morality, death, fate, chance--without ever seeming heavy or self-conscious. I've never seen a Woody Allen film to match it. As a matter of fact, I can't remember another film of late that I thought was quite this good. From the opening shot, the film draws you in and doesn't let up, moving from shot to shot with a fine sense of rhythm and a narrative drive that builds the viewer's curiosity through a series of unexpected switchbacks. Rhys-Meyers is superb as an ex- professional tennis player from a poor Irish background who has turned social climber. Too proud to accept a favor from his upper class friends without immediately offering to pay it back, he affects an interest in opera and Strindberg. The viewer at once sympathizes with him and winces as he strains to seem refined and self-assured. Allen has put together a superb cast of young actors who bring his near flawless script to life so convincingly that one almost immediately suspends disbelief and becomes absorbed in the story. The shots of London are luxuriant and spacious, never self-indulgent. Few films, novels, or plays manage to form such rich dramatic material out of characters' inner obstacles. A classic piece of drama that reaches toward the likes of Shakespeare and Dostoevksy, every facet--from structure to dialog to editing to sound--is brought off with panache. This is not only Allen at his best but an example of what the cinematic medium is capable of when properly exploited.","user":"trevormerrill","rank":[306,430]},{"title":"Ignore the UK paper reviews, this is terrific","rating":9,"date":"15 January 2006","review":"What a throughly engrossing evening Woody Allen has provided. This film has been, by and large, poorly received by the British critics. I cannot understand why. Yes, it does have the strongest echoes of Crimes and Misdemeanours, but if a director/writer can't borrow from his own product, who can? This isn't funny Allen -- there are few laughs -- but it is an extremely intense and successful serious Allen.<br><br>Does Allen's magic transfer to my home city? You bet it does; lovely locations; Notting Hill, the Tate Modern, the \"Gherkin\" in the City, all look great but are also entirely relevant. Many critics said he didn't have an ear for British dialogue. I simply don't hear that -- it may be a bit stagy at times, but the writing is spare, to the point, and literate. Few trans-Atlantic clunkers.<br><br>Yes, there are some silly bits; bits where you wish any half-intelligent Englishman had watched the film and said \"Wood, old son, this is cobblers\". British detectives don't call themselves \"Detective so-and-so\". They might be Detective-Sergeant or whatever. The force that polices London is the Metropolitan Police, not the \"London Police\". Perhaps Allen didn't realise that his main copper, Ulster actor James Nesbitt, sounds a parody of the amusing roles he plays in some widely-seen British Yellow Pages adverts. Little things, so easy to iron out, that detract just a touch from credibility.<br><br>Scarlett Johannsson -- what an actress, is she really only 20 or whatever? She packs huge power and stunning looks, if occasionally getting a trifle near Glenn Close in Fatal Attraction. Jonathan Rhys Myers does his forlorn sports coach bit, as from Bend It Like Beckham. The solidly Brit supporting cast is entirely believable, even if their effortlessly affluent lifestyle takes a bit of swallowing. Genuine surprises at the end. This is a thoroughly satisfying evening at the movies.","user":"lauriemar","rank":[244,342]}]