[{"title":"Make no mistake, this isn't a comedy...","rating":7,"date":"27 November 2005","review":"I had heard this movie described as a black comedy by some. And when one thinks of Harold Ramis, they think of his ingenious work as a director of comedies. But this is a different Harold Ramis. What he has fashioned is \"film noir\" all the way.<br><br>John Cusack works perfectly with the material, not so much in a Humphrey Bogart kind of way as in a Fred MacMurray sort of way. He's the average guy protagonist. He just happens to be a Witchita attorney for a Kansas City political boss.<br><br>The film begins when Charlie Arglist (Cusack), with over two million in stolen cash, jumps into the car with partner-in-crime Vic Cavanaugh (Billy Bob Thornton). Throughout the evening Charlie encounters strip club owner Renata (Connie Nielsen) and drunken colleague Pete Van Heuten (Oliver Platt, his fist scene-stealer in a number of years).<br><br>The character of Pete offers some great comic relief to the story. He's Charlie's best friend, drunk on Christmas Eve. He's also married to Charlie's ex-wife, and hating it. This leads to an awkward encounter with Charlie's kids and former in-laws.<br><br>Thornton is still finding new ways of being corrupt and amoral. Connie Nielsen is a classic femme fatal in the 1940s style. Mike Starr is good as usual, playing a menacing mob enforcer. Randy Quaid does his usual best as Kansas City mobster Bill Guerarrd. And bit player Ned Bellamy, cast as a strip club bouncer with Mom issues adds some fine scenes.<br><br>This is about the most straight-forward \"noir\" I've seen since Lawrence Kasdan's \"Body Heat,\" but as directed by Ramis, it feels slightly like a Coen brothers movie, with the occasional comic twists to the genre, and the casting choices of Thornton (\"The Man Who Wasn't There\") and Starr (\"Miller's Crossing\").<br><br>It's not the best movie of the year. But it's good for people who aren't so anxious for a \"white\" Christmas.","user":"tghoneyc","rank":[105,119]},{"title":"The Art of Moodiness","rating":8,"date":"6 January 2007","review":"The Ice Harvest is attractive to two audiences, those being the film noir and/or crime fans and the people who think a movie with Cusack and Thornton directed by ex-Ghostbuster Ramis is going to be a mishap-riddled caper comedy. Unfortunately, this film's heart lies outside of the compatibility of either. It's technically not a crime film, because the story begins immediately as the crime ends, a $2 million embezzlement scheme that is never explained. Also, the film is certainly not a comedy within the ballpark of any other work by Harold Ramis. What Ramis has made is a film that is more of a dramatic exercise in cinematic mood and low-key atmosphere. The good news is that he pulls it off very well.<br><br>The Ice Harvest happens to be one of the movies I watch at Christmastime, because the film is actually so well-directed and so well-shot that it captures that constantly sought-after perfect cozy winter atmosphere on film. The events of the story occur over the course of Christmas Eve and Christmas Day, all in the small and quiet town of Wichita, KA. No matter how much time it spends during the outlandish drunken bouts of Oliver Platt or the destructive tantrums of Ned Bellamy's overaggressive bartender, The Ice Harvest never breaks its meticulous feeling and image for one moment.<br><br>Even though it's not what is expected by the vast majority of those who have seen it or those who mean to, it does have impressionistic characteristics of those expectations that deliver sensationally, such as Thornton's tremendously entertaining time on screen and the thicket of distrust that ushers in over the course of the holidays succeeding his and Cusack's so-called perfect crime. However, these are purely part of the style rather than the substance. The plot is conjecture of film noir rather than the real deal, as most of the twists are nearly meant to be somewhat obvious or expected. Really, the essence of the story lies in Cusack's descent into complete detachment from any virtue in life, feeling as if he's only an observer when encountering darkly humorous yet brooding things over his Christmas.<br><br>The Ice Harvest is not really a comedy and not really a film noir. Actually, it bears no genre per se. Simply, it's a wonderful installment in the phantom subgenre of cinematic moodiness.","user":"jzappa","rank":[30,35]},{"title":"\"As Wichita Falls... so falls Wichita Falls. \" - Charlie (John Cusack)","rating":7,"date":"7 December 2005","review":"There's something about a dark, violent and offensive Christmas movie that sends me through the roof. I loved 'Bad Santa' and 'Die Hard' is my second favorite Christmas film (if you can call it that, I can) of all time. 'The Ice Harvest' looked very entertaining from it's previews and starred a talented group of actors including John Cusack (Grosse Point Blank), Billy Bob Thorton (Bad Santa), Connie Nielsen (Gladiator), the hilarious Randy Quaid (National Lampoon's Christmas Vacation) and the even more hilarious Oliver Platt (Showtime's 'Huff'). 'The Ice Harvest' was even directed by the great Harold Ramis (Caddyshack, Groundhog's Day). Yes, 'The Ice Harvest' had all ingredients to be a very decent black Christmas movie. In the first fifteen minutes of 'The Ice Harvest' I was sorely disappointed in it's quality, but by twenty-five minutes in, I enjoyed every dark minute. It is by far the most twisted Holiday movie I've seen (dark sh*t, real dark sh*t), but I was enthralled through the lot of it. <br><br>'The Ice Harvest' is based on the not-so-well-known novel. It follows big-time dead-beat dad mob lawyer, Charlie Aglist (John Cusack). Charlie decides he wants to make it big so with the help of a local Witchita goon, Vic Cavanaugh (Billy Bob Thorton) he rips off his violent mob boss client, Bill Guerrard (Randy Quaid). This all happens on Christmas Eve day, and he and Vic leave Witicha that night. All they have to do is act normal for 24 hours -- that turns to DISASTER! The two somehow get pursued by the mob, deal with a perky but wise bad-ass business lady Renita (Connie Nielsen), get the cops involved and somehow manage to get Charlie's ex-wife's new drunken dipsh*t husband, Pete (Oliver Platt) involved. It's going to be one hell of a night!<br><br>Like I said before, 'The Ice Harvest' is very slow during the start but really speeds up twenty - thirty minutes into it. The writing is solid for the most part (some of it is unbelievable), but the reason I liked it so much was because it was unpredictable. In the theater, I honestly had no clue what was going to happen next, and that is damn hard to find in a film now days. Harold Ramis does another great job directing this, and the cast is fabulous. Cusack and Thorton shine in their roles, Quaid is surprisingly perfect as a cutthroat mobster, Connie Nielsen handles her role okay for the most part, but the real stand-out is Oliver Platt. Platt is absolutely hysterical every second he is on the screen including a hilarious scene with him showing up drunk at his uptight parents-in-law's house for Christmas Eve dinner. 'The Ice Harvest' is enjoyable but it is nothing brilliant. It has it's flaws and displays them, but 'The Ice Harvest' wasn't meant to be groundbreaking, just entertaining (which it wildly succeeds in).<br><br>I was surprised to hear this was doing terrible in the box office. I think a lot of people would get a kick out of it, at least those who had the stomach for it. 'The Ice Harvest' is very violent, dark and sick and some of the more conservative and weak-hearted movie goers will find it's material offensive and pure rubbish. I personally loved it because it was sick and unpredictable. It was no Oscar contender, but it kept me on the edge of my seat. I haven't been on the edge of my seat in a movie theater in a long time. Thank you for another fun and quirky black comedy, Harold Ramis. Grade: B (screened at AMC Deer Valley 30, Phoenix, Arizona, 12/02/05)","user":"MichaelMargetis","rank":[44,55]}]