[{"title":"Heartwarmingly sublime","rating":10,"date":"14 August 2010","review":"Just finished watching Paper Man and I wanted to express what a great film I think this is. From beginning to end the movie is touching and full of sublime humor. Sometimes happy, and sometimes sad, the emotional weight leaves you feeling for all of the characters. Jeff and Emma turn in fantastic performances and Ryan's presence brought a smile to all of his scenes. Anyone who has ever felt a bit lost in life will instantly connect with this film, it is inspiring and reminds us that great movies can still be about the little things and characters in all of us. For a debut film, the directors are off to a great start, we need movies like this to remind us that film can still be an art, and does not always have to be about CGI blowouts.","user":"vyperxxx","rank":[88,106]},{"title":"Quite amazing.","rating":7,"date":"13 August 2010","review":"Alright, well I sat down to watch this movie without having a single clue as to what it was all about. I hadn't read anything about it, heard anything about it, or even googled it. I just sat down and watched it. I had expected it to be in the comedy corner, but it sort of isn't a comedy at all. Nor would I say it is a classic drama, but more of a movie about growing as people and coming to terms with whom and what you are.<br><br>The story in \"Paper Man\" is very warm, heartfelt and straight forward. It moves forward in a good pace, and you are never left bored throughout the course of the movie. Now, the movie is obviously kept afloat by the superb acting performances of Jeff Daniels and Emma Stone. I think this is one of the best roles I have ever had the pleasure of seeing Jeff Daniels in. Not saying that his previous work is bad, just that this is outstanding. And Emma Stone worked so well opposite Daniels in her role, despite being that much younger than Daniels.<br><br>The role of Ryan Reynolds, well it was essential to the movie, although I think it would have worked better with an unknown actor for that role. But still, Reynolds is not a bad actor, but he didn't really shine through in this role, at least not for me. Lisa Kudrow performed adequately as well, although it did seem like her character didn't come off as strong on the screen as it was intended.<br><br>You might think a movie like this would be for a female audience, but I found it to be very nice, as a guy. The story is captivating and the performances are good. The story is not at any point too sassy, and at the end of the movie, you come to appreciate the movie for what it is. A unique piece of cinema about how people grow.<br><br>This is definitely not a movie you should let pass you by. Do yourself the favor and sit down to watch it (with or without your significant other). This is a very, very nice movie.","user":"paul_haakonsen","rank":[83,106]},{"title":"When the world is in peril, When Evil surrounds you ...","rating":10,"date":"28 August 2010","review":"No matter your sex or what is your age difference, when you find a friend, if it is sincere, you have found one.<br><br>A one you can cherish, take care of, and don't listen to others prohibiting you of, because of rules and rules.<br><br>Hat's off to Writers, Directors, Jeff Daniels and Emma Stone. Emma, please give your DNA to a sort of preservation bank, perhaps we or our kids get a chance of having your clone as a friend or more if it worked out ;)<br><br>A small movie like this, playing with your imagination, emotions and feelings, up to this level? This must be either a proof to talents or something just ran off the normal Hollywood's crap line of production accidentally! /s<br><br>Want to witness real talent, feeling yourself in their place? Then this is your chance to appreciate a rare feel good movie, so real, you think you are Richard Dunn. (obviously I'm a male!)<br><br>I'm still looking back at the cupboard waiting the fantastic Ryan Reynolds as Captain Excellent to jump out of it!<br><br>I wish one day I could find a friend like Abby, giving some sense to my life.<br><br>Thank you for such a movie. These are the ones we support with our pockets not those 200 Gazillion Dollar ones targeted only for money and as empty as the popcorn box or the cola bottle at the end.<br><br>Open a bottle of wine, and taste this movie with, preferably a Friend.<br><br>Cheers!","user":"RainbowCastel","rank":[55,71]}]