[{"title":"A decent, fun filled movie that will keep you entertained","rating":7,"date":"8 February 2008","review":"I work at IMAX theaters, and we showed an advanced staff screening tonight. Having been surrounded by posters and trailers for Spiderwick Chronicles for months, I was already sick of the film before I even saw it. But I went into it with an open mind, and found myself pleasantly surprised. The plot centers around a broken family that moves into an old house that has been in the family for years, in hopes of \"starting over\". Freddie Highmore plays two roles, twin brothers Jarod and Simon, and does an impressive job at keeping the two personalities distinct and different. Jarod, the angsty protagonist of the film, discovers a book (titled, the Spiderwick Chronicles) written by his late great uncle depicting in explicit detail the creatures of a \"hidden world\" all around us. Jarod reads the book, and in the process awakens an evil Ogre and a horde of goblins hell bent on obtaining the knowledge hidden within the book to destroy mankind, and creature-kind as well. The pacing is decent, and the acting works well within the context of the film. Oddly, it's the adult actors that deliver the lamest lines, as they seem profoundly out of place in this otherwise fantasy and child actor filled film. The CGI effects were well implemented too, with various characters and creatures popping up here and there to provide comedic relief, and often, pivitol plot development. The various supporting characters do a great job of keeping things moving, most notable being Jarod and Simons sister, Mallory, played by Sarah Bolger, who delivers a great performance. Having never read the books, I can't make any comparisons, but what I saw in the film I liked quite a bit. Not the most complex of movies, and there are some glaring plot holes here and there, but overall, it holds up pretty well, albeit some wonky script writing here and there.","user":"nubby_G","rank":[109,132]},{"title":"Although The Spiderwick Chronicles did fall short in comparison to other films in the same genre, it did offer some fun entertainment for the entire family.","rating":7,"date":"15 February 2008","review":"Although The Spiderwick Chronicles did fall short in comparison to other films in the same genre, it did offer some fun entertainment for the entire family.<br><br>Being a fan of most fantasy novels and films, I had the wonderful opportunity to read through the entire series last year and was actually looking forward to its adaptation on the big screen.<br><br>What surprised me the most was actually the length of the film. It was fairly short (90 minutes) and I felt that the producers made a huge mistake by attempting to cram all five books into one film instead of dividing them into separate features. I had recognized a few of the scenes from the books, but overall it seemed very rushed and excluded many of the series most exciting moments. Any fan of the books would probably be disappointed in the way the series was handled and executed.<br><br>As for the rest of film, I thought it was well done. The CGI continues to be to focal point in most of these types of family films and the producers spent a great time with its detail and design. The fairies looked neat, the goblins were frightening, and the big bad ogre looked well big and bad.<br><br>Overall, I would say this film would make for a great matinée on a Sunday with the kids. There are several moments that may scare children under the age of five, but otherwise it should appeal to children of all ages.","user":"trench-4","rank":[51,62]},{"title":"Bird! Bird! Bird!","rating":10,"date":"10 March 2008","review":"Went to a UK preview tonight and this completely took me by surprise. A brilliant fantasy adventure which retains it's dignity and doesn't sell out for a cute Disney style box office attack.<br><br>The issues in it were quite good and realistic and it wasn't necessarily 'happy ever after' in the end. The scripting and the style of the piece reminded me of 'The Princess Bride'- although this is more of an action adventure than a comedy.<br><br>Well worth seeing, and there doesn't seem to have been much 'hollywood tailoring' such as there was with the Golden compass and Narnia...<br><br>As to the monsters / fairies- they were very well done indeed, quite believable considering they were computer generated.<br><br>Well worth seeing, but I have the feeling it won't get as much publicity as the usual run of the mill children's movie...<br><br>Why do I keep saying children's movie when I am 34?","user":"DancefloorTerrorist","rank":[73,91]}]