[{"title":"Dark is rising, interest is falling","rating":2,"date":"6 October 2007","review":"If you were to take the Harry Potter film franchise and remove all the memorable characters, fun, adventure, and coherent narrative storytelling, you would get The Seeker: The Dark is Rising. While not completely unwatchable and competently made, the film has no sense of wonder. That's quite an amazing feat when you consider it centers around a kid with numerous superhuman powers, and surrounds said kid with themes of time travel, villains who can summon swarms of crows and snakes in an instant, and an apocalyptic snow storm that could bring about the end of the world.<br><br>Our young hero is Will Shanton (Alexander Ludwig). Will is your average awkward teen struggling to fit in after his father's job forced the family to move overseas from America to England. He's just turned 14, and has also just discovered that he's part of a prophecy that he never knew about. Supposedly, thousands of years ago, there was a great battle between the forces of Light and Darkness for control of the world. Light won out in the end, but Dark is vying to make a comeback. The Dark is represented by a villain called The Rider (Christopher Eccleston), named so because he rides around on horseback. The Rider keeps on appearing before our young hero, and sending demonic mall security guards and evil grannies who can summon snakes after him. He claims to be looking for \"the Signs\", but Will doesn't know what he's talking about. Fortunately, there are some people to help explain Will's destiny, and explain the plot (but do little else). They represent the \"Light\", and inform Will that he is the \"Seeker\", and that only he has the power to seek out six Signs - powerful artifacts from the past that hold the fate of the world. As the Seeker, Will gains various powers including super strength and traveling through time, of which only the time travel one seems to be of any use to him in his search.<br><br>All the ingredients are here for a fun fantasy adventure, but The Seeker: The Dark is Rising doesn't even seem interested in itself. This movie has such a shocking lack of wonder and whimsy, two things all fantasy adventures must have. The incredible keeps on showing its face throughout the story, but the movie forgets to allow the characters to react or even respond to it. At one point, Will's younger sister discovers her brother's power first hand when she accidentally travels through time with him. How does she react to this? She doesn't. She finds herself transported thousands of years in the past in the middle of a battle, and all she cares about is that she rescued a kitten from the battlefield. She doesn't even ask her brother what's going on, nor does she ever bring it up again in a later scene. She does, however, keep on clutching to that little kitten she found for the rest of the movie. I guess time travel, super powers, and the fate of the world itself just can't hold a candle to the adorableness of a kitty cat.<br><br>The storytelling employed here is of the most basic and episodic quality. Things happen out of sheer coincidence or dumb luck. I mean, what are the odds that all of these Signs Will is supposed to be looking for all seem to be within a three mile radius from his house? He doesn't so much \"seek\" these things out, rather he stumbles upon them. He goes to church for Sunday service, and wow, there's one of the Signs he's looking for! Whatever the case, can it really be qualified as an adventure if the hero is hardly forced to leave his own house? For all the characters' talk of prophecies and darkness destroying the world, everyone in this movie sure seems to be taking it in stride. They even still have time to celebrate Christmas, even the ones who know the world could end in five days.<br><br>For all its mistakes, The Seeker is not without some merit. The opening moments has a mysterious atmosphere, and got me interested before the movie decided to brush off its own explanations. It's kind of like finding a beautifully wrapped package, opening it, and finding a ball of lint inside. It's at least interesting before the disappointment hits. The first 20 minutes or so have hope and the promise of wonder, then the movie just kind of craps out and loses interest in itself. It's odd to think that The Seeker is more comfortable dealing with the ordinary rather than the extraordinary. If the people behind this film were behind the Harry Potter series, the \"Muggle\" world would be more interesting than Hogwarts. I don't think I even have to explain what would be wrong with that picture.<br><br>The Seeker: The Dark is Rising is based on a very famous children's novel by Susan Cooper. I have not read this book, but I have a feeling that this adaptation is missing what made the story so interesting in the first place. Here is a story that cries out for the fantastic, and gives us people who don't even seem to notice it. Those kind of people don't deserve to inhabit a story like this. We need a hero who shares our sense of wonder. All we get with Will is someone who discovers he has the power to change the world, and says \"that's nice\", then walks away.","user":"keiichi73","rank":[97,115]},{"title":"Worst adaptation EVER","rating":1,"date":"8 October 2007","review":"I was beside myself with glee when I first heard of this movie. The book it is based on has been a book I have read and reread as well as given to children and adults alike over the years. So I was HORRIBLY disappointed at the changes made in this adaptation. Key elements left out, characterizations gutted, the mythos it was based on trivialized.<br><br>After such great adaptations as LotR, Narnia and the Potter books to see this classic ruined was a sad sight.<br><br>The books concepts depend on British folktales and legends (Arthurian based) and the movie seems to have tossed that aside in an attempt to woo American audiences. The family is changed, leaving out the close knit structure that is the basis of the story.<br><br>Don't see this movie. Don't let your kids see this movie. Do yourselves a favor and read the book.<br><br>Someday someone will make this movie with an eye to the source material.","user":"wytchcat","rank":[235,302]},{"title":"Story and Originality are almost officially Dead","rating":2,"date":"15 October 2007","review":"If you saw the preview and thought \"Pass\", I would call you prudent. If you have been a fan of Susan Cooper's beloved book series since you were a kid, saw the preview and thought \"Maybe it won't be as bad as it seems...\", then I weep for your broken childhood love. If you were like me and thought \"Even if it is cheesy, it might turn out to be fun\", then I'm giving you a Get Out Of Jail Free card with this review. It is not enough that we must be subjected to one-dimensional characters, painfully predictable dialogue, hackneyed plot lines, cliché villains, headache-inducing camera work, and one of the worst climaxes ever recorded. No. Not by a long shot. The atrocity here runs deeper. Our intelligence is insulted, our tastes are ridiculed, and our freedom of choice turns on us and squeezes its fist around our throats. This film registers as a negative, a black hole, in the canon of cinematic creations. There were parts where I imagined the producers saying, \"Just leave it that way. They'll never notice\" or \"You don't have to explain that, it'll fly right over their heads.\" I understand that the budget for this film was (gasp) a measly 20 million dollars, but lack of financial resources is NEVER, EVER an excuse to feed gold-plated crap to the masses. Christopher Eccleston fans may get a slight quiver of a laugh out of his (failed) quirky turn as The Rider, the wraith-like shape shifting ambassador of \"The Dark\". But in all seriousness, I think he may have just needed a few extra bucks for a down payment on an Aston Martin he might have had his eye on. Otherwise the acting is not even a subject to be brought up, since cardboard cutouts don't require much effort to portray. The special effects are where all the money went, and they're fairly decent. Though I refuse to count this as praise, any more than I would appreciate a smattering of whipped cream on the top of a rancid pile of stinking, eight-week old peach cobbler.<br><br>In any fantasy, there are rules that must be set and limitations where magic is to be found. Otherwise, the whole thing becomes a free-for-all that never holds any kind of credibility. I don't think I have the time or the energy to describe all of the problems, violations, and inconsistencies I saw occur within this film that barely topped two hours. It would be a real challenge for someone to sit down and try to catch them all. There was no respect for the genre here, just a seemingly voracious need to exploit the current fantasy craze. If after The Lord of the Rings, The Chronicles of Narnia, and Harry Potter, the bigwigs in the studios think that this sort of thing can pass as acceptable, then the legacy of Story is over already. Yes, I am being overly dramatic, but at this point, it's too late to turn back. Time once lost is not recoverable, money once spent requires more labor to regain, and the wish to walk away from a story feeling like we've been entertained, had our minds and hearts opened, once dashed is hard pressed to be soothed back again from boundless feelings of deep discontent and a sense that we have been robbed. It breaks my heart, and I left this film genuinely livid.","user":"bluemandolin1","rank":[108,137]}]