[{"title":"It is what it is.","rating":6,"date":"26 April 2009","review":"Fans of Sci-Fi have had to withstand much worse offerings than this movie. I was entertained and the movie kept my attention. I had, originally, just started it as \"background noise\", but had to rewind it because it began to draw my attention. I watched the making of and, considering the the budget they had to work with, the fact that they used models and matte instead of CGI, the special effects could have been a lot worse. I felt the acting was believable and I didn't see any obvious holes in the plot. I'd watch it again and would recommend it to a fan of Sci-Fi. <br><br>I've never understood the indignation of some of the posters on these boards. The movie wasn't over-hyped and is, honestly, quite enjoyable.<br><br>I think the cast,crew, and special effects teams all deserve a thumbs up.<br><br>Just my humble opinion.","user":"likeshiminleather","rank":[121,135]},{"title":"Classic B-Movie, with non-stop action and thrills!","rating":8,"date":"19 April 2011","review":"This is definitely one of the best, all-out sci-fi action movies i have ever seen, with all the characteristics of a classic B-Movie; static characters, simple yet effective plot, actually good one-liners, super-digital CGI (helps give the classic feel), and best of all; enough bloody, nasty, and violent action that makes this a great watch! Out of all the characters, Thomas Jane's performance is actually quite good, filling in the shoes of a good character that you can remember and come to like, surprisingly. The run time is good, doesn't drag anything out, but one BIG disappointment was the special \"Director's Cut\" released on DVD; it's not nearly as good as the theatrical version!! But even so, this is a definite must watch for all sci-fi/action/horror fans because in the end, this movie is a fun ride that needs no expectations except to know that the action and suspense cover for all the flaws 7.5/10 Stars***","user":"slayerjmk95","rank":[18,19]},{"title":"Surprisingly Good","rating":7,"date":"15 August 2009","review":"So, going into this film, I was not expecting to much. However, after watching this film, I can say I was impressed. There were good actors with Okay rolls. I also have to say, this is what CG effects and backdrops were used for, to give low budget films the interesting environments and effects without killing the budget.<br><br>To say the least about this film, it ranks as a top notch SyFy Channel movie. Yes, there are a couple movies on that channel that were good films, and this would be comparable, at the least, to them.<br><br>Admittedly, you don't really \"feel\" for many of the characters, other than Sgt. Hunter. His character, of course, was the primary of the bunch, so that makes sense. The remainder of the cast is just for support, and add for drama.<br><br>I have to say, I would like to see a sequel, considering how the film ended. I won't go into that as not to spoil anything.","user":"reverend_darkshadow","rank":[27,31]}]