[{"title":"Vulgar, Sure, But Certainly Not Stupid.","rating":8,"date":"22 October 2007","review":"I've noticed a lot of the negative comments about this title tend to focus on this movie's vulgar, 'stupid' humor. Now let's get one thing straight. Knocked Up is vulgar, absolutely it is, but is is not stupid. Stupid humor is crap like \"Mr. Woodcock\" and \"Good Luck Chuck,\" movies with no real craft to any of their jokes.<br><br>\"Jessica Alba fell down!!! Ahahahahahaha!\" <br><br>\"He yelled 'sex' really loud!!! Pssshhahahahahaaheheheheeee!\" <br><br>No. Die.<br><br>Knocked Up, on the other hand, is actually pretty clever most of the time. And even the movie's vulgarity isn't done in an over-the-top, simply-for-gross-out way (cite the fat bitch from Good Luck Chuck). It's what I guess you could call 'relevant vulgarity.' Anyway, the movie is extremely funny. Every joke is naturalistic, but not expected. The movie's characters are all convincing and multi-dimensional, and above all likable. Seth Rogan really does make the movie, though. He is hilarious, but he comes off more like a real nice, frank, down-to-Earth guy. Just the kind of guy you'd like to sit down and have a beer with. The kind of guy you'd more than like to get smashed with. The kind of guy you'd really like to have ill advised unprotected sex with. The kind of guy you'd love to raise a bastard child with. Needless to say, he's the reason the movie works.","user":"RabidED990","rank":[246,363]},{"title":"Clever Writing ....","rating":21,"date":"21 December 2008","review":"Although the subject matter wasn't really appealing to me, the critics and general audience reviews are right: this is a very well made movie. The acting is great, the plot fast-paced, the characters believable and the dialog witty and clever. It reminds me of Superbad - another movie that I would never normally see, but one which wins you over by it's sheer (albeit crude) brilliance.<br><br>The basic premise is simple: a young TV reporter celebrates a promotion by getting drunk and inadvertently pregnant. The father-to-be is a good natured, pot-head slacker who has no money. When she decides to have the baby, she's not sure what her relationship with the father should be... and the movie progresses from there.<br><br>It's a simple plot but the dialog is what makes this movie shine. No matter the scene, it was always fun to hear what the characters were going to say. Even though most of them were one-dimensional, the dialog made them seem human and easy to relate to. A fast-movie plot also kept the movie moving along - something was always happening and there was never a dull moment.<br><br>While there is a certain level of crudity throughout, the movie is generally lighthearted and innocent. It's a fun movie to see.","user":"Vic_max","rank":[43,60]},{"title":"A simple story is made into a very entertaining comedy","rating":9,"date":"15 April 2007","review":"Ben Stone (Seth Rogen) meets Alison Scott (Katherine Heigl) at a bar, they get drunk and have a little fun afterward, then they part ways. That is, until a few weeks later, Alison discovers she's pregnant and Ben is the father. This simple story makes up the hilarious film Knocked Up. I really enjoyed this, it has a lot of great laughs and it also has a lot of heart spread throughout.<br><br>Seth Rogen does an excellent job, I'm glad he's been given the chance to be the lead in such a big film. And Katherine Heigl is equally entertaining. The two of them are so great together, they're just so much fun to watch on screen. The supporting actors are also wonderful. Leslie Mann and Paul Rudd are perfect together. And I think Kristen Wiig steals the show with her small yet hysterical role as one of the workers at E!.<br><br>When people go to see this they'll want to compare it with 40 Year Old Virgin. Though I'm not a big fan of comparing movies to other movies, I guess I'll have to go through with it. For me, 40 Year Old Virgin is a funnier movie, but Knocked Up is a better written film and it has more heart to it. Both films based their story on a simple premise (a nerdy 40 year old hasn't had sex, a guy has a one night stand and gets the woman pregnant), but it seems like 40 Year Old Virgin used its idea to just get laughs. Knocked Up, on the other hand, uses its set up and continues the story throughout the film, developing its characters.<br><br>So, Knocked Up is a very enjoyable film, it has some big laughs (I particularly love the side story with the bearded roommate) but its also very sweet at times. I'm sure people will love it. See the movie and you'll get more than just laughs.","user":"se7en187","rank":[237,388]}]