[{"title":"Gritty gem with strong, committed performances","rating":8,"date":"24 November 2006","review":"In a run-down public toilet in London at 3.07 am, the middle-aged prostitute Kelly takes on the 11-year-old runaway Joanne. Together they take the train from London to Brighton to escape Kelly's hard-edged pimp. The film explores the mother-daughter-like bond that forms between the girls as they are left to fend for themselves in the gritty underworld of South London.<br><br>Paul Andrew Williams has done something remarkably cool here that he did not realise until his film started receiving praise and wider distribution (it even made its way to the Stockholm International Film Festival, where I saw it). Nevertheless, we can easily tell that this is a quality film with excellent performances by its two leads Lorraine Stanley and young Georgia Groome. Although the seedy underground and hierarchies of bad guys, johns and pimps channel Guy Ritchie and Matthew Vaughn, director Williamsm stresses that London to Brighton is \"not a gangster movie\", but an unflinching look at the two aforementioned characters and how they cope under pressure.<br><br>The plot is left best unspoiled because it is gradually unfolded through well-positioned flashbacks, arguably the goldmine of the film. The first half of the film has a few pacing problems as nothing truly jumps out and grabs you  but when the unspeakably effective background segments are interjected London to Brighton receives a well-deserved jumpstarting kick up the arse, continuing down a perfectly-paced path. One of the most poignant scenes sees Kelly's pimp ask 11-year-old Joanne if she is a virgin, and subsequently telling her to have sex with an older man. The amount of smoking, cursing, screaming and beating that goes on around her is heartbreaking.<br><br>This would not be the case with a lesser actress. The fact is that Georgia Groome inhabits Joanne so effortlessly and deeply that it is a sight to behold. Her crying performances wrenches your heart. Other than the perfectly-cast Groome, the director told us that he applied no seriousness to finding the 'perfect people' for the respective characters: the guy in the green jeep, for example, was cast because \"he had a green jeep\". In this way a gritty, unpleasant and plain cast presents itself  an ordinary pack of South London criminals. Better yet, they truly emote. When Kelly and Joanne down the sour rum &amp; coke that the older man has given them, you can feel the bitter aftertaste of the drink.<br><br>'London to Brighton' has been likened to Mike Leigh's Naked, and perhaps this is an apt comparison. What remains clear, however, is that Williams has served up a deliciously gritty and unflinching drama in the midst of chaos, which he occasionally pauses with wonderful slow-motion captures and dreamy shots of the windy barren boardwalk of Brighton. It's bruised, realistic, harrowing and compelling  a very good watch.<br><br>8 out of 10","user":"Flagrant-Baronessa","rank":[56,68]},{"title":"Gritty, scary - and brilliant!","rating":8,"date":"12 December 2006","review":"I can't recall the last time a film had such a visceral impact on me. Coming out of the cinema after watching \"London to Brighton\" I felt my senses reeling and the adrenalin pumping as if I had just stepped off a particularly fiendish theme park ride.<br><br>There's a grim nastiness running throughout this story, interwoven with a thin thread of maternal compassion. Life is hard and hopeless for these people. They have few choices open to them. Their environment is sordid and gloomy. Even the seaside resort of Brighton is cold, windy and desolate.<br><br>But what lifts the audience out of what might otherwise be a depressing experience is the storyline which builds excitement and fear to the point where my friend felt he had to get up and actually leave the auditorium! Without revealing the plot, I can say that had he stayed, the final scene  which in no way strays from the noir  would have rewarded his perseverance.<br><br>The cast turn in convincing performances and Georgia Groome is excellent as the young runaway.","user":"mark-1079","rank":[47,57]},{"title":"A New Talent","rating":10,"date":"4 September 2006","review":"The fact that the Edinburgh International Film Festival bestowed their New Director award on Paul Andrew Williams is a solid enough indicator of the strengths and unique qualities of London TO BRIGHTON. Admittedly made on a shoe-string budget, and cast with relative unknowns, the film never once looks cheap or out of its depth. I was amazed when I saw it at Edinburgh by just how tough and unflinching a portrayal of the criminal underworld it is. The leads put in tremendous performances that will surprise many, and William's writing is exceptional. The film really zips along through its 90min length, and pulls the viewer in to a lock-tight embrace. In my opinion this film is one of the highlights of the year so far and a real find for the British film industry. For a first-time director working on a tiny budget, getting five star reviews in the Guarduan and Scotsman, and great praise from the Times is a hell of an achievement. I hope other people who love British cinema see it when it is theatrically released.","user":"sam-1051","rank":[49,69]}]