[{"title":"A self-hating horror movie?","rating":11,"date":"11 February 2009","review":"This movie is, above all else, confused. It tries to talk you into believing that it's a tribute to classic campy slasher films, it dazzles you with good production design, cinematography and some fairly decent actors, but ultimately it turns to tired slapstick and surrealism without purpose, all courtesy of the only horrifying aspect of this movie; the script! Maybe it isn't a tribute, maybe it's meant as satire or some kind of black comedy? I can't tell! Even if that's the case, it's not funny because the jokes are mostly based around how unfunny horror movies are, and this is clearly one of those unfunny horror movies. Violence is plentiful and graphic, like the genre prescribes, but it is only there as a reference to other films or for purely gratuitous purposes, so in effect it's either unoriginal or holding up the story. The characters are consistently written in a way that at best, makes you not care about them at all and at worst, quietly hoping that they are next in line for swift death. If a bunch of college kids had made this movie and put it on the Internet, it would have been sort of an impressive effort. As a \"real\" Hollywood movie, it's depressing and begs the question; Who the hell would green-light a script like this? My advice: pick any one of the 20+ classic horror movies that this movie references and watch that again, odds are good that you'll have a better time!","user":"alven75","rank":[10,12]},{"title":"Hack!","rating":6,"date":"6 February 2009","review":"A class trip to an island turns into a nightmare as the college students hoping for a high grade to boost their GPA fall prey to their hosts, a married couple, obsessed film buffs, who record those they murder in ways associated with horror movies.<br><br>This, at first, appears to be just another formula slasher. You have a check list of stereotypes that normally appear in slashers and can pretty much mark an X by the characters who will die as the film continues. But, what sets it apart from the fray of the usual is the wicked sense of humor, expert casting of genre veterans, and some perverse acts by a bizarre couple of psychos. But, also important is that HACK! actually plays against norm in that a guy actually is the one at the end fleeing from killers. And, a specific twist regarding a third(..and possibly fourth)party perhaps involved with the psychotic duo certainly adds to the terror for our hero, Jay Kenneth Johnson(..as the hunk Johnny)as he must find a way out a very sticky situation as his friends are dead and his options of escape are limited. Danica McKellar(..the cutie from Wonder Years)is \"nerded\" up as the unflappable, scholarly Emily, but we all know that a pair of glasses and braided hair can not mask the babe underneath the disguise. Emily is google-eyed for Johnny, who, in a change of pace for a slasher film, actually takes up for her when fellow classmates poke fun at her supposed dorky nature..yet, Johnny is still able to gain rapport with his fellow students because he's just a cool dude. The rest of cast are merely supplying cultural stereotypes bound for violent death..a dumb, impolite jock quarterback needing a high grade to make his football team, a sexpot, a foul-mouthed, weed-smoking skank, an Asian homosexual whose sexual orientation is the butt of many jokes and gags, and the token black character who supplies the pot, talks ghetto and is always trying to dial up someone on his cellphone that doesn't work(..imagine that). Most of these characters service the film as victims running through the island woods as the predators give chase. There's a dungeon the loonies have, a chamber of horrors where destroyed victims, grisly corpses, are used as set-pieces for memorable images in movies like Hellraiser &amp; Texas Chainsaw Massacre, and one captured character is held in a large bird cage over a piranha-infested water hole! <br><br>Surprising number of recognizable faces pop up in minor parts such as Kane Hodder(..as the opening victim trying to escape from his pursuers), Burt Young(..as a crusty boat captain who takes the crew to the island), Tony Burton(..as nervous Sheriff Stoker, who worries that something dire has happened to the kids when they don't return;he has a scene with ROCKY co-star Burt Young which might bring a grin to fans' faces), William Forsythe(..as a gruff Irish island fisherman who attempts to save the day, and has some memorable exchanges with the psychos), and Lochlyn Munro(..as Burton's moronic deputy). Lots of in-jokes such as the names of the crazies, Vincent King(Sean Kanan, whose chiseled features and clean-cut looks adds a unique dimension to his nutcase)and Mary Shelley(Juliet Landau;who's always obviously a bit weird, her camera by her side at all times ready to record even the most mundane occurrences for a \"new movie\"). Even the professor, who is to chaperon the students, is named Mr. Argento(..nice!). There also an abundance of references to horror classics and iconic characters popping up in the dialogue. This is made by filmmakers who love the genre and try to express that in as many ways as possible. The violence derives from an ax, hand gun(..rarely a weapon used in horror) shot gun(..makes a real bloody mess of a victim's skull), thrown loose brick, a well(..the homage to The Grudge is quite an eye-opener), clown's hammer(!), chainsaw, and a spinning saw blade(..decapitating a bound person's leg as he screams in horror). A thrown saw blade decapitates a victim whose leaning up against a tree. Lots of gore and viscera. Gabrielle Richens as Sylvia, a foreign exchange student lusting for the quarterback, is quite a looker. Once McKellar is able to shed her geeky disguise..yummy. Slasher fans might embrace this one..it's dark heart is in the right place.","user":"Scarecrow-88","rank":[4,4]},{"title":"I don't even know what to say","rating":5,"date":"27 February 2008","review":"It seems like the writer is a big fan of horror movies with the countless references to many horror classics. I don't think that the actors are the problem of this film, but more so the dialogue. Some of the actors are actually really good, but not in this film, a lot of the dialogue just makes them sound stupid. The writing is really horrible in this. There is no investment in the characters, you don't really care about any of them.<br><br>It seems to me that this film is trying to be a homage to horror films, but instead looks like film saying \"Hey, look at me, I like horror films.\" This isn't just a bad horror movie, it's a bad attempt at a horror movie.","user":"nop_inc","rank":[16,24]}]