[{"title":"Film noire + femme fatale + murder = one terrific movie","rating":9,"date":"2 September 2007","review":"\"You know what they say about cops and donuts\" quips Salma Hayek's character Martha Beck to James Gandolfini in the movie Lonely Hearts, \"they're only good when they have a hole in them.\" This, coupled with Gandolfini's retort \"funny, they say the same thing about women\", captures the essence of the Chandler-esquire dialog that peppers this true crime homage to film noir.<br><br>The movie tells the story of Raymond Fernandez (Jared Leto) and Martha Beck who carved out their own chapter in the annals of crime history during the 1940s as the Lonely Hearts Killers. Together, Fernandez and Beck ran a con game using personal ads to seek out wealthy widows and single women with money. Fernandez would engage in correspondence with the women, eventually meeting them and gaining their trust as well as access to their money. Beck, would accompany him posing has his sister, helping Fernandez gain the trust of their victims, whom the two murdered after they'd drained their bank accounts. At the time of their capture, the body count they'd racked up was estimated at between 12 and 20.<br><br>Directed by Todd Robinson, the grandson of detective Elmer Robinson (played by John Travolta), the story alternates between that of Fernandez and Beck, and pursuing detectives Robinson and Hildebrandt (Gandolfini), with Gandolfini handling the connecting voice-over narration in traditional film noire patter.<br><br>Although some details are condensed for narrative purposes, the story largely sticks to the facts of the couple's actual murder spree, the only glaring discrepancy being the casting of Hayek as Beck, who in reality was a rotund, unattractive, battleaxe of a woman who maintained Fernandez's loyalty by granting his every sexual wish. The producers can be forgiven for opting to cast Hayek instead of a more credible Rosie O'Donnell type, however, as Hayek brings more than mere eye-candy to her role. She plays a sadistic, manipulative, cold-blooded murderer to the hilt, and practically serves as the driving engine for the film's story.<br><br>With a crackerjack cast of Travolta, Gandolfini, Hayek, Leto and Laura Dern (as Robinson's love interest) all bringing their A-game, coupled with a smartly written screenplay, snappy dialog, good pacing, excellent cinematography and direction, the only oddity about this film is that it was relegated to limited theatrical release, largely playing a few festivals before being relegated to DVD. Unlike the case it is based on, this is one crime that probably will remain unsolved.","user":"Craig_McPherson","rank":[28,34]},{"title":"Dramatized True Crime at it finest!","rating":8,"date":"9 December 2006","review":"This is an excellent film. Filmed in a classic \"Film Noir\" style, it is both dark and engaging. The script is well written and expertly crafted. The pace is fluid and the characters are well developed.<br><br>The score is appropriate and effective. It helps create tension and mood without becoming oppressive as many scores do.<br><br>The cinematography is absolutely terrific and creates a dark and intimate view.<br><br>All these elements combine to create an excellent environment for what is a truly inspiring cast. It would be difficult to overstate the quality performances of the entire cast. John Travolta was completely convincing as he always is but I think he may have surprised even his most supportive fans. He nailed the part hands down. In one scene he suspects a dead body is possibly hidden in a box and the mood he creates as he approaches and investigates the box is riveting.<br><br>But the true star of this movie was without doubt Salma Hayek. She was mesmerizing as Martha Beck, a true masterpiece. She played evil so well it was spooky. Most people who watch this movie are going to really enjoy how carefully she seduces the viewer into her despotic plans. This is certainly one of her finest portrayals and shows she has considerable acting depth. A nasty \"femme fatale\" may not be a huge stretch for her but she really did a terrific job.<br><br>\"Lonely Hearts\" is not a family movie. There is plenty of blood, boobs and bad language. The movie deals with very heavy themes like suicide and child murder. And to make matters worse for young ones the story is true. Martha Beck and Raymond Fernandez were real monsters and the movie shows more than enough to make that clear to anyone including kids.<br><br>I am a big fan of true crime and this film is really great. For me at least, it was one of the best I've seen in a long time. If you are an adult I recommend this film. Dramatized True Crime at it finest!","user":"guitarcarl","rank":[71,95]},{"title":"Decide for yourself but I thought it was excellent.","rating":9,"date":"25 November 2006","review":"I'm losing faith in this forum and some of the people that vote here... How can you possibly rate this film as a 1 or 2 or 3? Each to their own I suppose and for whatever reasoning or motives... For myself, I found this movie to be excellent. It held my interest from start to finish - and the finish was satisfying. Gandolfini and Travolta were excellent as you would and should expect. Salma Hayek gave what I think should be an award winning performance. Jared Leto was also superb... I can't say I've noticed him in anything of note before this. It was also nice to see Laura Dern again - I've been hot for her since watching Rambling Rose : ) All I can say is watch this movie and decide for yourself. I definitely recommend it.","user":"apriliam3","rank":[91,135]}]