[{"title":"What a wonderful movie!!!","rating":10,"date":"1 February 2005","review":"This is one of the best, most heartwarming and well acted movies I have seen in a long, long time. I immediately fell in love with all of the characters, especially Ray, portrayed beautifully by Skeet Ulrich. His inflections and mannerisms are superb. Keri Russell has outdone herself as Livy, with her timeless manners and elegant sophistication in handling an awkward situation during an unforgiving era. This is a poignant drama that evokes emotions long since lost in ordinary, mundane television. Congratulations to Hallmark and CBS for providing such outstanding broadcasting, and hats off to Mr. Ulrich...this role is Emmy-Worthy!","user":"LiquidPoetry1921","rank":[60,61]},{"title":"The Best Since the Sarah, Plain and Tall Series","rating":10,"date":"3 February 2005","review":"**** May Contain Spoilers **** Quite bemused by the recent array of Hallmark presentations, their plots questionable and their characters unappealing, I anticipated this time a decent film previewed in the Hallmark Video News. I always liked arranged marriages story lines because of the awkwardness and the development, and I hoped this would not disappoint.<br><br>And it did not.<br><br>I agree with so many previous posters: the settings -- time and space -- are beautiful, the characters respectful to each other, including parent to child and child to parent, and the slow, easy development of the relationship between Ray and Livy. The casting is perfect.<br><br>In a DVD extra, Skeet Ulrich spoke of the need for body language as a means to communicate -- and this is the outstanding feature to this film. Notice all his facial expressions -- raised eyebrows, slight smiles, reddened or full face, turns of the head, and so forth. Their not touching and sideways glances are so expressive. Mare Winningham's looks of concern, worry, or joy are great.<br><br>And the dialogue adds to the high quality: his gentle correction of her when he says, \"Our farm,\" and Martha's reply to her husband's expression of love at her party -- \"I know.\" Plus all the other words spoken -- the two friends at the church -- \"How'd you meet?\" and their looks when Ray, Livy, and covered cake left, one craning her neck -- Slim's tribute -- great.<br><br>So a huge thank you to Hallmark and a plea for a sequel that maintains this perfection -- no surprises, just more of this extraordinary \"ordinary\" story -- with, of course, the same cast. The Sarah series maintained the integrity, parts one through three -- so it's been done well before.","user":"jjr3929","rank":[34,34]},{"title":"Russell and Ulrich shine in \"The Magic of Ordinary Days\" to raise my opinion of Hallmark movies","rating":9,"date":"31 January 2005","review":"I liked \"The Magic of Ordinary Days\" very much because of a combination of things. Set in Colorado in 1944, the movie follows Livy, wonderfully played by Keri Russell. After a brief relationship with a soldier, Livy finds herself pregnant. Her father, a minister, arranges for her to marry a farmer who lives in rural Colorado, but Livy is not happy with the situation, especially since she was pursuing a masters degree in Denver. Ray, the farmer, is willing to marry her and raise the baby with her though. Skeet Ulrich is the shy Ray and is also absolutely wonderful in the role. Russell and Ulrich are great together, even though Livy and Ray seem quite mismatched in the beginning. The movie shows the progression of their relationship as Livy's eyes are opened by the love that surrounds her: from Ray and from his sister and her family, but especially from Ray. Ulrich gives his character a love for Livy so deep that he would do anything for her. Their relationship is tested though when Livy's sister visits and offers to take her back to Denver. <br><br>I usually find Hallmark movies to be quite cheesy, but \"The Magic of Ordinary Days\" is a love story given great depth and played out beautifully by Russell and Ulrich. I recommend it to anyone looking for a cute, feel-good movie with very good acting.","user":"Schaeffer","rank":[47,48]}]