[{"title":"And I don't like horror movies...","rating":10,"date":"15 October 2007","review":"Let me begin by saying I DON'T like horror movies. I don't enjoy jumping in my seat. I don't like being afraid of the dark for the next 2 days, and I usually HATE Spanish movies. So usually I only see the big horror classics, and that is because I've read enough spoilers to confront the movie in a laid-back way.<br><br>Having said this, I was dragged to see this movie against my will. And I was right! I have never, EVER, been more uneasy, uncomfortable on any movie, from the Exorcist to the Prophecy, from Psycho to Halloween. The story seems obvious; the cliché-horror themes are there, and while I saw them coming, I was comfortable enough. But then comes the movie, the script, the score, the acting, all in perfect harmony... and you jump, and you chill and you shout and you wish you had never entered that dammed cinema.<br><br>It is good. It is great.It is moving and horrifying. It does not need CGI, sound effects or unreal characters. Its there. Its real. Its haunting. It WILL be a classic.<br><br>Chapeau!","user":"fmagnet","rank":[468,592]},{"title":"absolutely incredible","rating":10,"date":"29 August 2007","review":"I saw this at the Frightfest and its AMAZING, did the previous reviewer even see it? No real shocks!!, I've never seen a cinema jump like the audience at Frightfest for this film. I'm kind of tempted to name the shocks but I wont. Its such a stunningly made film, creepy, atmospheric, shocking, great story, beautifully directed, the main woman is incredible. I was never really sure if it was supernatural or psychological, but as it reveals...wow, its excellent. Its so well done I cant write more without giving stuff away, but go and see it. I was expecting a low rent \" pan's Labyrinth \" but I think it might be even better than PL, though very different. Best film i've seen in ages","user":"jmsnjms","rank":[328,412]},{"title":"A satisfying thriller on one hand; an equally rich emotional journey on the other","rating":8,"date":"8 December 2007","review":"I went into a screening of this today knowing only that it was about a woman who buys the home she lived in as an orphaned child, planning to open it to other orphans, that it mixed fantasy and reality, and that Guillermo del Toro of 'Pan's Labyrinth' had a hand in it. I didn't have any expectations. Even if I did, I certainly not have expected what I got. 'El Orfanato' surprised me first in successfully thrilling me with its surface, and surprised me again in how deeply it moved me with its core.<br><br>When Laura (the marvelous Belén Rueda) moves back into the house that used to be the orphanage she lived in as a girl, she is thirty-seven, married, and she and her husband have adopted a son - Simón, a little boy with HIV who doesn't know that he's terminally ill or adopted. Simón is wildly creative - he has several imaginary friends and a penchant for treasure hunts, mind games, and the story of Peter Pan. One day shortly after a mysterious visit from a social worker and Simón's revelation that he knows the truth about his adoption and illness, Simón disappears. The rest of the film follows Laura's desperate search for her son as she comes to terms with her loss and her own past as well.<br><br>Screenwriter Sergio G. Sánchez does a masterful job of balancing the thriller with the drama. Laura's attempts to connect with everything that haunts her and her home are darkly touching, though slightly psychologically twisted. The acting is strong, and the directing, editing, cinematography, and music all work together well. Some of the sound effects - the constant creaking, wind blowing, etc. - got wearisome as the film went on, and some of the thrills were a little cheap - I won't ruin it for anyone by revealing them - though, admittedly, they were effective all the same. The story dragged a little towards the end and during the scene with the medium - cutting it just a little shorter might have been equally as effective and easier on the viewer.<br><br>Bottom line: even if you don't like \"scary\" movies (like me), you'll probably still appreciate and enjoy the more thrilling aspects. If you're a horror flick buff, you'll probably find some of the thriller elements a little tired and overdone. Either way, it's still worth seeing - the exploration of Laura's heart and mind are both lovely and tragic to behold, and though the film is morbid, it is beautiful as well.","user":"nonsequitur247","rank":[108,132]}]