[{"title":"Delightful!!","rating":10,"date":"28 November 2005","review":"A delightful comedy of errors, much in the vein of \"Moonstruck;\" but in some ways funnier and more charming. The acting is less over-the-top than in \"Moonstruck.\" It's Shakespearean in its Romeo &amp; Juliet romance, and its comedic errors and misunderstandings. Its odd little plot twists cover a 40-year spoiled romance, an up-to-the minute romance, and provoke an old Italian grandmother into finally speaking, after 20 years of mourning in silence for her dead husband. Vincent Spano and Tony Lo Bianco are charming as uncle and nephew; and Lainie Kazan shines. Patricia Heaton (of \"Everybody Loves Raymond\") is fabulous. This is far better than most made-for-TV movies. I recommend it highly.","user":"rrenon-1","rank":[20,22]},{"title":"Better than most feature films!","rating":10,"date":"5 December 2005","review":"I am so glad I accidentally found this on TV as I was dozing off for a nap on Saturday. It kept me awake and completely charmed me. Not only were the actors very good, the settings were gorgeous (how could they NOT BE in Napa Valley?) and the music was a perfect match. I want to watch this movie again, seriously. Because of her character on Raymond, I've never been a Heaton fan, but she won me over in this movie! I base my opinion for many films on whether or not they made a rainy or cold Saturday or Sunday BETTER. This one DID IT! We could not remember the name of the actor who played the uncle, but we knew him, so when the credits actually named the actors at the end, this movie received a few more PLUSES from us! I recommend heartily!","user":"moonchildiva","rank":[19,21]},{"title":"Great Entertaining Film","rating":10,"date":"30 November 2005","review":"Enjoyed viewing this picture from beginning to end and how two families growing grapes in Napa Valley could have such a strong love and hate relationship. The entire cast of actors gave outstanding performances and I thought that Patricia Heaton,(Sara Rosa) showed her real talents and even rode a horse around the vineyards. This engagement ring was given with great love and in a way, caused a great deal of hatred for many many years among these two families. There is lots of humor, drama and cute romance with husband and wife and some live together couples, getting to know each other. I really think this story of these two famines should be made into a TV series, or at least make up a TV program using most of these fantastic actors.","user":"whpratt1","rank":[14,16]}]