[{"title":"portrayed real life","rating":10,"date":"4 October 2006","review":"As a black girl living in London, I saw how this film portrayed real life. In the scenes at the beginning, in the school, I could relate fully to the events. People may not think that it truly represents black people, or schools in London, I beg to differ. You obviously have not been in a bad enough school. The language used in the film, the slang, is a part of life now. I look at schools on the telly and wish that I do not have to call everyone 'blud'. If I do not, I will get beaten up for 'trying to be white'. Kidulthood was a fantastic film, showing, yes, a different way of life, but a true representation of it. It was actually quite unnerving at how similar life is for my community to that of the film.","user":"sexy_bexi_baby","rank":[46,58]},{"title":"why all the bad ratings","rating":9,"date":"8 March 2006","review":"I am not sure why this film is getting so many poor ratings. It is an excellent piece of film-making with a cracking script, fine performances and imaginative direction. A real eye opener that deserves a wide audience.<br><br>The movie has sparked some controversy in the UK for 'glorifying' the violence, sex and drugs portrayed but that is rubbish, this is essentially a deeply moral tale at heart.<br><br>Mark Kermode gave it a very sensible and measured review on his Radio 5 slot and I am in agreement with him.<br><br>I predict that a number of the actors in Kidulthood will go on to bigger things. A group of talent to watch.","user":"wildsheep","rank":[99,136]},{"title":"At last a great little Film , and it's British too","rating":8,"date":"5 March 2006","review":"If like me you have despaired at the way that the London has been portrayed in films over the last 10 or so years this film is a God send. This is a London that truly reflects the city as it is today and not as it was in the 50s, like films such as Notting Hill, Wimbledon and Love Actually to name but a few. Added to that the film isn't to bad considering the recent track record of UK films. Its a bit like Larry Clarke's Kids meets Spike Lee's Do the Right Thing with added Grange Hill (a BBC Children's drama programme)all set in &amp; around Ladbroke Grove &amp; Harrow Road, London.<br><br>The film tells the stories of a number of kids given the day off school after a girl kills herself after being bullied. What ensues over the next 24 hours includes a relentless tide of booze, drug taking, underage sex, stealing as well as Gun-crime. And not once is there any preaching or moralising that is left to the viewer to make there own mind up on.<br><br>The performances in the main are some what workman like however two performances stand out, that of Aml Ameen (Trife) and Jamie Winstone (Becky). Of the two, Winstone is some to look out for because on the evidence of this film she has a bright future. Director Menhaj Huda handles things well from Noel Clarke's first time script, again both are to be looked out for in the future. The film also has a firin' Soundtrack by some of the UK's Hip Hop &amp; Grime artists, giving the film the feel of a US production.<br><br>As I said in the beginning this film is an antidote to all those fay Richard Curtis film's we've had to endure over the last few years. One hopes that the filmmakers get the opportunity to make more like it, if not in the UK in the US.<br><br>The film is definitely one to check out if you can.","user":"BlackNarcissus","rank":[64,86]}]