[{"title":"Do not let the slow pace fool you.","rating":9,"date":"1 January 2013","review":"So this movie was not for everyone, I personally thought this movie was great.<br><br>An exorcism movie that does not involve the devil is refreshing to see, and the experience of the movie is played out quite well in the pacing and how events unfold. The fact it features the Jewish religion over Christianity is a very nice touch, one you rarely see in a movie of this style as most people hear exorcism and assume the Catholic church. While many may complain it is too slow, and other such things let me ask you this question.<br><br>What were you expecting from a movie that was purely plot driven?<br><br>Personally the acting was also great, I could empathize with the characters and understand them. The father was just worried about his daughter, who hid her signs of the problem well until things got bad. I mean when it really showed and she was hitting the kid at school, that looked like something that night happen in school over even something small like a favorite pencil or item. There was in my opinion no weak performances in the acting, coupled with a solid and strong story makes for quite a good movie.<br><br>Lastly the execution was some of the best I had seen this far, it flowed and was not jumpy like say the bourne movies. Nothing was out of place and the movie felt creepy and eerie throughout with all of the silence that you could almost hear in many parts of it. If your looking for a truly good movie that will have you walking away satisfied this is one of them.<br><br>It is a well written, acted, and executed movie that while it may seem slow moving is well worth the watch. Think of it what you will, but I recommend this movie as one of my top ten movies of 2012.","user":"deadly_twilight","rank":[76,98]},{"title":"The cream puff version of The Exorcist","rating":6,"date":"31 August 2012","review":"The parallels between this film and The Exorcist are obvious even from the trailers, so I won't go too far into that. Just suffice it to say that The Possession contains none of the impact or shock value that The Exorcist has. In short, it's just not as good of a film.<br><br>However, in its own right, it's a pretty competent horror movie. The story of the central characters is kind of cliché. Husband and wife have divorced, they share custody of the children, there's a new boyfriend/girlfriend in the picture, etc. This type of set up is always convenient when dealing with a \"messed up kid\" film. That way whatever is wrong with the child can inevitably be blamed on the fact that the child is just not dealing well with the break up of his or her parents. And that's exactly what happens in The Possession; except there is actually something VERY wrong with the youngest daughter and it has absolutely nothing to do with her parents. Without giving away too much, the plot centers around an ancient wooden box the youngest daughter finds at a yard sale. Of course she wants it, and so she gets it. And there begins to occur some rather strange phenomena; most of them downright spooky, a couple kind of hokey.<br><br>All in all, I was pleased. This film has got good pacing, decent acting, and exceptional cinematography. There's not much I can find as a fault here. If I had to name my major complaint about this and similar movies it would be this: I'm not thrilled about the influx of PG-13 horror films. I've a suspicion this is due to a need to bring in a wider audience (younger viewers/teenagers), and make more money on ticket sales. Because of this the final product tends to be a little too watered down for my tastes. The Possession shows a lot of promise, but I can't help but wish the writers/director would have pushed the envelope a bit more; fleshed out the story. Then it would have been great. As it stands now, I'll just say it's a \"good\" little horror film. Nothing that will be talked about this time next year, but I consider my money well spent.<br><br>My rating: 6.5/10","user":"IheartCali5882","rank":[60,81]},{"title":"Could have been so much more","rating":6,"date":"8 September 2012","review":"I would like to start off with the positives. There are a few: the acting was done well by all involved, the story and some of visuals. Anything Kyra Sedgwick is involved in is generally pretty good. Jeffrey Dean Morgan was good as the struggling dad after a divorce. However, I think the star of the movie was Natasha Calis. Reminded me of a young Linda Blair. <br><br>The story was very good and well explained so I understood what was coming up next. I also appreciated the integration of the Jewish faith into the movie as this is critical to the original story. The visuals is where I felt this movie could have shocked more. There were a number of good scenes (the one with the dentist) and the final scene. But the bumps and jumps could have been more integrated into the story earlier. It was one hour into the movie before anything exciting happened. The time was spent on character development which is good but I like a few more \"scares\". <br><br>There were too many unanswered questions at the end of the movie. This is why I rated it the way I did. This is not a bad movie at all. It did make you think and it did spark discussions on the way home from the theater.","user":"lmt_is_me","rank":[9,10]}]