[{"title":"historical novel","rating":8,"date":"18 November 2009","review":"Although critics in my native Greece were very circumspect when valuing this movie I disagree with them. Many found that it lacked grandiose crowds in the battle and acclamation of the Pope scenes, but I think that in reality medieval battles and the assembly of Roman plebeians acclaiming the Pope must not have been particularly grandiose events and that added a quality of realism to the movie.<br><br>Also the structure of the story, the equivalent of what Germans call Bildungsroman-that is the process of the development of character through life, was presented in a very able manner, showing the evolution of Joan, a simple but charismatic country girl, to supreme Pontiff of the Roman Catholic Church.<br><br>The love story subplot was also good adding romance to a tale that would have been dull otherwise and proving that even scholarly girls are not immune to the pleasures of the flesh.<br><br>I have to comment on the acting of Ms Wokalek, which I found admirable in the way that it portrayed the subdued power of the character of Joan under a facade of neutral manners and also the surprise role of John Goodman who played a larger than life exuberant and kindly Pope.<br><br>The evocation of the age was also excellent avoiding excesses, and presenting the mendacity of peasant life in the villages as well as the relative luxury of the ruling classes.<br><br>Of course the main point of the story concerned the barriers that gender and class posed to a talented poor woman during that dark age. I think the story has similarities with that of Joan of Ark. The final surprise, which I will not disclose, must have been a novelistic devise relative to modern concerns about the Church invented by the author of the novel on which the movie was based and not an integral part of the Pope Joan legend as preserved through the ages.<br><br>All in all a very able movie which I greatly enjoyed. It is a pity that the response of the Greek critics was at best lukewarm.","user":"georgioskarpouzas","rank":[57,69]},{"title":"Great fun for anyone who loves historical movies!!","rating":8,"date":"27 October 2009","review":"I went to see Pope Joan with a group of friends the day it was released in Germany. Most of us had already read the book, but some had not. We were all quite skeptical as to whether the movie would be true to the book and whether it wasn't a little too long (two and a half hours seemed a lot to us!). But, after having seen it, I must say it was one of the most absorbing two-and-half-hours-movie I've ever seen. I didn't have a look at my watch once.<br><br>The story is quite true to the book. I read the book at least 8 years ago, so I had forgotten most of it. However, when the plot evolved, my memory came back and I didn't notice any major deviances from the book, neither did my friends.<br><br>\"Pope Joan\" is just a classical historical movie and everyone who loves that genre, will most certainly enjoy the movie! It has everything you need: a charismatic heroine who challenges the role of women in her time; some good and wise clergymen (John Goodman is great fun as food-loving, jovial Pope!); some evil and brutal clergymen who want to spread Christianity violently; some scheming and intrigues; a good portion of war and battle scenes; a romantic love story and, last but not least that interesting question at the end that will certainly cause you to discuss with your friends and search wikipedia: Was there really a woman who became Pope?","user":"Naurya","rank":[53,65]},{"title":"Best historical movie of they year?","rating":10,"date":"8 April 2010","review":"It is for sure one of the best movies about ancient history and educated women that I seen so far, what makes this unique is that Joan strives to excel in religion and science. <br><br>She comes from a traditional middle-ages background where women are uneducated so she has to learn how to look and act like a man to be able to follow her passion, this creates a constant struggle to hide her true gender.<br><br>Her intelligent and strength in human character shines through the canvas and what she manages to accomplish in her lifetime was phenomenal!","user":"nicco77","rank":[38,54]}]