[{"title":"The quest for mutuality in love","rating":8,"date":"20 October 2014","review":"As Nemo looks back (from age 118, yearningly, and forward from age 9, predictively, drawing on a 9-year-old's storybook-even-horror-story-based clichéd imaginings of adolescent/adult life and sci-fi future worlds), he sees his life's choices and their envisioned consequences pivotally stemming from one crucial choice at age 9, each path \"typed up\" as a draft of an alternate life. It's an existential tale of the power of choice to create the environments that reshape the persons who then choose from what life presents in their consequent environments, ad infinitum. It's a romantic tale in both the historic sense of quixotic, picaresque adventure multiply envisioned (including into distant time and space) and the modern sense of a quest for the idealized romance of heart and soul.<br><br>The alternate lives Nemo envisions ultimately hinge on a quest for one thing: mutuality of love in marriage. No cliché in that; rather a truth of human want and need borne out of the anguishing pain of a 9-year-old caught in rupturous divorce. Desperate to make the choice no 9-year-old should be asked to make, in such a way that it will be \"the right choice\" for his future, especially to find rapturous, enduring love, not re-creating his parents' fate, he engages a daunting will to prediction and a time-travel suspension and projection that allow him to see three futures before making the fateful choice.<br><br>So, to me, Nemo's three \"lives\" – represented by three girls and the wives they become in his predictive imaginings and rememberings – depict three points on the continuum of mutuality in love:<br><br> loving more than being loved (with Elise, who marries him on the 'rebound', keeping the torch alive for the old flame)<br><br> being loved more than loving (with Jean, who he marries as fated by a dance, thus a kind of 'arranged marriage')<br><br>These two reflect shoe-on-the-other-foot variations on the torturous \"I love you but I'm not in love\" dynamic where Nemo thinks a marriage can work, but discovers it cannot. <br><br> and mutually impassioned loving (with Anna)<br><br>Across scenarios, we see his one mutual love, Anna, as someone he'd meet in various contexts (as if destined, as if his scriptwriting mind is trying to relieve him of the paralyzing thought that any one choice could preclude finding his true love yet also revealing that some timings for crossing paths with Anna could be inopportune, that perhaps only one timing might lead to the sustainable love life he craves):<br><br>first as children at the beach (who we wind back to in the final shot, sitting in innocent harmony on the dock), an age seen in first draft as too awkward for Nemo's self-consciousness that makes him hide his truth and blurt relationship-killing statements;<br><br>second as adolescents, brought together by parental merger, a merger that eventually reinforces his 9-year-old-self's pain about the fragility of imperfect love while exiling his and Anna's mutual pledges of soul-mate-like-passion;<br><br>third as adults, passing in a crowd - train depot, city street, funeral - where timings are off, where too much accumulated adult pain, caution, and distrust interfere, making all but the final draft of such adult encounters – the miracle in the chalk circle – come to a dead end; <br><br>and last as aged fellow travelers to Mars (i.e., destined to meet even if Nemo initially married Elise, upon honoring Elise's wish for her ashes).<br><br>Old Nemo claiming that these depicted lives are equally \"meaningful\" doesn't mean equally nurturing or vital; his emotion betrays where his truth lies - with a mutual love that's \"to die for\" (among all the traumatic deaths - by water, fire, or firearm – that he envisions) - and at age 118 worth living for – long enough to see Time reverse and be able to wind his way back - back to the chalk circle when \"chance\" or fate or miracle rescues an all-but-lost hope of reconnection, or back further to childhood on the dock as playmate–sweethearts who might never have lost each other, perhaps the maximal dream of the 9–year–old's quest for a love that endures all change.<br><br>When old Nemo lives long enough to reach time's reversal, he laughs a victory laugh for having found the scenario that miraculously returns his one mutual love to him in the nick of time, now presumably together (in some time and space) \"for as long as both shall live.\"<br><br>Some suggest the \"moral of the story\" carries a (negative) verdict about wealth or career. But I think it was not wealth-boredom that made the Nemo who married Jean seek an alternate identity that got him assassinated; rather it was the restless boredom of never truly loving, reflected in Jean's questioning whether he even liked or knew her (even whether she took sugar in her coffee), missing the passion of two lovers who mutually attune to their beloved's every desire. <br><br>Nor is marrying 'trouble' (Elise grappling with mental instability) what undoes love – Nemo stays committed to the most trial-by-fire of marriages - as long as the love is mutual, but Elise's romantic fantasy is elsewhere. <br><br>It's asymmetric, unrequited love that smothers marriage with Jean or Elise, not the fact of an easy life or a hard one.<br><br>This message points back to the tale's beginnings, for the very 'die' the 9-year-old Nemo must cast and that traumatizes him is the result of a broken marriage, a love that was not mutually \"for better or worse.\" Whichever of the 9-year-old's Hobson's choices he makes, what he scripts enough drafts to realize is what matters most to sustainable (\"eternal\") love and how to make his heart recognize, treasure, and hold it when he finds it. His last gasping word, \"Anna,\" evokes Citizen Kane's dying, cryptic \"Rosebud,\" but the latter portrays a self- pitying sense of boyhood loss, whereas Nemo's \"Anna\" portrays a transparent self-realizing sense of a boyhood dream found.","user":"cetaylor3","rank":[46,48]},{"title":"What have I done to deserve this ?","rating":9,"date":"16 January 2010","review":"Mr Nobody, Nemo Nobody, is now 100 years old, the last mortal on earth in 2092, and he is about to die. Questioned about his life on his death bed by a journalist that sneaked in the hospital, he tells the stories of his lives. Yes, lives, his three lives, his three destinies between which he was unable to choose from. Three love stories, three very different existences conditioned by apparently meaningless decisions. Three paths, three wives, three families, three fates.<br><br>This genuinely mind blowing movie is an experience revolving around the notion of choice, the importance or futility of decisions, a complex story that questions randomness, and what our lives are made of. Illustrated by bribes of a science documentary enlightening us about concepts like time before and after the big bang, the extremely interesting superstition of the pigeon, the eventuality of the big crunch, the complexity of quantum mechanics and string theory. This is a journey into the human psyche and the ability to create and explore in our imagination all the possible moves, like a chess player, that would lead to different paths, different existences. Exceptionally imaginative, acutely funny and startling, this production reeks of intelligence and craftsmanship, breaks down linear storytelling into bits, only to shuffle the whole thing in a brilliantly orchestrated masterpiece. It reminded me of so many great experiences, from David Lynch movies to Jorge Luis Borges books, it's an exquisite bundle of intellect and emotion.<br><br>Choices, their meaning, why we choose this or that road through our lives, their consequences, whether we are aware of them of not. How many different lives could we be living ? Through the infinite possibilities facing each and every one of us, the good and the bad choices, every turn taken creates a new life, the most interesting of all is being alive. Chaos theory and butterfly effect to remind us how small we are in the randomness of the universe and yet so able to actively manifest the reality we desire. Nemo Nobody has to choose between leaving with his mother or stay with his father, the starting point of the exploration his available destinies. Unable to decide, he chooses both and takes us for a ride through an immensity of possible.<br><br>The filming is smooth and sequences linked in a flow of event that jumps back and forth through time, brilliantly edited with great attention for rhythm. The music score is so adequately put together that it adds to the already stunning staging efficiency of the directing by Jaco Van Dormael. I dare to say this is the very best movie of 2009 and will most likely go see it a second time next week, one can never get enough of these absolutely mind blowing experiences. Confusing and dazzling at the same time, it manages to spark the most interesting discussions about the meaning of life, in an attempt to pinpoint why we live it. Whatever you got planned for this week end, just drop it and go see that movie, you will not regret it.<br><br>There is a concept which corrupts and upsets all others. I refer not to Evil, whose limited realm is that of ethics; I refer to the infinite.<br><br>Jorge Luis Borges<br><br>(www.radiostationexp.blogspot.com)","user":"Tieum","rank":[358,430]},{"title":"Genius","rating":10,"date":"19 September 2009","review":"Just caught the north American premiere at the Toronto Film Festival. This is my first IMDb comment, doing it cause i saw no one else has written anything yet.<br><br>Jaco is an absolutely brilliant writer/director. I haven't seen too many art-house films, but I was pleasantly surprised by the tone which wasn't too serious, or pretentious. There were laugh out loud moments during a movie with themes concerning choice, destiny, and metaphysics.<br><br>I was enamoured by the love story, it was feel good without being Hollywood.<br><br>The visuals were amazing. I believe that Jaco explained that he used different DP's to film the different possible lives of Mr. Nobody. There were scenes set in the year 2092 that were absolutely stunning on the big screen.<br><br>I found the soundtrack to be awesome. Any movie with \"Mr. Sandman\" and \"Where is my mind?\" is alright by me.<br><br>The movie was extremely imaginative, original, funny, and will probably have me thinking about it and my own life for days after viewing.","user":"davee_b0y","rank":[553,688]}]