[{"title":"Finally a Dutch movie that isn't afraid of love","rating":8,"date":"22 October 2007","review":"Who wouldn't want to unwrap Carice van Houten from her gift costume? She deserves her prince on the white horse because she comes to realize that she should believe in love. I also liked Anneke Blok, who plays a type that is rarely portrayed in Dutch movies: the busy mother who arranges everything and is heading towards a nervous breakdown. The gay couple is portrayed so matter-of-factly - not as some statement - that you are hardly aware that you are watching two men kiss each other on the lips.<br><br>The first half hour of the movie is especially funny. The movie then loses some of its momentum, despite the rapid cuts between the story lines. Some of the jokes fall flat and one extra character is hastily introduced. The finale on snowy Santa Claus's birthday makes up for a lot, although I found it a bit too understated to serve as the climax and bold moral statement that this movie deserves.<br><br>The multiple-story-line approach is a real balancing act and I applaud the filmmakers for their guts to set the bar so high. Also, I think to make a positive movie about love is in a way more daring than the cynical approach with a lot of cheap nudity, which since long has been the standard in Dutch movie-making. <br><br>Judging by the numbers of visitors, the filmmakers have succeeded in making the audience believe in love, at least for a short while..","user":"erikweijers","rank":[19,25]},{"title":"Super!","rating":9,"date":"14 October 2007","review":"Colorful, touching, and very funny! This can be considered as a Dutch version of Love Actually (even the fonts of the credit titles are similar), which is a big compliment to Love Actually. As the stories and situations here are very Dutch (including gay marriage and a vehicle carefully locked to a bridge), I think this film will move Dutch viewers more than the British version did. I know I wanted to cry at the end, but I was there with my girlfriend. Super performances of the all-star cast, all playing the roles they do best. And the movie shows Amsterdam from its most wonderful side as well! <br><br>The movie does raise a worrying question though: what will we do when He really dies? My suggestion: we ask Gijs Scholten van Aschat. Any other candidates?<br><br>Try to avoid the trailer, which spoils some surprises.","user":"jonkersniels","rank":[24,34]},{"title":"Just good","rating":8,"date":"21 October 2007","review":"I saw \"Alles is Liefde\" recently and I liked it. The advertisement for the film is strange..sometimes this film is presented as a pure romantic movie, but most often you'll only see the ruder jokes. As is with the truth sometimes, the film itself lies between those two.<br><br>The acting is good. It seemed that Dutch mainstream film left the soap level some years ago. There are a lot of new faces and a number of old ones. Carice van Houten for example, rising star that is close to international stardom, is a great actress that has little trouble with playing totally different roles. In Alles is Liefde, she is simply great.<br><br>I will not spoil much about the story, but it starts great with the arrival of Sinterklaas. The mood is just right, the acting just fits and it all feels very real (even if you live far from Amsterdam). The directing seems pretty solid and the sets are good(production is sometimes very weak in dutch cinema).<br><br>The acting is good. There are many, and with that I really mean MANY characters that we follow during the movie and they are all so different. We see a working class family, unhappy saleswoman, royalty womanizer, gay couple, mothers that seem confused about this point of their lives and prehaps the greatest of them all; a middle aged man that comes back to Amsterdam to do something about his past and gets famous and pushed around in a situation that is very public and absolutely not for him.<br><br>The only thing that I didn't like about this film is the music. Sure, it's pretty good, but there is just a little bit too much of it. It's mostly mainstream music and it's very romantic, but when you use this kind of music on any situation it's kinda loses its power later on.<br><br>The rest; great. This movie is fun and romantic. There is enough for anybody, so not many people will be bored while watching this (except the Chuck Norrise-like filmlovers).","user":"D_vd_B","rank":[21,30]}]