[{"title":"The Giver Review","rating":5,"date":"11 August 2014","review":"I know, I know, that score makes you want to hate on me already. First, let me say that I have read the book and really enjoyed it. It was thought provoking, emotionally engaging, and intelligent. Second, while I enjoyed the book, I am not passionate about it like some people are. So I went into the movie with a completely open mind, just wanting to experience the movie. <br><br>First, the positives. Jeff Bridges and Meryl Streep are fantastic as expected. Both bring wonderful layers to their character. Also, the use of going from black and white to color was used real well to demonstrate what the characters see. The film looks good and is acted well.<br><br>Now my complaints. First of all, the setup of the supporting characters felt off to me. The society they live in have a certain set of rules that everyone follows because they were taught to their whole lives. But all the characters broke the rules multiple times in the beginning of the film. That takes you out of the overall feeling the movie is supposed to give you, the message it has to offer.<br><br>Next, while the book got you emotionally attached to Jonas and what is happening to him, the movie falls flat. Their are certain moments that have to have the audience fully involved emotionally, but just don't. That is a big negative unfortunately, because you want to care, but the film is too lazy setting you up for the emotional blow.<br><br>Finally, the pacing is way off. The middle part with Jonas coming to the realization of what is really going on, is rushed and he makes up his mind like that. That is the most important part of the movie, and sadly it is rushed. Then the movie slows down, and that leads to a VERY anti-climactic ending.<br><br>Overall, if you are a die hard fan of the book, then obviously you should see it. Who knows, I may be the only one who doesn't drink the coolade for this movie. But the tone and storytelling are to sloppy and the movie fails to get you emotionally attached. So the result is a mediocre film for me. I still recommend you see for yourself, but just ask yourself: Did I love the movie or did I want to love the movie because of the book?","user":"jackgradis","rank":[286,376]},{"title":"The Giver","rating":8,"date":"10 July 2015","review":"When I saw the title I asked myself what we give. When I saw the movie I asked myself what we have given up. <br><br>The simple and clear message in the movie is what makes it interesting and good. I saw so many simple things explained in such a profound way. Things such as friendship, family, love, emotions, humanity. <br><br>After all this is a great movie that shows what humanity is all about. What emotions are, how we see the world because of them. About what is right or wrong. What we sacrifice to create one Utopia. We see in this movie the good in people, but we also can see the cruelty that we are capable of. <br><br>To be completely honest, I saw a little resemblance with another movie. Despite that, It is a movie that I wanted to watch again.","user":"stefan-alev","rank":[32,39]},{"title":"Entrusted with the memories of the past","rating":8,"date":"12 January 2015","review":"If you think that the world that George Orwell created in 1984 was a rigid one they were positively hedonistic compared to the society shown in The Giver. Playing the title role is Jeff Bridges who is called that because he has a very special duty to be the one entrusted with the memories of the past. The ruling body of the society has to be able to refer to the past to be guided in making decisions. But we can't have everyone knowing about lest they long for the good things of the past. It's all been abolished the good and the bad, conformity and sameness is the order of things. Color is not even allowed everyone wears drab clothing like they were in prison. The family is abolished, kids are born and then assigned to nurturers, women particularly go into that occupation and it is an occupation like being a plumber. <br><br>A new group of young people are being given new assignments and young Brendon Thwaites sits eagerly awaiting his occupation. He gets the prize as he is chosen to be the Receiver of all the past knowledge from Bridges. His training is to telepathically connect with Bridges all the experiences of the past, the good and the bad.<br><br>The use of color in film is never thought of this day, it's simply assumed that films now will be photographed that way. But The Giver takes its place along side Schindler's List and Pleasantville in using color sparingly and to make a point. Color comes into Thwaites world as it has been in Bridges' and the equation of knowledge with color is a point well made.<br><br>When Thwaites decides that there's something more out there than what he's grown up with, society shakes. None other than chief elder Meryl Streep wants measures to be taken to stop Thwaites from questioning the order of things. <br><br>Thwaits, Streep, and Bridges head a cast that tells a thought provoking tale of curiosity and rebellion and curiosity in seeking something better always proceeds rebellion. The film ends abruptly and I suspect there's some box office soundings being taken to see if a sequel is to be made. I hope one is, but if it's not The Giver can certainly stand on its own.","user":"bkoganbing","rank":[26,35]}]