[{"title":"The most deceptive packaging ever, my copy anyway, looks like a romantic comedy but is not; has some merits, however","rating":6,"date":"12 July 2012","review":"This compilation of film shorts has some stellar actors and some intriguing story lines. In the opening piece, a struggling writer (Gerard Butler) is despondent that his wife split, taking his daughter. He has a gun and contemplates shooting himself but tries one last time for a reconciliation. Julie Delphy, in another piece, thought she would have it made it she grew up to wear high-heeled red shoes but found out that romantic happiness is more elusive. She, too, is pondering a final solution to her misery. In one of the most impressive shorts, a woman (Imelda Staunton) goes to a lovely country inn in England to wait for her own demise. It seems all of her relatives died on the eve of their 58th birthdays and she expects the same for herself. Although her \"last meal\" is not what she had in mind, the crab legs suggested by the chef prove delicious. All of the inn's staff receive big tips for their care but will she pass away? Then, there is a clever piece devoted to a national spelling bee, where television commentators Charlie Sheen and Anna Faris become amazed at some of the young contestants' strategies. Also included is a very dark work dealing with a German concentration camp and the last one features a damsel in distress (Eva Mendes) with a broken-down car. All in all, this is one unique film which will certainly not please everyone, especially with some of the touchy topics and language. Yet, its avant-garde qualities will delight other film fans who crave the unusual. With good acting and offbeat plots, viewers who admire independent flicks will want to try it.","user":"inkblot11","rank":[5,5]},{"title":"Six short films, mostly about death. Not that much fun to watch. Great cast and the \"Spelling Bee\" one is funny. I say C-","rating":4,"date":"26 June 2011","review":"\"You have to let yourself go sometimes.\" A movie that has six short films that have nothing to do with one another. This movie has a great cast, and thats about it. Of the six stories, three deal with death (mostly suicide), two are pretty boring. The one bright spot I will say is the \"Spelling Bee\" one. With Anna Faris and Charlie Sheen (playing himself) commenting on a spelling bee they are watching. That one was pretty funny, but overall a pretty drab and depressing experience. This will be one of my shorter ones because it's not really a reviewable movie in the fact that all the little movies are about 15 min and would take to long to talk about every little film. Unless you are big into the art house films you will not really enjoy it. This is one that is definitely not for everyone. Overall, not really that entertaining except for the \"Spelling Bee\" one. Not much else to say. I give it a C-.<br><br>Would I watch again? - Nope.<br><br>*Also try - Burning Palms &amp; New York, I Love You","user":"cosmo_tiger","rank":[4,6]},{"title":"Waste of time","rating":7,"date":"7 August 2011","review":"I am having a very difficult time finding the words to express how simply awful this movie was. The cast and the story line seemed to render the makings of a good movie... boy was I wrong. The movie made no sense- what-so-ever. Out of each short story, only one had somewhat of a meaning, and I still had to wonder if the meaning that I got was the same meaning that watchers were suppose to get?? The stories did not connect or tie together at any point. I felt very disappointed, and truly upset that I wasted my time... I hope someone will read this before they even consider to watch this movie... my advice... choose something else.<br><br>P.S. Shame on the \"Good\" actors who fooled me believe that this was going to be a \"Good\" movie.","user":"glitters_pink24","rank":[1,3]}]