[{"title":"Pretentious rubbish","rating":1,"date":"10 April 2016","review":"A nice idea gone awfully wrong. The first 20 minutes are actually quite good: the art design is worthy of all the prizes you could award it, and the director builds a growing tension that keeps you interested, although you already know, from the first five minutes, that the likely outcome is that everything will fall apart, since \"the building\" is clearly a metaphor for \"modern\" society. <br><br>However, even predictable plots can be interesting, and initially this seems to be the case.<br><br>Then, the film loses its grip and very quickly becomes an endless repetition of chaos. By the 30min mark the director has made his point: society sucks and if things continue as they are, we will all descend into primitive behaviour and act like barbarians. Nothing wrong with that message per se, but the film gets stuck on it like a broken record and treats the audience to an endless stream of pointless violence, mindless sex orgies, rapes, more violence, looting, social chaos, still more violence. It's like beating a dead horse and then continuing to beat it until you are beating the skeleton of a dead horse (and you continue beating it).<br><br>It seems that the writer and director were so in love with the core message that they could not quite get around to developing it and finishing it properly.<br><br>I saw this at a cinema in London; some people left half-way into it (most seats were empty anyway). I managed to sit through the whole thing, hoping that the movie would redeem itself towards the end; it only got worse. This might be at the top of my \"worst films of all time\" list.<br><br>The acting is not bad, the cast is good, and the art design is still deserving awards; but the overall result is just appalling. It would have made a great short film, if they stopped it at 30 minutes. The way it was released, at 119 minutes, it is 90 minutes too long.","user":"nando1301-1","rank":[221,299]},{"title":"Too incoherent to convey a clear message","rating":4,"date":"10 July 2016","review":"Is High-Rise an anti-capitalist manifesto, meant to show the evil of inequality? Is it an attack on the British class society? Is it meant to show how modern architecture alienates people from each other? Or is it just a succession of weird scenes, giving the director the opportunity to show off? There's something to say for all of the above, but I'm inclined towards the last. The film really is too incoherent to convey a clear message or idea. The metaphor of a huge high-rise building to symbolize society at large is interesting, but could have been better expressed. As it is now, the metaphor gets mostly lost in an avalanche of weird, decadent or shocking scenes. As a viewer, you keep waiting for the story to become clear, but it never really happens.<br><br>This is even more annoying because the film is much too long, and already from the start it's clear how it ends because the whole story is one large flash back. The result is zero suspense and maximum weariness.","user":"rubenm","rank":[86,114]},{"title":"Mish Mash","rating":4,"date":"1 May 2016","review":"You look at the cast . 10/10 You see the story line 09/10 You see the cinematography 09/10<br><br>We settle down , C,mon movie \"entertain us\" we cry.<br><br>1 hour later we just cry.<br><br>The morning after watching we are still \"none the wiser\" which is a great shame.<br><br>Very well made with a cast of most of my favourite Brit actors but what the hell is it all about ???? I still haven't got a clue.<br><br>Pretentious , Brit film Noir? my biggest regret is we wasted a Saturday night watching it.<br><br>My wife kept saying , \"turn it off if you don't like it\" but we kept thinking it would either 1) get better 2) we would eventually Get It or 3) We watched it this far so there is no point switching it off now.","user":"steven-drew","rank":[149,210]}]