[{"title":"Possible the first pornographic 'date movie' that lacks the hardcore edge guys expect but does take mainstream ADULT movies to the next level - REAL sex!","rating":7,"date":"25 August 2005","review":"How does a modern man recall his last 'love' relationship? In this case, by the songs they shared together. The man in question is a glaciologist who's airborne research over Antarctica spurs a chronological series of memories broken up by nine LIVE concert segments. To sum up the simplistic plot line of the flashbacks, the two young lovers meet at a rock concert and then each major sex scene at their Islington flat is punctuated with brief concert segments (shot guerrilla-style with the couple in attendance).<br><br>Director Michael Winterbottom (\"24 Hour Party People\") has actually done Hollywood (and Planned Parenthood) a service by taking out the 'fake' lovemaking scenes audiences have grown accustomed to and replaced them with REAL sex, actual condoms IN USE, and a female (or male) orgasm that hasn't been staged for dramatic effect.<br><br>Seriously, the porn industry should take note if this film has any commercial success in the USA, because for my money I'd rather have my human sexuality nicely photographed, lit well, and true-to-life than filled with emotionally forced bad acting, flat lighting, and fake orgasms (with even faker breasts). Name one porn movie with fantastic helicopter shots of Antarctica's icy surface with a science lesson tossed in too. Nada.<br><br>Best of all are the honest, first-rate acting performances from both Brit acting veteran Kieran O'Brian (\"24 Hour Party People\") as 'Matt', the very lucky older guy (age 31), and 'Lisa' (Margo Stilley), the young American waif, who gets picked up at a rock concert one night at London's Brixton Academy.<br><br>In England, where this film has already been released there was quite a brouhaha as first-time movie actress Margo Stilley (age 21) supposedly tried to have her name removed from the credits. Luckily, the scathing reviews by the British press have worn off and the film is being released in the USA with Margo credited and NO NC-17 rating.<br><br>Although a first-time principle actress, Margo's performance is noteworthy in that her improvised dialogue not only rings true but it speaks to the neuroses of many young 'wild' females way beyond the Paris Hilton experience. She even creates a little comic relief when confronting her 'boyness' in the bathroom mirror.<br><br>In retrospect, I don't think this film has the artistic merit of last year's ode to eroticism (Bertolucci's \"The Dreamers\"), but director Michael Winterbottom does make a compelling argument for taking sex scenes to their natural conclusion. Adult audiences are gravitating more and more to NC-17 rated movies (re: \"The Brown Bunny,\" etc.) and it may be time for local cinemas (and Hollywood) to grow up. Hey, if Angelina Jolie and Brad Pitt really are lovers then why couldn't they have 'condom sex' on screen for a change, and how much more of an impact would that have on college-age adults practicing 'unsafe' sex than thousands of hours of PSA's and sex-ed classes! Even if sex on the big screen isn't your thing, this film is so pure in its intentions it's practically a 'date movie' (except blind dates). Even the ladies will enjoy the sensitive approach to the material as the sexual exploits build from cunnilingus to some mild S&amp;M, eventually progressing to the de rigeur 'cum shot'. As I said, it's an ADULTS ONLY experience, but one that might rekindle the sexual romance in your own relationships and give you a forum to converse with your partner about a sensitive subject (in America anyway).","user":"SONNYK_USA","rank":[95,121]},{"title":"Physical love is a dead end (\"L'Amour physique est sans issue\")","rating":25,"date":"25 January 2005","review":"I had read some reviews and comments from the Director before seeing \"Nine Songs\" so I had adapted my viewing mode accordingly. I armed myself with the kind of cold, intellectualized, high-culture glasses one uses to see relevant contemporary art. Most of the times it won't be neither an esthetically satisfactory experience nor a necessarily pleasant emotional experience but if we can see the point of the artist and if that point seems in resonance with one's curiosity and awareness of the world around, that will be good enough. From that somewhat minimalist expectations' level viewpoint, \"Nine Songs\" did the trick. I can see Michael Winterbottom's point. Why can a writer engage in sexual imagery with no restrictions and a film author can't do the same? There is also, I think, a honest experimental tone in all that. Something like \"Let's see if it works to ask the actors to go all the way. Let's see if we can stay inside serious film making and not add an item to the increasingly inflated porn film list.\" I think MW managed to sail through. Yes, it can be done (but, at what a price for the actors it remains to be seen); yes, it's definitely miles away from porn. As to if this incursion into real sex in the picture is as effective as explicit sex in literature, I'm afraid that MW is no Houellebecq. Sex in the daring novels of Houllebecq retain a kind of legitimacy because in the center of the plot there is a couple where love between the two is expressing itself (although fed by some rather non-conventional sexual behavior). Sex in Sade or in other libertine writers was deliberately tabu-breaking, and liberating in a way. The extremely good quality of the writing (both in Houellebecq and Sade) is a crucial element in allowing the authors who engage in such edgy fields to get away with it. In \"Nine Songs\" the couple fails to touch us, there is no love there (not even the good chemistry of sexual love), and the \"writing\" in film terms is not that impressive. It resembles more a documentary, which in fact it is (\"How to introduce explicit live sex in mainstream cinema\"). We end up leaving the screening room with the frustrating sense that an opportunity was lost. Like a piece of rather cold contemporary art it challenges you, it makes you engage in argument with your friends, it makes you wish to write a comment on web site. But we enjoy good cinema, not merely relate to.Enjoyment is not there.","user":"consul-2","rank":[175,237]},{"title":"An anti-climax","rating":31,"date":"31 March 2005","review":"In the (admittedly unlikely) eventuality that someone wandered into a cinema expecting this to be a musical, a rude shock would ensue, since this is the most sexually explicit mainstream film ever exhibited in Britain. Indeed the only mainstream movie I've previously seen to compare in explicitness was the 1976 Japanese work \"Ai No Corrida\" (\"In the Realm Of The Senses\"), but this work goes further with a scene of ejaculation, as well as fellatio, cunnilingus and penetrative sex. Since this is the work of accomplished British director Michael Winterbottom (\"In This World\"), one cannot possibly regard this is as pornography - besides anything else, porn features far more voluptuous women and portrays the sex from an exclusively male point of view, whereas the sex here is realistic (as well as real) and as female-oriented as much as male.<br><br>The problem is that the film appears to be utterly meaningless. A British research geologist Matt (Kieran O'Brien) goes to London gigs and has sex with American student Lisa (Margot Stilley), but there is no characterisation or plot or even a script (the dialogue was improvised and is banal). Even the music seems to bear no relationship to the lovers and - except for some haunting work from Michael Nyman - is dreary gunge. Shot on low budget digital video, the picture is as grey as the subject matter and the only light-hearted aspect is the rather unsubtle joke of the (mercifully short) running time (69 minutes). Come again? No chance.","user":"rogerdarlington","rank":[156,211]}]