[{"title":"Good","rating":7,"date":"29 February 2020","review":"A well-crafted thriller, The Mechanic is an intense and action packed film from director Simon West. Starring Jason Statham, Ben Foster, and Donald Sutherland, the film has a strong cast that delivers good performances. The story follows an assassin who takes on a protege, but is forced to go rogue when he's betrayed by his employer. The material is familiar, but the writing is able to keep the film engaging. Though it's not that original, The Mechanic is a solid action film.","user":"MR_Heraclius","rank":[38,40]},{"title":"Good Enough For a Late Night Flick","rating":6,"date":"10 February 2011","review":"I just got back from seeing a late night showing of The Mechanic. After having a long week, this film did exactly what I wanted it to do...entertain me. <br><br>Was the plot original? No. <br><br>Was the acting amazing? No. <br><br>But... Was the action good? Yes. <br><br>Was Jason Stathham in it? Yes. <br><br>Can you ask for anything else in an action film these days? It didn't label itself as a milestone of cinematic achievement. It was marketed as an action film, with good death scenes, mildly intriguing characters, and a simple plot and it delivered exactly on cue. Go see this if you just want to see some good action stars kick-butt for a couple of hours. 6/10","user":"SpartanIII","rank":[92,119]},{"title":"Good hardass killer thriller","rating":8,"date":"10 April 2017","review":"When Jason Statham is good he is very good. In this movie I think he is very good as the silent, deadly killer for hire. It is a straightforward killer/action/thriller. The story is nothing new but it is a well working story which is nicely executed.<br><br>The story is, as I wrote above, not very original. Killer for hire finds out that his next target is his mentor and friend. As the professional he is he executes the job anyway but later discoverers that not all is as is should be. Time for revenge. A simple, straightforward and well working story.<br><br>Things are complicated a bit by Bishop taking his friend's son under his wings. Of course he wants to walk in his fathers footsteps. He is inexperienced but also undisciplined. Something that, not surprisingly, is causing problems.<br><br>I do like that Bishop stays a no bullshit hardass killer throughout the entire movie. No whining or silly emotional outbreaks or breakdowns. I also like the unemotional, silent and deadly impression of a professional assassin the he radiates.<br><br>There are quite a few fairly well done action scenes in the movie ranging from silent assassinations to the obligatory blow things up scenes. The parts where Bishop and Steves goes after the big bad guy is quite well done with some quite cool stunts without being over the top.<br><br>The ending was probably the only thing in the movie that was a bit unexpected. Unexpected in a good way that is. I quite liked the little surprise there.<br><br>Overall I as well as my son liked this movie quite a lot. I hope that Mechanic: Resurrection is as good as this one.","user":"p-jonsson","rank":[8,8]}]