[{"title":"Sartre and Satire","rating":25,"date":"25 November 2009","review":"Fantastic Mr. Fox is acclaimed director Wes Anderson's first animation, specifically stop-motion, and it's, well, fantastic. <br><br>George Clooney's voice as the head fox of an animal clan that shouts diversity is straight out of Danny Ocean-- cool and witty with an overlay of sentimentality that would convince you to open your hen house door to let him have his way. That's after his little speech that tries existentialism on for size, foxwise that is: \"Why a fox? Why not a horse, or a beetle, or a bald eagle? I'm saying this more as, like, existentialism, you know? Who am I?\"<br><br>As the animals pull a caper against farmer Bean (Michael Gambon) and his thugs, the animation pulls away from the gloom of another winner this year, Where the Wild Things Are, and confirms the fun of a well told beast fable with loads of anthropomorphism to reaffirm our love of humanity and confirm that animals, like us, will always be animals. The ease with which Anderson/Clooney convince that this stealing and mayhem are what animals do is a tribute to script and performance that seduce us into the stylistic den of thieves known as the fox lair and all its attitude and custom, sanctioned by mother nature herself.<br><br>Mr. Fox: \"The cuss am I? Are you cussing with me?\" Badger (Bill Murray): \"No, you cussing with me?\" Mr. Fox: \"Don't cussing point at me!\" <br><br>Such an exchange is indicative of the fun Anderson has with kids and adults by not bombarding the youngsters with profanity but winking at the adults as if to say, \"You know what I mean.\" And the most violent moment comes not from scenes with guns but rather where the animals steal chickens and break their necks, done so gingerly and quietly that it seems what it is: Just what foxes do and what humans must do to eat the chickens. Darwin meets the cartoons: Mr. Fox: \"And how can a fox ever be happy without, you'll forgive the expression, a chicken in its teeth?\"<br><br>That's Wes Anderson for you: Sartre and satire with a dash of dashing fox.","user":"jdesando","rank":[102,127]},{"title":"The Truly 'Fantastic' Fantastic Mr. Fox","rating":10,"date":"12 November 2009","review":"In recent years, Disney's Pixar division, with their monopoly over animation, has churned out some of the biggest, funniest, most emotional material to hit theaters in the last ten years. By this point, the public knows their aggressive marketing campaign and knows it well. Adult humor and themes geared not only toward the kids, but the parent's as well. The mass appeal? Mom and dad can now take their eight year old to the local multiplex and fork over the steep price of admission without wasting it on a two hour long power nap. Last quarter's CGI constructed Pixar extravaganza \"Up\" captured audiences' hearts, imaginations and pocket books, raking in a less than modest 292 mil at the box office, making it one of the highest grossing animated films of all time. Along comes \"Fantastic Mr. Fox\", helmed by auteur Wes Anderson, a crack team at Twentieth-Century Fox (Yes, I said Fox) and Indian Paintbrush, one of Wes' collaborators on his predecessor \"The Darjeeling Limited\". If there's one thing that's detrimental to the Trump-like successes of the Disney powerhouse, it's a new found competitionlet the games begin.<br><br>\"Fantastic Mr. Fox\" is a pure delight. A feast for the eyes. From frame one, it takes no time at all to draw you into its beautiful visuals of vast countryside's, running streams and falling foliage, all in marvelous stop motion. That's right I said it, stop motion. From the course hair on Fox's face to the cotton ball chimney smoke of Boggis, Bunce and Beans warehouse smoke stacks, everything's been designed from scratch, much of which involves simple household items. After just a few minutes in Wes Andersons world inspired by written cues from the mind of the British children's author Roald Dahl (inspired by Dahl's own hometown) you're dragged out of the theater and immersed in a faraway land for the entirety of its modest and to the point one hour and twenty minute runtime. The real treat lies in the notion of how long it actually must have taken these top notch art designers to bring everything to life. There are forces at play here that give one a clear sense of the fact that stepping away from a computer screen and getting things done the hard way pays off when witnessing the final product. Production value is staggeringly noticeable and truly memorable. I for one am still transfixed by the universe of Mr. Fox.<br><br>Among one of the droves of Wes Anderson fans, I had high expectations going into the film. Anderson is one of those rare writer/directors that manage to separate themselves from the societal norm, branch out and go their own way. With Fantastic Mr. Fox, he effortlessly supersedes his reputation as one of the most unique Directors of this century. You may be asking yourself how you direct a bunch of puppets, but Andersons 'puppets' are among some of the most realistic and complex that you're likely to meet. With human emotions, expressions and actions, it is clear that Mr. Anderson took great time and preparation during the film's production and pre-production to make sure everything came off as smoothly and impactful as possible. Look out for a particularly funny scene during one of the nightly stake outs portrayed wholly through images on security camera monitors. Very, very well thought out and clever. <br><br>Fox, for being aimed at children, is probably one of the most adult animated films I've seen to date. Think Pixar Redux. There's smoking, 'cussing' and above all some extremely heavy handed adult humor and themes. In Wes Andersons sharp, funny, unbelievably witty script, he keeps all of that classic dry comedy that's become synonymous with his trademark, the only exception being that it's coming from the mouths of the animals he's intricately created. Parts had me gasping for air; others had me rolling in the aisles. It's clear to me that by now Wes has really honed in on his craft and gets marginally better with each new picture. <br><br>Wes Anderson, with his creative brain that can only be compared to an Einstein of the medium, lays all his cards on the table and ups the ante for Pixar Studios. When asked if he wanted to continue to make animated films he commented by saying, \"I would certainly love to make other animated films in the future.\" Could this be his new calling? Truly focusing on the niche market of animated movies tipping the scale more in favor of adult audiences? One would love to think so (of course without turning into another Robert Zemeckis and taking a permanent vacation from live action). Fantastic Mr. Fox is something to be experienced. Children will love its adorable characters while adults will marvel in its ability to connect with them. After all, each of us was a kid at one time or another and because of that there has never been a better excuse to pretend again.","user":"amarcordforever","rank":[184,239]},{"title":"A Wonderful Return to Classic Animation","rating":10,"date":"10 December 2009","review":"I'll admit it: I love stop motion animation. From the crude Christmas classics that are always on TV this time of year to the elegant masterpieces of Tim Burton, I never miss the chance to see classic animation at work. Needless to say, when I heard about Fantastic Mr. Fox, I was excited. A wonderful Rhold Dahl book, beautifully crafted animation, and an illustrious cast all in one package – this was exciting. I'm happy to say that my excitement was justified as Fantastic Mr. Fox is perhaps one of the best new movies I have seen this year. <br><br>The story of Fantastic Mr. Fox follows the lives of the Fox family – Mr (George Clooney), Mrs(Meryl Streep), and their son(Jason Schwartzman) – and their animal neighbors and friends. Mr. Fox, once a professional chicken stealer, decides to settle down with his wife after she becomes pregnant and instead take up a career in writing. After moving to a new home in the trunk of a tree, Mr. Fox takes notice in three massive fowl and fruit farms. Risking everything. Mr. Fox decides to embark on one last big job – stealing from all three farms. What happens after that can only be described as pure confusion and debauchery.<br><br>As with most Rhold Dahl stories, the book Fantastic Mr. Fox works to both excite kids and humor adults. As a result, the original short story is considered a classic for many families. Though some adaptations of Rhold Dahl classics (see BOTH adaptations of Charlie and the Chocolate Factory) have strayed from Dahl's dry, quirky humor, the film version of one of his best loved stories have honored this side of Dahl's story, projecting a humor perhaps more suited to adults than children, but creating an overall story that will appeal to all. <br><br>This movie would likely have been impossible without the work of numerous wonderful voice actors. George Clooney, Meryl Streep, Jason Schwartzman, Bill Murray, Willem Dafoe, Michael Gambon, and Owen Wilson all provide voices in the movie, among other lesser known but still wonderfully talented actors. As a result, the voices blend beautifully into the animation. Instead of feeling like characters with a voice shoved in, the voices and the characters are one. <br><br>The animation is perhaps the most appealing aspect of the movie. The script and humor works with the animation in ways traditional or digital animation could not. In many instances, the animation itself provides part of the story. By using a more traditional method, Fantastic Mr. Fox is also able to provide very specific quirks and personalities to each character, something often lost in newer animation. Adding to the animation is a muted, fall palette of colors, giving the entire film a homey, comforting feel. <br><br>Animation has become so perverted in recent years. Throwing away emotional appeal for visual appeal, the plethora of slick, computer animated, shiny films are almost unnerving. In such an atmosphere, choosing to make a use traditional animation can often spell anathema for the film. As a result, Fantastic Mr. Fox shines, choosing to pick traditional animation techniques to allow the viewer to relate to and communicate with the film in a way few films are able to do anymore. Though perhaps not for everyone, I would recommend Fantastic Mr. Fox for anyone interested in quirky humor, stop-motion animation, or simply a beautifully crafted and well written story.","user":"conversequeen64","rank":[89,113]}]