[{"title":"Underrated Supernatural Thriller","rating":7,"date":"13 September 2007","review":"The restless sales representative of a transport company Joanna Mills (Sarah Michelle Gellar) travels from Saint Louis to Texas in a business trip. She is haunted by violent visions and after meeting her client, she visits her lonely father. On the next morning, she decides to visit La Salle, a small town where she has never been before, but she had recollections of many locations. She lodges in a hotel and later she meets and is befriended by the local widower Terry Stahl (Peter O'Brien), who helps her from an aggression. Her daydreams and nightmares increase and she becomes obsessed for disclosing the truth about her visions of a brutal murder of a woman in a barn. Along her investigation, Joanna gets close to the killer and feels that her life is in danger.<br><br>I bought this DVD first because I am a huge fan of Sarah Michelle Gellar, the eternal Buffy, and also because I like supernatural stories. Fortunately I have disregarded the low IMDb User Rating since this film is an underrated supernatural thriller. The plot explores the concept of reincarnation in an adequate pace, unraveling the mystery in the last scenes. The direction is sharp and Sarah gives credibility to her character. My vote is seven.<br><br>Title (Brazil): \"O Retorno\" (\"The Return\")","user":"claudio_carvalho","rank":[48,68]},{"title":"Atmosphere and character","rating":8,"date":"10 November 2006","review":"There are attractions to this film. One, it proceeds at its own pace specific to the revelations the main character achieves. Some would say it moves too slowly but, I think, this is only in contrast to recent genre films that rush to exploit thrills, sometimes fun, sometimes silly. The pace is more like that of classic mystery movies with a little film noir mixed in.<br><br>The atmosphere is somewhat reminiscent of recent Japanese horror films and remakes though the narrative is much more structured. This is emphasized by the \"washed out\" look of the photography even in direct sunlight. Of course, parts of Texas where much of this was shot appear a little washed out in reality. While this is not especially flattering to the actors, it underscores the uncertainty the characters must endure. (Congratulations to Ms. Gellar for acceding to this when most actresses are looking for every cinematographic advantage they can get!) <br><br>The film is more about character and the discovery of destiny than about complex plot or even surprises. As in many Hitchcock movies, the audience is supposed to know more about some things than the characters. Most horror and mystery fans will have a pretty good inkling of the answer the heroine is seeking well before all the loose ends are tied up. (As the \"Robot Chicken\" version of M. Night Shyamalan might say, \"What a twist!\") <br><br>Ms. Gellar must portray a repressed young woman suffering from more than one trauma from the past. She conveys effectively that her character is confused, haunted, resolute, scared, brave and smart enough to make her way in a good ole boy business world. She cannot accept help even from the few who are closest to her. Her premonitions (memories?) lead her to out of the way places and a man with a past as tormented as her own. There is solid support from the reliable Sam Shepard and from J.C. MacKenzie in a performance that is quite a departure from his usual roles.","user":"Bmovie","rank":[81,125]},{"title":"It's Suspense Not Horror!","rating":8,"date":"12 November 2006","review":"Read the above title. The thing you need to realize is when you go into the movie is that it is a suspense thriller, not a horror film like Saw or The Grudge. I know this because I went with my best friend to see the film and he hates horror films, but he loved this movie as did I...You need to go into the movie with some things in mind. One, it is a low budget film, it's released through Rogue Pictures, from what I have heard, it is an indie film and therefore its not going to be on the same par as some of the other films that are out there today. Two, think more along the lines of \"What Lies Beneath\" and not along the lines of \"The Grudge\". I thought it was very creative, the way it was filmed and the way the story panned out. You may not figure everything out until the last 15 minutes of the movie, but I am sorry, I actually enjoy movies like that and not ones that are going to give everything away to you in the first ten minutes of the movie. Sarah Michelle Gellar does an excellent job in this film. I think it's just good all around. It's a good film to see if you want to be in suspense, but not be grossed out like Saw does.","user":"sonicfloodandavalon217","rank":[77,125]}]