[{"title":"Better Than They Say","rating":7,"date":"26 April 2006","review":"\"American Dreamz\" is not the funniest or cleverest film ever made, but it isn't as bad as a lot of the other reviewers are saying. To be sure, it will offend anyone who is a fan of American Idol, President Bush, or Al Qaeda.<br><br>The jokes are cute but will not leave you rolling in the aisles. There are really good performances throughout, especially by Willem Dafoe. who I had never really seen in a comedic performance.<br><br>This film could have been more mean spirited, but they actually went out of their way to make all the characters empathetic. My favorite part is when the terrorist are looking forward to eating grapefruit sorbet.<br><br>It's a shame this film was not more popular in the theaters, because it has a lot going for it despite it's faults. Hopefully it will be more popular on DVD.","user":"brenttraft","rank":[74,90]},{"title":"a RARE satire because it breaks taboos about what we can satirize","rating":9,"date":"24 May 2006","review":"Perhaps this film has gotten mixed reviews because it breaks an unwritten code about how far a movie can go in satirizing America's myths. When before have we seen the President of the United States on happy pills and robotic-ally pro- gram-med by his Rovelike handlers ? Who would suggest that an Al-Quaeda training camp could be funny and that someone in it has up scale all-American relatives in Orange County, California ? Could our love affair with American Idol be an escape from the collapsing American middle class way of life ?<br><br>This film IS often funny but it doesn't want that humor to stay in a feel good zone. It WANTS to make us uncomfortable and to face things that we don't want to look at too closely. The \"sin\" that this film has committed is that it wants us to grow up.","user":"cndiver","rank":[126,159]},{"title":"\"American Dreamz\" is a brave and hysterical satire that mocks everything and everyone.","rating":8,"date":"8 April 2006","review":"\"American Dreamz\" is first and foremost a satire on pop culture America. This movie is based around the television series American Dreamz which is the highest grossing show not only in America but around the world as well. The show is hosted by Martin Tweed, (Hugh Grant) a heartless man who is just doing the show for his own selfish reasons. American Dreamz is about to start its new season and as they go through the casting process they pick a southern girl named Sally Kendoo (Mandy Moore), an Arab named Omer (Sam Golzari) and many others. But that's not all the movie focuses on, it also focuses on President Staton (Dennis Quaid) who has just gotten reelected but is finally beginning to wonder what's going on in this world he is supposedly running. As the president begins to question his role, Vice President Sutter (Willem Dafoe) signs President Staton up to appear on the season finale of American Dreamz so he can redeem his image to the American Public. Bold and funny moments ensue<br><br>\"American Dreamz\" is a very ballsy and brave movie. At times it is so hard to realize you're watching a movie that was made by the big Hollywood studios because this film mocks everything about their culture and thinking. I think this film will be appreciated by very few because people will not be able to look at this film for what it is, a satire. The movie mocks so much about our current country from the television show American Idol to George Bush and Dick Cheney. I feel so few will be able to understand that this film isn't to be taken seriously, since it mocks issues that are happening in real life. <br><br>What I liked best about \"American Dreamz\" was that it mocked everything and everyone. From rich America to white trash America no one was safe. The movie mocks the United States as well as Iraq. It mocks fashion, music, television and so forth. It's a brave movie for being able to mock all these things because I can see so many people getting ticked off by the film. <br><br>But forget about everyone else for a moment, this review is based on my thoughts and I found the film to be incredible. It is one of the best movies I have seen so far this year. The film provides a lot of laughs and never drags on. The movie wants its audience to be able to laugh at themselves, something that Americans tend not to be able to do so well. It's a brave and comedic satire that pulls all the right punches and is based around a show that is truly something that everyone in the world is aware of. <br><br>Hugh Grant is terrific as Martin Tweed, the foul-mouthed, uncaring, fame seeker who doesn't care about anyone but himself. He pretty much mocks Simon Cowell from the show \"American Idol\" and I think he does this well. Mandy Moore is terrific as well and I think after a few more roles like this and \"Saved!\" she will start being recognized in Hollywood. Her character Sally Kendoo is pretty much a female version of Martin Tweed. She is uncaring, she wants fame, and she doesn't seem to care about anyone but herself. Not to mention she is a perfect mockery of such pop icons like Britney Spears and Carrie Underwood. Dennis Quaid does a great job impersonating President Bush and actually makes a more likable President in my opinion then the real George Bush. Also Willem Dafoe is the perfect mockery of Dick Cheney. I think his performance here is so dead on that he should receive some kind of nomination for his portrayal. But the real star of the movie is Omer played by Sam Golzari. He absolutely steals the movie from everyone else. He is the most likable and sweet character. At first you laugh at him but as the film goes on you begin to really love his character and feel for him. <br><br>Paul Weitz is the director, writer and producer of \"American Dreamz.\" Weitz is one talented guy who takes so many actors and makes them into something great. \"About a Boy,\" \"In Good Company,\" and his short lived but brilliant television series \"Cracking Up\" all prove that he is a talented guy who can create original and clever work and \"American Dreamz\" is no different. But not only is he a great director but a great writer as well. His screenplay is great and mocks cultures with dead on examples, not to mention his non-typical Hollywood ending which I applaud him for leaving in. I read audience reactions from the test screenings about the ending were pretty negative but I am glad he kept it because I feel it's a great ending. <br><br>Bottom Line, \"American Dreamz\" is for audiences who can laugh at themselves and the culture they are apart of. This is a film that people will either love or hate and there will only be a few in between. It's not a movie for those who are easily offended or see the world as something that shouldn't be made fun of. It's a satire in its finest form. You have a terrific cast all of whom are solid at their roles, the script is brilliant and brave, and the directing is wonderful. This movie even makes you think when you laugh. You can't ask for a better comedy movie to come out of Hollywood, this is the finest satire to be released from a major studio in years. If you have a decent sense of humor and can laugh at yourself every once in a while, check out \"American Dreamz\" because it really is a dream with a Z. <br><br>MovieManMenzel's final rating for \"American Dreamz\" is a 9/10. It's the best satire to come out of Hollywood in years.","user":"MovieManMenzel","rank":[146,212]}]