[{"title":"Rambo is back and better than ever!","rating":7,"date":"22 January 2008","review":"I saw this at an advance screening in Oslo, and going in, I didn't expect it to be any more than a cheesy and somewhat gory tribute to eighties actioners by a star/director/producer/writer who was desperate to relive past glory. That latter may or may not be true, but my former assessment was plain wrong. This movie is authentic, shocking and unlike any other comparable movie.<br><br>Given its genre, the movie is a masterpiece. The story is simple but solid, and works on several levels. The action scenes are unparalleled, more intense than \"Black Hawk Down\", \"Saving Private Ryan\" and \"Stalingrad\" put together. The level of brutality and gore will shock and fascinate, and no doubt cause some level of controversy.<br><br>Stallone proves himself to be an excellent director, as well as in excellent shape for his age. I had little faith in him going in, and I stand corrected.<br><br>This is a Rambo who has come to terms with who and what he is, in a movie that holds up when compared with the original \"First Blood\". Well done, Sly. Well done indeed.","user":"Norse_Sage","rank":[649,870]},{"title":"Pure action!! Solid Movie.","rating":9,"date":"25 January 2008","review":"Rambo is without question a sick action movie and Stallone has proved himself again as an intense actor and as a solid director. This installment combines elements from all three previous movies but this one had a much more realistic feel. Yes some dialog is questionable and there are a few, albeit brief, scenes that don't quite work, but make no mistake, this movie takes no prisoners. Stallone slips back into the role with ease and his supporting players do an admirable job. Critics will whine as they always do about the excessive violence, gore and lack of story. (Stick to giving awful movies like The Skeleton Key thumbs up guys). The ironic thing is that Rambo actually gives a vivid and some would say accurate portrayal of war. It has a similar feel to Black Hawk Down and borrows its chaotic action. Rambo pulls no punches...It's brutality, violence and gore are rooted in reality. Gone is the \"fun\" action of 2 and 3. It is replaced with realism which amounts to some of the best and most intense action sequences I've ever seen. My only real gripe with the film was scenes that were sped up in post. (No big deal) <br><br>Finally, the integrity of the series as a whole has been kept in tact. Everything from the music, to the action to the character to the final scene. An extremely well crafted movie. Rambo/action fans will not be disappointed...And neither will the critics who rave about The Princess Diaries","user":"chrisalsop1213","rank":[247,325]},{"title":"Essential action film best Rambo film in the action genre my second personal favorite","rating":10,"date":"2 January 2018","review":"Rambo (2008) is essential best action film in the action genre my second personal favorite film in the Rambo franchise. I love this film to death! Rambo is a fighting machine and I absolutely love the gory action films. This is movie is great it is absolutely awesome I love this film to death. It is the best film, since Rambo III wasn't that successful, this movie was. It is been nearly a 10 year anniversary since this movie come out. Here is where the legend of action heroes reloaded and ended well. <br><br>They would've raped her fifty times... and cut your f*****g heads off! Who are you? Who are any of you? <br><br>My number one favorite action film is Rambo: First Blood Part II, this my second favorite action film from Sylvester Stallone. First Blood is number 3 favorite action film in the series. John Rambo is my comic book hero. I love the fourth installment of Rambo to death. I know there is a lot of people who hate this film and prefer Rambo III over this film and think it is not a good movie. I disagree It is not your typical action movie because it is way too gory and bloody mine it is. I love Rambo's Mini Machete he uses in this movie. This is Sylvester Stallone's only movie he wrote and directed by him self. <br><br>The action is gory and bloody that I love it. The movie has ton's of action and it is realistic performed. I love the rescue mission. I love that Rambo chops a Burmese soldier's head off with his machete. Rambo put's a mine in the forest and kill's 20 Burmese soldiers. Rambo is using a Browning M2 Aircraft machine gun. Rambo uses the M2 to obliterate the driver and than he kills all the soldiers while he is reloading the machine gun M2 - .50cal BMG and than he kills the rest of the soldiers those were the kicks ass action sequences. You have a lot of fire power in here and I love the rescue mission in here. This is a bad-ass kick-ass film!<br><br>Sylvester Stallone portrayed and acted well his famous character and so did Graham McTavish as Lewis a mercenary, Matthew Marsden as School Boy, Reynaldo Gallegos as Diaz and Julie Benz as Sarah I like these characters and they did their acting well done. Sylvester Stallone directed this movie and to me it is really powerful realistic well action performed. I don't agree with you haters, I think this movie is better than Commando (1985) Schwarzenegger film! Rambo puts most of action films today to shame. That's my personal opinion. <br><br>Music score from Brian Tyler wasn't that terrible like everyone is saying it was arguably good to the Rambo character. Richard Crenna and Jerry Goldsmith couldn't come back because they both past away and are no longer with us anymore. R.I.P. I think Brian Tyler did a good score. <br><br>P.S. I don't like the extended version because it is different from the theatrical cut and Rambo looks like an asshole in the beginning of the movie. I love theatrical cut and honestly it goes fast around it is not boring it is entertainment It is one of my personal favorite action movies. This movie is a perfect 10 for me.","user":"ivo-cobra8","rank":[113,144]}]