[{"title":"Let's call it as we see it.","rating":1,"date":"20 December 2006","review":"I tell my students to call it as they see it. If someone would be crushed by a scathing review, so be it. These Hollywood \"hotshots' need to get the hint that the public expectations for a true representation of a best-selling novel are more important that their \"artistic vision.\" And when I say \"artistic vision,\" I mean stupidity and downright ignorance. Paolini's Eragon did not sell the way it did because it was merely some pulp fiction about a dragon; rather, it sold because it has a strong storyline, compelling characters, and timeless message. Not to mention that it was written by a 16 year-old boy.<br><br>The most egregious evils lay within the following three reasons. <br><br>First, as it is, the entire film is told as exposition. Perhaps this was done purposefully; after all, this is the first installment of a trilogy. However, it should be a complete story regardless. The writer tells the viewer what is going on, rather than showing the viewer what is supposed to happen. It's like writing a paragraph with only statements and leaving out the 3-5 sentences of elaboration for each. It is the worst kind of highlight paper. Truly by the end of the film, you are only waiting for the story to begin. But honestly, by the end of the movie, you just want to be put out of your misery. <br><br>Second, the characters are static and boring. The viewer gets no sense of emotional depth to any of the characters. By limiting the character development, the trilogy itself is severely limited. By the time the film reached the final battle scene, instead of empathizing with the characters, I laughed at them. The music told me that I should feel excitement, frustration, and even sadness, but all I could do was laugh. The laughter was uncomfortable and verging on hysteria (I was deeply wounded by this film), but it was laughter nonetheless. For example, when Eragon wakes after the final battle is won, he looks upon Murtagh's friendly and sympathetic countenance. Eragon asks if Saphira is all right and Murtagh replies, \"Some friends can never be replaced\" Leading the viewer to think that Saphira may be dead. Eragon is clearly distraught, and at this point, as a viewer, you should be crying. But in a whirlwind, Saphira appears, and Murtagh happily proclaims something like, \"But luckily, they don't have to!\" And at that point, I started laughing. A loud, raucous laugh came out of me and I had no control over it. I thought, \"Gee, that Murtagh! He sure is a practical joker- he almost had me there!\" Because, you know, that's what pals do: they pretend that their friend's best friend has died, and then they can have a good laugh over it. Ha ha! Yeah, right. The viewer has no sense of the camaraderie between these characters because at the end of the film, we still don't even really know who they are, much less have a sense of their relationship to one another. <br><br>Third, as a result of the previous two reasons, the story has no message worth telling. The novel is infused with themes about friendship, tolerance, caring, and justice; however, each becomes lost in this nightmare that Fang-who-ever had wrought. It is the most severe of all sins, as this film will be more widely accessible and distribute than the novel itself. For all those who walk out of the theater thinking this movie was good, whether or not they have read the novel, they are being deceived. They are being deceived into thinking that this garbage is all that this novel is or could be. With The Lord of the Rings, Peter Jackson proved that a significant novel with a clearly defined fantasy world can be made with thoughtfulness, grace, and beauty. Eragon, the movie, contains none of those ideals. With a poorly written script by Peter Buchman, widely known for his work on War Magician and Jurrasic Park 3 (Did anyone even see that?), and slipshod production values, the film falls flat on it's face. All good stories leave the reader with something to think about, but this one just left me thinking, \"I paid $9 for this?\"<br><br>True, the novel is a significant work that should be made into a film. However, I can't see how, in the universe that has been created by the filmmakers, that the full trilogy can be told with any vestige of the original story arc. What this Fangmeier moron has done is a true disservice to Paolini, the Inheritance trilogy, the fans and general public, and most significantly, himself. This is his directorial debut, and it is a pathetic interpretation. <br><br>Something amazing could have been done here. But what I saw was a lazy and wretched re- working of a story that should have simply been told as it was written. For this, as a teacher, I must give Stefen What's-his-name and his entire production crew an F because his work was off-topic and irrelevant.","user":"mrs-mcmanus","rank":[54,63]},{"title":"Don't watch the movie-read the book","rating":4,"date":"25 December 2006","review":"When I first heard that a movie is going to be made by the book \"Eragon\" by Christopher Paolini, I must say I was very delighted, and I was even more delighted when I heard that Stefen Fangmeier will be the director. I have read the book, and thaught:\"What a great movie this is going to be\". Unfortunately, I was wrong. First of all, I would dare to say that half of the events that happened in the book weren't shown in the movie at all(reason: Lord of the Rings has less then 400 pages and the movie lasts around 3 hours; Eragon has around 500 pages and it lasts around hour and a half). As a result, instead of complexed, unpredictable fantasy plot you get simple, one-way heading fairy tale. Characters that play very significent role in book(like Murtagh, Ajihad and Angela) are hardly even mentioned in the movie, so that it becomes centered on pretty much only 3 characters-Eragon, Saphira and Brom. Villains and locations lack imagination, so they look cheap and ordinary. Choice of actors is, in my opinion, good, except Edward Speleers. There are way too much \"memorable quotes\" in the movie, so that movie becomes kind of too much theatrical.Everybody, from director to actors failed, but still, I personally bealive that the biggest failure is Peter Buchman, screenwriter. Although he had a fantastic material to work on, he managed to ruin it, and make a pathetic screenplay from a fantastic bestseller. Only bright side of the movie is always top-of-the-class John Malkovich(King Galbatorix), pretty solid performance by Jeremy Irons (Brom), but most of all dragon Saphira (voice by Rachel Weisz, whose vocal abilities are on very desirable level)","user":"damir-zupanic1","rank":[374,533]},{"title":"For the readers of the books, it was murder.","rating":2,"date":"16 December 2006","review":"First of all, the movie starts with Arya and the egg. But the narrator explains about who she is which eliminates the whole mystery of her character right off. There was no character development at all. Eragon is totally downplayed in the beginning and Roran is there and then just gone. Brom was portrayed as a cranky old man instead of the compassionate story teller. I must say though, that Saphira's period of growth was clever and Saphira, herself, was fantastic. But, none of the characters had personality. Speaking of the characters' personality, it wasn't ALL the screenwriters fault. What was with Ed Speelers? His rendition of Eragon lacked substance. The battles were immensely cut short. SOOOOOOO much was cut out of the book. And for people with children, it should be rated PG-13 because the battles were pretty graphic and the Ra'zac were really creepy looking. <br><br>For people who read the book, the movie will make you want to kill the screenwriters. Major things were totally screwed up. Brom didn't even die the way he actually did in the book! Arya was conscious pretty much the whole time so there was no \"oh no she's going to die!\" suspense there. It was pretty lame. I felt nothing for any of the characters throughout the movie because nothing about the movie made me want to care about them. Did Christopher Paolini sell out when the price was high enough? I don't know but I am shocked that a writer would allow his or her book to be demolished in such a disgraceful and mocking creation as this movie. The graphics were good and the music was too, along with the setting and they were the ONLY good things.","user":"goddessngirl","rank":[28,35]}]