[{"title":"Move Over Henry VIII, Louis XIV, and Napoleon: Mirander Priestly is Here -- Realistic Exposé of the Feudal-like Realm of the Madison Ave Fashion Scene","rating":8,"date":"4 October 2009","review":"We in the United States like to believe that we reside in a country without royalty and nobility. The only people who think that there is true egalitarianism have never worked in the Entertainment and Media Industries. There is an aristocratic elite, no question, and it is not exactly made up of politicians (although there are some). It is largely composed of those who control media, particularly in television, film, radio, music, fashion, and print. They control what get's seen and what doesn't. When these people put on huge events that involve the press, cameras, and limousines, the public comes out to pay unquestioned homage to these elites, often on the sideline behind a barricade. With cameras flashing, these people are treated like the royalty of the 17th and 18th centuries. \"The Devil Wears Prada\" examines what is like to be in the inner circle of one of these elites.<br><br>In addition to the public's clamoring to glimpse these powerful elites, another segment of the population desires to become one of these people by trying to \"break into\" the media business. Since there are many more people who dream of being in these circles than there are spots available, this gives enormous power to those already on the inside, particularly those who have sway to either make or break an up-and-coming career. \"The Devil Wears Prada\" chronicles an aspiring journalist who lands a dream job that, she is told, \"thousands would kill for\": being the personal assistant to the editor of one of the largest fashion magazines, Runway, whose editor-in-chief makes Bill Gates seem like a softy. The character, Miranda Priestly (played by Meryl Streep in a tour-de-force Oscar-nominated performance) is in fact modeled after real-life Vogue Magazine editor Anna Wintour whose chilling detachment from those around her, her ability to make or break fashion careers, and her cut-throat demands on her staff have become legendary throughout the fashion world.<br><br>In the film, the corporation that is \"Runway\" is no democracy. It is feudalism, with Mirander the absolute queen ruling over her dominion of serfs who constantly scatter about trying to please her. The central character, Andy Sachs, is plunged into this Madison Avenue purgatory without knowing the rules of the game. A journalism-major from Northwestern, Andy knows next to nothing about the fashion world, but it's not just the fashion world--it's the world of the elite in New York. Since everyone wants to gain favor from the higher-ups in order to step up the ladder, there's often over-the-top deference to those in elite positions. I half-expected her female assistants to curtsy when Mirander entered the office. Mirander knows perfectly-well her status and she uses it, often flaunts it, to her advantage. Her staff run around like castle servants anticipating the arrival of the Lady of the Manor.<br><br>Streep is magnificent as her voice never reaches past mezzo-piano. When one of her staff has transgressed, or simply cannot fulfill her expectation (I doubt Superman could hold a job there), in the softest tone possible she expresses her disappointment. And yet, the anticipation of her negative reaction is what makes for moments of anti-gravitational intensity. Of course, she never compliments anyone when they've done well. Excellent performance is taken for granted in this kingdom. I've never found the raging tyrant frightening. Rather, it is the even-tempered soft-spoken empress with absolute power who sends anyone who to displeases her to the block with a disinterested wave of the figure that is the most terrifying.<br><br>At one point in the film, Andy chuckles when Miranda fusses over some seemingly identical-looking belts which of course spawns a lecture about how Andy's current wardrobe was in fact created by the fashion elite. This does point to another side of the fashion facade which I think may be the point of the film. If you take away the cameras, the celebrities, the allure, the models posing in museums wearing the latest by Christian Dior, at the end of the day all this is about is just jackets, belts, purses, skirts, dresses, and pants. I think one of the characters says as much. These clothes may look wonderful, even stunning, but that's all they are. They are lifeless pieces of fabric cut in a certain way to make the wearer look appealing but that's all it is. The fashion industry of course needs to perpetuate the idea that clothing is much more than clothing: that beautiful fashions will create fairy-tale existences for the purchasers. They are meant to represent a life of luxury and splendor and the purchase of these articles will bring you closer to that reality. When it doesn't, you need to buy more of these clothes. And you need to read Runway (aka Vogue) to tell you what you should buy. Of course, the only ones who actually have these fairy tale existences are the ones providing the clothes. Most of the people buying these fashions are still behind the barricade. Is there an irony here?","user":"classicalsteve","rank":[55,68]},{"title":"Much better than I had been led to believe","rating":9,"date":"5 March 2007","review":"I had been told that Merryl Streep is great in this movie but the movie isn't really very good, so I went in with very low expectations. Maybe that was good: I really liked \"The Devil Wears Prada\" a lot.<br><br>Maybe I liked it because of two things I had in common with Andy: first, I have had the experience of starting a new job with only the vaguest idea of what I was supposed to do (and how to do it) and finding that everyone expected me to perform competently, without any training or help, right away. Second, I have had a boss (female) who was so difficult to please and so willing to tell her underlings how stupid they were that several quit without even waiting until they could find other jobs. In other words, I could really relate to Andy's situation. Stuff like that actually does happen in the real world. Perhaps, that is the reason that I was possibly the only person in the theater who was hoping Andy would not make the choice she made.<br><br>One thing that Miranda Priestley (Merryl Streep) had going that my Boss From Hell did not was class. It would have been very easy to create Miranda as a monster, but, wisely and skillfully, Merryl Streep allowed her to have a dignity and intelligence that made her seem to be demanding but not sadistic.<br><br>Stanley Tucci is superb as Nigel, the ambitious, hard working man who dreams of having a position of power like Miranda's some day.<br><br>\"The Devil Wears Prada\" is a very funny movie that is not as far divorced from the real world as, I believe, the producers of this movie may have thought.","user":"Fred-S","rank":[87,114]},{"title":"Meryl Streep, A Character Actress As Star","rating":7,"date":"13 July 2007","review":"Unmissable for Meryl Streep fans. She plays second fiddle to Anne Hathaway here - screen time wise, otherwise she's the whole bloody orchestra. She's the one reason to see the film and that in itself is one hell of a reason. Meryl Streep is fearless and part of the joy of going to see her films is that we know for a fact that she's going to dare and dare and dare. From Sophie's Choice and A Cry in The Dark to Death Becomes Her and Plenty. Here the story is as unbearable as most TV commercials but she, Meryl/Miranda transforms it into something else. We connect with her evil queen because her evil queen is much more real, much more human than anybody else on the screen. Emily Blunt and Stanley Tucci are fun but they're in the periphery of a story that's so wafer thing they can't really move to the center. Anne Hathaway is kind of invisible and her character only changes costumes and make up. There is no real tangible growth. Now that I got that out of my system. Go see Meryl be Miranda. You'll have a lot of fun.","user":"borromeot","rank":[140,191]}]