[{"title":"A realistic glimpse into our history....","rating":8,"date":"6 November 2005","review":"I was reluctant to see this movie. As a veteran of Desert Shield/Storm, I spent my first 90 days in-theater in the Weapons Co of A Swofford's Battalion. I later was moved to the 1st Bn of 7th Marines, but having been in the same unit for some of the same time I felt I could offer readers a unique perspective on the film's accuracy.<br><br>From a purely aesthetic perspective I thought the film was well done. The acting was very good, and the script was well written, witty, and accurate. The actors were well suited to their roles. My personal preference for a good plot would have been disappointed were it not for my personal interest in the film. In my opinion this film is an outstanding dramatic-documentary, so adjust your expectations accordingly. If you are expecting a driving plot line and all the accompanying dramatic tension, then I think you will be disappointed (as many whose comments I heard exiting the theater certainly were). But if you think of it as a chance to take a glimpse into a point in history, and see it as some of those who lived it did, then I think you will be impressed.<br><br>Many people may think that the obscenity of some of the interactions was overdone for effect. But whatever anyone's personal judgment of that behavior, that is the closest portrayal of Marines (or soldiers) being themselves I have yet seen on screen. Marines are vulgar. They do watch porn. They do fight among themselves. They do both hate, and love, the Marine Corps. There is an omni-present anti-war conspiracy theorist. The do say ridiculous things. There are some who are over the line. The reality of the Marine Infantry is that things happen there every day that are well beyond conventional sensibility, and which strain credibility to the average civilian. It's all true. I love the Marine Corps and I am still serving - I don't have an axe to grind. It just happens to be true.<br><br>Are there parts of the film that I find incredible? Yes. But they are not the essential things. There is a scene, it's even in the trailer, in which everyone is firing their weapon into the air. I wasn't there, but I can't fathom a breach of discipline on that scale. I can't say it's impossible, but I am doubtful. But whether it's true or not is not important. At its essence this is a film about Marines, how they adjusted to the Marine Corps, each other, and a war. If there are a few incredible details, then we can just be grateful that Hollywood didn't impose a car-chase on us.<br><br>This is a film about Marines. At that time, there were very few who turned down scholarships to Ivy League schools to come in. We were from strange backgrounds. We were obscene. We did want to get our kills. Many of us were frustrated that our war was only 100 hrs long. We knew we were filling the footsteps of giants - the Marines of Iwo, The Chosin, Belleau Wood - and I think we all wanted a chance to earn a place next to those men. In our wild, adrenalized youth, those aspirations just took the crude form of looking for a kill. Or at least that's how I've put it in perspective 15 years later.<br><br>If you go and see this film, try to recall yourself at 18 (as I was). Suspend your judgment of the obscenity and vulgarity until you're sure you would've done it differently. I can't speak for Swofford, but I am still incredibly proud of my service there. The insanity of this film reminds me why: because it is characteristic of the immense hardship that our youth bears on behalf of the rest. Do the characters look stressed? It's not hyperbole. We were 18 and we thought we were going to die over there. Still, at H-Hour, everyone marched North. In my opinion, you better fill some big shoes before you judge that. <br><br>So don't go into this film champing at the bit to pigeon-hole it as \"Anti\" or \"Pro\" war, with all the pre-fab rhetoric that comes with such a judgment. You have an opportunity here to look back into our little moment in history. Swofford has invited you into our memories. They are not Right, and they are not Left, they are just our story as Swofford lived it. If that kind of thing interests you, then go and see this movie.","user":"splatzer","rank":[660,698]},{"title":"A true and realistic story","rating":10,"date":"4 November 2005","review":"As someone who is in the military, I thought this movie was perfect. If you are looking for a message about war or politics you won't find it here. This movie is strictly a story told by the main character about his time serving in the Marine Corps and his tour in the Gulf. It is true to life. From the language, situations, to the way the characters interact, the film is right on with accuracy.<br><br>The film is shot with striking cinematography. Scenes in the desert, especially with the oil fires, are breathtaking. The shots are done perfectly and originally throughout while the score and soundtrack takes it to a powerful emotional level.<br><br>The film will receive bad reviews from a political standpoint. I read a couple before I saw the movie that all stated they didn't like the movie because it had no message or stance. To that I say good. It was refreshing to see a movie as a movie. I was glad that it was just a story, and there wasn't any motivation underneath it. That's not to say that the movie is one dimensional. There are many undertones, just none of which are attempting to reassert or defame the current war in the East.<br><br>See this film if you want to see a humorous, sad, psychotic, intense, and most importantly REAL story.","user":"scottmey","rank":[515,640]},{"title":"Pleasantly surprising","rating":7,"date":"24 October 2005","review":"I saw a promotional screening of the film, sponsored by my university. Following the screening was an audience Q&amp;A with the author (and main character), Tony Swofford.<br><br>And it was no surprise that the very first question from the audience was, quite ambiguously, \"Do you support the military?\" When Swofford dismissed the question as too broad and complex to be answered with a simple yes or no, the inquirer followed up with, \"Well, do you support the war?\" Swofford dismissed this even more readily.<br><br>To me, this was perfectly representative of how the film handled its potential political implications.<br><br>As Troy says early on in the film, \"To hell with politics. We're here now.\" And that's essentially how the movie went. <br><br>It bypasses the soapbox and simply tells you how it was, from the perspective of a single soldier. And while the opening boot camp scenes may seem like Full Metal Jacket Lite, the rest of the film is truly unique.<br><br>Sam Mendes directs with his usual brilliance, showing once again his affinity for bright, vivid color, even in the largely monochromatic desert.<br><br>Jake Gyllenhaal gives an excellent performance as Anthony Swofford, complemented by the able talents of Jamie Foxx and Peter Sarsgaard.<br><br>The film's only real flaw is that, like the war on which it was based, it's pretty slow, and not a lot really happens.<br><br>In the strictest sense, I would have a hard time even classifying this as a war film, and it's certainly not a deliberately political film.<br><br>But in its own way, it tells an intense, personal story. Beyond that, you're simply left to make your own judgments.<br><br>7/10","user":"Juansmith","rank":[379,483]}]