[{"title":"Mindless, but Fun","rating":6,"date":"9 September 2006","review":"Anyone who expected this movie to be an amazing, intelligent film will be severely disappointed. However, from the trailer, I made a guess as to the general quality of the film. I was right, and I enjoyed myself.<br><br>Hot guys who do magic. That's pretty much all you need to know about the movie. The dialogue is crap, most of the acting is so-so, characters are woefully underdeveloped, and the plot is flimsy at best. That said, it was a fun movie. There was exciting action, and lots of fan service for the girls in the audience (Don't worry boys, there are girls in dubious sleepwear, too) It's one of those movies where you sit and watch and say, \"This is a really good idea, but even *I* could write a better movie than this.\" The concept is cool, the execution not-so-hot. But as a break from the grind of class? Definitely good.<br><br>The action was cool. The boys were pretty. And, really, what more does a girl need?","user":"madhatterdru","rank":[205,279]},{"title":"not as bad as expected","rating":4,"date":"17 September 2006","review":"Basic summary: Ipswitch used to be a community of witches and escaped the Salem witch hunts by forming a covenant of secrecy. The first born males descended from these families have supernatural powers, and must come to terms with the seductive, addictive nature of using those powers.<br><br>Well, I usually give movies the benefit of the doubt and start from a 5, going from there:<br><br>Production: -1 for very obvious audio out of sync, +1 for nicely done special effects, the darkling actually gave me chills, +0.5 for nice colorization (I like the dull blue), -0.5 for the stupid sound track, +0.5 for the opening sequence -- I'm a sucker for stylish compositing and flashy title design.<br><br>Story / Script: +1 for decent main idea, -0.5 for DBZ/Matrix/Street Fighter ripoff/pastiche, -1 for not explaining some plot threads very well (spiders, darkling), -1 for boring, predictable ending, -1 for gratuitous exposition, both as words on the screen and as bland monologuing<br><br>Acting / Characterization: -0.5 for bad bad acting, although it gets a little better as the film progresses, -1 for lack of character development, especially among all the females<br><br>Other: +1 for gratuitous male and female nudity, which is fun to watch, and +0.5 for no sex scenes, which for this genre are usually done very badly and end up being boring rather than hot, +1 for hitting its target audience, teenage sci-fi/horror/thriller fans, even though this movie is not exclusively any of those genres.<br><br>Conclusion: This is not a \"film,\" this is a MOVIE. There's really nothing to analyze, it's just good, (relatively) clean fun. Lots of really attractive actors and actresses. Lots of boys fighting in the style of DBZ and Street Fighter. If you like cute actors and actresses, supernatural special effects, and/or mindlessly fun plots, this movie is for you. If you prefer Oscar-worthy, exquisitely-produced film masterpieces with tons of multi-layered, allegorical plot threads and groundbreaking visualization techniques, you probably won't like this film.<br><br>Using my twisted logic, this movie gets a 4/10.","user":"blackfractal","rank":[138,192]},{"title":"Typically, I'm in the Minority Again. I LOVE This Movie!","rating":9,"date":"8 December 2007","review":"Okay, so it's a male version of the Craft...kinda. Yes, I'd have to agree with that summation; however, this features MUCH more story, more meat, more history, and a FAR better execution than the Craft. It also presents a much better developed story, characters, and production style.<br><br>This is dark, yet shines throughout. It is witty without being stupid. It is serious without taking itself too seriously. It is entertaining without losing sight of the fact that its audience wants to be uplifted by their entertainment.<br><br>This work features some innovatively creative elements, great performances, and strong dialog combined with historically based characters, enlightened direction, and an incredibly slick production style that does not lose itself in its...slickness. *L* I really enjoy this, and have the extended edition in my DVD collection.<br><br>All in all? It's not good for the kiddies. It tends to be a bit harsh in places, but falls well within the PG-13 rating it receives. Billed as \"horror,\" this work is more \"thriller,\" in my opinion. It makes for decent Friday/Saturday night viewing, if you have not yet seen it.<br><br>It rates an 8.7/10 from...<br><br>the Fiend :.","user":"Elswet","rank":[58,81]}]