[{"title":"A brilliant performance by Maggie Gyllenhaal","rating":7,"date":"26 October 2006","review":"Finally a film that you feel does not purposely play at the collective heartstrings of humanity or jerk you for tears every chance it gets. In spite of its tragic and heartfelt content of a mother reconnecting with her 6-year-old daughter after she has been released from prison, Sherrybaby moves back into realistic mode, and feels truly engaging because of it.<br><br>Undoubtedly, Maggie Gyllenhaal's performance in the film reeks of Oscar-bait for it is simply an excellent performance. Sadly I think the academy will overlook 'Sherrybaby' because the film is simply not good enough on its own and the sum of its individual components rarely, if ever, do justice to its titular actress. However, awards are not everything and rest assured that the film still has plenty to offer. In the front row for this is its realistic and unshowy core, sewn together by Maggie Gyllenhaal as ex-con and former teenage-mom-and-drug-addict Sherry. Upon returning to her old life, she finds that it is nothing like she left it. Her daughter Alexis now lives with her brother and his wife Lynette, both of whom have become strong parental figures for the young girl, much to the dismay and frustration of Sherry who wants nothing more than to re-build a bond of trust and love with her daughter, but who now finds Lynette a barrier.<br><br>This frustration makes and propels 'Sherrybaby'. It stems from a variety of things that the film touches upon at several points: the seedy halfway home Sherry is sent to live at upon her release, the trouble she has readjusting herself to society and to work (\"I'll suck your dick if you give me the job I want.\"), her abusive relationship with her father, her coping drug addiction and the fact that Lynette is discouraging Alexis from calling Sherry 'mommy'. The film is evenly peppered with these problems but luckily it never tips over into gloominess. What it does most, however, it plunge bravely into the white trash culture of America: junk-food, fat people, seedy jobs and apartments, pinning its scantily-clad centre Sherry somewhere in between.<br><br>I think Gyllenhaal captures her character with effortless conviction. From the mood swings, frustration, confused maternal love to the ultimate frailty, she translates every component of her wreck of a character with perfect emotional transparency. It all translates into a very real and heartrending performance. Best of all, she never falls prey to showiness or exaggerated melodrama; she keeps it down-to-earth. Soon Sherry turns into a manifestation of the title 'Sherrybaby' as she finds herself sucked back into her teenage life of sorts: she craves attention, she is helpless, she wants to do drugs, she sleeps around. All the while she remains on the outside of things looking in because she has been absent for so many years.<br><br>Certainly all performances in the film hold up pretty well. It is especially interesting to see Danny Trejo in a role in which he is actually nice for a change  a bit of a sleaze, true  but still on the side of good (as opposed to rentable bad-guy/thug). All the interactions between the characters follow the theme of the film; it is realistic. But 'Sherrybaby' is not devoid of faults. At all. One of its key shortcomings is its lack of any clear point. You get the feeling most scenes do not serve any purpose other than to give us a feel for the way things are run (wow, I feel like I'm writing about Scorsese) in the white trash culture. There is in this way no clear narrative structure. What is worse is that there is little or no humour to ease the mood, and nearly NO music score throughout the film. <br><br>In fact, dissecting the film would probably reveal individual components that could not even pretend to equal the sum of it all. Thankfully, Maggie Gyllenhaal elicits so much sympathy as Sherry that it does not really matter.<br><br>7 out of 10","user":"Flagrant-Baronessa","rank":[77,84]},{"title":"By Far One of the Most Unsettling Pics I've Seen But Anchored by an Outstanding Lead Performance by Gyllenhaal","rating":7,"date":"21 November 2007","review":"There is one reason and one reason alone to see 'Sherrybaby', and that is for Maggie Gyllenhaal tour-de-force performance. Gyllenhaal gives her best performance to date as Sherry, a heroin addict/thief on parole who struggles to stay clean and re-kindle a relationship with her estranged five-year-old daughter. Everything else in the movie is mediocre at best. The other actors are good, but none of them have roles with enough substance for special merits. 'Sherrybaby' is not an easy movie to watch, it's painfully realistic and I felt incredibly embarrassed by Gyllenhaal's Sherry through-out the entire film. It's also somewhat predictable. Long story short, 'Sherrybaby' would be nothing without Gyllenhaal's groundbreaking and tear-jerking performance. Grade: B","user":"MichaelMargetis","rank":[16,17]},{"title":"Great Performance","rating":10,"date":"8 October 2006","review":"I saw this movie at Sundance and thought Maggies' performance was WOW. There is so much junk that makes it to the big screen, I am surprised this movie did not get widescreen release. Obviously the \"suits\" think movies that make you think won't appeal to mainstream audiences. While at Sundance watching this film, I was sitting near two woman that were adult probation officers and they stated that the movie was very realistic and thought the Director did a great job of capturing what woman go thru after they are released from prison. They also said that most woman in jail have been sexually or physically abused at sometime in their life. Great job and kudos to all those that worked on this movie!","user":"Albionw","rank":[48,58]}]