[{"title":"Wonderful! Highly recommended","rating":9,"date":"27 October 2004","review":"This direct-to-video sequel is already out in Europe, so that's why I've already seen it. And guess what : I love it! Not only because I'm a Balto fan, but because it's a really good animated movie, especially for a DTV (and we all know that the DTV sequels are usually all but good!).<br><br>In fact, it gives a slightly different feeling compared to the original or Wolf Quest. I don't know exactly why, but this is the first time I felt that with an animated sequel...And it's really a nice thing ;) The story is one of the best points : there are a lot of things happening, perhaps even more than in the first, and everything goes quickly. There are no boring passages, although some will probably not please everyone. No magic here, the humans are back for good, all the key points of the scenario give a feeling of reality; so it is much closer to the original on that side. The characters aren't still very well drawn; in fact, it depends, sometimes they are perfectly drawn, nearly as in the first one, and sometimes much less. I would say it is common for a DTV on that side. However, the backgrounds are AWESOME. The colors are more than beautiful, and the less beautiful backgrounds are on pair with the most beautiful in the original. It's another thing that is really impressive for a DTV sequel, seeing that IMO they are as beautiful as some big animated movies like \"Brother Bear\" or \"Spirit\", and perhaps even more! As for the musics : I would say the same thing. While there are still some empty passages, the soundtrack is really, really awesome, impressive, especially near the end. It may not have the shrewd style of Horner's Balto 1 soundtrack, yet the score from Adam Berry is exceptional, and make some passages unforgettable. To give a better idea of what I overall think of the film, I would summarize that into one word : beautiful. Really, really beautiful. Beautiful scenario, beautiful musics, beautiful graphics... Some of you might be wondering if they will rent it or buy it directly. Well, I believe that this film has more than enough replay value, when Wolf Quest had nearly none; so IMO, it is definitely a must-buy for every Balto fan, and even for everyone else ;)<br><br>To summarize : A wonderful film. Definitely a must-see for Balto fans, and one of the best DTV sequels ever made to an animated movie (maybe the best with TLK 1/2). It may have some flaws, but there are so many qualities in the scenario, graphics, musics...that everyone will let through these minor problems, and enjoy the great story it offers. If you liked Wolf Quest, you have all chances to love it. If you didn't, but still liked the original Balto, believe me : it's somewhat different from WQ, so you don't have any reason to not watch it just because WQ was a disappointment. Unlike Wolf Quest, I really can't see anyone who wouldn't like it.","user":"steetboris","rank":[16,18]},{"title":"Poor Ending To The Balto Sequels","rating":4,"date":"24 August 2006","review":"The original Balto was amazing. A much-loved favourite of mine. I also enjoyed Balto II - Wolf Quest. But then came Balto III - Wings of Change. First impressions, poor animation with computer animated elements. None of the characters had their original voices - nor did they even sound like the originals. Whoever thought up Stella the Goose should be sued. She is an unnecessary character who, in my mind, ruins the entire film. I do like Kodi, Balto's son in this film. He is given a lovely character and makes the film actually worth watching. No mention is given to Aleu though? All in all, this is a poor ending to the Balto sequels and was most probably even less popular than poor Balto was originally. An addition to a Balto fans collection but otherwise, do not waste your money.","user":"xWhiteFang","rank":[8,11]},{"title":"It washes away the shame of Balto II","rating":6,"date":"9 September 2005","review":"OK, the plot is a bit cheesy and predictable. Most of all, it is so simple that it needs a secondary story to back it up, that being a love story for the goose. But it's way better than Wolf Quest and it approaches the quality of the original Balto. The animation is also better, a slight change in the way things and people are drawn is obvious. <br><br>All in all a good sequel, but enough with Balto. Leave the poor dog alone. Let us see, in the first movie he fought the lead dog and won. In the second Balto he fought a lead wolf and won. Now he takes on a plane, and he wins. Balto does rime with Rambo, doesn't it? :)<br><br>In conclusion, I would rather watch Balto I and then Balto III. Balto II is not worth watching and the third part is best connected with the first like Highlander...","user":"siderite","rank":[7,10]}]