[{"title":"Well done (coming from a fan of the books!)","rating":7,"date":"12 October 2009","review":"As a big fan of the vampire books by Irish writer Darren Shan I wasn't particularly looking forward to seeing Cirque du Freak: A vampire's assistant. Sometimes you should let a book be a book. And judging by the movie trailers the casting looked all wrong and the main character seemed too boring and too American to my taste. But in the end curiosity won and I went to see it anyway.<br><br>The vampire saga of Darren Shan consists of 12 books (four trilogies) and aims at kids aged 11-14. None other than JK Rowling was a big fan of this series so comparisons to Harry Potter were made very soon. What the two series have in common is the scope of the story. The tale of Darren Shan also has a Voldemort and a big (but very misty) showdown (in the last book). Like Harry Potter Darren Shan is drawn into a mysterious but exciting new world. Both teenagers must learn to control their power and learn the ways of being a new sort of being (wizard or vampire). So obviously there is a connection. <br><br>The movie is loosely based on the first trilogy, Vampire Blood. Darren Shan is an ordinary 16 year old teenager with a big fascination for spiders. One day he and his best friend Steve go to a real freakshow, where they meet vampire Larten Crepsley. Steve wants to become a vampire because his life stinks anyway. But Crepsley decides to chose Darren as his vampire student. So Darren fakes his death and moves to the camping ground of the Cirque du Freak. He befriends a snake boy, a monkey girl and a woman with a beard and tries to go on with his (vampire) life. But he soon finds out that the vampire world is on the brink of a full scale war between vampires (the kind that only drinks human blood and takes what it needs) and the Vampaneze (vampires who kill the humans they drink from). And somehow both parties think that Darren is destined to play a big part in this war<br><br>Watching this movie I tried to forget all the things I knew from the books. And yes, this movie experience turned out to be a very enjoyable one.<br><br>Chris Massoglia (The Hole) looked miscast at first as Darren Shan. But as the story progresses you can see why he was chosen. His innocence works very well and you can see him develop into the hero he will one day be. In my imagination Larten Crepsley was more serious than the one given us by actor John C. Reilly (Chicago ). But I did enjoy his version of the experienced vampire mentor in the movie. But to me Josh Hutcherson (Journey to the centre of the earth) was best cast as Steve. Steve hates the world and his character will play a major part in the rest of the story (= other books). There's a lot of evil in Steve, but in this movie it remains at the surface. Sort of. As fans of the books all know, he's capable of doing much more damage.<br><br>The pace of the movie is pretty good: there's a lot to be told here. There's a lot of humour in it (the books were pretty serious) and the voice-over by Darren Shan works very well. Especially the first 20 minutes (with the actual freakshow) were well done. Salma Hayek looks stunning with beard and actually gets more screen time than in the books. Too bad her acting isn't always that convincing. Ken Watanabe is a great Mr. Tall, the boss of Cirque du Freak. He gives the movie a great mysterious quality.<br><br>Okay, then the bad things. Sometimes the acting and action scenes were bad. Some of the effects looked fake. And the fact that it all ended with an ordinary rumble was a disappointment. The ending seemed very rushed. But what really let me down were the mysterious Mr. Tiny and his army of Little People. In the books Mr. Tiny is a cold hearted man who's so scary and powerful that every word he uses can be felt as a dagger in your heart. But in the movie he's just a silly old bald man who talks too much. His army of Little People – Jawa like creatures he raised from the dead – seemed too computer generated and looked like a pitiful low-budget effort to imitate Gollum. Too bad.<br><br>But overall I really enjoyed Cirque du Freak: The Vampire's Assistant. It's a good introduction to the vampire world of Darren Shan and I sincerely hope that the movie will be so successful that there will be a part 2. Because when Darren, Crepsley and Little Creature Harkat travel to Vampire Mountain , that's when the real fun begins!","user":"Joejoesan","rank":[49,59]},{"title":"Entertaining Movie","rating":8,"date":"26 January 2009","review":"I watched a screening of this movie and loved it. I wasn't sure whether to expect a children's movie or adult movie, and it came out to be more like the latter. I grew up reading &amp; watching \"Goosebumps\", and this movie made me feel like I was watching a \"Goosebumps\" film tailored for adults.<br><br>John C. Reilly does a really great job acting; it's nice to see him do something more challenging again. If you are turned off by his work in movies like Walk Hard, Talladega Nights, etc., give him a chance in this movie. He really impressed me. Patrick Fugit was my favorite actor in the film; his character was visually an eyesore but also in some odd way incredibly adorable. And Chris Massoglia, of course, was a great lead actor. <br><br>I would watch this film again when it officially comes out in theaters.","user":"bitterandtainted","rank":[124,174]},{"title":"Not as bad as it could have been","rating":7,"date":"4 November 2009","review":"My tween-age daughter has become a fan of all things vampire thanks to the \"Twilight\" books and films, so she asked me to take her to see this movie, even though it's based on a different series.<br><br>Although \"Cirque du Freak\" shows its \"young adult\" target audience, it was not as bad as many teen-oriented films I have seen. It had an interesting, if simplistic, storyline, and was effectively filmed. I agree with the comments that especially commend the Freak Show scene as an early high point, but the rest of the story moved along at about the right pace, and I never found myself bored.<br><br>I'm told the teen lead was very attractive, but he's not much of an actor. His evil counterpart, played by Josh Hutcherson of \"RV,\" was somewhat better. I'm not a real John Reilly fan, but he did a good job in his leading role. Willem Dafoe was wasted playing, essentially, a vampire version of John Waters. I would hope that Ken Watanabe and Salma Hayek would have a bit more to do in future installments. Ditto Orlando Jones, who hasn't done much since the horrible \"Evolution\" nearly killed his career. I also hope the character of Mr. Tiny is written better in the future; this guy was a pain to watch, and came off more like a sweaty pedophile than a supernatural referee or whatever the hell he was supposed to be.<br><br>Parents: nothing to worry about here. I'm not even sure how it came in at PG-13, unless there was some mild profanity sprinkled in that I don't remember. This might be a little complicated for little ones, but ages 8 and over shouldn't be scared by anything they see here. Best of all, it's not too painful for adults to watch if you must. Then again, I'm a veteran of the Pokemon movies; I've been to movie hell, so I can sit through anything now.","user":"NavyOrion","rank":[49,67]}]