[{"title":"Very funny","rating":9,"date":"17 June 2006","review":"Saw at Cinevegas film festival - am going to see again at Outfest in July, as I live in LA. <br><br>Reminded me of those fun ensemble movies I watched growing up (16 Candles, Fast Times at Ridgemont High, Caddyshack). Multiple stories, multiple characters and a lot of laughs. As with most of those multiple-storyline movies, there are always the occasional 'clunker' moments... but those moments are few-and-far between, and are outweighed by a good rhythm to the movie, great comic timing, and a lot of heart.<br><br>Also, I think it's safe to say I developed a huuuuuuuuuuge crush on actress Dagney Kerr - who plays suicidal April in the movie. I challenge anyone with a pulse to resist falling under her spell here... Really really lovable, adorable, squeezable and any other '-able' you can think of.<br><br>I think most people will find this movie a lot of fun - a rare comedy that is actually really funny.","user":"crispylap","rank":[35,54]},{"title":"charming, funny and smart","rating":8,"date":"14 June 2006","review":"I live in Las Vegas and saw this movie yesterday at the 2006 CineVegas movie festival. The director, majority of the actors and producer were all at the screening to answer questions and talk about the movie. I thoroughly enjoyed watching it and could not stop laughing. For the most part its a comedy but also deals with people finding themselves and having realizations that life its self is what you make of it. Like the tag line says 10 people, 5 cars, 1 day....only in L.A...this makes for a funny, smart and charming movie. And having Trent Ford acting in it doesn't hurt.(because i find his to be very cute) Billy Baldwin, Cheri Oteri and Ricki Lake all do a great job at making their characters have quirky personalities and make us go\" oh yeah i know someone like that\". In the end, i say go see this if you get the chance, you wont be disappointed.","user":"doritos1","rank":[30,50]},{"title":"A little gem of a movie","rating":8,"date":"20 October 2007","review":"I came across this film by accident, you know - one of those films that you watch because there is nothing better on and then really end up enjoying, whether it be because you happen to be in that frame of mind or whatever. Very much along the lines of Robert Altman's work, but with the advantage of being a little bit fresher and not so serious - i mean yes there are serious parts but they are book-marked with so many good one liners and so many scenes which will have you smiling that the serious dialogue probably won't even be noticed. William Baldwin once again proves that he is more Alec Baldwin, than Alec Baldwin himself and surprisingly he is not that bad and may even have a comedy future ahead of him (like Alec on TV). Trent Ford and Ricki Lake prove that they too can hold there own in this type of film and Ricki Lake providing one of the best moments when she realises that she may actually be a lesbian. Kudos, however, must go to Dagney Kerr for providing the character of 'April' with such a tragic and funny personality and the best lesson to be learnt from her is that if you are going to kill yourself - then plan ahead!! Overall, you will be surprised by this if you give it a chance and let yourself relax and i would certainly recommend it for a lazy Sunday in bed when you are feeling a little bit low and need cheered up in a gentle way. You have nothing to lose anyway.","user":"gabriel666uk","rank":[7,11]}]