[{"title":"First Rate Teen Flick","rating":8,"date":"18 March 2006","review":"I saw this movie today (opened yesterday here) and was simply delighted.<br><br>I saw a review that said something to the effect that the reviewer thought this would be just another teen movie, but then found it was based on Shakespeare's Twelfth Night ... and then started trying to justify liking this flick on Shakespearean grounds. I really think this is going way overboard: the only connections I could see with Twelfth Night are (a) the basic conceit of a girl masquerading as a man; (b) the extensive male-female humor arising out of that basic conceit; and (c) some of the names (including Viola &amp; Duke).<br><br>Aside from those names, the thematic commonalties (a &amp; b) are really great themes for any script, and this movie's script is no exception. Beyond that, though, this really is a simply delightful and very contemporary/traditional teen flick. And that's a perfectly legit genre even if highbrows have to find an excuse to like it ... like alluding to Shakespeare.<br><br>The movie is bright, fast-paced, emotive, stylized, funny ... full of teen hormones and teen humor and male/female humor suitable for all ages. And that's really the best part IMHO: really just about every male stereotype and every female stereotype is depicted in roundly appealing over-the-top fun. Those stereotypes are parodied relentlessly but affectionately, with such a complexity of invention that I'm still a little bewildered ... but really don't feel at all disappointed in that regard, it's not that kind of a movie: things come at you fast and fun and you get a laugh and a groan and then move on to the next split-second happening.<br><br>Amanda Bynes really is just delightful as Viola / Sebastian; Channing Tatum makes a wonderful Duke; David Cross does a wonderfully over the top Principal Gold. All of the acting and characterizations were fine and on target. Cinematography was excellent.<br><br>Wonderful entertainment from beginning to end ... check it out!","user":"cdelacroix1","rank":[145,176]},{"title":"outrageously funny!!!","rating":9,"date":"22 March 2006","review":"I just took my 11 year old daughter and 8 year old son to this movie and I can't remember a movie where I laughed SO hard -- literal out loud, deep bursts of laughter because this movie is hilarious. Granted the story line is predictable but the ride is so extremely enjoyable it doesn't matter that you know how it's going to end. The actors' comedic senses of timing were impeccable. The actors were perfectly cast. My children mentioned that Amanda Bynes seems to be the last of the young women actresses who aren't ruining their lives. She is so refreshing. My children said this is now their favorite movie of 2006. Our money was well spent on this movie.","user":"soli1313","rank":[170,210]},{"title":"Roll in the aisles funny, a real blast!!","rating":9,"date":"20 March 2006","review":"She's The Man was everything I wanted it to be and maybe even a little more. I love the teen type \"chick flick\" films and I knew this one would be great!! In the same vein as 10 Things I Hate About You (one of my all time faves) She's The Man is a unique, well written, very well performed comedy with some of the funniest lines, and physical comedy I have seen in a long time. It's probably the funniest movie I've seen this year (with the exception of the hilarious Pink Panther.) But She's The Man is actually a more intellectual funny and most of the humor relies on the witty script, \"Three's Company\" style story of mistaken identities, and mixed messages, and the cast.<br><br>Amanda Bynes is a star!! Even since the days of the horribly campy (yet strangely entertaining \"The Amanda Show\", she has shown a brilliant talent for comedy. She's probably one of the most talented comediennes out there. Her style of physical comedy, impersonations, and witty dialect makes her hilarious. Previously her big screen debut (where she was the star) was the rather hilarious and well made \"What A Girl Wants.\" If that wasn't her break out vehicle than She's The Man takes care of that hands down. Bynes is really the ultimate girl next door. It's a shame she doesn't do more big screen work because she could be the next \"It\" girl. She is the All American, cute, down to earth, bubbly teen (although she's twenty now) and whether or not she'll be able to carry her talent and style over to being an adult actor will remain to be seen. But for the purpose of this film she is perfect!! She actually legitimately pulls off the rather outlandish plot of her impersonating her twin brother and makes it believable. Not entirely...but believable enough. Most of the script relies on the comedy of her errors trying to be a guy but it's just hilarious, non stop laughs. Channing Tatum redeems himself from his deplorable performance in 2005's \"Havoc\" by plays Duke. He's the jock, the captain of the soccer team, and eventually Bynes' object of affection, unfortunately he's also Sebastian's room mate (who is Bynes.) He's a good leading man, and the chemistry is perfect between them. Laura Ramsey is Olivia, who happens to be attracted to Sebastian (who again is Bynes.) She does good as well although her part is small and she doesn't really effect the rest of the cast one way or another. James Kirk is great in his small role as the real Sebastian. His resemblance to Amanda Bynes is astonishing...they are absolutely believable as twins and further more, from a distance you could understand someone believing Bynes is Sebastian. The rest of the cast all fit in there somewhere and their roles range from brief to more supporting but essentially they are all supporting the story between Bynes and Tatum but everyone is more or less supporting Bynes terrific performance. She easily carries the film with no hesitations and makes it worth while.<br><br>This is one of those films that shows so much in the trailer and yet it's not one of those films that when that part comes up it's not funny anymore. The parts in the trailer that make you laugh are even more hilarious in the actual film. Relative newcomer director Andy Fickman does such an incredible job on this film. He weaves together a potentially complicated storyline and makes it flow naturally and makes everything fall together. The story which is loosely based off of Shakespeares Twelfth Night but it's remarkable how much they managed to translate over to this modern day film. It's seemingly completely off the wall but more exact to the classic comedy than you'd think. There isn't too much to say about a downside except that the last half hour drags a little and also becomes a might predictable but it doesn't change the hilarity of the first half of the film. Nonetheless you'll be laughing to tears and it's one of the funniest films in the theater right now hands down!!! 9/10","user":"Robert_duder","rank":[68,85]}]