[{"title":"Delightful","rating":10,"date":"20 January 2006","review":"'High School Musical' is definitely one of Disney channel's best original movies up to date. I've seen numerous other ones - Pixel Perfect, Twitches, Go Figure, Stuck in the Suburbs, etc. - but none of them compare to this one. Zac Efron and Vanessa Hudgens as Troy and Gabriella are adorable together, and their chemistry is more believable than the chemistry I see in many major motion pictures; Ashley Tisdale and Lucas Grabeel as Sharpay and Ryan are laugh-out-loud funny; and the other students, along with Troy's father and Ms Darbus, are perfect.<br><br>What really blew me away and made this movie stand out from the other Disney channel original movies, however, was the music, singing, and dancing. I loved the songs, especially 'What I've Been Looking For' as sung by Sharpay and Ryan, 'Breaking Free' by Troy and Gabriella, and Gabriella's solo, 'When There Was Me and You'. I was impressed by the vocal skills exhibited by the four main actors and actresses. The dancing sequences are also fun and well choreographed, and I loved how they were right in sync with the music.<br><br>Overall, in comparison to other Disney movies, this one is a 9/10. As a Disney channel movie, it inevitably has several flaws, the most obvious of which is the cliché, cheesy plot between the two main characters. I was also disappointed when there was no kiss between them, but that didn't really take away from the movie too much.<br><br>Whether you're a 10-year old or a 30-year old, I highly recommend seeing this sweet, funny movie.","user":"shmexsay","rank":[192,270]},{"title":"Campy, Corny and ABSOLUTELY WONDERFUL!!!!!","rating":9,"date":"21 January 2006","review":"High School Musical is one of those rare movies that makes you laugh at it's absurdity and love everything about it at the same time. The plot isn't complex, Troy meets Gabriella at a New Years Eve party, and they sing a karaoke duet together. Neither has ever sung before, and they find the experience exhilarating. After midnight, when they almost kiss, Gabriella runs away, but not after exchanging phone numbers with Troy. A few days later, Troy returns to school, where he is the star basketball player, just before the \"big game.\" Also about to occur, casting for the school's \"winter musicale.\" This is where we meet Sharpay and Ryan Evans, a brother and sister musical star team. It is soon revealed that Gabriella is a new student at Troy's school. After a lot of deliberation, Gabriella and Troy audition for the musical, much to Sharpay's, and their friends', dismay. I won't divulge how, but all end up happy, and celebrate in a fantastic closing song \"We're all in this together!\" <br><br>It's the simplicity of the movie that makes it so wonderful. As a fan of musical theater and an amateur performer (I played Mrs. Paroo this fall in The Music Man! HEHE!) I loved every moment of this film. It is the essence of musical theater, parts of it were corny and over acted, but go to see any show on Broadway and you'll notice the same, it's a characteristic of musical theater. Other parts were heartfelt and lovely, without being overly sentimental. The music was beautiful and well sung overall. The actors didn't necessarily have the best voices, but they were all fully suited to their roles. Especially the girls. Ashley Tisdale is perfect as dive Sharpay. Any one who has been in a high school show recognizes this girl, there's one in every school. Vannessa Anne Hudgens is lovely as shy, intelligent Gabriella. She is practical and grounded but can't help wanting to do something as seemingly frivolous as singing in the school show and fall for the popular jock. The first time you see her smile you realize how adorable she is.<br><br>High School Musical is definitely worth watching. If you're a fan of musicals you're sure to enjoy it.","user":"uptownrn","rank":[159,233]},{"title":"Absolutely Hideous","rating":1,"date":"14 July 2006","review":"Maybe I'm just a weirdo. After reading all these other reviews, I'm pretty sure that I am. Or maybe it's just because I've been performing with musical theatre companies since I was about seven, so the idea of a musical isn't something novel and new for me. But every time I tried to watch this movie, and every time I heard somebody talk about how great it was, I just couldn't help but CRINGE. Not only was this another long shot for the young Disney stars to prove their \"versatility\", such as it is(n't), but it was yet another show about the magical clichés and drama of high school, something I'm getting absolutely sick of. I have to go to school every day and deal with petty high school drama; why would I want to come home and listen to people SING about it? Seriously. At least REAL musicals that used those themes, like Hairspray and Grease, had actual talent behind them, as well as good songs and actual FUN. Not a bunch of pretty-boy jocks smiling cheesily and singing about how much they love basketball. The whole production was so shallow...I still haven't been able to sit through the entire movie. I've had to watch it in sections of twenty minutes, just to be able to stand it. And something that ESPECIALLY bothered me: the representations of the people in the drama club. Dude, that teacher? \"Brava\"? You've got to be kidding me. And then that little drama queen and her wimpy brother...so, so cliché. I haven't met anybody like any of those three since I was, like, ten. And I know, I know: it's just a corny little Disney movie playing up the clichés. And for about half a second, characters like that might seem kinda funny. Then try going to school the next day and hear people asking you if you've ever had a director like that teacher, or asking how you can possibly be a \"real\" theatre person because you don't seem obnoxious enough...it gets old. This movie sucked. Why do people like it so much?","user":"chilipepperz9182","rank":[339,534]}]