[{"title":"SuperBad Acting & Horrible Animation","rating":1,"date":"29 March 2010","review":"I watched this movie last night and right away noticed that the animation and acting sucked. I watched about 40 minutes of it hoping the film would get better it didn't. I wanted so much to turn it off however I had already committed myself to 40 minutes of the movie so I watched the rest. This movie was funny only because they tried to make this so real and suspenseful. The actors tried so hard but it was just so obvious there was no real talent here and it made the film horrible. OK, enough about the acting lets talk about the graphics/special effects. Lets just say the graphics of the movie were equivalent to a 1996 Sega game. It's jaw dropping how a movie from 2008 can be so behind the times. I wonder what kind of budget they had and if the movie even made enough to cover it. OK so overall this was a poor movie, but since I suffered through it I want you too also. I have been trying to trick my friends into watching this but after seeing the trailer they just laughed and said \"hell no\"","user":"mprush12","rank":[13,13]},{"title":"Wooden Acting and Worse Animation","rating":28,"date":"28 April 2009","review":"This movie had the quality of a high school production. Some of the actors were terrible, especially the one playing William Bell. Some of the \"Armchair Combatants\" were pretty good, though. It's hard to believe this was made in 2008. The \"animation\" for the battle scenes looked like something from the early 90's. There's shareware that can do a better job, when someone knows how to use it. The \"twist\" ending was obvious in the first 10 minutes. It extremely stupid and unoriginal (think \"The Game\" with Michael Douglas). Skip the The Controller and instead get TRON, it's special effects were more realistic even though it was 26 years earlier.","user":"chicagorob1","rank":[11,12]},{"title":"You're Kidding Me, Right?","rating":8,"date":"8 September 2011","review":"I spent a fair amount of time on Playstation and Dreamcast and Nintendo 64 in the late 90's and on X-Box in early 2003 or so, so I might be considered part of the target audience for this film. It's not as if I don't understand the conventions of computer games and the way they approach story telling.<br><br>But let's be honest here - \"The Controller\" is a horrible misfire. I happened across it one night on a cable channel and was transfixed by the amazingly bad graphics and the awful dialog the actors were forced to mouth.<br><br>I can't judge whether the actors were actually any good or not because the dialog they had to work with was impossible for any live human being to deliver. Seriously, if you were a writer and tried to pass this for dialog in a cut scene from \"Net/Hack\" or \"Metal Gear Solid\" or any other video or computer game from 2008 (or 1998), the game producers would have had you beaten to a pulp.<br><br>Maybe it's my imagination, but I swear I can see the actors dying inside and hating themselves and each other as they try to make these wretched scenes work.<br><br>Supposedly this was an independent venture. I tend to believe that, because no real experienced producer would have allowed this thing to be released.","user":"lemon_magic","rank":[7,7]}]