[{"title":"I would like a red plumb floating in perfume served in a gentleman's hat.","rating":8,"date":"8 December 2006","review":"Much can be said about David Lynch but I think the mistake most people make is to think that he is trying to create a coherent and straight forward narrative structure. He is working on a subconscious level in his mind. The idea comes before the reason behind the idea. In many ways this is how art should be created because any other way will feel forced and pretentious.<br><br>David Lynch is not just trying to f*k with you. Its not meaningless and its not pretentious. If you've ever seen his interviews he is one of the most humble and soft spoken directors I've ever seen. Justin Theroux did a Q &amp; A after my screening of Inland Empire and he described working with lynch as light hearted and fun. The complete opposite of what its like to watch some of his films which are often dark, terrifying, and disturbing.<br><br>Inland Empire is a sister film to Mulholland Dr. As my wife put it, \"Watching Mulholland Dr. helped me to understand Inland Empire.\" They are two sides of the same coin. Lynch still seems to want to take a stab at the evils of Hollywood. His concern for the well being of actors is strong but this time instead of a new comer (Naomi Watts) he deals with one older actresses come back role and like Mulholland Dr. their are the evil producers behind the scenes and even the added possibility of a cursed set.<br><br>I am a huge Lynch fan. I don't find his films hard to understand. I am not a very intellectual person but Lynch's themes are so simple. The visuals are to be enjoyed on their own terms especially when they seem not to fit with the rest of the film. A lot of lynch's trademarks return, the dual personalities, time folding in on itself, gratuitous nudity, and another tragic murder mystery.<br><br>While this film does feel like a retread of Mulholland Dr. it also stands on its own especially since it contains a much more upbeat ending and perhaps four layers of storytelling,good luck figuring out which is which. He also continues to experiment with sound and even sings the vocals to a song in the film.<br><br>I got exactly what I wanted from Inland Empire. The downside to this is that Lynch is sort of repeating himself and I hope that doesn't mean he's out of ideas or perhaps Mulholland Dr. did not yet exercise his disdain for the studio system. The film is part murder mystery and part lucid dream. It has dream logic and has a lot of fun with some of its bizarre dialog and incredible visuals. This film also has much in common with Eraserhead in that he's completely free to explore his ideas. No one is telling him to shorten the film, cut out scenes, or that it doesn't make sense. Its uncompromising and truly art without boundaries.<br><br>My only other criticism is that the digital video is just ugly at times. When the shot is static the amount of detail in the picture can be incredible but when its hand held and moving around its grainy and looks pretty terrible. I miss the polished look of his older films but I guess that is going to be another thing that sets this movie apart from the others. I highly recommend this film to the Lynch enthusiast and to no one else. If you aren't in on the joke then I cannot imagine you leaving the theater happy after three hours of pure, free from concentrate, unpasteurized lynch. I went to see this with my wife and my best friend needless to say only I loved it. Take that as you will.<br><br>4/5","user":"manythings711","rank":[302,383]},{"title":"The film Lynch has been working towards all his career","rating":9,"date":"10 October 2006","review":"I just saw this film at the New York Film Festival followed by a Q &amp; A session with David Lynch, Laura Dern, and Justin Theroux. I will try my best to recount my thoughts while they are fresh, and incorporate what the film maker and actors had to say. <br><br>\"I can't tell if it's yesterday or tomorrow and it's a real mind f---\" <br><br>This single quote from Laura Dern sums the movie up fairly well. It is also one of the self- referential moments of the film that explores the audiences very thoughts while providing some comic relief. <br><br>Lynch's new film, INLAND EMPIRE, is similar to his other work, but unlike anything he's ever done, or I've ever seen before. As one reviewer aptly put it, it is a double reference to Hollywood and the inner workings of the human brain. Before I discuss the substance of the film I will briefly review the technical aspects. <br><br>First of all, the movie is not unwatchable (because of clarity purposes) as some critics had said, although I did see it at the Lincoln Center which has a beautiful theater and top quality facilities. The digital camera works well for this film. It lose some of the cinematic flourish of film, but also brings a more realistic, gritty feel to it that is appropriate for the theme. The lighting and production were top quality as usual for a Lynch film and the score sets every scene brilliantly. Often times we can't tell if the sound is diegetic or non-diegetic, but it makes no difference. <br><br>Lynch said that he used the digital camera to give him freedom. You can see much more movement in this film than his others, giving an almost voyeuristic feel. He also uses many close shots, and as always, obscure framing allowing ambiguity and confusion. Lynch really explores the freedom of movement and editing that is available with digital, and you can feel his energy and zest in the new medium. The moments of suspense and terror are so well done - there are several scenes that will literally make you jump - that I found a Hitcockian brilliance of using subtlety, indirectness, and sound to convey emotion rather than expensive special effects. Of course, there are other scenes that would qualify as downright freaky.<br><br>The movie is completely carried by Laura Dern, and not because she is in 90-95% of the scenes. Her character(s) morph and change so often in identity and time that it is hard to believe it is her in every role. Her range and ability to work consistently over so many years and under the conditions of this film is mind blowing. It is one of the finest performances I've seen by an actress or actor. <br><br>The film itself is hard to summarize. Most of you know the basic plot, but this really means nothing about the film. It has no type of linear story line and the converging and diverging plot lines are connected by only the most simple threads, time, location, memory (\"Do I look familiar? Have you seen me before?\") identity, and people who are good with animals. It would be a disservice to this film to try to find meaning or symbolism as I see some people already are. It is not a mystery to be solved, as Mulholland Dr. was (though that film never will be solved either). It is a movie that plays off of ideas, color, mood, it presents intangible emotions that we feel and internalize rather than think about and solve. Film doesn't need a solution to make sense, but it is typical for us to want solve things, to have closure. This film is better if you just let it wash over you and surrender the urge to find meaning.<br><br>The three hour running time makes no difference because the movie moves in and out of itself with no regard for time. Using so many scenes allows time to effect the viewer much as the characters themselves. As the characters question time and reality, the audience does too. As the scenes slowly build up, giving us reference, we start to wonder where we saw that character, who said that line before, what location fits into what part of the sequence and how, leading up to the Laura Dern quote I used before. It doesn't ask us to think, but to feel, and it does this better than any film I've seen. It plays on our emotions with intense sound and cinematography, grasping fragments from dreams, sliding in and out of reality, exploring nightmares, and asking us what time and reality really are. The film is also very self-conscious as I said before, and also makes many subtle (and not so) pokes at the audience. It also has some truly surreal moments of Lynch humor. <br><br>Explaining all this doesn't really matter because you will have to see it and take your own idea from it. I would recommend that you see it in a theater though, as it could never have the same impact anywhere else. I was skeptical going into this movie after what I had read, thinking Lynch had gone off the deep end. However, I realized nothing you read about it will make a difference once you see it, and that Lynch is in better form than ever. Ebert said that Mulholland Dr. was the one experiment where Lynch didn't break the test-tube. With INLAND EMPIRE he throws the lab equipment out the window. His freedom in making this movie, both with medium and artistic control, is unparalleled in anything he's done. He finally made a movie for himself and his vision, without any kind of apology or pretense.","user":"Thelonius_Spunk","rank":[475,619]},{"title":"Mulholland Drive on Acid","rating":8,"date":"12 October 2006","review":"I saw INLAND EMPIRE at the Venice Film Festival world premiere last month. I want to keep this review short due to the fact that writing in great detail about this film is useless. INLAND EMPIRE is an experience. An experience not to be written about but to be FELT. It is David Lynch's definitive work. It's everything he has ever wanted to put into a film and it's completely free from anyone else's taming influence. The film is suffocating, dark and endless yet paradoxically contains some of the director's funniest and lightest scenes. I was frightened, uneasy, overwhelmed and moved. My emotions were thrown into disarray several times during which I lost all sense of appropriate reaction. Do not expect the mystery of this film to be solved, but expect it to be finished. Do not expect your head to understand the resolution but expect that your heart and intuition will.<br><br>If you cannot decide whether to see this film or not, I implore you to get up and go. Whether or not you enjoy it, you will never see a film like this again. I also implore you to see it IN THE CINEMA. Do not wait to see it on DVD because the experience won't be half as extraordinary.","user":"illuminousgurkin","rank":[343,470]}]