[{"title":"Awaking To Ryan Gosling","rating":8,"date":"2 January 2008","review":"Ryan Gosling made happen what happens only once every so often. Made me look at what I seen before under a new magnifying light. He took me with him and showed me, with the most astonishing clarity, the complexity of a talented man dragged down by a legacy of good intentions and addiction. We're permitted to visit his family once and we understand what he's fighting with without any weapons. He doesn't blame anyone but he's the result of his own DNA and he knows it. His bright moments, the explanation of what History is for instance, is a glimpse into the man he could actually be, fully. The humanity that Ryan Gosling lends to his character on his darker moments it's as chillingly real as it is moving. The chemistry he establishes with the wonderful Shareeka Epps is as powerful as the one he established with me. I want to meet him, I want to meet Dan and while I was thinking that I realize I know him already. He lives next door to me, he's related to me, I was his friend. This is what superb performances do. They re-awake you.","user":"littlemartinarocena","rank":[160,177]},{"title":"Gritty and sensitive","rating":9,"date":"4 September 2006","review":"Set in Brooklyn, New York where he currently lives, Ryan Fleck's first full-length feature, Half Nelson, is a gritty, sensitive, and emotionally harrowing film that meticulously avoids the inspirational clichés of many teacher-student films and the obligatory violence of films set in the ghetto. The title is derived from a wrestling move in which you turn an attacker's strength back on him. In the case of Dan Dunne (Ryan Gosling), an idealistic eight-grade history teacher in an inner city school, he turns the attack on himself, inspiring his students by day and drugging himself at night with crack cocaine.<br><br>Dan is a well-liked teacher and basketball coach whose parents (Deborah Rush and Jay O. Sanders) were liberal activists during the 60s and 70s, participating in protests against the Vietnam War but have now substituted alcoholism for political passion. Like his parents, he wants to make an impact on the world but is disillusioned with the current political climate and, out of frustration and fatigue, (like many on the Left today) has drifted into a self-induced stupor. Believing in social justice and that society can be changed through education, he teaches history, to the chagrin of the school's administrator, in the form of Hegelian dialectic, showing that change results from a clash of opposites.<br><br>Dan shows his students videos of seminal events from the last fifty years such as the 1954 Brown vs. Board of Education ruling that paved the way for desegregation of the schools, clips from the civil rights movement, and Mario Savio speaking on the Berkeley campus during the Free Speech Movement. To its credit, the events in the film do not occur in a political vacuum but attempts to tie in the failed protests of the Left to Dan's drug habit are not entirely persuasive. Dunne's life begins to spiral out of control when one of his students, thirteen-year old Drey (Shareeka Epps), discovers him in the girl's bathroom passed out from ingesting cocaine. Instead of becoming frightened or angry, Drey brings him water and helps him to gradually come down from his high.<br><br>Drey comes from a family in which her mother works a double shift and is rarely at home, her father is out of town, and her older brother is in prison for selling drugs, but she is mature and street-wise beyond her age. She promises to keep his secret and both find that their unlikely friendship satisfies an emotional need that Drey cannot find with her classmates and Dan cannot find with other adults. He is dating a fellow teacher (Monique Curnen) but his behavior with her is erratic and his political speeches and drug habits soon turn her off. A former girl friend from his period of rehabilitation (which he said didn't work for him) tells him that she is now getting married which pushes him further into a downward trajectory.<br><br>The emotional highlight of the film is a confrontation between Dunne and Frank (Anthony Mackie), a suave drug dealer and associate of Drey's older brother who recruits Drey to be his collector. While Dan wants to steer Drey in the right direction, he is hardly a role model and the results, while promising, are inconclusive. Although the premise of the film is somewhat implausible, Gosling's performance of the charming but flawed teacher is completely credible, so nuanced and touching that we root for him in spite of his capacity for self-destruction. Shareeka Epps is equally convincing in her powerfully understated performance as his tough but sensitive young friend. Co-written by Anna Boden and supported by an outstanding original score by Broken Social Scene, Half Nelson \"stands and delivers\" one of the finest films of the year.","user":"howard.schumann","rank":[185,219]},{"title":"Awesome","rating":10,"date":"8 July 2006","review":"Anyone who has experienced addiction in their lives, whether your own or someone close to you, will find this film cutting. It is not about the reasons leading to addiction or the recovery, rather it is about the experience of the addiction in its raw reality. Even if you have not experienced addiction in your life, the story is worthwhile and the photography stellar. Ryan Gosling is the perfect portrait of a good person who got lost. His portrayal of a crack head is almost too good. The dialog is not pretentious or assuming and not overused. The story unfolds itself in a very natural manner. <br><br>Highly recommended.","user":"delaney907","rank":[212,277]}]