[{"title":"It's not easy to take your eyes off Stone","rating":6,"date":"12 April 2006","review":"In Michael Caton-Jones' \"Basic Instinct 2,\" Sharon Stone tries desperately to prove she is still sexy and dangerous To each uncrossing of legs, she supplies every type of attraction And yes, she does get naked, but not as naked as before teasing us only with a glimpse of her nethers In every step of the way, every line of dialog, every gesture, makes her look absolutely stunning, even better than she did in the original erotic thriller back in 1992<br><br>Stone returns as novelist Catherine Tramell whose bestselling books match her deadly reality so perfectly making us wonder This time the action moves from San Francisco to London, where she attracts the attention of the Scotland Yard Soon a celebrated psychologist named Michael Glass is caught between her seductive powers Glass knows all about homicidal impulse and identifies Catherine as having \"risk addiction.\" But when the people surrounding him start falling in graphic ways, Glass starts jeopardizing his profession to keep at distance the siren's notorious advances<br><br>With his soft brown eyes, bland haircut, and prominent chin, Morrissey's Dr. Glass is no match for a sultry, sexy and smart vixen like Sharon Stone Stone completely embodies every aspect of Catherine's physical attribute, manipulating the hell out of the freshly divorced psychiatrist Dr. Milena Gardosh (Charlotte Rampling) recognizes Glass is falling for Catherine and advises him to remove himself as her therapist<br><br>Stone seems to be a strong figure only composed of \"capital sins.\" She is daring and shameless in her teasing, temptations and commands She never shows any remorse, and remains, one more time, one of the classic femme fatales<br><br>\"Basic Instinct 2\" is hardly unwatchable, because Stone is very winding, puzzling and intensely fascinating in the way she puts out of side issues through dialog that seems foolishly open and penetrating","user":"Nazi_Fighter_David","rank":[126,170]},{"title":"It is now fashionable to trash \"Basic Instinct 2\" even before you see it.","rating":8,"date":"3 April 2006","review":"It seems that it is becoming fashionable to rip \"Basic Instinct 2,\" to the point that a significant part of the audience (including critics) found it terrible even before it was released. It seems even more fashionable to trash Sharon Stone wholike all of usis now fourteen years older, andunlike most of usstill looks wonderful. First comments on this movie were so vicious that I had to see for myself. In my opinion, this sequel is not nearly as good as the original film, but is not as bad as most comments pretend. Michael Caton-Jones is not Paul Verhoeven, neither Henry Bean and Leora Barish are Joe Eszterhas. \"Basic Instinct 2\" is just an entertaining, average thriller, and besides the addition of Jerry Goldsmith original score, keeps little resemblance to its predecessor. Even Stone gives her character a different dimension, creating a lustful, devilish Catherine Trimell, who can perfectly well rank among other monsters like Hannibal Lecter. She is an intelligent actress who is not afraid of taking risks and can play with camp at her leisure. Unfortunately, she seems to be the main target for those who enjoy trashing this flick. She became too successful, too much of a main icon, and like all those actors who have reached that level, her time has arrived and she is now bound to be destroyed by Hollywood audiences.<br><br>The rest of the cast is outstanding, giving performances that are far better than the material deserves. David Morrissey is a much better actor and by far more interesting than Michael Douglas: his acting is flawless, giving a dense, complex dimension to an otherwise one dimensional character. Since he has more screen time and is the axis of the movie, he can keep your attention from beginning to end.<br><br>I am not recommending \"Basic Instinct 2\" as a great movie; I am just expressing my disagreement with most of the comments on this site and my conviction that agendas other than the movie itself are shaping the opinion of most spectators.","user":"ENRIQUE-3","rank":[188,263]},{"title":"What is wrong with you people?","rating":10,"date":"4 April 2006","review":"I don't understand your objections to this movie. It is a taut, thrilling extension of the character created in \"Basic Instinct\". The only part of the story that is the least bit unrealistic, is the fact that Sharon Stone's character is still alive and not in jail at this late date.<br><br>SPOILER ALERT: As the movie progresses, we are presented with three theories of what is going on: 1) Sharon Stone's character is killing all these people because she's crazy (Risk Addicted); 2) David Thewlis' crooked cop is killing these people in order to frame Sharon Stone's character; 3) David Morrissey's analyst is killing these people for revenge. What upsets most people about the movie seems to be that none of these theories are ever explicated as the \"real\" story. (Although the analyst is in a psychiatric care facility for killing the cop; the only killing that occurs on screen.)<br><br>I think this is a brilliant plot device in the spirit of \"2001, A Space Odyssey.\" WHO CARES what is real? The blonde really is crazy, the cop really is crooked and the analyst really wants revenge. What's important is the interactions between these and other characters in the story. Like real life, everyone is more complicated than anyone thinks and reality is more complicated than a movie. Get over it!","user":"ericose","rank":[82,115]}]