[{"title":"Touching the limits of imagination","rating":10,"date":"8 May 2005","review":"I saw this piece on local Animefest and I tell you what. I honestly thought my head will blow. Such seemingly never-ending torrent of originality and imagination is truly unprecedented. There are numerous animation techniques mixed together, loads of standard anime exaggeration (no manga though), psychedelic trips, serious issues and silly sarcastic humor. There's no way an intelligent non-shallow adult would not like this masterpiece. Consider yourself as unprepared for what you will see but be ready to be surprised when you do and mentally exhausted once you did.<br><br>By the way, describing the plot of Mind Game would be utterly stupid. It's a mind game alright, you will get the message one way or another.<br><br>Straight 10/10","user":"soulcharmer","rank":[74,80]},{"title":"A mind-blowing, surreal, life-changing adventure","rating":10,"date":"29 March 2005","review":"Wow. What can I say? I was truly blown away by this movie. Winner of the Noburo Ofuji award (the most prestigious award in Japan for an animated film), this film has unfortunately only had a very limited release in Japan (although it is playing in theaters again since winning the award). The director, Masaaki Yuasa, has previously done critically acclaimed animation work on other series, and helped create the equally mind-blowing, and somewhat disturbing short animated movie \"Cat Soup\".<br><br>The first thing about the movie to note is the animation. The animators worked in a collaborative effort, and included a wide range of experimental and traditional animation techniques, a bit of CGI, and even a bit of live action. Viewed as individual pieces, it can be jarring, but seen together as a whole, each piece seems to fit with each other perfectly, with the different animation forms setting the mood perfectly.<br><br>The story begins in present-day Tokyo, and follows a loser who is letting his childhood girlfriend slip away. Things take a twist to the fantastical side, as the characters embark on a surreal journey that changes everything about them. The actual elements of the plot are not really the focus of the movie..it is about setting the mood, creating the atmosphere of the characters' emotions, and drawing the viewer in to same mental journey the characters are going on, without even realizing it. The pace of the movie picks up and slows in parts, before building up to its thunderous and (literally) exhausting climax.<br><br>See this movie , if only for the virtuoso animation that you will not see in any other film. And who knows? it just might change your whole outlook on life.","user":"mike8869","rank":[58,62]},{"title":"Story that never ends","rating":9,"date":"14 May 2005","review":"And I thought the avant-garde style of animation and story telling was going to take its routinely long hiatus with the marvelous Triplets of Belleville, but I was fortunately wrong.<br><br>After reading countless reviews, certain people proclaimed their dislike for this film with little to no elaboration given, which somewhat intrigued me and pushed me further toward wanting to experience Mind Game. As an avid follower of experimental cinema and anime I rarely get rewarded with solidly evolving features, but once in a while I strike gold and get to travel through the medium of rich expressionism dealing with both real life and fictional events in the utmost fascinating fashion. Mind Game is the recent treasure and a great example of such artistry, fusing stories of love, self worth and other qualities of life, without forcing conclusions or values, but merely giving you a chance to reflect on your life or simply enjoy that of the characters.<br><br>The main conflict of this film deals with a young man named Nishi, who lacks courage to do what he really wants in life. After a rather fatal turn of events he gets a second chance at life and love. So he embarks on a journey to face things he otherwise wouldn't, but his personal rediscovery takes place in the weirdest of places. <br><br>Aside from feeling a genuinely exalting rush with its almost mosaic imagery and perfectly fitting music, I felt something else while viewing Mind Game and I attained a certain notion afterwards, which I don't see worth sharing, since I believe everyone who'll give this a watch will acquire on their own terms, levels and depth.","user":"Gigo_Satana","rank":[42,47]}]