[{"title":"The True Nature of Sacrifice","rating":1,"date":"1 September 2006","review":"Prior to this release, Neil LaBute had this to say about the 1973 original: \"It's surprising how many people say it's their favorite soundtrack. I'm like, come on! You may not like the new one, but if that's your favorite soundtrack, I don't know if I *want* you to like my film.\" <br><br>Neil, a word. You might want to sit down for this too; as Lord Summerisle says, shocks are so much better absorbed with the knees bent. See, Neil, the thing about the original, is that Paul Giovanni's soundtrack is one of the most celebrated things about it. The filmmakers themselves consider it a virtual musical. Along with Richard and Danny Thompson, and Bert Jansch, it practically kick-started the 1970s Folk New Wave. To undermine it is akin to imagining Jaws without John Williams. Or The Buddy Holly Story without Buddy Holly. The result's one of the most breathtakingly arrogant, pointless remake of a British cult classic since Sly Stallone's Get Carter.<br><br>The original had apparently left Nicolas Cage \"disturbed for about two weeks.\" So disturbed, during that fortnight's window, that he pitched the idea of re-imagining one of the most nuanced films about inter-faith struggle ever devised to a writer-director previously known for his wholly unsubtle depictions of male chauvinism. It's like some parlor game: what would you get if Sam Peckinpah took on Bambi? Or Gaspar \"Irreversible\" Noe remade Love, Actually?(Actually, I'd quite like to see that). Unfortunately, someone took this parlor game seriously: All LaBute's succeeded in doing is ripping out the original's guts while saddling it with his own gormless Sex War preoccupations.<br><br>After failing to rescue a little girl and her mum from a fatal car crash, Cage's highway patrolman spirals into a medicated torpor. Then he receives a letter from ex-fiancée Willow Woodward (this one trades on name-homages for kudos), now living on the private island community of Summersisle  that extra 's' stands for 'superfluous'  and wants Edward to help locate missing daughter Rowan.<br><br>Summersisle, it transpires, is a female-dominated joint, conceived as a haven for oppressed womenfolk and refugees from the Salem witch trials. Here, the matriarchs observe the Olde ways, and the few males are near-mute breed-mules. It's like Lilith Fair on a grand scale. Summersisle's main export is honey  a symbolic and literal headache for Edward, as he's allergic to bees. \"Beekeepers!\" cries Edward. \"They seem to be everywhere on this island!\" Well, that's probably because Summersisle's main export is honey.<br><br>While making his investigations, Edward overhears of an oncoming Mayday ritual called \"the time of death and rebirth\". He discovers the previous year's crop failed; nearly dies from bee stings; and eventually comes to the conclusion (a conclusion which admittedly couldn't be more obvious if the locals had tattooed a timetable of events on the back of his hands) that Rowan will be burnt alive in a pagan rite to ensure a bountiful harvest. He also meets the Queen Bee of the hive, Sister Summersisle (Burstyn), who has her own plans for him involving the eponymous Wicker Man: \"The drone must die.\" <br><br>First, the good news: any concerns Cage would be airlifted from the Wicker Man's flaming jaws at the last minute by a fleet of black CIA helicopters can be laid to rest: he toast. That's about it for the good news. \"This is a story whose chapters were carefully written\" intones Burstyn with sublime irony. Though retaining the basic cat-and-mouse premise (and credits typography), what's left subjects the original to a scorched-earth policy.<br><br>Crucial to Shaffer's original screenplay was that his Christian copper, in accordance with ritual, came to the island of his own free will  and most importantly, was a virgin; the perfect sacrifice. In reducing matters to a sexual, as opposed to a religious power-struggle, LaBute presents the flimsiest of qualifiers for a harvest sacrifice. By the time Cage has worked out he was the bait, you honestly couldn't care less.<br><br>And Cage is one of the very worst things in this; a lumbering, drawling donkey  an arsewit whose tongue seems just slightly too big for his mouth. \"Goddamit\" he moans after he hallucinates a drowned Rowan, with all the mental torment of a man who's set his morning alarm clock half-an-hour too early. One hopes it's his character's frequent reliance on pills that has reduced him to this state  alternately fatigued, then full of preppy, overbearing vim. If so, it's a fine portrayal of an undistinguished IQ addled with anti-depressants. If notit doesn't bear thinking about. As Willow, the saucer-eyed Beahan is similarly dreadful, presenting her lines as if in competition with Cage for themosthalf-hearteddelivery. While Burstyn entirely lacks the mercurial menace to convince. Who's afraid of Naomi Wolf? <br><br>Every element that made the original great  the lovingly detailed depictions of folk customs, the ingenious score, the dialogue (Lord Summerisle's majestic \"You did it beautifully!\" has been replaced with the rather less attractive \"You did it excellently!\" Whoah, dude!)  have been substituted for a meandering battle-of-the-sexes thriller with occasional crash-bang wallop. Namely, walloping women; this is a LaBute flick, after all. Cage's Sister Beech bashing is just one of the more embarrassing episodes; impotent little men will be hooting with glee at how them uppity hippie chicks finally got what was comin' to 'em, hyuk hyuk.<br><br>The closing coda sees the whole rotten mess collapsing under the weight of genre cliché: in a bar, two guys run into a couple of Summersisle maidens on shore leave, flirty-fishing for fresh martyrs. At the moment of their successful pick-up, you half expect the women to turn round and give an exaggerated wink and a thumbs up to the camera.<br><br>One more thing: keen credit watchers may have noticed that films sporting an unusually high producer count (anything up to 10) tend to be Not Much Cop. The Wicker Man has 18 producers in total.","user":"Ali_John_Catterall","rank":[449,521]},{"title":"Hilariously Awful","rating":2,"date":"2 September 2006","review":"A phenomenal achievement in awfulness. It's actually hilariously awful.<br><br>First off...Nicholas Cage must now have made it to the finals in the Over-Emoting Category in his acting class. Wearing new hair plugs and with a face that has been lifted so many times his pinned back ears seem to be straining to touch in the back he oozes not only a sick smarmiess but creates a \"hero\" character that you have no vested interest in.<br><br>I don't know what it is with Neil Labute and female characters. He makes females out to be totally deviant and evil...and pays them back by having Cage punch several of them directly in the face and call them all \"b****es\" a few times too. I've enjoyed LaBute's early films and a few of his plays...but it's a strange fascination he has.<br><br>I'd give this film a 2 out of 10 solely based on Ellen Burstyn's performance. By the time she finally makes her appearance (bravely soldiering through her scenes with her wig line clearly visible on her forehead) it seems like all hope may be lost. She deserves an Oscar right here and now for saying her lines with a straight face and when she appears wearing a white mumu and blue, white, and gold face paint booming about The Wicker Man you know that working with Scorcese and Friedkin really prepped her for this role dang well.<br><br>This movie is so wrong-headed and cuckoo that is has to be seen to be believed.<br><br>Highlights include: Nicholas Cage running away from a swarm of bees and then falling down a hill.<br><br>Nicholas Cage stealing a bicycle and looking like Ms. Gulch from The Wizard of Oz riding around on it.<br><br>Nicholas Cage running around the island kicking down doors looking for the missing girl.<br><br>Leelee Sobieski PLUMMETING from a once-promising acting career in a \"brawl\" with Cage.<br><br>Ellen Burstyn dancing around in a said while mumu.<br><br>Nicholas Cage screaming \"Who burned it? Who burned it? Who burned it?Who burned it?Who burned it?Who burned it?\" for no reason.<br><br>Nicholas Cage in a bear costume (I'm not kidding) running through the woods, taking off the costume (but leaving the bear feet on) and then doing some karate moves to some villains.<br><br>And you haven't lived until you have seen the final 15 minutes of the movie and its dreadful epilogue that looked like it was shot yesterday in your cousin's basement.<br><br>Needless to say, if you can make it through this film without laughing out loud then you deserve a medal. There was actually a point in the movie where I stopped snickering to wonder if maybe this wasn't an elaborate send-up of \"hysteria\" films...only to be reminded when Cage would scream/shout/whisper his dialogue that he really was taking himself quite seriously.<br><br>I think this one is destined to be a cult film all over again...just because it's so dreadful.","user":"Snopjo","rank":[80,99]},{"title":"Appalling","rating":1,"date":"1 September 2006","review":"How this film could miss so many of the fascinating, complex and mysterious aspects of the original story or the original movie is truly remarkable. An unbelievably thin and unengaging plot, ankle-deep characterisation/motivation and a really awful soundtrack (replacing tension with vast swathes of noise, replacing the arcane musical references of the original for digitised crashes and roars. Then there are the specific references to the original which are merely \"plastered on\" over the cracks... Dreadful. In a world where gormless, brain-dead Amerikan remakes of The Italian Job (a tear appears), Get Carter (sobs uncontrollably) and Alfie have desecrated our screens recently, this one takes the proverbial biscuit. Execrable nonsense. How Ellen Burstyn ever got involved is a wonder... Rubbish.","user":"sjc1952","rank":[224,295]}]