[{"title":"Wraps you in, funnier than you'd think, but makes you think","rating":9,"date":"2 July 2006","review":"I saw this at the LA Film Festival and frankly was expecting it to be very artsy, interesting, and a real downer. It was far above all those things. The split screen is easy to adjust to and really wraps you in, you're quite fascinated to see what these two people will do next. I loved the set up; it lent itself to a nice surprise for the audience and felt completely natural.<br><br>What really shines in this movie is the dialog...it's some of the most brilliant original dialog between two people with a shared past that I've ever heard. During the Q&amp;A afterward, I was actually a bit disappointed the director didn't give the screenwriter more credit for her amazing script (which she wrote in three weeks). It's so engaging and natural, you might guess it was improvised...but 99% came directly off the page. <br><br>Helena Bonham Carter and Aaron Eckel really landed plum roles for themselves in this story and I've never loved them more than here. The reviewer who thought Helena was miscast is way off in his perception. It's not about wedding sexual tension (good grief) and it's far from a chick flick...it's about the deep connection between two people regardless of time and similar to \"Before Sunrise,\" etc., yet quite different, but I don't want to spoil it. <br><br>The film is touching, very humorous, and deeply thoughtful. You will want to watch it several times to catch all that happens.","user":"cjschepers@southwest.net","rank":[85,96]},{"title":"An Emotional One-Night Stand Made Uniquely Resonant by a Split Screen and Carter's Superb Work","rating":8,"date":"12 January 2007","review":"There are so many conventional movies about adulterous chance meetings that the prospects of another one wouldn't seem to be too promising. However, director Hans Canosa takes a rather novel approach with this small-scale 2006 indie film in looking at the illicit one-night stand with a pervasive split-screen process. Most often, the two sides reflect the perspectives from the man and woman at the center of the story, and at other times, we see their individual memories as flashbacks to their youthful courtship. Initially, the gimmicky aspect of watching the duality of the action is rather jarring, but it gradually becomes a dramatically effective means for exhibiting the dynamics of the two characters in real time. Gabrielle Zevin's sharply delineated, often amusing dialogue also helps to bring an immediacy to what could have been a predictably drawn situation.<br><br>The intimate, verbose plot itself turns on several contrivances, some more forgivable than others (like the absence of names for the lovers and the misunderstanding arising from matching cell phones). Regardless, it's really the adroit charm and emotional dexterity of the actors that sets this movie apart. Playing yet another rascally man-child, Aaron Eckhart adds shades of mid-life romantic vulnerability that make his character likeably flawed. But the picture really belongs to Helena Bonham Carter's richly textured performance as the woman, easily her best work since 1997's \"The Wings of the Dove\". As a complacent married woman who feels herself hurtling palpably toward forty, she provides such revealing nuance with each scene that I ended up wondering more about her character's fate than his. With her sad dark eyes and pouty mouth, she looks more like legendary French actress Jeanne Moreau as the years pass.<br><br>Shot in only thirteen days and with a running time of only 84 minutes, the movie is quite small in scope, but it is also a relatively undiscovered gem that will hopefully take on new life on DVD. Speaking of which, the 2007 DVD has a surprisingly robust number of extras beginning with Canosa's thoughtful commentary track. Also included are an entertaining 25-minute interview with an easily bantering Eckhart and Carter from the Telluride Film Festival; an insightful five-minute short with the director showing a demo of his dual-camera film-making technique; a helpful four-minute explanation of why split-screen was used specifically for the film; and a less interesting, more technical twenty-minute demonstration of how Canosa used Apple Final Cut Pro software to make his complex edits.","user":"EUyeshima","rank":[22,23]},{"title":"I agree with Roger Ebert - one of the best at Telluride 2005","rating":10,"date":"10 October 2005","review":"I was lucky enough to see this movie on Monday, September 5, the last day of Telluride 2005. There were five other screenings that had sold out before that. I'd heard the about the film, but wasn't sure I had to see it until I read Roger Ebert's review of the film on his website's festival writeup.<br><br>I didn't think that a movie made entirely in split screen could be anything but a gimmick. But after seeing the film, I agree with Ebert--the split screen comes to seem necessary. The split screen is used not only to show the simultaneous actions and reactions of both characters, but also shows flashbacks juxtaposed with the present, alternate versions of the present, and moments imagined or hoped by the characters that quickly return to reality. Sometimes the present is fractured into more than one emotion for a given line or action, showing an actor performing the same moment in different ways. The editing is assured and masterful, employing storytelling techniques that couldn't exist without the split screen. The writing is brilliant, full of humor and insight. The movie is like nothing you've ever seen before.<br><br>Aaron Eckhart and Helena Bonham Carter are amazing--funny and heartbreaking at the same time. I really can't wait to see this movie again. If a movie ever rewarded two viewings, it's a movie that plays in two frames.","user":"gollytolly","rank":[62,71]}]