[{"title":"Pretty good flick.","rating":7,"date":"26 June 2007","review":"I just saw the screener and it's pretty good. It's not a high budget movie, but it's very tastefully done. It's not about the gore, it's not quite a thriller or a comedy. It's a mixture. Keeping it real and somewhat close to life. About the acting: There is one scene where they should have slapped the actor and make him do it again for screwing up his timing, but on the whole it's very entertaining. Sean Patrick Flanery did great, although you do get the sense of a cool guy playing a dork. But that's easily forgotten by the 'hey, it's the guy from the Boondock Saints' feeling. (or maybe that's just me) I think you'll enjoy this movie. It just might make you smile, or give you a kinky idea to try with your girlfriend... (just consider this part a joke, those fainthearted people amongst us)<br><br>Anyway: good flick, go watch it.","user":"c-i-z-ler","rank":[30,35]},{"title":"A pleasant surprise","rating":8,"date":"29 June 2007","review":"I must admit, when I first saw the description for this movie I thought it was going to be awful. Im glad I watched it anyway.<br><br>The creators of this film took a tired, cheesy plot and magically turned it into quality entertainment.<br><br>Keep in mind this is a rather low budget film with mostly unheard of actors, and despite all of this the film was quite enjoyable.<br><br>This isn't a horror film, or a comedy, or a romance, or a drama, or a thriller...its more a tasteful combination of all of these.<br><br>The plot develops slowly with perfect timing keeping you interested and tagging along with the main character throughout the film.<br><br>The originality and unpredictability I think are the qualities that stand out most with this film.<br><br>I may have given it a better rating if it weren't for the glaring over-acting by Jon Huertas (Javier) which was a severe distraction.<br><br>Over all though I would have to give my approval on this film (which is rare, as I am picky). I would recommend this film to anyone.","user":"GirlAchromatism","rank":[36,43]},{"title":"Lightweight but fun vampire flick with decent production values","rating":22,"date":"22 June 2008","review":"\"The Insatiable\" is a well-made vampire comedy horror with a decent cast and direction. Sean Patrick Flanery plays Harry Balbo, a man who witnesses a horrific vampire killing during his visit to his local convenience store. Balbo becomes obsessed with tracking the beautiful female vampire (Charlotte Ayanna) down and is successful in imprisoning her in his basement.<br><br>Ayanna is a convincing screen siren and it's easy to see how Balbo becomes her unwitting helper. Michael Biehn plays a seasoned vampire hunter - it's a small role but he makes the most of it.<br><br>7 out of 10. The ending's a bit rushed but this is a reasonable horror comedy. Worthy of a rental.","user":"DVD_Connoisseur","rank":[10,11]}]