[{"title":"Adrenaline Rush - Fast & Furious: Tokyo Drift is a solid good third entry action flick!","rating":9,"date":"24 January 2016","review":"The Fast and the Furious: Tokyo Drift (2006) in my opinion I think is a solid good action sequel, a very bashed and hated in the series. Which I don't think this movie is bad, I think is a much better movie than Furious 7. I always loved this movie, I think it is a good movie, but in the series is not the worst one, but is far from worst one that would be Furious 7. I think it was a different solid, good sequel in the series and I love it for an action film. The Fast and the Furious: Tokyo Drift is a fun movie to watch: it accomplishes what it set out to do and that's provide the most realistic yet gravity-defying racing sequences, backed with the eye-catching background of the electrifying, neon Tokyo. Plot-wise it suffers a bit and the acting isn't top-notch, otherwise the loud music, import cars, cityscape Tokyo, and Japanese pop culture more than make up for the flaws of the film that you'll watch it again and again.<br><br>Plot: When convicted street racer Sean Boswell (Lucas Black) tries to start a new life on the other side of the world, his obsession with racing sets him on a collision course with the Japanese underworld. To survive, he will have to master drifting—a new style of racing where tricked-out cars slide through hairpin turns, defying gravity and death for the ultimate road rush.<br><br>This movie is more the highest-octane installment of the hit movie franchise built for speed! There are more mind-blowing stunts and heart-pounding racing sequences than ever, The Fast and the Furious: Tokyo Drift will put you in the driver's seat. \"Strap yourself in for a blistering, super-charged ride.\"-- Pete Hammond, Maxim\" The CGI I am sorry but in one way it is terrible which I really did not like when Sean (Lucas Black) and Neela (Nathalie Kelley) are slide down with the car during the car chase and they cross over the crowd of people without hitting anyone, you can see the camera, that it is made with a CGI that is the only main problem I have with the film, the rest was okay. This is a very simple film, not a big confusing plot and again this films, you know 5,6 and 7 the plots are still pretty simplistic.5 was a heist movie, 6 was this guy the evil version of you, we want him to bring him down simple.7 you killed this guy's brother, he is looking for revenge and he also try's to kill you so you get this, simple movie not complicate at all. That is one thing that this movies get right constantly.<br><br>The racing in this movie: I think they did a better job than in 2, because I didn't noticed more of a CGI, because that's how they just do it now, a lot of wide shot you can tell there was a lot of practical stunt drive, it look good which I enjoyed that. I know a lot of people will put this movie lover down and I think it is a solid movie and a solid flick. This is the first time Brian Tyler made the score and this is also the first one that Justin Lin directed, he went later directing three next movies 4,5 and 6 which I love to death. I thought the direction is good, I like the resolves on the end of the movie, the sound track is good, I did not mind the cast you know. Lucas Black is the lead in this movie. Sonny Chiba is in this movie I always like the actor. This was Sung Kang's first introduction of his character Han who later appeared in 4 as a cameo, than in 5 and 6 as regular cast. Vin Diesel did returned with his character Dominic Toretto, who made a cameo scene on the end of the movie, which I thought was pretty cool. Bow Wow I didn't mind him in this movie and Nathalie Kelley was extremely hot and I really though she was much better sexy babe, than Eva Mendes was in 2 Fast 2 Furious. Nathalie Kelley lights up the screen as Neela and I would welcome her return to the series any time.<br><br>Overall: Tokyo Drift gets a solid 8 by me it does lacks on the great characters and the cast of the first two movies in the series, but is redeemed by Han, awesome car scenes and a pounding score from Brian Tyler. I have enjoyed this movie and I think it is a solid action movie, I love this film and it is a step above than 2 Fast 2 Furious by me.<br><br>The Fast and the Furious: Tokyo Drift is a 2006 American action film directed by Justin Lin, produced by Neal H. Moritz and written by Chris Morgan. It takes place between the events of sixth and seventh films. The film stars Lucas Black, Bow Wow, Nathalie Kelley, Brian Tee and Sung Kang.<br><br>8/10 Score: A- Studio: Universal Pictures Starring: Lucas Black, Bow Wow, Sung Kang, Nathalie Kelley, Brian Tee, Leonardo Nam, Brian Goodman, Zachery Ty Bryan, Nikki Griffin, Sonny Chiba and Vin Diesel Director: Justin Lin Producer: Neal H. Moritz Screenplay: Chris Morgan Rated: PG-13 Running Time: 1 Hr. 44 Mins. Budget: $85.000.000 Box Office: $158,468,292","user":"ivo-cobra8","rank":[38,49]},{"title":"No rats in buckets, no CGI, just an entertaining flick featuring excellent car racing","rating":8,"date":"13 April 2017","review":"Branching away from any original cast members of the first two films, thankfully, Tokyo Drift provides a refreshingly new look to the franchise.<br><br>Tokyo Drift is possibly my favourite of the series, or at least its up there with the first film; it only has a few problems that can be swept under the \"It's Fast and the Furious, what do you expect\" carpet. The story follows American \"teenager\" Sean Boswell (Lucas Black) whose reckless driving lands him prison time, but to avoid this he moves in with his father in Tokyo. He attempts to move on a dangerous rival's girl, and must become a competitor in the street racing's drifting scene.<br><br>I say \"teenager\" as that's what IMDb says, and he does go to school in the movie but honestly, he's the oldest teen I've ever seen. Along with every other \"teen\" in this movie! While I talk negatives, the majority of the film is set in Tokyo yet 95% of the dialogue is English and Sean has a knack of meeting every foreigner in the city. I don't mind this so much, but I fully expect all of the Japanese characters to speak Japanese, especially when Sean isn't present!<br><br>But, unlike 2 Fast 2 Furious (choke) this film actually cares for its characters and their personalities (as Sean says early on: \"It's not about the ride, it's about the rider\") from Sean's fish-out-of- water acceptance, to his mentor Han's closet of skeletons. The villain isn't ridiculous either, his uncle is part of the Yakuza and he has a serious \"king of a little hill\" problem. Again unlike 2 Fast 2 Furious (gag) the cars have never looked better, sleek and refined and the drifting action is spectacular, especially when synchronized. Plus, no CGI, just skilled professional drivers, making the film worth seeing solely for the racing.<br><br>There's no stupid Tyrese Gibson mugging at the camera, no rats in buckets, no CGI, just an entertaining (albeit poorly localized) flick featuring excellent car racing and professional stunts.","user":"CinemaCocoa","rank":[29,37]},{"title":"I enjoyed this movie","rating":7,"date":"23 February 2020","review":"I actually really enjoyed this movie. I love the location, cool race scenes, surprisingly interesting plot and overall a lot of fun. If you are a fan of the franchise you might be disappointed cause of its lack of characters we know and love but you'll still be entertained.","user":"MR_Heraclius","rank":[37,49]}]