[{"title":"The Space Marine, the Vikings, and the Alien Space Dragon","rating":9,"date":"3 February 2009","review":"I stumbled upon this move by accident, but being a sci-fi and fantasy nerd, I watched it, despite the fact that sci-fi movies nowadays tend to be rather poor.<br><br>The story begins with Kainan (James Caviezel) crash landing his spaceship into a lake, in the middle of Viking-land, in 709 AD. With his co-pilot dead, and his ship in ruins, sunken to the bottom of the lake, he uses his only working piece of technology to teach himself the norsk language. (I laughed my head off, when the first word he utters in Earth language is the \"F\" word :D) Wandering around in a forest, he is found by Wulfric (Jack Huston) and brought back to his village. They think Kainen is responsible for brutally ransacking a nearby village, and when Kainen tells them he is hunting for a \"dragon\", he is labeled as a liar and enemy. When in fact, the \"dragon\" he is referring to, is a monster from another planet, now hunting the viking populace and fauna of the land. Soon, when the villagers start vanishing and turning up as mutilated corpses, the vikings realize that Kainen might be telling the truth after all...<br><br>I gotta say, combining space marines and alien monsters with a fantasy Viking setting intrigued me to no end. Outlander is the living proof, that such a combination can result in a very good and entertaining 115 minutes. Although the story is a little shallow, lacking in huge plot-twists and deep character development, but it is enough to keep the attention between the awesomely gory fight scenes.<br><br>The acting is good enough, with the Christian Bale look-alike Caviezel, and the great but short performance of Ron Perlman, it manages to be captivating. We see far more swordplay than pulse rifle shoot-outs, so the sci-fi part of the film is largely suppressed to make way for the epic battle between the vikings and the moorvens, but that's just how it must be in this movie. The fight scenes are nicely choreographed and acted, the special effects are more than awesome, and the whole is movie is just great.<br><br>I'd like to point out, that the Moorven is most astonishing space monster I've ever seen. With the clever colored pulsing and the well thought-out anatomy of the beast, it manages to be best so far.<br><br>It's not the best movie I've seen, but it's still great, and every sci-fi and fantasy fan should go see it.","user":"Playbahnosh","rank":[154,183]},{"title":"Berlin Fantasy Film Fest","rating":7,"date":"19 August 2008","review":"Caught a screening of this last night in Berlin. Cinema was completely packed, not a spare seat in the house, and the crowd really seemed to enjoy it. I thought the film was great, really cool genre pic that comes across as a nice mixture of Predator/Braveheart/Beowulf, all the while managing to feel quite original on its own. Nice cast, Nice Script, and everything is handled a hell of a lot more intelligently than what you'd expect from a movie which is essentially 'Giant Alien Vs Vikings'. Why this is only getting such a limited release is beyond me, I think it could actually do quite well if given the chance. Basically anyone who enjoys Sci-Fi Action/Adventure done well should be looking forward to checking this one out when and if they get the chance.","user":"davidaq","rank":[256,312]},{"title":"Space monster actionfest set in Viking times - what are you waiting for?!!","rating":8,"date":"27 March 2009","review":"It's a real shame I haven't seen a single preview or a billboard for this movie. Whatever, though - the box office opportunity was wasted because someone or other didn't have faith in humanity (I mean seriously, anyone with a droplet of testosterone in them would find this highly entertaining, so of course there's a market for it), but this movie's cult status is assured. <br><br>Spaceship carrying terrifying bloodthirsty monster and a mysterious hero (well, not that mysterious) crash lands on Earth during Viking times. I repeat - Vikings! Swords, battles, mead- drinking and all-around Norse badarsery are featured prominently. The acting is good for the most part, the writing isn't stupid and formulaic, and the director keeps a brisk pace throughout the film. And the space monster is simply terrific, imbued with the perfect amount of personality. <br><br>If I was 10 years old when I watched it, I would have been running around on the ceiling for months. Being the mature and responsible grown man I am now, I didn't exactly do that - instead, I recommended it to all my friends and watched it 3 times.","user":"Voland-4","rank":[25,27]}]