[{"title":"The best film you could ask for from an \"A-Team\" adaptation","rating":7,"date":"8 June 2010","review":"If any film demands to be graded on a curve, it's The A-Team.<br><br>Simply consider the notion of making a big-budget summer movie from of one of the cheesiest television shows of a cheesy TV era.<br><br>It's a crafty plan to lower your expectations. As long the movie isn't two hours of punching grandmothers and kicking puppies, you're likely to leave the theater saying, \"That was better than I expected.\"<br><br>Guess what? It works like a charm.<br><br>The A-Team, against all odds, is one extremely entertaining film. It puts pedal to metal about 90 seconds in and never lets up. That's also savvy because it's also kind of a mess that would collapse under its own weight if it slowed down for more than two minutes.<br><br>Director Joe Carnahan (Smokin' Aces, Narc) isn't taking that chance. Action scenes come flying at you hard and heavy from start to finish. The results are mixed: Some sequences are choppy and confusing, others thrilling. But like a comedy that never stops pitching jokes, content if only half of them stick, The A-Team pitches action, action, action, with a side of action and a little action to wash it down.<br><br>The plot follows the general concept of the TV series with a few tweaks. A (very) lengthy credits sequence set in Mexico shows us how the team of former Army Rangers comes together: Leader John \"Hannibal\" Smith (Liam Neeson), his right-hand man Templeton \"Face\" Peck (Bradley Cooper), powerful Bosco \"B.A.\" Baracus (Quinton \"Rampage\" Jackson) and loony pilot James \"Howling Mad\" Murdock (Sharlto Copley).<br><br>We jump ahead several years, where the A-Team is now an Army covert operations crew with dozens of successful missions under their belts. But when they're set up for a fall by a variety of villainous forces, the boys have to break out of jail and fight to clear their names.<br><br>That's pretty much all you wanted to know about the plot, right? Because it gets pretty confusing from there and doesn't matter in the slightest anyway. It's only there to support – that's right – action.<br><br>Before I tell you why A-Team is worth your hard-earned cash, I should lay out its many faults.<br><br>Though Carnahan directed, it's not surprising to see director Tony Scott was one of the producers. Too many scenes evince Scott's \"look\" – the camera shoved in way too tight on the actors, so you can't tell what the hell's going on in fight scenes or big gun battles.<br><br>The special effects are wildly uneven too, especially in the climax. It looks like the usual Hollywood problem of the CGI being \"just good enough\" to make a locked-in release date. This time, it's nowhere near good enough.<br><br>But then, The A-Team is a nitpicker's dream, if you really want to go there. Jessica Biel's casting seems like an inside joke – \"we're not taking this seriously, and neither should you, so let's cast a gorgeous but astonishingly wooden actor in this role.\"<br><br>Maybe you're wondering whether she's really that bad. Look at it this way: This is the first major film role for \"Rampage\" Jackson, an MMA fighter. He's not great, but he's not too bad – and that's high praise for a non-actor stepping into the iconic role. Yet he's a good bit more believable than Biel.<br><br>So with those issues, what makes The A-Team so entertaining? The rest of the cast, actually. If you can look past Biel (actually, look right at her, that's what she's there for), the film is jam-packed with colorful, charismatic performances.<br><br>Neeson seems a bit odd at first stepping into George Peppard's shoes as Hannibal, being considerably taller, leaner and tougher. But that's appropriate for the movie, which is basically the TV show on (lots and lots of) steroids. No attempt is made to explain his Irish accent, nor that of Copley, who is South African. It doesn't matter: Somehow in this film, it works.<br><br>But the film decides early on to focus on Cooper, hot off his success in The Hangover, and it's the right choice. You'd never have guessed the guy who played eighth fiddle on Alias would be front-and-center for a star-making performance, but it's true.<br><br>The A-Team shows off Cooper's buffed-up physique almost to the point of absurdity – he's shirtless on screen more than Mark Wahlberg in Date Night – but Cooper's charisma carries the day throughout.<br><br>A well-rounded supporting cast also delivers. Patrick Wilson and Brian Bloom, as potentially shady characters related to the A-Team's troubles, steal every scene they're in. (It probably doesn't hurt that Bloom, a veteran actor mostly relegated to TV work, gets co-writing credit.) Their wonderfully brash characters bring welcome levity to the pounding machine of gunfights and explosions that propels The A-Team.<br><br>Finally, I would be remiss if I didn't note the drinking game that by all rights should be born from this film: Drink whenever a guy with icy blue eyes is on screen. You'd pass out halfway through the film.<br><br>There's Cooper and Neeson alone, plus Bloom and Wilson, with a little Gerald McRaney – yes, Major Dad himself – thrown in for good measure.<br><br>If you're really into dudes with bright blue eyes, The A-Team is like porn. If you're into nonstop action and lots of male bonding, The A-Team is like porn. If you're into deep, fully-realized female characters – well, look elsewhere.<br><br>But if you had to ask me what I would want a big-screen take on a really silly TV show to be, The A-Team more than fits the bill. It's ridiculous, sure. But it's also a ridiculous amount of fun.","user":"Rick_Gershman","rank":[318,415]},{"title":"The A-Team in 1,000 words: overkill is underrated","rating":8,"date":"8 June 2010","review":"Overkill is underrated. One of the many mottoes Colonel John Hannibal Smith throws around whilst hatching his brilliant plans, dispensing them like his insightful wisdom increases the chances of success. A motto director Joe Carnahan has taken to heart in making 'The A-Team'. A smart move, as complete and uncompromising exaggeration appears to be exactly what the format asked for. Especially since the translation of TV shows to the big screen has proved to be no easy task. Just look at 'Miami Vice', which pretty much bombed despite the presence of Michael Mann, the director/producer who created the original series. Or the near criminal trashing überhobbyist MacGuyver recently received by the hands of questionable farce 'MacGruber'. In a world so significantly different from the mid-eighties, the severely underpaid and hopelessly dated missions of the four fugitives could have very much been out of place as well. <br><br>The reincarnation by the hands of Carnahan however, avoids many of the pitfalls that the outdated format has to offer. For one, the director has brought the well known premise of the series to the present. Vietnam has been replaced by Iraq and the bad attitude of Bosco Baracus is not the only thing that makes the foursome dangerous: the happy-go-lucky stance of a team that rarely asked for enemy casualties has been replaced by an attitude that better suits a group of elite soldiers. What is especially striking is how well the cast handle their roles, and how much fun they have doing so. Understandable, since the characters in Carnahan's installment have been blown up as well. Hannibal in the hands of Liam Neeson, although not as charismatic as George Peppard, is equally complacently on the jazz whenever a dangerous situation can be even remotely relished. Templeton \"Faceman\" Peck in the version of Bradley Cooper enjoys the swindling of both women and all sorts of tools even more than his predecessor Dirk Benedict and the script provides Quinton \"Rampage\" Jackson with a philosophical depth to his distinctive character - and evolution thereof - in the BA 2.0 version. The acting skills of the professional wrestler are up for debate, but then again you never questioned Mr. T. either. Even though he played the bejeweled, Mohawk sporting powerhouse with an acute fear of flying as an overly enthusiastic pupil in a school musical, always staring at the next person to speak his lines way long before they had the floor. The biggest fun, however, comes from Howling Mad Murdock in the interpretation of 'District 9'-phenomenon Sharlto Copley, who occupies the crazy pilot with both a zest for life and an absolute fearlessness of death – cue the suicidal midair antics. His inimitable flying skills, Murdockian features (sock puppets and his interaction with BA for example) and especially his imitation of Mel Gibson in 'Braveheart' - including stick horse - make him the movies' main asset. <br><br>The script then. The plot, pretty much a side issue, continuously serves up action excesses – equally incredible and entertaining – but yields more than a whipped episode of the series stretched to a playing time of two hours. You could say the plot is kind of a cross section of the five years the series ran, if you omit the recurring missions the mercenaries entered into. There is plenty of borrowing from existing story lines, more or less adapted to the new universe of Carnahan. The film opens with a spectacular introduction of the four veterans some years ago - only Hannibal and Face are trusted comrades, BA and Murdock have still to cross their paths - setting up the Alpha team that started it all. Included of course, is a supporting role for the black GMC Van, which can impossibly be disregarded as the fifth member. Cut to eight years and eighty successful missions later, to the operation that sees the team become the proverbial scapegoat the series theme credits were based on – something to do with a crime they didn't commit. The bank robbery in Hanoi has been replaced by the hijacking of a truckload of counterfeit money in Baghdad, commanding General Morrison is still here. The CIA is present as well, in a possible set-up for a sequel in which Hannibal's outfit will be contracted by the organization in a reference to Stockwell (Robert Vaughn) of the fifth season of the series. The plot is driven by the aftermath of the robbery, offering supporting roles for Captain Charisa Sosa (the distractingly attractive Jessica Biel) and CIA man Lynch (Patrick Wilson, 'Watchmen'), but it's all a mere hook for ridiculous set pieces and extravagant action to be towed on. <br><br>Hannibal's crack commando unit must pull out all the stops in order to clear its name, in an adventure that at times offers absolute top entertainment. That is, if you're willing to believe that a parachute suspended tank (as seen in the trailer), wherein the fearless foursome escape from an exploding plane, can be easily maneuvered in midair using the inboard cannon, simultaneously discarding enemy aircraft like it's a game of Duck Hunt. There are enough sequences that ask more than a lot of your ability to shut off your brain, but as said that exaggeration is exactly what this film needed. 'The A-Team' is simply a masterful popcorn spectacle par excellence, offering high-level action entertainment and jokes that are more often than not very decently set up. The cast has great fun working with the pleasantly unlikely adventures and the story is – in good tradition - full of references to the 80's hit series it is based on. The plot falters a bit left and right and the credo overkill is underrated is at times perhaps taken a little too far, but that is merely an expected consequence of handing control over to the man behind 'Smokin' Aces'. Regardless, the oncoming release might well feature a well-deserved 'to be continued' by the time the end credits start rolling.","user":"Robert_Nijman","rank":[226,317]},{"title":"Overblown, super-exaggerated trash... and I loved every minute","rating":7,"date":"9 June 2010","review":"I was quite a fan of the A-Team when I was a wee lad, thanks mostly to cable TV reruns, and I was eagerly anticipating this movie from the moment I saw the first episode. At no time did I think it wouldn't happen.<br><br>Of course, as the years passed, and I grew older and wiser, I came to realise that an A-Team movie might just be a really bad idea. I mean, c'mon, an ex-Army unit that never kills ANYONE? That uses ridiculous plans that frequently broke the laws of logic and physics? Yeah, right.<br><br>Fortunately, when this film WAS announced, I couldn't help but feel a little excited. Especially when that cast came forward. And the first trailer had me revved up... and nervous. Could so easily be trash.<br><br>Well, it is trash. Trash of the most glorious, overblown, wonderfully-fun kind. Tongue planted firmly in cheek, and with utter acknowledgement of the fact that the most it can aspire to is \"A Fun Night Out\". The cinematic equivalent to a Big Mac: ridiculously bad for you, and part of you wishes you hadn't, but you still enjoyed the hell out of it anyway.<br><br>The cast work well together, and have a pretty good team dynamic. Liam Neeson brings the right combo of gruffness and cool to Hannibal (though a little more humourless than George Peppard), and Bradley Cooper is, well, Bradley Cooper, wise-cracking and entertaining as con-man Face. Though many have spoken ill of Quinton 'Rampage' Jackson as B.A., I thought he was capable enough in a role that required little more of him than snarling watered-down catch-phrases. Of the foursome, the easy stand-out is Sharlto Copley's jittery, crazy-eyed Murdock, who manages to steal the scene whenever the camera lingers on him for more than three seconds. If District 9 marked him as a bright new talent, hopefully this film should make him a star.<br><br>Jessica Biel as conflicted agent (and Face's ex) Charisa Sosa, and Patrick Wilson as smug CIA man Lynch, offer some fine support, but really, this film's all about the action. And the action. And the action. Which is served up with a trowel. Most of it's wonderfully-overblown, but in that great \"Aw, that was cool\" way that was prevalent in the Eighties (though the level of exaggeration which the climax reaches does start to stretch even the most resilient switch-off action fan).<br><br>All in all, my best advice is sit back, switch off, and enjoy the ride. It may not be the A-Team you remember, but it's a hell of a lot of brainless fun nonetheless. And we really haven't had that for a while.","user":"ThirtySevenSquared","rank":[122,167]}]