[{"title":"Surprisingly effective","rating":8,"date":"22 June 2007","review":"While doing some research before reviewing 1408, I was shocked to discover that this was the first time since 2004's Riding the Bullet that a film based on a Stephen King story had gotten the big screen treatment. 1408 marks somewhat of a comeback to the silver screen for the author after mainly working with television the past couple years. Director Mikael Hafstrom has created the most atmospheric and downright tense thriller I can think of so far this year. The premise may be thin, and yeah, it doesn't always make a lot of sense. But, is it ever effective.<br><br>Mike Enslin (John Cusack) used to be a promising author until the untimely death of his young daughter, Katie (Jasmine Jessica Anthony). He now spends his time writing trashy paranormal novels about the world's most haunted areas. He travels the world, doing research by staying overnight at places that are supposed to be haunted, gets some colorful background info that he can use for material, and then moves on to his next job. One day, Mike receives a postcard informing him of an old hotel in New York City called the Dolphin Hotel, which is supposed to have a room that has quite the history. Doing some private research, he learns that the Dolphin has had a long and tragic history of deaths, all of them surrounding the guests that have stayed in Room 1408. Mike books the room, despite the warnings of the hotel manager, Gerald Olin (Samuel L.Jackson). Entering the room, nothing seems ominous at first. But then, the room itself begins to take on a life of its own, and begins tormenting Mike with various ghostly apparitions, mind tricks, and even displaying his own painful past before him in various ways. <br><br>1408 is the second thriller set around a hotel released in less than two months (the other being April's Vacancy), and is by far the superior film. The film is actually quite subtle in its way of creeping us out and disturbing us, which is a nice change of pace from the recent Hostel: Part II. Rather than bombard the audience with ghostly special effects and gore, the movie gets under your skin and goes for a much more psychological approach. The screenplay by Matt Greenberg, Scott Alexander, and Larry Karaszewski, wisely does not even attempt to explain Room 1408. It's just a very evil presence that can somehow look deep within troubled souls, and torture them to death with their own personal demons. In the wrong hands, this material could have been laughable. Even though the movie frequently flies into the realm of the unbelievable, it manages to somehow stay grounded.<br><br>A lot of this has to do with the fact that the film never loses its way, and become an excuse to throw as many special effects and jump scares into the movie as it possibly can. The human element of Mike Enslin is always at the center of the story itself, and its scares. The movie is built around the fact that he is forced to face his personal demons the longer he stays in his room, as well as try to keep his mind in check as various nightmarish hallucinations are paraded before him. It's much more effective than the usual characters that have passed as villains in recent paranormal films (usually gray-skinned people with hair over their faces), and it never once becomes heavy-handed or preachy. This is also a tricky balance to pull off. When the room started showing him flashbacks of Mike's own past, I grew nervous, thinking that the movie was going to start hitting us over the head with morales. Fortunately, it never once loses its sense of the eerie, and remains appropriately unsettling throughout.<br><br>At the center of the movie is John Cusack, who literally has to carry the movie almost by himself. This is essentially a one-man show for most of its running time, with fleeting apparitions being his main companions. Cusack has long been a favorite of mine, and this is one of his stronger recent roles. He not only has to carry almost the entire film on his own, but he also has to convincingly act like he is slowly going insane without hamming it up, or losing his personality. Any actor can tell you that madness is a difficult thing to depict. He strikes a very good balance, and remains believable throughout. Samuel L. Jackson is also notable in his small, but no less important, role as the manager who tries to talk Mike out of his decision to stay in the room. And then, of course, there is Room 1408, which is a character itself. The way it is constantly changing itself, right down to the paintings on the wall, creates an effectively creepy atmosphere that is continuously bizarre, but never so much so that we lose our sense to believe.<br><br>1408 succeeds where so many other films have failed in that it is not about apparitions jumping out at the actors or lurking in dark shadows. It digs much deeper for its horror than simple jolt thrills, and becomes an effectively thrilling horror film. It could be argued that the whole thing loses some weight when we apply logic to the story. But seriously, who wants to apply logic to a movie about an evil hotel room that can read your mind? When all is said and done, 1408 is a reminder of what horror can do. It can do so much more than thrill us. It can also make us laugh and leave us captivated. Perhaps what's more surprising than the fact that the movie can accomplish all that is that so few other horror films can.","user":"keiichi73","rank":[441,532]},{"title":"An innovative horror film","rating":8,"date":"21 June 2007","review":"I've never seen a horror film quite like 1408--can you even call this film a \"horror\"? Well, it's not the horror movie we're used to seeing in this day and age. The films that are supposed to scare us nowadays are made from the same recycled junk we've been seeing for years now. Nonsensical plots are dreamed up just to make use of the exciting range of CGI. Underdeveloped characters we don't care about are tortured/murdered by a psycho for no apparent reason. Most of the intended audience for these movies isn't even scared anymore.<br><br>Let me tell you, 1408 is different. Its main intention is not to scare you (though it undoubtedly will); it wants to tell you a story. It doesn't start out as a scary movie. John Cusack plays cult writer Mike Enslin, a man who visits supposed haunted spots in order to debunk their reputations in the mildly-successful books he writes with titles such as \"10 Nights in Haunted Hotels\". When the room 1408 at the Dolphin Hotel in New York is brought to his attention, research tells him that the death tally in the room is in the double digits. He sees the room as a solid ending chapter for the new book he's working on.<br><br>The film is based on a Stephen King short story, which I had the pleasure of reading before I saw the film. While the film does take its creative liberties, it never forgets where it comes from. Writers Matt Greenberg, Scott Alexander, and Larry Karazewski seem to be very well-read on the author, and the movie always feels just like Stephen King--if you've ever read him, you know what I'm talking about. There have been times when I've been reading a novel of his and had to tell myself, \"Calm down, it's just a book.\" There are moments in this film of such mind-gnawing anxiety, such high-adrenaline terror that I had to tell myself, \"Calm down, it's just a movie.\" (Note: Stephen King does recommend the film.)<br><br>Director Mikael Håfström never takes his audience's intelligence for granted. We're never beaten over the head with the same thing; the film is always headed somewhere new and exciting. The innovative ideas here are just terrific.<br><br>John Cusack is brilliant as the cynical writer with a tragic past. He's never unbelievable, and he always nails the character down perfectly. There was never a time when I wasn't rooting for Mike Enslin in 1408. There was never a time when I did not want him to get out of the room. Cusack's emotional range is really put into play here, and the casting could not have been any more dead-on.<br><br>Samuel L. Jackson gives a chilling performance as a manager who is intent on not letting Mike enter room 1408. His determination to convince Mike not to enter the room only fuels Mike's determination to enter it. Through him, we pick up on the facts about the room Mike's research couldn't provide. His warnings give us chill bumps but leave enough open so that we still don't know what we're in for.<br><br>And with room 1408, you never really know what you're in for. Who am I to ruin it for you? Just know that this is not a mystery. We will not come to understand why the room is the way it is. There are, of course, those who will be disappointed by 1408--because when all is said and done, they will find it's not a movie about a freaky hotel room, but rather the man who's trapped in that hotel room and what he finds there.","user":"antonioiam","rank":[531,659]},{"title":"Top notch supernatural thriller","rating":8,"date":"3 July 2007","review":"If your horror movie tastes run less towards chainsaw-wielding maniacs and more towards things-that-go-bump-in-the-night, then this is the movie for you. Based on a short story by the great Stephen King, \"1408\" is one of the genuine movie sleepers of summer 2007.<br><br>John Cusack gives a tour-de-force performance as Mike Enslin, a successful writer who specializes in the investigation of paranormal activity with a particular emphasis on hotel rooms that have the reputation for being haunted. The twist is that Enslin is, essentially, a nonbeliever who spends most of his time and energy debunking the very subject off which he is making his living. The 1408 of the title refers to a room in a swanky, five-star Manhattan hotel in which, we are told, no fewer than fifty-six guests checked in but never checked out, having met their untimely demises there in the decades since the establishment opened. Determined to put an end to the \"foolishness,\" Enslin moves into the room convinced he will ride out the night in utter peace and safety. He has, of course, another think coming.<br><br>As adapted by Matt Greenberg, Scott Alexander and Larry Karaszewski, \"1408\" succeeds mainly by keeping it straight and simple and by focusing so intensely on the character of Enslin and his relevant back story. The multi-layered plotting keeps us guessing from first moment to last, so that we never quite know whether what Enslin is experiencing is really happening or whether he is suffering some form of mental breakdown brought on by the death of his young daughter and the subsequent breakup of his marriage a few years back. Along with director Mikael Hafstrom, the master craftsmen responsible for the film's phenomenal art direction and sound recording draw us into the strange world they've created where nothing is quite what it appears to be and where we spend most of our time nervously scanning the edges of the frame to see what surprise is next poised to jump out at us.<br><br>Cusack, who has long been underrated as a performer, gets the chance to really show us his acting chops in this role. He allows us to clearly see the fear and vulnerability hidden beneath his character's wisecracking, cynical exterior. Samuel L. Jackson and Mary McCormack also excel in the small but crucial roles of the wise hotel manager and Enslin's estranged but faithful wife, respectively.<br><br>For those who can remember a time when fright films had more on their minds than simple blood and gore, \"1408\" is like a refreshing, restorative tonic on a hot summer day.","user":"Buddy-51","rank":[56,65]}]