[{"title":"Rapper Meets Demons, Yo.","rating":8,"date":"22 October 2006","review":"I saw this flick at the NYC Horror Film Festival. When I first heard about it I thought, \"A horror film featuring a white rapper? What a crappy idea.\" Well, it was great.<br><br>\"Rapturious\" is a white kid with dreadlocks--a talented up and coming rapper--with a nasty drug habit and a really interesting prior existence. We find out in a pre-credit sequence that doesn't even seem like it belongs in the rest of the film that in the late 1800s he was a notorious serial killer and rapist. The law finally catches up with him and they hang him from a tree. The whole sequence was shot in a real, dusty little ghost town in Arizona, where the buildings still stand. Very creepy, and very dislocating.<br><br>Flash forward to the present where Rapturious (played by Robert Oppel) tries a brand new drug given to him by his dealer (Hoya Guerra). He immediately starts having what he *thinks* are hallucinations caused by the drug in which he murders people and is told by a demonic voice \"WE'VE FOUND YOU, DEADMAN.\" What the poor kid doesn't know is that his soul managed to escape from hell after his execution (during an interview with a very nasty Demon, whose name escapes me), and evidently, he's been taking refuge in unborn babies since then, this being his latest rebirth. But the long arm of demonic justice has finally reached out, and they are by God determined to drag this errant soul back to his sentence in the Inferno.<br><br>So it's a game of cat and mouse throughout the whole story, as the demons--some in human disguise-try to net him.<br><br>We've seen it before, but the neat thing about this movie is the casting, and the terrific, urban feel. It was all shot in New York City and Queens. . .and Brooklyn, it looked like to me, and it just has the right street feeling.<br><br>The cast is great. Robert Oppel is perfect as Rapturious. Classic tough guy with a sad childhood, which one black rapper accuses him of milking too much for his music. Even though you never get inside this guy very much he has a very edgy, sympathetic vibe, so you like him. This is a role Johnny Depp would have had before he broke out.<br><br>Amin Joseph, who plays the closest thing Rapturious has to a friend, is so good he doesn't even come off as an actor. Hoya Guerra, as the drug dealer, almost steals the movie at one point, in a scene where he's sitting in his seedy apartment, watching one of those awful Mondo Cane movies on his TV, laughing hysterically and repeatedly exclaiming \"GET TH' F**K OUTTA HERE!\" while slurping down what looks like a bowl of beans. There's a short scene in a bar where a fat Italian guy (Sal Argano) sits and rants about how Coney Island is being over run by \"wiggers,\" white kids who dress like black kids, that is absolutely priceless. I don't know where writer/director Kamal Ahmed found his cast, but they worked great for him. <br><br>Horror fans will love Debbie Rochon as Rapturious's agent and they'll also love Joe Bob Briggs, who plays aslightly off center psychiatrist at Belle View and who. . .well, I'll let the movie hold *some* surprises, but I will say he has the best line in the flick.<br><br>I guess this will go direct to video--I hope not, I think it deserves a theatrical release--but one way or another, it's really worth seeing.","user":"RocketB52","rank":[26,49]},{"title":"worse than you tube movies!","rating":1,"date":"1 February 2009","review":"This is a film that makes you say 2 things... 1) I can do much better than this( acting,writing and directing) 2) this is so bad I must leave a review and warn others...<br><br>Looks as if it was shot with my flip video. I have too believe my friend who told me to watch this has a vendetta against me. I have noticed that there are some positive posts for this home video; Must have been left by crew members or people with something to do with this film. One of the worst 3 movies I have ever seen. hopefully the writers and director leave the business. not even talented enough to do commercials!!!!!","user":"pinsatiable","rank":[6,9]},{"title":"Weird,but interesting","rating":10,"date":"30 December 2007","review":"Although I found this flick not exactly in the horror or hip hop genre,the fact that it wasn't the typical fare you normally see for this kind of straight to DVD movie. Was it amazing? Not really. Was it weird and interesting? It sure was. Can I recommend it? Depends on the person,but it has a mind-game quality that I personally enjoy. Robert Oppel,who stars as Rapturious,isn't exactly the kind of personality you root for (he can act,but has a somewhat unlikeable persona)does well,as well as Debbie Rochon (who plays his manager),but the real star in my opinion is Rapturious' drug dealer Hoya Guerra (from the rock group Madball) He steals the scenes being an obnoxious,bugged out homey. Also,director Kamal Ahmed's demented visuals round out this interesting indie.","user":"xmachinex","rank":[5,8]}]