[{"title":"Excellent adult cinema","rating":9,"date":"12 August 2006","review":"This film was really impressive (I agree with everything localdj2001 said), and much better than I expected. I saw it at the Melbourne Film Festival to a capacity audience.<br><br>Some people cannot enjoy a film if they cannot feel for the characters. If so, this is not the film for you. The characters are all flawed, and not particularly likable (kudos to the director/actor for allowing himself and his wife to be portrayed in this manner).<br><br>We have a reasonable size established Turkish community in Melbourne. This film introduced me to a more modern view of the Turkish that we don't see here. Culturally, it was very interesting.<br><br>The film reeks with emotional honesty. It is mature, adult cinema. The story is somewhat cryptic as there are aspects of a collapsing relationship that are never revealed. But unfolding events reveal that everything is not what it seems. And real life is like this - we see something and think we know, but we only know the little glimpse we have seen.<br><br>What is said in this film is sparse but interesting. And what is not said is just as interesting. There are very long takes, some of which nothing much seems to happen. In others, there is much happening.<br><br>The title is very clever because it adds weight to the background of the film, which is the changing seasons. The cinematography was really stunning, especially at the end. Lighting was terrific. The film lingers long after the credits. <br><br>This is the first film I have seen by this director, but he is surely very accomplished. If very high quality, intelligent, artful European cinema is your taste, go see this.","user":"paulmartin-2","rank":[76,92]},{"title":"I'll largely remember Climates as the movie, it looks absolutely flat-out stunning","rating":10,"date":"10 October 2006","review":"Ceylan's previous feature, Distant, won the Grand Prix at the 2003 Cannes Film Festival; its glowing reception cemented his status as a major contemporary auteur. In Climates, Ceylan takes us to stunning locations all across Turkey in what may be his most personal film to date - in addition to directing and starring, he also wrote and edited. Filmed with his signature contemplative style, it is a highly subdued, deliberately-paced work that conveys more through silence than through exposition. The cinematography by Gökhan Tiryaki achieves a new high for high-definition video with its refined, poetic images, while Ceylan's precise, beautiful compositions give the film a characteristically elegiac tone. This achingly poignant film subtly captures the emotional tremors that ripple through a fallow relationship.","user":"chadonline","rank":[48,57]},{"title":"perfection","rating":9,"date":"13 October 2006","review":"I saw climates yesterday at the NY film festival.<br><br>Nuri Bilge Ceylan is a director who uses himself or his relatives to act in his own movies. In Climates he(Nuri Bilge Ceylan) and his real life wife (Ebru Ceylan) are the main characters and his mother and father are his real life parents as well. In his role, he is a professor at a university and his wife is in visual arts. During their trip in Kas which is a very hot place located in southern Turkey these two fall out and their conversations almost come to an end in this hot climate.This not sharing much leads up to the husband asking for their separation.As they got back the regret the husband feels takes him to find his wife with a crew she was working with in the beautiful but very cold and snowy city of Agri located in Eastern Turkey.The climate changes and so does their minds..<br><br>This movie is more of analyzing the relationships between people. His success comes from how he could reflect the depth of his characters and their emotions and minds with very little conversation.Nuri Bilge Ceylan's style is based on a strong plot. He focuses more on human relations with very little happening around them but more importantly what is happening inside of them and between them. I enjoyed every second of the movie with curiosity.I recommend this movie highly.","user":"ozgeeren","rank":[44,55]}]