[{"title":"I didn't see what was horrible about it, but it's certainly not that good","rating":5,"date":"17 May 2008","review":"Let me start off with the downsides of this movie. There was a lot of unbelievable material, and it got so out of hand at times that I really couldn't enjoy it for how ridiculous it was being. Some of the acting was poor, and I felt the actors and actresses really didn't care how they portrayed their characters, except maybe a few, and therefore they ended up being unlikable and ultimately forgettable. Most of the funny material wasn't funny at all, and I got super tired super fast with all of the lame jokes and mundane, black comedy antics. Not to mention it was predictable to the point where I wasn't enjoying any surprises.<br><br>Now, the actual upsides. I did laugh a few times, and it was because the material was actually humorous. No, it wasn't hysterically rolling on the floor laughing, but it got smiles and chuckles nonetheless. It managed to keep me entertained, and I was actually sucked into the story plot a little. I became interested because even though most every attribute about this film is average or poor, the plot truthfully seemed endearing to me, for some odd reason, and overall, while the movie is mediocre, and I certainly wouldn't watch it again, it's not terrible. I wouldn't recommend it, but you don't have to completely avoid it, per say. It was nothing special, but if you feel like watching it, be my guest.","user":"Dragoneyed363","rank":[29,37]},{"title":"Entertaining, Not Award Winning","rating":5,"date":"21 January 2008","review":"I really enjoyed this film for a number of reasons. I think Katt Williams is hilarious all by himself and was a great person to cast as choir director. I thought the plot was not as generic as most theft-based plots that hit Hollywood. I thought the transitions that happened as the film developed were fun to watch. Overall I thought the movie was really good.<br><br>If you are trying to decide whether or not you want to go see this movie, consider this as you make your decision. First, the film is stereotypical. The main characters live in and attend church in a run down community exposed to crime, drugs, and other stereotypical things you expect to find in a stereotypical community overrun with stereotypical people who are stereotypically Black or Hispanic. Second, the film is funny. Things that are funny to people who understand the complexities and realities of being Black will realize this; people who do not understand will find it challenging to find the comedy. Third, the film will not be an Oscar nominee. The movie was not so well shot, scripted, edited, or presented that you will see it up for major awards. That being said, a number of movies come out every day that are entertaining but are not award-winning and we watch them because we want to be entertained. This is another one of those films. So, if you want to be entertained, you understand the positive and negative inner workings of Black society, and you do not mind viewing a film that displays both stereotypes and truths about the way Black people live, move, and have their being, this movie is for you.","user":"LadyGotthelf","rank":[28,37]},{"title":"Shamelessly deeding stereotypes on screen!","rating":1,"date":"5 January 2008","review":"With scenes pumping off like in a TV show, this film exposes an urban community with an appeal that's worst off than the dirty red-light districts in some cities. The film blares with loud music that seeming competes with noise from the loud-mouthed characters. The Writer/Director brings out a Baltimore community, inhabited by either dysfunctional characters or low-based folks  gangsters, masseurs, street alcoholics, homeless folks, macho men who can't resist glaring at female bottoms, and those who fill their time in an overheated church where the choir director maneuvers around like a court jester and any one dressed like a manicured, fruity dude could be troublesome! Even the court room has the appeal of a noisy street market! Hhhmh, what a pathetic way to portray a community especially when it's so absurd to see Ice Cube's Durell  a man obviously with brains and talent  so easily becoming enticed to crime by his dysfunctional pal, LeeJohn, or having nothing better to do than be obsessed by a female's wriggling rear end.<br><br>Boy, aren't we getting rather bored with film after film that makes excuses for irresponsible bums who turn into gun-trotting robbers just because they are short of cash or are being hounded by ugly loan sharks? Boy, it's even more freakish to have to watch misfits turning over a new leaf by some lonely old church ladies with ogling eyes! Absolutely a lame movie without any witty humor, but with lots of unflattering stereotypical clichés to attempt at drawing out laughs and where events and characters flow and end at very predictable expectations. Yep, this film is simply overloaded with non-complimentary logic and ugly characterization of an urban community!","user":"janyeap","rank":[47,78]}]