[{"title":"An Engrossing but Macabre Portrait of Lots of Death in the Pretty Irish Countryside","rating":10,"date":"3 March 2006","review":"\"Six Shooter\" is the debut written/directed film by playwright Martin McDonagh and now I want to see more of his work.<br><br>This film is suffused with death, human and animal; we see or hear about intentional deaths - murder and suicide--, natural deaths --by illness or mysterious causes, accidental deaths, and maybe a few I missed in passing.<br><br>Each character deals with death in a different way, from the psychotic to tearful grief to quiet suffering to violent reactions, and the actors portray each fully.<br><br>While Brendan Gleeson is the central widower trying to make sense of all these observations of death for his own coping mechanisms, the film is stolen by a motormouth Rúaidhrí Conroy as the most annoying guy to ever be on public transport. He non-stop goes from cheerful to entertaining to manipulative to scary and beyond.<br><br>While it does go a bit over the top, the cinematography and settings always ground it in grim reality, with a brief excursion into magic realism.<br><br>The Irish scenery outside the railway car windows does look very pretty, in contrast to what's going on inside.<br><br>I viewed this film as part of a commercial screening of Oscar nominated shorts.","user":"noralee","rank":[33,41]},{"title":"Exquisitely told story","rating":10,"date":"10 August 2006","review":"As far as short films go, this is near the top of the list. McDonagh (formerly a playwright, here making his film debut) is a master craftsman, able to play several levels at the same time. \"Six Shooter\" is shocking, heartbreaking and very funny, often simultaneously. The story, in a nutshell, revolves around four people, each suffering a very recent death in their families. As they each deal with the loss in very different ways, they collide with each other, sometimes with words, sometimes with more.<br><br>The cast is uniformly excellent, especially Brendan Gleeson as the sad-eyed protagonist and Rúaidhrí Conroy as a ticking time-bomb of a kid. McDonagh's pitch-perfect writing - while not approaching the near-apocalyptic absurdity of plays like \"The Lieutenant of Inishmore\" - is appropriately bleak. His direction is also assured, showing him to be a filmmaker to watch in coming years.<br><br>\"Six Shooter\" is available on iTunes for two dollars. If you can, buy it. It's truly a great work of modern cinema.","user":"Cinema Buff","rank":[18,23]},{"title":"McDonagh's parody?","rating":7,"date":"7 March 2006","review":"McDonagh is a brilliant story teller and fully deserves his Tony nominations and his Olivier Award for Best Play (The Pillowman). His critics have questioned his use of casual cruelty as a dramatic device, although he always grounds violence in a social context or connects sadism to particular characters' proclivities. This film is beautifully acted by Brendon Gleeson and especially Rúaidhrí Conroy, sharply photographed, and well directed by McDonagh himself. For technique alone it is Oscar-worthy. But the whole piece strikes me as an absurdist joke with insufficient resonance. This is a mélange of destructions, an indulgence in violence that reduces and parodies McDonagh's better scripts.","user":"fowler-16","rank":[20,27]}]