[{"title":"Surprise! Gratuitous gore and nudity can be tiresome","rating":2,"date":"28 September 2009","review":"I really tried to give \"The Haunted World of El Superbeasto\" a chance.<br><br>Yes, it's a Rob Zombie movie- meaning that he casts his friends in an overlong music video for a song that has only overstayed its welcome on the classic rock airwaves by thirty years. Yes, it's animated by Spumco- meaning that no fungus-ridden toenail, no wax-encrusted ear canal, and CERTAINLY no booger-filled nostril would be denied a graphic close-up still.<br><br>But know that I hushed my wife every time she said \"NOT FUNNY.\" Know that memories of Spumco's groundbreaking \"Ren &amp; Stimpy\" remained fully entrenched in my mind through my movie. Know that the odyssey of the washed-up wrestler El Superbeasto and his sister Susie-X (Sheri Moon Zombie in a Mary Sue role) through the Haunted World holds so much promise and in its three years of development we all had every right to be excited. But golly gee whillikers; when I crossed The Film Director of No Restraint with The Animation Company of No Restraint. you know what I got...? Bored.<br><br>...sorry...<br><br>Look, shock gags are like betta fish- they do not mix well with others of their kind. When filming or drawing something provocative, it needs time to captivate. Enthrall. Repulse. Take root in the viewer's brain (watch \"Meet The Feebles\"- ah HAH; see the people near you cringing upon mention of that movie...? THAT'S how you shock someone!) In El Superbeasto however, there is so much breasts and blood and gore and breasts and blood and gore and breasts and blood and gore and breasts and blood and gore and breasts and blood and gore and breasts and blood and gore and breasts and blood and gore in the first FIVE MINUTES that it's like the aforementioned bettas in the same bowl- they've immediately rendered each other to shreds, and all we're left to watch is a bowl of lifeless mud. And no amount of Nazi zombies can resuscitate that.<br><br>And- for a world inhabited by every movie and fiction monster out there- the movie can be stunningly predictable. If you can't figure out for yourself why the Bride of Frankenstein is coming to climax while sitting in a haunted lagoon, look out- you're clearly a one-celled organism and there's an amoeba waiting to engulf you.<br><br>That's not so say that \"El Superbeasto\" is unwatchable. Some of the songs are genuinely enjoyable. Most of the jokes come from Dr. Satan and his gorilla Otto (ripped from \"George Of The Jungle\", but hell that's always funny) and their interaction with Velvet Von Black. Granted, that could be because El Superbeasto himself is the most detestable protagonist I've seen in a long time- over-the-topness be damned. I'm trying to imagine Zombie writing him up, and saying to himself \"Now THIS is a guy I can spend four hours alone on a car trip with!\" I'm failing.<br><br>I also take offense to Zombie's ubiquitous nods to the classic horror and exploitation films of the past because I truly believe that they're lacking in respect. Tura Satana reprises her role as \"Faster, Pussycat! Kill!! Kill!!!\"'s lethal lady Varla long enough for Susie-X to slam a door in her face. Zombie's beloved \"Phantom Creep\" robot has a major role as Susie's sidekick, but he's a horndog who transforms into a crab-walk-like car that Susie drives by lying belly-down upon, and shifting a single lever between his legs. (...Get it? Bela Lugosi does. And he's underground right now crying.) <br><br>Other references include Michael Myers is struck by a car as he crosses the street- which of course stands as a great metaphor for what Zombie did to the \"Halloween\" remake. Worst of all, the ending to \"Carrie\" is ripped off and accompanied by a song decrying Zombie for ripping off \"Carrie\". No wait- that may be squaresies with how many times Otis Firefly and Captain Spaulding appear in this film. And then when El Superbeasto grabs a mic and bursts into Loverboy's \"Piece of My Heart\"... ooh, we have a triple tie.<br><br>...I think that if The Haunted World of El Superbeasto was more in form with \"Dr. Horrible's Sing-Along Blog\", it'd be much more enjoyable. Now I didn't really care for Dr. Horrible, but the \"villains\" received much more screen time than the \"heroes\", so I can understand its appeal. Come to think of it, that was what I liked about Zombie's own \"House of 1,000 Corpses\", so why couldn't lightning have struck twice...? Instead, Rob Zombie's first animated opus is kind of like an \"Austin Powers\" movie. Only Austin has been replaced with Andrew \"Dice\" Clay. And Dr. Evil and Mini-Me are holding out for more money.<br><br>...Finally, here's an aside to all the other commenters mentioning \"El Superbeasto\" in the same breath as Ralph Bakshi's \"Fritz The Cat\": Please go SEE \"Fritz\". Immediately. This way you can go back and edit your \"Superbeasto\" IMDb entries with a sincere apology explaining how foolish you were to compare Bakshi's razor-sharp dissection of '60's college life and pop philosophy with Zombie's non-stop potty humor. Some of you, within ten minutes of watching \"Fritz\", may realize how freaking wrong you were and cannot wait until after the closing credits to amend your original text. You are quite permitted to pause the film.<br><br>In other words, \"The Haunted World of El Superbeasto\" and \"Fritz The Cat\" are animated films with adult ratings- That's their ONLY similarity! END OF!!","user":"the-gil-monster","rank":[28,37]},{"title":"An odd, weird, and mediocre animated film","rating":6,"date":"2 May 2011","review":"Rob Zombie has been known for doing many heavy metal songs and directing horror movies like, \"House of 100 Corpses\" and \"The Devil's Reject's\". But in 2009, he released a direct-to-video animated film based on the comic book made by him. The animated film was called, \"The Haunted World of El Superbeasto\".<br><br>I like the film's animation. It's Spongebob Squarepants meet's Ralph Bakshi. The film also has some nice voice acting from Tom Papa, Sheri Moon Zombie, and Paul Giamatti as the villain.<br><br>The problem's with this film is that sometime's the movie can be boring and some of the funny moment's in the movie can be pretty lame.<br><br>The Haunted World of El Superbeasto, is not a bad movie, but it's going to depend what you're into. If you're a Rob Zombie fan or someone looking for a mindless movie to watch, then this movie is for you. If you're someone that take's animated films seriously, then this movie is not for you.","user":"Criticman12","rank":[10,12]},{"title":"Love it or Hate it! Inappropriately funny!","rating":7,"date":"25 September 2009","review":"Watching this movie I did nothing but laugh, though I knew it was wrong to laugh at zombie Nazi's getting their heads sliced off by a hot animated busty-blonde-chick with an eye patch, I just couldn't help it. The movie was stylish, funny, and careless, with a \"So what?\" Attitude.<br><br>This movie will either leave you in disgust, or laughing until your lungs bleed. Personally for me, this movie was a love, as I can only speak for myself I can't say you'll like it, but if you think you'll like it, then you'll probably love it. If you like immature and comically brutal cartoons, with sex drive and bad-mouth language, then you'll love this!","user":"mrjoeobrien","rank":[25,38]}]