[{"title":"Insightful & Important","rating":21,"date":"21 February 2005","review":"Deep Throat changed America. It legitimized porn, creating a billion dollar industry in the process, and sent the sexual revolution to dizzying heights. Love it or hate it, Deep Throat was an historical event.<br><br>Inside Deep Throat looks back at that amazing phenomenon, it's causes and effects, and how it changed America and the lives of those who made it.<br><br>Interviews with Throat director Gerard Damiano &amp; male lead Harry Reems give much insight into the porn biz of those bygone days, a dark world of sex &amp; drug addiction, fly by night productions, and mafia money men. Sexperts Erica Jong, Dr. Ruth &amp; Helen Gurley Brown offer their takes on how society reacted to and was affected by this new sexual openness, while 70s porn queens Georgina Spelvin &amp; Andrea True offer quick sound bites that explain what drew people to the business.<br><br>The film covers many bases &amp; covers them well. We see the hypocrisy of Jesus-inspired DAs, who waste millions of taxpayer dollars on frivolous prosecutions of actors, theater managers, and anyone else they see as an easy target in their crusade to \"clean up America\".<br><br>Censorship and free speech issues are discussed by the likes of Norman Mailer, John Waters, Dick Cavett and others, while Gloria Steinen &amp; Susan Brownmiller offer their views on how porn degrades women. Both sides are eloquent and make valid points.<br><br>We see the tragedy of Linda Lovelace's wasted life. Unable to escape the stigma of being the film's star, she joined forces with the Women's Movement in denouncing porn. Shortly before her death in a traffic accident, Lovelace briefly returned to the biz because she was flat broke.<br><br>Inside Deep Throat is a brilliant film. It takes a time, place and event, a cultural phenomenon of it's day, and puts it under a microscope. Future generations may look at Deep Throat the film and wonder what the big deal was.<br><br>Inside Deep Throat explains it all to them.","user":"davidbeecher1956","rank":[48,55]},{"title":"If you aren't offended by porn, you'll really like this movie","rating":7,"date":"28 April 2005","review":"All I can say is wow, this was a great documentary. Because of the subject matter it isn't for everyone, and the fact that it has an actual X-rated scene in it doesn't help either. But if you can get past that, this is an insightful, fascinating look at adult films and our society. And there is a lot of humor in it as well. I wasn't surprised that several people in the audience walked out, since even I didn't realize how graphic the language/visuals would be. Showing how Deepthroat brought the \"BJ\" into the mainstream of adult films was interesting, and the interviews with the people actually making porn were very insightful.","user":"J_Wal","rank":[22,27]},{"title":"The Boogymen of her time are still with us.","rating":10,"date":"17 November 2005","review":"I was impressed with this marvelous doco after watching it yesterday and unlike Dick Cavett I remember watching the film in the heady days of the 70s in San Francisco-perhaps not as brave and revolutionary as watching it in Oklahoma City but a political statement none the less.<br><br>My thoughts about the film are coloured by this historical connection but that in no way diminishes the strengths of the film. After all these years to see the players in the flesh talking about such a phenomenon made for an enjoyable morning of film watching. You cannot view the film without seething anger at the religious conservatives that made virtually all the player's lives far more difficult than those lives should have been.<br><br>If there was a villain in the movie it would have been the Tennesee prosecutor who doubled as a lay preacher when he wasn't trying to make America into his own little brand of religious conservatism. Their kind of dead-head sociology and politics is still rampant in the States and the only difference is they've changed their target from sex to terrorism-or at least their definition of political terrorism.<br><br>The directors, Bailey and Barbato, have crafted a superb film inter-cutting old film clips with current interviews in order to create an excellent vision of all the threads between the personalities and opinions of the players. The hilarity of these characters come through when they speak with a forthrightness that generally ends up on the cutting room floor.<br><br>If you are an old guy like me-see the film for its historical look at a time that we can remember. If you are a young person interested in politics, look at the film to see the nature of the bad guys around us now but with new crusades to fight.","user":"diane-34","rank":[19,23]}]