[{"title":"Common war movie, but still somehow unique","rating":8,"date":"10 May 2006","review":"Yes, we have all seen a lot of those movies that focus on soldiers in the battle, their bravery, weaknesses, breakdowns etc. Those films are always end up in a way that let's us know once again, how pointless is war and how it has its impact to every single life separately. This movie is not an exception in overall point of view. It has quite a same morale.<br><br>But few things make it still unique and are the reason to rate it a bit higher than just average.<br><br>At first reality. Not historically, but people in the movie are much more real than in Hollywood movie. It seems that only Russian actors can let the public see the soul of Russian people and soldiers. I'm not Russian myself, but I've met a lot of them and this is just the unique thing they call \"Russkaja dusha\" (Russian soul). Russians have very hot temper, they can blaze up in a second and start the fight, but they never let it damage their friendship.<br><br>Second dose of realism: people in war. I mean especially Dygalo was a very realistic character. When I was serving my time in Estonian army I met an officer who was also veteran of Afganistan war. And believe me, he was quite a copy of Dygalo. It is hard to understand, how real war experience could leave such a trace in human mind, but now when I saw Praporshik Dygalo in that movie, I noticed a huge similarity between Dygalo and that officer and I instantly understood that this is the real thing, this is exactly how war affected those soldiers. And the fact this film has managed to take it to public so real, gives it a great bonus.<br><br>And last, but not least: Russian language in a movie that also really sounds as Russian language. I'm always laughing about the episodes in Hollywood movies that should include Russian army or characters and I have to say that Russian language in Hollywood movies is more than ridiculous, therefore I'm quite happy that this film was made in Russian. By the way, Russian is considered to have the most developed vocabulary in swearing and as this is war movie and those guys are pretty rough as well, it sounds much better and more real in Russian. Translation usually manages to lost at least half of the meaning.<br><br>In conclusion: yes, I would recommend this movie to everybody. Although it shares the same morale than other war movies, it's still somehow unique and especially Americans could take a look and compare it to Hollywood stuff.","user":"draax","rank":[164,179]},{"title":"10 rota","rating":10,"date":"18 July 2006","review":"I really expected to see some stupid clone movie and watched it 6 months after buying because nothing else was to see.<br><br>Darn this one rocks, I laughed, understood situations and it really nicely messed some things together like you were fighting there yourself. At the beginning I was thinking Full Metal Jacket, somehow it was pretty much alike.<br><br>I have seen so many bad and boring war movies, this isn't one of them. Excellent is my opinion.<br><br>Anyway I haven't seen any other Russian war movie and I like Russian movies... <br><br>Really worth of watching if you like war movies even a bit.","user":"nexus-37","rank":[90,116]},{"title":"One of the best war film since PLATOON !!!","rating":9,"date":"8 February 2006","review":"I am big fan of war films, specially from Vietnam and WWII. Afghanistan was taboo in Russia for long time, therefore I was very impatient to see 9th company and because of Bondarchuk, that is the name.<br><br>I was really surprised about this film. Perfect acting, spectacular special effects, costumes and different point of view on war. All of these made this film superlative. And something more. I felt something strange after the end of this film. It was mix of feelings like anger, sympathy and sorrow.<br><br>9th company is impressive successor of famous Russian war films and Fyodor is brilliant follower of his father Sergey. Is nice to see excellent masterpiece from different, like American production.<br><br>God bless Bondarchuk !","user":"rado-15","rank":[59,75]}]