[{"title":"Dances all over Happy Feet!","rating":8,"date":"15 August 2007","review":"What is it with this sudden surge of penguin movies appearing? Or penguins appearing in movies? I've always found watching penguins on real life TV programmes to be very entertaining because they just seem, well there's no other word for it, cute. But just recently Hollywood has seemed to start to overuse them a tiny bit. March of the Penguins I suppose really kicked it all off. I can't see what all the fuss was about that documentary and quite why it was the success it was. But it was an interesting movie. Then came along Madagascar, while admittedly not completely about penguins the penguins that did feature were undoubtedly the best things in the entire movie. Since then penguin items, TV shows and penguins on our screens have been appearing like crazy. It reached its pinnacle in my eyes last year when Happy Feet arrived on our big screens. Now I really wanted to love Happy Feet, when I first watched it I actually did adore it. But after multiple viewings I realised something, it was actually pretty boring, and way too depressing at times for my liking. Its animations was beautiful, but it just didn't live up to its potential. When the first trailers for Surf's Up arrived I didn't know what to make of it. Dancing penguins is one things, surfing penguins is just plain ludicrous. I felt like Sony were merely cashing in on this penguin phenomenon. So what a pleasant surprise to find that Surf's Up is not only a movie that'll appeal to both kids and adults, but also the best animated movie of the year so far! The fact that its a surfing penguin movie didn't make it as good as it is, no the movie succeeds for daring to try something different. A mockumentary style movie somewhat reminiscent of Creature Comforts, trust me if you like Creature Comforts you will adore this movie. The script is well written, the voice cast absolutely brilliant, hell even the animation surprised me for being very well done. If it has one fault its that its obligatory sentimental streak felt a little bit too forced for my liking. Nevertheless this is a small fault in an otherwise enjoyable and very well made animated movie.<br><br>The voice cast of the movie are particularly brilliant. Shia Labeouf leads the cast as surfer wannabe Cody. Labeouf was until recently one of the few actors I could not stand to see on a screen. My past experiences with him on movies were usually films that cast him as the annoying kid. For this reason I couldn't stand him. However, then he starred in Transformers and changed my mind completely. He is actually a great actor, he can deliver a joke easily, he's easily likable and he just does everything in such a great way. This shines through again with his performance here, and because of his work in this movie I would be quite happy to see him lead another animated movie some time in the future. His character is always funny, he definitely gets some of the best lines and moments in the movie. Jeff Bridges is pretty good in his role, he works best in the funny moments of the films, when it comes to the sentimental stuff I just found his voice work to be not as good. Jon Heder almost runs off with the movie as Chicken Joe, who got the biggest laugh from the audience. Zooey Deschanel was average I suppose, her character deals more with the icky stuff towards the end than the great comedy stuff. James Woods seems to be having a great time as Reggie, he also gets some great comedy moments.<br><br>The actual comedy side of Surf's Up is perhaps the movie greatest success. The mockumentary style allows us to see a different way of making animated movies. The movie of course has to switch to a more movie-ish feel at some points, its in these moments the movie isn't at its best. Whenever they're doing the documentary style the movie is as perfect as you could hope for. Meeting Cody's family at the beginning is pretty hilarious, and meeting all the other supporting characters, especially Tank who has the best scene of the movie with his trophies, is definitely the movies highlights. If you are planning to see this I highly suggest you watch the characters in the background more so than the characters in the foreground, they made me laugh all the time to see them waving at the camera or pulling faces behind the other characters backs. Chicken Joe is definitely best comically, the best scene with him involves a hot tub and the natives, its pretty hilarious, a shame most of the joke is ruined in the trailers.<br><br>So what are the negatives of the movie then? Well I suppose if I look at this from a kids point of view then I realise that there are a lot of jokes that might leave the kids a bit cold. The kids will still be entertained for the majority of the movie, especially during the very cool looking surfing sequences, but some of the humour is more directly aimed at adults than anyone else. Also the sentimentality factor obviously starts to kick in towards the end. While its never sickly like a lot of other animated movies are, it still feels a tad forced. I wish for once we could have a kids movie without all the obligatory kiss and make up feel at the end of it. Why can't everyone just still hate each other or something like that? Anyway the sentimentality never makes the film bad at all, its still a great movie.","user":"simonparker1990","rank":[20,20]},{"title":"I loved this movie!","rating":9,"date":"9 June 2007","review":"As an old surfer, and a lover of penguins, I was totally PUMPED for this movie! So I went out to see it last night, and I laughed several times. One of the most awesome things to me, was how Big Z encompassed the ideal of just having fun and letting everything go while you surf. You've got to watch it to see that, but really, this movie is spectacular. The animation is great, the characters develop nicely, and the \"documentary\" format adds to the humor aspect of it. <br><br>I don't know about the comparisons to Happy Feet, but it seems rather weird to get all upset because there's another penguin movie out on the market. Bottom line, for me, is that this movie was very fun to watch, and I thought it had some classic bits of humor. It may be a bit too much for some younger kids, but it was great for me. I loved this movie!","user":"remanifest","rank":[88,107]},{"title":"A Nutshell Review: Surf's Up","rating":8,"date":"16 June 2007","review":"It's easy to roll your eyes when you see yet another animated movie starring talking animals, and what more, talking penguins. Guess you can credit the popularity of our feathered friends from down south to award winning films like the documentary which started it all, March of the Penguins, and the other animated movies Madagascar (where they were scene stealers) and Happy Feet. But before you actually decide to pass on this one, Surf's Up a surprisingly refreshing tale set in the bright sunny beaches with laid back \"dude\" attitude, which doesn't seem to try too hard to please, and comes up just about right.<br><br>One of the good things about the movie is the voice talent featured. Like Happy Feet, it contains some recognizable names, but just as a reminder to our Legend of the Sea friends, big names doesn't necessarily equate to good voice acting. Shia LeBeouf (a name which we will see quite frequently over the next few months with Transformers and Disturbia) gets the lead role of Cody Maverick, a surfer penguin wannabe who dreams of making it big in the surfing community. His idol is Big Z (Jeff Bridges), a world champion who had made an impression on a young Cody. However, Big Z is presumed missing in action during one competition, and the new world champion, Tank Evans (Diedrich Bader) looks set to retain his status for the umpteenth time.<br><br>The supporting characters too are a delight, with Zooey Deschanel as a Baywatch lifeguard babe and James Woods as a sports tzar, and Jon Heder continues his stereotype by playing Cody's new best friend Chicken Joe, a chilled out surfing chicken who finds himself at probably the wrong place each time and associating with the wrong species.<br><br>What made this movie work is that the filmmakers recognize they have to come up with a narrative style that is different in order to engage, and given that it's a sports type movie, they went for a sports entertainment channel style, complete with replicating camera techniques including details like less than perfect wireless camera transmissions (love those on-board cameras, nevermind if it doesn't make complete sense or is illogical), over the top channel transition sequences, and you just gotta love those faux pas interviews with just about every character. If you can't get enough of baby penguins, the filmmakers too are shrewd enough to include these crowd favourite characters in endearing scenes.<br><br>With Father's Day mood all round, this movie is apt too for the season, given its theme of family, and bonding with (surrogate) father types. The humour injected ranges wide, from subtle lines and references, to the more obvious physical slapstick moments. I can't resist but to again advise our Legend of the Sea friends, this is what computer animation is about, with its depiction of photo realistic quality of the sun, sand and the sea, with realistic surfer moves, a simple story yet packed with adequate thematic moments, with song and music that don't irritate, but serve to move the narrative along smartly.<br><br>Recommended animated movie, despite the overused penguin characters. Stay until after the end credits for a short scene (there's also one played during the credits, so don't walk out of the hall just yet).","user":"DICK STEEL","rank":[47,56]}]