[{"title":"A Nutshell Review: Firewall","rating":6,"date":"15 April 2006","review":"I was quite surprised that Massive Attack's Angel was chosen to accompany the opening credits, which consisted for mostly CCTV / voyeuristic shots of a team conducting surveillance on the movements of Harrison Ford's Jack Stanfield and his family. I know it's a cool track, but Angel is perhaps becoming one of the more overused tracks in Hollywood pictures already.<br><br>But it hints well at what Firewall is going to become. Cliché and overused sequences which will probably make you scream \"haven't I seen this somewhere before\"? Firewall offered nothing very new in terms of plot outline, as it contains modified scenes from even Ford's own works like Air Force One (the family's survival being threatened, and it's up to one man to save the day) and The Fugitive (the frame up and one man's run from the law). Ford has already become comfortable in the role of an all-American one man hero, that this role offered no surprises at all.<br><br>It's basically standard fare with the usual chases and action fight sequences. Stansfield is a VP of (network) security of a bank, and has designed the bank's software, with other operational duties like making sure the bank can respond to external online threats. However, as the saying goes, almost 80% of intrusion are committed knowingly or unknowingly from the inside, and with a head honcho part of the act, you can be sure that he has the know-how to siphon out cash if he wants to.<br><br>In comes Bill Cox (Paul Bettany), scheming con man, who with his team of merry men, take Stanfield's family hostage and lapses into the usual psycho-mumbo-jumbo routine. With the family's antics at escaping, you really wonder if Cox, as a villain, has what it takes to call the shots in a hostage situation. While he might have the upper hand, it's his weakness in being ruthless to the hostages that proved his downfall, and make him a very weak cinematic villain. Here's someone who would rather shoot at his own men than to teach them hostages a lesson. Probably he has this noble subscription to \"women and children first\". And it doesn't help when there's the usual good guy amongst his merry men who offers the family sympathy points.<br><br>Word of caution though, for those who might think that this film offers some cool technology on screen. Leave the techno-babble at the door, there's no \"firewall\" to hack into in the first place, and the \"hacking\" is actually a no-brainer. And unless the USA offers wireless internet access like everywhere, it's pretty incredible with what a laptop can do in the movie.<br><br>It has your expected twists and seemingly smart moments, but nothing that will truly make you go \"wow\". The fist fight choreography can get pretty intense, however, there's no need to reach the end of the road before you know who's gonna emerge tops. It isn't exactly a bad movie, but one which doesn't even have a single sequence that can redeem this picture from really bad mediocrity.","user":"DICK STEEL","rank":[85,114]},{"title":"Was good the first and second time I saw it... when it was called \"Patriot Games\" and \"The Fugitive\"","rating":4,"date":"6 March 2006","review":"Take a gray-haired Harrison Ford, place him in a business suit and then have him fight someone conveniently wearing all black, and you'd swear you were watching any number of movies from the last fifteen years. Name Ford's character Jack, and you'd think that would narrow it down to a good one. Then again you could just be suckered into seeing \"Firewall\" which borrows and doesn't add from the Ford post-Jones collection.<br><br>In a play-it-safe campaign to show the world that he isn't too old, Harrison Ford is pushed into \"Firewall\". It's been fourteen years since, \"Patriot Games\", in which Ford played a man that seemed over the hill then, and here he is today in the same situations. To jog your memory, Ford has been making a living playing essentially the same character in similar situations for years, thanks to the aforementioned \"Patriot Games\", \"The Fugitive\", and \"Air Force One\".<br><br>\"Firewall\", directed by Richard Loncraine, concerns the tale of Jack Stanfield, played by Harrison Ford, being forced through the methods of Bill Cox (Paul Bettany), into electronically stealing from the bank he keeps hackers out of on a daily basis. Cox has a bargaining chip, the Stanfield family. Eventually Cox and his team baby-sit the hostages and circumvent there own success. Jack then hunts them down, and none of this comes as a surprise due to the formulaic structure of the picture.<br><br>Some may find \"Firewall\" a difficult film to dislike because it plays all the clichés. It isn't artistic but rather commercial film-making. Borrowing from every film mentioned above, it uses elements from what worked and safely combines them in a coherent, yet unexciting manner. The action scenes don't come till the end of the picture, and those five minutes offer little more than stunt work put on by actors half Ford's age. This is a vehicle for Ford and as the audience we are supposed to subconsciously see this as a practice run at a fourth Indiana Jones film. With such blatant disregard for a plot and even unique action, you can view this movie as the precursor to \"Indiana Jones and the Gated Community\".<br><br>There is an element that seems realistic and that is the acceptable number of henchmen who are employed by the leader. If they are trying to steal money, then having less people to divvy up the bounty would result in a greater payday. Cox has a modest four men working with him. Unfortunate for both him and the viewer, their lack of common sense is staggering. For example, the family dog Rusty, plays a prominent role when the bumbling fools take him hostage. There should be a logical reason for taking Rusty. With his family already held captive in an unknown locale; I'm sure Jack Stanfield was ready to walk away from them and start a new life. But wait, Rusty is missing too, now I have to comply with their demands. This ultimately destroys the credibility of the screenplay.<br><br>Performances in the film are convincing. Virginia Madsen is good as the relaxed wife considering the situation her character is put through. My favorite role was of Paul Bettany as a sometimes caring villain that flips a mean pancake. Despite this, director Richard Loncraine has crafted a film that is best described as what a computer would spit out if the command was: thriller. Everything functions to drive the story on its merry way. Lacking character nuances, rich emotions, and beautiful scenery is OK for a suspense film about robbing a bank. Where \"Firewall\" betrays the genre is in not providing twists, originality, or an intriguing story.","user":"Legendary_Badass","rank":[168,235]},{"title":"One Too Many Of These Kind Of Roles For Ford","rating":5,"date":"15 January 2007","review":"Harrison Ford seems to be a guy who likes to play these kind of everydayman-superhero characters. Sometimes they are really good, entertaining films and sometimes they are insultingly stupid. This is case of the latter.<br><br>In a nutshell, \"Jack Stanfield\" (Ford), a bank executive, and his family are held hostage by \"Bill Cox\" (Paul Bettany) and his group of thugs. They demand he rob $100 million out of accounts through computer hacking, which only he could successfully accomplish.<br><br>Along the way we get a number of Hollywood clichés, such as 1 - Ford turning into Rambo-Superman and not only outwitting everyone involved but beating up most of the crooks; 2 - An ending where he does fight the main bad guy who is half his age, takes a beating that would render a human being unconscious at least six times bur Ford keeps going until he wins; 3 - the usual obnoxious kids including a 12-year-old boy who is not the least bit scared, which is ludicrous; 4 - the crooks not killing any of the family, even the dog - which they take with them and is instrumental in saving the family! Yes, these criminals only shoot themselves, never their opponents!! Are you kidding? I could go on with 5, 6, 7, 8, etc., but suffice to say, there are just too many holes in here to make this anything but a film you shake your head at as being ridiculous. <br><br>It's almost as believable as playing the President of the U.S. and totally disarming a group of terrorists on an airplane by yourself! Oops, Harrison's been there-done that, too.<br><br>In the end - a film that starts out promising but gets dumb and dumber as it goes along.","user":"ccthemovieman-1","rank":[26,34]}]