[{"title":"brilliance took two decades to arrive","rating":10,"date":"6 November 2005","review":"before i start, i would like to say this. i can read, have read the book, and i read the title of the movie before watching, as should you all. quite disappointed in all the pompous idiots filled with prejudice about the movie.<br><br>I know that another version of the well-mined Jane Austen classic would need to be brilliant indeed. Such diverse and beautifully written characters and such a delightful plot, so deeply rooted in a profound understanding of human nature, are timelessly attractive to directors, actors and audiences alike. So give them a break. you couldn't do any better.<br><br>Lets start with Mr Darcy. Darcys embodied by Olivier, Firth and now Matthew McFadyen bring differently significance to enjoy in the proud and socially awkward leading male role. Where Olivier and Firth gave us an aloof, arrogant Darcy encased rigidly in a shell so impenetrable it was almost impossible to believe he had been moved by Lizzie's sardonic criticisms or attracted by her spirited independence, McFadyen shows a more accessible Darcy. He's vulnerable, even fragile behind his stiff manners. His aloofness is more believably from social inadequacy than arrogance, yet he is believably constrained by his social standing to regard decorum, fortune and propriety in a wife's family as significant in his choice of a bride. His capitulation to Lizzie is therefore more believable.<br><br>Similarly Garson, Ehle and Keira Knightley illustrate the lively intelligence, sharp-minded wit and wry humour of Elizabeth Bennet in equally shining ways that nevertheless bring out different aspects of the character. Keira Knightly's performance as Elizabeth Bennett is by far her best, as she sparkles in this role.<br><br>The two have a chemistry that i had yet to see on the big or small screen - one that mirrors real life romances. the dislike on both accounts is obvious, watching it grow to love was beautiful and stunning. the love story is heart-felt and sweetly, deeply affecting to a level that modern romantic comedies rarely achieve. I found this movie to be a a richly photographed, memorable ensemble production in which the romance is predominant over the drama but does not eclipse it. though my one disappointment - the ending?! of course i wanted to see them kiss, who didn't? but the shots of them arguing in the rain, and as they draw close with the sunlight shining between them was breathtaking.<br><br>Giving due significance to the rural environment which plays such an important part in the story, the cinematography captures wide frames of soft, misty fields, copses and winding country roads as an environment which underscores the gentle manners and passionately beating hearts beneath empire gowns and ruffled shirts. The surroundings both detract from the humans and function as appropriately natural settings for the dramas of human nature.<br><br>Keira Knightley's swan-like Elizabeth moves with energy and grace, hotly opinionated and profoundly moved by principles and prejudices, and magnetically drawn by the seeming arrogance, reticence and gallant behaviour, finally revealed, of Mr Darcy. For two centuries Elizabeth Bennet has been a heroine much admired for her self-contained independence within a culture more conditioned to female submissiveness. Knightley's portrayal is true to the original.<br><br>All in all, i must give this movie 5 stars, 10 out of 10, 100 % brilliance. The story itself, the characters, the actors, everything that was in the movie 'bewitched me body and soul'. i have never been more moved by a movie, especially not one where i found it to be as hilarious as it was moving.","user":"kristen87","rank":[267,356]},{"title":"Spirited Modern Interpretation of Austen's Classic Love Story","rating":9,"date":"4 October 2005","review":"A \"modernised\" version of Jane Austen's classic novel that should not be compared unfavourably with 1940 Hollywood Olivier / Garson version nor several BBC serials culminating in the most acclaimed TV series version from 1995 with Colin Firth &amp; Jennifer Ehle-a personal favourite. <br><br>This 2005 film clocks in 127 minutes (UK / Europe)&amp; 135 minutes (USA &amp; Canada) -the extended version allowing audiences to share more of the timeless love story with the main characters -Elizabeth Bennet &amp; Mr Darcy. <br><br>Director Joe Wright plus his screenwriters ( Oscar winner Emma Thompson contributed to the final screenplay) have chosen to emphasise Elizabeth Bennet / Mr Darcy plus Jane Bennet/ Mr Bingley story lines &amp; reduce Mr Wickman, Charlotte &amp; Mr Collins to supporting characters.<br><br>Austen's famous wit,satire &amp; humour that forms the basis for her enduring appeal (Pride &amp; Prejudice was finally published in 1813 &amp; continues as an annual bestseller)is sidelined to open up this version as more emotional drama for modern audiences.<br><br>If you are open to a newer interpretation, can avoid comparisons to the nearly 5 hour 1995 TV version which allowed for greater depth &amp; detail in telling all the characters story lines &amp; accept some of the new film's rushed story lines-you are in for a treat .....<br><br>New British star Keira Knightley (Elizabeth Bennet))excels in her first real leading actress role ably supported by fellow Brit Rosamund Pike (Jane Bennet) as the sisters supportive of each other's &amp; their Bennett family problems.Knightley at 20 is the right age for her character,this allows Elizabeth's girlish personality plus her character's pride, misjudgements &amp; loving nature to shine through....<br><br>Great star turns from Brenda Blethyn as their mother Mrs Bennet plus Oscar winner Judi Dench as fearsome Lady De Bourgh (Mr Darcy's aunt)add depth to this film version.Claudie Blakley as Elizabeths's wise friend Charlotte Lucas &amp; Simon Wood's amusing Mr Bingley are delightful supporting performers. <br><br>One major surprise is Canadian actor Donald Sutherland's touching performance as Mr Bennet -capturing both the humour of living in an all female household &amp; five daughters to look after with the poignancy of seeing his eldest children's difficult relationships develop -easily his best acting performance in years. <br><br>In the difficult role of Mr Darcy rising British star Matthew Macfadyen (BBC's Spy series Spooks &amp; Award winning New Zealand film \"In My Father's Den\" rises to the occasion.With the short running time, there is not enough time to allow Darcy's repressed &amp; prejudiced personality to be fully represented -Macfadyen perfectly displays Darcy's social &amp; class problems, his unfortunate attempts at gaining Eliabeth Bennet's interest &amp; his painful adjustments to achieve their personal love story.Macfayden &amp; Knightley's objectionable first dance,their embarrassingly moving Collins House meeting,the unexpected Pemberley encounter plus their two proposal scenes are highlights of this film. <br><br>Engaging acting performances with wondrous film photography,film locations at some of United Kingdom's most famous stately homes, marvellous film sets &amp; costumes plus one of 2005's best original music scores add greatly to this new film version. <br><br>All in all one of the better films of 2005 -not perfect film making and not intended to be as subtle as Austen's novel -but a wonderful surprise with some changes to present a modern version of Pride &amp; Prejudice for current audiences -do see this film as &amp; when it is released worldwide....<br><br>And after seeing the film or re-visiting 1995 BBC TV series -read the original novel for its classic storyline, memorable characters &amp; Austen's brilliant writing style,wit &amp; humour.....<br><br>9 Out Of 10 for this different interpretation of an enduring classic","user":"Peter-Adamson","rank":[362,499]},{"title":"Jane Austen for ever","rating":10,"date":"17 November 2005","review":"Jane Austen's tale of love and economics reaches us once more with the energy of a thorough novelty. \"Pride and Prejudice\" has been a favorite novel of mine since I first read it and I've seen Laurence Olivier and Greer Garson, Colin Firth and Jennifer Ehle and now Matthew MacFadyen and Kiera Knightly. Amazingly enough I've never been disappointed. The material seems to be full proof. Colin Firth's Darcy, in many ways, is the Darcy I've always imagined. He's been an actor I've followed feverishly since his glorious Adrian LeDuc in \"Apartment Zero\", Matthew MacFadyen was totally new to me but he managed to create that sense of longing that makes that final pay off so satisfying. Kiera Knightly is a ravishing revelation. I must confess, I didn't remotely imagined that she was capable of the powerful range she brilliantly shows here. The other big surprise is Joe Wright, the director, in his feature film debut which is more than promising, it's extraordinary. The photography, the art direction and the spectacular supporting cast, in particular Donald Sutherland and Brenda Blethyn, makes this new version of a perennial classic a memorable evening at the movies","user":"katiemeyer1979","rank":[402,560]}]