[{"title":"Surprisingly Solid Portrayal of General Eisenhower","rating":17,"date":"17 September 2004","review":"Before I saw this film I'd never have thought Tom Selleck's body type or acting skill were remotely apt for him to portray General Eisenhower. But Selleck pulls off the role admirably: this is the best playing of a role I've seen him manage. Kudos, Mr. Selleck - you made me forget you were Tom Selleck and had me, from the get-go, believing you were General Eisenhower.<br><br>The film isn't about the war, the SHAEF staff, or even the invasion itself: it's about Ike's superb organizing and planning brain and his ability, unique in history, to manage what was, to that date, the most unwieldy and potentially fractious warfare coalition ever to have joined hands as allies. Selleck and writer Chetwyn tell quite well how Eisenhower dealt with the frustrations and burden of his critical command.<br><br>Sure there are bits of created dialogue not to be found in the historical record and compressions of events and characters necessitated by the limits of cinematic storytelling, but on the whole this is a worthy film that achieves exactly what it set out to do: tell about Ike's grasp of the task set before him and his unparalleled aplomb in carrying it off.<br><br>The only egregious gaffe in the writing was the line spoken by Group Captain Stagg in which he tells Ike and the senior SHAEF staff that the low pressure storm systems, which boded ill for the launch of the invasion, depended on how much they'd be propelled by the jetstream. In 1944 the jetstream had not been discovered. Some prewar and wartime high altitude fliers had experience of the jetstream's effects, but meteorology had not yet identified the jetstream by name, or learned of its constant presence as prime determinor of weather aloft or at ground level. (If you think me wrong about this, see the PBS 'NOVA' episode about the late-1940's crash of an Avro Lancastrian airliner in the Andes Mountains.)<br><br>The only other objection I have to ALL films, to many otherwise comprehensive books, and to nearly all of the media reportage about the Normandy Invasion is the complete absence of mention of OPERATION NEPTUNE. NEPTUNE was the co-equal naval component of OVERLORD - which was the land component of the total SHAEF plan and operation. Without NEPTUNE there was, and could have been, no OVERLORD. Indeed the NEPTUNE planning gave SHAEF and Ike as many fits and starts and moments of intense anxiety as did any of the factors in the OVERLORD planning and execution. The two operations were, from the start of the invasion planning through its execution, akin to two hands being necessary to wash each other.<br><br>A note to the IMDb reviewer who posted here that Field Marshall Montgomery was humorous and well-loved: this is simply not so. Most of Monty's associates - both senior and junior and both British and American - found him intolerant, rigid, insufferable, and the antithesis of humorous. It was also Monty's grave flaw that he prided himself as god's gift to generalship - a trait he shared with America's General Patton and which put Monty and Patton at loggerheads with each other throughout the war (Ike put up with much nonsense from both of them, and yet Ike's leadership managed to harness their talents to the task of achieving Allied victory). In his own plodding way Monty was a fine field commander, but he lacked completely what are today known as \"people skills\" - which lack disqualified him from being appointed supreme allied commander, which Churchill recognized long before it was necessary to appoint one. It was Ike alone among Allied commanders who had in spades all the people skills Monty and Patton lacked, as well as a near-perfect grasp of the leadership the Allied coalition, stacked as it was with prima donnas from every Allied nation, required in order for victory to be achieved over Nazi Germany.<br><br>(By the way: let's all learn to spell \"martinet,\" okay?)<br><br>Quibble: Timothy Bottoms' work as Ike's able SHAEF Chief of Staff Lt. Gen. Walter Bedell Smith is too easygoing. General Smith suffered from painful stomach ulcers and those who knew him did not mistake his ulcerous irascibility! Bottoms misplays Smith as a soft-spoken foil or private confessor to Selleck's finely etched Ike. Perhaps this soft Smith is artistic license since the film is not about Smith but about Ike, but I still feel that Chetwyn and Bottoms might have tried to give General Smith and his ulcers and his legendary suffer-no-fools-whomsoever wrath their historical due.<br><br>Most importantly 'Ike: Countdown to D-Day' succeeds in a way that most historical films fail: it gives the sense that none of what we now as history was preordained or a done-deal, that the events that Ike dealt with were not easy or inevitable - or glorious. There is here real drama given life by fine portrayals of characters facing up to and dealing with the gravest doubts and tasks.","user":"Piafredux","rank":[65,71]},{"title":"Superb - true war drama without combat","rating":5,"date":"5 October 2004","review":"I would really recommend seeing the DVD due to the excellent commentary by Selleck, the writer and director. <br><br>Argument about the Second World War - what went wrong, what went right, why things were done - and of course about the historical accuracy of any depiction in film - is one of those great indulgences of mankind.<br><br>But I think this movie very faithful to history - and those who say that a single particular meeting with Churchill at which Y was decided did not occur, because instead there were a dozen meetings in which Y was gradually decided -- or that there were also A, B and C people at other meetings - are simply not dealing with every movie's need to compress a true story. <br><br>I think this movie (though it does acknowledge that there was some condensing of character and incident) is truly excellent.<br><br>There is a maturity about the playing (and Selleck is really superb - a tribute to the seriousness with which he took the task of playing a hero who had an obviously immense impact on history) and sober approach to the issues -- that make it very moving.<br><br>The movie does a wonderful job at showing Ike grappling with: <br><br>a) the difficulties of others' personalities (DeGaulle, Patton, Miller, Montgomery), <br><br>b) the tactical decisions (how near to the landing do you have the paratroops drop - and do you change your mind as you learn of German troop movements? The need for a full or half moon as well as good weather; the likelihood of further delay to see if things improve -causing a loss of German surprise about place of invasion).<br><br>It's just superb in every way - it will make you wish this were part of a 12 or 14 hour series about Eisenhower in wartime. <br><br>Selleck (with his Midwestern accent and - for this movie - very deliberate in movement and speech - makes a superb Eisenhower).","user":"trpdean","rank":[35,41]},{"title":"A Good Performance by Tom Selleck in a Tough Role","rating":9,"date":"9 July 2004","review":"Dwight D. Eisenhower was the perfect choice for Supreme Commander of the Allied Expeditionary Forces that stormed French beaches on the one D-Day that indelibly evokes 6 June 1944.  Having successfully commanded the forces that invaded North Africa and subsequently Sicily, Eisenhower was the right man at the right time, the indispensable molder of a coalition with perhaps too many headstrong generals and admirals.  All these senior officers had combat command experience-Eisenhower never left the United States during World War I.  He was a remarkably competent staff officer whose abilities were noted by, probably, the shrewdest judge of Army men in America, George Marshall. And Marshall elevated his protege from lieutenant colonel to General of the Army in a very short period.<br><br>The problem with portraying Eisenhower in the tense and confusing period before the actual invasion is that never-ending talk, not action - briefings, meetings, staff reports - were the basis for the Supreme Commander's decision to launch the invasion or postpone it.  Weather issues were critical but The Weather Channel has much more excitement every night than that found in the calm, Scottish-accented reports RAF Group Captain Stagg, Eisenhower's meteorologist, delivered several times a day.<br><br>\"Ike: Countdown to D-Day\" has no battle sequences nor does it explore the emotional territory of the fighting men who would begin what Eisenhower termed \"The Great Crusade,\" the title of his postwar bestselling memoir.<br><br>Tom Selleck, in an outstanding performance, captures the nuances of a general with high ideals and a simple but consummate love of his country. British generals and some American ones, including Patton, decried Eisenhower's lack of battlefield command experience and even his ability to grasp complex tactical situations.  They were, to a certain degree, correct but what they missed was that his job was not to micro-manage combat but to hold together men of extreme temperaments and often mutual dislikes against the forces that might pull them apart and damage the coalition effort.<br><br>Selleck's Eisenhower is quiet, thoughtful and fully engaged in being an ALLIED leader and his gifts in that capacity are well reflected by this actor.  Yes, some incidents are perhaps subject to challenge by the historically knowledgeable (including me) but in the main this is as accurate a  movie dramatization of D-Day planning and decision-making as we're likely to get.<br><br>While Eisenhower's driver and confidant, Kay Summersby, an attractive Englishwoman in uniform, is present kudos go to the writers and director for not hyping up the film with an unnecessary romantic digression into the general's alleged extramarital affair with the winsome chauffeur.<br><br>This film might bore some but it's a fairly good capture of the tensions and issues preceding the issuance of one of the most momentous orders in the history of warfare: \"Let's go!,\" Eisenhower simple command that translated years of preparation into a massive assault that presaged the liberation of Europe.<br><br>9/10","user":"lawprof","rank":[30,36]}]