[{"title":"Likable but inconsistent","rating":6,"date":"17 December 2007","review":"Based on the low score at Rotten Tomatoes I expected very little from this film. Maybe it's a testament to the likability of its stars Mila Kunis and Ben Gourley, but I found myself smiling more than a few times during this road trip flick. The production value and cinematography are definitely a cut above.<br><br>Sometimes I'm troubled that somewhat self-indulgent movies like this can attract such talented production crews when perhaps more important, but less trendy stories, never see the light of day. But still, I like escapist fare like this sometimes and it's hard to really put a value on art.<br><br>If you're having a slow night, this will prove an entertaining diversion.","user":"KALE808","rank":[20,27]},{"title":"Standard Self Discovery Film","rating":4,"date":"16 January 2008","review":"Rutger Hauer helps along a film that basically can be summed up in the young person finding themselves category, and rather obviously so, so it needs a lot of help.<br><br>The beginning holds a lot more promise, of a film that could turn into Michael Clayton or Stranger Than Fiction. It's too bad because I really got hooked into the beginning. Then, like the opening soundtrack, it went from great and intriguing to basically nowhere.<br><br>It's fun enough with plenty of curiosities and interesting characters acted well. I'm sure that will be enough for many people. The problem is it all feels contrived and empty which, ironically, is supposed to be the main discovery for the character's self realization. Not the film itself (it's not a self aware film), but that the character is supposed to recognize his own life is contrived and empty.","user":"wastebot","rank":[9,12]},{"title":"I Know Exactly Why This Movie Was Made","rating":2,"date":"22 March 2008","review":"This movie was made because the concept translates well into a two sentence summary that can be used to lure investors. That is, the premise is interesting and sellable. I mean, I rented it based on the synopsis. The problem is there is nothing beyond the initial concept. There is no coherent plot, no fully fledged characters, no real comedy, no interesting scenery, no surprises, and no good performances (except Jon Herder, he does something with very little). It's as if the people who green lit this thing never read the script but only the synopsis. And if there were enough people like me, it may even have made money.<br><br>To the prospective viewer: don't waste your time, there is nothing funny or interesting to see here. To the creators of the film: hey, you got your film made, so what if its not that great. Most people never get to see themselves or their work up on screen.","user":"Fritz_Gerlich","rank":[16,26]}]