[{"title":"Surprisingly effective and chilling.","rating":9,"date":"14 January 2006","review":"Let me preface this by saying that I did not view the trailer before I saw this movie, nor did I really know anything about it. I do not know if that will lessen the impact at all, but it might (not sure what they show in the trailer).<br><br>Writer/producer/director McLean shot this movie on a digital HD handy cam, giving it an amateurish feel - but it is far from amateur. The first 45 minutes feel like a completely different movie than the last hour or so, and that is one of this movie's many strengths. McLean spends time letting the audience get to know the three main protagonists, who are Liz, Kristy, and Ben. They girls, who are both from Britain, are nearing the end of their Australian excursion, and they set off with their new Aussie mate, Ben, on a road trip/backpacking trip across the country.<br><br>McLean has an eye for the unsettling, even in the mostly warm first minutes, and he uses the stark colors and landscapes of the deepening outback to give it a slowly building sense of dread. Their are a few ominous signs - a dog barking viciously at something off screen, a rather unpleasant encounter in an out of the way gas station, and an awkward conversation about UFOs and aliens. I knew it was a horror movie, and the slow buildup is a wonderful way to create true and genuine tension.<br><br>Another thing that creates tension is the fact that the three main characters are so well fleshed out, and feel so real, that the audience begins to care for them. Knowing it is a horror movie, we know that something is eventually going to happen, and beginning segment, in its quiet, tender moments, make you wonder when that is going to happen. It's all part of the extremely good package.<br><br>Another thing to like about this horror movie is that the characters, for the most part, do not do any stupid things or horror clichés; rather, they are trying to survive and they do respond in believable ways to the horrors around them. And when those horrors finally come, after an particularly amazing segue (going to sleep...sunset...waking up hogtied), they do not let up.<br><br>Part of the criticism of this movie is that it is realistically violent and brutal, but it's a juxtaposition from the first half. It's also a juxtaposition of civilized vs. uncivilized, and the sterile, uncompromising landscape of the Outback is the perfect place for this to occur. There wasn't an over the top amount of gore, which is good, because the cruelty of what the three endure is enough to churn anyone's stomach. However, the movie is not just simple exploitation - far from it, actually. It's about that deep-seated fear of the unknown, and what could happen in an unfamiliar place.<br><br>McLean, while following a somewhat formulaic idea, stays far away from the usual stupidity. The fact that we have grown to care for the three main characters is why the second half is so effective, because there are things that happen to them that are so brutal that you feel it right with them.<br><br>'Wolf Creek' is one of the few good/great horror movies I've ever seen.","user":"MattD12027","rank":[245,311]},{"title":"Sadistic coming-of-age flick?","rating":8,"date":"11 October 2006","review":"I was thinking \"yeah, sure. Another 'based on true events' bullshit movie\" and I am now here to eat my words.<br><br>It might be tagged with 'inspired by real events' and you may reasonably ask; \"how do they know that?\". And perhaps they don't know at all, but as you watch this movie, you will completely forget that tag, because this flick is going to swallow you, and chew you up.<br><br>For a good hour this is 'just' a road trip drama. You get to know Liz and Kirsty, two British tourists down under, and Ben, the happy Aussie the two girls team up with for their road trip. And they get to know each other while the open road stretches before them. Some will feel the movie drags out and others will watch as the little drama unfolds, as it is well told and deliciously realistic. But even if you are part of the first group just hang in there, because this movie gets vicious, and thats mainly thanks to the long build up. When characters are made real and likable, its all the more gripping when they go through hell.<br><br>The acting is perfect in this flick and that is fortunate indeed, because just one bad performance could have ruined it. Kirsty and Liz are obvious friends and looks out for each other, and Ben is the fun loving Aussie, but still respects the girls hes riding with. These 'kids' genuinely likes each other, and the small slow-moving romance between Ben and Liz makes an air of innocence surround it all.<br><br>Then their car breaks down....<br><br>And in come the outback weirdo Mick Taylor. To return to my expectations \"yeah, sure...\". If the first half of the movie hadn't punctured my expectation of this being another mainstream hack like Wrong Turn and TCM remake, Mick Taylor would surely do it. In the aforementioned slashers, you could be quite sure who would die, and who'd just get their t-shirts ripped, but in this one you don't want any harm to come to any of the three. But Mick makes sure there comes plenty to all of them. He is a first grade sadistic psycho and he displays it with such a gleeful joy that you just can't help but believing it. Suddenly the movie turned from road trip drama to borderline exploitation horror. There's a whole change of tone when he comes on screen. In fact from the moment his headlights come on screen. Its dark, it rains, the kids don't know where they are being taken and so on. Suddenly that wide open road that stretched before them seems like a confining obstacle that keeps them in place. The horror that unfolds here must be seen. <br><br>Its one of the best back roads horror movies since TCM so get watching it. But don't expect your average slasher. In fact; don't expect average at all, because this flick works so well on every level.","user":"AT-AT","rank":[21,24]},{"title":"Unrelenting, actually frightening","rating":7,"date":"10 November 2008","review":"Wolf Creek is a fine example of a rare breed nowadays: a horror film that pulls no punches and makes no apologies for frightening and unnerving the audience.<br><br>Three young people are hiking in the Australian Outback when they're unlucky enough to meet Mick Taylor (played brilliantly by John Jarratt), one of the most twisted psychopaths to grace the big screen in years. Mick is a guy who did some hunting at one time, is pretty good with a rifle, and is a survivalist with some possible military training... we're not really sure of much else. All we know is that at some point he took up hunting people for his own amusement and found out he was quite good at it.<br><br>What makes this film frightening is how realistic and plausible the story is. Mick seems like a demon that could actually exist in the real world. He's not a super-genius serial killer always toying with the cops. He doesn't kill to fulfill some grandiose plan or message. He doesn't kill his victims in elaborate, unlikely scenarios or games. Rather, he's a pure sadist who just seems to enjoy watching pain, suffering and death. It's that simple. It doesn't take much imagination to realize, in the the middle of the Outback, it would be quite easy for a psycho like Mick to operate for a long time and never get caught.<br><br>Wolf Creek is brutally violent and unflinchingly realistic. It never gives the audience time to catch their breath or to feel any hope. This movie is not for everyone. It leaves you unsettled and feeling uneasy. This is only for real horror fans who desire a scare that will stick with them long after the movie ends.","user":"michaeljharvey","rank":[33,40]}]