[{"title":"A Nutshell Review: The Alibi","rating":7,"date":"29 April 2006","review":"A dream service for those adulterous men and women out there. A service which takes your calls, handles all potentially tense situations of private eyes and that suspecting spouse, essentially taking care of you on the side while you bang. Sounds good? I think so too, at least in a business sense.<br><br>Ray Elliot (Steve Coogan) runs such a service. It's a money spinner, based on statistics that one in 4 men stray, and one in 10 women cheat. He advertises his risk management career through word of mouth, and takes pride in his job in bailing clients out of seemingly explosive marital situations. The pre-requisites? A calm cool mind that can spin out stories and tell them with a straight face.<br><br>Lola Davis (the hot Rebecca Romijn) is his new management recruit, and without much orientation, plunges into the job head on. Initially you might think the movie will develop on the above company politics scenario, and have the two leads get involved with each other romantically. But no, before you can get to see the next fling, the movie heads on to classic crime noir territory.<br><br>On his last field job, Ray's client accidentally kills his mistress in a bout of S&amp;M, and it's up to Ray to clear the mess up, violating one of his principles that his company doesn't provide alibis for crime. However his reputation and integrity is on the line, and he has no choice but to cover it all up.<br><br>And you'll probably wince at the amount of challenges Ray goes through in having this done, and having a price put out on his head. It's essentially one heck of a caper, as we witness how Ray Elliot schemes and plot to get his rear out of situations that's seemingly impossible, and incredibly lucky to get out of. It's full of crossings and double-crossings, and while you might be lost at certain plot points, just hang in there as all will converge for the finale, leaving you with a smirk, quite satisfied with the outcome.<br><br>What's fun in this movie is the huge ensemble cast that play the many characters on screen. Another X-Men franchise regular, James Marsden (Cyclops) is here as the inept himbo Wendell Hatch, Ray Elliot's last client, and we have a myriad of characters like hit men, gangsters, cops, an unsatisfied wife, etc from a cast of Selma Blair, James Brolin, Sam Elliot, Jaime King, John Leguizamo, Deborah Kara Unger, and the likes.<br><br>One thing's for sure, having a huge network of those whom you have deposited emotional or material help with, certainly will help bucket-loads when the time comes. If you're up for a caper, then I'd recommend The Alibi, for its fun.","user":"DICK STEEL","rank":[31,39]},{"title":"This is how I imagine Frank Tashlin does neo-noir","rating":7,"date":"16 April 2006","review":"THE ALIBI is a smooth, elegant, neo-noir expertly shot by guys who did pre-cog scenes in MINORITY REPORT. It is very reminiscent of Frank Tashlin's work. Tashlin was the Warner Bros. cartoonist who ended up doing vehicles for Jerry Lewis and Doris Day. While his cartoons were strongly influenced by live action cinema, his live action features had a distinctive cartoonish element.<br><br>Te same can be said for THE ALIBI which works as a very tightly knit yarn and feels as precise as a special effects sequence. This precision makes the film flow smoothly and the directors deliver Hollywood entertainment at its best.<br><br>The cast is top-notch and the attached talent is the major asset of this production.<br><br>The only major shortcoming of this feature is the complete absence of emotions and character depth. The only character fully developed is the main character and it is a shame because other characters are too flat so the story fails to emotionally resonate. The screenplay feels like the first draft and it seems that it was just a couple rewrites away from being fully developed.<br><br>This is why THE ALIBI is just a well made programmer while it seems that deep inside it possessed a much bigger potential.","user":"dima-12","rank":[30,39]},{"title":"Great fun","rating":9,"date":"12 November 2006","review":"Saw this at the premiere at the AFI filmfest here in Hollywood. Crowd loved it, I had a great time. Great story, fine acting, fast paced. Keeps you going the whole way through. Very stylish. I enjoyed the feel of the film - editing, tone, camera work. Reminds me of an older style 60s thriller/comedy. Yeah, you have to pay attention to what's going on which is usually the sign of a good film. James marsden was hysterical, hope to see him doing more comedy. Would have liked to have seen more of Rebecca Romijn's character. Sam Elliot was awesome and Steve Coogan was a fantastic lead - very dry humor, I will look out for more of his films. Please see this film if you like to have a good time at the movies.","user":"robotball","rank":[19,24]}]