[{"title":"He's Stifler like tofu is meat","rating":4,"date":"11 March 2008","review":"Whoever owns the rights to \"American Pie\" is being pretty capitalistic about it. You can name twenty characters Stifler if you want, it doesn't change the fact that this is a rather uninspired effort to cash in which bizarrely works. You can judge it standing by itself, but just keep in mind it was never intended to stand by itself. So here Stifler's brother Matt (who's not even the same guy from \"American Pie 2\") is punished for pulling an on all levels pretty lame prank. The Sherminator meanwhile has become a school counselor and sends him to band camp, which as it turns out, currently employs Jim's Dad. It's like bad fan fiction came to life. So naturally he pulls more pranks on the rivals like, two. They get back at him like, once. The rest is filled up with very bothersome references to the actual \"American Pie\"-movies, semi-naked chicks and extremely irritating love subplots including a horrendously clichéd nerd you just can't possibly side with. Add a last fifteen minutes that's like the Siberian prison edit of \"Family Matters\" and you start wondering why it's still somewhat enjoyable. Perhaps it's the presence of Eugene Levy in yet another movie he's too talented for. The sunscreen gag was pretty good too I guess. This \"American Pie presents\" crap needs to end though, even if you don't give any thought to how a movie can present anything, it's still a thorn in the eye to the franchise.","user":"Sandcooler","rank":[10,11]},{"title":"Pleasantly Surprised","rating":7,"date":"28 February 2006","review":"After hearing quite a few negative comments/remarks/reviews about this film, I had somewhat lowered expectations.<br><br>Not to mention the fact that it was following what is undoubtedly the greatest comedy trilogy of our generation, and perhaps arguably any other. Attempting to follow the footsteps of any of the American Pie's is quite a task, let alone all three.<br><br>Anyway, I expected disappointment. This was in no way as good or as funny as American Pie 2 or American Wedding, nor was it as groundbreaking as American Pie. But, there were certainly a lot of laughs. I was impressed at the acting of the guy who played Stiffler's younger brother.<br><br>As someone who basically grew up with the American Pie movie series, I'll always enjoy those movies, and watch them with a sense of nostalgia, for I was in similar points in my life to all the characters at the times the moview were originally released. For that reason this movie actually made me feel old.<br><br>Anyway, I was pleasantly surprised by this movie, and am considering adding it to the collection. I'd say it's a solid 7-8 out of 10. Definitely worth watching, but not quite the caliber of the original three.","user":"jasonklingensmith","rank":[44,67]},{"title":"Surprisingly, not that bad","rating":6,"date":"13 February 2006","review":"I have to admit, that i was expecting the forth edition to the American Pie series, with its almost complete absence of original characters (Except for Jim's Dad and the Sherminator) to be dreadful. Thankfully its actually pretty good, Tad Hilgenbrinck (Matt Stifler) pulls off an incredible performance as the Stifmeister's younger brother; its like Steve Stiflers back (really he's that good) <br><br>Matt Stifler is assigned to band camp, as punishment (revenge) by the Sherminator and that's where the trouble starts, more antic's involving instruments, cameras and Jim's dad follow and with plenty of laughs 'American Pie presents Band Camp' comes out with at least some credibility as a part of the American Pie Series.<br><br>Missable, but worth a look 6/10","user":"mjw2305","rank":[37,56]}]