[{"title":"Great black comedy reviving a British tradition","rating":8,"date":"5 December 2005","review":"This great black comedy in the British tradition appeals to all generations. I went with my mother, wife and son and we all enjoyed it very much.<br><br>My 20-year-old son, who was not accustomed to this type of dark humour, was quite startled at how murder was portrayed in an off-hand, humorous way. I felt it was a revival of a genre going back to the \"Wrong Box\" [1966] and before. This film does not dwell on the violence, the gore, the sentiment or the psychological aspects of murder. It seems to be standard fare for most films but it didn't seem appropriate here.<br><br>As much I respect, Rowan Atkinson as a comedian, I was concerned that this film would be in the Mr Bean or Black Adder vein. In fact, I was pleasantly surprised to find that Rowan Atkinson is a very good actor. Most of the time, he played his role as an absent-minded vicar in an understated and sometimes quite touching way. Mr Bean fans will have their moments. There's also lots of innuendo combined with more subtle humour.<br><br>Maggie Smith is as ever excellent. The rest of the cast play their archetypal characters or in the case of Patrick Swayze's caricature well.<br><br>Though I was able to predict the overall plot, the story is entertaining and there is a gentle message about marital problems, the generation gap and hypocrisy. The scenery mainly in the Isle of Man and partly in Cornwall is stunning.<br><br>I recommend it highly.","user":"rob-1955","rank":[120,130]},{"title":"I saw this film recently and I was pleasantly surprised.","rating":7,"date":"30 November 2005","review":"I saw this film recently and I was pleasantly surprised. It reminded me of the old Ealing Comedies as it was charming but had a definite sense of delicious wickedness running through it. All of the main characters are funny in their own way particularly Rowan Atkinson and Maggie Smith. It reminded me so much of and Ealing Comedy that after a while I could only see Alec Guinness in drag when Maggie Smith was on screen. Kristin Scott Thomas started out as being being a bit of a female Hugh Grant in Four Weddings and a Funeral and showed that she can be quite funny but towards the end she gets a little unconvincing once some revelations unfold. All in all it has it's minor misgivings and gets a little too silly and unbelievable in places but I'd give it a go.","user":"ramhouse3","rank":[92,104]},{"title":"Surprisingly wonderful English comedy","rating":9,"date":"4 December 2005","review":"This is an almost perfect \"naughty\" English comedy whose humour is too complicated to be described. Rowan Atkinson, Maggie Smith, and the rest of the cast are perfect. This is the most understated I have ever seen Atkinson, and marks an interesting evolution for him. Two young ladies in front of me were still giggling halfway through the closing credits, and the entire audience, judging from the laughter, had a great time. I chuckled all the way home - think I'll go see it again tonight, as I have an \"Unlimited\" card, so can see as many movies as I like for 11 pounds a month.<br><br>Seriously, this is not a \"sweetness-and-light\" comedy - it has a dark side, which is evident from the beginning, but that aspect drives the humour, because it touches feelings in us which we must restrain, but in watching the film we are allowed to indulge them. It also has a lot of very deep things to say about marriage and religion (Atkinson plays a shy, self- absorbed country vicar with a beautiful wife and daughter whom he neglects) without indulging in the usual superficial post-modern ironic attacks on either institution. In fact, it has some very intelligent things to say about both of them.<br><br>You really must see this movie - it is a gem - if you know people who don't normally go to the movies (like older in-laws) urge them to see this one, or at least rent the DVD.","user":"crogerson","rank":[104,119]}]