[{"title":"The Descent - symbology and meaning","rating":10,"date":"30 August 2006","review":"What's interesting to me is the deeper meaning and symbols of the film. The film is really about two women. Sarah, and her friend, Juno. The film opens with Sarah losing both her husband and child in a horrific wreck. Over the course of the movie, it becomes apparent that the accident was caused because the husband was distracted and upset over an affair he was having with Juno. Sarah is aware, at least subconsciously, of Juno's betrayal and that it lead to the deaths of her husband and child. She is not in a place mentally or emotionally to acknowledge it on a conscious level. When Sarah awakens from the wreck, there is a sequence where she runs from darkness. The darkness symbolizes a call to action. Sarah rejects it by running from it. She isn't ready yet. This is classically what chase dreams are about. The dreamer is being pursued by their subconscious given horrible form. If the dreamer can make a conscious effort to stop running and speak to the scary thing chasing them, that dreamer's unconscious will speak directly to the dreamer. This would be the conscious (dreamer) dropping the ego defense (running) and interacting with the subconscious (chaser) to gain new insight.<br><br>A year passes and Juno get all the friends together to go spelunking. She lies and takes them to a cave she has discovered because she wants Sarah and her to be the ones who find the cave complex and name it. In Juno's sick mind, she's trying to perform some type of penance. She doesn't see that she's manipulating her friends to do something incredibly dangerous. Juno is a manipulator who only sees things from her own narcissistic point of view. Other people are only as real as Juno feels about them.<br><br>Going underground is dream imagery for going into the subconscious. This could be going into a basement under a bar as in Fight Club or even underwater.<br><br>Sarah is returning to the darkness that she ran from earlier. She starts to experience hallucinations (waking dreams) mainly her daughter's laugh. Her subconscious is pulling her back to the event that damaged her psyche (the wreck).<br><br>They get trapped and so must go deeper into the cave to find a way out. Thus Sarah is going deeper and deeper into her subconscious. It's not readily apparent but it's when they get to the deepest point of the caves (the deepest level of consciousness) that they actually encounter the cave people. If you watch you'll notice that they stop traveling downward (they may fall or are be pushed downward but the never choose to go down). Thus the cave people are the most base and ancient level of Sarah's mind. They lack all their senses. They have no problem-solving or tool-using skills but they are very strong and aggressive. They are a primal force.<br><br>While down with these creatures, several key events happen. The first is that Juno and Sarah's friends began to be picked off. The second is Juno's true character is revealed. She stabs one of her friends (accident) but then leaves rather then helps her (because of shock but on purpose). What's interesting is that as soon as Juno reunites with the main group, she makes a big show about she won't leave without Sarah who is missing. She acts differently when people are around. Character is what you do when others aren't watching. Juno is a person of weak character.<br><br>The biggest key event is that Sarah is separated from the group and ends up in the den of the cave dwellers. The heart of this lowest level of her subconscious. It is here that Juno's original betrayal becomes fully known to Sarah's conscious self. The friend that Juno stabbed is bleeding to death and tells Sarah of Juno and her husband. It's at this lowest level that Sarah understands Juno. Juno is the type of woman that would wreck the marriage of a good friend, stab a friend and leave them to die alone, and lead all her friends to certain death because of an ego trip. In short, Juno is a destructive force. Sarah kills her hurt friend to end her suffering. This is the action that Juno refused. Sarah empathized with her friend and refused to leave her in pain to make her escape. Juno did not do this. Juno felt that her feelings and safety were more important than her friend's suffering.<br><br>The other event that happens in this room, is that Sarah kills a cave dweller child and observes it's mother grieving over the loss. Sarah has now committed the same sin as Juno. The mother tries to kill Sarah. This is what is missing from Sarah's life. Sarah needs to take vengeance on Juno to become whole.<br><br>Sarah eventually meets up with Juno again and they began to make their way out as the last two survivors. After the last big fight against the cave dwellers, Sarah confronts Juno about her lies, manipulations, and betrayals. Then, Sarah stabs Juno in the leg and leaves her for the cave dwellers. This the same action Juno took earlier when she stabbed her friend and left her. What is different is that Sarah makes a conscious choice to kill Juno and takes responsibility for the action where Juno avoids the responsibility of everything she has done.<br><br>Then there is a long sequence where Sarah is climbing upward out of the dark to the light. This is symbolic of a return to consciousness and the real world.<br><br>This movie has parallels with Hamlet. What is missing from Sarah is what was missing from Hamlet. They both need to take action but because of the horribleness of the action they must take, they have recoiled from it and spend the whole story getting to a point where they come to terms with what they must do to be whole.","user":"grayden1977","rank":[178,220]},{"title":"Masterful horror film. Spoiler free review","rating":9,"date":"12 July 2005","review":"If nightmare inducing horror is not your bag then the less you know about The Descent the better. Geordie writer-director Neil Marshall has delivered an accomplished, well acted, out and out horror movie that comes as much of a pleasant surprise as his first major feature Dog Soldiers did back in 2002. Shot in a mere 7 weeks The Descent sees a sextet of undeniably attractive action women leaping headfirst into an Appalachian potholing adventure that goes wrong so quickly you are left wondering if any one of them will survive, let alone ever see daylight again.<br><br>There are comparisons to be drawn to Marshall's 'Soldiers of course - again the story is stark and wonderfully economic. Again there is group of six people, predominantly one sex accompanied with a lurking, ominous threat and again there are more nods to popular film culture than you probably realise. The Descent however has a sense of humour that is suitably pitch black.<br><br>Long before the cave appears we play witness to a traumatic event that underlies the plot and serves to both unite and tear apart relationships in equal measure. Mostly affected are fragile Sarah and physically strong Juno, an adrenaline junkie who leads the group further and further beneath the ground. No time is wasted in recreating the primal feel of crawling through tunnels with hard hats scraping the dust from the rocks, choking and inducing paranoia all the way as it lingers in the stale, torchlit air. It's here Marshall gets a little inventive. Playing with various different lighting techniques our heroines become colour coded through scenes via glow-sticks, flashlights and video camera. Sounds echo when visuals are briefly lost and deliciously bone crunching they are too. Events escalate quickly and the whole ride becomes what can only be described as a non-stop relentless assault on the senses that will demand repeated viewing.<br><br>The only thing that will ruin this movie for you is word of mouth, which ironically is exactly what this film will need to become commercially viable. But the less you know, the more you will enjoy it. Have fun spotting references to Carrie and Apocalypse Now by all means, but don't be fooled into thinking this is a mere standard entry into the much saturated genre-movie staple. The Descent will rank as one of the most unashamedly terrifying British films ever made. It was made by people that love good cinema, and it shows. The Descent was made before The Cave, and now has an alternate ending for new audiences.","user":"Youkilledmypine","rank":[402,557]},{"title":"Easy to miss, hard to forget.","rating":8,"date":"9 July 2005","review":"There aren't that many British horror films, so it's not too much of a stretch to call this one of the best British horror movies i've seen. It has flaws, but i've only seen a few films in my life that don't. It's incredibly entertaining though.<br><br>The basic premise: Fun-loving, adventurous Sarah suffers a personal tragedy, a year later her friends rally round and they go on a caving trip in the Appalachian Mountains in the US. Things go awry.<br><br>It's a slow starter this film, the tension is palpable from the start but things don't properly kick off for nearly an hour. Don't get me wrong, it's never dull, but the pacing of the film is similar to that of a roller-coaster. There's an uphill wind-up that builds suspense, but when it goes over the edge it just doesn't let up until you come to a juddering halt. All the horror techniques are used here, there are enough jumps (both telegraphed and not) that every pause will have you ready to flinch, but there's also fantastic use of suspense and everything about the film oozes menace and foreboding. A special mention is needed for the music. Like all good scores, it goes mostly unnoticed. But it's intertwined beautifully with the film, it moves you and misleads you, it swells from background plinks and plonks to grand, blaring orchestral pieces. The lighting is also masterful. When the girls split up, Marshall uses different lighting to indicate which person or group you are looking at. Whether it's through infra-red camera, luminous green light-sticks or red flares and torches, you instantly know who you're looking at, and that cuts down on the confusion very effectively. Flaws? The dialogue is a little clunky at the start, there's a few moments of cgi as they first enter the cave that are pretty shoddy. Other than that it ticks all the right boxes. Great acting, great plot, excellent gore levels, perfect ending. Not everyones cup of tea, but definitely mine. Hell hath no fury","user":"outy","rank":[246,339]}]