[{"title":"Wafer fin, badly chosen time period.","rating":5,"date":"28 November 2016","review":"After the big hoo-ha about how bad this film is, in particular because of Zoe Saldana's casting, I decided to give this movie a shot.<br><br>I know virtually nothing about Nina Simone's life, but this film does not want to portray what her life was during her prime. Instead it relies on itty bitty pieces of dialogue during interviews and conversations with Nina's old friend Richard Pryor. It is set during the last decade of her life, when she is mentally ill, unstably alcoholic and very difficult to tolerate. Clifton (David Oyelowo), the nurse at the mental hospital where she is interred, takes her in, looks after her and eventually becomes her manager. <br><br>The real problem with this movie is, glaringly, the time period of Nina's life. It's not a good one, and very little happens in the movie. We start her off as a little girl defying racial segregation so that her parents can sit in the front row. Nothing else is shown of her rise to fame and struggles, which makes the film feel very empty. <br><br>One thing I really didn't like is the erasure of Clifton's homosexuality. Although he and Nina are not seen intimate with each other (at one point she calls him the F word when he refuses to have sex with her) there is a small implication. Why couldn't they show everyone he was gay?<br><br>The last thing is of course Zoe Saldana as Nina. I personally feel the criticism (and it was extremely scornful) was very unfair. She did the best with what she was given, and she should be praised for it. The problem is not the color of her skin, its the age. She is supposed to be in her sixties, and yet Saldana is actually younger than David Oyelowo! They really couldn't find an older actress?<br><br>At times the movie was painfully boring, badly paced and perhaps unintentionally funny. 5 out 10.","user":"Avwillfan89","rank":[20,22]},{"title":"I was not impressed by this film's portrayal of Nina's life, her music and her importance in history.","rating":4,"date":"25 April 2016","review":"Nina Simone was a huge public figure in the black civil rights movement and one of the most popular jazz musicians of all time. She remains to this day very influential and unique. This film managed to capture none of it. It decides to focus entirely on her romantic relationship with her assistant during the last years of her life and - even though it does address her mental health issues and her problems with showbiz - it briefly skims over all the good and important influence she had over culture and music. Zoe Saldana may have been able to pull off her demeanour while in daily life, however her 'on stage' performances were underwhelming. I don't have a problem with her doing her own singing while impersonation an actual person, because a voice-over would probably not have worked well, however, Zoe's auto-tuned performance failed to capture the spirituality, strength and powerful presence that Nina had. Obviously, no one can be as good a Nina as Nina was, but if I didn't know who Nina Simone was before this movie, I certainly would not have cared about her afterwards. Overall, I was not impressed by this film's portrayal of Nina's life, her music and her importance in history. If you want a better portrayal of Nina, watch What Happened, Miss Simone (her documentary) or listen to her actual music.","user":"maripere95","rank":[29,34]},{"title":"An injustice to Nina Simone's legacy","rating":1,"date":"27 April 2016","review":"Everything you wouldn't want to see in a film about Nina Simone. While Zoe Saldana might get a C+ for effort, one wonders if there were any mirrors anywhere on set or if she figured CGI would fix her appearance; although, the problems with this abysmal film are greater than Zoe's horrific makeup. The story is disjointed and focuses on absolutely arbitrary parts of Nina's life. There is no depth or realness to Cynthia Mort's vision of Nina and - considering the subject matter - that's an injustice. It could be considered an accomplishment that Mort was able to create a film about Nina Simone that leaves the viewer feeling nothing at all. Perhaps the worst part of the film is how ugly they made Nina. While she might not have been what's considered conventionally pretty, Nina possessed an elegant beauty that was a powerful part of her performance. Nina Simone was a beautiful woman and to turn her into a creature from the blackface lagoon in a biopic is unforgivable.","user":"atotheron77","rank":[49,62]}]