[{"title":"A Real Treat","rating":10,"date":"22 March 2007","review":"\"Who Loves The Sun\" works its way through some prickly subject matter with enough wit and grace to keep the story not only engaging, but often hilarious. It's been a while since I've found such a thoroughly touching, thoroughly enjoyable film. <br><br>The film is gorgeous, drawing the eye with beautiful scenery and tranquil landscapes. The peaceful imagery contrasts wonderfully with the tension between the very human, very flawed, and yet very likable characters. Due to the excellent cast all five of the major players are wonderfully interesting and dynamic. <br><br>I recommend \"Who Loves The Sun.\" It's a really funny movie that takes a poignant look at the hurts that we can inflict on each other, and the amazingly difficult but equally rewarding process of forgiveness.","user":"RoamingTroll","rank":[17,21]},{"title":"Well told story with a small but great cast","rating":7,"date":"28 January 2007","review":"I didn't know anything about this movie going into it so I was pleasantly surprised after watching it. Prior to seeing it I had been watching some rather disappointing independent films, so I was very glad that I saw this entertaining picture.<br><br>Will returns to meet his friends Daniel and Maggie after a five year departure. Staying at the lakeside home of Daniel's parents, the group intervene, recalling their past and trying to fix their troubles together.<br><br>Starring Lukas Haas and Adam Scott, two actors I grew up watching on TV and on film, I was glad to see the two on screen together. And Molly Parker, R H Thomson, and Wendy Crewson complete the wonderful ensemble. With so many great interactions between the characters, the film is filled with excellent dialogue both dramatic and comedic. For a great character driven film, Who Loves the Sun is a perfect selection.","user":"se7en187","rank":[16,20]},{"title":"Comedic Approach to a Dramatic Dilemma","rating":6,"date":"13 August 2010","review":"The issue of infidelity is usually used as a set-up for revenge thrillers in movies, while in the real world most people try to control their murderous impulses and navigate their way to reconciliation or separation. \"Who Loves The Sun\" opens with the sudden return of a young drifter to the lakeside community where he had grown up, five years after he had suddenly disappeared. Will had exiled himself after catching his wife, Maggie, having sex with his childhood best friend, Daniel. Ignorant about the infidelity, Daniel's parents offer Will shelter for the night - and while he sleeps, they call up their son and Maggie, who soon arrive seeking explanations for the prolonged absence - and the trio promptly begin wrestling with their various unresolved issues.<br><br>Writer/director Matt Bissonnette initially seems to take the situation with appropriate gravity, but gradually dilutes his film's credibility by choosing the comedic option time and again as the narrative unfolds. The excellent Molly Parker balances her performance nicely between poignant regret over her past behavior, and anger at Will's extreme response to her betrayal. In contrast, Will and Daniel are too often required to act out their conflict for laughs. They scuffle ineffectually, play stupid jokes on one another, jump impulsively into the lake fully-clothed, and stare sulkily into the distance until both of them look like petulant juveniles. By the time the story's big twist is revealed near the end, most viewers will feel as if they have been watching a light comedy rather than a drama - and it seems like a wasted opportunity for a nice idea and the luminist cinematography.","user":"tigerfish50","rank":[5,5]}]