[{"title":"Best of the movie series, but does not make it a good movie.","rating":6,"date":"21 February 2020","review":"The storyline builds quite nicely in the 3rd installment and the addition of a few more known actresses and actors, helps move this film forward. Unfortunately the special effects are still very rudimentary.","user":"MR_Heraclius","rank":[38,43]},{"title":"Entertaining","rating":7,"date":"21 September 2007","review":"Im not sure what video gamers were expecting when this series was turned into film. Just like books, comic books, and whatever else, the source material will more often than not be different from the film. However, that is not always a bad thing. Take Jurassic Park for instance. The movie was phenomenal, but nothing like the book. Anyways, the reason i'm saying this is because I myself have played the games and have enjoyed the movies quite a bit. Sure, there not masterpieces by any means, but I think they are time well spent to escape reality for a couple of hours. I think Milla plays a great heroine in distress and a serious badas s. The character development in this is non existent. You get a little speech to bring you up to speed, but if you haven't seen these before, you will be lost in the film. (A friend that I had brought asked me how Claire Redfield knew how to fly a helicopter.) But you're not in this movie for the character development. You want to see zombies die and Milla kick butt, and that is what this film delivers. There are some great scenes here and some pretty fun kills, not a whole lot that you haven't seen before, but still entertaining. The movie goes pretty quick and has some very nice things to add. Alice's telekinesis was very cool to watch, and I can see why she didn't get to use it a lot. A lot of the special effects were much better here than they were in previous films, and that was a definite plus. The bad is that it ends for another to be made, and this is supposed to be the last. A lot of main players lose their lives, and that's fine, cause the movie doesn't give you time to care for them. Nope, the main focus here is Milla and she delivers the goods. Good fights, good kills, not much logic, pretty decent special effects, and the greatest pot smoking scene in history make this worth seeing in my opinion. If you liked the first two, you should enjoy this just the same. Personally, I don't think any of them have been too bad.<br><br>P.s. why did they keep airbrushing Milla's face, she is entirely too beautiful for that.","user":"sackjigler","rank":[131,188]},{"title":"A Nutshell Review: Resident Evil: Extinction","rating":8,"date":"5 October 2007","review":"With Extinction, the Resident Evil franchise perhaps have made its mark as the most enduring computer game turned movie to date. Most of such movies usually make for cheesy lazy weekend entertainment, little in depth but filled with plenty of set action pieces, which for the most parts are nothing groundbreaking. But what this franchise has to credit for its longevity, is Milla Jovovich.<br><br>OK, so she has made mostly mediocre movies of late (I sense some fanboys will get me for this, but let me put it straight, I'm a fan of hers too), especially with the lacklustre Ultraviolet, and the really showy .45. If not best remembered for her role as Leeloo in Luc Besson's The Fifth Element (still credited in my books as the ONLY film I watched with having zero prior knowledge on anything about it), then it'll be for her role as Alice, the zombie butt kicking superbeing whose blood holds the key to a reversal of the effects of the T-virus engineered by the evil Umbrella Corporation.<br><br>The premise here is similar to that of 28 Days/Weeks Later, where the virus is now out of control, and mutates humans into flesh chomping zombies, spreading mayhem worldwide. Human survivors are few and far between, and where we left off from Apocalypse, Alice is now travelling the world alone, seeking refuge and peace, while evading Umbrella's gunsights. It presumably takes place a significant amount of time after the predecessor, given that Jill Valentine (Sienna Guillory) doesn't return for this, keeping the doors open for either an unlikely spin off, or a revisit into the gap in timeline should Guillory sign on the dotted line.<br><br>But I guess as Juvovich fans, we don't really care, do we? So long as we get to see our heroine in action, we're satisfied, whether she's causing misery to her opponents from her twin handguns, double Kukri knives or just her incredibly toned limbs, we're rooting for her all the way, dressed in garb personally designed by Juvovich herself, which provides for both form and functionality. The trend of casting pretty women to pair with her continues, with the first movie having Michelle Rodriguez, the second with Guillory, and now, Heroes' Ali Larter and Spencer Locke join the fray. However, they are relegated to more pedestrian roles as compared to previous partners, so don't be expecting much from them, especially for fans of Larter.<br><br>The story can be no more simpler than Alice serving as a messiah for a small convoy of survivors headed by Larter's Claire, delivering them a message to journey to the promised land in Alaska. But of course the road to Peace and No Infection is plagued by challenges which culminates in a big battle in Las Vegas, where the trailers have teased with the entire city being semi-buried in sand. And like a video game, all levels will lead to their respective Big Boss to do battle with, and Extinction doesn't evade that formula too. Watching Alice grow in power, provides a lot of kick in some of the cool things she can do, enhanced with special effects of course.<br><br>Don't expect the franchise to slam the door of opportunity shut on itself. By the look of things, we might even see a fourth movie coming up in perhaps two or three years time (the interval between the movies thus far). Expect plenty of blood and gore as our heroes cut through ugly zombies like hot knife through butter, and none other does it more balletic and graceful than Milla Juvovich. You go, girl!","user":"DICK STEEL","rank":[113,177]}]