[{"title":"Stunning~","rating":9,"date":"4 January 2006","review":"When I was about 9 or 10, I read the book. I loved it, and it deepened my love for the city of Venice. The movie is about two boys, Pop and Bo, who get separated when their mother dies: 6 year old Bo has to live with his terrible aunt and uncle, 15 year old Pop ends up in an orphanage. The decide to run away to Venice, a city their mother had always loved. Without money or home, they meet the 16 year old Lord of the Thiefs and get to live with him and his gang of orphans, and get a dangerous mission to steal a wooden wing...<br><br>The actors were well chosen and played even due to their young age very well, the pictures of Venice are beautiful and the music was thoroughly fitting. Only 9 stars, because notable changes were made from the book, though it wasn't too tragic.","user":"tiamat72","rank":[67,76]},{"title":"Great music, a great story and well executed direction","rating":7,"date":"15 March 2006","review":"Sometimes you just want to enjoy a movie and overlook some minor imperfections. You judge it by how you feel when the movie ends. A movie that the whole family can enjoy, sans profanity, nudity, complex themes or juxtaposed subplots.<br><br>Great music, a great story and well executed direction. This is one movie that will not disappoint you as long as you understand that it is a children's' movie with simple and easily understood dialog and story line. Surprisingly, the adults equally enjoyed the production.<br><br>The characters are very convincing and the script is believable. Overall a very positive experience.","user":"mike-2945","rank":[39,45]},{"title":"Probably one of the best non-American family adventures in recent history.","rating":9,"date":"3 August 2006","review":"The Thief Lord was released in my country a couple of months ago and for some reason this movie almost immediately caught my attention. A German family adventure/fantasy movie with English language and with English actors  all of that seemed quite unusual and therefore interesting to me. At the same time I never heard of Cornelia Funke's novel of the same name so I didn't know exactly what to expect from the movie. <br><br>I watched Thief Lord today and actually I liked it. It was really fascinating to see something fresh and different from typical and often annoying Hollywood family stuff. For young ones Thief Lord is an enjoyable family adventure with talented young cast against the background of one of the most beautiful cities in the whole world, Venice. For grown-ups besides that it's a story of bitter loneliness and sometimes misunderstanding which unite most of the characters. Two brothers, fifteen years old Prosper and much younger Bo, after death of their parents are separated. The younger goes to the old childless relatives and Prosper has been sent to an orphanage. But brothers can't live without each other and for six years old Bo Prosper is the only person who cares about him and loves him so much. Desperate, they run away. They have nowhere to go in the whole world and they are heading to Venice, the city that their mother loved so much. But the city is not welcome to runaways with no money and only unexpected help of a mysterious boy, who called himself Thief Lord and saves them from more troubles. Bo and Prosper join him and his team of orphans who find a refuge in a deserted movie theater. Soon our heroes learn that ancient city is full of surprises and what's is more that some strange magical things can happen there. They become involved into rather unexpected events and lives of different characters collide in Venice. We meet a lonely wife and husband, who also heading to Venice, trying to find a runaway child, who was merely a way to suppress their own loneliness, a lonely detective, who was hired to find Bo and some other characters. However, finally for many of our heroes resolution salvation of their personal problems will come in a rather unexpected way for each other. <br><br>But the loneliest and most suffering from that is mysterious Thief Lord himself who is trying to keep his secrets inside of him. This key character is playing by Rollo Weeks, who looks very good in his rather complicated part. Both Aaron Johnson (Prosper) and Jasper Harris also left very positive impression from their acting, self-reliance and naturalness. Despite rather short running time of the movie the development of most main characters is not bad. We know enough about them to feel sympathy or antipathy to them and we are not indifferent to them, which is very important for such a story. The acting among adult cast was also not bad with most memorable and likable performance from Jim Carter as Victor. <br><br>Thief Lord in the beginning the movie is fast paced and probably a little too short but mostly it's exciting well-filmed film with interesting and original story. The soundtrack one it's own looked very good and it's a very good addition to visual part even if sometimes the music is abstracted from what we saw on screen. And let me to say that visuals for such low-budgeted production were also not too bad. If you are looking for a good non-American family adventure film on English language as an alternative for Hollywood production featuring talented cast, probably you would be unable to find better choice than Thief Lord. Also it's worth to notice that the movie mostly successfully avoids typical and clichéd for American family films crude humor and language.<br><br>I know possibly I'm too generous and surely Thief Lord is not a flawless masterpiece but I rated it 9 out of 10. Unfortunately such enjoyable and beautifully shot family movies so rarely appear in our movie theaters or video stores. <br><br>And the last one thing that I almost forgot to mention. The title song \"Orphan skies\" is pretty cool and I liked it very much.","user":"Juni78ukr","rank":[20,23]}]