[{"title":"reasonably entertaining time-waster","rating":6,"date":"21 May 2006","review":"You'd think Michael Douglas would have learned his lesson by this time, but apparently he hasn't. For even after all the trouble he had with an adulterous romance in \"Fatal Attraction,\" here he is in \"The Sentinel\" playing the role of Pete Garrison, a veteran secret service agent who's having an affair with none other than the First Lady of the United States. Even worse, when it is discovered that there may be a mole secretly operating in the service, the finger of suspicion begins to point directly at Mr. Garrison. Is he truly the undercover operative working to bring down the President, or is he merely a tool being set up as a convenient fall guy in a plot to rub out the nation's chief executive? <br><br>Based on the novel by Gerald Petievich, \"The Sentinel\" is a decent enough thriller set in the high stakes world of political assassination. Although it frequently strains credibility, gets lost in a maze of cyber/techno mumbo jumbo, and succumbs to a few too many man-on-the-run clichés, the movie still manages to generate enough mystery and suspense to see us through most of its many rough patches. Prime credit goes to Douglas, who after all these years, could clearly do these roles in his sleep, and to Keifer Sutherland, who plays a fellow agent with personal reasons for doubting Garrison's probity and loyalty to the institution. Kim Basinger also does a fine job as the beautiful First Lady torn between duty towards her husband and the man she loves.<br><br>You'll probably forget this movie the moment you walk out of the theater, but you should have a reasonably fun time while you're still in your seat.","user":"Buddy-51","rank":[66,74]},{"title":"Michael Douglas and Kiefer Sutherland go down a well worn road in a good movie that really should have gone straight to cable","rating":6,"date":"30 April 2006","review":"Michael Douglas is a secret service agent framed in a plot to kill the President of the US. Kiefer Sutherland is the agent on his tail.<br><br>Its not a bad movie its just been there done that with form over content film making. There is no real tension because the actors are in roles they've played a dozen or so times before (Sutherland in 24 each week)so you can pretty much walk them through whats happening.Thats the problem here, its all been done before, better.<br><br>The real question is: Do I really need to pay 10 bucks a head to see whats a essentially a big screen TV movie? I think not. As I said its not bad, its just not worth running out to the theater to see. Wait for cable where this movie really belongs.","user":"dbborroughs","rank":[152,181]},{"title":"The director should stick with TV","rating":6,"date":"22 April 2006","review":"This movie had all the potential in the world to be a modern-day \"In The Line Of Fire\", with great suspense, story, acting, action, etc... but the Director missed the ball. Every action and suspenseful scene was missing the added element that separates TV-movies from box-office blockbusters. It's hard to put into words, but watching all the action and suspense scenes felt like I was watching a mid-budget USA or TBS movie. The cast was great and them combined with a good screenplay and overall plot saves this movie from being a disaster. There was too little character building as well, especially for the 'bad guys'. The story was still good and the movie overall will still be entertaining, but needless to say, I was disappointed.","user":"dlevin-4","rank":[135,171]}]