[{"title":"Emotionally devastating - must-see cinema","rating":9,"date":"27 October 2008","review":"I have only just learnt that Zvyagintev's The Return was his feature film debut. It really impressed me with it's sparse and elusive narrative, filled with mystery and ambiguity. It is visually spectacular, with a strong Eastern European aesthetic that one can't look away from. The Banishment is no less a film.<br><br>This is a much more ambitious effort than Zvyagintev's debut. Again he has crafted a story that is highly enigmatic. It stars Konstantin Lavronenko, who played the role of the absent father returned in The Return. Alex is a man with a shady past and his brother Mark (Aleksandr Baluyev) is of the same ilk. When Alex's wife, Vera (Maria Bonnevie), reveals she is pregnant and that he is not the father, a sequence of events unfolds that will have you on the edge of your seat. \"If you want to kill, kill. If you want to forgive, forgive\", says Mark.<br><br>The tension is palpable, magnified by the sparse dialogue. In one sense, words are not needed as the body language says it all. Yet in another, the inability of the protagonists to bring out into the open what needs to be said leads to unforeseen consequences. This is both thematically similar to Nuri Bilge Ceylan's similarly excellent Three Monkeys and stylistically they also share much in common. As in Ceylan's films, Zvyagintev shows great confidence in telling a story, taking his time to create a palpable ambiance. At 157 minutes, the film is quite long, but always engaging.<br><br>The cinematography is stunning throughout, with excellent use of the widescreen. There is one tracking shot in particular that left me breathless as the camera seemingly floated through space. I can recall only twice where the camera movement impressed me so: the caravan sequence in Noise and the various tracking shots in Soy Cuba. The use of darkness, light and shade are used to great effect. The music is haunting, reminding me of the Gothic sounds of the music of Enigma. It renders the film with a sense of tragedy of biblical proportions.<br><br>Zvyagintev is a magnificent talent that just can't be ignored. If you see only one Russian film this year, make it The Banishment.","user":"paulmartin-2","rank":[45,47]},{"title":"Better and more complex than \"The Return\"","rating":8,"date":"23 December 2007","review":"Andrei Zvyagintsev's second film \"The Banishment,\" if evaluated closely, could arguably be as interesting as his first film The Return, if not better. Both relate to related concepts \"Father\" and \"Love/Absence of Love.\" In both films, there are few words spoken.<br><br>To evaluate \"The Banishment\" is like completing a challenging crossword puzzle. You would know this unusual situation if you have seen \"The Return.\" To begin \"The Return\" was not based on a novel. This one is. That, too, a William Saroyan novel\"The Laughing Matter.\" Yet the director is not presenting us with Saroyan's novel on the screen. He develops the wife as a woman \"more sinn'd against than sinning,\" while in the novel she is mentally unstable. Understandably, the director decides to drop the Saroyan title. Thus the words \"I am going to have a child. It's not yours\" provides two utterly distinct scenarios depending on whether the woman who speaks those words to her husband is a saintly person or a mentally unhinged woman. The change in the character of the wife by the director opens a totally new perspective to the Saroyan storya tool that contemporary filmmakers frequently use, not to wreck literary works, but creatively revive interest in the possibilities a change in the original work provides.<br><br>Those viewers familiar with the plethora of Christian symbolism in \"The Return\" will spot the painting on which the children play jigsaw is one of an angel visiting Mary, mother of Jesus, to reveal that she will give birth even if she is a virgin. This shot is followed by a black kitten walking across the painting. And the forced abortion operation at the behest of the husband begins on Vera, the wife in Zvyagintsev's film. By the end of the film the viewer will realize that the director had left a clue for the viewernot through conventional character development using long conversations.<br><br>\"The Banishment\" is representative of contemporary cinema provoking viewers to enjoy cinema beyond the story by deciphering symbols strewn around amongst layers of meaning structured within the screenplay. <br><br>As usual, the cinema of director Zvyagintsev is full of allusions to the Bible. This is the third famous film that refers to a single abstract chapter in the Bible on love: 1 Corinthians Chapter 13. In \"The Banishment\" the chapter is read by the neighbors' daughters. In Krzysztof Kieslowski's \"Blue\", set to the musical score sung towards the end of the film a choral musical piece sings the words \"If I have not love, I am nothing\" from the same Biblical chapter commenting indirectly on communication breakdown between husband and wife and the slow and painful reconciliation with the husband's lover. Bergman's \"Through a glass darkly\" is a phrase on taken from the same chapter of the Bible, a film also on lack of communication and love between father and son, husbands and wives.<br><br>The banishment alludes to the banishment of Adam from the Garden of Eden represented in the film by the anti-hero's tranquil family house, far from the inferred socio-political turbulence elsewhere. Soon after the wife's proclamation we see her children playing with the jigsaw puzzle depicting an angel appearing to Virgin Mary, mother of Jesus, that she will bear a child. These clues indicate to the viewer that wife was innocent. In the movie, these are but a few of the dozens of symbols and metaphors that extend even to the selection of classical music. As usual, the cinema of director Zvyagintsev is full of allusions to the Bible. The banishment alludes to the banishment of Adam from Eden represented in the film by the anti-hero's tranquil family house, far from the inferred socio-political turbulence elsewhere. A black kitten crosses the jigsaw puzzle and tragedy follows. These clues indicate to the viewer that wife was innocent. In the movie, these are but a few of the dozens of symbols and metaphors that extend even to the selection of classical music Bach's Magnificat or the \"Song of Virgin Mary\". There is washing of the brother's bullet hit arm, reminiscent of Pilate washing his hands in the Bible. <br><br>While the story and structure of \"The Return\" is easier to comprehend, \"The Banishment\" is more complex. The first half of the film entices the viewer to reach the wrong conclusions. The Father is correct, the wife is wrong. The second half of the film surprises the viewer as all assumptions of the viewer made from the preceding episodes are turned topsy-turvy. Men are arrogant, egotistical and father children without love. There is no love in the silent train journey of the family while the wife is looking at her husband with love. Like Kieslowski's \"Blue\" the woman appears stronger than the manand in an apt epilogue its women (harvesting a field) who are singing a song of hope and regeneration.<br><br>A supposed major flaw noted by critics is the lack of character development. In this film, Zvyagintsev develops characters using silent journeys (lack of communication) and misconstruing of reality (\"child is not ours\"), very close to the storyline of the director's first film. Actually, Zvyagintsev progresses in this second film by extending the relationship of \"Father and children\" in the first film, to \"Father and wife\" in the second. In the first film, children do not understand the father; in the second, the father does not understand his wife. When he does it is too late, just as the kids in the first film of the director. This is a film that requires several viewings to savor its many ingredients of photography, music, and screenplay writing. Zvyagintsev is not merely copying directors Tarkovsky, Bergman and Kieslowski-he is exploring new territories by teasing his viewer to \"suspend his/her belief\" and constantly re-evaluate what was shown earlier.","user":"JuguAbraham","rank":[57,66]},{"title":"Zvyagintsev creates a stark, grave allegory of marital and familial disintegration","rating":7,"date":"28 August 2008","review":"Andrey Zvyagintsev's \"The Banishment\" is a stark, grave allegory of marital and familial disintegration. The father, Alexander (Best Actor at Cannes 2007, Konstantin Lavronenko)a slight, lithe, laconic characterfaces an unconscionable choice midway through the film. His wife, Vera (Maria Bonnevie), is a quietly tired mother masking a great deal of uncertainty behind pained eyes and faded beauty. Their young children, Kir and Eva, sense that a storm is brewing. This is Zvyagintsev's despairing poetry on the toxic disconnect between loved ones, surveying the limbo between the way things are and the way it should be.<br><br>\"I'm pregnant, but it's not yours,\" Vera says unhurriedly, looking at her husband imploringly, eyes beseeching, as they lounge on the patio of Alexander's hilltop childhood home in the countryside, far away from the bleak greys of the industrial city where they reside. In that moment, Alexander realises the shift from mental to physical infidelity, less mindful to the betrayal he refuses to talk about than he is to his pride taking a dent. For the first time, the angular complexity of Lavronenko's face twists into a wordless rage that reveals his only response to the malaise rising within this marriage.<br><br>Alexander meets surreptitiously with his shady brother Mark (Aleksandr Baluyev), a criminal sort that needed stitching up and a bullet removed from his arm in the dead of the night just days before. Mark informs Alexander of a gun he left up in a dresser at their father's home. The moral landscape opens up here with two pathsto forgive or to kill. Both choices demand a hefty price, but remain acceptable as long as one is able to reconcile one's self with it.<br><br>Zvyagintsev creates a dreary mood piece, sustained with tension and a deeply burdening excavation of secrets and silence. There's an exploration of miscommunication here, not lies. The unspoken becomes just as virulent as falsities; the emotional estrangement between people becomes a source of dehumanising decay. The story of family is timeless in its essence, but intermittent, it's intrinsic morality however, is everything. Once again, the past has a way of rearing itself into the future. Just as Zvyagintsev saw profundity in the role of the Father in his mesmerising debut, \"The Return\", he sees the same here in the dynamics between parents and of spouses. The themes remain similar, but the religiosity of his enterprise is clunkier and more obtrusive.<br><br>While the acknowledged influence is Andrei Tarkovskynature and pastoral simplicity as it relates to the inner self and the interplay of religious iconographythe resonance of the camera is plainly Zvyagintsev's. The director, once again working with the cinematographer Mikhail Krichman, seems incapable of framing an ugly image: the open spaces of the golden countryside becomes stupefying and the creaky house itself hinges on a chasm, a solitary wooden bridge is the sole connection to a world outside the confines of family. As the narrative bends and folds, so does Zvyagintsev's virtuosity with visual chicaneryimages and shots blend into one another, revealing the webs of space and time.<br><br>For all its technical poise, Zvyagintsev's story lacks the emotional veracity of his debut. From each shot, right down to its script, everything is so precisely composed that the film becomes antiseptic beneath the tragedy by justifying its theoretical banality with intense symbolism and inorganic actions. Characters have weight but no realitythey seem becalmed, even unaffectedthey are ideas acted upon, props for a rambling parable and dangerously on the verge of evoking ennui. But in spite of its inherently languorous sermon, Zvyagintsev tackles the film with the cinematic prose of epic literature by enveloping the film with an aura of solemnity and disquiet.","user":"movedout","rank":[33,38]}]