[{"title":"Decide for yourself (I question the sincerity of IMDb votes to date)","rating":7,"date":"17 September 2006","review":"I saw this film at the New Orleans premiere and found it to be an interesting spectacle that I largely enjoyed watching. I'm writing to let the public know that the numbers look strange at this point (September 17, 2006). Why? Nearly 20% of the votes have been in the 1-3 range (which would rate this film to be in the ranks of the worst low budget films ever made). One voter has commented that he did not see the film, but hates Sean Penn's politics so he won't see it and will give the film a 1 just to spite Penn. At the same time, nearly half of the votes give the film a perfect 10. I don't think that the polarized ratings to date reflect careful attempts to rate the film. Perhaps that's often the case with IMDb. I suggest taking them with a grain of salt for the time being and deciding for yourself if you are interested in the film.","user":"gruenig","rank":[399,488]},{"title":"A powerful showcase of talent in a gripping film","rating":7,"date":"24 October 2006","review":"A door-to-door salesman, Willie Stark (Sean Penn), is a straightforward man with decent morals and a commitment to the common weal. Such a winning profile is quickly spotted by political hucksters who disingenuously persuade him to stand for Louisiana State Governor simply to split the opposition vote. Stark gets wise to this attempt to use him as a pawn and, in a dramatic turnabout, throws away a prepared speech and appeals to the people, declaring himself a 'hick among the hicks' who will stand up for the commoners' needs. Once made Governor, he does indeed set about popular reform programs, also hiring reporter Jack Burden (Jude Law) to dig dirt on anyone who stands in his way. Jack, unfortunately, comes from the wrong (well-heeled) side of town and soon finds his loyalties torn when Judge Irwin (Anthony Hopkins) refuses to publicly support Stark. Jack also has some unpleasant surprises in store as he is reunited with childhood friends Adam Stanton, a determinedly unmaterialistic character who doesn't want to be in anyone's pocket, and his luscious sister Anne (Kate Winslet), both of whom are tangling in different ways with Willie Stark before very long. This is a towering story set in the deep south, amid sweltering ideals and where goodness only comes out of the dirt - which means that everyone has some dirt on them somewhere.<br><br>All the King's Men is quality, heavyweight cinema with outstanding performances backed up by very professional direction and cinematography. Penn sets the standard, delivering one of his most moving demonstrations of carefully chiselled acting skills but, aided by a tight script and editing that doesn't waste a frame, every other actor also seems to be giving it their all in every frame. At well over two hours, it kept my attention all the way through, and a score by Oscar-winning composer James Horner served only to underline how effectively all these top talents are assembled.<br><br>Having given All the King's Men such accolades, you might think I'd be struggling to find fault with it but, although many of the elements might individually be worthy of an Oscar, my overall impression was that the film showcases a lot of remarkable talent rather than putting it to its finest use.<br><br>This is the second time Robert Penn Warren's book has been made into a major movie, yet we might wonder if much of the subtle analysis that space allows an author is being woefully denied filmmakers because of time restraints. Although the movie is to be congratulated for not using a trowel to lay on contemporary analogies about political power, corruption and oil, some character development in other morally ambiguous areas would not have gone amiss. Did power finally corrupt Willie Stark, and how far did he go in using criminals to further his beneficial public works? Penn creates a powerful figure, but the story, for all its tension, remains sadly predictable. The title is never clearly explained in the film, although it can elsewhere be attributed to a motto used by real life Governor Huey Long (on whom the story is arguably based): \"Every Man a King\" - which was part of a Share Our Wealth program of heavy taxation for wealthy individuals and corporations. In 1929, Long had called a special session of the legislature so as to enact a five-cent per barrel 'occupational license tax' on production of refined oil, in order to help fund social programs. What would originally have been complex trade-offs between a rich elite and an impoverished, post- Great Depression lower class, is in the movie reduced to high-sounding truisms about ideals and finding things of value. The rhetoric, forcefully delivered (as it is here) is an actor's dream, but although the story is beautifully and dramatically told, it lacks enough surprises, is heavy with the gravitas of its own self-importance, and may tempt some audiences simply to exclaim, 'So what'? Reading up on the background can supply a context that gives All the King's Men greater depth, but as entertainment it is a tour-de-force that is at the same time slightly unsatisfying.","user":"Chris_Docker","rank":[49,56]},{"title":"Don't believe the (negative) hype","rating":10,"date":"25 September 2006","review":"If there was one film in 2006 that suffered because of hype and rather uninformed critics, this would be it. First, the magazines played it up because of the all-star cast and fantastic source. Then, all of sudden, the nation's movie critics decided it wasn't what it was cracked up to be, and piled on it. One problem with the critics is that many of them clearly have not read the book. Richard Roeper complained in his newspaper review, for example, that the movie never shows you how Stark went from bad to good. Well, having reread the book in anticipation of the movie, I can state emphatically that that is because the book never explains it. Take your pick critics: is your criticism going to be that it's unfaithful or that it followed the book? Furthermore, the move is NOT a remake. The original All The King's Men movie, no matter how good it was, focused the story on Willie Stark. The real story (and this version) is focused on Jack Burden (which is why the whole backstory with Anne Stanton is thrown-in). To call it a remake shows how self-centered Hollywood can be (as fans of Brokeback Mountain are no doubt ruefully aware).<br><br>Now, what I thought of the actual movie: first and foremost, Sean Penn gives a absolutely brilliant performance, one of the best I've ever seen. I saw a Huey Long documentary a couple month before the movie, and Sean Penn evokes him magnificently. The scene where Willie Stark is stumping the state is simply film-making brilliance, as are his several hauntingly shot speeches. Jude Law gives a fine performance, as do all the supporting actors, especially Patricia Clarkson, who nails Sadie Burke. Some people had a problem with the accents, but I thought that Jude Law and Kate Winslet did adequate impressions and did not lose anything for it. And of course, the power of Warren's story shines through the whole movie. I do not personally know anyone who did not really like the movie.<br><br>Why did it not work with people? I'd say two reasons: first, first-person narrated classics are notoriously difficult to translate to film. Another example that comes to mind is The Great Gatsby, which has a similarly detached narrator, and did not succeed despite Robert Redford, Mia Farrow, Karen Black and Sam Waterston among the ensemble. Second, to be brutally honest, if your favorite films are normally comedies or horror movies, you won't like this kind of movie.<br><br>All I can say is that I am surprised and somewhat astonished at the negative piling on. For any moviegoer who likes an epic story of humanity and politics in their harsh reality, All The King's Men is a must-see.","user":"peregrine1988","rank":[104,129]}]