[{"title":"Good fun ghost story","rating":8,"date":"8 May 2008","review":"Well made ghost horror might not be the greatest movie ever made, but manages to entertain effectively.<br><br>Let us first of all say that this movie does exactly what it says on the tin. It is a ghost story and never pretends to be anything else. Anyone looking for a highbrow horror tale here can look elsewhere.<br><br>Getting back to the story though, and a family with a mysterious past move to a new home in the middle of the country, a home with a chequered history of its own, and it is not long before daughter Jess encounters the secrets of the house...<br><br>Husband Roy is desperate to make a go of this new life, by making a successful harvest with the fertile soil in the fields next to where they now live, and despite some troubles between mother and daughter it seems that they are going to try putting their problems behind them.<br><br>The house has other ideas though.<br><br>The Messengers makes no apology for what it is - an old-fashioned ghost story with a hint of horror and which benefits from a slightly shallow plot to aid with fast story telling and scares. Yeah, it's not exactly earth shatteringly terrifying but it does a better job of building tension than most of its peers.<br><br>Its special effects are reasonably decent, and never look too fake bar bar one single occasion in the cellar.<br><br>The acting too is acceptable and does the job - Kristen Stewart does her best with the material and produces what the role requires.<br><br>But the fun here is with the overall feel of the movie - it just works as long as you don't try to expect too much from it.<br><br>The only oddity is 'Cigarette Smoking Man' from X-Files William B Davis making an unnecessary and pointless appearance twice as a real estate broker - a side story which was totally inept and served no purpose and gave the actor all of 20 seconds of screen time.<br><br>That aside, good movie and worth seeing as long as you don't expect more than it is.","user":"Danny_G13","rank":[15,15]},{"title":"Nothing new, but not unwatchable","rating":6,"date":"1 February 2007","review":"I saw this one tonight at a screening, and I wasn't entirely disappointed. I'll be honest -- there's nothing new in The Messengers. It's all been seen before in earlier, more original movies. This one is kind of a \"best of\" reel of some good ideas from other horror movies. If you're looking for something original and scary, this isn't it. If you're looking for a little jumpy fun, I can't say this one is a miss. By virtue of the \"good ideas\" being good, they work. What it lacks in originality it makes up for in assembling them in a reasonably coherent manner.<br><br>My only real gripe is that Dylan McDermitt looks about as out of place working the fields of his farm as any actor I can think of. They could have at least tried a LITTLE bit harder casting that part.<br><br>Think The Birds + Ju On + Amityville Horror + Sixth Sense.","user":"mrmatt14","rank":[99,130]},{"title":"Scary? No, But It Serves Its Purpose Of Entertaining","rating":8,"date":"18 July 2007","review":"If you aren't expecting some super-scary or gross film, just a mild ghost-type story, this fits the bill just fine. That's all I expected and I entertained for an hour-and-a-half. Is this some award-winning film? No, Is is genuinely scary? No, but it isn't anywhere near as bad as all these reviews say it is here, either.<br><br>What I liked best about this movie was the photography. It was stylishly filmed and I enjoyed the bold colors, decent direction and nice rural scenery. Who doesn't like looking at large groups of sunflowers?<br><br>I had no trouble with any of the characters, either. Since it was partly one of those \"you don't listen to me,\" teen girl flicks, I expected some snotty kid was Kirsten Stewart was fine as 16- year-old \"Jess.\" Dylan McDermott and Penelope Ann Miller played nice enough parents, too. <br><br>The twist near the end was good after that was revealed, you got the normal clichés with the climactic action scene. That was kind of cheesy, I admit, but most of the film was just fine with me. For what I expected, I have no complaints. It's a decent flick.","user":"ccthemovieman-1","rank":[41,51]}]