[{"title":"i really don't understand why so many bad reviews","rating":8,"date":"9 May 2018","review":"I really don't understand why so many bad reviews, infact i found this movie not so bad, even a nice one funny and entertaining.\nof course is a light movie and nothing so special, but if you want a light comedy with several funny scenes and laughs that could be ok.","user":"francesco-trio","rank":[22,24]},{"title":"Yet Another Putrid \"Comedy\"","rating":1,"date":"1 April 2013","review":"I must sound like a broken record, but once again this horrid film proves that Hollywood simply cannot make a decent comedy anymore. This one has the same things they all do now- tons of juvenile potty humor, gratuitous male nudity (and in a rarity, a brief topless female), and a predictable, disastrous message. The male nudity, by the way, includes a close up view of a male's penis. <br><br>As usual, the males in the film are made out to be the bad guys. Two hapless husbands, who are guilty of nothing more than ogling women here and there, are granted a \"hall pass\" by their wives. This idea comes from their friend, played by the odious Joy Behar, who is no actress and can barely recite her lines. The men are told that for one week, they can do whatever they want, and pretend they aren't married, while the wives take the kids out of town. <br><br>In an utterly foreseen twist, the guys turn out to not even be capable of talking to girls, let alone sleeping with them, while their wives are partying up a storm with hot younger athletes. Meanwhile, we are treated to a running gag that could have been penned by most third graders, of the guys' fat friend constantly uttering \"I have to poo.\" In a truly artistic scene, we are treated to this man's fat bare bottom taking a dump in a sand trap on a golf course. Talk about hilarious! <br><br>Owen Wilson eventually turns down the hot 21 year old who had been his children's babysitter, her hot 40 something aunt, and the gorgeous blonde Australian chick who had been the object of his fantasies. He doesn't even get to kiss any of them. His hapless friend is similarly unlucky. Meanwhile, Christina Appelegate, as the other husband's wife, does sleep with a younger guy. Afterwards, she says \"this can't happen again- I love my husband.\" <br><br>This is the message that has been coming out of Hollywood for some time now- a wife can have an extramarital affair, but the husband cannot, or at least if he does, the marriage is over. We saw this even in Family Guy, when Lois slept with Bill Clinton, but Peter inexplicably backed out of sleeping with his date, so the writers solved that by having Peter sleep with Bill Clinton, too. Ugh. <br><br>When the hapless other husband reunites with Christina Applegate, he gets down on his knees and apologizes. \"For what?\" the audience might ask. He didn't really do anything wrong. But his wife sure did. And does she admit this, or apologize herself? Nope. Guess again- she accepts his ridiculous apology with a canary-that-ate-the-kitten smile. Nice message there for everyone. <br><br>This movie was not as awful as the Judd Apatow stuff, or quite as unfunny as most of Adam Sandler's and Will Ferrell's \"gems,\" but it is still thoroughly offensive.","user":"donjeffries","rank":[69,97]},{"title":"Do you hate males? You'll love Hall Pass!","rating":1,"date":"3 December 2011","review":"Do you think men are all bumbling incompetents who can barely dress themselves? If so do yourself a favor and check out this gem!<br><br>***SPOILERS!!!!*** Did you know that married men BLATANTLY check out other women CONSTANTLY!!!??? ME NEITHER!!! This information had NEVER come up on my radar and thus the fact that this was pointed out several times in this movie was absolutely hysterical! I'm so glad that JB Smoove &amp; Stephen Merchant found time away from those AWFUL television projects that they're involved in! I just don't understand why Larry David &amp; Ricky Gervais continue to hold these guys back! They should totally continue down this road where they FINALLY have some good writing behind their performances! <br><br>This this the best Farrelly brothers movie since Stuck on You!!!!!!!!!","user":"ChrisMangan","rank":[65,91]}]