[{"title":"A Strange, Dark Psychological Thriller","rating":10,"date":"15 October 2009","review":"I watched this by accident. I was looking for another movie, a comedy about a man who thinks he's a character in a novel (which turns out to be STRANGER THAN FICTION). Comedy, Jim Carrey, I thought this had to be it. I was wrong, and boy, am I glad I goofed.<br><br>Carrey plays Walter Sparrow, a fairly ordinary-seeming man, an animal control officer whose wife Aggie (played by Virginia Madsen) happens to buy him what seems to be the only copy of a self-published novel, THE NUMBER 23. But as Walter reads the book, the story of a homicide detective named Fingerling, he finds the character reminding him of himself. As he reads of the character Fingerling's descent into obsession and madness, he becomes increasingly disturbed himself, and goes hunting for the pseudononymous author, determined to find out what it all means. The answer uncovers a dark secret involving a murder committed over a decade ago, and alters the lives of Walter and his family permanently.<br><br>I won't say more, it would give away too much, but I found this wonderfully acted, beautifully written, and altogether involving. Carrey excellently plays both Walter Sparrow and Dec. Fingerling (in scenes from the novel shown as Carrey reads it), Madsen shines as loving housewife Aggie and novel character Fabrizia, and the supporting players turn in excellent performances, particularly Lynn Collins as the novel character Suicide Blond. The photography is frequently dark and threatening, which fits the plot, the sets are marvelous, and the climax is perfect.<br><br>I hope Carrey does more serious roles. This movie proves he's not just a funny rubber face.","user":"saintonge","rank":[52,65]},{"title":"Just because you're paranoid....","rating":7,"date":"28 February 2007","review":"9/11 2001, 9+11+2+1= 23, JFK was killed on November 22, 1963 2+2=4 and 1+9+6+3=19 and 19+4= 23, Caesar was stabbed 23 times, and so on so forth.<br><br>Whether you think it's a coincidence or not it's still pretty cool and Joel Schumacher's the Number 23 wouldn't have been half as interesting without his knowledge.<br><br>The film follows Walter (Jim Carey) as his life starts to be consumed paranoia as he claims the number 23 is haunting him. He comes to this conclusion whilst reading a book, the Number 23 which he draws parallels with the main character's upbringing and his own childhood. The only problem being, said main character a detective Fingerling kills his lovely girlfriend. As everything in the book already mirrors Walters past, why shouldn't it mirror his future also? Worried that he'll kill his wife, Walter attempts to track down the author before it's too late.<br><br>Though it's easy to throw insults at Schumacher (Batman and Robin anyone?) he is good at thrillers being at the helm of Falling Down and Phone Booth. Here he delivers again. True, the ending may be a little drawn out and may not be to everyone's taste, however Carey's performance is once again proof that the rubber faced actor can indeed, wellact. It's just a shame that with every serious performance by Carey, critics scrutinise his performance because it isn't comedy. Have they seen the Truman Show, Eternal Sunshine.people? Carey can act. And Schumacher can direct, the only problem here is the plot isn't that strong, with the twist maybe feeling a little anticlimactic. Still it's an enjoyable film and may have you looking for the number 23 yourself when you leave the cinema.","user":"Simmy41","rank":[158,216]},{"title":"Watchable, not Wonderful","rating":6,"date":"24 February 2007","review":"There has been a great deal of critical scorn directed at 'The Number 23', which almost made me rethink my decision to see it, despite finding the concept very enticing, being impressed by the promotional materials, and generally liking Joel Schumacher as a director (yes, Batman and Robin was awful, but he's directing some very good films like The Client, Phone Booth and The Lost Boys) And after seeing the finished product, I find myself asking why the knives are out for the film. Now, I'm not saying this is a brilliant film, because it isn't. It's rather easy to guess the plot twists, the script does tend to patronise the viewer and the final segment of the film casually abandons the central premise in favour of a more generic 'mystery' storyline. But I found quite a few things to like about the movie, such as strong performances from Jim Carrey and Virginia Madsen, very stylish direction and (for most of the movie)a genuine undercurrent of tension as the events unfold. It's not going to be remembered as a highlight on the careers of anyone involved, but if you enjoyed conspiracy theory novels such as The Da Vinci Code or shows like the X-Files, you are more likely to see past the critics and enjoy this film. <br><br>Final Score 6 (which is 2x3)/10","user":"falkar","rank":[259,378]}]