[{"title":"Tormented Souls","rating":8,"date":"24 October 2008","review":"In Germany, the elder Frau Traude Krueger (Monica Bleibtreu) gives piano classes in a prison for a few prisoners and the security guard Mütze (Sven Pippig). When she sees the rebel and aggressive Jenny Von Loeben (Hannah Herzsprung) playing piano, she immediately identifies her potential and offers to teach her for a competition. Frau Krueger finds that Jenny was a prodigy when she was a child; abused when she was a teenager and has been imprisoned for murdering and decapitating a man. Along the period they work together preparing for the exhibition, Frau Krueger discloses secrets about her love in World War II while the self-destructive Jenny has four minutes of glory and recognition of her talent.<br><br>\"Vier Minuten\" is another powerful and engaging German movie, disclosing the story of two women having nothing in common but their passion for music and tormented souls. The non-linear beginning is quite confused, but provocative and intriguing (I saw this movie on DVD and I watched the first chapters again to get a better understanding); however, after ten minutes, the story becomes intelligible with the development of the characters, supported by magnificent performances and wonderful cinematography. The story is deep and touching, and viewers that enjoy superficial Hollywoodian fairy tales may not like this dense drama developed in low-pace. Monica Bleibtreu and the lovely Hannah Herzsprung have top-notch performances that deserved nomination to the Oscar. The conclusion is thrilling and heartbreaking, and will probably make the eyes of sensitive viewers wet. My vote is eight.<br><br>Title (Brazil): \"Quatro Minutos\" (\"Four Minutes\")","user":"claudio_carvalho","rank":[29,30]},{"title":"Exciting and thought-provoking film!","rating":8,"date":"20 June 2007","review":"I am still feeling quite spellbound, after seeing the film \"Vier Minuten\" this evening! The director's<br><br>opening sequence, with skillful use of silence and a relatively slow pace, immediately caught my attention. The photography was excellent and the acting superb. The story, although slightly contrived, was engaging. I feel that the subplot was not really connected to the main story and could have been developed further. The music was most enjoyable, but I feel that, although music features to a large extent in the film, it is not meant to be a showcase for the music, but rather as a tool to explore the relationship between Frau Krueger and Jenny. This is exceptionally well depicted and the acting absolutely brilliant!<br><br>I feel that there is a great depth to this film, which probably needs more analysis than I have had time to give it. I should like to see the film again and wish I could see a version without sub-titles. It is so tempting to peek, thereby missing all the nuances of the wonderful characterizations.<br><br>I would recommend this film to anyone interested in intelligent acting and who wants to be able to reflect on a film's deeper meaning, rather than just be superficially entertained. I enjoyed \"Vier Minuten\" and although it was set in a rather grim environment, I found it uplifting, rather than depressing!","user":"annamargaret1948","rank":[40,43]},{"title":"Brilliant Relationship Drama and 4 minutes you will not forget.","rating":9,"date":"29 October 2006","review":"Really excellent film - the two leading ladies give stella performance as an elderly piano teacher (with some interesting secrets left over from German war times) and as a young, brilliant, but disturbed, pianist.<br><br>The backdrop of a women's prison and its local dramas and characters is a fascinating stage as their relationship develops their pasts come influence their actions and trust is built. (And no, it is not one of those touchy, feely Hollywood set-ups, this has real depth).<br><br>The \"4 minutes\" the title refers to, is a film sequence which I personally found incredible, I still get gooseflesh down my back when I think back to it. The audience in the cinema I saw it spontaneously burst in to applause at the end of the 4 minutes.<br><br>All in all a thoroughly worthwhile film, although there is quite a bit of German history, some knowledge of this would be of use and I am not sure how it would translate from the original German. Some excellent comedy intersperses the intensity of the drama  but all credit must go to the main actors. Really good  go see it..","user":"IJKMan","rank":[72,84]}]