[{"title":"This is an excellent movie, why didn't it receive an Oscar","rating":10,"date":"24 April 2018","review":"This is the most enticing film I have ever watched. A true master piece displaying the true artistic integrity of film. The underlying themes of a monotheistic society exploring the themes of Christianity and the teachings of the lord. A true masterpiece that really is a work of art and one of the most fabulous film I have ever witnessed. Nicholas Cage has a Masterful performance as Speckles and should have won best supporting actor. This film is ground breaking in the way of unconventional story telling. I love this movie, it cured my depression. Thank you Hoyt Yeatman, beautiful film, 10/10","user":"dk-52874","rank":[22,26]},{"title":"It's quite good, actually.","rating":7,"date":"24 November 2009","review":"I don't understand why this movie has a current rating of 4.7/10. I loved it! True, some characters could have been given a meatier role. But overall this is a good, sweet one with plenty of action and excellent animation. Penélope Cruz sounds sexy (as usual), and Nicholas Cage is unrecognizable as Speckles the mole (I didn't know it was him until I saw the credits), but he's terrific. And though they appeared for a total of a little over few minute, Bucky the hamster (who is a quarter ferret) and the three mice were adorable.<br><br>I'll recommend this movie to anyone looking for a good laugh on a lazy afternoon. And for the kids! 7* out of ten!","user":"preetharoy","rank":[31,42]},{"title":"A team of highly trained rodents use their combined skills in covert special-ops","rating":5,"date":"26 July 2009","review":"Who doesn't like guinea pigs? I wouldn't be surprised if Cavy sales rise after the impression these CG 3-D specimens create in the PG audience. Their mouths alone are cutely depicted and entertaining in their own right. <br><br>I had read a small unflattering local review and didn't want to waste my time. My 8 yr. old Son, however, got his own idea from the trailers, and wondered how a \"review\" could possibly say it was \"no good\" as I had reported. So I took he and his 10 yr. old buddy to the matinée.<br><br>I'll admit there were a couple of wordy moments where the illusion was broken for me, but on the whole, with the involving 3-D effects, there were enough chuckles and action to leave me wondering why it was trashed. I've seen much worse. I liked it better than Alvin &amp; the Chipmunks, and Up... but I think Monsters VS Aliens was more re-watchable.<br><br>As we left the chilly theater to enter the hot afternoon, I asked the boys what they thought. \"It was awesome!\" Well, not my exact thoughts but it wasn't a bad distraction from more serious current affairs.","user":"goesling","rank":[46,70]}]