[{"title":"Marvellous Ending","rating":10,"date":"1 March 2018","review":"The message of this film is that there is no symmetry to life. What goes around does not come around. The fall of the coin has no bearing on the way the cookie crumbles. There is no right or wrong to the fates of men. No justice. Opportunities seized may lead on to fortune, but they could just as well lead on to dusty death. Only children expect things to be fair. As things once were they need no longer be. Now that IMDb has decided to list reviews by date there is a slightly increased possibility that this effort will be read by someone. Performance reviews are absolutely not read by me for helpfulness, but for interest and entertainment.","user":"chaswe-28402","rank":[406,453]},{"title":"A Look into an Abyss","rating":10,"date":"20 June 2013","review":"I expect a film like 'No Country for Old Men' to be polarizing for some, especially if they're expecting a big finale with the good guy and the bad guy drawing their guns in the end to settle the score. 'No Country for Old Men' is a film that dabbles more in existentialism, despite all the crime that occurs. Basically, what I'm saying is that the film adapted from the novel is very unconventional not only for its genre, but also in its approach to storytelling. What the Coen brothers do best is combining altogether different elements and creating something with its own unique character. While there are subtle throwbacks to the old wild west, the story takes place in modern society where technology has advanced, society has advanced and unfortunately crime has too.<br><br>What are Anton Chigurh's true motives? Does he have a philosophical doctrine that we the audience are unaware of or are just unable to comprehend? What Anton does is create a lot of questions that arise from his actions and his interactions with the other characters. To watch a character as odd as him is fascinating and I cannot give enough credit to Javier Bardem in portraying such a character that is so enigmatic and just his presence alone is able to evoke so much mystery. Even though Anton is very incomprehensive, it is all made up for by being able to be somehow captivated by him.<br><br>How every character deals with Anton is interesting, to say the least and as the film progresses, the feeling of despondency increases gradually. The lack of heroes is what gives this film its sense of hopelessness and that feeling of hopelessness is basically set in stone from the first few shots coupled with Tommy Lee Jone's epic voice-over narration in introducing the story. It is the perfect introduction to what we will witness in the story and what it all means for a sheriff like him in comprehending these events. As the events occur, we the audience reflect on these situations just as much as Sheriff Ed Tom Bell. Tommy Lee Jones' performance in this role is impressive and is injected with a great sense of humanity. I commend his portrayal as Bell, in that he is the character who carries the weight of the story.<br><br>The acting is a huge fragment in bringing this film to life, but what also does that is how the visuals are executed and it is definitely utilized to a great effect. From its majestic shots to its beautiful lighting and color tones, the Coen brothers set a mood that permeates the whole film. Its barren settings really add a feeling of desolation that is at the same time hypnotic and surreal. While the film can be suspenseful and its suspense is definitely executed perfectly, the film still somehow manages to maintain an air of mystique. The non-existence of a soundtrack really gives the film a feeling of loneliness, all the while adding an even greater sense of sterility to its already barren wasteland.<br><br>I can go on and on about the great acting, its memorable shots and its great script, but what makes 'No Country' a great film is that it manages to be truly idiosyncratic in its execution just like how the Coen Brothers' other great films are. Even if a film like this leaves me more questions than answers, if it still manages to captivate me to a point that I'm willing to return to it, then that shows that it doesn't matter if I don't have any answers to my questions. There are only a few films that are able to pull this off naturally and 'No Country for Old Men' is definitely one of those special films that can do just that.","user":"Sonic_Ocean","rank":[32,39]},{"title":"Coens firing on all cylinders. Brilliant.","rating":10,"date":"16 May 2007","review":"If this doesn't end my year in the top two films of the year then we are in for one hell of an awesome year of movies.<br><br>The new film from two of the best filmmakers working today No Country For Old Men shows the talents of the Coen Brothers on top form. After a couple of disappointments (Intolerable Cruelty had flashes of Coen genius but felt more of a Coen imitation than the real thing; Ladykillers had the odd funny moment but was the blandest film the brothers ever made, and there's just no excusing Marlon Wayans!) they knock this violent western drama out of the park.<br><br>More in the vein of their superb early mostly-serious efforts Blood Simple and Miller's Crossing (my personal favourite of the Coen back catalogue) No Country For Old Men is a slow-moving, character-driven masterpiece about uncompromising and uncompromised characters. It is very violent and bloody and not always for the squeamish.<br><br>Shot through with moments of humour these come, as in life, from real situations and observations so don't be fooled into thinking this will be the serious film with goofy-characters Coens of Fargo. No Country For Old Men is a tough, gritty story.<br><br>The unrelenting pace may take its time but you are gripped every moment. This is a thriller that genuinely thrills.<br><br>Javier Bardem gives the best performance of his career. And, yes, I have seen The Sea Inside and he in superb in that but here he is simply extraordinary. It is a portrayal of unrelenting evil, of true derangement, of a human being with no shreds of humanity that ranks at the very top of studied film psychopaths. And I say film not movie because this is not a clichéd character. This is not a character whose lunacy you enjoy over popcorn. This is one of the most frightening performances ever committed to celluloid. I felt truly nervous of what was going to happen every time he walked on screen.<br><br>Josh Brolin essentially carries the bulk of the movie and he is excellent in a role that challenges him. I have never seen him perform to this level and if Bardem didn't steal the film you'd be talking about Brolin all the way home. As it is this gives him a showcase for his talents that should see him get a lot more attention.<br><br>Tommy Lee Jones is used sparingly but to great effect. Sounding more like Michael Parks than ever before his scenes pepper the movie with a wearied view on a world he doesn't really like or understand to great effect.<br><br>I did find Stephen Root a little distracting as i have never seen him in a serious role before and he just looks amusing but he is in very little.<br><br>Roger Deakins' cinematography is breathtaking as usual and the Coens' script is superbly crafted. There are moments, almost asides from the main plot, that would be superfluous in most scripts and excised in most studio films but which work perfectly in the overall context of the movie as only the Coens can achieve. One scene featuring Bardem in a gas station is up there with the best scenes i have ever seen on film.<br><br>I have not gone into the plot here because I saw this film having not read Cormac McCarthy novel and knowing little other than the basic log-line - a man out hunting comes upon a scene of dead bodies, guns, drugs and money on the Mexican border and comes to the attention of both those behind the scene and a local world-wearied sheriff - and i think that's the way to see this film.<br><br>Go in knowing as little as you can but knowing at least this: this is a serious, violent, slow-paced character piece from the Coens. This is not a Fargo. If you are squeamish don't see it. If you have a short-attention span don't see it. If you only love the Coens for their fantastic comedies like O Brother and Big Lebowski and the comedy/thriller Fargo don't see it. But if you want to see an intelligent, superbly acted, powerful, beautiful cinematic treat that will remind you of the true power of cinema see it, see it, see it. It's a masterpiece. Bravo Ethan and Joel.","user":"motta80-2","rank":[1,1]}]