[{"title":"Inhale","rating":8,"date":"24 March 2006","review":"You'll need to inhale, then exhale slowly and relax before plunging into the world of Nick Naylor (Aaron Eckhart), lobbyist and bag man for the Tobacco Industry. The laughs are some of the best abdominal exercise I've ever had at the movies. Thank You for Smoking is far and away the best satire to come out of Hollywood in years. The last attempt I remember was WAG THE DOG. This film is far better at true satire, its wit biting do-gooders and do-badders alike. It has been too long since Satire and the Politically Incorrect Sense of Humor have been allowed to point out the absurd in all sides of an issue. If you don't laugh out loud, your sense of humor has become a casualty of malpractice by the Doctors of Spin and the Nursemaids of Political Correctness.<br><br>Young Jason Reitman's direction and screenplay are deft and light. He is never heavy-handed, or worse, condescending (as may have happened more than once in WAG THE DOG). Based on a novel by Christopher Buckley (the son of William F. Buckley), the script is the star here. The double, triple, and sometimes quadruple entendres are spoken conversationally by a star-studded ensemble cast, who clearly revel in great material and great lines. Every reviewer opines that this will be Aaron Eckhart's break-out role. With his Dudley-Do-Right face and \"that guy who always gets the girl----- on crack\" charm and glibness, his Nick Naylor is the ultimate purveyor of the spin doctor's prescription: \"the means justify the end\".<br><br>The casting director should be congratulated in the same breath as the director. Rob Lowe as the \"genius\" behind Hollywood \"EGO\", a consultant firm which helps raise financing for movies with strategic product placement, is note-perfect in a \"small role\". With William H. Macy, the Vermont Senator who takes on the tobacco industry, Maria Bello, a fellow Merchant of Death lobbyist, and Robert Duvall, the \"Captain\" of this particular industry--- the cast is jaw-dropping, and sublimely funny. Katie Holmes, pre-TomKat, is gorgeous, seductive, and completely believable as the reporter who stops at nothing to get her story.<br><br>Nick Naylor's relationship with his son is the lens which focuses Nick on his own behavior. Even that relationship is not treated as a cliché, or completely reverently by the satirist, who remains true to the last frame to the goal of letting the air out of our self-righteousness. It is a breath of fresh air. I not only recommend it, I intend to see it again.","user":"bitcetc","rank":[230,262]},{"title":"\"Thank You\" for a good satire!","rating":25,"date":"25 March 2006","review":"First of all, sorry for the cheesy title. I couldn't help myself. Second of all, \"Thank You for Smoking\" is, in fact, a darn good satire - one of the best I've seen since \"Election\". Aaron Eckhart holds the picture together with a witty, charismatic performance as a tobacco lobbyist. The film is basically about his profession as he spins the news, pitches a movie idea, dodges a subpoena, has an affair with a reporter (Katie Holmes), tries to spend time with his son (Cameron Bright), and has lunch with an alcohol lobbyist (Maria Bello) and a firearms rep (David Koechner) - where they literally compare body counts. The performances are excellent across the board, from William H. Macy's crusading Senator to Rob Lowe's smirking Hollywood agent who struts around his office in a kimono. Even Adam Brody is enjoyable as Lowe's hyperactive assistant whose in-joke with a co-worker earned one of the biggest laughs of the movie.<br><br>The majority of the credit, however, needs to go to first-time feature director Jason (son of Ivan) Reitman. Adapting from Christopher Buckley's novel, Reitman has fashioned an enormously clever script, consistent and strong in character, yet not forgetting to be incredibly funny. The style is also perfect - brisk, light-hearted, with impeccable timing marred only by a tangental subplot including Sam Elliott that is, sadly, not very funny. Overall, however, the pace is fast enough where the laughs keep coming.<br><br>Reitman also does the unthinkable: he keeps the satire dark and funny to the very end. While most comedies stray blindly into the sentimental, \"Thank You\" avoids unnecessary emotional tripe and - thankfully - avoids sermonizing about the dangers of smoking or of the flaws of the political process. Eckhart's flawless performance and Reitman's wonderful screenplay anchor an uncommonly perceptive comedy, provided you take yours black. If you need a little cream and sugar, \"Fun with Dick and Jane\" might still be at the dollar theater.","user":"paxatron","rank":[187,220]},{"title":"Entertaining and Honest...","rating":8,"date":"13 September 2005","review":"Just saw this as it premiered in Toronto - awesome cast, very funny dialog, and more than skin deep. First time director does a nice job - and the opening credits are noteworthy. RECOMMENDED. Pokes fun at the smoking industry (and lobbyists), but at others as well, and its hard to disagree with the sharp satire. Rob Lowe's small role is priceless, the casting was perfect across the board. Nick Naylor's (Eckart) relationship with his son is center and keeps some genuine qualities through all the laughs. My friend and I both rated this near the top or at the top of the 7 films we saw in Toronto last weekend. Not sure what its distribution / release schedule is yet, as there was still some debate over who had actually purchased the rights to it. Eckart in person came across as very genuine and is also in another great upcoming movie - Neverwas.","user":"jak_wonder","rank":[197,257]}]