[{"title":"surprisingly good","rating":23,"date":"23 October 2011","review":"I was pleasantly surprised to find this movie was way better then I expected. Some of the humor is a little subtle for what you might expect. One scene I liked was toward the end when the box boy gang is coming down the main aisle with Zack next to the Andy Dick character who can barely see thru his coke bottle glasses. Dick starts veering off to the side and Zack puts his arm out and pulls him back and they continue on as if realigning someones walk is a normal event. The movie isn't intended to reinvent Shakespeare but some of the harsher reviewers seem to judge it in that light. I thought Jessica Simpson was a good choice for her part. Any lack of acting ability fit the part just fine and works. It was a pleasant and funny movie to watch and never resorted to throwing in four letter words just to do it like so many movies will do.","user":"tomntempe","rank":[26,29]},{"title":"I wasn't expecting much...","rating":8,"date":"14 January 2007","review":"I wasn't expecting much, but I was pleasantly surprised. I laughed at several witty lines, especially one where Zach corrected Vince's grammar, but Vince didn't get it. Even Jessica Simpson didn't bother me because they didn't try to inflate her intelligence; they just made her a rather bland character. <br><br>The plot isn't original, but watching Vince pretend he was Tom Cruise from Cocktail made me laugh. When I watch this sort of movie I want to laugh and I did just that. Dane Cook was a pleasant surprise too. I had never seen anything with him. I thoroughly enjoyed the movie even though I didn't think that I would.","user":"aalexakisfan","rank":[85,114]},{"title":"Are you kidding?? GREAT MOVIE","rating":7,"date":"6 January 2007","review":"I was hardly amused when I saw the previews for this movie. It didn't look that good, I'm not that big of a Dane Cook fan (and in no way a Jessica Simpson fan), and I didn't enjoy \"Waiting\" too much (though I'm not sure how much that relates). This movie has more wit than it knows what to do with, and I laughed out loud numerous times. All the acting was spectacular and I was surprised to find that the writing had equal amounts of humor and heart.<br><br>To come into it thinking it was going to be terrible and coming out thinking it was one of the better movies I've seen in a while, I'd say that's an accomplishment. Though its only my opinion of course, check it out if your curious.","user":"SpidermanPez","rank":[88,135]}]