[{"title":"Perfect Portrayal of an Autistic Spectrum Disorder Child","rating":10,"date":"20 January 2012","review":"I have read a LOT of reviews from people who seem to know absolutely nothing about children with Autistic Spectrum Disorders. Thomas Horn did an excellent job portraying one. He was very moving in everything he did! I know he did a great job because I have two children with the disorder and he fit perfectly between their two levels of autism. Does he have big beautiful eyes... sure. Don't knock the kid because he looks good. He was spot on with his acting! This story has you feeling all sorts of emotions and by the end of the movie we had all shed a lot of tears. And the tears were caused by what the child was doing to handle his grief and understand why his dad was taken away from him and NOT because it had anything to do with 9/11. My son had lost his mom and the movie brought back all sorts of emotions because he could relate to the child perfectly. This movie has replaced Billy Elliot on my list of most moving story. Not everyone can enjoy this kind of loving and sophisticated story so it might not be for everyone but if you have a heart and have ever lost a parent, I am sure that you will love this movie! Another moving story brought to us by Stephen Daldry!","user":"Robert-872","rank":[324,459]},{"title":"This movie will stay with me for the rest of my days.","rating":9,"date":"17 February 2012","review":"At thirty minutes in I was wondering who would be the first to leave the small audience in the cinema. By the end of this movie I, and the few others, simply sat with our metaphorical mouths agape at the impact of what we had just seen. A slow, meandering, and with hindsight, entirely necessary beginning gives way to a riveting and gripping story. A story which you would expect to bring you to tears (and it will for some) but is ultimately about triumph. It may appear to be a story about 9/11 and such was the enormity of that event that it would be easy to suggest that this is just an excellently acted and well-crafted story about that day. That would be to undersell this movie. 9/11 is just the vehicle which carries the message of how our everyday, minor irritations with other people and our general lives are simply unimportant in comparison to the reality that most people are just trying to do their best in our jobs, our marriages and in our relationships. We are imperfect and the enormity of 9/11 hammered that home. These couple of hours repeats the exercise. But this movie does more than use the day's story in such a simplistic way. Rather, it weaves the tragedy into the story of lives that are already living with sadness and it allows those participants to view their personal tragedies in the context of the much bigger one. To use the \"device\" of a compulsive child (what a performance!)forces us voyeurs to focus more clearly on the everyday minutiae which both he and we come to see as insignificant. A wonderful experience...this movie will stay with me for the rest of my days.","user":"greg-1260","rank":[198,277]},{"title":"A haunting and lovely tale of a boys journey to keep his father alive in his memory.","rating":10,"date":"28 January 2012","review":"I personally loved this movie, and was shocked to see such negative reviews. I loved the fact that it centered around 9/11, as I think as painful and emotional as that was, we should NEVER forget it. I thought that the acting was superb and the scenery of NYC was wonderful. I loved the message and even though I was emotionally exhausted by the films end, I still felt good after seeing it. I give this film 10 stars and hope to see it receive many awards. I'll be owning it on DVD when its released. The acting by the whole cast, although the boy carried the movie almost single handily, was great, and this movie seriously touched my heart.","user":"whitx5","rank":[158,268]}]