[{"title":"A pleasant surprise...","rating":6,"date":"27 July 2010","review":"I had never heard of \"Memory\" till I purchased it on a 4-movie \"Horror Collector's Set\" DVD from the bargain bin. In addition to \"Memory,\" the other three movies on the DVD were Tobe Hooper's \"Mortuary,\" \"Wages of Sin\" and \"Bloody Mary.\" \"Mortuary\" wasn't too bad but the other two films were flat-out awful, so by the time I sat down to watch \"Memory\" I really wasn't expecting much. Imagine my surprise when it turned out to be the best movie on the DVD, even though it certainly isn't what I would consider a \"Horror\" movie. \"Memory\" is a fine mystery/suspense thriller along the lines of a James Patterson story (think \"Kiss the Girls\" or \"Along Came A Spider\") with some occasional horrific overtones.<br><br>Billy Zane of \"Titanic\" stars as Taylor, a researcher for a pharmaceutical company who is accidentally exposed to an unknown drug compound while in Brazil for a convention. When he returns home to Boston, he begins having disturbing flashbacks of a masked person in a black cloak, dark forests, and little girls. Disturbed by these visions, he begins to do some research on the powder he touched and it turns out that Indian tribes in the Amazon have been using it for thousands of years to see other people's memories, through their own eyes. Unfortunately for Taylor, the person whose memories he's now \"sharing\" happens to be a psycho who's been kidnapping and killing little girls for the past 30 years without being caught. With the help of his artist girlfriend (Tricia Helfer of \"Battlestar Galactica\") and two family friends (the late great Dennis Hopper and Ann-Margret) he takes it upon himself to unravel the mystery and stop the masked kidnapper before he can claim yet another new victim. As his investigation moves along, it seems that the killer also has a connection to Taylor's past that he has never suspected.<br><br>Though this was obviously a low budget film (from a first time writer/director) \"Memory\" is a nice looking film and a tight, fast moving effort. The veteran cast turns in fine performances all around, and the twists and turns of the plot will keep the viewer guessing till its creepy finale in the kidnapper's lair. This is also the coolest set piece in the movie, a cavernous building loaded with scary looking mannequins and bizarre scrawlings on the walls. I thought I had the ending figured out early on but as it turns out, the filmmakers threw me a curve ball that I wasn't expecting. Horror fans will probably be disappointed by this flick (as I said, it really doesn't belong on a \"Horror\" DVD) but fans of psychological thrillers should be pleased with this little known gem.<br><br>\"Memory\" can apparently be found cheaply wherever bargain DVDs are sold so I would recommend checking it out. Just a tip, if you happen to buy it on the same \"Horror Collector's Set\" that I did, skip the other three movies on it and go right to this one.","user":"MetalGeek","rank":[19,19]},{"title":"Memory: Passable but forgettable","rating":5,"date":"21 January 2018","review":"I don't know why this is going round as a horror movie, it's not even close. Memory is a thriller and a passable one at that.<br><br>Billy Zane, Dennis Hopper, Tricia Helfer and Ann-Margret star in this clever though ultimately flawed little tale of a man recieving premonitions and his efforts to decipher them.<br><br>This is evidence once again that Billy Zane is one of Hollywoods most underrated, underutilised and underappreciated actors. The man can do it all yet gets stuck with wall to wall b-movies.<br><br>Memory has some nice ideas but fails to present them very well, it's one of those films that could have been great if handled by the right people but alas wasn't.<br><br>Decent enough effort but should have been better.<br><br>The Good:<br><br>Cast deliver<br><br>Some nice ideas<br><br>The Bad:<br><br>Generic delivery<br><br>Things I Learnt From This Movie:<br><br>Billy Zane needs more appreciation<br><br>Dennis Hopper CAN do roles without coming across as weird and/or disturbing","user":"Platypuschow","rank":[5,5]},{"title":"A Pleasant Surprise From Zane and Hopper","rating":7,"date":"14 June 2007","review":"After accidentally touching an unknown drug, Taylor Briggs (Billy Zane) begins having flashbacks to the life of someone else -- a child abductor who has never been caught. Can he put the pieces together and solve the crime before the kidnapper abducts again? <br><br>I have said in other reviews that Billy Zane really makes a movie. My trust in that statement was fractured after seeing \"The Mad\" (though I don't blame Zane), but once more restored after this picture. He appears in practically every scene. While not the greatest film you'll see (it has a very made-for-TV or straight-to-video feel about it), the plot is interesting and the characters likable. Billy Zane, of course, helps tremendously by being the evil twin of Ben Affleck.<br><br>It also helps to have Dennis Hopper play Taylor's foster father Max Lichtenstein, although his only purpose in this film is to show up at random times with a few beers and cigars. Oh well, he's still better here than he was in \"Land of the Dead\". \"Max,\" says Hopper, \"is a guy whose wife has died and he's sort of coasting through life a bit like a ghost. But it's a really warm relationship that he has with Taylor -- something genuine and real.\" That's a good quote. And Hopper knows Max, if the rumors are true, because he spent weeks studying his lines despite being a relatively small character -- residents around town would catch him in restaurants reading. Tricia Helfer was also pretty decent, though not particularly noteworthy.<br><br>This was a plot-driven film, to be sure. Rated R for \"language and frightening images\", there's no nudity or gore here. The frightening images, as far as I can tell, are just a person in a mask. Nothing really disturbing. There's a photo album that may be thought as disturbing by some. I thought it was deviously brilliant. <br><br>The plot was excellent because it's not only a thriller but also a mystery (a race against time to solve a child abduction case, while the lead also must find how he's connected to the kidnapper). There's even sub-mysteries (such as how the lead's girlfriend knows about the kidnappings) that might leave you guessing. And random shout-out: nice use of a cell phone as a flashlight. We've all been there.<br><br>I give this film credit because I thought I had it figured out before it was half over. My two guesses about certain plots were close, but ultimately both wrong. There's a few twists you won't see coming. The \"big reveal\" is disappointing only if you're being overly critical, as they sort of dump it all on you at once for no reason. But I thought it was okay.<br><br>I wouldn't have rented this film on my own, but having been asked to review it, I'm glad I did. If you're scanning the new releases and find this, you could do much worse. I saw it with two friends and we all seemed to enjoy it, so it caters to a wider range than just myself. And Billy Zane and Dennis Hopper are in it. Worth checking out if you want a story different from your usual serial killers and splatter films.","user":"gavin6942","rank":[19,27]}]