[{"title":"Mediocre at best","rating":1,"date":"12 October 2006","review":"Frankly I'm rather incensed that on the basis of the dazzling reviews attributed to Steven Smith I wasted nearly two hours on his debut offering. Have they all been written by his pals? The action clunks along, the music is irritating and over used, the script is simply dire and the actors (with the exception of the gardener) mediocre at best. I do think we should support the efforts of a young filmmaker but saying it's brilliant when it's not will surely only encourage him to make the same mistakes again i.e. continuing to write his own scripts and using the same actors for another venture. Yes, it's his first film, low budget etc. - I get it, but it's also out there for members of the public to purchase and it's just not up to scratch.","user":"nigelkbrook","rank":[11,14]},{"title":"Oh dear God!","rating":1,"date":"19 January 2007","review":"Happened upon a copy of this. Not mine and if I had spent my own money on this I'd be finding those responsible and demanding it back! All I can say is this would be a terrible student film. Any understanding of the medium of film is absent. Acting is god awful, the story would have been rejected from the original Twilight Zone series as unoriginal and lame, and the change in tone of the lead character's reaction to the 'ghost' is laughable.<br><br>I can only agree that the 'glowing' reviews of this film are from friends and family. I'm afraid it's not even entertainingly bad.<br><br>Amateur in the extreme! <br><br>Avoid! Avoid! Avoid!","user":"jdgrem-1","rank":[8,10]},{"title":"So bad, it's almost good","rating":1,"date":"25 June 2006","review":"It's one of those dramas that's so bad that it almost hits the point of being very funny, the script is absolutely dire, direction appalling, lighting purely armature, the only thing letting it down from a true so bad it's good feel is that the sound design is only quite bad; it adds no suspense to the story although trying hard, but doesn't at least destroy any speeches. There's continuity problems of seasons of out door shots throughout. And finally last but not least the acting is appalling. For a professional production it very much has the feel of a university media project you have to feel sorry for the sorry for anyone who had to put their names to this.","user":"tom_strudwick","rank":[11,15]}]