[{"title":"Simply yet impressively filmed story based on a real-life drama","rating":9,"date":"23 December 2009","review":"Acclaimed movie Dare mo shiranai (Nobody Knows, 2004) and related featurettes on the DVD from my Tokyo acquisition earlier this year, easily proved to be well worthy of my prolonged attention.<br><br>Though slow-moving and long (almost 2.5 hours), one never gets bored watching four kids (in the movie of the age of 4, 6, 10 and 12 years) trying to survive on their own. Kids are kawaii (cute) and their performances touching, while bringing to life a bittersweet story of abandoned children. Trying to avoid attention from authorities and subsequent institutionalisation or imposed guardianship, inevitably leading to their separation, they are concealing the fact from their landlords and neighbours, continuing to live alone and thus staying together, sadly, with an almost unsurprisingly tragic outcome. <br><br>Indeed a powerful story, based on real events. Unfortunately, as found on the free on-line encyclopedia page http://en.wikipedia.org/wiki/Nobody_Knows_(2004_film), actual events, taking place in 1988 in Tokyo's Toshima-ku (ward), thoroughly described in \"The affair of the four abandoned children of Sugamo\" depiction of the incident, have been even far more gruesome. Well deserved rating 9 out of 10.","user":"Davor_Blazevic_1959","rank":[89,91]},{"title":"Children can not choose their parents","rating":10,"date":"11 September 2004","review":"\"Children can not choose their parents\" This was what came into my mind after I saw this movie.<br><br>This movie is based on actual incident happened in 1988. It was much more miserable than the movie. A woman was living with a man. She thought he had filed the marriage notification. When their son was born, the man said he had filed the birth notification. One day he left her to live with another woman. When the boy reached the primary school age, she knew neither the marriage notification nor the birth notification were filed. Facing this situation, she decided to hide her children from the society. (According to another source, the mother told the police that she thought the birth notification of a bastard child would not be accepted.)<br><br>She had met several men and had 5 children, two boys and three girls, who were not registered and hidden from other people. When the second boy died of sick, she hid the corps in the closet. While she works in a department store, the eldest son took care of three sisters. When the eldest son was 14, she went out to live with her new man, who was 16 years older than her. She gave the eldest son her address. When the children were protected by the police half a year later, a girl was dead, and the two were debilitated, as they were confined in a room and poorly fed. The girls were 3 and 2 y/o and still used diapers, but they were changed only once every day. It is reported that the eldest boy blamed himself for not being able to take good care of his sisters, instead of blaming his mother...<br><br>Compared to the real story, the movie is less miserable. In the movie, even the little boy and girl look normal and pretty, but in the real story they were very poorly developed. But it was still more than enough to surprise me. What a mother! In a conversation with the eldest boy, she says \"May I not become happy?\" She acts on this thought, without thinking of the same right about her children. Her childish lisping talk describes her immaturity. And of course, men were more guilty. Sadly, children can not choose their parents.<br><br>Every child acted amazingly well, very natural. Particularly, the eyes of the eldest boy, Akira, are very impressive. The eyes tell many things from their miserable life.","user":"shi612","rank":[249,269]},{"title":"A compelling portrait of the world of abandoned children","rating":6,"date":"6 March 2005","review":"\"Nobody Knows\" is painful to watch. It's a story you won't shake off, depicting the most defenseless of humans -- four young children, the oldest only twelve -- trapped in growing poverty and abandonment. It's a process-narrative of devolution that makes you feel helpless and angry and sad. It's saved from mawkishness by the natural energy of the children playing the roles of the four kids. And if it survives, its not because of its treatment of a social issue so much as for its evocation of the precise details of childhood.<br><br>There are two main subjects here. One is criminal neglect: the story is loosely based on events that happened in Tokyo in 1988. The other is the private, often secret, lives of children. Koreeda began as a documentary filmmaker and this seems to have given him exceptional skill in working with people and capturing their natural reactions. The winning, tragic children in \"Nobody Knows,\" four half-siblings with different fathers and the same childish, selfish mother, never seem to be acting and often no doubt aren't. Nonetheless the subtlety of expression in the delicate, mobile, beautiful face of the older boy, young Yûya Yagira, was such that it won him the Best Actor award at Cannes last year.<br><br>Also important is Koreeda's gift for detail, his meditative examinations of fingernails, feet, a toy piano, video games, pieces of paper, objects strewn around a room, the hundreds of little soft drink bottles that are everywhere in Japan, plants, dirt, all the small things children see because they're closer to the ground. And the things they accept because they're defenseless and innocent, but also incredibly adaptable.<br><br>Akira, who's only ten and whose voice changed during year spent making the movie, is in charge. As their mother's absences become lengthier and the children finally seem to be abandoned for good, money runs out. Akira is captain of a sinking ship, a somber duty, but he and his little sisters and brother keep finding time to laugh and play.<br><br>Koreeda's a passionately serious filmmaker: the two better known of his earlier fiction films deal with death and loss and here he considers as a given the worst of human carelessness and indifference both by society and the individual. \"Maborosi\" (1995) was a homage to Ozu but without Ozu's sense of social connectedness; it begins with an isolated couple in the city and chronicles a young widow's second marriage in the country through a slow pastiche of observed daily scenes where event and even dialogue are minimal concerns. The content of \"Maborosi\" is too thin, but the images and color are exquisite and the sequences of natural, unrehearsed-looking scenes achieve an impressively rich, beautiful, zen-like calm. \"After Life\" (1998) uses actual recollections of older people talking to the camera to build up a fantasy about dead souls held temporarily in a bureaucratic pre-Heaven limbo being asked to choose a single favorite memory to take with them into eternity: the effect is perplexing, thought-provoking, charming, and with great economy of means, cinematic.<br><br>\"Nobody Knows\" isn't as brilliant or resolved as \"After Life\" or as exquisitely visual as \"Maborosi,\" but for all its rambling excessive length it delivers a quantity of undigested patient misery and joy that will evoke such noble antecedents from the classic world of cinematic humanism as Clément's \"Forbidden Games,\" De Sica's \"Bicycle Thief,\" and the homeless father and son living on garbage in Kurosawa's Do-des-ka-den.<br><br>What's new here though is a sense of the encompassing otherness of big modern cities and the stoicism and resiliency of childhood (and perhaps also of the Japanese personality). Keiko, the childish, weak, spoiled mother (played effectively -- we instantly hate her -- by You, who's some sort of pop star in Japan), sneaks three of her four children into the new apartment and tells them they can't go out, can't show themselves even on the balcony. (In the real event, this was largely because they were illegitimate and had no papers, but here the explanation is that their noise may get them evicted.) Only Akira can leave, and she won't let him or the others go to school. They're prisoners of their urban anonymity and of an impersonal contemporary society.<br><br>As in Andrew Berkin's \"Cement Garden,\" the children also pretend everything's okay to escape the cruelty of the social welfare system. We watch agonizingly -- and many writers say the movie's somewhat too long; it does feel thus especially during the first hour -- but this time Koreeda's world is more direct and specific than before and there's plenty of talk. The children chatter among themselves. Eventually they go out and mix a bit by day with other children. Akira even talks to himself; he has to, because there's no adult coaching him so he must impersonate an elder adviser.<br><br>Whatever its roughness and excess, \"Nobody Knows\" is intense and powerful film-making. Koreeda has put his whole heart and soul into this movie and with it achieves an experience you can't shrug off. Nor will you forget the kids, especially the beautiful boy, Yûya Yagira, who may be growing inch by inch into a star even as we speak.","user":"Chris Knipp","rank":[118,129]}]