[{"title":"a good movie to make fun of","rating":2,"date":"16 February 2007","review":"If you're looking for a movie that's fun to watch simply because you can make jokes about the not so great acting, cheesy \"special\" effects, and typical sci-fi plot...then this is the movie for you! Not at the acting was bad, in fact, a few actors were actually fairly decent. The special effects weren't the greatest (to say the least); the animals looked completely computer animated. There was an annoying squawking to cover up the swearing and there was only one song played over and over again throughout the entire movie. Overall, a good movie if you're looking for something completely cheesy and fun to make fun of. Not a good movie to watch if you're looking for something serious.","user":"moltenwater","rank":[10,10]},{"title":"What a learning experience!","rating":4,"date":"2 October 2007","review":"This is like a zoology textbook, given that its depiction of animals is so accurate. However, here are a few details that appear to have been slightly modified during the transition to film:<br><br><ul><li>Handgun bullets never hit giant Komodo dragons. It doesn't matter how many times you shoot at the Komodo, bullets just won't go near it.</li></ul><br><br><ul><li>The best way to avoid being eaten by a giant Cobra, or a giant Komodo dragon, is just to stand there. The exception to this rule is if you've been told to stay very still, in which case you should run off, until the Komodo is right next to you, and then you should stand there, expecting defeat.</li></ul><br><br><ul><li>Minutes of choppy slow motion footage behind the credits really makes for enjoyable watching.</li></ul><br><br><ul><li>$5,000 is a memory enhancement tool, and an ample substitute for losing your boating license/getting arrested.</li></ul><br><br><ul><li>Members of elite army units don't see giant Komodo dragons coming until they are within one metre of the over-sized beings. Maybe the computer-generated nature of these dragons has something to do with it.</li></ul><br><br><ul><li>When filming a news story aiming on exposing illegal animal testing, a reporter and a cameraman with one camera is all the gear and personnel you will need; sound gear, a second camera, microphones etc are all superfluous.</li></ul><br><br><ul><li>When you hear a loud animal scream, and one person has a gun, he should take it out and point it at the nearest person.</li></ul><br><br><ul><li>When you take a gun out, the sound of the safety being taken off will be made, even if your finger is nowhere near the safety</li></ul><br><br><ul><li>Reporters agree to go half-way around the world in order to expose something - without having the faintest idea what they're exposing. Background research and vague knowledge are out of fashion in modern journalism.</li></ul><br><br><ul><li>Handguns hold at least 52 bullets in one clip, and then more than that in the next clip. Despite that, those with guns claim that they will need more ammo.</li></ul><br><br><ul><li>Expensive cameras (also, remember that the reporter only has one camera) are regularly left behind without even a moment's hesitation or regret. These cameras amazingly manage to make their way back to the reporter all by themselves.</li></ul><br><br><ul><li>The blonde girl really is the stupid one.</li></ul><br><br><ul><li>The same girl that says not to go into a house because a Komodo dragon can easily run right through it, thus making it unsafe, takes a team into a building made of the same material for protection - and nobody says a word about it.</li></ul><br><br><ul><li>High-tech facilities look like simple offices with high school chemistry sets.</li></ul><br><br><ul><li>Genetically-modified snakes grow from normal size to 100 feet long in a matter of a day, but don't grow at all in the weeks either side.</li></ul><br><br><ul><li>The military routinely destroys entire islands when people don't meet contact deadlines.</li></ul><br><br><ul><li>Men with guns don't necessarily change the direction they're shooting when their target is no longer right in front of them. Instead, they just keep shooting into the air.</li></ul><br><br><ul><li>The better looking you are, the greater your chance of surviving giant creatures.</li></ul><br><br><ul><li>Women's intuition is reliable enough to change even the most stubborn of minds.</li></ul><br><br><ul><li>Any time you're being hunted by giant creatures is a great time to hit on girls half your age.</li></ul><br><br><ul><li>Animal noises are an appropriate masking noise for 'swearing' at the same volume.</li></ul><br><br><ul><li>Old Israeli and Russian planes are regularly used by the US Military.</li></ul>","user":"wheels128","rank":[17,19]},{"title":"A by-the-numbers effort","rating":4,"date":"23 May 2006","review":"Komodo vs. Cobra is not going to set the world on fire. It's not a hallmark of cinema history. What it is is a group of underfunded filmmakers trying to make another movie, make another paycheck, and continue to support themselves and their families. As such I give these efforts a lot of slack. I mean, come on, it has to be hard to be a Russian special effects technician. Not a lot of big budget films getting made there. BUT-- they are a dedicated bunch and more than willing to throw their all into whatever lame American monster flick needs affordable SFX. And I get a kick out of looking for the same locations appear time and again in these flicks. If for some reason you find yourself watching this again, look at the sequence where Pare and company are walking through a \"jungle.\" Look at their feet and you'll see paved walkways. And if you happen to still have a copy of \"AI Assault\" (shown a week or two earlier also on SciFi), you'll see the folks in there tramping through the same ersatz jungle. Come to think of it, I think the helicopters land in the same clearing in both flicks. I can admire the thriftiness of these films. Every dollar really does show up on the screen! Too bad there just aren't enough dollars......","user":"davidemartin","rank":[26,33]}]