[{"title":"Movie was funny, entertaining and I enjoyed it.","rating":7,"date":"12 October 2007","review":"While it's no worse than much of the action movie junk that makes it to theatres, Bobby Z, originally entitled The Death and Life of Bobby Z, is a action thriller with Tim Kearney (Walker) as our hero. Kearney is a convict who's an ex-Marine and clearly not so much a bad person as one who has frequently found himself in trouble due to circumstance rather than intent. This gives director John Herzfeld, whose own career hacs been on less than an up-tick since the appropriately named 15 Minutes came and went in about that long, a premise for having a good guy hero who still fits the label of a tough convict.<br><br>The slightly convoluted storyline sees Kearney  whose life is in peril since he killed a biker gang boss in prison (self defence, of course)  offered an opportunity to walk free, as long as he's willing to impersonate a drug kingpin who happens to look just like Kearney, and who has just died. Fishburne plays the Drug Enforcement Agency cop who puts Kearney up to this task.<br><br>Before you can say 'gunfights are fun', Kearney is being shot at by the cops, manhandled by Mexican drug thugs, pursued by the bikers, and generally in demand by everyone, regardless of whether they think he's Kearney or Bobby Z. Our hero, of course, dodges the bullets, battles the bad guys, befriends Bobby Z's son (who has never met his dad) and romances a beautiful woman (Olivia Wilde) whose relationship with the bad guys is a bit hazy, but clearly quite intimate.<br><br>Filled with head scratching twists and cornball dialogue, this is not exactly a brilliant film. Yet it's got a slick look and at least a few passably enjoyable action scenes. And Walker, while never likely to be mistaken for a Shakespearian thespian, has the good looks and charisma to lead the way here. At least his character isn't loaded down with as many stupidly threatening lines as Fishburne's. Wilde also does a passable job as Kearney's conflicted love interest; she's mainly called upon to look good (which she accomplishes rather easily), but also doesn't muff her lines when she does have something to say.<br><br>Movie was funny, entertaining and I enjoyed it.","user":"NerdLife","rank":[26,31]},{"title":"Not too bad for straight to DVD","rating":5,"date":"17 April 2009","review":"For a seemingly low budget film, Bobby Z wasn't too bad. Moves pretty quickly, but with a weak storyline and plot, it is clear why it was a straight to DVD feature. Paul Walker does a decent job with a character that an Actor won't be able to do much with, except go with the flow. No real surprises, or twists and turns, just straight to the point B rated action. Actually has some pretty good fighting sequences and shoot outs. Laurence Fishburne is surprisingly cast as a supporting with a weak performance, mainly due to the script and content and possibly direction as well. Bobby Z is definitely a good B movie, with a rating of 5 overall considering everything listed above. All in all, this film is definitely worth watching if you're just chillin' with 97 minutes to spare. And Paul Walker is not nearly as bad an Actor as everyone tries to make him out to be. Have fun.","user":"paramount-services","rank":[13,15]},{"title":"This was fun","rating":8,"date":"2 June 2006","review":"I saw this movie last night at a special screening for audience feedback. Paul Walker really can act - I was pleasantly surprised. I originally thought he was only cast for his looks, but can see he has good acting abilities.<br><br>Movie was funny, worked well and I enjoyed it. The action scene in the kitchen was great and intense, kept me on the edge of my seat.<br><br>Lawrence Fishburn - as always - great! He's a solid actor and his role as the DEA Agent worked perfectly.<br><br>Paul's pretty love interest (Olivia Wilde from the OC)chemistry was lacking.<br><br>Chuck Liddell, although was only in the beginning of the movie was convincing. There was also a girl named Ashley who I would have like to see more of. She's hot! <br><br>The kid looks like he'll have a career ahead of him. The relationship between the kid and Paul Walker worked well and was believable. Not sure where I've seen him before, but he may have a promising career.<br><br>I liked the sequence of the movie - it starts with a mystery and the flashback kept me trying to figure out what was going to happen next. I liked the movie can't wait to see on see it on the big screen. Hope if comes out soon.","user":"stanman90048","rank":[71,107]}]