[{"title":"It's good movie to watch","rating":7,"date":"23 February 2020","review":"It's Jet Li vs. Jason Statham in War, an exciting martial arts action film. An FBI agent out for revenge pursues a notorious assassin named Rogue who's come to San Francisco to instigate a war between the Triads and the Yakuza. The storytelling is rather good, especially in creating suspense and intrigue. And, the fight sequences are particularly impressive. However, the characters aren't given much depth and seem more like stereotypes. While War is pretty much a typical revenge film, it's entertaining and has a good cast.","user":"MR_Heraclius","rank":[36,37]},{"title":"For the fan boys","rating":8,"date":"24 August 2007","review":"This is a man's film. They really should be selling brats and beer in the theaters for attendees. Anyone going to a film with jet Li or Jason Statham should know what to expect. Going to a film with the two of them and you know there is going to be blood, violence, killing, action, noise, and an eventual winner. If this is not your cup of tea, go see The Nanny Diaries and leave this to the fan boys.<br><br>This is not their first film together. They both appeared in The One six years ago. This time they are the leads and on opposing sides - Statham an FBI agent and Li a contract killer. The action takes place in the middle of a Yakuza war in San Francisco.<br><br>Fans of Jet Li will not be disappointed. he still has all the moves even if he is 47; however, he does rely more on swords and guns, and other weapons in this film. Statham is Li's equal and gives as good as he gets. The story has an interesting twist which i will not give a clue on as it is a major plot point.<br><br>Interesting entertainment by girls in cages at the Yakuza club. I thought that went out in the 60s, but it was a nice diversion.<br><br>This film is red meat. It has no pretensions of quality and dialog is minimal, which goes along with the story. If you are a fan, you will be entertained. If you are not, why are you there?","user":"lastliberal","rank":[252,328]},{"title":"Reasons to see WAR","rating":29,"date":"29 August 2007","review":"Reasons to see WAR <br><br>WAR kicks ass, and you should see it a lot of times, for these reasons: <br><br><ul><li>Jason Statham yelling at people, and then kicking ass. In other words, being himself. </li></ul><br><br><ul><li>Jet Li killing a guy by kicking him in the face....and that's not his best kill. </li></ul><br><br><ul><li>Random girls getting nude for no reason. </li></ul><br><br><ul><li>Ninjas. Just when you think this movie couldn't rock any harder, they put Ninjas in the movie. </li></ul><br><br><ul><li>A twist ending that would make M. Night Shawhocares *beep* himself. </li></ul><br><br><ul><li>A car chase every 10 minutes. There's even one with motorcycles. </li></ul><br><br><ul><li>Violence. Lots of it. Guns, blades, blood, kungfu, decapitations, the bases are covered. </li></ul><br><br>-Jet Li and Jason Statham fighting each other. It's as epic as you might think. <br><br>So, in conclusion, if you, 1. Like things that are awesome. 2. Have a pair of testicles. 3. Need to see a movie that rocks for a change. 4. Are a human being. <br><br>...than WAR is for you.","user":"metrbot","rank":[643,897]}]