[{"title":"A Hilarious (and Much Needed) Assault on Decency","rating":8,"date":"13 November 2006","review":"Sacha Baron Cohen comes to America in the guise of Borat Sagdiyev and wreaks his own brand of Kazakhi havoc in this very very funny film.<br><br>In our age of uber-political correctness, \"Borat\" comes sweeping through like a brisk and refreshing wind, completely bounding over every cultural taboo we've erected around ourselves. Thus, no one is safe: Borat takes on Jews, blacks, gays, feminists, middle-Americans, religious fanatics, frat boys. The only weapon against the bumbling Borat is a sense of humour, which this movie shows most Americans painfully lack. Indeed, if there is any message to be had from \"Borat\" (and I'm not sure there is much of one, beyond its fascinating cultural experiments), it's that everyone needs to lighten up and not take themselves so seriously.<br><br>The image of Americans projected in this film varies from the heartwarming to the downright frightening. New Yorkers threaten Borat with physical violence when he approaches them on a subway. Feminists walk out on him when they find his views on women too much to tolerate. Folks out in the heartland commiserate with him over his hatred of gays and Jews; a gun shop owner even helps him pick out the best weapon for shooting Jewish people. A sweet Jewish couple give him a place to sleep, and bring him a homey meal (that is, before they turn into invading cockroaches). A group of manic Pentecosts help him find Jesus. An RV full of frat boys make complete asses of themselves by espousing their hopelessly ill-informed views on minorities in our country and the need to revert to slavery. The majority of people treat Borat in the condescending way of those who want to think of themselves as being culturally aware without really knowing anything at all about other cultures. These people become rude the second Borat offends their sense of propriety. On the other hand, the disenfranchised of America greet Borat with open arms, and we see a group of gays and a group of blacks interacting with him as if no cultural boundaries existed at all. The film's sweetest (and most unexpectedly so) moments come from Borat's befriending of a black prostitute.<br><br>Of course, this is a carefully crafted work of fiction, and Cohen only lets his audience see what he wants them to see. I would probably react much the same as many of the people in this film if this crazy-looking and sounding man appeared out of nowhere and began to antagonize me. But the movie does make Americans look like a bunch of awfully self-important, uptight stiffs, and I've been to enough places in this country and met enough people to realize that the way events play out in this film (even if they are manipulated or staged) probably come very close to the real thing.<br><br>Thank God for movies like \"Borat.\" If nothing else, they remind us that our cultural boundaries only matter as much as we let them, and that all of the fears that govern political correctness are mostly ungrounded. After all, virtually every person in this film was offended at one point or another, and as far as I can tell, all of them lived to tell about it.<br><br>Grade: A","user":"evanston_dad","rank":[425,560]},{"title":"Borat: A laugh out loud movie","rating":10,"date":"18 June 2007","review":"Before I go on and recommend EVERYONE to see this movie I want to remind you of one thing. This movie is satire and if you don't understand that then there's absolutely no point in watching.<br><br>Much like Spike Lee's \"Bamboozled\" it is made very clear that this movie is a satirical piece. Their lampooning, spoofing, however you want to put it there just kidding around take that in account before you go mad because Borat makes jibes at women and Jews.<br><br>Cohen has once again had me in tears with laughter as he examines the American way of life. If you haven't seen any of Cohen's TV material then you will definitely be shocked by what you see.<br><br>Cohen manages to create genuine laugh out loud moments. Yes they are often at the expense of others but so what?!? No one was harmed during the making of this movie and if they didn't want to be involved they didn't have to sign the release forms. But beyond the laughter Cohen does hit a political nerve whether you like it or not. The footage of a Texan talking about Gays and immigrants is both humorous and extremely alarming. As is the conversation between three frat boys (who clearly have the social intelligence of a two year old combined). It's a stark realisation to see the backwards world we are still living in.<br><br>If satire eludes you then this movie isn't for you but if you can sit back, relax and really take in whats going on and have the cop on to realise that Cohen isn't Borat (Cohen comes from a strict Jewish background) then you will be able to take this movie at face value.<br><br>Remember ITS SATIRE! Rent it now and just sit back and enjoy the ride!","user":"rorosuperro","rank":[113,144]},{"title":"\"He insist we not fly in case the Jews repeated their attack of 9/11. \" - Borat","rating":23,"date":"23 February 2007","review":"Many people have practically no idea who Sacha Baren Cohen is, besides his small role as the gay French Nascar driver in 'Talladega Nights'. This is because the show he had, Da Ali G Show, was a very unpopular show. Mainly because it was on HBO and late hours of the night. Unfortunately, many people never watched the show not because they didn't like it, but because they didn't know it existed. Da Ali G Show was an incredibly original variety/reality show featuring Cohen in three roles including Borat (whom is the main character of the movie). Cohen, posing as these different characters would interview politicians and such who were unaware the interview was a joke. The reactions Cohen would get out of people including one politician telling him to 'go f*ck himself', were priceless. Going into the one-month early sneak-preview of 'Borat', I was expecting a funny movie, but was skeptical on how funny the movie would be. Usually film adaptations of short five minute skits don't work so well, examples include 'Superstar', 'Night at the Roxbury', 'The Ladies Man' and 'Coneheads'. All are pretty much loser movies with a few funny scenes but not much more. However, when the ending credits started to roll and I walked out of the 'Borat' screening I was sore from laughing so hard. To be honest, I never laughed so hard during a movie in my entire life.<br><br>There is not much I can tell you about this without spoiling it for you. Basically the plot is a Kazakhstan news reporter taking a trip to the United States to win the love of Baywatch's Pamela Andersen, whom he thinks is a virgin. HA! All I will tell you is that Borat travels across the country from New York to L.A. doing such crazy stunts as taking a dump in front of the Trump Towers, publicly masturbating in front of a NYC Victoria's Secret store, singing an Anti-American Kazakhstan National Anthem at a rodeo in Nebraska, buying weapons to protect himself against 'the jews' (whom he believes were responsible for 9/11 Terror attacks) and trying to kiss just about every guy he sees, which brings about homophobia in many of the real people featured in the movie who don't know it's a movie. Some may call 'Borat' the funniest film ever made, and that's not and understatement.'Borat' is without a doubt one of the most original and ingenious comedy in the last three years, and maybe, just maybe, the funniest film ever made. Grade: A- (screened at Harkins Arrowhead 18, Glendale, AZ, 9/04/06)","user":"MichaelMargetis","rank":[116,153]}]