[{"title":"A Nutshell Review: Ice Age 2: The Meltdown","rating":8,"date":"29 March 2006","review":"Similar to the first Ice Age, the promotional material for the sequel was out in the theatres way in advance, and courtesy of the Scrat character too, up to its usual antics of getting to that elusive acorn. Here, Scrat opens the movie, and emulating the style of the first, he provides most of the laughs, also as an intermission from the actual scenes from the main cast.<br><br>Our gang of prehistoric animals are back - Manny the Mammoth (voiced by Ray Romano), Sid the Sloth (John Leguizamo) and Diego the Sabre-tooth Tiger (Denis Leary). We learn that Sid has gone into the early childhood business, educating the young minds of pre-historic brats. However, I felt that this movie was somehow darker in tone than the original. While the original was one which dealt with hope, this one had its setting in extinction, disaster and death.<br><br>The valley which they live in is threatened by the melting ice, no thanks to global warming. So all the animals embark on a journey to salvation, to that rumored ark which will save them from the massive floods to come. Along the way, our trio meets up with another trio of characters, who were added to expand the cast, featuring 2 Possums Crash (Seann William Scott) and Eddie (Josh Peck), and another, but female, mammoth (Queen Latifah).<br><br>Needless to say, Manny's still anti-social, and Diego can't get along with those rascal possums who get on his nerves, and Sid's the \"philosopher\" ever providing the laughs. Various themes like romance (hey, we got 2 mammoths here), friendship, trust, and believing in oneself to overcome one's phobia get covered. Pretty wide scope, but they manage to fit in place nicely.<br><br>The villains in this sequel are pretty nasty, besides the looming natural disaster, we have two sea creatures with nasty teeth and attitude, as well as menacing vultures ever ready to pounce on the flesh of animals who have fallen.<br><br>But it's not all that bleak. Keep a lookout too for that mad sloth song-and-dance sequence, which has potential to become the next ear worm ala Madagascar's zany \"you-got-to-move-it\" song. The animation is as usual, top notch, and I just can't get enough of the photo-realistic ice and water landscape.<br><br>This is one piece of animation that doesn't rely too much on sight gags, of spoofing current affairs, but one filled with more witty dialogue and kept on an even keel with its interesting storyline. Though at times it might feel clichéd, somehow it excelled in its execution.<br><br>And that makes this sequel, as enjoyable as, if not better, than the original. Recommended stuff this week!","user":"DICK STEEL","rank":[129,172]},{"title":"A lovely film with a great storyline.","rating":9,"date":"19 April 2006","review":"This is a lovely film. Great animation and a brilliant storyline for an animation film!<br><br>The characters are all lovable and there are a few extremely funny parts in it! Just little phrases and actions the characters do is hilarious!<br><br>Ice Age: The Meltdown follows the animals on their journey to find dry land when they discover that their lives are at risk if they stay put due to the ice melting.......there are some little adventures and discoveries along the way though!<br><br>If you have seen the first one you will like this and in case you are wondering......he is still trying to get his nut!<br><br>I think it is a must see for all ages, not just children.","user":"Becky_Boo","rank":[34,43]},{"title":"Laugh out loud funny!","rating":10,"date":"9 April 2006","review":"I wanted to take my older kids to the movies for some family time. We went and saw Ice Age Meltdown really for lack of something better to see. (Looks like a bad year for movies again- on the bright side, we'll save a couple hundred bucks.) I am pleased to say, I loved this movie. I laughed so much and found it very enjoyable. It was much better than the first one and I don't know if I've EVER said that about a movie. The characters are witty and entertaining and Scrat gets a lot more screen time in his plight for the great acorn. If you liked the first Ice Age then seeing the sequel is completely risk free. A great film for young and old alike. Enjoy! =)","user":"blubutterfly21","rank":[67,92]}]