[{"title":"Sad and sometimes quirky journey about friendship, loss and regret","rating":8,"date":"1 November 2005","review":"I just had the pleasure of seeing this wholly original modern-day American western. Just when you think you have this film's plot pigeon holed it takes you in a different direction. THREE BURIALS OF MELQUIADES ESTRADA is in part a revenge story, but it's also much more than that. There are no one dimensional characters. As much as you want to hate Barry Pepper's numbed border patrol officer, you can't help but feel sorry for him. And Tommy Lee Jones' Pete will break your heart. He and Pepper have never been better and Jones' direction is natural and subtle. My only problem with the film was sometimes it got a little too quirky for its own good. But for the most part I believed every moment and really cared for these lost characters. It's one of those films that really leaves you thinking about a lot of stuff, from mortality and loss to the very real problems of racism and inhumanity. It's never preachy or self aware and isn't out to impress, it's just telling a story. I highly recommend this movie. It's by far one of the best films I've seen recently.","user":"IAN-Cinemaniac","rank":[201,225]},{"title":"Powerful and moving modern western","rating":22,"date":"22 November 2005","review":"The \"Three burials of Melquiades Estrada\" is a multi-layered story of death, retribution, loneliness, and remembrance. Although it takes place in modern day Texas, its main character Pete Perkins, superbly played by Tommy Lee Jones, seems to be living resolutely in the past. He is determined to seek justice for his best friend's death and forces the guy responsible for to a journey across the borders in Mexico to locate the village of the deceased for a proper burial. This journey will bring forward the stark contrast between the values of two ways of life and the landscape transversed is both geographical and emotional.<br><br>Modern civilization throughout the film is mainly represented by 4WD cars, sniper rifles, dinners, shopping malls, trailers, and TV-sets incessantly showing soap operas, while the characters revelling into those manifestations are invariably emotionally numb, disaffected people, trapped to a perfunctory life from which they seem unable or unwilling to escape. Concomitantly the values of the old west, based on friendship, loyalty and commitment have ebbed, though they are still existent as embodied by the relationship of Pete with his best friend. Pete is forced to pursue his own sense of justice after being repeatedly scorned by the contemptuous behavior of the authorities towards him and his demand for rightful punishment of the culprit, a cool, violence prone and emotionally detached border-guard.<br><br>The story is masterly told in a sturdy manner that perfectly serves the complexity of the excellent screenplay by an apposite use of flashbacks and wonderfully shot sequences. All the performances are top notch in their expressive minimalism, greatly contributing to the lasting emotional impact of this outstanding film.","user":"gtzam","rank":[217,244]},{"title":"Bring me the body of Melquiades Estrada","rating":10,"date":"14 February 2006","review":"The Three Burials of Melquiades Estrada(2005) ****<br><br>Tommy Lee Jones steps up to the plate and takes a big first swing with 'Three Burials.' This is a movie that captures the old Peckinpah-esquire style of the rugged west and combines wonderfully with Guillermo Arriaga's moody and alienated script. This is a film that could have took a political mood and dealt with the issues of border security and the like, but it smartly refrains from doing so and instead focuses sharply on the heart of society itself - people. <br><br>Tommy Lee Jones plays Pete, a rancher who has few friends with his closest friends being a woman from town, and a man from Mexico. The woman is the wife of a local diner owner, Rachael (Melissa Leo). She also happens to be extremely bored and engages in extramarital affairs. Pete loves her, but she loves her husband. And possibly the sheriff, and possibly Pete. The other emotional connection in Pete's life, the Mexican, is Melquiades Estrada (Julio Cedillo), an illegal immigrant who finds work and friendship with Pete. Pete loves him like a son, or a brother, or friend, or a combination of all three. Barry Pepper plays Mike, the new border patrolman in town. He is brutal. Perhaps by nature, or not. He is bored; he passes the time sitting outside of his jeep looking at dirty mags. His wife, Lou Ann (January Jones), is also bored. She feels isolated and separated from her husband. She spends her time at the local diner and befriends Rachael. While she sits at home, her husband, the rookie border patrolman, makes a stupid mistake and tries in vain to hide it. The whole town is bored, even the police and the border guards. They find out, the police find out, and in a small town people talk, but more importantly people listen because they have nothing else to do. Pete finds out about Mike's mistake and sets out to carry out Mel's last wishes and bury him in his home town back in Mexico. <br><br>The story has its characters and connects them in ways that we don't always suspect they will connect. No one is a cardboard cut out. Even better, no one is simple. Each character is complex and has their own distinct feelings. A major theme is that of alienation. The characters are alienated not only from each other, but from themselves as well. Earlier i stated that he film took the right road and avoids making a blatant political message. The movie still carries a message though. It is a commentary on life and society. <br><br>The story has parallels to Peckinpah's 'Bring me the Head of Alfedo Garcia.' It has a very Peckinpah style, and features a man who makes a long journey with a dead body. He cares for it and tries to preserve it, even talks to the body sometimes. The film has some great cinematography as well, and the score suits it perfectly. The acting is wonderful, and I have to say that Tommy Lee Jones has rarely ever been better than he is here. Barry Pepper also gives a solid performance. This is Tommy Lee Jones first directing credit in major film and he knocks this one out of the park. Jones clearly has a strong control of his movie and this should go down in history as one of those rare first time wonders. <br><br>4/4","user":"MacAindrais","rank":[103,125]}]