[{"title":"The first spiritually oriented movie that really works!","rating":10,"date":"5 May 2006","review":"I was invited to a screening of The Peaceful Warrior in NYC Thursday April 13th, having just learned of this film's existence a few days earlier.<br><br>I was looking forward to the film, but with some trepidation, considering that prior attempts at communicating spiritually oriented books or ideas had fallen short of my expectations and had fundamentally failed to convey to the audience a transforming inner experience; witness What the Bleep, Siddhartha, Little Buddha, and others.<br><br>Let me say this, simply and directly. They got it right this time, and they did it in a way which could be embraced by crowds at the multiplexes. By impressing the discovery of bona fide spiritual truths on a recognizable sports template, the movie makers will be carrying under-appreciated ideas and experiences to the masses. At least I hope so! I actually woke up early the morning after seeing this, with my mind full of things I might say in an exhaustive review. Never in my life have I felt that way about a movie before.<br><br>The reason this movie succeeds is that it follows one of the most basic rules for good story-telling: it shows rather than tells. Although some fundamental spiritual ideas are described with words, it is the plot and character development that proves the truth of those words. You see the transcendence and the realizations in the faces of the characters, and you are not left to wonder why. You understand.<br><br>The story, based on a book by Dan Millman, follows a college gymnast who has great potential but whose desire for success is one of the main obstacles standing in the way of that potential. In his mindless pursuit of a goal, he becomes sucked into the deep dark hole of life-is-what-happens-while-you're-making-other-plans. In its simplest message, our hero's real challenge is to find happiness by being present and finding interest and love for what's right in front of him.<br><br>The film doesn't try to oversimplify the content of a spiritual path into a single dogma; there are many other seeds of thought strewn along the path by Socrates, each of which could have been the basis for a different struggle to transcend relative unconsciousness.<br><br>For many years I have been convinced that non-religious spiritual thought and experience could be something to drive the world in a new direction. This movie provides an example of what life can be like if we ponder these thoughts and implement them in our lives in a concrete and practical way. It's not necessary to be a champion gymnast to derive the fundamental teachings from this film. It is a teaching that anyone can understand. This is why I see that The Peaceful Warrior can inspire those who embrace the possibilities which it offers to become peaceful guerrilla warriors, working tirelessly underneath the radar, changing the world.<br><br>This is not only a good movie, it's an important one.","user":"rtolz","rank":[223,262]},{"title":"A Great Film with an Important Message","rating":9,"date":"4 May 2006","review":"I've long been a fan of the book upon which this film is based -- Dan Millman's The Way of the Peaceful Warrior.<br><br>If you've read the book, you know its central lesson is learning how to live in the moment.<br><br>Filled with memorable aphorisms, the book is part novel, part autobiography, and part spiritual guidebook -- and I have to admit that I was nervous about how the book would translate to the big screen.<br><br>But I was lucky enough to catch an advance screening of the film. And for fans of the book like me -- and people who've never read it -- this film delivers. <br><br>Nick Nolte's performance as Socrates is one of the best he's ever given. Scott Mechlowicz does a great job showing us the transformation of Dan Millman. And the feeling one has when one walks out of the theater-- of wanting to seize every moment that life offers you-- is a feeling that we don't get often enough. That feeling is worth the price of admission alone.<br><br>Peaceful Warrior is that rare film that manages to be hugely inspirational without being cheesy. It's well worth seeing.","user":"OntheMidway","rank":[148,183]},{"title":"Excellent adaptation of a powerful and important book","rating":10,"date":"2 June 2006","review":"I've appreciated Dan Millman's work for many years, and I have looked forward to seeing how well this film would be done. I saw it last night at a preview screening, and I was very pleased, and very moved, by it. The message is profound and important. While at one level it might be dismissed as something \"we already know\", when we look around our society, it's obvious we don't. Last night the actors themselves in a live teleconference after the screening shared how -- unlike most of their work -- being involved in THIS film changed their own lives too. <br><br>There are many moments which are quite funny. There is much that is quite moving. If you are at all open to the real story in the film, you will not walk out of the theater thinking only of your next snack.<br><br>There is not a classic battle between good guys and bad guys here. Rather it gives us some tools and insight to deal with the conflicts within ourselves. I hope that many, many people get to see this film.","user":"wtharrison","rank":[72,92]}]