[{"title":"An underrated Gem.","rating":10,"date":"6 September 2009","review":"This is way better than most films that spoof other films. It's a million times better than the likes of Epic Movie, Disaster Movie and many other pathetic attempts to parody other films. Unlike most films that spoof others this one gets the job done without overdoing it and at times it even felt like an actual Superhero film as well as talented cast members that fit their roles perfectly and the villain \"The Hourglass\" was good considering it was a parody film. It also has various comedy elements of its own such as Lucille's funeral and many more moments that I would mention but I don't want to spoil the film. At the funeral The priest says \"We are gathered here today to say goodbye to Lucille\" then all the people at the funeral shout \"Goodbye!\".If you plan to watch this film do not judge it on the low rating. It's a pity most parody films weren't as good as this.","user":"Ironwarrior86","rank":[104,125]},{"title":"Very funny","rating":7,"date":"14 July 2009","review":"With all these bad Spoof movies like Date movie, Not Another Teen Movie,Epic Movie and Disaster Movie (which is the worst spoof movie ever).<br><br>So i was thinking will be the same, but my god this movie made me laugh so much, This movie better then others listed above better then Scary movie 4 and 2 <br><br>Plot: In this spoof of Hollywood blockbusters, director and screenwriter Craig Mazin (THE SPECIALS) tackles the age-old story of a regular guy who suddenly finds that he possesses super powers. Ricky Riker (Drake Bell) is a typical teenager, except that his luck is worse then most. Basically, he's a loser. He's been in love with beautiful Jill (Sara Paxton) for years, but is sure she doesn't know he exists. Even his best friend, Trey (Kevin Hart), is willing to throw him over for another clique. But Rick's life changes dramatically when a genetically enhanced dragonfly bites him during a school field trip. In a flash, he becomes the Dragonfly. He can scale buildings, and has immense strength--though he's still a klutz. Rick isn't sure he has what it takes to be a superhero, but it's up to him to save the city from the villainous Hourglass (Christopher McDonald), who literally sucks the life out of people, and threatens to harm those dearest to Rick. Mazin, The main spoof is spider man they also spoof Batman, the Fantastic Four, and the X-Men.<br><br>I love this movie so, well the last spoof movie I Saw was Disaster movie that oh my god, that movie was SO bad ) (That one the reason like this movie more then I Should) The superhero movie is one best spoof to come out last year, I am not saying it the best spoof EVER! Love it 7/10","user":"atinder","rank":[51,66]},{"title":"Why thought of as so bad?","rating":10,"date":"4 February 2009","review":"Well, I've been reading the reviews on this film for quite a while now, and I've got to say: why is everyone complaining about it? To be perfectly honest, I saw this film because my best friend rented it, so I hadn't had a chance of reading any of the reviews online. If it had been the other way around, I probably wouldn't have seen it, and that would have been just a darn shame. So what if some of the situations are a little extreme? So what if it all seems a little \"Oh, come on!\" - that's what this type of comedy is all about! I had a good laugh watching this, and I strongly suggest this for a friend night...but definitely not the movie I'd see on a family night.","user":"superspy_24","rank":[27,34]}]