[{"title":"Super family fun","rating":9,"date":"16 April 2019","review":"I don't understand all the negativity towards this movie, I loved it and thought it was just as good as Bruce Almighty. It's creative, lighthearted, and overall a fun movie that I've watched several times!","user":"isabella-06097","rank":[11,12]},{"title":"You can take your kids to this movie","rating":27,"date":"27 June 2007","review":"I haven't seen Bruce Almighty. Unlike just about everyone else who went to this movie I had nothing to compare it with and no expectations based on the earlier movie.<br><br>I have a feeling what people were expecting was a frenetic, high strung, giddy, laugh a nano-second experience. If that is what you are expecting, then you will be disappointed.<br><br>What I was expecting was based on what I saw in the trailers for this movie - ordinary guy is visited by God, God tells him to build an Ark, the guy's beard and hair grow and animals show up. I was also expecting some funny stuff.<br><br>The film delivers on story, on character, on relationships. It has an element of menace and anticipation. It has funny stuff and it has heart. It is also a movie you can take your kids to, which is kind of rare these days.<br><br>I really enjoyed this movie. Set aside your Jim Carrey expectations and you may enjoy it, too.","user":"wfgwilliams","rank":[72,98]},{"title":"Don't expect \"Bruce Almighty\" all over again.","rating":8,"date":"12 March 2009","review":"Evan Almighty generated a lot of hype before its release. A lot of people loved Bruce Almighty, and were expecting something just a zany and hilarious in Evan Almighty. Most of them were disappointed: this movie was received negatively by most critics and audiences alike. Well, I liked it! First of all, this movie has been misunderstood, because it was mismarketed. It was marketed as a hilarious sequel to Bruce Almighty (and the trailer made it look that way, too). But, to be perfectly honest, this is more of a family film than a comedy. But it is a really good family film.<br><br>This film had a lot of potential for comedy. It delivered at times, but not consistently. It also had two very crude toilet humour jokes involving male genitalia (just the word, though, nothing beyond that). I will freely admit, this isn't nearly as hilarious a comedy as the original. But it's good in its own right.<br><br>Morgan Freeman's scenes as God were excellently written and performed! One scene in particular, in a restaurant, was really touching and moving. Freeman is really a terrific actor, I'm glad they cast him as God. The performances in this movie were, overall, great. (Although it's a lot of fun watching the young kid unable to resist looking into the camera when pointing out two doves to his dad.) So, all in all, Evan Almighty is not \"almighty\" but it's still \"alrighty\".","user":"tml_pohlak_13","rank":[25,34]}]