[{"title":"love this movie highly recommend.","rating":9,"date":"23 February 2020","review":"Epic. I fell in love with all the main characters. This movie is so exciting you just can't turn away . Dramatic, exciting, emotional, beautiful story of good versing evil. Even though the story involves the natives of Central America circa 1511 there is a moral implication than can be applied to modern America. The Mayan Empirical governing body had become so vile and corrupt that it's collapse was inevitable. Tribes and villagers who wanted to live solitary and peaceful lives were being attacked by the Mayans. The story is just amazing.","user":"MR_Heraclius","rank":[41,42]},{"title":"Pure exploration of primal fear. Brutal chase/survival flick.","rating":10,"date":"28 August 2016","review":"I was lucky to see this film in a theatre in 2006. What an experience man. Went into without watching the trailer or reading any reviews. This is one of the best survival films ever made. Everything is good bah this flick. An awesome visual treat. The best adventure story with a lot of brutal action. An adrenaline filled chase movie. The last 45 minutes beats all parkour n survival films put together. Thank you Mad Gibson for a wonderful cinematic experience. Its a masterpiece. This movie held me on the edge of my seat from its beginning til the end credits. The waterfall sequence is just breathtaking. It beats the scene from Predator n US Marshals. Those cameramen really deserves credit for the chase scenes. The movie has an amazing n breathtaking visuals and landscapes.","user":"Fella_shibby","rank":[91,98]},{"title":"A rare cinematic treat, a film that takes us to another world","rating":11,"date":"11 July 2008","review":"Without wishing to fall into the trap of critical hyperbole, I can honestly say that this is the most original and impressive American film that I've seen this decade, more so than the highly acclaimed likes of The Departed (2006) or No Country for Old Men (2007). Whatever problems you might have with Gibson, from his personal politics to his previous work, there is no denying the determination of his vision, or the sheer sense of daring and imagination in attempting to pull off a project of this size and pitch; taking elements of an already well-documented real life civilisation and abstracting it for the purposes of dramatic tension, to create a once-in-a-lifetime cinematic experience that genuinely takes us to a world that we've never before experienced on film.<br><br>In my opinion, it is the very essence of cinema; developing a story and reducing it to the most simple and iconic of images, placing the emphasis on family and a race for survival, and all captured with a skillful combination of design, editing, music, performance, choreography, photography and character. Admittedly, you could always argue that the narrative is secondary to the atmosphere that Gibson and his crew so skilfully create, and yet, it is no less affecting or exciting as we come to know and respect these characters through the film's rich and amusing opening sequences - filled with a great sense of character and warmth - as well as a fairly pointed visual metaphor in the killing of an animal that will come to prefigure the subsequent actions of the final film. To counter some of the criticisms levelled against Gibson by historians and scholars alike, it is worth taking into consideration the subtle way in which the director plays with the notions of myths and legends; creating a heightened atmosphere of continual stylisation that stresses the influence of a film like Apocalypse Now (1979) or Aguirre, Wrath of God (1972), with the fevered madness of the jungle giving way to an unforgettable depiction of the Maya civilisation as an infernal hell on earth.<br><br>The film can also be read as a story-within-a-story construct, in which the film we see becomes an extension of the folktales being told by the tribe's elder as the men sit quietly around the campfire in the scenes directly preceding the carnage. If we think about this particular interpretation, we can see the that the film is working on a level of fantasy, in which the more recognisable themes of the film create a parable related very much to the idea of becoming a man; illustrated by the journey that our central protagonist Jaguar Paw undertakes in order to prove himself to his wife and young family. More fascinating than even that, however, is the notion of the film as a prolonged nightmare; with the scene of the initial massacre beginning immediately after Jaguar Paw awakes from a particularly frightening dream, rife with subtle allusions and a sub-textual foreshadowing to certain themes further developed throughout the rest of the film.<br><br>For me, this interpretation makes a great deal of sense, with the opening sequences laying the foundation for Jaguar Paw's dream - as we are introduced to the ideas of family, loyalty, honour, death, fear and survival - and all represented by the image of the neighbouring villagers fleeing their homes and moving through the jungle as if escaping some foreboding evil; perhaps a foreshadowing to the plague subtext that will appear later? Regardless, the prolonged journey that our heroes take from their own village to the bustling metropolitan world of the Mayan civilisation, with their temples and sacrifices - and the staggering use of music, movement, sound and colour - all mark this out as one of the most richly fascinating and genuinely otherworldly experiences that I can currently recall in a contemporary film. Gibson's direction is faultless here; extending on the visual landscape and hyper-real approach to time and presentation that was developed in his previous film, the flawed though no less memorable The Passion of the Christ (2004), and continuing the idea of developing and exploring an entirely believable cinematic netherworld with roots in actual, documented fact.<br><br>Here, the controversial approach to accuracy and truth should be overlooked; after all, the film isn't attempting documentary realism, as anyone who has experienced the film will know. Instead, Gibson creates an adrenaline fuelled thriller that advances on the well-worn codes and conventions of Hollywood survival dramas such as Deliverance (1974) and Southern Comfort (1980), with an added depth created by the choice of characters and the location, and again, the use of the fireside folktales as a sort of implied framing-device. However, regardless of these notions, Apocalypto (2006) is a masterpiece, purely for its visceral impact and creation of a full-formed world that overloads the senses with its vivid, fever-dream-like atmosphere and truly unforgettable design.","user":"ThreeSadTigers","rank":[157,178]}]