[{"title":"Where's my car?","rating":1,"date":"25 August 2005","review":"Most other comments seems to be infected by a classic case of -Let's read a plethora of theories and commentaries into this as an after-construction-kinda deal. It's easy to sum this movie up in one sentence: A violent story about a group of people in search for their missing car.<br><br>This has been praised as a stand against class-society and apparently it should contain a vast amount on social commentary. Where? Name one action movie who hasn't got a rich villain and a poor hero or some misfit trying to set things right based on his unbreakable social pathos. <br><br>And some of the huge plot holes:<br><br>Well the monatery system in this movie can't be explained. Why does currency still work in a world where there a so few people, and plenty of goods to go around for everybody.<br><br>The gated community is just a silly, awfully depicted place, instead of dealing with the situation they sit around drinking champagne and buying designer clothes. (Is this the huge social comment?!?)<br><br>Why build a stupid land train when you can loot every tank regiment on Earth?<br><br>Conclusion:<br><br>After the three first (Night, Dawn and Day) Land... seems to be a world of it's own. It seems to be so far away from anything else, depicted in the first three, it could be a pilot for a TV-series.<br><br>Many may complain about the one dimensioned actors but, be fair, how would ANY actor act in such a humourless, wafer thin story like this. The direction seems more to be inspired by army boot camp than any sort film-making. It follows the same concept over and over and over again: \"Run-Shoot-Swear-Run-Shoot-Swear\" And by God do not under any circumstances show any emotion except anger.<br><br>I was almost breastfed with zombie movies and for almost 20 years it's been a great inspirational source. It pains me to see this movie and I hate to admit that not even me, one of the greatest fans on the genre, can protect Romero from this failure.<br><br>Mr. Romero, get back to the drawing board, and better luck next time.<br><br>I still have hope!","user":"soulassassin2000","rank":[118,166]},{"title":"Complete Disappointment!","rating":2,"date":"29 June 2005","review":"This movie was terrible! The storyline - can't use the word plot as that would give it too much credit - was tedious! Some say it was a great perspective on class? Are you kidding me!!! From the HORRIBLE acting to the complete and utter Lack of dialog, characters changed motives, desires and allegiances so quickly without any second thoughts. Plus, a lot of scenes just plain didn't make Any Sense!<br><br>*SPOILER* I realize that the two troops were sent up to keep an eye on our main characters but why in the world did the big guy suddenly knock out that woman?!?! What was with that? The gratuitous female-on-female scene? What purpose did that serve? Only the one zombie guy seemed to be learning anything and leading the troops yet was able to avoid huge blasts from explosives while zombies around him exploded? These characters have such amazing aim at such strange points but then they can't kill this One Zombie? And everyone in the van just blindly follows Choro but then immediately switches alliances? And what was with the girl who was ready to nuke the entire city but then, when asked to fire on a bunch of zombies and half-eaten civilians all of a sudden she has a heart? Plus, even after Choro turned into a zombie he was able to carry out his revenge? Not only was he able to remember to kill that CEO guy but also he was able to find him that easily? And what was with the horribly, cheesy ending where they just want a place to live?!? Uh, hello, have we forgotten that THEY ARE DEAD!!!! Kinda the Premise of the movie!!!<br><br>Oh I just was SO disappointed - and I gotta say, I didn't have high expectations or anything, I just couldn't believe how bad it really was. My boyfriend and I looked at each other after the movie and were so angry - he had been particularly excited about this one and I thought the idea that the zombies would possibly be learning something well that was neat. OH SO SAD when a Great series like this jumps the shark!","user":"Blkpetal","rank":[71,103]},{"title":"Romero's latest Zombie flick is a winner","rating":8,"date":"20 January 2007","review":"Zombies have taken over the world in Land of the Dead, the remaining survivors live within a walled city to keep the dead out. A revolution is brewing in a plan to overthrow the city. but outside the walls the zombies are developing their intelligence.<br><br>The plot kind of sounds a bit lame, but it really does work well and this is a zombie flick that can be taken quite seriously. Romero has again created something great on a tight budget, and he has done well to make it look good, with some great make up effects. The cast are all pretty good, there are some good characters and the dialogue is effective.<br><br>Overall Land of the Dead delivers all out zombie action that's great for fans of the genre, good work George.<br><br>8/10","user":"mjw2305","rank":[23,30]}]