[{"title":"300","rating":8,"date":"22 February 2020","review":"300 tells the story of the 300 Spartans who defended their homes against the Persian army. The movie is a phenomenal action packed story that sticks pretty close to the actual events. The movie is done in a style similar to a graphic novel which adds high contrast and beautiful slow motion scenes. Overall, the movie is incredibly entertaining and tells a fascinating story.","user":"MR_Heraclius","rank":[39,46]},{"title":"A two-sided piece of art","rating":8,"date":"31 March 2007","review":"This film isn't for all people. That's to say about a lot of movies in general of course, but this one in particular brings up a big clashing point between critics; What do we want to see in our movies? What is more important, to portray a fictional setting for the sake of giving people a mind blowing visual experience or to amuse and amaze them with clever plot twists and intelligent dialogs?<br><br>First lets analyze what exactly this film is made of. Basically, the whole thing is just one epic fighting scene after another. Most noticeably is the camera work and the visual effects. Every shot seems like it was intended to be a work of art. The colors, the characters, the costumes, the backgrounds... every little detail has been given so much attention. During the big fights you'll also instantly notice the unique editing. There are a lot of \"time slowdowns\" throughout the battles which show what exactly is happening. Fatal wounds that slowly leak blood spatters in the air, decapitated heads traveling in slow-motion across the screen... it's all there. <br><br>The story on the other hand isn't very complicated, in the sense that the whole movie could probably be described in a sentence or two. The dialogs are simple and most often talk about moral values like freedom and honor. If you would look at the script, it would probably look like another movie that has nothing more to offer then idealistic visions of how life should be.<br><br>Reviewers of this title seem to be split up in two groups. They either love it with passion calling it an epic movie of the 21th century, or hate it even more and throw it off like a piece of garbage consisting of mindless action and silly cliché phrases. I feel reluctant to take a position in this argument. Normally it's tolerable to weigh out both sides of this matter to result in a fair judgment about a movie. Not in this one. On the one hand the visual are surely among the best to be witnessed in a movie. Every detail, every background, every special effect set to the scenes are so mindblowingly stunning. On the other hand the plot and dialogs are of the most simplistic and quite frankly dumb kind. \"I fight for freedom! I'd rather die in honor then live in shame!\" Sounds familiar? <br><br>Of course it could be debated that this movie was never intended in the first place to have a unique plot that makes your head spin. But from an objective point of view it's still lacking in this department, so it should be noted.<br><br>Now that's fine and all, but does that all make of the film? Is it worth watching or what? I think it is. For me the good outweighs the bad by miles. From the second the movie started it grabbed me and didn't let go. Every battle, every scene of the movie had me at the tip of my chair. Everything from the strong acting to the wondrous visuals to the war-shouts of the soldiers was just so stunning... it was truly a wonderful experience.<br><br>I did not one single moment felt like the movie lacked anything. But I could imagine why other people did.<br><br>So here's the deal.<br><br>If you are easily impressed by beautiful landscapes, wonderful camera-work and editing and powerful acting then go see this. Right. Now. You'll be missing out if you don't. There is so much to see, so much power in the way this comic is translated to the big screen... It'll leave you in awe.<br><br>However, you are looking for a good story, clever plot twists, some innovating to the world of the movies then skip this. 300 contains nothing of this, nor does it wants to give you this. <br><br>I enjoyed this movie so much, but I know there will be people that will pass of as rubbish, and that's understandable. Just be sure to make up your mind about what you want to see when you go to the theater yourself instead of being drawn into bias by the tons of reviews this site has to offer.","user":"gus495","rank":[1,1]},{"title":"Chills!","rating":10,"date":"13 March 2007","review":"After I saw the teaser for 300 I knew I HAD to see this movie! From then on I avoided all other previews, reviews, etc. as not to influence my expectations of the movie. I then went into the theater on opening night with no knowledge of the plot... only that it had something to do with Greeks and Frank Miller! Ignorance is bliss! I was absolutely blown away. I'm a 26 yr old female who generally doesn't watch violent films... but I found the battle scenes so well done and breath taking. I had chills and goosebumps virtually the entire film. I'm with many other reviewers, who felt like they had to contain themselves from shouting \"yeah!\" at times. Maybe I'm crazy, but I thought the whole movie was very sexy and passionate, whether it was the sex scene, a battle scene, or Leonidis addressing his men.<br><br>I think it is a shame that so many people are condemning this movie for it's historical inaccuracies, or it's \"racism\", etc. People are reading far too into this movie. Whatever happened to enjoying a movie simply because it is entertaining and pleasing to to the eye? Don't people watch movies anymore to escape from the daily grind of life? I know I'm not as well spoken as many who have posted here. I just think this was a fantastic movie. I didn't go see it to learn anything! I just wanted to be entertained! And boy was I!","user":"deadmonkeys","rank":[1,1]}]