[{"title":"A thoroughly enjoyable TV-version of Indiana Jones","rating":7,"date":"11 December 2004","review":"I liked it. I admit to catching the movie only because of Noah Wyle, but the movie caught me. It was fun, not taking itself too seriously, and the feature character is an unlikely hero, which is always worth watching. The name librarian is misleading since Noah Wyle's librarian character is more archaeologist and artifact keeper than librarian, probably why he's the librarian instead of a librarian, a different Jane Curtin will have you remembering.<br><br>The plot here is pretty basic. Geeky guy needs to save the world with beautiful woman to help him. She's the brawn; he's the brains. If you like fun little action-adventure movies, this is the kind of plot you're used to.<br><br>If you're looking for something different, don't look here. There's very little originality to bed had, but then again, since when did people start expect originality in a made-for-TV action-adventure?<br><br>The acting isn't bad nor is it great. It's definitely good enough for a made-for-TV movie. On top of that, you get to see Bob Newhart as a magic marine who kicks ass and saves the day. If nothing else, you should watch to see old Bob Newhart learn a few new tricks. ^_^<br><br>The music is pretty standard stuff. Think of it as a cross between Stargate SG-1 and Xena with some random rock beats tossed in for fun. It's perfectly suited for this kind of movie and doesn't try to step outside the box. Granted the rock beats got a little jarring at times due to their unexpectedness but the overall feel was fairly cohesive.<br><br>As for the 'action' portion of the program, it's more than fair. After all, if you're going to cast Kelly Hu in a movie, you make good use of the flair that she's known for, a touch of martial arts found in a good old-fashioned fist-fight. Hu's much more of a natural at this than her good-girl counterpart, but that's only to be expected since we are talking about the woman who got to give Wolverine as good as he gave. As for Bob Newhart, I couldn't possibly say whether or not he was good at the action bit. It's too weird for my mind to wrap around, but at the same time, I really liked him in this role. Noah Wyle was the brains so his fight scenes mostly involved him getting beaten up.<br><br>Overall, this was a really fun movie. I found myself watching it again when it re-aired. I dearly hope they make a sequel. This movie was much more conducive to a sequel than many other made-for-TV movies. I don't know that this would make a good series, but I'd be willing to bet it wouldn't be too bad if they tighten the story a little. After all, there's got to be a reason why there were so many threads left untied at the end of this movie.","user":"SaturnWings","rank":[63,78]},{"title":"I enjoyed watching this film with my grand daughter","rating":8,"date":"1 January 2006","review":"I liked the film, it was light hearted, didn't take itself seriously, (unlike some of the 'critics in here) It's a family film, which is as rare as rocking horse Poop these days, forget about the goofs, if you take every film apart you'll find them any where<br><br>If you want a film you can watch with a 4 to 80 year old, this is for you, just sit back and enjoy, I'd like to see a sequel to it (even if its just to see Sonya Walgar again, an unlikely heroine)<br><br>I know there are traces on 'Indiana Jones' here, but what the heck, every film can have traces of other films in them, why not this one, just enjoy it, my 4 year old grand daughter enjoyed it and its normally hard for her to sit through a film of any kind","user":"derrick-48","rank":[43,56]},{"title":"Good, light-hearted movie","rating":5,"date":"5 December 2004","review":"The Librarian: Quest for the Spear is a film that doesn't take itself too seriously. Though having a few minor errors in the proper names in legends, and having a protagonist that knows more and can put things together better than anyone ever really could, this movie is a very entertaining look at a work where every legend and fantasical story is completely true.<br><br>The basic concept is that Flynn Carsen (Noah Wyle) is a 30 something professional student with upwards of 27 advanced degrees. After his Egyptology professor graduates him early to force him into getting out of school and into the real world, he gets a job as the Librarian for the Metopolitan Public Library. Immediately after his interview he finds out that the Library that he is to be in charge of contains such wonderous treasures as the Ark of the Covenant, Pandora's Box, and the Golden Goose, as well as a fragment of the Spear of Destiny. Shortly after starting his new job the fragment is stolen by the nefarious Serpent Brotherhood. Flynn is sent to recover all of the pieces of the Spear with the help of Nicole No one.<br><br>While fairly predictable in resolution, this film offers light hearted romp though an interesting view on a more or less obscure legendary artifact.","user":"techneonate","rank":[48,64]}]