[{"title":"I did not like this film, unlike many uncritical viewers","rating":1,"date":"19 May 2012","review":"This film is unbelievably biased. It is pure anti-Soviet cold-war drivel and it is historically inaccurate. Robert Gates says that the CIA began giving aid to Islamic fighters in Afghanistan months **before** the Soviet invasion. Jimmy Carter signed an order on July 3, 1979 to give aid to the Mujahedeen. It had the effect of drawing the Russians into the Afghan trap. \"The day that the Soviets officially crossed the border,\" Zbigniew wrote to President Carter, ...we gave to the USSR its Vietnam War\". Charlie Wilson's importance is wildly blown way out of proportion. The real-life Wilson had always been a right wing government good-old-boy who liked war. He was a commie-hating cold-war warrior. In the film we are lead to think that Wilson was simply a good time loving, womanizing, good old boy Congressman that never really grew up until he saw in person poor Afghan refugees: themselves poorly drawn caricatures of Afghan citizens. At this moment in the film Wilson changed and found a righteous cause. Born again Charlie!! Pure Hollywood nonsense! The real Wilson was not a nice guy. He was a friend of Nicaraguan tyrant Anastasio Samoza. Wilson's buddy in the movie (Philip Seymour Hoffman's character) is based on the CIA operative Gust Avrakotos. Army colonels led a coup in Greece in the 1960s; Avrakotos was the CIA main contact with the totally horrible fascist regime. Avrakotos fled Greece in the late 70s, with a very nasty reputation. The consequences of this cold war game are ignored by this crappy Hollywood movie. The weapons the U.S. supplied the Mujahedeen were used to wage a lengthy, bloody civil war in Afghanistan. Reagan's claim that the Afghan fighters were the moral equivalent of America's founding fathers is absurd. More brainless propaganda. Half the CIA money went to the monster Gulbaddin Hekmatyar, who in his youth threw acid in the face of an unveiled women. The CIA and US government would ally with anybody against the USSR. The terrorists received Stinger missiles, US Army training, and lots of money. The Taliban and the group that came to be known as Al-Qaida came from the Afghan civil war and were taught by the USA how to fight. There was little real concern for the fate of Afghanistan and its people. Washington never cared about the Afghan people in the first place ... and they still don't care. They are just pawns in The Great Game. The movie is a formulaic cliché, with it's warped fixation on the importance of the individual and its disregard for facts. Most Americans -- and reviewers here -- apparently take movies like this seriously, but this kind of crap makes the USA a joke to the rest of the world.","user":"davylevine","rank":[159,200]},{"title":"Excellent and faithful adaptation of the best-selling book.","rating":9,"date":"22 December 2007","review":"It doesn't happen very often, but occasionally one man can make a difference -- a big difference.<br><br>George Crile's 2003 best seller, CHARLIE WILSON'S WAR, is a fascinating and eye-opening account of the most unlikely \"difference maker\" imaginable. A relatively obscure Congressman from the Second District of Texas, \"Good Time Charlie\" was known more for his libertine lifestyle than his libertarian legislation. Likable and licentious (even for a politician), Charlie Wilson served his constituency well since the good folks of Lufkin only really wanted two things, their guns and to be left alone. It's Easy Street replete with his bevy of beltway beauties known, appropriately enough, as Charlie's Angels.<br><br>When asked why his entire office staff was composed of attractive, young aides his response is a classic, \"You can teach 'em to type, but you can't teach 'em to grow tits.\" No argument there.<br><br>But even the most rakish rapscallion has a conscience lurking somewhere underneath, and for Charlie Wilson the unimaginable atrocities being committed in Afghanistan moved him to muster his entire political savvy toward funding the utter, humiliating defeat of the Russian military and, possibly, to even help hasten the end of the Cold War as a result. Fat chance, huh?<br><br>Under the skillful direction of Mike Nichols and a smart, snappy screenplay by Adam Sorkin, CHARLIE WILSON'S WAR is a sparkling, sophisticated satire that chronicles the behind-the- scene machinations of three colorful characters comprising \"Charlie's Team.\"<br><br>The on-screen \"Team,\" is composed of three marvelous actors with four (4) Academy Awards and nine (9) nominations between them. Charlie is beautifully portrayed by Tom Hanks in a solid, slightly understated fashion that is among his best work in years. He's aided, abetted and abedded by Joanne Herring, a wealthy Houston socialite played by the still-slinky Julia Roberts. Hey, why else have the bikini scene than to let the world know this? By all accounts Ms. Roberts looks good and holds her own, but the screenplay never gives us even a hint why Kabul and country is so important to her character. Maybe the two Afghan hounds usually by her side know -- but we as an audience never do. As for the third member of the \"Team,\" Philip Seymour Hoffman steals every scene he appears in as Gust Aurakotos, a smart, street- wise (i.e. non Ivy League graduate) CIA malcontent who knows the score -- both in the Agency's boardroom and in Wilson's bedroom.<br><br>For the Mujahideen to succeed, the most important assistance the U.S. can provide is the ability to shoot down the dreaded MI-21 helicopter gunships which rule the skies. This takes money, lots of money, and eventually \"Charlie's Team\" covertly coerces those in Congress to fund the effort to the tune of $1 billion dollars for advanced weaponry to arm the Afghan rebels. This includes top-of-the-line, state-of-the-art anti-aircraft and anti-tank rockets as well as other highly sophisticated killing devices. Nasty, nasty stuff.<br><br>That this kind of multi-billion dollar illicit activity can and does take place behind Congressional doors is truly alarming. Every American should see this movie or read this book because it reveals a truly frightening aspect of the business-as-usual political scene rarely seen outside the walls of our very own government. Oh momma, I wish it weren't so...<br><br>Even though the initial outcome for \"Team Charlie\" was an unqualified success, the unimaginable, unanticipated final result is that these sophisticated weapons are now used against our troops by the Taliban and others. Since the funding was entirely \"covert,\" the young generation in this part of the world has no idea the fall of Soviet oppression and the end to Russian barbarity was the direct result of American intervention. Yes, once the Russkies left, so did our aid -- zip for schools, zip for infrastructure, zip on maintaining meaningful relationships with the Afghan people. As a result, the overall consequence is an unmitigated disaster -- it's like the forerunner to \"Mission Accomplished.\"<br><br>As Nichol's film so pointedly points out, \"The ball you've set in motion can keep bouncing even after you've lost interest in it.\" Mike Krzyzewski knows this, Eva Longoria Parker knows this, little Lateesha in Lafayette knows this, but the typical American politician doesn't. So we go from good guys to bad guys because we couldn't let the world know we were the good guys. Talk about a Catch-22 (another Mike Nichols film).<br><br>Perhaps Charlie Wilson said it best, \"We f&amp;%ked up the end game.\"<br><br>Again.","user":"teocalli","rank":[194,278]},{"title":"Disgusting","rating":1,"date":"26 November 2010","review":"Tom Hanks bring me good expectations but when I saw propaganda I got disgusted right away. I was fighting that war myself and I remember clearly that I had some afghan friends on our side as well. Also communism was not horrible especially under Brezhnev rule(those were not 1930's anymore and not civil war in 1920's). I see antirussian propaganda everywhere these days but this disgusted me more then others because you show taliban like some sort of freedom fighters(but now you view them different aren't you?). Those freedom fighters take skin off alive Russian soldiers. Also russians never dropped children toy mines that's piteful lies. And the pilots scene also was arrogant \"Hey let's hunt some woman and children. Btw I cheated on my wife. Happy hunting.\" Just like CIA spread lies during the war Hollywood spreads lies 20 years after the war. USA has honor or what?<br><br>My friend died in that war he was a pilot and I was not happy when I was at his funeral. And this movie doesn't make me happy either it makes me offended by arrogance of Hollywood and US government.","user":"markup314","rank":[91,127]}]