[{"title":"Leanr the history before commenting.","rating":6,"date":"28 December 2007","review":"I have been hearing many bad reviews for this movie, panning it for a perceived 'blanket condemnation of the Mormon Church.' What so many of these reviews refuse to take into consideration is the actual character of territorial Utah in the 1850s and the rest of the historical evidence.<br><br>The plain simple fact is that Utah at the time WAS full of zealous religiosity. Every statement made by Brigham Young in the movie comes from his published sermons. Utah territory was a harsh and repressive society, and the movie portrays this accurately. <br><br>This movie is in NO WAY a blanket condemnation of Mormonism, though it IS a condemnation of the Mormon Church *IN THE 1850s.* To say that this movie portrays them like \"homesteading Nazis,\" is completely unfair.<br><br>John Voight's performance gives a perfect example of the sort of character found in Mormon authorities in the period, while his sons show us some of the various types of dissension, the outright rejection, and the horrified self-loathing obedience. <br><br>The only thing I can see wrong here is that they could have put some hostile people in the wagon company, as undoubtedly there would have been. I can understand why they did not however, in order to drive home just how terrible this massacre was. Whether or not Brigham Young was directly involved in the events is up for debate, but there can be no doubt that the teachings he espoused and the environment they engendered were a significant part of what caused the massacre.<br><br>In short, most of the negative reviews come either from Mormons or people who have very little background with regards to the history of Territorial Utah","user":"ravingloony-1","rank":[91,111]},{"title":"somewhat fictional movie about a true, historic American event.","rating":6,"date":"19 December 2007","review":"Having watched this controversial film, I can say I enjoyed it because American history does interest me. The film itself depicts the paranoid state of mind of Mormons and some bad timing for the emigrants from Arkansas passing through Utah territory, ironically on September 11, 1857.<br><br>The film itself does a good job with presenting the period piece with costumes, props and location... where it fails is the spoken dialog and monologues. Perfectly horrible was the language. The love story is an interesting twist in the story, fictional and entertaining. Also the feelings of trepidation, hate and fear in the film seems disturbingly accurate and true.. As with any religion or institution that tries to place theological control over a large number of people often seem to harbor fear and trepidation of losing that power.<br><br>The massacre scene seems to be word for word as depicted from the last words of John D. Lee, a person who participated in the act and was put to death by firing squad for it in 1877 after confessing his part in the massacre and explaining the state of mind of the people around him at the time.<br><br>What caught me was that this film was not tightly wrapped. It tried to set up the story and the events that lead to the tragic events, but loosely fictional enough to tick off some Mormons obviously.<br><br>Historically, yes the account of the Mountain Meadows Massacre seems pretty accurate, it does mention the Federal Government was going to be sending troops and that Brigham Young was ready to fight. But the way it was said and done to get these small set up events introduced... it seemed a little (not a lot) leaned against Mormons in the film. A fair and an unbiased recollection of history or historical events isn't what you will find but maybe, the story from a sensible relative of one of the massacred.<br><br>The film does try to show some human side of the Mormons that were involved, through the love story and the character they portray as John D. Lee, especially at the end of the movie. It pretty much wraps up with him looking like he is regretting doing something (this is during the massacre).<br><br>Also the film does very quickly attempt to show the history of ill will the Mormons had received and what led to their paranoid and resolute state of mind via montage of the violent mobs that often attacked the Mormons and then assassinated Joseph Smith in Missouri, forcing them out of the state.<br><br>The film does bring a controversial piece of American history to light and let's the viewer really decide for themselves. But in the end it seems to question the leadership (or lack of) in the Mormon church, who was at the time Brigham Young and the local bishop (John Voigt)in the film.<br><br>**I would highly recommend watching the 2004 documentary: BURYING THE PAST: LEGACY OF THE MOUNTAIN MEADOWS MASSACRE**<br><br>and reading the Mormon church's September 2007 addressing the events, in Mormon run Deseret News. http://deseretnews.com/article/1,5143,695209108,00.html","user":"phrixion","rank":[17,20]},{"title":"Getting your whole community to uniformly bash a movie is as good as telling people to watch it.","rating":10,"date":"20 December 2007","review":"I was about to disregard this movie and thought that maybe I'd check out what people have written about it on IMDb. Frankly, to any one that is not Mormon, the thorough and complete disgust I see on this site from people who are very obviously from the Mormon community doesn't dissuade me from watching this movie, it actually encourages me. When people take so much effort to convince you not to watch something, I for one, think it's probably worth watching. I have watched it now and I must say, it wasn't the awful movie we are made to believe it was by the people posting on this site. To the contrary, I found it a very powerful and compelling movie and I'm glad to have watched it. I will certainly do some historical research to see where the alleged biases come in, but I have a feeling the movie will certainly not be quite the fiction that some of the posters have made it out to be.<br><br>My actual rating would have been a 6 or a 7 at best, but since there are people (I would assume those in the Mormon community) trying to bring the rating down simply because it shows a group of their people in an unfavourable light, I gave it a 10 to balance it out.","user":"big_poppa_paul","rank":[100,143]}]