[{"title":"Awakening","rating":8,"date":"10 January 2006","review":"I have been anticipating watching this movie for a month and it was beyond my expectations of a lifetime movie. The acting was superior (Gilpin, Polo and the child actors). This movie follows two women (Gilpin and Polo) on their journey to help children around the world. Through their journey of orphans and abused children they stumble across Jacob, an severely abused child,whose story makes the movie touching and meaningful. The movie can get a little confusing at times because they do switch from one decade to another, as long as you're paying attention you'll understand what is going on. The movie was a great awakening of what some children are living through and that people can really change the world for others.","user":"Tmorris44","rank":[15,15]},{"title":"The love of children.","rating":8,"date":"21 August 2006","review":"Based on the book written by Sara O'Meara and Yvonne Fedderson ('Silence Broken'), this TV movie chronicles how both Sara and Yvonne went all the way to help kids who had been neglected.<br><br>The TV movie began with a young boy Jacob who tried to hide away from his abusive father as he tried to call the help centre. Though Jacob's father eventually found out where his son was, the help centre eventually managed to trace where the call was from. It was later known that the centre was managed by both Sara and Yvonne.<br><br>After Jacob was being brought to the centre, Sara and Yvonne reminisced about the time when they performed back in Tokyo and the event which changed their life. The two ladies knew after their encounter with the homeless kids on the streets of Tokyo that helping neglected kids was something they can do.<br><br>The movie changes between the current times and the time when Sara and Yvonne trying very hard to push their cause across to the relevant authorities in the country to some of the cases in the movie like especially two children by the name of Laura and Michael other than Jacob.<br><br>Sometimes it's just scary to hear and watch of cases of child abuse. But then it's just true that there are always such cases out there. The TV movie can really pull the heartstrings.","user":"dy158","rank":[9,9]},{"title":"Loved it - a \"MUST WATCH\"","rating":10,"date":"13 January 2007","review":"It touches you... Shows you the real world... Shows you that there is a lot of crap going on around the globe, where poor, helpless, innocent, orphans and children are being tortured, molested and abused. And then it shows that there are those amongst us who would spend their entire life fixing this! This movie has surely stirred me... and I will definitely watch it again. The acting is great, I would want to know what became of the lady in Japan though. The scene that brought a tear in my eye was when Michael's back was shown, and it read \"Bad Boy\" (which was made out of scars). And then again, when Jacob's shirt was removed, and we could see the Iron marks...","user":"sbaray","rank":[5,5]}]