[{"title":"Wholesome family values Movie","rating":8,"date":"3 May 2006","review":"This movie is about old-fashioned values like decency and unselfishness. Though the premise, an old style English shoe factory avoiding bankruptcy by designing boots for drag queens sounds sleazy, this movie is squeaky clean entertainment suitable for children.<br><br>The camera work is entertaining, especially, oddly the closeup scenes of shoes being manufactured, streams of colour zipping along to the upbeat music.<br><br>It is a movie without villains. The conflict comes from selfish vs unselfish motives, self direction vs worrying what others think, despair vs taking responsibility.<br><br>Of course the theme of tolerance for diversity is woven through. The movie does not have the usual silly Hollywood tolerance breakthroughs. It comes in fits and starts with back pedaling and tolerance from surprising sources.<br><br>The lead drag queen Lola sings better than anyone on American Idol, in a genre all her own. The musical numbers are far better than you will see an any real world drag show. These are not female impersonators. None of the drag queens would ever pass as female.<br><br>This is a character-based tragi-comedy about wildly different outcasts interacting. Of course the basic plot is predictable if you watch the trailers and use your intellect. But that is not how to watch this comedy. It is a bit like complaining that Lucille Ball was inevitably going to get herself covered in some sort of mess in the Long Trailer or that a Marx brothers comedy would end in a pie fight. Immerse yourself in the movie's reality. I was genuinely surprised by the ending, though in retrospect it was inevitable. Plot twists like a murder mystery is not what this movie is about. If all you care about is plot, skip this movie; it will go over your head.<br><br>All said, unless you have a heart of stone, you will come out smiling and more optimistic than when you went in.","user":"roedyg","rank":[118,128]},{"title":"Enchanting story of a drag queen and a shoemaker","rating":10,"date":"27 May 2006","review":"\"Kinky Boots\" is a delightful film based on a true story about the travails of a shoe manufacturing factory set in Northampton, England. When Charlie Price (Joel Edgerton) takes over the family shoe business, he discovers the company is practically out of business. After laying off a bunch of people, one of the young women he's making \"redundant\" tells him the company needs to find its niche. He finds it by accident when he helps a drag queen named Lola (Chiwetel Ejiofor) who's about to be attacked by a group of men. After watching Lola's shows, Charlie decides the niche will be shoe wear for \"a variety of men,\" i.e., drag queens et al., who have trouble finding womens shoes that fit. He invites Lola to Northampton to help design and test the shoes.<br><br>Funny, warm, with characters you care about, \"Kinky Boots\" says something about societal attitudes towards those who are different and what it truly means to be a man, but doesn't beat you over the head with it. It has a great story, lots of humor, and excellent acting, particularly from Chiwetel Ejiofor and Joel Edgerton. While everyone else in the film complex was at \"The Da Vinci Code\" and \"MI: 3\", several of us were being royally entertained by an old-fashioned story. We loved every minute of it.","user":"blanche-2","rank":[77,83]},{"title":"Cheeky, good fun!","rating":8,"date":"30 April 2006","review":"Kinky Boots is a cheeky, fun little movie that has a simple message, but a life all its own! It is part of the new wave of irreverent British comedies and it holds its own against the rest of the pack.<br><br>Chiwetel Ejiofor shines in this film, proving once again that he's an actor to watch. After compelling turns in Inside Man and Dirty Pretty Things (among others), he defies convention in Kinky Boots--this is not an actor who can be type cast! He is riveting as Lola/Simon, convincing through and through.<br><br>There are some subplots that fall a little flat, but the story is very cute overall. The actors are uniformly good, but Ejiofor stands out. In addition, the production design is also pretty well done--the drag sequences are hysterical and a joy to behold. This film put a gigantic smile on my face that stayed put for the rest of the day!","user":"HaloFive00","rank":[62,68]}]