[{"title":"Radiant!","rating":9,"date":"9 December 2006","review":"Bring your Kleenex. Maybe it's just coz I'm female, or maybe it's coz my mother read this book to me when I was little -- but every time a new word appeared in that web -- tears rolled down my cheeks!<br><br>It's very charming. They have kept to the time frame of the book -- it looks like the 1930s-1950s. They haven't tried to \"modernize\" it with pop culture references and silly jokes like so many kids' movies nowadays do. <br><br>Fern isn't break dancing with the pig. (No, there are no musical numbers.) <br><br>Fart jokes were kept to a minimum. (I think they are required by law nowadays to put fart jokes in all children's entertainment.) <br><br>They didn't dumb down the lovely words E.B. White used -- Charlotte uses her grand language as she speaks to Wilbur and spins her webs.<br><br>I kept thinking of \"Babe\" at the start of the movie. A white runt pig saved. Similar barnyard companions. Even the voice of Wilbur sounds like the voice of Babe. (Even tho Babe was voiced by a 32 y.o. woman and Wilbur by a 9 y.o. boy!) But I think the writers of Babe must have been fans of the classic \"Charlotte's Web\".<br><br>Steve Buscemi as the voice of Templeton the Rat is just perfect. (Poor guy even has a rat-like face -- is that why they cast him?) And the CGI animation is flawless. You can't tell the animated animals from the real ones. Flawlessly blended.<br><br>That little pig is SO cute at the beginning -- I just wanted to watch him play in the mud for 10 minutes. (But no, they kept the story moving along.) They even tried to make the spider cute, but that's quite a challenge. Still Julia Roberts' soothing motherly voice helps. (Nevertheless, the little girl next to me climbed into her grandma's lap when the spider appeared.) <br><br>And Dakota Fanning, as always, is a darling.<br><br>So go -- and if you loved the book as a child, bring plenty of Kleenex!","user":"hellokristen","rank":[81,90]},{"title":"Beautifully done, very true to the story","rating":9,"date":"16 December 2006","review":"I was prepared for almost anything going into this movie, knowing that so many filmmakers who adapt classic stories think it is their duty to \"update\" the story, or feel the need to add a lot of comic relief.<br><br>Thankfully, Winick did not succumb to these temptations. Instead, he offers a delightfully filmed version of the story, with CG effects so realistic and subtle that they detract from the live action base not even a little bit.<br><br>This movie is very true to the original story, and the comic relief was, in my opinion, not at all overbearing. I got a lot of genuine laughs out of the movie, and, at 40, that's saying something for a G-rated movie aimed at families with small children.<br><br>The movie has an old-fashioned but familiar feel to it. It seems to represent the America we all think we remember, and want to see when we visit the country. It seems in many ways timeless, without feeling Disney-esquire. I'm sure this is what the filmmakers were going for, and they hit it right on the nose.<br><br>I thought the casting was excellent, for the most part. Though Agnes Moorehead (from the original animated version) absolutely bowls Oprah Winfrey over as the goose, and Julia Roberts' voice was maybe a bit too matter-of-fact for Charlotte. Debbie Reynolds' extra-sweet voice did, I think, a just-so-slightly better job in the original. That aside, Miss Fanning is perfect as Fern, and Siobhan Fallon could not play the incredulous Mrs. Zuckerman one iota better.<br><br>I think E.B. White would be pleased. This is as honest a representation of his wonderful story as anyone could hope for.<br><br>If you have small kids, read them the book, and then go see the movie.<br><br>If you read the book as a kid, and still smile when you think about it, then go see it yourself.<br><br>Highly recommended.","user":"pkuras","rank":[49,56]},{"title":"moving, beautifully shot/animated","rating":8,"date":"13 December 2006","review":"It's a beautiful movie and wonderfully true to the book. A fan of EB White's brilliant work, I could recite the last lines alongside the movie. The friend I went with is a die-hard fan of the older, animated Charlotte's Web; his only complaint was that this one had fewer musical numbers (read: none). Also, I felt the beginning and end credits act as somewhat of a homage to the animated version.<br><br>The voices are very well cast; Julia Roberts is a comforting and delightful Charlotte, and while the opening shots of the spider made some in the audience go \"Ew,\" we grow, like the barn animals, to embrace her warm nature. I found her quite beautiful in the end.<br><br>Steve Buscemi is perfect as Templeton. Knowing John Cleese is behind the head sheep makes it even funnier. And Dakota Fanning finally gets to play a little girl being a little girl.<br><br>It only made me tear up twice, but I'm a big softy. Take the family, the kids, and anyone who's ever enjoyed EB White's classic story.","user":"serenade7","rank":[46,54]}]