[{"title":"See it if you have nothing left to see","rating":4,"date":"7 September 2006","review":"This film is only mildly funny, there are lots of situations that could have made it funny but I think its the lack of comical timing of the actors and scenes that for me missed the punch, you always see the joke coming. The story is unoriginal but this was not a film made for its originality. The film does have a few funny moments and lots of nudity and things alike, like drugs and parties but they all seem a bit dull and slow. The film falls way short of movies such as \"American Pie\" &amp; \"Road Trip\" even though more \"naughty\" stuff happens in this film and is more explicit, those films know how to use these elements for suspense and laughter this film just throws all them in an hopes it works.","user":"diabloicexp","rank":[18,23]},{"title":"Vida, you're the best.......butt","rating":2,"date":"19 September 2006","review":"I rented this movie for one, well two reasons: Vida Guerra. She is absolutely hot, however this movie isn't. And, disappointingly, no she doesn't remove any clothing. She does wear some nice, revealing clothes, but come on you can see more on the Internet. And the movie is pretty lame to boot. It is like a low-tier American Pie, but those films are way better and have better looking women. Trust me, check out Vida on the 'net and not in this loser.<br><br>Some of the performances are OK, like the red-haired dude from various other movies like this, but this doesn't even rate as an Animal House rip-off in any way. A few of the performers redeem themselves, I laughed a few (few) times.<br><br>And poor Larry Drake. You used to be a cool, character actor. What happened?","user":"Tom_Powers30","rank":[10,12]},{"title":"Not funny but not dumb","rating":3,"date":"26 August 2006","review":"Before I tell you what I think of this movie, I just need to tell you a few things. I'm 26 years old, big fan of all sorts of movies, no matter if they adrenaline pumping action flicks, deep emotional love dramas, intelligent satire or plain silly dumbness, as long as I get anything out of a movie, I'm satisfied.<br><br>About Dorm Daze 2 then, I saw Dorm Daze a couple years ago and I recall enjoying it. Nor more or less than any regular teen movie, but it had the whole door slamming Shakespeare thing going on which was really nice to see nicely incorporated into the American Pie format. This movie, however, tries to be as intriguing as the other one with a huge cast of people you never really get to understand who, why or what they are. The movie is a mess, but you can follow it if you really try (dispite all the errors in the plot). My main concern about this movie though, is that its not funny (and I'm a guy who found Benchwarmers hilarious for its plain and simple stupidity). There wasn't one single moment in this movie that I found funny, and I'd say I know funny when I see it, all categories. They were really trying for laughs but failed miserably. The plot work is much better then the comedy of it, but unfortunately that doesn't say much about the plot either.<br><br>Therefor, I cannot recommend this movie to anyone. Its not funny, and if you're into those plot things you better go with the first Dorm Daze instead, and stay away from this one.","user":"Jezperse","rank":[25,38]}]