[{"title":"Utterly Spectacular!","rating":8,"date":"8 March 2006","review":"I was a fan of the \"V for Vendetta\" graphic novel, and Alan Moore disinheriting the film was a bit discouraging. But he's always been a little crazy. The film version is everything I could have possibly hoped for - gripping, chilling, intense, exciting, heartbreaking. It gets Moore's music if not his exact words; elements are slightly different, subplots removed. But the idea - as V himself would be so proud to say - remains the same.<br><br>The plot is surprisingly complex and nuanced, and I don't want to give anything more away than the previews already have. Suffice it to say that a masked anarchist (voiced by Hugo Weaving) must save a young woman (Natalie Portman) during his attempt to expose corruption in the government. Weaving is perfectly cast, using his formidable physicality and imposing voice to give gravitas to the insanity of the character. Portman has gone from child to teen star and is finally emerging as a talented, adult actress following her Oscar-nominated turn in \"Closer\". Here, she gives her best performance to date as the orphan Evey. John Hurt is characteristically impressive as the enigmatic government leader, and Stephen Rea gives a wonderful supporting turn as the police inspector charged with finding V - before it's too late.<br><br>The Wachowski Brothers' former protégé, James McTiegue, takes on the directing duties here and helms an enormously impressive first feature, using every trick in the book in a manner reminiscent of his mentors' breakout hit \"The Matrix\". Unlike \"The Matrix\", McTiegue allows the story to be more of a focus than the action, and as a result the film is a tense and emotional thriller, with outbursts of spectacularly filmed and choreographed action. Showing more maturity and restraint than the Wachowskis, McTiegue doesn't show off, and his trickery isn't self conscious. When slow-motion overtakes a late action sequence, it seems as natural as breathing. The late cinematographer Adrian Biddle (the film is dedicated to his memory) does an outstanding job, Oscar-nominated Dario Marianelli's score is a fantastic accompaniment to the piece, and the visual effects are astonishing, terrifying, and deeply moving, especially in the climatic moments in Trafalgar Square.<br><br>With solid acting, great action, and fantastic technical wizardry, it sounds just like another \"Matrix\"-style ripoff. But the biggest difference in \"V\" is that it is a story of real ideas - not a fantastic, science fiction creation, but a genuine examination of the human condition. The power of fear takes center stage here - the fear of war, of disease, of famine. Fear is a basic human nature, and has been exploited as a weapon - a method of control - for centuries. And for those who would use it, a masked man waits in the shadows to carry out your sentence. The verdict? Vengeance. \"V for Vendetta\" is a must-see.<br><br>10/10","user":"paxatron","rank":[1,1]},{"title":"A Bloody Masterpiece!","rating":10,"date":"19 March 2006","review":"I am speechless. I just came back from the theatre, where I watched 'V for Vendetta'. There are three main elements in the movie and it excels on all three of them.<br><br>First off the dialogues and script. Intense, witty, honest but not patronising, intelligent but not pretentious. That's the first level at which the movie surprises you. You don't except such high level of script from an action movie. But it is slowly revealed to the audience that V for Vendetta is not just an action movie. The story is filled with current events and has a definite strong political sense.<br><br>Secondly Hugo Weaving's performance. It is definitely what grabs you from the start. He delivers some of the hardest lines with incredible charisma. His performance shines throughout the movie and honestly he sounds as good as any of the best actors out there. He should be nominated for an academy award.<br><br>Finally the visual part. Incredible, yet no \"Matrix\" effects used. Everything looks beautiful, dark yet vibrant. The cinematography is top notch. The final battle scene brought tears to my eyes.<br><br>Do not miss 'V for Vendetta'. It's one of the best movies of all time, an eternal classic.<br><br>10/10","user":"atzimo","rank":[1,1]},{"title":"A Brave Film","rating":7,"date":"7 June 2018","review":"On the eve of the suppression of freedoms following 9/11 and the government spying and intrusions this was just the film we needed.\nOver ten years later it is still exciting and riveting.\nWhether seen as entertainment or a polemic against right-wingers: V is a hero.","user":"zgp-17116","rank":[88,104]}]