[{"title":"Sad But True","rating":7,"date":"18 April 2007","review":"I can see how this film might not be for everybody, but I make my living writing for television and this movie is actually pretty dead on. The satire works because I felt they keep it real. Stuff that might seem absurd I have seen happen (actually real stuff that happens in the development of a pilot would make people shout at the screen and say \"come on - that couldn't happen!!). The film is very well cast - everyone from Lindsay Sloane to Ion Gruffudd give strong performances. Many of my fellow writers begged me to see it, so I finally went and I thought Kasdan does an excellent job. But the film could pretty much play like a documentary - without fail, the nets will almost instantly try and change the ONE thing about a project that makes it unique - they want it to be like everything else (Weaver's character has the great line - \"it seems original and original scares me!\"). It is a real marathon filled with danger to get a pilot sold, then possibly get it filmed, then edited, then tested and then through literally winning a lottery - getting it on the air!! But at the end of the day - it is the viewers who decide what stays on - if something gets numbers, it stays - if it doesn't - it goes. And every now and then a unique and smart show will get on the air and more times than not - no one will watch it. Viewers SAY they want something different, but most of the time when you try to do that - they go \"what the hell is this?? This is too different\" and then they go back to watching Jim Belushi.","user":"shark-43","rank":[64,70]},{"title":"Fast paced, hilarious film","rating":9,"date":"11 August 2006","review":"I saw this at the Traverse City Film Festival and it was one of my favorite films there.<br><br>David Duchovny has written a great script for a new TV show and the studio wants to make the pilot. Unfortunately, before it airs, they want to make some changes to his script. The film follows the script as it goes from one hand to another before it gets turned into the perfect TV sitcom.<br><br>The cast is excellent. David Duchovny does a great job as the lead, we all relate to him because we all want to see something new, not just the same clichéd sitcom premise. The TV show cast is great, from the opening moments in the film when they audition for the parts, all of their scenes are perfect. And Sigourney Weaver steals the show playing the evil network boss, every time she's on the screen it's impossible not to laugh.<br><br>Jake Kasdan was at the screening and told us afterward that most of the stuff shown in the film has happened to him before on several pilots he's worked on. It's sad that things like this still take place, that so many shows keep dumbing down and are afraid to be different. Hopefully TV executives will take a look at this film and get some ideas.<br><br>By the way, be sure to stay for the closing credits.<br><br>9 / 10","user":"se7en187","rank":[37,53]},{"title":"Solid movie","rating":7,"date":"29 April 2006","review":"Just saw this at Tribeca. Interesting, entertaining, often funny. Sigourney Weaver is exception. A Solid 7 -- as good as most independent films and insightful. <br><br>I would say that the only draw back are the visuals -- kind of bland photography. which should not detract at all from the films commercial appeal. <br><br>Jake Kasden is someone to watch. I also really enjoyed the Q&amp; A after the screening. David D. is very funny. And seems to be expanding beyond the X-FIles persona that must be hard to elude.<br><br>Sigourney Weaver is so underrated as an actress -- she can do anything. seems to get better with age.<br><br>Hats of to the production team","user":"marty416","rank":[47,69]}]