[{"title":"Bland acting, incomplete action, pointless take","rating":1,"date":"8 June 2015","review":"I registered at IMDb to spit out my frustration at the movie. 1. This movie is nothing like the other movie - Frequency. Granted, the premise is similar, but no background and a very weak story. 2. A device that can make a call to the past - well, whats the background to it? How come it is discovered late? 3. Only 1 person is chasing the autopsy report, the rest are busy burying it. That makes no sense. 4. The \"device\" gets accidentally kicked from the bed. It falls down... thats it.. nothing more to it! This just kept me hanging there wondering - am i missing something here ?? 5. And whats the deal with the lady (i think that was a lady) working in the morgue? She was very hostile to the lead character, delays the report by a day and then .. thats it !!! Pointless suspense scenario that just adds to the over all frustration!<br><br>I watched this movie only on account of the other 2 reviews before me. They compared it to Frequency (happens to be one of my favs). Got fooled ... this is not worth your time or download.. I really tried to like this movie, but I just couldn't watch after 30 mins ..","user":"sandeepak","rank":[6,7]},{"title":"Good for what it is.","rating":8,"date":"16 November 2019","review":"I'll be honest, I'm really into these kinds of movies, so it really scratched all my itches. I had a lot of fun with it. Give it a try, you might not like it but maybe you will.","user":"ravshar","rank":[0,0]},{"title":"Quality Film making","rating":10,"date":"22 April 2006","review":"Just finished watching a screening of Disconnect and I am impressed. The storyline was well plotted with a continuity that is absent in a lot of other films of its kind. The action flows almost flawlessly when it matters and delivers a memorable ending. The acting was very natural, the camera work and angles well shot, and the story itself held my interest by keeping me guessing all the way to the end. Good musical score throughout, too. Anyone who liked the Butterfly Effect or Frequency will certainly appreciate Disconnect.<br><br>Robin Christian Peters is a formidable new film maker whom I expect to see great things from in the years to come. When this film is released I predict it will do very well.","user":"brian-1425","rank":[10,38]}]