[{"title":"Let's put it this way: My 5 year old walked out","rating":2,"date":"30 July 2011","review":"Took my 5 year old son to see this one at a Saturday Matinée.<br><br>I can't remember the last time i saw a more un-engaging kids flick.<br><br>My kid was noticeably bored from the word go, but i'll give him credit he was a trooper through the first half. I've seen him get restless before in the theatre, this one he was more or less falling asleep.<br><br>When we got to the scene where Gargamel peed in the restaurant i was ready to check out, but i would brave it if my son was having a good time.<br><br>Wonder of wonders, at that point he turned to me and said \"Dad, i have to go to the bathroom, but when we're done there can we not come back into the theatre and just go home?\"<br><br>Tells you all you need to know about this one.<br><br>Don't waste your time or your money.","user":"drew_atreides","rank":[278,399]},{"title":"Hollywood, stop raping our childhood classics!","rating":1,"date":"2 August 2011","review":"Clever producers and marketers have known it ever since: when in doubt, take some beloved children's comic-, cartoon- or toy-franchise and put them into a 'hip' contemporary setting (that's NYC or Los Angeles to you and me). This has worked many times before, having produced such monumental box-office hits like \"Masters of the Universe\", \"The Neverending Story 3\" and the record-breaking \"Howard the Duck\". Not to forget that epic events when Jason went to New York or when Mr. Bean went to Los Angeles. To paraphrase a currently fashionable comedian: all those films were \"WINNING\"  and so is \"The Smurfs\".<br><br>Hollywood, we understand that a buck means more than anything to you but please – pretty please – stop raping our childhood classics. Mr. Spielberg, if you happen to read this, please: \"LEAVE TINTIN ALONE!\" So as to not let this review degenerate into a complete rant: the acting was alright (for your average children's TV-show ala Sesame Street) and Frank Azaria, well, let's just say that I liked his various voices in \"The Simpsons\". The real problem is the Smurfs themselves, who seem soul- and lifeless as, almost as if they had been created by a computer.<br><br>How would I grade this calculated, corporate train-wreck? Well, I'll give it a finger but it certainly isn't the 'thumbs-up' one. Save a few bucks, rent the Hanna-Barbera \"Smurfs\"-series or treat yourself with the original, \"The Smurfs and the Magic Flute\".<br><br>I'll be seeing you next year for the Hollywood remake of \"Asterix the Gaul\". I'll let you in on a secret: Asterix and Obelix go through a mystical time-gate and end up in New York, where they'll be playing Guitar Hero  with a former child-star – and it's in 3D! But all that's top-secret inside information. Now excuse me, I'll have to go and pass water over the grave of Peyo.","user":"t_atzmueller","rank":[98,140]},{"title":"Everyone involved should be thoroughly ashamed of themselves.","rating":1,"date":"2 August 2011","review":"I know film makers never set out to make an awful movie. In their heart they start the production with the hopes the final product will be a good one. But after seeing this, I wonder what they really had hoped for. Even during pre-production someone, a producer with some ounce of talent, should have hit the breaks on this one. In the end they all must have realised what a huge pile of toxic waste this is.<br><br>If you're going to make an animated Smurf movie, then do so and let it be animated in it's own Smurf world. Don't involve real humans, animals, locations etc.<br><br>The final product stink and everyone involved should be thoroughly ashamed of themselves.","user":"Valmont74","rank":[160,267]}]