[{"title":"Not bad... just not award worthy.","rating":7,"date":"21 August 2007","review":"I didn't know much about Invasion before I walked into this movie. I heard the bad reviews from critics but hell, who listens to them? While watching this movie, I wasn't aware that The Invasion was re-filmed and rewritten. Apparently they rewrote it to add the twist in the end, as well as they added more action sequences with faster and better-angled camera work.<br><br>So the movie starts off right away with Carol Bennell (Nicole Kidman) scattering around the medicine cabinet in a Pharmacy whispering \"stay awake, don't fall asleep\" to herself. The neat fast-paced camera work kept you right into the movie from the beginning, but sadly the amazing beginning just doesn't match up to the pathetic ending. It seemed like they got tired of writing the movie so they decided to end it off with a simply and quick ending.<br><br>Some organism from a different planet crashed down to Earth and took over the citizens of the world. When the organism comes in contact with a human, they will become a different alien-ish like being obsessed with capturing people and affecting the world with their plague. When each person was affected, they would turn into these emotionless, mindless and painless zombies while they sleep. In search of her son, Carol Bennell gets affected and must stay awake so she would be able to save her boy. With help from Ben Driscoll (Daniel Craig) and his team of doctors, they go on the search for a cure, to save humanity and especially, save Carol.<br><br>I find that this movie gave off the message it was trying to, but in the process it failed at almost everything else. I was expecting, before walking into this movie that it would be filled with suspense with my heart jumping ever so often... but I wasn't scared or thrilled once. The suspense scenes had great music playing, had the great camera angles, but was just missing the spice to make it really work. And in regards to the end of the movie... I can promise you the writers got tired of having to rewrite a story and just through in a quick, painless ending. Course the quick painless ending resulted in annoyance for the audience.<br><br>While I walked out of the theater, I was thinking about this movie and how I would interpret it. One thing came to my head, and it was that the new directors did what they were supposed to - make me think and remember this movie once I leave the theater. This was NOT a forgettable movie, rather quite memorable. Sure there was a bad ending, but my eyes were attached to the screen throughout the whole film. I didn't look at my watch once, and for me that gives this movie a big bonus.","user":"steeped","rank":[88,115]},{"title":"Invasion of the Script Snatchers","rating":4,"date":"19 August 2007","review":"\"The Invasion\" had a lot going for it. It had two big stars, an acclaimed director, a big time producer, and a time tested premise. The only thing missing was a script.<br><br>\"The Invasion\" does not follow the same story as the earlier movies. They took the premise and made a new story. The new story has only a threadbare plot, no character development, and some of the most banal dialog I have heard in recent years. At 93 minutes, there are long passages that go nowhere and do nothing for the story.<br><br>Whoever gave the green light to this production without having a decent script first should be fired.<br><br>Despite that, there are some parts that are watchable. It is just frustrating that they could not have come up with a better story and better characters.","user":"brenttraft","rank":[167,237]},{"title":"Not Bad..Nicole lookin good!","rating":7,"date":"24 August 2007","review":"We went to see this last night. After all of the horrific reviews, I was expecting a real P.O.S. I was pleasantly surprised. While not to say it was an AWESOME movie or anything. It was good Sci Fi fun. I get irritated when a lot of movie buffs are looking for every film to be a Gone with the Wind or something. This was just a fun, smooth, entertaining production. I've never been a real fan of Nicole kidman, but I must say, she was quite fetching in this movie. If you are looking for the 50's version of War of the Worlds..The forbidden planet..John Carpenter's the THING...etc..it doesn't qualify. If you are looking for a fun Sci Fi Thriller to watch, it does the job.","user":"rdambroso","rank":[123,183]}]