[{"title":"Dances with Vikings","rating":6,"date":"13 February 2008","review":"Nipsel and company basically hybridized the structure of Dances with Wolves with a not-quite-historical fiction (more like radical speculation) plot about interactions between Norsemen and Native Americans during the 12th century A.D.<br><br>Ghost (Karl Urban) is a Norse boy left behind aboard a wrecked ship. He is adopted by the Clan of the Dog (the dogs who cohabitate with this tribe are historically inaccurate, but that's just one of many historical transgressions). As he grows up, Ghost's obvious difference and his history become something of a stumbling block for him, but he works hard to overcome them in order to be accepted by his adoptive people. Eventually, it seems, he must confront the demons of his past, and unfortunately, so must the Clan of the Dog.<br><br>Pathfinder is played well by Russell Means, and Ghost's love interest - Starfire - is nicely portrayed by Moon Bloodgood. Urban has great physical talent, but this story did not lend itself to testing his ability to create drama and mood, so there isn't much to say about his performance. Likewise, most of the Norse characters were so under-developed and one-dimensional that it is impossible to comment on the performances involved.<br><br>Although the story relies on stereotypes to develop both its Norse and Native American characters, since so little is actually known about the Norse colonies, this seems forgivable. What is not really forgivable, in my opinion, is the reiteration of the trope established in Dances with Wolves and other similar works which suggests that it takes a European to effectively fight off Europeans. Although the characterizations of the protagonists in both films are adequate to explain their behavior, the character and behavior of the Native Americans attached to them is less well developed, and there is a lingering, inaccurate and disturbing shadow of inferiority implied in their apparent inability to strategize and effectively lead in combat.<br><br>However, Pathfinder refuses to touch reality with any length of pole, so, sit back and enjoy the action, costumes and sets.<br><br>The film contains a lot of violence, most of which is convincingly shot. The costuming is excellent, and the sets are lovely. if you can get past the problems - which are several - you may just enjoy it.","user":"mstomaso","rank":[45,56]},{"title":"Good action scenes wasted on terrible story, acting and editing.","rating":5,"date":"15 January 2007","review":"What a waste.<br><br>The only redeeming feature of this movie were the well made action scenes (not all were good, but overall there were more enjoyable fight sequences than boring ones).<br><br>The story is clichéd and predictable. The acting is terrible (the main role is so horribly sketched out that you can barely blame the actor, the supporting roles all make a mark for their blandness). The main couple have no chemistry, the dialog is UN-enjoyably bad and the editing looks like it was done by a blind man. Scenes start and end with absolutely no flow. One scene was particularly bad (I wont spoil it for you, suffice to say its the one where the Indians charge into battle against the hero's wishes). That is the only scene when I laughed in the movie, and its supposed to be a sad/rousing scene.<br><br>The trailer of this film looked really pretty, but then again the consisted of mostly the fight scenes so I'm not surprised at all. The director seems to have had a good eye for visuals, but his effort has ended there.<br><br>Pathfinder = 5/10 Five for the fight scenes.<br><br>I was trying to find a path out of the theater at many times during the movie.","user":"access_code_1","rank":[188,285]},{"title":"Don't think of this as a 'history lesson' ... just enjoy the story.","rating":8,"date":"1 September 2007","review":"This film was very good. I really think the viewers should not even think about it being a 'history lesson' at all. It is very much a Frazetta style picture, with almost exactly the 'Death Dealer' painting portrayed. So with that in mind this is a movie of possible unknown 'raiders' who are just *way* too brutal and they just want to kill and maim and they need to be stopped at all costs by the natives of the land ... and so they need a hero.<br><br>I think this film is at least twice as good as \"300\", and here's why: although it has almost exactly the same 'graphic novel' look and feel, I like this film more because the storyline was very engaging, great characters, costumes, and cinematography. As you watch the movie each scene is distinct and new and really is memorable, and if you *really* squint your eyes you might even believe it (like 'Lord of the Rings'). There is lots of gore (heads lopped off, etc.) but that is the current styling of films anyways; I could do with a little less of it myself.<br><br>I loved the natives and how they're portrayed. The costumes and sets are fantastic! There's a bit of their mysticism, and honour (warriors are very 'brave'), and real sense of tribal bonding and family.<br><br>PS. Watch the DVD extras and you really 'get' where they were going, (who cares about the vikings having horns??). It's just a great movie, and for story this is great! Thanks to the cast and crew !","user":"Michco","rank":[14,17]}]