[{"title":"I enjoyed this movie","rating":7,"date":"23 February 2020","review":"A massive departure from the original, Death Race keeps the cars and kills and forgoes virtually everything else from 2000. Fun in a very different manner, but still fun, and that's what counts.","user":"MR_Heraclius","rank":[38,39]},{"title":"Don't Listen to the Critics","rating":8,"date":"14 November 2008","review":"I always hate it when all those high class critics from the newspapers and journals bash a film for not being what THEY want it to be and not looking at it for what its SUPPOSED to be.<br><br>The title is \"Death Race\" after all. No-one ever expected it to win any golden trophies in the first place. So what if the acting was a bit bland and the plot was a little weak. That's not was the movie is supposed th be about.<br><br>It's not a Martin Scorsese film where you sit back and think \"Oh, that is very thought-provoking and I feel that I've truly learned something inspirational today.\" No. This is a film where you sit back, look at it, and think \"Holy ****!! Did you see that ********** explosion?!\"<br><br>This is a film where you have fun in. Don't worry if you walk away with nothing meaningful to talk about at the end. Go ahead and laugh at its stupidity. I guarantee you you'll still have a much better time that watching something like Capote","user":"dino_saur333","rank":[186,242]},{"title":"who needs a plot when there's explosion and mayhem?","rating":7,"date":"21 August 2008","review":"2012 the economy has hit bottom, broke through and has kept on descending. Along the way prisons have been handed over to the private sector that have chosen to make a profit by broadcasting gladiatorial style death matches starring the inmates, with the reward to the inmates after 5 victories  FREEDOM Enter Jensen Ames (Jason Stratham) a recently unemployed steel worker and former race car driver who lost his license but no matter how bad things are, he's a happy man as long as he has his family.<br><br>That is, until he's set up for the murder of his wife, imprisoned, and forced to compete in Death Race if he ever hopes to see his daughter again.<br><br>But enough of the plot! A paragraph blurb at the start and 8 minutes of character development is pushing the limits of this flick and that's not why a person would see a W.S. Anderson/Jason Stratham action flick and besides, a plot would allow \"plot holes\" and who needs to deal with that headache? The rest of the movie takes place in the 3 days of Death Race. The first 2 days are competition/elimination rounds reminiscent of Mario Kart as if it was designed by some rogue member of GTA on a disgruntled day but who loved the hidden short cuts and power-ups.<br><br>Amongst all the adrenaline filled action, Anderson makes sure to toss in the occasional character development or when he's feeling really daring he'll toss in some pseudo-dramatic realization our hero comes across which helps remind the movie-goer that the movie has a plot rather than just a string of explosive action sequence. All of this is done with the utmost use of cliché and designed to inspire the excitable little 12 year old boy in many of us to stay riveted in our seats as we wait for Jensen to strike with angry revenge for all he's been through.<br><br>The movie is everything a modern day movie aficionado should not like. It's brainless, sexist, ridiculously violent, and lacks any redeemable qualities. These are also all the reasons why I had so much fun with the movie. I went seeing what I expected and that's exactly what I wanted to see!","user":"NolanSorrento","rank":[199,260]}]