[{"title":"Second most underrated MCU film.","rating":9,"date":"10 May 2019","review":"Ant-Man is great Heist film disguised as a superhero film. With great performances all around, I'm surprised it doesn't get the attention it deserves. Definitely a must-see-movie.","user":"jstrohm-58359","rank":[14,16]},{"title":"Better than I thought it would be","rating":8,"date":"2 September 2015","review":"Antman. When I first heard about the plans for this movie I laughed to myself and thought, \"How can becoming smaller be cool?\" Sure enough, Marvel has surpassed my expectations and turned something I thought would be lame and uninteresting into something hilarious and actually pretty cool. I'm not going to include any spoilers, but I will say the fighting style of Antman is much better than I thought it would be. I learned a lot about the story as well as the abilities he has. <br><br>Antman gets much more interesting when doing combat. The ability to shrink and grow at will is something Marvel has gotten very creative with. <br><br>The language in this film is good enough for my young children to watch. There are no F or GD bombs to ruin the mood and the moment with the family. I'd say I'd surely watch it again.","user":"Dana_Sibilsky","rank":[165,252]},{"title":"2 legs bad; 6 legs better","rating":8,"date":"21 July 2015","review":"OK, so I will probably target the wrath of a legion of fan-boys but as a PhD Physicist I will categorically state that much of the science in the Marvel universe is total nonsense. For example, it requires a certain suspension of belief that whole cities can be levitated. But it's called \"Science Fiction\" for a reason, right? \"Ant Man\" pushes that suspension of belief to whole new levels. The concept that a miniaturised man, were such a thing even possible, could exert the same moment and force as a full sized person would make Newton spin in his grave.<br><br>With these nagging doubts I watched the trailer increasingly comfortable in my view that, (even with a free cinema pass), this was a film I would avoid like the plague. That was until the final scene, featuring Thomas the Tank engine, that was ludicrously and surprisingly comical. Could it be that, like last year's \"Guardians of the Galaxy\", Marvel had pulled its pompous head out of its ass and come up with an 'Avengers-lite' that could entertain a broader audience? I decided to risk it. And I was glad I did.<br><br>Paul Rudd (\"Friends\", \"Anchorman\") plays ex-con Scott Lang who is recruited by brilliant scientist and would-be superhero Dr Hank Pym (Michael Douglas) and his gorgeous daughter Hope (\"Lost\" and \"The Hobbit\"'s Evangeline Lilly) to steal a jacket. (No, really). The owner of said jacket, albeit a high-tech jacket, is businessman and all-round bad-guy Darren Cross (Corey Stoll), with evil intent. (You can tell he's evil by what he does to a cute little lamb - this is the worst viewing for sheep since \"Far from the Madding Crowd\".) By miniaturising Lang and securing the help of an army of ants, the stage is set for a heist of a most unusual kind.<br><br>This sounds ridiculous to even write. So why does it work? First up, the script by Edgar Wright ( of \"3 Flavours Cornetto\" fame), Adam McKay (\"The Other Guys\"), Joe Cornish and Paul Rudd himself is as tight as a drum, with some situations and lines that are downright hilarious. A couple of brilliant lip sync scenes, one featuring the requisite Stan Lee cameo, are grin-inducing pleasures.<br><br>Supporting the screenplay, the three leading players pull off their roles with enormous panache. Rudd is hugely likable, with all of the smart-whip humour of Downey Jnr.'s \"Iron Man\" but with none of the appalling arrogance. Michael Douglas, in his one outing this year, seems to be revelling in his role and (presumably with the help of some clever makeup and/or CGI) looking very dapper in the 1987 version of his character. And Evangeline Lilly enters the Avenger's world with a bang and looks very comfortable there. In an effective supporting role, Michael Peña (\"American Hustle\") adds a comic lightness of touch as fellow robber Luis. Abby Ryder Fortson also deserves special mention (and an Oscar for cuteness) as Lang's young daughter.<br><br>Whilst real fan-boys might object to the flippant nature of the film, there are a number of clever cross-overs into the 'mainstream' \"Avengers\" films, with one B-list Avenger guest star and (eventually) an A-list appearance. And (as is common in these films, and notable as 80% of the audience stayed in their seats for the full credits) there is both a mid-credits scene (that's a set-up for the sequel) and a final post-credit scene that (so I'd told) is hugely significant for next year's \"Captain America: Civil War\" (in which Rudd is set to reprise his \"Ant Man\" role).<br><br>The director is Peyton Reed, whose limited movie portfolio to date includes Jim Carrey's \"Yes Man\" and \"Bring it On\".<br><br>As I found myself thoroughly enjoying the experience, my rating, against all the odds, is twice what I expected it to be. I can't believe I'm saying this but I recommend you go see this for a fun movie summer experience.","user":"bob-the-movie-man","rank":[73,117]}]