[{"title":"Does what it does well enough","rating":7,"date":"7 January 2011","review":"If you have seen the trailer and gone ahead and bought or rented the movie, then you know what to expect. This isn't Bergman's The Seventh Seal, or Welles Citizen Kane. It is what it is, a funny family movie with lots of forest critters causing trouble for Brendon Fraser.<br><br>Of course Brendon has done better more artful movies, of course he's done more adult-themed action, but why all the hate for this movie? Sometimes I want a sophisticated cerebral comedy with witty satire and subtlety, just like sometimes I want a fancy meal. But there also times I just want to kick my shoes off, sink a beer, scoff a pizza, burp and watch a fun film. This is what you get with Furry Vengeance, and it delivers what it sets out to deliver.<br><br>The performances are exaggerated sure, and yes, you can tell no-one has spent months refining the CGI. But what the hell, the movies makes you smile throughout, with a few laugh out loud moments thrown in too, and the extras on the DVD prove that everyone had a good time making the film.<br><br>Chill out all you negative reviewers, appreciate this movie for what it is.","user":"reccewoody","rank":[33,42]},{"title":"A movie that needs defending","rating":9,"date":"20 August 2010","review":"I don't usually bother with reviews but when I logged into IMDb and searched for Furry Vengeance I was astonished to find the movie was actually lounging in the bottom 100 of all time I was simply stirred into action to defend this movie. I have put two and two together and decided that the low rating this movie has accrued has probably everything to do with a bunch 20 something nerdy tech heads who have yet to enjoy the pleasure of having children, I watched this film with 3 young children of various ages and they had a ball as I did, there was several laugh out loud moments and not just for young children but adults too, but if you're a twenty something adult you might find it so uncool inverted commas! so seriously you view life. When you have children of your own movies like this will become so much more enjoyable believe me!. I'd give this movie a 7 rating from an adult with children perspective but I rated it a nine because the children in my presence absolutely adored it and would probably have gave it ten if they could rate it themselves. Some people should really learn to enjoy life sometime?","user":"Thischarminglad","rank":[60,85]},{"title":"a made-for-TV movie if ever there was one","rating":3,"date":"16 May 2010","review":"I won't give away any plot, but to be honest if you've seen the trails you've probably seen the only good bits of the movie and the rest is watchable if nothing's better on.<br><br>I initially gave this movie 4/10, but as I wrote this downgraded to 3. I'd say this movie would be ideal for anyone between the ages of 5 and 9. I'd not buy it on DVD except from the bargain bucket, or watch for free on regular TV. I regret having spent good money to see it at the cinema.<br><br>We saw this at the cinema as a family; we are middle-aged parents with a son, 6, and a daughter, 4.<br><br>We adults thought it was slow to get started but managed to pick up a little bit of pace. It was quite predictable with the same jokes repeated, and there were no plot twists at all to give it any interest. The bored teenager role was acted with little imagination, the girlfriend just about imagining a soupçon of character. Brendan Fraser managed to make a reasonable deal of a weak plot, and his wife Brooke Shields had a few moments of believable acting as a wife.<br><br>The script writer lacked imagination, the budget was probably quite low too, there were times the poor CGI punctured the suspension of disbelief (I imagine this would not be one to enjoy on blu-ray unless they fix things up in the transfer). One novelty was that the animals didn't speak, instead thought bubbles appeared with pictures. If I was being cynical I'd say this was as much a way to avoid the costs of voice character actors and dubbing into foreign languages as to give the movie a twist.<br><br>This could easily have been an episode of a any standard sitcom about a family relocating to the country, and could have been edited down to 45 minutes... and then perhaps the reuse of jokes might not be so bad, but they quickly became stale.<br><br>So, the movie failed from an adult perspective. Did it succeed to keep the kids entertained? Our 6 year old enjoyed it, he's at that age where adults being stupid, animals being smart, and lots of mess and stink are funny. He's able to follow quite complex dialogue so was able to grasp the point of the movie.<br><br>Our 4 year old found it hard going, as it was slow to start, there was too much dialogue with too little action, she enjoyed the slapstick humour, but was frequently restless - she'll re-watch Finding Nemo with more attention and she's seen that 10+ times!.","user":"speculatrix","rank":[36,49]}]