[{"title":"Run-of-the-mill teen comedy","rating":5,"date":"13 September 2006","review":"You'd think that a movie called \"John Tucker Must Die\" will approach the parameters of a gritty look on high school-style existentialism. As the National Geographic Channel puts it, think again.<br><br>John Tucker (Jesse Metcalfe of \"Desperate Housewives\") is the star of their high school's basketball team, and he's secretly dating three girls simultaneously. Upon learning how their \"serial-cheating\" boyfriend is three-timing them, cheerleader Heather (Ashanti), intellectual Carrie (Arielle Kebbel) and activist Beth (Sophia Bush) plot for revenge. They set him to fall for new girl Kate Spencer (Brittany Snow) and have her break his heart later on.<br><br>So that's \"John Tucker Must Die.\" It's a film that tries to go for the feel-good parts of the standard teen flick, along with the usual high school relationship subplots. But gritty it's not. Though initially the movie seems to head towards being an effective satirical comedy, it immediately becomes just another stock sleaze. Betty Thomas' direction is breezy enough but she fails to give the film a distinctive bite as Jeff Lowell's screenplay seems not to draw a bead on to the vaguest notion of creativity.<br><br>Metcalfe is effective as the eponymous lead while Snow (who I recall as Zoe in \"The Pacifier\") could have been charming but the problematic script doesn't give her a juicy character that could rise beyond its stereotype and she ends up bland. In fact, one could arguably root more for John Tucker. As for the rest of the cast, they're a mixed bag with Ashanti and Jenny McCarthy as Kate's mom figuring prominently in my head.<br><br>\"John Tucker Must Die\" isn't so much an absolute schlock. Despite its transparent and derivative nature, it does have some of its moments that elicit chuckles. It's that sort of movies I watch on sleepless nights on cable given the right mood. But with a title as toothsome as that, it tantalizingly could have been way better.","user":"Jay_Exiomo","rank":[44,63]},{"title":"Cute, Cute, The \"Johns\" out there Must die. Just kiddin.","rating":7,"date":"31 July 2006","review":"OK, so I went to see this with my mom who is over 55, my niece who is 15 and I am 26.....so you have assorted ages and opinions and point of views...Well we all thought is was going to be cute and funny but we didn't think we would laugh the whole time and think that it would actually have a good story to it. I thought that my mother and I liked it more than my niece did, I'm not sure if that was because we could relate to the moral of the story but I know she laughed a lot louder than we did at times. But we all laughed. The crowd was mostly teens. Compared to other movies out this summer I think it is worth paying the day or night rate. I would actually go see it again.","user":"jast_family","rank":[88,141]},{"title":"cute and upbeat","rating":9,"date":"28 July 2006","review":"When I first saw the previews for this film I thought it looked funny, but shallow..and a little trashy. However, after I saw the film I was surprised to find the film uplifting, with some depth , and good actors. Ashanti,Bush,and Kebbel blend together well as they team up against Tucker. Each of their personalities contribute to this film in a special way. Snow (the lead character) was what made the film. She truly lit up the screen.Actors aside the movie as a whole was enjoyable and exciting. This movie maybe was not the most spectacular movie created. But it was fun and worth spending a few bucks to see.<br><br>If you are looking for something entertaining, you might want to give this a try.<br><br>4 out of 5 stars","user":"greasefreak","rank":[58,97]}]