[{"title":"A Tour de Force on bald tires","rating":9,"date":"2 February 2006","review":"Anthony Hopkins is simply astounding. The man can disappear inside of characters so diverse and capture you so completely, that you have to wonder if his well of talent has a bottom.<br><br>This film is at turns charming, bawdy, fascinating, riveting, nerve wracking, hilarious, heartwarming and heartbreaking. As Burt Munro -- an aging New Zealand man losing his hearing, short on money, living in a shed surrounded by weeds, considered a lovable if eccentric oddball by all who know him except one small boy, and obsessed with making a 45 year old motorcycle capable of breaking the land speed record on the Bonneville Salt Flats -- Hopkins takes us along for the ride every minute of this movie. The fact that this film is based on the true story of Burt Munro makes it all the more captivating, but a lesser actor than Hopkins might very well have lost us along the way. It is no wonder that the children of the real-life Burt Munro were moved to tears by Hopkins' portrayal.<br><br>There's a clever ongoing bit about the taste of Burt's hot tea, and you will also wonder a bit about how his lemonade might taste. Every scene is a jewel in this movie, and the cumulative effect proves that extraordinary films do not have to cost bazillions of dollars and take two years of computer-generated special effects to WOW their audience.<br><br>Burt is challenged by every imaginable obstacle standing between him and his speed dream: his failing heart may give out any minute, the journey around the world to transport the 1920 Indian motorcycle to the USA seems insurmountable, he has no machine shop or whiz-bang tools and equipment to work his engineering miracles, etc. What he DOES have is an indomitable spirit that will never, ever stop trying. Whether he's battling young ruffians who diss his ancient motorcycle or banking, bureaucrats and red tape, he is a wrinkled but worthy warrior.<br><br>The supporting cast is as beautiful and bizarre as it gets, and the audience becomes inordinately fond and just about every one of them except for a nasty foreign cabdriver (Carlos Lacamara), but hey, somebody had to be disliked. Great actors in small roles abound, including Diane Ladd as Ada, a frontier gal that's been lonely a while, Saginaw Grant as Jake, an \"Indian\" with a really distasteful solution to Burt's prostate problems, and Paul Rodriguez as Fernando, a human and humane used car salesman. Perhaps the best scene -- and heart -- stealer is Chris Williams as Tina, a cross-dressing front desk night clerk at a fleabag hooker hotel. You gotta love him. Or her, as the case may be. Stellar performance, and Hopkins' Burt treats Tina with such dignity it defines friendship.<br><br>Don't miss this fine, fine film. And if there is justice in the boffo box office world, The World's Fastest Indian will be a true Oscar contender in 2006.","user":"jdcorcor","rank":[123,129]},{"title":"I never thought I would cry","rating":10,"date":"5 February 2006","review":"It's a good thing I took my wife, because as all men know the only way not to cry is to look over at your wife/girlfriend and make fun of them for crying.<br><br>Seriously, I am a motorcycle aficionado but I truly think this movie transcends that. It's not a \"guy's film\" at all but a serious look at the life of a man that was average by his own reckoning - by ours he's a hero. When you find yourself looking at that and saying \"I would have quit\" and it was only the beginning of the movie, well, that's some tough stock Burt Munro came from.<br><br>And it's not tedious, not an uphill struggle all the way against insurmountable odds, none of those clichés. It's a great movie about a real guy and I can't imagine someone watching it and not being entertained, moved, and frankly, impressed.","user":"Lee_In_KC","rank":[140,149]},{"title":"A non-mushy feel-good movie","rating":10,"date":"25 January 2006","review":"Seeing the movie \"The World's Fastest Indian\" reminded me why I go see movies. I average about one every two weeks, and this was one of those rare movies that actually made me feel *happy* afterward.<br><br>The main character, New Zealander Bill Munroe as played by Anthony Hopkins, is a true man's man. He has spent his entire adult life tinkering with his streamlined motorcycle, a 1920 Indian (hence the title.) Now in his 60's in the year 1963, he wants to realize his life's dream of taking it halfway around the world to the Bonneville Salt Flats Test Track in Utah, the only place where he can find out how fast it will actually go.<br><br>The movie pulls off two often-used themes, The Long Journey and Overcoming Adversity, without a hint of phoniness or melodrama. The Long Journey from New Zealand to Utah takes up most of the movie, with Munroe scrounging up travel money, working off part of his passage on a dilapidated freighter, and the long, event-filled drive from the California coast to Utah in an old used car. Overcoming Adversity is portrayed in two ways: by Munroe's awesome mechanical genius as shown by his ability to fashion spare parts out of almost anything and to improvise a la MacGyver, and in his charm and likability when confronted with more human obstacles. Indeed, one of the movie's chief strengths was the character's ability to make friends easily under any situation, with a cast of colorful supporting characters who wonderfully complemented Hopkins' acting.<br><br>After finally reaching the test track, the movie's focus shifts from the acting to the cinematography and drama. The dozens of colorful cars, motorcycles, and drivers' outfits contrast strikingly with the blinding white of the salt flats and the mountainous backdrop. And when Munroe finally gets the chance to make his test run, two questions come to mind. How fast can he go? More importantly, will the 64-year-old man and the 43-year-old patched-up bike hold together under the strain?<br><br>After seeing the movie and while still in my euphoric state, my skeptical mind wondered how much of it was actually true. I did a little research, and the portrayal of this amazing man seems to be true enough. Go see this movie; if you do, you'll leave the theater feeling good, and perhaps even a little inspired.","user":"DaRitz","rank":[128,138]}]