[{"title":"Creative film with a lazy ending","rating":9,"date":"9 May 2010","review":"In the near future, a bat-borne plague has turned 99% of the human population into vampires. The remaining humans are hunted down and farmed for blood by a corporation headed by Charles Bromley (Sam Neill), an individual who views vampirism as a miracle since he was dying before the plague broke out. There aren't many humans left though, and when a vamp goes without blood, they turn into grotesque Nosferatu variants called subsiders. Bromley enlists his top hematologist (Ethan Hawke) to come up with a blood substitute, but an underground band of surviving humans has a different resolution in mind.<br><br>This film has a unique premise, and for the first hour or so, I thoroughly enjoyed exploring the world that Michael and Peter Spierig created. The opening scene shows one of the downsides of vampirism, as a girl takes her life rather than be stuck in a child's body for eternity. There were other fun touches thrown in too, like blood coming in wine bottles and being poured over ice. The film's storyline touches on themes of corporate greed taking precedent over the good of the public, and there is an underlying oil subtext that is less than subtle.<br><br>The second half turns into a clichéd mess. The ending in particular is really cheesy as a result. Truthfully, I would have been happy if the whole band of humans idea had been scrapped entirely. Surely they could've come up with something a little better. I mean, this is a pretty creative film. Other segments of the picture seem rushed, like the subplot involving Bromley's daughter. Speaking of Bromley, Sam Neill is one of my favorite actors, so it was great seeing him in a genre film again. His presence is the highlight of Daybreakers. I've never much cared for Hawke, and his performance here did nothing to change my mind. Willem Dafoe also pops up, and while I usually do like him, his character here is annoying.<br><br>As is, chalk it up as a movie that could've been more. Oh well, at least it's way better than the last work from the Spierigs, Undead. That was one of the rare films that I stopped watching halfway through. Quick note: I saw a father and two young teens leave shortly after an early scene involving a gory testing of the blood substitute. Guess they thought this would be another Twilight.","user":"Cujo108","rank":[34,37]},{"title":"Could have been a genre-defining one, but still good...","rating":7,"date":"7 January 2010","review":"Saw 'Daybreakers' at Piccadilly today. Been curious ever since i saw the trailers and being an Ethan Hawke fan decided to check it out anyway. The film started out on a bloody brilliant note. The scenes conveying the near-extinction of the human race and how the vampires are taking over and how the vampires themselves are threatened by the blood shortage issue was done rather effectively and the audience seemed to love it. There is a sense of foreboding throughout the film which can be expected in the genre, but nevertheless is very vital to it as most films fall short here. Daybreakers is not your typical cliché-ridden vampire horror. There has obviously been some sensible writing involved here. But towards the end the screenwriter tends to lose his grip and throws in some regular scenes just for the sake of cheap thrills and gore. This for me did take a bit away from the essence of the film especially considering the rest of the film was great,<br><br>But nevertheless I would recommend this film, as there is much to be enjoyed. The cinematography and colour combos and contrasts have been created masterfully. Even most of the cgi seems credible enough. Ethan Hawke is his usual intense self and Sam Neil re-surfaces into the mainstream with a Batman-sounding villain character. But its William Defoe as one of \"the folks with the cross-bows\" who gets the best lines in the film. Sample this- \" a human in a world of vampires is about as safe as barebacking a five dollar whore!\"<br><br>Could have been a great vampire flick, a genre defining one, but is reduced to merely a good one. But that isn't too bad considering the amount of vampire dung we were dished out for the entirety of 09. This one is the best of the lot! Cheers","user":"ijenuse-1","rank":[169,208]},{"title":"The pieces are better than the whole","rating":5,"date":"18 January 2010","review":"Plague has turned most of the population into vampires who have taken over the world and begun feasting on the remaining humans. The trouble is that the human population is running out and unless they can find a blood substitute they are going to starve. Ethan Hawke plays the chief vampire hematologist who harbors a soft spot for humans, and who stumbles upon a way of possibly saving everyone.<br><br>Directed and written by Michael Spierig and Peter Spierig who turned out the great looking but dramatically messy The Undead about a meteor that turns a small town into zombies, we're once more into the great looking but dramatically odd territory. Much of the film looks like a vampire film noir. It looks like a Sam Spade will come wandering in at any moment. The horror sequences are bloody and frightening, the action is often amazing. The problem here is the story. While its not all over the place like the directors' earlier film it does have plot holes and at times lurches from things to thing in a none too natural manner. I was frequently wanting to stop and ask questions about why and how since little seems clear unless you just take it all on faith. I couldn't do that because the film was asking me to believe too many impossible things. the result was I was loving the pieces but only kind of liking the whole.<br><br>I'd wait for home video.","user":"dbborroughs","rank":[24,27]}]