[{"title":"Lame and Messy Story","rating":3,"date":"3 November 2015","review":"In Egypt, Prof. Hayden Masterton (John Rhys-Davies) organizes an expedition to a pyramid to witness an event that takes place only once every 5000 years. But he needs to buy a key from a local dealer that will awaken aliens from outer space that are hidden inside the pyramid. However the treasure hunter Peter Levitz (Michael Higgs) kills the dealer with Masterton's walking stick and steals the key; then he blackmails Masterton to participate in the expedition. When the team breaks in the pyramid, they find deadly traps and only a few will survive and Masterton uses the blood of his own daughter to activate a system to awaken the aliens. Will Earth be doomed to an apocalypse?<br><br>\"Prisoners of the Sun\" is a movie of action, adventure and horror with a lame and messy unoriginal story. It is funny to see Prof. Hayden Masterton preparing an expedition where a key is necessary but he will only buy it in the last minute. The plot and unpleasant characters are near ridiculous but the acting is reasonable despite the histrionic John Rhys-Davies performing the lead role. The special effects are decent but the disappointing conclusion is awful and this film deserves the IMDb User Rating. My vote is three. <br><br>Title (Brazil): \"O Despertar dos Deuses\" (\"The Awakening of the Gods\")","user":"claudio_carvalho","rank":[9,10]},{"title":"Oh dear, poor all round.","rating":2,"date":"1 February 2014","review":"Decided to watch this on a bored Saturday thinking maybe it'll be a bit like The Mummy, how wrong I was. The editing was amateur, the characters were just unappealing &amp; the acting was either over the top or absent. The use of cheap CGI didn't do it any credit &amp; the \"Mummy\", well I've been more scared by my cats jumping on my bed while I'm sleeping.<br><br>The only appealing thing that got my attention was the \"historical\" storyline involving Egypt &amp; Osiris which should really have been expanded on &amp; possibly used to great effect. I've given the film 2 out of 10 because of this, but I would advise you to avoid watching as you really won't be missing anything.","user":"klminsure","rank":[22,30]},{"title":"Prisoners of the Sun","rating":4,"date":"2 February 2014","review":"I decided to watch this movie when I saw that John Rhys-Davies played in it. He is magnificent as always, the movie on the other hand not that much. To be fair is not that bad either, it could be worse. The whole Egyptian – Alien human race is tasteless and it is a story told too many times. Yeah I know what you'll think. The same thing stands for the mummies. But no it doesn't. Mummies are something classic, like zombies (sorry for that)! You can never have enough mummies, you always want more!<br><br>So the story goes like this: an excavation takes place to locate an ancient pyramid. An eerie storm will solve some problems and bad man will play their role! The problem with this movie is that the story is too long in the beginning, so they probably wanted to finish quickly and the story towards the end is told too fast. My biggest objection with this one is: WHERE ARE MY MUMMIES?????????????","user":"morrigan1982","rank":[9,12]}]