[{"title":"one dimensional all the way through","rating":4,"date":"5 February 2007","review":"I knew a lot about Edie Sedgwick before seeing the film and was even prepared for inaccuracies but the major problem with this film is that it is inaccurate not for the purpose of making a point but that it is inaccurate for the purpose of making a one-dimensional film.<br><br>Did Hickenlooper paint Edie as a perpetual victim (notice how throughout the film she is never injecting herself but is bent over while others inject her?) just so that he could show her as a victim of Andy Warhol and his drug fiend factory friends? Or that she was always a victim of people like her friend Chuck who did a complete turn on her for that villain Andy? Is Hickenlooper trying to say that the biggest mistake of Edie's life was not choosing Dylan over Warhol in that elevator scene where her future self voices over, \"that was the biggest mistake of my life\"? Edie Sedgwick came to the factory a sick person, she was already headed for a crash even before she set eyes on Andy Warhol. In reality, she was rejected by the factory friends and many others for the drugs she brought with her everywhere, she was not introduced to them at the factory as the movie shows.<br><br>Hickenlooper seems to me to be trying to say that Edie Sedgwick, that fresh faced wasp in knee socks and pearls who left Cambridge with sketches tucked under her arms could have potentially had a wonderful and peaceful life, even a stable marriage with Bob Dylan had she only not met Andy Warhol and been subject of those movies.<br><br>I have a problem with this film because I am so interested, most people are, in the real Edie Sedgwick and I agree with another poster who suggested you see Ciao!Manhattan to get a better sense of who she was. If you want a tragic love-story about a good girl who chose the wrong guy, watch Factory Girl.<br><br>The real Edie Sedgwick was a person whose hystrionics and drugs were symptoms of a soul that was always trying to fly away, for her the world was always too small and her pain was always too big, and she lived her life as though she dreamed of having her wings singed flying too close to the sun.","user":"maryamishani","rank":[152,186]},{"title":"An Interesting Mess","rating":5,"date":"1 September 2007","review":"Alright yea its a mess, but going in KNOWING it is a mess allowed me to view this film with more forgiveness than the average film critic was willing to shell out.<br><br>First off there's the acting which is all over the place, some people are doing great while others aren't allowed enough room. Casting Sienna Miller was a good call, its a difficult role to cast but if they felt they had to go with a \"name\" then Sienna was the right choice. As for Guy Pearce as Andy Warhol, that really worked and its a true shame that the film was such a mess you couldn't realize that Guy Pearce was turning in an excellent performance. Especially if you have seen his work in L.A. Confidential and Memento, I had to remind myself a few times oh yea thats Guy Pearce. Had Factory Girl functioned as a GOOD FILM Guy Pearce would have received much more acclaim.<br><br>As for Hayden Christensen, I like him alright as an actor but his role as the Bob Dylan-esquire Musician just wasn't allowed much room. He was crammed into a corner spouting out cliché lines and trying his best to do an impression rather than an interpretation. This film was around 90 minutes long, and it should have been around 2 hours long considering all of the significant characters. You can't just brush by Andy Warhol and Bob Dylan (even though they don't officially call the Bob Dylan character Bob Dylan).<br><br>What I did like about this movie was that Warhol was portrayed as a little bit cold and detached, but Sedgwick was portrayed as being equally messed up and responsible for her own downfall. So the blame wasn't placed anywhere. Having actors like Jimmy Fallon and one of the Olsen twins in this movie only made me go \"what are they doing here?\" Pearce and Miller really did give it there all, and even that wasn't enough to elevate this sometimes incoherent mess. Its a mess, but I was still interested thanks to the two leads. I can't wait until Sienna Miller is given a lead role in a GOOD movie.","user":"turner_cinema","rank":[24,28]},{"title":"Edie Through The Looking Glass","rating":8,"date":"7 August 2007","review":"(Possible spoilers, though unlikely)<br><br>Okay, let me say that I enjoyed Factory Girl for what it is and think it is worth renting.<br><br>The story stars Sienna Miller as the fated Edie Sedgwick and Guy Pearace as vapid pop culture icon, Andy Warhol.<br><br>The movie isn't nearly as close to as bad as critics claim it is. The first 40 minutes is much ado about talk of cocks, Andy and Edie's irreverence, and a series of disjointed images. The first act is aimless. But it makes sense because Edie and Andy are aimless and so are the termites chewing Andy's wood at \"The Factory\".<br><br>Enter Hayden Christensen as Billy Quinn and the movie develops its paper thin plot. Though, I should say it's unfair to characterize the story this way. Edie's life was a paper thin plot, so the director, Hickenlooper can't be blamed for that.<br><br>Andy, who never says he is gay, though everyone else assumes (or knows) he is, is in love with the idea of Edie \"The Superstar\" and Billy Quinn simply wants to open her eyes. She becomes the rope in a tug of war. Billy's \"soul\" cries for the world in a time of upheaval versus the-devil-may-care, drug den world of Andy. And while the latter may be in \"love\" with his muse, Billy cares and wants Edie to know, if art is the food of the soul, then Edie is eating from an empty soup can.<br><br>Edie is a sympathetic character. You get the sense that no one really knew her. Not because she was empty and vapid but that she was so shattered inside the only part of herself she allowed the world to see was the facade her Andy created. In Factory Girl we see Edie through the looking glass. Not as she was, but as she appeared. Warped.<br><br>Edie is the cute girl you meet in passing at a party at some stranger's house. You like her, but never see her again. Though, over the years you hear the occasional rumor or two, until one day, you hear she's hit rock bottom and died. That's how it feels to watch Edie Sedgewick's story in The Factory Girl. On one hand, you want to mourn her. On the other hand, you wonder, what has the world lost? That in itself is the real tragedy.","user":"I-Sense-A-Plot","rank":[41,52]}]