[{"title":"Experimental fimmakers successfully rearing their artistic head","rating":9,"date":"30 October 2006","review":"The slowly unravelling character and background of a CCTV operator form the plot of this gripping and unsettling, low-budget, yet very professionally made film. Jackie's job is to watch the feed from closed circuit cameras sited in the less desirable areas of Glasgow (including a street called Red Road), and liaising with the police where possible to help track or prevent crime. She's a dour Scots lass who gives little away, and we build up a picture of her life very efficiently in the first few varied and colourful short scenes - her working life, her social life, her sex life and (at the edge of it) her family life.<br><br>She starts to follow an ex-con who she recognises on the cameras, eventually ingratiating herself into his life. We are kept in the dark for a very long time as to her motives and simply feel an insidious, creeping tension as she takes risks. That we become so glued to what she is up to is a great credit to the skillful characterisation and acting. It's one of those films where, if you want to feel the full impact of the surprises, the less you know about the story the better. The title maybe also suggests a path of sexual tension and danger that the protagonist feels she has to follow. The final denouement brings a surprise emotional enlightenment. If you dislike independent film-making or are averse to explicit sex, avoid Red Road; otherwise make a bee-line to see one of the most original and capable films to come out of Scotland.<br><br>Delving into the world of CCTV also opens up other questions. Britain has a very high deployment of CCTV - according to one estimate, the average Briton is recorded by CCTV cameras 300 times a day (director Andrea Arnold says in an interview that twenty per cent of all the CCTV cameras in the world are in Britain) - and there are also concerns about privacy and abuse. The film doesn't argue for or against - it seems realistic - but in portraying 'a face that watches the footage' it allows us to picture what it is maybe like on the other side of the camera when we form our ideas about the social dilemmas.<br><br>Although Red Road has been roundly praised, it is not immediately clear why it is so successful. There is very little substantive action for a long time and little of the obvious attention grabbers such as violence or heavy romance. Although it seems to be directed on a very tight leash, part of the credit no doubt should also go to Lone Scherfig (characterisation is done in part by Scherfig as collaborator), and with whose background there is a discernible connection.<br><br>Danish Director Scherfig rose to fame with Italian for Beginners, one of the successful films to be made under the strict discipline of the austere Dogme95 rules. While Red Road uses little of the formal laws of the back-to-basics Dogme system, the lessons learnt are evident: a lack of intrusive background music, no superficial action or definable genre, and so on. The reliance is on the characters themselves, and in working in the development of the Red Road characters Scherfig's genius is shining through. We feel, just as we did in her Wilbur Wants to Kill Himself, that the people have just walked off the streets of Glasgow (or are still walking about on them). This style of realism is also discernible in the first British Dogme film, Gypo, released about the same time as Red Road, and together they form almost a new thread in British cinema. Whatever the reasons or antecedents, Red Road is a film of remarkable ingenuity aimed at an intelligent adult audience.<br><br>The background to the creation of Red Road is that it forms part of a project called Advance Party. Scherfig and her collaborator, in accordance with the experiment, presented the fully fledged characters to director Andrea Arnold who then wrote the plot around them. They have a life of their own instead of being altered to fit a storyline. The creative genius behind the idea, as with Dogme, is Lars von Trier. In the hands of Oscar-winning director Arnold, we again see art and new creative processes forcing their head through the much-abused medium of cinema.","user":"Chris_Docker","rank":[84,100]},{"title":"A lovely film that truly surprises","rating":9,"date":"16 June 2006","review":"I saw \"Red Road\" at Cannes, and it was my pick as best film almost to the end, beaten out only by \"Pan's Labyrinth\". The film keeps you off balance throughout because you are not told what to think of events; they simply unfold without explanation until the events themselves necessitate dialogue between the two main characters. Not knowing becomes rather vexing because you are always trying to figure out why the protagonist does so much that you feel is wrong, but it's all just part of the fun. And the kind of storytelling I enjoy most. It reminded me of \"Exotica\", another film I loved. Too, the faces of the actors are relatively unfamiliar which adds to the mystery, since they carry no \"baggage\" from previous films to the characters.<br><br>There doesn't seem to be a distributor connected to this movie yet, and we'd really lose out if it doesn't get to the U.S.","user":"luckyfay","rank":[63,79]},{"title":"Great Story","rating":8,"date":"28 October 2006","review":"Lead actors were very convincing and natural, I'm guessing a few of the small parts were played by non actors which i love and thought it added even more authenticity, the inner city settings and photography were gritty and real, an area which had obviously been excluded in so many ways and that grim reality was truly captured by the film. Story kept me guessing all the way through which i like, i did think i had the plot figured out at one point but i was way off the mark. Loved the general pace of the story and the fact that the script was so honest and uncompromising. I also enjoyed the more general theme of our living in a society in which we are being watched constantly without our knowledge and the privacy questions that generates. Highly recommended.","user":"mnicol-3","rank":[39,53]}]