[{"title":"Take it for what it is","rating":9,"date":"4 September 2007","review":"Wow. Shoot 'Em Up is exactly what it claims to be. An action movie. Balls to the wall, no holds barred, but nothing more. And that's exactly what you get. Don't go expecting high art...SEU doesn't take itself seriously enough for that. But that's exactly what makes it work. It KNOWS it's over the top, and doesn't try to hide it. Clive Owen's Smith character is the Bugs Bunny to Paul Giamatti's Hurtz Elmer Fudd. The film takes the best cartoon elements, makes them flesh, and still kicks in that over the top craziness. Bad puns that are so bad they're good, action sequences that there just for the sake of having an action sequence, and the wildest sex scene ever...it's amazing. It's the funniest, coolest, most amazing mix of stunts, bad one liners and paper think plot lines.<br><br>You get everything you expect from Shoot 'Em Up...and it's all great.","user":"Insane Ian","rank":[427,547]},{"title":"Garth Ennis Comics Fans Will LOVE This Movie","rating":10,"date":"11 August 2007","review":"In this deliriously over-the-top masterpiece of outrageously clever mayhem, star Clive Owen is an unstoppable good-guy gunman who is given to asking the question \"you know what I hate?\" immediately before letting all hell break loose.<br><br>You know what I hate? Dishonest, hypocritical reviewers like the one sitting two seats away from me at the \"Shoot 'Em Up\" screening I attended. Although he made amused grunts and other appreciative noises during the deliciously inventive stunts, laughed out loud at the jokes, gasped and groaned at all the right gasp-and-groan-worthy places, and generally appeared to be having a grand old time, he said afterward that he didn't like the movie.<br><br>What the hell is wrong with critics like that? Are they afraid the art-house crowd won't take them seriously if they express appreciation for a film in which a newborn's umbilical cord is cut with a gunshot, or a thug gets killed by having a carrot shoved in his mouth and out the back of his head? What, you mean Bergman or Antonioni never filmed a lactating hooker tearing out a ring from a Marilyn Manson lookalike's \"personal area\" to convince him to talk?<br><br>Ahem.<br><br>Although the posters for \"Shoot 'Em Up\" resemble Frank Miller comic-book drawings come to life, the actual movie has more in common with the work of another comic-book great: Garth Ennis, writer of such jaw-droppingly hyper-violent heroes as Marvel's the Punisher. (Although the awful 2004 \"Punisher\" movie included some supporting characters and plot points that originated with Ennis, it lacked anything resembling his very dark yet fiercely entertaining style. The guy definitely has a way of making vigilantes and their dangerous toys fascinating.)<br><br>Owen plays Mr. Smith -- and that's probably not his real name -- a guy who is simply waiting for a bus when he gets drawn into one of the wildest, most crazy-violent action opening scenes of all time. By the time the bullets stop flying, Smith is on the run with a complete stranger's targeted-for-death baby and one hell of a lot of questions.<br><br>Smith enlists a kinky \"got milk\" hooker (Monica Bellucci) to wet-nurse the infant. Despite some tough talk, she turns out to be more placidly sensual and maternal than kick-ass tomboy, which makes for a nice change in this kind of movie.<br><br>Meanwhile, a sadistically evil genius appropriately named Hertz (Paul Giamatti) dogs their trail with a never-ending army of hired killers and, yes, a couple of dogs. Giamatti scores as this badass with brains, who is shocked and hilariously furious about how Smith &amp; Company keep managing to survive. \"Do we suck this bad,\" he says at one point, \"or is this guy really that good?\"<br><br>Writer/director Michael Davis has loaded the film with one unforgettably imaginative image after another: spent shell casings bouncing off a pregnant woman's stomach, a gun dropping in an unflushed toilet, a hand with bullets between the fingers shoved into a fireplace as an improvised weapon. There are showdowns, standoffs, car chases, airborne gun battles and even a shootout in a firearms factory.<br><br>Best of all, the screenplay manages to both glorify in and yet subvert some of the things you'll be expecting. For example, it's a mega-body-count, blizzard-of-bullets barrage that's actually a plea for gun control at heart. Seriously. Also, although it has scenes referencing bits from movies as diverse as \"Lost Highway,\" \"The Transporter\" and even \"Raising Arizona\" (how's that for range?), it still feels fresh and original.<br><br>And there's one perfectly done little scene that's so poignant you may actually find yourself tearing up. Don't worry, though -- a hail of gunfire follows very shortly thereafter. Heck, a hail of gunfire follows shortly after EVERYTHING in this movie, usually including other hails of gunfire!<br><br>I can't wait to see what relative newcomer Michael Davis does for his next movie, but it will be hard for him to top this one. \"Shoot 'Em Up\" is a flat-out joy to watch. When it was over, the first thing I said was, \"I want to see this movie again RIGHT NOW!\" It's that good!","user":"backrowreviews","rank":[153,201]},{"title":"Thin on plot, thick on action","rating":10,"date":"27 July 2007","review":"I rated this movie a 10 in the context of other action movies; it's nowhere near a 10 when compared to classics like Casablanca, but in it's genre, it accomplishes exactly what it sets out to do.<br><br>Clive Owen stars as \"Smith\" a guy with a past (that's slowly revealed during the crazy gun fights) who shows up as a knight in shining armor to a lady who is about to pop a baby and is being chased by baddies, headed up by Paul Giamatti. After he rescues the kid, he links back up with an old flame, DQ, played by Monica Bellucci. The movie starts out with a bang, quite literally and doesn't settle down the entire time. There's a plot somewhere in the movie, but if you think too hard, it'll disappear in a puff of logic.<br><br>That being said, the gunfights and car chases are stellar. They are lots of fun, with ridiculous things going on the entire time. Just suspend your reason &amp; logic, strap into your theater seat and enjoy the ride.<br><br>Michael Davis spoke before the preview and said he was an action movie buff since the beginning and made the movie he wanted to make. As an action movie fan, I thank him!","user":"Duellist","rank":[406,570]}]