[{"title":"GREAT action movie","rating":8,"date":"14 June 2005","review":"People people people...anyone expecting Citizen Kane out of this movie needs to have their head examined. BUT...if you were looking for a thrilling, fast paced roller-coaster, that's what you will find.<br><br>For the past year, I have been seeking out alternatives to American cinema because it has become so formulaic and awful. I troll IMDb and eBay to see what else is happening in the world. Sure, B13 is derivative, but it is certainly more exciting than another \"re-imagining\" of a 70s cop show.<br><br>The opening sequence took my breath away. I was half-way through the film before I felt it was sage to dart to the kitchen for a drink. I said to my wife \"THIS is the movie I've been searching for.\" Even the subtitles were good. The verbiage and spelling were very authentic and slang-conversational. It did not feel forced as many foreign films do. It was definitely subbed with the British market in mind, as some of the banter evoked thoughts of Lock, Stock or Layer Cake or Football Factory.<br><br>If I want a truly compelling story, I'll look elsewhere, but check out B13 for the some great fight scenes, excellent scenery and mind-blowing athleticism.","user":"baldmatt2001","rank":[198,236]},{"title":"The Perfect Action Movie","rating":9,"date":"12 June 2006","review":"This film takes everything that has been learned in the last 100 years about how to make an action movie and distills it into a perfect 85 minutes.<br><br>The stars are true athletes, including David Belle, the co-founder of the sport of Parkour. He has spent 18 years perfecting his skills, which means that most of the spectacular stunts are real, not done with special effects.<br><br>The plot is action-movie perfect as well: A criminal kingpin, a damsel in distress, an honest cop, a noble criminal, corrupt officials, double crosses, nearly superhuman enemies. And at stake: honor, truth and the lives of millions.<br><br>There are hardly any extraneous elements, few scenes that don't make sense, no characters that do something really stupid when they should have known better. Every loose end is wrapped up in a very satisfying way. And there's even meaningful social commentary. All (though I said it before) in 85 minutes.<br><br>Why do other action movies drag on for two or even three hours and have long slow spots? Why do other action movies have plot holes big enough to walk through? Why do some of them lack drama, get silly and end up feeling like a waste of time? Why can't they all be as taut and tightly written as this one? <br><br>Because it's hard. It's hard to reach this level of perfection. It's hard to make a movie in which every scene counts. It's hard to get the plot, the acting, the action and the emotions right.<br><br>It's so hard it took 100 years. But here it is. Don't miss it.","user":"lyre","rank":[134,164]},{"title":"Pure Adrenaline  One of the Best Action Movies I Have Recently Seen","rating":8,"date":"17 November 2006","review":"In 2010, the dangerous districts in the periphery of Paris are surrounded by walls, and the dwellers do not have school, hospital and even police in the area, which are ruled by drug lords. In the 13th District, Leito (David Belle) is a honest man that lives in a clean building and does not permit drug dealers nearby his neighborhood. When he destroys one million Euros in heroin of Taha Bemamud (Larbi Naceri), the criminal abducts Leito's sister Lola (Dany Veríssimo) and the corrupt police arrests Leito. Six months later, the tough and honest Capt. Damien Tomaso (Cyril Raffaelli) is assigned to find and deactivate a stolen bomb that might destroy the 13th District and the two million dwellers. Together with Leito, they have to face the gang of Taha and disclose a despicable secret behind the robbery of the bomb.<br><br>The unknown \"Banlieue 13\" was one of the best surprises I have had this year. It is pure adrenaline and certainly one of the best action movies I have recently seen. The greatest attractions are the performances of David Belle and Cyril Raffaelli. I have just read in IMDb that David Belle is co-inventor of the sport known as Parkour, \"which consists of moving freely in a natural area, including climbing on buildings and taking on whatever is in the way\". Cyril Raffaelli is also stunt coordinator and stunt. Together, they are awesome, with amazing choreography that recalls Jackie Chan when he was young, and certainly are among the best I have ever seen in the cinema. The direction and the story are also good, hooking the attention until the very last scene. Just as a curiosity, in the beginning of the movie, the guys are watching a Brazilian soap-opera with Regina Duarte and Antônio Fagundes. My vote is eight.<br><br>Title (Brazil): \"B13 - 13o Distrito\" (\"B13 - 13th District\")","user":"claudio_carvalho","rank":[54,63]}]