[{"title":"Better than I thought","rating":5,"date":"5 November 2006","review":"I just got back from seeing this movie and I have to say it was pretty good. I didn't go to the theater with high hopes, however, so it was easy to meet my expectations. We loved the other 2 movies and had to finish the trilogy! This one could be titled Santa gets a midlife crisis--the plot is based on Scott's frustration over having so many responsibilities and not enough time with his family. There are some disappointments; of course, Bernard isn't in it and we all love him; just one line with no explanation tells us he must be gone. Also, Santa doesn't seem himself; yes, he's frustrated, but you don't see the excitement he had before. And,the plot gets resolved so close to the ending that you still haven't processed it, and the credits are rolling! But if you liked the other movies, go see this one; it's not as action packed, it's a little sappy, but it's clean fun and you'll laugh if you let yourself! <br><br>Just remember that it's not Shakespeare, it's just a Christmas movie. Go and have some fun! Enjoy the Canada subplot, eh?","user":"flafan3","rank":[47,59]},{"title":"\"Santa Clause 3: The Escape Clause\" is candy in every dimension of the word","rating":7,"date":"6 November 2006","review":"I suspect the movie-going public generally loathes taking chances on upcoming movies. They want reliable, reassuring entertainment, preferably with an upbeat, if unrealistic, ending. Last Sunday, I suppose my parents and I had that hankering for that \"cinematic comfort food\" when we saw Tim Allen play the jovial, corpulent one for the third time. Overall, the movie fed us well, even if the food consisted of eye candy, ear candy, and tear candy.<br><br>The plot basically consists of Santa Allen juggling his expecting wife, her bemused parents (Ann-Margaret and Alan Arkin) who complain of insufficient family time, and the machinations of the devious original Cold Miser himself, Jack Frost (Martin Short). It's no surprise that Santa successfully keeps all the balls in the air, although it's also no surprise that he also almost loses his world because of Jack.<br><br>\"Santa Clause 3\" is cute, sweet, innocuous fun, with occasional flashes of jaded Christmas cynicism from Short and, to a lesser extent, from Arkin. For example, Short's conversion of the North Pole to a Vegas-like production had bite, even if it was a bit hackneyed. When Arkin pouts after Santa's (Scott Calvin's) daughter by his ex-wife and Judge Reinhold's psychiatrist character (whew!)defeats Jack with a literally warm hug, the audience guffawed. Another scene, where Scott is tricked into giving up Santahood by Frost and becomes corporate Scott Calvin again reminded me a little of Bill Murray's character in \"Scrooged\". However, the movie is ultimately geared to the little ones, on whom it seemed to work, because the theater I saw it in was full of very young children, and they kept quiet and still!<br><br>The movie gets the majority of its laughs from the emoting Short, the skeptical Arkin, and the sight gags like the yawning \"Santa Fireplace\". Allen wisely defers to them in the humor department, although he cuts loose in the hilarious outtakes at the movie's end. (\"Mother Nature, can you thaw him out? Uhh, oops!\")<br><br>If you are willing to leave your logical cynicism at the front door and bathe in the usual Christmas treacle, go see this movie. It will put you in both the shameless sentimental AND shameless commercial Christmas spirit.","user":"japamo","rank":[15,18]},{"title":"Just what we expected","rating":6,"date":"4 November 2006","review":"Took the kids to see this and they loved it. I didn't have high expectations but was entertained and got the predictable feel good, happy ending. I agree with others that it was a couple notches better than the second movie. All and all, a good way to kick off the holiday movie season.<br><br>Other notes of interest: The actress playing Mrs. Clause is on the T.V. show Lost now. That took a little getting used to. Martin Short did a nice job as Jack Frost. The blooper reel at the end of the movie is pretty lame. Not funny at all. Plus, when the bloopers are literally shown 3 seconds after the end of the movie, it takes away from the movie itself. The kids are still smiling and in a magical place then \"poof\", magic is over here are the actors messing up their lines. It's like seeing Peter Pan on stage and right after the show, they show you all the wires that were used to make him fly. Save the bloopers for the DVD.","user":"tttbone1","rank":[33,46]}]