[{"title":"The First Avenger","rating":7,"date":"22 February 2020","review":"It wasn't that bad of a movie, but undoubtedly it had a few flaws in terms of screenplay. The story itself was fine, and I'm personally a big fan of Captain America's origin story so this movie was a nice watch for me. Maybe not so much if you don't care at all about superheroes such as CA.","user":"MR_Heraclius","rank":[40,41]},{"title":"A review and a review of reviews.","rating":10,"date":"20 April 2012","review":"I loved this movie. Captain America has had 3 movies in the past, not counting some 1940s ones which can be excused for being good, that were so awful they make movies like Steel or Green Lantern look good. However, I saw a lot of critiques for this movie that were negative. Now I understand differing opinions and all, but they all followed a formula and each one seemed like griping to the point it was just getting stupid. If you'll indulge me here, I have a list of the repeated ones and a rebuttal to each.<br><br>1. The technology for WWII is too far advanced! This one was the most common and the stupidest in my opinion. It's called \"Fiction\", as in \"not real\". Every time I heard this one it made me think these people have no suspension of disbelief and would complain that Iron Man is a terrible movie because the technology to build a flying robot suit doesn't exist yet. People, it's comic books and it's in a fictional WWII setting. It's allowed to take liberties.<br><br>2. Captain America is too invincible! That was just stupid. Captain America is relatively weak compared to many other superheroes, he's just a perfect example of a human being brought about by the experiments in the film. Also, he's the main character. He's not supposed to die in a movie that is leading him up to be in a tie-in to all the other recent Marvel films that will lead to The Avengers.<br><br>3. Red Skull is a terrible villain.<br><br>There is no sense to this one. He's supposed to be the guy that's worse than Hitler and can get just as many people on his side to do his bidding. On top of that he can take Cap in a fight fairly evenly. Saying he's a bad villain is baseless.<br><br>4. Steve doesn't go through a character arc/get any back-story.<br><br>For one, he really doesn't need to. Steve was a good guy from the start, and he did go through an arc. It was subtle, but he did. He gained more confidence and become the soldier he is. He has a back-story but it's weaved in throughout. We know he was bullied a lot, we know he he is from a military family, we know he grew up with Bucky, we know he has had very few, if any, dates in his life, he's a childhood friend of Bucky, and we know he wants to be a soldier because he feels its his duty. I'd rather get it weaved in through the narrative of the story rather than get a huge text dump or just have characters talking for half an hour about everything they've ever done.<br><br>5. This movie just glorifies America! Not really. It's a good vs. evil story that happens to have a character named Captain America, which was given to him by a publicity stunt. I suppose you also hate movies like Saving Private Ryan because it tells things from the perspective of American soldiers but not the Japanese ones? <br><br>These were the most common arguments and they are easily refutable. Captain America is a great movie, showcasing one of the best Marvel has to offer and should be in the 7s or higher, not the 6s.","user":"Baker-63","rank":[69,88]},{"title":"A Super-hero Rightly Interpreted for the Big Screen","rating":4,"date":"4 August 2011","review":"Like many comic-book fans I was expecting the worst from this movie. This is not because the character has any less depth than other super-heroes, but I knew that it would be extremely difficult to transition Steve Rogers to film in a serviceable way. The guy is called \"Captain America\" for heaven's sake.<br><br>Any comic-book reader would probably appreciate the ironies and idiosyncrasies behind such ostentatiously patriotic code-name, mostly because in print Cap has challenged the assumptions behind his symbolism, becoming a more conflicted and universal figure.<br><br>But its hard to translate any of this idiosyncrasy successfully in 2 hours. Fortunately the film, instead of getting to political, is more old-fashioned pulp like Indy or \"Sky Captain,\" which thankfully never takes itself too seriously (which was one of the flaws of \"Thor\").<br><br>I had my doubts that Chris Evans could pull off the modesty and heart needed for the role, but I was wrong. As the Red Skull, Hugo Weaving was wonderfully evil in a nostalgic, serial-villain kind of way. Haley Atwell is a sidekick/love-interest with the rare quality of not being incredibly annoying, and Tommy Lee Jones is perfectly cast as Tommy Lee Jones.<br><br>The reason I found this to be a good movie was because I enjoyed it, plain and simple. It's well-photographed and well-acted. Like its titular hero, it modestly embraced its silliness, creating a charming B-movie experience.","user":"webspinner128","rank":[153,206]}]