[{"title":"The Best movie about Killer Piranhas ever made.","rating":7,"date":"20 August 2010","review":"I thought this movie was going to be just AWFUL. However I was mistaken, it was actually pretty good. The acting, as I would've expected was mediocre, but no one in the cast was destined to shine in this film. I also had a good time watching the film, I was really happy how the Piranhas looked. Don't go in expecting a masterpiece like Citizen Kane or Schindler's List, cause you'll definitely be disappointed, but with a movie title like this, who would? Just go in expecting some laughter and have some fun with it. Also there's a lot of nudity and gore, so I don't advice parents to take your kids in theater to watch this film. Piranha 3-D lived up to its title, featuring Killer Piranhas with 3-D. It isn't in any way perfect, but then again, it doesn't need to be.<br><br>7/10","user":"Loving_Silence","rank":[220,331]},{"title":"Aja delivers all the blood, camp and boobs you could ever ask for","rating":7,"date":"21 August 2010","review":"Films rarely deliver on the promises of their trailers. Even their synopses can indicate a promise of something the final film has a problem making truly happen. Some movies come close, others fail miserably, and others deliver a different experience entirely. Piranha 3D is the rare film the delivers exactly what the trailers, synopses and every ounce of marketing promises – buckets of blood, campy humour and boobs – lots and lots of boobs.<br><br>The plot, or what little semblance there is, revolves around the small town of Lake Victoria, which explodes with activity every Spring Break. An earthquake tremor shatters the lake's floor, and lets loose hundreds of prehistoric piranha. And as the trailer suggests, not even local Sheriff Julie Forester (Elisabeth Shue) can stop the mayhem in store for the unlucky college students and residents who venture into the water.<br><br>Despite a rather threadbare plot, Piranha 3D survives on an alternating scale of maniacal destruction and sheer glee. It is clear from the opening moments of the film that Alexandre Aja is having loads of fun creating this throwback monster movie. And in a year where just about everything seems like a nostalgic reference to films from other decades (specifically the 1980s), Piranha 3D fits right in. It makes no argument about the type of film it is at any point. It knows it is not going to be the next Schindler's List, and it knows it has no chance of even remotely being a \"good movie\". What it strives for, especially if you are the right audience for it, is to be the funnest film of the summer. After all, this is a movie that makes a joke about a severed CGI penis.<br><br>The film is fun for the sheer fact that Aja does not seem to care about the line between good and bad taste. The aforementioned severed penis aside, there are quite literally hundreds of people who are murdered by these prehistoric killers by the time the film reaches its credits. And Aja just seems to revel in the destruction he creates at every turn. I lost count of how many people perished in one grisly attack near the beach that makes Jaws look about as menacing as Bambi. And somehow, the attacks even vary at how successful they are, and just what gets attacked. Various body parts are ripped out and eaten in detail, and many people end up more mangled than the trailers suggest. Aja has a go-for-broke style that we rarely get a chance to see in modern horror, and pushes the limits of what he can show at any given moment. I have heard there were cuts made to the film, but as it is, I cannot even fathom what could have possibly been chopped out in comparison to what they left in.<br><br>But the buckets of blood are only the beginning. This is also a film that revels in having bare breasts appear almost every five minutes. Hell, there is an entire five minute underwater ballet-like scene that borders on soft porn. But again, it does not seem like Aja cares. He just wants to revel in how much he can possibly get away with, full frontal nudity and all. It almost feels exploitative at times with just how much these female actresses show off, specifically Kelly Brook and Riley Steele (who is just one of a handful of porn stars who appear in the film). Aja knows his audience, knows his genre, and knows the films that inspired it. It almost comes off like he wanted to ensure he had enough bare breasts so he knew he did not do a disservice to all of those expecting gratuitous amounts of nudity.<br><br>The film's ultimate success comes from its humour though. With just how ridiculous the film quickly becomes, it never loses sight of its tone and lack of seriousness. It may get extraordinarily gruesome, but it is never serious or horrific enough that you will have trouble laughing at what is going on. The campy one-liners are all very effective, as is the film's nostalgic sensibilities. Even better are the cast members who provide them: Christopher Lloyd as an aquarium owner two steps short of Doc Brown; Jerry O'Connell as a coked out porn producer; Ving Rhames as a bad ass deputy; Eli Roth as the host of a wet t-shirt contest. Everyone brings their A-game, and maintain their deadpan humour throughout. They all look to be having just as much of a blast as Aja is.<br><br>But there are issues with the film. For one, some of the special effects are lacking. The explicit shots showing the piranha destroying their victims all seem to look awful, as do the piranhas themselves (3D effects do nothing but make them look even worse). The makeup effects are working at full throttle in every single case, but the effects of how these people are being ripped limb from limb seems to have not been too much of a concern for anyone. I realize the campy style of the film, but its style does not excuse its shoddy special effects. The character development is also a little stilted, much like the performance of main star Steven R. McQueen. Had Aja sacrificed the thirty to forty minutes of \"development\" and just added more mayhem, this would not be nearly as much of an issue. But looking at the movie and its style, I doubt Aja was going for perfection here.<br><br>Granted you are the audience for buckets of blood and gratuitous amounts of nudity, Piranha 3D delivers on all counts. It has some problems and is far from a great movie, but its campy and nostalgic style more than forgives any issue. The film exists solely to be gleefully destructive. And as long as you realize that going in, you will not be disappointed.<br><br>7.5/10.<br><br>(This review also appeared on http://www.geekspeakmagazine.com).","user":"DonFishies","rank":[107,175]},{"title":"Boobs, Blood & Doc Brown.","rating":7,"date":"21 August 2010","review":"An underwater tremor unleashes thousands of hungry Piranha that have thought to have been extinct for millions of years. Bad timing, because it's Spring Break. <br><br>Piranha was, what some people called, a rip off of Jaws. Another person wanting a piece of the pie. It went on to have a sequel, to be directed by the now famous James Cameron and it seems that it is time for a remake, in 3D no less. Do we need a remake? Probably not, but the film is fun and excessively violent, which makes for a good time for those looking for b- movie horror goodness. Piranha delivers on the levels it aims for, take that as you want to.<br><br>Alexandre Aja directs this film, let's just forget he did Mirrors okay? He gets the bloody mess off to an interesting start by having Richard Dreyfuss in the film. A nod to Jaws no doubt, but one can only assume that he had him in here to say that this film is either a: More scarier or B: More dangerous. I'd go with the latter because the film isn't scary. What's more dangerous though? One shark, or thousands of Piranhas? You pick.<br><br>So it's Spring Break, so the fish have hundreds of young drunk teenagers to eat, and boy do they eat. The film doesn't shy away from the bloody truth. Piranha's can strip a cow to it's bones in minutes, these guys are more aggressive. They've been feeding off each other for millions of years and now they have a variety of meat to pick from. Yummy. So people die in bloody, over the top, funny ways. The film is one for the people who cheer when someone has their legs torn off. If that's not you, you might want to stay away from this one. <br><br>Also, if you're not a fan of naked women, you might want to stay away from this one. This film is full of naked women, left right and centre. There is even an underwater naked swimming dance sequence set to opera music. It's weird and funny at the same time because it comes out of nowhere. <br><br>The film could have used more of it's cast. We have Richard Dreyfuss, Ving Rhames, Christopher Lloyd and Eli Roth. All of them are underused. Rhames, I thought was going to have a more hero type role, he doesn't. Roth has a total of maybe two scenes as does Lloyd. Dreyfuss only shows up at the beginning of the film. Once again, an interesting cast that is not put to good use. The film decides to stick with the blood and boobs. <br><br>The film is in 3D. I expected to have more fun with it than I did. Although I did enjoy it more than other 3D films I've seen. It has a more gimmicky feel to it and it actually fits with the film. Seeing bits of Piranha fly up at you is fun. Boobs in 3D, fish in 3D but the things that were used the most were the underwater coral reefs. <br><br>The theatre lost power near the end, so the last 3 or so minutes of the film we saw with no sound, but I could tell what was going to happen, even with the lack of audio. I'm not letting that affect my review for the film, but I can sense that the film was going to go for one of those jump-scare-abrupt endings. <br><br>Piranha 3D is a hoot, for those who know what they are getting into. In my theatre there were children, this is NOT A KIDS MOVIE!!!! This is more bloody and violent than any SAW film. Piranha is full of cheesy moments, and it works.","user":"Matt_Layden","rank":[70,112]}]