[{"title":"Beautiful and Brilliant.","rating":10,"date":"28 April 2007","review":"I walked into this movie expecting something completely different than what I got. While most people are using this as an excuse to hate this movie, It made me like it even more. The acting was excellent. Justin Chatwin and Margarita Levieva are incredibly believable and both seem to really enjoy the material. I can understand why some people would be mad. Most people were expecting the teenage horror flick. I am so glad it wasn't. There was so much depth and beauty to it. In my opinion if you didn't' like it either you didn't understand it or you are a horror obsessed teen. The soundtrack also was amazing. I loved everything about this movie. The promotion(meaning Trailers) could have been done a lot more differently and better. Still i strongly encourage this movie to those of you who love deep, thought provoking, beautiful, and emotional movies!","user":"fenwayconnor","rank":[257,387]},{"title":"Really Great","rating":9,"date":"3 May 2007","review":"Despite all the bad reviews on here, I went to see \"The Invisible\" and I was not disappointed. I really loved the underlying drama and self discovery the movie relayed throughout the story. It made you feel for both the victim and the villain and feel their pain and sacrifices. It went past the usual story line of romance and macho heros, but looked deeper. And above that, my friends and I loved the main character :) He is very good looking. Apparently the other reviewers don't have the ability to see past explosions and fake fights in films to see the depth portrayed in this movie. Definitely give this one a try. It made my day and made me think very hard about life. Not to sound too cheesy...","user":"Juicygirl789","rank":[175,291]},{"title":"nice","rating":7,"date":"25 December 2006","review":"This is a remake of the Swedish movie 'Den Onsynlige' and there is no doubt that its worth your time. One of the best movies I have ever witnessed. There is little to no fear elements in the movie, but it's such a beautiful story about a ghost that it can't be ignored.<br><br>If you think you can figure this movie out by the synopsis above, think again- 'The Invisible' is a epic story about life, death and the choices you make during your time on this Earth. For such a bright film, it's quite Gothic in a sense of the irony the story evokes. In the end, what really matters is making your life worth something and taking control of it on your own- the lesson is a great one, and hopefully this movie will entertain along with inspire. Check it out if you can.","user":"reenis","rank":[184,317]}]