[{"title":"Very good... for the first 3 quarters.","rating":8,"date":"7 January 2007","review":"I wasn't expecting anything too good but i was pleasantly surprised. This is fast paced, seems fairly believable and was genuinely creepy in places. The acting was pretty good too and you really felt for the characters. There were some nice twists and the film moved along at a nice pace.<br><br>I would have absolutely loved this if only it had a better/different ending. To me it just didn't make any real sense for the last few minutes and what sense i could make of it left too many loose ends and unanswered questions.<br><br>Still it deserves 8 of out 10 for being a superb film for the most part.","user":"skyelmaidstone","rank":[70,90]},{"title":"Fairly good movie, but not great","rating":6,"date":"31 March 2007","review":"There are a lot of great things to be said about this movie, but that it deserves a 10 is definitely not one of them. Although the movie was paced well there are many holes in the storyline and in the plot also.<br><br>Nathan Fillion and Katie Sackhoff do very good jobs with their characters. As for caring about the characters you really don't get to know them that well aside from Abe.<br><br>The end of this movie well lets just say it borders on the cheesy and it left me thinking \"what the\".<br><br>There are many places that you will think \"why did you do that\" and \"that was just mental\" because it is in these areas that common sense should prevail, however that is not the case, and can be very frustrating. The movie at times is a little cliché, using cheap tricks to get cheap chills.<br><br>I felt i had to comment on this movie because of its 10 star rating when it is far from.<br><br>Watch this movie for sure however don't go into it as did expecting the best horror flick of the year and only getting an above average movie.","user":"khunia","rank":[26,31]},{"title":"Better-Than-Average Supernatural Thriller","rating":6,"date":"4 June 2007","review":"The main reason to see \"White Noise 2: The Light\" is for Nathan Fillion's quietly powerful performance as Abe Dale, a man whose family is killed and who is himself brought back from the dead. The screenwriter Matt Venne is focused mostly on exposition and in some scenes you can practically see the storyboarding (\"Abe looks down. Sees himself in the shattered mirror fragments\") but despite this Mr. Fillion finds ways to inject nuance and emotion into wooden and often under-written scenes. The story is most intriguing in the first half of the movie, but less so when it shifts from Abe's personal experience to a broader canvas in order to explain what the heck is going on; still, there are some nice goose-bump moments and the last ten minutes are definitely provocative and hair-raising. If you like supernatural stories and want to see Nathan Fillion show he can play a troubled, normal, non-heroic guy, you should enjoy this one.","user":"sounds-5","rank":[12,13]}]