[{"title":"It's good movie to watch","rating":8,"date":"23 February 2020","review":"Surprisingly good funny action. Selma, girl, cute, was a nice touch. The action is all good, good efffects and a story that held together. It's a bit strange and creepy at times but all in good fun. Many good ideas.","user":"MR_Heraclius","rank":[36,37]},{"title":"Very good","rating":11,"date":"11 July 2008","review":"You know you're not watching a formulaic comic book film when one of the highlights is a drunken rendition of \"Can't Smile Without You\" by Hellboy and Abe Sapien. \"Hellboy II: The Golden Army\" is a more confident, assured outing than the first film and while it does not draw from Mignola's comics for its plot it is perhaps better off for it, lacking the usual burden of comparison and expectations. \"The Golden Army\" is more fantastical than the first film and is less sci-fi oriented but this is the sort of thing Del Toro does exceptionally well as a writer. He never lets the fantasy become the focus of the film, instead concentrating on characters and delivering action scenes that can only be described as, forgive the crass immaturity, kickass.<br><br>As entertaining as many comic book-to-film adaptations are it is a rare event when one can call one of these films a true artistic achievement. I am convinced without a shadow of a doubt that Guillermo Del Toro's entire career has been leading up to this film, particularly regarding his work as screenwriter here. The comedy feels less forced and is worked incredibly well into the script here, so much so that it doesn't feel remotely unnatural when the scene of comic drunken singing leads directly without a break into one of the film's most intensely dramatic sequences. Del Toro's handling of character has never been better, not even with \"The Devil's Backbone\", which is still my favorite of his films, and his sheer skill and ability when it comes to telling a fairytale-esquire fantasy is astonishing, as proved in the prologue to this film. In short this is Del Toro at the top of his game and providing artistry the likes of which we rarely if ever see in summer blockbusters. It's only fair that an astonishingly brilliant comic like \"Hellboy\" by an astonishingly brilliant artist like Mike Mignola is adapted this well and by someone as talented at what they do as he is.<br><br>How refreshing it is, a week after the release of \"Hancock\", which to me epitomizes everything wrong with action film-making today, that we get \"The Golden Army\" which features hands down some of the finest action scenes we have ever seen in this sort of film. Just stunningly beautiful, well-shot, well-crafted, the sort of thing that leaves one wondering how much time and effort went into it and endlessly thankful that some really talented people went to the trouble of making the film. <br><br>The film is generally just superb on a technical level. Why am I even saying this? Of course it is. Danny Elfman composing, Guillermo Navarro serving as cinematographer, top-notch editors, fantastic special effects wizards. It's a world-class crew that made this film. I shouldn't be surprised at its quality but \"The Golden Army\" really just floored and astonished me with how good it is. The cast is also excellent, proving once again that you don't need 'big names' to carry a movie. Just about everyone here is excellent, particularly Perlman with another excellent turn as Hellboy and the underrated Selma Blair as Liz Sherman. <br><br>\"Hellboy II: The Golden Army\" provides essentially everything a Del Toro or Mignola fan would want. I imagine it will entertain and charm many outside those circles as well with its fantastic action sequences, engaging characters, and wonderful sense of humor. I would personally go as far as calling \"Hellboy II: The Golden Army\" one of the top five or so comic book movies ever made.","user":"ametaphysicalshark","rank":[189,267]},{"title":"Can't Smile Without You","rating":11,"date":"11 July 2008","review":"okay, I'll start out simple. This movie is not Gone With the Wind. It isn't Ben Hur, not even Pan's Labyrinth. it is no fantastic achievement in film that will go down in the history books. But really, it's Hellboy - does it really need to be a classic? Honestly, I loved this movie. It was pure fun. I found the first Hellboy movie to be a fun movie. . .but it lacked that certain something that was keeping it from being a great movie. This one introduces all new mythology into the series, which allows director Guillermo Del Toro to invent all sorts of new creatures that all look amazing. The visual aspect of this film is classic, nothing short of amazing. The movie has some flaws, a few strange possible plot holes, but by the end of the day, the humor rules the day, and the humor hit spot on, to make a very funny film. I can't get the song \"I can't Smile Without You\" now after seeing this film. That segment was hilarious. Hellboy succeeds in being a film with a decent story, good visual work, and great characters with great humor, all to make just an overall FUN movie where Indiana Jones couldn't. (I only mean Kingdom of the Crystal Skull) For someone who believes any film that doesn't win 11 Oscars isn't worth watching, I'll be honest, you'll hate Hellboy 2. For someone who goes in expecting only to be entertained, just to have a fun time, I 100% recommend this film to that kind of person. Go see it, it's very worth it.","user":"FosterBreadford","rank":[140,198]}]