[{"title":"Its no American Beauty or Sideways in terms of the middle-aged crisis theme. Then again, that is a good thing....","rating":8,"date":"2 March 2007","review":"To compare Wild Hogs to comedic greats and classic movies about mid-life crisis would be absolutely foolish. Sitting back and enjoying the wild ride is your best choice in getting the full enjoyment out of this flick. Containing a diverse cast that works quite well, a handful of funny cameos, tons of predictable yet enjoyable scenarios, and a rather surprising amount of physical humor; Wild Hogs is a startlingly delightful comedy that isn't afraid to reach low for a laugh. Coming off as more than just a guilty pleasure, we have good acting running the show, as our longtime cinema veterans mesh together and bring out their best comedic skills to deliver a nice trip through the United States.<br><br>Wild Hogs follows four middle-aged men losing excitement (among other things) in their daily aspects of life. Doug (Tim Allen) isn't the fun guy he used to be, Bobby (Martin Lawrence) is not able to run his own home, Woody (John Travolta) has lost pretty much everything, and Dudley (William H. Macy) has nothing to begin with. The four of them decide to take their boring lives out for a spin, and try to relive the glory days of college-- ride off in their motorbikes across the country. The main conflict is whether or not they can unleash the Wild Hogs in them and be able to reach California in one piece. The other problem arises when the well-known tough biker gang Del Fuegos crosses paths with them.<br><br>The premise is something we've all seen before, yet it can still be done well with the right group of people. Mixing John Travolta, Martin Lawrence, Tim Allen, and William H. Macy is something that truly would not, and could not have been predicted by anybody. Nonetheless, this unique quartet does a fantastic job. Not one actor is overused or overacting, and we see each of the actors' talents brought to life. Tim Allen puts his physical humor to the test and succeeds. John Travolta brings his comedic chops and also is shockingly hilarious. Martin Lawrence has his good movies (Nothing to Lose) and his really bad movies (Black Night, Big Momma's House 2) but in here, he doesn't go too far, doesn't attempt too hard, and holds his own as the uncertain Bobby. Topping them all is William H. Macy, whose physical comedy tops all the others in this movie. Rounding out the cast is an assortment of cameos and short roles that despite being good were quite underused (Marisa Tomei, Stephen Tobolowsky, Ray Liotta, John C. McGinley, Peter Fonda).<br><br>The laughs in here are present pretty much throughout the film, and it ranges from funny little one-liners, to physical comedy, to lowbrow comedy, to even a bit of absurdity. A bit of it is predictable, yet some of it comes flying out of nowhere (literally and figuratively). We have a nice bit of cinematography to capture some of it, including a nice shot of \"death\" taking a liking to William H. Macy and a brilliant game of \"Bullslapping.\" The director, Walt Becker, knows better and lets the camera roll and the actors take control of what is going on. He was fortunate enough to capture the fun and silliness with little effort.<br><br>We don't have Oscar material in the least bit, but we have material that will spark laughing riots from the audience time and time again. Like most decent comedies of this decade, its best not to be taken seriously, because analyzing and nitpicking would distract from the overall experience. Like what the characters in the film originally wanted; it was a trip with no rules, no barriers, and no remorse. Wild Hogs does just that; it was a raw, strong PG-13 ride with the violence, sex, profanity, and look-away moments that anyone on the open road would witness. Also supporting this movie is a nice soundtrack, cleverly adding some good Southern rock, Bon Jovi, AC/DC, and even White Zombie. Try to catch some subtle Disney humor involving the actors and character's names.<br><br>Bottom Line: So what if the script isn't groundbreaking? So what if the direction didn't enhance anything? So what if the story became a bit predictable? We have four veteran actors making fools of themselves for almost two hours on the open road, and with very little time in between potential laughs. It was just pure popcorn entertainment, and isn't that what you want on a Friday night? Wild Hogs will not inspire you to do something, but it will inspire some conversations and maybe even a second viewing. Besides, it is rare to see Tim Allen and Martin Lawrence provide a slew of funny moments. While this movie could have benefited from fewer clichés and more unpredictability, it stands tall as the first good comedy of 2007.","user":"diac228","rank":[182,255]},{"title":"maybe here and there a bit overplayed but it was sure funny!","rating":8,"date":"19 March 2007","review":"Four guys in their late forties - probably more early fifties ... ;-)  go through their midlife crisis. No matter if loving, nagging or no wife, life is just not what it used to be  or ever was. Adventures are searched for, and John Travolta (not acting his best in this movie) has the saving idea for his buddies: a real road trip on their bikes instead of their usual short trip to a biker bar once a week.<br><br>Like in \"City Slickers\" the men have to go through some adventures and become heroes before they emerge with new energy to battle the next years of getting older ... however, the adventures these guys have on their trip are hilarious. The end slows down a bit with its predictability but this movie is very entertaining, funny and the ticket money well worth.","user":"caljane","rank":[67,102]},{"title":"Hog Wild Laughter","rating":9,"date":"18 March 2007","review":"Critics have been panning Wild Hogs in their writings. I have read a lot of negative response from the same goof-balls that have promoted some very bad movies. Sometimes I wonder if they are on certain payrolls to give a certain vote towards a movie. With that said---Wild Hogs is absolutely wonderful. In today's day of poor comedies (see anything starring Will Farrell for example) that do not produce a laugh or a smirk---Wild Hogs is a breath of fresh air. I have lately been happy if a movie has at least one good laugh to feel like my admission fee was worth spending. And in today's movie world, most movies are one joke wonders. Wild Hogs is a throw back to the days of My Cousin Vinny, Airplane, and Young Frankenstein. This movie was filled with laughs and good gags. The movie starts off slow and is reminiscent of a couple of failed Tim Allen projects (Shaggy Dog and Zoom), but after about 15 minutes it shifts gear and becomes a wonderful comedy well worth spending the admission fee. If you want to have a good laugh and enjoy yourself---see Wild Hogs.","user":"galahad58","rank":[131,223]}]