[{"title":"A few hair-pin turns before the 16 blocks are traversed","rating":7,"date":"4 March 2006","review":"This is not a remake of \"The Gauntlet,\" though the theme is a familiar one. There are, in fact, several movies with similar plots; \"3:10 to Yuma\" and \"Narrow Margin\" come to mind. A reviewer emailed me that \"Midnight Run\" not only has a story like \"16 Blocks\" but Bruce Willis' character Jack Mosley has a name that is a composite of the movie names for two of the leading roles in \"Midnight Run\": Robert De Niro's Jack Walsh and Yaphet Kotto's FBI Agent Alonzo Mosely. This, of course, may be mere coincidence. Though the story may seem like déjà vu, the action is fast paced making this an exciting film to watch.<br><br>Anyone who doubts that Bruce Willis can act needs only watch his standout performance in \"Pulp Fiction\" to see what depth this actor can bring to a demanding role. The role of Jack Mosely may not be challenging to Willis, but he still gives it all he's got which is plenty. Playing the part of an over the hill New York cop with a game leg, nothing to live for, and a drinking problem seems easy for Willis to make it all believable.<br><br>The criminal, Eddie Bunker, Jack must deliver to testify within a certain time frame is played with gusto by hip-hop artist Mos Def. Eddie is the most verbose prisoner ever. He rattles on and on about anything that comes to mind, some of it funny, some of it trite. He also has a riddle that is not answered till near the end of the film.<br><br>A standout performance is delivered by David Morse as the leader of the dirty cops, Frank Nugent. Morse is in danger of becoming typecast as a dishonest lawman. I'm hopeful he will become more diversified in his roles since he is such a talented actor.<br><br>This is another winner from action director Richard Donner. If you like his other successful concoctions such as the \"Lethal Weapon\" flicks, \"Superman,\" \"Conspiracy Theory,\" and \"The Omen,\" then you will certainly enjoy \"16 Blocks.\"","user":"krorie","rank":[146,167]},{"title":"excellent suspense","rating":7,"date":"7 March 2006","review":"This movie was an excellent surprise. It starts slow, but stay with it. Your first look at Bruce Willis as the burnt-out over the hill cop tells you this will not be the normal shoot-em-up cop drama. The plot starts building almost instantly, unlike many movies where you have to wait through thirty minutes of fluff before the story goes anywhere. The characters in the movie are surprisingly endearing, honest and genuine. They're just normal enough to identify with. Not the standard super evil villain and valiant good guy. Bruce Willis is awesome in his role as the tired underdog struggling with the morality of torn loyalty. Mos Def, whose character's voice was a little aggravating, played an excellent supporting role. The relationship he develops with Willis'character is both surprising and humorous. Overall, the movie was tense from the start and is filled with suspense, humor and a great deal of drama. It takes some unexpected turns and has a great ending. I highly recommend it.","user":"ageorge1023","rank":[134,165]},{"title":"I underestimated 16 Blocks","rating":10,"date":"3 March 2006","review":"I wasn't entirely sure this movie would stick out from the rest but I chose to go since I had nothing else to do. Hell am I glad I was bored. 16 Blocks is a wonderful thrill ride with lots of action/suspense and mild comedy. Any Bruce Willis fan would love this like they did Hostage. Willis plays Jack Mosley, a drunk/hungover cop that seems to have lost his touch. He gets all the scrap jobs that no one wants and one of these jobs brings him straight to Mos Def who plays Eddie, a very hard to understand, very talkative guy who has apparently witnessed something and is due to testify at 10 sharp. It's about 2 hours until he has to be at the court house which is 16 blocks away and a hell of a lot of cops standing in the middle. Mosley doesn't entirely know what to believe, the kid or his ex partner of 20 years but he puts his faith into the kid and the thrill ride begins. Hands down the best dirty cop film I've seen in a while.","user":"tankeredbell","rank":[183,242]}]