[{"title":"A little editing would've been nice.","rating":5,"date":"22 November 2005","review":"My reaction to Domino is about as mixed as the mixed race flowchart that Mo'Nique presents on The Jerry Springer Show during the movie (I know, that doesn't make much sense unless you've seen the movie). I dare you to not laugh once she starts introducing terms such as Blacktino, Chinegro, and Japanic. I suppose if you suck at the teat of political correctness then you might not get the joke, but otherwise it's one of the funnier scenes in the movie (the running 90210 joke being the funniest). At this point you're probably wondering what in the world Mo'Nique, Jerry Springer, mixed flow charts, and 90210 have to do with a movie about bounty hunters. It's a legit question. All I can say is welcome to the unconventionalism that is Domino.<br><br>I didn't mind the fact that this isn't very conventional, but at times it does feel a little convoluted. By the end of the movie I was pretty clear regarding what was going on, unlike the 'tard in front of me who couldn't decipher the concept of flashbacks, but the script does feel unnecessarily complex. Yeah, the movie kept my interest and is fairly entertaining, but it was just begging for tighter editing. Trimming about 20 minutes would've made the story stronger and the narrative more fluent. My guess is that Scott was experimenting and just couldn't bear to get rid of anything (Tom Waits' cameo especially felt unnecessary).<br><br>Tony Scott's made a movie that appears to be something he and his friends could most enjoy while under the influence of substances of a dubious nature. I can deal with the frantic pacing, the quick camera cuts, and the strange coloring, but is it really necessary to show characters saying the same line multiple times from different angles? Sometimes it's all just a little too weird for the sake of being weird.<br><br>One of my biggest complaints is that we mainly know that Domino is a bounty hunter because she tells us about 24 times in her narration, which starts to grate on the nerves after a while. I would've preferred to see a little more focus on, you know, her actual bounty hunting. SHOW us why she was a really good bounty hunter; don't just tell us over and over. I was expecting some really cool scenes with Mickey Rourke and Keira hunting down their bounty, showcasing the technical side of the hunt, and wrapping it all up with cool, tough-guy (and girl) bounty hunter stuff. Maybe a little sniping here, a vicious beat down there. Sadly, it never came.<br><br>Do I remind everybody that I'm a reviewer by pointing out in every single review that, \"I'm Johnny Betts. I'm a movie reviewer\"? No, I do my job and show you what it is that makes me a movie reviewer! <br><br>\"By writing crappy reviews, Johnny?\" <br><br>Uh, well, I guess we all get mixed reactions sometimes.","user":"TheMovieMark","rank":[235,345]},{"title":"Still a turd no matter how hard you polish it","rating":2,"date":"1 December 2005","review":"Tony Scott destroys anything that may have been interesting in Richard Kelly's clichéd, patchy, overwrought screenplay. Domino Harvey (Kiera Knightley) was a model who dropped out and became a bounty hunter. This is her story... \"sort of\".<br><br>The problem with this rubbish is that there isn't much of a story at all and Scott's extreme graphic stylization of every shot acts as a distancing mechanism that makes us indifferent to everything in Harvey's chaotic life.<br><br>You just don't care about Harvey. Knightley plays her as an obnoxious, cynical brat who has done nothing to warrant our respect. She punches people she doesn't like and sheds her clothes and inhibitions when the situation calls for it, but she isn't the least bit real and Knightly isn't the least bit convincing, either.<br><br>The film is boring. It's loud, too, and shackled with one of the most annoying source music scores I've heard in a long time. The final twenty minutes are a poor re-run of Scott's \"True Romance\" climax with Domino's gang going to meet two sets of feuding bad guys who are -- surprise! surprise! -- destined to shoot it out with each other at the top of a Las Vegas casino.<br><br>Unfortunately, this potentially exciting conflagration is totally botched by Scott and becomes a confusing, pretentious, pointless exercise in celluloid masturbation. This is not an artistically brave or experimental piece; it is a failure on every level because it gives us no entry point to the lives and dilemmas of its characters.<br><br>Mickey Roarke looks good as a grizzled bounty hunter, but he disappears into the background as the \"narrative\" progresses. Chris Walken turns in another embarrassing cameo and Dabney Coleman, always solid, is underutilized.<br><br>Don't be fooled by this film's multi-layered, gimmick-ridden surface. It is still a turd no matter how hard you polish it.","user":"fertilecelluloid","rank":[109,159]},{"title":"You'll love it or hate it  it's a stylistic thing","rating":7,"date":"28 June 2006","review":"My name is Domino Harvery. {EDIT *dizzying* CHOP} My--my--my name is Domino Harvey. {CUT, CHOP} My name is Domino Harvey. {EDIT. CUT. Playback}<br><br>Never have I seen a director take so much flack for his style before. By now it is evident that most people do not appreciate Tony Scott's choppy, flashy, dizzying editing technique. If I have to choose between loving it and hating it, I'd say I love it. It was borderline distracting at times, but the end result was pretty good and it's nice to see a director with a creative edge to his style and some originality (even if it borrows heavily from MTV videos).<br><br>This stylistic edge manifests itself as Keira Knightley plays the role of cocky badass bounty hunter Domino Harvey and even her dialogue seems strangely choppy. Otherwise she plays her poorly because I pretty much hated her character and did not sympathize one bit with her, no matter how much she suffered. We follow Domino through her life as she joins up with fellow bounty hunters Mickey Rourke, Rizwan Abbasi and Edgar Ramirez. The crew become tangled up in the FBI and suddenly has a reality show contract under Christopher Walken's TV production company (what is Christopher Walken doing in every film, by the way?). I guess that is a clever film technique, because now Tony Scott is free to use as much flashy MTV/Reality Show editing footage as he likes. It becomes a pastiche of MTV culture at this point.<br><br>It followes then that the story is told at an amazingly rapid-fire pace, with lots of raunchy strong language and gun violence. There are some funny jokes; it's all very modern and surreal at the same time. It's a mess, but it's a rather enjoyable mess. It is ultimately flawed in so many ways (the actors try too hard to make their characters \"cool\", for one) but it works. I give it a weak 7/10 which may seem generous when compared to the general consensus of movie-goers who graded this film  but I feel it had some good ideas and executed them well.<br><br>7 out of 10","user":"Flagrant-Baronessa","rank":[104,154]}]