[{"title":"Aja sees Craven's 1977 and raises him one HELL of a remake","rating":8,"date":"15 March 2006","review":"Alexandre Aja, you have a new fan.<br><br>Before this movie was released in theaters, I made sure to watch Wes Craven's original endeavor. Let me just start out by saying that compared to today's standards and conventions, Craven's classic \"The Hills Have Eyes\" seems almost mild when compared to Alexandre Aja's remake. However, purists too skeptic to check this movie out should rest assured that the film is very, VERY faithful to the original. The characters, story, and overall progression of events remain unchanged, however, the quality of all said elements has increased dramatically since the original 70s release. Furthermore, like any other quality remake, there are twists, there are surprises, and for people who think they're getting the same film with updated technology, think again.<br><br>The film starts out with the nuclear bomb test-radiation disclaimer, and from there, to those who've screened the original, the familiar New Mexico desert setting is presented for all to take in. Make no mistakes, though. Aja never misses a beat, and he makes sure to take advantage of any opportunity he can when it comes to scaring the living crap out of the audience.<br><br>After a very vivid and graphic opening, the film gets rolling, mixing elements of freshness with both nostalgia and familiarity. People who saw the original will know what they're looking at, however their eyes will also be glued to the screen due to the overall difference in presentation and cinematography. The familiar gas station attendant is shown to the audience, and soon after, the Carter family + in-law stroll in. From there, the real fun begins.<br><br>Aja and his fellow screenwriter did an amazing job adding depth and dimension to the family members, ensuring that throughout the course of the film, people in the audience would certainly be able to connect with or identify with at least one member of the Carter family. This is accentuated by very strong performances by all the actors. Recognizable, seasoned actors are chosen for the older family members, while younger, relatively lesser known actors are chosen for characters like Bobby and Brenda.<br><br>I really could not complain with any of the performances. With all the craziness and gruesome things happening to the family, the actors' reactions are all portrayed very realistically, with emotions dead-on with very few hiccups in line delivery. One performance that stood out in particular to me was definitely that of Aaron Stanford (Pyro, X2 and the upcoming X-Men 3). Despite the fact that Standford was merely a year old when the original 'Hills' was released, he more than proves his acting credibility and fits the role of Doug very well. He does the role justice, and fills the shoes of the protagonist very well. I could go on and on about the performances of the rest of the cast (which are all extremely solid), but you want to know more about the movie, right? One cannot help but compare this film to original. There are 3 reasons I feel Aja's remake tops Craven's original: 1) the emphasis Aja places on the Carters, 2) the make-up effects, 3) the excessive gore.<br><br>Whereas Craven gave the deformed family clan plenty of screen time in 1977, Aja opts to shroud them in mystery for much of the film's duration. In many ways, the family emphasis is almost reversed in either film. Aja makes sure to hide the deformed family members from the viewers until just the proper moment, while Craven made their names and personalities as clear as day. I personally think the less information there is about something, the scarier it becomes to the person dealing with it. Aja realized this, and presented it very well.<br><br>Speaking of presentation, one cannot help but watch in sheer awe and amazement at some of the deformities displayed by the irradiated family members. I personally have not seen such drastically deformed individuals first hand, and I'm not sure how accurate their portrayals were in 'Hills' '06, but one thing is for sure: they were damn gruesome. Do not be fooled, the little child shown in the commercially televised trailer is NOT representative of the rest of the film.<br><br>And then there's the gore. Ah, the gore. Monsieur Aja, you are the brainchild of modern horror, and you definitely know how to ride with the best of them. No body part is taboo in this film, and for all you gore fanatics out there, there are no annoying instances where the camera \"looks away\" when someone or something is, say, struck with the menacing swing of a weapon. For all those who've said \"But I wanted to SEE what happened to him!\", rest assured, you will indeed see what happens to everything in this film.<br><br>The Hills '06 will satisfy your blood-lust. Alexandre Aja takes Craven's original film and builds on it in just about every way. Better acting, better visual effects, better make-up, better story presentation (i.e. no unanswered plot holes or abrupt \"halts\"), and much, MUCH more gore. This film is not for the squeamish, and it is my opinion that it will suppress the doubts of any skeptics who, upon seeing this film, may have badmouthed horror movie remakes in the past.<br><br>Only thing that caused me to dock it a point were the questionable courses of action some of the characters took. Alas, such things may always fall into the category of \"typical horror movie no-no's.\" Furthermore, I wasn't really horrified while watching this movie. A more accurate description would be that I was highly impressed and satisfied.<br><br>Horror movie fans: see this film as soon as you can. Non-horror movie fans: if you see this, prepare to have your world rocked.<br><br>See this movie people, it's pure gold.","user":"jackalman22","rank":[272,359]},{"title":"Not bad , but still prefer the original by a mile","rating":7,"date":"18 November 2006","review":"What made early Wes Craven movies so special were these eary and daunting atmospheres he was so good in creating ; And this is what Hills Have Eyes 2006 totally lacked. Firstly the music through out the movie was awful and totally cliché and unfortunately diminished any depth that HHE was trying to show. I did like the nuclear mutant idea , but then seeing them reminded me on how the original HHE villains had way more presence on the screen and they had no make up !!<br><br>Now I did like the actors , they played their respective roles well The effects were good + I did like how they twisted the original script and added some new ideas instead a complete knock off of the original So my final word not a bad movie , but lacked atmosphere/suspense , which is so important in horror/slasher movies , shame !","user":"sebastianhennessy","rank":[59,77]},{"title":"Finally, an excellent horror movie","rating":10,"date":"11 March 2006","review":"The Hills Have Eyes, although a remake of the original, was everything a horror movie should be. Typically, I'm not a fan of slasher flicks, but this movie had elements I like to see in a movie. I don't like to see the protagonists making stupid mistakes (the old \"curiosity killed the cat\" syndrome), I don't like being able to guess the villain 20 minutes into the movie (although this wasn't the scenario in this particular movie). I don't enjoy picking out who's going to do die first, and being correct. I don't think sex scenes have any place in horror movies. I like things to be important and advance the plot.<br><br>Although the movie had some \"MTV\" elements to it, it still adhered to the classic horror movie thrills. The thing I liked about this movie was the fact that they repeatedly \"crossed the line\", doing things that you wouldn't expect modern movies to do, nothing is off limits in this movie. Horrifying elements that made you, well, terrified. Lots of \"boo\" surprises, but also more complex and twisted than modern movies have allowed. I spent most of the movie with my mouth agape... It's not just the gore, although there is a lot of that. They didn't leave anything to the imagination, did not imply anything...they showed you everything.<br><br>It was admittedly a little slow at first, but then all of the sudden things began to take a turn for the wicked. One thing this movie did that most horror movies don't bother to do is go into character development. Not a lot, but more so than a typical thriller will bother to do.<br><br>This movie was so disturbing, I'm not sure I'd want to see it again. That \"Deliverance\" mentality...you see it once, you're glad you saw it, but so disgusting you're pretty sure you don't want to experience that again.<br><br>Any horror aficionado should see this movie.","user":"mecha_meg","rank":[358,521]}]