[{"title":"Not Perfect, But Funny","rating":8,"date":"24 February 2007","review":"I know that many people are complaining about the short length of the movie, a sparse 84 min, but what's there is funny. I know that when I left the theater, my face, as well as the faces of my 9 friends who came with me were hurting from laughing so hard. If you a fan of the show, you will love the inside jokes and cameo of one of the shows most beloved characters (I won't spoil that for you, just look at the cast for yourself). There are also plenty of notable celebrity cameos such as Danny DeVito, and The Rock to name a few. I will admit that it isn't exactly up for any awards, nor will it go down in history as one of the funniest movies of history, but it has its moments. If you liked the show, you will like the movie.","user":"vashstampede117","rank":[59,76]},{"title":"Bizarre, crazy ... and entertaining.","rating":11,"date":"11 August 2008","review":"Having not seen the TV series, this was my first exposure to the characters of the \"Reno 911!\" world. As such, the movie was really amusing to watch. There are some really funny bits (mostly coming from the dialog) along with the insane wackiness of the characters. As a first-time viewer, it was just plain fun to watch.<br><br>The movie is basically about a group of Reno police officers who travel to Miami for a police convention. When a quarantine restricts the Miami police force (and all the other officers in the city), the Reno crew must defend the city.<br><br>The dumb innocence of the characters coupled with the serious tone that goes along with being police officers is well done. Each character is also well-defined with particular quirks, hangups and issues with the other characters. As a result, the things they say are often nutty and hilarious.<br><br>If you've never seen the series, everything in the movie will be fresh and amusing. There are some good laughs here and there and the bizarre, kooky characters will keep you fascinated. For new viewers, it's worth checking out.","user":"Vic_max","rank":[11,12]},{"title":"Funny and Satisfying, Even for Non-Fans of the TV Series","rating":7,"date":"22 February 2007","review":"I'd only seen part of one episode of the TV show before seeing the film, so my knowledge of the characters and the premise of the show was limited. No matter: the film does an excellent job of establishing its tone and the specifics of the characters right off the bat. No roadmap required.<br><br>My biggest fear with seeing a theatrical version of a TV series is that the film tries to overinflate the stakes of the plot to justify the increased length and budget and fails. Reno 911!: Miami took that necessity to its logical next step by moving the small town incompetence to a much larger scale in Miami, but due to some clever (and minimalist) writing, the relocation works. And, since nearly all of the humor in the film is derived from the characters and their reactions to their situations -- all of which speed by at a brisk pace, so as to not overmilk a joke -- the relocation never felt forced or unwelcome.<br><br>Impressively, the film veers into cliché territory on numerous occasions but never delivers the expected punchline. The actors know their characters so well that their improvisations keep the audience and their costars on their toes at all times. Even the traditional \"caper\" plot, which is really just an excuse to tie all the vignettes together, is handled with more originality than I would have expected.<br><br>Perhaps I should start expecting more from this creative team, since they're capable of sustaining my interest (and my amusement) over the course of a full-length feature. In fact, perhaps I should start watching the series...","user":"MITCH!","rank":[55,75]}]