[{"title":"When Keeping It Real Goes Right","rating":10,"date":"19 October 2007","review":"I would consider myself to be a movie buff and I live and grew up in Massachusetts. I must tell you that Ben Affleck has done an outstanding job in his directorial debut. In casting his brother Casey you may think that it's just nepotism or giving his brother a break. No. He is the absolute perfect person to play this role. Because they know the area they have made one of the most authentic movies I've ever seen. And it's not just some Boston movie either. I heard a woman as I was leaving saying it's just like The Departed. No it's not, it's much better and the fact is, I loved The Departed. But that was flashier. As great as it was you could tell people were acting. Not here. They seemed exactly like the degenerates and handful of decent folk I see every day of my life. The woman who plays the girl's mother, I don't know who see is, but I've met her about 1000 times.<br><br>As far as the story goes I'd never spoil it for you but it's complex, not confusing. There is a lot going on and it's so real. I don't know what's happened in this area but people have become so lousy. So lousy that if you're a good person you just don't know what can be done anymore. There seems to be no answer sometimes and this film is set in that world. If you have the brains and heart to try you don't even know what will come of it.<br><br>Who should see this? Intelligent people. People who want to come out of a movie thinking about what they just saw. People who want to see an incredibly well made film. And anyone who ever liked Ben Affleck even for half a second. He should be very proud of this movie. As far as content there are loads of curse words, some drug use, but no nudity that I can remember, and there is some gun violence, but nothing too bad. Put it high on your movie going list.","user":"the_Poppuns","rank":[529,653]},{"title":"Will Keep You Debating On What Is Truly Right","rating":8,"date":"16 February 2008","review":"I had wanted to see this movie for sometime now. I have finally gotten to see it and can tell you it is no disappointment. This movie had a particular touch that gave a genuine and authentic feeling to it. Ben Affleck has a way of writing about life on the streets in Boston that just grabs you. Good Will Hunting was a fine example of that but Gone Baby Gone displayed his directing abilities as well. This movie appeared that it could fall apart any second but yet the story held up and managed to get its message out. Ben Affleck seems to be very creative and knows how to get your attention right when he want you to.<br><br>I had not expected Casey Affleck to play as well either because there were so many compliments made toward his performance I expected something totally different. Yet he also brought this authenticity in his acting like Ben did in his directing. Youn could just see the look in his eyes that he was totally into it, he was it. He gave a great portrayal of a detective that should have earned him an Oscar nomination. Also a great supporting cast was put in place with Morgan Freeman, Ed Harris and Amy Ryan. All of them gave engaging performances as well. Amy Ryan especially with her performance as the mother of her girl who is the centerpiece of this story. I believe if it was not for her this movie could have very easily fallen into an ordinary movie. <br><br>What really made up the movie was the message. After all what is a movie without a message. This movie did not try to pretend to be deep or try to impress. It did what it had to do, asking the a very tough question. Is the right thing to do always the right decision to make and do the ends justify the means? I advise you not to miss this movie and definitely watch this with a friend or family member.","user":"alexkolokotronis","rank":[135,162]},{"title":"Ben Affleck crafts a disturbing emotional adaptation.","rating":10,"date":"22 October 2007","review":"After a decade of critically disgraced performances and brutal public humiliation year after year, Ben Affleck took a well deserved break from the Hollywood scene. This year he came back, but instead of taking the spotlight by starring in a film, he went behind the scenes and opted to direct his first feature film. Taking an example from another actor turned director, a little independent man named Clint Eastwood, he decided to adapt a novel written by Mystic River author Dennis Lehane. On the surface, Gone Baby Gone tells the story of a missing child and the two private investigators who are hired to find her. The story transforms into a highly disturbing tale of selfish, terrifying characters and the fact that no matter what people never change.<br><br>In deciding who to play the leading role of the intelligent, reserved, moral and slightly naive Patrick Kenzie, Ben looked no further than his brother Casey. Initially this may seem like a bad idea with lots of sibling tension on the set, but the decision couldn't have been a better one. After years of under-the-radar brilliance, Casey gets to show his acting genius in the leading role of a powerful, emotionally drenching work. I love the fact that everyone is finally getting to see what a true wonder this young actor is, with talent greater than the majority of actors I've ever seen no matter what their age. He's getting a large amount of critical recognition for his flawless turn in The Assassination of Jesse James by the Coward Robert Ford, but he is almost as exceptional in this one. Counterbalancing Kenzie is his mature and equally intelligent partner and lover, Angie Gennaro played by the beautiful Michelle Monaghan. The two of them grew up on the streets of Boston and therefore are pursued to use their relationships with the criminals involved to help find the men who kidnapped this little girl. This leads the audience on a highly engaging and very disturbing journey through the lowest forms of scum in the Boston population and a climax that is just as surprising as it is haunting.<br><br>The second half starts with another missing person's case and Kenzie discovers something that forces him to bring back Detective Remy Bressant (Ed Harris), a character who he didn't end on the best of terms with in the first act. In an act of high tension and in the face of an ultimate evil, Kenzie makes a decision that he immediately regrets and is the first time he really matures in the film and falls into a moral crisis as he witnesses the true personalities of those around him and re-evaluates everything in his life. A conversation with Bressant soon after this act provides a stage for Ed Harris' remarkable display of talent in one of his career best performances. However a revelation Kenzie makes during this conversation leads us into an even darker world of corruption within the police, back to the victims of the original crime and a lesson that sometimes the most morally righteous can people can do terrifying things if they believe it is for the greater good.<br><br>Another stirring revelation leads Affleck to the film's second big twist that I didn't see coming from a mile away. He finds moral corruption, again 'for the greater good', in the most unexpected place and is led to one of the most arduous and unimaginable decisions I've ever seen put on film. I won't spoil anything, but it's safe to say that this was the first and only time I've ever put myself in the shoes of a character on screen and wondered what I would do in his situation. It's a decision I don't think I could ever make, and one of the most painful scenes of the year. Watching Affleck's expression and the pain in his eyes is truly gutwrenching. In his decision we eventually see that even in the most emotionally straining situations and no matter how much they say they will, people never change. I found that to be the final moral of the film, and the ending was haunting, cathartic and emotionally painful as we see Kenzie living with the fact that maybe his decision was the wrong one but he still tries to do the morally just thing in the end.<br><br>Ben Affleck has come back strong to the Hollywood scene by avoiding public humiliation and realizing that the film would be miles superior if he directed instead of starred in it. There is one minor flaw in this feature, and that is that it felt to me like three different films. There are two clear cut endings, but the film picks back up afterwards on the road to the final conclusion. With each new story comes depth and disturbance from the characters and overall plot, so one can easily ignore this very minuscule flaw. His casting was flawless from the stunning magnificence of Casey Affleck to the Oscar-worthy Ed Harris to the critically praised grieving mother Amy Ryan. Gone Baby Gone is certainly one of the best films this year, and I hope it's not forgotten come awards season, particularly in the form of it's reborn director and flawless leading man (as well as the rest of this multi-talented cast). A deeply disturbing and thoroughly engaging picture that is sure to stay on my mind for days.","user":"dead47548","rank":[238,302]}]