[{"title":"Malkovich cowering in a toilet: an image to remember","rating":9,"date":"20 September 2009","review":"J.M. Coetzee's Disgrace is a hard, concentrated novel, painful to read, unyielding, uncooperative, unfun. What better actor than John Malkovich to convey Coetzee's own unwillingness to do anything to ingratiate himself to the reader? The actor projects a cold self-assurance. It may not matter that his South African accent is faulty at best, fades in and out; that he seems too distant and affected to be any kind of literature teacher, let alone one currently teaching Wordsworth, a devotee of Byron. The same thing happened with his performance as Valmont in Frears' Dangerous Liaisons. His Midwestern drawl grated; he lacked suavity, lacked charm. None of it mattered because he had such evil, such confidence, such panache, such an edge, he held the screen and transformed himself into a new compelling kind of 18th-century French Iago of love. Besides, here, as his daughter Lucy, the South African newcomer Jessica Haines is equally important and very good, less flawed by casting incongruities than Malkovich. And as Coetzee's comment has acknowledged, the most important thing to the adaptation is how the film can convey the beauty of the South African landscape better than his book did.<br><br>What's most disturbing to people about the novel is this: it conveys ideas through the protagonist David Lurie (Malkovich's role) about how South Africa has been trashed, how the blacks hate the whites, how the country is a place of anarchy and violence, that are clearly Coetzee's own views. How dare he do that and make no bones about it? But since he's ruthlessly honest, how dare he not? The novel was the first I read by Coetzee and didn't make me run out to read more. But the book became the first time a writer won a Booker Prize twice, and four years later Coetzee was awarded the Nobel Prize for Literature. Maybe he was doing something right.<br><br>And so were the Australian Steve Jacobs who directed this adaptation of the book and his Moroccan-born wife Anna Maria Monticelli who wrote the screenplay and produced it. Outsiders that they are they have nonetheless produced an adaptation that makes a complex book clearer without mangling or oversimplifying it. This kind of international production may grate upon the spirits of South Africans, but they wouldn't be likely to enjoy an all-local production either. All one can say is that this is a book that works well as a film and that adapts successfully without a lot of changes.<br><br>David Lurie has had several wives but he \"wasn't made for marriage.\" A womanizer, a sensualist, at 52 he's losing his physical attraction; he's looking old. Even his Malay prostitute lets him go. He forces himself upon Melanie Isaacs (Antoinette Engel), a mixed-race student in his romantic poetry class. When they have sex, she turns away as if repelled, but she submits. He's found out and threatened by Melanie's boyfriend, yelled at by her father, boycotted by the students, and at an administrative hearing he's so unrepentent he ends by being forced to leave the college. He goes to the Eastern Cape where his lesbian daughter Lucy has recently been abandoned by her lover. She grows flowers and vegetables she sells in the local market, and she arranges for David to help Bev (Fiona Press), a middle-aged lady whose animal shelter work consists primarily of euthanizing unwanted dogs. In and out of the property he now shares with Lucy is Petrus (Eriq Ebouaney), an almost mythically neutral, philosophical black man who owns land there and is gradually taking over, but who also made Lucy's garden land arable.<br><br>Then enters the outside horror. Three young black men appear when Lucy and David are returning from a walk and ask to use her phone. They invade the house, rape Lucy, nearly kill David, and shoot all Lucy's dogs, wrecking the interior of the house and stealing David's car. One pours a bottle of methyl spirits over David and sets fire to him, locking him in the bathroom.<br><br>This sequence is more powerful than the book. After his arrogance, to see Malkovich cowering beside a toilet bowl with his face burned is unforgettable. Eventually he returns to Cape Town and cowers before Melanie's family, asking forgiveness. It's not quite believed, but it's as much of a transformation as such a man is capable of. But it's Lucy's response that's more important: she refuses to report the crime, and refuses to leave. She cooperates with Petrus, who defends the youngest perpetrator. He turns out to be family, the son of his new wife's sister. He says it's over. Reconciliation. In fact, the attack may not have been so random.<br><br>David says it'll never be over and will be passed on to those who come long after them. This may be an endgame. But they were born here and they remain. The important thing is that Lucy stays, and so does David, after returning to Cape Town to apologize -- and be serviced by a prostitute. The film, like the book (but perhaps in clearer outline) is about humiliation, suffering, enduring. It's about sexuality and about living with other beings, other animals. Viewers who don't find Disgrace \"real\" astonish me, though people and events are symbolic as well as specific, always richly both, and always simple and complex. David sleeps with Bev to please her, because she's lonely, and she wants it. Of course it's the sort of good deed that pleases him, but there is humility in it, as is his help, however unenthusiastic, with the animals. Malkovich's arrogance becomes complex because the most vivid images in the film are the ones of him cowering and afraid. In order to maintain his Byronic arrogance as a genteel rapist of \"coloured\" young women, he has given up his pride and his status. Disgrace is a film for smart people. It's as tightly coiled and thought-provoking as the book, and nearly as good.","user":"Chris Knipp","rank":[67,82]},{"title":"Bleak morality tale","rating":8,"date":"14 July 2009","review":"Both J.M. Coetzee's novel and its film adaptation leave their audience wanting more answers. Disgrace is a confronting and brutal tale of life in modern South Africa. The message is clear. There are no simple solutions.<br><br>Literary academic David Lurie's admiration of Byron seems to have formed his personal morality and his professional ethics.<br><br>His amorality leads to a doomed relationship that precipitates both work and identity crises. His alienation from university colleagues and students results in a refusal to defend his reputation or his professorial position.<br><br>He is not the victim of an old fool's infatuation but the arrogance of a serial Casanova. He quotes William Blake as his sole defence, \"Sooner strangle an infant in its cradle than nurse unacted desires.\" His retreat to his daughter's remote farm entangles their individual problems in the realities of life in the post apartheid era.<br><br>Director Steve Jacobs and screenwriter Anna Maria Monticelli continue their professional and personal partnership as co-producers. Their earlier collaboration on La spagnola in 2001 was another Australian production that is a minor gem.<br><br>John Malkovich's ability to convey complete self absorption and intense self doubt without dialogue make him an excellent choice for David. Relative newcomer Jessica Haines plays his daughter Lucy. Hers is a competent and moving performance. Eriq Ebouaney strikes the right tone in a difficult role as Petrus, the black farmer and her co-landholder.<br><br>Disgrace is an adaptation that more than does justice to the novel. Like the book, it does not sensationalise or over-dramatise this extremely difficult story. I had misgivings before the screening because the novel seemed so bleak. Lucy's compromise and David's acceptance of her decision offer such slim hope.<br><br>We are left with little doubt that this is an allegory for the issues facing modern multi-racial South Africa. Yet it is at the personal level that the film is most powerful.<br><br>Kevin Rennie Cinema Takes http://cinematakes.blogspot.com","user":"kevin-rennie","rank":[51,66]},{"title":"Liked it, but convoluted...","rating":9,"date":"13 September 2011","review":"John Malkovich portrays an esteemed Capetown professor who lives somewhat in his own ivory tower, has an affair with a young student and finds his idyllic life in academia and ego-gratification shattered.<br><br>He decides somewhat on a whim to visit his daughter Lucy, who runs a farm on the South African coast. She cares for several dogs and has a native worker who helps her on the farm. It is a small cohesive village and she is on the outside looking in, a veritable intruder, in more ways than one.<br><br>The story develops and foreshadows the violence which is beset upon Lucy and her father by a local disturbed boy who rapes her, along with a gang of two other young men. Her father sustains burns, but does not see what actually happens to Lucy in the other room, although the audience can infer she is being raped repeatedly. <br><br>Malkovich at first approaches her gingerly, thinking she is damaged and distraught needing to move away from the farm and her assailants. However, the opposite proves to be true. In a rather dismal scene, Lucy tells her father she must remain, that rapes like this have occurred before, and she is owing this to the people of the land, that she must remain to take on a sort of punishment.<br><br>There are psychological nuances here. People inducing sadomasochism, or enduring it for their real or presumed character flaws. It makes for a compelling story, and I'd imagine the novel by J.M. Coetzee is a great read. The film at times does not translate this subtlety, and we are left feeling annoyed with Lucy and her victimized state.<br><br>Malkovich is good here, as usual, with an affected but acceptable accent, a restrained but marked need for sexuality in his later years. He has an affair with a local veterinarian where he brings some of Lucy's unfortunate dogs to be etherized. <br><br>The scene where Malkovich plays music for a dog, the dog responds to him, wanting his love, and he brings it to the vet to be destroyed is sad and stark. \"Put it out of its misery\", he tells her...and we almost imagine he is speaking of his own life instead of the dogs.<br><br>Overall a worthy film, although the book is probably much clearer in intent and I am now intrigued to read the authors works regarding animals and the fragility of life. Recommended. 8/10. **Addendum: Have finished the novel and it is a must read","user":"MarieGabrielle","rank":[11,12]}]