[{"title":"Wow","rating":7,"date":"14 October 2006","review":"Impresively taking \"Texas Chainsaw\" back to its roots, horror fans and cinema-goers alike should definitely give this prequel to the daring 2003 remake a chance. Although the remake in 2003 was excellent and had a tighter, more involving plot than this film, it breaks a barrier because rather than directly approaching the style of the remake and trying to live up to its success, this equally grisly thriller ignores all of the gloss, cinematography, pacing and story that it was inspired from. Instead, it goes back to the film style which made the nightmare in 1974, a more direct homage to the in your face horror that started it all.<br><br>This story is in 1963, right before the events of the 2003 film which took place in the early seventies. Jordana Brewster plays Chrissie, who is on a fun road-trip across Texas with her friends, Eric, Dean, and Bailey, played well off of each other by Matthew Bomer, Taylor Handley and Diora Baird.<br><br>Shortly after the terrifying, recognizable psycho Leatherface commits his first murders, a cross story involving an encounter with some nasty bikers throws the doomed teenagers flipping across the road in a surprisingly brutal accident.<br><br>After Sheriff Hoyt arrives (R. Lee Ermy in another chilling performance), to take control of the scene, the nightmare begins for Chrissie's friends as she watches them get taken away in his police car, unknowingly headed for the house which would become a place of torment and nightmares for years to ensue.<br><br>Appropriately gory and no-holds barred, Jonathan Liebesman creates a tight, slick and sadistic thriller in the eyes of Chrissie as she endlessly attempts to rescue her friends from a demented madman's clutches. This is a highly worthy and satisfying entry in the horror series that will make an indelible mark on your imagination, if not already done by the seemingly endless spew of remakes and graphic horror films.","user":"mbworm","rank":[68,90]},{"title":"Unpleasant and disturbing...as it should be","rating":8,"date":"6 October 2006","review":"Prequel to the 2003 \"Texas Chainsaw...\" giving us the origin of Leatherface and his twisted family. That's all done within the first 20 minutes...then it's just a virtual redo on the original with four likable 20-somethings being captured and tortured by Leatherface and his family. Considering it's basically a remake of the 2003 film, it works remarkably well.<br><br>It takes place in 1969 and has two brothers (Taylor Handley and Matthew Bomer) going to enlist (after being drafted). Along are their two girlfriends (Jordana Brewster and Diora Baird). But they're stopped by crazy Sheriff Hoyt (R. Lee Ermey) who is Leatherface's uncle...and the \"fun\" begins.<br><br>Very grim and graphic with no humor and shot in muted color...just as the 2003 one. The gore is strong and disgusting (this got trimmed to get an R rating) and I can't say I liked it...but it did it's job. It scared me. I was cringing in my seat a few times and jumped more than once.<br><br>Another plus is ALL the acting is good. Brewster, Handley, Baird and Bomer are all good-looking and likable--when the violence starts you really are horrified at seeing such great characters being tortured. Ermey is on hand giving another terrifying performance as Hoyt. His character is so twisted, violent and sick that when he got a taste of his own medicine my quiet audience broke out in applause. Also there's good old Leatherface and his chainsaw chasing everybody.<br><br>In some ways I applaud a grim, graphic R rated horror film that pulls no punches--I HATE the watered down PG-13 crap we usually get. But unlike some (like \"Scream\") this is pretty unrelenting and wears you down. But it scared me and that's exactly what it's supposed to do. An 8.","user":"preppy-3","rank":[123,173]},{"title":"Don't expect anything new","rating":7,"date":"7 October 2006","review":"Please don't get me wrong, this is a good horror film. To those looking for gore, it is there any there is plenty of blood shed. I would speculate several scenes have been cut to appease the mpaa. Had this film been release before Hostel, The Hills Have Eyes, or the Saw Franchise, more of the film would have ended up on the cutting room floor. The film is being advertised as it will show up how Tommy Hewitt became Leatherface. Anyone looking for any real discovery to this information will have to look somewhere else. Truthfully the only real incite into the Hewitt family origin is how a homicidal sexual deviant was able to become a Sheriff. Being a prequel, the lack of background information is, to say the least, disappointing. <br><br>I don't want to get into specifics, but there are several parts where the film feels as though it being recycled. Some scenes feel as if they were rehashed from other Chainsaw films, needless to say they did not live up. Add to this the typical slasher clichés (don't go upstairs/down to the basement, etc) and it only adds to the predictability.","user":"zahana","rank":[112,159]}]