[{"title":"Good for it's genre","rating":6,"date":"22 May 2006","review":"As far as mad stalker/Friday the 13th/Halloween type movies go I think it was effective. Kane makes a good \"monster\". The cast of unknowns seems to try reasonable hard. There were some gross-out gory parts, some effect atmosphere, some unexpected ways of getting killed, and for me anyway a surprise in some of the twists. It's a B-movie but in that context it works for me. The theater was full and the crowd seemed to get into it. If you want to see a \"maniac versus a group of teen agers\" movie this is a good one to see.<br><br>The set up for the villain is effective and they actually did a good job in explaining how he got as messed up as he did. Actually by the end of the movie you get enough flash backs that you think he was twisted into shape and not just born evil ala Freddy or Jason.","user":"wrudd","rank":[38,43]},{"title":"A decent gore flick","rating":7,"date":"20 May 2006","review":"I was expecting this movie to suck, but what I got was a pretty good slasher/gore film. Most of the death scenes are adequately brutal. The teens are decent, with Penny McNamee definitely the best of the bunch. Rachael Taylor looks like a young Christie Brinkley, but doesn't bring much to the movie other than that. Kane was good as the killer, and is totally believable as a fearsome juggernaut. I saw the \"twist\" coming from miles away, but I still enjoyed the movie.<br><br>But what really stood out to me was the direction. Gregory Dark might actually have a career in legit film ahead of him. Aside from overusing the horror film \"speed cam\"(you know, where like the guy's face shakes all fast?), there's some good shots here. The camera angles and environments really emphasize Kane's size, making him look even bigger than he actually is.<br><br>If you're looking for deep story or characters, this ain't it. But that's not what slasher films are about. If you're looking for some good violence, or if you're into gory films, go check this out!","user":"mrtacoman","rank":[90,118]},{"title":"I just saw it and...","rating":21,"date":"21 May 2006","review":"I remember way back when I was a manager at Toys R Us I had to watch this sad, pathetic \"Personnel Management\" training video. It lectured that whenever you say a criticism, you should ALSO include a compliment. This movie reminded me of that principal.<br><br>First off, it's not all that bad, actually. Kane makes a pretty good \"Silent Psycho,\" and the character's back story is decently developed in a series of B&amp;W flashbacks. His POV shots are nicely distorted, and, unlike the vast majority of psycho killers in film today, is not simply an \"unstoppable force.\" Kane actually manages to find a character in there. (A very minimal character, to be sure, but there is a TINY bit there more than just a \"Thing-That-Kills-People-For-No-Reason.\") On the whole, however, the acting in the film is best described as \"not-TOTALY-sucking.\" (I'm reminded of that Simpsons episode where Groundskeeper Willie sings a song that goes \"Wouldn't it be adequate?\" Yes, the acting here is, indeed, adequate, but only just. To be fair the actors aren't really being asked to act here, it's enough that they are clichéd stereotypes.) <br><br>The art direction is generally good, if very, very derivative of other films like \"Hostel\" and the \"Saw\" series. It goes a bit over the top with the filth and grime at times, but for this kind of movie, that isn't really a problem from an aesthetic standpoint. It is a problem from a plot standpoint. The people are there (we learn this in the first 10 minutes, so don't worry, it isn't a spoiler) to do public service by cleaning an old, historic building. Unfortunately, the sheer SCALE of the mess at this building would take that guy from \"Dirty Jobs\" and a full hazmat crew a month to deal with. The place is practically a toxic waste dump. There are a few problems (which I will NOT detail in the interest of avoiding spoilers) with the set and set dressing that are later revealed as not problems at all, but rather plot points. Those I can forgive.<br><br>The film delivers on what it promises: A creepy, disgusting setting with a creepy, violent psycho stalking creepy, dysfunctional people, with absolutely minimal story, plot, acting, direction, sense, or purpose to get in the way. It's almost Ed-Woodian in it's gleeful disregard of knowledge of it's own lack of ambition to greatness. (If I may be allowed to construct a sentence that convoluted without being arrested by the Language Police.)<br><br>I had very few expectations from this film (Hell, after all, it IS a WWE film...), and the only thing that really disappointed me is the same thing I am disappointed by in most horror films. It was very, very predictable. At one point I was sitting there going, \"...and now someone runs in and saves them,\" only to be rewarded by just that.<br><br>In the end, if you can accept the idea that a correctional institute would send a co-ed group of mixed violent and non-violent offenders to do heavy-duty industrial cleanup in street clothes and sandals for a weekend with only 2 chaperons, then nothing else the film asks you to accept will be much of a problem for you.","user":"sandman33","rank":[87,117]}]