[{"title":"Looks good and covers a lot of ground but doesn't work as a dramatic film","rating":12,"date":"12 April 2009","review":"The opinion on IMDb on this film seems to be pretty split and the reason appears to be because many are not writing their opinions of the film so much as they are reviewing Biggie and/or hip-hop itself. So the unquestioning 10* reviews rave about the man and his music, while the 1* reviews talk more about the aspects of the music and culture he represents than they do about the film. I was curious to see what the film was like on its own merits so I made an effort to see it recently. The truth of the matter that the film is \"ok\" but not anything more than that – and I say that as a hip-hop listener who likes more east coast than west coast.<br><br>The problem with the film is that it is far to driven by ticking boxes of people and events. As a result it doesn't flow so much as it does introduce people and things in a way that the audience will recognise. This is all well and good but it breaks up the film as a dramatic piece – for example with Lil' Kim, she is not allowed to just be part of the story, no, when she is introduced we even get a shot of her name badge so we can all be sure from the start as to who she is. It is like this with events as well, and the dialogue is surprisingly expositional in its nature with far too many characters seemed to be talking just for the sake of filling in blanks or moving to the next scene. As a sort of summary of Biggie's career this is fine I suppose but when it comes to caring about the characters then it does hurt it quite bad.<br><br>Not that the film is overly concerned with the characters because the events-driven script doesn't really have any. Before anyone messages me with insults, I can see that there are physically people on the screen there, doing and saying things as these people, but in terms of character development and depth there is none. Nobody ever feels real – partly because of the dialogue but also because the material doesn't give anybody room to develop. This is best seen in the \"second-tier\" characters such as Puffy and the many women in Biggie's life but it comes over differently with Biggie himself. Contrary to his musical personae, the film does not play up the negative side of Biggie's life too much. It cannot completely hide it though and we do get lots of infidelity and things like him happily selling crack to a pregnant woman. However all of these things tend to be deliberately cancelled out later on in some daft and unnecessary scenes. For example we get to see the crack user years later, fine and playing with her child (also fine) and of course much is put right by conversations, commitments and phone calls on the night that he gets killed. Such things damage the film further as both a record and as a dramatic film – I didn't want \"warts &amp; all\" but an edge of realism and criticism (where warranted) would have been good.<br><br>It might be them or it might be the material but either way, the cast are not that great. Woolard does a solid impersonation of Biggie and deal well with the material but he has nowhere to go with his character other than the specifics of the scene – there is not a man inside his performance so much as an image of a man. Luke and Bassett are both very talented actors but neither gets to showcase that here – indeed Luke is only memorable for how well he nails Puffy's dancing style. Naughton's Lil Kim sticks in the mind for reasons other than her performance (although again as an impression it is good enough for here). Smith, Ringgold, Mackie and others just do the basics as the film gives them no other options.<br><br>The end result is a film that looks good and covers a lot of ground but doesn't work as a dramatic film. The people and events are there but they are only ever names and things that happen – never real people or events that come from the story. The cast turn in solid but not that good performances accordingly but nobody can raise it beyond what it is. Not \"bad\" generally but just really lacking over what I would have expected from a biopic.","user":"bob the moo","rank":[52,67]},{"title":"Sick of people writing things that make no sense !","rating":10,"date":"18 January 2009","review":"First off, I went to see this movie, just left as a matter of fact and I think the movie was very well done. For the people saying that the movie was anti-climatic, what was the climax supposed to be ? We all know how it ends, or should they have added more to the story for dramatic effect so we could then talk about how fake it was, and how it didn't really happen that way ? They told it the way it happened It seems that many people are forgetting that this was a movie about someone's life, not somethingfabricated or concocted simply for the purpose of entertainment. It is supposed to tell a story,his story and if you are a true fan of B.I.G. then that should be the reason you went to see it. What good would that have done to his legacy to fill the movie up with speculation about who did what, if anything it just would have reignited the war between east and west for trying to implicate people in the shooting. The purpose was to show that behind the persona of Big Poppa was a real person, a person that loved and was loved by many people. Honestly its silly to be upset about the fact that it doesn't tell you who shot Pac, or B.I.G.,why diminish from the memory of either by using Biggie's life story to speculate on something that no one but those responsible, knows the answer to ? Also Pac, though I am a huge fan of his music as well, is just a supporting character, this movie wasn't about him, it was about Christopher Wallace, the man, the son, the father and the husband. I get sick of people making comments with no basis or foundation. Of cours things are going to be left out, it's inevitable,seeing as how you can't fit 24 years of someone's life into 2 hours of film, they put in the parts that were relevant to the story of how he came up, his brief career which introduced him to us all, and his tragic ending. I for one was touched, I bobbed my head, I laughed, I reminisced and I cried, and for 1 movie to evoke that many emotions, I say it's a job well done. I for one think B.I.G would be proud, so if you are one of those people that don't even like rap music, then here's some advice:don't even post a comment, better yet don't go see the movie, keep your negative comments to yourself. For those that loved B.I.G he was special to us, and deserving of his story being told just like anybody else who has left us and had their story touch our lives. He left a void, and hip-hop hasn't been the same since he left us. I loved the movie, and would gladly pay my $6.50 to see it again.","user":"cleon1-2","rank":[137,199]},{"title":"Never was a fan until now","rating":8,"date":"19 January 2009","review":"Back in the 90's as a teen, I never really got in to Biggie's music or lyrics. I never knew the correlation between he and all these artists like \"Puff Daddy\" Faith Evans, Lil Kim all came up together. I never understood how the East Coast West Coast feud got started.<br><br>This film gave me a new respect for Christopher Wallace. His intelligence and how he tied that in to his passion for music and lyrics. He had a dream as a child and in the end he achieved that dream of not just becoming a success as a performer, but a success as a father to his children, a good son to his mom, and a good man to himself.<br><br>I love that line in the move \"If you wanna change the world, First you've got to change yourself\"<br><br>Inspirational film, even if you're not a fan of his music or hip hop, you can still appreciate the story behind this man.","user":"jessmix","rank":[79,113]}]