[{"title":"Heart of the Beholder is the story, based on real events, of a man destroyed by persecution who managed to come back and achieve a measure of revenge.","rating":15,"date":"15 February 2006","review":"The Heart of the Beholder is the story of a dreamer who finally achieved one of his dreams: his own business, a chain of video stores in St. Louis, Mo, only to be driven out of business by a group of fanatics who are outraged when he won't remove The Last Temptation of Christ from the shelves of his stores. It is, as they say, based on real events. In fact, the movie was written and directed by the man himself on the advice, he says, of Robert Wise. Undertaking the project helped in his recovery process. At the time I write this, he is having trouble getting distribution for the movie.<br><br>This is a story that needed to be told. The trouble is that the movie isn't very good, more like a worse than average TV movie. The actors in the main roles don't quite pull it off. Michael Dorn in wasted in a small role. Greg Germann's performance is the best in the movie.<br><br>This is definitely a movie to see on DVD because all the background information is what makes it interesting. We learn that the most unlikely things depicted in the movie actually did happen. Freedom of speech is everywhere under threat so everybody should either see this movie or read about the story on-line.","user":"john_cberry","rank":[27,31]},{"title":"Excellent presentation of a controversial subject/","rating":8,"date":"10 October 2006","review":"Since this movie deals with the controversial issue of freedom of expression of even disagreeable subject matter, it is bound to elicit extreme views on all sides of the issue. HEART OF THE BEHOLDER successfully deals in a humanistic way with the controversy surrounding one business and it's belief in the free market system of making video tapes of commercial movies available for sale to those who were interested. This did not mean pornography, but rather several main stream movies that aroused objections because they dealt with subject matter that often challenged certain strongly held beliefs. While the movie definitely has a point of view, it fairly deals with all facets of the controversy and delivers an emotional impact in telling it's heartbreaking story.","user":"tedcordes","rank":[19,23]},{"title":"An Illustration of emotional/verbal terrorism","rating":8,"date":"13 January 2007","review":"When people's control issues get mixed up in their religion, then it is trouble for anyone who does not agree with their rigid, jargon based belief system. This is well illustrated in \"Heart of the Beholder.\" Well worth the viewing. The script, however, though chock full of possibilities, came off a bit shallow in the story-telling. I believe this was due to the fact that there is so much of the story to tell and you only have two hours to tell it. There are some great scenes throughout the film where each actor gets their moment to shine.<br><br>This is a great film to see on how NOT to behave as a Christian. \"Heart of the Beholder\" illustrates that fundamentalist terrorism exists in every religion. There is no 'right' in ruining someone's life, livelihood, or terrorizing their family and saying that God says it's okay. One cannot say that God is love and then behave with violence, verbal or otherwise, to prove it.<br><br>I happened to have seen \"Last Temptation of Christ\" when it came out in the '80's and found it a great film bringing home the fact the Jesus was human, he had doubts and he most likely went to the bathroom just like the rest of us. Funny how Jesus never terrorized people into seeing things his own way. His temper tantrum in the temple was based on the fact that the vendors had turned sacred ground into a market place. In that cast he became what one might call \"A Holy Terror,\" but never when he was teaching or healing did he behave with verbal/emotional/physical abuse. Neither should we.","user":"d-grogg","rank":[11,13]}]