[{"title":"good v evil","rating":6,"date":"21 September 2006","review":"Left in Darkness wasn't actually all that bad of a film. The description on the back left me very wary of what I was about to watch. The beginning was rather odd with the star as a little girl whose deafness to her grandfathers recommendations didn't bode well for a long life. The dreaded rape scene wasn't as horrible as I thought it would be, considering what some twisted directors have done with the subject. The story is about a woman who is raised by her grandparents after her mother dies giving birth and father disappears. She is killed at an animal house type of party by the typical drunken sociopath frat boys. She wakes up dead between heaven and hell and must fight for her soul using vague clues given to her by dead relatives and a guardian angel of sorts. It moves relatively quickly and has some good horror scenes. The editing was good and the camera work was good. The dialog was a little flat. The acting wasn't too bad and there were some seasoned actors in bit parts.","user":"wrlang","rank":[25,29]},{"title":"A real surprise","rating":8,"date":"19 December 2006","review":"I caught this on cable the other night, and to be honest I wasn't expecting much. You don't expect much from Zone Horror, not after a while - there are an awful lot of Z-grade turkeys on that channel, but occasionally they do come up with a gem, almost in spite of themselves. This film isn't quite a lost diamond, but it's not at all bad.<br><br>If nothing else, the writer and director have a bit of imagination. The plot goes like this: Celia goes to a party, messes about with a ouija board, then gets raped and murdered. Most films would take a drearily predictable tack at this point - Celia has to ensure that her killer is brought to justice, yadda yadda. You can see half a dozen movies with that plot on any given evening, if you really want to.<br><br>But this film takes another tack. Celia finds herself in something like Purgatory, a dangerous place inhabited by creatures who will eat your soul, given half a chance. By working through the ghosts of her past, and working with her 'imaginary' friend from childhood, she has to try to escape and get to, presumably, Heaven.<br><br>The bad news is that the budget was obviously about seven dollars. Purgatory is represented by something that looks very like suburbia, and there is at least one scene too many set in the front of a car. Parts of the plot are slightly repetitive, too, and the dialogue isn't particularly memorable.<br><br>But - and it's a very big but - everyone involved obviously cared about this movie. The acting is more than competent, especially from David Anders as the morally ambiguous childhood friend, who is a rarity in this type of horror film - a really interesting character. The movie whooshes along at a good clip, the plot actually makes some sense, and I found myself genuinely caring about Celia's plight, which was totally unexpected.<br><br>The most surprising thing, for me, was the the director of this movie also did a couple of truly horrible films that I saw recently, It Waits and Sasquatch Mountain. This movie is, thank God, in a different class to those cheese-fests. Hopefully this means that Steven Monroe is getting the hang of this directing business, and we can expect more like this in the future.","user":"mattbaxter72","rank":[18,21]},{"title":"Too Many Rules in the Purgatory","rating":5,"date":"15 March 2010","review":"On the twentieth-first birthday of Celia (Monica Keena), her friend Justine (Jessica Stroup) invites her to go to a party in a fraternity. Celia is still grieving the death of her beloved grandfather Joe (Tim Thomerson), who has recently died, and blames herself for the death of her mother in her delivery. In the party, she is drugged and gang raped; then she has an OD and dies alone in a bathroom. Out of the blue, she finds alone in the fraternity house and she is lured and attacked by Joe. However, her guardian angel Donovan (David Anders), who saved her life when she was a girl, explains the rules to keep the protection of her sanctuary and survive the massive attack of soul eaters. Sooner Celia finds that she is in a sort of purgatory and distrusts Donovan; further, she does not know who is telling the truth and how to reach Heaven. <br><br>\"Left in the Darkness\" has an interesting and original premise but there are to many rules to be followed in the purgatory where the lead actress spends two hours trying to discover who is really helping her and finding the way to the paradise. Monica Keena and David Anders have good performances in the lead roles. I have recently seen a movie with Jessica Stroup, but unfortunately her character has a minor but important participation. This film was released in Brazil directly on DVD by Flashstar Distributor and deserves to be watched at least once. My vote is five.<br><br>Title (Brazil): \"Terror na Escuridão\" (\"Terror in the Darkness\")","user":"claudio_carvalho","rank":[7,7]}]