[{"title":"Not as good as 11...Much better than 12.","rating":8,"date":"8 August 2007","review":"Normally the sequel to a movie is a let down. Especially if the first part was really good. I think that's what's happened with Ocean's 12 for many but l hope this doesn't mean that they won't be watching '13'.<br><br>I was happy to see all of the same characters and actors together again because that is one big cool cast. Not to mention Al Pacino...icing on the cake.Who could resist?<br><br>For those who are in doubt about Ocean's 13, i hope you're not affected by some bad reviews because history doesn't repeat itself with this one. It's got an interesting story and some fabulous actors and acting. Don't miss out.","user":"emrelanur","rank":[37,43]},{"title":"A lot going on, but nothing much happening....","rating":4,"date":"7 June 2007","review":"Ocean Thirteen's slick credit sequence, highlighting Brad Pitt in all his movie star glory and letting us all know that Soderbergh and his camera are up for some glossy fun, gets the heart racing in anticipation of a slick, sly heist caper on par with #1 and superior to #2.<br><br>But then, as detail upon detail is heaped upon the audience and increasingly silly machinations are put in place to ensure the casino-robbery plan works, it all starts to unravel until, burdened by its own only-in-the-movies logic, the film grinds to a halt just when it should be at its most exciting.<br><br>At the 80 minute mark, the film, in desperate need of a compelling story to kick-in, is still setting up the details of the heist. No tension has been created, no forward momentum is in place, no characters are established sufficiently to root for. Soderbergh is no doubt hoping the good will audiences have for his characters from the first film is still in place here (sorely tested in Oceans Twelve). And despite taking all this time to create a detailed if rather ludicrous heist plan, it then boils down to relying on coincidence rather than cunning for it all to work.<br><br>Clooney and Pitt still have the charisma and chemistry to make some moments enjoyable, but there isn't the zing in their banter that was a highlight of the first film. Other returning cast members - Matt Damon, Bernie Mac, Elliott Gould, Andy Garcia - are all reduced to plot devices rather than given any substance (I know this isn't meant to be a in-depth character piece, but gimme somebody to care about and not just ogle!). Best moments come from Scott Cann and Casey Affleck; most embarrassing from Don Cheadle. And though Al Pacino is suitably villainous as the bad guy, he's also the most interesting and compelling character in the film, making his ultimate downfall (which, lets face it, is no spoiler) a little bittersweet (I would've liked to have seen him slap Danny Ocean up the side of the head, if only to create a little spark in the film).<br><br>What is sorely missing is a strong female character. Julia Roberts provided it in #1; Julia and Catherine Zeta-Jones were the best things about #2. In O13, Ellen Barkin is reduced to playing Pacino's 2IC as a blindly-ambitious slut, and its awful. Other female characters are either casino-pit screechers or hookers, underlying the boys-own macho-ness of these films.<br><br>It does look great in parts - the set design and CGI work is impeccable - and Soderbergh, holding his own camera under the name 'Peter Andrews', shoots his cast and the locales sumptuously in deep, rich reds and golden tones. But at 122 minutes its a long slog.<br><br>With a triumvirate of blah threequels this American summer already clogging multiplexes, Ocean Thirteens only adds weight to the argument that if anything interesting or inspired is going to be done with the characters or plot in a franchise film, its already been done by the time a #3 is churned out.","user":"Screen-Space","rank":[129,170]},{"title":"Suave but a Bit Flat","rating":7,"date":"2 July 2007","review":"I liked \"Oceans 13,\" but I wanted to love it.<br><br>I love the handsome stars, the great clothes, the nifty sets, the music -- David Holmes' score is a really fun, retro trip back to 1965. I love the deadpan delivery of funny lines: \"I just bit into a pepper,\" a man says, when caught tearing up. I love the payoff when scams reach their climax.<br><br>But I wanted this movie to thrill me as the previous \"Ocean\" movies have, and, while it was a slick good time, it wasn't memorable.<br><br>There is less character development here than in previous movies. Ocean is not pursuing Tess. Linus has pretty much proved himself.<br><br>There wasn't the spectacular stunts as performed by Shaobo Qin in \"Ocean's 11\" or Vincent Cassel in \"Ocean's 12.\" \"Ocean's 13\" doesn't fully exploit Las Vegas -- we've seen this movie's Las Vegas before.<br><br>Al Pacino is kind of blah as the villain. I wasn't afraid of him; I just kept wondering why he had orange hair. Andy Garcia is more juicy in a smaller, ambivalent role.<br><br>The movie resuscitates the film career of Ellen Barkin. She looks spectacular: flat stomach, legs to die for, magnificent cleavage. And then what do they do? Humiliate her and make a bitter comment about how she is a woman \"of a certain age.\" \"Oceans 13\" would have been a better movie if it had made better use of this hot actress. A sex scene between her and the ever cool Matt Damon would have perked the movie up.","user":"Danusha_Goska","rank":[9,10]}]