[{"title":"Village of the Damned, Ship of Fools, call it what you will it was pretty funny.","rating":7,"date":"18 November 2005","review":"For some reason no channel shows these Comedy Central Roasts - or any Roasts, for that matter - in the United Kingdom, which is a little surprising because all-out p*ss-taking as a form of expressing love and friendship is far more a British attribute than an American one, one would have thought. Except for one thing: in England we would happily take the mickey out of someone in public for faults of character, mannerisms, and the odd misjudgement, but in the American version there really are no holds barred. The most egregious public faux pas, the idiotic past relationships or marriages, the crimes committed - *nothing* is held to be out of bounds for the proper Roast. However, I can see that the Comedy Central Roasts generally concentrate on comedians, and after all, how much mischief can a comedian really get up to? <br><br>This one is different.<br><br>The Comedy Central Roast of Pamela Anderson is the once-in-a-lifetime opportunity to see a room full of people who have between them plumbed the depths of human behaviour in terms of drink, drugs and, most spectacularly, sex, and rip the sh*t out of each other for it. When you consider that this Roast is about Pamela Anderson, her ex-husband is Tommy Lee and her closest friend is Courtney Love, the sheer quantity of character flaws and devastating incidents that are up for grabs for all present to take fullest advantage of is almost beyond conception - from the quantity of flesh remaining in Pamela Anderson's silicon, to the amazement of Courtney Love's debut as a stand-up comedienne - not that she's funny, but that she's standing up. And the Big Three aren't the only ones to get the treatment. Eighty-two year old Bea Arthur got up on stage at one point and read a portion of Pamela's novel that involved, well, an act not legal in all 50 states, let's say, and for the remainder of the evening she had to sit and endure jokes about her having a penis.<br><br>Talk of the male organ does bring me to the down sides of the show - there were far too many references to Tommy Lee's apparently inordinately impressive equipment, and there certainly was a tendency on the part of all the Roasters to talk more about Lee and Love than about Anderson herself, certainly as the evening went on. And the other downside was that Pamela didn't do that great a job with her Riposte, which had some good lines that unfortunately died on the stage - although the audience and the participants were being so raucous that they simply may not have heard them properly.<br><br>Overall, a reasonably hilarious showcase of really, really offensive comedy. Watch it if you can, as long as you have a broad mind.","user":"Clive-Silas","rank":[11,11]},{"title":"Very crude and definitely for adults, but outrageously funny","rating":9,"date":"3 September 2005","review":"This program had caught my interest weeks before its air date. Something about it appealed to me, although I didn't expect much. I thought it would be a cheap piece of exploitation - typical Comedy Central trash. To some extent, I was right. It's very vulgar, very crude, and very, very raunchy.<br><br>But I was surprised at just how funny it was. I was laughing so hard I fell off my sofa and almost cried - it's outrageous stuff. The comedians assembled for the roast are all very talented, and they each deliver their own speech - it's like watching a Greatest Hits compilation of various comedians delivering their best jokes.<br><br>The guests at the roast are quite famous faces. David Spade (through video communication), Tommy Lee, Andy Dick, Adam Carolla, Courtney Love, Anna Nicole Smith in the audience, Jimmy Kimmell, and so on and so forth. All very sleazy celebrities for the most part, they add to the program's raunchiness.<br><br>I was shocked by just how much they got away with. The jokes are some of the most explicit I've heard uttered on television - they were bleeped out the first time Comedy Central played it, but a lot of the stuff made it through - primarily the names of vital body organs.<br><br>My only problem with the show is that it's so sleazy it's almost a bit sick to find yourself watching it. And too much time is spent focusing on Tommy Lee's famous physical attribute - every comedian cracked a joke about his schlong and Andy Dick even simulated oral sex on him. It got lame after a while. A few days after it aired, Tommy Lee said, \"I got tired of all the jokes being about me. You know, it's for her, it's like...here she is, focus on her.\" And I agree with him, it got to be tiring after a while.<br><br>Nevertheless for the most part this is a very funny (if very, very crude) \"Roast\" and Pamela Anderson was a good sport through it all. She endured a lot of verbal humiliation and took it in good spirit.<br><br>I personally enjoyed most of it and even got a chance to see Tommy perform his new single from the album \"Tommyland the Ride.\" It's a really good song and it's a solid performance.<br><br>At the end of the day you may find yourself shocked by the content in this program, and perhaps you might even feel a bit ashamed to be watching it, but if you can ignore its crudity it really is one of the funniest programs ever aired on television - it attracted 16 Million viewers, one of the highest rated Comedy Central programs in history. Apparently word traveled fast.","user":"MovieAddict2016","rank":[20,23]},{"title":"The funniest roast Comedy Central has done","rating":10,"date":"17 February 2006","review":"The latest roasts on comedy central have been funny, but not memorable enough for a second viewing. Well Comedy Central has found a way to change that with the roast of Pamela Anderson. Oh Pamela you gorgeous Baywatch babe, she takes hits like I've never seen before on live television. And now with the release of this DVD you get to see the whole thing uncensored! Oh comedy central, you shouldn't have.<br><br>If you think you've seen a roast before .. you haven't seen anything yet. The Roast of Pamela Anderson had me rolling in the aisles the first time I saw it on Comedy Central a couple months ago. And as many times as they re-ran it, I tell you I couldn't get enough. Let me just mention some of the goodies found here: First and foremost Pamela, in a classy see through getup, handles herself oddly enough with class, dignity, and a smile. She is one heck of a lady. But its the guests that are the highlight. Lets first start with Courtney Love, a personal hero of mine! Courtney was detained shortly after this performance and sent into rehab, so its quite a laugh to hear her boast here of how she has been clean and sober for a year! Clean and sober she is not, funny as hell she is. She is the scene stealer here, and the other comedians take more joy out of poking fun at her than even Pamela at some points. All of which are hilarious, and watching Courtney react and flail and fall about, is certainly something that needs to be re-watched over and over again. We get Bea Arthur reading excerpts from Pamela's book. Can you say brilliant? Who woulda known Bea Arthur would come out of hiding to roast our lady of the hour? She delivers the double-whammy when she reads aloud one of the \"sexiest\" scenesof the book. We have the always hilarious Sarah Silverman doing what she does best. She has had one hell of a year what with her movie \"Jesus is Magic\" her cameo in \"Rent\" her part in \"The Aristocrats\" and showing up at many roasts. Here she does herself proud poking fun at Pam, Courtney, and her boyfriend Jimmy Kimmel to name a few. Andy Dick takes a feel of Pammy's assets, and confuses an audience again with his sexuality. Tommy Lee is on hand. Which is great because he and Pam are like the couple never meant to be together, but somehow you just root for them. Although they aren't together as of the taping, it is cute to watch them take jabs at each other. The self proclaimed \"Queen of Mean\" Lisa Lampanelli delivers perhaps the funniest bits near the end before Pam herself gets her revenge.<br><br>Pam sat through the hell of a roast all for charity, PETA of course, which she is known to support avidly. (even protesting at KFC's .. she is quite devoted, and I think she should be commended for it). So with the cast of Jimmy Kimmel, Tommy Lee, Adam Carolla, Eddie Griffin, Sarah Silverman, Jeffrey Ross, Nick Dipaolo, Andy Dick, Greg Giraldo, Bea Arthur, Elon Gold, Lisa Lampanelli, Lady Bunny, Courtney Love, even Anna Nicole Smith (in the audience) and of course Pamela herself, it is a star studded hilarious event.<br><br>And now you can own it and rewatch it over and over. Who wouldn't want to see Courtney Love take a pratfall right at the moment when Pam gets up to deliver her speech? And the DVD features a ton of bonus features which are equally as exciting. There's footage from the rehearsal, there's outtakes from the show, there's stuff from the red carpet (hillarious), and more. So overall I'm giving this 4 stars. It is the funniest thing you will find on DVD this month. So if you're in need of a laugh, or a fan of any of the comedians or musicians on the DVD, this is a must have. Check it out, you wont regret it.","user":"RoxyScary","rank":[4,6]}]