[{"title":"This movie is full of holes and none are black","rating":2,"date":"11 June 2006","review":"1. Poor acting - at the very least poor depiction of what should have been strong emotions such as living without children, scared, etc. Lead character acts as if he just woke up <br><br>Disconnected or no flow at all - such as characters making statements about research they did that they never had time to do (because they spent all time driving or running around)<br><br>The \"black hole\" would not behave at all the way it did in the movie. Suffice to say that there is no \"Science\" in this fiction.<br><br>The whole army behaves like it is in a war with another ... human army. Hiding behind walls, carrying guns, etc.<br><br>The only reason I gave it a 2 and not 1 is that it could, nevertheless, be amusing to watch how people have no clue what they are talking about.<br><br>Stupendous.","user":"asusnjar","rank":[40,47]},{"title":"Black hole has lunch in Missouri","rating":4,"date":"12 June 2006","review":"I knew from the trailers Sci-Fi channel was showing that this one would be totally insane. I watched anyway, figuring it would be at least good for some kitschy comedy, and a chance to see my home town of St. Louis get ripped. It did not disappoint (at being insane, that is).<br><br>A black hole is created artificially in a lab, but the black hole itself is not the only menace, as a strange electrical energy entity (that zaps people into oblivion) hitchhikes with it. This creature was actually kind of a creative plot device, since the movie really didn't seem to know what to do with the black hole other than devour stuff. Since there is a famous landmark in St. Louis, it's pretty obvious where the black hole goes for lunch (always moving along the ground in a 2-dimensional manner, by the way). As for the creature, it was utilized in some intriguing ways; but the explanation of its nature and intent was insufficiently developed, and could have been explored more.<br><br>Most everyone is at least somewhat familiar with basic scientific theory regarding black holes, and therefore will see a myriad of scientific absurdities, but if you view this silly nonsense without taking it seriously, it can be fun to watch. Toss disbelief into the black hole; or just play a game of \"find the goofy science\" as you watch.<br><br>The actors, given the weird script, really do approach the thing with urgency. When the scientist hero describes his quantum physics theories, you almost want to believe the offbeat premise of this movie. But then another bizarre thing happens and you're laughing hysterically again. There are the usual ploys and clichés: divorced dads, military that wants to use nukes, rogue scientists, TV news reporters doing play-by-play of destruction, etc.<br><br>Watch for loony amusement only. Science has been imploded in this \"Black Hole.\"","user":"MartianOctocretr5","rank":[26,31]},{"title":"Inconsistent waste of time","rating":1,"date":"26 April 2008","review":"I am not going to waste too many words on this simply horrific movie.<br><br>The only thing that matches the poor acting the inconsistency in the time line and story telling.<br><br>The Arch which is supposedly torn down by the black hole... can be seen standing in the background near the ending.<br><br>Additionally.. if they shut down the power... the city lights would've been out. While even at the very end all the lights are still on. Which makes me think... if you know the creature absorbs energy... turn it off straight away! The only thing going for this movie is the alien if self, which doesn't look too bad.<br><br>Avoid at all costs if you can.","user":"Emile_Verwaaijen","rank":[12,13]}]