[{"title":"Better than I expected","rating":7,"date":"3 October 2006","review":"I know I saw the 2001 Italian original, but didn't remember much about it until I saw Tony Goldwyn's remake and the scenes and story came back. And it then surprised me how much of the original I managed to remember. That's also possibly because Oscar-winner Paul Haggis' screenplay sticks awfully close to its Italian origins.<br><br>I am a fan of Zach Braff's work. \"Scrubs,\" for my dough, is the best half-hour comedy on TV and his directorial debut, \"Garden State,\" was one of the best films of 2004.<br><br>\"The Last Kiss\" is not a romantic comedy by any stretch of the imagination, no matter what advertising campaign the studio launched. This is a well-acted, well-told story about the dumb things we men do to the women we love. And, of course, the consequences.<br><br>The film delves deeply into the insecurities of its characters, never offering pat answers or easy resolutions. There are no Richard-Gere-climbing-the-fire-escape-to-get-Julia Roberts moments in the film.<br><br>Braff plays Michael, a 30s man facing the harsh reality that the rest of his life has been plotted out and he longs for something different. Despite having a gorgeous fiancée Jenna (the lovely Jacinda Barrett), he finds temptation around the corner.<br><br>The film balances its three subplots well. They never interfere with the Michael-Jenna saga, yet add to the complexities of the story.<br><br>However, I found it interesting that while in the Italian film, the object of the protagonist's desire was a high-school Lolita, Haggis and Co. opted to make her - in this case, Kim (Rachel Bilson) - a college student. The Italian film tends to be a bit more potent on that level, though Michael's attraction to Kim is believable.<br><br>The performances all find the right pitch. Braff is completely believable as the confused young man in search of meaning to his life. Barrett is heartbreakingly good. There also are some terrific supporting performances from Casey Affleck, Blythe Danner and Tom Wilkinson. Then again, when was the last time you saw Wilkinson perform badly?<br><br>Couples should see this film. It's a mature, thoughtful, unpretentious, and sometimes even difficult, movie to see. But it is gratifyingly good. Don't go expecting a typical fluffy date movie. This film raises interesting and important questions about couplehood and then lets you figure out the answers. When was the last time a Hollywood film did that?","user":"anhedonia","rank":[85,94]},{"title":"'The Last Kiss' is one of the better movies dealing with adulthood","rating":12,"date":"12 July 2007","review":"The Last Kiss; Michael is a frustrated architect on the brink of turning 30, who's spirits are dampened when he begins feeling as if his life is formulatic and planned. At a good friend's wedding, he meets Kim, a beautiful and charming college student. Michael's uncertanties with his fiancée Jenna lead to an unexpected affair with his new collegiate. However Michael is forced to deal with the consequences of his actions when his secret spills.<br><br>The Last Kiss is a very good movie, although you're likely to be depressed leaving the theater if you are under the age of 30. Smart, engaging and honest, along with incredible acting and dead-on dialogue add up to a penetrating, insightful melodrama that isn't afraid to pull the punches.<br><br>The movie is undeniably sad, but it's a certain type of sad in which you will probably find it hard to look away. The characters are interesting, flawed people just like you and me, and everyone stumbles onto something interesting from scene to scene.<br><br>4 from 5","user":"moviesfan11","rank":[25,30]},{"title":"Not Quite Garden State 2","rating":7,"date":"11 September 2006","review":"Don't necessarily expect to see the next step in Andrew Largeman's life. While the trailer makes you think \"Hey, it's Zach Braff playing another guy who is confused about his life, and not sure where to go from here\", The Last Kiss does offer a little more. For one its much more mature, and the characters are all flawed (and not in cute 'Natlalie Portman lies to get people to like her' ways) and they are all real. The performances were far better than i expected, the entire cast shines. The movie succeeds in appealing to everyone. No matter who you are and what state your romantic life is in, you will find someone to relate too. <br><br>Jacinda Barrett finally gets to show some acting skills, and comes through beautifully. Casey Affleck is great. Zach Braff makes me understand why he wants something different, despite the fact that Jacinda Barrett seems so lovable. And the biggest surprise is Rachael Bilson. Early on she seems as if she is playing Summer Roberts on the big screen, but as her character unfolds she simmers with sex appeal, and was able to break my heart with just a simple gesture.<br><br>The Last Kiss succeeds in letting its actors shine, and if anything you should see it for its great soundtrack.","user":"merkfosta","rank":[129,178]}]