[{"title":"The story has depth, poignancy and surprise which will grab hold you and won't let go throughout the film.","rating":8,"date":"1 August 2017","review":"This movie has some shades of a Woody Allen film in its character studies of people and in capturing the atmosphere of Manhattan. It examines family and sexual relationships between a husband and wife as well as extramarital love and sex. It looks at a young man's struggle with his sexual and romantic feelings. This is a psychological drama that highlights guilt, jealousy and even an important aspect of the oedipal complex. It is complicated and heavy stuff and it all flows from the pen of screenwriter Allen Loeb, who had written several successful movies before this earlier script ultimately came to fruition. This didn't happen until Marc Webb became attached to it as director and a terrific ensemble cast was put together which includes Jeff Bridges, Pierce Brosnan, Cynthia Nixon, Kiersey Clemons and Kate Beckinsale. However, the character who ties the plot together is relative newcomer, Callum Turner, who plays Thomas, the 25-year-old son who ultimately makes deep seated discoveries about himself and each of his parents before he can move on with his life.<br><br>This is the type of movie that will capture your attention and make you ponder each character's motivation. The story has depth, poignancy and surprises which will grab hold you and won't let go throughout the film. It certainly kept us thinking and talking as we left the theater. (2017) – Scheduled for release August 11th. FilmRap.net","user":"mblumenfield-02427","rank":[55,71]},{"title":"Contemporary indie version of a Woody Allen movie combined with The Graduate","rating":8,"date":"11 October 2018","review":"Thomas Webb (Turner) is a spoiled rich millennial who is trying to figure out what to do with his life after college. While searching for life answers around mysterious neighbor (Bridges), he learns that his father (Brosnan) is cheating on his mother (Nixon) with his assistant (Beckinsale). \"The Only Living Boy in New York\" is a movie full of characters you would walk away from at a cocktail party, engaging in the flattest brand of smart banter imaginable. Turner is a very irritating person as Thomas, while film's main draw should be Bridges. He's a phenomenal actor, but his roles get too cliche, wasted and reduced to portraying a stereotypical cigar-toting old man who has a thing or two to tell the young ones. Brosnan is a surprising standout, his burst of anger and subsequent sadness during one pivotal scene conveying more years of back story in mere minutes. \"The Only Living Boy in New York\" have fantastic cast, looks good, but it's not particularly distinctive because it was playing safe in the end when It could be a little more daring and dangerous. In general, it is definitely an odd story with a twist, but I did enjoyed (most of) it. 7+/8- from 10.","user":"akcenat","rank":[11,12]},{"title":"An unexpected and truly satisfying night at the movies.","rating":10,"date":"19 August 2017","review":"Zounds! Thank heaven I didn't see another site's 31% rating before I went to a WGA screening of \"The Only Living Boy In New York,\" because I might have given it a pass. I LOVED it! I'd give it a 99.9% rating (after all, nobody's perfect). What a joy. Allan Loeb's intelligent and serious script is liberally sprinkled with laugh-out-loud lines and Marc Webb's masterfully fluid direction is stunning. Like watching a French film I almost expected subtitles. Webb made love to New York as if it was Paris. Flawless casting, Jeff Bridges is brilliant. Stellar performances all-round. Wonderful title sequence. And that fantastic sound track—thrilling! See for yourself.","user":"teakyew","rank":[48,70]}]