[{"title":"I enjoyed this movie","rating":8,"date":"23 February 2020","review":"This third installment is just as long, fixes some of the damages but adds along new ones. At Worlds End improves on its CGI magic but still possesses that dragging story that is just too long and confusing.","user":"MR_Heraclius","rank":[37,38]},{"title":"Good conclusion to the series, same problems as the 2nd","rating":7,"date":"28 May 2007","review":"AWE was a decent close to the trilogy (although they did leave it open for the possibility of a 4th).<br><br>Lets go down the list: 1) Holy cow. The CGI is breathtaking. The details on the sets is just as breathtaking. The filming sites were beautiful. These are a talented group of folks I tell ya. GREAT job.<br><br>2) Acting .. both good and bad. Sparrow, Barbossa, Beckett, Norrington, Jones, and Gibbs provided some very good acting and funny moments. However, they were offset by Pintel and Ragetti (they got annoying in the 2nd film and it didn't stop here. While I enjoyed the idea of Tia Dalma's character, I wasn't impressed with the performance by beautiful Miss Harris. I haven't especially liked Keira all that much in other things she has done and it was the same here. Decent actress but not overly impressive. Stellan's portrayal of Bill Turner was decent enough but a notch down from what we KNOW he can do. Now the best for last. Im a 100% hetero male and even I can say that Orlando Bloom is a VERY good looking guy. But for the love of pete, this guy is one of the most terrible actors ever and strangely, he was cast in two of the biggest, most profitable trilogies ever. He has essentially played the same character in every movie, just with different costumes. His mannerisms, his low \"sexy\" voice, his facial expressions .. ALLLL the same, all the time. Sooo blahhhhhhh.<br><br>3) The story was good but there was too much of it. It has been said here but I will say it again. At one point, I just stopped trying to follow along and just enjoyed it. Everyone stabbed everyone else in the back at least once. It wasn't \"hard to follow\" but a movie like this isn't supposed to make you think. You want that, go see .... Clue :P the whole Singapore thing was just unneeded. While it did add a new element to the film, it just seemed too forced.<br><br>4) Running time was a tad bit long but it passed fairly quickly due to the great action sequences.<br><br>All in all .. I was impressed with the movie, but it has its problems. Much like part 2.<br><br>I say go and see it. You wont be disappointed but you wont walk out thinking you just saw a masterpiece either.<br><br>Just my thoughts ...","user":"tough_guy007","rank":[156,223]},{"title":"At World's End","rating":8,"date":"30 May 2007","review":"The more I think about this movie, the more I like it. This is strange, considering my low expectations. The first film was fun, and I was very happy to see swashbuckling returning to movies, but I never really bought into the script. I wasn't convinced that pirates were some sort of blood-bound \"race\", and I was powerfully confused by the distance between and physical relationships of various locations. But, still good fun. The second film just kind of made me mad; I loved the ending, but it was just one example of how much it was a standard sequel: every single quirk of the first film was referenced, every single character had to return, and it HAD to be structured - nay, plotted - like Empire Strikes Back. This included re-introducing the Han Solo-Leia love story where the female lead wants the anti-hero, just to appease all the screaming Johnny Depp fans. It begged to be liked, but aside from a great score, great effects, and some very funny moments, it just came off as trite.<br><br>And then we get At World's End, which has everything you could possibly want in a pirate fantasy film: Legendary ships riddling each other with cannon fire in a whirlpool, screaming buccaneers swinging from one ship to the next, sword-fights on crow's nests, and all that in about fifteen minutes. The rest is an admittedly convoluted story that is much more clearly plotted than the second film, while still taking breaks for letting us spend time with characters we weren't so sure about last time, but are once again fond of. Maybe it's Geoffrey Rush as Barbossa, or the overall simplicity of the plot, but it just worked, and I had a great time.<br><br>I was legitimately surprised and concerned at what the plot did with our heroes and villains, and was very satisfied with everyone's status in the end. I guess I wouldn't mind seeing another Pirates movie now, but I kind of think everything that needs to be done is in this film.<br><br>I can't wrap up without mentioning the very nice abstract stuff Verbinksi and co. did with the journey to Davey Jones' Locker. It takes guts to do really surreal stuff with a $300 million Happy Meal blockbuster, but they really did some new, interesting things with their bottomless bag of tricks.<br><br>A- Curse of the Black Pearl: B+ Dead Man's Chest: B","user":"Joe Fixit","rank":[41,55]}]