[{"title":"What have you done?!","rating":1,"date":"2 August 2006","review":"I was so excited about this film. I absolutely love the books, and although the trailer of the movie implied a few silly changes had been made, I still thought it would be true to the heart of the book.<br><br>What a travesty. From the moment it began I knew that being a fan of the book was not a good idea. Alex Pettyfer is not Alex Rider. Since when was Alex Rider actually particularly good at being a spy. In the film, he's already far better than any spies MI6 have to offer before he goes to training. HE'S MEANT TO BE RELUCTANT. The training camp is supposed to be a huge task for him, but apparently falling off a zip wire to music by the Gorillaz is a tough training programme. <br><br>The characters became gimmicky and ridiculous, they were like cartoon caricatures. Jack Starbright is not some kung-foo, puffer-fish loving idiot that she is in the film. Alicia Silverstone is wooden and irritating. Alex Pettyfer spends the entire duration of the film content with the fact he looks good, and doesn't feel the need to really look upset or happy or anything when these kind of emotions are required. He basically sat back, had a few facial shots of him looking moody filmed, and let his stunt double do the rest. Smithers - Stephen Fry what are you doing?? He was sarcastic and moody, he's meant to be practically the only jolly person Alex meets. And MISSI PYLE MAY JUST BE THE MOST IRRITATING ACTRESS EVER. WHAT WAS SHE DOING?!? If at any time the film started to redeem itself, she'd come on stage and run into something and say something in her ridiculous accent (By the way, that entire sequence with Jack and her made me want to walk out). <br><br>Everything was wrong. All the suspenseful moments from the book - Alex swimming under water in the mine, the jellyfish scene, the quad bike scene (which wasn't even in the film, and is one of the best scenes in the book), EVERYTHING, was just rushed and ruined, and linked together with bad one-liners such as, \"what is this, Hogwarts?\"<br><br>Utter, utter farce. If you are a fan of the book, do not waste your money. The Alex Rider films will certainly not be getting any more of my money.<br><br>READ THE BOOKS!","user":"jrt_joe","rank":[64,81]},{"title":"Enjoyable but a bit too light-hearted","rating":5,"date":"13 August 2006","review":"Book adaptations rarely capture the excellence of the novel which they are based upon and though the same can be said for 'Stormbreaker', it still is a rather good film considering the fact it is mainly aimed at the pre-teen and young teen audience.<br><br>Based on the first of Anthony Horowitz's 'Alex Rider' novels, the story is centred around orphaned fourteen-year-old Alex Rider who lives with his Uncle Ian, a man who his nephew assumes is a dull bank worker but is in fact an MI6 operative. When Ian is killed on a mission, his superiors are determined to recruit Alex to break the case. Pressured into complying, Alex is trained at an SAS-type camp before being sent undercover to discover the true intents of psychopath Darius Sayle, who is planning a nationwide release of computers he has dubbed Stormbreakers.<br><br>In his big-screen debut as Alex Rider, sixteen-year-old Alex Pettyfer was a shade too old for the role (he was as tall as most of the adult cast, which took away the shock his role as a child thrust into danger). However, although he did have lapses where his performance turned wooden, he was quite successful in bringing the character to life, depicting Rider's determination, anger and cockiness well. It's just a shame he was no-where near as good as he proved himself to be in 'Tom Brown's Schooldays'. Mickey Rourke was great as the unhinged and vengeful Sayle, his real-life disastrous plastic surgery only enhancing his character's crazed nature. It was Pettyfer and Rourke who carried the bulk of the film but their co-stars, including Ewan McGregor, Sophie Okonedo, Robbie Coltrane and Stephen Fry, made their presence known despite having minor roles.<br><br>The fight and action scenes were nicely performed and depicted a suitably odd feel by conveying the fact it is a boy in the heat of the battle. I also enjoyed the homages to James Bond such as how the main credits at the start exploded onto the screen and how Mr. Smithers nicely complimented Bond's Q. And it was also change for the better to meet Ian Rider as he is already dead in the beginning of the novel so we never really get a feel of what his character might have been like (although we could have done without the stereotypical busy father-figure/neglected child scenes).<br><br>However, there were numerous low points in the film. I love Bill Nighy and he did give a good performance as MI6 boss Mr Blunt but the character just didn't come across right. He was too slapstick to properly depict the cold edge to Mr Blunt, a man who doesn't think twice about sending a child into the line of fire. The change to the character of Jack Starbright was also annoying. She isn't meant to be a karate expert nor does she ever become directly involved in Alex's missions so there was absolutely no need for the fight scene. It was quite irking to see the script was poorly handled in terms of keeping Alex's role a secret. Instead of both MI6 and Alex himself taking great care to ensure no-one ever learns of his part in bringing down Sayle, he's all over the news in the film and even his little girlfriend knows the truth. It ruined the idea that if recruiting Alex as a child spy became public, it would be humiliating for MI6 and disrupt whatever chance of normality Alex tries to harbour for himself.<br><br>For a first outing though, 'Stormbreaker' was enjoyable and would probably please young members of the family as well as parents dragged along. However, the unnecessary humorous touches to the film will very likely leave many older teens and twenty-somethings wanting a bit more 'meat'. Hopefully when they adapt 'Point Blanc', the darker edge that makes the novels so addictive is retained.","user":"cosmic_quest","rank":[59,77]},{"title":"Action packed fun for older children and adults","rating":9,"date":"18 July 2006","review":"I was at the World premiere in London and I was apprehensive about watching a film adaptation of a book as some of them work and others don't. This one definitely does. From the first minutes of the film, you know that you're in for a thrilling adventure. Alex Rider, played superbly by Alex Pettyfer, is very believable as a school kid thrown into the deep end by Bill Nighy who hams it up brilliantly as spymaster Alan Blunt. Alex Rider is a deadly weapon on two legs as you'll see as the film progresses. Marvellous Micky Rourke, plays the evil villain who keeps a very unusual and deadly pet and looks as if he's just stepped off the set of a Revlon ad (you'll see!!). There's lots of action, some love interest, but that's not overplayed and although some of the evil characters look as if they've been loaned out from Cirque Du Soleil, including Micky Rourke, they play their parts as they should be, comically but with a twist of evil thrown in. It all works very well but Alex Pettyfer is a revelation. He plays the part coolly, calmly and with a great deal of conviction. I think Sean Connery would be proud of him. The film throws in a few James Bondesque clichés and there is one scene in the film which will remind you of a particular person from Goldfinger !! All in all highly enjoyable, my 11 year old niece and 14 year old nephew and their friends really enjoyed it and I think you will too.","user":"lyndon_gray","rank":[100,153]}]