[{"title":"You may not Believe it, but I REALLY liked it.","rating":8,"date":"29 August 2008","review":"Disclaimer: Let me start by saying that I was neither drunk nor high when I watched this movie. I watched it stone cold sober, alone, in my living room.<br><br>Amazingly I just gave an Uwe Boll film 8 stars, I know, I can't believe it myself. If I were twelve years old and still read MAD Magazine I'd probably have given it ten stars.<br><br>There are plenty of \"zany\" pop culture riffing movies out there, (Meet the Spartans, Super Hero Movie, Date Movie, etc.) but the difference here is Postal works. I laughed throughout the entire movie, with the exception of about seven jokes which didn't make sense or just didn't work. But it doesn't matter that these seven jokes failed because the movie is an endless stream of jokes, sight gags, bikini clad cult members, machine gun battles, and bad taste in the vein of John Waters/Troma Films earliest efforts.<br><br>It's too bad Uwe Boll got himself involved in a petty internet pi**ing contest over this film. I think had he just been modest, kept his mouth shut, and let the film speak for itself it may have been a minor success. The old Hollywood saying about there being \"no such thing as bad publicity\" doesn't work for you when all you get is BAD PUBLICITY. <br><br>That said, the only real problems with the film are the low budget production values and a few of the minor performances, but even those problems just add to the humor of this film. <br><br>The plot actually made sense.<br><br>The actors played it straight without being too zany too often. <br><br>And the jokes, although in bad taste and definitely not for everybody, were never so mean spirited that I was turned off by them.<br><br>I think Uwe Boll knew what he was doing with this picture. The satire and parodies worked well, and there were even a few jokes that made me want to cheer. I know, crazy huh?","user":"U8RU486","rank":[128,159]},{"title":"Funny as hell","rating":8,"date":"30 May 2008","review":"I don't understand the bad reviews of this film. People complaining about how its not true to the games have obviously never played Postal 2. This movie is probably closest video game adaptation that I have seen. It is completely true to the theme of the game.<br><br>I watched this film at the premier and actually had a chat with Uwe Boll before the film started. He came out right before the film and made a 10-15 speech that consisted mostly of him tirading about how Bush is an idiot and even more about how he hate all the reviewers that give him bad reviews. I think he must have self esteem issues to come off like that against the reviewers.<br><br>Anyways, this movie is very funny, if you're into this sort of movie. Obviously if you hate Uwe Boll or are totally politically correct or are easily offended, then don't watch this movie. For people like me that like dead baby jokes and are pretty much desensitized to everything, this is a gold mine of comedy.","user":"fraggle_rock_123","rank":[175,245]},{"title":"Postal: Boll's \"Best\" Movie","rating":7,"date":"28 August 2008","review":"Now we all know Uwe Boll's track record when it comes to movies, but even more so when it's applied to video games. However, in the case of Postal I have to say I was rather surprised because the movie possessed this subtle flair of the game. While watching it I felt it was trying its hardest to be as true to the game as it could. It has sick and pointlessly funny humor both political and sexual, and it has a ridiculous plot that feels like something right out of the game. Perhaps the one thing Boll does well in Postal is the bumbling collection of Muslim terrorists who are apathetic about the whole \"Jihad\" thing and they are quite funny to watch as they goof around. I guess what makes Postal the movie special is the collection of little silly Easter egg-esquire instances that will just make you chuckle. Like the Postal game, the movie deserves its due because it is a novelty among movies. Regardless, it's Boll's \"best\" work.","user":"Bocklocke","rank":[49,64]}]