[{"title":"Not Just Another 'Team Sports Cure Every Evil' Film","rating":8,"date":"19 January 2007","review":"It seems like the past few years have seen a run on sports films that demonstrate the power of learning sportsmanship on a team level can alter the lives of the misbegotten youths suffering from the angst of society's perceptions. We've been through soccer, baseball, tennis, dance, track and football: GRIDIRON GANG uses football as the pivotal point, but due to the presence of a fine script by Jeff Maguire who adapted Jac Flanders documentary film, and cohesive poignant direction by Phil Joanou who knows how to move a large cast around and keep it personal, and most of all due to the overpoweringly fine performance by Dwayne 'The Rock' Johnson this film is so honest and uplifting that it doesn't leave a dry eye in the audience.<br><br>The story is well known: Probation Officer Sean Porter (Johnson) is frustrated that the boys in his camp for young criminals when released to the streets show 75% returning and a large number dying in gang related violence. He sees this trend as being due to the lack of self-esteem in kids whose lives outside are demeaning and encourage failure. He gathers support from his fellow workers Malcolm Moore (Xzibit), Paul Higa (Leon Rippy) and Ted Dexter (Kevin Dunn) and gradually builds confidence in his project to organize a football team of his inmates. We wisely get to know the background of a few of the more difficult incarcerated boys, a fact that makes the project more full of tension and understanding of the problems to be resolved. Though most of the cast are unknowns, they are fine actors in this film: Jade Yorker, David V. Thomas, Setu Taase, Mo, James Earl, Trever O'Brien, Brandon Mychal Smith, Danny Martinez, Joe Seo, and Joey Lucero.<br><br>Through the team's growth as a unit they confront and manage to cope with problems and grow into goal-driven, good spirited young men. The presence of Dwayne 'The Rock' Johnson is stunningly underplayed and all the more powerful for it. This is a sensitive performance that places Johnson in an all new category of respect as an actor. The film is overly long (120 minutes) due to repeated games the team plays and for devotees of Football that will be a positive aspect. But far more important than the games is the quiet growing of trust and faith that shows in the faces of this fine cast. Recommended viewing, especially for those who think they have seen too many sports related do-good films! Grady Harp","user":"gradyharp","rank":[50,51]},{"title":"The Rock does a fine performance in Gridiron Gang","rating":8,"date":"15 September 2006","review":"As I watched the end credits and saw documentary footage of the real Coach Sean Porter and discovered he had lighter skin than The Rock, I thought, oh well, at least there was no discussion of racism in this movie. Skin color aside, The Rock did a fine performance in the role of a coach who wanted to show his juvenile delinquents what teamwork and discipline are about through football. From their first play with the Panthers to the first playoff game with the same team, this movie makes you cheer or cringe with every move that comes. There's also gritty footage of life in the streets in the beginning and the aftereffects during some games. Overall, though, it's not unlike some other inspirational sports films like the recent Invincible that shows victory in the end. So if you don't mind another feel-good football sports movie, I highly recommend Gridiron Gang!","user":"tavm","rank":[47,48]},{"title":"breaking the ties that bind you","rating":9,"date":"25 January 2007","review":"i feel compelled to give this film a 9 and almost rated it a ten. It isn't original; it isn't award-winning craft or direction. The football scenes weren't that good. I'm not sure The Rock has improved or expanded his range as an actor or not. But this film is based on true events, and inspires a great deal of optimism for the nature of mankind. There is a sincere desire for reform and redemption as a mission here, by a penal institution no less. It is less punitive and more on the side of these kids who end up in the court system. Many of us don't consider ourselves to be \"criminals\", and yet, by definition, most of us have broken the law at some point in our lives. Perhaps they were for what might be considered minor infractions, such as coasting through a stop sign, or not declaring something at the airport. But they are still crimes. The big difference here, is, most of us don't get caught. And even if we do, many of us can escape a prison term. We are, after all, human. I really appreciated this film for it's compassion; it's desire to build self esteem in a person and give them a real shot at a fulfilling life; to turn their lives around. It went for a sincere attempt at eradicating recidivism and portraying \"locked up\" kids as complex human beings who want a better life. kudos to Grid Iron for that. Am i a bleeding heart? maybe. And if i am, so what? Better to give someone a chance for redemption than to shut them up and turn your back.","user":"pookey56","rank":[41,42]}]