[{"title":"There WAS a point.....","rating":7,"date":"9 April 2007","review":"To keep it brief the movie was just OK for me although there were a couple of decent performances. As a southerner I always hate it when I hear overly exaggerated Southern drawl. It's like fingernails screeching down a blackboard to me. In retrospect I quite liked David Morse' character. In my opinion he took far more risk than Ms. Fanning as the \"addled\" father. We also got a glimpse of the gifted singer Jill Scott. <br><br>What was the point? Simple. Music can be used as a conduit for healing when no other options exist AND that there is less difference between white and black than there is between rich and poor.<br><br>You had to watch the whole movie, pay attention and understand that the rape scene was part of the set up for the true message and not the point of the movie itself.<br><br>I could ramble on......but I won't.","user":"davidfrazier42","rank":[38,52]},{"title":"A comment from someone who has seen the film","rating":10,"date":"26 January 2007","review":"I just watched the final Sundance screening of this film earlier this evening. It was excellent. I found it to a highly emotional film with a very powerful message. Also, Dakota Fanning has a beautiful voice for someone who had never sang before filming began. Not beautiful as in technically perfect, but beautiful in the way it conveyed the emotions of the character at the time. Just to clarify for all of those who haven't seen it, there is no pornography in this movie. In fact, Utah's Attorney General watched it for himself, and said that it does not break any laws and contains no child pornography. Please withhold judgment until you have actually seen it.","user":"rebelgyrl05","rank":[105,175]},{"title":"Ultimately very disappointing.","rating":4,"date":"24 January 2007","review":"This is a bad film. It is not really Dakota's fault, but to be honest I wasn't really impressed with her this time around. I felt like she was a little too much, a little too melodramatic, and definitely not as real as she is in her other films. The real problems with this film lie in the directing, the script, and the pacing. It's poorly filmed (though beautifully lensed), the script panders to too many stereotypes to even enumerate, and even though it's very short, it crawls along.<br><br>All the controversy about the rape is unfounded, too, because it actually is only a very small piece of the movie. You see her face twice and her hand once, and you hear her. I'd say it was 45 seconds. Maybe not even that long.<br><br>Anyways, color me disappointed. Definitely not worth all the hype, and I really wish Dakota could have found a better filmmaker(s) and film(s) during all the time she wasted as this film sat in preproduction. I hope this doesn't affect her career too much.","user":"MattD12027","rank":[107,181]}]