[{"title":"Good Fun but Flawed History","rating":8,"date":"16 October 2007","review":"Overall I enjoyed the movie. There have been too many recent films about the Tudors and Elizabeth in particular, but this film looks good and it keeps you entertained. It's set at the time of the Spanish Armada in 1588. Elizabeth is shown as tough, smart, and married to her country. She also suffers from bouts of insecurity and irrational jealousies. This film is more hagiographic and melodramatic than its predecessor. <br><br>The film tends to ignore the facts when they get in the way of the story. Elizabeth was 55 at the time of the Spanish Armada and she was never a looker. Blanchett's Queen is youngish and attractive. Blanchett's acting performance is powerful and impressive but also a bit stagy. The way the politics of the time are depicted is a bit too black and white. The Spanish look grim and are dressed in dark colors. They are portrayed as crazy, religious zealots. Spain had a right to be upset at English privateers / pirates who attacked their ships and stole their gold. Mary, Queen of Scots is shown as a dowdy, schemer who disliked Elizabeth. The reality was that Mary was a pretty bimbo who made bad choices when it came to men.<br><br>Parts of the film veer too much towards soap-opera. Sir Walter Raleigh (Clive Owen)becomes a favorite, but when Bess Throckmorton, one of the Queen's ladies-in-waiting and Raleigh get secretly married, Elizabeth becomes jealous and behaves badly. Later, Raleigh and Francis Drake are shown defeating the Spanish at sea. In reality Raleigh was looking after the coastal defenses in the South West of England and didn't marry Throckmorton until 1591. The real Raleigh was a brilliant man: soldier, explorer, writer, poet and courtier and probably deserves his own film. The film is good fun but it's simplistic, cartoon history.","user":"eastbergholt2002","rank":[139,178]},{"title":"Good costumer drama that takes a brilliant look at the turbulent life of famous Queen of England","rating":7,"date":"23 March 2009","review":"This is a sweeping chronicle of 16th-century English Queen from his splendor years . She's the Protestant Elizabeth , she was a brilliant stateswoman who managed to restore England to power and glory amidst public and private confusion . As are splendidly recreated wars , loves , turmoil and fight power of its time , including her troublesome days and machinations surrounding . It's magnificently captured by marvelous sets , splendid production design and glamorous gowns . This elaborate , colorful costumer drama packs outstanding performances from Cate Blanchet as an impulsive queen , Clive Owen as a dashing and arrogant commandant , besides a top-notch support cast giving strong acting , as the charismatic Geoffrey Rush as Sir Francis Walsingham , Samantha Morton , Jordi Molla , Rhys Ifans, Abbie Cornish , among them . The fine cast does quite well in historic setting . This interesting historical drama contains a wonderful cinematography that adds color to the atmosphere by Remi Adefarasin who photographed the previous part titled ¨Elizabeth¨ . Evocative and imaginative musical score fitting to the past time by Craig Armstrong . The motion picture was lavishly produced by Michael Hirst (The Tudor) and finely directed by Shakar Kapur, an Indian director , costumer expert (Elizabeth , Four feathers). <br><br>The picture talks about Mary Queen of Scots (Samantha Morton) , she and Elizabeth were rivals for power in Tudor England . The heathen Protestant Elizabeth dreads the prospect of the Catholic Mary about her ascending the English throne, leading to intrigue and divisiveness within the court. Then Mary was imprisoned by Elizabeth , who rightly feared Catholic plots to place Mary on the throne. Mary was guilty of plots complicity and was condemned death warrant . The film especially describes relations between Spain ruled by Philip II (Jordi Molla) and England at the breaking point . Spectacular battle scenes between the British Navy commanded by Duke of Effiham and Raleigh and the Spanish commanded by Duke of Medina Sidonia , it lasted ten days , during July 1588 . At the climax William Raleigh leads the attack on the Armada ships massed off the British coast .","user":"ma-cortes","rank":[11,12]},{"title":"Flashy, disappointing sequel","rating":5,"date":"22 December 2007","review":"It is now 1588, and Queen Elizabeth I (Cate Blanchett) is no longer the fragile, naive young princess of England, but an accomplished monarch with a knack for public relations. England's empire is growing, and Elizabeth develops an attraction towards explorer Sir Walter Raleigh (Clive Owen). But soon war looms as Spain's King Phillip II (Jordan Molla) threatens to invade England, and a cabal of Catholics led by the imprisoned Mary Queen of Scots (Samantha Morton) plots against the Queen's life. With the aid of Raleigh and aging spy-master Francis Walsingham (Geoffrey Rush), Elizabeth confronts these foes and earns her place in history.<br><br>Shekhar Kapur's \"Elizabeth\" was a visually stunning, brilliantly acted, and extremely compelling film which depicted a young Princess forced by circumstances into one of the most delicate situations imaginable. The movie was gorgeous to behold in its art direction, cinematography and costumes, but also had an intriguing story and a very strong cast, headed by the brilliant Cate Blanchett. \"Elizabeth: the Golden Age\" has a lot to live up to, but surely the history behind the film would ensure an entertaining sequel about one of the history's most compelling individuals.<br><br>Unfortunately, 'twas not to be. \"The Golden Age\" is a very weak, disappointing sequel to a great film. The story plods, the characters become two-dimensional, and the impressive cinematography and visuals bog down rather than enhance the film. With all of the intriguing aspects of Elizabeth's reign, and the fact that director and star were back from the original, it's doubly disappointing.<br><br>Where shall we begin our criticism? The story, which is all over the place. The original film has a multi-faceted plot, but all of the characters and actions tie together with consummate skill. Here, the various intrigues and plots are introduced incrementally; we don't even know who the English Catholics are until well into the film, and their relation to the plot, despite a lengthy introductory scene. \"Golden Age\"'s various subplots cease to be layered and interesting and simply become a great big muddle.<br><br>Another huge criticism of the film is its characterization of historical personages, notably the Spanish. Elizabeth's portrayal is spot-on, but otherwise? King Phillip in particular is a hateful stereotype; most of his dialog is pronouncing Elizabeth as evil, even saying at one point \"Elizabeth is the darkness, I am the light.\" He might as well twirl his mustache and laugh maniacally a la Snidley Whiplash. Mary Queen of Scots is the only villain who comes across as remotely human, and even she is hurt by very little screen time. The film makes very little of Mary herself, relegating her and the other supporting characters to the background, choosing to focus on a ridiculously overwrought, historically-improbable love triangle between Elizabeth, Raleigh, and Elizabeth's servant (Abbie Cornish).<br><br>All this might have been forgivable if the movie had delivered on its promise of a rip-roaring climax. Throughout the film's length we are impressed upon of the Spanish Armada's vast size and perceived invincibility. We see epic CGI shots of the fleet setting sail. We hear Elizabeth's ministers portentously pronouncing the Spanish as unstoppable. We get Elizabeth's rousing speech to the troops in full battle armor. And the payoff for all this build-up is... nothing. A few brief CGI shots of ships in battle, and an oh-so-fancy shot of a single horse swimming through the wreckage of a sinking Spanish ship. Pathetic, and unforgivable. I wasn't expecting a Rambo film but I was expecting a scene that made all of the dread mutterings of the past two and a half hours worthwhile.<br><br>The movie is as visually splendid as any you'd care to name. The use of imaginative lighting, costumes, and art direction is simply a site to behold. The film reaches its high point during an abortive attempt on the Queen's life, when her would-be assassin pronounces her a \"whore\" - followed by a shot of Elizabeth, dressed in white with immaculate sunlight streaming down around her. This scene is absolutely stunning, but it is also indicative of the film's basic problem. All of the interest is in the visuals and costumes, and there is no real substance to them.<br><br>The movie has one major redeeming factor, and that's Cate Blanchett. Blanchett is a brilliant Elizabeth, showing her to be a great leader, but also a desperately lonely woman whose best asset is her PR abilities. The supporting cast is woefully under-used, particularly Geoffrey Rush. In the original, Rush's Walsingham was an intriguing, slippery character. In this film, his contribution is to sit in the background and mumble a portentous line every once in awhile. The rest of the cast, except Samantha Morton, is unexceptional, through no fault of their own.<br><br>\"Elizabeth: the Golden Age\" should have been a great follow-up to a great film. With a talented director, an amazing lead performance, and one of the most compelling chapters in history, \"Golden Age\" should have been something special. Unfortunately, it is nothing more than a big, shiny, leaden disappointment.<br><br>5/10","user":"Hancock_the_Superb","rank":[17,20]}]