[{"title":"A delicate introspectiveness","rating":8,"date":"17 November 2005","review":"Hong Sang-soo: Tale of Cinema/keuk jang jeon (South Korea/France/MK2 2005). 90 minutes. No US distributer. Shown at the New York Film Festival, Lincoln Center, October 1 and 2, 2005.<br><br>Hong was back for the third time at the New York Film Festival with this appealing self-reflexive look at ineffectual young men who happen to be filmmakers. The first segment is a film about such a man (Lee Kiwoo), who is tall and handsome but directionless. He meets an old girlfriend (Uhm Jiwon) and eventually talks her into committing suicide with him, though the attempt ends comically.<br><br>Ten years later, the star, who was also the director, is now famous and ill. His co-star, the girl, is a successful actress. She encounters a classmate of the filmmaker, also handsome, now down on his luck, who claims his story was appropriated in the film, and it seems like it is going to repeat itself as he gloms onto her and they spend a drunken night together.<br><br>What's interesting is the way Hong slides from glamorous ennui to comical mediocrity in his meandering New Wave-ish sequences in a brightly lit but tacky urban Korea. Is Seoul really anything like Paris? Perhaps not. But Hong's sweetly melancholy film with its gentle convolutions lingers pleasantly in the mind -- despite the slightly too-easy irony of its finale with the once \"suicidal\" director now whimpering that he doesn't want to die.<br><br>Hong was born in Korea but got a BFA at California College of Arts and Crafts in Oakland and an MFA at the Art Institute of Chicago.","user":"Chris Knipp","rank":[13,20]},{"title":"A tale of woe, peppered with Marlboros and Hite beer","rating":5,"date":"3 October 2005","review":"I got the opportunity to see this at the NYFF-the director was both mysterious and shy in the Q&amp;A so he did not shed much light on this seemingly simple film in concept which becomes complex in the execution(no pun intended). A better name for this film should have been \"Sex and Death\" as that are its two central subjects. I can't say I \"got it\" while watching it, but it had a resonance that sneaked up on me later. There is so much smoking and drinking in this film that my chest and head hurt by the end-I felt like I could smell the smoke and the beer. I was not familiar with the director's other films, but I might seek them out at this point, as this film did perplex and fascinate me, exactly what world cinema should do. Seoul looks like a beautiful and ugly place, all at the same time, and the meandering shots added greatly to the film's New Wave-like look.","user":"lrpulini","rank":[5,20]},{"title":"Boring.","rating":1,"date":"1 September 2008","review":"I can't believe this film has got such high marks from other reviewers.<br><br>This is similar to the worst low budget French films, it is so desperate to the meaningful and obtuse that it simply bores you.<br><br>The characters are believable and well acted but that is the only positive.<br><br>The film moves very slowly from non-event to non-event with the few real events being overwhelmed by the plodding pace.<br><br>The characters aren't interesting or likable, you don't care what happens to them and never and the dialogue is dull.<br><br>Watching this was an enormous waste of time.","user":"imdb-19548","rank":[8,42]}]