[{"title":"Freaking hilarious","rating":10,"date":"21 September 2007","review":"One of the funniest movies I have ever seen, if not the funniest. As many others have said, this isn't highbrow comedy, but that doesn't make it any less enjoyable. The puns and gags are highly memorable, and there are a lot of lovable actors, many of which you wouldn't expect to see in a movie like this, which makes them even more entertaining.<br><br>Whenever my friends have a LAN, we have to watch this movie at least once, as most of them are game designers. Many people have said that the movie is unrealistic, but beyond the obvious physical and logistical deviations, the general attitude and behavior of the characters isn't too far off from what I see when I've been around my friends.<br><br>I can't believe anyone could rate this a 1. If you did, call the morgue, you are dead inside.","user":"ckaspereen","rank":[76,91]},{"title":"You'll love it if you like these kinds of films (like I do)","rating":9,"date":"9 July 2006","review":"Well, obviously some viewers didn't like this one, and that's the case with all comedies that we could compare to Grandma's Boy. I still haven't quite gotten a handle on what those viewers aren't seeing in these films that they would like to see. The typical answers are that they want something funny, something not stupid, not clichéd, and so on, but of course that doesn't tell us much, because lots of us do find these movies funny, not stupid and not clichéd.<br><br>So how do you know whether you'd like Grandma's Boy if you haven't seen it yet? It's worth noting that Adam Sandler it, it features a lot of Sandler regulars, and it's the vein of Adam Sandler comedies like Happy Gilmore (1996), The Waterboy (1998) and Little Nicky (2000). Actors like Rob Schneider, David Spade and Kevin Nealon have cameos or small parts, and it's also not off base to compare Grandma's Boy to the Deuce Bigalow movies (1999 &amp; 2005), or Dickie Roberts: Former Child Star (2003). Chances are that if you like \"those kinds\" of movies, you'll find a lot to appreciate in Grandma's Boy, too, and if you don't like those kinds of movies, you should know (or should have known) to stay away from this one.<br><br>Of course Grandma's Boy is exaggerated and not realistic and even ridiculous and absurd at times. That's part of this subgenre of comedy, along with an ever-present irreverence and regular jabs of \"crudeness\" that work because at least in theory, they tend to appear when you least expect them. The idea at this point isn't to top the irreverence and crudeness of previous films, because to do that a filmmaker would basically have to resort to doing various illegal things in front of the camera. The name of the game is to give the false impression that maybe you're going to play things straighter this time around, so that the crazy stuff works in context. Director Nicholaus Goossen shows that he understands this well.<br><br>Grandma's Boy is about game designers, which by extension makes it about geeks and nerds. This may not be how most game designers (or most grandparents and their friends) really are, but this isn't a documentary, it's a very funny comedy, and this is at least about how those of us who aren't in the business imagine or want them to be. That's part of what makes comedy work--it has exaggerated, fantasy elements by way of caricatures/grotesques of (stereo)types that exist at least in popular, contemporary \"mythology\".<br><br>There are plenty of gags that people who like these sorts of comedies will remember for a very long time. They arrive about once every two or three minutes at least--just enough time to wipe away your laughter tears from the last gag. You can't get a much better recommendation than that. And if you know you don't like these kinds of films, please, do yourself a favor and just avoid this one, too.","user":"BrandtSponseller","rank":[91,115]},{"title":"I went back again!","rating":10,"date":"19 January 2006","review":"Never in my life have i went to see a movie playing in theater more than once. You get those people who have gone to LOTR or star wars 3 or 5 times, once was enough for me. Of all movies in the world that I could see for a second time, Grandma's Boy was the one that did it for me. Not only did i see it twice in theater but I Paid twice to see it! No sneaking in, no illegal downloading...I have supported this movie! And why? Because never in my life have i found a movie that made me laugh so much. And i laughed just as much the second time as I did the first, perhaps more. Joel Moore owns this movie. He plays his character so well that you can't help but wonder how he did it. Makes me want to get metal legs too.I'm not saying everyone will find this movie funny...if you've never smoked a joint, played a video game or made a sexually explicit comment....well then yeah you'll probably sit through this like a wet fish. A sick sense of humor is kind of a must. Maybe you have to be a bit of a dork, i dunno. Fact is it had a good beginning, middle and ending and what could be better than that? (Even award winning Backdoor Mountain left me disappointed with the ending!?!) SO that's my opinion and I'm sticking to it. 10/10 for the best comedy of the year...and two thumbs down to the critics who are obviously too old and boring to find the crazyness of youth amusing.","user":"booeythang","rank":[153,212]}]