[{"title":"Silent and surprisingly dull","rating":7,"date":"7 November 2006","review":"Nirvana were big around about the time I was in my teens so I do have a certain amount of cultural involvement in his suicide. By this I'm not claiming anything special, just saying that it was an event I remember from the time rather than since. As such I was quite interested in seeing this film although I did think it would be detailed than it was. Instead it is literally \"Blake's\" last days in a remote house with a group of friends. We see him in a state of isolation, falling deeper into whatever it is that is eating at him from the inside out. Van Sant has drawn this fall out over 90 minutes where, lets be honest, not a great deal actually happens.<br><br>To some viewers this has given the film a tragic and haunting quality that has produced a lot of insight into the man Blake. I am not one of those viewers. It wasn't that I was waiting for the film to do a lot of work for me or spoon-feed me emotions, but I did need more than what was delivered and I confess that the film bored me intensely at some points. Van Sant has written these last days and based them on Kurt Cobain but I would have liked him to have imagined a bit more detail in his character and perhaps done more than delivered some stroppy teenager silently moping around the place until the inevitable happens (and even that is done in a very low key way). It is hard to fault the intimate nature of Van Sant's filming but this is very different from getting into the character and actually benefiting from this degree of perceived intimacy.<br><br>Pitt does as he is told and spends most of the film looking through his hair in a sort of creative and tragic way. Without any dialogue to speak of (sorry) this is all he can really do and I found it totally unconvincing and uninteresting  which is a pretty big failing given that he is supposed to be the heart of the film and the reason we have all come along. The rest of the cast are fairly unimportant and it says a lot that the only one that held my interest was Ricky Jay  but that was only because he was Ricky Jay.<br><br>Perhaps this will really touch major fans of Cobain but it did nothing for me at all. Silent and surprisingly dull, this badly needed depth and insight as well as a serious and respectful tone.","user":"bob the moo","rank":[14,16]},{"title":"\"It's a long lonely journey from death to birth:\" Gus Van Sant's rock epiphany","rating":9,"date":"29 July 2005","review":"Not everyone will love \"Last Days.\" Nonetheless it concludes a minimalist trilogy that does more to build Gus Van Sant's cred as a serious and original filmmaker than anything since \"Drugstore Cowboy\" and \"My Own Private Idaho.\" And in its way it's every bit as good as its predecessors, \"Gerry\" and \"Elephant,\" and like them is HBO-sponsored and exquisitely filmed in a boxlike and claustrophobic small format. The irony is that this career-making role for the young Michael Pitt that \"Last Days\" contains is one in which he only mumbles and hardly speaks. But he embodies and lives and becomes his role as few actors you will see this year have done. He goes to a dangerous and disturbing place. River Phoenix might have taken the part, but maybe it's a good thing for him he never did.<br><br>Pitt channels the dying spirit of Kurt Cobain as he was, isolated in a big house, avoided by people there and avoiding them and almost everyone who came looking or called. Once he picks up the phone when his producer is calling and he listens, but never speaks. Blake (Pitt's character's name) is a shaky, peripatetic Howard Hughes, who goes native in the first sequence, wandering in a daze, walking into the woods, bathing in a river, spending the night by a bonfire of sticks. The mumbling is eerie, it's eavesdropping without insight for us. As he returns to the house, stumbles about, prepares makeshift meals in the kitchen, puts on a dress and brandishes a shotgun, the lack of human interaction brings home as no dialogue-written scenes ever could how isolated and mad he has become.<br><br>Since \"Last Days\" is largely a mood piece -- a splendidly original, dreamlike one -- setting is crucial and the old stone house with its crumbling, paint-peeling walls and mess and sound equipment and instruments and paintings, is a major player, so well represented in the elegant, original cinematography of Harris Sayides that it resembles no place else you've ever been. There are three or four other people in the house -- the action's so chaotic and haphazard you may not quite know who or how many. One's clearly \"Asia,\" Asia Argento, and she's sleeping with \"Scott,\" Scott Green, and there's \"Luke,\" Lucas Haas, tall and gangly in Coke-bottle glasses. Blake sneaks up on Asia and Scott with a shotgun when they're in bed together sleeping. Typically, nothing happens. He doesn't shoot, and they don't notice him. They and other people go out to and return from nightly revels. Blake is just there.<br><br>As in \"Elephant\" Van Sant's approach is neutral. He does not analyze or explain or judge, and the actors are free to improvise and be themselves. Blake's respected because it's his house, but he's also a kook. Random visitors who're let inside are grotesque and comic: first it's dorky but cute twin Mormon \"Elders,\" then a large well-spoken black man selling a renewal of a Yellow Pages ad from the year before. \"How's your day been so far?\" he asks as an opener. \"Uh.it's another day.\" mumbles Blake. He's cooperative in a rote sort of way but there's little indication he knows what he's talking about. There's a detective and a young man who once knew Blake, who escapes them and other people by running outside to the woods again. These two are neither sinister nor funny: they just are. They're just interlopers, like everybody else, into Blake's lost world.<br><br>The method in this trilogy has in common that it requires quiet acceptance of the proceedings; that if you give yourself up to its sometimes real time sequences (especially in \"Gerry,\" where Van Sant says they're influenced by Hungarian filmmaker Béla Tarr), they're hypnotic and special, and if you don't, they're just irritating and boring. The experience requires a lot from the viewer. It's hard to describe a movie in which little happens. Nothing turns out to be quite a lot and you might remember that James Joyce wrote a long detailed novel about the events in the life of a little man in a single day in Dublin. It's certainly important that Pitt is deeply in character. If his acting were mannered or theatrical or unfelt, nothing would work. When he finally sings one song, a plangent cry of despair with the refrain, \"It's a long lonely journey from death to birth,\" it's very Cobain, but Pitt's own song and passionate, exciting performance.<br><br>There's a kind of climax here, but there's nobody (but us) to witness it. Luke and Scott are up in bed with each other. As in \"Elephant,\" several sequences repeat. Blake seems to be dying repeatedly, as Asia stumbles upon him lying on the floor and he seems to nod out, though you never see him do drugs and maybe it's just the after effect of them from long before. Finally he's gone. We don't see him do that either. His soul quietly climbs naked up out of his supine body, like a Duane Michals photo. Then there's all the police, the ambulance, and the other inhabitants sneak off, as Blake did. It's all a pageant. I felt right at home in it remembering Oregon, Washington, the hippie days of the Sixties: it was there for me. I know it was Grunge Rock and Kurt Cobain, to whom this film is dedicated, died in 1994, at 26. The point is that it feels real. But its relation to real events is tangential. And if you give yourself to it and take it in its own context it's a wonderful film, a beautiful funny-sad experience of doomed-damned youth and a deeply felt meditation on isolation and death.","user":"Chris Knipp","rank":[131,186]},{"title":"Blake or bleak?","rating":8,"date":"2 October 2005","review":"Last days This is the final instalment of Gus van sant's trilogy of the disenfranchised and the alienated human condition. It began with 'Gerry' dealing with two guys trapped in a desert with no way of finding civilisation again and continued with 'elephant' dealing loosely with the columbine school killings. Last days is loosely based on the life of Kurt Cobain the late nirvana singer. Last days is really gelephant a mix of the first two films. Similar themes like repetition and the same story told from different characters perspectives are lifted straight out of elephant and the endless, hopeless tracking shots of despair are taken out of Gerry. Here the main character Blake is lost, unlike the two central characters in Gerry who are lost in the desert without hope, Blake is lost in his own head seemingly without hope. We meet Blake in the title of the film, his last days, being destroyed by drugs (although we never see him take anything harder than a cigarette) and emotional vampires who pretend to be his friends sucking the life out of him coupled with the pressure of fame and impending 86 date tours, Blake is quite simply falling apart. Here though it is a beautifully subtle take on madness, gone are the visions you see in films like 'Jacobs ladder' replaced with a clever underscore of sounds of doors opening and closing and mutterings and oddities. It's as if as you travel round with Blake you too can here the doors of insanity opening in his head, you too struggle to make out all the sounds. It's gently handled but eerily effective in linking you in with Blake's mindset. Elsewhere he stumbles and crawls round trying to function in the face of increasing paranoia and his drug addled inability to perform even the simplest of tasks. With record executives, band members, his manager and a private investigator all on his trail doing little for his state of mind Blake only seems comfortable when making music. This is also the only thing he can do with any sense of achievement, this could be down to the fact that it is second nature or the fact that he is a musical genius. The film also has an amazing sense of space, the landscapes around the mansion, the emptiness of its rooms and the vacuous nature of the hangers on to Blake's coat tails. With some amazing scenes, look out for the Venus in furs scene and the amazingly shot and framed acoustic song performed by Blake in the studio with probably one of the best little pieces of improvisation I've ever seen, this is a brilliant and touching portrayal of a great man left to fall to pieces by those who should have helped him stay together. Although different in its approach it deals with madness in a way not seen since Polanski's 'repulsion' and ultimately it is a film that stays with you long after the final chilling shot.","user":"come2whereimfrom","rank":[58,86]}]