[{"title":"The Best Film Ever Made Ever","rating":10,"date":"5 August 2013","review":"Now let me get this straight. I'm not Alan Partridge. I didn't decide one Monday afternoon, while eating a double decker, to come on to IMDb and give a review. That would be illegal. Neither am I plugging double deckers. They're really nice though, and I reckon Jesus would probably eat them. I digress. Alpha Papa is amazing. Alan Partridge will surely get the Oscar nod for best actor. If you thought Brokeback Mountain was stunning (I didn't) then you'll bend over backwards to watch this. Alan doesn't play a gay cowboy, but rather a non-gay radio show presenter who ends up in a siege (sorry about the spoiler). And he doesn't die at the end either like Bruce Willis in Sixth Sense, or the dog in Bob Marley and Me. No, he lives after enduring what can only be described as an epic battle of man versus another slightly crazy man, who looks a bit like that bloke off Star Trek with the fake Irish accent. Anyway...don't waste your time watching Monsters University or the slightly camp Wolverine who has knives and forks for hands. Watch a real man in action giving the performance of his life.","user":"mrwag-757-964031","rank":[125,169]},{"title":"Enjoyable but over-rated","rating":6,"date":"23 August 2013","review":"I am huge Alan Partridge fan but despite this, I went into this film with slight trepidation as I don't think I can remember a TV-Film comedy transition that ever managed to really capture the magic of the TV version.<br><br>Alas it is the same story again here.<br><br>For me, the series of Alan Partridge where he lives in the motel, is one of the greatest comedy series of all time (C*** P*** Partridge), and the follow up series with him living in the caravan is every bit it's equal (Dan!!?). The recent radio shorts are also pretty good.<br><br>However, the magic of Alan is missed just slightly in the movie. As is always the case with these crossovers, the cinema transition seems to demand a higher pacing of the comedy along with the more bombastic production generally, and this doesn't really sit well with Alan. You need to be able to watch his every facial expression, and capture every word of his dialogue and just take in the hilarity of his view of the world. Likewise, his supporting characters have all been unique in their own ways, but in this big screen version they have been almost caricatured and stripped of any real wit or supporting merit. Michael is particularly disappointing in this regard but Lynn's involvement is also slightly... pointless and over-the-top when she is used.<br><br>I found the whole cinema experience a little bit tiresome and that's the first time I've ever said that about anything with Alan Partridge in it. This is a decent film, and fans will find lots to titter at, but I would be surprised if there is anything truly memorable when we look back in a few months time. Even after first watch, there isn't a phrase I can pick out that will stick in my mind, and that's the really disappointing thing.<br><br>The three-quarters full audience of my cinema in SW London seemed to enjoy it but there were no extended belly laughs - just murmurs of laughter spotted throughout, and one almost sensed that we were all collectively colluding in really wanting this film to be better than it actually was by lending our laughs. I'll give it another try on the small screen and perhaps my mind will change but until then, and after first watch, this is a slightly disappointing 6/10.","user":"cathalokane","rank":[21,26]},{"title":"Very funny. Won't disappoint Partridge fans","rating":10,"date":"9 August 2013","review":"As a fan of Alan Partridge I was looking forward to seeing this and I wasn't let down. I'm not sure what people who haven't seen the TV shows will make of it but for fans this is a big treat. <br><br>The plot is pretty flimsy but when you have a character like Alan Partridge you really don't need much of one. The jokes and laughs keep flowing and whilst some miss the mark there are plenty of scenes that will have tears running down your face. Some of the old favourites like Lynn and Michael (slightly superfluous in this) are here but this is all about Alan. <br><br>It plays like a very long version of an episode but it's face paced enough to never get tedious and the film just flies by. This is a film that can be enjoyed by anyone and may even garner a new generation of Partridge fans. <br><br>Alpha Papa is a comedy that actually makes you laugh and is highly recommended.","user":"MattyGibbs","rank":[36,50]}]