[{"title":"Very enjoyable - ignore the reviews!","rating":7,"date":"5 November 2006","review":"This is definitely the first time I have gone to see an Russell Crowe and/or Ridley Scott film at the cinema, fully bracing myself to be disappointed and...<br><br>I am very pleased to be able to say that I enjoyed it thoroughly. It has a very warming glow to it - beautifully played; gorgeously shot. Anyone who isn't just a little bit seduced by Provence after seeing it needs their head (or more likely their heart) examining. The lessons may well have been taught in a hundred films before, but that doesn't make them any less relevant or resonant for the commercial era in which many of us now live...<br><br>So, why the terrible reviews? I really don't know. The comedy was not overplayed in the way implied by the critics at all. To be blunt, it was not really necessary, as the warmth and effectiveness of the film and story lies in the romantic drama. The comedy is fine, but doesn't really add anything to the film. However, it does give it a very upbeat, cheerful and likable feel and maybe that is reason enough.<br><br>Max's character and Russell Crowe's performance? It's in the quieter moments where Crowe really excels and shows just why someone would want to cast him, as opposed to say Hugh Grant, in a film like this. His reactions to memories and the things that other characters do and say are just so much deeper and more real than Grant is capable of: which is why Grant always comes off as the same character in these films (a variation on the Grant formula) and Max comes off as real.<br><br>It almost seems as though the critics have a film with this plot pegged into a box: because they can only see (and can only expect to see) a Hugh Grant characterisation, they cannot accept anything other than a Hugh Grant characterisation. Whereas the actual reason that Crowe doesn't come off as Hugh Grant is because he isn't channelling that kind of characterisation at all. This is a very different kind of film.<br><br>Also, the critics seem to be completely off the mark in assessing the character, when they say that he starts off a bastard and ends a bastard too. Actually, this is far more about unearthing other qualities - not completely rejecting those 'bastard' qualities that he begins the film with, but refining and diluting them, as he becomes more and more adjusted to his past. He doesn't change, he opens his heart and mind to qualities that he has been ignoring within himself. You can see that other Max from the moment he opens the letter telling him Henry is dead - but he tries to resist the feelings that are clearly there, in large part because he doesn't want to face the fact that he has let his Uncle down - and all of the guilt that is allied with that.<br><br>The film is not the best film I have ever seen. The questions it asks are fairly fundamental, but they aren't startling or especially thought provoking.<br><br>But the film is highly enjoyable, from start to finish; and it's warm, something that is pretty rare in films these days.<br><br>So, to end, clearly I am not in tune with the critics - but then, increasingly that seems to be the case nowadays. I just think that I see completely different films to them...","user":"sarum100","rank":[292,341]},{"title":"Better than the critics say","rating":9,"date":"12 November 2006","review":"Like the reviews overseas,Australian critics have generally snubbed this film as bland and contrived with some nasties regarding Russell's accent and wooden comedy delivery.<br><br>I thoroughly enjoyed this intoxicating film which I agree has its faults, however it succeeded in its core themes of love,friendship and beauty as being central to a well lived life.<br><br>I feel Crowe does a good job as Max, an arrogant and ruthless bonds dealer who inherits a château from his Uncle Henry(Finney). Initially interested in how much money this can make, circumstances necessitate a longer stay whereby Max begins to recall his many enjoyable Summers spent with his Uncle at the Provençal château.<br><br>Marion Cotillard provides the love interest as the beautiful and tempestuous Dark French girl and young Aussie star Abbie Cornish contrasts as the fair blond Californian beauty who is Henry's illegitimate daughter. Both perform well though I know Cornish is much more capable than this role requires.<br><br>The movie is a little uneven at times as Max learns his lesson on what is truly important in life.Sometimes the comedy is light, sometimes slapstick, and all this juxtaposed with some sentimentality and more serious moments. Most of the characters are contrived from Max through to the peasant French verniers. However in spite of this the story unfolds in a believable way and the photography is stunning as you would expect of the Province and Scott.The women are gorgeous, the wine looks delicious and the food makes you salivate. It succeeds in its attempt to seduce and makes one a little sad to return to suburbia as I did.<br><br>Finally,on Crowe.I feel there are many critics who love to pan Crowe. It has become the fashion.How he missed out on a nomination for Cinderella Man is beyond me.(Though he would not have beaten Hoffman or Phoenix). He is obviously still anathema in Hollywood and to many critics a man they love to hate because he is simply not liked.One critic criticised him in this film because he was unlikeable but surely that was the point! At least he is an actor who acts. I mean Hugh Grant plays Hugh Grant and Tom Cruise plays Tom Cruise.But with Crowe, he always plays his character.And a good job he does once more.<br><br>All in all 7 1/2 out of 10.And definitely more delicious on the big screen.","user":"Drtimk","rank":[157,181]},{"title":"A tasty vintage","rating":8,"date":"13 October 2006","review":"A Good Year is much like Peter Mayle's other books  shortish, picturesque, sometimes mouthwatering, generally light and definitely charming.<br><br>To that end, this film does the book excellent justice and even manages to make the cinematic transition without losing or adding much in the process. (Max has however become a blend of Wall Street's Gordon Gecco and Capt. Aubrey  a cold power hungry cut-throat exterior with a bit of a romantic hedonist hiding a Depardieu-like charming buffoon locked inside.) Sir Ridley Scott makes it clear that the real star here is the Provencal countryside in all of its golden sun soaked glory. Russell is the fulcrum that moves us from one beautiful scene to the next, lightly shuffling and dancing in over-sized pajamas with a suit jacket and a tie for a belt.<br><br>And oddly, this isn't necessarily a bad thing.<br><br>As obvious as the story line is (both in the book and the film) it remains absolutely charming and Crowe's performance is an essential part of what makes it work, hammy or no. He looks great and his trust in Scott as a director allows him to simply have fun here  a nice break from all of the heavy (and often heavy handed) Oscar bait bio-pics he's pigeonholed himself into recently.<br><br>The rest of the cast is picture perfect. I've been waiting to see when Freddie Highmore would play a young Russell and he's lovely here, big eyed and gracefully gawky as young Max. He holds his own against Albert Finney's lovingly blustery Uncle Henry. Marion Cotillard is gorgeous as Fanny and also sturdy enough to hold her own against both Max and Crowe himself. Abbie Cornish is pretty and sweet and her American accent is damn near perfect. Isabelle Candelier is a colorful counterpoint to Max's stuffy British ways, but it is Didier Bourdon who nearly walks away with the picture. His is a character we haven't seen done a million times before and whose eyes hint at a story equal in richness to the Château itself. Archie Panjabi is Max's assistant, a character created for the film. As the all knowing and mischievously wicked Gemma she appears ready to run away with this picture. (And as always watch for a cameo by Ridley Scott's longtime partner Gianina Facio  I won't spoil your fun by telling you where she appears.) Again, there is nothing new or groundbreaking here. It will be compared to Under the Tuscan Sun and a long history of countless other films of this nature  an attractive woman or handsome bastard gets in touch with who they really are, gets back to basics and becomes who they were always meant to be.<br><br>Forgive me for taking this path, but the wine/film comparisons are inevitable with this one.<br><br>Like most of the films made today the fresh elements in this film come from the particular vision of the film maker, the chemistry of the cast and the way all of it can come together in a charming and palatable fashion. In other words, the blending of the key ingredient's.<br><br>It all comes down to being a matter of chemistry, craftsmanship and preference. Chemistry causes the grape to ferment and become wine. Craftmanship and experience make that wine something worth drinking. Chemistry amongst the elements of a film  story, cast and setting makes these pieces form a cohesive whole. Craftsmanship and experience make it a palatable film.<br><br>And the rest is simply a matter of taste.<br><br>Though it lacks the crisp originality of a sauvignon blanc, the hipness of a pinot grigio or the bold edginess of a Cabernet, but the elements here come together to make a film that plays pleasantly over the tongue like a decent rose  easy to sip and enjoy and given the chance could well leave you with the warm glow of a late summer afternoon.<br><br>But enough with the wine clichés! You could easily take advantage of the value of a matinée or opt to wait for DVD, though neither will do the scenery justice. This sweetly charming film will hold up equally well as a date movie, a mid week escape or something that you can take Mom to.<br><br>Worth a look.<br><br>-Roo's Reviews","user":"critter-26","rank":[191,227]}]