[{"title":"Fitting Reinvention of the Franchise","rating":8,"date":"9 February 2007","review":"i just saw a test screening of TMNT and, although i suspected it would be good, it surpassed my predictions. i should note that i am a pretty big fan of the old movies (1 and 2 anyway) and the old cartoon, and am a collector of TMNT comic art posters-- this may give you a perspective on where i'm coming from before you read my review. Without giving much away, here is what i liked(+)/disliked(-).<br><br>+ANIMATION: the biggest thing the movie has going for it is the animation. it is miles ahead of any animated movie I've ever seen. the level of detail is unsurpassed and completely amazing. everything from backgrounds, characters, various surfaces and textures (including skin), lighting and different effects (including a pivotal sequence in the rain) absolutely blew me away.<br><br>+DESIGN: along the same lines as the animation, the general look and design of everything was pretty cool. the turtles themselves look different and new, as well as splinter, casey and april. their designs fit in well with the overall look of NY city, which is dark, worn and very impressive. the skyline was very well done. I was also particularly impressed with the design of karai and the foot.<br><br>+CHARACTERS &amp; RELATIONSHIPS: especially between the turtles and splinter --and particularly raphael and leonardo-- the relationships are complex, as is traditionally the case for the franchise. in this film they are well drawn and developed and, in the end are fulfilling and cathartic. there are a few surprises to say the least, both within the turtle team and also without. casey also adds to his relationship with raph in this movie.<br><br>+SCREENPLAY/STORYLINE: The screenplay is generally okay. the tone is about as perfect a balance you can hope for for a film trying to appeal to the Saturday morning crowd as well as the old school, 20-something fans. it returns to the darker, more emotional tone of the first live action film but doesn't fail to deliver on humor (although some of it is hit and miss-- probably the result of trying to appeal to the younger crowd). Dialogue is decent. the storyline is a bit more on the sci-fi side than most fans of the old movies will be used to, but it seems secondary to the development and relationships of the characters-- a good decision on the part of the filmmakers. the plot is still interesting and fast paced, and the villains are credible.<br><br>+ACTION/FIGHT SEQUENCES: generally well done. for me, the centerpiece of the whole movie was a climactic, rooftop fight scene in the rain. other cool sequences include a skateboarding scene, and a huge fight against a bunch of foot ninjas.<br><br>-HUMOR: not that it was particularly bad (although michaelangelo was borderline annoying sometimes), but for me, there wasn't enough. i usually associated the turtles with humor, even in their darker pieces like the first live action film.<br><br>-SPLINTER'S VOICE: this may be sacrilege, but Mako's voice took some getting used to. I was used to the soft-spoken whisper of past splinters. this one is harsh and grumbly. this isn't to say its bad-- it just took some getting used to.<br><br>-CHARACTER SCREEN TIME: michaelangelo and especially donatello were hardly in the movie. there could have been more development about their characters (traditionally leo and raph are the focus, though) although they do bond well as a part of the whole group. Same goes for April. She has usually been a pivotal character in any incarnation of the franchise, but she is minor here. Hopefully there will be future films where these three characters will be explored in more depth.<br><br>-APRIL: not only does she have little screen time, but she isn't as \"strong\" a character as she usually has been, and her fighting skills were kind of out of the blue. besides this, her relationship with casey was kind of flat. hopefully it will be remedied in future films, if there are any.<br><br>-CASEY JONES: what happened to the hard-edged casey we all knew? i get that he is supposed to be more \"domestic\" now, but i didn't even get a hint of the old, violence-crazy vigilante.<br><br>-VIOLENCE: i hate for this to be another \"there's not enough violence in TMNT\" discussion, but although there is a lot of fighting, it seems they've really tried to keep the violence to a minimum, which is understandable considering their broad market (after all, it is PG). depending on if this film is successful, i would like to see them up the darkness and violence a bit more (PG-13 would be cool)-- although even if it is successful, it probably wont happen. wishful thinking i guess.<br><br>You will enjoy this film if you are a true old school fan or a fan of the newer cartoon. If you never really liked the turtles, you probably wont like this either. Since this is supposedly based more on the original comics, even the comic fans should enjoy it. Although it is a bit on the dark side, the PG rating is fitting, and isn't too much more violent than the Saturday morning cartoon, id imagine. it is a good action film and a good family film-- adults and non-fans shouldn't be bored. To people who balk at the idea of it being animation (\"its a cartoon!\") or being PG, i'd say give it a chance-- you might actually like it. like most things, if you walk in hating it, you're gonna leave hating it. but as a longtime fan of the turtles in most incarnations, this film has my seal of approval. it was pretty good, and i expect to see more.<br><br>OVERALL: 8/10","user":"ChimpCadet","rank":[271,326]},{"title":"Good fun on the big screen","rating":8,"date":"19 March 2007","review":"Saw the preview of TMNT on the weekend and I have to say that the comments from ChimpCadet are spot on.<br><br>I am one of the older generation of TMNT fans and I can happily say that I greatly enjoyed watching this film. Also the row of children sitting behind me did not make one noise from the start of the film to the end. Which I think is a good sign to universal appeal of this film.<br><br>The plot ticks along at a good pace, some of the action sequence are outstanding in terms of action, animation and detail (as stated by ChimpCadet the fight in the rain is a highlight of this film).<br><br>On the whole a great film that does well to start the franchise and spawn a sequel or two.","user":"tfay-4","rank":[105,129]},{"title":"Turtles in the New Millennium","rating":7,"date":"22 March 2007","review":"TMNT does its job: CGIs are done very nicely, the visual overhaul of the Turtles' design comes near the original comic-look and for a kiddie flick (let's face it TMNTs target audience is well below 14) it is a shade darker, cooler and grown-up than any of the other animation films hitting the Box Office right now.<br><br>I was not sure what to expect after some of the reviews I read before seeing TMNT, but have to admit I was pleasantly surprised. Snappy one-liners and some tongue-in-cheek comments younger viewers will not get did really make this a great CGI-movie. Especially the hyper-kinetic camera work and the rather unusual scene setups were really intriguing.<br><br>Don't listen to the \"It's-not-like-the-comics\"-Fanboys and dive into the turtle world, you won't regret it.","user":"Cheshyre","rank":[107,135]}]