[{"title":"Spectacular, Arresting Visuals and Clever Storyline","rating":10,"date":"26 April 2008","review":"I saw this film two weeks before its scheduled release at the Los Angeles Indian Film Festival at the Arclight Cinemas in Hollywood. The film saw a surprise premiere after another in the festival was canceled. The visuals are like nothing I have ever seen before: spectacular, epic, ... words cannot describe this masterpiece of cinematography. Every scene is a work of art. The color palate is so rich, from the bright orange of desert mountains, to the vibrant red of a blood-soaked sheet, to the opulent green of the Indian's attire. The first five minutes of the film were arresting, the haunting soundtrack, the beautiful black and white images, I had goosebumps.<br><br>The acting seems very candid, very real. The young Romania actress playing the role of Alexandria is adorable, and Lee Pace as always is superb as the hospitalized, paraplegic stuntman. The characters were absorbing, and the story captivating. And where many films were unworthy of the title of \"A Fairy-tale for Adults\" this film truly is. It is about love, death, adventure, responsibility, and growing up.<br><br>The sheer magnitude of this film is unbelievable, shot in 18 countries, spanning many years (for the director to scout locations and cast appropriate actors) it is a true work of genius and a commitment by all cast and crew. I just hope that the filmmakers get enough out of the commercial end of this movie, to compensate them for the great effort that so obviously went into the making of this film and so that we might possibly get another like it in the future.","user":"Indiefilmbuff","rank":[219,239]},{"title":"Remarkable","rating":10,"date":"16 May 2008","review":"If you have not seen, or in fact, heard, of this movie, let me be the first to tell you about it.<br><br>This was and is the sort of experience that first enraptured and astounded me as regards to the movies. A story told in such a way as to become a part of your awareness, a gentle reminder of the fantastic, mythical and magical components of what is best in humanity whilst not forgetting what it means to be human.<br><br>Breathtaking does not even begin to describe the cinematography. The colors, the framing, costumes, lighting, and the backdrops are gorgeous; like something out of a dream. If this was just a visually moving film, that would be enough but there is so much more.<br><br>Tarsem Singh's direction is possessed. He manages to capture a kaleidoscope of emotion as diverse and generous as the tones and colors that deliver this movable feast for the eyes. His motley casting of relatively unknown actors is inspiring and refreshing.<br><br>The acting is extraordinary. Both poignant and comical, this journey of heartbreak and revenge, of discovery and friendship is conveyed with joy, witticism, curiosity and a vulnerability that is so rare in life, never mind in movies, it left me humbled. Especially the young Romanian girl, Catinca Untaru, who, not only made her big screen debut in this movie but is the heart and soul of the film in a breakthrough performance that I am sure will garner rave reviews.<br><br>It is my sincerest hope that you find this movie as emotive, tender and touching as I.","user":"jonathan-medina-1","rank":[377,424]},{"title":"Visually spectacular and emotionally engaging","rating":10,"date":"6 January 2007","review":"The Fall is a charming, fantastical story with a haunting undertone and features the most endearing child actress since Jacques Doillon's Ponette... what more could a film boast? Moreover, this film could be watched on mute and still make a lasting impression on the viewer through its striking imagery. The Fall is the story of Alexandria, an injured immigrant child wandering the hospital where she is being treated. The viewer is drawn, with Alexandria into a dark and extravagant world through the story of a maimed stuntman who she befriends. The skilled interaction between the finely divided reality and fantasy is reminiscent of David Cronenberg's eXistenZ. I can not recommend this film any more strongly.","user":"shaansahota","rank":[295,339]}]