[{"title":"A movie that will last","rating":8,"date":"8 January 2005","review":"\"Million Dollar Baby\" has great characters, but it doesn't glorify them. It has a wonderful story, but it never tries to impress you. The photography, score and direction is superb, but never distracting. What this movie is, if I have to call it something, is passion. Passion for film-making, passion for storytelling, passion for its characters, passion for its actors, and passion for its story and the means at which it will go to tell it. Amazing.<br><br>Frankie Dunn (Clint Eastwood) owns a messy boxing gym which is populated, mostly, by downbeat losers who he spends some time training. He runs it with his friend and former student Eddie Scrap-Iron Dupris (Morgan Freeman), who now lives contently at a room in the gym. One day a young woman named Maggie (Hilary Swank) walks in, looking for a manager and trainer. Frankie shafts her immediately (\"girly, tough ain't enough\"). Frankie has bigger things on his hands. He's managing a fighter who has a shot at a title bout.<br><br>But Frankie is old and weathered and not an appealing manager, so the fighter leaves him. Frankie is broken by this; it is another in a long line of rejections and separations. We can tell that, at this time in his life, he only gets really close with those he's training (Scrap is the only exception). We can tell that his loneliness  and a bit of persuasion from Scrap  cause him to agree to teach Maggie. Teach, that is the agreement, not manage. But, by the end of the film he will have devoted his life to her.<br><br>So the rest of the story follows these two people. There is no real 'plot' that you could describe in a trailer because it is constantly changingit is not the inspiring underdog story you may think of it as. No, what it's 'about' is these characters, and how they react to the circumstances around them, which change with each scene.<br><br>Narrating the story is Scrap, speaking like he's looking back to a time long ago when everything has passed. His voice seems flat, deadpan, but there is a working of subtle sorrow in it. Scrap is a sad human being, he sees himself as the result of missed opportunities in the past, and so he spends his time helping the others, offering them his wise advice, with a tone of deadpan humor and even cockiness. Scrap knows what should be done, and what will happen regardless, and he is sort of okay with everything, in a sort of passive way. But the man also knows what's right and he has a deep, inner strength which is displayed in one scene in particular where you just have to cheer. It is an intriguing character, and personally I think it's Freeman's best performance.<br><br>And Eastwood's best too. He is an elderly man; some might say too elderly to still be working. After all, most people are retired by his age. But if you had to guess when you're watching this film, you would never, ever say the man is seventy-four. You would say something closer to the sixties, because the man has such amazing energy and dedication, and above all, he has talent. It's been forty long years since \"A Fist Full of Dollars\" and film has come a long way, and so has this man. At seventy-four, passed all those years as an action hero, nearing what's could be the end of his career, Eastwood has made his best movie. I really, really hope he has time to make many more.<br><br>As for Swank, well, she must have found something big that she shared with her character, because this is not acting, it is existing. Swank is Maggie. That's all there is too it. This could be the movie she will be remembered for.<br><br>So, \"Million Dollar Baby\" is a masterpiece. I saw it last night when it opened in my city, and everyone else was seeing \"White Noise\", and I was shaking my head. Everyone who is even remotely interested in movies should see this one, just so they can know how movies are supposed to be made. I'm trying to think, and there is not a single thing here where Eastwood went wrong. The acting, directing, writing, score, cinematographythey all accomplish precisely what they're supposed to with sublime perfection. Many of these aspects will certainly receive Oscars and all of them should.<br><br>You may cry through this film, you may cheer. Whatever the case, you will love it.<br><br>9/10.","user":"NoArrow","rank":[570,711]},{"title":"Swank gives the performance of a lifetime!","rating":10,"date":"15 April 2011","review":"I didn't view this film until today because I simply wasn't interested in women in boxing; however, I wish I'd seen it years ago! Hillary Swank can never make another film and this one would be her crowning glory. It takes you on a wild ride of emotions from the beginning and Clint Eastwood's curmudgeon self is part of it all. Naturally, the \"voice of God\" in Morgan Freeman is there to explain it all and give some meaning to what each of the characters fell. By now, everyone knows the ending but I still won't spoil it for late-comers to the film like myself. I do believe much has been made about it and it's unnecessary. Yes, you will be torn about what is morally right but you can certainly understand how Eastwood's and Swank's characters feel! Please see this film. You will understand pugilism more than ever before and you just might see some of your own self in the film! It is well worth the time!","user":"ezlidblue-1","rank":[40,46]},{"title":"A Punch In The Stomach","rating":9,"date":"20 March 2005","review":"I don't know why, but I went into the theater thinking I was about to see a female Rocky Balboa kind of deal. I left the theater in a daze. Overwhelmed by the simple truth of its conclusion. My hat to Clint Eastwood. What an extraordinary career. An artist of enormous proportions so well camouflaged behind a shy smile and a charming, clumsy attitude. I remember focusing on Clint Eastwood through a very different lens after sitting through \"Pale Rider\" a mythological, lyrical western. Actors love him because he, clearly, doesn't lie to them, doesn't kiss their asses. He quite simply gives them room to maneuver. Even someone like Meryl Streep, felt freer and capable to stretch herself all the way to Italy under his wing. Sean Penn, Kevin Bacon, Tim Robbins, Jude Law, Morgan Freeman, Gene Hackman yes mostly men but there was also, other than Meryl Streep, Genevieve Boujold. Marcia Gay Harden, Laura Linney and now Hillary Swank with a performance that not even \"Boys don't Cry\" could predict. The film is a triumph in every department. My stomach ached from feeling. That's a compliment Mr. Eastwood. Thank you very much.","user":"marcosaguado","rank":[323,423]}]