[{"title":"Solid but underwhelming","rating":7,"date":"29 July 2006","review":"Due to Michael Mann's track record it was hard to go into this movie without very high expectations. After all, we are talking about the creator of arguably the greatest crime drama/thriller ever made with \"Heat\", as well as the highly entertaining \"Collateral\". But \"Miami Vice\" fails to live up to Mann's past success in the crime genre.<br><br>The plot is completely ordinary and doesn't offer up any unexpected twists and turns along the way. Because of this, the movie lacks intensity through much of the first and second acts, when everything that's happening is completely predictable. <br><br>However, pedestrian plot aside, the biggest disappointment was the manner in which the characters were developed. Both \"Collateral\" and \"Heat\" were notable for the way in which they delved deep into the psyche of the central characters, providing compelling personal drama to go along with the heists, hits and gunplay. But in \"Miami Vice\", we never really get to know the characters or their motivations beyond the surface level. And to make matters worse, Foxx and Farrell never develop the kind of rapport that's necessary to make a movie like this work on a high level. Compare Foxx and Farrell to Johnson and Thomas, or Gibson and Glover, and you'll see what I mean. Even though the \"Miami Vice\" movie aspires to be darker and grittier than \"Lethal Weapon\", which it is, it fails to be as dramatic because we never really come to care about the characters all that much. While there was clearly a conscious decision to downplay the \"buddy\" elements of the movie, the result is that Crockett and Tubbs seem so disconnected from each other on a personal level that it's hard to buy that they would die for each other, which we are expected to believe. The only relationship that is at all convincing or fleshed out is between Crockett and Isabella. The rest seem decidedly distant and undercooked.<br><br>What saves the film from being a bust is the visual splendor and great action sets. Mann once again proves that when it comes to creating a gritty atmosphere and staging shootouts, he's among the best in the business. When it comes to style, visuals, and atmosphere, \"Miami Vice\" is top notch.<br><br>In the end perhaps what hurt this movie most was studio deadlines and delays while shooting. It's been widely reported that Michael Mann had to feverishly edit this film just to get it into theaters on time, and in many ways that shows. There are multiple loose ends that are never tied up or explained, and several plot threads seem underdeveloped. I'm sure some day we will see a director's cut which approaches the 3 hour mark just like \"Heat\", and perhaps that version will overcome of the issues involving character development and plot holes in the theatrical version. Until then, \"Miami Vice\" is a movie that, while far from being a total failure, is none-the-less disappointing in that it had the potential to be a much more complete film than it is.","user":"maxwellsmart","rank":[315,434]},{"title":"Liquid Cinema: Part 1","rating":8,"date":"8 October 2009","review":"\"All is flux, nothing is stationary.\" - Heraclitus <br><br>\"Miami Vice\", \"The Departed\" and \"The Black Dahlia\" were all released in 2006. \"The Departed\" went on to do big business and win several key awards, whilst \"Dahlia\" and \"Vice\" did nothing but annoy audiences tremendously. Their characters were ciphers, the films had little action and despite their tremendous visual style, their plots were a giant bore. I myself found both films almost painful to sit through when first seeing them in theatres.<br><br>But time has a way of putting everything in its proper place. Today I find Scorsese's film intolerable and have since seen \"Vice\" and \"Dahlia\" over five times, the later two films revealing themselves, with subsequent viewings, to be truly spectacular. But isn't that always the case with great films? You're unprepared, they leave you baffled and your immediate response is always to react with hostility.<br><br>The \"Miami Vice\" television series was renowned for its flashy cars, cool clothes, sexy women and glossy look. Police detectives Tubbs and Crockett were as interested in their designer sunglasses and exotic sports cars as they were in catching criminals. The TV series celebrated superficiality and vapid aesthetics.<br><br>The \"Vice\" film, however, is one of profound numbness. This is an anti-procedural in which the characters are all desensitised to aesthetics, director Michael Mann opening the film with Linkin Park's \"Numb Encore\" before throwing his audience headlong into a police story so dense and alien that we immediately become as suffocated as the characters on screen. Tubbs and Crockett have themselves been on the job for so long that everything has long lost its sex appeal. The clothes, cars and exotic locales are now all completely banal. Life has been bled of colour, their toys have been bled of value and everything has a hollow, empty feel.<br><br>The film's plot – the detectives going undercover to infiltrate a criminal organisation – is both unoriginal and unimportant. This is a tone poem, a big budget art movie in the vein of Wong Kar-wai and Antonioni, Mann more interested in crafting a low-key crime story in which business is conducted with the existential detachment of Jean-Pierre Melville.<br><br>When late in the film Tubbs says to his partner, \"So, fabricated identity, and what's really up, collapses into one frame. You ready for that on this one?\", he's speaking of his partner's ability to distinguish between the professional life of a police officer and the domestic realm of romance. But on another level, the film is about the collapsing of identities in a larger sense, the archetypal police hero robbed of all energy, hopelessly fragmented, numb and reduced. The film itself is bookended by the lyrics \"I'm tired of being what you want me to be, feeling so faithless lost under the surface\" and \"one of these mornings, they will look for me and I'll be gone\", both movie and cast bleeding off into melancholic nothingness.<br><br>The flashy universe of the \"Miami Vice\" TV series, with its boundless money, its 80s excess, its glitzy materialism, has been torn open to reveal a vast network hidden deep within. If De Palma's \"Scarface\", released a year before Mann's TV series, exposes the banality of wealth, of pop individualism, of our very own post modern aesthetic, then \"Vice\" the movie tries – like HBO's \"The Wire\" - to map capitalism's unmappable network of corruption and money. This is a complex and illegible world in which it has become impossible to interact if not in a peripheral manner. Everything is in flux, moving, changing hands too quick for minds to process, let alone affect. Money, relationships and people are always in transition. By the film's end, a leak in the heart of a government agency has not been plugged, the villains escape and Crockett loses his girl. Nothing is resolved and everything is liquid. Liquid money, liquid people, liquid jobs, liquid relationships. Everything moves and it moves fast.<br><br>The detectives themselves embody divergent movements. Tubbs is focused, a man of stability, both in his love life and professionally, whilst Crockett is unpredictable, unbalanced and instinctive. He's always gazing out at the horizon, yearning for that utopian \"beach paradise\" that all Mann's heroes long for. But \"Vice's\" utopia differs significantly from the paradisaical longings of the men in \"Collateral\", \"Manhunter\", \"Thief\", \"Public Enemies\" and \"Heat\". Those characters all failed to actualise their idyllic havens because they were unable to separate the \"professional\" from the \"domestic\". But the lesson that \"Vice\" teaches is that the modern man is permanently disembodied. There is no \"actual\", no \"real\", to connect to. The human being has disappeared and dematerialised into the heart of an urban universe governed by technology and money. The post urban world is a confused and atomized mass held together only by the financial tendrils that cross it and the electronic images that recreate the simulacrum.<br><br>Crockett thinks he can resist this global system, thinks he can carve out a place of \"tranquillity\" that exists outside the flux. But this place no longer exists. In a world where a rapid edit is all that separates Miami beach from the slums of Columbia, where money darts back and forth on go-fast boats, where \"product\" circles the globe in Learjets, where identities are readily forged, created and abandoned at the click of a button, how can one truly hope to tear themselves away from the global system?<br><br>Man literalizes these themes toward the and of the film, when a sliding camera motion tracks the entwined hands of Tubbs and his lover. This same horizontal motion charters the disconnect between Crockett and his girl as she leaves on a boat (and their abandoned safe house). If Tubbs and his lover have connection in motion, it is only because they occupy the same professional space. But even this connection is fragile and hopelessly volatile.<br><br>(Part 2 of this essay can be found in my review of \"Thief\")","user":"tieman64","rank":[38,50]},{"title":"A difficult but ultimately exhilarating piece of cinema","rating":9,"date":"9 August 2006","review":"There is almost a documentary quality to this movie. Aside from one short sequence the film almost exclusively focuses on the characters at work. In essence the film is about two groups of exceptionally competent professionals- one set cops, one drug dealers - at work. And their work is a cat and mouse conflict between the two. There are almost no exposition or explanatory scenes. Similarly the film makes no concessions to the viewers in terms of the use professional jargon and language. The viewer is thrown in at the deep end, as in many documentaries, and has to work out for themselves what is going on.<br><br>In other words the film treats its viewers as intelligent people and challenges them to understand. If you are prepared to accept the film on these terms then it is quite a stunning experience - beautifully shot, well acted, with some exceptional and realistic action sequences - by one of the finest directors alive.<br><br>This film is several leagues ahead of the brainless pulp that often passes for thrillers or action movies. Outstanding.","user":"themcquade","rank":[30,39]}]