[{"title":"Knowing","rating":8,"date":"7 October 2018","review":"I love watching movies that leave you just thinking at the end. This movie really did that. Now I'm not really sure why it has such bad reviews but i really liked it and would definitely recommend watching it. <br><br>Its not another end of the world movie where your main characters saves their family and end up surviving at the end, which is something i liked because it shows how Nick cages's character has to cope with knowing that him and his family will die and theirs no stopping it.<br><br>I really enjoyed the ending and how everything comes together at the end to show that this is Gods doing. You would never expect that from the way its played out, other than the foreshadowing from his son talking about not believing god at the beginning","user":"k_van-92622","rank":[22,25]},{"title":"Did Writers Know When It Jumped The Shark?","rating":6,"date":"21 March 2009","review":"This film started out with a real grabber. The whole time capsule thing was working as was the predictions and it had me riveted waiting to find out what was going to happen next.<br><br>Then everything went left and the movie bounded over the shark as Cage begins a wild chase to tell everyone about the end of the world.<br><br>I absolutely believe this screenplay wasn't written with the ending that was in the movie. I figure around one third of the way through someone said, \"hey this is way too M. Night Shymalan, better beef up the special effects!\" That's when the explosions started.<br><br>Then another Hollywood big-wig said, \"hey, we need to add some extraterrestrials or this will never hit\" and so enter the blond guys in the woods. These scenes look like they were re-shot after the fact.<br><br>Finally as Cage is on his knees waving to his son on the space ship, I expected the credits to roll, but no. I feel pretty sure a focus group was show the first cut and they said it was a downer, so...after a rewrite and lots of money on special effects. Voila! End of the world.<br><br>Ten, after another focus group, comes the two kids in Eden ending that looked completely out of place and I feel pretty sure was tacked on after audience reactions ranged from\"but what about the kids?\" to \"that's a downer\".<br><br>All in all, the whole thing went way off the rails and squandered any viewer interest in favor of bad theology and worse writing.<br><br>If anyone can confirm my theories of rewrites and re-shoots, please let me know. Otherwise, I have to believe the producers just got lost somewhere along the way to what promised to be a good film.","user":"hardykh","rank":[301,442]},{"title":"Proyas delivers his best yet","rating":8,"date":"8 August 2010","review":"In 1959, an elementary school buries a time capsule that holds drawings of what the kids think the world will be like in 50 years. When the capsule is dug up in present day, each child is given a drawing from the capsule. The drawing that Caleb Koestler gets isn't a drawing at all. Instead, it's a page full of random numbers. When Caleb takes the paper home, his astrophysicist father stumbles upon the discovery that the numbers seem to have predicted the dates of major disasters which occurred in the 50 years since. Not only the dates, but the number of victims from each incident as well. A fascinating discovery, but more important matters lie hidden in the numbers, as there are three dates and three major disasters to come... and they're coming soon.<br><br>\"Knowing\" is more ambitious than a typical disaster movie. Not really a surprise coming from director Alex Proyas. The closest he's come to generic is \"I, Robot\", by far his weakest work. While certain plot points may be hard to swallow for some, I had no qualms with any of it. Of course, I fully expected the film to be bashed unmercifully by many just because Nicolas Cage is in it. I know people like to criticize Cage every chance they get, but his acting is just fine here. Some of the tender moments between he and his son were actually quite effective from an emotional standpoint. Reading through several of the reviews I've seen, it's clear that some people just have a hate-on for the guy. My girl Rose Byrne shows up halfway through the picture, and while her character is that of a tortured woman relegated to looking distraught and flipping out, she does both well. Her panic at the gas station brought a smile to my face, as I just love watching her work.<br><br>Proyas handles the suspense exceptionally, particularly the buildup to the various disasters. The screws turn slowly, but ever so tightly. As for the disasters themselves, the scene with the crashing airliner is wicked in it's execution. Shot in the pouring down rain and all in one take, we witness the crash followed by Cage sulking amidst explosions, burning rubble and burning passengers. The subway sequence isn't as effective. Not even close, really, but the build makes up for it. The final disaster, which I won't spoil here, is positively fantastic both in buildup and execution. One scene in relation to the final disaster involves a discovery on the bottom of a bed. I felt that this scene made for a very strong gut punch, just well-done all around in leading up to it, music, everything. Chaos aside, I also liked some of the human touches that Proyas threw in. Caleb watching a video of his mother singing him a lullaby is a really strong little character moment in the midst of everything else going on. I also thought Cage's reaction was well-played. <br><br>Now for some faults. The score could be overpowering at times. I also feel that the final scene was not needed. The line about starting over was enough to get the point across, I didn't need to see it. More subtlety would have been most welcome, and ending the film with the earth in cinders would make for a more potent final image. Aside from that, the worst I can say is that some of the acting from bit players was rather on the weak side.<br><br>Overall, I was very satisfied with the final product. It could have used some tweaking here and there, but most films are flawed in some way or another. The twists in the storyline won't work for everyone. It seems a lot of the time when a new film tries to shoe in aliens or any sort of spirituality aspect, it gets branded as some sort of new age crap. I don't subscribe to that thought process. I think it's a strong piece of filmmaking from a filmmaker who doesn't work as often as he should. The masses can have their popcorn films, but I like my popcorn with a few extra layers of butter on top.","user":"Cujo108","rank":[46,61]}]