[{"title":"pleasant surprise","rating":9,"date":"19 July 2007","review":"I went to a small advance screening of this movie on July 19th, knowing no more than the names of a few of the actors and that it was a fantasy/adventure quest of some sort.<br><br>The plot line really is nothing like I have seen, and a unique story is certainly appreciated with everything else that is currently in or coming soon to theaters. In spite of what first impressions may give, it isn't cheesy, corny, tacky, or ridiculous, and is actually highly entertaining and funny. The flow is quite well done, nothing seems rushed or dragged out. The soundtrack, for lack of better words, is magical and adds much to the film, as opposed to simply filling the silence as often happens in movies or TV. And even though I might have known what was coming at points, I still couldn't bear to stop watching the screen; to my knowledge, not a single person left the theater during the entire movie.<br><br>My one gripe is that there seems to be almost no marketing for this film, and as brilliant as it is I can't figure out why.","user":"spiffarriffic","rank":[567,643]},{"title":"Provides more fun than all of the summer blockbusters put together","rating":9,"date":"12 August 2007","review":"The 14 year-old in me is immensely happy that they're now able to make really good looking fantasy movies, and that they're all the rage, what with Lord of the Rings, Harry Potter and The Chronicles of Narnia making loads of cash at the box office. This year will see (and already has seen) several more, most notably The Golden Compass, which has the most exciting trailer I've seen this year. Stardust, based on a novel by Neil Gaiman, showed up in theaters this week with little more than a peep. I saw no previews for it, only a couple of commercials. The critical reaction is kind of blah. I wouldn't even have seen it if not for the fact that I have to wait on a friend to see The Bourne Ultimatum, and that nothing else interesting opened this weekend. Well, if you'll forgive the horrible pun, the stars must have been rightly aligned, because I went to see Stardust, and I loved it. It's not a huge movie like Lord of the Rings. The plot line is your very basic fantasy quest (the hero sets out to look for a fallen star) filled with obstacles. But within that basic outline, the story is lively and imaginative. It's simply aiming to be a lot of fun, and a charming little romance. And it succeeds wonderfully. There were a lot of big films this summer, but none of them were nearly as fun as this one. There's a lot going on, but the story is told well and is almost entirely coherent. It isn't a masterpiece, but it definitely can occupy the same kind of ground that something like The Princess Bride has (though I don't like it quite as much as the earlier film). A lot of fun to be had here if you're a fan of the genre.","user":"zetes","rank":[286,329]},{"title":"Previews do no justice...","rating":10,"date":"2 August 2007","review":"Why are the previews so blah for a movie that is so awesome!! Everyone should know what an excellent movie this is. It is engaging and funny from moment one, original, and well-acted. I wish the movie was doing itself as good press as it deserves!<br><br>For anyone that loved The Princess Bride, Labyrinth, and other truly funny and original fantasy adventure, this is one of the great ones. Robert DeNiro is hysterical. Relative newcomer Charlie Cox is an incredible leading man. Claire Danes is fantastic as always. Michelle Pfiefer is making quite a splash with her recent returns to the screen. There are also a lot of wonderful moments from minor characters...even down to facial expressions.","user":"songbrd427","rank":[657,770]}]