[{"title":"Not very memorable,but entertaining","rating":7,"date":"5 September 2009","review":"The plot summary of Killshot sounds as one of many cheap thrillers which infest the dusty shelves of video stores and the night hour from some modest cable-TV channels, because we have two formulas we have seen on many movies from this genre: the retired killer who is going to do his last job, but is betrayed by his powerful bosses and the couple who accidentally witness a crime and have to run from the murderers.But...wait a minute! Killshot is based on a book written by the brilliant Elmore Leonard,the cast includes various solid actors (Mickey Rourke, Diane Lane, Joseph Gordon-Levitt, Rosario Dawson and Thomas Jane) and it is directed by John Madden, an Academy Award nominated filmmaker with a competent filmography of art-house films.In other words, before watching this movie, you do not have to expect a cheap straight-to-DVD action film in the lines of the ones which are starred by Wesley Snipes, Marc Dacascos or Steven Seagal.Killshot resulted to be a good thriller,and although it is not very memorable,it kept me entertained.<br><br>The story from this film is a bit predictable, but the intense performances and precise direction increase the suspense, so the final result is a competent thriller which achieves a good combination between Leonard's \"noir\" sensibility and a modern cinematographic style.<br><br>I liked the atmosphere of a small town this movie brings and to see the story set in the frontier of the United States and Canada,offering a different landscape to the typical locations from Los Ángeles or New York.I think the best elements from Killshot are its methodical rhythm and the logical chain of causes and consequences which drive us to a satisfactory ending.Although Killshot does not have much in common with Madden's previous films (Captain Corelli's Mandolin, Proof and the famous Shakespeare in Love), his mature and disciplined work is also seen in here, because he lets the story to flow on a natural rhythm.<br><br>In conclusion, Killshot is an entertaining thriller, and I can give a recommendation to it, in spite of being a bit predictable and not very memorable.","user":"Argemaluco","rank":[30,34]},{"title":"Suspense, Thriller, Romance and Missing Pieces","rating":7,"date":"30 May 2009","review":"KILLSHOT is far from being a great movie. I suppose it could be said that it isn't even a movie, but instead a DVD project as it has a rather leaden history. But though there was no theatrical release to garner public interest and little promotional material about its shelf release, it may just find an audience among word of mouth promotion. It has enough elements to keep the interest of even late at night tired viewers - and that says a lot these days. Elmore Leonard's novel has been reconstructed by Hossein Amini and John Madden has done his best to string together the various beads of the plots that comprise this story, and the result is a film peppered by some worthwhile actors who do their best to make the implausible story lines work. <br><br>Armand 'Blackbird' Degas (Mickey Rourke) is a long time hit-man, an American Indian with a past pasted together by tragedies who accepts an assignment to make a new kill. His plan is disrupted by his accidental and maladaptive association with a bona fide psychopath Richie Nix (Joseph Gordon-Levitt) and girlfriend Donna (Rosario Dawson). Nix decides to partner with Blackbird and in the process they encounter a 'couple on the rocks' - Carmen and Wayne Colson (Thomas Jane and Diane Lane) - who happen to witness an incident that puts them in danger of Nix and Blackbird's recipe for not leaving witnesses. The couple is put on Witness Protection Program but that doesn't dent the clever Blackbird from accomplishing his goals. The rest of the story is a cat and mouse chase that has some moments of real terror. And as in most of Leonard's stories, things don't turn out the way they seem to suggest. <br><br>Things are missing from this film that create holes in the story and stretch credibility. The work by the lead actors is quite good as is that of the momentary cameos by such luminaries as Hal Holbrook and Lois Smith. A great film this is not, but a film that maintains attention/tension it is and worth an evening's entertainment. Grady Harp","user":"gradyharp","rank":[48,58]},{"title":"Despite it's flaws, \"Killshot\" is not a total dead loss.","rating":6,"date":"26 January 2009","review":"KILLSHOT with Mickey Rourke, Diane Lane, Thomas Jane, Joseph Gordon-Levitt, Rosario Dawson and Hal Holbrook, directed by John Madden. <br><br>MICKEY Rourke's intense and interesting performance as a troubled hit-man lifts this structurally flawed adaptation of Elmore Leonard's gritty crime novel. Directed by John Madden (\"Shakespeare in Love\"), the film is never as much fun as the book, which was a violent, witty and richly enjoyable slice of ultra-sleazy pulp fiction. But, despite all it's fault (the movie was completed in 2006, but is only being released now), \"Killshot\" is not a total dead loss and is likely to be enjoyed by genre fans who approach it with low expectations. Oscar-nominee Rourke (\"The Wrestler\") plays Armand \"The Blackbird\" Degas ,a veteran, half Indian hit-man for the Toronto mob who slays his boss's girlfriend during a hit. Returning to the rural area where he was raised, he pairs up with dim-witted young psychopath Richie Nix (Joseph Gordon-Levitt). Then, when, when the lovely Carmen Colson (a sexy, effective Diane Lane) sees Armand's face during a botched crime, he decides she must die. And the chase is on. \"Killshot is a rather messy film that shows evidence of post-production edits and re-shoots, but Armand, Carmen and Richie are classic Leonard characters, there're one or two good shoot-outs and at least the films retains some of the master crime writer's wonderful trademark dialogue. Nice scenery too. As a Leonard fanatic, I wouldn't have missed the chance to see this on the big screen for anything (it's been given a national cinema release in South Africa - not a huge one, but way bigger than five screens in Phoenix ). I wasn't expecting much, so I certainly was not disappointed. Quite a bit of the book comes through and although Gordon-Levitt - usually one of my favourite young actors - sometimes goes to far over the top, the supporting cast is pretty good. Thomas Jane and (a totally miscast) Rosario Dawson have some nice moments and there's a cool cameo by the great Hal Holbrook . However, the interaction between Armand and Carmen Colson is nowhere near as intriguing as in the book (perhaps this has something to do with the notorious Weinstein scissors) and even though the picture has been pruned to 84 minutes it still drags in the second half. Reading Elmore Leonard's website the other night, I noticed that the maestro has seen the film (apparently a 100-minute cut) and seems to have enjoyed it, which tells us something. This flawed, but watchable (there's a good film lurking in there somewhere) movie should have been released to more cinemas in the States. Sadly, it doesn't look as if that's going to happen, but I can tell you one thing. It's going to be a solid renter when it hits DVD. Hopefully the distributor will release both this 84-minute cut and a longer version on disc. And let's hope we get to see Johnny Knoxville's deleted scenes, and a director commentary. But I suppose it will only come out in a vanilla version shorn of special features.<br><br>My Rating: 6 out of 10 (on the big screen).<br><br>PS. Drop the score down to 5/10 for the DVD - I've now seen the (South African release)DVD which in the 1.78 aspect ration ratio rather than 2.35.1 and looks shoddy compared to how it looked on the big screen. The film really falls to pieces on a second viewing.","user":"JeffersonCody","rank":[76,107]}]