[{"title":"Quality film making from Disney","rating":8,"date":"30 August 2006","review":"Really enjoyed this film. Went with my almost 13 year old son who is just starting his first participation in organized football in school and I think the film really inspired him.<br><br>No the film does not focus on the Eagles professional sports organization. So if you're looking for a film that does that, you're probably going to be disappointed.<br><br>The film focuses on our hero and to a large degree his neighborhood friends and what it was like for a 30 year old bartender who only played organized football in high school and how he showed up one Saturday at an unprecedented open try out for a professional football team and how he was selected....not selected to join the team automatically.<br><br>No, he was only selected for a spot to possibly be on the team. It took a few weeks of being with the team and surviving 'cuts' until he was actually part of the team.<br><br>The fact that he did make it, against all the odds, is certainly your classic fairy tale come true.<br><br>Disney manages to show rough guys from a rough part of Philadelpia and rough professional football players realistically without ever having to utter one profanity on the screen or use gratuitous violence or vulgarity to do it. That's an accomplishment Disney should be proud of.<br><br>Honestly, as a movie buff, it's been a long time since I've gone to the movies where I was able to stay engaged throughout the running time of the movie.<br><br>The movie isn't pretentious nor does it take the easy way out in telling its story of rough blue collar characters-by employing vulgarity, overt sexuality or excessive violence.<br><br>It relies on tried and true methods like a good storyline, taking the time to establish a good foundation in the beginning of the movie, letting the audience get to know the characters involved and then when the bigger more dramatic moments come it doesn't need to rely on over the top special affects to get the audience involved.<br><br>That being said, the actual professional football game scenes are well done with just enough special affects to give the audience the feel that these actors really were on that playing field playing the game.<br><br>I really can't say enough about this movie. When all the hype fades away on other overly marketed &amp; bigger budgeted movies, it will be a movie like this one, that you'll reach for over and over again in your personal movie library.<br><br>And while we're at it, hats off to Mark Whalberg for a sensitive, well acted portrayal.","user":"mrcaw1","rank":[78,85]},{"title":"Support the underdog, after the movie you will smile!","rating":8,"date":"25 August 2006","review":"After just seeing \"Invincible\" I must say thumbs up! Way to go that finally after 30 years this true story is brought to the big screen. Call me bias or partial because I'm an Eagles fan, but the story of any underdog making an NFL team makes you happy. 30 year old bartender and part-time school teacher Vince Papale who finds life a struggle from his wife leaving him, to problems paying his bills he finds only one hope that is to escape thru his love and passion for the Eagles. Papale a season ticket holder and sandlot football star decides to give himself a shot at a better life in 1976 when newly hired coach Dick Vermil decides to hold open tryouts. Papale has the odds stacked against him, but thru his will and determination to make it, because no one ever expected him to do anything he prevails! Papale lands a roster spot as a special teams player a blue-collar guy doing blue collar work on the field. The scenes and background of this movie, especially the way Veterans Stadium is shown is sketchy and unbelievable, but the story is true and touching. Vince Papale played for the Eagles for three seasons, well acted and done by Mark Wahlberg who showed enthusiasm with this role. Also Greg Kinnear is great as legendary head coach Dick Vermeil, overall a great movie of an underdog that leaves you smiling at the end. I hope more real-life NFL movies are made about players, because \"Invincible\" sets the standard.","user":"blanbrn","rank":[69,78]},{"title":"Wahlberg and Kinnear seem so easy wearing their roles naturally in this NFL sanctioned film about Philadelphia Eagles' Vince Papale and Coach Dick Vermeil","rating":8,"date":"30 August 2006","review":"Both Mark Wahlberg and Greg Kinnear are such naturals in delivering their characters. When in fact, from the production notes, Wahlberg went through actual football training/coaching, being there with the team for every play and practice, gaining insight into his portrayal of a real living person. Both met their inspired 'hero'. For Kinnear, he received confirmation when Vermeil's son indicated that he got his father's mannerism/cadence spot on. The operative word here is 'genuine,' caring and intensely so. They worked hard preparing and learning to correctly portray the two NFL notables.<br><br>Papale and Vermeil - they needed each other (or fate brought them together). In a way, both are in the same boat: struggling to gain confidence by the rest of the team. Against all odds, they did it and won over the rest of the South Philly Eagles team and the PA fans. Yes, it is inspirational. Yes, it's been told before. Why so different? This film being NFL sanctioned is the more earnest in getting it right in every respect for authenticity. The shots of the different plays and athletic moves get up close and real with a trained acting team and augmented sound design.<br><br>Double duty as director of photography and director of his debut feature film, Ericson Core, faithfully puts us in the year 1976 recreated. The Jim Croce song that started the film \"I Got A Name\" is reminiscently catchy and hints at the personal struggles of Papale. With Sara Knowles (\"Gattaca\") production design, Susan Lyall (\"Mississippi Masala\") costume design, vital Football Coordinator Mark Ellis (\"Miracle\") who studied/choreographed the plays and moves for specific film shoot, and having Vince Papale and Dick Vermeil as consultants at hand, Brad Gann's script and a strong supportive team of producers, all made \"INVINCIBLE\" unarguably a worthwhile film to see.<br><br>I went into the cinema with no expectations - feeling fortunate to see Wahlberg and Kinnear both in one movie. I find the film heartwarming (a tearjerker for me, too). It encourages roots: remember the buddy friends, neighborhood community and parents who'd stand by us. The tenacity to not give up - keep trying, focus on task at hand - doing your best is no failure no matter what others may think. The integrity of one's character and believing in oneself is not easy to sustain in hard times. Support system close to you is important: Papale has Janet's encouragement and Vermail has his wife's timely reminders. We need such spirits genuinely emanated in films like \"Invincible.\" <br><br>Greg Kinnear came a long way from the remake of \"Sabrina\" opposite Harrison Ford. His diverse roles in \"As Good As It Gets\" opposite Jack Nicholson, \"Auto Focus\" opposite Willem Dafoe, \"The Matador\" opposite Pierce Brosnan, and \"Little Miss Sunshine\" along with an ensemble of talents, demonstrated how vastly skillful he's become. Mark Wahlberg can be underrated - it's almost all him in \"Boogie Nights\", funny fantastic in \"The Big Hit\", quietly solid in \"The Yard\" (opposite James Caan), 'funkily' good in \"Rock Star\", smooth action in \"The Italian Job\" remake, gritty action in \"Four Brothers\" - he holds his own in a wide variety of complex and challenging roles, be it \"Three Kings\" or \"I Heart Huckabees\".","user":"ruby_fff","rank":[27,29]}]