[{"title":"An homage to everything","rating":7,"date":"5 March 2006","review":"James Gunn wrote Slither as an homage to the horror movies he loved. Every single one of them. From the Deadly Swarm, to The Fly, to the Toxic Avenger, to Basket Case, to some films most people wouldn't know much about.<br><br>The film is about a loving husband (though noticeably not the best. His love for his wife is one of his better sides) who is stung by an alien insect. He starts mutating into a squid beast while slug like monsters Terrorize a small town where cell phones don't exist.<br><br>It's obvious from the previews that this is a bit of a comedy. You'll be surprised at just how suspenseful it really is. The horror ranges from cheap pop-outs, hilarious gore, and heart pounding action in a genre bending film that is like Tremors for adults.<br><br>The movie is well acted, and all the actors have such great chemistry together. While the movie isn't an excellent film, those looking for a good time have nothing to complain about. It keeps the audiences entertained like few other movies can.","user":"Newski_the_Hippie","rank":[238,280]},{"title":"A Horror Movie Made By Horror Fans for Horror Fans","rating":8,"date":"31 March 2006","review":"Today, I am a happy gorehound. I've just seen \"Slither,\" and it was a truly good time! OK, let's face it... this one isn't going to win any awards for originality. The story here is \"Invasion of the Body Snatchers\" meets \"Night of the Living Dead\" with hints of \"The Blob,\" David Cronenburg's \"Shivers,\" and a more-than-passing special effects nod to Brian Yuzna's \"Society.\" But it WORKS here.<br><br>James Gunn, a veteran of Troma Studios, has made a horror fan's horror flick. Laced with homages to everything from 1950's drive in cinema to R.L. Stine's \"Goosebumps\" books (not to mention a clip from a Troma movie on a TV in one scene). Gunn clearly knows his audience, because he IS his audience. He delivers up a movie that might be formulaic, but its over-the-top gore, it's black humor (this is one horror show that never takes itself too seriously), and it's general gung-ho, pull-no-punches attitude turn what could have been yet another plodding bit of cinematic flotsam into what could well be an instant horror classic on par with \"Re-Animator.\" If you know what I'm blathering about here, if the names and the titles of these films are familiar, then see \"Slither.\" You're going to love it.","user":"w00f","rank":[189,224]},{"title":"As pure B-movie fun, Slither pulls no punches.","rating":9,"date":"30 March 2006","review":"It is absolute fun, plain and simple. It gets in, does it scares and it's laughs, and gets out quick. As what it was meant to be, it was absolutely brilliant. It does its own thing, and it does it perfectly, and the result is pure entertainment, nothing more. So, if you like movies like Shaun of the Dead, Army of Darkness, Dead Alive, Gremlins, Tremors, or anything in that vein, you will like this movie.<br><br>Or if you just wanna see Captain Mal Reynolds (Nathan Fillion) again on the big screen and wistfully wipe a tear or two away, you can go see this movie too.<br><br>It's creepy, it's gleefully gross, it's HILARIOUS, and I don't think I wasted a single minute watching it. Great movie.","user":"urthstripe321","rank":[121,143]}]