[{"title":"This is a masterpiece","rating":10,"date":"5 March 2019","review":"This movie is so beautiful. The horrible green screen effects, the villain Linus,the dream journal,the horrid acting ,and the dream song.I LOVE IT SO MUCH! Watch this movie you will be in for a huge ride.","user":"coldenlamb","rank":[37,38]},{"title":"Postmodern Masterpiece","rating":10,"date":"10 October 2011","review":"The Adventures of Sharkboy &amp; Lavagirl<br><br>This film is absolutely not for children. But is a postmodern masterpiece. It is a surrealistic nightmare on par with Eraserhead, as a young boy uses dreams to escape from the ennui of average suburban life. The purposely amateurish CGI work is an obvious satire of the blatant overuse of computer generated imagery in modern films. Additionally, the 3D work is a subtle undermining of the corporate film industry's reliance on this gimmicky technique. It is a psychedelic and stylistic tour de force, by far Rodriguez's best film. The script is a powerful exercise in stream-of-consciousness writing. You must see this film, but put the kids to bed first!<br><br>A+","user":"PoprocksAndCoke","rank":[40,46]},{"title":"Good for kids","rating":8,"date":"15 June 2005","review":"Well, I didn't like it. Or, at the least what I mean is that I just saw a movie with tons of plot-holes, childish themes, and so on. However, you better believe my kids loved it. My son actually hooted and hollered when Sharkboy started fighting the plugs. He grabbed my shirt and motioned for me to watch, even though I already was. I think I just witnessed my son discovering his first hero.<br><br>My daughter laughed and laughed. She loved Lavagirl. She thought it was hilarious when Lavagirl zapped Sharkboy because he said someone else was prettier. And my daughter is old enough to understand the themes of pursuing your goals and remaining strong in the face of discouragement. So I think she walked away very pleased with the film. She said she wants to be Lavagirl for Halloween.<br><br>If you're 16+ this movie is a loser. You won't like it, and that explains all the low scores you're seeing here. This movie just isn't for adults. But if you are a parent looking to entertain your kids, this movie works. And if you are reading this near the end of 2005 or later, you should probably know that renting this as a video will be a fine way to keep your kids occupied.<br><br>-Tony","user":"Anthony_Boyd","rank":[128,161]}]