[{"title":"A rich staging overshadows narration and plot weaknesses","rating":7,"date":"20 February 2007","review":"Like many films starring teens or pitched to a teen audience, Cherry Crush falls short on intrigue and plays long on wrought dialog and narration. What Cherry Crush has that say, Cruel Intentions, doesn't have is a languid and saturated visual feel that distracts from the film's occasionally empty writing. The film has a similar feel to The Virgin Suicides, which also focuses its artistic energies on creating rich landscapes and detailed portraits of its characters (rather than character development). Director Nick DiBella's choice to prioritize style is a good one given his strength with the camera. It's no wonder that the protagonist in his co-writing debut is a photographer.<br><br>Because of its sophisticated cinematography and laudable go at film noir in color, Cherry Crush deserves to be offered to an art house audience. The story of a rich kid bewitched by a mysterious pauper isn't a terribly sympathetic, but putting the failures of the plot concept aside, DiBella captures his subject well.","user":"rw212605","rank":[20,29]},{"title":"Beautify Cinematography but no story behind it","rating":4,"date":"23 February 2007","review":"This movie is beautiful to look at. Rochester has been transformed into a real live movie venue but that's where the professionalism ends. The story line and characters are under developed and poorly written. Despite the voice over you never learn what dastardly deed the lead character did to turn him into a bad boy and get expelled from private school. The photos he shoots of his love interest are slick, professional and commercially beautiful but don't reveal anything more than a glam shot from a slick magazine does. I kept wanting to see some gritty, 18 year old's idea of honesty, something cutting-edge, and I never got it. I never believe that his family is pressuring him into a life he doesn't want and the women around him look an awful lot like they're from Greece, NY not some fantasy Film Noir landscape. <br><br>The entire film noir aspect of the film is only defined by the great music track. The script and visuals are in constant conflict with the premise of the murder mystery. The writing never gives the viewer enough details to provide a great ahh-ha moment at the films end. <br><br>The amused audience seemed more interested in catching their own faces and spotting Java Joe's product placement than on the quality of the story. The film looks great but just doesn't deliver.","user":"rochviewer","rank":[27,42]},{"title":"Good But Not Great","rating":6,"date":"29 May 2007","review":"Not bad at all, but not quite as good as I was expecting from the comments here. Jonathan Tucker does his best Toby Maguire in this story about a privileged young photographer who gets mixed up with a girl from the wrong side of the tracks.<br><br>As I watched this movie I tried to figure out what separates it from The Crush with Alicia Silverstone or Devil in the Flesh with Rose McGowan. While not directly analogous, those movies have the same type of noir lite feeling to them. But the difference is, aside from the fact that this movie really strives for believability and has decent writing, that those movies had lead actresses that really crackled on screen. I mean, you knew you were going to be seeing more of Alicia Silverstone after The Crush, or at least you should be.<br><br>Not so with Nikki Reed. She does a nice enough job and there's a restrained quality to her performance--to this whole movie really--that works well. (Too often this type of movie veers toward gushy melodrama and Cherry Crush manages to rein that in.) But again, Ms. Reed is not a show stopper. In fact, I found myself more interested in Julie Gonzalo on screen, even though she's got the boring, goody two shoes role.<br><br>What's worse is that there's no real chemistry between Reed and Tucker.<br><br>With that said, this movie has some nice touches. The high school seems especially real. The idea of being privileged is handled with respect, not given a superficial treatment. The second half of the movie becomes more involving than you expect and the ending is believable.<br><br>Overall, I liked it. But I wouldn't be surprised if I see it in the video store soon. It's better than some USA movie, but it's not quite ready for movie theaters either.","user":"KALE808","rank":[17,25]}]