[{"title":"Leaves a smile on your face - plain and simple.","rating":9,"date":"27 March 2007","review":"Surveying the wreckage of numerous other such films - burdened at their outset with flimsy premises, one-dimensional characters, stale gimmicks that coast on the fumes of pop cultural trends, and implausible \"meet-cute\" situations - which could not be sustained even with big-name talent, inestimable budgets, and plague-like advertising campaigns, I was understandably sceptical as to how the \"romantic comedy\" aspect of this film might play out when I first sat down to watch it. In retrospect, I honestly couldn't have been more pleased. Rare indeed is the occasion when I have walked out of a theatre feeling unambiguously good about what I saw, believing that it was well worth the time and money I spent to watch it.<br><br>The story forming the basis of \"Starter for 10\" is handled with a great deal of humour, sensitivity, and intelligence. At no time did any part of it feel forced or contrived, nor was it condescending. Testament to this film's openness and accessibility, the emotional connection that I formed with the primary character (James MacEvoy - may he have a long and distinguished career ahead of him) was subtly cultivated throughout, reinforced by simple - yet heartachingly truthful - moments of confusion, awkwardness, uncertainty, and disappointment of the kind anyone might experience (and probably has) in similar circumstances. \"Starter for 10\" masterfully captures the spirit of that time in one's life wherein a person fully enters the world and begins to establish her- or himself as an individual.<br><br>So often, and unfortunately, it is the case that I see people on the screen with whom I cannot identify, in situations to which I cannot relate (this is typically due in part to the performers' overblown celebrity status and the general \"Hollywood\" gloss that is spread thickly over the top of everything). Not so where \"Starter for 10\" is concerned. <br><br>Perhaps it's no coincidence that \"Starter for 10\" references \"The Graduate,\" since I believe it shall, in time, prove itself a worthy descendant of that film's legacy and subsequently receive the higher profile that it deserves.","user":"SprngsEternal","rank":[58,71]},{"title":"University Challenged - A love song to the other British Eighties...","rating":8,"date":"20 April 2007","review":"Tom Hanks knows what he's doing when he puts his ha'penny's worth in as an executive producer - this has had sleeper hit written all over it from day one.<br><br>Lovingly made, with a nicely observed, but still sweet, story of social and socialist morals in the Eighties, it is evocative and rings (mostly) true. The performances are solid, the director gets the era right; but, and here it scores great points: it also has some real soul, and though in places an exercise in capturing its time it has a real wit, and intelligence as well as deprecating humour that serve it well.<br><br>Funny, intelligent, and definitely deeply romantic - it is also an amazing nostalgia trip for those of us who were around in Britain at that time. The production design has obviously been at great odds to make this work; from the posters in the student bedsit to the clothing it is very well thought through. Aided by a very competent script, that is just too worked through and lacks some real teeth to be really outstanding - it is much better than most American romantic comedies as it is so much more than boy meets (two) girls (and well you know the rest)...it actually touches a much wider world, and questions some values that are worth remembering. Moreover, even at its most manipulative it still somehow has real heart, and just carries you along.<br><br>It would have been great to have balanced the many laughs with some more complex dilemmas - but this is a surprisingly rounded comedy - a definite must for those who remember Britain in 1985 - without bashing at the politics endlessly - but it is just as enjoyable as a great romantic drama-comedy in its right... the Wedding Singer with much bigger brains... <br><br>Overall, impressive for its evocation of a lost age - before brands and spending took over the world - and it is guaranteed to make you grin - especially if you were there - and to sing - along. The theme of University Challenge alone will reduce a whole generation to wobbly nostalgic has beens. Excellent stuff, and one to be simply enjoyed.","user":"intelearts","rank":[30,35]},{"title":"Sweet, moving, emotional winner","rating":10,"date":"21 September 2006","review":"I attended the world premiere of \"Starter for Ten\" at the Toronto International Film Festival. First things first. Just as director Tom Vaughan did in introducing the film, let's get the explanation of the title out of the way. The plot centers around a group of university students competing on \"University Challenge,\" a popular UK quiz show in which the host begins by announcing, \"Starter for Ten...\" The American equivalent would be, \"I'll take Famous Armadillos for 20, Alex.\" Now that we're set in place, let's get set in time.<br><br>This is a period piece -- 1985, to be exact. And make no mistake about it -- the filmmakers went all out to recreate the mid-80's -- sets, costumes, hair and, most importantly (for this writer, anyway) the music. And oh, what great songs. That had me from the word \"go.\" Finally, we need a protagonist. One who is captivating enough to command 90 minutes of our time. And this is, perhaps, the crowning achievement of this film. His name is James McAvoy, and he had no less than three films screening in Toronto this year. Talk about prolific. Though a bit older than the character Brian Jackson, he's convincing as a teenager off to discover himself and of what he is capable, in school, life, and affairs of the heart. He wins us over because he commands the screen and the script, and has the eyes of innocence and vulnerability with which we can all identify. He is everyman -- every boy/man -- and no doubt we see our own coming-of-age through his eyes. Throw all those elements together with a compelling love story and you have a formula for success. I asked McAvoy after the screening what his most difficult scene was. Without giving anything away, I'll just say that he becomes emotional at times, and quite convincingly. He told me that he had to keep reminding himself that it was Brian who was sad, not James. That's powerful stuff. This is a sweet, moving film which left me wanting more. I'll take \"Starter for Ten,\" and I think you will, too.","user":"larry-411","rank":[63,83]}]