[{"title":"Israeli Connection","rating":2,"date":"16 April 2020","review":"I really disliked this movie! Both main actors, The Israeli settler and the deflowerer, performed stiffly throughout the dull film. With \"Wonder Woman\" we wonder why they think we will come back. What less could we expect?","user":"roger-stark","rank":[8,8]},{"title":"Silly action movie = no masterpiece","rating":4,"date":"10 June 2017","review":"I wanted to like Wonder Woman, but I just can't get aboard the hype train. It's really the same as every other cartoonish, overblown comic-book action movie, except with a female protagonist.<br><br>Actually, this is worse than the average comic book movie, because it preaches to the audience about pacifism but then hypocritically celebrates \"heroic\" violence. In other words: Wonder Woman is an alleged pacifist who kills a bunch of people. Wonder Woman is also an alleged feminist, who allows Steve Trevor to drive the entire plot and basically steal the movie from her. Really, this thing is about as progressive as Dick Cheney's great-great grandfather.<br><br>I could forgive Wonder Woman's flimsy social commentary, if it were any good in other respects. But the plot is loose and shabby, the CGI is poor, and about half the scenes were shot in front of a green screen. Sometimes, I couldn't tell if I was watching a real movie, or Patty Jenkins playing God of War on her Playstation 2. (When exactly did cinema and video games blend into this horrible hybrid art form, which has none of the beauty and charm of old-school cinema?)<br><br>And don't get me started on the villains. The World War I era Germans are depicted as cartoonishly eeeevil, while the same era's British Empire is held up as a heroic ideal. Meanwhile, the main villain is a nightmare of bad CGI, who looks like he belongs on a 1980s heavy metal album cover. Naturally, they got a wonderful actor for this stupid part and wasted him entirely.<br><br>Perhaps I'm going overboard on criticisms, but we need some balance to the rapturous praise this film has received. Movie fans often accuse professional critics of being too harsh, but lately, I think critics have actually become too lenient. Mainstream movies get dumber, louder and tackier all the time, and they are increasingly substituting mawkishness for real emotion and character development. And yet the critics have given this thing a great Rotten Tomatoes rating! I guess we've all lowered our standards to rock bottom?","user":"WeeClaude","rank":[1,1]},{"title":"Lazy writing at its best","rating":6,"date":"9 June 2017","review":"First of all, this movie only made money because it's a superhero movie. Everyone likes superheroes and there is no way a parent is not going to take their children to see it. Look at Transformers. Most of the movies are downright idiotic but it still makes money because it's.....Transformers. So all popular comic book hero movies will make money period. <br><br>I can't make sense of the movie and I really don't think the writers knew either. Her morales flip flop, the bad guy has no real reason to be \"bad\", the good guy has no real reason to \"die.\" The side characters really didn't serve much of a purpose.<br><br>Some parts of the movie are decent and a few seconds later, the same scene turn into a total crapfest. The 3rd part is an utter mess and that act alone should be more then enough reason to keep WW off the top of the charts but somehow has a 94% rating on RT? That right there shows you that ratings are padded because you can't have at least 1/3 of a movie be total trash, 1/3 of the movie just corny dialog and somehow end up at the top of the charts.","user":"kamin-987-808346","rank":[807,1]}]