[{"title":"Thank you Kelly Carlson","rating":5,"date":"16 December 2009","review":"I saw this movie on TV and it left me in a state of confusion. I simply could not understand why the people making this movie, made so many misstakes. And what was up with those opening scenes? I got Rambo flashbacks during that. I consider myself to be within the target audience, boys who like action movies with guns, babes, car chases, fights and so on. The problem with this movie IMO is that it underestimates its audience. Just because we like action movies, does not mean we like movies with just action scenes. Nor does it mean that you do not have to make any sense.<br><br>10 years ago i would have thought that this movie was tha bombe. I would have thought that it was cool. However this is not 1999, it's 2009 (yes, i know the movie is from 2006). After all the things that have happened in the last couple of years, you simply can not show such unbelievable stuff as getting shot at a 120 times from 3-10 meters away during a car chase and not get hit once (outside the Matrix of course).<br><br>This movie made me doubt myself. Have i learned so much about combat tactics, guns and ammo, warfare, law enforcement, crime and human frailty (from watching Discovery Channel and National Geographic) that i am simply incapable of enjoying a simple action movie? After thinking a lot about that i concluded that the answer is yes. Yes, i know to much to enjoy a simple action movie. And The Marine is about as simple as it gets. A bit more work on the script to make it more logical and coherent and this movie would have scored at least 1 more point (probably 2). I know the marines are tough guys, but i also know marines are not dumb. Stubborn yes, but not dumb. The marine in The Marine is tough and dumb.<br><br>The Marine is fun to watch, but only when you have nothing else to do. If you need to kill some time, then The Marine will kill it. And you will watch it all the way to the end because of Kelly Carlson. If you are a man you want her to be your lover or hostage. If you are a strait woman or gay man, Kelly Carlson's hair will make you go \"oh wow, look at that, that is hot\". But remember, if you want to enjoy it for more than Kelly Carlson, dumb yourself down a bit.<br><br>I gave this movie 5 stars. 1 for Kelly Carlson and her hair, 1 for Robert Patrick and his lines, 1 for the guns, fights and explosions, 1 for the cat-fight and 1 for giving me hope that one day someone will give me a multimillion dollar budget to make my own action movie.","user":"FatandUgly","rank":[19,22]},{"title":"Legendary","rating":6,"date":"13 October 2009","review":"This film has everything! Explosions, humour, cheesy lines, hot women and an enjoyable plot. This was not intended to be a big budget box office film, it delivers what it is meant to. If you are a fan of cheesy Arnie films from the 80s then this is the film for you. You certainly learn a lot from watching The Marine;<br><br><ul><li>John Cena is bulletproof</li></ul><br><br><ul><li>John Cena is like 'The Terminator'</li></ul><br><br><ul><li>South Carolina has Alligators not Crocodiles</li></ul><br><br><ul><li>John Cena can take on a whole Taliban base by himself</li></ul><br><br><ul><li>South Carolina possesses fridges that can chill beers instantly</li></ul><br><br><ul><li>In the world of John Cena, everything blows up</li></ul><br><br><ul><li>John Cena has the ability to jump 3 metres high, impressive</li></ul><br><br><ul><li>Robert Patrick wants cable</li></ul>","user":"Jimmyp89","rank":[14,16]},{"title":"One of the worst action flicks I've seen in a long time","rating":2,"date":"11 April 2009","review":"About 2 decades ago, people witnessed the age of when the action genre in films was at its finest. The world was given some of the greatest action entertainments ever (Terminator's 1 and 2, Die Hard, Predator, Robocop etc). And all of that was shamefully thrown away for the cheap rip-off's just so Hollywood can make a profit. And here we get WWE starting to finance and distribute films in hopes of expanding their fanbase and their publicity. And they start by throwing their superstar John Cena in his horrendous, over-the-top debut.<br><br>\"The Marine\" follows John Triton (Cena) who has been recently discharged for disobeying direct orders and he now has a lousy security job (but at the end, the problem of having a job he hates isn't even resolved, but what do we care?). Later on, a group of diamond thieves who are trying to evade the authorities after their latest heist kidnap Triton's wife. Triton decides to do the usual in a dumb action flick; he decides to go after them and take the law into his own hands. But the plot itself is too weak for us to care about what's going on. I mean the problem basically occurred by chance and coincidence when Triton and his wife just happened to be at the wrong place at the wrong time at the gas station. And all the plot elements don't mesh together very well.<br><br>And of course its action because the WWE wrestlers just want to prove their masculinity. And overall, the action sucks. There's explosions and gunfire, lots and lots of explosions and gunfire. But the special effects team must've been on crack because the blasts look like splashes of Sunny Delight, and the gunfire looks like it was made from a home computer with just that stupid orange X and the annoying sparkles that we see.<br><br>And the acting performance by Cena is atrocious and more wooden than a redwood forest. Robert Patrick as Rome is sub-par since he wasn't as threatening as he used to be in Terminator 2 and even in Die Hard 2 which he appeared in only 2 scenes. He's pretty much just spewing out dumb one-liners and acting goofy. All that, rather than the intimidating silence he's known for.<br><br>And the rest is just a bunch of badly timed jokes, dialogue and scenarios. Especially the part when Morgan is telling about his experiences with his camp counselor and Rome ordering him to find the generator. That part was WAY outta place, badly acted and awkward and it felt like it was never gonna end. And towards the end when Triton surely kills Rome in the blast, then after reviving his wife, Rome suddenly rises again with severe burns and then Triton kills him for good, VERY VERY B movie, if you ask me. And the \"The Marine\" is chock full of moments like those.<br><br>I didn't give this the lowest score because some of the fist fights here were alright and I liked some of the pop-culture references such as the ones to Terminator and Scarface here.<br><br>But don't waste your time, this is for John Cena die-hards only......","user":"shortround8391","rank":[17,22]}]