[{"title":"Transformers","rating":8,"date":"5 March 2020","review":"Steven Spielberg and Michael Bay team up for the exciting and action packed blockbuster Transformers. Earth becomes caught up in a war between two groups of alien robots that have come in search of a device that gave life to their planet. That cast includes Shia LaBeouf, Megan Fox, John Turturro, and Jon Voight, who all bring a certain charisma to the film. But the real stars of the film are the special effects, which are amazing. And Michael Bay does an excellent job at delivering high energy action sequences that are visually stunning. The writing is exceptionally poor and the film goes on for far too long, but the action and the visual effects keep the audience engaged. Transformers is messy and cheesy, and sophomoric...but it's also a lot of fun and immensely entertaining.","user":"MR_Heraclius","rank":[38,42]},{"title":"When Summer Blockbusters Go Really REALLY Wrong.","rating":1,"date":"8 July 2007","review":"When the announcement came for a new Transformers movie for Summer, I was pretty excited. I wasn't a major Transformers fan, but I had fond memories of the cartoon and toys. However, I hated the re-designed Transformers, thinking that these new designs were an overly busy cross between Lego's Bionicle toys and expressionist modern art sculptures. I also heard the script was poor, so I decided to skip this one.<br><br>However, I started hearing movie reviews about what an amazing film this was. \"The greatest film of all time!\" people proclaimed. So I came to terms with and accepted that these weren't the robots I grew up with, this was a \"new\" version, and I'd at least find interest in robots transforming into cars and beating each other up. I'd even go see this even though I don't like Michael Bay films.<br><br>How was it? Transformers is a disgustingly bloated and self-indulgent piece of crap. I understand that I'll get rated down for my review, but I'm prepared to accept that. Sadly, my theater must not have gotten the euphoria inducing gas that apparently other theaters got, causing me to gush over this film like other people.<br><br>Even the 1986 Transformers film wasn't perfect. It was basically one fight scene after another, and was a means to replace the old toys for a new line, but the action was good, showed the consequences of war, and featured the death of a beloved character. It kept true to the mythos, even though it was different. This movie makes reference to so many other films that it feels like a mishmash of 30 films you've seen before.<br><br>Bumblebee sends up an \"Autobat Symbol\" to summon the other Autobots like Batman. There's a scene in an underground bunker which felt totally pulled from Terminator 3 (and a few scenes later, uses the exact drumbeat from the \"Terminator Theme\"). The fight scenes with their out of focus cameras and \"shaky cam\" style seems like they are trying to treat the battles as if they were \"Saving Private Ryan\" caliber. When Bumblebee gets captured during a scene, the music swells up so mournfully and overdramatically, that it makes the tragedies found in \"Schindler's List\" seem modest.<br><br>The biggest problem in character design lies in the fact that they all really do look alike. The worst offender was the Decepticon Frenzy, which looked like a 3D rendered pencil scribble, and acted like the Zuni Fetish Doll from \"Trilogy of Terror\". During the final battle, I was having problems telling who was who, and when the robots collided, it was hard to see where one began and the other ended. The car forms were presented as blatant product showcases, ripped straight from a commercial. Then again, there was so much product placement in the film. eBay must have made a fortune.<br><br>The slow set-up to the action or even any real glimpses of the title characters felt like \"The Hulk\". I pay for a movie about transforming robots, that's what I want to see.<br><br>Why would they keep a deadly robot under Hoover Dam, a major water source and tourist attraction? Why would they bring this \"All-Spark\" out of the desert and into a heavily-populated city where property damage and civilian casualties could run their full course. The dialogue was painful, sounded like it was written for teenagers, by teenagers in a really bad fanfic like what they thought people would say. What really irked me is how the Autobots couldn't seem to kill a Decepticon, but a lone soldier skidding on his back could dispatch one with a single shot. Why were the Autobots even there if the humans could do it better? How is it that they can save Bumblebee, but they can't repair Jazz? What was the difference? The government/military/robot/anyone dialogue was totally unrealistic, with officials willing to \"bet their ridiculously high government paychecks\" on hunches. Every line smacked on bad puns, clichés, or just sounded stupid. There was an extended conversation about masturbation between Sam and his parents that felt really awkward and extended far too long.<br><br>The personalities were also way underdeveloped. Transformers has over two decades of history that wasn't touched upon. The Starscream and Megatron rivalry, where Starscream tried to usurp Megatron for leadership was not mentioned or covered at all. Jazz was cool and fun-loving with a sense of style, while in the film he sounds like a ghetto thug. His first line is profanity, and I felt insulted. Not because of the language, but the fact that this was apparently the best the writers could do. Decepticons were introduced and blown away within minutes. The Autobots weren't much better. Did the people who wrote the story know anything about the subject material besides the fact that robots changed to vehicles? And then Optimus Prime. Obviously, Bay's madness knew better than to totally ruin this character, as he was the only robot who looked even remotely familiar to any previous version. And the personality was fairly accurate... up to the backyard scene, where Prime's personality suddenly shifts, breaks character, and he becomes a clumsy comedian. The next scene, he shifts back into a \"leader\" personality.<br><br>The saving grace outside of Prime was Sam Witwicky (played by Shia LaBeouf), who brought a credible \"gee whiz\" performance to the film, and yet I felt sorry for him using such ham-fisted dialogue.<br><br>Summer 2007 has been really mediocre for \"blockbuster\" films, as we're apparently supposed to lower our standards, \"sit back, not think and enjoy\" with these types of films, but how is one supposed to do that with with film devoid of heart, personality or no focus on the main characters? As a stand-alone film, this is a really bad movie. As a Transformers-licensed film, it's a God awful embarrassment. I'm avoiding the sequels unless they drastically overhaul the franchise and get a script not limited to high-school level online fanfic.","user":"GuyCC","rank":[667,1]},{"title":"Don't shy away from \"Transformers\"...this is in no way a kids movie","rating":6,"date":"27 June 2007","review":"I went to see an advance screening of \"Transformers\" tonight, and I walked out of the theater in disbelief. Not because the movie wasn't what I thought it would be, but on the contrary, it was so much more than I had ever expected.<br><br>Going into the theater, I was expecting a corny kids movie with decent acting and a fantastic, unrealistic plot. Needless to say the plot was indeed fantastic and unrealistic, but it was all kept in check with solid acting and the most incredible display of visual effects that I have EVER seen. Most...actually almost all of the acting credit in this movie has to go to Shia LaBeouf, whom is quickly becoming a Hollywood star after recently giving an excellent performance in the thriller \"Disturbia\". It was another great performance from Shia in \"Transformers\", with his clever wit still ever present.<br><br>However, the most impressive aspect of \"Transformers\" was most certainly the special effects. The robot vs. robot fight scenes were, in a word, remarkable. I didn't know that modern day special effects could produce images so fantastic AND realistic, to the point where the robots didn't seem computer generated at all. The interaction between human and robot was beautiful and flawless. It seemed like the actors were actually interacting with real, 50 foot tall robots during the movie. \"Transformers\" will, without a doubt, be the pioneer for future cinematic visual effects.<br><br>The plot may have been a little unrealistic and some of the acting a little sketchy at times, but it does not in any way override what was truly an entertaining movie. The plot simply stayed true as best it could to the cartoon story without becoming overly ridiculous or corny. When I say unrealistic, that does not mean \"cartoon-corny\". In fact, I would recommend that ANYONE over the age of 13 go to see this movie. I promise you won't be disappointed.","user":"PretentiousID","rank":[849,1]}]