[{"title":"Silly, but a lot of fun","rating":6,"date":"17 October 2006","review":"If you don't take it too seriously you'll really enjoy this. Noah Wyle returns as the Librarian Flynn. This time he sets out to find King Solomon's Mine together with the help of fellow \"nerd\" Emily Davenport (Gabrielle Anwar). I found a lot of similarities to Indiana Jones as well as The Mummy is this film. But it did not ruin the Librarian 2 for me at all. It's still different enough to stand alone. I think the character Flynn makes this movie. He is an interesting and well written character who really entertains. I also enjoyed the addition of Gabrielle Anwar, whose love/hate relationship with Flynn creates some nice laughs. Overall The Librarian 2 has enough action, adventure and twists to keep you interested. Basically if you liked the first one, you'll like this one.","user":"deejou","rank":[56,71]},{"title":"This was just wonderful TV fare","rating":9,"date":"4 December 2006","review":"What fun! Noah Wyle strikes gold as the intrepid explorer/adventurer Flynn. I had been waiting for a sequel since the first one some years back. And I couldn't have been happier with the results.<br><br>Aside from the brilliant production it is the writing that shines here. Well-thought out plot line with all the magic and silliness this kind of entertainment demands. Everything was in its place and geared up to thrill you.<br><br>Having dispensed with the background of how Flynn becomes the iconic librarian, this second chapter hits the deck running from the get go, never stopping to catch its breath.<br><br>The twists on Solomon's story were creative and exciting. The romance like a hundred other ones yet -- surprisingly fresh because of the chemistry between Noah Wyle and Gabrielle Antwar. Fire!<br><br>Bob Newhart is just a giant in subtle comedy. His character is certainly mysterious and full of dead pan remarks. What fun!! Always nice to see Jane Curtain, and of course Olympis Dukakis. But in the supporting cast it was Mehboob Bawa and Robert Foxworth who stole the thunder. Can't tell you why. See it.<br><br>Just see it! No heavy violence. No crude toilet humor. Just adventure and very likable performances.<br><br>Mr. Wyle, you were producer, can we have more, please.","user":"ApolloBoy109","rank":[49,71]},{"title":"Flynn Carson is a seasoned Librarian after a year on the job.","rating":9,"date":"3 December 2006","review":"While Carson has served a year a Librarian he still retains his delightfully nerdy quality. This made-for-TV movie is a film lover's spoof, not meant to be taken too seriously. The sequel holds up well thanks, in part, to the return of Jane Curtin, Bob Newhart and Olympia Dukakis, but Wyle is the heart of the film. His comic/dashing hero is in the same vein as Brandon Fraser in \"The Mummy.\"<br><br>While a number of lines in \"The Mummy Returns\" came off as \"lame\" to me (an admittedly subjective judgment) I didn't really find any truly \"lame\" lines in this sequel and there were many really funny moments. I was afraid I might be disappointed, but my fears were groundless.","user":"kaygeess","rank":[34,48]}]