[{"title":"Exactly what you'd want in a Punisher movie","rating":7,"date":"6 December 2008","review":"I saw this a couple hours ago in Fullerton, CA. I was a reader of the comic, and am a fan of what we've seen from Marvel lately. This movie is just what I wanted, and what I expected.<br><br>Ray Stevenson is perfect as Frank Castle, and everyone else is at least good enough for an action movie. Dominic West is over the top as Jigsaw - which is what Jigsaw should be! A horribly disfigured mob boss with a vendetta is not a subtle thing to begin with.<br><br>As for the \"respectable\" critics' complaints: 1. Violence: Of course it's violent! What part of the title \"Punisher: War Zone\" implies peaceful conflict resolution? He's not the \"Admonisher\". The gore and violence is not at the level of a \"Saw\" film, but it is high. It is rated \"R\" for a reason.<br><br>2. Dialogue: I think the critics have been spoiled by \"Dark Knight\" and \"Iron Man\". Those were comic-book movies with extraordinarily good dialogue. \"Punisher: War Zone\" is no worse than a \"Predator\" or \"Rambo: First Blood\". Not great, but not awful. This is not supposed to be \"Hamlet\".<br><br>3. Script: The story moves along well, and when there's a break in the action (which isn't very often), the film doesn't drag- it's always going somewhere. Not perfect, but good. Much better than the critics have made it out to be.<br><br>All in all, a good time, and one that I'll buy and re-watch as soon as it comes out on DVD.","user":"cbhoov1","rank":[289,383]},{"title":"A movie for the fans, not the critics","rating":10,"date":"5 December 2008","review":"Just came back from watching the movie and I was definitely pleased. I was a bit worried that I would be let down after reading some of the early reviews, my suspicious about the reviewers not understanding the character were confirmed though.<br><br>Stevenson is a brilliant Frank Castle, the guy is a tank in this movie, shredding through his opposition just like a on screen manifestation of the character should. The critics complaining about the gore prove them unfit in being tasked with stepping anywhere near the film with a pencil and paper, doling out stars or thumbs.<br><br>While Im afraid the film will not get the critical recognition it deserves, with the majority of critics not understanding the character, I as a fan of Castle say I'm thoroughly pleased by the work the entire cast and crew have put forth.<br><br>While I agree that the movie was loyal to the source material and worth my dollars, there was one main area I think should have been retooled.<br><br>Jigsaw and Jim's accent is over the top, and in the end took away from the character, especially in the case of Jim.<br><br>At a glance<br><br>Pros: Unapologetically Punisher Level Brutality Stevenson is a compelling Frank Castle Movie pacing is great<br><br>Cons: Cliché accents Could have used some more dialogue from Frank<br><br>Overall: 8/10<br><br>Bottom Line: If you are a punisher fan, you're in for a blast","user":"kisskide","rank":[235,340]},{"title":"Punisher War Zone: A hugely pleasant surprise","rating":8,"date":"9 November 2017","review":"I really enjoyed The Punisher (2004) though I don't think Thomas Jane made a good Punisher he is a competent enough actor to have pulled it off.<br><br>When I heard about this one 4yrs later I had no interest, I was frustrated that it had essentially been rebooted and that Jane was no longer playing Frank Castle.<br><br>Here we are 9yrs later I've finally given it a chance and I'm saddened I didn't earlier. Punisher: War Zone is not the brainless action flick cash grab that I expected, in fact it rivals the 2004 version.<br><br>For a start Ray Stevenson is perfectly cast as The Punisher, he looks perfect and blows Jane &amp; even Lungren out of the water. He thoroughly takes the role and makes it his amidst a host of great actors and characters.<br><br>Extremely violent and quite loyal to the original material this is something I could have gotten behind if it had become a franchise.<br><br>I'm not an action junkie, in fact I'd say it is by far one of my least favourite genres but when its done right like it is here it makes for some great entertainment.<br><br>Ignore the critics and put the 2004 version aside for a moment, War Zone is a damn decent film.<br><br>The Good: <br><br>Remarkably violent (As it should be) <br><br>Awesome soundtrack <br><br>Very competent cast <br><br>Ray Stevenson makes a great Punisher <br><br>The Bad: <br><br>Accents are hit and miss <br><br>Recasting/Reebooting so soon after the last movie was a stupid move <br><br>Hero is a Christian, villain is an atheist. Overwhelming irony <br><br>Jigsaw monologue scene was dumb <br><br>Things I Learnt From This Movie:<br><br>I would love to see this Punisher added to the Marvel Universe <br><br>R-Rated superhero movies were a thing before Deadpool <br><br>Julie Benz is ageless","user":"Platypuschow","rank":[17,20]}]