[{"title":"My favorite movie ever?","rating":10,"date":"8 March 2009","review":"For over 25 years now, I have cited Blade Runner as my favorite movie of all time. After seeing Watchmen, I may have to reconsider.<br><br>First, I'm glad I went to see the movie alone. I've heard so many comments focused on a blue dick, or the length of the movie, or some other such nonsense, that I'm sure watching it with someone would have been a constant barrage of commentary and complaint. And no, that's not Javier Bardem. <br><br>Yes, the movie is long; nearly three hours. But, unlike the dreadfully insipid Titanic, at the end of this movie I wasn't asking for those three hours of my life back. And, as with all such movies, you must be able to look beyond the literal.<br><br>Watchmen is iconic and iconoclastic, deconstructionist and revisionist, laden with allegory and allusion. Consider, for example, the character Ozymandias. I'm wondering how many people who viewed the film ever even heard of Percy Bysshe Shelley's poem by the same name. The character even quotes the poem on a plinth in his Antarctic lair. The allusion is amazing. Here's the full quote;<br><br>And on the pedestal these words appear -- \"My name is Ozymandias, king of kings: Look on my works, ye Mighty, and despair!\" Nothing beside remains. Round the decay Of that colossal wreck, boundless and bare The lone and level sands stretch far away.'<br><br>Clearly one must see the allusion to the work, in this case, of a superhero who hopes to leave mankind a lasting legacy, but realizes in the back of his mind that everything is eventually lost in time. Ozymandias was the first poem I ever examined from an expositional point of view, and I was blown away. The use of it in this movie is equally impactful.<br><br>Then there is Dr. Manhattan, named, of course, for the Manhattan Project, which yielded the atomic bomb. His character is an allegory for God, and his relationship with man mirrors the apparent detachment with which God sees suffering in the world He created. The deity reference is reinforced often, and one thinks of Oppenheimer's citation of the Bhagavad-Gita, in which Vishnu takes on a godly form and says, \"Now, I am become Death, the destroyer of worlds.\"<br><br>In an expository scene in the second act, Dr. Manhattan has a sort of recollection of his life. His account is dizzyingly elliptical, since he does not see time as linear the way others do. This scene has the lyrical feel of my favorite piece of fiction, Alan Lightman's almost unbearably beautiful Einstein's Dreams, and the reference to Einstein cannot be ignored.<br><br>But the real beauty of Watchmen is the moral diversity of its superheroes. Each is flawed in different ways, allowing us to inhabit different ethical perspectives, intellectually at least, and witness their consequences. Everything from Rorshach's refusal to compromise, which makes him a doomed fugitive, to the ultimate compromise envisioned by Ozymandias, who can dispassionately evaluate scenarios where millions of lives are sacrificed, calls into question our most cherished beliefs. Where does it leave you? Well, that's for you to decide.<br><br>From a purely entertainment perspective, Watchmen is stunning. The visuals are state of the art, and do not suffer from the sort of mental rejection I have for some movies that present too many special effects to swallow at once as reality. And Watchmen doesn't suffer from Hollywood's apparent fascination with camp in comic book movies. Camp works to some degree in Spiderman, since he's a somewhat humorous character to begin with. But the excess of camp rendered the Fantastic Four sequel unwatchable. Watchman proves that superheroes can use more subtle forms of humor, such as irony, without devolving into camp for cheap laughs.<br><br>And the music, oh, the music. If you didn't grow up in the 60's and 70's, you will surely miss some of the impact, but don't worry. Even a second hand recollection of such iconic tunes will suffice. I am reminded of the painfully awful Across the Universe, which couldn't even pull together a decent movie built around the greatest catalog in modern music. Watchmen does it in spades.<br><br>I LOL'd, I cried. The people in the theatre applauded at the end. I vowed to wait 24 hours before writing a review to see if my euphoria passed. It hasn't.","user":"budmassey","rank":[1,1]},{"title":"After 10 years...","rating":10,"date":"3 November 2019","review":"The times did change.\nAfter so many super hero movies this one has become the best one of them.","user":"nevesleo","rank":[41,47]},{"title":"Get in line now......","rating":10,"date":"25 February 2009","review":"Screened FRebruary 23 for Australian Media.<br><br>There's no reason for me to expect I was going to like Watchmen. I knew the cast was interesting - Patrick Wilson has made smart film choices that don't rely on or intentionally subvert his good looks (Hard Candy, Little Children); Jackie Earle Haley was icky in Little Children (and I'm old enough to remember him from Breaking Away); Malin Akerman is cute but 28 Dresses and The Heartbreak Kid do not a superhero make; Jeffery Dean Morgan, Matthew Goode - ??? And director Zack Snyder did cool things with zombies in Dawn Of The Dead and made a wild and wacky movie in 300, which totally indicated his third film was probably going to be worth a look, but...you know, whatever...<br><br>So they all signed up for Watchmen - based on a comic bo...sorry, graphic novel...that I'd never read and that was coming to theatres less than a year after Ironman and The Dark Knight had redefined how good superhero movies could (and should, from here on in) aspire to be.<br><br>That Watchmen has turned out to be the most complex, exhilarating and deeply-moving fantasy film since Terry Gilliam's Brazil surprises nobody on Earth more than me - and, man, did it surprise.<br><br>In equal measure, it is a) an inspired vision of an alternate world that echoes but redefines our own existence; b) a subversive yet bracingly humanistic exploration of the role of the superhero in modern literature, c) a supremely adult take on the fetishistic pull of the heightened existence that life as a saviour of society creates, and d) a wildly exciting adventure story that turns normal people into exaggerated victims of their own creation and then back into mere humans.<br><br>An exploration of the plot would reveal more vast themes, but at this early stage of its release I don't want to risk lessening the experience for anyone.<br><br>I can reveal this - Billy Crudup as Dr Manhattan and Jackie Earle Haley as Rorschach create characters every bit as captivating (and deserving of Oscar recognition) as Heath Ledger's Joker; Malin Akerman makes an entrance to the world of superhero timelessness that will be the fantasy of every teenage boy, aged 15 to 50; and from the flawless art direction, set design and special effects to a mesmerising soundtrack, Watchmen is a film that revels in the perfection of minor details.<br><br>Be warned - those expecting Spiderman-like teen-angst or Fantastic Four-like silliness will be stunned, perhaps not quite sure of what they have found. Watchmen is an extraordinarily mature, risky project for Hollywood to role the dice on, especially given similarly-complex explorations of social collapse and vigilantism (V For Vendetta, most specifically) have failed to do blockbuster numbers.<br><br>But Watchmen is something special and deserving of analysis and discussion. As bold an attempt at commercial film-making as I can remember, Watchmen is an undeniably unique movie experience - rich, perverse, violent and resonant.","user":"Screen-Space","rank":[1,1]}]