[{"title":"very enjoyable","rating":8,"date":"29 November 2012","review":"I really don't think this film deserves the poor reviews it has received! I have never seen the original so am not comparing this, simply judging it as a film in its own right. The cast is brilliant, I love Diaz, Firth, Rickman and Tucci so was never going to be disappointed! Yes it's a ridiculous caper movie, it's not meant to be taken seriously on any level! It's great fun, I was weeping with laughter at some of the hotel scenes, and that doesn't happen often in a movie! I'm not quite sure what some of the reviewers on this site were expecting, but I was thoroughly entertained! I came out with a smile on my face so in my books that's just fine!","user":"leonasunflower1978","rank":[80,105]},{"title":"Quite good really","rating":7,"date":"22 November 2012","review":"I watched this film on release night with my fiancée. We had previously seen a couple of trailers for the film and thought it looked funny and interesting, although on the day I was disturbed to see find such a low rating here on IMDb.<br><br>*Disclosure, I am not connected to the film's production or any of the cast, and have no agenda here other than offering an alternative point of view.<br><br>The basic plot is already known in advance: that Colin Firth wants to con his evil boss using a beautiful Texan as bait. He travels to meet her accompanied by his friend and co-conman, Major Wingate. After watching her in a rodeo they go to a local bar to make the approach. The Major asks Colin how much is he going to tell her? He answers: \"Oh, only enough for her to play her part\". And the same is true of the audience. You are only told enough to a) identify with Colin's character and his motivation, and b) follow the plot to come.<br><br>We're then treated to a brief 'Ocean's 11-style' précis of how Colin imagines the con will play out from start to finish. Needless to say, no plan ever works out exactly as imagined!<br><br>The humour is very dry, never in-your-face, and this isn't the kind of film to hand you gags. Laughing our loud isn't the point. Instead there's a mixture of situational comedy, miss-understanding comedy, wordplay, and great interaction between the characters. Some of the best jokes are the ones where you have to smile ruefully when things go wrong on a bad day. I thought at the time that the screen-writing was a lot like Richard Curtis, and could easily imagine Rowan Atkinson as the lead. <br><br>Instead the best joke is Colin Firth himself, playing a little man, in Cameron Diaz's words, instead of a larger-than-life character for a change; playing it straight, rarely smiling because he's not very happy (he wants revenge, remember) and not trying to seduce the very comely Cameron Diaz, who also plays a wickedly funny character without being cast as the comic side-kick.<br><br>But, from a critics point of view, I guess, there's not much originality. You can perceive homages to other films; old Ealing- comedies like the Ladykillers, where the subject matter isn't funny but there is some great humour. And I'm not referring to the re-make, which I didn't like.<br><br>I'd like to watch this film again at a later time and see if I can. It might grow on me and become a minor classic, or it might drop to mediocre. Either way, if you watch it you have to appreciate it for what it is, rather than what it isn't. And it probably helps if you have a temperament where you can see the funny side in unfunny situations.","user":"aplivings","rank":[79,107]},{"title":"I loved it!! What are people on about","rating":10,"date":"30 November 2012","review":"I am surprised at the bad reviews. I thought the film was hilarious. Obviously people's sense humour is not the same but come on.. Give them some credit! it's no where near as rubbish as some of the reviewers are making it to be. This film made me laugh properly and I found it entertaining and engaging from from A to Z. I haven't seen any older version to compare but I don't care I think this film was money well spent. I loved the cast especially Colin! Sometimes just looking at his facial expressions in some scenes was funny. Directing was great too not to mention the script. I can't claim that I am an expert film critics but I felt I had to write a review after reading so many negative ones which I think is quite unfair for a film that had so many laugh out loud moments.","user":"lewiskass","rank":[93,130]}]