[{"title":"7eventy 5ive ... percent of the characters in this movie are incredibly unlikable","rating":4,"date":"13 January 2008","review":"The plot of 7EVENTY 5IVE involves college kids who play a cruel phone game that unexpectedly (to them, if not to fans of horror) gets them in over their heads. The STORY of 7EVENTY 5IVE, on the other hand, is that of a horror film that had a wee little bit of promise, sadly outweighed by really bad writing.<br><br>What could have been a fun, if somewhat silly, old-fashioned slasher tale is derailed early on by its filmmakers' misguided belief that the audience would enjoy watching a bunch of loud, whiny rich kids bitching at each other for most of the film's running time. With the exception of a police detective played by Rutger Hauer, (in a minor role that is designed mainly to add the movie's only star power) every character on screen is a different breed of young A-hole.<br><br>Male and female, black and white, straight and gay, an entire ensemble of shallow and shrill college kids carries the bulk of the film's narrative. Worse, since the tale deals with a PARTY game gone awry, most of the time the scenes are completely filled with these little b*****ds. Because of this, there are few breaks for the viewer, who must put up with the angry sniping of the thinly-drawn protagonists. Even though at least some of these people are supposedly friends, invariably all characters interact in a very hostile manner, long before any genuine conflict has actually arisen. This leads to the worst possible result in a slasher film: The audience, intended to care about the leads, instead not only cheers on the anonymous killer, but wishes that he had arrived to start picking off the vacuous brats far earlier.<br><br>The real shame of this poor characterization is that otherwise 7EVENTY 5IVE actually DID have some potential. Visually it's fine. First-time directors Brian Hooks and Deon Taylor know how to build a suspenseful mood. They also manage to deliver on some competent, if sparse, moments of classic 80s-style gore. Surprisingly, the production's cast is also fairly able. It isn't that the actors aren't capable of expressing realistic human emotion; it is simply that the screenplay (co-written by newcomer Vashon Nutt and director Hooks, who fared much better behind the camera than with a keyboard) is short of such moments.<br><br>7EVENTY 5IVE can hardly be recommended, as its familiar premise and few thrills can't outweigh the bad taste left behind by a story driven by a gaggle of unpleasant characters. In this tepid whodunnit, the real mystery is why anyone should care about a group of young folk who can't even manage to like each other.","user":"homerjer","rank":[23,29]},{"title":"Why God? Why?","rating":1,"date":"21 January 2008","review":"5 minutes into this movie I was hyperventilating, shaking, and writhing in pain. And not in the good way. The story is about a troupe of idiotic children making prank phone calls to a psycho which is always a good idea. Turns out psychos don't like prank phone calls because in 2 minutes time he's at their door killing poor Williams mom and dad. Well skip ahead 15 years and guess what? Still prank phone calling people. Yep you would of thought that a horrible murder would of deterred them from doing that ever again but no. So after about two hours later and way too many scream ripoffs I realized that this movie gave me nothing but a terrible taste in my mouth and a severe urge to take my own life. This piece of crap isn't even worth laughing at the shoddy production, the \"acting\", or Rutger haurs dwindling career. I love crappy horror movies but this is the most unsatisfying piece I've ever seen. Just don't.","user":"olliejackson","rank":[34,48]},{"title":"Nice concept, not executed too well.","rating":5,"date":"24 August 2008","review":"This movie has a quite good promising concept for a genre movie. It's a slasher in which lots of people are getting killed randomly by a serial killer. Like many genre movies before the movie uses phone-calls as its main concept. It's something which always works out well for horror/thriller movies. Nothing wrong with the phone-class but everything else about the movie is just way below par.<br><br>I purely watch these kind of movies because of Rutger Hauer. Even though the movies are always horrible, his presence still gives the movies always something special. But like always, his role is far too small. Perhaps if he was the main lead the movie would still had been more bearable. It now is as if he plays in a totally different movie himself and has nothing to do with the main plot-line of the movie. Like his scenes were shot at a totally different phase of production. I bet he never ever even met most of the other actors and crew members involved with the movie.<br><br>One of the movie its problem are its characters. The movie is a slasher, so of course it features a bunch of university students, played of course by a bunch of actors who are close to- or even older than 30 years already. None of them are however likable or memorable. They are basically all the same and a bunch of typical stereotypes. I don't even know who all these characters were and what their names were. There are just too many characters in it and most of them are just asking to be killed.<br><br>The movie its story also just doesn't ever seem to get off the ground. The first halve of the movie is filled with many false scares. Way too many. The scare moments of the movie because of this start to become really ineffective. It even makes the movie more comical like at times than an horror movie. Not sure if this was the point of it all. It was Brian Hooks first and as of yet only directed movie. Besides that he also played the main lead and served as a producer and writer for the movie. He's obviously not the most talented person around in the business.<br><br>When the movie becomes more of a slasher and horror/thriller movie the movie becomes more watchable to watch for the genre fans, despite being formulaic and predictable with it all. No, it's just not the most exciting or scary genre movie around but there are also definitely worse of out there. The genre fans should be able to appreciate some of the gore and violence of the movie.<br><br>The movie soon however starts to get worse again as it heads toward its ending, when the movie is trying to be clever by trowing a couple of twists (what else is new?), which are just too far out there and don't work out well for the movie as a whole.<br><br>5ive/10en<br><br>http://bobafett1138.blogspot.com/","user":"Boba_Fett1138","rank":[10,12]}]