[{"title":"Why do people think this movie is terrible?","rating":8,"date":"29 November 2017","review":"I was really disappointed when I started seeing all kinds of bad reviews for Suburbicon pop up. I was so excited to see it! I finally watched it today and I don't know what you guys are talking about. I felt it was a pretty spot on dark comedy. I didn't think it was overly gruesome. I didn't think it was confusing. I didn't think loose ends were left. On the social plane, I've seen reviews that accuse the movie of being racially inflammatory. I've also seen reviews that took the opposite stance and said that the black and white story lines never came together and the black story line was simply used as a backdrop. I don't agree. I thought it was rather entertaining that this white- washed community just attributed all the violence taking place to the new black family in the neighborhood, rather than realizing they had a couple of white sociopaths living next door. It showed how prejudice just promotes ignorance. Pretty solid message if you ask me..","user":"dawnlscherer","rank":[372,439]},{"title":"Another \"Blood Simple\" and a bit more","rating":8,"date":"7 February 2018","review":"IMDB really must try and do something about \"reviews that just attack movies for so called political bias. Same thing happened with The Post.\nThis was a highly enjoyable movie from the entertainment value to the \"makes your blood boil\" counter story.\nIt really was like watching another Blood Simple, also by the Coens.\nAnother review asked \"Is this a social commentary about racism in suburbia? Or in this a murder mystery of some sort?\" and then said it tried to be all and was neither.<br><br>How about it was actually both, with the attacks on the black family while in the neighbourhood there was something evil going on under their noses perpetrated by a white family?","user":"Monsieur_Rioux","rank":[136,171]},{"title":"Perfect balance between crime flick, dark comedy and social drama","rating":9,"date":"15 November 2017","review":"Suburbicon is a movie that doesn't deserve the overwhelmingly negative critics it gets. The movie is an ambitious mixture of a crime flick, dark comedy and social drama in almost equal parts. This isn't unusual for a script by the talented Coen brothers but Suburbicon is particularly out-thought and precise.<br><br>First of all, we have the story of a mysterious home invasion in a seemingly perfect town that leads to the murder of a physically disabled mother. <br><br>Secondly, the film portrays the small-town stereotypes of the late fifties in a humorous manner and also includes a solid dose of situation comedy. <br><br>Thirdly, the movie shows us the struggles of an African-American family in an otherwise homogeneous all-white neighbourhood.<br><br>In addition to this original mixture, the film is extremely stylish and portrays small-town stereotypes of the late fifties perfectly, including exchangeable family houses, flashy clothes and robust vehicles.<br><br>The movie includes numerous talented actors who are challenged to play unusual roles and deliver good to great jobs. Matt Damon really convinces as two-faced family father, Julianne Moore plays two roles and portrays both a bitter and disabled family mother as well as her manipulative and superficial sister and child actor Noah Jupe has his international breakthrough as he performs a shy and antisocial but also open-minded and clever boy. Even the secondary roles are unique and played by talented actors. One has to point out Gary Basaraba who plays a sympathetic but tough uncle, Oscar Isaac convinces as an investigative insurance agent and Glenn Fleshler impresses as scary villain.<br><br>If the acting is so convincing, it's due to the great work of the great directing effort. George Clooney is obviously rather known as an actor but he proves that he can also direct a great movie and I would even say that his precise work here is better than many of the somewhat superficial roles he has played in his career. It's great to see that George Clooney is still trying out new things so late in his career.<br><br>Some negative critics here focus on the fact that the movie portrays the racism of an all-white neighbourhood towards an African-American family and even shows the display of a Confederate flag in one scene where an angry mob smashes the windows of the family house. First of all, it's a matter of fact that racism was very present in those neighbourhoods of the United States of America back in the fifties and it sadly still is an issue today if we witness the numerous cases of police violence against African-American citizens. Secondly, the movie also shows that some residents aren't participating in the protests but rather trying to ignore it in order to not get into any trouble with their neighbours which was an attitude several people had back in those days. Thirdly, a few select people are shown which are helping the African-American family the best they can and it's a particularly clever move that the movie focuses on the friendship of a black and a white boy who show the ignorant adults around them that there is hope for peaceful coexistence in the future. Therefore, the movie isn't biased or left-wing propaganda as some angry reviewers try to make you think but a balanced and realistic portrait of a flawed society. Finally, the scene with the Confederate flag isn't offensive because the display of this flag is often associated with white supremacy. If you have a Confederate flag in your yard, you should seriously ask yourself what kind of person you are. This flag isn't anything to be proud of.<br><br>To keep it short, Suburbicon is an entertaining, original and stylish movie that mixes crime flick, dark comedy and social drama in a perfectly balanced way. Ignore the negative critics and enjoy one of the greatest movies of the year. The fact that the incredibly boring Blade Runner 2049 gets so much critical acclaim while Suburbicon is unjustifiably criticized proves once more that popular opinions don't mean much when it comes to understanding a piece of art.","user":"kluseba","rank":[140,183]}]