[{"title":"faNtastIc on sCreen chemIstRy","rating":10,"date":"23 September 2013","review":"Let's get something straight. This - Mr. Magorium's Wonder Emporium - is my realm. Some guys make movies, but not me. No! I am the one who watches. Upon recently viewing this movie upwards of 250 times in the past month, I can say this is a 100 percent perfect film that will not make you blue, but rather cheer you up even if you are cold and alone. Though I wish I could watch this with my family, I know that is unlikely even if I take full measures. Alright, let's talk about Mr. Edward Magorium. He was a good man and a good toy store owner. He didn't deserve what happened to him. He didn't deserve it at all. But I'd watch him again and tomorrow and the next day and the day after that. When you make it Edward versus Bellini, or Edward versus Molly, Edward loses! Simple as that. This is on Mr. Magorium, not Eric, not Molly. I mean really, what'd you expect me to do? Just simply roll over and not watch this on repeat? That I wouldn't take the time – extreme amounts of time – to watch this myself? Wrong! Think again. <br><br>If you don't agree with me, then I'm sorry you feel that way - but know this: If you've already read this far, I won. <br><br>Tread lightly, Mr Lambert","user":"MrLambert","rank":[73,89]},{"title":"The only review you need to read","rating":10,"date":"7 March 2008","review":"I am amazed by the unbelievably DENSE comments and reviews I've read, apparently written by folks who have completely missed the point. These people did not have the courage for 90 short minutes to suspend their cynicism, disbelief, and cowardly need for proof or substantiation of every little thing. (Big ol' raspberry to them!) <br><br>A kid's movie? \"Just\" for children? Heck no. Rather, this movie is \"just\" for those, regardless of physical age, who have been fortunate enough to retain any portion of their own childlike -- notice, I did not say childISH -- appreciation and pure unclouded understanding of wonder, simplicity, love, and of magic found in the everyday. <br><br>If your heart was not touched, even in some intangible microscopic way, by this movie - are you sure you still have one?","user":"kickboxgrrl","rank":[160,216]},{"title":"MOMS: Great movie, but toddlers and husbands will be bored","rating":7,"date":"19 November 2007","review":"My husband and I brought our 4 year old daughter to see this movie last night. We'd already seen (and ADORED) THE BEE MOVIE, and nothing else seemed age appropriate. Despite horrible reviews, we gave it a shot.<br><br>I loved this movie. It's not often that a kid's movie can move me to tears, but this one had a powerful (yet simple) message...LIFE IS WHAT YOU MAKE OF IT.<br><br>My daughter was bored to the point of BEGGING us to leave. This from a kid who sees movie-going as the ultimate treat. While it was visually stimulating overall, there could have been more in the way of special effects.<br><br>Jason Bateman was surprisingly good in his role as the accounting mutant. Some of the most moving moments in the film were created by little more than the expression on his face.<br><br>Natalie Portman was radiant and lovable and...androgynous? ;) She could easily have been mistaken for a thirteen year old boy throughout most of the film, to the point where it seemed that she had her chest bound up to appear that way. But it's not about the boobies, and it's not a romantic love story, which I greatly appreciated.<br><br>No sex. No violence. No profanity. My husband hated it.<br><br>There is love...lots of love. Pure love. The kind of love you feel when you're a child, and your mind has not yet been bogged down with the soul-crushing stress of adult responsibility.<br><br>This movie is a nice kick-in-the-pants for anybody who needs to be reminded that you don't have to be a kid to see the potential in yourself and the world around you. You just have to relax a little and believe in magic.","user":"DaynaSu","rank":[147,212]}]