[{"title":"A surprising gem","rating":27,"date":"27 July 2008","review":"This film is about a very organised man whose life is turned into chaos by an accidental revelation.<br><br>Though there are a lot of comedic moments in the film, I think it is more of an drama about Frank finding out that organisation and efficiency does not make him any happier. This realisation and complete personal change is engagingly portrayed throughout the film. Frank's situation connects to the viewers, and easily evokes much sympathy.<br><br>The ending is touching and well told. It explores what is more important in life. Is it the job, family or deeper values such as forgiveness? \"Chaos Theory\" is a surprising gem. It is an engaging, heart warming and yet light hearted and comedic all at the same time. Watch it if you have the chance!","user":"Gordon-11","rank":[49,56]},{"title":"Chaos Theory is an honest and well-done look at a man whose world is turned upside down","rating":8,"date":"19 March 2008","review":"Chaos Theory is an extremely well done film. It is a serious, emotional and at times humorous look at life and love that is incredibly honest and centers around equally honest and real characters. With the feel of a good indie flick and a strong leading man, Chaos Theory is one of those rare, genuine explorations of the human condition.<br><br>Frank Allen (Ryan Reynolds), an obsessively organized efficiency expert and top-selling author, has spent his entire life planning out every little detail and following the lists and schedules he makes for himself. He clings to controlling everything because it brings order, which gives him a sense of comfort and peace of mind.<br><br>One day, Frank's wife Susan (Emily Mortimer) sets the clocks forward ten minutes to help him be early for his schedule but accidentally sets them back ten minutes instead, making him late for his lecture on efficiency and setting off a chain of events that sends Frank's life spiraling. Through a course of seemingly random events, he learns some new information that, in effect, reveals to him that much of what he believed about his life is based on false information.<br><br>Not knowing how to deal with the revelation, Franks throws everything he's ever believed about order and efficiency out the window and starts living life on whim and chance. As he lets chaos overtake his life, he struggles to deal with the new truth that defines his life and forgive those involved.<br><br>The movie has its share of funny parts, but it really shines in its dramatic moments - when it's serious and honest. It effectively deals with things like relationships, truth, friendship and forgiveness, and it all feels true to how real people would react. As Frank and Susan try to deal with the new information, they begin to reassess their marriage and Frank questions what he's believed in for so long. His downward spiral into chaos is both interesting and realistic as well; none of it rings false. As you watch it all transpire on the screen, you're able to understand and relate to many of the emotions that Frank is struggling with.<br><br>Much of this success comes from the performance of Ryan Reynolds, an actor best known for comedic roles in movies like Waiting and Van Wilder, but who has an intensity and seriousness about him that translates powerfully to other types of roles. This is evident in Definitely, Maybe as well as Chaos Theory, and the latter is quite a departure from the comedy work he has done previously  one he excels in and should do more often.<br><br>One scene where his talent and intensity really comes through is when Frank pulls over onto the side of the road just after he discovers the life-altering news. As he sits on the curb trying desperately not to break down, choking back tears and vomit, his pain is clearly visible in both his eyes and in his physical anguish, and it exudes off the screen. The strength of Reynolds' performance really heightens this scene, as well as the whole movie, and makes the character and his feelings relatable and evocative for the viewer. Reynolds easily carries the movie, which is even better off because of it.<br><br>Chaos Theory is an extremely honest, sometimes sad, always emotional and very real exploration of how a person deals with a drastic change in their life. With a strong and atypical performance from Ryan Reynolds, and enough humor, hope and insight to keep it from being depressing, Chaos Theory is definitely one of the more intelligent films of 2008 and shouldn't be missed.","user":"red_grace","rank":[86,107]},{"title":"A Rarity","rating":7,"date":"16 July 2008","review":"Chaos Theory is a well-acted comedy that delivers laughs a the right moments while weaving an endearing tale. It never achieves greatness, but it is enjoyable throughout.<br><br>Frank Allen (Ryan Reynolds) is a professional speaker who lectures on time management, and his life is perfectly ordered and scheduled, down to the minute. When his wife (Emily Mortimer) sets his clock forward 10 minutes as a joke, his day is thrown off. When he ends up late for an out-of-town lecture, things go awry. A couple of miscommunications leads his wife to question his fidelity, and he ends up making a discovery that causes him to have his own doubts about his family life. Deciding that his strictly ordered life has done him little good, he begins to make multiple choice index cards, choosing one at random and doing what is written on the card.<br><br>Reynolds is a very under-appreciated talent, and his work in this film is spot-on. Stuart Townsend gives a strong performance as Frank's best friend, and Matreya Fedor has some great moments as Frank's 7-year old daughter. Sarah Chalke shows up briefly in an interesting role, but she isn't given that much to work with. <br><br>The movie is story is well-structured and not entirely predictable, and the pacing and timing are great. The flaw of the film, though, is the third act, which was a little over-the-top for my taste. <br><br>But it is a smart and pleasant film overall, perfect for a rental.","user":"zyxek","rank":[27,31]}]