[{"title":"Unforgettably Haunting Animation","rating":8,"date":"9 February 2010","review":"I would not have known about this film if not for its \"surprise\" Oscar nomination for Best Animated Feature film. Thankfully, it came to pass that I was able to watch this animated little treasure.<br><br>The story is about the child Brendan who was the nephew of the imposing and overprotective Abbot of the township of Kells. The main pre-occupation of the Abbot is to build a wall to protect Kells from the attacking Vikings. One day, Aiden, the renowned illustrator from Iona, sought refuge with them. Aiden opens Brendan's eyes to the art of illustration and the lure of the outside world. Along the way, Brendan befriended the white forest sprite Aisling, as he sought to recover an ancient crystal invaluable to the meticulous art of book illustration.<br><br>\"The Secret of Kells\" is unlike most of the animation released these days. It is a throwback of sorts as the illustrations are done in stark geometric lines and design without much care for realism, as much as symbolism. The movements of these lines are reminiscent of the simplistic yet fluid animation style used at the beginning sequence of \"Kung Fu Panda.\" However, it is the magnificent use of color that is the main source of wonderment for the audience. The reds used in the Viking invasion sequence is unforgettably haunting.<br><br>Try to catch this quiet gem of a film. It is a welcome respite from all the senseless bombast of current animated fare such as \"Monsters vs. Aliens\" and the like. The sparse Celtic musical score is effective in evoking the sense of fantasy that imbues the film. OK, the story might be a little shallow and the ending a bit wanting. I would have liked to know more about the Book that Brendan and Aiden was working on. But the clear star of this film is clearly its amazing stylized artwork, said to be based on the artwork in the real Book of Kells.","user":"3xHCCH","rank":[55,59]},{"title":"Beautiful!","rating":9,"date":"30 March 2009","review":"The Secret of Kells is a film I've been waiting for for years after seeing some early footage at the Cartoon Saloon in Kilkenny. I'm here to tell you now it's been worth the wait. The cartoons are heavily stylised but not annoyingly so as I'd feared. The whole film is a thing of beauty and great imagination, I particularly love the animated illuminated book where the little figures come to life on the page. The characterisation is superb, I love Brendan Gleeson's voice as the stern Abbot and I especially liked the voice of the sprite Aisling. The forest is a triumph, such a beautiful place. The story is well realised, a mix of fact and fantasy. and really draws the viewer in to cheer on Brendan in his quest for the perfect materials for the Book. I'm a lover of calligraphy and illumination anyway so the subject is close to my heart, but all the people I know who've seen this and are not fans of the craft agree that it's a lovely little film. I will definitely buy the DVD when it's released, and would like to say, well done Cartoon Saloon and all the people involved in this mammoth project. May there be many more. :) Coming back in here to say that I bought several copies of the DVD as soon as I could and gave them out at Christmas, everyone loves it! And I wish them all the luck in the world at the Oscars, such a joy to see this nominated.","user":"whistlestop","rank":[77,90]},{"title":"A visually astounding animated movie.","rating":7,"date":"12 October 2010","review":"\"Do you want to see the most beautiful page? The one that will turn darkness into light?\"<br><br>The story of The Secret of Kells is a simple one. A monastery in Ireland hurries to complete a wall that will hopefully protect it and its village from the coming destruction of the Vikings, when it is visited by a monk who also flees the Vikings. He brings with him a special book that he is writing, and a young boy who lives in the monastery tries to help him complete it, and meets a shape-shifting forest girl in the process. The friendship that's made between the two may end up saving both the book, and the lives of the monks and villagers.&nbsp;<br><br>The aspect of The Secret of Kells that's most noteworthy is the visuals. This is one of the most gorgeous and visually inventive movies I've ever seen. The art style is like moving illustrations from a book of English fairy tales, and it constantly changes from scene to scene, offering new things to see while keeping the same basic theme. It really is a beautiful movie, and I don't see how anyone could watch it and not be thoroughly impressed by the amount of creativity and work that had to go into making this.<br><br>On the whole, I think this will appeal to older teens and adults more than children, as it's a quite serious story, and pretty violent in some places. There's not much of the humor or kinetic antics that younger viewers usually like in their animated movies, but anyone old enough to appreciate The Secret of Kells will be quite pleased with this little gem.","user":"lewiskendell","rank":[22,24]}]