[{"title":"Loved It","rating":9,"date":"9 April 2007","review":"I thought it was a great story and very well cast. I didn't enter the theatre with expectations of learning the truth about Jane Austen's world, who was in it and what made her tick. I understood the movie was loosely based on the life of Jane Austen. The writers have simply devised a beautiful and clever story from only a small shred of evidence that there was a true love in her life. From what I gather the movie was really meant to be an fictional intervention in her life devised from what was known of her. I thought Becoming Jane was funny, beautifully shot and it made me giddy with lust over McEvoy. I loved the sexual energy and meeting of the minds between the love interests. I saw quite a few parallels between this story and Jane's novels. I really believe that Jane would absolutely adore this version, if not find it amusing how it was crafted. I do agree that to create a story about a much loved female author is risky territory, as there are devoted fans of Austen's who are looking for a representation that they personally feel fits their idea of what motivated her as a writer.","user":"jonesnicola2","rank":[162,189]},{"title":"Great Supporting Cast but disappointing rendition and miscast of Jane","rating":3,"date":"1 December 2007","review":"Big disappointment. I guess I'll have to watch Emma Thompson and Kate Winslet in Sense and Sensibility again to remind myself how great Jane Austen REALLY was. This version is so loosely based on Jane Austen's life - full of undocumented speculation that it seems unfair to capitalize on Jane Austen's name. If you want to know what really happened, look up her bio, don't rely on this movie. The supporting cast is terrific, especially James McAvoy and Julie Waters (as always). In my opinion however, Anne Hathaway lacked the charisma for this role. She was not interesting enough to make me care about her character or believe she had imagination enough to write a letter, let alone the works of Jane Austen! I guess I am in the minority but I found her to be without depth, wimpy and boring. I think Jane was such an important historical and literary contributor, poor casting of her pivotal role and a script based on speculation, ruined the movie for me.","user":"shirleyhanna","rank":[23,26]},{"title":"Lovely Movie!!","rating":9,"date":"11 March 2007","review":"Seldom does one go to a movie with high expectations and ends up having them fulfilled, but Becoming Jane is an exception in this case. I was charmed by Anne Hathaway's turn in Brokeback Mountain and The Devil Wears Prada and couldn't really understand the outcry resulting in her being cast as Jane Austen and after having watched the movie I know for sure Anne Hathaway was the right person for the role.<br><br>Hot on the heels of 2005's Pride and Prejudice this movie offers a look into the early years of a spirited Jane Austen and her encounter with a man who could have formed the basis of one of her most famous literary characters Mr Darcy.<br><br>I have to say this movie is without a doubt one of the BEST period films I have ever seen. Not only is it visually stunning but the performances from everyone are superb.<br><br>Maggie Smith a delightful as the shrewd old Aunt.<br><br>Julie Walters excellent as the mother who would give anything to knock some sense into her daughter ( Jane Austen that is ).<br><br>Anna Maxwell Martin is also very good as the sister and confidante of Jane Austen.<br><br>The director Julian Jarrold has done a wonderful job of making an amazing movie that will appeal to all generations.<br><br>And finally the two very charming leads who are the very heart of the movie : Anne Hathaway and James McAvoy. In one word both are AWESOME. James although has little screen time then Anne makes you understand the sheer cockiness and arrogance of Tom Lefroy, from his live free attitude in life to his transformation as a man who begins to care for Jane Austen.His chemistry with Anne Hathaway is sizzling and a very important factor in maintaining the movie's momentum.<br><br>And at last to the leading lady Anne Hathaway. The lady is a marvel as Jane Austen, her determination and spark is vividly captured by Anne in what can be called a very career defining performance. Not only does one feel the pain for Jane but one does marvel at what holds her together and her writing makes her pull through in life.It is Anne Hathaway's spirited portrayal of the literary icon that forms the essence of the movie.<br><br>From her determination to write and her heart break to her feisty attitude to succeed as a writer is uniquely captures by the young actress. One can't really find the exact words to describe the actress's performance as Jane Austen , which is if simply put great.<br><br>This movie has the makings to become the period drama of the year. A fine job by the actors and entire crew of the movie for giving us an insight to what could have been very important years in the young authors life.<br><br>A delight to watch in every sense 8/10","user":"waterlilly85","rank":[127,166]}]