[{"title":"Powerful but misdirected","rating":7,"date":"25 May 2007","review":"I think you're going to see some very mixed reviews for this film. The tragedy is that it's going to be picked up primarily by fans of westerns, who are looking for shootouts and plots that can be boiled down to \"good guys\" and \"bad guys.\" Do not go into this movie expecting that.<br><br>This is ultimately a revenge story, but not a straightforward or clean-cut one; in this way I would compare it to \"Memento\" and \"The Three Burials of Melquiades Estrada\".<br><br>It's not clear who we're \"supposed\" to sympathize with at the beginning. We want to sympathize with the revenge-seeker; but we're told almost nothing about why he wants revenge. As he displays at least as many brutal and mercenary traits as anyone else in the film, we question why we side with him, and realize that we're only inclined to do so because our previous experience with \"revenge\" stories has programmed us to do so.<br><br>But the quarry is far from a sympathetic character as well, and we're torn emotionally on what we want to see happen. That is, until the original tragedy is finally revealed. And I've honestly never seen such a well-conceived scene of this type... the tragedy is heart-rending.<br><br>I won't say much more except that as the film goes on, the degree to which it will appeal to fans of literal straightforward westerns decreases significantly. You see, as the film begins, Carver's pursuit of Gideon takes them through various isolated episodes: encounters with various characters. As the film goes on, these encounters become more and more obscurely surreal; the final such encounter seems almost supernatural or fantastic. The writer and director have peeled away the internal reality of the story, and are speaking to us through the form itself. Not something that your average Western viewer is likely to accept or appreciate.<br><br>Viewers will come to this film expecting a completely realist story; and that's what they seem to be getting at the beginning of the movie. The viewer is not prepared for this realism to slowly and obscurely fall apart - and while that may be the reason that the film creates such a powerful and somehow creepy experience by the end, the same factor is likely to leave most viewers feeling robbed.<br><br>Ultimately this film is definitely worth watching, but may not have enduring appeal to lovers of the traditional Western genre. A note while viewing: pay attention to the theme of loss, and how various possessions of the characters are lost.","user":"IQpierce","rank":[145,178]},{"title":"Intelligently-made western a refreshing surprise","rating":8,"date":"17 July 2007","review":"I rented this film without ever hearing of it before, and was pleasantly surprised...something which is becoming more and more rare in my movie renting experience.<br><br>This gritty, untypical western appealed to me on a number of different levels. The unusual casting of Liam Neeson and Pierce Brosnan intrigued me, their film presence was an enhancement without being a distraction to the film. The story was complex and minimalist at the same time, sometimes combining ultra-real and surreal elements. The cinematography is straightforward and beautiful, and a welcome relief from the jiggly camera technique, colorization, and other \"contemporary\" gimmicks that all too often nowadays cause technique and style to become a major distraction with the story being told. Thank goodness there are still directors that believe in having movies being filmed this way!<br><br>While the story grabs your attention from the very beginning and moves quickly, it takes its time in revealing who the characters are, and what are their motivations and the demons they are dealing with.<br><br>If you watch this with a preconceived notion of what a western should be, a la John Ford, Howard Hawks, etc. you may be disappointed, as some reviewers here obviously have been. I myself found this intelligent western - that is a little offbeat, with an element of mystery, and not always clearly defined bad guys and good guys - a refreshing change of pace from the racks of slasher film sequels, lame comedies, and Jennifer Aniston vehicles at the video store.","user":"Whythorne","rank":[57,71]},{"title":"solid western","rating":7,"date":"27 June 2007","review":"Written by Abby Everett Jaques and David Von Ancken and directed by Von Ancken, \"Seraphim Falls\" is a rough, tough, old-fashioned western set on the dusty plains and snow-covered mountains of western Nevada. The plot is little more than a straightforward revenge tale involving Liam Neeson (sans Southern accent) as a sadistic Rebel army colonel who hires a posse to track down the marauding Union officer he believes slaughtered his family in the days following the Civil War. The officer, played with steely-eyed determination by Pierce Brosnan, is a savvy, quick-on-the-draw survivalist who, through sheer ingenuity and skill, stymies and outwits the colonel and his men at every turn.<br><br>What \"Seraphim Falls\" lacks in substance, it more than makes up for in grit and style. For even though there isn't a great deal of depth to the characters, there's much pleasure to be derived from merely watching two actors of the caliber of Neeson and Brosnan squaring off in a grueling game of cat-and-mouse played out in a punishing, unforgiving landscape. Brosnan's character achieves an almost Superman-like quality as he stays one step ahead of his pursuers, devising ever-more elaborate means of ensnaring them in his traps. The movie takes a decidedly metaphysical turn in its closing stretches, with the divine Anjelica Huston, no less, appearing out of nowhere as a desert apparition to set the boys straight on a few eternal verities like redemption and forgiveness. But it is as a simple tale of vengeance and obsession that \"Seraphim Falls\" most captures our imagination and interest.","user":"Buddy-51","rank":[77,99]}]