[{"title":"A nice movie that may be a bit too much criticized","rating":8,"date":"11 April 2014","review":"I went to the movie with no idea what I was about to see. Genuinely had no idea about the plot and had no expectations at all.<br><br>Given the above I loved it. While it was entertaining and had that specific British humor which I find nice, it also had some powerful moments.<br><br>At the end it made me think about the kind of problems people face in their lives without making me sad like most of the movies that cover similar topics. I'm glad I went to it. Well spent money.<br><br>I would advice the audience to just see it like I did - without even checking the plot and the actors. Not knowing what it's all about made the experience a bit better in my opinion.","user":"nick_pp2001-911-354805","rank":[72,80]},{"title":"This Was A Surprise.","rating":8,"date":"11 December 2014","review":"Had no idea what this film was when I decided to watch it on Netflix and was pleasantly surprised by how attached I became to the subject matter, the characters and the story. <br><br>Brosnan is a disgraced TV personalty and decides to commit suicide by jumping off the top of a building on New Year's Eve. While up there, he meets 3 other people, played by Toni Collette, Aaron Paul and Imogen Poots, all there to do the same thing. None of them commit the act and instead form a weird bond between each other. A pact is made not to commit suicide until the next \"popular\" suicide date, which is Valentine's Day. Dark subject matter, I know. <br><br>Despite the content of the film involving topics such as cancer, suicide, underage sex and other questionable character choices, the film balances this topics interestingly enough to keep it rather light. It never became too dark, nor too comedic. It walked a fine line of genuine trust in the characters. I found myself attached to each one, their faults, their quirks and liked them all. Imogen Poots has the hardest task of playing the \"wild card\" character. This character can sometimes become irritatingly annoying and I can see some people thinking her performance here is just that, but I found it oddly charming and real. She's a young girl who yearns to be loved and can't find it. She's lost, she feels alone and she turns to uncomfortable humour as a shield to hide her true feelings. I felt that her character had the most demons and she came off as the most interesting. <br><br>The film is broken up into four segments and each segment is from one of the characters POV. At first I was afraid that it was going to be one of those films that played the same event multiple times from different character perspectives, but was relieved when that was not the case. <br><br>The film fails to use the supporting cast effectively. Sam Neil is only in a few select scenes and Rosamund Pike is in one very uncomfortable one. Couldn't help but feel that their talents were slightly wasted here. I had no idea this film was based on a book, thus had nothing to hold it against. There seems to be a lot of hate towards it, but I was genuinely interested from start to finish.","user":"Matt_Layden","rank":[18,19]},{"title":"Forget the critics.","rating":6,"date":"22 March 2014","review":"Before you see this, clear your mind of the negative hype. I went in to the film wanting to judge it for myself, and I have to say I had an enjoyable enough time. Its length is perfect, and I like how it tells the story. Just don't expect a realistic tale and you should have a good time. I liked how they didn't sugarcoat the actions of a character. I found Aaron Paul's character, J.J, to be very easy to relate to. In my opinion, they got a lot of things right with the topic of depression, and the comedy wasn't done offensively. It's not a light topic, but A Long Way Down shows just how many different reasons people have to be suicidal, some with no real reason at all.","user":"jamesissuperawesome","rank":[65,80]}]