[{"title":"Til Schweigers movie \"One Way\" let you feel the pain","rating":10,"date":"25 January 2007","review":"My husband and I saw \"One Way\", the new movie of the German actor Til Schweiger. There were no coughing, no feet-stamping and no murmurs to hear during the whole movie. Even at the end the silence continued. Than my husband broke it, saying: \"Man, what a good movie was that!\" The story and the pictures are very intense. They catch the viewer's whole attention which you can hardly escape.<br><br>The topic of the movie is rape. It's about guilt and atonement.About law, morals and justice.<br><br>In a today's criticism I read the sentence: \"Sometimes it is the start of a movie that gives rise to doubts. In \"One Way\", the movie of the Swiss Reto Salimbini, a girl is followed by several men and raped brutally, as a black figure wearing a uniform (Michael Clareke Duncan) appears and butchers the wrongdoers with a machine gun. The plot changes from this revenge-fantasy to the New Yorker world of the publicity expert Eddie (Til Schweiger)\" Now I ask myself seriously: What is so disconcerting about the imagination that the victim imagines the death of the men that are raping her? Isn't it even understandable somehow? The visualization in the movie makes the fantasy visible for the viewers - and uncomfortable. \"One Way\" is consequently shown from the rape victim's point of view, which is definitely not a daily mean.<br><br>In an other criticism it is said that the rape scenes are shown very drastically. So I watched them critically. My judgment: I have seen more drastically rape scenes in movies and on television before. But what is really hard to the spectator is - during the whole rape the camera is filming the victim's face. Vivid, oppressive and frightening.<br><br>The pictures do not allow any evading and phrases like \"somehow she wanted that, too\" or \"It's not as bad as it seems\" are absolutely wrong and out of place. The victim is injured with great physical and psychological pain.<br><br>Is it a woman allowed to take revenge if she has been raped, humiliated and emotionally killed? If she can't trust her pretending best friend or in justice? In \"One Way\" two raped and humiliated women experience emotional justice in the end and an initial slime ball develops into a better man. This is more than reality can (unfortunatly) sometimes offer.<br><br>Fill the movie theaters and watch it! It's worth it! Marte Cormann, www.kinoplausch.de","user":"martecormann","rank":[34,52]},{"title":"Til Schweiger takes a more interesting career turn","rating":9,"date":"4 February 2007","review":"hmmmm, yesss. From the statistics I read that US females over 30 did not like this film. Whereas the younger audience especially in Europe was thrilled. Why would this be so? The film is about rape and about revenge and how the victim feels and into what kind of situation she gets put by her surroundings. Seeing how things are, the US are very ambivalent about sexual themes. Not to say 'hypocritical'. Judging from the themes feministic theory in the US put forward in the 70ies and 80ies sexual oppression and violence are very much more of a problem when they cannot be voiced at all. This may have been different in Europe with a more liberal approach in many countries (well, not all, I believe...). Anyway, this might explain, why a film like 'One Way' will not be received so open-heartedly in the US - it is painful. And it shows parents in their relationship to their children in a very painful way. Maybe this also explains the distaste of 'elderly women' (to phrase it this way without actually implying criticism).<br><br>This much for the background. The film itself is a treat in that it shows a comparatively new side of Til Schweiger as a 'real' actor besides the many comedian roles he has played - actually one of those bought him his ticket to the film world: 'Manta, Manta'. He played in some more serious films before: \"The Ice Bear\" (Der Eisbaer) and \"Knocking on Heaven's Door\", but even his last flick in 2006 \"Where is Fred\" (Wo ist Fred) was a comedy - not bad (and including some hilarious stunts by Christoph Maria Herbst and beautiful Anna Maria Lara) - but not really a revelation. Also the film puts him in context with many other good actors, especially Lauren Lee Smith. For a while Schweiger has been directing and/or producing his own films - maybe because this was the way of getting a job at all? I hope not - rather do I hope that he will some time tread in the footsteps of Clint Eastwood, Robert Redford etc.<br><br>I will leave the comments to the film itself to the other two I have seen posted. Just this: it is a dark film, giving rise to hope, nevertheless. And it does show many things to make people thoughtful - and I do hope this makes them like the film rather than dislike (which would be the far more easy thing to do).","user":"offenes_meer","rank":[24,37]},{"title":"Perjuries, Ambition, Family Secret and Truth","rating":8,"date":"9 April 2008","review":"In New York, the competent creative director of Birk Advertising Eddie Schneider (Til Schweiger) is living a successful moment of his professional life and is engaged and has just proposed Judy Birk (Stefanie von Pfetten), the daughter of the owner of the company where he works. Eddie is also a wolf and very successful with many women, and is having an affair with a neighbor of the street where he lives with Judy. When he gets the account of the greatest American airline for his company, he is promoted to partner and he celebrates with his assistant and friend Angelina Sable (Lauren Lee Smith) in a lunch party in a restaurant. After hours, when they are in the garage, Angeline notes that she had forgotten her car keys in the office, and when she returns, she is violently raped by the despicable brother of Judy, Anthony Birk (Sebastien Roberts). On the next morning, when Eddie arrives in the garage, he finds the traumatized Angeline on the floor and he takes her to a hospital. He returns to the company and Anthony blackmails Eddie with pictures of his many affairs. Eddie has to take a side between his career and engagement and his friendship with Angeline.<br><br>\"One Way\" is a great movie supported by a magnificent screenplay that uses elements of thriller, crime, drama and even soap opera. The intriguing beginning, with a girl being gang raped by four teenagers and an enigmatic general rescuing her is absolutely original and brilliantly explains the character and traumas of Angeline, magnificently performed by Lauren Lee Smith. Sebastien Roberts is perfect in the role of a cynical scum and I confess that I loved when Angeline uses a sexual device to rape him. Til Schweiger has also a great performance in the role of an ambiguous character divided between his career and the loyalty for his friend, but he redeems in the end refusing to blame Angeline. The sweet Stefanie von Pfetten fits perfectly to her characters and her confession about a family secret in the end is the great twist of this movie. Eric Roberts has a minor but efficient participation in the role of Eddie's lawyer. In the end, I really liked \"One Way\" a lot and I do not understand why it is so underrated in IMDb User Rating. My vote is eight.<br><br>Title (Brazil): \"Pacto Quebrado\" (\"Broken Pact\")","user":"claudio_carvalho","rank":[11,15]}]