[{"title":"Nothing special at all despite endless hype.","rating":4,"date":"23 May 2009","review":"Most popular web sites covering the horror genre are embarrassing. You probably know exactly which ones I'm talking about. There are a handful of them, and they're always the ones being quoted on DVD covers and in commercials. What burns my goat is that these sites frequently lead horror fans astray by shamelessly gushing over the most cliché-ridden and mediocre crap being released these days. Why do they do this? The majority simply aren't impartial. Many of those in charge of these websites kiss so much director, producer and actor ass that they are no longer capable of writing an unbiased or less-than-flattering review. They fear that by speaking the truth they will risk the opportunity to get into advance screenings and may no longer receive free film merchandise, DVDs, early screener copies or chances to network and get themselves small movie roles, as well as possibly forfeiting bragging rights that \"so-and-so\" is a close personal friend of theirs. They know that throwing out excellent reviews to average (or in many cases awful) films equals free advertisement. These people aren't in this for their genre love as much as they are in it for themselves and thus everyone should really take most reviews from any of these online sites with a grain of salt. Incessant brown-nosing is an epidemic around those places.<br><br>How do I know? You're looking at a former writer for one of the most popular (if not THE most popular) horror sites on the web. And before you hand me a bowl to put my sour grapes in, let me make it clear that I threw up my hands and willingly and quietly walked away on my own accord because I was disgusting by the unprofessional and unethical practices conducted by the site I used to write for. I could no longer, with a good conscience, continue to write for them. My time is much better spent writing freely here on this website as opposed to having my reviews tinkered with behind my back or having the head honchos refuse to publish a review because (in their words) it would anger or hurt the feelings of a \"friend.\" If you recall a few years back when HOSTEL was released, a web site or two gushed about it being \"the most scary, most disturbing, most bad ass experience of the past 500 years!\" The same kind of overly-warm, suspiciously-glowing reception was given to HATCHET, but it doesn't really deserve that kind of acclaim. It's pretty ordinary. Some of the gore is decent, but that's about it. <br><br>As a spoof/parody/satire/\"loving tribute\"/whatever of slasher flicks, as I see some people claiming... well it wasn't particularly clever. Not as clever as, say, BEHIND THE MASK: THE RISE OF LESLIE VERNON, which is far superior to this one in my humble opinion. I think the humor missed the mark more often than not. As far as the supposed \"old school feel...\" Well, I'm completely sick of hearing that excuse for movies that are basically lacking. Bad acting? It's supposed to be bad! Bad dialogue? It's supposed to be bad! Bad movie? It's supposed to be bad! Try as some directors might, if your film looks extremely glossy and completely lacks grit, as well as incorporates CGI effects and a cast whose dialogue is little more than a constant stream of smarmy witticisms (apparently todays writers OD'd on Tarantino movies), then the \"retro\" novelty goes right out the window. This feels more like I KNOW WHAT YOU DID... than anything out in the early 80s. Just saying. T&amp;A? Yep, there's some of that here. Unfortunately, the shower/sex scenes of yesterday have been replaced by the \"Girls Gone Wild\" camera flashing/pseudo-lez make-out sessions of today, which are about as sexy as a root canal.<br><br>Then we have the obligatory \"name\" cameos with Kane Hodder, Tony Todd and Robert Englund's names adorning the DVD box. They were obviously hired to sell the movie and at least two of them appear in roles that are basically pointless. Joshua (THE BLAIR WITCH PROJECT) Leonard and John Carl (makeup fx maestro) Buechler also have small roles for what it's worth. As for the ending... Well, it kind of just ended. I'll give it that. A little abrupt for my tastes, but whatever. It was over. I guess we can now expect a sequel.","user":"capkronos","rank":[15,18]},{"title":"Much better than most, but...","rating":7,"date":"1 January 2008","review":"The tag-line \"Old School American Horror\" is a little misleading. While it's true that \"Hatchet\" recalls the mad gore of the 1980s, the \"horror\" factor is actually absent. Watching the film feels more like viewing a condensed reel of slasher kills with a few drunk and fun-loving friends - certainly not a bad thing, but not exactly a horror movie either. That being said, it's obvious that the people involved in the production have a real love for the genre. Kane Hodder's monster antics are always a delight, and Adam Green will definitely be a name to watch in the future. <br><br>In summary, I'd certainly recommend the film for anyone who gets a kick out of the slasher craze of the 80s, but be sure you're in the mood for goofy fun and not an actual horror flick.","user":"Obliviax","rank":[50,70]},{"title":"Sean of the Swamp","rating":5,"date":"8 September 2007","review":"Writing a review for Hatchet is almost pointless. Devotees of the horror genre will see this no matter what is written. In fact, a certain rhetorically named fan-boy website that prides itself on cool news has already lauded the movie's villain as the next horror icon. While I wouldn't be too sure about that, Hatchet does make one thing clear at least, and that's that writer/director Adam Green has undeniable talent.<br><br>Structured largely as a parody of the Friday the 13th films, Hatchet casts legendary Jason Voorhees stand-in Kane Hodder as Victor Crowley, the deformed son of a backwoods Louisiana bayou fisherman (also played by Hodder), who was presumed killed years earlier in a house fire started by a bunch of tormenting local kids.<br><br>Green follows the stock formula for such movies: take a bunch of folks, find an excuse to strand them in monster country, and let the audience revel in watching them get picked off one-by-one.<br><br>Where Green excels, however, is in his smartly written, comically-paced script that is chalk full of genuinely funny inside jokes that are blatant winks at the audience and along the way establish more of a bond with Sean of the Dead than Halloween.<br><br>In terms of horror movies, there's nothing going on here that is particularly inventive or even scary, but Green clearly isn't out to achieve that. Rather, he's paying homage to a genre that he grew up with, as is clear by the cameos he's given to icons Robert Englund (Nightmare on Elm Street) and Tony Todd (Candyman and numerous others).<br><br>Bolstered by good acting, top notch production values, and intentionally rubbery costume effects, Hatchet panders to the fan-boy crowd in glorious revelry. Clearly Green knows his audience likes to sit back, kick the Fangoria magazines off the couch, and watch somebody take a belt sander in their kisser.<br><br>While I think labeling Victor Crowley as the next horror icon in the same vein as Jason, Michael Myers, and Freddy is complete preposterousness, saying Adam Green is someone to keep an eye on is a more realistic, and complimentary laurel.","user":"Craig_McPherson","rank":[74,109]}]