[{"title":"A slow take on dreams and reality","rating":8,"date":"1 December 2013","review":"This is not a film for those who want speedy action, but the reverse. This odd movie plays entirely by its own rules, and it is not a masterpiece, but a really good try!<br><br>John Goodman, John Malkovitch, and Dena Delaney, are the pro stars in this little film about life, and dreams, while the younger kids (Jacob Zachar, and Skipp Sudduth in particular) do a great job here, too.<br><br>Slowly goes the story forward, in some ways reminding me of Kurosawa's movies about odd people, like his Dodeskaden.<br><br>A great, fresh, experience this film was, and I can't for my life understand why it has got such a low point as 5.0!","user":"tord-1","rank":[7,8]},{"title":"Small quirky suspenseful movie with fine performances, great cinematography, and an excellent score","rating":8,"date":"9 October 2010","review":"I recommend this movie based on excellent performances, a quirky, moody, suspenseful feel very well supported by unusual and highly effective music, and excellent cinematography.<br><br>This is a \"small\" movie in that it is based on clearly defined scenes, separated by time and geography, juxtaposed together to let the story unfold. The screenplay's roots in Bob Meyers's original play are clear.<br><br>The movie is also understated, leaving some of the work to your imagination. I like this in a movie, but others might find it unsatisfying. This understatement allows a delightful kind of organic humor to creep in from time to time, and allows suspense to build as well. Good job with this quirky directing style! <br><br>Several of the scenes between the John Goodman character and his business partner had the feel of two veteran actors sitting in front of a camera and improvising: \"You are two sleazy hustlers that have worked together for a long time, but one of you is having second thoughts. Act!\" They did a nice job with these scenes. Unfortunately, I dunno, to my mind all of those scenes after the important opening of the movie might better have been left on the cutting room floor. (Or, else at least include the other resolving scenes that would have let them actually mean something.) Certainly I would cut everything having to do with the partner's son and son's girlfriend, which added nothing, and had nothing at all to do with the rest of the movie.<br><br>John Malkovich was excellent. With him the movie is intriguing, and suspenseful. You cannot tell what is going on in his head (is he a brain-fried drunk, or is he in control, perceiving much that he is not letting on? Is he going to take action leading to violence?), but you WANT to try to figure it out. Without his stellar central performance, the movie would risk not hanging together at all. Yay to the Vietnam reminiscence scene with the chickens!<br><br>All of the performances in the movie were good (save perhaps the son's friend who had a small part and was passable). All of the acting was underplayed and subtle. Everyone was believable.<br><br>Much of the magic of the movie came from the mix of the unusual, but unusually effective, music, mixed with the brooding, darkly ethereal, cinematography. No schmaltzy rehashed formula strings with repetitive piano plonks here. Much attention was paid to instrumentation (steel drums? overtone-laden bronze prayer bowls?) and the effective use of space in the music to build suspense. The music, the sound, the camera angles, the overall mood in the camera-work did much to focus our attention on the meaning of the performances. Outstanding! <br><br>The *look* of the movie was also excellent. Even the pan-overview of a brick bungalow in Morton Grove gave us the feel something was going to happen. Be alert! The collage of old rotten boat-bottoms, mud, ancient house-trailer interiors, Southside Chicago expressways at night, rivers, power-lines, bars, and so on really captured the perfect mix between a real close-up view of Chicago, and the magical, beautiful, world of cinema.<br><br>I might have chosen a different ending, but in the interest of no spoilers, I'll not say more.<br><br>One theme about the movie stands out: \"Non-judgemental.\" In this particular way it had echos of Van Sant's \"Drugstore Cowboy\" -- and I mean that association to be high praise.<br><br>In short, this is a quirky, small, suspenseful movie that leaves plenty of room for the viewer's imagination, with outstanding music, with excellent cinematography and camera-work, and with some outstanding performances. It is probably not for everyone, but well worth it for the someone wanting to see, and hear, something unusual.<br><br>NOTE: A year later I am adding this footnote. This turns out to be one of those strange and wonderful movies from which the images haunt you a long time. I am very disappointed that it has not been released in theaters. Many movies have come and gone in my mind's eye since I saw this gem, but while they have faded, the images from this movie are still with me. Good job!","user":"thunderfoot1812","rank":[28,42]},{"title":"Warm, pure and realistic","rating":10,"date":"6 December 2011","review":"I loved this simple, little film. Not pretentious at all, compared to most movies I've seen lately. First of all, the mice-en-scene was fantastic with a steam punk feeling: boats, rusty trails, trains. This film made even an ordinary suburban area look interesting. The indoor settings were quite ascetic, but everything was well planned yet realistic. An unknown pearl. <br><br>I didn't imagine anything with John Goodman could be great, but I got positively surprised - even though his role was to play the funny guy.The main character, Mort, played by Malcovich was very realistic, deep and unintentionally funny, and so were the two boys. If you like realistic but somewhat crazy films that tell about a slice in some people's lives, you must see this.<br><br>They are marketing this film as a \"boat movie\". But the funny thing is that I don't even like boats. Still I just picked it up at the DVD-store. I'm glad I did. But the film wasn't actually that muck about boats, actually, but about family relationships, about how it is to be near a drunk, to have dreams, to adjust to how things actually are.","user":"finriikka","rank":[9,13]}]