[{"title":"touch of Gilliam","rating":7,"date":"13 September 2005","review":"Bizarre. Fantasmagorical. Frightening. A story-book nightmare. <br><br>Who else but Gilliam would give us a view of the inside of \"The Dude's\" ribcage?(Well, maybe Lynch)<br><br>In Tideland we approach to the edge of what is acceptable to the average film-goer but I kept wishing we would go over the edge and see what's there. Others in the audience claimed they wanted to escape to the lobby. It leaves most viewers uneasy, as if the film is an unpleasant taste to be rinsed from the mouth. <br><br>Whether or not you like it relies on the individual but what cannot be denied is that the film floats on the performance of Jodelle Ferland who plays 8 year old Jeliza-Rose as a modern day Alice though Tideland seems a far more frightening place than Wonderland. With the aid of her finger-puppet dolls' heads Ferland essentially inhabits 5 different roles withing the film. Easily one of the creepiest but most interesting performance by a child in years. <br><br>Good film? Bad? This hard-to-digest film seems to remain outside of such judgments. Best to see it for yourself. One thing is guaranteed: it's an unsettling journey into the realms of the weird.","user":"goldenboy72","rank":[221,255]},{"title":"Gilliam's return to form","rating":8,"date":"1 August 2006","review":"I was very intrigued by the range of opinions about this film, and I'm kind of agnostic about Gilliam at the best of times so could have gone either way. In the event, it seems to me like a very personal, smallscale and risky film - the kind of thing major directors don't do often enough.<br><br>Gilliam introduced the screening I attended by saying that plenty of the (invited) audience would hate the film. He also said that its subject is the resilience of children, in a world where we're encouraged to treat them as helpless victims most of the time.<br><br>I was pretty much enthralled from the opening scene. Jeff Bridges plays a character who's like the dark side of the Dude. A semicoherent junkie who's trained his daughter to cook up his heroin shots for him, he'd be the world's worst parent figure if it wasn't for the mother, a grotesque Courtney caricature who seems to me to be the only person in the film Gilliam's unable to summon up any liking for.<br><br>Events lead us into the wheatfields of the midwest and the story takes off into completely unforeseeable territory. There are countless reference points touched on over the next hour or so, in a very playful way - everything from Dorothy's farmhouse and her encounters with witches and brainless tin men, to the dinner table scene in Texas Chainsaw Massacre, to Psycho, to Jan Svankmeyer and The Bride of Frankenstein, and in what's either a major theft or a loving homage, one of the plot points of The Butcher Boy becomes a central event here.<br><br>The storyline takes detours into whimsy and the massively grotesque - there are two scenes here that will stay with me for weeks, one featuring a sex act in a taxidermist's workshop, the other best left undescribed - but there seems to me to be a central interest in the way that kids keep themselves sane through the most extreme circumstances, through imagination and play, and through projecting their fears onto made-up characters, that really shows an understanding of the way children's minds work.<br><br>The main character, the kid, is tremendously convincing, funny and - in the end - heartbreaking. I think this film might just stand with classics like Voice of the Beehive and Bernard Rose's totally underrated Paperhouse as one of the great films about solitary children and their imaginations, and their ability to rise above their fears.","user":"paulduane","rank":[161,184]},{"title":"The Age Of Unreason, Or...Why Terry Gilliam Can't Catch A Break","rating":10,"date":"18 November 2005","review":"Poor Terry Gilliam. The visionary director just can't catch a break. Blessed with one of the most fertile imaginations in modern cinema, equally renowned as an animator, filmmaker, and iconoclast, he has made a handful of highly original, single-minded films, most of which are now considered classics (although it tends to take a few years before critical revisionism regards his work as such; I bet few recall The Adventures of Baron Munchhausen was first considered a costly bomb on par with Heaven's Gate). But of late he has had to suffer a critical beating for his mainstream-designed The Brothers Grimm, not to mention the well-documented collapse of The Man Who Killed Don Quixote (why does the word schadenfreude come to mind?), and more often than not he is regarded as somewhat of a brilliant madman with integrity to burn, willing to battle Hollywood at any cost to keep his visions intact.<br><br>Now comes his adaptation of Mitch Cullin's Tideland, a category defying film that is at turns poetic, disgusting, absurd, and darkly funny (think the languid pacing of Spirit of the Beehive, the fever dream of Alice in Wonderland, the wry insanity Psycho, and a large dose of Terence Malik gone insane). In many ways, this is the purest Gilliam film since Brazil (a film that also borrowed liberally from other sources while maintaining its own originality), and hearkens back to the days when auteurs were not only allowed to follow their wildest muse but were expected to do so. And that, too, presents what will no doubt be Tideland's greatest failing, as well as its highest achievement. Cinema has become so cynical in the last twenty years - so narrow in scope and so entertainment driven - that anything which requires viewers to experience a motion picture on its own terms is usually greeted with scorn. These would be very tough times, indeed, for the likes of a young Fellini, Kubrick, and Lynch. That's not to say Tideland is a perfectly misunderstood creation, although it should be pointed out that those who are screaming foul about this film being pointless, self indulgent, and too weird are likely the very same people who ridiculed Grimm for being unoriginal, mainstream, and plain. Yes, there were walkouts at its screenings, gasps of shock, even angry grumbling. There were also laughs, applause, and continued debates concerning what the film was really about (how often does that occur these days after a screening?).<br><br>In the end, Tideland will likely please a select group who prefer to experience cinema rather than opposing it with their own expectations (there were those who were still talking about it two days following its premiere, even when they hated it). But for those who are anxiously wanting Time Bandits 2 or desire some degree of Pythonesque humor, Tideland will disturb, bore, and profoundly bother to the point of contempt. Nevertheless, it is a very unique and, at times, incredible film, infused with at least two amazing performances, beautiful photography, and one of the most enigmatic endings I've seen in ages.<br><br>Hate it or love it, few will be able to deny the lingering, ineffable vibrations left by this film, or that it stands as further proof that its director has stayed true to himself. Of course, prepare for the yin/yang laments to come in spades: Grimm would have been a better film had Gilliam been left to his own devices; Tideland would have been a better film had Gilliam not been left to his own devices. Poor Terry Gilliam; apparently he can do no right even when he does.","user":"bad_eats","rank":[444,524]}]