[{"title":"Deleted Scenes with a coherent story make for an awkward but somewhat funny movie","rating":29,"date":"29 December 2004","review":"Before seeing this movie, it is a good idea to see Anchorman. At that point, if you have not laughed yourself into a comatose state, then it would be a good time to see this film. From the first few moments watching this, you can see why the footage in this movie was trimmed from Anchorman. Not as funny as that film, the line delivery lacks the 70s-induced obliviousness of the original. What you do see is the main characters of the two movies get deeper into their characterizations, taking them in a slightly different direction from the first film. Some of the scenes in this movie feel out of place with the narration, an element of the film I personally could have done without. This review sounds negative, but what I am listing here are only small gripes with an otherwise acceptable film. Together, Anchorman and Wake Up, Ron Burgundy make one hilarious movie. Without the first, Wake Up Ron Burgundy feels kind of strange.","user":"mrderp123","rank":[25,27]},{"title":"A must for Ferrell fans... and especially for those who were begging for more of the news team...","rating":8,"date":"6 January 2005","review":"This film is definitely worth checking out if you were a fan of the theatrical film \"Anchorman: The Legend of Ron Burgundy.\" This feature seems to be made of cut footage from the first movie, including a complete alternate ending for the original film. In many ways, this second ending makes more sense from a writing standpoint, as many things that are introduced early on in the script (that are funny on their own, don't get me wrong) come back in the dramatic conclusion.<br><br>The only flaw in this feature is that it tries to pass itself off a sequel, instead of cut footage, and it doesn't quite work. Then again, if you can suspend your disbelief -- that concept becomes pretty funny, as well.<br><br>Chock full of great material from Will Ferrell, this film also gives some more screen time for Paul Rudd, Steve Carell, and David Koechner. Justin Long (Dodgeball) even makes an appearance.<br><br>Great stuff... although it starts to raise the question - how much money did they spend on this movie? Enjoy folks!<br><br>Goulet.","user":"SublimeCDS","rank":[30,33]},{"title":"This Was An Innovative Way To Show Deleted Scenes And Alternate Takes.","rating":16,"date":"16 February 2005","review":"As I am sure most of you know, Wake Up, Ron Burgundy was compiled completely of deleted scenes and alternate takes. Some are saying it is a sequel to Anchorman, but it feels more like an alternate movie. The same things happen to all the characters, but in different ways. All it took was a narrator to piece together the scenes on the cutting floor and there you have it, another movie! <br><br>Wake Up, Ron Burgundy is obviously not as good as Anchorman, due to the fact that most of the best scenes made it into the original movie. However, it is an awesome supplement to the original movie, complete with it's own set of special features. It even has it's own deleted scenes. Considering the movie is all deleted scenes, they must have had a ton of extra footage to pull together a project like this. If the movie had to stand on it's own, I would not rate it very high, but for what it is, I give it about a 6.5/10.","user":"BigHardcoreRed","rank":[40,48]}]