[{"title":"A Taut Political Thriller","rating":5,"date":"5 July 2014","review":"Gripping, brutal and powerful, 'The Last King of Scotland' is a brilliant dramatic depiction of the life of megalomaniac Ugandan dictator, Idi Amin, perfectly portrayed by Forest Whitaker in his Oscar-winning performance as one of the greatest casting against type roles seen in film. His Amin is capricious and unpredictable, a personality that can seem volcanic one moment and vulnerable a few minutes later. A blunt and brutal tale, and one that is highly engaging from start to finish. A taut political thriller about power and corruption. Macdonald's riveting and incandescent direction caps this fictionalised drama, a truly stunning flick that remains as a highlight of film in 2006.","user":"CalRhys","rank":[52,55]},{"title":"Idi Amin, Entertainer","rating":8,"date":"28 September 2006","review":"Life, unlike bad movies, is seldom obvious. In life, murderous dictators don't appear - especially at first - as mustache-twirling Snidley Whiplash figures, cackling madly (although Mussolini came close). The scary truth about monsters is that they are three-dimensional beings, not cardboard cutouts, who just kill a lot of people, but otherwise put their pants on one leg at a time, like you and I, and that makes them so much scarier than if they came from another planet.<br><br>In the best film of the \"dictator genre,\" Oliver Hirschbiegel's brilliant \"Downfall,\" Hitler appears as a man who is kind to his dog and his secretary (roughly in that order), and the impact of the work is all the greater as we witness what a \"real person\" is capable of doing. In Luis Puenzo's \"The Official Story,\" Pinochet's reign of terror is depicted through a single act of violence, as a door is slammed on Norma Aleandro's hand; the effect is stunning and \"real.\" <br><br>In the hands of a less talented director, the story of Idi Amin would be told against mountains of skulls and bones left behind by Uganda's mad ruler in the 1970s. (His total toll is estimated at 300,000.) In Kevin Macdonald's complex, intelligent, gripping \"The Last King of Scotland,\" more than half of the two-hour film subtly implies, hints at the dark forces underneath normalcy while \"life goes on.\" <br><br>And so, having established real contact with the audience, a jolly and seductive Forest Whitaker then takes our breath away as the mask comes off, and his Amin reaches out from the screen for your throat.<br><br>Macdonald - whose previous works are documentaries, including the Oscar-winning \"One Day in September,\" about the Munich Olympics terrorist incident - looks at Amin through the eyes of a young Scottish doctor (James McAvoy), a well-meaning, honest humanitarian slowly seduced by the Scots-loving Amin, who appoints him his personal doctor and then adviser.<br><br>The McAvoy character is fictional (although Amin did have a Scottish doctor), coming from Giles Foden's novel of the same name, but just about everything else in the film is based on fact - so much so that some documentary footage is smoothly integrated into the film. And yet, what's important and outstanding about \"Last King\" is that just as a painting can surpass a photograph in presenting reality, this film conveys the seduction and horror of a brutal dictatorship indirectly, subtly, unexpectedly.<br><br>Unexpected - and welcome - are the many flashes of humor, both Whitaker (dictator with personality) and McAvoy (eager pup of a doctor with overactive hormones) making the best of it. The tone is set in the opening sequence, as the frustrated, suppressed young Dr. Garrigan spins a small globe, swearing repeatedly that he will move to the first spot (\"the first!\") where he points when the globe stops. The first spot turns out to be Canada. McAvoy/Garrigan takes one look, hesitates... and spins again. And so to Uganda...<br><br>The linear, freely-flowing story-telling is masterful, taking us from the small village where Dr. Garrigan comes to do good and ends up doing well through a chance meeting with Amin, to Kampala, much court intrigue and colorful depravity (even as the fate of a nation is at stake), and eventually to Entebbe.<br><br>Fun and games, authentic scenery (the film was shot in Uganda), subtlety, psychology, a heart-pounding scene at Entebbe (after the hijacking, but before the Israeli rescue), nudity, sex, violence, harrowing questions about \"what would you do,\" and all - \"Last King\" is a wonderful compendium of facts and greater truths. Also, a hell of a good movie.","user":"janos451","rank":[148,168]},{"title":"Whitaker's Towering Portrayal of the Mesmerizing Ugandan Dictator Lifts This Historical Fiction","rating":8,"date":"2 February 2007","review":"Forest Whitaker's ferociously charismatic turn as Idi Amin so dominates this intense historical fiction that it is honestly difficult to pay attention to anything else in this 2006 political thriller. Even though he is definitively the emotional locus, he is intriguingly not the protagonist of the story. That role belongs to young James McAvoy, who plays Nicholas Garrigan, a precocious Scottish doctor who ventures to Uganda to satisfy his need for adventure after graduating medical school. By happenstance, Garrigan is called upon to help Amin with a minor sprain after his private car plows into a cow. Impressed by the young man's lack of hesitancy to take action, Amin appoints Garrigan to be his personal physician, a post that seduces the impressed doctor into the Ugandan dictator's political inner circle and extravagant lifestyle.<br><br>Scottish director Kevin MacDonald brings his extensive documentary film-making skills to the fore here, as he creates a most realistic-feeling atmosphere in capturing the oppressive Uganda of the 1970's. Helping considerably with this image are the vibrant color contrasts in Anthony Dod Mantle's cinematography and the propulsive action induced by Justine Wright's sharp editing. Screenwriters Peter Morgan (who also wrote \"The Queen\") and Jeremy Brock have developed a sharply delineated character study of Amin, who evolves from a magnetic leader giving hope to his people to a scarifying tyrant conducting murders on an imaginable scale (at least until the genocides in Rwanda and Darfur). It is impossible to over-praise Whitaker's towering performance here. He conveys the dictator's playfulness as well as his unmitigated rage moving from simmering to full boil with a power that is at once bravura and subtle. His relationship with the fictionalized Garrigan turns out to be the plot's essential pivot point, although the contrast between the two can be almost too extreme at times.<br><br>While McAvoy admirably captures the boyish naiveté of Garrigan, the character is drawn out in rather broad strokes that make his self-delusion all the more contrived as the story progresses. To intensify the political upheaval portrayed, the plot takes a melodramatic turn into an adulterous affair and even folds in the infamous 1976 Entebbe hijacking incident to illustrate Garrigan's increasingly precarious situation. It's all exciting and even downright brutalizing toward the end, but it also starts to feel a bit too Hollywood in execution. Kerry Washington shows genuine versatility as Amin's cloistered third wife Kay, while Simon McBurney oozes cynical suspicion with ease as a British operative. A convincingly Brit-accented Gillian Anderson makes her few scenes count as a weary clinic worker who proves to have better instincts than Garrigan. But see the movie for Whitaker's magnificent work. He is that good.","user":"EUyeshima","rank":[104,118]}]