[{"title":"Kokoda on a human scale","rating":8,"date":"19 April 2006","review":"While this film is not without it's flaws, it is definitely worth seeing. I found the dialogue hard to distinguish at times, and the plot line takes a little sorting out but the visuals work to stunning effect. It is a film that evokes a visceral (not to say gut-wrenching) response; one that brings the viewer much closer to understanding the nerve-jangling, terrifying experience of war, and the fortitude required to endure it.<br><br>Grierson's starting point are the words of the Isurava Memorial. It was the 'courage, mateship, endurance and sacrifice' of the boys and men of the 39th, 2/14th and 2/16th battalions, that bound these ordinary individuals together into a force stronger than the combined effects of their circumstances and the Japanese army.<br><br>The film is graphic in its depiction of the demands that that environment makes upon you physically. Though while watching it you might not feel the strength sapping jungle humidity or smell the stench of battle and its aftermath, you're left in no doubt about the challenges placed on human bodies by dysentery and malaria. <br><br>This is no glorification of war, but its grim and gritty reality. Seeing the film will help you appreciate the efforts of those who were there.","user":"bear-183","rank":[29,33]},{"title":"iconic point of Australian history","rating":7,"date":"23 April 2006","review":"In the mountainous terrain of New Guinea, is the Kokoda trail. A small band of improperly trained and ill equipped soldiers have to keep the advancing Japanese troops, threatening to over take Australia. The Japanese outnumber them one hundred to one; though this isn't their only threat; disease and injured soldiers are dropping like flies, holding out till the back up forces arrive.<br><br>Kokoda is a vividly created film on Australia's last stand against the Japanese army. Not covering all of war in New Guinea, we are only shown a small part, focusing in the fight of this small band of soldiers. Director Alister Grierson draws out the gritty detail of the land; the mud and rain in the claustrophobic rain forest. The are scenes of great intensity that play out like a horror film, mixed with some beautiful cinematography by Jules O'Loughlin.<br><br>Iconic part of Australian history aside, Kokoda isn't that great of a war film. Though struck with budget restraints, the problem lies within the script. The first acts seems omitted, plunging us right into action, there's not a lot of setup. The Characters aren't fleshed out, we don't know who these people are, making it hard to make an emotional connection; even though your placed right in the horror with them.<br><br>In a great performance, Jack Finsterer is amazing as Jack, leader of the small band of soldiers. Equally great is Travis McMahon as the hot-headed Darko. The rest of the cast doesn't compare to Jack and Travis, with cameos from Shane Bourne and William McInnes.<br><br>While Kokoda is not a epic war film, for which it should have been, Kokoda is a wonderful experience, paying homage to our war heroes.","user":"nobbytatoes","rank":[26,30]},{"title":"Realistic and moving","rating":8,"date":"16 April 2006","review":"There is a certain amount of trepidation in approaching a war film in the current climate of anti-war sentiment. Can you make it objective and avoid the over-sentimental patriotism of so many American entries in this genre?<br><br>The makers of Kokoda seem to have thought long and hard about this. <br><br>The moment in history depicted in this film is the invasion by the Japanese into New Guinea in World War 2. A situation that directly threatened Australia as most of the Allied forces were consumed with fighting their own battles many thousands of miles away.<br><br>For Australia it was a matter of going to this hostile environment to repel the enemy advance or watch them invade the homeland. Many volunteer troups were enlisted (known as \"chocco's\") to supplement the regular army. They were under-trained and poorly equipped for this battlefront.<br><br>We are shown that men may be drawn to war for the right reasons but when confronted with the prospect of death then the basic human instincts of survival take over. Would you just look after yourself or help your comrades?<br><br>First time director Alister Grierson and co-writer John Lonie wisely decided to take a small incident to humanise the situation rather than try for an historical docu-drama. The result is a tense, superbly acted and directed 90 minutes that never loses its grip.<br><br>Stunning cinematography highlights the beauty of the rainforest canopy against the human horrors unfolding below. <br><br>This would be a great film in any year. The fact that is has been put together by a first time director on a low budget with a mainly unknown cast (all performances are riveting) makes this a major achievement.","user":"Dash22","rank":[41,51]}]