[{"title":"Okay, Here's My Analysis of the Ending of Mandy Lane","rating":9,"date":"11 September 2013","review":"Spoilers.....................................<br><br>Mandy and Emmett are in on it together at first after the pool party. She is probably 100% into it because Emmett was ostracized when the first jock got killed at the pool party and her looks got her an instant acceptance into popularity. She stayed friends with Emmett on the sly. Emmett is a little more off the deep end than Mandy mentally--she's being wanted and adored and he is shunned. 9 months pass. Prior to reaching the ranch, Mandy and one of the boys stays behind to wait for the ranch hand to pick them up because the rich girl doesn't want to drive over a cattle guard. When the very adult ranch hand appears in the jeep after the boy makes his move, there is a change in Mandy's expression--starstruck would be a good description. She'd been dealing with boys, so Garth is probably her first experience with a grown male outside of school teachers. When the party arrives at the ranch, there's a slo- mo of Mandy looking around, almost like she is casing the place. Her bond with Garth hasn't formed yet, so she is still team Emmett. Up to when Garth is shot by Emmett, Mandy's hands, if not conscience, is clean. She stays in the main ranch house to patch up Garth. Red and Chloe make a run for it. Mandy's administrations have a definite sexual overtone, all on her part. You can see her alliances shifting; Garth has obviously not been included in the plans. Red gets shot, Chloe runs, finds the bodies like somebody has to in a slasher. Garth tells Mandy his jeep keys are in his cottage and to go get them. While Mandy is getting the keys, she finds a sharp knife with an antler handle on the counter. She takes both. Emmett drives after Chloe through a hay field, obviously capable of running over her but choosing to chase her, cat and mouse style. Mandy sees her, yells for Chloe to run to her and Chloe does. As Mandy hugs Chloe to her, she stabs her fatally with the knife while telling her with real emotion it will all be okay. She hugs Chloe for two reasons: she didn't want to kill her friend so holds her close to soothe her through her death; two, Mandy needs blood on herself so Emmett would believe she killed Garth. The suicide pact probably was real when the two of them cooked it up, but Mandy has changed her mind. Mandy refuses to take the pills that will kill her. She sees Garth stumbling behind Emmett and she cries out for Garth to shoot Emmet. Emmett gets hit, but still has some strength to beat more crap out of Garth until Mandy distracts him and she starts running across a field only to fall into a pit where diseased cattle had been killed (discussed earlier). Emmett still thinks he can persuade Mandy to come back to him, but she beats him to death with probably a leg bone, leaving him with the line \"she'd like to finish high school.\" Clues of Mandy's involvement culminate in her waking up in the kitchen with a streak of blood in her hair as if Emmett had to stroke a strand when he was in the kitchen making the refrigerator magnets line up to spell \"Wake Up\": not only to wake up from sleeping but that it was time for her to do some of the bloody work-- another reason she chose to kill Chloe over Garth (she needed to have blood on her for when she saw Emmett face to face--it was a bonus for Emmett to see her kill Chloe too). Approaching Garth at the end, Mandy has the knife and there is a brief moment where you might think she's going to finish him off too, but she has chosen him as her man. I'd argue she chose him as soon as she took the truth/dare to go to his cottage and invite him to the party. It isn't exactly a move for a shy, virginal girl to do. It shows her interest in Garth and that she trusts he isn't going to hit on her as every other boy does. She bundles Garth, alive, into the jeep, and they drive off into the sunset (?) to one of the many appropriate melancholy remakes of the cheerful hit songs of slasher golden days. Garth is the male figure she wants, not only as a role model, but as the \"final bachelor\". So sayeth I, who was around in the 1970's to see the original slashers. The twist is killer, haha, but it makes sense when you think about it. Emmett is the willing killer for a warped love. Until this weekend and her encounter with Garth, I don't think Mandy had any sexual feelings at all, other than to repel them. But once Emmett was in full tilt, she was forced to participate. I would almost class Mandy as a suicidal prone person used to being objectified (by peers) and abandoned (she's an orphan). Garth has integrity, maturity, values, and an adult role model with sexually controlled behavior who admires Mandy, particularly at the end when he says she saved them, which gives her more self worth than just her looks. If it lasts, who knows.","user":"omgllc2012","rank":[23,28]},{"title":"All the boys love Mandy Lane. But why?","rating":5,"date":"20 September 2008","review":"Before renting \"All the boys love Mandy Lane\", I saw its trailer in the YouTube to check it out. Good cameras, interesting story and there were some good reviews in IMDb. Well, maybe I was in for a surprise. You never know. So I took the risk and rented the film. But in the first moments of the film, I noticed that this one was not different at all - it was just another brick in the wall.<br><br>To begin with, apart from the differences of sex and looks there's nothing to really differentiate the characters in this film. Other films are able to provide simple characters (even if one-dimensional ones) with whom we can identify with. This film gives us a very superficial glimpse of the characters, their relationships, conflicts.. What we see in \"All the boys love Mandy Lane\" is just a bunch of stereotyped American teenagers like we've seen so many times before.<br><br>And how is Mandy Lane? Mandy Lane, as portrayed by Amber Heard, is just your typical high school girl. There are many girls like her - in any high school there are dozens of Mandy Lanes. Amber Heard has nothing really distinctive about her. She's pretty, that's all. Then, why do all the boys love Mandy Lane? This is a film, that's why.<br><br>That said, let's go to the film. As you well know, all the guys are mad about Mandy Lane. The boys (with the help of the girls) prepare a party. Mandy Lane is invited to this party. The party is to take place in an isolated ranch. No one had succeeded till now in scoring Mandy. The objective of this party is to ease things out. A girl in the group wants to make it with a guy, there are rivalries, frustrations, and last but not least, there's someone that loves Mandy so much that he/she is ready to kill for her. But make no mistake, anyone will guess from the beginning who the killer is, but prepare yourself for a wild twist that will put everything upside down.<br><br>If the script had managed to give us flesh and body characters and describe in more detail the relationship among the characters (their emotions, their conflicts...), this film could have been a memorable slasher teen flick. Had the film been done in the right way, there would be in it a growing sense of fear, of encirclement. Conflicts, fights, suspicion, and death advancing on and on.. outside just the empty fields... but the film is unable to build up the suspense. <br><br>\"All the boys love Mandy Lane\" is just a passable entertainment and nothing more. If you want to see a film with more substance try \"High Tension\" (Haute Tension), a very good french slasher flick.","user":"andrabem","rank":[45,66]},{"title":"I struggled with this ... but ending is OK","rating":3,"date":"19 September 2010","review":"I struggled for most of this film; the archetypes were cliché ridden empty vessels. If Mandy uses her beauty to attract attention that's a hell of a long game and a pointless objective. Why was being an orphan relevant to this script? why was being beautiful such a distraction for a whole school? why was the dowdy aunt even in this film? why did the edgy male in the gang show us he could fire a gun at a clay pigeon? why do whippets and drugs have a five minute high in this film? why do I care about any of the characters? Too much of this film is subjective; some shots are excellent and stylised but the content leaves a lot to be desired; some of the gore is well done; in the q &amp; a on the DVD the lead actress talks about awkwardness in Mandy Lane's character as she took her clothes off to join the group in a lake - I saw a classic playboy disrobe shot of a pretty girl. So much potential was overlooked in the script from a very good premise.","user":"sonicred007","rank":[18,26]}]