[{"title":"Standard submarine movie with a gay twist","rating":7,"date":"3 April 2005","review":"This movie first aired 4/1/2005 on -&gt;hereTV, the gay pay-per-view satellite channel. The guide description reads \"A submarine commander (Adrian Paul), who is gay, combats a mysterious enemy while silently mourning the loss of his partner.\" <br><br>The movie starts out with the obligatory gay scene, but it has practically nothing to do with the rest of the movie. There is a nice moment of closure on the gay storyline at the end of the movie.<br><br>The acting is pretty good, but most of the underwater effects are a little cheap. Any scene with a torpedo or depth charge in it looks totally fake, but other scenes looks reasonably acceptable.<br><br>I found it to be pretty good for a submarine thriller, but was a little too light on the gay content to warrant being classified as a gay-themed movie or getting first-run on a gay channel.","user":"WinBearTx","rank":[24,33]},{"title":"Terrible","rating":1,"date":"26 May 2006","review":"One a wet evening, I decided to pop down to the DVD machine around the corner to pull out a DVD for the whole family. Phantom Below looked promising so I decided to take it.<br><br>What a disastrous movie. 90 minutes of pure agony. The cast is poor, the script is bad and the visuals are pathetic. You expect to watch a movie about a submarine, in reality the shots of a submarine are limited. Instead you are presented with computer animated shots of submarines, torpedo's and the like. They must have really saved on the computer animations because they look as if they come straight out of a cheap third rate computer game.<br><br>The inside of the U-boat is also completely unrealistic. The studio shots remind you of 70's movies, they are so fake.<br><br>There are some pretty good U-Boat movies out there. This one certainly doesn't rank among them. Don't waste your time watching this one.","user":"boxmaker1963","rank":[24,38]},{"title":"Great","rating":9,"date":"31 July 2008","review":"Personally, I loved it. I'm sorry for the others that felt it was so bad. My husband and I have watched it several times. <br><br>I think Adrian Paul did an excellent job. He's a very good actor in all his films. The other's were pretty good too, but maybe one out of the bunch could have been better. <br><br>But other than that, we were thoroughly entertained. I'm sure there are things that stand out to men who have been on subs before that were totally unbelievable. I can understand that. I show horses and almost every horse movie I sit there and pick out what's unrealistic. It's happens with all movies.<br><br>It just shows that what's good for one person, might be bad for another. I hated Natural Born Killers and Pulp Fiction - go figure.","user":"kris-burkett","rank":[6,8]}]