[{"title":"Step Up does justice to its genre by not pulling any stops in delivering a truly enjoyable movie","rating":9,"date":"11 November 2006","review":"Choreographer and now director Anne Fletcher hits the mother lode with this gem of a dance flick! Having painfully seen similar dance-themed teen movies in the past (Take the Lead, Save the Last Dance, etc.), Step Up does justice to its genre by not pulling any stops in delivering a truly enjoyable movie. Hindi nagtipid sa pasikat.<br><br>Unlike similar movies where the audience agonizingly waits through scene after scene of boredom for a grand dance finale (which usually fails to enthrall anyway), Step Up treats the audience to several impressive, memorable sequences thoughtfully scattered throughout the movie. Finally, we are entertained by a dance flick where the leads (Jenna Dewan and Channing Tatum) are both beautiful to watch, have good chemistry (enough to sustain the kilig factor) and can really deliver the moves.<br><br>Dewan is a superb dancer; she has a fabulously fit body, not the anorexic ballerina type, and she dons her outfits exceptionally well for someone who's only 5'3\". It was also amazing to watch such a tall, gorgeous man like Tatum move the way he does (it must help that the boy knows his Kung Fu!). His deadpan facial expression makes his line deliveries unexpectedly funny. The supporting cast also amply sustains the rest of the story. Step Up churns out enough high points that you pardon its hiccuppy subplots and scene-stealing extras.","user":"jemps918","rank":[55,67]},{"title":"step up was GOOD.","rating":9,"date":"14 August 2006","review":"people keep talking about how awful \"step up\" was, or how it was such a waste of money. but now here are my two cents. it was, in fact, a good movie. the dancing was FABULOUS, and even though the acting could have improved, this movie was nothing short of amazing. the music was catchy and hot, and there was just enough romance in it to make it cute but not gross or sleazy. it had literally EVERYTHING you could ask for in a movie: romance, drama, comedy, and it was even slightly scary at some parts, too. Channing Tatum and Jenna Dewan did a great job. their dancing, along with everyone else's, was phenomenal. when i left the movie, i was actually inspired to be a dancer (even though i never will be.) the main reason people are turning down this movie is because of the acting. sure, the acting could have been better, but this movie was focusing on the DANCING. obviously you have to be a good actor to be in a movie, but the dancing was the main focus of this film. and i personally think the dancing was great. i couldn't ask for it to be better. this movie is definitely worth seeing, whether you're into hip-hop or not.","user":"avoisawesome","rank":[165,226]},{"title":"A Wonderful and Delightful Surprise","rating":8,"date":"7 November 2007","review":"In Baltimore, the troublemaker and street dancer Tyler Gage (Channing Tatum) lives with his foster parents in an Afro-American lower class neighborhood. His best friends are Mac Carter (Damaine Radcliff) and his little brother Skinny Carter (De'Shawn Washington) and they use to hang around together, going to parties and stealing cars. After being expelled of a party, the trio breaks in the Maryland School of Arts and commits vandalism, destroying the stage. Tyler is arrested and sentenced to 200 hours of community service in the school and Director Gordon (Rachel Griffiths) assigns him to help the janitor cleaning the place. One afternoon, the ballet dancer Nora Clark (Jenna Dewan) sees Tyler dancing in the parking area and when her partner Andrew (Tim Lacatena) has a strain and Tyler offers to help her in the choreography, she accepts the offer; they rehearsal and become close to each other while Tyler becomes friend of the students Miles Darby (Mario) and Lucy Avila (Drew Sidora). When Andrew returns, Tyler that is known for quitting everything he starts gives up dancing and leaves Nora alone. After an incident, Tyler has to decide to follow his dream or return to his life of rebel loser. <br><br>\"Step Up\" was a wonderful and delightful surprise for me. The heartwarming romantic story shows a perfect chemistry between Channing Tatum and Jenna Dewan, supported by a magnificent cast and awesome songs and choreographies of dance. There are also drama and tragedy, funny moments and I recalled Alan Parker's \"Fame\" and \"Center Stage\" with the students following their dreams in an art school. The characters are nice, the actors and actresses are excellent and I have really loved this movie. My vote is eight.<br><br>Title (Brazil): \"Ela Dança, Eu Danço\" (\"She Dances, I Dance\")","user":"claudio_carvalho","rank":[30,37]}]