[{"title":"Enjoyable British comedy/horror from the director of Creep.","rating":7,"date":"18 November 2006","review":"Severance is a pitch-black comedy/horror that successfully blends laughs with outrageous scenes of extreme violence to tell the tale of a group of employees for a weapons company who, whilst on a team-building weekend in Eastern Europe, run into trouble when they are attacked by masked assailants.<br><br>I found the film to be both highly amusing and also rather creepy, although how much you enjoy the film will depend on how warped your sense of humour is. I liked it a lot, but then my sense of humour has always been rather questionable.<br><br>The story, which bears some resemblance in places to the extremely over-rated Hostel, allows some conjecture on the audience's part as to exactly who the killers aresomething I particularly liked. Theories are bandied about by the film's characters, but the issue is never resolved absolutely, allowing the audience to decide for themselves.<br><br>The likable cast give sterling performances and manage both the comedic and horrific elements with ease. Director Christopher Smith, who also made the rather humdrum Creep, handles the action well, and the film moves at a brisk pace delivering plenty of chills and thrills along the way.<br><br>And to cap it all, Smith makes sure that the gore-hounds get their quota of blood 'n' guts, and even finds time to throw in a couple of topless escort girls for good measure.<br><br>I give Severance a very respectable 7 out of 10.","user":"BA_Harrison","rank":[58,71]},{"title":"Not really any spoilers to worry about. Severance is both fun and gruesome!","rating":7,"date":"26 August 2006","review":"For the better part of a decade every British comedy or romance was hailed as 'The funniest film since Four Weddings and a Funeral'. Although there are many Brit films made in any year worth a look, only one will truly be mass marketed and labelled as our best export. With Four Weddings' a distant memory, anything remotely amusing or linked with horror is now wrongly compared to Shaun of the Dead (or possibly Dog Soldiers). Poster quotes and lazy comparisons aside, it's nice surprise that for a horror comedy, Severance isn't actually half bad at all.<br><br>The plot is nice and simple. A (predominantly English) sales division working for a multinational weapons corporation are sent on a team building exercise in Hungary only to find themselves stuck in a dense forest where they are being hunted by a merciless European gang.<br><br>While Severance doesn't do anything particularly wrong, there are of course a couple of faults. Any work environment has to have some pretty unlikeable characters so it's unavoidable to feel less sorry for some when the killings start. Toby Stephens is undoubtedly one of the finest actors around, but he's yet to play a role in a successful film that really does him justice. Utterly capable and ever reliable Tim McInnerny (of legendary Blackadder fame) is amiable enough, but it's Danny Dyer that gets most of the punchy one-liners as the part-druggie, part-chav cheeky chappie he's grown accustomed to playing. Thankfully, cute Laura Harris hasn't been cast as the 'is she or isn't she the villain all along?' as it's really time she ditched that and moved on.<br><br>The two distinct genres don't always make for a happy marriage and eventually the tone shifts over to deadpan. At least one line is stolen from elsewhere but there's a couple of shots that felt like homages rather than plagiarism. There's more than enough laughs and nasty moments to fill both audience preferences. The fast pace means Severance doesn't risk outstaying a welcome, the special effects team did a great job and the camera work is suitably snappy. The only real risk is hype as anyone expecting anything other than a night out with a few grim moments and some genuine belly laughs will leave wondering what the fuss is about. Try to avoid thinking about where these guys took their inspiration from too as that wouldn't do anyone any good either. A solid 3 star experience that hopefully has some extra bits come home-entertainment time.","user":"Youkilledmypine","rank":[81,105]},{"title":"Funny, scary, clever and even moving","rating":9,"date":"24 August 2006","review":"I was a big fan of Chris Smith's previous film Creep and had heard this was even better so I had high expectations going in. They were completely surpassed by this superlative slice of hilarious horror action.<br><br>The way the film combines humour and horror is skilled and the script is smarter than average for the genre. The film works better as a comedy and there are some absolutely precious comedy moments that I won't detail here as I don't want to spoil any of them. Suffice to say that the audience were busily quoting them and some of the better of the fantastic lines of dialogue after the screening. I feel people will be quoting some of these lines for years!<br><br>On a more serious note, there are some seriously scary scenes in the picture and even a couple of deaths of some of the more sympathetic characters that are actually quite moving.<br><br>The cast is also perfect, none of them put a foot wrong. Laura Harris completely kicks ass as the heroine.<br><br>I sorta want to see a sequel but heaven knows where they'd go with it.<br><br>Overall, I loved the film - it's made by a writer and director who are genuine horror fans and it shows. They're also both very talented.","user":"glennondaniel","rank":[97,136]}]