[{"title":"Jet Li in a Masterpiece","rating":10,"date":"26 April 2006","review":"I've always been a fan of Jet Li since his early days, and frankly his movies and performances in them have been terrible in the last few years mainly due to his attempts to be a profitable and a more mainstream actor in the US. As a result, we were treated to \"nice\" movies like The One and Cradle to the Grave. This movie though makes up them. This was truly a gem. Not only were the action sequences spectacular, and I iterate spectacular, but the story line and acting as well as screen play was very tastefully done. Gone were the traditional comedic side plot, and welcomed was a sense of respect not only for the Chinese but also for some of the foreign countries that are often portrayed poorly in the movies. In the end, I can't help but feel like I've not only seen a great movie but felt the humanity and pride that the movie released. See it!","user":"drqu1981","rank":[174,216]},{"title":"A Great Action Flick, Stunning Performance","rating":9,"date":"30 January 2006","review":"This is the first martial arts film that I enjoyed very much. It has a very strong plot which is also based on a true story about an martial arts master, Huo Yuan Jia and together with great actors and actresses, a masterpiece is presented. As an Asian, I have already seen too much martial arts movie, however this one stuns me with the story and acting as I have mentioned above, but as well as their visual effects, every movement is shown clearly, one would find their heart beating hard as the fight is going on, the music in the film also fits perfectly with the film. I have to mention that this film is quite Hollywood standard and I believe it is because Jet Li had already learn a few elements to make a good Hollywood film when he was filming some Hollywood films a few years back. As Jet Li has said, this will be his last martial arts movie and wants to make it a good one, I think he has already fulfilled his dreams, because this is a truly Jet Li movie and I think a lot of people would like this film.","user":"JJ_oscartsang","rank":[149,189]},{"title":"Jet Li's paean to martial arts","rating":8,"date":"13 April 2006","review":"Make no mistake about it, Fearless is the best straight-ahead martial arts film since Jackie Chan's seminal Drunken Master 2. Director Ronny Yu crams more bone-jarring, well crafted fight scenes into the first forty minutes of this movie than most films can match in their entire runtime. This is a canny move, as it pulls in the viewer via the blurring action before beginning to develop the film's narrative in the middle third. While the story is a well used one (kung-fu bully comes to realise his skills can be used to educate rather than brutalise), it's a perfect structure on which to hang the film's many excellent confrontations. It's obvious that this film is Li's love letter to his Wu Shu background and martial arts in general. In dramatic terms, Fearless never reaches the heights of recent wuxia movies like Crouching Tiger, Hidden Dragon or Hero and so is unable to feel truly fulfilling as a great movie per se. It is however up there with Jet Li's very best work in the genre, OUATIC &amp; Fist of Legend for example, and if it is (sadly) true that it is to be his last period martial arts picture, it's a hell of a bang to go out on.","user":"rmj1971","rank":[109,137]}]