[{"title":"Intelligent Movie","rating":9,"date":"11 September 2015","review":"This movie is obviously allegorical, a fascinating tale about AI, but it is mainly about manipulation and power. It isn't for those wanting action or spectacular CGI, the movie is aimed at people who like to think, rather than passively wait to be entertained. There are themes here not only about AI, but also about surveillance, with excellent points about how data about us is collected by phone companies, search engine companies, commercial operating systems makers and so on. The plot seems simple but isn't, it's extremely clever, with the protagonist playing games, trying to stay one step ahead of one another. This is a movie with perfectly consistent internal logic that plays out perfectly. Don't go in expecting too much, however, as I can see most people will not be satisfied by this movie, but for me, it does what it sets out to do brilliantly. Therefore I give at least 9/10. And most recent movies have been getting 5/10 from me. This movie succeeds where another recent movie about AI, Transcendence, I think it is called, failed (but it was an interesting failure). A third movie about AI, a Spanish movie called Eva, was also brilliant. Eva was more moving and this movie more philosophical. But both movies were perfect in their different ways. The AI's name in this movie, Ava, seems to be a nod to the title of the Spanish movie. As an aside, it's nice that no \"stars\" appeared in \"Ex Machina\" and \"Eva\", the casting was great. Of course there are several aspects of this movie that are unrealistic and often absurd. But because this is an allegorical movie, these are acceptable, because the movie is making points, rather than striving for realism. It's more of a fairytale than accurate portrayal.","user":"Jim-Eadon","rank":[169,212]},{"title":"Paranoid Android","rating":9,"date":"26 April 2015","review":"Ex Machina has a very fitting sense of false intimacy. This is done visually as many of the close-ups are seen through glass. No matter how close we get to the subject on-screen, there always seems to be at least one wall of glass between us and it or them. The film also makes a very distinct contrast between it's interior and exterior shots. Outside of the facility is breathtaking landscapes. It is big, beautiful, refreshing and vibrant. Inside seems like an endless futuristic maze of glass, mirrors, plastic, chrome and dim lights. It is clean, cold and claustrophobic. A perfect setting for the subject that is explored in this tight, tense sci-fi thriller.<br><br>Ex Machina is the best science fiction film on artificial intelligence since Blade Runner. While Blade Runner is an action thriller that relies more on it's epic visuals to tell it's story, Ex Machina is a dialogue-driven psychological thriller that slowly works it's way under your skin. Thought-provoking and terrifyingly suspenseful, an induced state of paranoia may linger long after the end credits begin to roll.<br><br>The less you know going into a film like this, the better your experience will be. Alex Garland has given us a modern science-fiction masterpiece. Performances from all three leads are flawless and every other aspect of the production, from the cinematography to the soundtrack, is perfectly suited for the story. Not only is Ex Machina an amazing achievement for a directorial debut, it's Alex Garland's best written work to-date.","user":"themissingpatient","rank":[401,537]},{"title":"I think therefore am I?","rating":8,"date":"26 January 2015","review":"Ex Machina has a simple story dealing with a deeply complex and philosophical topic: namely what makes humans human.<br><br>The increasingly omnipresent Oscar Isaac plays billionaire Nathan Bates, genius creator of 'Google' - my mistake - 'BlueBook', the world's \"leading search engine\". Bates lives in the middle of the American wilderness (in reality, a very picturesque Norway) and in a property that actually exists (BlueBook the Juvet Hotel). He is leading a one-man research project into the development of an Artificial Intelligence. Leading neatly on from the recent Cumbur-busting \"The Imitation Game\" the eccentric and erratic Nathan needs to share his work with someone external in order to perform 'The Turing Test' - the test to determine if a machine can genuinely pass itself off as human to another human.<br><br>Domhnall Gleeson' character (Caleb) works for BlueBook and wins the Wonka Golden Ticket to spend a week with Nathan, becoming the human side of the test. Ava is the beautiful and seductive android subject and the film clinically walks through the sessions between Caleb and Ava, watched over by Nathan via the villa's comprehensive CCTV system. The only other significant character in the film is Nathan's house maid Kyoko (Sonoya Mizuno), who neither understands nor speaks English so drifts silently around offering various 'services'.<br><br>We have been here before: Ridley Scott's \"Blade Runner\" and Spielberg's \"AI\" both covered similar ground, but in perhaps a less claustrophobic manner than Ex Machina. This serves the story well, ramping up the tension as an age old Sci-fi plot-point emerges (as covered by the trailer): how will a sentient machine feel about having its plug pulled. (No rain or doves are included in this one).<br><br>The acting is all up to snuff, with Isaac - this time hiding behind a Brian Blessed-style bushy beard - looking and acting for all the world like George Clooney. Domhnall Gleeson (\"About Time\", \"Harry Potter and the Deathly Hallows\" and getting all the roles that Paul Bettany is now too old for) makes the journey well from nice but naive employee to a much more world-wise freedom-fighter. Swedish-born Alicia Vikander, currently also leading in \"Testament of Youth\", is deliciously sensual as Ava (albeit - and trust me to notice this - that her significant assets seem to vary in size during the movie). She is also an excellent actress, having to reflect a wide range of emotions through little else than her eyes.<br><br>I really enjoyed this film. However, that is on the basis that Science Fiction is one of my favourite genres: I can see some audiences finding the philosophical plotting too slow and wordy to hold their interest. But if you like your films deep and thought-provoking, as well as deliciously tense in places, then this might be for you.<br><br>The writer and director is Alex Garland, and this is actually his impressive directorial debut. He is of course best known as a writer, having penned the novel of \"The Beach\" and the screenplays for films including \"28 Days Later\", \"Sunshine\" and \"Never Let Me Go\". Also hats off to the special effects crew (led by Richard Conway) since Ava is a miracle of visual effects. The effective keyboard score is by Geoff Barrow and Ben Salisbury.<br><br>The film pleasingly doesn't outstay its welcome, also leaving some loose ends to ponder on after the lights come on and the screeching credits song (sorry, but it's just AWFUL!) drives you from the auditorium. Also be aware that for those offended by full frontal female nudity, or indeed those that enjoy it, that there is a good deal of it in this film. (Lads, practise the excuse now: \"But it's fine dear - - she's not a naked women she's a robot!\").<br><br>(If you enjoyed this review, please see the multi-media version at bob-the-movie-man.com and enter your email address to receive future posts. Thanks.)","user":"bob-the-movie-man","rank":[513,705]}]