[{"title":"The Joys of Sadism","rating":2,"date":"25 October 2012","review":"Can we finally acknowledge that horror films have largely turned into another genre, that of sadism? There is a huge difference between film bloodshed and gore that is a part of a horrific/suspenseful scenario, and that which is done so the audience can watch people undergo agony, as in the 'Hostel' franchise. I can't take it. It is not scary; it's just disgusting. As in this film. Take away the idiot decisions about the gun, going outside, leaving your girl alone in an isolated home after a freak comes by, calling for help, etc., and there's the making for good, scary suspense. Turn it into an exercise in extended sadism, and it's purely gratuitous in a disturbing way. Do people actually think it's 'scary' or 'suspenseful' to watch the girl beg for her life, as she sees her guy stabbed and stabbed? It's not. It's unrelenting misery and there's something way wrong with anyone who thinks it's good filmmaking. The strangers were extremely terrifying, and there are psychopaths out there. But this nightmare of torture and sadism is NOT a great scary movie (which I love as a genre), or suspenseful. It's mean and ugly, and what scares me is how torture is the new horror.","user":"jacklmauro","rank":[99,120]},{"title":"The characters in Friday the 13th are Rhodes Scholars compared to the characters in The Strangers","rating":1,"date":"7 July 2008","review":"If you are a fan of horror films, then you have probably seen Scream. In it, Randy, the resident expert of the idiocy of horror movies, gives you the rules of horror films. In it he tells of all the things you should do in a horror film, but end up not doing anyway. I think this film is inspired by Randy's dialogue in Scream. This is the most clichéd horror film in the history of clichéd horror films. Comparing this to Halloween or the Shining makes me throw up in my mouth a little. It is just plain blasphemy. This is nothing like the greats from the 70's and the 80's. It's not even as good as CHUD, Friday the 13th or any other decent but flawed horror film.<br><br>The problem with this film is that everything that these characters should not do, they do. Now, THERE ARE GOING TO BE PLENTY OF SPOILERS HERE SO IF YOU REALLY DON'T WANT TO KNOW ANYTHING FURTHER BECAUSE YOU ACTUALLY PLAN ON WATCHING THE FILM, THEN DO NOT READ ANY FURTHER.<br><br>First, you are being hunted in the house, you have a shotgun that can blow a hole through an elephant, and you are in a room that has one way in and one way out. You are safe. All you have to do is wait it out or the both of you leave the house together with the safety of the shotgun. Or of course the alternative is to separate and one person stays behind without the shotgun, the other goes to a barn to find a two way radio. The last thing sane people do is separate. If I was being hunted in my cottage with my wife by my side, the last thing I would do is let her stay behind while I go find a radio. She would be by my side all the time.<br><br>The best friend comes over at about 4 in the morning. He sees his buddies car bashed up. He sees the door with axe marks in it. He can see that something isn't quite right. Then has something smash his window. What should he do? Before entering the house, he should call the police and report suspicious behavior. But no, of course not, he enters the house with the loud playing music and doesn't call his friends name, or turn the music off, he of course walks silently into the open doorway and gets shot in the face by his best friend.<br><br>The classic case of not believing your girlfriend when she tells you that someone has been in the house. \"No sweetie, you just imagined that you saw someone and you must of dropped your cell into the fire.\" Sure that happens all the time.<br><br>Every one of these characters deserved to die. They were stupid, unrealistic and completely clichéd in the worst possible way. And for the makers of the film to pretend this is based on true events is ever so manipulative. I read the supposed case this is based on and saying this is based on a true story is like saying Rambo is a love story. It's just plain wrong.<br><br>The Strangers is one of the most incompetent films I have ever seen. There is no suspense, no thrills, no chills. There could of been, but you lose all feelings of remorse or sense of caring for the main characters because the screenplay betrays them so much.<br><br>1/10 Truly, truly horrible film.","user":"baumer","rank":[117,148]},{"title":"What a waste of time","rating":1,"date":"29 May 2008","review":"*** Warning *** Spoilers *** For such a short film, this managed to cram in every senseless cliché of the so-called horror genre. '...Girl runs from bad guys, girl trips, girls falls and hurts herself, girl whimpers, duh...' No character development, no depth, no sympathy for the characters. '... bad guys are harassing your house and threatening you, so OF COURSE you get hysterical, cry, and seek out every spooky noise...' So bad guys are hacking at your front door with an ax, you've got a loaded shotgun in your hand, but you don't shoot, you throw a chair at the door, Oh Wait, I've got a gun! But by the time you think to shoot the bad guys are gone. So your under attack from bad guys and it's just you, your girlfriend, and a loaded shotgun, so instead of hunkering down and letting them come to you to get shot, you leave your girlfriend alone in the un-secured house while you wander off to the tool shed to find and old ham radio. Sure, makes sense. So you go visit your friends and someone shoots out your windshield, do you: A- drive off fast and call 911, B- call 911 then run in the house to check on your friends, or C- dust yourself off, sneak into the house quietly, without ever bothering to wonder why your friend's car is wrecked, who's pickup truck that is, why the house is trashed, don't bother turning off the loud stereo, or calling out your friends' names, in fact don't even bother to look behind you to see if maybe the people who shot out your windshield are still around. That's right - C !?!Everyone who died in this movie deserved to die for being such mindless, spineless, insipid, whimpering idiots. Maybe if you've never seen a movie before, ever, or if you've had recent head trauma, or maybe if you're Amish this movie might scare you. Maybe. Don't waste your time or money.<br><br>REVISION::: it's now Sunday 6/1. I originally posted the above comment after an advance screening of this movie late-night on thursday 5/29 (because I work at a movie theater I get to see all the movies before they're released.) So I've noticed something peculiar... there are, as of now, about 8 pages of comments on this film. About 3 pages of comments before mine (meaning before the movie came out) all gave The Strangers 9 or 10 stars, glowing reviews, and taglines like \"best horror movie ever,\" \"scariest film ever,\" and \"awesome.\" But then, if you look at the dates of submission, 95% of all the comments posted after the movie was released say it's lackluster at best, anticlimactic, boring, lame, and not worth watching. So, I wonder, is that a coincidence, or maybe, just maybe, were all those people who posted great comments prior to the movie's release doing it for some other reason? Were they being paid to hype the film? Do they work for the production company? Or is it all just a big coincidence? Hmmm....","user":"J_M_Kiff","rank":[518,693]}]