[{"title":"Misconceptions","rating":9,"date":"14 November 2005","review":"I have watched this movie several times and have come to a number of conclusions. The first is that 90% of the North American audience knows nothing about Asian films and more to the point, martial arts. Several other IMDb members commented on the repetitiveness of the movie, comparisons to Jackie Chan/Jet Li and its use of Kung Fu.<br><br>First of all martial arts flicks will always be redundant to some extent since there are only so many ways to pick a fight, but stories do vary as does the quality of action. Tom Yum Goong is very similar to Ong Bak in its simplistic story and the noble feeling that surrounds Tony Jaa's character. Mind you in this movie Tony is much more violent and brutal to his enemies. His sorrow at the loss of the elephants is a big part of his rage and the simplicity of the story left lots of space for action. Perhaps left simple for international appeal or for the simple fact that a simple, pure story would be more poignant. Anyway, if you go to a martial arts flick looking to pick it apart and analyze the acting skills then your a fool and should never leave your American Hollywood watering hole.<br><br>As to comparing Tony Jaa to Jackie Chan or Jet Li, are you insane?! Both Jackie and Jet are in their forties. Both are from China and went through actual training schools and academy's as well competitions. Wu Shu, Crane, Drunken Boxing etc... These are the styles these men made famous. Jackie built his comedic style from the ground up with his amazing acrobatic abilities, fighting skill and on screen charm. Now I'm not a Jackie Chan fan by any means, but credit where it is due. Jet Li was one of the youngest Chinese National Tournament winners ever and blew people away with his Tai Chi and Shaolin style Kung Fu.<br><br>How does this relate to Tony Jaa? It doesn't at all and thats the point. Tony was very poor growing up in Thailand idolizing Bruce lee in the movies. He earned every break he has in his own way, and built his style accordingly. This movie is so amazing because it not just Kung Fu and Karate for the thousandth time. Tony is a master of Muay Thai Kickboxing, which he uses 80% of the movie. Now you don't even need to know anything about fighting to notice the difference between karate (or other styles) and Muay Thai. Through the diversity of his fighting style as he battles people who using everything from crane style Kung Fu to Capoeira, you understand why comparing him to others is unfair. While he has trained in similar martial arts its obvious that he is unique. He is in the best shape of his life and just now coming into his prime. His screen presence, skill and experience mean he could be as big or bigger than Jackie or Jet in the next ten years. At the very least he is going to be a major Thai action star for years.<br><br>Also people keep in mind this is a Thai movie. Hollywood wouldn't even have finished the credits before they ran out of money if they worked with the same budget. More International success will give Tony Jaa access to a bigger budget, more talent (ie writers, language instructors, studios etc..) and allow him to grow. Its easy to bash but look at the low budget flicks Jackie Chan or any other martial artist made when they where twenty and you'll see that this movie is much much better than most.<br><br>Remember it all just opinion people, everyones got one. PacManPolarBear","user":"PacManPolarBear","rank":[301,347]},{"title":"the best action movie of the year","rating":9,"date":"12 August 2005","review":"Had the opportunity to watch Tom Yum Goong at a local cinema here in Bangkok on opening night. Expectations were high, and the movie fulfilled them in both good and bad.<br><br>The action was some of the best caught on film (do they still use film?) that I have ever seen. Panom \"Ja\" Yeerum again showed that with his background of Muay Thai, gymnastics and stuntman work, he can deliver action scenes that are graceful and brutal at the same time, and will have the audience picking up their jaws from the floor at times. They don't use gimmicks like strings or special FX, so everything you see him do is stuff he really does. Except maybe one flying knee where he literally flew about 5 meters into the guy so he must have been launched off something.<br><br>However, as good as the action was, the obvious comparison would be to Ong Bak (same lead, same director). And as amazing as TYG's action scenes were, they didn't have the raw power that Ong Bak delivered. I think this may be because of different stuntmen - in Ong Bak, a lot of the people that got beaten up were probably amateur Thai stuntmen or retired muay thai dudes (scene in cave, for example) who don't mind taking a very heavy kick or punch to make a few Baht and be in a movie. So the impacts were very hard and very real in Ong Bak, and it made the action that much more \"in-your-face\". In TYG, due to the action taking place in Australia and the higher production values, the stuntmen didn't seem to get beaten up as badly. Sure, it was still better than any other action movie besides Ong Bak, but not quite as raw and powerful.<br><br>Then... the plot. The plot has already been criticized by many, and obviously it is full of holes, unintentional humor (unless there really is an English-language news channel in Australia where the newscaster has a strong Thai accent?) and so on. But it was nowhere near as bad as Ong Bak. Ong Bak really is a \"fast forward to the action scenes\" type of movie, whereas Tom Yum Goong is a watchable movie in its entirety. The first 15 minutes have barely any action at all, but the elephant scenes and the beauty of rural Thailand were beautifully shot and the actors did a surprisingly good job - both Panom and the guy who played his father. It seems that Panom's acting classes have paid off. Now if only he can learn passable English, he'll really have a chance of becoming the next big thing in Martial Arts action movies.<br><br>The (intentional) comic relief was much better than in Ong Bak - Mum Jok Mok plays a Thai policeman in Sydney. How he got to be Sergeant there, we'll never know, but he has a few funny lines - most of which are much funnier to Thais or people who know Thai culture than to the international audience. Like the \".... oh, oh, oh - and Laos!\" line. More laughs came from cameos like the Jackie Chan lookalike at the airport and Sek Loso drinking M150 on the street in Sydney. Not so much product placement as an inside joke (\"go inter\") for the Thai audience.<br><br>Getting the audience to cheer for the hero in an action movie obviously requires a nasty villain or a group of villains. Tom Yum Goong does well in this regard as well - both the Thai mobsters and especially their bosses in the Asian mafia in Sydney are an interesting, suitably detestable bunch. Also their \"bodyguards\", from the Capoeira guy to the three huge Caucasians in the end, are very good opponents for Panom \"Ja\" to beat up on. Furthermore, having the motivator be elephants (respected animals, and to Kham, family members) instead of a stolen head of a Buddha statue (like in Ong Bak) works much better, especially for non-Thai audiences. Good acting by the baby elephant in one early scene in the movie, by the way! Deserving of an Animal Oscar.<br><br>To sum up, Tom Yum Goong has a decent plot, a good cast with better acting than was to be expected, good cinematography, and of course, plenty of cracking, beautifully choreographed action that will not fail to impress any Martial Arts action movie enthusiast.<br><br>Highlights: Kham learning how to fight the Capoeira guy in a very well choreographed scene, and the bone-crunching extravaganza that was like Kill Bill Vol. 1's restaurant scene without the swords.<br><br>An excellent achievement in its genre. A whole lot of fun. 9/10.","user":"LaHaine","rank":[127,158]},{"title":"Jaa is amazing !!! The script on the other hand...........","rating":6,"date":"7 December 2005","review":"As a coherent , well acted film tom yum goong is a failure.As an opportunity to see tony jaa completely and utterly destroy his opponents in the most awe inspiring and brutal ways possible, its a huge success! The action in tom yum goong is phenomenal to say the least - tony jaa proves that ong bak was no fluke!The part where jaa does battle with a gang of bikers and roller bladers is an exciting sequence , reminiscent of jackie chan in his police story days. The fight where he battles his way to the top floor of a restaurant in one continuous tracking shot, is a truly amazing piece of work that demands to be re-winded more than once .The fight that pits jaa against dozens of suited henchmen is a bone crunching, applause worthy spectacle that proves what ong bak fans already know- TONY JAA IS THE MAN !!!!! These fights are just some of a collection masterful action sequences .<br><br>As for the rest of the film...lets put it this way- if the action was no good then tom yum goong would be unwatchable. The action makes up for the moronic , near pointless plot . I know that we don't watch these sort of films for plot, but tom yum goong takes the cake with its \"one man looking for his elephant\" story!And don't get me started on the acting, particularly the lines spoken in English.Tony jaa needs to work with a decent script writer in future....<br><br>Weak on pretty much everything else except the fights , tom yum goong has Superior action and confirms that tony jaa is an amazing performer.","user":"Merklin","rank":[80,102]}]