[{"title":"Not bad....could have been a lot better.","rating":6,"date":"21 April 2007","review":"Saw a preview of this last night. Still not completely sure what I made of it to be honest. It's a very short film at only 1 hour and twenty minutes and despite this it still feels a little padded as though there wasn't enough story to make it long enough to be a feature film. The key scenes are graphic and harrowing enough and I definitely left with a bad taste in my mouth. Gillian Anderson was probably the best thing about the film but I don't really buy Danny Dyer playing opposite her and there were certain scenes that were unintentionally humorous because of this. Dyer has definitely been a little miscast here and it does make you wonder whether it could have been better with a different leading man. The other problem I have with a film of this type is that in order for you to care about the plight of characters I believe you need at least a little insight into their lives prior to what we are seeing on screen, we need to know about who they are in order to root for them and I never really felt this film gave us the big picture in this regard. Despite it's flaws it's still a watchable drama/thriller but with a few more original ideas and a little added characterisation it could have been a whole lot better.","user":"barrow-5","rank":[85,101]},{"title":"At times a bit to real.","rating":7,"date":"29 April 2007","review":"Quite a short feature film, although you do not actually notice this when watching. Great to see Gillian Anderson on screen again, and to be honest i would not have predicted this role for her however she was well cast.<br><br>Personally i quite enjoyed the slightly comedic satire that ran through some of the scenes, and i think Danny Dyer helped with this. It is hard to tell if the film would have maybe been stronger with a different leading male, but then Dyer plays the 'male struggling with his emasculation.<br><br>Definitely lacking depth, i left wishing i had known exactly what happens with Anderson's character and her father, along with simply wishing i knew Dyer's character better.<br><br>Some uncomfortable scenes which i felt were not always necessary, although they do help to give the film an edginess that i liked. Basically it was brutally real and honest, very un-Hollywood. I would maybe say rent instead of watching at the cinema.","user":"hipp_dude","rank":[86,105]},{"title":"Better than its overused revenge plot suggests.","rating":8,"date":"7 August 2009","review":"A young couple are beaten and raped on the way home from a party in the English countryside. The nature of their relationship has all the hallmarks of a transitory sexual dalliance. Alice, a well-educated professional woman, played by the tremendous Gillian Anderson, and Adam played by Danny Dyer, a younger man installing an elaborate security system in her apartment. An unlikely couple thrown together by lust and opportunity whose connection takes on a much more complex and ambiguous character after the horrific events following the party and then the fortuitous chance to take revenge on the perpetrators.<br><br>What appears to be a tale of revenge is really a healing process where uncertainty and doubt surround the quest of the two victims and eventually a denouement where separate solutions are sought and an outcome where fulfillment remains elusive.<br><br>I really liked the way director Dan Reed handled the interplay between Alice and Adam after their terrible experience and explored the shifting ground of their relationship, complicated by contact with one of the perpetrators whose actions appear not to be motivated by criminal intent but something rather more understandable. Flawed but fascinating. 8/10","user":"Rupert17","rank":[11,12]}]