[{"title":"Stop expecting the greatness of T2......Better then T3 and Genisys","rating":7,"date":"27 February 2017","review":"Terminator Salvation gets panned left and right.....but let me first say this is way more better then T3 and Genisys by miles.<br><br>Not only is it a serious terminator movie.....its more faithful to the first 2, yes it has plot holes and not die hard terminator violence but what do you expect when companies are trying to make everything PG13 for money.<br><br>This is the Terminator movie you get, to throwbacks to Guns n Rose you could be mine to a CGI arnie wreaking havoc, yes it could of been done better but some of it is actually really good, just accept and stop expecting the greatness of T2, that was cameron and this is MCG two different directors.<br><br>The acting is good, don't know what everyone is going on about with Bale being a weak connor when he is perfect for the role, yelchin plays a fantastic kyle reese and sam worthington is great as marcus.<br><br>Relax, watch and enjoy a good summer action movie with no expectations, the opening helicopter scene is a work of art.<br><br>TS - 7/10","user":"JERICH9478","rank":[79,92]},{"title":"Salvation","rating":6,"date":"6 March 2020","review":"Terminator Salvation is a mess, one that has no real tension or stakes to its storyline. I respect that they wanted to tell a different story, but it just didn't feel like a Terminator film.","user":"MR_Heraclius","rank":[40,45]},{"title":"A really good sci fi movie","rating":8,"date":"8 September 2015","review":"I've seen it three times - in the big screen (2009), somewhen in 2012, and now at 2015 (after seeing genesys) I also really don't understand all the negative comments about this film. I am a fan of the Terminator series (t1, t2 and TV show) and i really think this film stays true to the original idea and actually adds quite a bit to it.<br><br>I liked the robot models (mostly the little water bastards and the huge robot at petrol station), the HK's look great, and that t-600 is bloody scary and awesome (bulky, limited movement and a gatling gun).<br><br>I liked the whole concept of the movie a lot, and it showing the initial research work and human test subject and all, and showing the fight against machines after judgment day (i wish genesys would show more of this) And there is marcus...god, i loved this flawed terminator model! well, as a sci fi freak i enjoyed Terminator Salvation a lot","user":"frequenzangriff","rank":[32,36]}]