[{"title":"Save your money--rent the original","rating":2,"date":"21 June 2006","review":"I wanted to like this remake. I really did. But I can't and the reasons--like Satan--are Legion.<br><br>You never realize how important good movie music is until you can compare two films with similar stories and different scores and realize that the original gave you such creepy, stunning music that what is in the remake can never compare. Sorry, but it just can't. If they copied so much else from the original, why not the score? It was vital.<br><br>Liev and Julie are just not interesting enough or grounded enough to be able to root for. And who cares that there are allusions to their marriage being a little rocky? Hello! We don't care about that! We want to know about the AntiChrist Kid you adopted, so don't get off on side issues that don't advance this plot.<br><br>And what's with having the priest actually say \"his mother was a jackal\" right at the beginning of the film???? That was one of the best suspense builders in the original. Was it because they didn't think we would understand what a jackal was? The worst was Liev giving him a serious look, as if to say, \"hmm, must take this under advisement.\" And the decapitation of the reporter was BETTER in the original. It was done from the side, in slow-motion, and then the head rolled and landed at Gregory Peck's feet, a chilling sequence which we knew was coming and they built up to it with agonizing slowness. The new one had more blood, but no horror. It was cheesy, instead of scary.<br><br>And please--this little kid, who everyone said was so much better than the original acted the part as if he had a sign in neon on his forehead saying, \"Hi, I'm the AntiChrist Kid!\" Talk about telegraphing.<br><br>All in all, this remake was pointless. Maybe the devil can't scare us that much anymore, but the next time I see a remake, I will certainly run for the hills.","user":"sharkey197","rank":[31,34]},{"title":"The World needs remakes like...","rating":3,"date":"13 September 2019","review":"Wal-Mart needs more ugly people roaming around on-premises.<br><br>What is the point of these stupid remakes that are a pale shadow of their originals?<br><br>Why does the nany jump on the back of the father instead of hitting him or stabbing him??<br><br>What-ever.","user":"Piero-the-christian-loser","rank":[12,12]},{"title":"Not as good or evil as the original.","rating":6,"date":"7 June 2006","review":"I really liked the original Omen. It didn't need to be re-made. There is nothing that modern film-making has brought to this film to make it stand out against the original. It's not as scary, not as honest or raw. The original film is genuinely disturbing -- from the dogs, to the nanny, to Damien... this modern remake just isn't as convincing. It has it's moments, and isn't that terrible, but there's an annoying distance, or separation between the subject matter and the film. It's too clean, too polished... it just isn't evil enough.<br><br>The music is not as good, the deaths are not as disturbing. But should we judge this film on its own merits? No, because it's a carbon copy remake. There is very little new material worth mentioning.<br><br>The only positive thing to say is that for anyone who hasn't seen the original, it's worth a look -- on DVD. But even then I'd recommend the original.","user":"randomStuff101","rank":[105,135]}]