[{"title":"This movie is so cool!","rating":1,"date":"30 August 2008","review":"Or that's what the filmmakers would like you to believe, anyway.<br><br>This movie tries sooo hard to be cool it's ridiculous. Everything, from the look of the film, the cinematography, the editing, the dialogue and the acting, is geared in super cool mode from the get go. Just to make sure that no one misses how cool this film is, there's a soundtrack of really cool rock n roll tunes and a twangy western-surf-tex mex guitar playing constantly throughout the film. As a final reminder of how frickin cool this movie is, all the actors have been instructed to speak in a hoarse voice, because, as we all know, that's badass.<br><br>The plot (if there indeed is one) seems pretty straightforward. But as someone else already pointed out, the director and star of the film, seems fiercely determined not to tell that story, instead focusing on a plethora of naked babes and dialogue that's supposed to be badass, but grows tired surprisingly quick (did they have an contest to see how many times they could cram the words \"pussy\" and \"f*ck\" and its derivatives in an 80 minute film?).<br><br>This movie was absolutely horrible.","user":"shanayneigh","rank":[147,234]},{"title":"One of the Worst Movies Ever Made","rating":1,"date":"25 February 2009","review":"Larry Bishop writes, directs and stars in this soft-core porn; a plot less biker movie about nothing to do with anything. This is one of the worst movies I've ever seen. I actually felt sorry for the girls in this movie (who probably thought they were in the making of a feature film). In all reality they're making a porno. They walk on set, spend three or four days there, say some sexually themed lines to a bunch of old men - thirty years older than them - then they take off their cloths and run around naked. I can only assume this was Larry Bishops only way of getting laid. You see shot after shot directly on girls asses. Shot after shot of Bishop walking up to some random chick and grabbing her by her crotch, as if he were shaking her hand. How this crap was even funded is beyond me. <br><br>There isn't one redeeming quality, or one moment in the movie that creates any kind of reaction, or shows any inclination that these people had any idea of what they were doing. If you don't see naked women all that often, then I guess this movie would be for you. If you're eleven-years-old, you might like it. The acting is awful, the writing is awful, the production is awful, and the direction is awful. It's not even worth your time renting it just so you can say you witnessed the car crash. You shouldn't even be reading these reviews. I shouldn't even be writing one.","user":"DaveDiggler","rank":[82,128]},{"title":"Don't waste your time","rating":3,"date":"7 August 2008","review":"Tarentino should be ashamed to be involved with this awful film. The acting, directing and script are all third-rate - with the entire film playing out like an excuse for writer/director/star Larry Bishop to get laid. The only reason it was made at all is most likely due to his association with QT. The plot of the film is pretty flimsy, and basically tries to survive on not-so-obscure references to older B-movies and some cameos from guys like David Carradine, Dennis Hopper, and Vinnie Jones. Each one is listless in their performance, particularly Hopper who is in full-on paycheck mode at this point in his career. The saving grace, if there is one, is that the script is so laughably bad that it can be entertaining. Bishop tries so hard to get that trademark Tarentino banter and just fails miserably, which can be pretty humorous at times and grating at others. I'd only check this one out if you love bad movies...or if you're really into biker films.","user":"locomotivebreath83","rank":[102,169]}]