[{"title":"+++ The Feeling of the Comic Book with a Small Plus ++++","rating":9,"date":"28 November 2017","review":"+++ The Feeling of the Comic Book with a Small Plus ++++ <br><br>------- ------- ------- ------- Capturing again that sensation from the comic maybe caused by those black and white scenes with some areas in color that make a feeling of cold and shivers travel all the way up our spine, this second part of Frank Miller's Sin City is completely worth-watching.<br><br>Being based primarily in Frank Miller's second story from the SIN CITY series, it was actually the one that I thought that they'd have taken to the big screen when they made their first movie as it was by far my favorite and the one that had a more defined central argument.<br><br>Continuing with all the good stuff from the first movie, it uses a lot of characters and elements we already knew, we had a conclusion for the tormented tale of Nancy Callahan portrayed by Jessica Alba and John Hartigan (now a ghost), performed by Bruce Willis which was a very logical conclusion to their story. But along all the good elements in the film, foremost I think that Eva Green's AVA gives us an interesting turn to the plot; unlike her comic book counterpart, this AVA never really seems a defenseless damsel in distress which means that most men falling for her can't be really considered victims, as they fell actually wanting to fall; they could have believed anything she said or even still make her will in the case they didn't. That makes her character a bit more powerful and some of the other characters, much less innocent.<br><br>As I said I thought that this was going to be the story that they were going to use in the first SIN CITY movie and now that they have finally taken it to the screen, IMO it was completely worth it.<br><br>I don't understand fully why it was not as successful as the first part. My guess is that it was not so surprising for a lot of people because most of the characters weren't new and the interesting visual format wasn't new either, nevertheless I think that both movies are more or less equally good, even when I must admit I prefer this second one by a bit.<br><br>Thanks for reading.<br><br>IMDb Review written by David del Real.<br><br>November 2017.","user":"David_del_Real_Reviews_in_IMDb","rank":[14,15]},{"title":"Poor Sequel","rating":4,"date":"23 October 2014","review":"Sin City was one of my favorite movies of the 2000s. A fun, creative film noir cartoon with unique visuals and a style all its own. The first problem you run into with this sequel is that it offers nothing new. It's a stylistic retread of the first movie, only less impressive. The visuals copy the first movie but somehow seem cheaper. The makeup effects aren't as good either, with Marv's jaw easily twice the size of the last movie. The action is weaker, with no memorable sequences and a final showdown that is derivative of the first movie. The other big problem is that the writing is very poor this time and the stories don't flow well together. The Dwight story is lame. The Johnny story is pointless. The Nancy story is impossible to take seriously, especially the ghost parts. Sadly, this movie is boring, listless, and disjointed. It's a movie that didn't need to be made. Still, it's always nice to see Eva Green naked. That's something that never gets old.","user":"utgard14","rank":[134,187]},{"title":"I don't see why everyone hates it so much.","rating":7,"date":"16 September 2014","review":"*Minor spoilers involving structure of the film, no plot points*<br><br>In short, it isn't nearly as bad as everyone is saying. Let me elaborate. <br><br>In case people don't know, the first Sin City from 2005 was based on the 1st, 3rd and 4th books in the 7 part series by Frank Miller. These follow the story lines of Marv, Dwight and Hartigan respectively. In addition to those, there are also a few shorts thrown in, either from the books or not. So, needless to say, Sin City and its sequel are both anthology films. If you want one single story that takes 2 hours, this may not be your thing. <br><br>Sin City 2 follows almost the exact same structure as the original, which I found nice. Sure they didn't do anything original with the structure, which was sort of playing it safe, but I liked it. It felt familiar and reminded me of the original which I loved very much. It begins with another short story, this time starring Marv. It rocks. It continues on with a new story not contained in any of the books. It stars Johnny, a gambler who \"never loses\". Mid way through, we cut to another story. This is the 2nd book, titled \"A Dame to Kill For\". If you've read this, you won't see anything new. Like with the first film, they essentially translated the story from page to screen, and it works for the most part. There was one detail I didn't like, but it doesn't last long. Then after that, we finish up the story with Johnny, and finally, we get to the revenge mission involving Nancy and her hunt for Senator Rourke. That's all I'll say about that. <br><br>Everyone is complaining about how the movie looks like a cutscene from a video game. They are sort of right, but not entirely. Even after waiting 2 weeks, I was unable to find a theatre in my city showing the film in 2d. It seems like this is happening more and more now. If you want to see an action movie in theatres, it's 3d whether you like it or not. Now, having not seen a 2d version to make a comparison, I can say that the 3d is most likely what makes it look so video game-y. I'm sure in 2d it'll look slightly better at least. <br><br>Update: I did see it in 1080p and in 2D, and it does look less like a video game cutscene. You can still tell that there's a lot of CGI, but it's done better than a lot of films. <br><br>Also, greenscreen sets have been used for over a decade now, I don't see why people are complaining so much. Everything is a CGI-fest these days, and this story, with a fantastic setting and extraordinary physics pulls it off nicely. You can tell, but it's far from awful. <br><br>Everyone is saying they loved the first one, but hated this one. I don't see how that's possible. They stuck very close to the original in most ways, such as cinematography, soundtrack, and directing, all of which were great (for a Sin City movie). Sure it isn't a masterpiece my any means, and it's not as good as the first, but it's super entertaining, very violent, and is sure to please anyone who enjoys the books or the first film. Forget all those jaded movie snobs saying it sucks. They're just focusing on all the negatives, and letting that cloud their vision of the awesome stuff.","user":"jessemorrison99","rank":[215,310]}]