[{"title":"A well-done portrayal of the enigmatic, volatile, emotional, altruistic, mischievous, and otherwise paradoxical Hunter S. Thompson","rating":9,"date":"14 July 2008","review":"Before watching this film I knew a decent amount about the father of Gonzo journalism, and everything I had learned seemed to suggest a man whose many contradictions made his overall nature hard to grasp. For this reason I praise this film for doing a remarkable job of really digging into the essence of all that is Hunter S. Thompson, including his writing, his lifestyle, his acquaintances, and primarily his impact upon America.<br><br>Gonzo: The Life and Work of Dr. Hunter S.Thompson methodically covers the bulk of Hunter's life from his boyhood to his untimely suicide. With interviews from many of his close friends and relatives, as well as some substantial political figures, the movie does a great job of putting his life in perspective. Consequently, it brings with it the energy and intensity that was pervasive in those times and places, like San Francisco in the early 60s. But Hunter's life is far more than sheer counterculture excitement, and the film covers the many events of civil disarray that Thompson fell witness to, and that shaped his cynical view of modern-day America.<br><br>The film manages to draw many parallels to the afflictions of our nation today, such as the war in Iraq and Bush administration. It follows Hunter's life all the way to the end, and in spite of the last quarter of the movie being a bit too lengthy, closes decently. For its effectiveness and emotional force, this is a must-see for Gonzo fans.","user":"Darklogic","rank":[16,16]},{"title":"The smartest guy at the bar","rating":8,"date":"13 July 2008","review":"After Enron: The Smartest Guys in the Room, Taxi to the Dark Side, and this vivid, significant depiction of the Sixties and Seventies superstar journalist Hunter Thompson, Alex Gibney has emerged as clearly one of the best documentary filmmakers we've got and also one of the most prolific.<br><br>Gibney tells a very smart, very verbal, very funny but also intensely significant story here. Some of the people who speak most highly of Thompson on camera are Billy Carter, William McGovern, and longtime Republican presidential adviser Pat Buchanan,as well as writer Tom Woolf and Thompson's editors at Rolling Stone, for which he did his best periodical pieces, the notable ones turned into books. More intimate details--but the man was such a perpetual performer that public and private are hard to separate--come from Thompson's first and second wives. And the English artist Ralph Steadman, who illustrated the writing, has much to say, as do plenty of others. When Steadman first met Thompson he fed the Brit Psilocybin and he was never the same. Steadman became an invaluable cohort and collaborator and his wild drawings provide a perfect visual counterpart to Thompson's written words on screen.<br><br>Thompson was a notorious wild man from early on. \"I wouldn't recommend sex, drugs or insanity for everyone, but they've always worked for me,\" he said. Prodigious in his consumption of drugs and alcohol, he was witness to some of the great events of his time, and got deeply involved in politics and opposition to the Vietnam war and of course the counterculture. Lean, athletic, flashily dressed, with trademark balding pate, big sunglasses, cigarette holder and drink in hand, Thompson was a demon at the IBM Selectric, gleefully spinning out brilliant pieces nobody else could have written, a master of outrage and wit.<br><br>Fueled by craziness, substances, and his own tongue-in-cheek joie de vivre, he devised his own outrageous style of writing in which cold clear fact was blended with wild invention and the adjectives and metaphors flew like hornets around a honey pot. Others too partook of the kind of journalism he practiced. The times--the flamboyant and boisterous and revolutionary Sixties and early Seventies-- seemed to call for a new more violent, more committed language in journalism. Norman Mailer also wrote about the democratic convention in Chicago in 1968 and on hand for Esquire were the likes of Jean Genet and William Burroughs. Three is something of Burroughs in Thompson, the drugs and the outrage and a way of seeing convention as conspiracy. One of Thompson's famous quotes gives a hint of the link: \"America... just a nation of two hundred million used car salesmen with all the money we need to buy guns and no qualms about killing anybody else in the world who tries to make us uncomfortable.\" This was the moment when the distinction between fiction and non-fiction blurred: Tom Wolfe (The Electric Kool-Aid Acid Test, which used raw material from the more adventurous Thompson), Thompson's act of \"embedded journalism\" as Wolfe calls it, Hell's Angels), Truman Capote's murder story In Cold Blood done for The New Yorker, were all variations on the idea of the \"non-fiction novel.\" Mailer had done a heroically personal and novelistic account of the 1967 March on the Pentagon, The Armies of the Night. The film might do a bit more to put Thompson in all this context, but it's clearly implied. He called his wild style \"gonzo\" journalism.<br><br>Thompson also wrote about Las Vegas as the American dream and about Nixon, whom he loathed. He also used a tape recorder a lot. This provides great material for the film. So does the Terry Gilliam film version of Fear and Loathing in Las Vegas; and Johnny Depp, who played Thompson in the film and became a great fan and friend, reads salient passages sitting in front of a well-stocked bar. Depp paid for the spectacular monument/funeral for the writer that Thompson had--on film--planned out long before, in which his ashes are fired into the Colorado hills. Ralph Steadman did the sketches. This is shown at the end of the film and provides a lovely son et lumière finale.<br><br>Thompson's innate violence may explain how he could have blended in so well for a while with the Hell's Angels. He kept at least twenty firearms on hand in his house, all loaded, his first wife reports. He always planned to end his life with suicide and he shot himself. He did it on a nice day in February almost as a family event, with his son, daughter-in-law and grandson at the house and on the phone with his wife, a shot to the head, at the age of 68, not an act of depression but the completion of a careful plan. It was over. And he had been here to see George W. Bush and predict the decline and fall of the American empire. A late collection of short pieces is entitled Hey Rube: Blood Sport, the Bush Doctrine, and the Downward Spiral of Dumbness.<br><br>His dissipation took its toll and so did fame. He fell into playing a self-parodying avatar of himself and his writing deteriorated after the later Seventies, so he had about ten good years and about twenty not-so-good ones. Some have dwelt on his decline; Gonzo doesn't. His writing faltered as early as 1974 when he went to Zaire with Steadman to cover the Foreman-Ali \"Rumble in the Jungle\" and he got drunk at the pool during the fight and never finished the story. Given how bright he burned and how hard he lived, it was inevitable that the man would burn out early And writing did not by any means fizzle out even into the Nineties. There is an immense wealth of spinoffs on film; Gibney had rich, rich material to work with here.<br><br>The best that could happen is that this beautifully edited and greatly entertaining film makes a host of new converts to the writing.","user":"Chris Knipp","rank":[23,24]},{"title":"The Good Doctor","rating":9,"date":"1 July 2008","review":"This is an absorbing doc not only of the good doc but the whole counterculture that he championed in many ways. For all his excessive lifestyle that became almost a parody of the drug culture, he remained a true intellectual and anti-corruption/hypocrisy crusader. He embraced the vision of a new world not ruled by greed and war-mongering, and as early as 1971 proclaimed his great sadness that the movement and the moment of flower power had passed and with it the chance for sane politics. This moment was captured well in \"Where the Buffalo Roam\" starring Bill Murray as HST, which is given kind of short shrift in this documentary in favor of scenes from \"Fear and Loathing Las Vegas\" with Johnny Depp as HST. Considering that Depp produced and narrates the film as well as financed the grandiose send-off that Thompson envisioned for himself, it's not strange that Murray's portrayal would be downplayed, as excellent as it was (and Peter Boyle's as the Samoan lawyer.) <br><br>All in all, it is a well-balanced account of Thompson's life and work, with many pertinent interviewees like his two wives and son, Jann Wenner of Rolling Stone, Sonny Barger of the Hell's Angels, Jimmy Buffett, George McGovern, Jimmy Carter, Pat Buchanan, Tom Wolfe, and various Aspenites. His passion and wit were undeniable, and his addiction to guns, booze and dope were in many ways forgivable. But his absence in today's disastrous political scene, his voice against war and corruption is sorely missed, and lamented by several of the interviewees. The parallels between Nixon and Bush are easily drawn, and \"Gonzo\" does this without hammering the point home except to exhort the audience to take up the fight that the Good Doctor waged in a seemingly crazy, but noble and honorable way for most of his life.","user":"jimi99","rank":[28,30]}]