[{"title":"Seagal fans rejoice? Ahhh, not quite, but a step in the right direction","rating":5,"date":"19 April 2006","review":"If you've kept up with Seagal's direct-to-video career (as I diligently have) \"Mercenary for Justice\" is certainly a step in the right direction. No, it's not great movie, but it's a whole lot better than most of his previous direct-to-video efforts. First and foremost the cinematography is really well done. This movie looks great and feels \"bigger\" than most of Seagal's previous direct to video movies. Second, although there's more gun-play than Aikido, Seagal performs in all his own action sequences (no stunt/body doubles) and the fight choreography is relatively classic Seagal (arm and wrist twisting / body tossing). Third, Seagal's voice doesn't appear to be dubbed at any point during the movie (as it's been in several of his other releases). What's bad is the usual: muddled story, poor supporting cast, some of the dialogue. The first 20 minutes of the movie lack a real cohesive setup / story (in fact, beside a brief freeze frame / still, Seagal doesn't appear for the first 11 minutes or so). The opening also suffers from the classic low budget, \"shooting a stunt from multiple angles – then intermittently cutting those different shots of the same stunt into the movie trying to sell it as a new event each time\" trick. Oh well. Bottom line: If you've kept up with Seagal this far in his career you won't be disappointed with \"Mercenary for Justice.\" Favorite Seagal theatrical release: Out For Justice / Favorite Seagal direct-to-video release (as of 04/19/06): Belly of the Beast","user":"mickeyshamrock","rank":[40,46]},{"title":"Too much love for this film.","rating":3,"date":"24 April 2006","review":"Seagal has of late been doing material so utterly poor, to suggest that it may be time for him to call it a day, and concentrate on a promising music career. Seagal looks old, overweight and lethargic in his recent films and aside from the slightly more professional twosome of Into The Sun and Belly Of The Beast, looks utterly bored. Add to this fact he is not doing his own stunts, fighting or even dialogue, then clearly many fans are getting annoyed. However Seagal has one of the most forgiving and undemandingly loyal fan bases out there, so he's getting away with it.<br><br>Mercenary For Justice is on one hand the usually bog standard he's been doing lately, but on a slightly more positive not he does most of his ADR looping and also all his own fights. Now that might seem like something that should be a given for an action man but these days Seagal films are rated on the following: Participation in fights, stunts, in the shooting itself (not using stand ins!) and participation in performing his own dialogue. As such this film is a step up from Black Dawn and Today You Die, his previous two, poor, poor movies.<br><br>The trouble is that the film has an awful script, poor direction and of course an incredibly wooden performance by its lead. The action is all filmed rather than using stock footage, as in the other Seagal and Don E Fauntleroy team up, Today You Die, which borrowed from several films. This it least has Fauntleroy showing slightly more control behind the camera, but unfortunately the film is one of a line of contractually obligated films Seagal had to do. Sure he got well paid to do them, but the fact is there have been rumours of on set troubles with Seagal, turning up late, changing the script. How true this is I don't know but certainly in this film and TYD, Seagal is probably only present for 2/3 of the movie. Thankfully MFJ marks the last time Seagal will work with these producers and this director, following a much publicised legal battle of suing and counter suing.<br><br>MFJ makes no sense whatsoever, perhaps largely due to the slipshod and difficult production thanks to the problems between the producers and the star. This is so poorly constructed and shabbily put together that it makes one wonder just how Seagal fans (myself included can keep coming back in the vein hope he'll do a good movie again. Similarly the film is not helped by a poor cast around Seagal, who lest we not forget is not in the movie that much. However Luke Goss isn't bad, but he is sorely underused. In perhaps the most awful performance ever committed to a B action film, Roger Guenveur Smith, grates, and annoys in the most clichéd British bad guy role, in which every word is ludicrously overly enunciated. As such the poor cast fails to engage in the dull and dragging scenes without the main man Seagal. The action itself ranges form mediocre to bad. There's plenty of explosions but the film is badly edited and the fights sequences are particularly dull, despite Seagal's participation in them. They unfortunately lack imagination and aside from some bone breaking and flushing peoples heads down toilets, it's all pretty brief and uninspired.<br><br>The sad thing is that many Seagal fans will \"settle\" for this junk. It shouldn't be that way. I only hope that the far more promising sounding projects, Shadows Of The Sun and Prince Of Pistols will have a more interested Seagal. I don't blame the big man for not raising his game in a film this poor, he was allowed to give minimal effort to collect a big fat paycheque, so fair play to the man. However he will have to deliver better films otherwise the paycheques could well dry up. DTV films don't have to be awful and Lundgren and Van Damme are proving that. I hope Seagal takes note in his next few films, but thankfully I see there will be little chance they are as bad as this. *1/2","user":"supertom-3","rank":[36,45]},{"title":"More Shooting Than Martial Arts","rating":5,"date":"13 May 2010","review":"I liked Seagal.... In his prime. A long time ago, (Okay, 1989) Steven Seagal was the master of the martial arts, A man who speaks little, but makes up for it in kicking ass... and he was lean and mean. Nowadays, he's fat, he can barely talk above a whisper, and he just doesn't care. But he keeps churnin' out the junk.<br><br>And I keep falling victim to it. For Seagal DTV standards, (does that even make sense?) it isn't as bad as \"Submerged\" , but it's not as good as \"Belly Of The Beast\".<br><br>The plot: John Seeger (you know who...) is an ex-mercenary, CIA, FBI dude, who has to break into a prison, while orchestrating a bank robbery. Then Seeger shoots lots of people. That's about it.<br><br>What's with the three word titles? Enough already. I guess people don't think it's a Seagal flick without a three word title. The title doesn't even make sense. A mercenary works for money and he has no soul, he doesn't do it for justice.<br><br>The only actors good in this is Roger Guenveur Smith as the villain Mr. Chapel and Luke Goss as Dresham. But even they were coasting.<br><br>If you want a good Seagal flick, go with \"Out For Justice\" instead.<br><br>For more insanity, please visit: comeuppancereviews.com","user":"tarbosh22000","rank":[6,6]}]