[{"title":"Powerful Story and Performances","rating":10,"date":"10 October 2007","review":"Went to a preview of this movie last night. I was blown away by the powerful performances of Benicio Del Torro and Halle Berry. Del Torro's performance was particularly moving - his best ever and Halle Berry definitely delivers. This is the story of a woman who appears to have been so invested in her husband as the center of her universe that when she tragically loses him, she turns to his best friend (who she has hated for years) to keep from losing her connection to her husband. In the course of events, she discovers the redeeming qualities her husband had always seen in him.<br><br>Del Torro gives a poignant performance of a drug addict who struggles to change his life after the loss of his best friend - with quiet dignity. A must see at least once. Although the movie is long, I can't imagine cutting one moment of this powerful story. Cinematically it's superb.<br><br>Everyone who knows anyone who has struggled with addiction will be gripped by the performance of Del Torro.","user":"nrigsby","rank":[98,121]},{"title":"Great Story, Great Acting and Directing!!","rating":9,"date":"5 October 2007","review":"Saw this last evening at a preview screening here in Arizona and it was a LOT heavier than the trailer leads you to believe, which, I for one, was grateful for! Granted, this is only MY opinion, but I think that Halle does some of her best work in a long time here and for me, ranks up there with Monster's Ball and Losing Isaiah. Of course, Benecio is a great pleasure to watch as always, playing the demonized friend of David Duchovny, but I think Halle rises just a notch up everything here and truly shines! The supporting cast is also really enjoyable to watch, especially John Carroll Lynch playing a next door neighbor who finds an unlikely friend in Benecio's character. Great camera work and great direction all the way around and although the film is a bit long, I am glad the director had the wisdom not to rush through the story. Great film and I cannot wait to purchase it on DVD!","user":"Toolman911","rank":[121,151]},{"title":"One Day at a Time...","rating":8,"date":"4 May 2008","review":"Sometimes you have to view movies one day at a time. As a film buff, I have to take the good with the bad. Danish director Susanne Bier's first American venture, \"Things We Lost in the Fire\" is one of those surprisingly good human dramas that often gets lost in the shuffle and doesn't receive the credit it deserves.<br><br>When Audrey (Halle Berry) loses her husband (David Duchovny) in a tragic Good Samaritan act gone bad, she deals with her grief in an unexpected way by inviting his drug-addicted best friend Jerry (Benicio Del Toro) to come live with her and her two young children while he \"gets on his feet.\" Featuring a music score designed to remind people of \"21 Grams\" (which also starred Del Toro and played with many of the same themes) and interesting cinematography full of extreme close-ups and small visual details designed to evoke intimacy and realism, \"Things We Lost in the Fire\" delicately mirrors Audrey's grief process against Jerry's rocky recovery.<br><br>The film is far from perfect as it sometimes deals with subjects (especially the scenes where Jerry is withdrawing from heroin) in a clichéd manner. Berry also struggles as she seems to underact in some of the more poignant scenes as a way to balance her overacting in some of the more theatrical scenes. However, her performance as an organic whole is very strong, and her character and her family feel and look \"real.\" The things they say and the way they deal with their situations are raw and heartfelt without ever being sappy or sensationalistic. The kids are naturalistic, and they actually look like they could be the children of Berry and Duchovny. Del Toro is once again a revelation, and his performance speaks volumes with his mannerisms and facial expressions as he attempts to reconcile his sad past with a hopeful future. Sadly, his tour de force was overlooked by every end of the year awards in 2007.<br><br>The bread and butter, however, is in the small details. \"Things We Lost in the Fire\" uses visual motifs, side stories, character foils, mirroring, and nuanced repetition in dialog as ways to develop grander themes. This is the stuff of great novels, and rarely do we find it attempted in film. What could have easily been dismissed as a melodramatic weeper turns out instead to be something quite good. The overlapping closing scenes where Berry speaks not a word while coming in from the rain, and Del Toro delivers a rehab monologue that gives quite possibly the most honest insight into addiction and recovery ever captured on screen, is a hauntingly hopeful mosaic of small moments. Yes, there were some moments of formulaic Hollywood gobbily-gook and some moments of strained drama, but these closing moments are real. They are good, and we as human beings (as film goers) have to learn to accept the good.","user":"WriterDave","rank":[19,21]}]