[{"title":"Se-quel, se-quel, se-quel...","rating":10,"date":"13 January 2013","review":"John Carter is an unjustly dismissed sci-fi masterpiece...grossly unjustified. What was wrong with it? Specifically, what was wrong? Pacing? It was intense!!! Coming from someone who uses this word sparingly, this movie was \"EPIC\". I am almost certain that time will enable objectivity, and objectivity will redeem it from the stinging taint slapped on it due to a predictably simplistic aversion to what is \"mainstream\" by film critics. If a studio other than Disney could have created the same film with half the budget it would have been heralded as a cinematic achievement within the sci-fi genre, but its budget was viewed as ostentatious and its production studio as childish, so it became \"cool\" to hate on it before anyone had even seen it.<br><br>Who makes something and how much they pay to have it made has nothing to due with the quality of what is actually produced, it may be indicative of quality or lack thereof, but the final product speaks for itself. Reviews of John Carter tell us more about film critics than the critics told us about the film. It was practically perfect. \"Incomprehensible plotting\"??? They laid the groundwork for the presumed sequels by deliberately leaving a few questions unanswered, which I hope they still make and answer because I loved this first one! Mars was epic, and then in the end we are reminded that the story began on Earth and the film ends stronger than I could have hoped for! An excellent story masterfully told on screen.","user":"Metacognizant","rank":[183,206]},{"title":"John Carter earns more respect!!!!","rating":9,"date":"15 July 2012","review":"John Carter did not get the attention that it needed! This movie should of been more successful and despite what most of the critics and viewers are saying about this movie, \"that its a lot like Star Wars and Avatar\", that is not true. I have found John Carter to be an amazing movie visually, and the story was actually great. Don't get me wrong, Star Wars and Avatar were great movies, but I believe that John Carter was far much different and slightly better. I saw John Carter in the theaters the week that it came out and I had a lot of fun watching this movie!. So the hell with the critics, in my opinion, John Carter kicked ass!!!!.","user":"jcvdfan83","rank":[311,356]},{"title":"I had low expectations","rating":10,"date":"22 July 2012","review":"I put off watching this movie because I read an awful review of it. So my expectations were low. But let me tell you, i LOVED this movie! What fun! Just a super fun movie.<br><br>I'm not going to spoil it for you, the less you know the better. I will tell you that John Carter was written by Edgar Rice Burroughs, the man who wrote Tarzan. But unlike Tarzan this is science fiction. If you liked Star Wars, if you liked Willow, if you like adventure and action movies then check this one out. I might even buy it, which I almost never do any more. This was SUCH a pleasant surprise.<br><br>I just wish I had a 3D TV, because it comes in 3D also.","user":"s-Rachel","rank":[102,114]}]