[{"title":"Gorgeous production cannot disguise the contrivance and melodrama","rating":5,"date":"8 November 2017","review":"How could such a beautiful looking movie fall so flat? Sumptuous filming, a stellar cast, with brilliant period sets and costumes are not enough to disguise the fact that Tulip Fever (2017) drowns under the weight of its own plot contrivance and melodramatic performances.<br><br>Set in 17th Century Amsterdam, it tells the story of an orphan who \"arrived barefoot and left in a carriage\". Selected to marry for her great beauty, Sophia's (Alicia Vikander) sole purpose is to bear a child for wealthy merchant Cornelius (Christopher Waltz) whose first marriage was barren. Cornelius commissions struggling artist Jan (Dane DeHaan) to paint their portrait to celebrate his wealth and her beauty but the artist immediately falls under her spell. While the affair progresses, her maidservant Maria (Holliday Grainger) falls pregnant to a fishmonger and the two women concoct a subterfuge whereby Sophia pretends to be pregnant to keep Maria's secret. As a background sub-plot, Jan seeks his fortune in the over-heated tulip market by purchasing the rarest of tulip specimens from an imperious nun (Judi Dench). Melodrama turns into farce as the multiple narratives interweave, tighten, yet ultimately go nowhere.<br><br>High visual production values do not make up for story implausibility. The months of unsuccessful mating between Cornelius and Sophia is portrayed as a bawdy comedy of nightly rituals where Cornelius struggles to perform his marital duties. The affair under her husband's nose, the fake pregnancy, and fake birth are all ludicrously implausible. The background tale of wild speculations on the fickle tulip market is a distraction rather than necessary for Jan's predictable investment outcomes. The script sounds unnatural and dialogue is delivered unconvincingly: many lines are spoken across class boundaries in ways that would have been unimaginable in that era. With a top- shelf cast, the acting is flawless although Alicia Vikander stands out for the way she plays the same Alicia Vikander that we have seen in several films. The chemistry with both husband and lover is of the barely flickering variety, and her impersonation of Mona Lisa is, as always, impeccable.<br><br>Does the film's ending justify the effort? Disappointingly, no. The fate of all the characters is disconnected from the narrative flow and the storyline threads remain dangling in the wind. For some audiences, the beauty of this production will be worth the commitment. However, after an hour and forty-five minutes, all we learn is that great beauty, wealth, greed, and deception, do not bring happiness; nor do aesthetics alone make a great movie.","user":"CineMuseFilms","rank":[21,26]},{"title":"Ignore the critics and see this movie","rating":10,"date":"3 September 2017","review":"I almost skipped seeing this movie because of bad reviews, but I am so glad I went anyway. This is really an excellent film. I cannot see for the life of me what the critics (both professional and ordinary moviegoers like myself) are pissing and moaning about. The story moves along quickly, with lots of fun twists and turns and lots of interesting characters who are established early and then return at surprising moments. Lots of good steamy sex too, so stay away if you don't like that. I read reviews about the weak acting—they are all wrong. Judy Dench totally nails her role. It seems I have to relearn this lesson over and over: IGNORE THE CRITICS!","user":"lorenjahns","rank":[81,120]},{"title":"If you like period drama, do not listen to the negative critics!","rating":8,"date":"16 January 2018","review":"I loved it...I really did. It is slow paced, what I absolutely like.\nThe costumes where beautiful and detailed.\nAlso the scenery was well done and gave an atmosphere of how it used to be.<br><br>Worth watching...not the best...but really enjoyed it!","user":"Karlien1968","rank":[43,62]}]