[{"title":"Way better than you might expect","rating":8,"date":"2 December 2005","review":"We just got home from seeing Aeon Flux, and for my money, it turned out to be far better than I had expected. Ready for an action movie with lots of leaping, jumping and hero stuff, it was all of that - but more. It actually had a story line! And it was that story line that kept things moving nicely along.<br><br>I think that it's relatively short length (97 minutes) also helped it from being bogged down with minutiae and having a plot that had to be mercilessly stretched beyond its limits. The scenes were crisply photographed, the special effects were enough to give the film its character WITHOUT making it a special-effects movie, per se.<br><br>Although a little thin in some parts, the dialogue was fair. The only thing I thought might have made it better was the development of some of the peripheral characters.<br><br>Charlize Theron is very versatile, and now I fully intend to see the anime of Aeon Flux.","user":"vmwrites","rank":[319,478]},{"title":"OK for a Hollywood movie but NOT Aeon Flux","rating":5,"date":"7 February 2006","review":"The Movie as it is alright if you expect just what i have expected. A stereotype action/special effect movie. Good fighting scenes and great special effects. BUT, honestly, this has nothing to do with the animated series. Well, yes, there are the technical gizmo's. And yes, there was some sort of love/hate relationship between Aeon and Trevor. Also there were clones in both, the series and the Movie (with one big difference, the idea of cloning was very much perverted using clones also as sex-toys. But thats about it. Trevor Goodkind a GOOD GUY? Maybe i am over-stressing the animated series, but i saw many philosophical implications in the series, totally lacking in the Movie.<br><br>The society in the city was a parted one and not this \"everything is just fine\" utopia like in the movie (Aeon entered the upper class part with an absolutely marvelous vehicle - totally missing in the Movie). The whole point about the animated series was the gray shade of both, the government and the rebels. There was no \"good side\". Both killed for their own goals, never revealed to the audience. In the movie you get your evil guy you can hate. Easy but unsatisfying. Both sides had their traitors, blurring the rest of a real difference between them.<br><br>The conflict between the rebels and the government was a futile struggle like in Orwell's 1984 (seen in a very good episode of the animated series, where the balance of power constantly changed between the government army and the rebels). The conflict existed for no reason but for the conflict itself. Therefore the element of luck was so important. The fact if you live or die depended on sheer coincidental factors (the \"Nail\"-scene in the animated series).<br><br>The \"caligulesk\" absolute ruler called Trevor Goodkind like in Hobbes's Leviathan was also missing. In the animated series Trevor had it all, leaving his live an escapade of sick games and lusts to fill his emptiness which only Aeon could fill. In the movie he is just a monarch, debating with his \"servants\".<br><br>Summed up, just watch this movie for itself, but you will be disappointed if you expect anything \"deep\" in the movie.<br><br>Please forgive my poor English and the typos hence i am a native German guy ;-)","user":"JBrawata","rank":[29,38]},{"title":"Surprisingly I'm NOT Disappointed","rating":9,"date":"5 December 2005","review":"I thought for sure I would be.<br><br>This is the first movie based on a TV show that I've gone out to see in a long time and for the first time, I haven't been disappointed. For anyone who remembers the original shorts from liquid TV and the following series, this film will fall snug into the sequence of the Aeon Flux story-line (such as it is). I feel that for the first time a movie like this has really captured the imagery, character, and themes of the TV show it's named after. From the script, to the directing, to even the casting, this film has really lived up to a show that I fondly remember from my college years.<br><br>When I first heard about it, I cringed at what I was convinced would be a butchering of what was an incredibly well crafted show. I thought for sure that the screenplay wouldn't blend with the series and that it would lack all of the post-modern themes that made the show so thought provoking and mind bending. I thought for sure that the characters in the movie would be the gorgeous carbon copied cliché archetypes we find in every action flik rather than the strange (in personality and looks), flawed, often torn, and questionably motivated characters that made the show so interesting. And I also assumed that this film would be so overwrought with cgi effects that I'd wonder why they didn't just make a cartoon.<br><br>I've never been so happy to say that I was wrong on all accounts. The screenplay almost seems like an episode they never made. It begins straightforward, leading into beautifully choreographed action. But just as you think you're settling into a dynamic action piece meant to leave your brain dead, the plot is twisted around, and you find yourself pondering philosophical concepts you haven't pondered since you last read Kurt Vonnegut. The characters and their motives can rarely be pinned to good &amp; evil but more or less selfish; another concept carried over from the show.<br><br>The casting was also done with the look of the show in mind. While Theron is far more gorgeous than I ever imagined the real Aeon looking, she captures the stoic, brutal, and graceful demeanors of the series' antihero. The rest of the casting for the film is even better. The actors chosen really do resemble the images I recall from the show like the absurd hair-dos, angular facial features, full lips, and tortured expressions that make you think they're wondering if life is really worth living.<br><br>The rest of the film's look is also spectacular because it's perhaps the most realistic futuristic society I've seen on film and because the locations/sets echo the look of the original show. The cgi effects no longer resemble something out of Tron but really make you wonder if what you're looking at is computerized or on the set. This may be just the natural progression of computer effects as I noticed the same thing with the latest Harry Potter movie. The setting (while not as grand and wide as I remember) has retained the post-industrial devolution look and blended it seamlessly with the super-futuristic look of the aristocratic locations.<br><br>I feel the only thing they didn't quite get right was the sensually explicit nature of the relationship between Trevor and Aeon. I'm not saying that the movie needed a full out sex scene or anything (although it would've fit considering the theme at the end) but we don't see evidence of the mind games, competition, and fetishism that made the relationship so compelling in the TV run. I was also hoping that the score would have a few echos of the original soundtrack for the shorts and that a few more of the full episode characters would make an appearance, especially Bambara.<br><br>Overall, If you fondly remember the Aeon Flux from Mtv's Liquid TV and you liked the full episode series even more, you'll dig this film. If you like weird post modern films (like Brazil, FightClub, or Akira) that leave you thinking a couple of days after you've seen it, you'll dig this film. If you've hated every single crummy movie based on a TV series, you should really dig this film. Most of all; If you're a sci-fi fan who feels it's been far too long since you've seen a good film, get out and see this one.","user":"gnorbury","rank":[196,306]}]