[{"title":"One with everything and extra everything","rating":6,"date":"6 November 2006","review":"This is a weird movie. It starts of as a gangster movie with drugs, naked girls and suits that you get arrested for just by wearing them.<br><br>The movie is split up into two different movies, the first a gangster/love/action/pulp-fiction-story and the second part a horror/psycho/thriller type of story. It sounds good on paper, and the director and editor are both doing their best to keep the two stories together. To bad it's not working, the stories are to different and it really feels like if someone took two movies and created a mix-tape from them.<br><br>The action is average and Wesley Snipes is doing his thing, but not more then you could expect from a B-type actor. Some of the other cast members are doing a real good job and this only makes Snipes look more like a poster name then a real actor in this case. <br><br>The biggest problem I had with this movie is that the psycho/killer part appealed more to me then the main gangesterstory. Every time the story shifted to the Thriller part I woke up from the \"almost-sleeping-state\" the gangster part put me in.<br><br>To sum it all up: OK movie the fact that it's very different from Wesley Snipes' other work, and that the writing is above average makes it interesting to watch.","user":"iipigbear","rank":[21,26]},{"title":"Waste of Time","rating":3,"date":"5 August 2010","review":"Look what happened to me on the same week. In one day I watched \"New Jack City\" who happens to be directed by Mario Van Peebles and it also happens to be a great movie about the dangers of the criminality in the New York of the 1980's and 1990's. A few days later I had the chance to watch this one \"Hard Luck\" also directed by Peebles and with Wesley Snipes in the cast. Result: this movie has nothing good to show except that are some twisted minds wandering around in the world. <br><br>Wesley Snipes plays Lucky an bad luck ex-convict who crosses countless and weird situations after some obscure negotiation involving an old friend (Noah Fleiss), some corrupt police officers and a gun dealer. While trying to get away of a shootout he kidnapped a beautiful dancer (Jacquelyn Quinones), stole the money of the negotiation and run away from the police. On the road he's gonna meet a psychotic couple (played by Cybil Shepherd and James Liao) and some other strange people in a mosaic and boring film.<br><br>The action scenes are annoying, weak and there's nothing special about it and Snipes was wasted in that department but in the dramatic scenes he is better than some of the supporting actors. The story presents too many characters and situations trying to be a action flick mixed with some mosaic film such as \"Magnolia\" where everybody and everyone is connected although we don't know how and when. About the psychotic couple...well they are presented in the beginning of the movie and you keep trying to understand what they're doing all the time, torturing people they find on the streets and you keep thinking what's the connection between them and Snipes? Only in the end you're gonna find out! <br><br>I'm truly disappointed with this film because it had some potential, it had a social denounce in the beginning (Snipes character survived the Hurricane Katrina) and the movie totally forgot that and moved to an ordinary and crappy action movie. I miss the great director of \"Panther\" and \"New Jack City\" who knew how to work with explosive themes and some good action scenes in the middle. A good cast was wasted (except Luis Guzman who was real funny in his only scene), money was wasted and my time was wasted. 3/10","user":"Rodrigo_Amaro","rank":[6,6]},{"title":"Has to be seen to be believed","rating":3,"date":"9 January 2015","review":"Well, I've finally tracked down Wesley Snipes's worst film and it turns out to be this Mario Van Peebles-directed stinker that attempts to mix the small-time gangster genre with a serial killer flick. HARD LUCK is an appallingly shot, badly written B-movie that's so inept that you wonder whether Peebles went out of his way to make the worst film he could as part of a bet.<br><br>The film stars Snipes and the often-naked Jackie Quinones as an ex-con and a stripper who go on the run from the Mob with a suitcase full of cash. All very ordinary you might think, but then the plot takes a turn for the bizarre with the introduction of a serial killing couple played by Cybill Shepherd and James Liao. Yes, that really is Cybill Shepherd in this movie, although what she's doing here I can only guess.<br><br>HARD LUCK is shoddily made and particularly badly shot; all of the dialogue scenes and moments of exposition are acceptable, but the handling of the action is horrendous (a surprise considering Peebles's experience in the genre). The ineptness has to be seen to be believed: there's genuinely nothing good here, aside from a typically reliable Snipes, so how this got made or even released I have no idea.","user":"Leofwine_draca","rank":[5,5]}]