[{"title":"Imagination and fantasy with special effects galore","rating":7,"date":"10 May 2010","review":"Mo (Brendan Fraser) is good father, happily married who has a special talent to bring personages out of books. But his wife named Resa(Sienna Guillory)has disappeared. One night he brings out various characters named Capricorn and Basta from Inkheart , a book written by Fenoglio (Jim Broadbent) whose story is set in Middle Age and plenty of magical beings. As there suddenly appears Capricorn (Andy Serkis) and Basta (Jamie Foreman), two nasties, and Dustfinger (Paul Bettany), a fire-eater. Now, 10 years later Meggie (Eliza Bennett) discovers the truth and she also has supernatural powers . Meggie along with his father and grandmother confront several fantastic adventures, dangers and risks.<br><br>This exciting motion picture displays derring-do adventure, romance ,fairy tale ,and spectacular frames with phenomenal production design. The flick gets lots of bombastic special effects including supernatural apparitions, wizards ,legendary heroes and numerous images have you on the edge of your seat. As appears the heroes of tales as ¨1.001 nights¨, ¨the minotaur¨, ¨Rapunzel¨ and several others. Riveting set pieces illuminate the full-blown adventures blending witchcraft, fairies, necromancy and turns out to be extremely amusing. Stimulating adventures of ours protagonists are complemented by a breathtaking final attraction in the castle scenes with incredible appearance of an overwhelming ominous shadow. Casting is frankly extraordinary, Brendan Fraser as impetuous hero, Andy Serkis plays magnificently a shamelessly villain and Helen Mirren as likable grandmother, and brief appearance of Jennifer Connelly as Roxanne, among others. Ideal main cast is completed by phenomenal secondary actors as US as British players. The movie packs a sensational production design by John Beard , accompanied by a glamorous cinematography by Roger Pratt filmed on location, in Italian Riviera, Liguria and Shepperton Studios, Surrey, England, including a mesmerizing photography with wonderful , marvelous landscapes . Emotive soundtrack appropriately adequate to fantasy by Javier Navarrete. The picture is brilliantly directed by Ian Softley. He's a good writer, producer and director,who achieved big time with ¨The skeleton key¨, ¨K-Pax¨, ¨Backbeat¨ and Hackers¨. Rating: Better than average. Essential and indispensable watching for fantastic cinema lovers.","user":"ma-cortes","rank":[16,17]},{"title":"Can't believe no one's mentioned...","rating":7,"date":"15 December 2008","review":"This was a very enjoyable film; maybe not as exciting and a bit more contrived than I'd been looking forward to, but it was still very enjoyable in the main.<br><br>But one thing stood out above any other in this film; and that was: Paul Bettany's performance as Dustfinger.<br><br>He was just brilliant, and absolutely stole the film for me. I thought he was a good actor anyway, but the moment he came on I had to stop and think \"wow!\", and I continued to be impressed throughout the film, as his character development just got more and more interesting. I felt far more sympathy with his character than Brendan Frasers (even though I think he's fantastic!), and I felt that he was the true 'main character' of the film (in the same way as Sam is to Lord of the Rings).<br><br>If anyone is unsure about seeing Inkheart, I would suggest that it is a must-see if only for Paul Bettany's absolutely stunning performance; he is intense, emotional, funny, troubled, heroic and just plain brilliant.<br><br>Also high praise for Helen Mirren and Jim Broadbent, who were very refreshing. I did feel more could have been done with Andy Serkis and Brendan Fraser, they didn't wow me as much as I'd expected.<br><br>But overall a very enjoyable film!!","user":"coolclairep-1","rank":[126,163]},{"title":"Inkheart is a highly enjoyable film. But it is NOT the book.","rating":8,"date":"2 February 2009","review":"Let me begin by saying I have read the book and most of the second. When I saw the trailer, there were so many elements I could not place that I presumed this film would be some combination of all three books, and almost did not see it as I had not yet read the last book. I'm glad I did not succumb to this temptation.<br><br>The movie itself is loosely based on Funke's book. That's right, \"book.\" It is actually NOT based on all three books, but rather, just as the title implies, the initial Inkheart. The elements I could not identify were never in the book. So...If you're a book fan and are unable to separate the literary story from a film adaptation, you WILL be disappointed. But honestly, if you're looking for something that bears more than a slight resemblance to the book, you still may be disappointed by the omissions, rearrangements, and substitutions.<br><br>But do let me say that Brendan Frasier is a wonderful Mo. The casting choice of Eliza Hope Bennett as Meggie was a bit of a surprise, but she is lovely and does very well as Meggie. Paul Bettany is a beautifully tragic Dustfinger. Wow, what a performance Bettany gives! I was also surprised by Helen Mirren's casting as Aunt Elinor, but she was a capable and endearing Elinor. I was even impressed by Rafi Gavron's Farid. I can't wait to see where HIS career leads him. He has great promise. They, and the supporting cast, were wonderful. Not one stiff performance. Andy Serkis was also good as Capricorn. I can't say he was \"awesome,\" as he was not nearly as scary as the literary version, and seemed somewhat of a victim of his own circumstances herein, but he was enjoyable, nonetheless.<br><br>If you have never read the books, however, you may find this as I did; an enchanting lovely fantasy with enigmatic characters and a slick execution style. I enjoyed this work far more than I should have, considering the plethora of WIDE variances from the literary source.<br><br>All in all, while Inkheart is a highly enjoyable film, it is NOT the book. My advice? Watch the movie. Love the movie. Then read the book and find a hundred new reasons to love it again.<br><br>It's still fun, it's still wonderful, and it's still enchanting.<br><br>It rates an 8.2/10 on the movie scale.<br><br>It rates a 3.5/10 on the adaptation scale.<br><br>It rates an 8.4/10 on the fantasy scale from...<br><br>the Fiend :.","user":"Elswet","rank":[96,124]}]