[{"title":"Crime in Post-war transitional period, while new ideas sound rosy for everyone","rating":7,"date":"25 January 2009","review":"In 1920s' post war transitional period, a chauvinist gang in Australia institutes a wagering federation for middle-weight boxing championship. Beside with their drug and beer smuggling activities, they also rig walkover horse races. Hugo Weaving plays the chief of the gang and Rose Byrne does his fiancée.<br><br>My reason of seeing this film was because I follow Hugo Weaving's career since 1999's Matrix, and Rose Byrne's career since her appearance in Troy(2004). When the characters are all introduced to us, we found ourselves in the middle of crime chains. Absolutely, there is no mystery here, since we feel like we're part of the gang. Then the only lonely good guy of the movie came to the spot: Art Walker, a young and promising boxer. He defeats one of the former champions by the arbitration board decision. Resembling Scorsese's Raging Bull, the boxer is forced to throw the game. To get the title shot, he obeys to the chief. At the end, he has to make a choice between his honor and his goal to become a champion.<br><br>There are no outstanding performances from the actors, yet I liked the cinematography and art direction a lot. Originally written for the screen, the techniques used for passing from one scene to the next is so impressive. The editing has been dished out very expediently that holds viewers' attention continuously, even though the storyline is very simple and unassuming.<br><br>This one is originally a good sample of a crime/action genre. Not exactly a family movie for its scenes of drug usage and female nudity, but it's very entertaining for the purpose of watching with friends.","user":"CihanVercan","rank":[20,22]},{"title":"This film is gorgeous!!","rating":9,"date":"13 September 2008","review":"I was swept away with the look and feel of this film. It reminds me of those glam film noir films - a mix of romance and violence. Rose Byrne is so gorgeous. The beautiful 20s costumes and look really suit her. Whoever did the costumes should be congratulated. Her scenes with that young Aussie guy are HOT. Hugo Weaving is great as always - his controlled violence is scary. Like good film noir you have to pay attention to the plot, but I didn't have a problem. And I really liked the music -a mix of jazzy numbers by Chris Abrahams and some modern songs. I hope they put out a soundtrack. The whole film was an interesting mix of period film with some modern touches - like the music.","user":"alfaguy","rank":[21,27]},{"title":"understated small story with top end production","rating":7,"date":"31 May 2009","review":"Ogilvie's big movie shows his exceptional craft in film making. The visuals alone are stunning, combined with top end editing, sets, and sound. The support players were almost better than the stars. the movie is flawed in other areas, a couple of slightly off performances noticeably from Hugo Weaving (what accent was he going for?) and Nevez (unconvinced of why we should care about him), and the story was so low key \"small time crooks\" that maybe the production values were just too good for it. Weaving was a little unconvincing as a tough guy although he could easily pull off scary. The violent scenes conflicted with him being a reasonably nice guy to his gf and taking sh!t from his underlings.<br><br>It's hard to know exactly why it didn't blow minds, but it certainly didn't blow. Some great lines and ideas going down in the script. Ogilvie shows class and control, craft and art, and I'd like to see where he goes next. Most definitely an art film rather than a big budget affair but with the look and feel it alludes to much more.","user":"Rob-O-Cop","rank":[7,8]}]