[{"title":"Searching the eternal youth in Romania","rating":9,"date":"4 November 2007","review":"It's been a while since I have written anything for IMDb. \"Youth Without Youth\" is not only a very personal approach to a barely known novella by Mircea Eliade, but also a homage to Romanian culture and civilization. I felt really good watching a legendary filmmaker like Coppola before the special screening (in Bucharest), walking on the stage and thanking sincerely to the Romanian cast and crew, and in the end, thanking all of us \"for Mircea Eliade\". I read Eliade's novella some months ago, and I found it difficult and \"anti-cinematic\", unlike \"La tiganci\" or other texts of his. \"Youth\" is, as I saw it, a meditation on time and the relation between human memory and identity. Eliade has been concerned with the theme of \"la vita est sueno\" (life is dream) for a long time, and his fiction shows it. Coppola also has been preoccupied with time, dreams and memory in his late films like \"Peggy Sue\", \"Dracula\" and \"Jack\". It might seem strange and paradoxical, but beyond the horror clichés and the gory make-ups, one can see lots of formal similarities in \"Dracula\" and \"Youth...\". The Italian American director is definitely bound to European Romanticism, and he tried to infuse a lot of new symbols (the mirror, the moon on the bluish night sky, the skull etc) to an already symbol-heavy-loaded narrative. Tim Roth is the ideal choice for the central character (old Dominic Matei that grows young after a lightning stroke). The rest of the numerous cast is composed mainly of Romanian actors, most of which are famous in our country. Iures is known for the international public also, and handles his role elegantly, as usual. Maria Lara is a Romanian-born German actress, playing the role of Dominic Matei's lady friend and lover. The relationship between Dominic and Laura is beautifully developed by Coppola's rewriting of the initial novella. Near the end of the film, there is a moment (shot in Malta) where Dominic decides to break away from Laura, because of the dreadful effects of his supernatural youth on her physical condition. Both actors are impressive in this delicate scene.<br><br>This film was, all in all, a pleasant surprise for me. I was expecting a more Hollywood-ish speculative and commercial-oriented style. Anyway, I personally (still) think the D.P. and the photographic department in general was overwhelmed by the magnitude of this project. Coppola should of thought more deeply about his choice, because Mihai Malaimare Jr. (the D.P.) and digital imagery was simply not enough ! It took over 2 years to complete this film anyway, so why didn't he use film instead of digital mediums? Was money really a problem here? Maybe Roth asked for a big fee, I don't know. This film won't be appreciated by a wide audience, because Eliade's literature is very special and restrictive (you need to fancy Romanian folklore and oriental philosophies in order to get into this). In fact, Eliade's novella was clearly inspired (as the main title shows) by one of the most beautiful and profound fairy-tales ever: \"Tinerete fara batranete si viata fara de moarte\" (hard to translate into English, but it might sound like \"Eternal youth and life without death\"). Even if you are not Romanian, you should check it out! It will change the way you feel about time and life, the way Eliade changed Coppola from an old mainstream Hollywood director into an arty European film experimenter.","user":"ekisest","rank":[203,255]},{"title":"Born again Coppola !","rating":9,"date":"30 November 2007","review":"Don't pay too much attention to the press résumé for this film. It has nothing to do with Nazis and American agents. Although they do appear in the film they are not central to its plot, and this is certainly not a spy drama. If this is what you are expecting you risk being severely disappointed. This film will never be a box office smash hit.<br><br>No, this is a film which explores the concepts and possibilities of Reincarnation, Karma, Mysticism, Spirituality, and Time. What if time is not linear? What if reincarnation is real? What if human potential could be exponentially enhanced, scientifically? If like me, you are fascinated by these esoteric subjects anyway, and you can forgive the quirks such as \"upside down\" camera shots, and occasional weak dialogue, then I suspect that you will love this film. It tackles these timeless questions, whilst always managing to be engaging, and entertaining - and it is beautifully shot. At no time did I feel that the film lacked pace or interest.<br><br>Bruno Ganz is becoming one of my favourite actors. After Vitus, he turns in another great performance here as the doctor who treats Dominic (Tim Roth) after he has been struck by lightening. A brilliant academic who has sacrificed his entire life to the study of the origin of languages, Dominic knows that, at the age of 70, he will now die without achieving his goal, his life purpose. The lightening bolt burns him to a crisp, but instead of killing him instantly, it gives him a new lease of life, regained youth, super-human brainpower and thus a second chance to complete his life's work.<br><br>He also regains the love of his life, now reincarnated as Veronica. Under his power, Veronica regresses back through the ages, each time speaking an older language, until, as she nears the origin, and his work nears completion, he realises that he can have his life's desire, but first there is a test, and a choice to be made.<br><br>This fascinating film which Coppola wrote, directed and produced is well constructed and satisfying. It really made me think, and hours after the end, the pennies were still dropping. <br><br>In what it sets out to do, for me, it is a great success.","user":"mjsinclair","rank":[66,81]},{"title":"A heavy and complex movie with deep philosophical implications","rating":9,"date":"3 April 2008","review":"I was flabbergasted to see that a lot of the comments for this film were negative. The fact that the movie is not of a commercial nature doesn't make it bad, it just makes it less accessible. In this manner, it is just as bad for movies as a science paper is for publications.<br><br>Anyway, the film is based on a book of Romanian Mircea Eliade, one that I didn't read. Actually, I didn't read most of Eliade's work for the very reasons people bad mouthed this film. Then I entered adolescence :-P.<br><br>The film, though, is a resounding success to me. Not only that it is well done, but at the end of it, it let me wanting to understand more and to read the book. Maybe I will one of these days. As the film is impossible to summarize here, I will get to a quick conclusion.<br><br>Bottom line: a heavy feeling film, with a complex script and a lot of philosophical ideas of Eliade's scattered through the story; also some of his personal obsessions: orientalism and the loss of the love of his life. I personally think it was a great movie, but it became a bit confused at the end.","user":"siderite","rank":[73,93]}]