[{"title":"Powerful when it's being original","rating":8,"date":"13 March 2007","review":"I just got back from a screening a couple of hours ago, and I was very happy with the movie when I left it. It's very intense, and the closest I've come to crying in a movie in quite some time. That is a credit to Adam Sandler, who delivers a magnificent performance on many levels, and who probably deserves an Oscar nom for it, were it not coming out so early in the year. Don Cheadle gives his usual superb performance playing the straight man to Adam's disturbed.<br><br>There is some humor, but most of it is really only funny in comparison to the tearjerking moments, as Adam deals with his loss and Don struggles to help him. Adam plays two levels very well... when he is mentally stable he is funny and likable, but when he is, well, less stable he's powerful and dark.<br><br>I recommend it for anyone who likes intense mental dramas about difficult friendship and loss.","user":"tyler-92","rank":[321,366]},{"title":"If you aren't moved....check your pulse.","rating":9,"date":"24 March 2007","review":"It's not very often a movie can literally make the entire audience laugh, and five minutes later fill their eyes with tears. Many movies try to do this, but few can deliver the emotional impact that this film did. Adam Sandler practically drags you in with his heated and often violent outbursts, but also makes you laugh when the shadow of his past isn't pulling him down. I'm not going to ruin anything, but there is one scene in particular that should have your eyes watering and lip quivering. Even the most macho of men would have to be heartless bastards to not feel something while watching this movie. Don Cheadle gives another great performance, but is out-shined by Sandler. Liv Tyler and Jada Pinkett Smith give solid performances, but nothing in the line of the two leading roles. Sandler's humor is still present, which actually saved this film from being border-line depressing. There are several laughs to be had, but don't think you will stay there long, because it gets serious again without much warning.<br><br>I could go on and on about how well this movie hit on just about every emotion the human body contains, but I will cut this one short. I feel there is no need to tell you anything more. Do yourself a favor and take the time to see this movie. Even if you have to wait until it comes out on DVD, it's 100% worth the time. A deeply moving film sure to put tears in your eyes and a smile on your face...unless of course...you are a heartless soul.","user":"Irishinvazion","rank":[268,321]},{"title":"Remarkable film about Grief, Family, and Friendship","rating":9,"date":"15 March 2007","review":"This film screened last night at Austin's Paramount theater as part of the SXSW Film Festival. We were graced with the presence of director Mike Binder and stars Adam Sandler and Don Cheadle who took audience questions after the film. It is a remarkable and powerful film about what it is like to lose yourself and begin to find your way back. The performances are phenomenal and the story manages to be both tragic and funny in a way that is all too rare. (The trailer for the film tries a little too hard to emphasize the comedic aspects.)<br><br>This is a breakout role for Adam Sandler. While he has begun to transition to more dramatic roles with Punch-Drunk Love and Spanglish, this role is a significant step forward for him as a dramatic actor. He deserves an Oscar nomination as he continues down to transition to more dramatic roles as Tom Hanks did and Jim Carrey is also doing. In this role, he seemed to be trying to channel Dustin Hoffman in Rain Man. Although playing an autistic man is certainly very different than Sandler's traumatized character, both characters for different reasons are trapped in their own worlds of child-like isolation and confusion.<br><br>Don Cheadle's performance is less surprising, but just as good. After Hotel Rwanda and Crash, we've come to expect remarkable nuanced performances from Cheadle. He has the qualities of sincerity and honesty that comes through in this role. But he, too, is also broken and struggling if not in the such profound ways as Sandler's character. Cheadle is struggling with difficulties in both his marriage and in his professional life as a dentist. Together the characters played by Cheadle and Sandler struggle to heal each other in the way that true friends often do (in a way that reminds me of Matt Damon and Robin Williams in Good Will Hunting). They are both searching for that part of the themselves that they have lost and trying to find again.<br><br>Reign over Me is one of the best major studio films to be released this year. The soundtrack, which is almost another character in the plot is wonderful. The filming in the streets of New York - a city that suffered a great tragedy and has also had to heal itself - is also quite beautiful. The supporting roles by Jada Pinkett Smith, Liv Tyler, Saffron Burrows (in a very odd role), Donald Sutherland, and Mike Binder himself are all quite good.<br><br>Writer/Director Mike Binder has really delivered a story that so many will be able to connect with on numerous levels. This is a story about grief, family, healing, male friendship, mental health, and the meaning of love. Reign over Me does not disappoint. The film is almost hypnotic as it draws you into the lives of its characters. Hollywood would have a much better reputation if it made more character-driven charming films like Reign over Me.","user":"JustCuriosity","rank":[227,271]}]