[{"title":"Tired Tale In First Person Singular","rating":7,"date":"18 October 2008","review":"Art Linson's memoirs are a reminder of what a sad place Hollywood really is. We got closer and more original glimpses in films that go from Wilder's \"Sunset Boulevard\" to Altman's \"The Player\". Bernard Rose's \"Ivansextc\" also comes to mind not to mention Blake Edwards's SOB. Here the prototypes are well known even by people who have nothing to do with the film industry so one gets a bit impatient waiting for this fresh look from a prominent, still active, Hollywood producer. No such luck but there are other elements that make the film fun to watch if nothing else. To see Robert De Niro play \"a character\" that it's not in any way a semi parody of the films that made him famous is a welcome surprise in itself. Barry Levinson shows that he's as sharp as ever and the rhythms that he finds to tell the story keeps the tired tale not only alive but almost gripping.","user":"watbarr","rank":[83,112]},{"title":"Unexpected gem","rating":9,"date":"18 February 2009","review":"When I read some of the other users' comments I could hardly believe we watched the same movie. Wasted 2 hrs of my life!? This is, simply put, ridiculous, this movie does not require moral or surprise, it is quite enjoyable and powerful as it is.<br><br>Superb acting, intelligent writing, characters you can sympathize with as well as good steady rhythm.<br><br>It is a beautiful movie centered around a producer and how his life evolves around a series of regular down to earth events. It is a little like entourage minus the girls and absurdity as it is centered around Hollywood but you do sympathize with the lead character a lot on his reactions to events.<br><br>I had no expectations from this movie and it turned out to be quite a gem, I believe this is one of those movies that will be rated more highly in the future. If there was any hype around this, if people expected a blockbuster, well it is their fault. It is more like an independent movie and a very good one at that I must add.<br><br>It certainly feels like De Niro very much enjoyed acting in this one, this is by far the best I have seen him in years. Turturro, Wincott, Penn Willis all saw something in this script and they were right. ( To be honest with you Turturro did overdo his part a little) <br><br>I have been to much more boring movies than this and they were rated much higher by IMDb crowd, no it does not move at a snail's pace, no there are no big psychological dramas or a big story, and yet all those are OK and their absence is what makes this movie perfect.","user":"eli_down","rank":[29,37]},{"title":"entertaining but missed the mark","rating":6,"date":"4 April 2008","review":"I just got back from an AFI screening of Barry Levinson's satirical comedy, \"What Just Happened?\", an inside look into the movie business and big studio politics. Robert De Niro was in attendance along with director Barry Levinson and screenwriter Art Linson. Although I tried to get a photo of De Niro, sadly, I was never close enough to get a good shot.<br><br>Based on producer Art Linson's book, \"What Just Happened? Bitter Hollywood Tales from the Front Line\", the film version tells the story of a successful Hollywood producer, Ben, played by Robert Deniro, as he juggles his personal and professional crises. This film has an impressive cast including Robin Wright Penn as Ben's second wife, Kelly; John Turturro as Dick, the stereotypical shifty agent; Stanley Tucci as Scott, the blocked screenplay writer; Michael Wincott as Jeremy, the temperamental director; Catherine Keener, as Lou, the hardcore studio exec; Bruce Willis as the demanding movie star; and Sean Penn as himself.<br><br>This mildly funny expose of modern-day Hollywood, was entertaining, but a little disappointing. The message is supposed to shock and outrage the viewer about how the film industry ruins art by turning it into pure commerce. But there have been plenty of Hollywood satires like \"The Player\" that have done this genre better. Although the source of the material is authentic and despite an outstanding cast (who all give great performances), \"What Just Happened?\" ultimately has nothing new to say besides the fact that Hollywood is a devious place to work. As a gimmicky farce, it works, but as a satire it was a limp and familiar insider's movie that lacked sharp irony, humor and novel characters.<br><br>This film won't appeal to everyone, but it does have some good one liners and funny moments. However, the combination of these actors working together in a comedy may be worth the cost of admission alone.","user":"moviefan8169","rank":[87,135]}]