[{"title":"An emotional roller-coaster of epic proportions!","rating":10,"date":"30 June 2006","review":"Very rarely can you find a movie that can make a person shed tears of sorrow one minute, then laugh out loud the next. This is a heart wrenching tale that will make people look at themselves and how they can better their own family units. <br><br>Viewers will find that they will relate to one of the many stories within the movie. It's been a long time since a movie has made me feel this type of sadness and sorrow, followed by a warm fuzzy feeling right in my chest. An amazing film, with amazing people. The supporting actors complete what is truly an inspirational film. It has inspired me to be a better father and a better son. Watch this movie.","user":"snoopx","rank":[112,120]},{"title":"A masterpiece that must be seen by everyone!","rating":10,"date":"1 January 2010","review":"A masterpiece that must be seen by everyone!<br><br>It's the better film I have seen so far. It's not only about the relationships between fathers and sons, or the sequences from a coup d' etat, especially against leftist people. There are a lot of things and ideas included. For example the attitude of a former lover, wounded, married to another man, but still carrying. Its an insight to the human relationships as a whole, the role of the family in Mediterranean countries. This does not mean that people from the North for example will not understand or will not be moved. But the situations depicted, fit especially to Turks, or Greeks (like me), or perhaps Italians. The director is really one of the highest class. I had previously watched his later film Issiz Adam (Always alone), and I was so impressed that I looked for another of his movies, so I found this film. <br><br>I found very good the actor who played the young boy. I was really shocked from the scene of the father regretting for his behavior, it looked very much like a Greek ancient tragedy. Also the music of the film was excellent. <br><br>Everyone must see this film. Not only he will like it, but I am sure that he will be moved.","user":"denpolites","rank":[66,71]},{"title":"An Incredible Movie","rating":10,"date":"12 December 2005","review":"As I watched that movie, I saw the Turkish relationships in the best way that it could be shown. A very good choice of cast is the most powerful criterion of the success of the movie. Humeyra, the grandmother is a very talented woman in acting. Emotional scenes become more frequent while we see the movie to get to the end. Unfortunate events make the Turkish people get closer to each other. The movie shows that perfectly. Hospitality, love, grief, laughs... Everything is included in this movie. An emotional breakthrough. The movie also points on the elderly reality -now an impossibility- the torture, made by the cops.<br><br>Better to be watched by fathers and sons. Also, crying may occur, don't worry; too many people who watched the movie had the same.","user":"ethernaldreams","rank":[217,247]}]