[{"title":"Good fighting movie","rating":9,"date":"23 February 2020","review":"This is way better than the original film. It's explosive and heart-pounding from start to finish. The best American made martial arts action film in years. An action classic. An adrenaline-charged action-packed edge of your seat thrill-ride that packs some of the most intense, mind-blowing and bone-crushing martial arts sequences I've seen in some time. It's stylish, hard-core, gripping and wickedly entertaining. One cool as hell action flick that delivers. A stunning, thrilling and well-crafted piece of action movie. Michael Jai White and Scott Adkins are just pure dynamite, they deliver with their great performances and power packed fight sequences. These two set the screen on fire with their extraordinary energy. A tremendously exhilarating movie. This film in every sense of the word is a knockout.","user":"MR_Heraclius","rank":[37,38]},{"title":"Great Kick-ass Movie","rating":9,"date":"1 May 2006","review":"This is better than the first one, though i like the first one too... but this one really kicks ass. The execution of the fight scenes, the action and stunt sequences are choreograph very nice and hard hitting.<br><br>The story is not that new to movie-watchers, though there's some twist but still its some kind of a stereotype story... <br><br>But if you want hard hitting, bone breaking action entertainment, this one is a must see!<br><br>The cast especially actors Michael Jai White and Scott Adkins Kicks Ass! Isaac Florentine and the action cinematographer did a very good job!","user":"fastlane765","rank":[33,41]},{"title":"Great action sequences!","rating":7,"date":"27 March 2006","review":"I attended the premiere at Paramount Studios and have to say I was impressed by the breathtaking fight scenes. They were filmed at a very high speed, so there was a hyper-real crispness to them and interesting time changes throughout. Things were slowed down and sped up to catch Michael Jai White's amazing choreography.<br><br>Michael Jai had a hand in much of the production and his attention to detail in these scenes in particular shows. Scott Adkins is also an incredibly adept martial arts performer and comes off as an appropriately menacing villain. Michael Jai plays George Chambers with all the hubris and latent anger you could want, but also with an undertone of humor not present in Ving Rhames' portrayal of the character. <br><br>The last reviewer made a good point about this film having an 80's action feel to it. There's a no-nonsense brutality to the fighting that you don't often see these days. This is no Jackie Chan hit-em-with-a-broomstick fest. Think Rocky meets UFC. A definite adrenaline-pumper!","user":"shawn-148","rank":[29,37]}]