[{"title":"Entertaining and Full of Action Adventure","rating":7,"date":"13 January 2010","review":"During a lecture about John Wilkes Booth and Thomas Gates, Ben Gates (Nicolas Cage) and his father Patrick Gates (Jon Voight) are surprised by Mitch Wilkinson (Ed Harris) that claims that their ancestor was a conspirator in the assassination of Abraham Lincoln based on the missing page of Booth's diary that he possesses. The outraged Ben decides to prove the honor of his ancestor and together with his wife Abigail (Diane Kruger) and his best friend, the writer Riley Poole (Justin Bartha), they head to France, England and Washington to collect clues to lead them to a lost city of gold Cinola and clean the name of Thomas Gates. But Mitch Wilkinson is following each step of Ben and his friends to take the merit of finding the treasure for himself.<br><br>\"National Treasure: Book of Secrets\" is an entertaining and full of action adventure that follows the style of Indiana Jones combined with \"Da Vinci Code. The story is developed in high pace, with likable characters and funny situations. Nicolas Cage and the gorgeous German Diane Kruger show a wonderful chemistry and Jon Voight, Justin Bartha and Helen Mirren give a magnificent support. Ed Harris is a very confused and ambiguous villain and his true motives are never clear, Harvey Keitel has a minor role and Bruce Greenwood performs again the role of president of the United States of America that seems to be tailored for this great actor. My vote is seven.<br><br>Title (Brazil): \"A Lenda do Tesouro Perdido – Livro dos Segredos\" (\"The Legend of the Lost Treasure – Book of Secrets\")","user":"claudio_carvalho","rank":[19,22]},{"title":"Decent film","rating":6,"date":"31 December 2007","review":"National Treasure: Book of Secrets is a decent film. Nothing more, nothing less. I came out of the theater content, and yet by the next hour I'd forgotten much of what had taken place. Such is the case for most films now, however.<br><br>Compared to the first film, the plot is weak (certainly not as tightly drawn as the former) but the energy is the same and the humor is the same, and overall it's still as watchable as the first. Helen Mirren and Ed Harris were also very good, and somewhat surprising, additions to the cast.<br><br>Essentially, the movie is on the ridiculous/unbelievable side, but it's worth a watch. I don't think I'd pay another 10 dollars to see it again in theaters, but waiting for a rental will do.","user":"AllTheMountains","rank":[82,112]},{"title":"Good entertainment","rating":7,"date":"19 December 2007","review":"I will keep it short and simple. Just watched it, paid 10$ for it, it is worth it. Not much of details as you would expect out of a great movie, not much of substance in the movie itself however the acting and the pace of the movie is so beautiful you wont think of the flaws in the intricate plans they carry out in the movie. The subtle comedy is really nice and they have kept the first movie in consideration and have not brought many new characters. It is not a movie that you would think a lot about after you come out of the hall, however you will not think anything else either while the movie is going on. I will give it 7 for the sheer value of entertainment and nothing else and of course the one liners that keep popping up which actually make you laugh.","user":"good_dn","rank":[187,271]}]