[{"title":"'Margaret, are you grieving?...It is Margaret you mourn for.' Gerald Manley Hopkins","rating":10,"date":"12 July 2012","review":"MARGARET is and has been a troubled movie - sophisticated examination of one girl's post- traumatic transformation as part of a larger point about how one's notion of importance is dwarfed by the larger worldview. Written and directed by Kenneth Lonergan and shot in 2005 as a three-hour film, the movie has remained on the shelves since its completion in 2007 over legal problems and finally is available for viewing in a 150-minute version. Though it has flaws it contains some of the most sophisticated dialogue and philosophical points about where we are in our society today that the editing glitches become secondary background noise in a compelling film. The title (no one in the film is named Margaret) references the Gerald Manley Hopkins poem 'Spring and Fall: to a young child' which is quoted at the top of this review.<br><br>MARGARET focuses on a 17-year-old New York City high-school student Lisa (Anna Paquin) who feels certain that she inadvertently played a role in a traffic accident that has claimed a woman's life, Monica (Allison Janney): Lisa was chasing a bus whose driver Maretti (Mark Ruffalo) ran a red light because of Lisa's distraction trying to discover where the Maretti bought his cowboy hat. Monica dies in Lisa's arms while asking for her daughter also named Lisa (we later learn Monica's daughter died at age 12 from leukemia). Lisa at first feels sorry for Maretti, thinking that if she tells the truth Maretti will loose his job and his family support. Lisa's actress mother Joan (J. Smith-Cameron) encourages her to not give accurate testimony to the police, a decision Lisa follows and spends the rest of the film regretting, and in making attempts to set things right she meets with opposition at every step. Torn apart with frustration, she begins emotionally brutalizing her family, her friends, her teachers, and most of all, herself. She has been confronted quite unexpectedly with a basic truth: that her youthful ideals are on a collision course against the realities and compromises of the adult world.<br><br>The world that Lisa occupies includes teachers - played by Matt Damon (who crosses a forbidden line when Lisa seeks his advice as the only truly adult man she knows, Matthew Broderick whose class discussions over literature are brittle and acerbic and deeply disturbing - her introduction to adolescent needs and physical incidents at the hands of John Gallagher, Jr. (now of The Newsroom fame), Paul (Kieran Culkin) - her relationship with her needy single mother Joan whose newly dating Ramon (Jean Reno), her contact with the deceased's friend Emily (Jeannie Berlin - brilliant), and the deceased's only family - all in an attempt to somehow set things right but Lisa admitting that she is as responsible for Monica's death as is Maretti. But the world outside can't cope with anything but financial compensation as the resolution to Lisa's angst.<br><br>There are many other characters brought to life by some VERY fine actors and the stunning musical score by Nico Muhly includes moments at the Metropolitan Opera where we actually get to see and hear Christine Goerke as Bellini's Norma singing 'Casta Diva' and Renée Fleming and Susan Graham singing the Barcarolle from Offenbach's Tales of Hoffman, allowing the opening and closing of the film to be accompanied by a quiet guitar piece, as well as proving Muhly's very highly accomplished music to underscore the moods of the film. The cinematography by Ryszard Lenczewski underlines the tension - form the imagery of slow motion crowd movement in New York during the opening sequences to the stabilization of important encounters between the characters. A lot is said and screamed and the level of communication and actions by Anna Paquin's Lisa alienate the audience at times, but the film makes some very solid statements about how we are acidly interacting or not connecting in our current state of society. That deserves attention. The film requires a lot form the audience, but in this viewer's mind it is well worth the time. <br><br>Grady Harp","user":"gradyharp","rank":[80,108]},{"title":"Makes You Wish that the Bus Hit You","rating":1,"date":"8 January 2012","review":"With the A-list cast, it is incredible that no one noticed that this film makes very little sense. <br><br>There is so much wrong with it, it is hard to begin. Scenes run on and on without advancing the story. Scenes are cut without reason. This film is badly in need of editing. Margaret is a very long movie with very little story to tell. <br><br>The story wanders everywhere. It is essentially a story about a 17-year- old woman, Lisa Cohen, who is partly responsible for the death of a pedestrian in New York City. The heroine, played by Anna Paquin, is annoying from the beginning when she is caught cheating on her math exam by her teacher, played by Matt Damon. He indulges her belief that she is entitled to do so.<br><br>Later that day she distracts a bus driver, played by Mark Ruffalo, in order to find out where he bought his cowboy hat. Instead of watching where he is going, the driver kills a woman in the crosswalk. The woman dies in Lisa's arms. She lies to the investigating officer at the scene and reports that the bus had the green light. She later experiences the discomfort of guilt.<br><br>The rest of the film involved this young woman making a nuisance of herself to pretty much everyone she meets. She changes her story. She wants to meet the family of everyone involved in the tragic death. She wants the bus driver fired. She wants to move to California to live with her father. She has sex for the first time without really knowing her partner. She tries to have sex with her teacher at school. She argues with everyone. <br><br>Jean Reno adds contrast to the ensemble. He plays a nice, interesting man who injects a little reason and depth to the story, so you know he has to die unexpectedly so that there are no agreeable people left in story.<br><br>The script is about unhappy, ethically-challenged, unpleasant people bickering about morality, about Israel and Palestine, about whatever, and then there is psychobabble. These people go after each other at the slightest provocation. <br><br>At some point, a civil lawyer is retained. The lawsuit makes no sense. The involvement of the heroine, who was partly responsible for the death, in every aspect of the suit goes beyond incredible. The beneficiaries of the suit lie about how much they liked the dead woman. The lawyer encourages this. There are speeches about morality made by people aren't very moral. <br><br>It is a long, long movie that makes you wish you were hit by the bus instead.","user":"ligonlaw","rank":[157,229]},{"title":"A tragic accident sends one New York City teenager into the throws of a moral dilemma which serves as a catalyst for her own transformation","rating":10,"date":"27 July 2006","review":"A truly heart wrenching story, \"Margaret\" reiterates Kenneth Lonergan's gifts for dialogue, story, and his ability to treat the most dramatic themes with artful humor, awareness and perception. The acting is exceptional; even relatively small parts, (played by actors such as Matthew Broderick, Matt Damon, Mark Ruffalo, and Allison Janey) showcase both the actors' own remarkable abilities as well as Lonergan's attention to detail. It is Matthew Broderick's character who is the only one to utter the movie's title as he recites a poem by Gerard Manley Hopkins. J. Smith Cameron and Anna Paquin, who play mother and daughter, both deliver fierce performances which form the relationship that serves as the backbone of the film. Taking on issues from abortion, divorce, and death to the inherent isolation of being human, the movie has a life and humor to it which cannot be brought down by the weightiness of these issues.","user":"abneuman","rank":[148,223]}]