[{"title":"A great idea, shame about the execution.","rating":6,"date":"24 February 2008","review":"What would happen if you could teleport ANYWHERE in the world in the blink of an eye? Thats the question explored in Jumper, a film thats as fast and action packed as it is hollow and underdeveloped.<br><br>The films theme of individuals who can vanish and reappear anywhere they choose is a great idea but its execution is a little weak in Jumper. Why? The blame rest squarely on the films instance on being the start of a series. Instead of taking time to develop anything in the movie, Jumper just whizzes by at an incredible speed, setting up characters, ideas and plot points without expanding or resolving or developing them. The whole thing is made to kick start a franchise of films where the story would be explained in more detail, but come on man, when you pay to see a film, you expect to see a clearly defined beginning, a middle and a satisfying end- something that Jumper isn't too concerned with.<br><br>Another problem that ties in with the films lack of depth, are the actors. While Hayden Christensen is as bland as usual, the cast (including the usually electrifying Sam Jackson) just sleep walk their way through the superficial script. Only Jamie Bell gives it some effort- his cynical Irish jumper would have made a much better lead character than Anakin.<br><br>However, while the film is pretty shallow there are some glimmers of goodness. The action sequences are fun, fast and frequent, the visual effects are cool and there's never a dull moment due to the films super fast pace.<br><br>It might sound like Im being too harsh on the film but its hard not to be when the movies concept is so great and the end product is as underdeveloped as this. If the film had a more detailed, more fleshed out, more self contained story, Jumper would have been a classic.","user":"Merklin","rank":[127,156]},{"title":"Unexpectedly fun.","rating":7,"date":"28 April 2013","review":"Initially, I thought Jumper would be just another wannabe-superhero film. However, it was far from that. A person who suddenly found out he had the power to teleport or 'jump' in this context when he was trapped in the water under ice. It is a very interesting story to me. Not surprising though, as David Goyer (writer of Man of Steel, and the Dark Knight Trilogy, and more) was one-third of its screenplay writers.<br><br>Samuel L Jackson was pretty cool in the film. I kept guessing what would happen in the film. The flow was pretty good. I like how David brought the problems to himself. Putting a man he was fighting against into a bank which he previously robbed. (Did he not think he would get implicated?) However, the ending was too open. Leaving his friend on the electrical stand, Samuel L Jackson stranded in the desert, and talking to his Mum (who is a Paladin). It would be a pity if a second film is not done (Though it probably will be done).<br><br>However, I would much rather see a Nightcrawler Origins film. (Okay, maybe not relevant) I'm definitely looking forward to see its sequel though. It better be unexpected.","user":"dragonmysterious","rank":[9,9]},{"title":"Attention Span? What happened to Them?","rating":7,"date":"24 February 2008","review":"For some reason, somewhere/when/one in Hollywood decided that 90 minutes was the optimal length a movie should be. Even in superlative films like LOTR and The GodFathers, there are always people bitching about it being too long. This is an issue that drives me nuts because JUMPER really needed another half hour or so to provide exposition, and answer questions that remain unanswered due to this inane 90 minute time limit. All in all, an interesting plot, decent acting, cool locations, very thin in development. Realistically, this is a film for those of us who can shut off expectations and simply enjoy some widely improbable events. An art-house film it is not, nor does it try to be, to its credit. I would really like to see a sequel to this film, as the storyline has been established, and I seriously doubt my semi-Rant about movie lengths will change anything. <br><br>An enjoyable premise, I just wish it had more time to develop.....","user":"Bihast9","rank":[51,63]}]