[{"title":"Decent movie","rating":8,"date":"23 February 2020","review":"It takes a while for your eyes to get used to the uncanny animation, but once you overcome the ordeal, Beowulf turns into an outrageously entertaining ride. The performances are solid, the visuals are unique, the score is uplifting, and it has great action sequences. It's really good fun for adults of all ages.","user":"MR_Heraclius","rank":[37,39]},{"title":"Better than I expected","rating":8,"date":"19 March 2008","review":"I didn't expect a lot from 'Beowulf', for lots of reasons, most of which were to do with the casting: incorrigibly cockney Ray Winstone as a warrior from what's now southern Sweden; wacky John Malkovich as a cynical counselor; loony Crispin Glover as a flesh-rending monster, and weirdest of all, Angelina Jolie as the monster's mother...thaet waes wundorlic castyng, as the poet might have put it. Then there was the way they did the whole thing in CGI, running the risk of making it all look a bit rubbery. Finally, Robert Zemeckis is the director and my great respect for him plummeted through the floor and into the crawlspace after he presided over the insufferable 'Forrest Gump'.<br><br>Nevertheless, this is a lot better than I thought it would be. I missed the 3D incarnation as we were watching the DVD rather than the cinema release, but after a while you stop looking at the CGI and start enjoying it. This is a 'Beowulf' where the story, although different from the poem, is actually very far from shabby.<br><br>Without giving too much away, the main difference from the poem is that in the poem, there is no connection between the monster Grendel and his mother on one hand, and the dragon in the latter half of the poem on the other hand. In the film, a connection exists. Neil Gaiman and Roger Avary do a professional job of tying it all together in a satisfying Hollywood way, without betraying the basic darkness and sadness of the story; it's not like Beowulf rides off into the sunset with Wiglaf at the end. Crispin Glover is genuinely scary as the tormented and raw-boned Grendel, whose main problem is that he just can't stand the sound of people having fun, although since most of this fun consists of hairy men singing lewd songs you can see his point. Angelina Jolie's animated self spends all her on screen time walking around without any clothes on, something that apparently gave Jolie a blush when she saw a cut of the movie. (One of the more eerie things about this film is that the cartoon Angelina Jolie looks marginally more realistic than the actress herself.)<br><br>Despite an accent that's more Stockwell than Geatland, Ray Winstone does a fine, sombre job as the hero, although my wife thought that the animated Winstone looked more like Sean Bean. Brendan Gleeson does a splendid job in the niche he's carved for himself of Hairy Sidekick. The acting honours, or at least the animation honours, go to Robin Wright Penn (or whoever worked on her character) as the pale and melancholy queen; she has moments of subtle hesitation and sadness that struck me as a triumph of CGI acting. <br><br>There is much excellent smiting, some of it unfortunately toned down a little in order to keep a PG-13 rating - so we don't actually get to see Grendel biting men's heads off, just people's reactions to him doing so. Most importantly, the story is not a travesty of the original. It's thoughtful and interesting, as you'd expect from a writer of Gaiman's quality (if not from the author of 'Killing Zoe') and contains some striking meditations on the power of legend and reputation. Plus, there's a really huge kick-ass dragon. 'Beowulf' is a strange and unexpected treat.","user":"lexo1770","rank":[115,152]},{"title":"Surprisingly Good - A 3D Treat","rating":8,"date":"17 November 2007","review":"When going into the theatre to see this I in two minds - it was my first 3D movie and I had heard good things, however I wasn't particularly taken by the concept or the trailers. I was unsure what to expect, however I ended up leaving the cinema extremely satisfied with the film, and tellingly, unable to stop discussing it long after the ride home.<br><br>Visually it is an absolute treat, Zemeckis uses 3D superbly, some of the camera angles and sequences are as great an art as the photo-realistic animation. Occasionally the odd shot appears where the impression is that it was set up solely to emphasise the 3D (e.g. starting at the end of a branch and panning out) and whilst this doesn't add to the film it is actually a pleasant reminder of the novelty of 3D.<br><br>There are only two areas that let Beowulf down aesthetically: the eyes and the mouth. The eyes were static throughout and it is the little details that make the difference when trying to make something as uber-realistic as this, such as the fact that the pupils didn't react to light. As for the lips - they're just not quite there yet - sometimes the speech didn't seem to be quite right.<br><br>The characters are expertly introduced and developed, most notably Anthony Hopkins character, Hrothgar and the tension between his wife. Grendell and his mother are wonderfully creepy and seductive, and bizarrely enough almost encourage sympathy.<br><br>For me the most disappointing part of the film was actually Ray Winstone as the titular character - he was fantastic when talking in a low growl, however the film really suffers when he shouts in full cockney accent. \"I will kill your monstah!\". I half expected Grendell's head to be smashed between a car and it's door. John Malkovitch is a saving grace with his none-more-sinister voice and interesting faith sub-plot.<br><br>The rating for this film has been hotly discussed and in my opinion I do not think it is suitable for children under the age of 12. Grendell would have truly terrified me as a child. The violence, as well as bawdiness, does not make it a family film for young children although having said that the lewd references do provide good humour and balances out the movie.<br><br>So, overall, this was worthy of an 8. Breathtaking animation, incredible action (especially the finale featuring an excellent dragon) and a generally brilliant cast. Beowulf throws down the gauntlet to film-makers to show what can be done with 3D and is an indication of the potential. It's not all the way there yet, but it's a damn good start.","user":"cdemw","rank":[168,262]}]