[{"title":"A stunning directorial debut which deserves to be seen everywhere","rating":10,"date":"28 May 2006","review":"Because this movie deals with recent German history, some German comments about it get sidetracked into minute historical discussions. Forget them; Das Leben der Anderen is an outstanding movie that should be seen everywhere.<br><br>The former East Germany, a relatively small country of 16 million people, was controlled by the most sophisticated, cunning, and thorough secret police the world has ever seen, the East German Ministerium f端r Staatsicherheit, or \"Stasi.\" The Stasi had about 90,000 employees -- a staggering number for such a small population -- but even more importantly, recruited a network of hundreds of thousands of \"unofficial employees,\" who submitted secret reports on their co-workers, bosses, friends, neighbors, and even family members. Some did so voluntarily, but many were bribed or blackmailed into collaboration.<br><br>Das Leben der Anderen, (\"The Life of Others\") German director Florian Henckel von Donnersmarck's debut, builds this painful legacy into a fascinating, moving film. In its moral seriousness, artistic refinement, and depth, Das Leben der Anderen simply towers over other recent German movies, and urgently deserves a wide international release. The fulcrum of the movie (but probably not its most important character) is Georg Dreyman, an up-and-coming East German playwright in his late 30s. Played by the square-jawed Sebastian Koch, Dreyman is an (apparently) convinced socialist who's made his peace with the regime. His plays are either ideologically neutral or acceptable, and he's even received State honors.<br><br>Although he is a collaborator, he is also a Mensch. He uses his ideological \"cleanliness\" to intervene on behalf of dissidents such as his journalist friend Paul Hauser (Hans-Uwe Bauer). These unfortunates must contend with every humiliation a totalitarian state can invent: their apartments are bugged, friends and family are recruited to inform on them, and chances to publish or perform can be extinguished by one stray comment from a Central Committee member. The most recalcitrant can be kicked out of the country and stripped of their citizenship, like the singer songwriter Wolf Biermann.<br><br>Dreyman lives in a shabby-genteel, book-filled apartment with his girlfriend Christa-Maria Sieland (Martina Gedeck), a renowned actress who often appears in his plays. At the beginning of the movie, Dreyman himself comes under the regime's suspicion, for reasons that become clear only later. The fearful machinery of the Stasi rumbles to life: his movements are recorded, and his apartment bugged. The Stasi had bugging down to a science: a team of meticulously-trained agents swoop into your apartment when you're not there, install miniscule, undetectable listening devices in every single room -- including the bathroom -- and vanish in less than an hour, leaving no trace. Agents set up an secret electronic command post nearby, keeping a written record of every joke, argument, or lovemaking session.<br><br>The \"operative process\" against Dreyman is overseen by Stasi captain Gerd Wiesler, played by Ulrich M端he, an actor from the former East who was himself once in the Stasi's cross-hairs. Captain Wiesler starts the film as a colorless, icy, tight-lipped professional who shows no mercy in fighting the \"enemies of socialism\": if he needs to interrogate a suspect for 10 hours without sleep to get a confession, he will do so -- and then place the seat-cover the suspect sat on in a vacuum jar in case the miscreant should later need to be tracked by bloodhounds. At night, Captain Wiesler returns to his tiny apartment in an grubby, anonymous high-rise. He settles himself among his inexpressibly drab furniture, eats a meal squeezed out of a plastic tube while watching reports about agricultural production, and then goes to bed alone.<br><br>As Captain Wiesler listens to Dreyman and his girlfriend he begins to like them, or perhaps envy the richness and depth of their lives in comparison with his own. Perhaps he also begins to wonder why a stranger should have the right to become privy to Dreyman's most intimate secrets: his occasional impotence, his girlfriend's infidelities, his artistic crises. At the same time, though, Wiesler is under pressure: a Central Committee official has made it clear to Wiesler and his toadying supervisor Lieutenant Colonel Grubitz (Ulrich Tukur), that Dreyman has to go down. <br><br>I won't discuss more plot details, as there are unexpected twists. Each of the main characters is drawn deeper into the conflict between Dreyman and the State, and each is torqued by loyalty conflicts that intensify as the pressure increases. The cast is outstanding. Sebastian Koch finds the right combination of poetic detachment and watchful sophistication for Dreyman. Martina Gedeck, as his girlfriend, has the most challenging role, since she's buffeted from all sides: by her suspicious partner, by Stasi agents trying to turn her, and by a lecherous Culture Minister. Ulrich M端he plays the Stasi agent's transformation with reserve, only hinting at the stages in his character's secret, but decisive, change of heart.<br><br>Director von Donnersmarck, a blue-blooded West German, has re-created the gray, drained look of the former East, and the nature of Stasi intimidation, with a fidelity that has earned the praise of East Germans. His pacing is relaxed, but doesn't drag; although there are a few longueurs, most scenes unfold at just the right pace, and there are several great set-pieces. One is a bone-rattling episode in the Stasi canteen in which a young recruit is caught telling a joke about East German premier Erich Honecker. Another is the penultimate scene, a masterstroke in which Dreyman gains access to his massive Stasi file, while reading it, suddenly understands episodes of his own life which had never made sense to him before. The ending is perfectly judged; bittersweet and moving without swelling strings or teary confessions.<br><br>Das Leben der Anderen is an outstanding movie, probably a great one. If it's not picked up for international distribution, it will be a bitter loss for thousands of potential moviegoers in other countries.","user":"ahammel-1","rank":[726,780]},{"title":"Outstandingly great movie","rating":10,"date":"8 March 2007","review":"I wonder why there has been so little written and publicized about this movie. This should be seen in every country and its merits trumpeted from the skies.<br><br>It starts off slowly and the locale is the former East Germany, inhabited by 16 million people who are being spied upon relentlessly by their secret police. In this very real world of the Berlin Wall, there are many Stasi, 90,000, overseeing the populace, aided and abetted by hundreds of thousands of informants. Many of these snitches were blackmailed or other pressures exerted (threats to children and loved ones) and a few obliged voluntarily.<br><br>What is truly amazing is that this is Florian Henckel von Donnersmarck's directorial debut, and he maintains a masterful hand throughout and keeps the story and the tension rolling from the first scene of interrogation which is filmed back and forth between a tape educating new Stasi as to interview techniques and to the actual cell itself where it was recorded.<br><br>The movie circles around three main characters and there is a wider circle of the powerful who pull the puppet strings for a variety of reasons which become clear as the movie unfolds.<br><br>First is Georg Dreyman, a playwright on the verge of celebrating his 40th birthday. Sebastian Koch, a tall,handsome actor dressed in writerly rumple, shares an apartment with his actress girlfriend, Christa-Maria Sieland (Martina Gedeck), and exists within the strictures of the state-sponsored theatre. He is a decent man, and tries to win support for his blacklisted friends.<br><br>For reasons that become quite clear, Dreyman falls under suspicion and the whole sophisticated Stasi spying system comes into play in the era of 1984. His whole apartment is bugged and every sound is monitored.<br><br>The man in charge of all this is Captain Gerd Wiesler,(Ulrich M端he). Ulrich's performance is nothing short of stunning. He starts as an almost robotic presence, dressed in gray, he almost disappears into every scene he's in. But one detects a clear intelligence in his bright eyes, the only part of him that's alive. Captain Wiesler lives in a non-descript arborited apartment, much like himself. He squeezes his food onto a plate from a tube.<br><br>But the captain starts to awaken slowly as he listens surreptitiously on the state of the art equipment secreted in the attic of Dreyman's building. He starts to fall in love with the couple and then pressure from above is brought to bear on him to dig for the dirt in Dreyman's life.<br><br>And he is in a dilemma now, as he is drawn further and further into the life of Dreman and his girlfriend.<br><br>I won't throw spoilers down. Suffice to say is that the story is enthralling right down to the very last frame. The acting is superb, the direction impeccable and the world of East Germany meticulously drawn with the viewer respected enough to find his or her own emotional path through the plot.<br><br>The ending is truly one of a kind. So right and true that I was left nodding, it was the only one possible.<br><br>A must see, I will sing the praises of this film to all I know. 10 out of 10 from me. Right up there in my top 50 of all time. I find it so disappointing that these movies don't get wider release AND compete for an Oscar in the best picture of the year and not just for best foreign film. Now there's a heretical thought!","user":"wisewebwoman","rank":[339,372]},{"title":"Excellent","rating":10,"date":"20 May 2006","review":"I do agree with all the other positive comments, and just need to add that this is the very first movie about the former GDR I saw that is not something like a comedy. Flicks like \"Sonnenallee\" or \"Good bye Lenin\" definitely were great and funny, but unconsciously left myself (a West German) with the impression that the GDR has been a sort of \"Mickey Mouse State\" full of stupid but charming characters, not really to be taken seriously. After seeing \"Das Leben der Anderen\" this impression shifted quite a bit: there actually was suffering, killing desperation and a terribly claustrophobic atmosphere behind that wall. This might well be the most realistic depiction of the dark side of the former East Germany. Thanks to the Producers, actors and director for making this movie. 10 out of 10.","user":"hareck","rank":[513,572]}]