[{"title":"A classic documentary film","rating":10,"date":"20 February 2020","review":"March of the Penguins a truly remarkable film. It is enchantingly moving and you must have a stone cold black heart to not enjoy this spectacle. Absolutely incredible, greatly emotional and a sincerely unfortuante true story turned into entertainment by cinematic geniuses.","user":"MR_Heraclius","rank":[36,37]},{"title":"Amazing","rating":10,"date":"13 June 2005","review":"I recently saw this film at the Waterfront Film Festival in Michigan and I can say it's one of the best documentaries I've ever seen.<br><br>Narrated by Morgan Freeman, it follows the annual journey that penguins and their mates endure to bring a newborn penguin into the world. This film has some of the most amazing footage I've ever see in a documentary ... including underwater footage beneath the ice of penguins feeding and being fed on. Footage so amazing that I heard one viewer saying how it must have been CGI as he left the venue.<br><br>If you have any interest in nature, penguins, or just want to see a touching story of the amazing journey that penguins make simply to perpetuate their breed, definitely check this film out in theatres. It's a masterpiece.","user":"uptown761","rank":[206,230]},{"title":"The Emperor's mating waltz in Antarctica","rating":8,"date":"29 June 2005","review":"\"The March of the Penguins\" has to be one of the most beautiful documentaries in recent memory. Luc Jacquet, its director, takes us on trip to Antarctica where we are introduced to the majestic Emperor penguins. Mr. Jacquet and his cinematographers, Laurent Chalet and Jerome Maison, have done the impossible task to capture these penguins in their own habitat under conditions that seem almost humanly impossible to live, let alone take this team to register it for us, the viewers in all its splendor and bleakness.<br><br>The Emperor penguins have to be the most elegant birds on this planet. They have such a noble way of standing and shuffling in almost perfect lines from the sea to the area where they will mate, hatch their eggs, and then have the females leave for the sea to feed themselves and bring back food for the new chicks. After that is accomplished, it's the males turn to do their march back to the sea to feed and fortify themselves, returning to the hatching and mating area. What makes these penguins so unique is the sense of family they project at all times. <br><br>Mr. Jacquet makes it clear for us to understand the behavior of the Emperors in their hostile environment. The English version has the clear narration by Morgan Freeman who expands on the way these birds live and how they are able to survive under extreme conditions. From what I have read about the documentary, the English version, which we are seeing in this country, has a musical score by Alex Wurman, that enhances the movie in unexpected ways.<br><br>Antarctica, that icy white vastness at the end of the world, has never looked more majestic than in this documentary. Thanks to Luc Jacquet we are enlightened by all what we learn about the Emperors as they endure and survive under the worst possible circumstances and remain the graceful figures they are. Watching \"The March of the Penguins\" feels, at times, like being at the ballet watching a magical dance performed by these flightless birds that manage to look so dignified all the time while doing for us their amazing dance of survival.","user":"jotix100","rank":[134,149]}]