[{"title":"Gleefully fun and thoroughly entertaining.","rating":7,"date":"23 February 2020","review":"'Wanted' is a film that's having too much fun not to like. Who cares about the impossibility of bullet bending when most audiences accept superheroes with inhuman powers and strengths based on comic book characters. As with those comic book films, it's just a work of fiction and fantasy, and since 'Wanted' doesn't take itself at all seriously, then you can suspend utter disbelief. The casting and performances are all spot on, above all James McAvoy who delivers one of his best performances in his career so far, even if the might not be the best film he's been in. Stylish, funny, competently directed and paced, this is a great action flick with an ordinary story that is more than the sum of its parts due to slick a execution.","user":"MR_Heraclius","rank":[37,40]},{"title":"As Dumb As It Gets","rating":28,"date":"28 June 2008","review":"The last line of this movie asks, \"What the f-word have you done lately?\" If you didn't immediately answer, \"I just spent two hours watching a really dumb movie\" then you must be an easily impressed video game enthusiast. Some interesting visuals aside, it's movies like this that give the term \"comic book movie\" a bad reputation. Unexplained gravity defying flipping cars, curving bullets and rat bombs just push the envelope too far in to the land of the absurd. The easily spotted plot turn does help but the rather uninspiring cartoon action just sinks it. Too many \"WTF?\" moments in both the action and the plot to enjoy this movie unless you really relate to a frustrated nobody stuck in a dead-end job and you want to fantasize about becoming an assassin. I can't figure out what was worse, the few Matrix type rip offs or the bizarre Rocky type killer training session? Also, how did they manage to make Angelina Jolie so unattractive? Not only does she look anorexic but add in the God awful tattoos and there is NOTHING sexually appealing about the character.<br><br>Ridiculous, un-inspired action mixed with possibly the dumbest plot of any movie this century means Wanted is one to avoid at all cost.","user":"SpanishRicky","rank":[364,584]},{"title":"Yawn...Sigh","rating":5,"date":"28 June 2008","review":"Like so many modern Hollywood moves \"wanted\" looks and sounds great but is a poorly conceived and written and is ultimately not a good movie. It's another in a long list of movies that is technically excellent but uninspired and unfulfilling.<br><br>What killed the film for me was that it was utterly ridiculous from top to bottom. From the opening scene you think you are watching something like the \"Matrix\" but the movie never gets around to explaining how these assassins attain superpowers. If I could train hard for a few months getting the sh*t beat out of me and bathing in krispy kreme sugar and somehow develop superpowers to defy all know laws of physics, I would get started right away. It wants to look and feel like reality, but unlike comic book movies like \"Ironman\", it asks you to swallow way more implausible nonsense than you may be able to stomach. In fact, \"Ironman\" looks like a documentary compared to this noisy, overdone \"rollercoaster\". I did not know going in that the movie was based on a comic about superheroes and supervillians. They should have committed more to that...there effort to make the movie \"real\" just made it a sloppy mess.<br><br>So it's a fantasy film that I found difficult to get into. The action is well done, the effects look great, but its another case where you are lucky not to have an epileptic fit by the first hour from all the flash cutting and gimmicks. Half the movie is in bullet time.<br><br>And then of course there is the loom, which is just a retarded concept and in the face of everything else, I found myself rolling my eyes. If they had spent half the time they spent on effects working on the story, we would all have been better off. <br><br>James McAvoy does his best with what he's given and its his performance that keeps the movie from slipping even further into the abyss. Jolie is always great but not given much to do here but look sexy...","user":"moreplease","rank":[262,423]}]