[{"title":"I have a cunning plan","rating":1,"date":"19 May 2007","review":"*** This comment may contain spoilers ***<br><br>This must be close to the plot synopsis:<br><br>Man: \"You know we're always saying we could use 50 million dollars?<br><br>Woman: \"Yes\" <br><br>Man: \"Well I have a cunning plan.\" <br><br>Woman: \"What's that then?\" <br><br>Man: \"First of all we need to find an aeronautics engineer working in a foreign country, with a child, and an encyclopedic knowledge of the layout of a particular long-haul plane.\" <br><br>Woman: \"Why's that?\" <br><br>Man: \"Well then, you see, we murder her spouse, in such a way as it looks like an accident.\" <br><br>Woman: \"What for?\" <br><br>Man (exasperated): \"Well then of course, we bribe the mortuary assistant at the hospital into letting us place explosives inside the casket.\" <br><br>Woman: \"But why?\" <br><br>Man: \"I'm coming to that. Then we wait until the woman decides to return the the U.S.\" <br><br>Woman: \"But what if she doesn't?\" <br><br>Man: \"She just will, okay? So anyway, when she decides to return home we find out what flight she's on. Hopefully she is not only placed on the type of plane of which she has encyclopedic knowledge, and flying with the airline of which you're a flight attendant, but also on the same flight as her dead husband's casket. Are you following?\" <br><br>Woman: \"I think so.\" <br><br>Man:\"Good, we're nearly there. Then all we need to do is falsify the checking-in information to remove all record of her daughter, make sure she gets on the plane half an hour before everybody else, ensure there is a row of empty seats behind her and get me on the flight, sitting nearby.\" <br><br>Woman: \"And then?\" <br><br>Man (laughing): \"Now this the cunning part. She takes the empty seats, allowing her daughter to sit in the aisle seat, then when she goes to sleep, all I have to do is steal a food trolley, stuff the daughter into it and hide her in the hold. Oh, and did I mention that we must ensure that nobody on the entire plane sees the daughter?\" <br><br>Woman: \"Isn't this getting a little far fetched?\" <br><br>Man (angry): \"What do'you mean? It's a great plan? All I have to do then is remove the child's boarding pass from wherever the mother is keeping it without waking her, assist her search for the missing child in the guise of an Air Marshal, convince the captain that the woman is mad and that the child died with her father (through a forged note from the mortician), and wait for the mother to escape from my custody. <br><br>Woman:\"Escape, why?\" <br><br>Man: \"Because the casket can only be unlocked by her, so once she's unlocked it I can set the timer on the explosives. From there we're home and dry. I merely have to recapture her, convince the captain that she's actually not mad but a hijacker who wants 50 million dollars and give the Captain our account number, asking him to ensure the money is paid straight in. Oh, Then we land, everybody gets off the plane, I shoot the mother and blow up the daughter and nobody is any the wiser. We walk away with a cool 50 million. Simple eh?\"<br><br>Never before have I wasted two hours of my life on quite such egregious nonsense.","user":"paulpensom","rank":[698,851]},{"title":"Is this the most convoluted plot ever?","rating":1,"date":"8 November 2005","review":"I think we have some sort of record. The steps needed for the criminals in this movie to succeed are:<br><br>1) Jodie deciding to go to the states on the same airplane as her dead husbands coffin. 2) An accomplice at the check-in who deletes any record of the daughters ticket. 3) that jodie chooses to be the first onboard - otherwise some of the other families with children might notice the child when she boards. 4) That the flight attendant doesn't notice the child when they board. 5) That the child stays hidden for three hours of flight. 6) That Jodie decides to sleep in the back of the plane with her child, so the kidnappers can whisk her away in the troll. Had Jodie and the child stayed in their seats, the kidnapping would have been impossible.<br><br>Improbable as this seems, the plot holes's just getting started. Now we need Jodie not just going amok, but escaping to do another feat: Remember how an airport security guy, at the beginning of the movie, tells Jodie she needs to lock the casket (with a code) for security reasons? (apparently, in this alternate reality, any coffin can get by airport security because 'coffins aren't x-rayed'). It seems the criminal actually needs to get hold of and move the explosives hidden in the coffin so he can blow up the child in the front of the plane (to cover the fact that she was onboard, i guess). So now the scheme of the criminals hinges on: 1) Jodie goes to the bathroom, crawls up a trap door, shortcircuits the lights, uses the confusion to get to the basement, opens the coffin, keeps the lid up and lets her self be caught.<br><br>I didn't understand this at first, thinking that the writers couldn't be that idiotic, but why else set up the idea of a digitally locked casket? She, it seems, has to open it! And when this setup is complete, the criminal only has to convince the captain that this crazy mother is a terrorist whos suddenly gotten hold of a detonator for a bomb.<br><br>I think the writing is, in many ways, intriguing. I fail to remember any movie with a plot quite so convoluted. Please respond if you can think of any.<br><br>Yours truly, Lars","user":"lars.dahlager","rank":[232,279]},{"title":"Flightplan Falls Apart","rating":6,"date":"11 October 2005","review":"Flightplan is a psychological thriller that takes place almost entirely on an air-born jumbo jet en route to New York, from Berlin. Jodie Foster plays Kyle, a mother who find that her daughter is missing after awaking from a nap. The jet also carries Kyle's husband, who recently died and rests in his casket in the cargo hold below. Kyle becomes increasingly frantic as she searches the plane for her daughter without success. The crew becomes adversarial, writing her off as a loony when they check the flight manifesto and find no record of her daughter ever being on board. Thus enters the psychological component of the film. Not only is the audience confused as to what has happened, but Kyle, after speaking with an on-board psychiatrist, also begins to have doubts about her own psychological stability in the wake of her husband's death. No one is sure what to believe, until a subtle clue jolts Foster back to reality, and back to her MacGuyver like maneuvers to attempt to recover her lost daughter.<br><br>It's an interesting premise, and oddly similar to Foster's previous film, Panic Room, in which her maternal character is forced into a confined space with no outlet. In keeping with most of Foster's performances, she plays a strong-willed, intelligent woman who overcomes difficult circumstances. As expected, Foster delivers, and pulls the audience into the story. I was disappointed, however. Foster has more to offer than Flightplan is capable of giving her. Flightplan, while entertaining, remains among those psychological-thrill-rides that are only as successful as their audience is unsuccessful in knowing the truth during the course of the film. To achieve this, the film has to throw a slew of false leads and suspicious looking characters into early shots in order to have the audience questioning.<br><br>I'm not fond of this technique. It's possible to keep the audience in suspense, and guessing without trickery. To me, this degrades the integrity of a storyline.<br><br>I was pulled in by the impressive marketing campaign of Flightplan and went to theaters excited. The film lived up to the aesthetic advertised -- a slick blue hue that reminds the audience of the snowfall in Berlin, the death of a husband and father, and the unfortunate and unforgiving circumstances that have befallen Kyle and her young daughter. And while this makes for a very sleek looking film, in the end, the fantastical, convoluted storyline cannot be realistically reconciled. I left the theater feeling somewhat cheated. While I realize it was a story and therefore ought to be granted a liberal amount of leniency when it comes to plausibility, Flightplan went to far outside the realm of conceivability. There were too many factors that had to conspire in favor of one person for the films storyline to hold together.<br><br>The real problem with Flightplan is that the more you think back, the more you become frustrated with how inconceivable the whole charade was; the more you become irritated with how often you were lead to wonder about something eventually irrelevant. There are some films that don't give you all the answers and pull you along on a suspenseful ride, and leave you feeling fulfilled when you finally figure everything out, and everything fits together. Flightplan concludes, you know the culprit, and then you think back, and nothing fits together.","user":"reesskennedy","rank":[259,326]}]