[{"title":"A good one for the whole family... Very creative!","rating":8,"date":"24 March 2008","review":"I went and saw this movie at the world premiere. I will start out by saying this... It is a very good for the whole family to enjoy.<br><br>Storyline: A girl and her father are on a remote island. They are the only ones who live their. The father is a research scientist who is interested in microscopic creatures. Nim, the daughter, is very much in touch with nature and enjoys reading the tales of Alex Rover, an adventurer. The author, Alexandra Rover, is agoraphobic and hasn't left her apartment in a very long time. Dad goes to sea, storm makes him stranded. Nim is stuck alone on the island and is contacted by Alexandra Rover, and calls for her help. Well, you will have to watch the rest to find out...<br><br>Pros: A great family movie. It has the perfect recipe of drama, comedy, suspense and a touch of romance. The acting is great. The scenery is beautiful. The special effects are magnificent. The story of a father and daughter living on a remote island is very creative and lends itself to a really great story, which is what this movie is.<br><br>Cons: Being a family movie, it is predictable. There are also plot elements which go no-where. One being there is a huge talk about Nim's mother at the beginning, but then it really doesn't go anywhere after that.<br><br>Summary: If you have kids, of any age, this is a good movie to go and see with them. If you don't have kids, but are looking for something different from the usual movies, this is still one to consider. All in all, a good story, well told and with great characters.","user":"gcoast-1","rank":[48,60]},{"title":"Great film","rating":7,"date":"31 March 2008","review":"While on holidays I managed to see this movie and I was pleasantly surprised. I have never liked Breslin but she is at her best in this movie and Jodie Foster will always be the magnificent Jodie Foster. Gerard Butler was also very funny and had me cracking up which is something a family movie has not made me do in a while. The story is good and witty and the movie is very family friendly. I think older teens would be bored because although I enjoyed it the story was a bit predictable at times. Overall I was very happy with the movie and would recommend it first and foremost as a family movies. Kids will love it and adults will be thoughtful enough to enjoy it.","user":"the-gossip-king","rank":[96,126]},{"title":"Lost Adventure","rating":5,"date":"5 September 2008","review":"'Nim's Island' is one of those films that had the potential to be a great adventure flick but, sadly, misses the mark. The screenplay is inconsistent and the script loses focus. Most of the characters aren't well developed, some are unnecessary and would have been better left out. While there are many plot holes, there are some unnecessary (and irritating, especially the sequences with the caricature bad guy visitors in the island) subplots. The entire film revolves around Nim being stranded on the island all by herself as her father is lost somewhere at sea and a 'borderline' agoraphobic Alexandra travelling to the island to rescue her. The climax is very disappointing. When one sees Nim and Alexandra meet for the first time, something big is expected but nothing like that happens. I would have much preferred that the film focus on Nim and Alexandra's adventure in the island and their attempt to rescue Jack but there's nothing like that. Moreover, the look of the film isn't that appealing. There are some nice glimpses of the island but the CGI is poor and use of green screen copy pasting is too obvious (due to poor lighting). I liked the animal characters but only the adorable sea lion looked realistic. Abigail Breslin and Gerard Butler are okay but they are mostly let down by the shoddy screenplay. However, Jodie Foster was amusing to watch. It's great to see her in a comedic performance and she carries off the eccentric Alex's 'borderline' agoraphobia and determination to save Nim with comic flair. It is her scenes that save 'Nim's Island' from being a total disaster. The film ends on a note that there might be a sequel. If there is, well I hope it has much more to offer.","user":"Chrysanthepop","rank":[19,23]}]