[{"title":"A great American musical....","rating":9,"date":"30 November 2006","review":"Screened overnite in Australia for critics and industry.<br><br>Ten minutes into director Bill Condon's adaptation of the hit musical, I whispered to my friend \"There's no way the film can go at this pace for two hours!\" Because up to that point, we had been utterly dazzled by breathtaking staging, impassioned performances and a display of film-making craftsmanship in all its forms (direction, editing, design) that had the packed audience stunned.<br><br>Well, two hours later, I'd been proved wrong. Condon has created a vivid, emotional spectacle that will dominate the 06/07 Oscar nominations. Dreamgirls is one of the five best movie musicals ever made.<br><br>There is really nothing new about the storyline - smalltown singers make it big and ride the roller-coaster of fame. But thats what works so well for the film - the great cinematic clichés are embraced and played to the hilt by a creative team, both behind and in front of the camera, that knows what makes a great Hollywood musical.<br><br>There's not one weak link in the cast. Condon's camera is in love with Beyonce Knowles and she handles the journey from the innocence of the groups early years to the staggering success and fortune of the group at its peak with surprising range. While most singer/actress attempts are failures (Madonna, Whitney, Britney, k.d. lang), Beyonce proves to have genuine talent.<br><br>Jamie Foxx centres and grounds the film in a less-flashy role but one that is crucial to the films credibility.<br><br>But there are two standouts. Eddie Murphy as fading star Early has never done better work. And Jennifer Hudson delivers an absolute tour-de-force performance in a role that sees her dominate every scene she is in. Her belting solo number was applauded by the audience (a rare enough occurrence during an industry screening but a moment that was repeated a few times thru the film). Hudson is a lock for the supporting actress Oscar, even this far from the ceremony.<br><br>Dreamgirls is a better movie in every way than recent award winning musicals Chicago and Moulin Rouge (both of which I am a huge fan). It is a film that tells a classic rags-to-riches story utilising great cinematic technique and bravado. 2006 has offered up some great movie-going experiences for me (Thank You For Smoking, Children Of Men, V For Vendetta, Little Miss Sunshine); for the sheer cinematic thrill it provides, however, Dreamgirls proves to be the best two hours I've spent in a cinema this year.","user":"Screen-Space","rank":[202,306]},{"title":"Belting Up The Old Story","rating":9,"date":"6 February 2007","review":"The legendary Broadway musical hit the screen, resurrecting the thrill of the original. That, in itself, is a miracle. I suspect that the miracle worker is Bill Condon. The story is told as if it revealed something we've never seen before and his winning innocence triumphs. The casting of Eddie Murphy was a stroke of genius. He unfolds a new inedited face and I predict a new career. The predictability of the tale becomes rewarding rather than annoying and I was surprised and moved all the way through. Jammie Foxx's unsympathetic turn manages to deliver a punch of humanity. Byonce Knowles, Danny Glover and the rest of the cast are a perfect foil for Jennifer Hudson's Cinderella Story. Bravo Mr Condon!","user":"littlemartinarocena","rank":[79,119]},{"title":"A Triumph!!","rating":9,"date":"27 November 2006","review":"What a spectacular movie musical experience! This is one worth waiting in line, if not purchasing advance tickets for. Beautifully realized by writer-director Bill Condon, 'Dreamgirls' brings back thoughts of a few years ago when the movie musical version of 'Chicago' knocked our socks off, and (with the help of the gorgeous 'Moulin Rouge') helped to revive the modern movie musical. The sets, costumes, musical numbers all flow beautifully and make for an incredibly affecting motion picture.<br><br>As amazing and eye-popping as all of the scene work and musical numbers are, this is, ultimately, a movie rooted in its performances. Jamie Foxx gives further credence to his stature as an incredibly talented musician, and Beyonce Knowles (known for her vocal talents) still manages to impress with her songs and her voice. Not to mention her stunning beauty, as each costume and scene in which she appears seem to top one another in terms of showcasing her incredible beauty. Eddie Murphy blew me away with not only his truly heartfelt performance as Jimmy Early, but his amazing voice and showmanship. What a talent! Anika Noni Rose, who I fell in love with on Broadway in 'Caroline, or Change,' gives her performance as Laurelle soul and a deep, rich vocal styling. But let's face it..we are all going into 'Dreamgirls' wondering if 'American Idol' contestant Jennifer Hudson can pull it off. She has quite a bit to live up to, as Jennifer Holliday's performance as Effie White in the original Broadway production is legendary. Add to that the fact that this is Ms. Hudson movie debut, she must have been feeling a huge weight on her shoulders to do the part, as well as the show, justice. If she isn't able to do anything less than nail the part of Effie, as well as her signature song, 'And I am Telling You,' the whole production, no matter how great the other aspects hold up, runs the risk of crashing loudly. The question on everyone's mind is: Can she do it? <br><br>Let me just say this... I have never sat in a theater watching a musical where the audience erupted in applause like they would in a Broadway theater after a performer's song. Everyone (and I mean everyone!) was wildly applauding when she struck her last note in 'And I am Telling You.' It was such an intense experience to be a part of. I mean...as I am writing this, I am getting goose bumps. But not only is her singing tremendously effective, but her actual performance is just as good. She brings a vulnerability and an innocence that perhaps would not have come through had the part been given to a more experienced movie performer. Ms. Hudson is nothing short of breathtaking and, even if you are not crazy about the rest of the picture (doubtful), you will almost certainly be amazed by her talent. Just remarkable. This has to be one of the most impressive motion picture debuts in the history of cinema. Even during the closing \"curtain call,\" when Jennifer Hudson's name was shown, there was, again, wild applause. A star has been born!!!","user":"nibbly","rank":[167,264]}]