[{"title":"beauty in the age of cynicism","rating":10,"date":"3 May 2006","review":"It has been a long time since I have seen a movie with as much integrity and honesty. As the writer so aptly states in the opening of the movie: this is a movie for romantics not critics.<br><br>When I hear someone trash a film or is angry about something the first question I ask is \"what are they afraid of?\". It IS easy to be cavalier and self serving. It is much more difficult to truly speak from the heart.<br><br>The characters are real...the performances excellent. The script is brilliant. There are so many gems...words of wisdom that it is hard to remember them all.<br><br>What I like most about this movie is that it is completely unapologetic. It takes courage to let it all hang out. <br><br>Perhaps if our culture was more in tune with nature and less about cynicism and ego we would all be better off.<br><br>I would highly recommend this movie to everyone.","user":"chris-1487","rank":[41,44]},{"title":"Big Yes!","rating":10,"date":"7 May 2006","review":"These days we have movies that hurl us into outer space, throw us into life threatening situations laden with violence and hysteria, or filled with so many amazing special effects that one cannot tell what is real and what is not. George Gallo's newest film, LOCAL COLOR offers none of the above. Not that I don't love the Wachowski Brothers or enjoy peaking into the twisted, creative mind of Quentin Tarantino. I do. But for countless reasons having to do with the state of the world today, I think that most of us long for this kind of \"entertainment\". The kind that serves to connect us to our humanity and give us hope. I love this movie. The acting is stellar, the story is compelling and inspiring. The cinematography is nothing short of spectacular. I was able to see the world through a true artists eye. It made me understand the level of passion and tenaciousness it takes to reach that level. Some might say that the film is too sentimental, others might say it is self-indulgent or egocentric, but I disagree. I feel that the tale was told with hat in hand that it will serve to inspire anyone who is open to the message it delivers. It is a movie about achievement attained by following one's passion, not by selling ones soul.","user":"JLurieDesign","rank":[33,35]},{"title":"A masterpiece","rating":10,"date":"4 May 2006","review":"I attended the World Premiere of Local Color Saturday night at the Tribeca Film Festival, and I was filled with a sense of peace and warmth as I left the theater. This really is a \"feel good\" film. <br><br>Nicoli Seroff is an aging, jaded former Russian painter. His would-be protégé is John Talia Jr., a young artist with the headlong enthusiasm of youth. Writer/director George Gallo's tale is is nothing short of a beautiful work of art, much like those which populate the film.<br><br>Ray Liotta: As John Sr., the always dependable Liotta shines in this role as the macho \"man's man\" to his son's budding art ambitions. The interactions between the two are painful if not comical. Even today (the film is set in 1974) how many fathers would lovingly encourage their teenage sons to be painters? Not unless the walls need to be redone, of course. But in a role that could have easily been stereotypical, Liotta adds nuance and texture to his performance with which a less experienced actor would have struggled.<br><br>Samantha Mathis: Perhaps Seroff's final muse as he heads into his last days, Mathis' Carla is full of life yet strains under the weight of pain only she understands. Now Talia enters their lives  who will best soothe her in her quiet anguish, or more appropriately, which artist will most find comfort in her presence? Will she be the fulcrum who balances Nicoli and John? Or will she tear them apart? Mathis takes on this enigmatic role with steady, understated strength and is simply angelic.<br><br>Ron Perlman: This veteran character actor may be one of our most underrated performers of the last 25 years. That he was chosen for the role of Curtis Sunday is a stroke of casting brilliance. Sometimes Seroff's lone supporter, sometimes his fiercest nemesis, Sunday provides the film's comic relief as a self-professed modernist who claims to be at the cutting edge of art while thumbing his stuck up nose at tradition. Effete and obnoxious, Perlman's Sunday manages to elicit some empathy in the face of the stubborn, equally opinionated Seroff. I cried with laughter at what may be one of the finest scenes in any film this year. You'll know it when you see it. Perlman is superb.<br><br>Armin Mueller-Stahl: I'm not one for hyperbole, but I truly believe Mueller-Stahl would be astounding in any role he chooses. In this case, as mentor to the young Talia, he is truly being himself  a legendary artist who has been there, done that. In this case, though, he is the reluctant teacher to Trevor Morgan's John. His is the face of wisdom drawn from a lifetime of determination, success, and failure. His is the mind of one who simply wants to live out his last days in a bottle of vodka. And it is left to John Talia to break that bottle, or at least to see Seroff through the glass, and vice-versa. Such is the stuff of great film, and here the brilliant direction of George Gallo is evident  he doesn't \"direct\" as much as he lets go. Mueller-Stahl inhabits this character like hand in glove, at times heartbreaking, at others raucous with laughter, his Seroff is the teacher we all dream of  or is he? Will John be up to the task of coaxing the long dormant talents of the Russian painter to wake up just long enough to inspire the young man to pursue his dreams? Mueller-Stahl is a delight, and deserves great notice for his performance as Nicoli Seroff.<br><br>Trevor Morgan: The impact of this film rests largely on the shoulders of Morgan's performance as the young John Talia Jr., whose story is based on the writer's own experiences as a young struggling artist in an art world that is quite unfriendly to contrarians. To play the protagonist in a film which is set in a world somewhat foreign to most is daunting in itself. Morgan not only succeeds but wins the hearts of the audience from the moment he appears on screen. The camera loves him, and in a role that requires as much to be said in a look or a gesture as words on a page, Morgan is an inspired choice. His are the eyes of youth, of sadness and hope, of loneliness and desire, and this is the stuff of which great performances are made. We believe Morgan is John, but more importantly, John is everyboy. This isn't just a tale of a youth yearning for acceptance in an art world in which his chosen genre is passé. After all, what teen hasn't sought approval, somewhere, sometime, in any setting? We all identify with John because we all were John. Who will listen to me? Will my dad support my hopes and desires? Will I find anyone to help me achieve my goals and dreams? This is classic material, and Morgan's performance is gut wrenching and joyful all at once. I was on the verge of tears for so long that when they finally did flow it was cathartic. That Morgan is still a teenager himself on whose performance this film succeeds or fails bodes well for this young man's career. He is frighteningly endearing, and one is left with a sense of wonder at what he has accomplished here. Expect great things from Trevor Morgan.<br><br>Visually and aurally stunning, the sweeping landscapes of the Pennsylvania woodlands (portrayed excellently by Louisiana) are photographed in loving detail by Michael Negrin, and the score by Chris Boardman is simply breathtaking. This is one soundtrack you'll want to own. The music tugs at your heart without being heavy-handed, which might have been the case in lesser talented hands.<br><br>Local Color is a masterful work of art, much like the subject of its story, and the artist George Gallo deserves nothing less than the boundless appreciation of the theater-going public. I certainly give him that.","user":"larry-411","rank":[35,38]}]