[{"title":"Finally, a romantic comedy I can pay full admission for and not regret it later","rating":9,"date":"13 February 2006","review":"For about five years or better yet since I've been married, I have banned all modern day romantic comedies from my precious eyesight. Why you say? Because nine times out of ten they featured awkward pairings of big-name stars who had as much chemistry as a week old can of generic pop that was left in the refrigerator open, the plots were so insultingly predictable that you just wanted to take out a bull horn in Hollywood and yell to screenwriters and movie studios everywhere: \"STOP INSULTING US BY RELYING ON YOUR FORMULAS TO MAKE YOUR MOVIES.\" Honestly, if I see one more chase scene to the airport to stop some chick from moving away, I'm going to blow something up, and finally romantic comedies were just plain unrealistic. I mean honestly, how many of us can believe that Jennifer Lopez, Diane Lane, and Julia Roberts are dateless. And how many women are really knocking down John Cusak's door to get a date? However, alas comes a true romantic comedy with depth, conviction, and heart. And while it did use a few formulas it did not depend on them. \"Something New\" features very real people, real responses, real dialogue, and most importantly real issues. I champion this movie for being groundbreaking and discussing things that no other (or few) mainstream film had the balls to tackle such as \"The Black Tax,\" the true difference between racism and reverse racism, and Black hair culture to name a few. Don't get me wrong, THIS MOVIE IS NOT A BLACK MOVIE. It is definitely romantic and comedic at its very heart and it is something that can be appreciated by all. But I felt so much better about seeing this film when I realized that it took the time to think and bring some things to the forefront. I hate the fact that this movie was not marketed properly. What a misstep. This movie was for all because we have all had to grapple with pressures from our family, our careers, friends, and culture at one point or another and realize that being true to yourself is all that matters. Oh and by the way, the chemistry between Sanaa Lathan and Simon Baker is phenomenal! I haven't seen chemistry like that in a long, long time. The movie is worth the trip just to see that.","user":"dawnwashington","rank":[143,157]},{"title":"I absolutely loved it!","rating":10,"date":"14 February 2006","review":"I am 51, single, and a black woman. I have seen this movie twice, once with my youngest single sister and the second time with another younger single sister. I paid full price each time and will see it for a third time with a married girlfriend. I like the subject matter and say it is about time, not just for the subject, but also that it did not portray us black sisters in a derogatory light. We can be more than hookers and gangsters and maids on the big screen. My sisters and I identify with Kenya and unfortunately, we are all in that percentage class of the unmarrieds.<br><br>It reminds me of the classic \"Guess Who Is Coming to Dinner\". I loved that movie too. It broke barriers. There are more relationships going on like this than we care to admit. My sisters and I would date a white man in a minute, if it was meant to be. Race isn't a preference. If we could each find one good man, he could be green and we would date him.<br><br>At the second showing, some in the audience clapped at the end, and we lingered for sometime afterwards and read all the credits. We really liked it and so much of it was true. The soundtrack is beautiful. I can't wait for the DVD and the CD soundtrack to be released. I fell \"in love\" with this movie. Love is more than color. The only thing that would have made me more love sick is if Brian was played by the hot and cute flavor of the day Matthew McConaughey!! I said it, yes I did!<br><br>Additional comment: Okay, I saw this movie for the third time and paid full price cause I loved it. It saddens me that this movie is not getting the PR it deserves. It's a hot topic, especially since it deals with us being seriously involved with a white man. The brothers have been doing this for years, yes years! Sisters, I say allow yourself to flip the script.","user":"rutalkenme","rank":[131,150]},{"title":"This movie was on point","rating":8,"date":"3 February 2006","review":"Geesehoward, to clarify something in your post: Sanaa's lover did not \"assume\" that she had a weave. It was after a night of lovemaking that he asked her about it as they lay in bed the next morning. I'm sure he was trying to run his fingers through her hair and found he was unable to.<br><br>I am a black woman who is married to a white man. I read the interview with Sanaa where she talked about living in Harlem and being terrified of holding his hand because she was afraid of the judgment. I felt as though she was writing my life story. Before we got married, my then boyfriend lived in Soho and I in Harlem. Walking around together in lower Manhattan, we got a few looks, but nothing even remotely close to the venom that was spit at us when we were together up in my neighborhood. People would stop dead in their tracks, hands on hips and say horrible things to us! And this is in the 21st Century! There were times I would actively dissuade my husband from showing me any affection in a Black environment because I didn't want the brothers to take it the wrong way and think it was an overt slap in their face-- you know, white man comes up in to the Black neighborhood to claim the Black woman while the Black man stands idly by. But after a time, I got over it. My man was just trying to love me. He was willing to take all the insults and stand by me and allow me to open myself up and let him in, so to speak. And I am so glad I did. I have been fortunate in having had positive relationships with all of the men I have dated seriously (who btw, were all Black). They all brought something special to the table. My husband just happened to come into my life at the right time when I was opening up to the idea of trying \"something new\". I have learned a lot from him, but he has also learned a lot from me. I think this movie did SO much in the way of allowing people to get a little more used to the idea that love comes in all shapes sizes and colors, and that it also comes with problems, depending on the type of relationship. Interracial relationships are going to always have family and societal disapproval, but guess what, everyone comes around eventually once they realized that it's not superficial, that there's true, honest love there. This is because people are just people, and if someone takes the time to get to know you, you discover all the things you have in common that have nothing to do with skin color. The moral of this extended post is this: After we had been dating for some time, my husband moved up to Harlem. Before you knew it, he was friends with everybody on the block and knew more people in my neighborhood than I did. That's because people are just afraid of what they don't know. Yes there is a lot of historical baggage attached to race in this country, but we can't keep schleping it around with us all the time, we've got to let it go, let it flow. I encourage all of you to see the movie. It was your typical predictable rom com, yes, where everything works out okay in the end, but it also has a lot to recommend it. I thought it was on point and funny and sad and all that good stuff. Go see it! (Plus it's the first studio film that's written, directed, produced and starred in by Black women!) You go ladies!","user":"karlenerogers","rank":[203,240]}]