[{"title":"Lugubrious Hybrid of the Food Network and Lifetime Makes for an Attractive But Bland Movie","rating":6,"date":"14 September 2008","review":"Despite what I recall of the advertising campaign last year, this soft-hearted 2007 film is far less a Food Network-derived romantic comedy than a Lifetime-oriented drama about grief and work/life balance. Directed by Scott Hicks (\"Shine\") and written by first-timer Carol Fuchs, this film offers the most insightful peek into the workings of an upscale Manhattan restaurant since 2000's \"Dinner Rush\" (i.e., if you don't count last year's CGI-generated, French food-fest, \"Ratatouille\"), but it also seems intent in splintering the story between the romantic sparks between the co-stars and the unexpected relationship that a single aunt forms with her orphaned niece. The result is heartwarming but rather diluted considering the potential inherent in the material presented. Hicks and Fuchs also seem intent on inserting predictable clichés along the way to reinforce the formulaic approach taken with the story.<br><br>Basically a remake of the 2001 German comedy, \"Mostly Martha\", the plot centers on perfectionist chef Kate who runs a tightly efficient kitchen in a chic SoHo bistro. As a resolute overachiever, she is able to get up before dawn to get to the fish market and stay late at the restaurant making her impeccably presented dishes until closing. So tightly wound is Kate that restaurant owner Paula forces her to see a therapist to address her supposedly difficult personality. This is the first of several disconnects I had with the film as Kate strikes me as demanding but not particularly abusive to her staff. Regardless, her life is turned upside down by the sudden death of her sister and the addition of her niece Zoe to her structured life. As if that wasn't enough, Paula has hired Nick, a rowdy opera-loving sous-chef, to partner with Kate as she struggles with her personal transition at home. Taking a number from the Tracy-Hepburn manual for romantic comedy, tempers flare as do sparks. Zoe's recovery from her mother's death becomes a complicating factor, but the rest of the story plays out basically how you would presume.<br><br>More interesting in edgier, less sympathetic roles, Catherine Zeta-Jones plays the icier aspects of her role well, but she is markedly less arresting when her character turns warm and gooey. The script also doesn't really respect her character much since she is made to look overly foolish and insensitive in her early scenes as a struggling mother figure. Aaron Eckhart seems to be playing more of a plot device as Nick, but he does it well, and the requisite sparks occur with Zeta-Jones. Cornering the market on playing put-upon children, Abigail Breslin is fine as Zoe, even though she has to be glumly depressed for much of the film. The usually more dimensional Patricia Clarkson plays Paula as a surprisingly brittle, opportunistic character, while Bob Balaban isn't given much to do at all as Kate's therapist but act as a bromide. Stuart Dryburgh's autumnal cinematography makes all the food look good, the stars as well, and minimalist composer Philip Glass, of all people, provided the unobtrusive soundtrack dominated by Puccini, Verdi, and Flotow arias. The most significant bonus item on the 2008 DVD is a twenty-minute episode of the Food Network's \"Unwrapped\" which includes interviews with the film's stars and the real chefs who concocted the dishes in the movie.","user":"EUyeshima","rank":[20,22]},{"title":"No Reservations About \"No Reservations\"","rating":8,"date":"9 August 2007","review":"\"No Reservations\" is not a great film, nor does it pretend to be. It is very predictable and follows the formula used in countless other movies. Despite that, it give you everything you want from this type of film and is better than many of the sequels that have come out this year.<br><br>Catherine Zeta Jones is as beautiful as ever. There is a nice dose of Verdi and Puccini opera arias, and Abigail Breslin steals the film like she did with \"Little Miss Sunshine.\" I have not liked Aaron Eckert in the past, but in this film he brings happiness to the otherwise dour Zeta Jones.<br><br>Some of the professional critics said they like the original German film \"Mostly Martha\" better, but I thought that \"No reservations\" improved on the original in every possible way. The only valid criticism I could find was that Catherine Zeta Jones is too beautiful to be believable as a lonely chef. That is a flaw I can live with.<br><br>If you are looking for a break from the so-called Summer \"action\" films, \"No Reservations\" is not very original, but it certainly fits the bill. The only drawback is that you will definitely leave the theater feeling really hungry for good food.","user":"brenttraft","rank":[86,110]},{"title":"Go and see the original \"Bella Martha\"","rating":3,"date":"30 July 2007","review":"Go to the video store and get the original. I do not understand why Hollywood has that need to take a perfect foreign movie and remake it. \"Mostly Martha\" or \"Bella Martha\" has a much better cast. Beginning with the heroine Martina Gedeck, who convinced me much more in the role of the work-obsessed perfectionist than the more famous Catherine Zeta Jones, to the Italian cook and the niece suddenly deprived of her mother and forced to live with an aunt, not fit for child-rearing. <br><br>In many ways, the American version of the movie is a copy of the German original. They just exchanged the actors. However, they also changed the story because it would have been difficult and not very believable to materialize a father for the little girl in an American context. <br><br>I was thinking about that. Maybe the father could have been Puerto Rican, or Cuban, or Mexican. Well, there are so many \"guest workers\" in the U.S. Take your pick. But I doubt that any of them would have shown up to shoulder the responsibility as the Italian father did in the original. Therefore, the American movie leaves that part out but keeps the Italian cook. And by doing this the whole story changes. In the original \"Martha\" is so removed from reality that she thinks it is okay to send her niece off with a complete stranger in a foreign country. <br><br>The American \"Martha\" is softer and therefore the movie is sweeter and does not have that edge the German movie has. <br><br>In the original the \"Italian\" cook is not so good looking but much more charming , the little girl is more of a brat but much more believable and \"Martha\" is more representative of a career woman in today's world than the watered down version we are presented in the American version. And the whole opera music in the American version was very annoying. I loved the Italian songs in the original and bought the CD. <br><br>Hollywood recognized that \"Mostly Martha\" was a great movie. Maybe the distribution companies should have put it in more theaters or it should have been shown in English without subtitles. In any case, the original is so much better. By the way this reminds me of another remake. \"Shall we dance\" is one of my favorites in the original Japanese version and totally forgettable in the American version.","user":"pefrss","rank":[43,55]}]