[{"title":"A sweet little masterpiece","rating":10,"date":"20 September 2006","review":"I attended the world premiere of \"Cashback\" at the Toronto International Film Festival. I walked out in a daze. I had a feeling I'd seen something special, that moment when you have to pause to take a breath and reflect on what you've experienced. I still had about 20 films to go at the time, and \"Cashback\" raised the bar and became the benchmark against which all the others would have to be compared. As it turned out, nothing came close. Of the 30 plus films I saw that week, \"Cashback\" tops the list.<br><br>Literally built around the short film of the same name which screened at festivals in 2004, triple threat writer/director/producer Sean Ellis did something ingenious. Rather than take his 20 minute piece and expand it to fill 90 minutes, he created a new Act One and Act Three to bookend a reworking of the original short in the center. And he pulled it off with a tour de force of light and sound. The result is an eerie, compelling twist on the classic Outer Limits episode where time stops while the protagonist weaves in and out of the frozen characters in another dimension. It may sound like sci-fi, but this is a sweet romantic comedy whose storyline is among the most original I've ever seen on screen. The concept is brilliant and the result magnificent.<br><br>The look is lush, cinematography by Angus Hudson breathtaking, and \"Cashback\" features an appropriately sweet score. They combine to give this low budget project a big movie feel, destined for the wide audience it deserves.<br><br>Most of all, I believe \"Cashback\" is the vehicle which will introduce newcomer Sean Biggerstaff (Oliver Wood of \"Harry Potter\") to the world. His star tun in this film as protagonist Ben Willis left me speechless. The camera loves him, and he is on screen virtually from opening to closing credits. This film is his to make or break. It rests on his shoulders, and he owns the material.<br><br>As they say, you'll laugh, you'll cry, and I walked out with a tear in my eye and a smile on my face. And no other film I saw at the Toronto Film Festival did that to me. \"Cashback\" is a sweet little masterpiece.","user":"larry-411","rank":[292,363]},{"title":"To see beauty in everything","rating":9,"date":"25 January 2007","review":"A guy and his girl break up. Painfully. As a result of this the guy becomes an insomniac and suddenly finds himself with 8 more hours in the day. 8 more hours in which he feels the pain of love gone sour. 8 more hours to be bored and restless. He decides to make the best of it and starts working the night shift in a supermarket where he is met with a new kind of boredom and several people that deal with that boredom in different ways. Himself adding yet another way of dealing with that boredom. He imagines he can stop time. What follows is best seen instead of read about.<br><br>This film is filled to the rim with the most beautiful stills, completed with several speeds of motion and feels right. Right in an artistically way. It is like watching a painting being painted,, like watching a poem being written, like listening to a song being composed. And at the end it all adds up and the completed picture is seen in all its beauty. All in all a really nicely designed film that belongs in the small theaters and in the art-houses.<br><br>Next to that it is fun to watch. The adventures of the guy are interesting to follow, even though they aren't all that different from what most people go through at one or other stage of life. Music choice was very fitting and acting was good enough not to be falling out of place with the rest. So, all in all, a very pleasurable watch and something I can recommend to anyone.<br><br>9 out of 10 sketches sketched","user":"LazySod","rank":[119,151]},{"title":"\"You just have to see that love is wrapped in beauty and hidden away in between the seconds of your life. If you don't stop for a minute, you might miss it\"","rating":10,"date":"28 May 2007","review":"You find the most beautiful films when you least expect it. Yesterday I went to the Sneak Preview in the local cinema and I came out happier then I've been in weeks. Cashback is an odd combination of teen comedy and romance and the best thing is that it works! The story involves around Ben, an art student. He just had a rough (literally and figurative) break-up with Suzy. Ben has problems to forget Suzy. He can't sleep anymore and is emotionally broken. To speed up the eight hours he used to sleep, he starts working night shifts at Sainsbury's. The film follows Ben's process of dealing with his broken heart, while he is working with his silly colleagues.<br><br>Effectively the film also tells the story about Ben's past which shows how his fascination with the female body began and how those things formed the way he thinks about things now. While working in the supermarket he likes to freeze time, to capture the beauty of little things, and to draw pictures of the (naked) female customers.<br><br>This film is not about sex and teen jokes as some people probably will say. It is about having a broken heart, finding new love, finding someone that is the perfect other half of you. It is about beauty. The scenes where everything but Ben is frozen and he walks around the store drawing the portraits of the women just strike the right chord. Sean Ellis did a great job to make those scenes look that perfect. It's his ode to the female body.<br><br>All I can say is that everybody should go and see this film. It's the best thing I've seen in a long, long time.","user":"volkstuintje","rank":[151,194]}]