[{"title":"I know I am in the minority here, but I enjoyed it","rating":8,"date":"22 July 2006","review":"First off, I can see why this film is going to be a box-office flop and why critics and audiences alike will not like it. I, who usually disagrees with most audiences, at least, thoroughly enjoyed this film. The storyline itself is rather ridiculous, I must say. Some girl shows up in a pool? She's a what-a narf? I went into the movie thinking I would hate it, but I came out knowing that I had seen a work of art. That's right. It was art.<br><br>First of all, it's a good family film, with enough tense moments to keep you watching, and enough laugh-out-loud moments to calm you down. It was refreshing for once to see a film with good, clean humour. The dialogue was not necessarily hilarious, but the actors, especially Paul Giamatti (Cleveland) delivered the lines extremely well.<br><br>The acting was tremendously well done also. Paul Giamatti is always fantastic, and while Bryce Dallas Howard seemed to act in the same manner as she did in The Village, she was still convincing. The ensemble cast worked well together. Some might bash M. Night for casting himself in a not-so-cameo role, but he proved that he can actually act! No, his performance will not win him an Oscar, nor should it, but I think there is definite talent there. I hope to see him in bigger roles, in films not his own.<br><br>The plot had many twists, maybe too many, but no matter. I kept trying to guess what was going to happen, but it I was always wrong. It was quite interesting.<br><br>What most made this film a work of art was the directing. M. Night has a rare talent that will go completely under the radar for this film because no one will see it. The camera angles were inventive-that's right, inventive. I may be one of the few who actually cares about camera angles and how a scene looks, but it looked great. The final product was polished.<br><br>I truly believe this film is M. Night's best work. He made the story up himself, wrote a screenplay that made us laugh, smile, cringe, and jump just a little, and directed a great ensemble cast including himself. Quite a feat. <br><br>So before everyone starts ranting about how stupid the storyline is or how \"so-not-scary\" the film is, just appreciate the uniqueness of the film, and remember what makes this film good. Forget the crazy story. It's everything else!","user":"the_scandal_cha","rank":[608,826]},{"title":"Refreshing original...","rating":10,"date":"15 January 2019","review":"This is a highly missunderstood masterpiece. One of a kind movie among Night.s creation. One that requires patience and full attention. Unique(still in 2019) script, unique development of the story, well penciled and motivated charaters.\nAllow it to get under your skin.\nOne a of kind fantasy story.","user":"ciubotaruoa","rank":[23,27]},{"title":"Lady In The Water - A True Bedtime Story","rating":8,"date":"17 July 2006","review":"Bottom line: Phili must be a crazy place to live.<br><br>I walk into every M. Night film knowing, good or bad, I am going to see a picture that is imaginative, original, and full of hope. This is one of very few writer/directors who actually strive to bring something new to the cinema on each different outing.<br><br>So, how was the film? Good. Dare I say, great? If you like his films, this one will definitely hit you deep. You'll put it at the top of your \"M. Night List\", and be glad to have it in your DVD collection later this year.<br><br>First, the acting. We all know Night has a habit of picking actors from the same pool. People he knows, trusts, and has worked with before. Willis has helmed two of his films, while Joaquin another two. This will be Bryce Dallas Howards second as well. We are used to Night writing his lead characters as more of a shadow of a man that once was. A tragic figure; this is no different in \"Lady In The Water\".<br><br>Giamatti plays Heep very, very well. But, because of Giamatti's inclusion into Nights' world, we see things much lighter. Willis, Gibson, and Phoenix had a habit of turning everything dark and dreary. And while Giamatti is still a tragic figure, he is eager to believe and more than willing to take the word of a half naked girl in his home. I, personally, believe that he is the greatest actor Night has worked with. And the result? A much lighter film. Thank God.<br><br>This is a fantasy. Not a horror, not a film with a twist (spoiler: there is none), which is good, because a twist would have put Night into an early grave. As a fantasy, a bed time story, Night treats us like children. Characters speak their inner dialogues, creatures with interesting names plague us at every turn, and the residents of this apartment complex are as interesting and comic as they are important.<br><br>There is still the important Night message: Purpose. We all have one. We all are meant to be somebody. Now, all we have to do is figure that out.<br><br>Even the intro reads like a children's' book; illustrations dance about in order to create a younger element to this tale.<br><br>The plot is simple. Nymphs, beasts, guilds, healers, etc. Almost like a role-playing video game in a sense.<br><br>The music and cinematography? Night kept his all-star team, and the project was helmed and sculpted beautifully.<br><br>The faults? I dare say Night could have done with less characters. They all seemed important, but it crowded the screen, and left us with a question: Is this that persons' only purpose? That's sad.<br><br>But, have fun with this film. It's a treat, as rare as Nights' films are.<br><br>Night brings a world of reality into a world of dreams, and the saddest point of the film, was when we had to wake up.","user":"banksj","rank":[319,486]}]