[{"title":"Next","rating":6,"date":"5 March 2020","review":"A film where someone can see 2 minutes into the future was always going to be difficult to understand and in a way it was but it was different, Nothing like we thought it would be it had some good action scenes, As much as the ending annoyed me it fit into the film nicely, Nic Cage was good but I think someone like Tom Cruise would of played it better (No offence Nic) It does leave you trying to work things out in your head and they used his future gift to put in some shock tactics and it all worked, It's by no means a classic but it's as good as it was ever going to be, Even with some cheap effects in places.","user":"MR_Heraclius","rank":[38,41]},{"title":"Far more than I expected","rating":5,"date":"5 May 2007","review":"Next is a much better movie than I expected to see, having read some of the reviews which called it disjointed and silly. Quite to the contrary, I found it deeply absorbing. I quickly picked up on the elements which must have caused some reviewers to accuse it of being disjointed, and began enjoying them. Of course silliness is part of any sci-fi story, we suspend our critical senses in that regard or we do not become sci-fi fans.<br><br>I single out one performer among a fine cast. Julianne Moore has really established herself as *the* deadpan action queen. She was a better Agent Starling than Jody Foster was, and she's a terrific, dominant presence in this film. Kudos to her for propelling herself to the top of a tough genre. She makes films more interesting to watch, by dint of her strong performances.<br><br>I read Phillip K. Dick's \"The Golden Man\" many years ago and still remember a lot of it. When I first began hearing about this movie I immediately flashed to it and wondered if this was a movie of that intriguing story. The answers are \"yes\" and \"no.\" \"The Golden Man\" is a much more ordinary story, but with resounding insights on the consequences of his existence. And his skin was a compellingly attractive rich golden hue, which helped make him irresistible to women. None of that fits this new story, and was properly omitted.<br><br>What is translated so well from the written page to the screen is the government's intense interest in him (although for different reasons), its efforts to get him under official control, and the exceeding difficulty of doing so. And of course, the story ends in a wholly different way than the movie, a very satisfying and inevitable conclusion that bolsters Mr. Dick's reputation for opening the future to us.<br><br>*** OK, ONE LITTLE SPOILER ALERT *** READ NO FURTHER (unless you don't mind) ***<br><br>I just have to add, the flurry of action sequences which come like a staccato rendition of The Flight Of The Bumblebee during his escape from custody, is thoroughly delectable and brought more than one involuntary \"Ha!\" from the audience I saw it with, including from me. It's one of the tastiest treats in the film.<br><br>And finally, yes, I too wish I knew who the heck these terrorists were and what the heck they were trying to accomplish with their nefarious plot. But I guess that's the brave new world we live in. We just don't get to hear the bad guys' dialogue, their reasons for doing the things they do. In that way Next is giving us another insight, not dropping us cold as others have complained. The only legitimate beef I agree with is the entirely unnecessary and just plain goofy Nicholas Cage business during the final pursuit. It looks like it must have been an idea of somebody too high up among the moguls to deny, but it is a definite distraction causing \"Huh? What?\" moments when the action is at its most intense.<br><br>All in all, a feather in everybody's cap and a movie I fully recommend without reservation. Drama, humor, really fine action sequences, twists, great characters. As baseball great Yogi Berra once said, \" Don't miss it if you can.\"","user":"SquirePM","rank":[191,272]},{"title":"Unexpectedly Good","rating":9,"date":"27 March 2009","review":"I saw this movie on sale for a bargain £3. <br><br>I had never heard of it, but Nicholas Cage is usually watchable, Lee Tamahori did the brilliant Once Were Warriors and the 'look 2 minutes into the future' Macguffin sounded intriguing enough; so I bought it and put it in the DVD player after dinner for myself and the wife to watch.<br><br>It was really good and kept us both on the edge of our seats until the end (the ending was also very clever IMHO).<br><br>Actually the best movie (along maybe with Watchmen) that I've seen this year.<br><br>I imagine the pitch was something like 'Groundhog Day meets Die Hard', but for once they more or less pulled it off.<br><br>They could have had a love interest with less of an age gap (but I assume Jessica Biel is there for eye candy not acting reasons) and the plot is a bit silly at times, but Cage plays it with just the right amount of 'tongue in cheek' as a lead in a paranormal action romance and compared with the last movie I sat and watched with my wife (the third Mummy) which is in a similar genre I suppose, this is in a different class.<br><br>I can't really understand why so many folks give this really low ratings. Maybe it's real hard core action guys who dislike it, and it's probably not for them - but really this came as a very pleasant surprise. Highly recommended.","user":"andymcnish","rank":[29,38]}]