[{"title":"A sensory delight","rating":8,"date":"27 May 2006","review":"Based on the recent Marie-Antoinette biography by Antonia Fraser, Sofia Coppola's film focuses on the personal qualities of the character of Marie-Antoinette and thus participates in the character's historical rehabilitation. Antoinette is seen as a respectful loyal daughter, a loving mother, a patient wife, who had to withstand a flood of vindictive criticism since the moment she set foot in the French court. This depiction contrasts strongly with many prior representations of the character in film (\"The Affair of the Necklace\" for example), which show her as superficial, selfish and vain.<br><br>The visuals and auditory elements, which evoke a powerful image of 18th-century Versailles, are the movie's forte. And their effects linger in one's mind (or at least they did in mine) long after one's exit from the theater. As a budding art historian, I was stunned by the intensely lush visual spectacle the film has to offer: the pomp and circumstance of ritualized and regimented 18th-century Versailles. The semi-private world that Antoinette builds for herself to escape Versailles's codified, quasi-totalitarian atmosphere, is evoked through a sequence of fast-moving images of champagne-guzzling, beautifully-decorated cake-eating, and Manolo Blahnik shoe buying. Thus Antoinette's fantasy world is likened to a world recognizable to you, me and Carrie Bradshaw. Some people may scoff at this 21st century world transposed to an earlier time. But as the center of the world in 18th-century Europe, Marie-Antoinette's \"secret Versailles\" would certainly have been as \"hip\" as this, and Coppola has found effective means through sound and image by which to make this hipness accessible.<br><br>The story zooms in on the character of Marie-Antoinette, played by a ravishing Kirsten Dunst, who arrives at Versailles at the tender age of 14, to become queen of France a mere 5 years later. Coppola emphasizes the loneliness of Antoinette throughout the film: most important is her alienation from the French court by the fact that she is a foreigner (something that made her a scapegoat for all of France's problems during the 1780's). Her powerlessness to \"fit in\" is emphasized also through her sexual alienation from her socially-awkward husband (played by Jason Schwartzmann), her mother's chidings that she has not yet produced an heir to the French throne (and thereby has not secured Austria's political place in Europe), and the bitchy gossip that goes on behind her back at court.<br><br>Marie-Antoinette is depicted as an intensely personable, friendly and playful person. Coppola fashions a Marie-Antoinette who is a dutiful daughter, a patient wife to Louis (who eventually overcomes his shyness and becomes a loving and protective husband and father), and a caring and tender mother. She is shown as both bold and humble, two qualities which had quasi-miraculous effects on both the court and the angry mob, as is shown in some of the film's most touching moments.<br><br>Equipped with these \"essential\" personal qualities, the charges traditionally made against Marie-Antoinette fade completely. It is precisely Antoinette's ill-fated attempt at fitting into French court society that causes her escape into a world of idle futility and libertinage. Her escape into the world of \"playing shepherdess\" in her pleasure-house of Le Hameau is shown not as a silly escape from responsibility but as the simple human need to be surrounded by the natural world. This place appears to us as it does to Antoinette: as a refuge from the backbiting, totalitarian regime of Versailles. Even the legendary \"let them eat cake\" statement allegedly made by Marie-Antoinette is discarded as fiction.<br><br>There is almost no place in the film for the 18th-century reality as it existed outside the bubble-like world of Versailles. This is not the movie's purpose. The end of the film is a bit abrupt: the last image shows the royal family heading to Paris to be imprisoned in the building of the Conciergerie. There is no mention of the guillotine anywhere, which again can seem surprising, but which shows that Coppola deliberately tried to eschew stereotypes and do something different. And it is all to her credit.","user":"jmb360","rank":[329,474]},{"title":"Let Them Watch Cake!","rating":4,"date":"25 October 2006","review":"Marie Antoinette is the film equivalent of one of those expensive fashion magazines that pepper indie art galleries  packed with achingly hip aesthetics but free of meaningful content. The film traces the life of the last Queen of France from her introduction to the French court until her departure from Versailles. If you're looking for serious history though, you're better off sticking to Antonia Fraser's source novel. Wigs, footmen and finery are more often than not filmed to the strains of 80s pop and punk and a pair of Converse shoes even sneaks onto the screen (though viewers will have to be sharp-eyed to spot them). It's the 18th century, Jim, but not as we know it. Marie Antoinette the film shares the obsessions of Marie Antoinette the character  shoes, cakes, finery and having fun. It even finishes before the dark conclusion to Marie Antoinette's tale  her arrest and subsequent death by guillotine for treason. Sophia Coppola's last film, Lost in Translation, won an Academy Award for Best Screenplay but it's safe to say she won't be receiving any such plaudits for this script. There's barely any dialogue for the first twenty minutes, and most exchanges thereafter are pithy and shallow. Great actors  Rip Torn, Danny Huston, Shirley Henderson  are given nothing much more to do than push the narrative along its slow path. Dunst's role is mainly to giggle, roll her eyes, and run around in period costume. O.C. characters have more depth. Visually, however, the film is stunning. No, better than that: it's luscious. Coppola was given special dispensation to film in Versailles and all the extravagant finery of the palace's rooms unfolds across your screens. When Dunst has a shopping spree  to the anachronistic sounds of I Want Candy by Bow Bow Bow  you go with her, feasting on cream-stuffed cakes, delicately stitched shoes and beautiful, patterned fabrics. The film is an orgy of materialism, filmed with the sharp editing and honed soundtrack of a television advert. All of which makes it difficult to see what point Coppola's making. The camera's fetishises the spoils of wealth and yet we're encouraged to feel sympathy for her as the revolutionaries close in on the palace at the film's end. She wants us to think Marie Antoinette's character was misrepresented  'I never said that!' she claims of the famous 'Let them eat cake!' reports  but shows us enough debauchery to reinforce the common perception. In fact, it's difficult not to see the director herself mirrored in her central character as it was in Lost in Translation  the spoiled Hollywood royalty reaping the benefit of her connections to stuff herself (and her film) with profligate confectionery. Your enjoyment of Marie Antoinette will depend on how you go in. If you're expecting Dangerous Liaisons you'll hate it. If you think you'd enjoy an 18th century hybrid of A Knight's Tale with Clueless, kick off your Converse, stock up on fairy cakes and indulge.","user":"danstewart25","rank":[77,106]},{"title":"Gidget Goes to Versailles","rating":4,"date":"26 May 2006","review":"and when she gets there, she gets bored, gossips, reads Rousseau, and has beach-blanket pot parties in Amadeus outfits. I did like the music, there is one inspired masked ball and a good \"watch the sun rise\" scene - the strength of this film is its connection to high school culture, seen through the eyes of a sweet, utterly conventional and finally boring teenage girl, projected from the California suburbs onto 18th century France. This is obviously also the film's weakness: this movie is a beautiful, expensive still life that knows nothing at all about French history, Europe, the Revolution, the Bourbons, how the ancien regime worked, how incompetent wars and not Marie Antoinette's Imelda-Marcos-like shoe fetish ran up the debt, about the conflict in North America with England and Spain, about how leading members of French government actually had brains - the films displays a nitwit, decadent, wig-loving, golden-furniture France as though seen by a France-hater in the Bush administration. As my brother pointed out, the movie also blew the subject of a potentially great movie, which is Marie Antoinette's inspired, sometimes brilliant defense of herself at her later trial. Trying to learn about what happened to the French court from this film is like trying to learn about American corporate culture by watching J.R Ewing's 30 second business deals at the Cattlemen's Club on Dallas. Well sure, politics wasn't the subject of the movie, but why is the \"chick stuff\" buried in diamonds and champagne? That makes these women seem way less tough and intelligent than they actually were in the bloody contact sport of French court politics. As an American watching this in Paris I was struck by the film's lack of historical, political, and cultural sophistication, in which Dunst is in every single frame and it's all one gigantic royal slumber party until the peasants show up in an illiterate wordless mass baying for bread and blood and shaking their satanic harvesting tools. Ouch: The film makes the most sense as a weird allegory of Hollywood inbreeding.","user":"cnewf","rank":[584,905]}]