[{"title":"Don't get high on the hype.","rating":6,"date":"19 August 2006","review":"A lot of people on IMDb have given Snakes on a Plane a 10/10 rating and left comments like \"omg this is best movie ever lol.\" Unfortunately, most of these people had come to this conclusion before seeing the movie, and are still high on the Internet hype that built the movie up to be something it's not.<br><br>I guess there's no real point to writing a review of Snakes On A Plane. With a title like that, you've already made up your mind about if you want to see it. But keep this in mind...<br><br>Snakes On A Plane isn't a comedy movie. It isn't a horribly cheesy or bad (intentionally or not) movie, either, or one that's \"so bad it's good,\" which is a phrase that gets thrown around a lot in SOAP discussions. Also, the movie's not all about Samuel L. Jackson being a badass or swearing a lot, although it happens. Snakes On A Plane is a entertaining mid-grade thriller movie that pretty much delivers what you'd expect from a Hollywood movie about snakes on an airplane. No more, no less.<br><br>Don't see this movie if you're expecting to constantly laugh at Samuel L. Jackson showing off how cool he is. There are plenty of moments where Sam kicks ass and gives some great one-liners and does amusing things, but he is offscreen just as often as he is on it.<br><br>Snakes On A Plane isn't the best movie of the year. It's not the funniest movie of the year or the scariest, but it is a good movie if you're looking for mindless fun involving a lot of snakes on an airplane, some gratuitous gore and nudity, and a few great Samuel L. Jackson moments, check it out.","user":"agent17","rank":[341,478]},{"title":"The Internet spawned a monster...","rating":5,"date":"20 August 2006","review":"I'm confident that \"Snakes on a Plane\" will prove once and for all that Internet culture and mainstream culture are not one and the same.<br><br>Because, my friends, the Internet will tell you that SOAP (as those in the know call it) is a classic film - the best \"bad movie\" ever made. But I think any more sensible member of the general public will tell you that SOAP is nothing more than a mildly competent action movie. It's not hysterically funny. It's not scary. It's occasionally exciting. And it sure ain't a \"10\" on the IMDb scale.<br><br>Don't misunderstand me; I had fun watching the movie. I was even willing to be generous, until I saw the outrageously high rating on this site and all the strangely gushing reviews. Frankly, I'm a bit astonished. Why heap such praise on this particular film? If you love camp, over-the-top action movies, then why not worship a camp action film that's actually good? (\"Wrath of Khan\" springs to mind - also \"Batman.\") <br><br>The truth is that parts of SOAP are pretty lame. Samuel L. Jackson is good, but his role is weirdly small. And, aside from his one power catchphrase, most of his dialog is banal and dull. The rest of the actors aren't even worth commenting on, since they're stuck with stock and boring \"funny\" characters.<br><br>Speaking of dull, how many different ways can snakes really kill someone? They hiss...they lunge...they bite...over and over and over again. It's not particularly cinematic. And most of them are fake CGI anyway, so they're not even remotely frightening.<br><br>Face it, the only reason to see this is because it's camp and bad. It's part of the whole culture of worshiping lame junk that's prevalent right now. It's hip to like terrible garage bands and lame movies because people are either too impatient, or too unsophisticated, to take the time to absorb entertainment that's actually artistic. So we watch and listen to junk, and imagine that we're superior to it, and that makes us feel good. Apparently. <br><br>Is there anything wrong with liking junk? Not really - I review and praise junk on this site all the time. But putting junk on a pedestal? That's very, very wrong.<br><br>Sermon over.","user":"dr_foreman","rank":[613,884]},{"title":"Oh, yes, Snakes on a Plane does indeed rock.","rating":10,"date":"16 August 2006","review":"A small part of me has died today. I realized something when I exited the theater, fresh from the prescreening of Snakes on a Plane (SoaP) at the cinema at which I work, that I may never again see another film that rocks this hard. If you are looking for a deep introspective look at the horrors of airborne terrorism and reptilian exploitation, look somewhere else, and don't complain about it. If you are like me, and I would assume you are since you are reading my review, and are looking for a solid hour and a half of ass-kickery, then congratulations. You just hit the jackpot with SoaP. I can honestly say that the film lived up to my every expectation. I was so pumped by the end of the movie that I threw my shoes across the (empty) theater in a fit of ecstasy. I kid you not.<br><br>Boiled down to its very essence, SoaP is the pretty much the essence of all that is manly. Think of it like an anti-chick flick. If you enjoy any of the following, then this movie is for you: gruesome deaths, breasts, cheesy physical humor, Samuel L. Jackson, or venomous reptiles. If not, then you clearly have a vagina, but may still manage to enjoy SoaP.<br><br>Plot is pretty thin, something generic about a kid (Nathan Phillips) who witnessed a mob murder and has to be transported to L.A. to testify in court, but I doubt anyone will mind. We know the basic story. There is a plane in the air that has both venomous snakes and Samuel L. Jackson on board. Samuel L. Jackson defeat snakes in a number of thoroughly awesome ways, which I will not reveal as to not diminish their awesomeness, and simultaneously deals with whiny, stereotypical frightened passengers. Trust me though, seeing the snakes rampaging through the plane and wreaking havoc on said stereotypical passengers is indeed sweet.<br><br>The acting is as solid as one could hope for from this cast. Jackson takes front and center stage, obviously. He saw the called the pitch, took a beefy swing and hit one into the upper decks. As for the rest of the cast, they did a decent job. Keenan Thompson actually doesn't suck, Nathan Phillips was solid enough, and Julianna Margulies did a fine job.<br><br>Honestly, I can think of no reason not to see Snakes on a Plane. Sure, the critics will lambaste it left and right. There's no doubt about that. However, coming from someone who is ready to accept the film for what it is, I can honestly recommend it to anyone who can appreciate its nostalgic, cheese-ball appeal.<br><br>All things considered, Snakes on a Plane will undoubtedly be the most enjoyable, and the most unlikely blockbuster of the summer. A solid ten out of ten.","user":"ps42","rank":[561,833]}]