[{"title":"Familiar yet Enjoyable","rating":5,"date":"19 February 2006","review":"Based on the novel by Claire Cook, the plot centers around a kindergarten teacher named Sarah Nolan (Lane), a divorcée who swears off men after a devastating divorce. However, her close-knit Irish-American family decides to 'help' her along by signing her up for a number of online dating programs. She then finds herself caught between two men, as she starts seeing the father of one her students (Mulroney) and a man who she meets through the dating service who seems far too perfect (Cusack).<br><br>Must Love Dogs is a familiar yet enjoyable romantic comedy that should keep you entertained for a while. The plot is nothing new and there are many clichés to be found here yet the film is still funny. The film works well because of its two stars John Cusack and Diane Lane. They both give good, funny performances and they have nice chemistry together. If you enjoy watching these actors on screen then you should like the film. The supporting cast is also strong except for Dermot Mulroney. The good thing is that Dermot is not in the film very much so he does not suck out too much from the picture. This is his third film from 2005 and he was horrible in every one of them yet he keeps getting hired. The rest of the supporting cast consists of Elizabeth Perkins, Christopher Plummer, Stockard Channing and Julie Gonzalo.<br><br>A few things are keeping me from rating the film higher. One of the reasons is of course Dermot Mulroney. The film also has a few annoying clichés that are hard to ignore. There were also a few bad stereotypes that were not needed and they were not funny at all. Even though the film does have its share of funny moments, it becomes dull from time to time. The film, for the most part, is safe and this movie could have easily been an episode of Friends or something. That does not mean it's a bad film, it's just a little sitcom-ish. If you do give the film a shot, don't take it too seriously and try to have a little fun with it. In the end, Must Love Dogs is a surprisingly enjoyable romantic comedy. Rating 7/10","user":"christian123","rank":[49,62]},{"title":"Not entirely a waste of $7, but...","rating":6,"date":"1 August 2005","review":"This movie had all the ingredients necessary to be one of those romantic comedies that are also 'good' films. The cast is competent, the actors all likable. But unfortunately, the writing is sub par. It is almost embarrassing to watch Diane Lane (or any of the actresses playing her sisters) recite lines like '...boob shirt? Boob shirt?...I don't have any boob shirts..' or '...that is disturbing on so many levels...' and other trite and trendy phrases. While John Cusack escapes most of the embarrassment (he has the best lines, and the best performance), it is still a film beneath him.<br><br>The movie has too many false moments in it to be entirely enjoyed - the obligatory gay friend Diane has, and of course his drop dead gorgeous model-like boyfriend; the large Irish family that seems to drop their accents from scene to scene; the trailer-park girlfriend; Diane's scene where she just shows up at Cusack's home (how did she know where to go, and what was her hurry?); and of course the 'chase' scene at the end where of course she had to bring her dog. And for that matter, it wasn't even her dog so even the title does not entirely make sense.<br><br>It's a shame, because like I said, the cast is likable. Just goes to show you that without the right screenwriter, even strong players can come across as high school acting students.","user":"JCBar","rank":[67,91]},{"title":"McDonalds Movie","rating":6,"date":"2 May 2006","review":"My friend commented this is a McDonald's movie - that is, you don't go to Macca's expecting haute cuisine and the title and summary at the back of the DVD cover should have tipped people off that this is a Cheese Burger movie. ( Plain, slightly boring, inoffensive) John Cusack and Diane Lane play angst ridden characters, slightly caricatured ( no one I know is quite as oddball as Jake- is Cusack being typecast?- or quite as neurotic as Sarah). The movie IS somewhat clichéd but the dogs are very cute as are the kids ( if slightly precocious at times). The sisters are more realistric - mine could be just as mean under the guise of honesty and just as meddling. Christopher Plummer as the Dad was a shock ( esp with Irish accent) - but Stockard Channing plays the girlfriend very well - mature aged vanity and all.<br><br>I liked this movie - a pleasant way to end a Monday night...","user":"BollyLover","rank":[19,23]}]