[{"title":"Very sweet","rating":7,"date":"4 August 2008","review":"I'm sure everyone can remember the first time they saw Bambi, I'm also sure that most of you have cried while watching Bambi, it's one of Disney's most touching films. So I got to see Bambi 2, while normally we have a million Disney sequels that are major disappointments, but Bambi 2 surprised me, it was very well done and was nicely put together. I really enjoyed the animation, the voices, the story, they were really lovely. The one flaw that comes into sequels is how different the voices are from the previous film, despite that you can still notice a difference, Bambi 2 fits the voices very well for the characters. I also enjoyed this new chapter into Bambi's life as he is learning how to become a prince, but still holding onto his childhood and his favorite friends.<br><br>Bambi is having a hard time, his father has to take care of him but his father also has no respect for him since Bambi isn't as brave as he is. Bambi will do anything to just get his father's respect, with the help of some old friends like Thumper and Flower, he'll try his best to over come his fear and be a brave prince. But he's got a new enemy, a mean fawn, Ronno, who constantly teases him about his flaws. Bambi is also having to learn how to grieve the death of his mother and make sure that he doesn't meet the same fate as she did.<br><br>Bambi 2 is a definite recommendation, it's a different Disney sequel than I've ever seen because it seems like this one could have been in the theaters. It's very well done and just a total pleasure to watch, wither it's by yourself or with the family. I loved the return of Thumper, it's always a pleasure to see him on screen, I loved when he was trying to show Bambi's father that Bambi could be brave, but Bambi needed more time, so Thumper does his best to distract Bambi's dad, it was so cute and funny. This was a good movie to watch, I'm sure you'll enjoy it.<br><br>7/10","user":"Smells_Like_Cheese","rank":[12,12]},{"title":"A midquel which tells the story of how Bambi meets and gets to know his father","rating":7,"date":"12 February 2006","review":"I grew up watching the old Disney movies, and Bambi has always been one of my favorites. When I first saw that they were making a new Bambi movie, I was really torn. I hoped that it would be a good follow-up, but was afraid that it would ruin the whole Bambi experience.<br><br>I was pleasantly surprised to find that the movie, though not as good as the original is far surpassing many Disney sequels.<br><br>The animation quality is good. Not only is it much better than most of Disney's recent sequels, it is is actually up to, and at some points even surpassing, the animation in the original. The songs were beautiful, and to my immense relief, they are all sung in the background in the style of the original. There is only one point at which any of the animals sing. It was extremely cheesy, but mercifully short.<br><br>The only real failing of this movie is that it lacks the fresh, genuine feeling of the original. While Bambi I felt unique and novel, Bambi II often feels cliché and it seems like they are recycling some material from The Lion King. The addition of Ronno as an antagonist adds nothing to the story but goofiness and low-quality humor. The Great Prince's character seems to be the caricature \"single dad\" struggling to understand his kid. And while Bambi's character has always been humanized (as are all animals in Disney movies) he seems far more \"human\" and much less \"animal\" than he did in the original.<br><br>Overall, I liked this movie, and was able to get a few nostalgic moments. Although it does not quite live up to the original, it is nevertheless a sweet and enjoyable movie.","user":"UnicornMaiden","rank":[30,34]},{"title":"Blown Away","rating":10,"date":"13 February 2006","review":"I did not expect to like this movie.<br><br>I am currently studying animation in college, and perhaps more than other people I've been expecting less and less from Disney since they started putting out sequels to their classics. I've been terrified ever since I heard that a \"midquel\" to Bambi was in the works, since I was positive it would be another campy, over-the-top rehash of the original.<br><br>Imagine my surprise, then, at the quality of Bambi 2. Perhaps it's because there's a legitimate gap in the original story for this to fill (Between the death of Bambi's Mother and his return as an adult), or maybe because of the creative details that were added (Several ideas and sequences were taken straight from the book, which was a nice surprise), but I found myself genuinely enjoying this movie. <br><br>Disney really seems to have put some thought into the kind of legacy they're picking up here. The themes and art style of the original are carefully preserved, the characters are expressive and lively. There is no sarcastic or self-aware humour; the writing is thoughtful and the storyboarding is beautiful. My one qualm are the two songs used in the film. They seem too...modern. I missed the choir. Luckily, those are two brief moments in an entire film.<br><br>If it had been left up to me this film would never have been made, but I can't imagine it being done with more care and respect for Walt's vision. The characters are treated with respect, the story has real meat to it, and the result is a great movie.","user":"RideIn","rank":[38,44]}]