[{"title":"Underworld","rating":7,"date":"22 February 2020","review":"Good Start up to the new saga of movies. If you are a fan of horror and the underworld series themselves then it's worth a watch, action packed from pretty much start to finish and delivers a good story that moves on for the first lot. Kate is great as always and brings along others to perform a good hour and forty minutes of vampire/werewolf mayhem!","user":"MR_Heraclius","rank":[37,38]},{"title":"A superb sequel for fans - others should avoid.","rating":7,"date":"21 January 2006","review":"Underworld Evolution is a film for fans of the genre - if you like it, prepare for two hours of undiluted pleasure or, if not, then I suppose all the epithets along the lines of 'boring, derivative, banal, underwhelming tosh' are fully justified. Read on: if you are put off by the description that follows, maybe this film is not for you and I've done my job. If you enjoyed the first film in the series, or (as one of the uninitiated) these tantalising glimpses of high-tech goth makes it appeal, then read on - for the more you know about the mythology first the better (since the film itself wastes little time explaining itself).<br><br>Underworld is a dark domain where age-old enmity between Vampires and Lycans (werewolves) is played out with terrifying fury. Normal people are fairly peripheral to the plot (vampires have emergency blood transfusion type supplies to save the need to attack humans). Both sides are armed not only with traditional blood-sucking and flesh-tearing fang-capacity, but with all the gadgetry of customised guns and other scientific paraphernalia with which to track and kill each other. Here is no disneyfied world of a timid picture-book 'Dracula' hidden in a battered old coffin somewhere - these guys exult in state-of-the-art locking crypts, massive stone fortresses, and raids conducted with military precision. The film unashamedly boasts an adults-only certificate and has consummate amounts of nastiness, gore, head-ripping and scary battles as well as realistic dollops of sex.<br><br>Apart from the actual mechanics (such as reaction to sunlight, ways of causing death), the vampires of Underworld have little in common with their namesake in literature - a fascinating creature that slowly saps its victim of strength. Several other fables are instead interwoven, perhaps the most obvious being a Romeo and Juliet type love affair between the beautiful Selene (Vampire heroine, played by Kate Beckinsale) and Michael, the Lycan hybrid. There is also a Beauty and the Beast charm since both these characters display very human qualities at times, such as their tenderness towards each other and the desire to minimise suffering. We long for them to rise above the terrible disease that pumps in their veins. There is a 'Mad Scientist' type underlay with the development of specialised weaponry and the search for the pure strain (giving rise to Matrix-style battles) and, last but not least, Underworld borrows from the X-Men idea of mutations and stylistically from more polished films of a not dissimilar ilk such The Crow or Blade.<br><br>The name Selene means the moon goddess, who was known for her countless love affairs and also her purity. Her sister was Eos, the dawn. Michael is a Hebrew word meaning 'he who is like God'. But we're hardly interested in the psychology of plot structure and name-conundrums at this point, are we? The thrill comes from watching Beckinsale (Selene) in a leather catsuit kick ass all the way to the nemesis, or seeing the potentially very scary (and equally photogenic) Scott Speedman (Michael) show his gentle side as he gets her kit off, or actors of the calibre of Derek Jacobi and Bill Nighy play really cruel, vicious, malevolent creatures that haven't been toned down for the under-18yr-olds, or the inventive and bloody battles in fabulously Gothic settings. There's lashings of blood every few seconds; sex mixed with blood for the pervy; and tasteful, delicate sex to remind us we're watching something artistic and not downright depraved (even if we are). If anything, Underworld: Evolution delivers in spades what the first film only hinted at, yet keeping some of the best elements (Beckinsale's acrobatics, car chases and great sets) that set the original tone.<br><br>The plot is far from simplistic, so here's a reminder of what you need to absorb in the first few minutes in case you miss it or forget to take notes: <br><br>Vampire heroine Selene (Kate Backinsale), after dedicating most of her life to exterminate Lycans (who she believes slaughtered her family when she was a child), discovers she has been betrayed by her own kind. She teams up with Michael, a Vampire/Lycan hybrid (a human who has become infected with both viral strains). While on the run with her, Michael has to struggle to accept and understand his powers, and he longs to end the war between Lycans and Vampires.<br><br>Other important characters include: <br><br>Viktor (Bill Nighy) - a haughty, ostentatious vampire overlord with a very dark side (Selene awoke him prematurely from a long sleep to tell him of a Lycan offensive).<br><br>Marcus - the last surviving Vampire Elder, a Medieval Warlord. Mutated into a vampire from the bite of a bat. Felt compelled to raise Vampire warriors (such as Viktor) to control the Lycan horde. As he was awoken by the blood of a Lycan scientist ('Singe') however, Marcus has become one of a terrifying new breed.<br><br>William, brother of Marcus. He mutated into a werewolf (Lycan) from a wolf bite and thence populated the region with the violent Lycan beasts.<br><br>Alexander Corvinus (Derek Jacobi) is the first immortal, the genetic father of both Lycan and Vampire. The pestilence of the Great Plague of Europe had mutated within him to become the Mother Virus, which eventually became two separate diseases (Vampire and Lycan), as it was passed on to his sons Marcus and William.<br><br>The film traces the evolution of these characters but you do need to concentrate to get the significance of the heavy battles that are heaped one upon each other. The real question is, what will happen to Selene and Michael? The ending packs an emotional punch and paves the way for even more spectacular (and hopefully bigger budget) episodes. Stay to the end of the credits for some great heavy metal music.<br><br>Underworld: Evolution offers escapism that explores dark lusts, power, overweening ambition, blind dedication, and the purity of vision to surpass these. Just don't expect Shakespeare.","user":"Chris_Docker","rank":[128,180]},{"title":"This movie will satisfy its target audience, guaranteed","rating":8,"date":"20 January 2006","review":"Let's face it. If you're going to see this movie, you probably enjoyed the original and are looking for more. You want high doses of fight scenes, vampire and lycan lore, blood, violence, and Kate Beckinsale wearing leather or less. In short, this movie delivers all of the above in great excess, so if you liked Underworld, you're going to like Underworld: Evolution as much or more.<br><br>On the other hand, if you don't like blood, violence, action, mythology, or using a sword in a world full of guns, this movie is not for you, and it's NOT MEANT to be for you, so don't complain about it.<br><br>This movie surpasses the original as far as story development. We learn a good bit about each character's past, which helps justify all the extreme violence they engage themselves in. We're also introduced to some new characters and plot lines that add interest and new twists, rather than just rehashing all the familiar faces from Underworld.<br><br>This movie fails to get a 10 rating from me for the following reasons:<br><br>1) Not quite enough \"stuff\" to fill the time. Too many shots of Kate Beckinsale \"looking intense\". The movie could have been 10 minutes shorter if the number of these shots had been reduced from seemingly infinite down to 10 or so. Minor problem.<br><br>2) A few glaring continuity errors.<br><br>3) Too many flashback/explanation shots from the original Underworld. I suppose this is necessary so as not to alienate viewers who didn't see the original or who forgot it. However, this movie is obviously targeted to people who liked the original and want more, so give us a quick refresher and then hit us with new stuff. No need to keep providing Cliff's notes throughout the movie. Make us think a little!<br><br>4) There wasn't a standout power move comparable to the spinning/shooting through the floor in the original Underworld. Let's face it, half the people that went to that movie did so because that shot was in the trailer. This movie had lots of power moves, but none that stood out as the winner.","user":"drk150","rank":[202,314]}]