[{"title":"All The Least Important Parts of the Book in Movie Form.","rating":6,"date":"15 July 2009","review":"This film has possibly the worst ending of any HP film, and wandered the furthest from the books. If you are a fan of the books, this is for you: <br><br>Remember that cool battle at Hogwart's at the end of the book? It's not here. None of it.<br><br>Remember the important plot setup with the tiara? Not here.<br><br>Remember all the background and memories about Tom Riddle? Not here.<br><br>Remember Bill Weasley? Not here.<br><br>Remember Bill getting wounded by a certain werewolf? Not here.<br><br>Remember Fleur? Not here.<br><br>Remember Snape's important parting words to Harry? Not here.<br><br>Remember the funeral? Not here.<br><br>Remember the touching conversation Harry had with Ginny at the end? Not here.<br><br>Remember Scrimgeour? Not here.<br><br>Remember the Burrow burning down? No? Oh, because that IS here.<br><br>In short, this film is great if all you took out of the book was the romance and funny bits. If you're more invested in the bigger story, you'll be disappointed.","user":"ZeroCorpse-1","rank":[665,830]},{"title":"The Best Book...The Worst Movie!","rating":4,"date":"15 July 2009","review":"As an avid Harry Potter fan who has read the books multiple times and of course seen the movies repeatedly, I was extremely excited to see this movie at the midnight showing. Half-Blood Prince is my favorite book and other than 7, the darkest book in the series.<br><br>That being said, I was so disgusted with this movie. Yates &amp; company literally turned it into Harry Potter comedy hour. I'm not sure how anyone thought this movie was amazingly dark when the theater was cracking up laughing the entire time at trite jokes. The only thing that should have been funny in this entire movie was Lavender &amp; Won Won's obsession w/ each other.<br><br>The movie emphasized the unrequited love/snogging/Ron &amp; Lavender romance over the major plot line which was learning about Tom Riddle's background. With the exception of Dumbledore's first meeting w/ Tom &amp; Tom asking about how to make Horcruxes, all of the background was left out. That's essentially three quarters of the book omitted.<br><br>What was the point of not having Tonks find Harry on the train? How can you have Tonks call Remus sweetie and not explain all the drama between them and how they got together? How can you leave out Madam Rosmerta's involvement? What was the point of the burning of the Burrow scene? The ending was horrific. It was completely different than the book. So now Dumbledore is the only one who can apparate on Hogwarts grounds? Malfoy spends all this time working on this cabinet only to have the Death Eaters walk through, Bellatrix (who is not present in the book) encourage him to kill Dumbledore, Snape kills Dumbledore, and they kindly saunter off the grounds in no hurry. No battle... no fear of being caught...nothing. What was the point of the cabinet in the movie? It was completely anti-climatic and they didn't even have the funeral scene which is a must-have. The worst part ever was the very end...Harry and Hermione are talking about Dumbledore's death and going searching for horcruxes and she randomly chimes in that Ron is OK w/ Ginny and Harry. WHAT?! It was so awkward.<br><br>And can someone please tell me how they are going to explain Dobby and Kreacher in the Deathly Hallows movies when they have essentially been omitted from the subsequent movies after being introduced? I honestly would like a do-over. They really need to re-shoot this movie and try again because it was bad. For the real fan, it leaves you cold and empty, with no tears for Dumbledore because you are so confused, and wondering why Yates and Co. cared about Lavender being funny more than the back story of Tom Riddle.","user":"xxmonexx","rank":[487,615]},{"title":"Mixed thoughts","rating":8,"date":"17 July 2009","review":"The reason I gave this an 8 is because it is truly a sensational film, the best yet out of the whole franchise. The acting is milestones ahead of what it has been in previous HP films (especially from Emma Watson), the storyline and characters are much more layered and 3D, the sets and special effects are breathtaking, and the score is absolutely gorgeous. As a stand-alone film, I would happily give this a 10.<br><br>BUT, of course, it is not a stand-alone film - it is the follow up of many other films, and is also based on a book so rich and layered that it could not possibly compete. While this is (IMO) the best film so far, it is also the most unlike the book, and if you know the book and what follows in the Deathly Hallows, you can't help but notice gaping holes in the plot where crucial information has been left out. This film features only 2 of Dumbledore's collected memories - the book shows quite a few more, some of which are important in Harry's hunt for the horcruxes and may have to be dumped somewhere unfitting in the next two films, just to get them out the way (for example, the memory featuring Hepsibar Smith and Hufflepuff's cup). Also, fans of the book will no doubt notice that some of their favourite scenes have been taken out: the funeral at the end, the aftermath of the final Quidditch match (the involvement of Quidditch in this film was entertaining, but seemed pointless as it lead to nothing), and most importantly the battle at Hogwarts between the Death Eaters and The Order/Dumbledore's Army. What I'm trying to say is, if you have not read the book you will probably be able to enjoy this film for the beautiful and intense piece of work it really is - but unfortunately, if you have read the book then the comparisons will come flying at you from the very start, whether you like it or not, and there are definitely more here than there have been in previous instalments.<br><br>Half-Blood Prince is definitely the darkest of the books, and this has proved to be the darkest film - the ever present sense of tension or even impending doom is hair-raising, and every scene featuring Tom Felton (Draco Malfoy) had me almost breathless, even if he does look about 30 now. He is definitely one of the best actors of the HP films. There are also some painfully tear jerking moments throughout: including a surprise attack on the Burrow, which was heartbreaking, and the scene in the cave where Harry has to force the liquid down Dumbledore's throat - that is the first time, in any film since he started, that I've really appreciated Michael Gambon as Dumbledore, which I imagine will be the same for many of you.<br><br>In short, definitely a must see - but book fans must accept that the films have taken their own turn now, and I imagine that the changes in this one will lead to some very major differences in the two Deathly Hallows instalments. The films could never be the masterpieces that the books are, but this one sure comes close.<br><br>...mischief managed.","user":"TheREALBunneh","rank":[10,10]}]