[{"title":"Great movie, quit bashing it!!!","rating":10,"date":"1 October 2006","review":"I can't understand what everyone is fussing about this film for. I saw it on the IMAX 3D and I honestly thought it was hilarious. I caught myself laughing out loud on many occasions. Seriously, this film is not \"violent\" by any means. To me, I really felt relieved to see some humor and scenes similar to the old Looney Tunes cartoons that used to be considered great, but are now considered evil and horrible.<br><br>I took my 4 year old daughter to see this movie as well, and she absolutely loved it. I have no reservations about any of the content in this movie, and I would highly recommend it to anyone with children. Any of the \"adult\" humor was tastefully done and, honestly how many small kids are gonna pick up it? The animation was well done, the cast was great, and there were some very creative action scenes in this movie. I wish all of these politically correct hypocrites would stop trying to psychoanalyze every damn film that comes out and bash it into the ground! Bottom line: This movie is outstanding, and it is incredibly funny!!!! GO SEE IT!","user":"bsmithindian","rank":[104,148]},{"title":"See It In IMAX 3D","rating":7,"date":"9 October 2006","review":"The kids loved it, and I was not bored, and that is more than what you usually end up with these days. The 3D IMAX is truly amazing, if you are already paying the theater admission then IMAX is definitely the way to go. The story is not original, to say the least, but they know it and keep it short. I liked the voice talent, although this \"the wiener dog has a German accent\" thing gets old fast. A lot of people seem to hate this one with a vengeance (look at the distribution of the votes with all those people giving 1), but it still gets a 5.5 average, so that gives you a pretty good idea. This is no Incredibles by any means, but the two little girls I took enjoyed it a heck of a lot more than Cars. Mostly harmless family fun with a few bathroom jokes thrown in: enjoy!","user":"amarosi","rank":[47,64]},{"title":"Are you kidding me?! 5.5?! I had so much fun watching Open Season!","rating":10,"date":"5 October 2006","review":"I was very much looking forward to seeing Open Season on it's first weekend, but I was a bit worried when I saw only a 5.5 on IMDb, because normally, most of the users are right about these movies. But my friends and I still wanted to see this fun looking picture, so we saw it tonight and may I say that I am surprised by you IMDb users who didn't like this film, everyone is entitled to an opinion, I agree. But seriously, how could you not like this film? It has amazing animation, fun characters, and hilarious jokes for kids as well as adults! <br><br>After a bear, Boog, saves a deer, Elliot, from becoming another trophy for an evil hunter, Shaw, they become instant friends. But since Boog is a pampered bear, Elliot wants in on the room service, but ends up getting Boog in some trouble and back into the woods, together they decide to get back to civilization, trying their best to avoid open season from other hunters as well as getting away from Shaw. My favorite character is the porcupine, he was just so cute, \"Buddy!\". Especially, the scene where the dame explodes causing a huge wave of water to splash over the woods destroying everything and moving all the animals away from their safe place and the porcupine sees Boog and Elliot and just smiles and happily screams \"Buddy!\" while getting swooped up into the wave as well! It was so funny! <br><br>Seriously, people, learn to have some fun, I know this was a kid's movie, but my friends and I had a great time watching this movie. This is one of the best movies I have seen of 2006, hopefully, the rating will go up. To those who loved this movie, thank you for having a good sense of humor, to those who didn't like the movie, just give it another shot, please! :D <br><br>10/10","user":"Smells_Like_Cheese","rank":[82,119]}]