[{"title":"Helm's great screenplay and Ferrell's astonishing acting make for an excellent film","rating":9,"date":"10 November 2006","review":"I liked the idea of Stranger than Fiction from the start. And I still like the idea after having seen the film. I was not a big fan of all the huge press first-time screenwriter Zach Helm was getting, but in comparison to the ballooning publicity with Sascha Baron Cohen and Borat!, it was not too bad. I continually looked forward to seeing the film, and am glad that the great trailer did not reveal everything like I had originally assumed.<br><br>The film involves Harold Crick (Will Ferrell), an IRS agent who lives his life by a very strict routine. One day, he wakes up, and begins to hear a woman narrating all of his actions. Suspicious, Crick continues attempting to live his life out, but after an inexplicable comment in regards to his \"immenent death\", he goes on the hunt for the voice. Randomly spliced into Crick's search is Karen Eiffel (Emma Thompson). She is writing a novel about a character named Harold Crick, and is unknowingly the voice Crick keeps hearing. She is battling a case of writer's block, and spends much of the film attempting to come up with the finale for the character.<br><br>Unlike many other existential comedies, Fiction is sweet and almost innocent in its design. Yes, the main focus of the film is pretty grim, but the life-altering questions that keep going around during the film do not become anywhere near as depressing and bizarre as those found in the likes of the work of Charlie Kaufman. In a way, Fiction feels a lot like a Kaufman-written film, but lacking in the means of being totally \"out there\"; almost like being a decaf as opposed to a regular. As a result, while being an excellent film (albeit slightly predictable), it cannot break past the mold already set by the likes of the absolutely brilliant Eternal Sunshine of the Spotless Mind. It just feels like it is missing that spark that could have sprung it right into the brilliance that all films like this strive for.<br><br>Going along with the story itself, it feels a little ill-paced in some few instances, but for the most part sucks you right in and keeps you there. It has many comedic elements, and has some great dramatic sequences as well. They all play well, and while I still would not give him a ton of credit, I was very impressed by Helm's first-time effort. His writing feels vibrant and fresh, and in a film industry with absolutely little originality or thought, it is just great that movies like this slip through and get green-lighted. Every piece of dialogue and background feels well expressed, and just play out astonishingly well. On the topic of Crick however, I liked the idea of how neurotic and obsessive Crick was over numbers, but I thought it was a bit of an overkill to include special effect shots showing the numbers being counted within his head. It felt silly in The Da Vinci Code, so why did Sony feel the need to add it here too? <br><br>On that note, much like my being impressed by Adam Sandler from time to time, Ferrell really pulls through here, and does give the best performance of his short career. The psychological trauma that his character goes through is evident in his facial and body emotions, and the way he conveys it on screen is nowhere near what I would have expected. He brings an amazing sense of what this character is really about, and gives him a poignancy that makes him so life-like that it becomes almost too great to explain. This is a pathetically sad man who you cannot help but pull for as the film goes on. And for all the right reason too. He may deliver some of the funniest lines in the movie, but he is totally mature and at ease in this role. Thankfully this means that he stays serious for the most part throughout the film, and does not let any Ricky Bobby or Ron Bergundy slip out. He could have easily blown it, but thankfully, manages to stay in check.<br><br>Thompson is another particular standout, especially in contrast to Ferrell. She is broken and weak, searching for the perfect ending. The pain and sorrow that goes through her face as she writes and thinks has a poetic excellence to it, and she only continues to prove how good of an actor she is. Dustin Hoffman and Queen Latifah work well in supporting roles, supporting Ferrell and Thompson respectively as the film progresses on. Hoffman has always had great comedic timing, and he does not let it go to waste here. He plays right off of Ferrell in grand ways, and just feels totally at home in the role. Latifah, while not in the film so much, is very good in her bit parts. Maggie Gyllenhaal also shines here, and clearly has the makings for an Oscar sometime in the late future.<br><br>For its small problems, Fiction still is able to prove its worth, and is clearly one of the best films of the year. It will be able to stand proud among the other entries in the existential comedy genre, or just stand proud on its own. Helm's screenplay coupled in with an intoxicatingly great performance by Ferrell make for a great trip to the movies. And sure beats some of the crap that's been released over the past few weeks.<br><br>9/10.","user":"DonFishies","rank":[300,356]},{"title":"Detailed, Astute, Eclectic, and Entertaining Pseudo-Comedy","rating":8,"date":"19 November 2006","review":"\"Stranger than Fiction\" is the complex tale of a simple IRS man named Harold Crick (an appealing Will Ferrel) who one day awakes to his own voice-over narration only to find he is the unwitting main character in the new tragic novel from acclaimed author Karen Eiffel (an excellent return to form for Emma Thompson). Imagine a Charlie Kaufman penned film where all the cynicism and nihilism is replaced with an endearing and heartfelt melancholy that creates a surprising amount of emotional involvement in characters who would've otherwise been over-reaching literacy devices, and you'll get a feel for the sincere type of entertainment Marc Forster's film provides.<br><br>Forster, with his keen eye and eclectic visual sense, populates the film the sharp and contrasting visual angles, camera tricks, and in-frame oddities (like the play with numbers) constantly keeping the viewer engaged and on their toes. Fun supporting turns from Dustin Hoffman as a literary theorist employed by Krick to help find out if the story he is in is a comedy or tragedy, and Queen Latifah as Eiffel's no-nonsense publishing assistant help guide the viewers through imaginative stretches that are occasionally too clever by half. Ferrel gets to show some nice range here, and much like Robin Williams did with \"The World According to Garp\" and Jim Carrey did with \"The Truman Show,\" graduates with honors into more high-minded quasi-serious roles. His co-lead Thompson is subtly method and well studied as the reclusive sociopathic author who just can't help killing her characters.<br><br>What really seals the deal is Maggie Gyllenhal as Farrell's love interest, the anti-establishment baker he is assigned to audit. She literally lights up the screen. There's one expertly framed and perfectly lit shot of her standing outside her townhouse inviting Farrel in for the night where the light from street lamp off screen is filtered in through the shadows of tree branches and hits her face in such a way that in that brief flickering frame you become insanely happy to be watching such a pleasant marriage of literary concepts inside a visual medium. At this point you don't care how the film ends. You're just grateful to experience that giddy moment of pure movie entertainment.","user":"WriterDave","rank":[213,256]},{"title":"A Must See!","rating":9,"date":"28 October 2006","review":"This movie was such a great surprise! I saw this at an advanced screening just days after suffering through Marie Antoinette. What a pleasant escape! The cast did an outstanding job. Who doesn't love Will Ferrell, but to see him in this role gives me a whole new level of respect for him as an actor. He simply shines on screen! Maggie Gyllenhaal is a delight. Emma Thompson is brilliant as always. Simply wonderful! The writing was terrific. It was so nice to see a movie that could make you laugh and think (not too hard) at the same time. Direction was well done as well - it was even visually appropriate.<br><br>Go see it and take a friend. You will laugh and be happy for a change after leaving a movie.","user":"lsmelton","rank":[270,336]}]