[{"title":"Getting Into The 7th Room","rating":28,"date":"28 May 2009","review":"Straughan's adaptation of 'How to Lose Friends &amp; Alienate People' is a charming and funny albeit familiar film. Yes, the story itself isn't anything new to the screen. The film also had potential of being an engaging satire but it remains rather a feel good romantic comedy. I liked the mixture of American and British humour. It is a well executed film that is rushed in the beginning and clichéd in the end. I enjoyed the mid-sections the most. Pegg, yet again, dominates the movie with his comic power. He's simply hysterical even though he isn't very different from his other films. Jeff Bridges is fantastic. A smoking Gillian Anderson is cast against type as the neurotic, stuck-up and arrogant publicist. Kirsten Dunst looks quite cute here and delivers a charming performance. Megan Fox pretty much plays herself. 'How to Lose Friends &amp; Alienate People' has got some hilarious dialogues brilliantly delivered by the actors. It is the comedic sequences that stand out while the romantic scenes and the more dramatic ones feel rather deja-vu. Pegg proves that he can carry a film on his own and 'How to Lose Friends &amp; Alienate People' remains, at the least, highly entertaining.","user":"Chrysanthepop","rank":[22,26]},{"title":"Great fun, absorbing and thought provoking. Plenty of fascinating characters.","rating":8,"date":"24 October 2008","review":"I was pleasantly surprised to find that How to Lose Friends and Alienate People was nowhere near as 'gross-out' a comedy as the trailer had led me to expect. I rapidly became absorbed in the unfolding of the narrative and remained engrossed throughout. Pacing of the more visual humorous content was, I thought, spot on. (I mean I got the impression I was witnessing Pegg's attempts at restoring lost control very much 'in real time', so to speak.) At other moments there was time allowed to share the main protagonists' (i.e. Pegg's and Dunst's) reflection on how events were affecting them and what had led them to where they now found themselves. All the characters were well cast, to some extent interesting in and of themselves, and generally quite likable. (Any apparent ruthless ambition displayed tended to be tempered by a corresponding good natured resilience.) An entertaining, intelligently scripted, brilliantly directed and superbly acted film that I would thoroughly recommend.","user":"geoffgee","rank":[84,114]},{"title":"Does exactly what it says on the tin","rating":6,"date":"27 October 2008","review":"How To Lose Friends And Alienate People looked like it might be different to the average rom-com we get these days, it looked like it was going to be a smart and satirical look at mainstream Hollywood. It isn't and it wasn't. It's in exactly the same vein as Run Fat Boy Run. I'm not saying that it's a bad film because it isn't and neither is Run Fat Boy Run, but I just felt like I'd seen it all before.<br><br>The start was rushed and lacked that flowing feeling. The middle was the best part, with a couple of laugh out loud moments. The end was a walking cliché which came straight from the school of Cameron Crowe (once again not always a bad thing).<br><br>Simon Pegg stuck to his normal schtick when he's without Mr. Wright and Mr.Frost, playing the lovable but overall clumsy fish out of water Brit. Jeff Bridges was and still is The Dude so he can do no wrong. Kirsten Dunst stuck to her guns and Megan Fox was thrown in as the so hot at the moment crumpet.<br><br>An entertaining film. Not bad. Not great either.","user":"marcusdean118","rank":[98,142]}]