[{"title":"Astonishing","rating":9,"date":"13 February 2019","review":"I'll be honest, when I went into to cinema to watch this movie I was expecting to not like it. I had seen a little bit of the trailer and it did not really \"speak\" to me and Alita's eyes were off putting. When the movie had begun I was actually searching for things to dislike but surprisingly there were none apart from a few cringeworthy moments. I quickly got used to Alita's eyes and they became in fact likeable. The story began to draw me in and I got completely absorbed into the story and the visuals.<br><br>The world is extraordinary and beautiful and the action scenes in this movie are fantastic, quite honestly some of the best I have seen. The story is a bit fast paced but not to a degree that it feels rushed. Alita as a character is great, she is kind-hearted, innocent, naive and protective. Throughout the movie Alita grows as a person and learns about sacrifice, loss, love and the horrors of the human mind. Alita is very likeable because she is such a good person in such a horrible world and you can't help feeling very sympathetic for an innocent being like her as she is exposed to the cruel world of Iron City.<br><br>I watched this movie without knowing the source material and I loved it. I was drawn in very early on and had to watch it a second time. I can definitely recommend this movie to anyone.","user":"The-honest-critic","rank":[1,1]},{"title":"Alita","rating":9,"date":"12 February 2020","review":"I loved this movie! Alita: Battle Angel is my type of movie. I love the science fiction and the great action throughout the entire movie. It also has a very substantive story as a solid foundation. The setting is very grim but Alita's character is uplifting and gives viewers hope. I liked how Alita's story also involves a quest of finding out who she truly is. She finds herself in a world where she can be seen as somewhat ordinary. But she comes to find out that she's far from ordinary. She's an angel from heaven. I really enjoyed this movie and the story itself can be explained further in other films. I hope there's a sequel as the ending laid the framework for more films. This movie is emotional, action filled, and has intense action sequences. The creators of this film did a nice job of spacing out the action. They didn't rush into it and every battle scene was meaningful. I would definitely recommend this movie.","user":"MR_Heraclius","rank":[52,58]},{"title":"Entertaining from start to finish","rating":9,"date":"5 February 2019","review":"I really love this movie. The storyline is really great. Exciting from start to finish. The graphics are really cool. Its like I didn't wanna blink at all.\nThe plot is not mind-numbing as critics say. Well it seems like I have to stop listening to them. Because this film is worth watching by everyone.\nThank you for all people behind this movie. I'm sure this movie wasn't easy to make.\nNow I really hope I don't have to wait too long for the sequel...","user":"na_icecream","rank":[1,1]}]