[{"title":"Flawed movie, but nevertheless breathtaking","rating":8,"date":"16 September 2007","review":"I saw a sold-out opening night screening of \"Across the Universe\" last night with a group of my friends who had really been looking forward to it. Many of them were extremely disappointed, while in the critical world, Roger Ebert and the New York Times loved it. Because the film was so highly anticipated, and a number of people have asked me how I liked it, I'm writing this review in an attempt to express why the movie is so divisive. I'm not going to talk about plot, or describe any of the numbers. If you're interested in seeing the movie, they'll be more enjoyable if they're unexpected.<br><br>It's a bizarre and beautiful movie musical, almost a music video at times, that uses thirty- three of The Beatles' songs and director Julie Taymor's unique visual style to illustrate both a personal love story and the overall conflict in the sixties. The movie is incredibly original and ambitious, and therefore its failings are as dramatic as its successes. Both stem from the same source: Julie Taymor's self-indulgence. That's nothing new to her movies, \"Frida\" and \"Titus\" have the same problem, but in a movie stripped of traditional narrative, it's glaringly obvious. Some songs are impeccably chosen and staged with great creativity, but others are too obvious, or thematically forced so Taymor can cram in another song and stunning visual sequence.<br><br>For the first half of the movie, I was frequently divided. One innovative sequence would really pull me into the style, then a forced number or awkward staging would distance me again. When an obvious, recognizable number began, I was torn between a cynical impulse to roll my eyes and an almost exhilarated impulse to laugh and applaud.<br><br>\"Across the Universe\" is a mess. There's no denying that. It is poorly paced and badly structured, and at times its feather-light plot and contrived or obligatory numbers become tedious. But at one point, about halfway through, I decided just to go along for the ride. I delighted in every brash, bold choice, whether it worked or not. I let the poignant moments move me, whether or not I intellectually felt that they were contrived.<br><br>The Beatles' music had a huge effect on me; from the fateful day that my friend accidentally copied the first three tracks of \"Revolver\" onto my computer, a love affair was born. Their songs are inexorably tied to memories beautiful and horrible scattered all over my life, and as I grow older, I'm constantly discovering new, deeper resonances in their familiar refrains. Even when the context was vague or stretched, the film's reinterpreting and revealing new facets of these songs seemed to serve as a tribute to their breadth and greatness. Taymor's damning depiction of the horrors of war, and lyrical portrait of young, idealistic love are both painfully expressive and unique, and simply took my breath away. By the film's shamelessly corny close, I realized that I had just had a genuine cinematic experience. For all the movies that I watch, that's incredibly rare.<br><br>In his review in the New York Times, Stephen Holden writes, \"I realized that falling in love with a movie is like falling in love with another person. Imperfections, however glaring, become endearing quirks once you've tumbled.\" I could laughingly list this movie's flaws from now till next week, but I sort of fell in love with its sheer audacity. You might not. It's extremely naïve, and thematically simple, and you could find that endearing or irritating. You may love it, or you may hate it, but you're going to feel something. This movie will not change your life; don't expect it to. But if you let your criticism fade to the background, and abandon yourself to Taymor's passionate fervor, you may have a pretty amazing experience.","user":"BriGuy7783","rank":[531,647]},{"title":"A masterpiece of video art,, design, music and dance","rating":9,"date":"13 September 2006","review":"After an intensely screened screening featuring nervous suits delivered in limousines and gentle but firm gentlemen controlling the ticket flow to assure a certain target group would be tested for their age, predilections, and proclivities, and wand wielding security guards frisking patrons for any signs of recording devices - including cellphones - I entered what we were told was the first-ever-in the-world test market screening of the Taymor/Beatles extravaganza \"Across the Universe\".<br><br>Thoughts of Peter Frampton in Sergeant Peppers' haunted me, but my admiration of Taymor, and, well, I was actually a kid IN the audience of the Sullivan Show on February 9, 1964. I was even in a band that appeared on MTV in their first hour (Robin Lane &amp; the Chartbusters)! Iattended my share of protests, worked with Reverend Daniel Berrigan, got psychedelic and ... well... enough about my qualifications to review the movie - it seems I still don't fit the intended demographic - it's the first time I ever lied my age downward! So despite that the studio may change some things - here's what I saw at this stage of tweaking the film.<br><br>Without quibbling over loose plot points and misguided scenes as they seem to be still tinkering with those things (and there are there are several out of place and unexplained scenes) - I've rarely seen such a feverish work of persistent video art in the service of great music. These are NOT small music videos wrapped around a questionable plot. Taymor's vision as a director seems to borrow from everything. Her story ideally wants to conjure up the not just the frolic, but the frenzy and passion of the 60's. <br><br>There is what looks like Jan Svankmajer in a stunning industrial dance scene in a draft board as civilians are turned into soldiers. Another scene has giant puppet pageantry straight out of Peter Schumman's Bread and Puppet Theater and Resurrection Circus. There are joyous location street dancing scenes, and breathtaking Technicolor composites. One such scene is a dreamlike vision done entirely in the psychedelic solarised colors of Richard Avedon's Beatle portraits. Her set designs are at times so clever and colorful, you laugh at the unrestrained joy and daring. <br><br>She begins with a glorious reinvention of the fifties musical, and careens into pure psychedelic delirium. The cinematography is rich and varied to the purpose of each scene, and dance sequences explode into place. The film moves from the innocence of small town upper-middle class America, to the nascent hippy scene in the village, to a sort of hallucinatory Garden of Eden (with too much but amusing Bono as a Ken Kesey Merry Prankster guru type). It moves to romance, and onto the dangers and volatility of the anti war 60's. All this is rendered through a constant flow Beatles songs delivered amidst magnificent set designs and video composites.<br><br>For the most part the music is respectfully and tastefully rearranged. (and without the Pavlovian shamelessness of the Beatles as they were used in \"I Am Sam\") A ballad version of \"I Want to Hold Your Hand\" movingly reinvents the song. I don't know if the actors actually sing but you could have fooled me. It is all carefully synched up. Even the drummers and strummers are always in synch. The actors are charming, but once again, as she has done in \"Digging To China\" to \"Down In the Valley\", Evan Rachael Wood rivets the film. It would too much to believe she could also sing like the angel - but darn if her throat isn't in sych! The voice is beautiful. At times songs and sounds collide like the Beatles in \"Number Nine\". The collision of a war protest at Columbia University with Helter Skelter over Dear Prudence is brilliant. Taymor has edginess that matches the sixties zeitgeist, and avoids the vacuous cotton candy fluff of Luhrmann's \"Moulin Rouge\".<br><br>I think it would be wise to address Taymor's strength, which is the darker political vision. The film's intented audience ought to be as angry as they were in the 60s, marching in the streets and standing up to an arrogant and corrupt administration with their trillion dollar war. The parallels to today are obvious. The time is right for such a film with such politics. It shouldn't get comprised by too much gooey and gratuitous romance.<br><br>I overheard two young girls afterward say; \"I don't know why they have to redo those great songs?\" - whereas a much older couple were saying; \"This was great  very artistic, fun - it really caught the feeling of the era.\" I hope the handlers in their infinite wisdom don't sell out the ability of this film to be politically relevant as well as beautiful.<br><br>Characters and situations that obviously echo Janis Joplin and Jimi Hendrix, the Weathermen, the Weather Underground, Abbie Hoffmann, Ken Kesey, draft card burning, 60's clubs in the East Village (Café Wha? becomes Café Huh?), and other sly references are fun to pick out, though I assume details are undergoing revision for clarity. I don't think this is just a film for 20 somethings. The kids I sat with remarked; \"This is important stuff for our generation to remember.\" Taymor's darker sensibilities are what the film really needs to keep it from being perceived as so much razzle dazzle and romance. There's a subversive edge to this story.<br><br>Visually, it is unquestionably a masterpiece of video art. Its final judgment may be that it can speak across generations.","user":"tjackson","rank":[243,304]},{"title":"Let's say Hair and Moulin Rouge had a baby...","rating":9,"date":"5 September 2007","review":"... and it's nanny was Julie Taymor ...<br><br>This probably sounds like I hated the film, but I actually loved it. <br><br>It has the time line and self-consciously-culture-smart soundtrack of Hair, yet the campy fun and karaoke stylings of Moulin Rouge. Julie Taymor takes this combination and makes it fun, instead of extra cheesy, and it is visually fascinating instead of the obnoxious MTV-video nightmare it could have been.<br><br>I cared about the characters - and the cast of 'unknowns' have great star power and voices. Even though I knew exactly what would happen, the journey there was great. The cameos were fun. The lead was sufficiently hot. The soundtrack is stuck in my head as I write this (the new versions, not even the original songs) All corny jokes and references, and lapses in plot are forgiven, because Ms. Taymor manages to take a movie chock full of things that have been done a million times before and makes it as fresh and exciting as if it were all done for the first time. You may know exactly what's going to happen but you never know how. This is the director's movie!<br><br>Definitely a movie journey worth taking.","user":"ManicMuse","rank":[300,395]}]