[{"title":"Extraordinary Performances by young actors","rating":10,"date":"13 April 2013","review":"I'm a middle-aged black man now and sometimes I wonder if young people get it.<br><br>I was born in Richmond, VA, and I'm 1 (ONE) generation removed from segregation. <br><br>It is because of this that I was FLOORED by the performance of these young actors. Chadwick Boseman &amp; Nicole Beharie did a magnificent job portraying the grace and courage of the Robinsons.<br><br>I couldn't have done it. Boseman has an UNCANNY resemblance to Jackie, and his performance was so visceral that it proved to me that I couldn't have done it.<br><br>I wouldn't have had the courage to stand up to racism by NOT fighting back. I wouldn't have had the patience to bide my time until folks decided it was time to see me as being more than sub-human. I absolutely wouldn't have taken the risk of playing a game while people threatened my wife and child.<br><br>When Jackie finally got angry enough to smash his bat against a wall, that was the ONLY thing I could relate to - then to realize he had to go back out there because it was about MORE than just him - I was flabbergasted by his courage.<br><br>This is more than a film about baseball. The nuances like watching people in second class seating still turning out to support Robinson in full-on \"Sunday church service\" dress was poignant to me.<br><br>This movie ain't just about Jackie.<br><br>My mom is from New York, and she was 7 years old when Jackie joined the Dodgers. She remembers this clearly.<br><br>It's obvious why you (as I did) would take your kids to see this film as it shows what happened and how far we've come. For me, it shows what other people did FOR ME that I was incapable of doing for myself.<br><br>This film has some corny parts to it - like most films of this ilk, it sanitizes some things and does tie a nice bow on some issues glossed over in the retelling...<br><br>..that doesn't mean it's not a darned good film.<br><br>I'm pretty cynical these days. It's not often that I watch a film with a lump in my throat the whole time. I am indebted to the young actors who portrayed the people of my grandparents' generation with style, class and urgency.<br><br>I will own this film when it becomes available and that date can't come soon enough.","user":"hitek_dialekt","rank":[214,238]},{"title":"A Number on the Back","rating":7,"date":"13 April 2013","review":"Greetings again from the darkness. After some soul searching, I have decided to turn off the critical side of my brain and concentrate on what is good about this movie. As a baseball and movie fanatic, a bit of trepidation creeps in when the two come together. However, this really isn't a baseball movie, though the story focuses on what may be the most critical turning point in baseball history. In fact, this turning point was much bigger than the American Pasttime ... it was also key to the Civil Rights Movement. The movie is a reminder of how different things could have been with the wrong man rather than the right one ... Jackie Robinson.<br><br>Writer/Director Brian Helgeland (s/p for L.A. Confidential and Mystic River) takes a look at what occurred in 1945-47, when Brooklyn Dodgers President and GM Branch Rickey (played by Harrison Ford) made the business decision to integrate baseball. We see his selection process ... Roy Campanella \"too nice\", Satchel Paige \"too old\". He settles on Jackie Robinson after their infamous 3 hour meetings where Rickey confronts Robinson with his need for a black player \"with the guts NOT to fight back\".<br><br>Chadwick Boseman portrays Jackie Robinson as a man thoroughly in love with his wife Rachel (played by Nicole Beharie), and one who says he just wants to \"be a ballplayer\", while at the same time taking pride in his world-changing role. We see his evolution from his stint as shortstop for the Kansas City Monarchs of Negro Leagues to his time with the Dodgers' AAA minor league team in Montreal and finally to his introduction to the Major Leagues in 1947.<br><br>This is an earnest and sincere movie that removes the complexities of the times and the main characters. Much of it is portrayed as good guys versus bad guys. The good guys are really good and the bad guys are really bad. Alan Tudyk has the unenviable task of portraying Philadelphia Phillies manager Ben Chapman, who famously unleashed a verbal assault of vile racism on Robinson. Mr. Rickey credited Chapman's small-mindedness as the single biggest factor in unifying the Dodger team around Robinson. The other famous moment given time in the movie is when beloved shortstop Pee Wee Reese (Lucas Black) put his arm around Robinson, shushing the Cincinnati fans. Of course as a baseball fan, I enjoyed the all too brief antics of Brooklyn manager Leo Durocher (Christopher Meloni) whose place in the Robinson story would have been much more profound had he not succumbed to the weakness of the flesh (so to speak).<br><br>Filmmaker Helgeland provides a tale of morality and social change, and provides a glimpse at the character and strength required by those involved. The story has much more to do with demonstrating how the times began to change than it does with how Jackie Robinson, an unpolished ballplayer but superior athlete, transformed himself into a perennial all-star and league MVP. And that's as it should be. As Rickey stated, acceptance will only occur if the world is convinced Robinson is a fine gentleman and a great baseball player. That burden must have weighed heavily at times, but it's very clear that Robinson was the right man at the right time.","user":"ferguson-6","rank":[73,84]},{"title":"Very Well Done","rating":8,"date":"11 April 2013","review":"You probably think this film is completely focused on the story of Jackie Robinson. That is definitely not the case, as this film finds balance between the story of Robinson, baseball, and segregation. And this film succeeds in depicting all three aspects to bring a powerful, heartwarming, humorous film. The casting is great. Every actor fits his or her character perfectly. Harrison Ford does an amazing job portraying his character with his no- nonsense humorous attitude. He has a good chance of grabbing an academy award nomination for this roll. This is one of those movies that takes you for an emotional thrill ride. You feel for the Robinson. You want him to win. And you rejoice when he does. So sit back and let the film drag you in; it's worth your time.","user":"gamerzach7","rank":[72,90]}]