[{"title":"Excellent movie displaying a powerful message","rating":10,"date":"6 February 2006","review":"This movie displays such a powerful message that most people take for granted. In our nation we have a history of segregation, and for those of us who think it is all in our past - this movie shows us that it is not. The actual events took place in 2002. The movie makes us aware that racism is still around, and is something that is not good. One person can make a difference, and just knowing that gives hope that one day maybe people can look at other individuals and see them for who they are and not the color of our skin. I commend the real girl who took it upon herself to take action and try and change the world, at least one small town at a time in order to make it better. I would recommend that everyone should see this movie. It is very good!!!","user":"babyluv113","rank":[10,13]},{"title":"Valiant","rating":7,"date":"8 February 2006","review":"Ernest R. Dickerson, best known as Spike Lee's #1 cinematographer, has had a spotty track record as far as being a director, making his directorial debut in 1992 with the gritty and ultra-bloody crime drama \"Juice.\" But here, he moves into lighter, still turbulent waters. He guides young Raven-Symone (in a nice turnaround from her usual comedy stuff) as a crusading teenager out to integrate her school's two separate proms. She does so with the help of her friends and a reporter from New Orleans, played by Aisha Tyler, who went to the school where this is happening. I slightly remember the case of this prom from four years ago and it is very disturbing to even think that racism is still that blatant in this country. I think it currently runs against the liberal ideology of things getting better through time, so what is better? Dickerson's cinematography makes the whole thing look pleasant, though the same can't be said for the critical subject matter. Raven-Symone does some excellent work here in giving her character many dimensions and it becomes clear that she is fighting a tough uphill battle against years of tradition, and the scars of her battle become clearly evident. The rest of the cast is good too, though the only thing that wears it down is some overt preaching and the feeling that it is just above average Lifetime Channel fan fare. But it is still a valiant effort that shouldn't be missed nor should it be overlooked by the overall movie-going public.<br><br>7/10","user":"dee.reid","rank":[10,14]},{"title":"Great movie","rating":10,"date":"1 March 2006","review":"For One Night...It was a great movie. The movie hit on a very informative subject about the world in which we are currently living. It is still hard for me to believe that racism still is so prevalent in our day and age. The setting is very familiar to me since I grew up in New Orleans and had no idea of went on right in our own back yard. Glad to see something so sensitive exposed to our newer generations. The acting in the movie was great. The kids seem to be into their characters. Wardrobe was in excellent taste. I especially liked Raven's best friend in the movie..Sela. She's a doll with lots of fiestiness to her;) I'd like to see her more in TV movies or rather on the big screen.","user":"creolecookie_1","rank":[15,23]}]