[{"title":"A tense thriller with top-notch acting and writing","rating":8,"date":"26 April 2009","review":"About a month before State of Play came into theaters, I read an article in The Washington Post (I live in the D.C. area) about the realism of the news industry as portrayed in the movie. One of the Post reporters served as a consultant on the set and I must say that he seems to have done his job. Almost every aspect, from the constantly chaotic state of the newsroom to the reporter-lingo, feels authentic and true to reality. While there are occasional times when the movie's main character, the reporter Cal McCaffrey, strays from the usual ethical and professional guidelines, there are logical explanations for such instances that are given in the movie. At one point, Russell Crowe even ad-libs a line about the outdated technology he has compared to the state-of-the-art computers given to Della Fry, Rachel McAdams's gossipy blogger: \"I've been here fifteen years, I've got a sixteen year old computer. She's been here fifteen minutes and she's got enough gear to launch a f***ing satellite.\" This line was inspired by the feud between print journalists and their online counterparts that, according to the Post reporter, exists in real-life. Because journalism is so crucial to the story of State of Play, every minute detail contributes greatly to the believability of the film as a whole and it is this attention to detail that really elevates State of Play above the average political thriller.<br><br>The cast, which includes three Oscar winners, though Ben Affleck won for screen writing, could not be more perfect. With his long, shaggy hair, bulging belly and old, trash-littered car, Russell Crowe looks appropriately scruffy and he disappears into his role, becoming one of the most convincing journalists on screen in recent years. It is impossible to imagine anyone else in the role, especially Brad Pitt, who was originally signed on for the part. As his partner on the story, Rachel McAdams delivers, giving her character a very energetic yet idealistic flavor. Della Fry is, at least in the beginning, a rather obnoxious woman but, in large part due to McAdams, she gradually becomes more likable and we learn to accept her for who she is. Helen Mirren is splendid as Cameron, McCaffery and Fry's insistent boss, and every time she appears, the screen comes alive (not that it's dead when she isn't there). Ben Affleck once again proves that he can act when given the right material. He gives his character, a promising congressman, an air of detached arrogance mixed with frustrated vulnerability. Representative Stephen Collins certainly has his principles but throughout the film, that sense of morality is largely shrouded in secrets and mystery and the audience is forced to constantly guess and re-guess his true intentions. Aside from the main actors, the supporting cast does a terrific job with a slightly comedic, almost delightfully over-the-top performance by Jason Bateman as a pretentious PR agent. Also worth noting is Viola Davis, who plays a contact of McCaffrey's in the morgue, and even though she only appears in one scene, she makes the most of that short screen-time that, in turn, makes us remember her well.<br><br>Other than the superb cast, one of the most impressive things about State of Play is the script, which was written by Tony Gilroy, Billy Ray and Matthew Michael Carnahan and based on the 2003 BBC mini-series of the same name. However, it bears Tony Gilroy's distinctive mark not only because it involves corporate conspiracies and unending twists, but the witty dialogue could have been written by almost no one else. Occasional instances of humor help lighten the otherwise rather dark mood. Also, the writing is highly intelligent and makes the audience actually think rather than simply go along with the complicated plot. This can also be contributed to the direction of Kevin MacDonald who, after winning an Oscar for his documentary One Day in September in 1999 and directing the Oscar-winning feature film The Last King of Scotland, proves that he has loads of talent and hopefully, will remain prominent in the film-making industry.<br><br>Other noteworthy aspects of the movie are the cinematography and the score, both of which help carry the tension throughout the entire two-and-a-half hour film, even during quieter scenes. However, State of Play is not quite perfect. The main, and perhaps only, flaw is the minor plot holes that, while virtually unnoticeable during the actual viewing of the movie, become more obvious upon dissecting the movie afterwards. It is impossible to discuss these errors in detail without giving anything away, but they do make the conclusion a little less satisfying.<br><br>Nonetheless, the movie is so good in all other areas that it is still easy to overlook the implausibility of the ending. From the virtually flawless cast and writing to the authenticity of its portrayal of journalists and the thought-provoking political themes, State of Play stands out among all the conventional political thrillers churned out by Hollywood in recent years. Go see it!","user":"Reel_starz","rank":[99,118]},{"title":"A solid and interesting old-fashioned political thriller","rating":8,"date":"15 April 2009","review":"Congressman Stephen Collins (Ben Affleck) is helping with the government investigation of a shady military-based company when he receives word that his mistress has committed suicide. Visually distraught, he leaves a hearing in tears and sets off a media circus. Seasoned reporter Cal McAffrey (Russell Crowe) was his roommate in college, and the two have remained friends. In a bid to quash the political blogging of junior reporter Della Frye (Rachel McAdams), McAffrey sets out to find the truth about the story.<br><br>State of Play sets itself up early on to be a cookie-cutter, predictable thriller. But as the film progresses, it rather quickly becomes the twisty and conniving thriller it needs to be. Despite being heavily dialogue driven, the film is an intense ride that will keep people on edge throughout. Some scenes are downright terrifying in their amped up suspense and political intrigue. This film really set out to be tense, and succeeds wonderfully. It knows just what punches to pull, and when to pull them.<br><br>The script, written by political scribes Matthew Michael Carnahan, Tony Gilory and Billy Ray, is insight and intriguing. It could have easily been made boring and inundated with rehashed politicalisms (like all of their last films), but this film revels in how interesting it becomes. It has laughs strung throughout (a genuine surprise), and lacks the nerve to become loaded to the brim with facts and innuendos. Instead, it expertly weaves between scenes, amping up the intensity of some scenes, and downplaying others.<br><br>But this is mainly due to the incredible performances by the cast. Crowe (who I usually loathe) and Affleck are simply outstanding in their roles. Age issues aside, both play their character with finesse and charisma. Affleck looks and acts like a confused wet-behind-the-ears, gunning-for-higher-office political pawn from beginning to end. Some of the reactions on his face are downright devastating in how excellently they are conveyed. And this is a guy critics once said could not act. Coupled with one-two shot of acting in Hollywoodland and directing Gone Baby Gone, we may be seeing a renewed resonance and importance for the Oscar-winner. Crowe on the other hand, delivers his strongest performance in years. While he has been downplayed and underused in his last few films, he carries this film. He is stubborn and vaguely likable, but he makes his character work for all of his idiosyncrasies and ethically-questionable tactics. He makes a seasoned journalist look like an amateur.<br><br>McAdams, all but a ghost recently, holds her own against the two heavy-hitters and delivers a performance that is both inspired and emotional. It gives her a lot of room to act, and she delivers in every instance. The rest of the cast is a bit mixed however, as so little of them is given that much to do. Harry Lennix, Robin Wright Penn, Jeff Daniels, the horrifying Michael Berresse and especially Jason Bateman, all deliver noteworthy performances, but never get to really shine in them. They all have their traits and motivations, but get little screen time to truly express them. They each are developed quite strongly, but they lack the movement afforded to Crowe, Affleck and McAdams. I simply loved Helen Mirren's scenery-gauging editor and all of her subtleties. But she too, is downplayed to the point of almost barely being in the film.<br><br>Despite its intensity, the film is bogged down by its dialogue-heavy scenes and consistent character additions. It is easy to keep track of everyone, but so many people are introduced that the film loses its focus on more than one occasion. It makes for a few scenes that are merely filler between the scenes of useful heavy acting. It just feels so tiring. I understand now how daunting a task it must have been to convert six hours of British television into a 127-minute film, but there are scenes that are just too easy to not have been cut out (some entire mildly useful subplots may have helped). Adding characters in makes sense for a story about two journalists frantically searching to lift the lid on a story, but there needs to be more emphasis on what was needed and not needed. A brilliant montage in the middle of the film goes almost entirely to waste because the filmmakers lack the knowledge of what should be cut. Limiting the preposterous and silly climax could have also done wonders. The scenes that are left in the film (including the finale) are great, but they could have been stronger if they were as tightly wound as the film wants itself to be. A little less shaky hand camera movement could have also significantly benefited the film.<br><br>Even with its problems, it is clear from the on-set of the first shot in the bullpen at the Washington Globe that the filmmakers are going for a very keen sense of homage to All the President's Men. While the on-going and very professional relationship between McAffrey and Frye is very similar to Woodward and Bernstein, the fabric of journalistic integrity and researching are the core of State of Play. The film is loaded with allusions to the Oscar-winning film, and even mimics shots right out of the film. While it is obvious for anyone who has seen Men, this film's nods are done in such a delicate and unique way that they never become distracting or blatant. The film is its own, and does not ever feel like it is living in its big-brother's shadow. It is a fresh take on old-fashioned reporting in a very digital age, and frequently walks the tight line of old versus new.<br><br>State of Play looked interesting, and surprisingly delivers on almost every count. It is not a perfect film, but it is a solid example of great film-making. It wants to be more, but seems content at being a twisty and suspenseful modern thriller. <br><br>8/10.","user":"DonFishies","rank":[166,216]},{"title":"Yesterday's News Still Blog-Worthy","rating":7,"date":"20 April 2009","review":"A gruff old-school reporter (Russell Crowe playing his A-game) becomes personally entangled in a breaking news story surrounding his old college buddy turned congressman (Ben Affleck, not as bad as you would think) and a young female aid who died under mysterious circumstances in the surprisingly plausible political thriller \"State of Play\" from director Kevin MacDonald who was previously responsible for \"The Last King of Scotland\". Though designed as a throw-back to paranoid investigative thrillers from the 1970's, relevance is gained when the massive cover-up revealed becomes a vehicle for the filmmakers to explore the death of print news at the hand of digital mediums.<br><br>The twisty and engaging screenplay is credited to three scribes: Matthew Michael Carnahan, Tony Gilroy and Billy Ray. But it's Gilroy's fingerprints that shape the story with all the overlapping dialogue and conspiracy talk that will remind many of his \"Michael Clayton\". Adapted from a sprawling BBC miniseries created by Paul Abbott, the trio is especially deft in their condensing of the story into a fully digestible two hours. Even as new characters and twists keep coming, the audience is never left out in the cold. They also give the cast plenty to chew on with some great throw-away lines amidst all the posturing between the cops, reporters, politicians and sleaze-bags.<br><br>Though it's Crowe and Helen Mirren as his sparring and quick-witted boss who shine the most, this is essentially an ensemble piece, and it's especially clever when Jason Bateman arrives on screen for a few pivotal scenes as a smug public relations guru who's too dumb to realize he knows too much. The cast also includes Robin Wright Penn as Affleck's wife, Jeff Daniels as the arrogant majority whip and Harry Lennix, who as a D.C. detective makes a compelling case here for the lead role in the Barack Obama Story. The only miscalculation in the casting is poor Rachel McAdams, lovely but annoying in her high-pitch as Crowe's blogging tag-along looking to kick it old-school and get something in print.<br><br>By the third act \"State of Play\" overplays its hand in its attempts to be timely with too much talk of the privatization of the military, Capitol Hill sex scandals and traditional newspapers losing out in the digital age to bloggers more concerned with gossip than real journalism. It could've also been more subtle in its preaching about the importance of serious investigative reporting. It should be commended, however, for an otherwise smart screenplay that doesn't spell out all its twists and turns too early and the well polished cast who give the film a slick sheen. Even though it might be reporting on yesterday's news, \"State of Play\" still makes for solid rainy day entertainment and is worthy of blogging about.","user":"WriterDave","rank":[80,102]}]