[{"title":"a true romantic comedy","rating":10,"date":"2 February 2006","review":"This movie is striking...I couldn't disagree more with the opinions that it lacks heart and conviction and is built up on too many clichés. Obviously with the genre it is difficult to avoid these things, but Ol Parker did a wonderful job breathing life into this love story. I walked in with very few expectations and left wanting to own a copy to watch again and again.<br><br>The characters, if somewhat two dimensional, are relate-able and passionate. Rachel is flawless, perhaps the best I have seen of Perabo (especially compared to her performance in her other lesbian film, 'Lost and Delirious'). The movie is worth seeing for her alone--she conveys with the simple wring of a hand or glance a thousand words. She brings to the part the giddy excitement of anyone who's ever been in love before, but at the same time deals with the obstacles of marriage and her newfound homosexuality in very real ways.<br><br>Matthew Goode also has a very praise worthy performance. In fact, most of the actors here really are excellent in their parts and their timing is brilliant. I laughed out loud multiple times and it was nice to see 'funny girls' on their own terms in the current Hollywood of 'Wedding Crashers' and 'Anchormen' where comedy is becoming routine and lackluster. Gotta love the British humor! <br><br>On a final note, this is an exceptional film in my eyes for the way it handles the lesbian theme. Parker is tasteful and human about it, making it about love more than anything else. This is the kind of atmosphere that makes you believe in love, whether you're gay or straight, and have faith that there is one person out there if only you'll keep your eyes open.","user":"duffy-mn","rank":[165,202]},{"title":"MPAA is stupid.","rating":17,"date":"17 August 2006","review":"I am not here to talk about this film. I am FUMING because of the MPAA rating for this film. Rated R. ARE YOU KIDDING????????? This film was a harmless romantic comedy just like the millions out there: Pretty Woman, Notting Hill, How to Lose a Guy in 10 Days- all of which are rated PG 13. I am so angry at the blatant discrimination in the rating of this film. Because it portrays lesbians FAIRLY (meaning, no one freaks out about their sexual orientation), it is rated R. And this might be no big deal. I mean, after all, we can all watch this film as adults. However, the blatant discimination makes me angry. And furthermore, making this film, like thousands of other films about LGBT people unavailable to a younger audience further isolates and \"other-izes\" LGBT people. Its not right.","user":"gringa_chola","rank":[168,209]},{"title":"Refreshingly delicate","rating":10,"date":"14 June 2006","review":"Imagine Me and You is best described as delicate. Very simply this film is about love.<br><br>As a British romantic comedy, Imagine Me and You will always draw comparisons to films such as Love Actually, Notting Hill and Four Weddings and Funeral but the level of reality portrayed in these films compared to Imagine Me and You is one of the major distinctions. Glittery moments, such as the doorstep scene between Keira Knightley and Andrew Lincon in Love Actually, are few and far between in the film, but this is by no means a criticism. The film never lacks any tenderness, in fact quite the contrary as it creates a greater impression of reality because of less ostentatious cinematography and mise-en scene. Occasionally the film falls into the trap of representing a very American idea of Britishness. The characters are all upper class Londoners, attractive, well-off with successful jobs. The male characters are foolish, awkward, hapless 'twits' but this does not detract from the charm of the film.<br><br>The film follows Rachel (Piper Perabo) her fiancé/husband Heck (Matthew Goode) and their wedding florist Luce (Lena Heady) who immediately has an impact on Rachel leading her to re-assess her seemingly perfect relationship.<br><br>The film honours love of different kinds. The love between Rachel and Heck, who are married at the beginning of the film is never disputed or questioned, they were best friends and this developed into a quite obvious love and adoration between the couple. Rachel loves Heck, but she is not *in* love with him. However, with Luce, Rachel experiences the instant, intense, exciting, passionate, all encompassing love at first sight. The fact that Rachel is experiencing this with a woman is not the issue, but rather that the first time Rachel catches Luce's eye is on her way down the aisle. <br><br>Unlike other films of the same genre, the characters are well developed and multi-layered. The comedy is typical foot-in-the-mouth humour, and silly one-liners, but is delivered with impeccable timing mostly by the parents. (Anthony Head plays an excellent aged Hugh Grant character and Celia Imrie is wonderful as a prim and proper, sharp mother.) The other performances are subtle, with all of the tenderness, heartbreak, humour, intensity and confusion that the script asked of the performers.<br><br>Imagine Me and You has high production values, is written and directed with care and sensitivity the truth isn't over thought, over polished, or softened and is a refreshing modern representation of love.<br><br>But of course, most important for a British viewer - Piper Perabo's accent is remarkably good.","user":"A4refilpad","rank":[84,104]}]