[{"title":"A Joyful Film About Death","rating":10,"date":"10 June 2006","review":"As usual Altman will divide his audience in a radical way. He, clearly, doesn't do it on purpose but it happens more often than not with the works of real artists where there is no room (or very little) for concessions. It is what it is, his vision, his whole. He mentioned that the film was about death and found that not everyone agreed not even some of his closest and more devoted collaborators. That's what he saw, that's what it is but it's bound to be contradicted by critics and audiences alike. Personally, I don't think I'll see a better film this year. The work of an idiosyncratic artist and masterful craftsman doesn't hit the main stream screens every day of the week. My only reservation is that the film is too short. I wanted to go on and on and on. To say that Meryl Streep is sublime seems kind of redundant but never mind, she is, sublime, surprising, funny, very funny, moving, very, very moving. Lily Tomlin and Meryl have the best moments in the film. They appear, look and sound as if they had been working together all their lives. Total chemistry. Lindsay Lohan is the biggest surprise. Good for her. That's the way to forge a way ahead. Work with the best. Woody Harrelson and John C Reilly are simply glorious. Kevin Kline does a Kevin Kline in the most enchanting way. It was also a delight to see Garrison Keillor himself playing himself, not just wonderfully but very convincingly as well. I recommend it with all my heart.","user":"arichmondfwc","rank":[184,214]},{"title":"I'll give you my moonshine if you show me your jugs","rating":25,"date":"25 March 2009","review":"Robert Altman begins \"A Prairie Home Companion\" with a reference to Edward Hopper's \"Nighthawks\": it's a wet and rainy night, but sitting inside the warm glow of a 1950's styled diner, detective Guy Noir nurses a cup of coffee. He then pays his tab, stands up and walks outside, pulling his coat over his shoulders as he braves the rain. In this one sequence, Altman sets up the paradisaical enclaves of warmth, light and shelter that will feature throughout the film. The world is a harsh and uninviting place, but the lights of a diner, the songs of a radio, the crackle of campfire tales, help us all get through the night.<br><br>The film's plot then unfolds in typical Altman fashion. A gang of singers and radio performers gather together at the Fitzgerald Theatre for their final performance. The theatre is being closed down and so a mood of nostalgia, regret and sadness hangs heavy in the air.<br><br>As the film progresses it then becomes apparent that all its conversations and subplots hinge on death, suicide, temporality, failed relationships and regret. Nothing is permanent, everything passes. Indeed, Guy Noir, the film's singers and the Fitzgerald Theatre itself, are literally and figuratively \"out of time\"; they belong to an era which has long passed, or is passing, away.<br><br>And yet whilst the many sequences, anecdotes and conversations that run throughout the film emphasise perishability, you'd be hard pressed to find a film more cosy and inviting. Time and time again, Altman clashes the warmth of friends and family with ominous feelings of dread, death and a kind of festering temporality. A song sung by actress Lindsay Lohan toward the end of the film seems to be the point at which they intersect, suicide, death, impermanence, family and art coming together to form something that is at once beautiful and sad. The result is that the film eventually becomes both elegy AND a celebration of the way humans huddle around flickering camp fires to tell stories and sing songs in an effort to stave off the darkness. And as Altman's title suggests, \"companionship\" - be it the companionship afforded by communities or strangers on radios - becomes the key to weathering what is really an existential storm.<br><br>But what makes \"Companion\" great is the graceful way in which it carries itself. Altman's camera is fluid, always shifting planes, always moving slightly, always a bit higher or lower than usual. Altman hasn't used this style since \"The Long Goodbye\", but here modern technology and lighter cameras have allowed him to attain a new level of grace. There's none of the rigidity of \"Short Cuts\" or \"Kansas City\", but instead a sort of elegance that Altman has tried (and often failed) to attain throughout his career, effortlessly switching back and forth between characters, sounds and spaces without the use of intrusive zooms. One wishes all of Altman's films were shot this way. <br><br>There are other great things here as well. Not since \"MASH\" has Altman assembled such a warm bunch of people. Actors Woody Harrelson, Streep, Tomlin and Lohan are all either hilarious or infectious, and Kevin Kline's private detective, Guy Noir, somehow manages to straddle the line between funny and effortlessly cool. With his over-elaborate Chandleresque dialogue, he's arguably the funniest noir detective since Jeff Lebowski.<br><br>Then there's the music, which at times surpasses the ballet sequences of Altman's \"The Company\", the jazz music of \"Kansas City\" and the country music of \"Nashville\". It's hard not to crack a smile when Harrelson sings \"Bad Jokes\", a song which seems to be about women and horses but is really about the biggest bad joke of all: life. Elsewhere the film's skits and songs manage to be both moving and funny.<br><br>Then there's the film's location: The Fitzgerald Theatre, with its dark rooms, romantic lights and cosy atmosphere. Altman's camera probes these rooms and corridors, creating a tangible sense of place. He sketches a location that manages to be homey and inviting, but also incredibly precious, like the flickering glow of a dying candle flame.<br><br>The film ends powerfully. The Fitzgerald Theatre has long been shut down, and so our radio performers (a pair of cowboys, a noir detective, an old man and two gospel singers) sit around a diner table discussing old times and talking about their struggles to find new jobs. An \"angel of death\" then approaches this table, at which point Altman switches to the angel's POV and has his cast look directly down his camera. \"Is it my turn now?\" their faces imply. \"Are you here for me?\"<br><br>The result is that we the audience become death, Altman's cast's very existence now dependent on us. Do we listen, do we watch, do we read, or do we turn away? Altman both implicates and chooses for us, suddenly cutting to a shot of the performers all back at the Fitzgerald Theatre, singing and having a blast. This, of course, is a direct contrast to the pessimistic ending of Altman's \"Five And Dime, Jimmy Dean\", a similar film which ended with ominous shots of a decaying and dilapidated diner, death claiming the film's cast and landscape.<br><br>It's such juxtaposition which makes \"Companion\" special. Less caustic than most of Altman's pictures, the film's very much an intimate wheel of creation and destruction, of men withering away and babies blossoming into existence, of characters giddily sneaking off to make love and pregnant women cursing their heavy stomachs, of art warming the soul and time looming heavy on the mind like a thundercloud.<br><br>9.5/10 – Everything here Altman's done before, but never with such economy, grace, beautiful acting and humour. \"Prairie\" is funnier than \"Mash\", sadder than \"McCabe\", more noir than \"The Long Goodbye\", has better music \"Kansas City\" and perhaps makes better use of spaces than \"Gosford Park\". Fittingly, Altman died after the film was completed. It's arguably his last masterpiece.","user":"tieman64","rank":[13,13]},{"title":"A song of love . . . .","rating":5,"date":"5 June 2006","review":"\"It's not true that I had nothing on. I had the radio on.\" Marilyn Monroe about posing nude on her famous calendar.<br><br>If there is anyone more laid back or brighter than Garrison Keillor in show business, let me know, because Robert Altman's A Prairie Home Companion, based on Keillor's long-running Minnesota Public Radio saga, shows Keillor as an audience sees him each weeklike a god gently guiding an eccentric ensemble through excellent performances made to look as easy as his demeanor. This film stands near Altman's Nashville as a testimony to the director's gift for sustaining strong characters in layers of dialogue approximating overlapping conversations at an interesting party.<br><br>Meryl Streep and Lily Tomlin as the singing country Johnson sisters bring back memories of Reese Witherspoon's amazing turn as June Carter and Streep's own previous country singer in Postcards. Ditto Woody Harrelson and John C. Reilly as the singing and joking Dusty and Lefty. But best of all is Kevin Kline as Keillor's real radio creation, Guy Noir, the '40's dapper, inquisitive, naughty narrator and security head for the production. Klein embodies the melancholic mood always at least hidden underneath any show's last show, despite Keillor's nonchalant assertion that every show is your \"last show.\" Around this realistic, charming premise of talented performers at their last performance, writer Keillor interjects a ghostly beauty in a white leather trench coat, Virginia Madsen playing Dangerous Woman, the spirit of death, gently accompanying those about to die and the moribund show itself. The character is a lyrical embodiment of the theme that nothing lasts but the love shared in any experience. Keillor remains in character after someone dies by stating he doesn't \"do eulogies.\" Nor does he do one for the show, which in real life still lasts in St. Paul from 1974.<br><br>So enjoyable are Altman, his ubiquitous HD camera, and his busy dialogue that you feel a part of the proceedings, catching the sweet smell of success for everyone attached to this thoroughly realized song of love to theater, music, and creativity.","user":"jdesando","rank":[117,147]}]