[{"title":"Horror Sci-Fi Film Festival in Arizona","rating":24,"date":"24 October 2005","review":"I made it to a screening of \"Feast\" at the International Horror Sci-Fi Film Festival in Arizona on October 23rd. I was really into the Project Greenlight show and from watching the show, I still didn't know what to expect from the film. It wasn't too long into the movie that I realized, even if you watched every episode of Project Greenlight as I did, you still don't see this coming. The movie was great! I sat back in my seat and went for a ride. It wasn't even 100% completed yet. A couple of scenes were too dark and it didn't have any credits. But it was so entertaining. They made this project for the horror genre, and they aren't going to let anyone down. There is so much blood, gore, and action in this film. The action sequences were a sight to see on the big screen. I was truly blown away with how good everything came out. John was there with his girlfriend Diane and one of the writers. They did a Q&amp;A after the screening and were very outgoing with the audience. After the screening they joined me and a bunch of Arizona talent at a nearby bar to hang out. He answered questions and was very cool to chat with. I hope they don't have any problems with getting this movie into theaters nation wide. It's a fun story with everything you want in a horror movie. You have to check it out when you get the chance.","user":"rosete","rank":[84,129]},{"title":"Kicks butt for a million bucks!","rating":10,"date":"24 October 2005","review":"Saw this film at the International Horror &amp; Sci-Fi Festival in Tempe, Arizona last night. This is the first film that I have seen from the \"Project Greenlight\" series. Since the film was made for only a million bucks, I expected \"Feast\" to be loaded with lots of things that would show that it was shot on a low budget. Well, there wasn't any CGI special effects and 99% of this film was shot inside the bar, but other than that, I didn't feel anything else was compromised that would affect the quality of the film. In fact, this film kicks more butt than most multi-million dollar horror and sci-fi flicks! \"Feast\" takes place inside a bar in the middle of the California desert. At one moment, a bloodied man shows up with a dead creature in his hand. He says there are four of them, he doesn't know what they are or where they came from, except that they devour and kill anybody they see. Within minutes, the creatures suddenly show up, the carnage begins and all hell breaks loose.<br><br>What I liked most about this film was the comical intros for all the lead characters: \"hero\", \"loser\", \"expects nothing in life\" etc.<br><br>Director John Gulager and one of the writers, Marcus Dunstan, chatted with the audience after the screening. According to John, the film was scheduled for a January 2006 release. Unfortunately, the turmoil at the film's distributors has put \"Feast\" on the shelf at least for now. Hopefully, something could be done to get this film out to the public, word of mouth is already out and \"Feast\" stands to make millions at the box office.","user":"phoenixandrew","rank":[101,160]},{"title":"Great late night film","rating":8,"date":"15 October 2005","review":"I saw this movie last night at the Chicago Film Festival. This movie is not one that will change lives or addresses pressing social issues. Though it would be easy for somebody to say that it is a metaphor for our day and time with terrorist threats and all, but somebody even could do that with Cheaper by the Dozen. So anyway about Feast, it's a great film to watch.<br><br>The premise is very simple a bunch of strangers are locked in a bar for the night as monsters try and get in. There really isn't much more to it and that is where the beauty of this film lies. I have heard that Marcus, one of the writers described this as a movie that you start watching on TBS at 2 am and you don't finish, which is a great description for it. <br><br>The performances are pretty strong because the actors seem so relaxed in them. The best performances come from Balthazar Getty, Duane Whitaker, Clu Gulgar, Krista Allen, and Josh Zuckerman. The work of the Thomas L Callaway the cinematographer is great, especially in the final showdown scene, some may complain about not being able to see but the red color that covers the scene is great. The final shot of Krista Allen behind the rising sun is just beautiful, even if it is only a simple horror movie. <br><br>The main credit goes to John Gulager, whom despite all the \"drama\" shown on Project Greenlight, has crafted a really enjoyable film. He took all the raw elements of the production and crafted just an amazing final product. This is a movie that I will suggest to people who just want to enjoy themselves in a theater.","user":"fishbulb11","rank":[69,107]}]