[{"title":"Excellent movie","rating":10,"date":"6 January 2007","review":"I was very disappointed to learn that this movie was only going to have a limited showing in the US, only one or two theaters on either coast. My wife and I both enjoyed \"Flags\" and were pleased when we learned that Clint Eastwood made a second movie, this time telling the story from the Japanese perspective. As luck would have it, we going to Japan for the holidays so we decided to try and see the movie in Tokyo during our trip. We went to the Ginza area of Tokyo and, to our surprise, the movie was completely sold out. We needed to buy tickets at least one day in advance. Further, we learned that the movie was currently number 1 in Japan. Wow  that's impressive that an American made movie would become number one in Japan! Way to go, Clint! After a little extra planning and some adjustments to our schedule, we bought advance tickets and came back the next day.<br><br>We completely loved it. We were moved and stirred with many emotions including anger, anger over the horrors of war. We actually liked it better than \"Flags of our Fathers\". The movie was in Japanese and, as near as we could tell, Japanese appears to be the native language of the film. There were brief moments of English, American solders talking, one flash back scene before the war during a foreign dignitary dinner, and of course the credits at the end. The movie would have to be translated and/or sub titled to English in order to have half a chance in the US. Frankly, I think translation would take away from the movie's beauty and meaning. I understand a limited amount of Japanese so I could follow most of the story. The theater was very big and packed. I was a little uncomfortable at first; I may well have been the only American in the place. My wife (who is Japanese) and I sat next to an older couple. At several points during the film, I thought I noticed the man from the couple crying. When the film ended, my wife talked with the couple and learned that the old man's father died in Iwo jima. Later during the trip, speaking with Japanese friends and seeing the Japanese news, stories of lost loved ones from the war were common and this movie for the Japanese people has brought many of these memories out in the open.<br><br>To the Japanese, Iwo jima was a part of their homeland where a foreign invader was going to land and begin its invasion on Japanese soil. Throughout all of recorded Japanese history, never had a foreign invader prevailed in war against the Japanese on Japanese land. The imperial Japanese government of that time used this when they sent fighters to Iwo jima. These fighters were to ordered to \"fight to the death\" defending their country. That to loose and not die fighting would bring disgrace to self and family. They knew that America was planning to send an overwhelming force and they knew that they were being sent to die. For Americans, Iwo jima was just another far away place and different point in time where American boys were sent and where, unfortunately, some lives were lost fighting for freedom. My god, have we become that blasé about the wars our sons and daughters are being sent to fight in? My wife and I are unique, not typical American movie goers. I'm American, my wife is Japanese. Together, we've visited and cried together at the A-bomb Dome in Hiroshima, and again at the Arizona Memorial in Hawaii. I have relatives who fought in the Pacific, she also has family who fought in the war and who lived in Hroshima. I have two sons now serving in the US Marines. Together my wife and I watched and enjoyed both movies. The movies really didn't bring anything new, historically, to us about Iwo jima. But, the movies did do an excellent job reminding us that the ones who pay the price for war are normal everyday people. People who really don't understand the reasons or the politics behind why they are being sent to die. People who live, love, and are loved by family and friends. People with dreams and ambitions. But, for some reason when called by the leaders of the time, they go forward, obey orders, and do their duty. Sometimes, paying the ultimate price.<br><br>I've grown up with Clint Eastwood and it has been a wonderful entertaining journey. These two movies are, in my opinion, his best. Not because of the action, or the drama, or any of the other things that Clint Eastwood is known for, but because he's given us two interlinked stories about the affects of war on the people who are called to pay the ultimate price  people like you and me. We may be from different cultures, eat different food, speak different languages, prey to God differently, but we all have things in common. We all live, love, want to be loved, and we dream about and long for peace. And, sometimes we are called to serve and pay for the opportunity. Thank you Clint.","user":"sford-20","rank":[701,764]},{"title":"Very Personal","rating":9,"date":"20 December 2006","review":"Did it really last two and a half hours? It felt felt a lot shorter than that.<br><br>No, this is not an action war film with nonstop blood baths. It is a film that pulls the humanity out of the monster that is war.<br><br>This is one of, if not the best, movie ever directed by Clint Eastwood. I usually have a hard time following plots with many characters because they make me lose focus on the general story, but this one is done well. Not only am I engaged, I also become attached to every character and feel and understand their conflicts.<br><br>It does not matter who fights on the right or wrong side of WWII. This film goes beyond that. It is about what is right or wrong for the individual human being. It excels as a story about the human heart.","user":"deenying","rank":[385,429]},{"title":"One of the Greatest War Films Ever Made","rating":10,"date":"31 December 2006","review":"In the second half of \"Letters from Iwo Jima,\" a group of Japanese soldiers find an American who has been badly wounded and take him into their cave. Their general speaks English, so he begins talking to this soldier, whose name we later find out is Sam. Although the two men should be sworn to kill each other, they are able to have a connection in the one conversation they have. A while later, the general comes back into the room only to discover that Sam's wounds have killed him. He searches him for a while and discovers a letter written by his mother. The letter is full of words that truly come from the heart of this kid's mother, and by the time the general finishes reading the letter, every soldier in that cave has realized that Americans aren't these savages; these hate-driven murderers. No, they all realize that Americans are exactly like they are, and that they don't want to be there and want to return home safely just like their enemies. I believe the point that Clint Eastwood is making with his Iwo Jima saga is just this: these two enemies were far more alike than they had imagined and they were both fighting only in hopes of returning home safely to their family. <br><br>As for the specific film itself. In just about every way imaginable, this absolutely brilliant film is a step up from \"Flags of our Fathers\" (which is not something I say easily, as \"Flags\" is a terrific film in my opinion). From the acting of the incredible ensemble cast (most notably from Ken Watanabe's Oscar-worthy performance), to the film's delicate but powerful script, to the beautiful imagery of the film (the color distortion could not be any more brilliant than it is here), to Clint Eastwood's absolutely perfect knowledge of film and what works in a film like this. <br><br>Many people are wondering whether this will be able to compete for Best Picture at the Oscars this year. It is true that just about all of the film is spoken in Japanese, but the truth is that Eastwood has created nothing short of a masterpiece with this work, and a foreign language doesn't even come close to making that extremely obvious. I think that this film is very comparable in quality to Steven Spielberg's (who is one of the producers of the film) \"Saving Private Ryan.\" Although Spielberg's film has more entertainment value (as it features more action) and has an opening scene that cannot be contended with, Eastwood sends out an even more powerful message about war than Spielberg did, as it turns out that watching soldiers battle with no way out makes you feel the pains of war more than watching the soldiers on the invading side of the army. The fact that \"Ryan\" was able to strongly compete for Best Picture (and just about win the award) makes me very certain that this film has great chances, even if Martin Scorsese seems to be tough to beat at this point. What I think allows this to compete with \"The Departed\" is the fact that this film doesn't take the \"cool\" route that Scorsese took, which isn't something that the Academy has honored in the past. <br><br>The score, written by Kyle Eastwood (Clint's son), captures the feel of the movie better than any score written for any movie this year. It is very quiet music, but listening to it makes you think about all the people that die as victims of war. <br><br>To sum it all up, \"Letters from Iwo Jima\" is one of the greatest war films ever made, and is easily does the best job of depicting war as something that harms all involved that I have ever seen. Clint Eastwood has, with this achievement, engraved his name as one of the greatest American directors in film history.","user":"billybobwashere","rank":[277,312]}]