[{"title":"Good? Yes. Great? Oh Yes.","rating":10,"date":"16 October 2005","review":"First off, non-fans of The Batman animated series will be harsh on this, but if you aren't a fan you should still give it a watch. The story is Dracula is causing trouble in Gotham. It's a simple story, which is fine, the movie is only about 80 or so minutes long, but it has time to breath and doesn't drag.<br><br>The show, is a very vibrant, action oriented, in your face cartoon, which is fine, it suits the show. As a movie, that presents some hurdles, primarily ta deficit in plot development and the potential for overlong climaxes. Well there are no pacing issues, the movie starts off pretty fast, but manages to keep speeding up at a noticeable, but not problematic, pace, as a good and well thought out movie should.<br><br>Voice acting and music is top notch, there were some really strong themes towards the end, and I wish they had put more into the music, but it provides more than enough. I'd buy a score if one were released, as I would also be looking forward to more in the ways of arrangement and music come a second feature.<br><br>Many will try to compare this to Batman Beyond: Return of the Joker, or Batman: Mask of the Phantasm, and some will try to compare this to Batman Begins, which is all fine and good, except that it is quite difficult see beyond in the style in the four movies. And that is what this is, an exercise in style, but much to my delight, it is not style over substance. Though short, the film is quite solid in both character development and tone.<br><br>Lastly, where the movie excels is in the action. Do no forget, The Batman is fighting a villain that physically outclasses him, but the fights themselves are well animated, well organized, and visually impressive, as in The Batman's fluid movements, he some how gives an incredible fight.<br><br>This is an excellent movie, and I am glad I have seen it. Fans of the show,will love it, and fans of the comic will enjoy a solid representation of the mythic hero if they can remain unbiased. Though it is a bit violent and in your face when it comes to gore, it is a great film, and I eagerly await more. It looks like we have a winner.","user":"gohmifune","rank":[34,42]},{"title":"A pretty good movie AND A few corrections","rating":9,"date":"11 December 2005","review":"Overall a really good flick. much better than dini's later efforts for Batman direct to video movies. First of all, Vicki Vale IS a redhead contrary to what the other user posted, she was turned blonde by Hollywood, but DC comics the original character was a redhead. Secondly Batman did use his head, he knows his strengths and he knows ho to goad his enemies into doing what he wants them too, Bruce put his body on the line to get Dracula into the position he needed him in, He had to go hand to hand again, to save Vicki and the citizens, also he had the sense to give Alfred his position so that he could ready that sun machine - it was strategy, just like chess sometimes you have to sacrifice valuable pieces for the ultimate victory. <br><br>One thing i really liked is we finally (in this incarnation of batman) got to see the scientist behind the bat. <br><br>I love the animation in this as well, the fight scenes are choreographed and animated superbly, it's still not as complex as Batman TAS overall - but if they keep doing DTV movies with more mature themes I think they will easily have some classics on their hands, this movie was fun a little corny, but all super-heroics are, but overall very fun to watch.","user":"garryhess","rank":[11,12]},{"title":"Good vampire film, animated or not","rating":8,"date":"17 November 2009","review":"This review comes from a fan of Gothic vampire stories like Dracula, and someone who has sporadically enjoyed Batman in comic books but never cared about the film series - including Dark Knight. Batman VS Dracula: The Animated movie (2005) is refreshingly old-fashioned and successfully atmospheric story where Dracula has his Gothic style, including preference for eeriely beautiful graveyards. This is not some trashy upstart like vampires from cooler-than-thou garbage Blade - and to put it bluntly, the word \"cool\" makes me think sleazy bully who tortures fat nerds and sleeps in his own filth when drunk. One typical mistake - Dracula burns in sunlight, unnecessary twist added by movie makers in 1922 - is used in the film, but that does not affect the atmosphere, of course. Animated or not, this is one of the best vampire films of the decade, which has been full of trash.","user":"minamurray","rank":[7,7]}]