[{"title":"better than these reviews - great suspense","rating":7,"date":"9 July 2008","review":"alright, after reading the comments of all the macguyvers who know exactly what they would have done in this scenario, i have to chime in...<br><br>1) \"why didn't they just throw one of the girls up the side?!\" - wow. i can't believe someone (several people) actually wrote that. have you ever tried to \"throw\" someone or even lift them slightly while you're treading water? try it. no amount of strength would help. the strength of four or five people wouldn't help either without some ground to stand on! oh man, i'd love to see you try it.<br><br>2) \"why did they only try once with the swimsuit-rope?!\" - well, half of it stayed up there on the rail, out of reach, after it ripped, if i remember correctly. even if it hadn't, why should the filmmakers be required to show numerous attempts - why can't we just assume that time passed in the story where they did try a bunch of times?? if they show every little possible event, then it's a 20 hr movie instead of 90min.<br><br>3) \"why didn't one of the girls try to climb the rope instead of the dude?!\" - well, yes, that's a very valid point. huge mistake of judgment. but a possible one. this dude was a boat nazi chode, remember? and a rather dumb one.<br><br>4) \"why did he throw the cell phone away?!\" because he panicked and the guy was kind of a dumb ass to begin with. he thought the phone was fried because it was wet. you saw the unbelieving, sunken faces of his friends when he did that. one even asks him what the hell he was thinking. people freak out and f*ck up in tense situations.<br><br>5) \"why did he interfere with the guy who was trying to use the knife?!\" again, he was a world class chode! even in their dire situation, at this point he still seems prideful and arrogant and detached from reality. so he sees the other guy wildly stabbing at his (boss's) luxury toy, and he gets all materialistic and selfish. probably still thinking about how he's going to maintain his cover, since it's not even his boat. and by the way, he did not stab the guy,as several people claim - he caused the guy to stab himself.<br><br>6) \"how could he be so stupid as to try to find the knife on the ocean floor?!\" - i don't want to find out for myself, but i think that's what delirium does to people. <br><br>I found all of these points of frustration for so many posters here to be quite realistic. the film had plenty of other flaws, but i think the realism of the protagonists' descent from calm and crafty to desperate and delirious was right on. much of the acting was unremarkable but did not ruin the movie. what do you expect? i heard bobby duvall had to drop out because of a conflicting project.","user":"landalus","rank":[57,73]},{"title":"Unimaginative, predictable, ridiculous cash in on Open Water","rating":1,"date":"14 July 2006","review":"Open Water was believable, and much more gripping than this very formulaic sequel. The plot is standard unimaginative Hollywood fare, and seems to make a situation (which could easily have been resolved by the characters) into an unconvincing thriller with an unbelievable script which features a series of contrived episodes. <br><br>Each incident left me asking \"why didn't they try this\", and \"why didn't they try that\" as each character seemed to act in a totally irrational way - why did they only try once to get on board with the swimsuit 'rope' ? It was very cheesy that they almost made it, but then didn't try again. Why did they throw the phone away for no good reason? Why didn't they use the knife as a foothold to get on? I would not have trusted these characters to have made me a coffee without at least three of them getting seriously injured or dying. <br><br>This film had nothing new in it, and seemed like an attempt to cash in on the success of low budget Open Water.","user":"adrift-2","rank":[105,150]},{"title":"Don't let IMDb ratings keep you from watching this one","rating":7,"date":"13 April 2008","review":"I was entertained from start to finish. Had I come to IMDb and seen the rating of 5 I might have skipped it, but I saw the movie before I came here- lesson learned and advice to others. It's fast paced and there is always something happening. I really was not bored at all during any part of the movie. There are many things I can criticize about this movie, and I can understand the points other posters have made, but the bottom line is that it's just a movie. It's how I passed a couple of hours this Sunday night and that's all. When I want real excitement all I have to do is open the paper and read about all the crazy things happening in the world. So, I enjoyed it and I recommend it to others who like these kinds of movies.","user":"brooklyn_gent","rank":[44,61]}]