[{"title":"Not my Naval Academy","rating":3,"date":"21 February 2006","review":"I graduated from the Naval Academy in Annapolis, MD in 1988. I went to see the movie with my wife, an ex Navy Nurse, last weekend. We were eager to see the familiar grounds of the Academy and see an accurate depiction of the real Midshipman experience. <br><br>We're still waiting.<br><br>Okay, by now you've read plenty of comments regarding the plot (predictable), the acting (cardboard) etc. As a remake of the whole \"Officer and a Gentleman\" theme, it's not too bad. The whole poor boy with an attitude bucking the system thing has been done.<br><br>If you are planning to see the movie hoping it's a realistic depiction of life at the Naval Academy, or in the military in general-don't bother. They actually got a few things surprisingly right, and many more things wrong. Therefore, I thought I'd give a little insider's look at the nit-picky details.<br><br>What they got right: The uniforms, by and large. It's not likely that every single Mid would have scored Expert on their rifle and pistol qualifications- but they all seem to have earned those ribbons. BTW- Jordanna Brewster's character was a Second Class Midshipman- a Junior. Tyrese was, as he said, a Senior.<br><br>The rooms- pretty close. Actually, the showers are in the rooms.<br><br>The bedspreads- Strange, but true. Little details like the Plebe sleeping on top of his covers so he won't have to remake the rack.<br><br>The Plebe Indoctrination- The apparently silly memorized responses to questions like \"How's the Cow?\" (-She walks, she talks, she's full of chalk. The lacteal fluid extracted from the female of the bovine species is prolific to the Nth degree.) It's designed to train you to be able to rapidly and accurately memorize complex information strings. Obviously it still works- I learned it 22 years ago and still know it verbatim. Marching off demerits- yep, done it. The chowcalls- yelling the menu in the passageway. Cannonballs with Hard Sauce! Yum! <br><br>Expulsion for an Honor Offense- Apparently someone caught lying today would be put on Honor Probation. Twenty years ago, anyone violating the Honor Code (not concept) was separated. <br><br>Boxing- All MALE midshipmen were required to take two semesters of boxing- your Plebe and Youngster (sophomore) years. The boxing coach was excellent. He fit the part very well. There was an open tournament each year, but it's held in a big field house, not a dark and dusty courtroom set. It's really not that big a deal to most mids.<br><br>Jumpers- People have committed suicide by jumping from windows in Bancroft Hall- the residence hall.<br><br>What They Got Wrong: The Academy- They found some period buildings in Philly with lots of columns, etc. The locations in no way captured the feel of the Academy or the city. Annapolis is a beautiful tourist city (and the state capital) on the Chesapeake Bay. The nearest shipyard would be in Baltimore- and they don't build warships there.<br><br>The Military Discipline- Plebes don't saunter down the P-way (hall) they march or run. Nobody goes outside in uniform without a cover (hat). Most of Huard's responses to his superiors would have gotten him fried. Conversations are not casual, and they're usually one way.<br><br>Hazing- Buckets of water at extend arms? Maybe (We used rifles). Racist or sexist remarks wouldn't be tolerated. Cole's little sycophantic buddy was an insult to real Midshipmen.<br><br>The boxing- again, not that important. Females don't box. (Or didn't 20 years ago.) Nobody boxes without protective headgear-NCAA rules (only pro's can be that stupid.)<br><br>Twins- one of the best acting jobs- and totally unrealistic. There are no fat plebes. You have to be in top shape just to get in- there are physicals and athletic evaluations. You eat 4,000 to 5,000 calories a day during Plebe summer, and still lose weight. I lost 10 pounds. Anyone overweight is put on a restricted diet.<br><br>Midshipman Authority- A Firstie, regardless of his stripes, is not going to be timing the obstacle course and then making separation decisions. A midshipman's training costs hundreds of thousands of dollars- only qualified officials will separate someone, and only after every attempt at remediation has failed. Bottom line- nobody with that low a degree of self-discipline will survive to commissioning. You have to want to be there yourself- not for someone else.<br><br>Free Time- There isn't any Plebe year. Huard certainly wouldn't have been in the boxing gym after dark alone. (or with an upperclass female.)<br><br>Fraternization- Jordanna's character, as the senior member, would know better than to fraternize with (kiss) a subordinate. He was strictly off-limits until the end of his Plebe Year. It happens- but wouldn't be obvious (jogging together?)<br><br>Plebes No More- WTF was that? Only graduates throw their covers in the air.<br><br>By the way, Wahlburg (sp?) was a Lieutenant Commander; they kept calling him Lieutenant. <br><br>The list goes on, but this is just a small sampling of the accurate and inaccurate points of this forgettable movie. They could have fixed the script, gotten competent advisors, and made a much better movie without any additional budget. It costs the same to film them doing something right, rather than wrong. I can see why the Academy Administration distanced themselves from this project.","user":"Navy88","rank":[61,72]},{"title":"Predictable Collection of Clichés","rating":5,"date":"25 November 2006","review":"After insisting thirty-four times with his congressman, the shipyard welder and amateurish boxer Jake Huard (James Franco) joins the U.S. Naval Academy. Having difficulties in the classes and suffering prejudice in his relationship with his superior Cole (Tyrese Gibson), he has the support of his roommate and his superiors Ali (Jordana Brewster) and Lt. Commander Burton (Donnie Wahlberg). Jake studies hard and trains for an internal box competition, in an unfair environment.<br><br>\"Annapolis\" is one of those movies that the viewer can foresee the whole story. In this one, there is a combination of those \"tough lives of rookies with their superiors\" in a military facility with a box competition, in a predictable collection of clichés. Further, the film is miscast, with the sweet, mignon and gorgeous Jordana Brewster couching James Franco in box fight. You certainly have already seen at least twenty movies with one of these themes better than this one. My vote is five.<br><br>Title (Brazil): \"Annapolis\"","user":"claudio_carvalho","rank":[27,35]},{"title":"Anchors No way","rating":4,"date":"6 February 2006","review":"Like most if not all moviegoers, I depend on the trailers preceding the film to give me an idea of what it's about to help me make a decision if I want to see it. When I saw the trailers for this film I thought it looked pretty entertaining since I've spent all of my life either in or around the military, including the Navy.<br><br>Well, after seeing the film the best I can muster to say is that I'm very disappointed. The film doesn't resemble the trailer enough and I feel that the trailer was deliberately designed to be misleading. There is so much difference I feel defrauded. The trailer contains flash footage of Navy Ships at sea, submarines, jet fighters, helicopters and aircraft carriers. These images give the impression that some amount of time in the film will be devoted to a Midshipman's experience on cruises throughout the Navy. None of those things are in the film at all.<br><br>The entire film centers around a rather lame and phony looking 3 round amateur boxing match at the Academy. That kind of thing should have had it's proper perspective in the career of a Midshipman at Annapolis, a very brief and minor one done for diversion from arduous studies. Beyond that, this seems to be a collection of gee, let's find some pretty looking people and put them in tight uniforms.<br><br>At least the actors themselves seemed to try and give the audience their money's worth. I think the best performance was by Vicellous Reon Shannon, who played a much picked on overweight student. Next was Jordana Brewster who still looked and acted more girlie than your average competent Midshipman. James Franco looked buff in the manner of young Hollywood and did OK with the material he was given but it lacked enough story substance to feel real.<br><br>In the final analysis, serious drawbacks in the film included completely inappropriate depictions of overt and blatant sexism, racial discrimination and hazing, none of which would be tolerated at all in the modern academy. Including those things constitutes a serious insult to the integrity and honor of men and women in uniform at a time when they are fighting and dying for the cause of freedom around the world.","user":"bjones","rank":[24,34]}]