[{"title":"A two hour thrill ride that doesn't relent for a minute.","rating":10,"date":"6 March 2006","review":"This was an extremely graphically violent film with some gratuitous nudity. A lot of extremely well played roles. characters were simple with complex backgrounds. It kept me on the edge of my seat for the entire film wondering what was next. I left feeling like I had just had a two hour seizure. Every time you thought you had it figured out it threw a curve at you. From beginning to end it was fabulous and realistic. Paul Walker gave an excellent performance and you really got into his skin. The supporting cast was excellent, development of the characters rolled out in a believable manner with out a bunch of unnecessary revelations. I will buy this movie when it comes out on DVD. If you enjoyed Reservoir Dogs and Pulp Fiction you will probably really enjoy this film.","user":"cshuman-1","rank":[261,339]},{"title":"You'll be hooked within seconds","rating":10,"date":"4 March 2006","review":"I was a big fan of Tarantino after seeing \"Resevoir Dogs\" and \"Pulp Fiction\". \"Running Scared\" is certainly in that same vein, and it also reminds me of John Woo's \"The Killer\". But where this film lacks the dialog of a Tarantino film, it is a lot more visually stylish than anything QT has ever done. There are great transitions, effective dynamic time warping (speed up or slow down a shot, like a bullet flying through the air), and if you thought Maynard, Zed, and the Gimp were bizarre in \"Pulp Fiction\", wait until you meet the creepy married couple who through their sick hobby make every other evil character in this film look like Buddhist Monks. It's a fast, furiously-paced film, certainly aptly titled. A great cast, beginning with Paul Walker and Vera Farmiga. And certainly the main kids stand their ground, especially Cameron Bright. Also worth mentioning is the end title sequence animated by Gary Hebert. Bottom line, if you were disappointed by films like \"Kill Bill\" and \"Sin City\", films you really wanted to like but found them too cartoonishly clichéd, you'll be more than satisfied with \"Running Scared\". It's sharp and engaging.","user":"jstachler","rank":[243,338]},{"title":"Keep me in suspense","rating":9,"date":"10 March 2006","review":"This movie is definitely more violent than the ones I normally go to (I'm a woman in her 50's)but I really enjoyed this one. It kept me on the edge of my seat through the whole movie. A couple of times I even jumped in my seat. Paul Walker was great - he seemed perfect for the part. I hadn't seen him in movies before but I'm definitely a fan now. The story has a definite twist which kept me interested. If you can get past the violence and some nudity, I'd really recommend it. Lot of action and suspense and a good story line. The theater was full when I went and the audience clapped for the movie at the end - which means most of them enjoyed it too.","user":"thekid1015","rank":[191,265]}]