[{"title":"Enjoyable silliness","rating":7,"date":"8 September 2007","review":"Occasionally when editors send reviewers a list of new and upcoming films, a kind a war-weariness can set in: even more so when one's gut feeling suggests an obvious divide between worthwhile cinema and the barrage of rather missable comedy. Even more so when a film in question has not risked journalistic censure by having an advance press screening. I am not one of the many people who thrilled excitedly to Simon Pegg's efforts in Shaun of the Dead or Hot Fuzz. And I was even less impressed the last time he joined forces with David Schwimmer in Big Nothing. So it was with a feeling almost of self-sacrifice that I volunteered to sit through Run, Fat Boy, Run. Which doesn't even have car chases or zombies to recommend it.<br><br>The surprise was that it is actually quite good.<br><br>Simon Pegg studied drama at university but earned his spurs in working life as a stand-up comedian. Which perhaps explains why his timing is so split-second perfect. The gags in Run, Fat Boy, Run are not that remarkable. At times you can even see them coming. But the performance and skillful delivery is so polished that they are entertaining anyway.<br><br>Run, Fat Boy, Run uses a formula that has served Pegg and his growing fan base well: he is the nerd who eventually turns hero. We feel sorry for him, irritated by him, repelled by him. He's the well-meaning hopeless case we just want to 'fix'. So the audience is relieved and rooting for him by the time he makes good. We are fully behind him by the time he makes his resolve that he is \"sick of being a 'nearly-man'.\" In this present incarnation, Pegg (Dennis) has an attack of nerves just before getting married. He runs out on his gorgeous wife-to-be Libby (played by Thandie Newton) - literally - running off as she stands in the road in full bridal dress. And pregnant.<br><br>Five years later, Dennis is working as a security guard at a women's clothing store. The predictable jokes are spoon-fed us faultlessly. Pegg rescues any situation that threatens to become too silly by a look of open sincerity (rather like Ricky Gervais does with political humour). But Pegg seems to have an instinctual grasp of cinema that enables him to extract the best results from his material. On a hot Saturday afternoon, and with strong competition from much publicised movies, the auditorium was fairly packed.<br><br>The second theme from the film's title comes from Dennis' decision to run the London marathon. This is mostly to 'prove' something to Libby (for whom he has now discovered undying love) but also to win a bet for his mates and to prove himself equal to Libby's super-fit, super-rich, super-handsome suitor, Whit. His five-year old son provides the magic glue to pull all the elements of the story together.<br><br>In a wise choice, the filmmakers avoid anything that might belittle the Marathon (given that many UK viewers may have a deep respect for the institution). But they also bring in much underused and very photogenic shots of London en-route - particularly the Docklands area.<br><br>With such a vanilla story line, Run, Fat Boy, Run is relying on Pegg's reputation to pull in audiences. I suspect that many of his fans may be occasional movie-goers who simply demand something light and untaxing. He has the ability to make a futile chase after stolen women's underwear amusing. When he seems to be rubbing himself off against a shop mannequin it could be a pathetic or tacky sketch in any other hands, but his wide-eyed expression and fast pacing move us from one joke to the next before we have time to analyse.<br><br>I wasn't bored. And I had expected to be. In fact I was laughing loudly. It reminded me of when JM Barrie had planted children in the audience of his first performance of Peter Pan. It helps to be in the company of people who see the joke. Run, Fat Boy, Run has not made me a convert to Pegg's brand of humour even if I enjoyed the film, but I have to admit that he is good at his job. Sometimes it is the difference between a sterile press screening and an audience of fans. On this occasion, marketing gets the benefit of the doubt.","user":"Chris_Docker","rank":[111,145]},{"title":"Humorous retelling of film Running [1979]","rating":8,"date":"6 September 2007","review":"This was a great film and had me and the rest of the audience in stitches. Well worth seeing and for those that have seen Michael Douglas in the Running [1979] the tale will be somewhat familiar.<br><br>Simon Pegg delivers the comedic moments superbly (doesn't he always?) and yet also convincingly parts a warm touch to, well, those warm touching moments in the film that he shares with his son.<br><br>Harish Patel deserves a very honourable mention as Pegg's landlord-cum-mentor-cum-trainer. The only problem with the film was that all the way through I was waiting on Nick Frost to make at least a cameo appearance - talking of which the David Walliams scene will bring a smile to those Little Britaners out there.<br><br>Great film.","user":"david-3651","rank":[59,77]},{"title":"Fat and Fantastic!","rating":9,"date":"11 September 2007","review":"I loved Shaun of the dead and hot fuzz so i knew i would like this but it was even funnier than i thought it was going to be.<br><br>A strong cast, the storyline was obvious but then i think that was the point, it was supposed to be a cliché, that's why it seemed funnier. The direction and writing were very good and generally the pace of the film was perfect.<br><br>I adore Simon Pegg in these roles, his ability to play the straight, flawed individual but make him the funniest man on screen is great and you're drawn to his story, no matter how ridiculous his predicament is. His best friend was hilarious, the setting of the London marathon was a great idea and Hank Azaria played his part well as the whole way through i wanted him to not get the girl and lose the race.<br><br>It's not as funny as Simon's other films but i really enjoyed it and it was well worth paying to see, in fact i'd watch it again tomorrow as there was so many laughs throughout to hold my interest.<br><br>Overall i love the Britishness of this film, the good guy and his basic life, it's not showy, or Hollywood it's just a simple film with comedy stars doing silly things and making us laugh, a perfect pick me up if you ask me.","user":"kclambeth","rank":[78,106]}]