[{"title":"Predictably clichéd. But, surprisingly well made.","rating":7,"date":"23 May 2010","review":"Sara Campbell (Virginia Madsen) and her husband, Peter Campbell (Martin Donovan) decide to move to Connecticut when the long journey for the treatment of cancer to her son, Matt Campbell (Kyle Gallner) is taking a huge toll on his body. The 5 children and her move into a cheap rental home, but it is quite huge. The father stays back at his job and only comes to Connecticut at weekends. The house has a history behind it. It was actually a mortuary in the 1920's, where Ramsey Aickman was famous for his seances which were attended by Harvard professors and all kinds of big shots. He had an assistant Jonah, who was a kid, and he was a medium who could amplify the nature of these seances. During one of their seances, all the sitters around the seance were killed, except Jonah who was never found again. But now Jonah is haunting Matt and things start to get weirder as the days go by.<br><br>This film is 'based on a true story'. How many times have we seen a horror movie which proclaims itself to be based on true events? Most of the times its just a cheap trick to make more money. So, I had decided long back never to watch a horror movie by thinking that it was actually a true event. This film is clichéd and sort predictable upto a point. Do we have a kid who can see ghosts? Check. Do we have parents who think he is hallucinating? Check. Some cute adorable children? Check. A haunting history to the place? Check. A guy of faith to help them in their time of need? Check. A friend who will believe Matt? Check. Cats or other animals possessed? No. Surprising, isn't it? Possessed animals are quite a hit among horror movie directors. Anyway, the thing which makes the movie a believable true story is the ending in which Sara says her son is fine and has no cancer now. That would be a kind of proof that this was a true story.<br><br>Even with all of the clichés, this is a very well made movie which is worth a watch. The real high point of the movie is Kyle Gallner who gives a haunting performance as Matt, the cancer kid who can see the dead. We can see the subtle change in him when he is kind of possessed by the ghost, in the scene where he makes his little brother sleep on a metal table used for autopsies in the funeral room and spins the boy round and round and the look on Matt's face was extremely creepy. He is truly an amazing actor and looks frightening throughout the movie. Virginia Madsen needs no special mention, we all know that she was an Oscar nominee and a good actress. She pulls in the necessary requirement of the character. Elias Koteas as Reverend Popescu didn't do enough justice to the role. That's just my opinion. The father character played by Martin Donovan did a good job, except in the drunk scene, where it really didn't add anything to the story. The graphics are quite cool and it is very stylistically shot which makes it quite a good horror movie. The editing is slick and the ghost scenes look really cool. There are no false jump scares and the background score is well done.<br><br>7/10","user":"GirishGowda","rank":[34,41]},{"title":"Horror Grounded in Reality is Back, Finally!","rating":9,"date":"24 March 2009","review":"I'm sure it helped that I was in the right mood and the right atmosphere when I saw this movie at a midnight screening at South by Southwest, but The Haunting in Connecticut was a horror movie that really struck a chord with me.<br><br>I'm a longtime fan of this genre, getting acquainted with all the old classics and cult films through USA Saturday Night Horror when I was young, and continuing to see and love newer ones, such as The Ring, throughout college. However, when I go on a rant about the current state of horror movies, I tell people that today's movies make you heighten your sense of disbelief too much in order to be scared  I call it \"fantasy horror.\" There aren't enough movies like The Exorcist anymore where it absolutely feels real, like something that has always existed but you've just been lucky enough to avoid.<br><br>I loved The Haunting in Connecticut, because it is much closer to reality horror than fantasy, and I suppose that's because it's based on a true story. It just doesn't feel like it came straight out of someone's imagination. It was the kind of movie where, not only did I find myself wondering about the true story of the Snedeker family, but when I went to sleep that night, I couldn't help pondering the history of my own home and its previous tenants. If you're the type of person who loves horror movies, I assume that's the exact creepy way you want them to resonate.<br><br>Besides the background story, one of the other reasons I think this movie worked was because of the performance of Kyle Gallner. This young man plays a much more complex (and believable) protagonist than most of the ones I've seen in horror films lately, as his character, Matt, has a very familiar (and scary in its own right) disease that makes him question whether the haunting is real, or a symptom of his sickness. I venture to say that his character could have made an interesting movie even BEFORE the paranormal activity starts, but Gallner was exceptional in this role, and I think we'll still be talking about \"the boy in The Haunting in Connecticut,\" 10 years from now.<br><br>So for true horror movie fans, I definitely recommend checking this one out. Sometimes there's nothing wrong with a horror movie based completely in fantasyland, like Nightmare on Elm Street, but the creepiest horror usually has a dose of reality. This film will scare you, it will make you think and it will leave a lasting impression.","user":"steelydwill","rank":[187,271]},{"title":"Haunting in Connecticut keeps Casper in Wyoming","rating":7,"date":"27 March 2009","review":"I really did hesitate to see this movie because I had not seen many that have interested me since the days of Poltergeist - one exception being The Exorcism of Emily Rose. I loved both despite the obvious difference in style.<br><br>I found The Haunting In Connecticut disturbingly fun. It definitely had its own style which at times made me wonder when the signs of it bombing were going to appear. I think that was part of why I enjoyed it because it never did disappoint me. This mixture of reality and the supernatural kept me on the edge of my seat. Was it the trauma of cancer causing so much grief for this family or the chilling(yet burning), hidden secrets of the dead in this funeral home that kept expectations from settling on one aspect or the other? The fact is both were enough to draw attention away from the other while we try to make our own conclusions.<br><br>An innocent, everyday family deals with the possible, yet probable death of young Matt, who at times suffers excruciatingly from dealing with the unknown and death that he is convinced is his destiny. Squeezed between what is and may be real was enough, but then deal with the likes of a stranger who claims to be a reverend...c'mon, this is classic stuff. You can't take all this in without suffering a little, especially when the family itself starts to fall apart when they need to stick together.<br><br>While there are some questions that may not be answered, the story itself was more than satisfying. Special effects were kept to a minimum but used effectively and when needed. Acting was not Oscar worthy but good enough to make it all seem real. Fun when you want it and scary when you need it.<br><br>It's definitely a 7/10","user":"MovieZoo","rank":[81,124]}]