[{"title":"Good intentions and some powerful moments but overall a disappointment","rating":5,"date":"10 August 2006","review":"I honestly didn't think it was very good at all, though I respect the intentions of the filmmakers. Whatever one wants to say about Oliver Stone, he showed a commitment to faithfully telling the story of these two Port Authority cops trapped in the wreckage of the World Trade Center and their worried wives.<br><br>I liked a lot of the scenes in the beginning, the little mundane details like when Michael Pena's character is going about his everyday street beat. But the scenes at the WTC itself are really awkward, especially the cross-cutting between real footage and the actors. They just don't match, neither the film stocks nor the actors' reactions. A couple of moments with Pena standing there on the concourse were effective in creating a sense of horrific surrealism, and the moments right before the collapse were sudden and chilling...but overall it was not as powerful as I was expecting. For a film called World Trade Center, I guess I was expecting a little more context and not something focused so narrowly on these two Port Authority cops and an ex-Marine from Connecticut (as the only person outside these two cops' families whose story is told in the film, the focus on him reeks of jingoism in a GI Joe/Rambo vein). <br><br>I know it's a little unfair to compare this to United 93, but I need to in order to illustrate the point. U93 told a specific story (the experience of the passengers on the plane) and placed it within a context (what was happening with air traffic control and the military). The lessons that are demonstrated in the actions of the passengers are enhanced by contrasting them with the helplessness of the \"professionals\" responsible for their safety. It's telling a dramatically powerful story, conveying a theme , AND providing a larger historical context of what happened that day. Oliver Stone, by comparison, has failed to effectively tie the experiences of these two trapped cops with the larger events of the day, and his film suffers as a result. And in the end the film largely shortchanges the stories of the 2749 families who didn't get good news that day. <br><br>OK, so the film focuses on a narrow story of these two trapped cops and their families (and the gung ho marine, but he has limited screen time). Was their story well told? The scenes amidst the wreckage were compelling, but the back-and-forth with their wives became annoyingly schmaltzy. Yes, Maggie Gyllenhaal gave a strong performance as the pregnant wife and a lot of the moments with her family (esp the brief scene with the Colombian mother-in-law praying) were emotionally poignant, but so much of the family stuff was lame melodrama. And to be honest, even Maggie's performance was a little generic. I understand that these characters are all closely based on real life, but it still felt very Lifetime movie of the week. As for Maria Bello in the role of the other wife, I loved her in A History of Violence, but she was bland in this. The kid actors playing her children were mostly awful, and the film dragged whenever their story was on the screen. The resolution is mostly handled well, I really like what Oliver Stone is trying to convey about these small gestures of heroic goodness in the face of such desolation. But the power of these scenes is undermined by his tendency to pour on the sappiness while largely ignoring the greater horror of the day. It feels like a soap opera set against the greatest tragedy of our age, and that just doesn't work for me.<br><br>In short...not intense enough, not enough context, too much melodrama, not enough of a sense of reverence for what happened, highly impressive job of recreating the debris field, a charismatic performance from Maggie, overall a mediocre film.","user":"imaginarytruths","rank":[289,438]},{"title":"A classless play on emotions","rating":1,"date":"12 August 2006","review":"I know that many people who don't like this movie say so just because they thought it was made at an inappropriate time. Personally, I hated this movie on its own merit as poor film-making. It seems that Oliver Stone just decided he wanted to make a movie, any movie, about 9/11, and didn't care about the content of the movie. The end result was a movie of such pitiful quality that one could go though the script and replace the term \"police officer\" with \"miner\" and \"World Trade Center\" with \"a coal mine\" and the entire script would work perfectly as a cave-in disaster movie. It's that generic. Stone tries to carry the movie just by showing how sad the families were and how scared the policemen were, meanwhile allowing the audience no interesting plot points to hold on to, nor any significance to the tragedy. In the end, I have to conclude that Oliver Stone just wanted to get some cheap emotional reactions from the crowd, because at one point the movie says that it is about the potential for good in humanity and how strong we can be in the face of adversity. Stone quickly forgets this, because only about 15% of the movie even shows people coming together to help one another. The other 85% of the movie is spent watching the families argue or seeing flashbacks to their happy memories, which is a good way to get audience reaction but hardly lends any significance or depth to the plot. I don't in any way want to belittle the pain that these families had to endure, which is why I am disappointed that that pain was exploited to make a bad movie. September 11 was the most important and tragic event in my lifetime, and I think it deserves more respect than to be made into a generic, poorly-written disaster movie less than five years after it happened.","user":"hugodinwitty","rank":[469,822]},{"title":"A life-affirming movie about courage","rating":9,"date":"26 July 2006","review":"It's a little known story from a day we know all too well. \"World Trade Center\" tells the gripping true story of two of the last men pulled out of the rubble of Ground Zero alive.<br><br>Nicolas Cage and Michael Pena play Port Authority Police officers. In the film's heart- pounding opening minutes, we watch the attack unfold through the eyes of these first responders. As the routine morning becomes anything but routine, the officers glimpse news reports (we are thankfully spared any images of the plane striking the towers) and get bits of information from cellphone calls to family members as they race downtown. But what's most striking is how little the men know about what's really happening. As the officers prepare to the climb the North Tower, they are unaware the South Tower has even been hit. Communications gear is failing, and there is confusion all around.<br><br>Through impeccably detailed sets and flawless special effects, director Oliver Stone and his film-making team recreate these hectic moments in all-too-realistic detail. You're right there, on the street, looking up and watching the chaos unfold in 35mm and THX surround sound. If you didn't know any better, you'd think Stone had a crew shooting in Lower Manhattan that day. You have to struggle to remind yourself everything you're seeing was recreated on a sound stage on inside a computer.<br><br>Screenwriter Andrea Berloff further enhances the realism with believable dialog. She not only effectively captures the \"cop talk\" (half the time, there's so much lingo being bantered back and forth, you don't understand what the heck the characters are saying -- as it should be), she also delivers a truth and honesty to the conversations and interactions. The words never feel contrived.<br><br>The quality cast does the script justice. It's remarkable how well Cage, a major movie star, disappears behind the mustache and hunched shoulders of Sgt. John McLoughlin. Pena (last seen as the locksmith in \"Crash\") is instantly likable as Ofc. Jimeno. Their performances are even more noteworthy considering they spend the majority of the movie flat on their backs. They are also well supported by Maria Bello and Magie Gyllenhaal as their respective wives, who spend much of the film enduring an agonizing wait to learn the fate of their husbands.<br><br>Stone's storytelling is also more methodical and straightforward than it's been in recent years. He mercifully ditches the frenetic editing style he's employed in films like Natural Born Killers and Any Given Sunday.<br><br>***Not Political***<br><br>When one hears that Oliver Stone, director of such politically charged films as JFK and Born on the Fourth Of July, is making a movie about 9/11, your first tendency is to say, \"uh oh.\" But this may be the least political movie Stone has ever made, one both red states and blue states can agree on. It's not about the roots of terror, or who's to blame for what. It's not about villains. It's about heroes. Though set during one of America's darkest hours, it tells a life-affirming story of courage, love and the strength people can summon inside. The movie reminds us how we all felt that day, how we all came together. Some say it is too soon for a movie like this. But as our nation sits so sharply divided, it's not a minute too soon to remember the unity of purpose we all had on 9/11 and ponder whether we can ever get it back.","user":"jmoney-2","rank":[269,465]}]