[{"title":"Charming","rating":7,"date":"5 March 2008","review":"I didn't know what the heck Penelope was, I only saw the trailer once and it looked very strange, I only saw the poster more than a few times and it again, didn't really catch my interest. But my friends and I decided to check it out and I'm actually glad that I saw it. As silly story that it is and a bit predictable, it's a good movie. Most romantic comedies tick me off because they are so predictable and the it's the same formula each time, Penelope is close to the same formula, but instead adds a fairy tale twist. It has the same moral of the story as most films of having to accept yourself, but Christina Ricci made it more charming and lovable. The cast was perfect and all did a great job, the looked like they had such a good time bringing this story to life.<br><br>Penelope seems like the girl that should be living the high life, a wealthy family, part of royalty, but her life isn't perfect. Due to a shallow mistake her ancestor made, a witch cursed a face of a pig onto the next born daughter, that happens to be Penelope who apparently has to marry a man of royal blood to break the curse. But since she's not the prettiest face on the planet, every man runs from her, but Max, a spy sent by a photographer, Max learns that Penelope is a beautiful soul. Penelope runs away though to find her freedom and instead finds herself and how wonderful she truly is.<br><br>Penelope is a very cute film, I was very impressed with the story, there were some things I was a little disappointed in, like how they just abandoned some characters for no reason. But I think it's hard to fit it in a short film, still I think it could have been edited better. But Christina Ricci was a great choice for Penelope, even though she's still oddly enough not the ugliest woman I've ever seen with the nose, she did a good job and held her own well. Reese Witherspoon, small role, but she was so charming. I would recommend Penelope, it's a cute film and was a lot of fun to watch.<br><br>7/10","user":"Smells_Like_Cheese","rank":[51,55]},{"title":"An uplifting tale with something for everyone.","rating":9,"date":"24 February 2007","review":"I saw this at a preview and really enjoyed this movie. It's a wonderful take on the common theme of accepting who you are, not what you are.<br><br>Although aimed at tweens/teens, it has elements which also makes this entertaining for adults. It has great visual appeal, slapstick humor as well as clever writing throughout.<br><br>This movie deserves to be successful and it's best promotional vehicle will be word of mouth.<br><br>It is well cast and Cristina Ricci, as the main character, is instantly engaging.<br><br>A fun movie for all !","user":"toddy_aus","rank":[100,116]},{"title":"Worth seeing - Magical!","rating":8,"date":"21 December 2006","review":"I saw this at a NY preview, and it was very much worth my time.<br><br>Cristina Ricci was excellent. I thought it was brave and smart of her to take on this role, and given the make up and costume she was very expressive and genuine  eyes, eyes, eyes. If any of you have seen \"Pumpkin\" this character would be a polar opposite of that role, but just as tongue and cheek, and just as much fun.<br><br>James McAvoy looked great, as was his performance. Christina and James had sparks that were believable. The supporting cast was also fun and fanciful. Catherine O'Hara played an excellent zany Mom which was more believable and real, in a weird way, then her role in Beetle Juice, (a film I adore.) Reese Witherspoon, was strong as usual, even in this odd, small supporting role (given her filmography). She looked great as a lower east side character. The only disappointment was Richard E. Grant, and not by his doing. There was no chance for him to shine given the part. Something tells me he got lost on the cutting room floor. A zero role for him given his talent.<br><br>In sum, I am one for magic and fables, so for me this was a very enjoyable film. I forgot the time which is the best test of all. Bravo!","user":"me_inc","rank":[98,115]}]