[{"title":"Michael Clayton a different kind of thriller","rating":8,"date":"8 December 2007","review":"Michael Clayton is not your typical legal thriller. Oh, it has most of the standard trappings of one: double-crossing, shady back room deals, and a guilty client. But in the case of Michael Clayton, the film focuses most of its attention on the questionable moral quagmire of working for guilty clients, living your life protecting those who you can't help but find reprehensible, wanting to get out, but finding you are good at it and that is where your superiors want you. Michael Clayton isn't a revelatory film, but it is a smart one that deals in the grey world that we all live in, not the black and white one legal films are usually about.<br><br>The central character is Michael Clayton (George Clooney), a \"fixer\" at a major Manhattan law firm. His job entails him cleaning up other's messes, not litigating in a court room. He hates the work, but the senior partner at the firm, Marty Bach (Sydney Pollack), wants him to stay in the job because he has a talent for it. Things are not rosy for Michael right now: his addict brother has run a business venture that Michael was a partner in into the ground, leaving Michael with thousands of dollars in debt; his relationship with his ex-wife is on the rocks, and into this environment comes a whole new caliber of problem: Michael's friend, and fellow attorney, Arthur Edens (Tom Wilkinson), who is a lead attorney for a major case for the firm involving U/North, a huge, multifaceted corporation, has discovered evidence damning to U/North, and has also, seemingly, lost his senses.<br><br>Arthur begins plotting to publicly expose U/North with this evidence, thereby destroying them, something that U/North's lead corporate attorney, Karen Crowder (Tilda Swinton), cannot allow. Michael is called in to help calm Arthur and bring the situation under control, but it becomes quickly obvious that Arthur cannot be reigned in, and Karen begins looking at far more dire methods of containment.<br><br>When you walk into Michael Clayton, you need to be prepared for a limited amount of action, and a fair amount of talk. It is a film about words and far less exciting events than found in many movies. Michael Clayton is also not the most straightforwardly plotted film. A great deal of information is suggested through inference and requires the full attention of the audience. But Michael Clayton is hardly boring. It delves into the decisions that individuals make when their livelihood depends on living in a moral quagmire. Michael is a man who is concerned about making sure that he can make the payments on a huge debt and dealing with the sometimes annoying and reprehensible people that the law firm provides its services to. Arthur is in a similar situation, but he can no longer live with himself and the protection of clients who are obviously guilty. It is debatable whether Arthur is mentally unhinged, or simply woken up to the reality of his actions and what they mean in the grander scheme of things.<br><br>Michael Clayton is the directorial debut of Tony Gilroy, a longtime Hollywood screenwriter, who crafts a film that manages to keep you involved like a good thriller without providing many of the requisite elements: chases, shootouts and fisticuffs. Michael Clayton is a thriller that works at a slower pace, but still manages to enthrall with its developments. Critical to the film's success is its performances. George Clooney gives us a Michael who feels many aspects of his world closing around him and tries to keep all the balls in the air. Tom Wilkinson's turn as Arthur is that of a man who has experienced an epiphany, seeing the world like a newborn baby. Finally, Tilda Swinton's Karen Crowder is a woman who is all about appearance (one of her first scenes reveals her practicing a speech so that it will appear perfect) and ensuring that no one rocks the boat of U/North. She has sold her soul to the devil and will do anything to keep the company intact.<br><br>Michael Clayton is certainly not everyone's cup of tea. It requires a strong attention span and a willingness to not have everything spelled out for you. If you can provide that, then it is a film experience that will provide some rewards.","user":"rparham","rank":[295,324]},{"title":"Slow burner but high quality movie","rating":8,"date":"30 September 2007","review":"After seeing \"Superbad\" last weekend, I needed a grown-up antidote and this movie is certainly that. A slow moving, adult, serious movie with a message.<br><br>The movie has a number of themes including ageing, corruption, principles and truth. The movie's message is that there is more to life than making money.<br><br>The acting is uniformly good but Clooney is outstanding. His character is complex and he's pretty unhappy with what he has become. But it's all done very subtly. There are no obvious messages in this movie. As another reviewer wrote, you have to pay attention.<br><br>Don't read too much into my \"slow moving/slow burner\" descriptions. This movie is not boring. It just doesn't whiz along with one implausible twist after another. It's evenly paced with an almost complete lack of silly plot lines (there was no need for the lawyer in crisis to remove his clothes during a trial).<br><br>Everyone involved in this movie deserves praise for producing a challenging, grown-up, movie-with-a-message in the face of a torrent of mindless nonsense.<br><br>Highly recommended.","user":"bobbyelliott","rank":[330,425]},{"title":"An intelligent movie with reasonably wide appeal","rating":8,"date":"30 September 2007","review":"During one scene, high powered corporate lawyer Karen Crowder (Tilda Swinton) practices answers for a coming interview. How do you achieve a work-life balance? The question, of course, could apply to us all.<br><br>Ideals versus the reality of paying a mortgage? Trapped in a fast lifestyle. You maybe realise what you are doing is less than perfect. How easily can you get out? (One might also ask, how do serious actors balance worthwhile projects against box-office returns. A question that seems to prompt the fluctuating choices of stars like Swinton and Clooney.)<br><br>By putting such an impasse at the heart of the movie, Michael Clayton becomes more than an edge-of-your-seat legal drama: it is a powerful psychological study that asks how far we will go to avoid facing unpalatable truths.<br><br>Michael Clayton (George Clooney) is an in-house 'fixer.' He works for a big New York law firm. He sorts out their dirty work. For instance, a big client is involved in a hit-and-run. Or bad stories in the press that need smoothed out. Clayton is good at his job. But discontented. Divorce, gambling addiction, failed business venture, loads of debt. No easy way out, even if he wanted one.<br><br>U-North is a large agrichemical company (think Constant Gardener). Their in-house chief counsel is Karen Crowder (Tilda Swinton). Karen wants to see off a multi-million dollar class action suit. Clayton's firm is employed to wind it all up nicely for her. But Clayton's colleague, the brilliant Arthur Edens (Tom Wilkinson), has an apparent mental breakdown. He strips off during a deposition. Then tries to sabotage the entire case. Clayton goes in to 'fix' things, yet he is gradually forced to admit how good the firm has maybe become at making wrong seem right.<br><br>Much in the tradition of Erin Brockovitch or even Syriana, this is a film that tries to attack the respected authorities while still working within the format of mainstream cinema. (More cynically, it uses high production values and scenes that last no longer than the attention span of passive audiences  supposedly the length of a TV commercial break.)<br><br>Directed by the man who wrote the Bourne trilogy, Michael Clayton racks up an intelligent suspense movie out of a plot nominally too dry for mass-market appeal. It reminds us of a world of imperatives we all succumb to. Maybe we don't always stop to question our job or its ethics too closely? Finish our overtime. Get reports ready for tomorrow. Close the deal. Have some private life. Let's leave philosophy for people with time on their hands. 'Nothing to do with me.'<br><br>This is a moral-dilemma-movie that could easily have failed and doesn't. Two hours of lawyer-talk could be enough to bore anyone. But the screenplay cleverly contrasts high-intensity scenes and well-developed characters. Arthur's psychotic ranting. Clooney's impenetrable cool. Swinton's prepared polish. These are displayed in the boardroom. Or uncomfortably restrained emotion in family scenes. The high-stakes backroom card game. Or the simple, almost documentary-like portrayal of one of the plaintiffs claiming damages from U-North.<br><br>Director Tony Gilroy is in no hurry to play all his cards. By the time murder enters the game, we are so engrossed that it seems like a natural progression.<br><br>Cinematography by Oscar-nominated Robert Elswit is crucial. Right from the start, we are torn by fascinating contrasts. A long panning shot through expensive, empty offices is coupled with a sound-over of manic rambling. Suddenly the camera wanders into a busy room. An annoying reporter over the phone. And the overheard phrase, \"The time is now,\" brings everything together in the present. Shortly afterwards, a horrific scene in which Clayton is almost killed. Then flashback four days to unravel a 'smoking gun' that can overturn the lawsuit on which lives, careers and whole firms rely.<br><br>At one point, a shadow on the lower right of the screen could almost be an audience member standing up. As it advances, we see it is Clooney. His 'reality-check' moment  one with which we have been subtly led to identify  then saves his life. The subsequent soul-searching and inner turmoil also provide one of Clooney's most rounded and complex performances to date. (Additional casting is spot-on, with Wilkinson and Swinton both excelling themselves.)<br><br>Clayton's ability to ask himself difficult questions is matched by Crowder's knack for self-deception. It is a frightening depiction of the legal mastery of words when she gives instructions for the most abominable acts with total deniability.<br><br>Although the overly obvious Blackberry product-placement annoyed me slightly, I found Michael Clayton a satisfying film without any of the usual over-simplified characters. Threads are pulled together a bit too conveniently towards the end, but it succeeds in never seeming contrived. If you have always put off thinking a little too deeply about where your own life is heading, it might even give you a necessary nudge. But as all-round entertainment to a thinking audience, Michael Clayton is one of this summer's better movies.","user":"Chris_Docker","rank":[198,254]}]