[{"title":"Sweet comedy and drama, especially for anyone who grew up in the '70s","rating":10,"date":"23 January 2006","review":"This weekend, we saw a movie that effortlessly combines '70s nostalgia, social and family drama, athleticism and some really fine performances into one gem of a movie -- \"Roll Bounce,\" a very sweet coming-of-age movie about semi-urban teens in the age of roller disco. I'm not kidding -- this movie doesn't hit a single wrong note. The fashions, the phrases, the world depicted are perfect late '70s. The acting is spot-on, and features one of the most real father- son relationships I've ever seen on film. Chi McBride, as the father, brings a quiet but heavy dignity to the role, and his interaction with Bow Wow is just real. No clichés, no nonsense. That makes it all sound heavy when in fact it's beautiful -- and the movie is very very funny, not afraid to play up the silliest sides of the '70s soul and disco scenes with some characters that would have been at home in the heyday of Parliament, an outlandish appearance by Wayne Brady (and a lesser one by DMC, or, as my kids now know, \"D's for never Dirty, MC's for Mostly Clean.\"). Plus, a couple of scenes with Charlie Murphy that were happily expanded in the \"gag reel,\" which is the only part of the disc really not suitable for children. Let me put it this way -- it's been a LONG time since I watched a movie two nights in a row.","user":"cjohnson12144","rank":[18,20]},{"title":"Exactly as Advertised!","rating":9,"date":"8 October 2005","review":"We saw Roll Bounce this afternoon. It was exactly what I expected it to be. A predictable, exaggerated, silly, corny, inauthentic 70's nostalgia-fest. <br><br>We loved it! Seriously, it's probably in our top five for the year thus far. It was so much fun. Even the dramatic, serious moments were good and not laughable. My husband said afterwards he was thinking how funny it was that an emotional scene in an otherwise fluffy, insubstantial feel-good movie could evoke more feeling in him than all two hours of The Constant Gardener, for example. <br><br>Anyhow, we've both been a good mood ever since, we just had a great time at the movies. It was nice to see a good, clean, wholesome family movie that doesn't suck.","user":"candy_flesh","rank":[39,53]},{"title":"This is a great movie, especially if you grew up in the 70's","rating":10,"date":"4 January 2006","review":"This movie brought back memories long forgotten. I loved to skate as a kid and this movie inspired me to start skating again. I've lost some of the skills I once had...but I recently purchased some new skates and I will be a permanent fixture at the Skating rink. It made me remember how much I loved skating, and watching all the skaters get their jam on was out of this world! Great movie for all ages!! My kids and I will spend a lot of quality time in the rink! If you like good music, super, phenomenal skating skills, go see this movie...you won't regret it. I was jamming in my seat when the music and skating was taking place and I'm sure you will do the same...Enjoy!","user":"kevin-r-crupper","rank":[17,21]}]