[{"title":"rather dull sad costume drama improves slightly","rating":5,"date":"22 April 2015","review":"Thérèse Raquin (Elizabeth Olsen) is left by her father to live with his sister (Jessica Lange). Her hope of his return is lost when he's reported dead. She is pushed to marry her sickly cousin Camille (Tom Felton) by her domineering aunt. Camille finds a clerical job in Paris and the three of them move to the city. They buy a dusty shop and Thérèse is stuck behind the counters at the empty shop. She falls for Camille's new work friend Laurent (Oscar Isaac) who also paints. They quickly have an affair. However their secret affair is threatened when Camille decides to move back to the country.<br><br>It's a rather dull costume drama for the first half hour. Everything is dim and cold. Olsen needs some more opportunity to do something. When she pretended to be a bear, it was a flash of something great. The movie seems to be filled with possible great moments that are quickly engulfed by the movie's overwhelming blackness and whispers. It's an old romance novel of corset ripping without any great charm.<br><br>When the movie changes to a murder thriller, it picks up some energy but nothing that truly takes off. The prodding darkness keeps clawing it back to lifelessness. I never really fell in love with the couple. Lange is masterful at times but the movie is generally lifeless. It tries to be a nightmarish Hitchcockian thriller but director Charlie Stratton doesn't have the skills.","user":"SnoopyStyle","rank":[17,19]},{"title":"When born into a family in which love is absent, how far will one woman go to keep a man who found a way to satisfy her?","rating":6,"date":"15 June 2014","review":"Admittedly I am not a big fan of period dramas. I find them pretentious and with most actors performing in a constrained manner, so they seem prim and proper, they often do come off dull to me. However, post-Belle, I did find myself curious about this film. After all, it does have Jessica Lange and Elizabeth Olsen in it, as well as the familiar face of Tom Felton. But, with no mention of Jane Austen, one of the few whose adaptations can liven up a period drama, I walked in hesitant and perhaps rightfully so.<br><br>Characters &amp; Story<br><br>Poor Therese (Elizabeth Olsen) has found herself dumped with her Aunt Madame Raquin (Jessica Lange) and sickly cousin Camille (Tom Felton). To make matters worse though, Madame fully expects Therese to dedicate her life to nursing and entertaining Camille. Even to the point of marrying the boy. So, naturally, when a young man named Laurent (Oscar Isaac) comes around and not only presents himself as interesting, but less coddled and childish than Camille, it sparks something in Therese. But how far will she go in seeking some way to appease her lust and happiness? That is the question which lingers throughout the movie.<br><br>Praise<br><br>The first act of the film, in which we meet and get to know the main cast, makes for quite an entertaining picture. Olsen, as Therese, is quite fitting for the expression the Olsen sisters seem to have in their eyes, this sort of sadness even when they smile, makes Therese quite the sympathetic character. And while I am no fan of Tom Felton, with him popping up in multiple movies I've been watching, I must admit that playing multi-dimensional pathetic men seems to be something he is quite good at. For while I do feel bad for Therese, Felton as Camille certainly draws your sympathies as well since you can tell between him wanting to assert himself, and truly make Therese happy, he does try. It is just that Therese wants a more traditional man over a momma's boy.<br><br>Which makes Isaac as Laurent quite a burst of fresh air. I mean, watching Therese, who can't even deal with breathing the same air because of how mad she is with lust, was quite amusing, as is their whole relationship. I'd even say that the two have good enough chemistry, in the first act, that it makes you hope the two actors would work with each other again.<br><br>Criticism<br><br>However, once the climax happens and the 2nd act begins, watching the movie certainly becomes a chore. Be it the odd whispery voice of Shirley Henderson repeating \"Madame\" over and over; Therese and Laurent losing their appeal as a couple; or even Jessica Lange having a stroke and trying to give a quality performance using just one hand and eye movements, the 2nd act is simply a struggle to sit through. Not to forget, both Olsen and Lange portrayal of guilt and grief is so over dramatic that it really is quite a liability for the 2nd act. Especially as we see Therese's guilt eat at her and cause her to fight with Laurent. Making for when the film ends, it isn't something which saddens you but gives you such a feeling of relief.<br><br>Overall: Skip It<br><br>Consider me spoiled by the likes of Belle and the few Jane Austen movies I've seen. For with a lack of sarcasm or wit, and not even aesthetically pleasing attire to attract the shallowness of the eyes, it is hard to say this film gives any real quality reasons to sit through the whole thing. Which is unfortunate since the first act surely presented a decent film, but the climax somehow stole away all the life of the film and left us with a bumbling mess. Hence why the label \"Skip It\" is given. Even with the first half of the film being pleasant, the 2nd half is so exasperating that it ruins the film as a whole.","user":"Amari-Sali","rank":[13,15]},{"title":"When struggling to breathe makes you drown","rating":7,"date":"4 April 2014","review":"In life, people all have shades of grey. We have good moments and bad. At times, a person can be our best friend, and at other times, he can seem our worst enemy. A family member can be our greatest ally, and then suddenly our fiercest obstacle. But for the purposes of cinema, films often eliminate these complexities. They present us with heroes who are immaculate in virtually every way and villains who have no redeeming qualities whatsoever — and they expect us to cheer and boo accordingly. But that certainly isn't the case in Charlie Stratton's first feature film, In Secret . In this dark and captivating drama based on the novel Thérèse by Émile Zola, the lines are brilliantly blurred. There's no hero to worship or villain to wish dead — just people with good moments and frighteningly bad moments trying to get through life.<br><br>When Thérèse Raquin (Elizabeth Olsen) is left with her Aunt (Jessica Lange) after her mother's death, her life doesn't seem to be off to the best start. After years caring for her ailing cousin Camille (Tom Felton), her aunt announces that the two of them will be wed and they'll all move to the city. Understandably, this isn't the life the imaginative Thérèse had dreamt for her future. But dutifully, she does as she's told — and quickly sinks deeper and deeper into the hands of this family she never truly wanted to be part of.<br><br>Then, seemingly out of nowhere, the strong, charismatic, and handsome Laurent (Oscar Isaac) presents himself and she finds hope and love for the first time in her young life. But with a needy husband and overbearing aunt, the two realize they can never truly be together — unless they take matters into their own hands. And so begins a dark and terrifying psychological study of what happens when people are desperate to pursue their wants, regardless of the damage those desires may cause.<br><br>Although the average summary of the film might have you going into the cinema expecting a tortured romantic drama, Stratton isn't afraid to take sharp turns without a moment's notice. So be prepared for plenty of darkness and suspense. Your notions of bad guys and good guys quickly disappear as you find yourself cheering for one character one moment and feeling terrified of her at the next. Olsen, Lange, Felton, and Isaac carry off these depictions of refreshingly multi-dimensional characters almost effortlessly and with captivating honesty. Stratton's screenplay and direction brilliantly capture the complexities of human wants and needs — and the devastating effects of our desperate attempts to achieve them.<br><br>Everyone just wants to be happy — but at what cost?<br><br>http://juliekinnear.com/blogs/in-secret-review","user":"jul-kinnear","rank":[32,42]}]