[{"title":"A Powerful Conclusion to Iñárritu's Trilogy","rating":9,"date":"11 March 2007","review":"\"Babel\" represents director Alejanrdo Gonzalez Iñárritu's conclusion to a trilogy that begins with \"Amores Perros\" and continues with \"21 Grams\". That being said, if you have seen either of those films and did not like them, it is probably fair to assume that you will not like \"Babel\" either. Thematically and stylistically, this film continues in the same direction, but increases in scope, illustrating that one incident can trigger a devastating series of events all around the globe.<br><br>Like \"21 Grams\", \"Babel\" is constructed as a puzzle, with different pieces transpiring during different times and in different places. Many viewers will no doubt see similarities to Paul Haggis' \"Crash\" which explores similar issues; however Iñárritu's piece places more emphasis on human emotion and requires the viewer to be much more participative in the interpretation of themes and ideas.<br><br>The film is set into motion when the young sons of a Moroccan goat herder get careless with a new rifle and accidentally shoot an American tourist (Cate Blanchett) traveling with her husband (Brad Pitt). This one act sets off a series of tragedies with global implications. American officials interpret this as an act of terrorism and of course the media reflects this accordingly. There is a story of the couple's undocumented nanny who juggles taking care of their kids while attending her own son's wedding in Mexico. In my favorite story, a deaf Japanese girl (Rinko Kikuchi) struggles with her mother's recent suicide and a father who is emotionally distant. This story doesn't reveal its connection to the others until late in the film, but it is undoubtedly the most poignant.<br><br>At its core, \"Babel\" is about the difficulty of human communication and even though stories unfold in four different countries and in five languages (English, Arabic, Spanish, Japanese, and Sign); language is far from the principal obstacle. This film is more concerned with cultural assumptions and biases that tend to obscure reality and how our perceived differences keep us from connecting to each other. There are many reasons to recommend \"Babel\", but most of all because of its astounding ability to cope with issues of global importance while also presenting characters whose individual struggles are no less compelling.","user":"Doc-134","rank":[168,253]},{"title":"Thoughtful, edgy, engaging and ambiguous","rating":9,"date":"25 November 2006","review":"Babel is one of the most intelligent and artfully made films of 2006. The film has two central themes - culture and communication. It also exposes the connections between these themes in the arenas of politics, religion and geography sensitively and intelligently. The tag-line, though intentionally obtuse, sums the film up well - \"If you want to be understood... Listen\" - The parable is designed to speak to people all over the world who seem to believe that the meaning and importance of political boundaries somehow supersedes the value of humanity. It has especially important messages for Americans, however. And its release was well-timed to coincide with an election (2006) which may, in the long term, provide some hope for American foreign policy.<br><br>The film brilliantly weaves four deeply interconnected stories engaging five cultures on three continents. The cultures are North American, Mexican, Moroccan, Japanese and Japanese/deaf. At the heart of each tragedy is an inability to communicate. The tragedies begin with bad decisions that spin each plot somewhat out of control once cultural interference and miscommunication kick in.<br><br>Brad Pitt and Kate Blanchett play a troubled American couple having very little fun on a vacation in the Middle East. Susan (Blanchett) is shot by a young boy practicing with a gun (The two Middle Eastern boys who play the brothers in this film give Oscar-worthy performances, unfortunately I can't get their names out of IMDb easily). Three crises are simultaneously set off, as the Americans' nanny must find a way to attend her son's wedding in Mexico while Susan's medical crisis unfolds, and the poor Islamic family responsible for the gun begin to undergo a devastating crisis of their own. Of course the United States executive branch (not the government - sorry, we are still a democratically organized republic regardless of who sits in the oval office) interprets the crisis as an act of terrorism and a political crisis threatens to doom Susan to bleeding to death in a small remote town in the desert. Finally, in a seemingly disconnected story, Chieko (Rinko Kikuchi), a young, deaf, Japanese volleyball player is coming of age. Her mother has committed suicide and she seems bound to work out her problems with her father by devoting herself to a lascivious lifestyle.<br><br>The performances are, all around, excellent. The directing is exquisite - perfectly paced and visualized. This is a great film which, despite its commercial pedigree and big budget, achieves a rare level of artistry - proving that blockbusters do not have to be sold short. Babel will make you think, and think well. Make sure you bring your attention span and brain, however.<br><br>Very highly recommended.","user":"mstomaso","rank":[350,568]},{"title":"An Exhausting Film","rating":6,"date":"19 October 2006","review":"Alas, it appears that, based on other user comments here at IMDb, I am in the minority on this film. I found it to be tedious and exhausting, and the effort I put into sticking with it far outweighed any sense of closure I received from it.<br><br>Alejandro Gonzalez Inarritu appeared at the screening I saw and introduced his film as the final entry in a trilogy that includes \"Amores Perros\" and \"21 Grams.\" Inarritu, in a comment that surprised me, said that his intent with this trilogy was not to focus on politics or social commentary, but rather to look at the modern family and what it means to be a father, son, mother, daughter, etc. This may have been his intention, but I don't feel that over the course of three entire films Inarritu did say much about these issues. Instead, he has painted a portrait of the world as he apparently sees it as a pretty bleak, uncaring and unforgiving place to live. I thought \"Amore Perros\" was so pessimistic as to border on nihilism; \"21 Grams\" came closer to finding a sense of peace and redemption among the general human crappiness. \"Babel\" sticks closer to the sentiments of the first film than the latter.<br><br>\"Babel\" is of course about communication, or more exactly miscommunication, in the modern world. It's a theme that has engaged the interest of many a filmmaker lately -- the idea that technology has made instant communication so much easier, yet people seem to be more than ever incapable of understanding one another. It's a conceit that greatly interests me, but Inarritu doesn't exploit its potential here. \"Babel\" consists of a monotonous series of scenes in which people shout, storm, fight and talk over one another, always in a hurry to be understood without taking the time to understand. Very well, point taken. But Inarritu makes this point within the film's first half hour -- you only need see one or two scenes of this kind of frustrating verbal gridlock to understand what he's trying to say; after that, the frustration just mounts without any kind of pay off. People are mean to one another, some are unbelievably callous (I didn't buy for a second that the group of tourists who accompany Brad Pitt and Cate Blanchett's characters to a remote Moroccan village after Blanchett is accidentally shot would be so uncaring as Inarritu depicts them). In Inarritu's world, all authority figures are to be justifiably feared, as they go around beating everybody up and pulling guns on innocent people. There's no nuance here; Inarritu pounds his message into you. For example, he obviously feels strongly about the mistreatment of illegal immigrants, especially those from Mexico, but instead of engaging in an intelligent debate about the topic, he sets up such an implausible, not to mention one-sided, scenario in this film that you can't help but agree with him.<br><br>The biggest disappointment in \"Babel\" is his failure to fully utilize a couple of wonderful actors he has assembled. Cate Blanchett is utterly wasted as the caustic American wife whose shooting sets off the chain of events. And Gael Garcia Bernal likewise gets nothing to do as a hot-headed Mexican whose attempts to run from border patrol creates a sad ending for one of the major characters. Brad Pitt does better than expected with the frenzied, frustrated husband of Blanchett. But these people have no history. We know virtually nothing about anybody in the film, yet are expected to care deeply about what happens to them. Maybe that's part of Inarritu's point -- that we're all connected to one another even if we don't know it, and that the world has become so small that there are no longer such things as strangers in it. But this is a film narrative, not real life, and you can't build a compelling one out of anonymous characters.<br><br>After \"21 Grams\" I thought I was warming up to Inarritu, but this film has sent me back to the detractors' camp. He certainly knows how to put a movie together, and he finds engaging ways to tell his stories. But his attitudes and approach to the modern world are so depressing and fatalistic that his films push me away rather than draw me in.<br><br>Grade: C+","user":"evanston_dad","rank":[641,1]}]