[{"title":"Great performances, below-average movie","rating":6,"date":"26 October 2008","review":"Colin Farrell, Edward Norton, Noah Emmerich, and Jon Voight all deliver great performances. There are many intense scenes throughout the movie, and Norton and Farrell match them with their own intensity. Voight is believable and realistic as the patriarch of the family of cops and the chief, trying to keep his family in order as he thinks it should be.<br><br>Despite the inspired performances of the main characters, however, Pride and Glory falls short due to awkward pacing, pointlessly convoluted side-stories revealed in equally pointless scenes, and a general lack of focus. Pride and Glory tries to tell two or three stories at once, but fails to really punctuate any one of them, leading to a fairly emotionless climax and no discernible, unifying theme. The result is a forgettable movie and a hint of buyer's remorse; if you're a big enough fan of Ed Norton or Colin Farrell and want to see either of them put on a great performance, catch the matinée, or even still, wait a few months and rent it.","user":"Slaughterlouse","rank":[113,139]},{"title":"The cast made the movie","rating":7,"date":"26 October 2008","review":"The plot of this movie is the fairly predictable (though always entertaining) idea of the corrupt cops against the good cops and the always-annoying injection of the nosy media. If it had been done by amateur actors, this movie wouldn't have been nearly as good.<br><br>Edward Norton was absolutely STUNNING, blew me away. He's always been a favorite of mine but every role he's in continues to amaze me. There a scene where he's talking to a Spanish woman and his expression throughout the scene is the main thing that stuck out to me in the whole movie. There's just something in his eyes that draws you and sucks you in.<br><br>Colin Farrell did an amazing job as well, as did Jon Voight. They managed to bring their characters more personality than I expected there to be. Especially Colin. Even though he played a such a bad character, there was something there in the way he was with his family and everything that still made me feel BAD for him.<br><br>And though the f-bombs were sometimes distracting and the ending could've had more punch, overall I really liked this movie.","user":"obsessive_disintegration","rank":[109,140]},{"title":"More True Than Some Want To Know","rating":8,"date":"26 October 2008","review":"I haven't seen a lot of cop movies, so perhaps that's why I didn't find this picture \"formulaic\" as some have called it. I did find aspects of the film familiar, but for a different reason: I have been a resident of New York City for some time now; I have known law enforcement officers, and I think this was a realistic movie (except for the large number of murders, but hey, it's a movie). Many scenes of this film were quite reminiscent to me of stories I heard from a (former) corrupt cop I used to know.<br><br>I appreciated the fact this film showed the characters as human beings with families. I am tired of films that show both heroes and villains without back stories. I'm sure there are younger film-goers who would have preferred a more comic-book like movie...you'll grow out of that.<br><br>I liked the way the film ended. It brought in another dimension to the human drama.<br><br>Overall, this film is gripping, well acted, well directed and has an integrity to it that is often missing in films these days.","user":"nyshrink","rank":[55,68]}]