[{"title":"Incredible","rating":16,"date":"16 March 2006","review":"I walked in to this movie, asked what it was about, and immediately rolled my eyes when my friend told me that it was a high-school based comedy. A list of possible plots tumbled through my brain. Prom? Popular vs. Geek? New kid in a different environment? Or the totally overused Girls One and Two fight over Hot Guy? Never in my wildest dreams did I expect a teen based comedy with an actual plot line, message, and thought! The acting was incredible, the characters well developed, and the subtle humor funny enough to lighten up the heavy subject material. I respected these kids, and I couldn't stop thinking about its message long after the credits finished rolling. This movie is bound to offend some people (contains a mass same-sex make-out scene, students pinning condoms to their clothing, disrespect towards authority, and scathing editorials about the school system.) Still, it's worth watching, and I would gladly pay to see it again.","user":"Ooh_Mr_Todd","rank":[17,21]},{"title":"I like this movie!","rating":7,"date":"6 March 2005","review":"I went to an early screening of this movie and I really liked it! Although the film could do with a little editing- it was an early cut I believe- the first time director got some great performances from his talented mostly no name cast. It's one of those films that has some low budget problems but the film's heart is so in the right place you easily over look them... the two leads were very good as well as a stand out performance from Julie Bowen as a mean ambitious principal... overall a really great first effort by all. The story, based on real life incidents, takes place at high school where the aforementioned Julie Bowen resides as principal. She is running for state school superintendent and has begun a crack down on her students- her policy- much like a high school version of the Patriot Act- inspires a number of students to rise up and protest in very creative ways. This film hopefully will be an inspiration to many. Wait till the very end credits to see some very interesting documentary interviews with the real students the film was based on. Really hope this one gets a distributer. Certainly seems like an easy fit for an MTV youth type audience.","user":"melinalives","rank":[46,81]},{"title":"Extraordinarly Original...Would be an Understatement","rating":10,"date":"10 March 2006","review":"Okay I would Just like to start off by saying that I do not write comments for movies very often but this movie just blew me away so I had to...<br><br>Kids in America: The story of a group of high school students who believe that their principal is taking away their rights, such as free speech and others, and how they change that all by getting the whole school involved...<br><br>A main reason I liked this movie is because it was about a group of high school students who \"bridge the gap\" of being the regular typical student, they are very outspoken, different, rebellious kids and their actions in the movie such as just getting up out of class to have a protest against their principal in the schoolyard, burning a symbol in the school football field that is extremely negative towards the principal, and just really standing up &amp; fighting against the completely unfair educators they have! Also why I liked this movie is because of the very original and flat out hilarious humor in the movie...<br><br>Anyways the message of the movie in my opinion is just simply \"Stand up to the higher power!\" Because I think that if most kids had the points of view such as the teens in this movie they would be better &amp; happier high school students! In all possibly one of the greatest movies I've ever seen...<br><br>Deserves WAY more than the 5.1 it has rite now! 10/10!!!","user":"betheldude92","rank":[11,16]}]