[{"title":"A pornography video shot on a married couple's honeymoon - based on a true story, an educational film","rating":8,"date":"20 December 2006","review":"A movie worth watching. Unlike typical Hindi movies, this one is based on the most rising crime in contemporary India ... crime of shooting pornography films of oblivious married couples and circulating them illegally. This movie is fast paced and goes directly to its point. It revolves around aspects that is the most important for the audience to know. Aspects such as, what kind of people are involved in the business, what makes it successful, the reasons for such video production, success and so forth. An educational movie, I would say. Besides, it is a decent entertaining movie as well. The series of events and its strong bond to reality makes it worth watching. I mention its bond with reality because most of us refuse to face certain facts of our life and live on with it. This movie definitely highlights the life of a person who lived a life most of us do and the emphasizes on how he fought for reality and tried to make his life worth living even after all the difficulties he goes through. Well directed, inspirational, educational and entertaining. A must watch!","user":"fauzia_lala","rank":[9,9]},{"title":"very very good movie","rating":10,"date":"1 April 2008","review":"This movie is very good and one of the main reasons I wanted to watch this movie was that I wanted to hear the last song at the credits. I was surprised to:I expected Emran Hashmi to be the bad guy in the movie because in the other movies I've seen with him in he is the bad guy. It takes up real life issues about a man battling a porn website and the people who run it. Good scenes of violence. 10/10 is my rating for this movie, it is very good. I wan't disappointed at all, it is a great movie. Buy and watch it. You will not be disappointed at all. It has some funny bits in too so it is humorous. 10/10 is the good rating for this movie.","user":"asim34522-1","rank":[7,7]},{"title":"Sharp, Fresh and Memorable","rating":10,"date":"11 February 2007","review":"Kalyug is one of those films that despite being better than 95% of Hindi films, was never going to do amazingly at the box-office simply due to the unknown lead cast, the theme of pornography and very confusing trailers that did nothing to entice viewers.<br><br>The plot, starts off like a superspeed version of a typical Hindi film, ie: boy (Kunal) meets girl (Renuka), they fall in love, get married etc, but then comes the twist...<br><br>In a midnight police raid, the newlyweds are arrested and interrogated separately about a video that has been released on the internet of their honeymoon night, police coercion tactics leading Renuka to believe that her husband is a sleazy pornographer, she commits suicide leaving her completely innocent husband distraught.<br><br>Whilst out on bail, he manages to track down the creep responsible for the hidden camera in the hotel room (played by Ashutosh Rana), during the ensuing fight, the sleazeball loses his bag, which he leaves behind as he runs off onto a moving bus.<br><br>Kunal finds in the bag, a large amount of cash, more videos of hidden camera porn and information related to a porn website being operated from Switzerland that specialises in this type of content hosted by an Indian pornstar \"Annie\" (Deepal Shaw). Kunal then flies off to Switzerland to settle the score. (Using some of the money from the bag... other reviewers seem to have been confused by this!) In Switzerland, he visits a sex shop to try and get some information about the pornstar \"Annie\" (Deepal Shaw), here he meets Emraan Hashmi, who works in the shop simply because they pay him... it's pretty much his take on life, \"do anything for money\". Unsurprisingly Kunal hires Emraan to help in his search for the people behind the website.<br><br>We find out that Deepal Shaw's character is another victim of the porn industry as she was SOLD into it by her extended family in the aftermath of the Gujarat earthquake (another point that a few reviewers don't seem to have understood!) So now obviously we have the set up for the grandstand finale between the good and the bad.<br><br>Amrita Singh is brilliant as the evil mastermind behind the website, her performance is outstanding as are many of the lines she is given. I won't give away exactly what happens with the ending, but needless to say, justice prevails! The movie may be a bit too long (a couple of Deepal's songs could really have been cut altogether), but then with Jiya Dhadak Dhadak and Aadat on the soundtrack, it's not possible to say the music was bad! Emraan's character is ripped off Joaqin Pheonix in the much darker \"8mm\", but I am definitely not saying the movie/plot is a copy, it clearly isn't! I recommend this to any fan of Hindi cinema who is looking for something that is truly a bit different.","user":"slumdog_crorepati","rank":[4,4]}]