[{"title":"Welcome to the family!","rating":9,"date":"18 October 2008","review":"Writer/Director Gina Prince-Bythewood, winner of the Independent Spirit Award for Sundance hit, \"Love &amp; Basketball,\" has now brought the beloved, acclaimed best-seller, \"The Secret Life of Bees\" to the screen.<br><br>1964, South Carolina. Lily Owens (played with open-eyed honestly by Dakota Fanning) is raised in a loveless home by her cruel, distant father. Fourteen year old Lily longs for a mother she never knew. When her only friend, their black maid Rosaleen, is assaulted in a racist incident, the girls are forced to go on the run. <br><br>Lily and Rosaleen end up on the doorstep of the Boatwrights, the black sisters who own a successful honey farm. Lily concocts an elaborate lie to persuade the maternal August Boatwright (played with warm dignity by Queen Latifah) to temporarily take them in. They are met with some resistance from the guarded June (Alicia Keys), a classical cellist and civil rights activist. But they are welcomed enthusiastically by the open-hearted May (played with touching vulnerability by Sophie Okonedo). They soon find that hyper-sensitive May is moved to tears by the mention of anything sad.<br><br>August teaches Lily how to tend the bees, and May whole heartedly embraces both girls. They are soon accepted as part of the family. But Lily still needs to find the truth of why her mother left her.<br><br>This is a coming of age story and parable about how to cope with the painful truth and find forgiveness. As Lily's young love interest puts it, \"It's not just about the truth. It's about what you do with it.\" The two sisters illustrate different ways to deal with the hard truths of life. June has closed her heart and built a protective wall to keep out hurtful emotions. While May has completely opened her heart and feels everyone's pain. Her heart is open to joy but it is also an open wound. <br><br>I loved being in this world and a part of this loving family - so much that I stayed for a second screening. This is due in part to Gina Prince-Bythewood's excellent adaptation and the wonderful acting of Dakota Fanning, Queen Latifah, and especially Sophie Okonedo - who is literally the heart of the film.<br><br>If you're looking for a sweet way to spend the afternoon, \"The Secret Life of Bees\" will supply the honey.<br><br>Movie blessings! Jana Segal reel inspiration dot blogspot dot com","user":"reelinspiration","rank":[66,75]},{"title":"Sorry Seinfeld ... the Real Bee Movie","rating":7,"date":"27 October 2008","review":"Greetings again from the darkness. Having not read Sue Monk Kidd's novel, I was expecting a sappy, soulless, chick flick that would have me rolling my eyes for a couple of hours. Instead, director Gina Prince-Bythewood (Love &amp; Basketball) delivers a very engaging film with a message and some very strong performances.<br><br>Dakota Fanning plays Lily, who accidentally killed her mother at four, and has since lived with her white trash, redneck despicable father (Paul Bettany). Lily and her nanny Rosaleen (Jennifer Hudson) runoff to some small town dot on a map thanks to a clue Lily's mom left on one of her few remaining personal items. They arrive at the home/business of August, June and May Boatright (Queen Latifah, Alicia Keys and Sopie Okonedo) who harvest and bottle the best honey in town. What follows is a smörgåsbord of odd family life that slowly gives hope to young Lily.<br><br>Based in 1964, the film dips its toe into the Civil Rights Act and the ongoing racism of the south, but focuses more on the strength of love and family ... even in a Pepto Bismol home! The performances are all very strong but three standouts are Dakota Fanning, Paul Bettany and Sophie Okonedo.<br><br>Ms. Fanning is now 14 years old and she delivers a remarkable performance ... and what feels like the first where her screaming skills aren't overused (War of the Worlds, Man on Fire). She strikes me as a young Jodie Foster ... one who has just transitioned from child actor to real actress. I can't wait to see where her career takes her. Mr. Bettany is such a shock here as he typically plays a well dressed, under-spoken Brit (which is what he is in real life!). As a southern redneck whose bitterness rages against the world, he not only pulls it off, but manages to make grits seem even worse than I previously thought. Ms. Okonedo (so amazing in Hotel Rwanda) pulls off the always difficult task of making a \"special\" adult seem very real and vital. A most touching performance from a top notch talent.<br><br>This is a good story with strong performances, though to take the next step as a film, it needed to dig a little deeper into its wide range of characters and settings. Still, definitely worth seeing.","user":"ferguson-6","rank":[54,62]},{"title":"wonderful movie","rating":8,"date":"18 October 2008","review":"I'm not sure why this film got such a bad rating....it's truly one of the nicest films I've seen in a long time! I brought my daughter to see the movie today -- we both had tears in our eyes throughout the movie. The acting was superb, as was the casting. Normally I like to read the book before seeing a movie, as usually the book is so much better. I am glad that my daughter talked me into going to this movie. I think cinematically, it was one of the prettiest movies I've seen in awhile. You are taken from laughing one moment to feeling as though your heart is being tugged out of your body in the next moment. I will definitely be recommending this film to my friends!","user":"kirkfam-1","rank":[79,94]}]