[{"title":"I Think Many Have Missed the Point...INCREDIBLE FILM!!","rating":10,"date":"28 May 2007","review":"I did not see the IMAX version, so maybe that makes a difference. I just watched the DVD, which was long. However, it seems like a lot of people did not get the point of this movie, which was absolutely excellent and very exciting. We are on the frontier of a lot of exciting discoveries, and leaps and bounds are being made in marine exploration. <br><br>People complain that the animals shown were not explained enough. That's because THEY DON'T KNOW WHAT IT IS. They say \"Oooh, look at that! Wow! What is it?\". This is exploration, people. They are finding new types of animals. If they can't capture it, they are going to have to take pictures of it and study how it moves etc. etc. and go through a long process of figuring out what it is and how it lives. <br><br>The point of this movie wasn't necessarily to show pretty pictures of all of the animals, although I was stunned by the visual beauty of it. The point was to tie marine exploration to space exploration, hence the title. I loved seeing what goes on with the machinery and finding out all of the different people involved in this research, showing us all the different groups that come together from different fields to explore together and work on their individual goals. A lot of people complained that they didn't want to see the engineers and the subs and robots, but the people who do that incredible work should get more credit than they often do and should definitely be introduced in the movie. This technology is absolutely amazing and the people who do it deserve to brag. They are showing us the incredible things that the human mind can achieve. I also loved seeing how excited they were.<br><br>This movie has a lot of very important things to say and did a great job illustrating the massive activity going on in this sector of science. Not only has it made me enthused about the things I'm going to see in my lifetime, it has made me believe that one of those things is probably going to be life on another planet. <br><br>After day after day of being depressed about the state the world is in, petty political and religious arguments, seeing this movie definitely made me feel hope for the human race again. These people put most of us to shame. This movie doesn't deserve to get blasted the way it has been and these brilliant folks don't deserve to be called \"retards\". How silly! So maybe you don't like the way it looked, or thought they should have done something different. Whatever. These guys are ridiculously hardworking, are doing amazing things, and are trying to show the world and let us get in on it. Geez. People just love to insult things.","user":"lemming_eater-1","rank":[15,16]},{"title":"actual review of the movie","rating":21,"date":"21 February 2005","review":"OK.. i was super excited to see this movie.. i didn't care that the 3-d glasses were giving me a mild headache and i had to cock my head and squint to make things go into \"3-d focus\" sometimes. The Movie was awesome until the end when they showed the computer rendered graphics of what they thought the actual aliens might look like.. that was a super bad way to end a good film. Also.. it was WAY TO SHORT FOR THE MONEY I SPENT. what i'm saying is, they had a lot of really good underwater footage of animals a person does not get to see in action very often at all.. so instead of showing them for 10-20 seconds, why not show them for at least 5 minutes each, and maybe talk about what animal it is. I mean c'mon these people are marine biologists, and all they say is \"neat, cool, look at that\" i mean DUH!! if i was there, that is what i would say to!!! tell me something i don't know. the movie was so short they should've shown the animals for way longer, i would not have gotten bored seeing them... to bad i don't even know what they are called, because the retards just said \"wow, thats cool\" instead of \"this is this kind of animal. this is how it survives, etc...\" I don't regret going to the movie. but i just wish they would've shown more of the footage they had, and the ideas about exploring space were cool and informative, but i really hated the computer graphics stuff they did. they could've shown those crazy octopus things for like 10 minutes and i would not have gotten bored with the image at all.... and the same goes for basically all the animals they ran into down there.","user":"pklekn","rank":[33,40]},{"title":"Big Disappointment","rating":4,"date":"24 September 2005","review":"When it comes to action movies, James Cameron is one of my favorite directors. In particular, \"The Abyss\" and \"Terminator 2\" are two of my all-time favorite movies. Like others, I'm disappointed to see that since \"Titanic\" Cameron is only making documentaries and I'm looking forward to see his \"Battle Angel\" (currently scheduled for a 2007 release), which will be his first feature in 10(!) years.<br><br>I didn't really like \"Expedition: Bismarck\" and \"Ghosts of the Abyss\", so my expectations from \"Aliens of the Deep\" weren't that high. Still, I got disappointed. I watched the 95-min DVD version and felt like I was watching a \"behind the scenes\" featurette of the real movie.<br><br>The movie promises to show us \"aliens\" from the bottom of the sea. It surprised me that during the entire duration, you don't get to see more than 10 minutes of that - most of them are the same creatures. TV shows like the excellent \"The Blue Planet (2001)\" by the BBC already gave us all these creatures (and many others not shown here) in a MUCH clearer view and better photography.<br><br>Instead, this movie focuses on showing all the people and equipment involved in making the dives. It was interesting in the first 10 minutes and it would have been alright if I wanted to know more about the making of the movie. But it's not interesting to see Cameron and crew for 95 minutes discussing how things should be made.<br><br>Except for the few short computer animations in the movie, I got a feeling that I was watching an unedited material. Cameron puts himself and lots of people with Ph.D. in front of the camera, but he is more interested in showing us them playing, making faces, modeling to the cameras and having really shallow discussions instead of giving some in-depth analysis of the subject.<br><br>Most of the underwater dialog consists of \"Wow\" and \"That is amazing\". The narration is horrible right from the beginning and the lowest point - for me - was during the explanation how these creatures were first discovered, which actually used the phrase: \"These scientists went like 'Wow!'\".<br><br>Most of the underwater material shows the submarines and the people instead of the creatures. Is it because they didn't find what they wanted and didn't have enough material to shows us? When you finally get to see some creatures, you have absolutely no explanations about them. So many educated scientists around and you don't even get to know the names of the creatures! You just watch it like you would if you dived yourself. Cameron himself sums it pretty well in one scene, when a beautiful jelly-like creature passes and he says \"I have no idea what that is\". I don't blame you - you're not a scientist, but what are all the people around for?<br><br>Summing it all up - this movie was a big disappointment and boring enough for me to fast-forward parts of it. If you want to see the creatures promised here, see another documentary; if you want to see a good Cameron project - go and watch any of his brilliant action movies. But save yourself from watching this.","user":"room102","rank":[39,51]}]