[{"title":"Total tearjerker... and I still fell for it...","rating":10,"date":"9 May 2006","review":"Having watched so many Korean movies and dramas that end with someone having a terminal illness (Autumn in My Heart, I'm Sorry I Love You, remember those?) I thought I'd discovered all the tearjerker tricks... Nothing, however, could have prepared me for this one... Unlike the previous deals, the illness doesn't so much kill you physically as it does mentally, and trust me, that is much much worse... First of all I'd like to commend the screenwriter for hitting the right spot with the first half... I thought the history between the couple is presented really well... I don't know why some people think it's too fast-paced cos it is possible for people to fall in love and get married in that amount of time, and I thought the use of elliptical editing was just right, not so excessive that you feel like you're seeing a trailer... The second half is the one that I think felt a little bit rushed, but the story is so mesmerizing that honestly you don't really care... And Cheol-soo is one heck of a husband, I don't know if I'd ever be able to do what he did (and let me warn you girls, that guys like Cheol-soo exist only in movies)... And I didn't think the ending was ambiguous, more like open-ended... The last scene is guaranteed to make you shed buckets... The cinematography is beautiful, as others have mentioned... They did a lot of close-ups with both characters in the same frame, which I think is really endearing... And also panoramic shots of the land where they wanted to build their house which were beautiful... My favorite thing, however, is the soundtrack... The Spanish songs are right on target but my absolute favorite is when they played \"Nessun Dorma!\" from Turandot (my favorite aria of all time) during the wedding scene... I cried, and it wasn't even the sad part yet... All and all, fabulous, fabulous movie... 10/10","user":"sukapesta","rank":[70,77]},{"title":"Top par Romance","rating":9,"date":"13 March 2005","review":"I'm not the kind of guy who likes a Romance movie very often. To be honest there have been only a few movies before this in the genre which I thought were great. Enter \"A Moment to Remember\" (unofficial English title) which swept me away with it's amazing characters, decent story and tear jerking tragedy romance. Though the film is definitely has a lot of commercial elements to it, it still has a certain charm that is lacking in today's Hollywood films. The story may be simple but its the direction that is well done and sets the pace nicely. I also loved the musical score in the movie which was very well done especially during the last scene when its about to end.<br><br>Simply an amazing movie though not perfect is right up there in my top movie list in this genre. A solid 9/10.","user":"hasaangilani85","rank":[59,66]},{"title":"excellently","rating":10,"date":"17 August 2005","review":"This is another great production from Korea. Korea have really made a name for themselves producing love stories just like A Moment To Remember. Son Ye Jin absolutely suited the role which was to be played and so did Jung Sung Woo. At the beginning, he was seen as an arrogant man with little feelings, and yet the way Son Ye Jin taught him the way to love and treasure life was so touching. Until tragedy struck for her, it was a great movie. It was love at its highest level. I would recommend this movie to anyone in this world. Even to those who dislike draggy love movies, this movie teaches a lot about treasuring your loved ones before its too late. An absolutely great production. I Love this movie. Watch It!","user":"ardentay","rank":[61,70]}]