[{"title":"A Delightfully Offbeat Comic Book Comedy","rating":9,"date":"15 January 2015","review":"Scott Pilgrim vs. the World is probably as close as we'll come to having an experimental film released in theaters nationwide. This is one of the most innovative, original movies to come out in years. It's unlike anything I'd seen before. And yes, it is good, very good. I could not stop laughing the whole time.<br><br>Onto the plot. Scott is something of a loser. He's socially awkward. He shares a mattress in a bunker-like apartment in Toronto with a sarcastic gossip king. He's in a band called the Sex Bob-Ombs, but they're really not that great. He also has a clinging, hyperactive girlfriend, \"Knives\" who's only 17- kind of a big deal when he's 22. All this changes when he dreams of a purple haired girl on roller blades. The very next day he finds out that she's real; that her name is Ramona flowers and she's the cool new girl in town. His first attempt to hook up fails miserably. His second attempt, although even more lamed brained, actually works, and they're soon an item. But now comes the bad news; to win her love, Scott must defeat her seven evil ex's. He also has an evil ex of his own. Plus, there's the matter of breaking up with Knives, and the battle of the bands is coming up!<br><br>That's the setup, what follows is a hilarious romantic comedy punctuated by a series of completely over-the-top video game style fight scenes. Stylistically, I'd have to call them a cross between Sin City, Street Fighter and Viewtiful Joe. Each of the ex's has their own unique fighting style and their own super powers, such as vegan-powered telekinesis or summoning an army of stunt doubles. Often you hear martial arts movies criticized because the action is obviously computer aided. Here, that's the whole point.<br><br>The movie's humor comes not only from the sheer ridiculousness of the situations, but also from the characters' reactions to them. After one of the ex's has flown in through a brick wall and battled Scott in the middle of a concert, everyone is just kind of weirded out. They don't act like nothing has happened, which would make it hard for the audience to suspend their disbelief, nor do they run screaming for the police, which would only complicate matters.<br><br>Comedic effect is also generated through the use of deadpan dialog. For instance, when Knives confesses that she's never kissed a boy before, Scott replies, with a straight face \"It's okay, neither have I.\" Or the band's self-introduction, \"We're the Sex Bob-Ombs and we're here to make you all sad and depressed and stuff.<br><br>The movie also pokes gentle fun at hipster subculture with the way that Ramona has thirty plus flavors of tea, or how Scott's roommate is always texting. There are also quirky touches like one girl who can bleep herself out, much to Scott's amazement, and a scene when the intro from Seinfeld plays after the characters enter the apartment, and canned laughter follows every line.<br><br>The editing and structure are highly non-traditional, with heavy use of dreams, daydreams, montages, animated flashbacks and asides, and chapter titles introducing segments. The visuals are impressive and very imaginative, such as the way that flashes of color accompany the playing of any musical instrument, allowing you to see the sound. Speaking of which, the sound is another high point, not only the energetic, rock fueled sound track, but also the sound effects taken from classic games like Mario and Zelda.<br><br>Scott Pilgrim vs. the World succeeds in telling an offbeat story, providing interesting characters, and in producing lots of laughs. Other than a couple of too-obvious puns, I honestly can't think of anything wrong with this movie. I would highly recommend it to anyone in their teens or twenties. Four stars.","user":"williampsamuel","rank":[92,108]},{"title":"Fun Film","rating":8,"date":"28 July 2018","review":"Very fun film with loads of story lines, adventure and fantasy.<br><br>This is one rare creative film that almost has it all.<br><br>For something different check this out!","user":"adw-95701","rank":[64,75]},{"title":"Eye candy film, eye candy games, eye candy chicks","rating":9,"date":"4 July 2019","review":"What else do you want? Great film. The type of extraordinary film that draws one to the cinema. I own the DVD and it is getting a workout. The fantasy, the jokes, the romance, the legs, the feminine hair.\nYeah. I am a fan.","user":"zaviannoel","rank":[48,56]}]