[{"title":"There was never a moment I wasn't laughing.","rating":8,"date":"21 February 2020","review":"I don't know what it is about this obviously ridiculous film, but this is one of the few films that makes me laugh consistently throughout. It's hilarious, exciting, and it features one of the Rowan Atkinson's finest performances. One of my favorite comedies that I've seen.","user":"MR_Heraclius","rank":[37,38]},{"title":"One of the best sweet films this year!!!!!","rating":10,"date":"26 August 2007","review":"That's a excellent film, I really loved it! Again Rowan Atkinson give us his classical character Mr. Bean. From beginning to end it is a very sweet and warm hearted film! It is a great film for kids and adults! I only hope that Rowan will revisit this character again! We need more Mr. Beam! The acting is perfect a way above many comedians! Clearly we can notice the inspiration from \"Mr. Hulot's Holiday (USA)\"<br><br>All the supporting actors are very good, it is just a very well cast film with great soundtrack! <br><br>Also Willem Dafoe is great as the obnoxious pretentious art-film director So please Rowan don't do the same that the main character do in Sullivan's Travels (1941). WE NEED MR. BEAN!!!","user":"paulosuckow","rank":[19,19]},{"title":"The comedy that defines the term \"Summer Fun\".","rating":10,"date":"18 May 2007","review":"If you asked a handful of people of varying ages in America, chances are you'd get about 8 out of 10 knowing who he is. They may not know Rowan's real name, but they know the character.<br><br>The sad part about this film is that it's absolutely wonderful, and most people in America aren't going to see it because it's rated \"PG\". Not a dirty gag, foul word, or joke about someone's junk to be found. And the really amazing part is that it's half comedy, half gorgeous scenery surrounding it. It mocks the Hollywood standard, it has melodious music, it's masterfully filmed, and all the while you just find yourself going \"Oh, that Bean.\" *puts fists on hips*<br><br>I can't honestly say I've seen a film this good, this funny, this... pure that can make anyone laugh and find themselves feeling charmed after having seen it. Emma De Caunes stole my heart, Max Baldry is a kid that anyone his age can relate to, and Defoe actually pulls out a great, over-the-top performance without even uttering a four-letter word that he's so very good at snarling out.<br><br>You know what? Shame on us America. That we need the big bang, the flatulence, and the double entendre to amuse our soured idea of comedy. What is so wrong with having a character like Bean, a performance like Atkinson's, that we can't find that part of us that wasn't soured on tasteless \"humor\" but just absorb and let out a barrel-chested sigh of satisfaction after a hearty laugh from a genuine, clever clean joke or visual gag?<br><br>We'll go on, with our Jackasses and Scary Movie XII and we'll forget about them five minutes after we've left the theater, but darnit, it's high time a movie like Mr. Bean's Holiday came along. And I for one would pay money to see this again, even if the American know-it-alls of Hollywood think it's better suited in a death slot in September, to be forgotten, sandwiched between sequel after sequel and the banality of teen slasher flicks acted by twenty-somethings whose genre should have died off years ago.<br><br>If what Atkinson says is true, that this is the last time Bean will ever appear, then he's gone out on the highest note you could ever bestow on a character so beloved. Shine on Bean, and ride off into that sunset, you crazy, wonderful fella you. And thanks for all the laughs.<br><br>... But where's Teddy?","user":"SquirrelBot3000","rank":[164,193]}]