[{"title":"\"The Hamiltons\" Brings A Whole New Meaning To The Term 'Dysfunctional Family'.","rating":7,"date":"31 March 2007","review":"Another one of the eight films that was part of After Dark's Horror Film Festival, \"The Hamiltons\" is an intriguing little horror film/twisted family drama that will have you interested and disgusted at the same time. This independent horror film focuses around a family of four, consisting of three brothers and a sister, their parents both deceased. Francis is the youngest, who is withdrawn and spends most of his time filming his unconventional life with his camcorder. Darlene is a wild goth girl with an attitude, and her twin brother, Wendell is a bit of a tough guy and a ladies man. David is the oldest, the \"man of the house\", who is struggling to take care of his siblings and deal with being a homosexual. The Hamilton family may seem like a basically normal bunch on the surface - but little does anyone know, they also kidnap innocent people and tie them under their house and proceed to murder them.<br><br>Interesting premise, eh? I thought so myself. Far from your conventional horror flick, \"The Hamiltons\" contains one of the most twisted suburban families you'll see on screen. The story itself is pretty original - well, at least I can say I've never seen a film quite like this before. The film balances itself out, teetering on the brink between a horror/crime film and a psycho family drama. Script-wise, the film is really quite impressive. It has a few faults here and there (this would mainly be the trouble finding any sympathy for a couple of the characters of the family, when it seems the writers were poking at that), but overall the writing is clever and keeps a couple of important plot-twists pretty well hidden until the appropriate time to reveal them. It does drag it's feet a little during the middle of the film, which could have been a problem - luckily it isn't necessarily uninteresting because the character interaction is really compelling.<br><br>The acting here is surprisingly good, the leading actors are mostly unknown (besides Brittany Daniel of \"Club Dread\" and \"Joe Dirt\", who has a small role in the opening scene of the film), but I thought everyone performed well and the characters were pretty believable. The film is shot in a strange fashion, and it gives it an almost documentary style, which puts the audience in the moment. The picture is very bright and clear - it captures a realistic effect. There are a few shaky, jittery camera movements, and while I felt they were over used in some areas, they add a nice effect to the film. The big revelation near the end of the film was near genius, and the conclusion is almost perfect. I won't spoil it for you, because it would essentially ruin the biggest plot twist of the movie.<br><br>Overall, this is an interesting little flick with some great things to offer. It's not your typical horror movie at all, so don't expect one - but if you want to see a different type of horror film (a little slow moving, but heavy on character development), check it out. It's not a perfect movie, but I thought it was pretty good. If you thought your family was different, wait until you see \"The Hamiltons\". 7/10.","user":"drownnnsoda","rank":[37,49]},{"title":"Interesting, but deeply flawed.","rating":6,"date":"20 November 2006","review":"\"The Hamiltons\" has a great premise, and the ending of the film is inches from being extremely satisfying. On its own, an excellent ending...it's getting there that's the problem with the film.<br><br>The fundamental flaw of \"The Hamiltons\" is that it's caught between being a serial killer film and a family drama, and unlike \"Suburban Nightmare\" - which was similar, also an indie, and much better in my opinion - \"The Hamiltons\" refuses to commit to its characters. It wants you to empathize with them at the same time it paints them as violent sociopaths. In doing this I found the ending disingenuous, and most of the movie was simply too scattered.<br><br>There ARE strong points to the film. The main character, Francis, is easily the most well-developed character. Although he gets too whiny and, frankly, useless at times, he's able to make the transition into action with aplomb. His relationship with one of the women being held in the cellar of the house is particularly well-written and potent.<br><br>The problem is that the movie feels forced to bend to genre conventions, and in doing so it makes the other three members of the family unsympathetic in the extreme. The characters of Wendell and Darlene are written well as sociopaths, but the problem comes when the film wants you to identify with them and accept them as part of this family, and you can't imagine why anyone would love them even if they WERE family.<br><br>The film is worth watching, but the script really could've used another run through editing to work out the kinks.","user":"Caustic Pulp","rank":[42,57]},{"title":"\"Family Dysfunction\" Gets A Murderous Makeover...","rating":8,"date":"29 March 2007","review":"For lovers of sensitive teen dramas centered around dysfunctional families...have I got a treat for you! THE HAMILTONS will take you back to your high school days of discovering books like CATCHER IN THE RYE, RUMBLEFISH and THE OUTSIDERS...only this has nothing to do with gangs. It does deal with a troubled young man, trying to find his place in the world, and also how he fits in with his VERY unique \"family unit.\" Frances Hamilton (Cory Knauf), confused, withdrawn and in constant turmoil, documents his day-to-day life with his siblings, following them around with a camcorder as he records them and his thoughts in a video journal.<br><br>Older brother David (Samuel Child) carries the weight of the world on his shoulders, along with his role as 'man of the house', the legal guardian for everyone else since their parents died. The twins, volatile 'bad boy' Wendell (Joseph McKelheer) and Goth-obsessed Darlene (Mackenzie Firgens) aren't willing participants in the family, unless it involves being with each other. They're as close as a brother and sister can be...actually closer than what's considered appropriate.<br><br>The Hamiltons struggle to be good neighbors and put on the best face they can...when they're not shredding off someone else's. They do the best they can anywhere they live, until people start disappearing, and they have to move...AGAIN. Struggling with their murderous, nomadic existence and what it takes for them to survive, Frances is at a crossroads...should he pitch in and help them continue to do what they do, or should he tear the whole family apart in the hopes of finding a more \"normal\" way to live? If you enjoy 'family dramas with a twist' like George Romero's MARTIN, GINGER SNAPS or even the unconventional psycho-thriller MAY, THE HAMILTONS will definitely be your cup of blood. The Butcher Brothers have carefully fashioned a tale that will keep you engaged even if you figure out the 'family secret' well before the ending.<br><br>The actors turn in solid performances, but especially the ferocious effort by McKelheer and Firgens, and Rebekah Hoyle as Sam, the latest victim who may hold the last chance for Frances' most desperate wish.<br><br>I'm afraid that hard-core gorehounds seeking maximum carnage may feel cheated. When this film was part of HORRORFEST last year, it was sold as a 'slasher' film in the trailers, which is only half-true. Set your mood for something a little more nuanced and different, and you'll be ready to meet THE HAMILTONS.","user":"cchase","rank":[27,37]}]