[{"title":"An excellent movie!","rating":10,"date":"25 December 2005","review":"I was sceptical before watching this film but by the end I had tears running down my cheeks.<br><br>By depicting the feelings and destinies of the soldiers, the film demonstrated the absurdity of war and how each soldier is more than a mere cannon target. It is a commentary on the utter stupidity of politics governing war events from behind curtains while not actually experiencing the real war. By depicting a unique event in European war history that occurred on Christmas day 1914 it shows viewers that Europeans can be as one even as \"enemies\".<br><br>About ten years ago I watched Paul McCartney's video \"Pipes of Peace\" and thought that what it depicted was completely fictitious--nothing more than pacifists' dreams. I have now learned that it was true.","user":"kaplunv","rank":[78,81]},{"title":"The Power of Song as a Gateway of Understanding","rating":10,"date":"16 November 2006","review":"Writer/director Christian Carion ('Une hirondelle a fait le printemps' aka 'The Girl from Paris') is unafraid to write and create cinematic tales that touch the heart as well as the mind. 'Joyeux Noël' is a story of war and its effects on soldiers that goes far beyond sentimentality (or the opposite emphasis on brutality as found in American films) and offers the viewer insights to the responses of young men's minds to the monster of war and how they cope.<br><br>Based on a true story, the film opens with the usual callous killing among three groups of soldiers - German, French, and Scottish - who face an oncoming Christmas Eve in the trenches, the realities of fighting have precluded their getting time to retreat for air. But a miracle happens: among the Germans is a famous opera tenor Nikolaus Sprink (Benno Fürmann) who has aligned with his fellow troops in the trenches, hoping he can bring some minor sense of Christmas and understanding to them. His soprano partner Anna Sorensen (Diane Kruger) finds a way to be with him in the trenches on Christmas Eve, 1914. Meanwhile the disgruntle troops of all three sectors are planning meager festivities and a bit of relaxation even in the trenches as the bodies of the day's plunder lie in the snow of no man's land. We get to know the French Lieutenant Audebert (Guillaume Canet) and his orderly Ponchel (Dany Boon), the German head of the regiment Horstmayer (Daniel Brühl), and the Scots - especially the priest/medic Palmer (Gary Lewis).<br><br>Christmas Eve comes and the voice of Sprink (in reality the tenor Rolando Villazón) sings 'Stille Nacht', rising out of the trenches to sing in the open of no man's land. Soon he is accompanied by the Scottish bagpipes and the 'chorus' of the Germans, the Scots and the French. They all emerge, share gifts of champagne and other libations, and agree to a cease-fire in honor of the holiday. It is in this magic moment that the true personalities of these warring men surface and each is seen as a vulnerable puppet of the WW I, exchanging addresses to meet after the war. Anna Sorenson has managed to enter the scene and during a communal mass led by Palmer she sings (the voice is Natalie Dessay) an Ave Maria (composed by the film's composer Philippe Rombi): the lovers have previously sung a duet version of Bach's 'Bist du bei mir'. For that moment in time the horrors of war melt and the camaraderie of the men glows and is carried into Christmas Day when all three groups of soldiers agree to bury their dead together. Of course the brutality and ignorance of war re-engages and the leaders of the three groups enter camp and threaten courts martial and punishment for the troops' lack of military discipline. The film ends in a manner that leaves the audience able to integrate the happenings of that Christmas Eve on the futures of these men.<br><br>The script is superb, the cast is uniformly excellent, the sets and cinematography are creatively moody, and the musical score by Philippe Rombi is one of the finest in years: the ending song 'I'm Dreaming of Home' deserves to become a standard. Would that everyone could see this film, a bit of global hope in the cloud of the destruction that shadows our world right now. Highly recommended. Grady Harp","user":"gradyharp","rank":[54,57]},{"title":"Footnote to the movie","rating":9,"date":"31 December 2005","review":"This very touching story about a true occurrence during the first Christmas of the Great War is very moving. Although the truce was not a generalized event, it did happen in quite a few areas all along the front line. It was the only moment of sanity in an otherwise gruesome experience in futility. Twenty years later, these same countries would be at it again.Karl Marx said that wars are awful events pitting ordinary people (proletariats) one against another for the benefit of the wealthy, the powerful, the aristocrats. This aspect is depicted very well in this movie. I would just like to add a footnote: Alfred Anderson, the last survivor of the Christmas Truce of 1914 died November 21th, 2005 at a nursing home in his native Scotland. He was 109 years old. Lest we forget.","user":"Pideja","rank":[148,165]}]