[{"title":"A good idea that may lose people who are not fans of Kitano","rating":7,"date":"9 September 2005","review":"Before I get into anything, I'll admit the film was pretty funny. I laughed more than a few times, and I wasn't alone. There were definitely some funny moments.<br><br>Now to my impressions, and I'll include some high level feedback I got from others as well. I'm a mid-tier Kitano fan. I've seen a handful of his directorial films, and many of the films he's acted in. I went with two other people (bear with me, this has a purpose), one of which has seen all of his films, another who hasn't seen a single film by Kitano. Why do I mention this? Because I think it might be one of the keys to enjoying this film As mentioned in the synopsis, the film is about his life. It starts with Beat Kitano the superstar, and follows him around \"off set\" to give the viewer an idea of what he's face in his daily life. At some point he comes across a \"Mr. Kitano\" (also played by Beat) in which the story starts to explore the fantasy world of this \"Mr. Kitano\" who idolizes Beat. While fantasizing, he touches on aspects of his others films, and this is where the experience will differ depending on your prior \"Kitano\" experience. There were a few scenes I laughed at, where as my friend who had not seen a single Kitano film look puzzled. On the other hand, there were some scenes in which I didn't really react, yet my friend who is a \"Kitano Fan\" smiled from ear to ear. I guess what I'm trying to say is while I think anyone can enjoy this film, it really seems to truly experience what Kitano was trying to do you have to know a little about his other films. If you don't have prior knowledge, I'd be willing to bet by the end you'll question if 25-30 minutes of the film couldn't have been removed with little impact on the end result.<br><br>One of the question I thought about while watching the film was why the movie moved so far way from Beat? I actually found the Beat segments to be more enjoyable than the later part of the film, but unfortunately Beat doesn't remain in the film for long before he runs into \"Mr Kitano\". I also wonder if he didn't spend too much time exploring this fantasy world, and the end resulted in too much for the viewer. It was fun at first, but I'll admit as much as I love art film, this started to get a bit redundant after a while.<br><br>I'd also like to mention that the film (at least in my eyes) is by far his most \"artsy\" film to date. It almost seemed Ki-Duk like at times, as the last 40 minutes or so of the film had very, very little dialog. Somewhat like HWAL.<br><br>Anyhow, I'd probably give the film something between a 7 and 8. I'm pretty sure it's going to get some outstanding reviews, as critics who've had more experience with Kitano should get more out of the film. When the DVD drops I might give it another spin.","user":"Splattii","rank":[34,38]},{"title":"One of Kitano's Master Pieces, but difficult to understand as a Takeshi Newbie","rating":10,"date":"4 February 2007","review":"For those of you that may not be familiar with the Japanese Artist Takeshi Kitano, let me first introduce this multi talent. This really is necessary, as most Western People only know him from his Japanese Television Show Takeshis Castle, which has very little to do with the rest of his work and my confuse some of you. Kitano became famous as Beat Takeshi, and still most people in Japan refer to him with that name. You may think that this name comes from his often violent movies, but actually, he got this name while doing slapstick comedy in a duo with another comedian. Nowadays, in Japan, he is most know because of his daily television shows and radio emissions, that range from political/satirical to pure comedy and non-sense. In his own country, not that many people know that he also is an ingenious movie writer, director and actor, very often doing all of them during his movies. He owns his own studios and makes films that very often don't receive the recognition and appreciation they should, although he has in recent years been nominated or won on several occasions for Golden Lions (Hana-bi, Zatoichi, Dolls, Takeshis), Golden Palms etc. But part from these media appearances, he's also a great painter, photographer, cartoonist, writer and poet.<br><br>He made his directorial debut in 89 for the movie Violent Cop. He was only supposed to play the main character, but as the director dropped out, he overtook that role too and revised the whole movie. In case you've heard otherwise, his movies are not only about violence and Yakuzas, although in some cases they play a significant role. But they never stand for themselves, they always stand for something deeper most people may not realize.<br><br>Now let's come to his latest addition, Takeshis'. It is a master piece in every sense, but if you actually not into his movies, I strongly recommend not starting by this one, as you won't understand a thing (even if you speak Japanese:-). I'd recommend any newbie starting by Hana-bi, continuing with Kukijiros Summer, then Dolls and then Sonatine. This may sound like a lot of work, but it's definitely worth it. Please consider at least watching Hana-Bi, it's a fantastic movie from every point of view. Along those movies, you'll get used to the Japanese way of thinking, Kitanos visual and poetical styles, it will be very difficult to understand the very abstract but still hilarious movie Takesihis'.<br><br>I would describe the movie itself as David Lynch meets Haruki Murakami, Kitano style. I think if you know and appreciate each of them, you'll get my point. I don't want to and wouldn't be able to spoil any surprises, still I'm not going to tell you anything further as it would be impossible to reach the subtle brilliancy of this work of art.","user":"c_imdb-314","rank":[21,23]},{"title":"Review from 2005 TIFF","rating":7,"date":"10 September 2005","review":"I saw this film at the 2005 Toronto International Film Festival.<br><br>Takeshis' is the latest film from writer/director Takeshi Kitano. He apparently got the idea for this film shortly after finishing Sonatine (1993). Kitano was previously at the festival in 2003 with Zatoichi, which won the People's Choice Award that year.<br><br>Takeshis' finds him playing two roles: one is a version of his real-life actor persona, Beat Takeshi; the other is a mild-mannered convenience store clerk/amateur actor named Kitano. The lives and the dreams of the two men intersect and parallel each other continuously throughout the film.<br><br>Actors, scenes, and elements from Kitano's other films (Sonatine, Kikujiro, Brother, and Zatoichi to name a few) show up frequently as the two men have waking dreams involving each other's lives.<br><br>The Beat Takeshi of the film is almost a stylized version of his real self, as the public might perceive him. This feeds into the fantasies of the clerk Kitano, who dreams of being Beat Takeshi, taking out his frustrations with the world in a hail of gunfire, just like in the movies.<br><br>The film is constantly jumping between reality and fantasy, from one character to another, rooted in the present but with flashes into the future. It can make it difficult to follow at times, leaving you to wonder whose perspective is being shown on screen and whether it exists in the dream world or the real world or something in between.<br><br>The film was enjoyable and not overly impenetrable, with its share of humorous moments and trademark flashes of sudden violence. Still, the movie is not quite as accessible as his other films, with the exception of Dolls, and while not strictly necessary, familiarity with Kitano's previous work heightens the viewing experience.","user":"riid","rank":[27,33]}]