[{"title":"A hard, but intelligent film","rating":8,"date":"13 September 2006","review":"I recently saw this film at the Toronto International Film Festival.I was eagerly anticipating it's release, being a big fan of Pi and Requiem for a Dream. That being said, this is a hard film to watch. It has beautiful cinematography, an amazing score, and very impressive acting, however, I feel that the advertising on the film has been misleading. This is not a love story, nor is it a science fiction film (although it has elements of both).The true core of the film is a man dealing with the idea of mortality. The fact that he, and everyone, especially the woman he loves, is going to die. This is nothing like Requiem for a Dream or Pi, it has a heavier feel to it, though it is not as depressing. Not everyone will like this movie, in fact, I find it hard to believe that this will get a wide release, as it is not a commercial film. It is an art film, a discussion piece, a beautiful poem about the fragility of life and the idea of forever.","user":"baldwinbrothers2000","rank":[799,986]},{"title":"Absolutely Fantastic","rating":10,"date":"28 September 2006","review":"Fantastic in every sense. This film is indeed poetry, and a beautiful testament to love and the cycle of life, and the impermanence of death. Wow. The script is tight, and the non-linear presentation works very well. The scene compositions were exquisite. The score enhanced without being overbearing, which is so often the case in contemporary film.<br><br>The acting is absolutely superb, but then it's got Hugh Jackman and Rachel Weisz. I can't imagine Brad Pitt doing any sort of justice to this film. Darren Aronofsky lucked out in the long run by getting someone who has the range to portray the vast emotions required for Tomas/Tommy/Tom. Weisz has the depth for regal intrigue and spirited grace. Their chemistry makes their stories even more entrancing.<br><br>This film does require a thinking brain to be appreciated.","user":"mysticwit","rank":[1,1]},{"title":"It's all done except the last chapter. I want you to help me. FINISH IT...","rating":9,"date":"22 November 2006","review":"\"TheFountain\" is a story tackling three different time periods. Tomas (Hugh Jackman) is a 16th century Conquistador on a bloody hunt though a hidden Mayan temple to retrieve sap from the mythical Tree of Life for his queen (Rachel Weisz), who is desperate for immortality. In 2005, Tom (Jackman) is a doctor frenetically searching for the cure to cancer to save the life of his wife Izzi (Weisz), who is in the final throes of her battle with death. Five hundred years later, Tom travels through space on a quest to reach the place of tranquility that Izzi spoke fondly of, using the Tree as a device to get him to the answers he needs to rest his weary mind....<br><br>In performances that can only be described as exquisite, Jackman and Weisz assist their director in opening up this knotty story through their soulful and romantic interpretations of desperation and peace. Essentially playing one lost soul, Jackman foams with remarkable anguish as he performs three separate interpretations of duty, handing in career-defining work. Weisz is the face of love in \"The Fountain,\" lending the film a flowering emotional core of the film.<br><br>The Fountain\" is masterful on so many unique levels, presenting a demanding filmgoing experience that should elicit a grand sense of awe on an emotional and spiritual level unlike anything you've seen this year.<br><br>Aronofsky has out done himself again....","user":"Otto-Maddox","rank":[505,662]}]