[{"title":"Unexpected","rating":10,"date":"2 September 2006","review":"I walked into this movie thinking it would suck based on reviews. I was surprised that it actually was interesting and provocative. I think some people might have trouble handling the subject matter and the fact that it's treated with equal parts seriousness and humor. But uncomfortable laughter to me is the sign of a movie that actually pushes some of our buttons and that's a good thing. The cast here is wonderful, in particular Elisha Cuthbert, who proves she can act and Katy Mixon, who nails the bitchy teen banter that can be so typical in other movies. The direction is heavy handed at times but the humor does a good job of undercutting the heavy atmopshere. The ending does have some problems which I won't post here since I don't want to give anything away, but overall I think any movie that manages to be this disturbing is worth a look. I suspect this film will be re-evaluated when its time has come.","user":"frankfrankfour","rank":[90,111]},{"title":"A distressing but well executed film","rating":8,"date":"12 September 2005","review":"This film receives a 10 for disturbing subject matter. It is at times very difficult to watch. The characters are troubled, each in his/her own way. It feels edgy and often very foreign. With that warning, I must say that on some level I enjoyed the film. Technically it is superb. The character development is wonderful, the story intriguing and the plot is gripping. As the plot unfolds, you are forced to change your opinions about each of the characters. At first I despised the main character but felt much sympathy for her towards the end. Not an uplifting film, but that is certainly not what the screenwriter nor the director intended. I suspect that it will be an award winner.","user":"kenningtonr","rank":[134,179]},{"title":"The Unquiet Quiet","rating":9,"date":"2 September 2006","review":"I just saw this movie last night. And haven't been able to get it out of my mind. I liked it so much - and at so many levels - I hardly know where to begin.<br><br>First, there's the darkness. Quiet, and not-so-quiet, darkness is everywhere in so many ways. This is neo-noir at its best.<br><br>Then there's the humor. Frankly, I didn't realize how much humor there was until I had read the other comments on this movie. While watching the movie I kept catching myself letting out a chuckle at the oddest times, or so I thought: but then I realized others around me were laughing at the same times; and, like me, sort of catching ourselves: all the laughter was quick, disturbed laughter. Still, the other commentators are right: humor is definitely an important and surprising feature of this movie. Very dark humor, very quirky and ironic humor, but humor sprinkled (if that's the word) throughout the rough texture of this movie.<br><br>The subject matter was handled superbly in my opinion. Sexual abuse is always disturbing matter. I kept thinking of comparisons between this movie and \"Hard Candy\" and \"The Woodsman.\" regarding how this very challenging material is depicted. In \"The Quiet,\" The attention to the \"systems\" dynamics of abuse was very disturbing, but very realistic. Nina's ambivalence about her incestuous relationship with her father; her manipulation of him; her dreams of bloody revenge; her myriad ways of \"coping\" with the ongoing horror that both horrifies her (and us) and is so much a part of her life that it's just 'the way things are\" to her in so many ways. Her father's interactions with her are thoroughly realistic. And so is the whole world of Nina's mother. \"Hard Candy\" and \"The Woodsman\" in their ways also confront the complex dynamic of sexual abuse. However, for depth and breadth in depicting these dynamics, I really think \"The Quiet\" comes out clearly superior to the other two movies, as fine as they are.<br><br>In addition, \"The Quiet\" sets side by side two very different - and yet so very alike - forms of young trauma. Nina is traumatized by her father's presence: sexually abusive, emotionally entrapping, overwhelming and enveloping her world so much that she seeks all around her opportunities to break out and escape. Dot, in contrast, is traumatized by her father's absence: dead, stripped from her with a suddenness and finality that leaves her utterly unreconciled to his demise; reduced to ash that she dabs on her tongue but cannot taste. Nina and Dot are both ambivalent in so many ways. Both blame themselves in regard to their fathers; both love their fathers; and miss their fathers; and both share so much more than is at all apparent at the beginning of the movie.<br><br>The acting was just wonderful throughout. The lovely Elisha Cuthbert is utterly convincing as Nina. Camilla Belle depicts Dot with a sensitivity and darkness and vivid colorlessness that is both appealing and repelling. Martin Donovan as Nina's father, and Edie Falco as Nina's mother, are frankly to me simply perfect in their roles.<br><br>The depiction of high school life has been endorsed for its realism by high schoolers both in the Comments and on the Message Board. Certainly it comes across not only as a realistic teen world, but as a kind of identity-defining context that attracts and repels and amuses, all at once.<br><br>All in all, \"The Quiet\" is to me a superb combination of neo-noir darkness, quirky humor, and deep, disturbing exploration of the dynamics of trauma and sexual abuse. I think I'll try to see it again before it goes out of the theatres.<br><br>I feel deeply grateful for this movie, and for all who were involved in making it a reality. It's not often I find myself drawn back to see a movie like this again and again. Thanks, folks!","user":"cdelacroix1","rank":[35,43]}]