[{"title":"Another remake misfires","rating":4,"date":"13 December 2006","review":"It all starts off so well too. The opening shot of Wolfgang Petersen's Poseidon is beautiful. A single take that begins beneath the surface of the ocean that swings up and out of it as the underside of the ship slices through the waves, before pivoting round the colossal cruise liner and zeroing in on Josh Lucas running on the deck. With the sun setting in the distance and the immense size of the vessel itself contrasted with the deep blue of the water, this is a visually astounding entrance to a movie that is unfortunately very shallow indeed.<br><br>A remake of the classic disaster movie The Poseidon Adventure, this tells much the same story with a small group of passengers trying to escape a doomed ocean liner after it capsizes due to a freak wave. Given the beloved status of the original, besting it was going to be tricky from the start so how to do it? Bestow the characters with as much depth and humanity as possible, arrange it so that you don't want any of them to die just as the original film did? No. That isn't the 21st Century Studio Approach to blockbusters at all, the trick is explosions! Lots of explosions! And dangerous stunts that happen in very quick succession with no set up whatsoever.<br><br>As a result, things happen very quickly. We've hardly got to know anyone on the ship before the wave strikes and sends their world tumbling upside down in a hail of glass and debris. Trapped beneath the waves, there is no debate on the best means of survival but instead a bull headed rush to escape as soon as possible and before you know it, barely any time has elapsed before we have our luckless nobodies dangling from lift shafts, diving through burning oil slicks or scrambling up air vents rapidly filling with water. This could all be very entertaining if it wasn't so empty and if only they'd eased back on the throttle a little bit, we could have had a much more successful film.<br><br>Kurt Russell for instance is wasted. As an ex firefighter and former Mayor of New York with a failed marriage behind him, they could have crafted the image of a troubled man going through a midlife crisis who finds himself tested beyond his limits. Instead, the only hints at any characterisation are him protesting his daughter's cleavage bearing dress to leave no doubt that theirs is a strained relationship. Then there is Richard Dreyfuss (who has finally found a bigger boat), whose character might as well be listed in the credits as \"depressed, elderly gay man.\" Everyone else is just as vacuous and while Josh Lucas is certainly a charismatic focal point, it cannot make up for the two dimensional stereotypes of Kevin Dillon's gambler Lucky Larry or Mike Vogel's performance as Christian, the fiancée of Russell's daughter who manages to put in perhaps the worst attempt at acting you will see in a blockbuster this year.<br><br>It does have a few commendable points though. One death scene involving a lift shaft, jagged metal spikes and an explosion is an adrenaline pumping crowd pleaser and the aforementioned scramble through the flooding ventilation shaft is really quite tense, the ensemble cast squeezed together in a claustrophobic nightmare as the water bubbles up around them. Ultimately though, it is not enough to save it. Poseidon may make for a diverting hour and a half but Hollywood needs to learn a valuable lesson about plotting: bigger explosions and insane stunts are nowhere near as impressive if we don't care about the people involved. The original version made an entire generation terrified of getting on a boat with Ernest Borgnine, this is just laughable.","user":"ExpendableMan","rank":[82,98]},{"title":"Not bad at all, there have been worse remakes....","rating":6,"date":"21 May 2007","review":"Whilst not holding a candle to the far superior original in terms of script, plot and acting, this remake of the classic 1972 'The Poseidon Adventure' is at least watchable which is more than can be said for a lot of the seemingly endless tide of remakes hitting cinemas these days.<br><br>The characters (for want of a better word) are a bit thin and cardboard and the plot really is just a long string of reasonably predictable set pieces but at least it entertains. The best bit is the special effects which are absolutely top drawer. For some reason Hollywood can do some really good FX and CGI when it comes to boats and the CGI rendition of the Poseidon itself in the opening scene is incredibly well done.<br><br>Top marks also to the Producers for making sure the Poseidon is a proper British flagged Southampton registered ship and not some Americanised tub.<br><br>Much like its predecessor though I fully expect this version to become stable Bank Holiday afternoon television filler material for the next twenty years. Just a pity a remake of 'Beyond the Poseidon Adventure' can't be done from this.","user":"jmupton2003","rank":[20,23]},{"title":"A 'Bad' movie can still be fun to watch","rating":6,"date":"3 August 2006","review":"Especially one that sinks Titanic in special effects...<br><br>This is a remake of The Poseidon Adventure (1972). Before you jump on the bandwagon and start bashing it on this basis alone, keep it mind that the original film was not exactly a masterpiece. It was a film that sacrificed scientific reality to propel an inane plot, filled with one-dimensional characters and compensated for it with action-overload. Poseidon is exactly the same -- ridiculous plot, intrepid characters and big slice of adventure. What is different in this version is the masterful CGI. This is a perfect time to remake a film like this (much better than in 1972) -- just go overboard with special effects and no one will notice the flawed writing (which is basically a sketchbook mess).<br><br>This is the reason Poseidon does not fail in entertaining the audience. I'll admit that I was skeptical when Fergie of the Black Eyed Peas appeared in all her plastic surgery glory and Josh Lucas spouted out some cheeseball line (\"Where is the disco?\" \"Why, you feel like dancing now?\"), but I set its cringeworthy dialogue aside early on and focused my energy on not wanting to kill Fergie. The giant tidal wave capsizing the luxury liner Poseidon would take care of that, leaving only a small group of people fighting to reach the top and get out. <br><br>Another thing, besides special effects, that is by far better in this version is that the characters are actually interested in surviving and do not stop every few minutes for a petty argument as in The Poseidon Adventure (1972). Make no mistake however, these characters are still dumb to the core, getting by on lucky circumstances, occasional heroic feats and conveniently appearing objects and hatches  you've seen it all before, but damn, this is sensationally quality action.<br><br>Overall, Poseidon is bathed in a militantly hectic mood and is as fast-paced as any action film you'll see. It features mind-numbing special effects, overdoses of excitement and just typical Wolfgang Peterson overkill. It definitely won't disappoint you if you're looking for cheap but solid adrenaline kicks. I'd even happily sit through this experience again.<br><br>6.5/10","user":"Flagrant-Baronessa","rank":[108,153]}]