[{"title":"VERY funny -- a very pleasant surprise!","rating":10,"date":"23 March 2013","review":"I was talked into seeing this, and I have to shout it out, because it is a RIOT! I don't write many reviews, but when I love a film, I have to. If I have any complaint on this one, it's the title. I expected gross-out humor (\"crude\"). There isn't any, really. It's actually extremely unpredictable, subtle and extremely smart humor.<br><br>It has a story arc that you begin to somewhat anticipate, but you don't feel you're being patronized. Instead, you're left feeling that very intelligent people put this thing together in hopes that everyone would find something to love about it.<br><br>The cast is great, the animation is fun, and it's non-dizzying 3-D.<br><br>When I saw it, the entire audience clapped at the end, because we were entertained throughout, and found the ending really satisfying.<br><br>What else? Sweet emotions crop up because we can all relate to the family dynamics. Every family has the screw-up, the salt of the earth, the rebel, and the stubborn one. And it has one of the funniest babies ever put on film. A baby unlike any baby you'll ever see anywhere.<br><br>Very, very funny. Definitely recommend.","user":"nanvan108","rank":[149,178]},{"title":"Joyous fun","rating":9,"date":"24 March 2013","review":"In my life as a parent of a 10 and 12 year old, I have been to see a lot of animated kids movies, some of them quite painful to sit through. This one ranks at the top. The action, the humor, the characters, the plot, all rolled up in to a big ball of fun. I was belly laughing with my kids the whole way through it. And the message is lovely to boot. Excellent casting...the chemistry between the characters stood out in a way I never thought a cartoon could, no doubt due to the talent of the actors and standout animation (not something that I'm usually all that dazzled by.) It was the interaction, along with thoughtful humor of what is important in life, that really put this over the top for me. The complete implausibility of the plot didn't even mildly annoy me, the way stories of this genre sometimes do. <br><br>I could actually stand to watch this a second time. Well done Hollywood, please put this level of thought in to more children's movies.","user":"susanmworden","rank":[85,103]},{"title":"Slapstick Heavy Family Fun","rating":7,"date":"21 March 2013","review":"From DreamWorks studios comes its latest animated adventure, the prehistoric family comedy The Croods. It is a slapstick-heavy family movie that should delight young children and keep parents entertained.<br><br>The Croods are the last remaining family in an arid desert landscape. They have survived by following family patriarch Grug's (Nicolas Cage) rules to the letter, including staying in the cave after dark and fearing anything that seems new (new is BAAAD). Despite this, teenage daughter Eep (Emma Stone) wants to break free and rebels against her father, which results in a chance meeting with the highly inventive Guy (Ryan Reynolds), who warns her that the end of the world is nigh. When the Croods' cave is destroyed, the family is forced on a journey into a strange new world where Grug's rules clash with Guy's techniques for survival.<br><br>The Croods is a formulaic movie that sticks to a traditional hero's journey and relies on typical archetypes, but it's elevated by the writing and direction of Kirk DeMicco and How to Train Your Dragon's Chris Sanders. Like Sanders' previous work, The Croods focuses on a family's dynamic and relationships. This time, the focus is on a protective father who wants to protect his family physically and protect his daughter from a member of the opposite sex who suddenly challenges his position as the alpha male. While the trailers and first half of the movie made is seem Eep was the main character, it's actually Grug who goes through the greatest change and learns the biggest lessons.<br><br>The story is one about learning, exploring, and using one's intelligence. It also touches on the idea that it's unhealthy to live a sheltered life. But at times, the movie lays it on a bit too much with Guy and his \"solutions\" leaving Grug on the losing end.<br><br>Most of the humour used in The Croods is very physical and slapstick oriented. Characters have Loony Toons levels of invincibility as they endure intense physical pain. This type of humour obviously appeals to fairly young children, but I would be lying if I said I did not laugh at the film at all. The Croods avoids using crude toilet humour to generate cheap laughs. There is not much in the way of verbal humour, but there are some running gags, and modernisms are kept to a minimum. They are still there but they are more putting modern products in a Stone Age setting, a little like The Flintstones, so they serve more as pop-cultural winks to adults.<br><br>As expected from a DreamsWork movie the animation is fantastic. It's quick and fluid, and the camera flows nicely as it follows the action. The Croods themselves have a seemingly unpleasant, bulky design to them but it actually works in the context of the film because the characters live in the wild, so big and broad makes sense. It is a little refreshing to see the main female character is not made out to be a stunning beauty, but rather someone who has been shaped by her environment. The beginning of the movie starts with in dry, mono-coloured landscapes before we get to see the bright colours of the jungle and continually seeing the weird creature reminiscence of designs of Sanders' previous works.<br><br>Like other animated movies these days, The Croods has a big name voice cast and they also do a decent, if standard job. No one disgraces themselves. Cage is an unusual choice, but he gives a strong performance. There is only one time when Cage is let off the handle; Unfortunately, that is when we are experiencing the most modernism the movie has to offer.<br><br>The Croods is not going to match the heights of DreamsWorks major hits of Shrek, Kung Fu Panda, and How to Train Your Dragon. But it certainly does not belong with the dregs the studio has to offer. It does what it sets out to do: make a movie that will please children while attempting to give a positive message and some heart. It has an old-fashioned sense of humour that leads to a surprisingly enjoyable animated movie.<br><br>Please visit www.entertainmentfuse.com","user":"freemantle_uk","rank":[59,73]}]