[{"title":"Not for the faint hearted","rating":10,"date":"6 July 2006","review":"If there is any one movie I would ever recommend to discourage someone from trying Heroin or even to stop someone who is doing it this is the movie I would show them.<br><br>I was somewhat blasé when my girlfriend chose this as our weekly movie that we go see, personally I actually wanted to go see Superman Returns, possibly because it had Heath Ledger in it, possibly because it was just another druggie movie. I'm still not sure whether we should have just gone to see Superman, not because it was a bad movie, quite the opposite. I have to say that this is one of the best movies I have ever seen (and that is quite a claim I know), but I don't think that I could ever see it again.<br><br>That said, I would definitely recommend this to you all. It is a brilliant piece, frighteningly realistic, intense and very powerful. I never wanted to try Heroin ever and this film certainly hit that home. If I ever hear someone say they want to try it normally I would just call them an idiot and leave it alone, but now I think I would absolutely go off at them. This movie certainly cannot be accused of glorifying drugs.<br><br>Heath Ledger and Abbie Cornish totally made this movie their own. Their chemistry is at times absolutely beautiful and wonderful, and at other times frightening and unnerving. The number one feeling this movie left me with was quite uncomfortable and also somewhat disturbed. And that I believe is exactly what this movie was attempting to do, realism at it's best. Berthold Brecht himself couldn't have done better himself.<br><br>I've never seen Abbie Cornish in anything else before this, but if her other work is as brilliant as her performance as Candy in this film, point me in it's direction. Abbie was absolutely brilliant, especially in the wide range of emotions and personalities she had to portray.<br><br>My one criticism for this film (if you could call it a criticism) is that it may be too realistic (it is almost as if someone had just filmed this couple's life and put it in the cinema) and some scenes could be somewhat disturbing for some people but I believe that is the point of the film. Call it a warning.<br><br>I know this isn't exactly the most well written review and I hope it makes sense, but this is one film I have actually been motivated to write a review about and I thoroughly recommend it to anyone.","user":"groovy_little_chicken","rank":[209,232]},{"title":"A touching story","rating":8,"date":"30 May 2006","review":"Despite a couple of good reviews, I approached this film with foreboding. Movies about junkies in love, taken from searing autobiographical first novels are usually not what I would call entertaining, though there have been worthy earlier Australian efforts such as \"Winter of Our Dreams\" (with Judy Davis and Bryan Brown) and \"Monkey Grip\" (which starred Noni Hazelhurst and Colin Friels). As \"Trainspotting\" showed it is possible to be light hearted about drugs and addiction but the storyline here is far from cheering and there is no Hollywood-style happy ending. However it did not turn out as gruesome as I feared it might.<br><br>This was partly because of two stunning performances by Heath Ledger and Abbie Cornish as the not very happy couple, Dan and Candy. Somehow, Heath got it just right as the shambling, disorganized, would-be poet, who is nonetheless capable of pulling off an effective scam when required. Abbie gave us a beautiful, headstrong and dangerous Candy. Their scenes together are as intense and as convincing as you will get in the movies. They were both well supported by Tony Martin and Nonie Hazlehurst as Candy's parents and Geoffrey Rush as their supplier and friend Casper. Geoffrey Rush is a dangerous actor to use in a supporting role because of his ability to steal scenes, but he produces a wonderfully ambiguous character as a counterpoint to the intensity of the leads.<br><br>Caspar makes an interesting remark about drug usage: \"When you're on it you don't want to stop, when you want to stop you can't.\" Artists have particular trouble since they see drugs as feeding creativity. Even so, some people break the habit. I hate to use the term \"selfdiscipline\" but that and the support of those close to you seem to be crucial factors. Being in love with another addict does not seem to be a great help, for obvious reasons. The Thought Police will be pleased that drug-taking is not glamourised and Dan and Candy's experiences are a mite painful, but the movie does not take a judgmental stance. If we had to have another movie about junkies in love, this is the one.","user":"Philby-3","rank":[77,86]},{"title":"Gritty life drama of love and drugs.","rating":8,"date":"6 June 2006","review":"\"Candy\" is one of those films where you walk away feeling a little bit stunned by the awful reality it exposes. It is not a pretty film nor a pretty subject, but as another \"drug\" film, at least we can feel an empathy for the main characters,whilst the horror of heroin addiction is still depicted.<br><br>It is this balance that sets \"Candy\" apart from many other druggie pics.The love between Candy and Dan is very real. Affectionate, painful,hopeful and hopeless, it transcends the heroin story to the extent where we really hope everything will work out for them; though we're taken on the ride of rapid decline so familiar with this drug.<br><br>Much credit for this balance lies with an excellent story and direction from Neil Armfeld (more familiar with theatre in Australia), and some superb acting from Heath Ledger and Abbie Cornish in the leads.Geoffrey Rush has a delicious support role as Dan's friend Casper,a \"mentor\" whom we suspect is a little tormented by his own influences.Tony Martin and Noni Hazelhurst round out the main supports as Candy's suffering parents,loving but helpless as they observe their daughter's descent into a world they never knew.<br><br>Like drug problems in real life, all the characters enmeshed in the mess are frail, vulnerable,emotional and ill. They are good and bad.They blame each other and themselves. They look everywhere for solutions that might work,yet we suspect the ultimate solution is too difficult.<br><br>I suspect that in years to come,this will become one of the ultimate drug pics to show to teenagers. Not hopeless like Trainspotting,nor in anyway melodramatic like so many others(Clean and sober,28 days etc..), it shows the horrors of drug addiction whilst maintaining its humanity.The ending may be disappointing for some, but it remains true to the love, hope and uncertainty central to this film and to anyone who lives with recovery.","user":"Drtimk","rank":[74,83]}]