[{"title":"Save your money, skip this one.","rating":4,"date":"26 September 2006","review":"I had great expectations for the sequel to one of my favorite movies. When I learned it would be direct-to-video I worried. Such fears were more than confirmed. This movie, to put it bluntly is terrible when compared to the first. The plot is nonsensical, and takes place around a boring office environment. The acting is frigid, there is little character development, and predictably leads the viewer to little enjoyment, and lots of confusion.<br><br>It would appear the director of this film has not even seen the first one, considering the frequent mistakes, and plot jumps.<br><br>Save your money, skip this one. This possessed such great potential, but suffered such terribly delivery","user":"forasale","rank":[204,228]},{"title":"BE2, lame sequel","rating":4,"date":"1 October 2006","review":"When I first heard of the Butterfly effect 2 movie I was immediately thrilled and captivated, remembering the first Butterfly effect movie with reverence.The non linear buildup and suspense of the first Butterfly effect movie was a refreshing novelty when first released. I expected that the second Butterfly effect movie would continue on this highly enjoyable path. I found it strange and puzzling that Butterfly effect 2 did not make it onto the big screen , but was send strait onto DVD instead?. After I saw the movie, I had to conclude that Butterfly effect 2 is not even a shadow of the original Butterfly effect movie. The story is a lame, predictable love story without suspense or thrill. Now I can understand why the second movie was demoted directly onto a DVD. The first Butterfly effect movie was a trilling , suspenseful wild water ride compared to this stagnant pool of muck....","user":"wild_willie2","rank":[92,106]},{"title":"Spoils the name.....","rating":1,"date":"28 September 2006","review":"The original Butterfly Effect had many wonderful original aspects to it. The main character's abilities were explained in a sort of way that it was slightly believable and the movie was full of twists and turns that culminated in a satisfying and realistic ending. Sadly the sequel does not feature any of the elements that made the original so brilliant. Everything has been dumbed down , gaps in the storyline are almost insulting if you're a fan of the previous film and the amount of sex infused in this movie is unjustified for this storyline , it isn't placed to create an atmosphere like in Lord of War per say , it just seems thrown in because the director was clueless. There are no moment when your skin tingles , you are spoon fed the entire story , everything is very linear in a movie where the time-lines are supposed to be altered and the ending made me feel i needed a drink. <br><br>Just watch the first movie again or search for something else , this movie is one step away from being one of Uwe Boll's, a definite pass.","user":"vladtudose2003","rank":[177,210]}]