[{"title":"Going home is no vacation.","rating":6,"date":"23 June 2008","review":"A successful talk show host leaves Los Angeles to reunite with his family in the Deep South.<br><br>By the end of this movie's trailer, you would've thought \"Oh, not again.\" No, that's what you were thinking. Don't deny it. Even I did too. But the trailer is very misleading and I found myself liking this movie more than I was going to. A lot more.<br><br>What I loved about this movie were the characters and moral. And yes, I loved those things. Each of the characters are unique and have their own memorable moments. Also, this movie had some pretty decent jokes, much better than many other comedies released this time who use clichéd and predictable jokes.<br><br>What I also admired about this movie was the family matter and moral this movie was trying to give out. I found it oddly touching and very sweet. Unfortunately, the other jokes this movie seem to have were also predictable, gross, unfunny, and crude. Some scenes in the movie just ruin the sweets scenes before it because it felt like the filmmakers just want to make people laugh.<br><br>Like I said, the characters were memorable. The most notable were James Earl Jones, Nicole Ari Parker, and Mo'Nique. Mo'Nique, I must say, is the funniest character in here, in my opinion. She throws each joke at you and you can't have enough!<br><br>Yes, the trailers for this movie were misleading so the movie was actually quite decent. The jokes were actually funny, the characters memorable, and the moral is very touching for anyone who has a family. Sure, it had its bad moments but this is better than most comedies released this year.","user":"moviewizguy","rank":[21,26]},{"title":"Expecting too much","rating":8,"date":"15 October 2008","review":"Come on people, I think you were expecting too much. It was a comedy and I thought it was very funny. How were the \"stereotypes\" semi-insulting? I believe half of us have a relationship with someone in our family pretty close to what Roscoe had with his father, and his siblings. We live with it and accept it. Or if we can't accept it, we tell the person, (finally!) how we feel and sometimes we learn because of not communicating that we both looked at things very differently. (\"I didn't know you felt that way!)Black people deal with things, especially family issues, with humor. Ease up, not Oscar material, but very funny.","user":"jlittle73091","rank":[17,21]},{"title":"Lively and yes, funny","rating":6,"date":"23 June 2008","review":"Successful Talk Show Host RJ (Lawrence) is besieged to come back home for his parents' 50th Wedding Anniversary.<br><br>I was skeptical, I was wary, I wasn't sure, but this time the promos didn't let me down. This was good. Since the basic theme was a grand family reunion, you know the usual obligatory things will be performed, a softball game, (with other families it may be a touch football game), an obstacle course (okay, this is a new one that I've witnessed, but there you are) and other family things, etc. Nothing new here. But, what keeps this movie fresh is the quick and lively dialogue from all the cast. It didn't feel scripted. It was like eavesdropping on the goings on and the timing, by all, was excellent. And, you know you need good timing when slap-stick comedy is performed. Also, the music throughout was perfect.<br><br>This was without a doubt a cast of characters, and not your usual every day family members and each character member had his or her own shtick and this helped make this a fun movie. <br><br>Joy Bryant who played Bianca must have gone to the Molly Sims School of Acting because I kept seeing and hearing Ms. Sims whenever Ms Bryant was on screen. Hey, this is a good thing, not a criticism. She was good. Nicole Ari Parker who played Lucinda is absolutely beautiful. I am sure we will see more of these two women in future movies. <br><br>It is indeed rare that promos deliver when it comes to comedy, but this time they did. How about that!<br><br>Violence: Yes, family fighting stuff, Sex: Yes, Dog Sex: Yes, two go at it. Nudity: No, Language: Yes, some, not much","user":"bob-rutzel-1","rank":[14,17]}]