[{"title":"Feel Good, Fun Movie !","rating":8,"date":"20 January 2012","review":"I wasn't expecting much when I saw this movie - and I'm not really a fan of movies where kid's are the lead - but, I was pleasantly surprised with this one.<br><br>Even though this was a \"formula / underdog\" type of movie, it had me cheering for Atom, Hugh Jackman was great and so were the cast of characters.<br><br>The CGI was excellent, I really connected to the characters, and it was just a fun, guilty-pleasure (c'mon, boxing robots - who DOESN'T want that !) type of movie.<br><br>Not quite \"A Space Odyssey:2000\" but then again, it's not supposed to be.<br><br>FUN. ENTERTAINING. GREAT ACTION.<br><br>Recommended !","user":"quarterwave-271-907469","rank":[108,164]},{"title":"Great movie, good story. Who doesn't like fighting robots??","rating":9,"date":"27 September 2011","review":"We saw an advanced screening on Sept 22. I thought it was going to be another one of those cheesy, campy, not really believable, warm fuzzy, type of underdog/rags to riches movies. I was actually surprised. It had some great plot twists, it had a real story line. And while yes, there is some language sprinkled throughout, it did make a good family movie for older kids, 10+ (my opinion). The ending wasn't quite what I was expecting, but looking back I think I liked it better for that. Who wants an ending they can see coming the entire movie?<br><br>It had some great comedy moments. The relationships between the actors felt genuine and not overdone or forced. <br><br>The robot animatronics was good. The robots themselves were fun and imaginative and definitely made me wish we really had this sport. I would so be there!","user":"gremlins-haunt-my-house","rank":[296,500]},{"title":"Outstanding","rating":10,"date":"8 October 2011","review":"Any movie that gets the audience involved in a positive way and leaving cheering is an excellent movie. It is like Rocky on adrenaline and with a whole lot better acting. Hugh Jackman, Evangeline Lilly and Dakota Goyo all have great performances. Dakota who plays the son really makes the movie, but all the actors performances are great. The guy who thought it boring... well, you lack passion and your soul must be dead. Real Steel is the absolutely hands down best movie I have seen in a long time. You will cheer, cry, laugh and be thoroughly entertained. I had to sit and watched the credits at the end just to catch my breath. Great movie.","user":"george_jozwiak","rank":[333,605]}]