[{"title":"big, messy, but enjoyable","rating":6,"date":"2 December 2007","review":"You can get a pretty good idea of Southland Tales from a quick description of its characters. Dwayne Johnson plays Boxer Santaros, a movie star in Richard Kelly's all-too-near dystopian future. But it's not that straightforward. Johnson plays The Rock playing Boxer Santaros, while Boxer is playing the role of a character he's researching, one Jericho Kane. Sarah Michelle Gellar plays an ageing porn-star with a business portfolio that includes energy drinks. And Sean William Scott? Well, he plays a cop's amnesiac twin brother, as part of a neo-Marxist scheme to overthrow the government. Or does he? And you thought Donnie Darko was confusing. Welcome to Southland...<br><br>The year is 2008. Justin Timberlake - did I forget to mention him? He plays a drugged-up Iraq war veteran with a huge scar on his face. Who sits in a huge chair with a huge rifle, guarding \"Fluid Karma\", an ultra-valuable perpetual motion wave machine that is the new form of power since oil has become rare and therefore massively expensive. Politics, anyone? Anyway, JT (who might be telepathic) narrates over an introduction comprised of graphic novel slides and MTV-meets-FOX news bulletins that guides us from our present to the \"present\" of Kelly's 2008 Southland. The passage of time has not been kind to the US; a nuke has gone off in Texas, and the country has become a police state. The most \"recent\" clip reveals that Boxer (played by Dwayne Johnson playing The Rock) has disappeared without a trace, which is where the movie begins. Or does it? By this stage, you just might have gotten the impression that Southland Tales is a bit of a mess. And you'd be right. Kelly's attempt at a politically-charged all-encompassing comment on the world that can also appeal to the youth of today does ultimately fall flat, but that's not to say it's without its merits. The satire's often sharp, and the way the movie skips from genre-to-genre (dystopian conspiracy to Scooby Doo farce to musical to action movie) works surprisingly well without jarring too much. The music, while not perfect (I'm pretty sure Black Rebel Motorcycle Club won't have the kind of comeback that allows them to host LA's 4th of July weekend party next year...) creates some of the movie's more memorable moments, such as JT's Killers dance number and the captivating three-way dance toward the end.<br><br>The deliberately exaggerated performances are, for the most part, very good, with Johnson capturing the action man (playing an action man - going through a crisis - playing an action man) role very well. The way he switches from the kind of guy who pours beer over himself as a form of refreshment to jittery neurotic mess is both funny and engaging, allowing you to see a little of the man beneath the steely facade.<br><br>Unfortunately, this is as close as you'll get to the characters. While the overplaying is amusing, it excludes you on an emotional level. Donnie Darko worked so well because it drew you in, but Southland seems to deliberately keep you at arm's length lest you miss out on some of Kelly's political messages. For all its mystery, intrigue, and action, it feels a bit soulless, and goes out with a whimper as opposed to the bang it so desires.<br><br>Southland Tales is an ambitious film, but a messy one, and while it may not work on the kind of level it's aspiring to, in a movie climate where so many films play it safe, at least Kelly tries. Very flawed, but entertaining nonetheless.","user":"snow0r","rank":[173,234]},{"title":"I normally recommend this film to nobody.","rating":10,"date":"31 March 2008","review":"This is the way the world ends. Not with a whimper, but with a bang.<br><br>This is a film about all of the seemingly random events that lead up to the end of the world. And it's also a comedy.<br><br>That says it all right there, doesn't it? <br><br>When this film ended, I ran to tell every one I could find about it. The odd thing I found about it was that I ended nearly every one of these conversations with the following: <br><br>\"It was amazing, but don't see it. You won't like it.\" <br><br>It's strange to hope that a film I feel so passionately about should not be seen by the very people I want to discuss it with. However, that's exactly the way I feel here. This film is not for everybody; in fact, there are only a precious few out of all of the people who see it that will even tolerate its existence. But you know what? That really isn't important.<br><br>Art is subjective, and no matter how many times I bother to explain a difficult concept to somebody who hated this film, I realize that it will never work long before the conversation ends. The problem is that these difficult concepts are actually very simplistic: Richard Kelly had Dwayne Johnson spoof the stereotypical, apocalyptic action-hero throughout the film. This included over-dramatic readings of his lines, delayed reactions and odd vocal dynamics.<br><br>What? You say that it wasn't intentional, and that it was just Johnson's poor acting skills? <br><br>This is where the small-minded fail to grasp the most simplistic of concepts. The great analytical film student will analyze a crooked frame and declare the brilliance of its intent; they will say that this intentional error supports the themes of the piece. So why does the same not go for Southland Tales? <br><br>Each one of these already-marked actors has broken out of their shells for this movie. The fact that everybody stereotypes them attests to Kelly's genius in assigning them the roles; however, it also proves how unfortunately small-minded today's modern audience has become.<br><br>Was this film a mess? Absolutely, in every sense of the word. But was it a coherent mess? That's the real question, and I think that I can safely say that it is. This film is nowhere near as difficult to understand as anybody would have you believe. The concepts are straightforward and are practically dictated to you by the narrator; this becomes essential to the understanding of the story, as there is just way too much going on to take in on your own. However, instead of hindering the film, it makes these seemingly unrelated scenes string together into a true tapestry that is worth exploring.<br><br>So, you know what? I'm going to go against my own advice and advise anybody and everybody who reads this review to go out and see this film. If you don't like it, don't come back to this website whining about it, because nobody here has the tolerance to explain things to you that you will never understand. No amount of discussion of cinematography, lighting or the fantastically haunting score by Moby is going to change the mind of an already jaded viewer.<br><br>But maybe, just maybe, you will like it. You'll get a chance to experience something you're likely to rarely, if never, experience again. Because as all of us who enjoyed the film know:<br><br>It had to be this way.","user":"devv1988","rank":[362,513]},{"title":"Not as bad as you've heard... never would have done well","rating":8,"date":"12 May 2008","review":"This movie, maybe more than any other I've seen, is a commitment. If you think that 144 minutes is a lot to commit to a movie, the running time is only the tip of the iceberg.<br><br>In the DVD cut of the movie, a lot of things are obscured: what the big picture is, why characters are motivated to do certain things, why multiple identities are a recurring theme, why certain characters/actions are necessary.<br><br>What is in the DVD cut is an extensively detailed alternate world. Unfortunately, to make the actions in that alternate world make sense, you basically have to either watch the movie multiple times, or at least know what you're dealing with.<br><br>There are at least 4 layers to everything that's going on: 1) political/social commentary on contemporary American society and the apocalyptic undercurrent therein; 2) sarcastic/caustic pop culture references (Philip K. Dick is a big one, but also subtle things... for instance, the Rock was Sean William Scott's protector in \"The Rundown\" and plays a similar role here); 3) a self-consciousness or self-referentialism: actors cast against type, some similar themes to Donnie Darko, actions that play out in the film are largely based off of the AWFUL screenplay written by one of the characters (as seen in the graphic novel prequels); 4) the actual plot of the movie, which has deep ties to the Book of Revelation, and makes much more sense if the graphic novels are read first.<br><br>These layers are pretty consummately intertwined. This is part of what makes this movie to be compelling enough to make me want to put in the necessary effort. Its imagery was provocative, and because Richard Kelly has created such a densely layered world for himself, putting in the time actually is incredibly rewarding.<br><br>It should also be said that this film, like Blade Runner or There Will Be Blood, does not let its plot set specifications on its scope, or what it's about. If you hone in on what the director thinks its scope/purpose is, it's much easier to appreciate.<br><br>I'm not sure exactly how to rate this movie, since as a stand alone movie it is a failure, but if you take the time to get inside Kelly's mind, it's worthwhile. So. My advice? View it as an investment or don't view it at all. Don't throw it on for an evening's entertainment. If you do, you might be entertained, but you'll probably be confused and angry.","user":"mgoldsmith","rank":[98,146]}]