[{"title":"A taut psychological thriller","rating":9,"date":"28 March 2007","review":"Buenos Aires 1977 tells the true story of four men who narrowly escaped death at the hands of a military death squad during the Argentinean dirty war in the late 1970s.<br><br>The Dirty War is the name given to the state-sponsored violence against citizens mostly carried out between 1976 and 1983 by Jorge Rafael Videla's military government in Argentina during what was called by the dictatorship the \"National Reorganization Process\" or what the modern world calls \"genocide\".<br><br>The film follows Claudio Tamburrini, a goal keeper for a minor league football team, who was forcefully kidnapped by members of the Argentine secret military police.<br><br>He is taken to a detention center known as Sere Mansion which is an old dilapidated house in a suburban neighbourhood on the suspicion he's an anti-government terrorist.<br><br>Tamburrini is not alone and his fellow abductees are frequently tortured by the jailers for information he doesn't have because he was never a political activist.<br><br>After four months of imprisonment, and many sessions of torture, Tamburrini and his fellow captives make a break for freedom.<br><br>It is a gripping film throughout with bleak filming adding depth to the situation making it a taut psychological thriller especially because you are aware that this actually happened. The camera work and acting immerse the viewer into the mundane but arduous life that these innocent prisoners lead right through to the climatic finale.<br><br>According to the Nunca Más report issued by the National Commission on the Disappearance of Persons (CONADEP) in 1984, about 9,000 people were \"disappeared\" between 1976 and 1983. Estimates by human rights organisations place the number at closer to 30,000.<br><br>Buenos Aires 1977 is a deeply moving and involving film worth a trip to the cinema for an education on both how to shoot this kind of film and a brief education about the not-so-distant Dirty War of Argentina.","user":"saturnalia33","rank":[17,17]},{"title":"An Inside View of Political Detainees","rating":9,"date":"25 August 2008","review":"One of the aspects of this excellent film from Argentina is the disturbing fact that it is based on actual events. Director Israel Adrián Caetano (with Esteban Student and Julian Loyola) created the screenplay from the main character's memoir - 'Pase libre' by Claudio Tamburrini - and in doing so bring a sense of immediacy and unfiltered truth to this tale of the 1977 military dictatorship in Argentina during the time of the 'Desaparecidos' or terminal evacuation/elimination of dissidents to the regime. <br><br>CHRONICLE OF AN ESCAPE (Crónica de una fuga) relates the capture of soccer goalie Claudio Tamburrini (Rodrigo de la Serna, remembered for his magnetic portrayal of Alberto in 'The Motorcycle Diaries') during a soccer game in 1977 when he was abducted, blindfolded, and taken to a house of detention as a suspected revolutionary. Claudio is beaten, interrogated, starved, and forced to live nude, blindfolded and in handcuffs chained to his palette along with other detainees - Guillermo Fernández (Nazareno Casero), El Gallego (Lautaro Delgado), El Vasco (Matías Marmorato) and El Tano (Martín Urruty). Each of the detainees is repeatedly tortured and deprived of the 'necessities' of living until after four months the group decides to escape. The tension of their ingenious escape provides the film with a tense and riveting closure, and at the end of the film the destinies of each of the detainees is revealed. <br><br>Though the world knows some of the details of the military junta in Argentina that lasted from 1976 to 1985, observing the calamity in the form of real individuals who suffered pleads the case for understanding the atrocities better than simply reading media accounts. The manner in which Caetano directs his superb cast is enhanced by the extraordinary cinematography of Julián Apezteguía and the moody and creatively subtle musical score by Iván Wyszogrod. The cast is uniformly excellent: though the men who play the evil torturers have not been named in this review they are all very strong actors. This is a tough movie to watch and the audience should be aware that the prisoners appear in the nude throughout the film (if that is a problem for some viewers). In Spanish with English subtitles. Very strongly recommended, especially in this time when the concept of 'detainees' is so very much in the public eye once again! Grady Harp","user":"gradyharp","rank":[15,15]},{"title":"Recollections of a Dark Period","rating":7,"date":"25 December 2008","review":"In 1977, the goalkeeper of the Almagro team Claudio Tamburrini (Rodrigo de la Serna) is illegally kidnapped from his home, arrested by the government forces and sent blindfolded to Sere Mansion, a clandestine detention center. His acquaintance Tano (Martín Urruty), who had been tortured for a long period, had falsely accused Claudio of being a revolutionary. Along the months, Claudio is kept nude and handcuffed together with the prisoners El Gallego (Lautaro Delgado), El Vasco (Matías Marmorato) and Guillermo Fernández (Nazareno Casero) and submitted to all sort of humiliations and tortures, until the night they decide to escape from their imprisonment in the old mansion.<br><br>The dramatic \"Crónica de una Fuga\" is a true recollection of a dark period of dictatorship in South America sponsored by USA to fight the communism, more specifically in Argentina. The story is very well acted but limited to the situation of Claudio and the other three prisoners in the Sere Mansion and their escape. However it omits, for example, that Tano and the other prisoners have been certainly dropped airborne from an Air Force airplane (the Jeep indicates Air Force Argentine, and this was a common practice in the dictatorship period). My vote is seven.<br><br>Title (Brazil): \"Crônica de uma Fuga\" (\"Chronicle of an Escape\")","user":"claudio_carvalho","rank":[15,17]}]