[{"title":"It is what it is.","rating":6,"date":"1 July 2008","review":"I'm quite surprised at how many people are slamming this movie for historical inaccuracies, use of English, its similarity to several other films and a happy ending. <br><br>I had no problem understanding this was not a historical documentary nor did any signs point to this film being the most original sensation of the year. When I went into the film, I expected a fictional Hollywood story with a bit of action and some entertaining special effects. Guess what I got? Yes, I got a fictional Hollywood story with a bit of action and some entertaining special effects. That's all it aspired to be, it works for the film and it shouldn't be a surprise to anyone thinking of sitting through it.<br><br>On a side note, I hope the same people slamming this film for its historical inaccuracies, use of English and similarity to other works go slam Shakespeare next because these terms describe his most famous plays. As far as I am aware, they weren't speaking Shakespearean English in 13th century Verona, Italy. Anyone hear of, The Tragicall History of Romeus and Juliet by Arthur Brooke? Published before Shakespeare was even alive, I wonder if he based \"Romeo and Juliet\" off it? <br><br>Point is, 10,000 BC should be taken for what it is. It is two hours of Hollywood entertainment. No surprises.","user":"dan-ragan-1","rank":[265,334]},{"title":"I spy with my little eye....Swiss, Eskimos, Arabs, Egyptians, Indians, Native Americans, Celts, Zulus, Masai, Ethiopians....","rating":1,"date":"19 March 2008","review":"The film starts by introducing us to a Multi-culti tribe in Switzerland (?) led by a shaman eskimo woman. They seemed to have forgotten that prehistoric hunter gatherers generally wandered around and fill instead their days by waiting all year in their village for mammoths to meander by and kill one for food which luckily lasts all year. <br><br>Their 'noble' existence is shattered by some Arab horsemen looking for slaves. They leave the Alps into the jungles (!) of Italy(?) where they are attacked by birds which once lived in South America. The scenery changes to Utah as they track the slavers into Africa. They meet some Zulu tribes who happened to have bumped into the Swiss hunter's father and who somehow managed to teach the Zulu tribe the one language that seems to exist in Europe. <br><br>The Arab desert slavers have attacked the zulus too so the Swiss and the zulus combine forces to attack the slavers. Rather than follow the river (the Nile?) to the slave town, they decide to cross the Sahara (after all there's no food or water by a river so this would seem a sensible option!).<br><br>After wandering around for weeks they look to the stars and decide to follow the North Star (the slave city, in common with Santa's hideaway is under it apparently). Hey ho, after a few days they find slave city and it turns out to be a pyramid construction site led by an alien. Luckily, the crafty alien god has lots of slaves and a ready source of desert living woolly mammoths to help build his pyramid. Swiss hunter cries 'operation desert freedom' and the slaves rebel. <br><br>The alien god's Indian eunuchs (fresh out of Indiana Jones and the Temple of Doom)and some albino africans flee to a giant ship stored in a pyramid but the rebelling slaves catch them up and kill the giant alien who turns out to be 'Lurch' from the Adams family. <br><br>Eskimo woman then dies back in the Alps to bring Swiss hunters girlfriend back to life in the Sahara (she's prophetic as shes got blue eyes - apparently rare we're led to believe in Switzerland). <br><br>The film ends with the desert dwelling Zulus giving the Swiss crops which somehow grew in the Sahara. The Swiss then set off home surely cursing that they set Lurch's giant boat alight as it surely would have speeded up their journey across the Mediterranean. They have a group hug back in the Alps when their desert crops begin to grow at the foot of a glacier...<br><br>Needless to say I won't be buying the DVD","user":"garaidh_2000","rank":[350,477]},{"title":"Very unjustly criticized, in my honest opinion","rating":7,"date":"2 July 2008","review":"While I was certainly not going to watch 10,000 B.C. expecting a masterpiece, I got much more than I bargained for as well. While the film is not excellent, it entertained me thoroughly and I was interested throughout the entire watch and surprised after it was over. It is pelted with comments and reviews about how it is poorly written, edited and played out, though I am here to counter those three accusations, because I, like a few numbers of people, thought it was enjoyable.<br><br>The movie could upset many scientists or people who love and or respect history. Having mammoths in what looks like the Ice Age, large Velociraptor-like birds in an immense jungle and Egyptians all in the same time era, it seems like the movie just threw a whole bunch of material together. However, I am always willing to accept that even with information and proof on past time eras, we can never be 100% certain on anything, and I judged this film not on it's historical accuracy, but it's entertainment and enjoyment levels. The characters, while a lot are a bit unbelievable or one-dimensional, all pass the time effectively and fill in for what is needed in the story. The storyline itself is probably my favorite aspect, having some wonderful material to work with and really nice effects and performances from the lead man and Camilla Belle, who is regarded as a horrid actress, but I very well liked in this and her other work.<br><br>It is nicely done, in the sense that I am interested and entertained with how everything moves along, and even though it seems like it is unsure on which direction it should go at some points, it never jumps subject, even if it does jump scenes. I do not understand Roland Emmerich, though. It seems at times that he just did not want to concentrate on or deal with this film, having some very poorly played out scenes. Even if I liked the way it moved along, he was not as dedicated as he could have been on this movie like he was Godzilla and even The Day After Tomorrow. The movie also has some poor dialogue and some material just does not make sense, but I still however stand by my approval of it. It is not as bad as many claim, even if it is not amazing. It is worth the watch if you want to watch it.","user":"Dragoneyed363","rank":[58,75]}]