[{"title":"A huge improvement on the first film","rating":7,"date":"6 February 2009","review":"This is an entertaining film, and is it better than the first movie? Yes, much better! The stunning location of the English castle was a delight, as was the lovely Jennifer Love Hewitt. Don't forget the adorable dog Oadie, who was one of two reasons(Jennifer Love Hewitt being the other) for watching the first film. Billy Connelly was too OTT, but it didn't help with the material he was given. The script was still a tad uninspired, but an improvement. Bill Murray is a lot more bearable in this movie, but he does sound a little bored. The supporting voice cast do a commendable job too, Tim Curry the standout with his aristocratic voice, he was perfect for the voice of Prince. I laughed a lot at this movie, its predecessor is a far cry from that. There are a few cheap gags such as the dog Rubble and the trousers, and some clever ones such as the mirror sequence, inspired by I think the Marx Brothers. Thank you for an entertaining movie, and it doesn't deserve the low rating. 7/10, Bethany Cox","user":"TheLittleSongbird","rank":[12,15]},{"title":"HUGE surprise...","rating":7,"date":"28 December 2006","review":"I braced myself for 90 minutes of unfunny and weak cat jokes.<br><br>We were totally, and I mean totally, surprised: a really well-made film with lots of genuine laughs and the kids were all enthralled. Talking animals, a great turn by Billy Connolly (Who got my wife's vote for best dressed man in the movies this year - whoever did the tailoring on this really did a good job). Excellent sets (Castle Howard is perfect for this), and just plain fun all round.<br><br>Garfield and his doppelganger are very well animated: you really can't fault it.<br><br>Nothing too scary, nothing too rude, and lots of pratfalls, good one-liners, and fun to had by all. A nice dose of sentimentality -- all in all, and I hate myself for saying it, one of the most enjoyable films we've seen in a while - whether for kids or not.","user":"intelearts","rank":[24,35]},{"title":"Nice for what it is. Silly, good hearted, for kids and parents. Bit slow for adults","rating":7,"date":"22 July 2006","review":"I did not know this was a children's movie. After all, Shrek, Monsters Inc., Toy Story, etc., appeal to children, but are also squarely aimed at adults. Garfield, Tale of Two Kitties is squarely aimed at younger folk, with a few mild chuckles for the parents. It was colorful, well done, excellent quality, etc. but let's face it, by being designed for 5-10 year-olds, it also had to be really sloooooooow.<br><br>Brekin Myer is a charming actor with good vibes. So is the chick--- Jennifer Love Hewitt. Likable people. The British supporting cast (note that the movie starts in America, but moves to an English location soon enough) is also excellent. Billy Connoly plays an odious villain; I find that comedian rather odious in person, myself. But I must confess he seemed to be a good actor--- maybe his odi-osity was due to great acting ability? Anyway--- Bob Hoskins is a hoot as the bulldog, and the other animal voices are good, too. Tim Curry was an amazing counterpart to Garfield, playing the ultra-posh aristocratic English cat, Prince. But again, the jokes are NOT multi-leveled. They are simple, aimed at 5 year-olds. If you take your kids, you'll like it too. If you go with adults, you'll have a lot of cognitive capacity left over whilst viewing it to accommodate virtually any daydreaming task.","user":"bopdog","rank":[19,28]}]