[{"title":"I just hope Rutger Hauer will not watch this!!","rating":5,"date":"5 February 2007","review":"Unlike many horror fanatics, I have nothing against the trend toward remakes of classic genre filmsthere are cover songs, so why not cover movies? But the 2007 embalming of Robert Harmon's 1986 masterpiece The Hitcher is the kind of mechanical exercise that gives not only remakes but horror in general a bad name. Witless and pointless, it's compelling only as a lesson in the importance of style when it comes to scaring an audience. Though the plot is close enough to the 1986 version to earn a screen credit for that film's scriptwriter, Eric Red, the execution is so botched that what was terrifying in Harmon's film becomes coma-inducing in the remake. Like the 1986 version, the new Hitcher tells the story of a young couple relentlessly pursued by an unstoppable, completely psychotic killer who frames his prey for murders he commits. The key difference is that in the original movie the love interest, played by Jennifer Jason Leigh, didn't come into the story until late; a significant chunk of the storyline was devoted to a cat-and-mouse game between two characters, Rutger Hauer's chilling hitcher, and hapless victim C. Thomas Howell. In the new movie, the heroes are an item right from the start: college lovers Sophia Bush and Zachary Knighton hit the road, and after some random babbling that's evidently supposed to pass for character development, they find themselves the targets of the psycho hitcher, played by Sean Bean. What follows is essentially a feature-length chase, as the kids have to evade the murderer as well as the authorities after the hitcher, in a hilariously implausible chain of events, makes it look as though they are responsible for his bloody crimes. The Hitcher is directed by Dave Meyers, a veteran of music videos, who is to plot and character what airline workers are to luggage. He excels in individual moments, like an energetic opening-credits sequence and some well-timed bursts of violence, but when it comes to connecting these moments into any kind of involving drama, Meyers and his collaborators don't seem to have the faintest idea what they're doing. Even though the film is practically all action, it has no momentum or intensitythe set pieces don't build, they just pile up on top of each other. There's no terror because there's no emotional connection to the characters; the noir-ish doppelganger relationship between Hauer and Howell in the original has been completely stripped from the narrative, and the lack of psychological subtext makes Bean silly rather than threatening. Though the movie is superficially faster paced than the original, it seems longer because there are no strong characterizations to anchor the action. It doesn't help that Meyers has one lone weapon in his arsenal of scare tacticsin the place of suspense, he provides scene after scene in which the volume goes down really, really low before someone jumps out with a loud \"BOOM!\": This isn't film-making, it's shock treatment. The director also has no apparent understanding of what made the original film scary. Whereas Harmon mounted Eric Red's audacious screenplay as a sort of hallucinatory nightmare, Meyers shoots the same action as though he's directing a beer commercial. There's no sense of poetry in his images, and the result is that a villain who came across as a supernatural force of evil personified in the 1986 film just seems silly herethe plot is absurd, so to play it on a level of literal reality as Meyers does is a choice that defies common sense. The decision to turn the movie into a sort of teen romance is equally mystifying given how few dividends the love story yields. Bush and Knighton are appealing screen presences, but they have nothing to do heretheir relationship has no definition or depth, and when the movie hinges on one of the lovers avenging the other, the violence seems uninspired and gimmicky because it isn't an extension of any internal tension. I realize, especially for its target audience, that complaining about the lack of substance in The Hitcher is a little like complaining about the lack of musical numbers in The Hills Have Eyes. But The Hitcher doesn't offer even the most basic payoffs of its formula. The action sequences are so slick and impersonal that when a key character is torn to pieces it has all the emotional impact of a grapefruit being squashed on screen, and so little actually happens in the movie that when the end credits start to roll it's a little shocking. As I watched the final fadeout, I was still waiting for the movie to begin.","user":"Cinema_Love","rank":[44,60]},{"title":"Even if you don't compare it to the original this isn't a very good movie","rating":3,"date":"10 February 2007","review":"The plot is simple, a couple traveling on a dark and stormy night pick up a man who was hitch hiking and soon find they should have passed him by.<br><br>The story has been often used but the immediate source for this telling is a film that starred Rutger Hauer as the title character. Hauer's John Rider managed to walk the fine line between insanity and reason as he upped the ante in everything he did in some twisted game that only he understood. In this remake Sean Bean is the psycho on the loose and its a wonderfully acted portrayal of a man on the edge of sanity. Unfortunately he's not very scary. Bean is somehow much to urbane to be frightening even as he's doing terrible things to people. He's simply to charming.<br><br>Whats worse are the people who pick him up. I hated them from the start and wanted some one-anyone-to kill them simply so I didn't have to spend anytime with them. Stupid and vacant they seemed less like people than the victims Bean kills. C Thomas Howell in the original may have been a bit of a twit, but I really felt sorry for him as Hauer turned his life into a living hell, here I felt they had it coming.<br><br>Different enough from the original to make comparisons pointless this film isn't very good on any level and really has no reason to be seen except for Sean Bean good, but nonthreatening villain","user":"dbborroughs","rank":[48,68]},{"title":"Enough with bad remakes already!","rating":1,"date":"21 January 2007","review":"The original was highly enjoyable and Rutger Hauer had never been creepier.Jennifer Jason Leigh was memorable too,as she always is,even if she had limited screen time.In the remake they have sped everything up and added lots of more gore.The gore bit pleases all the bloodthirsty kids who usually shoot people's heads off in lame shoot-em-up video-games.More irritating still this one is shot like some long music video with totally out of place music.Sean Bean better watch out.Silent Hill was bad enough and he appeared in the ultra-silly Equilibrium as well.Now this.Fortunately the critics have given terrible reviews and this abysmal remake really deserves it.If you've seen the original don't EVER watch this remake.Learn this.Remakes are in 9 out of 10 cases a lot worse than the originals.Only remakes that are superior that come to mind is \"the Fly\" and \"the Thing\".","user":"ColinChapman","rank":[32,45]}]