[{"title":"The loneliest of professions","rating":8,"date":"28 January 2006","review":"I saw this film at the 2005 Toronto International Film Festival. Between 1933 and 1955, Albert Pierrepoint was Britain's Chief Executioner, responsible for more than 600 hangings. Timothy Spall gives a devastating performance as a decent man engaged in the loneliest of professions. The title is somewhat misleading. Hangings were carried out until 1964, but Pierrepoint was the last man to hold the official office of Chief Executioner.<br><br>As the film begins, Pierrepoint is proud to be offered a job as a hangman, following in his father's and uncle's footsteps. Since he's only needed every few months, he maintains his job as a grocer's deliveryman and keeps his moonlighting a secret from his friends and even his wife (Juliet Stevenson). He is very good at his new profession, and is determined to complete each job as quickly and humanely as possible. It's a bit odd seeing him trying to shave seconds off the time required for each execution, much like a professional athlete trying for a world record. That is, until you realize that his desire is for the prisoner to have as little time as possible to be afraid. After each execution, it falls to Pierrepoint to cut down the body and prepare it for burial, and it's touching to see the tenderness he displays. After the execution of one woman, he tells his assistant, \"She's paid the price, now she's innocent.\"<br><br>Pierrepoint's reputation grows and after the war, he's flown to Germany by the British Army and placed in charge of executing scores of Nazi war criminals. As a result, his secret is leaked to the press, who now broadcast his identity as the finest hangman in the land. With his earnings from these jobs, he and his wife decide to open a pub(!), which does a booming business, thanks in part to his notoriety.<br><br>But the job begins to take a terrible toll. Even after he tells his wife about his second profession, she doesn't want to hear about it. Nobody really wants to hear about it. When protesters start demonstrating against capital punishment, Pierrepoint finds himself the target of their ire. Doubts begin to creep in to destroy his previously unshakable faith in what he does. By the mid-1950s, Albert Pierrepoint resigns his position (ostensibly over unpaid fees) and completely reverses his own position on capital punishment, though he initially keeps his opinions to himself. In his 1974 autobiography, however, he finally confesses that the whole experience had left a bitter aftertaste for him and that he felt that capital punishment had \"achieved nothing but revenge.\"<br><br>Though this is a fairly standard biopic and \"issue film,\" the performances of Juliet Stevenson and especially Timothy Spall are remarkable. Pierrepoint's determination to remain detached takes a terrible toll on his life and is bound to fail eventually. The obvious conclusion is that killing corrodes our humanity, whether the killer is a murderer or an executioner on the state's payroll.","user":"mcnally","rank":[27,27]},{"title":"A Dirty Job","rating":8,"date":"7 May 2006","review":"Albert Pierrepoint was Britain's most prolific executioner, overseeing the hanging of more than 600 condemned men and women including Derek Bentley, Ruth Ellis and Lord Haw Haw. Adrian Shergold's film starring Timothy Spall in the title role is a dark period piece exploring the stark relationship between compassion and work ethic.<br><br>Pierrepoint approaches his grisly duties with pride, professionalism and a stoical detachment  a third generation hangman, he is well accustomed to checking his personal life at the prison gate while he gets on with the job at hand.<br><br>But duty and morality are constantly battling in the back of his mind - a struggle neatly illustrated when he is seconded to Germany after the War and tasked with dispatching Nazi war criminals. His clinical work here is deliberately and uncomfortably linked to the crimes of the Nazis who gassed their Holocaust victims with the same brutal precision.<br><br>Back in England, as liberalism begins to take hold and high-profile executions enrage a population bubbling with discontent, Pierrepoint's reputation in the eyes of the public slides swiftly and irretrievably from British war hero to callous murderer  a bewildering descent perfectly captured by Spall's mesmerising performance. Juliet Stevenson is not bad either as Pierrepoint's loyal wife gradually embittered by years of turning the other cheek at her husband's double life.<br><br>The film celebrates dignity and humanity but is laced with a uniquely British attitude evocative of Vera Drake and The Remains of the Day. Like these earlier social dramas, Pierrepoint culminates memorably in a momentary quivering of its previously resolute stiff upper lip.","user":"tjcclarke","rank":[48,52]},{"title":"Charismatic Timothy Spall.","rating":8,"date":"14 September 2006","review":"I booked this independent little British film to show at Coalville's Century Theatre, on the Non-Theatrical circuit. Titled \"Pierrepoint\" here in the UK, this is a case of another quality British film being routinely ignored by the multiplexes in favour of the usual fodder presented for the masses. I was confident my regular audience would be interested by this true story of mass executioner Albert Pierrepont who really was 'a household name' in the 50s and 60s. In actual fact, Mr Pierrepoint was NOT 'the last hangman' in the UK. It really is a remarkably entertaining picture considering the obviously dour storyline, much aided by the portrayal of charismatic star Timothy Spall, who can be relied upon to always give an interesting and engrossing performance. Mr Spall is no matinée idol lead but not many would argue he is one of the most popular actors in Britain today. The film explains how Albert followed in the same 'career' of his father and Uncle Tom (who is briefly portrayed in the film), and interestingly reveals the technical side of his skillful and efficient methods for a successful result! Along the way, Albert is seen with Field Marshal Montgomery, who personally recommended Pierrepoint to carry out the Nuremburg executions, as well as other familiar people such as Timothy Evans, Derek Bentley and Ruth Ellis, all of whose cases fed the argument for the abolition of capital punishment. In the film, much dramatic use is made of Pierrepoint's execution of his friend, 'Tish', who often sang duets with Albert in the latter's pub. This really is true, very much a case of stranger than fiction. This film is strangely entertaining, never dull, although I noted some of the female members of my audience were regularly looking downwards whenever a hanging was shown. However, afterwards, there many favourable comments about this film and we were still talking about it at the post show drink in the pub afterwards! Obviously achieved on a very restricted budget, but a film to be recommended.","user":"keithmp","rank":[39,42]}]