[{"title":"Solid and disturbing hidden gem about a troubled psycho","rating":8,"date":"16 April 2005","review":"I'm happy to have caught this one at the International Rotterdam film festival 2005 a few months ago. I actually enjoyed myself very much. It was a special screening which the director joined and introduced with a nice little speech. He basically said that a lot of film festivals rejected it because of its harsh violence and that Rotterdam is the first to be open to it. In other words; I was in for a big treat.<br><br>All in all, the movie isn't overtly violent. However, that doesn't take away that it's very good debut of the director, not to mention a good adaptation of a manga. It's a nice slow paced psychological movie that toys with the troubles of a man who has suffered a lot in his younger years and is now living with the after effects. It's a very dark movie with horror and drama elements about a young man being tormented and teased most of his younger school years. Years later, he has taken refuge in his little house where he has bad dreams, fantasies and is alone a lot. Then he gets a new job at a construction site and some new neighbors: turns out that the man of the family moving is his new employer and is fact, the same guy who used to make his life miserable. To make it short, it's payback time, but not a Kill Bill, Sin City type payback with slashing, one-liners and lots of action (which is also good btw), but a more slow-paced and build-up, tensed, psychological and slow payback. This approach proves to be very effective for the themes the movies tries to flow along: teen abuse, trauma, social pressure. The movie turns out to be an interesting study of human behavior and social schizophrenia. btw, The alter ego or second personality of the young guy is one of the scariest mo-fo's ever on screen, mentally but definitely physically, up there with the likes of Freddy Kruger, Hannibal, and whatnot. Horrific? Think of a very very very very scary looking guy you never wanna meet in this life or the next, that has been tormented most of his life and is completely immune to any moral, social of ethical code. It gets pretty horrific from there.<br><br>After the movie there was a short Q&amp;A session with the director in which we could ask questions. The crowd wasn't too anxious and due to the bad information provided by the organization, half the audience was already gone. Regarding the violence, he thinks that a lot of people rejected the movie not because of the 'goryness' or explicit images of the violence but more because of the type of violence, the effects and motivations of that violence and the effects of it. I couldn't totally see that in the movie: a lot of the violent image are disturbing in a surreal sense, not so much in a shocking sense.<br><br>It's a shame that the people who control what we can and cannot see in theaters and festivals are passing up this film, and to be honest, I don't really get it. I can give you 25 other movies which are much more violent. But it probably has to do more with the realness of it all. Either way, I hope that after the release in homeland Japan, second of April, the movie will get more attention and hopefully this hidden gem will get a wider release across the globe.","user":"Ike-NL","rank":[21,23]},{"title":"Beware with the things you do to people....they can come back to you!","rating":7,"date":"24 October 2007","review":"The story begins showing Jûzô Murasaki,a boy who is frequently being bullied and abused by a gang from his school, whose leader is Tôru Akai, the school's little demon.(And the things they do with Jûzo are not light stuff, they are from eating bugs to having acid poured down his mouth.) Never being able to defend himself, Jûzo grows traumatized, and ends up working, as an adult, in the same place that Tôru works. Tôru still has the same bad behavior he had as a kid,torturing other workers that are underneath his rank, but he doesn't remember that Jûzo studied with him when they were younger. Living the same hell as an adult that he had in his childhood, the anger inside Jûzo grows to a point that he gets another self, a violent and angry personality that is very different from his ordinary behavior. And this personality very soon becomes a part of Jûzo's, who wants his vengeance for all the years being bullied. And the good thing is that he is Tôru's neighbor...<br><br>'Rinjin 13-gô' is a very different movie about vengeance, specially because most of the things shown in this movie actually never happened, they could have happened if Jûzô never faced his enemy Tôru Akai. In this way, the story is very original, since most of the movies when have the vengeance plot, actually show what the characters did to their enemies, and never what could have happened if they had faced the person before. The director of this movie started in the film industry very well, and I hope we can see more great movies from Yasuo Inoue.<br><br>Ps: Anyone here is surprised like I am, to see Jûzo's wife let a strange neighbor that she doesn't know well to stay with her son?","user":"Lady_Targaryen","rank":[6,6]},{"title":"Hate to have that guy as a neighbor","rating":9,"date":"10 April 2007","review":"And here we have this hidden gem by first time director Yasuo Inoue. \"Rinjin 13-go\" AKA \"Neighbour Number 13\" is a revenge driven psychological movie that explores the inner conscience of an individual rejected and abused by society. Stylishly shot, the lead character develops a psychopathic split personality, the action is satisfyingly bloody not all that gory as I expected it would be, most of the violent acts done of-screen and as a hidden surprise it's got a cameo appearance by Takashi Miike. What more could I ask for? Nothing really. But one question still remains. Does it deliver? You bet it does, this a great film and it indeed offers some insightful glimmers into the mind of a psychopath.<br><br>Jûzô Murasaki (played by Shun Oguri) is an individual who has spent most of his childhood being bullied in school. Often humiliated and beaten he has never been able to stand up for himself. Years have passed since those days and now he has just moved in into his new apartment in a small tenement building. He finds a job as a construction worker under one, Tôru Akai (played by Hirofumi Arai). Akai, to put it simply is a bully. He spends most of his time torturing those that are underneath his rank, those that can't stand up for themselves. To make matters even worse Akai lives in the same apartment building one floor above. Juzo's childhood nightmare is brought back to the surface as he is subjected to a series of pranks leading up to a point where he is trapped in a toilet by Akai. Then, enters Number 13, Jûzô's split personality. One very nasty fellow who unlike his \"roomate\" has no qualms to use violence against, anybody or anything. 13 is the vessel holding all the anger, all the rage that has been building up in Jûzô for years. Once he is free all hell brakes loose, there are no more moral barriers to cross, everyone in his path gets it one way or the other. <br><br>Inoue does a commendable job in directing this movie. Bordering near the realm of the surreal, \"Neighbour Number 13\" is a dreamlike slasher, that has more brains than guts. Inoue makes it very clear that the story is much more complicated than it seems at first. Several sequences point to that, one good example is the opening shot. Showing us the arrival of NO.13 into Jûzô's mind. Not to mention the open-ended ending that certainly leaves a lot to think about. The actors do their jobs accordingly and it does feel very organic the way their characters react. Miike's surprise cameo is another cool addition (not to mention the way he gets killed)to this already good film, I'm not going to lie his appearance is partially one of the reasons why I watched this, so yeah I'm glad he's here even if it is for a few seconds or so.<br><br>So what do we have in the end? \"Neighbour Number 13\" a vastly enjoyable movie be it revenge/slasher/character study/psychological see it for whatever type you desire or just watch it as something unique, an amalgam that stays in a genre of its own. For a first time director Yasuo Inoue demonstrates some impressive skills and I'm definitely going to wait and see what he'll cook up in the future.","user":"K_Todorov","rank":[10,13]}]