[{"title":"A good movie","rating":7,"date":"4 August 2007","review":"I don't agree with some reviews here . Really this is a movie with an original screenplay that keep suspense throughout all the movie , something that so many Hollywood movies don't achieve even if they try . The music soundtrack is excellent, by Spanish composer Roque Baños, and Timothy Hutton does a fantastic job in this film. This is a good genre film and as that it fully achieves its goals. David Kelly does a fantastic job too in his role . The director is Daniel Monzón , previously a movie critic for Fotogramas magazine and this is his 3rd movie as a director . In resume , this movie don't pretend to be nothing but a genre movie. And as that it succeeds.","user":"finitodistampare","rank":[44,57]},{"title":"A big could-have-been","rating":29,"date":"29 September 2007","review":"\"La caja Kovak\" follows American science-fiction best-selling author David Norton (Timothy Hutton), who goes on a part business, part pleasure trip to the Spanish island of Mallorca with his girlfriend. He proposes to her and she accepts. On that very night, she jumps off their hotel balcony and kills herself after a short stay at the local hospital. In the bed next to her is Sylvia (Lucía Jiménez), a young woman who found herself jumping off the balcony without having any recollection of how and why she did it. Both women did it right after their phone rang and the song \"Gloomy Sunday\" began to play on the other end of the line. Together, David and Sylvia decide to try and solve the mystery.<br><br>The introduction is well done and it lures you into watching more, wanting to know how a song can make apparently normal people want to kill themselves. However, it evolves into a bizarre and not always efficient mix of thriller and science-fiction that completely fails to keep up the suspenseful and supernatural tone of the start, and is in fact rather dull and inconclusive at times. The characters are also quite poorly written -except for David Kelly's character maybe, the most interesting of the whole bunch- and they become quite predictable, as is the ending. Also, many clues thrown in along the way are never properly answered to.<br><br>All in all, it's an okay movie, one to watch and easily forget.","user":"Agnelin","rank":[32,41]},{"title":"A Taut Thriller That Keeps Circling the Viewer's Mind Through a Maze","rating":8,"date":"10 June 2007","review":"THE KOVAK BOX is a successful little suspense/psychological thriller from the Spanish writers Daniel Monzón (who also directs) and Jorge Guerricaechevarría. The story may be a bit far fetched, but then what horror story isn't? The premise for the tale holds up well and is aided by some very fine performances by a mixture of Spanish, English, and American actors. The mood of the film is beautifully set during opening credits by a complex maze in which a white rat sniffs and ambulates from confusing corner to confusing wall - just the manner in which director Monzón plans to tell his story.<br><br>David Norton (Timothy Hutton) is a celebrated science fiction novelist visiting Majorca for a special conference accompanied by his soon to be fiancée Jane (Georgia Mackenzie). David has been having premonitions on his flight to the conference and those brooding thoughts continue as he registers for the conference and finds little disturbing clues that culminate in Jane's suicide leap from their hotel balcony. Almost simultaneously an attractive Spanish girl Silvia (Lucía Jiménez) in the same hotel 'jumps' from her balcony but is saved from death by falling onto an awning. Jane dies in the hospital: Silvia is in the bed next to Jane, witnesses David's grief, and the beginning of a bond is created.<br><br>David meets a strange old man Frank Kovak (David Kelly) who seeks an autograph of David's first novel 'Gloomy Sunday' and from there the mystery begins. David becomes the unknowing main character in a sci-fi story that mimics ideas from his own first book, a story about the implantation of devices in humans that would enable a central force to assist the victims in their own destructive ends. The plot is tightly woven from this point on and to reveal any portion of it would diminish the chair-gripping finale.<br><br>Timothy Hutton seems an odd choice for the main character of the film until his combination of cool intellect and understated passion clicks in. The film is graced by the presence of the talented Lucía Jiménez who seems to have the potential of becoming another Penelope Cruz! The cinematography by Carles Gusi and musical score by Roque Baños make the setting visually and aurally spectacular. For those who enjoy mind bender thrillers, THE KOVAK BOX will certainly please. Grady Harp","user":"gradyharp","rank":[32,44]}]