[{"title":"Under Rated","rating":7,"date":"20 October 2007","review":"I'm a little surprised at how badly people are panning this movie; I usually find IMDb ratings to be a good indicator. Many of the negative comments seem to be based on the movie not conforming to the typical 'good guy always wins,' formula driven, oh-so predictable crap that Hollywood tends to pump out. I see one reviewer here actually put \"they couldn't even deliver the cliché ending\" as if that is something to be strived for. As for me, if I want a morality lesson I'll go to church. If you're looking for a comedy to give you lessons on how to live your life, you've got serious problems.<br><br>I'm still only giving the movie a seven because it's a comedy, it's not like it was so moving that it changed my life or anything. As comedies go, though, I found it pretty good. It's not one of those constant, laugh a minute, slapstick comedies, but the parts that did make me laugh literally made me laugh out loud, which is pretty rare for me. All in all, this is one of the best comedies I have seen in years.","user":"assignment41","rank":[105,146]},{"title":"It's no \"Something about Mary\"","rating":6,"date":"7 October 2007","review":"The horrible crude scenes leave a bad taste and overshadow any funny scenes. I think the Farrelly Brothers wanted to recapture the success of \"There's Something About Mary\" -- but they've flopped hard.<br><br>The universe of \"Mary\" was completely wacky and any naughty parts just fit into that universe. This one feels like there were too many screenwriters tinkering with it. (5 are listed). Someone wrote a mainstream romantic comedy script -- then someone else (The Brothers, I'm guessing) came along and just stuck in gross shocking bits.<br><br>It's very uneven. It loses steam in the third act. Has a very unsatisfying and unpleasant ending. Carlos Mencia is obnoxious. Ben is looking too old to be playing these parts. Meanwhile, the girls still look 25.","user":"hellokristen","rank":[141,216]},{"title":"First half so-so, second half quite funny.","rating":6,"date":"26 February 2008","review":"The Heartbreak Kid isn't right up there in the list of great comedies starring Ben Stiller. It's a bit further down, nestled in amongst the likes of Along Came Polly and Envy.<br><br>That's not to say it isn't a good film. As far as romcoms go, it's alright. I think it's fair to say the first half trudges along quite slowly but stick with it while the main characters are introduced and the plot is founded because the second half is nicely paced with some very funny moments as things start to conclude. The cliffhanger ending is surprisingly delightful and watch for a final funny scene around halfway through the end credits.","user":"servoskull","rank":[33,47]}]