[{"title":"Not Your Average Epiphany","rating":8,"date":"2 January 2006","review":"Religious conversion stories are often dreadfully boring to all but fellow believers. Too often they are tales of interesting lives of despair lifted by a higher power to lives of less-than-fascinating virtue. I don't mean to imply criticism of epiphanies in any form. But it is an axiom of sectarian movie marketing that the religiously inclined will tolerate the blandest of cinema if packaged faithfully, and that's often what they get.<br><br>I was expecting more of the same when I heard about New York Doll at Sundance last year. This is the story of Arthur \"Killer\" Kane, bass player for the legendary New York Dolls rock 'n roll band of the '70's. For those that didn't follow the pop music scene back then, the Dolls were one of the hardest-edged, most controversial groups of their era. Forerunners of the punk movement, they paraded in drag and set the stage for later bands such as The Sex Pistols, The B-52's and The Clash.<br><br>Like so many other punk bands, the Dolls fell victim to excesses and addiction. Kane, known for his \"killer\" bass lines, was sometimes too drunk to perform, and would simply stand on-stage with a bass around his neck while a roadie filled in for him. (However, since Kane was known for his wooden posture on stage, it may have been hard to tell whether he was really playing or not!) After a meteoric four years, the Dolls dissolved and Kane drifted into alcoholism and obscurity, only reclaiming his life with his 1989 conversion to Mormonism and work at the LDS Family History Center in Los Angeles.<br><br>But despite his discovered spirituality, he always harbored the desire for the band to reunite and play again. His seemingly impossible dream was realized in 2004, when Morrissey (The Smiths) engineered a reunion of the Dolls for the London Meltdown Festival.<br><br>Director Greg Whitely crafts a warm and engaging story set to this strange juxtaposition. Kane is an intriguing personalitysimple, friendly and honest, he talks wistfully of his days of drugs, sex and rock and roll (\"some of my fondest memories,\" he says) yet never wavers from his commitment to his Mormon faith. Interspersed in the reunion story are thoughts on Kane from Mormon co-workers and religious leaders as well as punk rockers Morrissey, Sir Bob Geldof (of Boomtown Rats and then Live Aid fame), Chrissie Hynde of The Pretenders, Iggy Pop and others.<br><br>But the drama is the reunion itself. Two of the Dolls died in the early 90's, leaving Kane, guitarist Sylvain Sylvain and singer David Johansen. Of the three, Johansen found the most success post-Dolls, both as an actor as well as singing under the alter-ego Buster Poindexter (remember \"Hot, Hot, Hot\"?). Kane resented Johansen for nearly three decades, and the tension is palpable when the singer arrives (over a day late) for rehearsals. While time and hard living have clearly slowed, humbled and mellowed Kane, in contrast Johansen comes across like Mick Jaggera youthful glam rocker in a craggy-faced, 50-year-old body. While Kane appears non-plussed by the experience, Johansen is still energized by the spotlight.<br><br>What is truly touching is how they resolve their differences, rekindle their relationship and develop mutual respect. Kane tries to explain his religion to a bemused Johansen, including the Mormon principal of tithing\"It's like an agent's fee,\" he explains. \"It's only 10 percent. It's a pretty good deal.\" New York Doll is a well-executed and compassionate documentary that will warm the hearts of faithful and heathen alike. Whitely clearly cares deeply for Arthur Kane, who seems to have touched the lives of everyoneeven those from the Dolls' era. And it's impossible not to like Kane, who is so sincerely grateful for his good fortunehis past, his faith and his chance to once again be a New York Doll. This is a tender story with a bittersweet ending, which I won't give away. I will tell you to keep watching as the credits roll, because there's a song you won't want to miss.","user":"baho2","rank":[39,40]},{"title":"Blessed are the meek rock 'n roll gods, for they shall inherit the earth","rating":14,"date":"14 November 2005","review":"What an enchanting little slice of wish-fulfillment cinema -- I love, love, love it. The thing is, this is not a saccharine Hollywood screenplay, Disneyfied for your viewing pleasure -- it is a real-life fairy tale inhabited by defiant glam rockers and blessed with a glorious racket of a soundtrack. Quirky, charming Arthur Kane guilelessly lays out his life for our examination -- his brief, joyous days of fame, fortune, and fabulous platform boots; his years of remorse and despair, boozing amid the ruins of youthful dreams; the healing peace of his newfound faith; and finally his giddy return to the beginning, as he finds himself in leather pants once again, this time viewing his fame and friendships with a wisdom, humor, and gratitude dearly bought over long years of struggle and spiritual redemption.<br><br>He is not so very remarkable, really, and that is what sets this piece apart from rockumentaries and gives it a warmth and depth that is lacking in that worshipful genre. Though he spent years living as a rock god, Arthur knows at age 55 that his long-ago life of fame was a gift, not an entitlement, and that he squandered it. Every audience member with a regret becomes invested in Arthur's story. He speaks frankly of his gratitude to God for lifting his sights and hopes again, but admits that the past haunts him even so. That mixture of peace and aching rings true and keeps this film human and honest even as we trail behind him, wide-eyed, watching him stumble gleefully on old joys and bravely confront his demons. There is a contented, bemused look in his eyes as he basks in the happiness of his reunion with friend and bandmate David Johansen while simultaneously parrying David's playful jabs at the finer points of Arthur's conservative Mormon faith. Gone is the glazed, drunken stare of his early days -- he now knows who he is and what he has and drinks every last drop with sober joy.<br><br>I take it back -- Arthur is really QUITE remarkable. Not because he and his friends were the toast of New York and London twice in one lifetime, but because he learns to see things as they really are, whether standing at the bottom of the heap or at the top -- an achievement that is easily as rare as rock and roll fame.<br><br>New York Doll is a winsome, moving film, and every time I think of it, it makes me smile.","user":"prufrockja","rank":[40,44]},{"title":"Interesting non traditional rock doc","rating":10,"date":"1 February 2005","review":"I caught this film at the Sundance Film Festival. It was one of the most popular films of the series. I'm not a big rock fan nor am I a documentary junkie, but I really liked this film. The back story was that the director began filming the story of a fallen rocker just as amazing things began to happen in his life. Catch it if you have a chance.<br><br>Here is the Sundance write up. New York Doll relates the meteoric rise, resounding fall, and recent all-too-brief resurrection of the seminal New York glam-rock-punk band, the New York Dolls, but it is foremost a story about the band's amazing bassist and leader, Arthur \"Killer\" Kane. With empathy, respect, and humor, director and friend Greg Whiteley follows Kane and interviews key musicians, friends, and colleagues to uncover the legacy of the Dolls and their significant impact on the London music scene in the dizzying heyday of the early 1970s.<br><br>After Kane and his band bottom-out on drugs and alcohol, he disappears from music, embracing a surprisingly different path when he becomes a born-again Mormon. When rocker Morrissey organizes a London reunion of the New York Dolls, Kane buys his guitar back from a pawnshop, takes leave of his Family Center library job, and heads back to New York City to prepare for an unlikely comeback.<br><br>How will the reconstituted band pull off its first performance in 30 years? Can these musicians possibly recapture the energy and élan that made them legends in their own brief time? What awaits Kane after his short reprise in the spotlight? The answers make New York Doll an entertaining, exhilarating, warmly human, and ultimately bittersweet paean to an era and the man lovingly described by friend and band member David Johansen as \"the miracle of God's creation.\" Diane Weyermann","user":"taylor745","rank":[34,37]}]