[{"title":"Better than you will think, not quite as good as you hoped for.. but generally satisfying.","rating":7,"date":"19 January 2007","review":"Chaos was actually very different from the usual run of the mill *yawn yawn* action movies. Maybe because I like Jason Statham so much, but I enjoyed Chaos. Sure it was predictable, but it tried to be clever, different and have that twist. And its almost funny seeing Statham switch from London to American accent all the time, and Snipes wasn't the best.. but on the whole it was a better than your average movie.<br><br>So the quick synopsis; Statham is a much maligned suspended detective called in to be a negotiator in a bank robbery. The siege becomes complicated, and the audience has to understand the past and present to unravel the future and what is really going on.<br><br>OK down to the nitty-gritty. Chaos could have been a class act if it was done just a tad differently. Snipes needed to be as controlled as he was in the beginning, Statham should have stayed English accent, and the plot (punchline) should not have been delivered with a sledgehammer - or - not trust the audience to work things out without feeling the need to spell it out TOO clearly. I am reminded of another excellent and cognitive heist movie when seeing Chaos. I will not say it's name as that may be unwittingly revealing.<br><br>Statham is one of my favourites from Lock/Stock, Transporter etc and I like his presence in every performance I have seen him in thus far. Snipes I could take or leave yet I was happy he didn't try to encompass the entire screen! but the pleasant surprise I had was with Ryan Phillipe. I think he's becoming a class actor and I would love to see him land some plum roles that highlights his talent.<br><br>Overall, Chaos tries a philosophical and clever approach that is different from the average outing; regardless of what the DVD front cover may suggest, possessing a hypnotic funky score, in general good acting and a decent enough plot... overlook the obvious anomalies, and Chaos provides value.","user":"siit","rank":[40,48]},{"title":"Not too bad!","rating":6,"date":"9 April 2006","review":"This is a reasonably brisk paced and entertaining action thriller. There's a similar story to Spike Lee's critical hit, Inside Man, only Chaos was made two years ago, and is as yet awaiting its release. This may give an indication to the fact the film is not really a bankable product. This is not down to quality, because this is by no means a bad film, it's just what you might call a marketing nightmare, as a theatrical release anyway. It's a \"thinks it's cleverer than it is\" thriller starring two martial arts stars, but without martial arts. In fact this isn't action all the way as you might expect with Jason Statham and Wesley Snipes as two of the headliners. Eventually this will find a release, but probably DTV.<br><br>Chaos is an enjoyable flick though. We have Ryan Phillipe and Jason Statham teaming up to investigate a bank heist. As the title suggests, this film is about Chaos, or the Chaos theory, whereby seemingly random acts are in fact connected. Wesley Snipes co-stars as the bank robber in question. The cast are good. Phillipe shares lead duties with Statham, and handles the film well. His character is pretty two dimensional but he does it convincingly and handles the action well too. Statham, delivering another strange accent, supposedly American, is despite his accent, charismatic. It's Wesley Snipes though who stands out, actually enjoying himself after a string of sub-standard, lazy performances in his DTV action vehicles and also in Blade Trinity.<br><br>The film looks polished, has a decent score and is a good watch. It just feels very DTV but a better than the normal DTV. Indeed this may have one or two twists too many but the twisting plot manages to keep you guessing as it unravels. Overall not bad, but nothing new. **½","user":"supertom-3","rank":[79,105]},{"title":"Great Cast......Good movie!","rating":7,"date":"5 January 2006","review":"I went to this movie with the lowest expectations and i just thought i would see a van dammed type of movie. But I was in for a surprise. The movie has good twists and action, I really loved the acting from Jasom Statham who is a really good actor! If you are an action movies fan then you shouldn't miss this movie... and don't think this movie is an all action movie, the story is well written and the twists are well made. I'd say go for it if you don't know which movie to watch!<br><br>The movie starts with Jason Statham out of the force. So then they had to get him back because of a bank robbery and the bad guys asked for him. Something bad happens in the Bank, then the cops are after the bad guys looking for them. You will have to keep a close eye at the movie, it's a good action thriller that you will not expect to be as good as it is!! and after this movie i'll proudly say i'm a huge fan of Jason Statham (Snatch, Lock Stock and two Smoking Barrels, Transporter, Transporter 2, Cellular, CHAOS), this guy is just amazing!","user":"DxB_PiRaTe","rank":[110,156]}]