[{"title":"Splendid but not for everybody","rating":8,"date":"31 December 2018","review":"I've seen this movie three times by now and still think it's brilliant, yet it's not a movie for everybody. It's surely no coincidence that even Martin Scorsese had to struggle for 25 years to scrape together the funds to make it.<br><br>I can also understand why so many folks feel the movie is boring and too long even if to me it was neither boring nor too long. In fact, it feels just perfect.\nThe reason I suppose many people don't truly 'feel' this movie -an exception in Mr Scorsese's rich filmography- is because of its theme. For surely, in times of abundant secularism and reductionist materialism, a movie such as this one cannot be other than a dinosaur.<br><br>Essentially this is a movie about the genuine spiritual process of transcending implicit narcissism into an effulgence of humble, selfless Love. It is therefore a movie about the genuine path of authentic christianity.<br><br>What makes it a special movie, at least in my heart, is that it not only sharply portrays this process of self-transcendence but also makes the link to the collective missionary adolescence of historical christianity. For surely, the Japanese are very much refined in their cruelty, yet they clearly are much more sane and of a deeper (personal and cultural) wisdom than are the young Portuguese missionaries who remain by and large unaware of the unwarranted cultural superiority with which they approach the Japanese.\nTo bring all of this clearly into focus and allow for the story to reach its spiritual and historical apogee took close to three hours of masterful moviemaking.<br><br>Not to make this an overly long review: for those who are knowledgeable about the genuine (christian) path of self-transcendence into humbled Love, this is surely a masterful film. For others it is a boring waste of time.<br><br>Those who love this movie may also be interested in checking out \"The Assassin\" by Hsiao-hsien Hou. This movie is about the taoistic version of the same inner path of transcending attachment to emotions and your social identity of the past to arrive at ultimate immersion in the Tao or the natural way.","user":"ghent1","rank":[29,33]},{"title":"Silence Of The Lambs","rating":10,"date":"9 May 2017","review":"Agnus Dei that is, Lambs of God. What an extraordinary film.Martin Scorsese confirms his seriousness of intent and his enormous respect for his audience.He rates us so highly that he confides in us, telling us something that clearly comes straight out of his heart. Dry, severe, an intellectual's sensibility that becomes clear and accessible to all as we realize that Scorsese is not trying to sell us something but just to tell us, to share with us something that obsesses him. I was enthralled and moved throughout. The performances in a Scorsese film are always superb but in Silence, Andrews Garfield goes a step beyond superb. He managed to make his priest someone I knew personally even if his reality is far, far away from us in time and space. A masterpiece.","user":"lucaajmone-it","rank":[186,262]},{"title":"A Profound Adaptation Of One Of The Great Novels","rating":9,"date":"11 November 2019","review":"Based on Shusaku Endo's remarkable novel of the same name, a novel which many consider to be one of the very greatest of the 20th Century, this is a film I was very keen to see - but it took me a long time to get to. It's not an easy sell - over two and half hours on Catholic missionaries living and dying under brutal Japenese persecution. At the time of release, I remember one reviewer saying it was 'boringly pious'; an idea which seems to me to miss the point entirely.<br><br>Both novel and film seek to understand why the Christian faith didn't take root in Japan in the same way it did in so many other countries; why so many missionaries failed and even recanted their faith under horrendous persecution. The reality is that in many countries where Christian worship and faith is violently opposed, it flourishes rather than dies. So what was different in Japan?<br><br>That neither the film nor the book offers easy answers is the key; everyone - from the missionaries to the Japanese authorities to anyone who has studied this - has a theory, but none are completely satisfactory.<br><br>On hearing that Andrew Garfield and Adam Driver had been cast as the two Portugues Jesuits at the heart of this story, I was concerned that they would not have the gravitas necessary; what did work well, it seems to me, in their casting was that their deliberate blankness and sincerity work well, especially in the earlier stages, as the well-meaning missionaries in an alien culture. The film's cinematography is startling and beautiful; in the first half of the film, there are repeated shots through mist or smoke, clarity partially revealed in counterpoint to the missionaries' own certainty; as the film progresses, however, this is flipped - there is sharp crispness to the images, a reversal of the missionaries' increasing doubts, confusion and fear. Other shots throughout deliberately echoing religious art, a painterly style that sometimes even merges into a literal painting. These are the Westernised visions of faith with which we are familiar; but an authentically Japenese vision of what faith may look like is missing - evoking for me the stained glass windows in my own church in Cape Town, where every depiction of Jesus or a Biblical character has white skin.<br><br>There are hints of Heart Of Darkness and Apocalypse Now - the classic, critical story of Western colonialism; the noble, heroic Westerners journeying to 'dark places' to bring the light, discovering there's as much (or more) darkness in them as there is in the places they have come to.<br><br>There's so much more to be said; like the novel, this is doubtless a film that will yield more with repeated viewing, and with whatever spiritual or theological eyes one views it with. The title refers to much - the apparent silence of God in responses to the missionaries' prayers, the silence of those watching or suffering the atrocities of persecution - and the silence of those killed by it. The enforced silence of the Japanese church. As one character says, echoing the Biblical experience of Elijah, \"...it was in the silence that I heard your voice.\"<br><br>The film ends with a moment of speculation and uncertainty; a reminder not to judge. A reminder, perhaps, to those so quick to criticise Scorsese's much misunderstood earlier work, 'The Last Temptation Of Christ'. Both of these films require patience, humility and deep reflection from the viewer. Both of them have much to teach even those who are most convinced of their faith; both of them are rich, rewarding, serious films which deserve repeated attention. My personal preference of the two is this film, not least because of my deep affection for the original novel. But it's a film I need to digest and pray on, and it will, I hope, drive me to a deeper reflection on 'Last Temptation....', and much thought on my understanding of mission, ministry and faith.","user":"david-meldrum","rank":[9,10]}]