[{"title":"focused spy drama","rating":7,"date":"26 February 2007","review":"On February 18, 2001, Robert Hanssen, a 56-year old FBI agent, was arrested, by the very agency he worked for, for selling secrets to the Russians. He was sentenced to life in prison after pleading guilty to 15 charges of espionage. This is widely considered to be the worst case of treason in the history of American intelligence.<br><br>\"Breach\" looks at the story through the eyes of Eric O'Neill, the young, up-and-coming junior agent assigned by investigators in the bureau to spy on Hanssen. In the position of personal assistant to Hanssen, O'Neill works to uncover evidence against his boss that will help to strengthen the legal case gradually being built against him.<br><br>\"Breach\" is a fairly solid political thriller, less concerned with big action scenes than with examining the relationship between these two very different men set in unwitting opposition to one another. Hanssen himself is a mass of immense hypocrisies and contradictions. A devout Catholic, he attends Mass religiously, recites the rosary everyday, and looks with disdain upon homosexuals, women who wear pants and anybody seemingly to the left politically of Rush Limbaugh and Ronald Reagan. Yet, despite his outward display of moral rectitude, Hanssen secretly distributes porn videos of his wife (she is unaware of their existence) and betrays his country by turning over classified information to the enemy. O'Neill finds himself simultaneously drawn to and repulsed by the man, who manages to be both prig and libertine at one and the same time. O'Neill knows that what Hanssen is doing is terribly wrong, yet he can't help falling under the spell of a man he knows that, under other circumstances, he might well come to value as a friend and a mentor.<br><br>Ryan Philippe is subtle and brooding as the taciturn O'Neill, reluctant to condemn the man he's been sent to bring down until all the facts are in. It's true that his performance is a bit of a Johnny-one-note at times, but since the function of the character is that of observer rather than catalyst, Philippe's self-effacing underplaying seems the right editorial choice here. Plus, it clears the deck for Chris Cooper to step to the forefront with his finely-tuned interpretation of Hanssen that brings real dimensionality and depth to the film. He turns Hanssen into a richly complex figure, a man who demands strict adherence to form yet who systematically violates that very rule at the deepest core of his own being. A stickler for protocol and standards and unforgiving of those who fall short of them, Hanssen somehow fails to see his own glaring weaknesses while managing to condemn others for theirs. Through his perceptive performance, Cooper makes it possible for us to see this walking paradox in all his complexity and humanity.<br><br>The movie itself, written by Adam Mazer, William Rotko and Billy Ray, and directed by Ray, is a trifle plodding at times and doesn't feel as vital as perhaps it should given the seriousness of the issues it is addressing, but, for the most part, we welcome its unfrenetic approach to the subject. It doesn't try to gin up the melodrama or unravel its human enigma - rather it presents him as truthfully and impartially as possible, then leaves it up to the viewer to render the final judgment.","user":"Buddy-51","rank":[122,144]},{"title":"The best of the year to date","rating":10,"date":"16 February 2007","review":"The history behind the FBI and the CIA have always fascinated me and I have studied this history for many years. I am well aware of the story of Robert Hanssen, and had to see the film because of that. I had my doubts about it, being the avid movie-goer that I am that they would try to \"Hollywood-ize\" it too much, as is almost always the case when a true story hit the silver screen. This is not the case with \"Breach\".<br><br>Some of the things in the movie are stretched, as is always the case, but it still remains very loyal to the truth. \"Breach\" does a wonderful job of taking theses slightly exaggerated parts to increase the feeling of drama and suspense, and doing it the right way.<br><br>Another bright spot is Oscar Winner Chris Cooper's fantastic portrayal of Hanssen. Cooper does such a great job of capturing Hanssen's intimidation of young Eric O'Neill and his increasing paranoia. There is no doubt in my mind that Cooper's role is Oscar worthy. It would be a shame if he were not nominated.<br><br>This film is excellent from beginning to end and is without a doubt the best spy movie I have seen in ages. The film itself, like Chris Cooper, I believe is Oscar worthy.","user":"tpibb","rank":[130,185]},{"title":"Two Men in a Boat","rating":24,"date":"24 February 2007","review":"I was surprised at how effective this was. You know from the very beginning how it will end. You know because it is a true story that there will be no trendy plot twists. You expect, and find, that the young assistant is built around a cliché, as is Hanssen's Catholicism, which oddly ignores the role of Opus Dei in this venture, and focuses on prayer instead of devotion.<br><br>And there is a formulaic bit about damaging fathers and odd wives. More: there's the project command center that is drawn from movies and not from life. And finally, our hero is told the FBI's biggest secret in an open public place. This would never ever happen, and it is staged this way only to help the pacing of the thing in terms of stagecraft. And that DIA computer room, with the nice clean Cray-like machines, is from the same fantasy world as \"Red October's\" neon-lighted missile tubes.<br><br>But in spite of all this, it works. And especially compared to \"The Departed,\" it works, simply, cleanly, deeply. <br><br>That's because the filmmaker decided early in the game that he was going to do what the Hong Kong \"Infernal Affairs\" did well and others copied: this business of actors playing characters who are actors. In this case, we have two such in the same boat.<br><br>We have a top information manager at the FBI working for the Russians and acting normal, even when leading the hunt for himself. We have the young under cover guy pretending to be simply a clerk. Each intuits the other is watching. The older man completely wins at the start, with the younger man eventually besting him in artifice. Its a calculation that the filmmaker makes, when deciding not to tell us why our young hero does what he does and where he gets the tools. In an ordinary story, that would hurt, but here it is a wise decision because such \"explaining\" would get in the way of the economy of the thing. And it is all about economic connection with us.<br><br>Its a bit counterintuitive that effective stories sometimes get better by lopping off story elements and information. But it is true. Some students of the Hanssen case believe that Hanssen's primary motive was to show his own importance (as a information security planner) by revealing holes in the system that he would have plugged. I wish this film would have worked with that a bit, because this notion of helping the system by hurting is system is both what the story could have been about and the means used to tell the story.<br><br>Still, a good one.<br><br>As a historical note, there's a reason folks from the FBI and CIA, even senior ones, can't wander into NSA computing facilities. Hanssen wasn't allowed, probably a good thing at the time. Opus Dei again.<br><br>Ted's Evaluation -- 3 of 3: Worth watching.","user":"tedg","rank":[87,121]}]