[{"title":"Generic and Average Thriller... Decent But Forgettable","rating":5,"date":"2 June 2008","review":"As with many other horror stories, things seem to go wrong when you put any number of young people in the woods. With \"The Lodge\", this is no exception. A young couple, away from the world and set on a non-stop drug-fueled and sexually-charged romantic getaway, have rented the eponymous lodge. But plans go awry when they encounter the caretaker (soap opera guest star Kevin McClatchy), a friendly but seriously deranged woodsman.<br><br>There is much good that can be said about \"The Lodge\". For a film that is starring and created by completely unknown people, I was impressed with the final product. The writer (Deb Havener) went through extra effort to create a background for the characters (drummer from a rich family with a music degree, for example). The directing is solid, although I question why there are so many shots of the fields (it seems some shots and the opening credits served no purpose other than to stretch out the length). Music, lighting and all the technical aspects were of a respectable quality (not Hollywood, but at least straight-to-DVD).<br><br>The two male leads are on opposite ends of the spectrum in the talent department. The young lover was nothing special... he could have been anyone and have been played by anyone, I just had no reason to care about him. The caretaker, on the other hand, was dynamic and menacing. At times I felt he was creepy, at others I felt sorry for him, as he appeared more lonely than sadistic. The range and diversity of his emotions would be hard to put in one character and remain consistent, but yet this was achieved flawlessly. If there's one redeeming factor of this film, it's the caretaker.<br><br>On a side note, this film raises questions about relationships that I'd like to touch upon (sorry, horror fans). We are clued in early on that the male lead plans on proposing to the female lead, and we have to give him credit for choosing a beautiful locale and a gorgeous woman. But yet, the constant fighting makes it clear they may not be ready for long term commitment. What is the message here? Are we saying that marriage proposals are good and can solve problems? Are we saying that stressful situations can draw people closer? As I often opine, didn't \"Speed\" teach us anything? The biggest problem with \"The Lodge\" is the sheer blandness. While there is a fair level of success in creating a creepy atmosphere, at the same time we are rather limited because there are only three key characters. Unlike other horror films, no one can die here or the film has to end prematurely. So the suspense has to be drawn out as long as possible, which works at times and fails at others. Time is also filled with countless sex scenes that go nowhere (sorry, guys). And if you want gore, you're not going to see much here (low body count equals low blood flow).<br><br>I found \"The Lodge\" to be enjoyable and watchable (which, these days, is more than I can say for many films). But there was nothing here I haven't seen in a dozen other films. I give Deb Havener credit for the development but her plot writing needs work. For another story involving two people alone in a rented room, see \"Vacancy\". The sheer intensity of that one makes \"The Lodge\" look like a Lifetime Network film. And that's not good.","user":"gavin6942","rank":[24,29]},{"title":"The tagline says it all","rating":4,"date":"26 April 2008","review":"What is the use of watching a thriller if you already know what is going to happen. Well,there could be some surprises thrown in that make it worth wile. Apart from a couple of creepy moments this movie has nothing interesting to offer. From the start you know how everything will play out. This could have been just fine if this movie delivered on other fronts. Apart from one element there are no redeeming factors. I can't talk about this element without spoiling the movie. But it does gives a bizarre twist on matters. Warning: Don't expect too much from this twist however since it is the most ridiculous twist I have seen. Some explanation could have made it more acceptable. Is this movie a waste of time? If there is nothing on television and you have nothing better to do than you won't be sorry. As long as you don't expect too much.","user":"chrichtonsworld","rank":[26,33]},{"title":"movie category: the dumb genre","rating":2,"date":"7 April 2008","review":"Either this was written and made by three 15-year-olds or they were targeting the double-digit IQ audience and spending the minimum required to somehow show a profit at straight-to-video. It's a cynical attempt to get some product out there without too much effort or creative ability.<br><br>There are holes in the script large enough to fly a dozen jumbos through. The acting is ordinary, but not helped by the stupid script, so I wouldn't condemn these unknowns, who probably worked for peanuts. But pay peanuts and... you get flicks like this.<br><br>Then there's this attempt at a twist ending that's so ludicrous you wonder if perhaps it was supposed to be a satire all along!<br><br>Maybe I got the maker's ages wrong, they could be younger - whatever, they're certainly not the sharpest knives in the drawer, pardon the expression.<br><br>Avoid if you've got any taste and a life.","user":"charliesparks","rank":[37,52]}]