[{"title":"Doomsday","rating":14,"date":"14 April 2008","review":"If you enjoyed 28 Days Later, Mad Max: Beyond Thunderdome and  Gladiator, this might be the film for you. Writer and Director Neil  Marshall (Dog Soldiers, The Descent) an obvious student of genre  movies, has managed to smoothly craft together a cinematic  Frankenstein's monster of sci-fi action clichés. Gratuitous blood  geysers? Check. Insane, post-apocalyptic punks? Check. Buff, beautiful,  uber-bad-ass heroine that can kill without a moment's hesitation but  still possesses superior morals to those that command her? Check.  Ego-maniacal bad guy played by Malcolm McDowell? Check. Ticking clock  to doomsday? Check.  Marshall has skillfully engineered what is truly an homage to the genre  movie and an action buffet for moviegoers with appropriate kitsch and  over-the-topness without lowering himself to the realm of spoof.  If you're looking for high cinema don't look here, but if you're  looking for excitement, humor and an overall really good time, Doomsday  will certainly fit the bill.","user":"brains-19","rank":[274,371]},{"title":"Awesome action flick. Very entertaining. Who cares for the plot.","rating":9,"date":"11 December 2016","review":"I saw this with my dad in a theatre in 2008. As a fan of Neil Marshal, I enjoyed it. His Dog soldiers n The Descent r very good horror films. I found this flick to be a very entertaining n action packed. It was like Mad max on steroids. This movie is a pure adrenaline rush with lots of action and suspense, violence and gore. Its an over-the-top grindhouse epic. A homage to Mad max, Escape from New York, Death race, 28 days later. Awesome visual effects. The pacing is very good. Action n horror fans will not b disappointed. The gore was excellent n top notch. The action is superb, the car chase is excellent with lots of body count n superb camera work n loud music. Mitra is gorgeous, the cinematography is excellent. Pure action n entertainment at its best. Bought a DVD of it recently. Need to revisit. Need to check the hot babe Lee-Anne Liebenberg.","user":"Fella_shibby","rank":[38,50]},{"title":"Homage to the post-apocalyptic","rating":9,"date":"9 May 2010","review":"It's April 2008, and a sudden viral outbreak has hit Scotland hard. To contain the deadly bug (dubbed the Reaper Virus), the British government works quickly to build a containment wall around the afflicted country. The possibility of the disease spreading to the rest of the world appears to have been effectively stopped in it's tracks. Fast forward 30 years and the virus has reappeared, this time in London. Satellite monitoring has picked up images of apparent survivors in the hot zone, which leads the government to suspect the potential for a cure. Desperate to put an end to the reborn plague, the Brits send a team of soldiers into the walled off country in the hopes that they can find the cure that may not even exist.<br><br>The third feature film from British filmmaker Neil Marshall. I thought this was a fun time at the movies, but don't expect anything new here. Doomsday is a pure love letter to Escape From New York and the Italian post-nuke films of the 80's. There are homages all over this thing, and I would like to think that I caught most of them. Hell, even Nightmare City seemingly gets a nod with the look and behavior of the infected. Watch the scene where one of the infected axes his way into Hatcher's compound and see if Lenzi's trash classic doesn't come to mind. Marshall knew what he wanted to do with this film, and he does just that. I have to admit, it was somewhat surreal watching such a film on the big screen, particularly the extended Sol/feast scene, which gets pretty nutty.<br><br>Rhona Mitra plays the team leader of the squad sent into the hot zone. She's a gorgeous woman with a killer accent, but she also comes through as a believable action star. I've long been a fan of her's, so it's nice seeing her get a role like this. Craig Conway is warped as the over-the-top Sol, but he lacks menace. He did get me to hate him, but that had more to do with the fact that I found him annoying. The considerable talents of Malcolm McDowell, Bob Hoskins and Alexander Siddig provide solid support despite what little they have to work with.<br><br>My biggest gripe with the film is the wall to wall use of music. It seems like there's never a scene that doesn't have some form of music blaring, and that becomes tiresome. A little more subtlety in that area would have been most appreciated. Also, some of the scene transitions feel awkward, and the film itself feels quite rushed. We don't get much down time or quiet moments, it's all very busy.<br><br>Still, I must admit that it's decent fun. Original? No. Flawed? You bet. That aside, if you have a certain affinity for this brand of entertainment, you should eat it up. And for the record, I'll take this one over The Descent any day. Mitra puts the wannabe badasses in that clunker to shame.","user":"Cujo108","rank":[32,42]}]