[{"title":"Baz Luhrmann Stumbles Through This Sweeping Australian Love Story","rating":6,"date":"29 August 2017","review":"Australia is the kind of grand movie romance that defined classic Hollywood. It's got all the important ingredients: A pair of movie stars, exotic locales, and a heaping helping of melodrama. In the capable hands of Aussie director Baz Luhrmann, who knows a thing or two about movie love stories (Romeo + Juliet, Moulin Rouge), Australia had 'classic' written all over it. Maybe with expectations that high, Australia was bound to disappoint. In any case, Australia is certainly not all it can be.<br><br>Much like Gone With the Wind, Titanic, or Out of Africa, Australia is a romantic epic that tells the story of an upperclass woman who falls for a dashing rogue. And that's not where the story similarities stop. Australia also takes place in a unique natural landscape and it's set against an important historical event. Australia is not just similar in story construction to these Hollywood classics, it is a direct variation on them. I don't hold that against Australia. The formula obviously works, and if you can put a worthwhile spin on it, I'm all in. Australia has a distinct Aussie flavor, and it's commentary on Australia's Stolen Generation is something we haven't seen in mainstream Hollywood. The cast is made up of just about every major Australian actor working, with welcome turns by David Wenham, Bill Hunter and Ray Barrett to highlight a few . Nicole Kidman and Hugh Jackman star, and they are exactly what they need to be. Kidman does her thing as the uptight English outsider, and Jackman was born to play the bushman with a heart of gold. There is almost nothing I can say against the structure of Australia. This exact story has been done before, and done very well.<br><br>As much as I hate to admit it, because I really like him as a filmmaker, Australia's problems start and end with Luhrmann. I suppose he must have had a passion for telling this story. He is Australian, and I'm sure he felt an obligation to do justice to the country's history, specifically the Stolen Generation, but you can't really see that passion on the screen. This is a sloppy piece of work. For starters, Luhrmann never quite finds the right tone for the story. The introductory scenes are kind of playful and more than a little humorous, but as the film moves along, the melodrama begins to take hold. It gives the film a jittery back and forth feeling, as if competing ideas of what type of movie this should be were all thrown in together, elbowing each other for space. <br><br>The bigger blunder from Luhrmann is the look of the movie. The Australian Outback is one of the most beautiful places on Earth. It doesn't take much to translate that beauty to the screen. And while there are, by sheer volume, plenty of breathtaking vistas on display in Australia, there are far too many ugly ones. Luhrmann relies heavily on sound stages and CGI backgrounds. Digital enhancement is, of course, not a dealbreaker in itself, but the CGI here is so bad, pervasive, and needless that it almost does spoil the rest of the film. There is absolutely no need for this much CGI in a romantic Hollywood epic, especially CGI that looks like a PlayStation 2 game. There is a long, pivotal, cattle driving scene in the middle of the film, and I didn't believe that environment for one second. This is a production that is calling out for old-fashioned filmmaking, and Luhrmann it seems, doesn't have that in him. At least not fully. He tries to have his cake and eat it too when it comes to balancing the art-house elements he's famous for and the traditional elements the material calls for. The result is a movie that is not artsy enough to separate itself from its obvious inspirations, And not traditional enough to stand alongside them.<br><br>This is a movie stuck in, well, No Man's Land. Luhrmann wants Australia to be a grounded drama about Australian history but he also wants a magic realism tale about an aboriginal twilight. It is not impossible to do both, but Luhrmann only gives half his attention to each. I'm being hard on Australia only because I know it could have been great. The final product is not a bad movie. There is a surplus of ambition and conviction in both leading actors, Kidman and Jackman, and in Luhrmann as the director. This is a solid tale with enough admirable craftsmanship to get a pass from me, but given its potential, Australia is a major disappointment.<br><br>64/100","user":"jaredpahl","rank":[12,12]},{"title":"Crikey! More Cheese than a Farmhouse Stilton.","rating":8,"date":"8 December 2008","review":"I have no idea what to make of Australia. It can't possibly be a serious movie, right? It certainly starts as a camp comedy, then lurches into a clichéd action romance adventure, before descending into an attempt at World War Two melodrama and finishing with a dubious helping of Elgar over a rather uncomfortable attempt at serious social commentary. Elgar? I mean why? My dictionary defines a farrago as a confused mixture, a hodgepodge or medley. That sums up Australia perfectly, a farrago. It has no idea what it wants to be so it attempts to be everything to everyone and fails at almost all of it. You can only get away with this stuff if you are really clever and have a well honed sense of irony and your tongue kept firmly in your cheek. Australia is neither clever nor ironic enough, which is a pity, because I loved Moulin Rouge, but after watching The Man with One Noun, The Drover, send a band of wild horses galloping past the ranch house yet again for no discernible reason, I turned to my companion and said I thought Australia might be Bonanza meets Monty Python.<br><br>I'm sorry if this sounds cruel, but when this much money is thrown at a movie and it turns out to be this inadequate, I actually feel quite miffed. Had it cost $10M, it might be excusable. At $100M plus, it isn't. I never, ever thought I'd find myself saying this, but Nicole Kidman is probably the best thing in this film, and the reason for that is because Kidman is actually quite good on the camp level (see her in Moulin Rouge or Practical Magic)  I have a problem with her as a serious actress (The Hours, Margot at the Wedding.) Had director Baz Luhrmann stuck at the camp tongue in cheek genre, we'd all have been better off. Instead he gets serious and we get a script in which - especially in the second half - every other line of dialog is a grating cliché and competing story threads lead to superficial treatments of what could, taken individually, be quite interesting plots. I will say upfront that I don't blame any of the actors, I think they all did a reasonable job given the material. I get the feeling that Kidman, Jackman, Wenham et al all took a deep breath, tightened their belts, firmed their jaws and said \"OK, we've been paid for this, let's give it our best shot.\" There's an enthusiastic \"let's put on the show in the barn\" feel to the acting. Or maybe it's me? <br><br>The (multiple) stories: there's an aristocratic woman arriving in an alien hot land to take control of a ranch which was her husband's purchase (think Out of Africa but without Meryl Streep). There's a cattle drive across the Outback (again heavily borrowed from Out of Africa) and the criminally wasted diversion into the desert to try and find water, which could, if handled properly, have led to some quite interesting drama. The heroine can't have children (O of A again) and takes up with an attractively roguish man (Robert Redford / Hugh Jackman) while taking on responsibility for the Kikuyu/Aboriginals who inhabit her land because unlike 99.99% of the other white colonizers, she has a conscience - surprise surprise. There are aerial shots of the Australian Outback  compare to the aerial shots of the Rift Valley in O of A - there's the pantomime villain Neil Fletcher played by David Wenham (apparently picking up where he left off in The Proposition playing an identical character, called Eden Fletcher  is there some significance to the name that a non Australian doesn't get?) then we lurch into the bombing of Darwin and the rescue of the lost children. If there are movie awards for plagiarism, Australia is in the running. It's an understatement to say it lacks originality.<br><br>It's also far, far too long, falling into a genre I'm beginning to call the 'Depends' movie, after the adult diapers required to sit through it - especially necessary when you realize that the only really acceptable way to watch Australia is after several drinks. Combine this with CGI which barely attempts to blend into the live action, an almost unbearably cute kid (Brandon Walters is heart melting) plus a cast which features every Australian actor who's graduated drama school since WW2, and what exactly is this movie supposed to be? Even as an advert for the Aussie tourist industry I doubt it works as well as The Proposition, which had better shots of dramatic Outback scenery. And how many visitors go to the Northern Territories to watch cattle droves? If Luhrmann really did edit this down from many more hours of film, then possibly he can re-issue a director's cut which works better. I see it working as a musical, along the lines of Moulin Rouge. The corn is certainly as high as a kangaroo's eye.<br><br>I went with a (female) friend who is a Hugh Jackman fan and I will, if cornered, admit to being a closet David Wenham groupie, so we were well primed to enjoy this, two girlies on a Friday night out - probably the target audience. But even Jackman taking his shirt off couldn't save it (and believe me, I've seen other movies where a Jackman shirt removal certainly did save the day.) I have no idea how much they paid David Wenham to make this, but it probably wasn't enough. It's not as bad as their other foray together, Van Helsing, but that's not saying much. And OK, the costumes were pretty. But the rest? Oh dear. Oh dear. Oh dear","user":"isabelle1955","rank":[205,297]},{"title":"Old-style epic romantic movie","rating":7,"date":"22 February 2011","review":"An entertaining romantic drama by Buz Luhrmann, old-Hollywood style.<br><br>The movie is set in the Northern Territory of Australia in the years previous to the involvement of Japan in the WW II, and tells the story of Sarah Ashley -an English lady who goes to Australia to try to get her husband back to England and ends becoming the head of their Australian cattle farm-, Drover -an independent free-spirited cattle and horse drover that works for her- and Nullah -a half-caste Aboriginal child who lives in the farm and struggles to live in a world in which he's alien to both blacks and whites.<br><br>This is one of those movies that you can say it is done as the movies of the golden era of Hollywood used to be - flashy wonderfully well-looking movie stars, great scenery and great studio settings, detailed recreation of the era's fashion, decoration, atmosphere, etc., , and a simple epic plot with a great love story. Australia has all of this, but also a little bit of corn, a thin plot, weak characters and flaws that are even more noticeable in a super-production like this.<br><br>The script is uneven and Manichean (with angels and demons) and mixes several movie genres (romantic comedy, romantic drama, war movie, western movie, and Aboriginal movie) with different degrees of success. The characters are descriptive and without emotional depth, and that affects the acting. However, I loved the depiction of the magic and wisdom of Aboriginal Australians, which is really well presented, with its magic beliefs and philosophical and environmental approach to the world. I think that part is truly genuine and real and reaches the viewer. I also loved that Lady Ashley's character is the one of a true modern woman, as she is a strong-willed free woman, a boss, the boss of her man, a woman who always leads, never submissive or afraid of being alone if she doesn't get what she wants. That's a post-modern woman, so rare to see in cinema nowadays.<br><br>The acting is unconvincing on the part of the leading actors. Hugh Jackman's performance is just OK in his role, while Nicole Kidman disappoints in the comic part of the movie, as she seems not to relax when she does so, but she warms up to her usual self when the story becomes more dramatic; she looks beautiful in this movie, like a 50s movie star, although those inflated siliconed lips were a distraction... Jackman and Kidman make a great couple, but their chemistry on camera was nothing memorable and you see yourself seeing two actors playing a couple, not a real couple on screen.<br><br>Most supporting actors are good in their roles, especially the Aboriginal ones, who really shine in this film. David Gulpilil is simply terrific, completely believable and inspired in his role of the Aboriginal Elder King George. Brandon Walters, despite his youth, offers a memorable performance, and his face really lights up the screen. Also great is the actor who plays Drove's Aboriginal pal, who also offers a solid performance. They are the ones who really give soul to the movie.<br><br>Despite what you might expect, the cinematography is poor. I was expecting the rare beauty of the Northern Territory to be captured by the always stylish and colorful Luhrmann. However, the part of the movie that happens during the dry season is completely opaque and colorless, ugly to watch, while the scenes happening during the rainy season are again limited in colors.To my disenchantment, many of the most colorful and beautiful scenes are digitally created or enhanced, while others seem to have been shot in big studios. Just the Mission island seems to convey that luxurious real feeling of the NT vegetation. Some of the most beautiful bits of the real land, the aerial vistas, look like if they had been taken for a documentary for National Geographic. Where is the emotional connection of the story with the land? In other words, the viewer doesn't go beyond what the eyes see. So, one wonders, why the movie was called Australia and why it was sold as a movie that captured the spirit of this country. To be honest, I thought that most scenes in the movie could have been shot anywhere in the world not in Australia.<br><br>The movie is a little too long. Most of the first half an hour could have been removed , condensed or presented in another way to give the non-Aboriginal characters more emotional background and depth. For example, we barely know why Neil Fletcher wants so badly Sarah's farm, and why he's so wicked in general but he loves a lovable sweet good- hearted woman. He is just an archetypal bad-guy, period.<br><br>Despite its flaws, I enjoyed the movie, especially the second hour and a half, and that heaven of a man that is Hugh Jackman. God Bless him and his holy body.","user":"Imdbidia","rank":[10,11]}]