[{"title":"One of the most amazing movies I have ever seen.","rating":9,"date":"22 February 2020","review":"Masterful character study and motivationally driven lives which clashed at the wrong time in history. Performances were delivered by first class actors and direction. An underrated tense thriller of one of the most complex people in history versus one of the most average.","user":"MR_Heraclius","rank":[41,42]},{"title":"A hauntingly beautiful film","rating":10,"date":"16 October 2007","review":"Andrew Dominik's The Assassination of Jesse James by the Coward Robert Ford, is a deliberately paced, stunningly visualized, and emotionally charged exploration of the early development of mass media celebrity in America. The film riveted my attention for two hours and 40 minutes, and has remained on my mind for several days after my viewing. Although centered on one of the iconic legends of the Old West, it is far beyond an updated reincarnation of the Western. It is an epic allegory about the development of the American cult of celebrity and the effects of this obsession on the individuals caught in its web.<br><br>Visually, the film soars beyond anything that has hit the screen since Conrad Hall's final masterpiece with Road to Perdition. Roger Deakins, the cinematography genius behind The Shawshank Redemption, Kundun, and all the Cohen brothers\" films since The Hudsucker Proxy, surpasses his best work. He pulls out all the stops hereintricately orchestrated changes in focus, richly textured colors, dazzling use of light sources, careful manipulations of time, powerfully significant fade-ins and fade-outs, and shots through rain, snow, and rippled old glassto communicate the story. Deakins' contribution stands out in the railroad train robbery sequence at the beginning of the film. Clearly defined, flickering light sources and deep black shadows create a dazzling, nightmarish vision that haunts the rest of the film. This sequence alone is worth the price of admission.<br><br>The richly textured, historically precise visual aspects of the film bring to mind Terrence Malick's Days of Heaven and Robert Altman's McCabe and Mrs. Miller. However, instead of the understated, \"realistic\" performances featured in those films, The Assassination of Jesse Jamesshowcases powerful, yet still realistic performances by an outstanding ensemble cast.<br><br>Sam Rockwell, as the not-too-bright but well-meaning Charley Ford, and Mary-Louise Parker, as Jesse's loving wife, stand out. Yet the film belongs to the two titular leads, both of whom deliver the performances of their careers and create characters filled with disturbing contradictions. Brad Pitt's Jesse James is alternately pitiable and terrifyingan affectionate, loving father, an old-before-his-time sage, an adventurous daredevil, an unrepentant bad boy, and a vicious sociopath. Casey Affleck's Robin Ford is a complex, repellent, and tragic character who challenges the audience's complicity in the undercurrents of the film.<br><br>All in all, this is a great filmnot for those seeking the simple pleasures of instant gratification. But definitely worth the attention of those who still believe that movies are an art form.","user":"rick-j-walsh","rank":[434,507]},{"title":"Great but hard to sell...","rating":10,"date":"14 October 2007","review":"If you have watched the trailer and know this movie is two hours and forty minutes long you know what you are getting into and should not be disappointed. This movie delivers on every level of film making, be it cinematography, acting, or writing. Casey Affleck delivers a fantastic performance in how he portrays Robert Ford as the bright eyed fawning kid in a way so sincere it makes the audience uncomfortable even when it shouldn't. Brad Pitt underplays his part as Jesse James hitting all the right notes while never saying much. Exactly the way one would expect an outlaw to act when they have everything in the world to hide. I can't say the movie didn't FEEL two hours and forty minutes long but I never wanted it to end sooner than it did. I guess I just enjoyed the time I got to spend watching these characters for the full running time.<br><br>I loved this movie. Unfortunately, a long western without action is something seemingly impossible to sell to the public these days. It would be to the advantage of the studio to sell this like The English Patient was sold 10 years ago. Just make people feel like ignorant idiots if they don't like it! As much as it pains me to say it, I think most people don't care enough to bother seeing what makes this movie so great. The only other option to make this a success is to fool them into THINKING they love the movie. I'm really curious how many folks out there that like the movie agree with me here.","user":"TheWylde","rank":[424,514]}]