[{"title":"Average, but not necessarily bad","rating":7,"date":"25 February 2015","review":"Tower Heist is Ben Stiller's latest comedy where he plays the building manager of a New York high rise tower block. He regrettably invests him and his staff's pension money with a smooth-talking crook who lives in the top floor penthouse. Naturally, the crook wastes their money and they're left without a cent.<br><br>Therefore, Ben and a few other disgruntled employees, enlist the help of small time crook Eddie Murphy to break into the penthouse and steal back their money.<br><br>It's a decent enough premise and, again, all the cast to a decent enough job. There you have it - it's a decent film. Not quite funny enough to be a comedy through and through. Not quite dramatic enough to be a straight drama. It even throws in a bit of a high speed car chase into the mix to add an element of 'action' into the genre.<br><br>It's a bit of a mixed bag. If you go into it without any expectations, you should find it an okay watch.<br><br>Not great, but not bad either. Fans of Stiller and Murphy should find extra things to enjoy about it.","user":"bowmanblue","rank":[11,11]},{"title":"Breezy and acceptable fluff","rating":26,"date":"26 April 2012","review":"\"Tower Heist\" is a movie that's never going to win awards. But if it's playing on your television during a rainy day, you will find it is an acceptable way to pass the time. And you'll find the movie has some positive features. Alan Alda makes for a good slimy villain, and Ben Stiller, Eddie Murphy, and Matthew Broderick (as well as their co-stars) make a likable bunch of people with a goal that you hope they will be able to reach. The actual heist has some unexpected twists as well as some genuine suspense. Certainly, the movie is not perfect. There are some parts of the movie when the movie seems to be missing footage, especially at the end where not all the plot points are resolved (though the two alternate endings on the DVD have this missing material that was for some reason removed from the theatrical print.) While I wouldn't say this is a movie to seek out, if you stumble upon the opportunity to see it, it will probably give you an acceptable amount of entertainment.","user":"Wizard-8","rank":[35,43]},{"title":"A Very Entertaining Way to Pass the Time","rating":7,"date":"7 November 2011","review":"I didn't expect too much from this movie after watching the trailer. Judging from the cast and the trailer I thought that it would be at the very least a little entertaining or just an okay movie. It is actually very entertaining and the performances from the entire cast are solid. I laughed a lot and more than I expected. It also has quite a few twists and turns which I wasn't expecting and which should keep you interested. The chemistry between Ben Stiller and Eddie Murphy is very good too and they both provide a couple of very memorable scenes. If you are looking for something to pass the time this movie would be a very good choice.","user":"Shelly_T","rank":[108,147]}]