[{"title":"One of the Most Brilliant Comedies I've Ever Seen","rating":10,"date":"30 April 2007","review":"Hot Fuzz satirizes American action films in a way that an American satire would not. Edgar Wright and Simon Pegg don't simply spoof the plot threads and the car chases. They know the smaller details of Hollywood's formula, as they exemplify with its continuous references to the scene in Point Break where Keanu Reeves fires his gun into the sky in anger and the scene in Bad Boys II where Martin Lawrence, in a circling tracking shot, says, \"S*** just got real.\" Not only do they tackle those less clear characteristics of Hollywood, they also perfectly portray people who talk about awesome scenes in action movies, hilariously by Nick Frost. The film is brilliantly in precise tune with the American mainstream action adventure.<br><br>The irony in this film is that it takes place in the serenely beautiful English countryside. In some ways, the film is very important for Americans to see. It delves very deeply into the conscious social mannerisms of the English, and parodies the timid insular English village life. Perhaps the most brilliant element of Hot Fuzz is the intertwining of a big-budget action film with gimmicks and a desperately fast pace and a quaint, atmospheric English village given the secrets-of-its-own flavor and a Agatha Christie-style expository structure.<br><br>The film-making style in and of itself is complicit in the satire. The cinematography and editing is a product of the school of Tony Scott and Guy Ritchie. It's filled with jump cuts accompanied by loud and constantly changing sound effects, occasional strobe, and montages of grainy, bleached out, extravagantly lit shots edited together at machine gun speed. The soundtrack is that of any super-cool action film from Hollywood. This works so well not only as a dead-on impression of Hollywood film-making but also as a hilarious opposition to the English countryside.<br><br>Simon Pegg's performance is a work of comic genius. His character is so well-developed as a man of invincible and authentic confidence and incredible drive, a workaholic, a zealot, and also an action hero stereotype. Nick Frost is a great second banana because not only is he the punchline to Pegg's straight line, he's also funny in such a direct, adolescent way, an unlikely comic relief sidekick.<br><br>The film's great surprise is a comeback performance from Timothy Dalton. Not only is it a reappearance from the abyss he's been lost in since his two-year stint as James Bond, but also a vindication against all who've continually dismissed his credibility as an actor and doubted his comic ability. He's very funny and one of the film's great highlights.<br><br>I've rarely seen a comedy so cleverly written, beautifully directed, atmospheric, or intelligently ridiculous.","user":"jzappa","rank":[300,348]},{"title":"Most fun in a cinema since....forever","rating":10,"date":"6 February 2007","review":"Saw this last night at a special screening followed by a Q&amp;A with Simon Pegg and Nick Frost. I liked \"Shaun of the Dead\" but wasn't a huge fan but I liked what I'd heard about \"Hot Fuzz\". I still wasn't prepared to be quite as blown away by it as I was.<br><br>This film works both as an out-and-out comedy but also as a high paced action film and also manages to showcase the directing talents of Edgar Wright and the acting of Simon Pegg (who can really *act*) The first half is a gentle build up but is generally and genuinely amusing, but once we put the pedal to the floor for the second half the pace is relentless.<br><br>The plot is substantial enough but isn't really what we've all come to see - it's about the snappy dialogue and the gags. To describe it as a spoof is unfair - they just corrupt the genre a little and turn up the comedy.<br><br>Great fun from start to finish.","user":"dgraham-1","rank":[545,700]},{"title":"How you Top Shaun of The Dead","rating":10,"date":"24 December 2006","review":"I was lucky enough to see a preview of this film for free after I attended a random screening of Scorcese's the Departed. Naturally hearing that the makers of Shaun of the Dead were behind this I had to go see it - if a group of people can make a romantic comedy with zombies, then a buddy cop film HAD to inventive and original.<br><br>I can safely say that it was. I haven't laughed as hard in a film as I did with Hot Fuzz. The parts are all cast brilliantly - in particular Pegg and Frost as the two lead police officers.<br><br>Pegg bringing the smart, intelligent, action hardened London cop to the sleep north England village works in a classic fish out of water scenario. It surprised me with it's direction and I will confess I couldn't have predicted how everything would pan out.<br><br>When this is fully released I urge you to go and see it.","user":"sean-764","rank":[590,767]}]