[{"title":"\"I was going to come as a shark but I realized an eagle was slightly better.\"","rating":8,"date":"27 December 2007","review":"\"Eagle Vs Shark\" is the story of two people considered 'losers' by society and how they might...just might...be right for one another. On one hand you have Jerrod, a twelve-year old boy trapped in a man's body who enjoys making candles, plotting revenge on the school bully that ruined his life and playing the video game 'Fight Man'. On the other hand, you have the fragile Lilly who sings songs about tangerines, lets people walk all over her and dreams about how Jerrod (a regular customer at the fast food restaurant where she works) may one day love her.<br><br>Creating a quirky, whimsical movie featuring two geeks who are awkward and barely able to function in society is difficult to pull off but New Zealand film maker Taika Watiti manages it. What makes this movie different to many others which focus on similar characters is that \"Eagle Vs Shark\" never stoops to mocking its characters despite the opportunity to do so. The audience is invited to share in their hopes and defeats, rather than stand back and laugh at their offbeat behaviour. It is a romantic comedy about two characters who are ill-suited to the genre (Lilly wears her shark costume while lying in bed with Jerrod for example).<br><br>Whilst both leads are magnificent, Loren Horsley is the real find here. With her wide innocent eyes, crooked smile and shy demeanour, she creates a character which you can truly connect with. Jerrod may be a complete jerk and oblivious to everyone around him but you never doubt that Lilly truly loves him. She's the type of girl who fades into the background of any room and Horsley manages to convey her joy and heartbreak in a way that you really want her to have a happy ending. Jermaine Clement as Jerrod is a lot harder to warm to because of his actions (and inactions) throughout the movie but ultimately you come to share Lilly's faith that the two are right for one another.<br><br>It's hard to avoid the comparisons to \"Napoleon Dynamite\" when reviewing \"Eagle VS Shark\". The deadpan deliveries of the characters in both movies is similar and the tone is almost identical. It's safe to assume that if you hated \"Napoleon Dynamite\" then you're absolutely going to loathe \"Eagle VS Shark\". Everyone else should give this movie a chance. Like the characters it features, it's not perfect but, like love, it's an uplifting experience.<br><br>Awkward. Quirky. Wonderful.<br><br>Recommended.","user":"Mr_Saxon","rank":[38,42]},{"title":"Dangerous Person, Yup","rating":7,"date":"20 June 2007","review":"Greetings again from the darkness. While comparisons to \"Napoleon Dynamite\" are inevitable, writer/director Taika Cohen/Waititi actually delivers much more depth than the cult classic from Idaho. The multiple story lines involve family relationships, one on ones, self-esteem and self-discovery. Of course it may also be one of the quirkiest films of all time.<br><br>Of the two leads, Jemaine Clement as Jarrod and Loren Horsley as Lily, Clement's role is much flashier, but Ms. Horsley steals every scene. She is such a delight and a curiosity on screen. Her crooked smile and expressive eyes are exquisitely charming and as a viewer, we immediately embrace her desire to be loved.<br><br>Most of Mr. Clement's role is gearing up for his big revenge fight against the high school bully. As with most things in his life, he doesn't handle the moment very well, but it does become his moment of awakening.<br><br>The family relationship issues are complex and handled very realistically as very little is actually said amongst the individuals. Body language speaks much louder than words. Don't miss the director in the flashbacks as Jerrod's \"perfect\" brother Gordon.","user":"ferguson-6","rank":[55,63]},{"title":"Worth seeing at least once","rating":7,"date":"29 January 2007","review":"Cute, quirky film. I thoroughly enjoyed this twisted and very unique \"Romantic Comedy\" . Occasionally I was reminded of Napoleon Dynamite, but that is not to say that the content and story was unoriginal. The opening scene was absolutely fantastic, and immediately you are thrilled to find out who this strange girl is, as well as who her crush is. I love that the writer/director made some very non-cliché choices for the characters, it made for some refreshingly shocking fun moments. His actor girlfriend is very talented, and in reality a beautiful girl. This unique film may not be the one you watch dozens of times over, or memorize every single line, but it is certainly one I will see again when it is released.","user":"wmmacy","rank":[54,62]}]