[{"title":"Dante and Randal are back - and in prime form.","rating":10,"date":"2 June 2006","review":"Clerks II is a worthy successor to Kevin Smith's 1994 debut, \"Clerks.\".<br><br>The continuing adventures of Dante and Randal speed along with witty dialogue, insightful social commentary, and a touching look at various levels of life, responsibility and most importantly, love.<br><br>There's a lot of the requisite dirty jokes, but they enhance the golden center of the flick. I laughed and cried in many of the same moments. But mostly, I watched two characters I had grown up with grow up themselves and face some of the dilemmas I've faced since I went from being a teenage slacker to an adult. I was reminded of a better time in my life, and also reminded to look forward to the future.<br><br>Brian O'Halloran knocks Dante out of the gate, with pitch-perfect delivery. I believe that this is still the Dante we knew - just a bit older. Jeff Anderson takes Randal, an already amazing character, and brings him to a new level. Randal becomes even funnier - and more touching. Trevor Fehrman's Elias adds the perfect foil for Randal's brand of mischief. Jay and Silent Bob, the dynamic duo, are also back - proving that Jason Mewes is back in top shape, and really enjoying making you laugh.<br><br>~Steve","user":"MallRat419","rank":[209,272]},{"title":"Young listless punks grow up to be 30-something listless punks","rating":8,"date":"6 June 2006","review":"I had reservations about a sequel to the cult classic, Clerks. The charm of the first movie was how Kevin Smith relied on convoluted dialogue and effervescent characters to launch the movie. I was not confident that he could return to those roots after 12 years of success under his belt.<br><br>Fortunately, this movie does not disappoint. Smith's trademark witty dialogue is ubiquitous as ever. The characters argue and rant about meaningless topics with the same intensity as family members faced with the decision to pull the plug. O'Halloran continues to portray Dante as the hapless slacker who simultaneously makes us feel sorry for him and urges us to smack him for not doing anything about his circumstances. The latter feeling is embodied by Anderson, who plays the irresponsible malcontent, Randall. Fans of the first Clerks movie will be amused by their continued antics. One of the new characters is Becky, played by Rosario Dawson. Dawson performs admirably, making us fall in love with the free spirit who took a wrong turn in life and ended up managing a Mooby's restaurant. Becky provides a refreshing contrast to the stodgy and suffocating Emma, played by Mrs. Smith. Emma appears a bit too one-dimensional, but her purpose as Dante's fiancée is clearly to show yet another disappointing facet of Dante's life. Another new character is Elias, played by Trevor Fehrman. Elias's role is a bit over-the-top as the hobbit-obsessed geek whose life is enriched by the promise of a live-action Transformers movie. The flaw is that Elias is too repressed and weird and cannot garner much sympathy from the audience. This might be Smith's intent, as we enjoy a little schadenfreude every time Randall torments him.<br><br>The story is fairly basic and picks up where the first movie leaves off. Dante and Randall seamlessly move from the end of Clerks to the beginning of Clerks II. This may seem sad, since they are now 30-somethings working as clerks, and that is intentional. The sequel shifts the focus from young clerks trying to determine what to do with their lives to clerks approaching middle age trying to figure out why they're still in their dead-end jobs. The story of Dante whining about his life and Randall putting him in his place is rehashed from the first movie, but with a sudden afflatus, Dante is finally able to do something about it.<br><br>The humor is still strong with Kevin Smith, as he throws ridiculous sight gags at us in between the labyrinthine dialogue about Transformers, Star Wars, racial slurs, blogs, and life in general. Fans of Kevin Smith naturally will enjoy this movie and do not need to fear that he has \"sold out.\" It's hard to say if newcomers will enjoy the movie. If they are into the humor of the movie, then they logically should already be aware of the first Clerks, as well as Dogma and Chasing Amy. I can only suggest for the moviegoer who is unaware of Kevin Smith's credentials to go rent Clerks. If the story bores you, then Clerks II probably won't appeal to you, though there are more sight gags that may appeal to some audiences. Those who are easily offended are also urged to stay away, as this movie contains scenes of profanity, bodily fluids, and (for most people) sexual deviance.<br><br>All in all, it is a solid movie. It has a few pacing problems (or did at the screening) but nothing that negatively impacts the movie. Some scenes are utterly ridiculous, but it is par for the course for this type of movie.","user":"Kuildeous","rank":[161,209]},{"title":"CLERKS II - A great conclusion to the NJ saga!","rating":10,"date":"5 June 2006","review":"This movie was everything I hoped it would be. It is especially (or maybe even primarily) for fans of Kevin Smith's \"ViewAskewniverse\". (And yes, it's in color...mostly.) Also, there was no subtitle...it was titled simply \"CLERKS II\"...no \"the second coming\" or \"the passion of the CLERKS\".<br><br>I don't want to hit any spoilers this soon before the movie comes out, but the general idea is that it is a \"coming of age\" story for the Gen X slackers, who finally in their 30s find themselves not having advanced very far in life, careers, personally or even in general (this is primarily Dante's role, anyway). He decides (due to some things beyond his control) to FINALLY move on, \"grow up\", get married and leave Leonardo New Jersey and its band of bad influences behind.<br><br>Randall, of course, is not so keen at his only friend leaving NJ, is perfectly happy living with his parents and doing as little as possible, and a good part of the movie is spent on Randall challenging Dante's decision and exploration of their friendship.<br><br>Now, this may sound like some kind of melodrama, BUT IT ISN'T!!! That basic story is weaved between the plot devices, smart dialogue and gritty or \"pushing the limits\" humor we come to expect from Kevin Smith.<br><br>There's Jay and Silent Bob of course, who have a mini-character arc/growth experience themselves, Jason Lee in with an all new character for one short scene (I think this is his 5th new character in Kevin's ViewAskew franchise), and Ben Affleck with a mercifully brief (one or two line) cameo. Jay and Bob's antics are always a great break from the other action, never an intrusion, even when they are TRYING to intrude, by making asses of themselves (literally) in the background of the primary action.<br><br>Plus, a couple of new characters, a crew member at Mooby's (a McDonald's type fast food joint) named Elias who is a very religious, naive counterpoint to Randall's ruthless and jaded personality, and therefore the butt of many jokes/gags. His and Randall's comments regarding \"Lords of the Ring\" vs \"Star Wars\" are priceless and vintage Kevin Smith.<br><br>Another new character, \"Becky\", is played by Rosario Dawson, who is the manager at the same restaurant. She plays the part of the good female friend who depends on Dante and challenges Dante to consider if he really wants to settle for a girl who is merely tolerable.<br><br>As with the first \"CLERKS\", this movie pushes the limit of what can be put on film and actually get released in theaters. I hope the more controversial parts make the final cut because I think the shock value that makes you say \"NO THEY DIDN'T!\" is a valuable part of the equation and expected from this film franchise. Without giving anything away, there are particularly two of the films ongoing jokes, one having to do with bestiality, the other in which some very NON-PC racial terms are used, REPEATEDLY, including the \"N-word\". No one else has the guts to address these issues and make them funny. 'Cept Kevin Smith.<br><br>Finally, the movie really does have a story without being preachy, we're treated to known characters without it being a nostalgia-fest (for instance, Jay and Bob are in their signature places in front of the Quick Stop, but Jay utters not once \"Snootchie Bootchies\"...but not to fear, he finds a NEW way to crack us up...Bob's discovered a way to keep Jay's mind off of drugs. Fans of Jay will NOT be disappointed.)And the movie goes through an interesting story arc, with surprises and twists resulting in a satisfying ending.<br><br>I'm concerned that the more risqué scenes might have to be neutered for ratings' purposes; hopefully not. If so, they will be on the DVD for sure. I can say that even in very conservative KC, the audience laughed A lot, no one walked out during the most \"offensive\" part, and everyone seemed to really enjoy the edgy wit, smart dialogue as well as the bathroom humor that kept the film at a fun pace.<br><br>*EDIT-I've since read that 3 people walked out, which isn't bad from an audience of nearly 500 and with a movie this edgy. I guess I was enjoying myself too much to notice the walkouts!<br><br>The movie is also more realistic than some of the other View Askew movies; more like Clerks, obviously. None of the comic book type stunts like in \"Mallrats\" (Silent Bob's batman utility belt and flying around with a cape) or \"Jay and Silent Bob Strike Back\" (with the fake lightsaber scenes and flying on the bicycle through a wall and not getting hurt) or all the special effects,mythology and divine interventions of \"Dogma\" (Alanis Morisette as God appearing at the end to save the world). There are no scenes to groan at and think \"ah, right, like that could happen\". These characters are real, and real things happen to them, no special abilities, creatures from the underworld or new age messiahs. Just real people that many of us can relate to.<br><br>In closing...don't take your grandmother to this movie. It is full of obscene language, profane concepts, drug references, \"unnatural\" sexual references, etc. Unless you know your girlfriend is hip and not easily offended, test her with a DVD of \"CLERKS\" first to see if she \"gets\" the humor.<br><br>Otherwise, get a gang of friends, go to this movie and get ready to laugh your freakin' BUTT off!","user":"Bladerunnerrr","rank":[231,309]}]