[{"title":"Infinity is a sympathetic but rousing film on one of the greatest minds of all time – Srinivasa Ramanujan.","rating":7,"date":"14 December 2015","review":"Before Albert Einstein there was Srinivasa Ramanujan - A little known fact outside India and the academic community, and precisely why this story had to be told. The Man Who Knew Infinity serves as a biopic behind the life and times of Ramanujan, a self-taught Indian Mathematician, who some say could decipher the very fabric of existence. It's a poignant film in as much as an emotional roller coaster but an extraordinary story told almost a century after Ramanujan's early and tragic death in 1920.<br><br>That's because Ramanujan was not only a mathematical prodigy by the age of 11, or that he could mentally compute complex permutations in a fraction of a second, but the fact that at the height of his powers, not many could fathom his genius. Not even the Cambridge scholars who elected him as a Fellow of the Royal Society and also a Fellow of Trinity College – monumental achievements for an Indian with no formal training in mathematics. Based on this true story and adapted from a 1991 book of the same name, writer/director Matthew Brown begins the film in 1914 Madras (back when Madras was rightly called Madras). Ramanujan (Dev Patel) comes from a poor Brahmin upbringing where even note paper is a luxury. He is seen frantically scribbling theorems on slate before sending samples of his work to intellectuals in Cambridge. Within an instant of receiving the latter's theories, Cambridge academic G. H. Hardy (Jeremy Irons) is not only astounded, but invites Ramanujan to study in England – both as his protégé and the missing link since Isaac Newton.<br><br>Forced to leave behind his young wife (Devika Bhise) with his mother, this would be the start of many of his problems but not before going on to make profound discoveries in his field of study. Close on the heels of The Theory of Everything and The Imitation Game, 2014's Academy Award frontrunners, Brown's screenplay fits the bill as a rousing film with a lot of heart but not much insight. Instead, it's more of a sympathetic look at Ramanujan's poor background and the hardships he would encounter in England, including what looks like an over exaggerated and clichéd case of racial prejudice and a depressing long distance love story with his wife. What this means is Infinity is still a well-made film worthy of a thunderous applause, but does little to focus on Ramanujan's innate brilliance. However, from a storytelling perspective that's not really the director's fault. Consider the fact that almost a century after his death, intellectuals using modern day computers are still baffled by Ramanujan's integrals and integers. And only as recent as 2012 have scientists confirmed Ramanujan's incredible intuition that suggests the existence of black holes in deep space – a concept that was virtually unknown during his time.<br><br>\"Intuition\" is Ramanujan's answer to how he arrives at his conclusions, and the best moments in the film where Hardy forces Ramanujan to provide \"proofs\", or sequential steps to his formulae. Without proofs his theories are considered inconceivable and Ramanujan is often dismissed as a charlatan. To its merit, Infinity builds on the relationship between Hardy and Ramanujan, both extreme opposites in their beliefs but recluses who find solace and then inspiration in each other. Irons is perfectly cast as an outspoken atheist opposite Patel who believes his theories come from God. Their symbiotic chemistry builds towards a tearjerker of an ending while adding warmth and closure. Given that Ramanujan was known to be short and stout, Patel might seem like a strange casting choice yet captures his character with integrity and passion and in some ways, a beefier underdog akin to his breakout role in Slumdog Millionaire.<br><br>That The Man Who Knew Infinity is aimed as a crowd pleaser is obvious and it works well within this scope. And given the subject matter, this film should also do well in foreign markets, especially multiplexes in the Subcontinent and surrounding regions. What's more important, and hopefully so, is that the film brings out Ramanujan's true legacy shoulder to shoulder with the likes of Newton and Einstein. Time, as infinite as itself, will tell.","user":"LloydBayer","rank":[150,166]},{"title":"Man's recognition of a true genius and his untimely demise is the ultimate human tragedy","rating":9,"date":"15 August 2016","review":"Ramanujan is a name like Beethoven or Picaso. You don't need to know their history. You don't need to know about their life. Their work speaks for them. While common people try to review and measure what they see, geniuses imagine completely new things that could exist. The Man Who Knew Infinity is just a movie based on a book based on the life of a genius. How can we even expect it to tell us all that is there to know about him? Still, it does its job fairly and with sincerity. <br><br>The striking difference between this movie and A Beautiful Mind, another biopic about a mathematical genius, is that of the tone. Sure, the portrayal of a genius struggling with schizophrenia makes for a more compelling story but is by no means tragic. How an unlikely partnership slowly turns into a mutual respect and finally into a meaningful yet short-lived friendship is at the core of the Ramanujan-Hardy story. As Hardy addresses his interactions with Ramanujan akin to a romantic affair, he encapsulates their common passion for maths and their devotion to the craft. It was a rare symphony of two souls that happens once in ages. The profundity of that is realised when one feels the pain of Hardy in coming to terms with the fact that he'll never see Ramanujan again. For that matter both Dev Patel's and Jeremy Iron's acting are utterly spellbinding. In that regard, this movie is filled with great performers and they all do their part very satisfyingly. It is like watching good theatre.<br><br>The seemingly unnecessary struggles of a capable man can be seen as a reality check. It is almost brutal to watch our hero suffer because of some petty issues that simply grow big because of either personal inhibitions or neglect. Case in point, Ramanujan's deteriorating health. There are always worldly limitations that tend to plague the best of us. Moreover, Ramanujan lived in troubled times. He was poor and being an autodidact didn't help his cause either. Ramanujan was an exceptional man surrounded by ordinary people who did deeply care for him but hardly understood him. Hardy was probably the only one who came close to appreciating him but had no experience in dealing with such a cultural disparity. The movie doesn't try to gloss over these circumstances. These are some of the things in this period drama that set it apart. I hope the generation that seeks to alter the truth for excitement rather than get bored by the depth of emotion can fathom that.","user":"organicsocial","rank":[62,74]},{"title":"Outstanding script and acting","rating":10,"date":"5 April 2016","review":"An important film; cleverly mixing a love story with the equally deep themes of moral obligations on privilege to raise those without. At first I was concerned I would not be able to disassociate Dev Patel from the role on Marigold Hotel, but after a few lines which sounded too contemporary, he improved significantly. <br><br>Jeremy Irons was captivating and the other roles adequately developed. The direction, pace, setting, wardrobe, story, score -all hold the attention.<br><br>When I watched it, at the end, the audience applauded. In fact at the end of it, one wishes it could last longer - craving more.","user":"alpeshpatel-77898","rank":[69,83]}]