[{"title":"David Gow's Powerful Play Transfers to Screen with Tremendous Impact","rating":10,"date":"11 September 2007","review":"STEEL TOES is yet another low budget, independent film that unfortunately will not find the large audience it so justly deserves except by word of mouth publicity. It is available now as a DVD, complete with significant extra features, and is one of the more powerful statements about hate crimes, understanding intolerance, and the journey toward compassion this viewer has seen. It is adapted from the original play by its author, David Gow, and benefits from the fact that David Strathairn, who created the role on stage in Philadelphia, and repeats his performance on screen, subtly embodies the lead character Danny Dunkelman.<br><br>The title, STEEL TOES, is derived from the name of the combat boots worn by Skinheads, the band of racially intolerant men who strive to re-enact the tenets of Nazi theories. The film opens in Montreal with a group of these warriors, led by Mike (Andrew Walker in a career-making performance) who gruesomely kicks an Indian man repeatedly for no apparent reason except racial hatred. Mike is arrested, placed in prison, and faces a charge of homicide when the hospitalized Indian man dies of his wounds. Danny Dunkelman is the court appointed lawyer assigned to defend Mike. Danny is Jewish and acknowledges a loathing for Skinheads and it is the confrontation between Danny and Mike that polarizes the story between two men who innately hate the symbol each stands for. Danny is a committed humanist and tries to overcome his prejudice by carefully preparing Mike for hi courtroom appearance. Likewise, Mike for the first time begins to gain insight into the misguided life he has chosen, finding Danny a man whose compassion shows through his belief system and is the only chance Mike has for avoiding a long prison term for manslaughter. One key and poignant aspect of the case is the document the Indian man made before he died, a statement of his loss of sight, ability to walk or sit resulting form the brutal beating he received from Mike, and yet it is a call for compassion and forgiveness he makes just before he dies. Danny repeatedly makes Mike read this document until a change occurs - a climax in a story and in a relationship that is one of the more significantly powerful ever filmed.<br><br>This is essentially a two-character story, though in making it cinematically fleshed out some additional characters are added. But the impact of the story comes shining through the economy of the prison cell set and from the impeccable performances by both Strathairn and Walker. It is a brilliant work of writing, acting, directing, filming and sound that bespeaks the strongest aspects of committed ensemble work. It is quite frankly a film everyone who cares about the future of humanity should see. If there is any justice in the industry it will not be overlooked at Oscar time. Highly recommended. Grady Harp","user":"gradyharp","rank":[20,22]},{"title":"Somewhat didactic effort is effectively moving...","rating":6,"date":"27 January 2008","review":"...although auteur writer/director David Gow's adaptation of his own play, \"Cherry Docs,\" most likely packed a stronger punch on the stage. In a nutshell, a dedicated Jewish liberal humanist, Danny Dunckelman (played by the always reliable David \"The Bourne Ultimatum\" Strathairn), is appointed by the court to defend Michael Downey (Andrew W. \"Sabrina, The Teenage Witch\" Walker), an ill-educated lout of a skinhead neo-Nazi who, in a drunken fit of rage, has assaulted and inadvertently killed a Pakistani immigrant. The story centers on the conflict between the two men as they seek to come to terms with each other, and each with himself, as they construct Michael's legal defense. A theme of forgiveness predominates, almost pedantically so, a fault perhaps of the identifiably theatrical dialog. Still, the film is well shot, well acted, and concludes on a reasonable note of uplift and hope. If he can get himself cast in some high-profile roles, Andrew W. Walker will be an actor to watch. Co-director, editor, and cinematographer Mark Adam also contributes a great deal to the pace and look of things, and ought to have a long, successful career. Recommended viewing for those who may need a lesson on the poisonous nature of prejudice, but equally rewarding for those who need reminding of the healing powers of forgiveness.","user":"MrGKB","rank":[6,6]},{"title":"Excellent performance by David Strahairn & most of the cast","rating":10,"date":"17 February 2007","review":"It is a movie that should be required viewing in schools. I was privileged to see it at the Woodstock Film Festival this past year. Unfortunately, films of this caliber that have a vital message rather than providing moviegoers with a thrill a minute \"entertainment\" too often do not receive sufficient funding get them into the local movie houses. The plot is timely and the acting is superb and realistic. I felt that, possibly in order to cut expenses the story was cut short. The \"interplay\" between Danny and his wife, Anna, and Danny and his brother could have been given more attention. Hopefully, the fact that David Strahairn is starring will provide the necessary backing to give the public an opportunity to see Steel Toes.","user":"grogkill","rank":[27,40]}]