[{"title":"Deck the filmmakers....","rating":3,"date":"23 November 2006","review":"Like watching a combination plate of a movie, with elements of every Christmas movie you've ever seen thrown in for good measure. First let's start with one of the flimsiest plot devices ever: lifelong-loser Devito (despite having a blonde, busty wife, uh huh) gets the inane idea to put enough xmas lights on his home so it can be seen from space. This will give him the accomplishment of his life, and make him \"somebody\". Now he has just moved in across the street from squeaky clean Broderick, who happens to me \"Mr. Christmas\" around the holidays. The two begin a war of wills as to whom the town will adore the most. Devito keeps piling on lights, Broderick tries to sabotage it. Now with that storyline laid out, so, so many things come to mind. A), Devito would never get away with the noise and paralyzing light beams shooting into everyone's bedrooms. B), as a car salesman, Devito forges Broderick's name and sticks him with the payments on a new SUV. Now, only in \"movie land\" would Devito not be fired and brought up on charges of fraud. C), let's count the rip-offs of other movies, shall we: xmas neighbors feuding (Christmas With the Kranks); unstable man lighting up his house (Christmas Vacation); Broderick banged around and covered in goop (Home Alone); a VERY badly blue-screened runaway Santa sleigh (Christmas Vaction AGAIN!). Tack on maybe \"the\" most forced, overly syrupy, and utterly rushed endings in film history, Christmas or not, and you have ten hard earned dollars wasted. As the film started it was good to see a couple of former movie heavyweights in a potentially big holiday film...sadly, this adds to the nadir that is still their current careers.","user":"mcfly-31","rank":[34,48]},{"title":"A comedy with no humor...","rating":3,"date":"27 November 2006","review":"...unless you're maybe 8 years old, in which case the sight gags might keep you amused. For a while. Matthew Broderick should be ashamed for getting himself mixed up in a mess like this. He's good at playing straight men, but his deadpan delivery of this lousy script will have you checking your watch frequently. It's a particular waste of his comedy talent, which is well-documented. Danny DeVito once again demonstrates that his career peaked about 10 years ago as he mopes his way through the story. Just when you think you've got his character figured out, he does something that takes you back to square one. Is he a nice guy? A scumbag? A criminal? It could be any of those things, or none. God knows the ending doesn't give you any ultimate idea. I don't really know, and I don't really care. Avoid this film unless you have nothing better to do at the mall except wait for a swollen molar to subside. It's about the only thing that seems less appealing than sitting through this turkey.","user":"Calstanhope","rank":[68,105]},{"title":"Don't believe the bad reviews! This is a FUNNY MOVIE !!!!!","rating":10,"date":"23 August 2013","review":"Very cute movie about two neighbors (Danny DeVito and Matt Broderick) who try to out-do one another as 'The Christmas Guy' on their block by lavishly decorating their houses during the yuletide.<br><br>Lots of great scenes like when newly arrived neighbor Danny introduces himself to Matt and winds up taking Matt's morning newspaper and cup of coffee. Also when Danny can't understand the conversation when Matt starts to \"talk weird\". Kristin Chenoweth is sweet as Danny's wife while lots of charming moments helps make this a holiday staple for the Christmas season.<br><br>Recommended for the entire family.","user":"Matthew_Capitano","rank":[15,20]}]