[{"title":"I love Tyler Perry's films and this is my favorite one yet.","rating":10,"date":"25 January 2010","review":"Daddy's Little Girls is my favorite Tyler Perry film so far. I am a recent fan of Tyler Perry's work my first film being Meet the Browns and ever since I was hooked. Tyler Perry works hard to make his films feel real and he never disappoints. In this film a man is trying to buy a garage while helping his three daughters grandmother take care of them. When tragedy strikes an almost never-ending battle for his children begins. As he must try and get his children back from the clutches of their drug dealing mother he is about to fail. Then a successful yet mean lawyer comes into his life just in time. With her help he might be able get his daughters back and maybe find someone to love just as all hope seemed lost.<br><br>This is probably one of Tyler Perry's most realistic films. It has some humor to help lighten the mood and some nice moments to give you a good feeling of whats about to happen.","user":"zactac","rank":[9,10]},{"title":"It's Real Life","rating":9,"date":"18 February 2007","review":"Unlike one of the other comments I read about Tyler Perry's latest film, I thought this was well done. The violence in this movie is what real life is like. And though, it is not suitable for young children or \"our boys and girls\", there is a reason it is rated PG-13. This isn't a feel-good family and children's movie. Kids 13 and older have most likely seen equal to or more severe fighting walking through the halls of their schools (as have I). And lets be real here - your typical 14 year old freshman in high school kid is not gonna spend $6.75 on a movie called \"Daddy's Little Girls\", am I right? I couldn't agree more that violence is not the answer - there's no doubt about that. But Tyler Perry's movie's are known for real life day-to-day struggles and how to overcome hard times. And if I found out that a drug dealer was beating my 5 year old daughter and leaving dark bruises on her tiny back, I would feel like doing the exact same thing. I'm so tired of cheesy unrealistic movies with dull humor. Thank you Tyler Perry for these films. You are a genius!","user":"ekauffman","rank":[41,59]},{"title":"I Love The Movie","rating":10,"date":"16 March 2007","review":"I guess I am one of the biggest dopes in this country, but I love Daddy's Little Girls. I have seen it three times already. I loved Gabrielle Union and she played the part well. Idris Elba was good too! I liked the fact that Tyler Perry omitted the Madea character this time, nice change. I enjoyed seeing familiar faces in this movie, which added a nice touch. I cannot complain Mr. Perry did a pretty good job and I am looking forward seeing another movie or play. My money was well spent and I don't feel guilty. If you are in the mood for a little drama, comedy and romance, then this is the movie to see. I guarantee you will enjoy it.","user":"jmtwin1","rank":[34,49]}]