[{"title":"A nice, entertaining film, with a lot of neat ideas","rating":8,"date":"25 March 2007","review":"I see it's getting some bad reviews, but I really liked The Last Mimzy. I don't know how much it is like the book, but I liked the ideas the film was based on, the graphics were nice, and it was a new twist on an old storyline (the kids did a really good job acting too). Some people complain it didn't have any action and they \"fell asleep\" - well it's not an action movie, and honestly if you fall asleep, either you're really overworked or you're just not into light mystery and philosophical ideas. It definitely has a \"new age\" touch, it's mysterious, and with a nice bit of surreal/sci-fi - if you liked movies the same pace and style as K-Pax (though this one is a bit more geared towards kids), then you'll probably like Mimzy. I wouldn't suggest really young kids for this one, they might not understand a lot of it - 10 and up would probably enjoy it more.<br><br>Also, the less you know about the movie, the more you'll like it. Don't spend a day reading reviews and looking at trailers. Grab your kids, go to the theater, and see it for yourself with a fresh mind. You'll probably enjoy it as much as I did. :)","user":"realraider-1","rank":[80,89]},{"title":"A Great Family Film","rating":8,"date":"12 March 2007","review":"There are not many movies you can take the whole family to see these days. Our ten year old son really wanted to see The Last Mimzy so we went to a sneak screening last Saturday night. I was very pleasantly surprised that I enjoyed the film as much as I did. My wife liked it even better. Our two other kids (daughter 12, youngest son 7) along with our son had a great time.<br><br>Kids will really be able to identify with the brother and sister in the movie. They seemed very real. The kids' lives at school and their relationships with their parents and teacher seemed true. This is a story about a regular family with all the ups and downs of everyday regular life.<br><br>Then, the story takes off. I don't want to give away anything about the plot because the surprises that gently unfold are what you and your family will enjoy about the movie. There are elements of science fiction and fantasy with nothing extremely intense to scare the kids. It's an interesting story told well with characters you care about. The visual effects are well done.<br><br>I liked that the movie does not talk down to kids to get its ideas across. My wife and I also liked that the language and situations were truly appropriate for a family film. My kids all want to see the movie again and the movie is definitely good enough to see a second time.","user":"reeltee","rank":[133,162]},{"title":"Think \"12 Monkeys\" but a bunny steps in for Bruce Willis","rating":7,"date":"23 October 2007","review":"If I were to come up with a one sentence of \"The Last Mimzy\" it would be: New age tree hugging proselytizing wrapped in a children's film.<br><br>Deploying a panoply of New Age pablums such as the interconnectedness of the universe and a kind of whitebread version of Far East mysticism, \"The Last Mimzy\" is nonetheless fun and stimulating to watch. Anything that can theoretically challenge the dumbing down of my children by the Disney Channel is, frankly, welcome.<br><br>My daughter, a very bright girl if I do say so, was mentally energized after seeing \"The Last Mimzy\" and couldn't stop talking about it. Five points minimum right there.<br><br>The visuals strike me vaguely as derivative of Bucky Fuller's concept of Synergistics or the Dymaxion, concepts which were precursors to his famous geodesic domes - the sum being greater than the parts basically.<br><br>At its best, this film engages the imagination of both adults and children. The premise--a bunny sent back in time to save all of humanity--on its surface seems very silly, but somehow it works. It works because we know intuitively that children are often the only ones with the innocence and purity and that certain clarity of intelligence to communicate seemingly impossible ideas - the faith of a child in action. The people of the future still understand this too.<br><br>I didn't find Mimzy's \"New Agey\" feel overdone and it worked cleverly for its intended premise.<br><br>One thing that was very wrong about the movie was the overt product placement of Intel in a particular scene Though I suspect Intel rarely gets a chance where product placement even makes sense in a movie it was really inappropriate. <br><br>Still, an extremely worthwhile film amid today's teen-oriented drivel.","user":"jantoniou","rank":[33,41]}]