[{"title":"95 minutes of terrific action","rating":10,"date":"5 April 2009","review":"The movie is wonderful, to the point and did not mess-up up with too much story and dialogs. <br><br>The movie shows tony ja's wish to cover the major martial art skills such as Chinese kung fu, Japanese Samurai, Ninja, Muay Thai, Drunken kungfu etc.,<br><br>The fight sequences are brilliant, rough and the art of Drunken fighting is shown perfectly as you will see the real essence unlike that of older movies which have portrayed it as a funny martial art. tony ja's love for elephants is obvious(Thailand's national animal).<br><br>overall 9/10 (-1 if there is no sequel) one can obviously see that even though the movie is tony ja's first direction it is very maturely taken and it's sure that it makes you feel like there should be some more at the end but The movie is unfinished as tony and the producers had some unknown clashes behind the scenes.<br><br>Yet the movie is full of brilliant fights and you will surely be satisfied while expecting for a sequel.","user":"rajeshnaidu_tony","rank":[25,30]},{"title":"gut wrenching intensity, tight editing and entertaining to the last detail","rating":7,"date":"28 March 2009","review":"This followup to the hit Ong Bak has nothing to do with the original Ong Bak, and it seems like the producers were simply trying to cash in on the name, but boy- why did they have to? This movie stands upto itself on its own. Tight editing, lots of superb fight sequences, lots of innovative battle techniques, minimal storyline meaning minimal time wasted on anything but the raw action that we are there to see; all makes it a great movie impossible to miss. You get glued to your seat and wont even blink. Somebody wrote he was bored, which I tried hard to understand- but couldn't. Man, action movies don't get bigger or better than this. Its like Gladiator meets Apocalypto meets Rambo, only better. Raw gut wrenching intensity makes it a pleasure to watch. Don't miss this.","user":"san_iom","rank":[47,61]},{"title":"Epic Martial Arts","rating":10,"date":"6 December 2008","review":"With a storyline reminiscent of Japanese video games and Samurai classics, it is nice to see this genre back on the big screens. The action sequences muscle out the storyline a bit, but they remain quite spectacular to watch. Tony Jaa clearly left a piece of his soul on the celluloid for the next generation to remember him by. The scenes are beautifully framed, full of color and contrast. All I felt that was missing was a control pad between my fingers and the freedom to take the character around the village to search for hidden treasure. <br><br>If the movie leaves you scratching your head a little at the end, you are not alone. However I suspect that it implies that a sequel is in the works and I am in favor for that. It is great seeing the epic martial art films back on the big screen, with a devoted cast ensuring the audience that they will get their money's worth. It is the best film in this genre that I have seen in a good long while.","user":"swampfoxx-1","rank":[76,103]}]