[{"title":"A surprise scary movie with two terrific performances","rating":7,"date":"29 January 2011","review":"Case 39 (2009)<br><br>The clever plot isn't quite clever enough to keep you going through the whole movie, but almost. And both Renee Zellwegger as the passionate and trapped social worker and Jodelle Ferland as the adorable but mysterious child are quite amazing. Both are actors at the best of their powers, Zellwegger limited only by the role and the writing, which is very good but not quite flexible enough to let her show as many of those perplexed and touching nuances she is so good at (seen equally in \"Bridget Jones's Diary\" and \"Nurse Betty\"). But it's possible Ferland has the role of her life here. She's not only playing a precocious child, but is clearly a precocious young actress, bright, expressive, surprising, and not merely cute. By the way she was fifteen when it was filmed, even though she looks and acts, in most ways, like she's ten.<br><br>You can't ignore the plot, of course, since this is a plot driven movie saved by two great actresses, not the other way around. And the story is a little bit of a formula with a twist. The twist is good, but it is singular. Eventually we are carried from a personal and social drama with some evil people to a supernatural drama. It's here where things get scariest, but also where things wobble slightly in terms of believability or logic, if logic has any place here. For example, once the antagonist is shown to have really limitless powers of some kind (possibly imaginary), why does this person not have the power to just kill someone out and out? There is dangled the idea that this bad force depends on fear to proceed, but this isn't developed clearly, or maybe you have to see it twice to get.<br><br>On the other hand, if you just go with the flow, it's really increasingly scary. There are some scenes, like the woman in the hospital room that turns into a kind of large oven, that are chilling and really well done. Certainly Zellwegger's character is able to find the outlines of logic as she tries to survive by outsmarting the situation, and we're on her side. Eventually it comes to a dramatic climax, and it's pretty exciting. A sleeper, for sure.","user":"secondtake","rank":[56,68]},{"title":"Definitely a case of peaks and valleys.","rating":7,"date":"6 November 2010","review":"I found it somewhat difficult to rate this film in all honesty. Some elements are surprisingly good, while others are just cliché'd and melodramatic. I enjoyed it overall and would have given it an 8/9 had there not been various glaring inconsistencies that were impossible for me to ignore. I've never been one to overly obsess about plot holes or implausibilities, but at times Case 39 doesn't even bother to follow the rules that it's made for itself.<br><br>Renee Zellweger plays Emily, a child protective services worker, who ultimately saves a 10 year old girl, Lilly from her abusive parents. She takes a maternal interest in Lilly but problems arise shortly after having removed the girl from her home. At this point, even if you haven't seen the trailer (I didn't), you can guess where the story is headed. This is not a problem because it works in the films favor. The tension and buildup are excellent as we wait for Renee to catch up to where we are. We know what's going to happen and so it creates an uneasiness that stays with us throughout the entirety of the film. There are some genuinely creepy moments ( I think I counted 3), and a host of other cheap \"jumpy\" scenes that sometimes work and sometimes don't. The movie managed to catch me off guard a couple times, and seeing as how I'm a huge horror buff, I'd say that's impressive. More times than not, I can anticipate a scare, but there were some scenes that had me on edge.<br><br>The acting is adequate amongst all the principal characters, the direction choppy in places, the look of the film is beautiful. Once again I just had a problem with the factors that didn't add up. For instance, if a character is what the film says it is, then why can't it get itself out of the situation that occurs at the end of the film? By definition of what this character is, the laws that confine \"normal\" people shouldn't apply to it, right? Also the explanation for what \"it\" wants is very unclear and flimsy at best. Without a clear understanding of the motivation, without an answer to \"WHY?\", it left me feeling a little unstable about the whole story.<br><br>All in all, it's still a great way to spend a couple hours if you can spare them. I consider it money well spent. If nothing else, you will definitely be entertained.","user":"IheartCali5882","rank":[46,59]},{"title":"Nothing great or very memorable, but entertaining","rating":7,"date":"9 April 2010","review":"Case 39 would have been a bit predictable even if the trailer had not revealed the mystery behind its story.For better or for worse, the story is an homogeneous combination of the well known elements we have seen on many movies which show kids involved on paranormal events.However, despite its lack of innovation, I had a good time watching Case 39, thanks to Christian Alvart's concise and dynamic direction and the competent performances from Renée Zellweger, Jodelle Ferland and Callum Keith Rennie.<br><br>There are various elements in the screenplay we have seen in other movies.However, even though the story lacks of originality, Case 39 is entertaining, because Alvart created a good rhythm and some solid moments of tension.What is more, the story is well structured.<br><br>Zellweger made her return to horror with Case 39 after 15 years (since her unworthy appearance on the atrocious The Return of the Texas Chainsaw Massacre).In recent years, she has created a very different image, but her performance in Case 39 feels realistic and effective.Ferland creates a good aura of threaten with her role; I liked not to see her trying to apparent evilness, because that is the point where almost all the child actors I have seen in the past in similar movies fail.And even though he has short screen-time, Rennie brings a good level of intensity to his character.As for the rest of the actors, they feel a bit bland.<br><br>In summary, Case 39 is nothing extraordinary or highly memorable; but I think it is effective for having a good time, and I recommend it because of that.","user":"Argemaluco","rank":[62,85]}]