[{"title":"Consumerism criticism love story.","rating":7,"date":"10 May 2013","review":"First of all, I haven't read the book, which I heard was good. This movie is more of a social commentary on consumerism, particularity in the advertising industry and how everything is about projecting the right image to make money.<br><br>The main story is about two advertising people are attracted to each other, but are they attracted to the image that the other is presenting or the real person behind it? There are some interesting anecdotes on the nature of marketing being presented in the movie, which I find to be the biggest draw of the movie for me. If seen from a \"criticism of marketing\" point of view, the movie is \"deep\". There are layers to the characters and story that requires a re-watch to get everything.<br><br>Overall, the movie achieves what it set to do. The story moves along at a good pace, there were no boring parts. Amber Heard's acting outshines the other actors. The not-so-big budget of the movie shows at times, but it doesn't interfere it from being a good movie.","user":"thebackofmyhouse","rank":[39,49]},{"title":"540th Review: Solid Post-Hipster Business Satire","rating":6,"date":"19 May 2013","review":"Syrup is a clever piece of film based on Max Barry's blacker than black novel about modern business where saying Wharton and Harvard is more important than effort and hard work. In a world where brand image is everything, everything is up for grabs.<br><br>Shiloh Frenandez plays Scat, a guy with dreams but lacking the killer instinct, that is supplied by 6, a platinum blonde who lives for marketing, well-played by Amber Heard - together they look to make a new soft drink and get involved in the ludicrously lucrative world of inter-office politics and global marketing.<br><br>This is good solid satire that just about has enough self-knowing irony to cock a snoot at what it's meant to be doing - and we, as the audience are gullible to be fooled and wise enough to know the fun is being fooled.<br><br>All in all this is a well-made and well-packaged film that doesn't quite get to the heart of the novel - but it's fun and funny and appeals to the post-hipster too cool for school in all of us.","user":"intelearts","rank":[18,25]},{"title":"Brilliant","rating":8,"date":"12 November 2013","review":"Ahhhh IMDb reviewers what is wrong with you people. I sat down to this after reading the reviews (5.5 average) and thought maybe its just another romcom flam which will fill in the evening, it will be nothing much.<br><br>But what I got was an original storyline and an engaging non cloned romcom I never seen before which zinged with ideas and concepts which I am still thinking about 2 days later, that is very rare with films these days. <br><br>As the film went the main protagonists have a great on screen chemistry, the story is an in-depth look at shallow marketing and it does that brilliantly. I really don't have to say more.<br><br>People have a look at this film and don't trust the reviewers who have read the book. I am sure the book is better, but as a standalone film this is very enjoyable. I have just bought another of the authors books as I am eager for more of his views of this time we live in.","user":"john-138-904908","rank":[26,39]}]