[{"title":"Portrayal of degenerative disease SPOT-ON","rating":8,"date":"2 December 2010","review":"Like Maggie, I was diagnosed with a degenerative, neurological illness (with no cure or treatment) in my early 30s, and also met my husband around that time. Hathaway's acting (and the script) captures with devastating accuracy the emotions one goes through when confronting a degenerative illness at an early age, particularly when falling in love (i.e. trying to push someone away/set them free before you become a burden on them; stubbornly seeking independence/avoiding vulnerability, though in real life, you really do need someone to love and take care of you; wanting to avoid the grief inherent in your diagnosis, and particularly, wanting to avoid pulling someone ELSE into that grief; going out and seeking support groups, and feeling empowered by this; getting angry at your partner's refusal to accept what is; etc. etc.) <br><br>I agree that portions of this movie were VERY Hollywood and over the top,and also that it was trying to be everything for everyone (love story,guy's flick, corporate commentary, light-hearted comedy, melodrama,etc.) Regardless of any criticisms, though, I was sobbing like a baby during the last third of the movie. It was just too real, too familiar,too spot-on, and I know that unless people have walked in similar shoes, they wouldn't be able to fully grasp the depth and grief of what was unfolding on screen. In a way, I'm grateful for all the fluff and comedy, because I wouldn't have been able to get through the movie otherwise.<br><br>So I say, overall, this movie was incredible due to its sensitive and accurate portrayal of Maggie's illness, and all of its emotional ramifications. Good job.","user":"carlabag","rank":[87,104]},{"title":"More complex than the trailer suggested, more enjoyable than the poster suggested","rating":8,"date":"1 January 2011","review":"This film surprised me in a good way.<br><br>From the trailer and the posters to be found in many of the bus shelters of our town it would have been fair to have expected a routine rom-com. The pose struck by the leads Jake Gylenhall &amp; Anne Hathaway on that poster just screamed \"knock about rom-com,just like hundreds of others\" It isn't though and that was a pleasant and engaging surprise.<br><br>Jake Gylenhall pulls off the role of super bright but super slacker son Jamie in a high achieving family well and is convincing as a magnetising presence that women find irresistible.<br><br>The absence of Anne Hathaway's character Maggie in the first segment of the film is the first suggestion that this will not be a routine paint by numbers romance and Maggie's introduction sets the scene for the complex character she successfully portrays.<br><br>This film covers a lot of ground and both of the leads are engaging and believable.<br><br>Issues such as serious illness, the workings of the big pharmaceutical companies and their attempts to influence the decision making of medical professionals, the struggle people have to pay for treatment and a believably complex love story are woven in without significant signposting or obvious plot twists.<br><br>Once again, the two lead actors were excellent and overall this made for an enjoyable and engaging film","user":"pedrothefish","rank":[141,178]},{"title":"Expected what I saw in the trailer and got more","rating":9,"date":"9 December 2010","review":"Despite what some may say, Love and Other Drugs wasn't like other romantic comedies I've seen except in the most general of senses, in that it was a romantic comedy. I hadn't seen one set in the environment of pharmaceutical sales or with a main character who had Parkinsons disease, a setting which is very interesting as there are a lot of things wrong with health care and the system today. It gives one something to chew on while watching the rest of the movie.<br><br>There's a lot to like about the relationship between Jamie and Maggie. They have a raw intensity and passion for each other that was a bit much for some viewers, but in my opinion it was there to show how connected they were both physically and mentally. I thought their banter and teasing nature was cute. Nobody got wounded or sulked when teased but just laughed and teased back. The initial attraction between them started as an understanding of each other's loneliness and vulnerability that allowed them to feel like someone else finally got them after easily charming others with nothing more than a fascade. Their relationship had passion, love, and a roller-coaster of emotions.<br><br>There was a scene midway through the movie where Maggie tells Jamie that even though she may have many other moments like the ones that she shared with him that it will never be as special or mean as much to her and my heart wanted to swell because I knew exactly what she meant and what it is like to love someone that much.<br><br>As they grew together, both characters changed and let go of their issues with commitment and love. They tore down the walls they'd built to protect themselves and just let themselves fall. It was beautiful to me and I really enjoyed Love &amp; Other Drugs.","user":"hyprsleepy","rank":[135,179]}]