[{"title":"An Excellent Tribute To The Video Cassette Generation and Film-making","rating":5,"date":"5 September 2008","review":"'Be Kind Rewind' has already become one of my favourite films of the year. It's funny. It's charming. It's nostalgic. It's awkward. It's unique and it's moving. The entrance of DVDs to our lives have lead to the rapid extinction of video cassettes but does one remember the days of renting, collecting and watching those big tapes? Rewinding them and forwarding them? Something small but one that I find fascinating. While 'Be Kind Rewind' pays respect to that generation, it's also a wonderful tribute to film-making in general. All the classic movies and blockbusters this film refers to are some of the most memorable movies that played during the VHS days and, in a way, 'Be Kind Rewind' is a superb homage to those films. Just watch all the sweded 'refilming' of, for example, 'Driving Miss Daisy' with Danny Glover and Mia Farrow, 'Ghostbusters' and 'Rush Hour 2' with Jack Black and Mos Def...and so many more hilarious surprises. 'Be Kind Rewind' also explores what it is about cinema that fascinate the ordinary man.<br><br>Gondry's writing is just as great as his direction. Everything fits together excellently. The comedy and drama blend smoothly. Michel Gondry's screenplay is impeccable. The dialogues are laugh out loud and never out of place. The characters are genuinely heartwarming, goofy and lovable.<br><br>The performances are heartfelt and fantastic. A wacky Jack Black, an endearing Mia Farrow (who's a science fiction fan), a very impressive Mos Def (I was very impressed by his comic timing), a humbly naive Danny Glover, a vivacious Melonie Diaz, Sigourney Weaver as an inspector in charge (with a touch of comedy) and many more talented actors make a terrific ensemble.<br><br>Gondry has tackled a lot of themes like a strong sense of community, people's love for movies, people being accustomed to old technology (as a result to which they sometimes have difficulty moving on to more updated sources), reviving loved artists who have vanished into oblivion and the overall sense of doing something great together (like the last movie on Fat Waller's life). He tells the story skillfully. I liked that it ended on a bittersweet note but somewhat ambiguously. I was having so much fun and laughing out loud so many times that I didn't even care if it bothered other people.<br><br>Many people seem to have trashed this movie because it wasn't like 'Eternal Sunshine Of The Spotless Mind'. I'd like to tell those people to get over it. How can people even begin to compare too totally different films and then call one of them trash for not being like the other? I love both movies and to me, with 'Be Kind Rewind' Gondry proves to be a versatile director and my appreciation for him as a filmmaker has only increased.","user":"Chrysanthepop","rank":[56,73]},{"title":"Fun film, though script is lacking","rating":6,"date":"25 February 2008","review":"Michel Gondry is a very talented filmmaker especially when it comes to visuals. His music videos and films go beyond simple video marvels into a world of simple visual trickery. This is something Gondry is very good at. Furthermore, he has a do it yourself mantra when it comes to filmaking. He's not into the marvels of CGI. He's more into what you can do without it.<br><br>But it takes a little more than visual trickery to make a film a success. Be Kind Rewind is a prime example. The film starts off well enough. Mos Def helps run a video store owned by Danny Glover's character. The store is probably one of the last remaining stores catering to VHS. Jack Black is Mos Def's left of center friend who works at an electrical plant. Through some plan to sabotage the plant, he becomes magnetic, erasing all the tapes.<br><br>Our heroes are forced to re-record the movies and do it through a process called \"sweding,\" producing 10-15 minute versions of the film, using a wide array of do it yourself techniques that Gondry himself has utilized in his work. An example is a simple trick where filming through a fan makes the film look old. All of this is fun. The way the guys try to truncate the film's stories into a little time or their lack of knowledge regarding some films like Driving Miss Daisy. the crude effects are fun and are prime examples of why we love Michel Gondry.<br><br>The downside to the film is the script, penned by Gondry. Clearly, the film is built around the sweded films. But I was starting to think that watching the sweded films would've been more fun than watching Be Kind Rewind itself. Gondry never fully fleshes out his characters or resolves some of the subplots. The visuals are fun, but when Gondry's forced to wrap up the movie, it becomes a little sporadic and we start to realize the the film doesn't go much beyond its rich concept.<br><br>There is something great to take away from this film. And while I have some reservations about the film, my recommendation for the film is based on Gondry's filmaking vision. That is to say, there is clearly a joy of filmaking associated with Gondry that will have me continue to look forward to his work. If you're not sure what I mean, take a look at his promotional materials or at his other short films. The man loves filmaking and has fun with this movie. However, I'd recommend he build an alliance with some good screenwriters that would help his visions become fully realized, and not just good natured diversions, as this film is.","user":"mrtimlarabee","rank":[125,182]},{"title":"Lovely, charming, original and not too sweet","rating":8,"date":"22 February 2008","review":"I missed this film at Sundance, caught it as soon as possible, and I wasn't disappointed. Despite being privy to the exhaustive fine-tuning of an indie film with an improvised feel, watching \"Be Kind\" I could absolutely believe it came together as quickly and spontaneously as the snippets of \"sweded\" films. This was part of its charm and I think Gondry's intention.<br><br>All the actors were engaging, and genuine heartfelt emotion - most definitely by the surprising, naturally pitch-perfect Mos Def - transcended the dialog, plot points and general wackiness.<br><br>The Fats Waller thread was just random enough and very skillfully and satisfyingly woven into the story from beginning to end. This and many other details - including touches like lovely Mia Farrow's curiosity about supernatural films and Sigourney Weaver's brief take-charge turn - convinced me that Gondry put quite a bit of thought and skill into perfecting the film's endearing awkwardness. It might not be to everybody's taste, but I think it was a great idea, executed and seasoned just right.","user":"shomethemovie","rank":[114,172]}]