[{"title":"Ignore the animation for 2010--still good for ages 10 and below.","rating":7,"date":"6 June 2013","review":"First, this film is not available ANYWHERE. If someone knows where a complete version of this is available for sale or streaming, let me know.<br><br>My daughter saw this via a YouTube upload. The first 10 minutes were missing, but she still liked the concept of a place for orphan and lost animals to go and spirit guardians that are shape shifters.<br><br>This is not REAL native American mythology, but rather a child's interpretation of it.<br><br>I only wish I could find a compete version for my daughter who insists on see this even chopped up. I would note that she (at seven) is not unsophisticated in made up mythology films. She is a huge fan of all of Myazaki's films and went as \"Princess Mononoke\" for Halloween.","user":"stanislav-fritz","rank":[3,3]},{"title":"It's OK, but confusing.","rating":5,"date":"13 August 2010","review":"My main problem with this animated film was his story and presentation of that story to viewer. First of all, I don't know anything about native American legends and stories, so I think that anybody who is not familiar with that, will have trouble following this story. They have spend more running time of this film on stupid and many times seen attempts at slapstick comedy, then on explaining story to someone for who is this first contact with this mythology. And story issues are main problem with most of recent animated films; you can't compete with Pixar on visual and animation field, but you can be creative with story, and story development.<br><br>Next thing that I didn't like, was visual style of some characters; they had \"fake\" shading; some shadows and highlights ware simply painted on texture of characters. Even that look kind of good in some situations, and it was in style with overall visual feel of film, but unfortunately it looked weird and bad in most of situations. That made characters look \"artificial\" and lifeless; except few hard shadows, and some direct light, there was little or none visual interaction of characters with environment.<br><br>What I liked, was music witch was nicely composed and made nice audio mood, and I liked animation of characters; some characters ware animated better then others, but lucky there was more good animation, then mediocre or bad one. Good animation of characters kind of fixed bad lighting and texturing, and also made characters interesting.<br><br>So, in the end, this film is nothing special, and if you don't know back story you will be confused. Watch it if you don't have anything smarter to do. <br><br>Story: 3/10 Visuals: 4/10 Animation: 8/10 Comedy: 4/10 Audio: 7/10 Action: 6/10<br><br>OVERALL: 5/10","user":"dejan_kober","rank":[13,31]},{"title":"Fair effort from the little guy","rating":6,"date":"30 January 2019","review":"Don't expect Pixar-sized budget and polish - this is an adequate kids movie from a small studio.<br><br>Impressive list of voice actors filling a typical lineup of characters and worn out tropes, with some hits and misses.<br><br>The animals are generally endearing and cute - except the lizard, who seems to jam in as much throwaway sarcasm as possible - which was initially fine but got tiresome.<br><br>Leans heavily on repeated slapstick gags for laughs (think classic Looney Toons), rather than clever writing. The ol' cactus in the rear gag happened twice in just the first few minutes.<br><br>The overall character development is wide but shallow.<br><br>Lots of zoomy action with some rushed plot (given to us in big gulps by grandpa), but overall, it'll do.<br><br>Whole thing wraps up neatly around 90 minutes. There's definitely worse movies in this genre.<br><br>Initial viewing availability was scarce, but now it's on most major streaming services like Amazon and Hulu.","user":"acentrella4","rank":[1,1]}]