[{"title":"If Kids Wrote Reviews, This'd Be Rated Higher","rating":8,"date":"2 August 2009","review":"I saw this movie with my 2 kids -- ages 3 and 9. Although I can't say I cared for it much, they LOVED it. I've never seen my daughter (the 3 year old) laugh so much or sit so still at a movie.<br><br>As a grumpy adult, I couldn't ignore the irrational plot line. My kids could care less, and they adored the clever funny dialogue and the silly slapstick comedy.<br><br>I'd strongly recommend that adults stay away. I'd also strongly recommend that anyone with kids go see it.<br><br>My rating of 8 is an average. I give it a 4, but both kids give it a 10. That averages out to an 8.","user":"grnth","rank":[73,91]},{"title":"Underrated and Funny Family Entertainment","rating":7,"date":"24 December 2009","review":"Stuart Pearson (Kevin Nealon) heads with his family to spend a summer vacation in Creek Landing, Michigan, with his brother Nathan Pearson (Andy Richter) and his sons and their mother Rose (Doris Roberts) in an old lake house they had rented. When the television has trouble with the image, Stuart's son Tom (Carter Jenkins) and the arrogant boyfriend of his sister Ricky Dillman (Robert Hoffman) go to the attic and then to the roof, where Tom meets his cousin Jake (Austin Butler) and they find the antenna dish totally destroyed. Sooner they discover four alien invaders that are preparing an invasion of the Earth that use a mind control weapon that only affects adults and they lock the quartet in the attic. Now they need to a find a way to force the adults to leave the house and discover the vulnerability of the invaders to plot a defense plan to save our planet.<br><br>\"Aliens in the Attack\" is an underrated and funny family entertainment. I laughed a lot with many moments of this enjoyable story, especially with Robert Hoffman that is hilarious when the kids decide to get even with him using the alien control. The CGI is also good, and Sparks is really a sweet character. My vote is seven.<br><br>Title (Brazil): \"Pequenos Invasores\" (\"Little Invaders\")","user":"claudio_carvalho","rank":[29,34]},{"title":"Hey, this isn't a bad movie for little kids!","rating":6,"date":"12 August 2009","review":"A couple of days ago I took my 11 and 6 year old grandsons to see this movie in Oceanside, California. Suffice it to say that I did NOT decide to go jump off the nearby Oceanside Pier when the film was over. Sure, it's no world-beater. On the other hand, I was somewhat surprised that the movie was better than I had expected.<br><br>Probably most of the criticisms one can read in the other reviews have merit. But over all \"Aliens in the Attic\" is far from the worst kids movie you have ever seen. Obvious, yes, but enjoyable for the little ones. I'll say this, I took these same grandkids to see \"Daddy Day Camp\" when it was out and I was completely disgusted and disappointed by that turkey. \"Aliens in the Attic\" is a couple of notches above that one. At least there are no exploding outhouses or questionable values modeled by adult characters.<br><br>No doubt taking little kids to the zoo or going for a walk in the woods would be better for little kids, but if you get stuck for something to do this summer you should not feel hesitant to take them to this film.","user":"bill-790","rank":[43,53]}]