[{"title":"'Brothers' showcases strong, solid performances","rating":8,"date":"23 February 2010","review":"Based on the Danish film, Brødre, Tobey Maguire plays Sam Cahill, a marine who goes off to Afghanistan and allegedly is killed in action. His brother Tommy, played by Jake Gyllenhaal, an ex-con, winds up looking after Sam's wife, Grace (Natalie Portman) and her daughters. As the story moves on, Tommy's negative attitude toward her and his outlook changes and their relationship develops. When Sam, who is found to be alive, returns home, there's a mixture of both joy and resentment among the characters, but to add, Sam has returned a changed and psychologically-damaged man.<br><br>The film mainly focuses on the family drama and relationships of the characters, inter-cut with scenes of Sam in action and imprisoned/tortured in Afghanistan. The progression of the plot takes its time to develop, but it feels organic. The characters feel real. While one could see the film as a criticism of war and the negative effects that war has on the family of veterans, the film is more a character-driven drama, and doesn't touch much into politics.<br><br>Admittedly, the plot itself isn't anything drastically new and one may imagine a plot like this in a made-for-TV drama if not for the emotional depth, intensity, and solid performances from Tobey Maguire, Jake Gyllenhaal, and Natalie Portman. One of the interesting plot points involve the brothers' father's (in a fine performance from Sam Shepard) favoritism for Sam, while looking down on Tommy as the \"failure.\" The love/hate dynamics between the three are interesting and believable even as the two brothers go through drastic character changes.<br><br>Tobey Maguire's performance is particularly noteworthy as Sam, a marine and a loving husband who comes back transformed into a physically emaciated, psychologically-scarred, ticking time bomb. My image of Tobey as Spider-Man now feels like a distant memory especially in comparison to what he portrays here. The two children who play the two daughters of Sam in this film give very natural performances in their varied reactions to difficult situations around them. Jake Gyllenhaal does strong work as Tommy, whose character transformation makes us want to root for him, despite his shady beginnings and flaws. To top off, Natalie Portman is radiant here, turning in a poignant, complex performance as a mother of two, who must deal with the initial mourning of her husband, the joy of his return, and the messy aftermath. Ultimately, her nuanced performance is the glue that holds the film together and make the other characters matter, and one can't help but marvel at the maturity of her performance.<br><br>Directed by Jim Sheridan (The Boxer), this film is a great showcase for all performances involved, while portraying an engaging, intense story about familial loyalty, redemption, and difficult relationships. In the wrong hands, this film could've gone the route of the by-the-numbers Hollywood cliché, but as it is, it remains a solid drama. I give Brothers *** out of **** stars.<br><br>More of my reviews are update on http://twitter.com/d_art","user":"d_art","rank":[51,60]},{"title":"Did anyone know that Tobey could act?","rating":10,"date":"12 December 2009","review":"What drew me to this movie was the cast of Jake Gyllenhaal and Natalie Portman, two phenomenal actors in their own regards. The only expectation that I had going into see this film was that I would be unimpressed by Tobey Maguire. Having seen him in several films (including Spider-Man), I must say that I wasn't prepared for the incredible performance he provided.<br><br>This movie was very simplistic. Nothing flashy, no real special effects, small amounts of simple guitar music as a soundtrack. But it conveyed a whole roller coaster of emotions from the beginning. The growth of Jake Gyllenhaal's character, the anguish displayed by Natalie Portman, the palpable pain and suffering by Tobey Maguire, and the fear and anger displayed by the eight-year-old Bailee Madison all combine for a very gripping tale.<br><br>Many regard this movie as anti-war. I simply do not see it as such. Soldiers are praised for their heroism on the battlefield (which they completely deserve), but all too often the wounds they suffer physically and mentally are disregarded. This movie illustrates the very real problem of the mental health of our service men and women, and the problems it causes in family dynamics.","user":"sclark-41","rank":[220,281]},{"title":"Powerful movie, great individual performances, a few flaws","rating":7,"date":"5 December 2009","review":"The trio of Jake Gyllenhaal, Tobey Macguire and Natalie Portman got me very excited for this film, and from an acting standpoint, they did not disappoint. The script gives Macguire the most to work with as the family man/Marine, Sam Cahill, whose latest trip to Afghanistan sees him imprisoned by the Taliban and ultimately returned to America with some serious psychological issues. While he is MIA, his wife, Grace, (Portman) and ex-con brother, Tommy, (Gyllenhaal) are told he is dead, and the two grow closer, eventually verging on emotional and physical attachment.<br><br>Ultimately, the movie is an emotional ringer. Sam returns to a family that wants to love him, but his walls are up, he's been through a lot and its his brother the fun loving Uncle Tommy who Sam's children want to play with. A quick note, Sheridan the director makes great use of the two daughters as comic breaks in otherwise terribly tense situations. Our theater was laughing at the kids and it felt to me, as though we needed that laughter to balance out the gloom. There are a few climaxes, some extremely tense family dinners and finally a final gripping scene where Sam is pushed to the brink, he distrusts his wife, assumes his brother is sleeping with her, and no longer can see the humor in his elementary aged children, can he hold on?<br><br>Its a touching film and a sad film, but it probably could have been a bit better. The script and title of the film suggest a big tension or interplay between the brothers. I found the brother relationship lacking in substance, and I thought the ingredients for some serious tension and emotional pain were in place but were never put to use. Sam Shepard does well as the Vietnam Vet father, but all he really does is establish his love for his son, the Marine, and his disdain for his son, the ex-con. There was so much more that he could have done, his role seems intentionally diminished. Portman is great as usual, but arguably miscast, as she doesn't belong cast into a film where she is not supposed to think. She's a thinking woman's actress and here she is left observing, we know she knows, but her character must play it clueless.<br><br>I cried, and wanted the story to continue, as there seems to be a bit left to this story when the film fades away. Both signs that the movie was enjoyable and touching. The growth of Gyllenhaal as the ex-con who is on the rise, adjusting to life on the outside and acting as a surrogate father in the absence of Macguire is nicely juxtaposed with Macguire's devolution into post-traumatic stress ridden torment. Watch the Oscar nods roll in, but I think, if anything, the movie may win individual awards, as the product as a whole falls quite a bit short of award winning status.","user":"ericjams","rank":[143,180]}]