[{"title":"Eye Candy","rating":6,"date":"12 February 2012","review":"WHAT'S YOU NUMBER? is a flimsy bit of fluff based on the novel '20 Times A Lady' by Karen Bosnak and transformed for the screen by Gabrielle Allan and Jennifer Crittenden. It is a very light comedy that has some observations about today's dating/quasi-relationship scene, but those impressions are a bit too true to be funny, so it is best to just concentrate on the film as a diversion of the kick back, put feet up, and giggle along with it genre.<br><br>Ally Darling (!) (Anna Faris) has a history of having many ex-boy connections who turned out to be losers. Reading an article that offers number amounts for judging sexual encounters (Ally has exceeded the norm) she freaks and believes that she can't find THE good guy. Deciding to reevaluate her ex-encounters searching for Mr Right, she decides to look up all of her exs to see if any of them have changed for the better. Finding this task daunting she turns to her apartment neighbor Colin Shea (Chris Evans), a would-be musician who sleeps with women every night and sneaks out the morning after to avoid relating to them, to act as her detective. The rest is a contrived series of ups and downs of the manhunt that has few qualified candidates. And the end is predictable.<br><br>For once Anna Faris has snagged a role that shows her talent (and fingernails-on-the- blackboard voice) and she looks terrific. But the biggest treat in the film is Chris Evans appearing in the buff often enough to keep the movie on: not only does he enjoy his Adonis body but he seems happy allowing it to buff up an otherwise routine comedy part. There is another attraction in the wings - Oliver Jackson-Cohen - who seems to have a future in film. Tuck in the always reliable Blythe Danner and Ed Begley, Jr and this is a cast worth an evening's outing. But the treat on top of the confection is the eye candy generously shared by Chris Evans. <br><br>Grady Harp","user":"gradyharp","rank":[24,29]},{"title":"What's your angle?","rating":6,"date":"3 April 2012","review":"I know I shouldn't have liked or enjoyed it. Especially because I'm not really a big fan of Anna Faris (as an actress that is). But you can't fault her in this one. She really gets the most of many scenes (as stupid as they seem and feel like). And while this isn't really something that should be accounted for (as a positive), it really is nice, that it does not pull any punches (talking about the R-rating, although there is a longer cut to be released later on).<br><br>Of course you know where this is heading and while the ending again might fall short of all the swagger that has come up to that point it still feels like a nice comedy. Or should I say \"raunchy\" instead of nice? But both words fit the bill here. Both lead actors are obviously having fun and it translates and really transcends to the viewer. Not comedy gold, but entertaining enough","user":"kosmasp","rank":[17,20]},{"title":"The Best Movie Katherine Heigl Never Made","rating":8,"date":"2 October 2011","review":"\"What's Your Number?\" follows the standard Rom-Com formula as all the other Katherine Heigl or Jennifer Aniston movies that came before it. The only difference is this one is actually funny and has a bunch of laugh out loud jokes.<br><br>The reason this film is so much better than the other R-rated Rom-Com's is that Anna Faris is a true comedienne and is not afraid to show a little butt-cheek to get a laugh. She is essentially the whole reason to see this film.<br><br>Chris Evans, Blythe Danner, and Ed Begley Jr. make up the fine supporting cast. The jokes are mostly foul, crude, and unsophisticated but the audience at my showing was laughing throughout most of the film. The ending gets saccharine and sentimental at the end, but most of these types of films do that.<br><br>If you have felt cheated by the films of Jennifer Aniston and Katherine Heigl, you should check out \"What's Your Number?\"","user":"brenttraft","rank":[61,85]}]