[{"title":"A Brutally Honest Review","rating":8,"date":"29 June 2012","review":"You will find reviews here using thousands of words in order to flame this movie, clearly they didn't understand it. You will know why after seeing it.<br><br>People are disappointed because they wanted to see an Eddy Murphy style comedy, the problem is this ain't a comedy it is a drama with a very good message. I loved Eddy Murphy in his first movies, he was a fast talking joke machine, he still is but the jokes are the same and comedy has moved on. For that matter I didn't like the comedy portion of this movie too much but I was deeply touched by the drama version. The solution to his problem is right in front of him and anyone who is willing to give this movie a fair chance will see it too and exactly this is what made the movie so strong because he is doing it all wrong and you want to scream at the screen and tell him what to do and how to do it.<br><br>In my opinion Eddy Murphy gave a partially brilliant performance. As I said I didn't enjoy the comedy too much, it was some sort of best of Eddy Murphy but when you are willing to accept that this is actually a drama and understand the comedy part as the metaphor that it is you will love this movie and maybe pull something valuable out of the message. For the concept of the message Eddy Murphy was the best possible actor for this role.","user":"alex-frey-pattaya","rank":[75,88]},{"title":"Comedy okay, Message is good","rating":7,"date":"12 March 2012","review":"Let's face it Eddy Murphy hasn't been making grade A movies over the past few years, at least none that matched his earlier films. So I can't help but admit that I was a little skeptical when I saw A Thousand Words advertised on T.V. To my surprise however, I was actually entertained with this picture, and even more surprised by the serious message present in this film. So sit back, relax, and read more about Eddy Murphy's newest film A Thousand Words.<br><br>The movie basically starts out like any other movie he stars in with Eddy Murphy, playing Jack McCall, being involved in some busy career and the rest of his life is essentially put on hold. As usual, these opening scenes are filled with his classic crude humor, some of which was funny for me and some I had heard countless times before. Murphy's mouth is as filthy as ever, and those who love hearing him scream and curse will not be disappointed at the majority of his dialog at the beginning of the movie. However, things change when the guru Sinja (Cliff Curtis) is visited by McCall and the blood bond between a magical tree and McCall get his thousand word limit, where every word he speaks (and writes) results in a leaf falling off the tree. From this point onward, the comedy style takes a different path and involves a combination of funny dialog, situational comedy, and of course some funny gestures that made me chuckle. With a limited number of words at his disposable, the writers did a nice job picking the right words at the right moment. There were countless times I laughed as he said one or two words at just the right moment to have me laughing. Instead of Murphy saying most of the funny lines though, his apprentice Aaron (Clark Duke) provided most of the zingers. Duke manages to once again play the naïve, immature teenager who knows how to say the wrong things, at the wrong time, in the most awkward way possible. As a result it works, though it does get annoying after the fifth or sixth time. What was funnier for me however, were the comedic situations Murphy's character was forced to endure. A few charade scenes, the escort of a blind man, and countless business meetings that required him to speak made me crack up at various points in the movie. <br><br>However, comedy is not the only thing this movie has to offer. A Thousand Words has a message built into it that really hit me deep down. Now revealing this message would ruin a lot of things about this movie, so I can't tell you what it is. The way they presented the message is free game though, and quite well done. I applaud the director's brilliant technique of building up the tension in the movie using temporary lulls in the comedy to develop the situation. When the limit is reached however, the group manages to capture the emotions with a combination of fitting music, great camera angles, and just the right balance of screen time to capture the actor's emotion. Murphy surprised me with how serious a role he can play and I admit there were one or two times I nearly teared up. Yes there were points where this movie was a little preachy and cheesy, but overall it tugged at my heart strings and made me really appreciate what they had to say. However, it's up to you to see the movie and see if the message affects you the same way. <br><br>Overall, A Thousand Words is a decent comedy, not the best or the crudest mind you, but still decent. The nice balance of drama and comedy, on top of some good character development and clever use of props and the environment were very entertaining for me. Yes, it's the same predictable Eddie Murphy movie you have seen in the past, but it's finally getting back to his comedic roots, while still providing some dynamic emotion that I haven't seen him do in a while. Is it worth a trip to the theater? Well for comedy not really, you can get the fun laughs just as well at home. However, the strong spiritual message this movie offers I think is worth a trip, but that's just me. Regardless here are the scores:<br><br>Comedy: 6.0 Movie Overall: 7.0<br><br>So as always enjoy the movies my friends and tune in next week for a review on 21 Jump Street.","user":"rgkarim","rank":[70,84]},{"title":"A more mature comedy from Eddie Murphy","rating":7,"date":"15 June 2012","review":"I have to assume that the people who rated this one below a 5 were expecting the standard slapstick fare. This isn't going to go down as a classic film, but it kind of picks up from \"Holy Man\" from 1998 in that the movie is about an unexpected encounter causing someone to re- evaluate and embrace their life.<br><br>Murphy does a pretty good job straddling comedic and dramatic acting. It's more like one or the other rather than both in the same scene, but it's not bad. The supporting cast is pretty good as well. The writing is decent enough.<br><br>What made me give this a 7 instead of a 6 is the ending. You pretty much know what's coming - that Murphy's character will resolve the issues which keep him from being happy. But the last 8 minutes or so are just really well done. Murphy's warmth really shines and you can't help but smile. And for that ending, I gave it an extra star.<br><br>Put this in the \"feel-good comedy\" category.","user":"gonzoville","rank":[43,52]}]