[{"title":"Entertaining. Isn't that what these films are meant to be?","rating":6,"date":"7 May 2008","review":"By now, we all know the formula of a romantic comedy. The basic framework revolves around a guy meeting a girl, a love triangle, a little white lie and an event that causes them to split before the soggy finale where they kiss and make up, living happily ever after. If you go into a rom-com expecting much more or something that deviates from that path, you'll probably be disappointed. After bar setting movies like When Harry Met Sally, Sleepless In Seattle and Four Weddings and a Funeral, the constant stream of lazy efforts in recent years can cause one to be seriously jaded by the genre. So it is with this skepticism and desire to switch off my brain, that I pop Over Her Dead Body into my DVD player. It is apparent from a mere glance at the synopsis that this film will not last long in my memory, change my life or be any kind of profound filmic experience for me, but I was entertained. The script was amusing, the delivery from the four leads (Bell, Rudd, Biggs, Longoria) precise and well timed. The premise was an interesting spin on an oft used plot device.<br><br>So what's not to like? An entertaining, funny and endearing romantic comedy. At best, a competent entry into the genre, quite a way ahead of most of it's type and at worst, a movie that feels like a sitcom without a laughter track. As someone who likes sitcoms, that isn't a particularly bad thing. In a nutshell, you could do a lot worse.","user":"filmbuff20","rank":[33,42]},{"title":"It starts out a bit boring, but picks up pace though, kind of","rating":6,"date":"17 May 2008","review":"Over Her Dead Body was a nice little movie, in general, that wasn't meant to be a masterpiece, but is just for enjoyment when you have nothing better to do, or are going to watch/see a so-so movie with your significant other. It was decent and entertaining, and pretty funny, and by pretty funny I mean there were some little giggles here and there.<br><br>There were a few clichés, but I don't really care about that. I found most stuff fresh. At first, I didn't think it was going to be good at all, when it started out. If you can get past the first twenty minutes though, the movie starts getting more interesting. This film wasn't burst out in laughter hilarious, like I said, and wasn't \"oh my gosh\" wonderful. It was just a movie that you can sit down and enjoy for how enjoyable it was meant to be.<br><br>I could understand why some may hate it and think it is very mediocre, but as the lenient movie reviewer I am, I found myself lightening up on it and just having fun, mild fun, but still, fun. There was nothing horrible enough about it to give it a 1/10, in my honest opinion, which that is what a lot of people gave it.","user":"Dragoneyed363","rank":[29,40]},{"title":"I did like it","rating":8,"date":"4 February 2008","review":"Look it's Eva Longoria and Paul Rudd in a movie about a dead girlfriend haunting the new girlfriend. It's Gabrielle from Desperate Housewives and the guy who wore \"sex Panther cologne\" in Anchorman. If you are expecting a Golden Globe nominated movie then you need to rethink how you look at movies. However, if you are willing to suspend reality for 90 minutes and want to watch a funny movie then you've come to the right place. The characters are all funny. They work together very well. The real match up is Paul Rudd and Lake Bell. He's as funny as he was on Friends and she was funny and good looking all at the same time. I went with my wife, she enjoyed it and so did I.","user":"joelsallee","rank":[43,62]}]