[{"title":"Cure for Seasonal Affective Disorder","rating":5,"date":"9 February 2008","review":"For the life of me, I cannot figure out why this movie is getting as lousy reviews as it is. I walked out of the theatre quite pleased; even if this movie will not get an Oscar, it earned the price of my ticket. It's campy, silly, and bright, and there is nothing like a fluffy romp around the sunny islands to cure those winter blues.<br><br>Admittedly, it's a contrived, predictable mystery, but that proves to be the focus rather than the romantic comedy that was promoted. But in the spirit of Nancy Drew and the Hardy Boys, it's a spunky predictable mystery. No, the characters were not all complex, but at least the powers that be went to the trouble of making them entertaining and personable.<br><br>I liked the idea of looking for sunken treasure. I liked the upbeat island soundtrack. I liked the funny characters. I liked the pretty scenes and the silly lines. I liked the random explosions and fight scenes, as pleasantly ridiculous as they were.<br><br>Kate and Matthew have the chemistry they had in \"How to Lose a Guy in 10 Days\". They have the sunny dispositions to pull off a mindless-but-fun storyline and to work with a wacky cast.<br><br>It's mind candy in all its fluffy goodness.","user":"mollymormonbrat","rank":[165,202]},{"title":"Not as horrible as everyone says","rating":5,"date":"9 February 2008","review":"I found this film \"cute\" and \"silly\". Don't go to it and expect the best film of the year, but rather something fun to watch during a date. I went and saw this last night with a friend who did not want to see it...at all. In the end he said he did enjoy it after all.<br><br>There is a little bit of a \"Dupree\" feeling towards the character Finn who is irresponsible and far from mature. His character is charming in a goofy way. He seems to mess everything up, but somehow in the end it all work out.<br><br>I did not care too much for the character Gemma, but nonetheless I laughed at her idiotic comments because I have met people as naive as her. She's basically a miniature Paris Hilton at sea who knows nothing about the sea.<br><br>I wouldn't describe this movie as thrilling, but it was entertaining. The comedy is shallow here and there. However, there are some incidents that will make you laugh and laugh. If you want to see a light hearted film that'll make you smile and giggle then I'd recommend seeing this.","user":"Lark_Pash","rank":[123,164]},{"title":"entertaining","rating":9,"date":"16 April 2012","review":"This movie was exciting, entertaining, and a good blend of romance, adventure, drama, and entertainment. Matthew McConaghey and Kate Hudson are a newly divorced couple who learn that a treasure they've been after is off the coast of Key West (thanks to Mr. Mac), and they take a cruise ship to go get it. My favorite scenes are the divorce scene, the diving scenes, and the scenes with the rich, air-headed rich girl. McConaghey is heavily in debt to a murderous rap star, which is why he is after the treasure. After a slow start, this really picks up and turns into a decent movie with gorgeous settings and lovely underwater photography and good cast chemistry. I loved it.<br><br>*** out of ****","user":"mattkratz","rank":[18,21]}]