[{"title":"False Marketing","rating":10,"date":"22 August 2019","review":"Near the end of the film, Driver phones the antagonist, Bernie Rose (Albert Brooks), and says: \"You know the story about the scorpion and the frog? Your friend Nino didn't make it across the river.\"<br><br>The fable of \"The Scorpion and the Frog\" goes like this: A scorpion asks a frog to carry it across a river. The frog hesitates, afraid of being stung by the scorpion, but the scorpion argues that if it did that, they would both drown. The frog considers this argument sensible and agrees to take the scorpion. The scorpion climbs onto the frog's back and the frog begins to swim, but midway across the river, the scorpion stings the frog, dooming them both. The dying frog asks the scorpion why it stung, to which the scorpion replies, \"I couldn't help it. It's in my nature.\"<br><br>This is the underlying moral complex in Nicolas Winding Refn's 2011 unconventional action drama, Drive. Driver, played by brilliantly by the memorable Ryan Gosling, is the frog; like how the frog is eventually drowned because of the scorpion's nature, Driver is eventually \"drowned\" because of the criminals he helps. Note how the scorpion he wears, which is emphasized repeatedly throughout the film, does not represent what he is, but rather what he carries on his back. We can then deduce that Driver's true nature is, in fact, good (for lack of a better word), but dragged down by his surroundings.<br><br>Refn occasionally adds a few touches to support these themes. Irene's son, Benicio, is watching cartoons in an earlier scene and Driver asks him if he thinks a character is a bad guy. Benicio replies, \"Of course, he's a shark,\" to which Driver responds, \"So there aren't any good sharks?\"<br><br>While Driver is confined in a criminal world he despises and feeds on at the same time, he attempts to break free by finding something good in Irene and her son. Their conversations are often awkward with long pauses in between (a common criticism of this film), but not without purpose. Notice how Driver doesn't wear his scorpion jacket especially during these occasions, metaphorically exhibiting his shyness and uneasiness in such situations. This indicates his adaptation to a happier world is a difficult one, with obstacles along the way, Irene's husband/ex-convict, Standard, representing one of them. Capturing the relatable embarrassment of getting to know someone, Gosling and Carey Mulligan display breathtaking chemistry here, walking the fine line between adoration and apprehension. Yet, when Driver wears his jacket, he turns into a vicious, stone-cold killer.<br><br>In quite possibly one of the most transcendent scenes of the century, Driver must finally accept the truth that he can't assimilate with the rest of society. His nature and situation does not enable him to do so, no matter how hard he tries. Hence, the infamous elevator sequence. A hitman has been sent to murder Driver, and Irene has just rejected Driver's offer of running away with him and the money. The three of them meet in the elevator. Driver then realizes he can't hide the other half of him, and before brutally slaughtering the hitman, moves Irene to the side, and kisses her, knowing it will probably be the last time they'll see each other. Refn's slow motion, perceptive intuitive rhythm, and atmospheric lighting transforms an ordinary romantic embrace into an absolutely breathtaking experience, and considering the context of the film, one of the greatest climactic self-realizations ever put to screen. That moment Driver saw the hitman, he knew he can't ever have Irene. He knew the next few seconds will most likely be the only time he could ever be truly happy again. He knew, that after Irene sees his other half, everything will be over.<br><br>And it was, for the most part. Driver proceeds to decimate the rest of the scorpions, and as he drives off into the night, leaving the money behind, we're left to wonder if he dies or not. Such ambiguous endings are often debated if they're necessary or not, and I would dare argue a conclusive ending would have been more satisfactory. After all, if Driver dies, it completes the metaphor that the scorpion and frog fable started. But it begs the question: is Driver somehow different?<br><br>Despite its ingenious thematic finesse, Drive's strongest aspects transpire more technically. As previously mentioned, Gosling's execution is just a masterclass in restrained performance; working on the paradigm of talking so little, yet saying so much. His eyes are energetic yet longing, shooting glances that make you feel scared and sorry at the same time. He absolutely rocks the outfit too, and I can't think of a single actor today who could have delivered a more convincing performance than he did.<br><br>But of course, there is no Drive without its soundtrack. Johnny Jewel of \"Desire\" and the \"Chromatics\" assembled a magnificent score, both atmospheric and memorable. Nostalgic in its 80's vibe, and overwhelming in its synthesizers, boundless in its elusiveness, Jewel's creation is something so unique and extraordinary that the feeling expressed is so beautifully indescribable. \"Nightcall\" by Kavinsky is about a girl that embraces her ghost lover despite his robotic behavior, \"Under Your Spell\" by Desire is a haunting introspection of Driver's powerless control over his own mind (\"I do nothing but think of you\", \"you keep me under your spell\", \"do you think this feeling will last forever?\") , and \"A Real Hero\" by College is Driver's transformation into \"a real hero\" and \"a real human being\". Brilliant.<br><br>Unfortunately, masterpiece is an overused word, and thus unfitting for Drive. Jewish mobsters Bernie and Nino are typical single-minded personalities, stereotypical villains we've seen in commercial gangster/crime films in the 90s. Shannon also somewhat acts as a service to the plot, but at least he can represent the little friendship Driver has. Flimsy and not fully realized, these criminals fall flat compared to the protagonists in Goodfellas (1990) and The Godfather (1972). If these characters were given dimensionality and more time to develop, Drive could have easily become the masterpiece it never was.<br><br>I think why Drive is so underappreciated among the general audience is due to marketing and preconceptions. The trailer takes practically all the violence and gore present in the one and a half hour runtime and compacted it into two and a half minutes. It is perhaps the worst false advertisement I've seen for the last ten years or so, as audiences will walk into the theaters thinking Drive is a simple Friday night crime/thriller with car chase sequences and a conventional story. Ryan Gosling too! When viewers realized they were wrong, they didn't hesitate to look for hidden context or metaphorical meaning, and instead simply dismissed it as a poorly made film. Of course, I'm not talking about all moviegoers, but I'm certain a vast majority had a thought process similar to this.<br><br>Nevertheless, Drive will stand the test of time. I'm sure of it.","user":"Wesley-Wang","rank":[185,198]},{"title":"Why Are Some People So Dumb?","rating":27,"date":"27 September 2011","review":"One reviewer here suggested that instead of seeing Drive you should see what Drive was aspiring to be Layer Cake. Drive is nothing like Layer Cake nor even tries to be. They have nothing in common, and the comment is just absurd. It is a far far better film though. From it's title sequence written in cursive pink (which a ton of idiots just did not get for some reason) to it's retro soundtrack. It is a picture perfect reflection of the films from the late 60's, 70's and 80's. If you have not seen films from this era (i do believe so many reviewers here have not) you will not entirely get this film.<br><br>This is a man with no name film. Instead of horses and cowboys we get fast muscle cars and ruthless gangsters. Our hero is a man with no name. He is also a man of very few words that can break out into fits of extreme violence at any moment to protect those he cares about. We get no back story to our hero just like the Eastwood pictures, which makes the film even more effective. He is not your typical Vin Diesel blabbering idiot action hero. He is an old fashioned action hero. Too many here did not understand this, and decided this was bad acting/directing. It is far better to imagine what Gosslings character has done to arrive at this point, than to be shown in some cheesy flash back sequence. Albert Brooks (who is just fantastic as usual), Ron Pearlman, and Bryan Cranston all provide nice contrast to our quiet hero.<br><br>Another reviewer here stated there was no explanation for the second car at the pawn shop. Well there was. I will not give it away here, but you will find the answer in the motel sequence. The violence has also been hated on here, but it is just part of the world he lives in. The fact that he can be just as cruel as the gangsters adds to the mystery of his character.<br><br>Not one negative review is credible. Unless you were raised on Transformer and Fast and Furious pictures. Then I guess you would need more CG, louder music, and bad duologue so you could understand the film easier. Or maybe you just need more imaginary computerized cars doing spectacular things on screen to hold your attention. The fact is this is a fantastic film, filled with great performances, and some of the best chase sequences since bullet. Be smart see films that matter.","user":"pattonfever","rank":[1,2]},{"title":"A Captivating Mix Of Contemporary And Retro Aesthetics","rating":4,"date":"4 July 2014","review":"'Drive' is a visceral and brilliantly executed vision of art-house action; possibly one of the greatest art-house films to have graced the screen. Nicolas Winding Refn has created a stylised neo-noir thriller that is simply stunning; full of glorified violence and stroking imagery. The soundtrack is amazing, fully reflecting the films mood, whilst attempting to create an atmospheric feel to accompany the gritty action. 'Drive' is a captivating mix of contemporary and retro aesthetics. A stylish and taut thriller that keeps the audience entertained from start to finish with breathtaking sequences, brutal violence and stunning cinematography, a modern masterpiece that has truly redefined the noir genre.","user":"CalRhys","rank":[176,231]}]