[{"title":"Cheadle Shines","rating":6,"date":"22 March 2016","review":"The life and music of Miles Dewey Davis, better known as Miles Davis, is on display in the new bio-pic, Miles Ahead. Don Cheadle wears as many hats as afforded to him playing the title character as well as appearing in the credits as producer and director in a film that showcases Cheadle's talent and offers a strong case in ensuring the Oscar's have some color on the stage at next year's telecast.<br><br>The film opens in the later years of Miles' life. He has already reached fame and fortune. But his drug addiction has turned him into a Howard Hughes recluse. And he has temporarily turned his back on music. The story opens with Miles alone in his home when he is aggressively approached by Rolling Stone magazine writer Dave Brill (Ewan McGreggor) who is interested in writing about Miles' new project. The opportunistic Brill gets swept into a fantastical series of events that include following Miles as he confronts his record label, procures cocaine and is chased through the streets in a hail of gunfire by unscrupulous folk looking to advance their worldly standing through the theft of Miles' still-in-progress demo tape.<br><br>The events that unfold are not based on historical fact. But it doesn't matter. Miles Ahead is more a movie about the attitude and persona of legend Miles Davis than it is a straight up account of a fraction of the musician's life.<br><br>By way of flashbacks, we get a glimpse into the more serene life of Miles Davis before drugs off-tracked his career. A clean cut Davis is seen rising in ranks through the Jazz clubs of America and eventually falling for Frances Taylor (Emayatzy Corinealdi) who would eventually become his wife of 10-years.<br><br>The film doesn't dive too deeply into the domestic violence between the two lovers that became headlines back in the early 60's nor does it touch too intensively the racial tensions in America at the time. There is a scene where Davis is unprovokingly harassed by police officers and taken to jail for simply showing kindness to a woman of white skin, but the film has no message to present in terms of Miles' involvement with racial divides at the time. Instead, Cheadle keeps the camera focused on a single day in the broken down icon's history. This works largely to the films advantage but sacrifices giving us a glimpse into the life of the historic character.<br><br>Don Cheadle is a revelation as Miles. The raspy voice, the trumpet playing, the belligerence. All are played exactly on key. The supporting cast does amply in tow but there is little to look at outside of Cheadle's performance.<br><br>For this particularly story, things do work out well in the end. Relatively. We had hoped for end credit title cards that would have told us more about the man. Those unfamiliar with Miles Davis might have wanted to know if he was still alive or what became of Frances Taylor after their split. Even a short blurb unveiling Miles' nine Grammy Awards would have been refreshingly educational at film's end.<br><br>Miles Ahead is not the be-all of musician movies. But I would categorize Cheadle's performance of the late trumpet player as one of the better performances of a real-life musician on screen. It's good enough to recommend the film to anyone. Jazz fan or not.","user":"gregsrants","rank":[33,40]},{"title":"a trippy trip of cool Miles","rating":6,"date":"14 April 2016","review":"Greetings again from the darkness. What would rate as the bigger challenge: defining jazz or describing the life of Miles Davis? In true \"passion project\" mode, Don Cheadle not only portrays the iconic trumpeter, but also directs, co-writes and co-produces. Cheadle's tribute to The Prince of Darkness is as open to interpretation as the hundreds of songs from Davis' recordings over thirty plus years.<br><br>Having stated in numerous interviews that he had no interest in the usual \"cradle-to-grave\" biopic, Cheadle's odd blend of fact, fiction and hallucination are meant to capture the essence of Miles Davis, rather than the life and times of the man. Guns, drugs, music, girls, and art are all present throughout this trippy trip of a movie that plays like an impressionistic painting, and not a portrait.<br><br>The bulk of the film is spent on Miles Davis during his self-imposed six year drug-fueled hiatus in the 1970's when he secluded himself in Howard Hughes fashion. There is an odd and ill-fitting plot involving the \"secret\" master tapes that Davis has recorded while waiting for his manager (Michael Stuhlbarg as Harper Hamilton) to pay him the money he is owed. Mixed in is a \"Rolling Stone\" writer named Dave Brill (Ewan McGregor) desperately trying to get an interview with Miles and listen to the tapes. This mad caper-ish core benefits greatly from the quick cuts to the past  especially those featuring Frances Taylor (Emayatzy Corinealdi) as Miles' beautiful, talented and supportive wife.<br><br>Of course, we shouldn't expect linear story-telling from a man whose life was anything but linear. After all, we are focused on the man who claimed his music was not \"jazz\", but rather \"Social Music\"  and that \"it takes a long time to play like yourself\". The car chases and gunfights might seem out of place, but do capture the essence of a man fueled by drugs and a possible (temporary) loss of his creative genius. Perhaps, as the movie suggests, Miles was remorseful for how he treated Frances. Or maybe it was simply the pressure of being Miles Davis . The coolest of Cool Jazz.<br><br>Mr. Cheadle does a nice job in portraying Davis, and is spot on in the trademark raspy whisper which Miles was known for (the after-effects of a larynx operation in the 1950's). Ms. Corinealdi (to appear in the new \"Roots\" project later this year) is outstanding as Frances Taylor, and is the one character we latch on to in hopes of maintaining our bearings throughout.<br><br>Taking its title from a 1957 Miles Davis album, the movie offers a glimpse into the mind of a musical genius who didn't always fit into \"proper\" society, and would be the perfect pairing for a head-scratching trumpeter double-bill with the recent \"Born to be Blue\", a look at Chet Baker.","user":"ferguson-6","rank":[25,32]},{"title":"Miles Below","rating":3,"date":"28 April 2016","review":"Don Cheadle plays a good part as the young and older Miles Davis, Ewan McGregor as usual in my opinion is poor and an expert at dumbing down all of his roles. How does he get the work I ask myself ? I, My friend and I are keen Miles Davis fans, his wife is not, to quote her \" I know less about Miles Davis than before I saw the film \" The storyline is poor, only showing a a brief chapter of Mile's life when he retired for five years, and the record company \" stole \" his new tape. An episode of the Keystone cops ensues with car chases and gun toting ....... Very uncool, very unMiles. I don't believe a word of it. OK,be different,but to only mention one of his 3 wives ( and imply he only had one wife) is downright ridiculous, and not one word about any of his many children and grandchildren I mean ...... Really ! I was really looking forward to this film but we all left the movie \" Kinda Blue \"","user":"jencliff","rank":[31,45]}]