[{"title":"Getting High","rating":7,"date":"13 October 2013","review":"This starts off pretty normal, but by the end of it, gets completely out of line/order. Which might be considered a good thing. It's tough to really care about the characters that are shown on screen completely, but it still manages to be more than intriguing. It doesn't take itself serious nor anyone involved! Nothing is sacred and everyone gets made fun of, which is a great thing.<br><br>Visually this is a trip, as is the story of the movie itself, in more than one sense ... or senses! I'm not sure how the translated version will work or the subtitled one, but in its original Austrian form, with some (broken) English thrown in for good measure, you get something that is so wild, so crazy and so innovative, that any open minded being must long for ... or I was just in the right mood (drug free of course) while watching it","user":"kosmasp","rank":[4,4]},{"title":"An improved sequel","rating":6,"date":"16 August 2016","review":"This is \"Contact High\", an German-language movie from 2009, which was written and directed by the late Austrian filmmaker Michael Glawogger. His co-writer here was Michael Ostrowski and this combination also worked together on \"Nacktschnecken\", the prequel to this film we have here. And in both movies, Ostrowski plays one of the main characters. Sadly, I must say I found him pretty forgettable in both films, probably the most from all the main actors. He and his buddy who share a whole lot of scenes in here never really entertained me that well and for me it was all about the pairing Detlev Buck and Georg Friedrich, who had a great deal of screen time together and made this a pretty rewarding watch overall. They just play their parts really well and their characters are pretty hilarious (in a good way!) and the chemistry was working too. It was nice that Buck got much more screen time than he had in the first film.<br><br>The latter is also one of the reasons why I believe that this sequel is better than the original film and the good thing is the story is so different here that it has hardly anything to do with the original film at all. You certainly don't need to have seen the 2004 film to appreciate 2009 movie. This one we have here is also a bit longer, runs for over 90 minutes. It is the story of a bag that seems to contain something mysterious, apparently very precious. And as everybody tries (not) to make sure the bag arrives at the target destination, we get to see an interesting (road?) movie that takes us on many locations and I also liked the focus on characters here. There are not too many in the center of it all, but just enough and the minor supporting players stay memorable too despite only having two or three scenes perhaps (like the Indian guy). I think you should check this out. I can see why people consider it one of the best Austrian films in recent years. Thumbs-up from me.","user":"Horst_In_Translation","rank":[1,1]},{"title":"A silly funny drugs comedy","rating":6,"date":"25 April 2012","review":"If Michael Glawogger had gained any kind of international reputation, it was perhaps for serious-minded, left-leaning features and documentaries about the struggles of the working man. CONTACT HIGH is not that sort of film. Branching out into the world of drugs and idiots, it is instead not a million miles away from an Austrian WITHNAIL AND I (only not as laugh-out-loud funny).<br><br>An American gangster in Vienna (Jeremy Strong) needs a bag retrieved from Lodz in Poland. He tells a gay garage-owner (Detlev Buck) to fetch it, who in turn asks a manic half-wit called George (or Schorschi - Georg Friedrich) to fetch it, who decides he'd rather watch the Le Mans 24 Hour Race so he asks a girl he knows (Pia Hierzegger) to fetch it, who finally asks the hapless pair who run her hot-dog stand for her. One of them (Raimund Wallisch) fancies him a bit of a sausage king and can't wait to sample Polish Würst; the other (Michael Ostrowski, who co-wrote the screenplay with the director) is just a good-natured dope-head.<br><br>There's also Wallisch's obnoxious daughter who discovers all sorts of excellent hallucinogenics lying around and alters several people's perceptions as a result; plus the perfect girl for Ostrowski; and a whacked-out hotel.<br><br>There's pleasure for non-Austrian audiences in seeing players like Buck and Friedrich, more familiar from Michael Haneke pictures, letting their hair down and having a wild time; there's pleasure, too, in the craziness of it all. It has that dopey, generous quality associated with all the best trips. Not incidentally, it's also among the best films I know about being stoned.<br><br>Unfortunately, the makers appear to have got high on their own supply, since, by the final couple of reels, they give up on the plot entirely and just have everyone tripping off their faces to general bemusement - not least the audience's.<br><br>That aside, I suspect you already know whether you're going to like this film - or whether you're going to think it a gross breach of public morality.","user":"tsavc","rank":[1,1]}]