[{"title":"Exactly what I expected","rating":7,"date":"20 July 2013","review":"R.I.P.D. is exactly what it looks like. The plot was not mind-blowing but it was good enough to hold my attention, the acting was not Oscar worthy but they did a very good job in their respective roles and it wasn't the funniest thing I've ever seen but I did laugh. I would almost categorize this as an action before a comedy, it's got quite a bit going on! <br><br>I liked the second half of the movie more than the first, though that's not to say the first half was bad. It just felt a little repetitive and right about the time I began to feel like it was going to go in circles, it kept moving and saved itself. The second half steps it up in both action and comedy and the climactic ending was great.<br><br>Overall I enjoyed R.I.P.D. It was just a fun movie that you don't need to think about!","user":"Hockey-Girl-1995","rank":[192,242]},{"title":"Good summer entertainment","rating":8,"date":"18 August 2013","review":"When I first saw the trailer for R.I.P.D. there were 2 things that made me wanna see it. 1. I love Ryan Reynolds Jeff Bridges and Kevin Bacon. 2. It just looked really entertaining. Thats not to say of course that this movie is without it's flaws.<br><br>You do get a feeling like in a way you have already seen this movie before and thats because in some ways it's a lot like Men in Black. that does somewhat pull you out of the movie at times but it really is not that big a problem. In my opinion the pros in this movie far out weigh the cons. It is a fun movie with interesting and likable characters. A cool idea that is fairly well writtin and just an overall fun movie to watch.<br><br>Thats really all I have to say about R.I.P.D. I don't really understand all of the hate thats it has gotten it really does not deserve all of that. Have people forgotten how to just have fun sometimes? I give R.I.P.D. a 7.5/10","user":"Rage-Kage","rank":[131,170]},{"title":"Somewhat Generic and predictable, but I still enjoyed it.","rating":7,"date":"19 July 2013","review":"The movie basically follows the three act formula, and although the crusty veteran and out of element rookie has been done before I enjoyed Jeff Bridges and Ryan Reynolds on the screen together. There is plenty action and a fair amount of comedy. there were some plot holes and the ending left a few unanswered questions. Even with these flaws my wife and I both feel like there are many worse ways to spend a few bucks on a hot afternoon. This is not a blockbuster or a classic movie, I would classify it as a good popcorn flick. Contrary to many other opinions here we both recommend this as a watchable movie, as long as your expectations are reasonable.","user":"runner-15","rank":[164,215]}]