[{"title":"A good movie if you actually SMOKE.","rating":8,"date":"7 May 2008","review":"I completely disagree with many of these bad reviews. My personal opinion: if you smoke, definitely see this movie. But not while you're stoned--it will make you paranoid about everything! If you have never smoked pot, or are against it, don't even bother. Honestly, the whole movie is kind of like an inside joke. If you don't get high or haven't gotten high, you won't think it's entertaining, and you probably won't get it. But this is precisely what I love about this movie: it probably portrays being high more accurately than any other stoner movie I have ever seen. I didn't like the ending and it did confuse me a bit as to what message it was trying to get across, but as for the rest of the movie, I thought it was genius. The thought process was incredibly accurate, the physical effects, everything. Being a smoker myself, the whole movie was incredibly stressful, and I understood exactly what the main character felt. So all in all, my recommendation is this: if you smoke, go see it. If you don't, you're not going to like it.","user":"elizabethesto","rank":[83,100]},{"title":"An air of innovation verses your typical run-of-the-mill stoner movie.","rating":7,"date":"31 March 2008","review":"I've read a lot of angry comments about this movie, claiming it's \"bashing\" on \"stoners\" and anti-pot propaganda. This is not the case. If you're familiar with Araki's directing and themes in creating movies, it would be easy to recognize this as a satire. Obviously things of this extreme nature don't happen to people who smoke pot, but I like my comedies to have an entertaining plot. This movie would be horrible if all the protagonist did was lay around high in her home.<br><br>Unlike most \"stoner movies,\" this one stands out as being one of the most original ones I can recall. There are elements of great artistic direction--which is often neglected in many pot related movies, and their are numerous political metaphors. I mean seriously, how often is \"Marxism\" and the Communist Manifesto brought into comedies? <br><br>Many people will say this is \"stupid,\" which seems like an oxymoron regarding a movie about weed. Indeed, there's incredible silliness and ridiculous over-the-top decisions, but that's the point of this movie(and not to mention Farris' character to begin with). Araki introduces subtle, witty imagery while simultaneously producing an enjoyable slapstick comedy.","user":"shadowstarz89","rank":[39,49]},{"title":"Pot helps!","rating":8,"date":"8 October 2007","review":"Extremely delighted by the film! Stoner movies have always been categorized in a different way as regular movies. It's not something serious that you would watch to learn a valuable lesson or to experience an unearthly ascension. The movie is just pure fun. The plot is rather easy to understand. The lack of complexity makes it a pleasant experience for everyone who would appreciate the humor in drug use. Anna Faris describes the condition of a high person more accurate than expected. I liked the sound effects that can be heard now and then according to the situation or what the protagonist is thinking.<br><br>Don't miss it only because it's an independent movie.","user":"rumen-manev","rank":[74,106]}]