[{"title":"High-Quality Espionage Thriller","rating":8,"date":"5 July 2016","review":"What is most interesting about Body of Lies is that it manages to rise above the predictability and formula that plagues the vast majority of espionage films. It is post-Bourne wrapped up in a more mature Bond plot with a politically conscious edge. Yet it never feels like it is stealing elements of those, more using them as a launch-pad for its own ideas. Though the film itself is sometimes guilty of falling back into safety, it remains consistently exciting and intently engaging even when those moments occur because of how keenly detailed and acted it is. It makes it standout as a cut above many of its contemporaries.<br><br>We follow Roger Ferris, a ground CIA operative who moves throughout the Middle East in an attempt to lure out and capture terrorist Al- Saleem. Of course his practices involve plenty of lies and deceit as he tries to retain the support of the head of the Jordanian Intelligence. Ferris is played by Leonardo DiCaprio who makes an excellent centrepiece for the film. DiCaprio is a great choice for the role, given his superb ability to convey emotion and his delivery making even mundane dialogue seem important. I'm not sure many could have been as appealing as he is here. Ferris grows into a more interesting character as the film progresses. His disillusion with the lies he has to sow and backstabbing from his superiors make for some of the most intriguing moments, whilst providing some welcomed morality that never feels forced.<br><br>His superior Hoffman is played terrifically by Russell Crowe, whose weight gain and distinct accent allow him to become the character. Crowe is at his best playing characters like this. Confident, forcefully honest, almost egotistical, yet understanding the importance of the situation. They're traits he always nails. Hoffman appears all-knowing, frequently surveying from the air, keeping constant contact with Ferris as he aids him in setting up a fictional terrorist group to smoke out Al-Saleem. He also clashes with the Jordanian head Hani Salaam, who is convincingly played by Mark Strong, a man who only asks that the CIA don't lie to him, which is something that Ferris finds increasingly difficult to avoid. <br><br>The interactions and differences between these three main characters is definitely the film's most interesting aspect. All three have distinct personalities that are well developed, conduct their jobs in very different ways and are portrayed by actors who always convince. The scenes that bring them together are always gripping, Ferris meeting Hoffman in Washington to devise a new plan, Hani questioning how Ferris could lie to him, the three of them discussing their mission. They all share a suspicion of one another that is fascinating to see play out.<br><br>There is a romance between Ferris and an Iranian doctor that is nicely played out and expands the characters. It also offers us an interesting look at the perception of a relationship with someone from the West in the Middle East. However, the issue is that it doesn't really fit in with the tone of the film and ends up becoming a plot device later on in the film which makes it feel rather forced. The action scenes and shootouts are always very fluid and exciting to watch. Notably, there is a weight to them that makes the injuries feel painful, these operatives don't just bounce back up like in so many spy flicks. There's a torture scene near the end that is brilliantly intense and really keeps you guessing as to its outcome.<br><br>With Ridley Scott at the helm the film is fantastic to look at and his direction is as smooth as it's ever been. In fact I don't think the Middle East has ever looked this vibrant and authentic on screen before. Scott directs the film masterfully. He manages to make the dialogue driven scenes feel just as tense as the action ones. I especially like the use of aerial surveillance, as it gave the film a much wider scope and added to the feeling of always being watched. Scott is saddled with a script that can be jargon heavy, but he's able to make it understandable and technical without dumbing it down or filling it with dialogue that nobody would comprehend. The funny thing is that this is type of film Scott's Brother Tony would usually at home doing, so it's nice to see him try his hand at it and go for a more subtle approach.<br><br>Despite its amalgamation of various espionage tropes and some misplaced plot points, Body of Lies is an exceptional genre film. It manages to work as both an exciting action thriller and as a more controlled politically-charged piece. The story is packed with deception and intrigue, just right for this type of film. The main characters are well-rounded and captivating to watch, they guide us through the film and I always wanted to see what their next move was going to be. It is a layered story and it's impressive just how well it is conveyed. Plenty of praise should go to Scott, his three leading men and script writer William Monahan. They have crafted a film that is well- balanced, a vivid portrait of the CIA in the Middle East and makes a number of potentially clichéd aspects feel fresh again.","user":"C22Man","rank":[33,36]},{"title":"A cut above most of its kind","rating":10,"date":"10 October 2008","review":"The main thing I was curious about with \"Body of Lies\" is what sort of film it would end up being. It could have been a post-Bourne action thriller, a serious dramatic thriller with a political edge (\"Munich\", \"Syriana\"), one of those intolerably dull post-9/11 films (\"Lions for Lambs\"), or something like Ridley Scott's brother Tony's \"Spy Game\", a movie with an interesting premise and disappointing execution.<br><br>I would argue that \"Body of Lies\" is the exact opposite on paper of \"Spy Game\". It's a movie with a questionable, sketchy premise and damn good execution. I'd always definitely preferred Ridley's sensibilities and films to Tony's, and his take on a story about a CIA agent working against agency politics is definitely superior as well, although a very, very large amount of my preference for \"Body of Lies\" comes from the script by \"The Departed\" scribe William Monahan. \"Body of Lies\" bizarrely manages to work as both a hugely entertaining, nifty action thriller and as a socially/politically-conscious drama. I can't believe I'm about to say this, but it really does go from \"Syriana\" to \"The Bourne Identity\" in a second, and does so without feeling ridiculous, contrived, or silly. It just somehow pulls it off, and I'm crediting Monahan with most of this success although Scott certainly handles the shifts in tone extremely well.<br><br>All you should know about the story going in is that DiCaprio plays Roger Ferris, a CIA field agent in an important position in the middle east division, just below the leader of the division Ed Hoffman (played by Russell Crowe), a snarky, racist, and mostly unlikeable man who leads the missions remotely through his laptop and cellphone. Ferris uncovers a lead on a major terrorist leader potentially operating out of Jordan, and chooses to act on it, involving Jordanian intelligence leader Hani Salam, played brilliantly by Mark Strong. His performance is just the right side of slightly hammy, and works wonderfully well. There are twists and turns and it's a lot of fun.<br><br>Now here's where I'm going to start sounding really bizarre: I know I just said it was a lot of fun, but there's a good amount of substance here and a good deal to be learned about middle-eastern politics (having lived there for many years, I can assure you that this film works as a primer on the mindset and cultural feel of the locations it is set in, and of the political system there. Its observations on Jordanian intelligence in particular are very much spot-on. There are scenes where the film gets really dark and serious, and they completely work as well. In particular, for a white American screenwriter's work, this is incredibly perceptive and understanding of how Jordanians act and feel. Something like \"Rendition\" from last year, while generally just not a good film, was also hopelessly inaccurate on just about everything. There was no work there, just a message the filmmaker wanted to send. With \"Body of Lies\", every second feels (and is) authentic and real (outside, perhaps, of some of the details of the espionage aspects, although the writer of the book it was based on was CIA), and there's even some cultural jokes completely in Arabic, untranslated on screen, that basically no non-Arabs will understand. It's a remarkably vivid, real portrait, and considering Hollywood's past of portraying Arabs generally in a 'dem Ayrabs, we America' way, which completely ignored the basic dress and attitude of real Arabs, something like this is refreshing.<br><br>The movie isn't perfect, and there's a key scene at the end which feels very didactic and heavy-handed (although judging by the twentysomethings who left the theater talking about how cool one of the torture scenes was, even a message delivered this bluntly just isn't getting into their thick skulls), but it somehow gets away with being an enjoyable genre piece and a genuinely thought-provoking and perceptive film (but not one which focuses on these elements to the point of being overbearing), with actual understanding of mid-eastern politics and culture, wonderfully involving characters (including the refreshingly non-sexual love interest Aisha, played by Iranian actress Golshifteh Farahani), and even a surprising sense of humor. \"Body of Lies\" is most definitely a cut above most in its (overall quite poor) sub-genre, and one of the biggest surprises of the year. <br><br>8/10","user":"ametaphysicalshark","rank":[251,324]},{"title":"Ridley does it again","rating":9,"date":"7 October 2008","review":"You really have to admire Ridley Scott's moxie.<br><br>Even though the 70-year-old director has long established himself as one of Hollywood's best and most durable directors; having helmed some of the most entertaining films of all time, in virtually every genre (including sci-fi classics like Alien and Blade Runner); and having been nominated no less than three times for the Best Director Oscar (Thelma &amp; Louise, Gladiator, Black Hawk Down), to decide to take on theme that has produced exactly zero blockbusters thus far  the Middle East and terrorism  takes an incredible amount of chutzpah.<br><br>But it does help if you have the help of two of the biggest actors in Hollywood at the moment, those being Leonardo DiCaprio and Russell Crowe (who has worked with Scott on two previous films, Gladiator and A Good Year). It's ironic to think that the last time these two actors shared the screen was back in 1995, with the clichéd-but-entertaining oater The Quick and the Dead. Of course, at the time, Crowe was a complete unknown and DiCaprio was a 21-year-old newcomer with only a couple of notable titles under his belt. But oh, how that's all changed now.<br><br>It's not easy to describe the plot of Body of Lies without giving too much away. DiCaprio plays CIA operative Roger Ferris, who is trying to flush out a terrorist leader named Al-Saleem in Jordan. He gets his orders from Ed Hoffman (Crowe), a man for whom results are the only satisfactory outcome, delivered with a fair amount of arrogance and a cocky Southern drawl. Ed plays the situation like a kid playing a video game, and has the resources to change the rules anytime he feels like it, dispensing his orders from his office, from his backyard, from his daughter's soccer game, for Pete's sake! This, of course, infuriates Ferris to no end, because he is the one who is in the trenches, chasing the bad guys, dodging bullets, ducking explosions, and procuring the badly-needed intelligence that Hoffman needs. Ferris is also trying to build a productive working relationship with the head of Jordanian Intelligence, Hani Salaam (Mark Strong), a relationship that is made even more tenuous by Hoffman's double-dealings and hidden agendas.<br><br>There are so many ways that Scott could have screwed this up. A lesser director might have chosen to ramp up the action, sacrificing intelligence for entertainment. A lesser director could have taken this story of espionage and twisted it into a convoluted and indecipherable Gordian knot. A lesser director would have gotten less convincing performances from his lead actors.<br><br>But Ridley Scott is not a lesser director. Though the plot is indeed complex, with many layers and sub-layers, deceit and treachery, Scott never lets you lose sight of the overall picture. He tells a solid, wonderfully entertaining story, without the need to drive home its message with sledgehammer subtlety (after all, very few things are black and white). And most of all, he gets electric performances from Crowe and DiCaprio, whose symbiotic relationship with a thinly-veiled veneer of mutual contempt is a pleasure to watch.<br><br>I don't know if Body of Lies will end up breaking through the barrier that every movie in this genre couldn't; but for what it's worth, I hope it does. One thing's for sure if anybody can, Ridley Scott can.<br><br>For this and other reviews, please check out www.thelatestmoviereviews.com.","user":"Shrykespeare","rank":[228,320]}]