[{"title":"Review from comicbookculture.net","rating":8,"date":"2 May 2009","review":"Star Trek. When someone speaks this name, various images, ideas, characters and phrases come to mind. I know they certainly do with me. Characters such as Kirk, Spock, Picard, Data, Janeway, Seven of Nine; ideas like the prime directive; phrases like \"Live long and Prosper\", \"Good God Jim, I'm a doctor not a.\". I wouldn't consider myself a \"Trekkie\", but I do have a deep affection for this series and world.<br><br>To my great delight, I was fortunate enough to see an advanced screening last night of JJ Abrams re-imaging of \"Star Trek\". I must admit that I was skeptical at first about taking such iconic characters and recasting them, even in younger iterations, because most people think of the characters of Kirk, Spock, Bones, Scotty, Uhura, Sulu and Chekov with the actors that originally portrayed them. These portrayals are engrained in the pop culture consciousness of the world and hence my skepticism arose. Fortunately, my doubts were unnecessary.<br><br>This is not your father's \"Star Trek\". From the moment the movie begins, so does the action and it never lets up. However, this movie has more than just incredible and intense action, it also pays homage to the series of old. Sure, they wanted to bring us a Trek for the 21st century, but they also realized that they needed to respect the source material and fans of a series that has been around more than 40 years. However, you don't need to know much about Star Trek to enjoy this movie. Each character has been given a background and history that lets you know a little something about each one. There's a lot to be told in an origin movie and it is handled deftly by both the writers and the director.<br><br>But, what really made the movies for me were the actors chosen to play these roles, especially Chris Pine as Kirk, Zachary Quinto as Spock and Karl Urban as Dr. McCoy, aka \"Bones\". This movie would not have worked if the casting of these three characters had not been spot on. Both Mr. Quinto and Urban uncannily channel their predecessors, Leonard Nimoy and DeForest Kelley. They took on some of their inflections, mannerisms and expressions to really give you a sense that they are just younger versions of the originals. Chris Pine, however, takes on the most memorable role in Trek history and makes it his own. This Kirk is not only the womanizer, lover, and captain that you already know, but as portrayed by Mr. Pine also has a swagger, bravado, intelligence, and is a complete adrenaline junkie. We could not have asked for a better Kirk in this movie.<br><br>They have laid a solid foundation for a new series, with new life, perfect cast and a director with a true vision. If the first movie can be this good, my expectations for further adventures have risen exponentially.<br><br>This is my first review for our website and as such might not be very good since I have no experience at writing reviews. I intentionally didn't reveal any plot points so as to not spoil anything for whoever may read this. I may in the future reveal areas that may have spoilers but mark these sections so you can skip over them. I'll be seeing Wolverine tomorrow and hope to have a review up by tomorrow night. Until we meet again, \"Live long and Prosper!\"","user":"jason-2281","rank":[767,1]},{"title":"The plot makes no sense whatsoever. (SPOILER ALERT)","rating":3,"date":"11 May 2009","review":"I'm not going to hit this from a scientific perspective. That would be too easy and would just invite others to castigate me for not \"suspending disbelief\" during a fun summer sci-fi. No, this movie sucks on a very base level. The first, and most disturbing part of the movie is the villain, Nero, who I think is the worst villain Hollywood has given us, and Hollywood once gave us Arnold as Ice Man. Nero is awful because his motivation makes no sense whatsoever.<br><br>As the story goes, Nero is furious at Spock, and by extension his whole race of Vulcans, because Spock did not get to Romulus' star in time to save it from super nova, which destroyed his planet and all those he loved and cared for. In the process both he and Spock are sucked into a black hole and spit out the other side well in the past, except at different times, Nero 25 years before Spock. In waiting 25 years for Spock to come through the black hole as he had, Nero and his crew seethe with rage and plot their revenge against Spock and his evil race of Vulcans.<br><br>But why? Did Spock create the super nova? No. That was explained as a natural disaster. Did Spock try to save his planet? Yes. In fact, he had every reason to believe that he was going to die in the process. After failing to stave off the super nova, he was sucked into a black hole, which is assumed to destroy anything entering it (after all, black holes literally crush atoms to the point of not existing). Personally I think that makes Spock a hero to the Romulans! Having a vendetta against Spock and the Vulcans would be like tracking down and killing the family of a fire fighter who died in your house while he tried to save your wife and kids. That makes no sense. None. Last, Nero is now in the past, no? Why doesn't he just go about saving his planet from destruction? He's got the \"red matter\" to do it.<br><br>The other thing that ticked me off was the silly string of \"accidents\" that put a gang of 22 year-olds in command of the Federation's flagship. Do they not have even a single 40 year-old who has actually been in space before? It's even worse than that if you think about it. Before the ship takes off Kirk is about to be booted out of Starfleet—but now he's put in charge?<br><br>I'm willing to suspend disbelief in sci-fi movie, but there's a difference between suspending disbelief and watching a movie like I'm a 3-year old. 3 stars out of 10.","user":"jmiller2032","rank":[365,574]},{"title":"Miserable horror stupidity","rating":1,"date":"9 May 2009","review":"Not content to rest on his laurels in boring the world into a black hole with LOST, or writing some of the worst ever episodes of Felicity, J.J. Abrams set busily to his task of eviscerating Star Trek in a derivative, boring, 2 hours and 6 minutes of sadistic torture. With new credits ripped straight from Third Rock From The Sun and Simon Pegg sequences that seem to be taken from Hitchhikers Guide to the Galaxy and Romulans who appear to have been extras from The Matrix. Do the makers of this film trust any of their OWN ideas!? Do they have any!? And the staple hopeful tone Star Trek is gone. Replaced by a war slash comedy tone that I would expect only to find in Red Dwarf or Starship Troopers. There are just enough seconds of great action in this film to fit into a great trailer. Yes that's right. That stuff you saw in the trailer? That's it, that's all of it, no more than that. There are just enough seconds truly funny comedy to fit into a comedy trailer. Surprise surprise! For the rest of it, we get people sitting around talking about nothing. Except they are in space... which is, you know, actually nothing. Unlike the New York of Seinfeld, which is, y'know, something. Oh, and did I mention that every character in TNG, DS9 and Voyager and Enterprise is dead? Oh, not dead. NEVER BORN! That's right, Picard and Data, will never exist. Never born. Because the timeline has been re-arranged. Re-arranged by who you ask? A small mining ship. A small mining ship with no time-sheilding has evaded the time-shielded time-police and killed Kirk's dad and destroyed the whole planet of Vulcan. Ri-ight. WTF? W T F!? How did they do away with the time police? Aren't a lot of the time-shielded time police FROM the planet Vulcan, that has just been destroyed by illegal unscheduled time travel of a tiny mining ship? If some kind of deity like Q has disabled the whole of the time police, why is it for such a small reason as destroying one tiny planet. Couldn't the deity destroy the planet with a flick of his finger? Oh wait, it's, you guessed it, Stargate! And why don't we see these juicy Q-type-bady-talks-to-bad-guys sequences?? Who knows.<br><br>Star Trek is supposed to be hopeful and inspire individuals to do good in the world. This is a war movie to inspire people to pick up a gun and do who knows what.<br><br>Star Trek Zero (official working title) gets a big ZERO from me. Awful, abysmal. One star because they don't allow lower.","user":"kaidaejin","rank":[319,501]}]