[{"title":"honest, accurate review for 'war of the dead'","rating":6,"date":"24 May 2012","review":"the best way to describe this movie is that it's a B movie coated with A movie presentation. the special effects and the acting are the only things really holding it back from its true potential. the acting or dialogue is at times so bad and the accents so inconsistent that you wonder why the director didn't just choose to re-shoot some of the scenes and put a little more pressure on his actors. the special effects are sometimes good, but sometimes bad. this is made clear at the start of the movie when some men are gunned down in a hallway yet there is no sign of any bullet penetration or even sound effects here and there. some men just fall to the ground, we'r shown close ups of some weird nazi character grinning as he walks out of a lit-up doorway like a freaking angel or something.<br><br>the best thing about this movie is its presentation. the cinematography and camera-work is pretty 'up there'. like one of the quotes on the DVD cover states, it is 'like an episode of band of brothers with zombies'. and yeah, it is; just with much less impressive actors. <br><br>the story is unoriginal yet interesting enough to warrant your time and it looks like a lot of effort went into this little B movie. the characters all look fantastic (just like any soldier out of saving private ryan or band or brothers) and at times gunfights and explosions are convincing. its just a shame the acting and occasional iffy effects let it down. <br><br>so in summary:<br><br>presentation - 8 special makeup effects &amp; sound - 6 acting - 5 script - 6<br><br>overall - 6/10","user":"adamcarlton","rank":[39,48]},{"title":"They're coming to get you, sergeant...","rating":6,"date":"29 May 2012","review":"I found \"War of the Dead\" by sheer coincidence. I had never heard about it prior to accidentally stumbling on it. And the cover of the DVD made me pick it up and give it a go, as I do enjoy zombie movies. And zombie Nazis, well it just doesn't get any better!<br><br>Now, I will say that \"War of the Dead\" is unlike most other zombie movies that I have seen in my life. It has that whole \"Band of Brother\" / \"Saving Private Ryan\" feel to it, with the impressions that you are right there in the action with the soldiers. I liked that about the movie, because it is a cool thing. And taking place during World War II, but with zombies running around, well that is just an interesting concept. Sure it is used in other movies, such as \"Outpost\" and \"Død Snø\" (\"Dead Snow\") for example, but still it worked out quite well in \"War of the Dead\".<br><br>One thing did puzzle me, and that was why Americans were there helping out the Finnish soldiers. That just didn't strike me as very plausible. But hey, it is just a fictional movie. Moving on, some of the accents throughout the movie were also a bit on the less impressive side.<br><br>Effect-wise, then I found \"War of the Dead\" to be quite good. The movie had a heap of action with guns and explosions. But for a zombie movie, then the gore and actual mayhem caused by the zombies was a bit tame. Especially because the zombies were agile and running around, a feature in zombie movies that I am not a fan of. (Yeah, I am a Romero-zombie fan to the very core!) And also the zombies seemed to be capable of some brain activity, as they were able to do intricate fighting and blocking in brawling. And when the zombies jumped down from those tall trees, then I was ready to find something else to watch (but I didn't, I gave \"War of the Dead\" a fair chance). What was that all about? So now zombies climb 10-15 meters up into trees to hide and ambush those coming past? That was just too ridiculous.<br><br>The feeling of the atmosphere in the movie was really one of the better things that was working to pull the movie up. Because it was a great mixture of \"Band of Brothers\" but mixed with the gritty places and narrow corridors that you had in the first two original \"Resident Evil\" games. And that worked out so well, because it really put on a brooding sense of being in the wrong place at the wrong time.<br><br>I think that the people they had put in the movie in the various roles were actually doing good jobs with their roles. And it was refreshing to see a movie with no familiar faces popping up. The one who put on the most impressive and memorable performance in the movie was Samuel Vauramo (playing Kolya).<br><br>As for a zombie movie, then don't expect the classical Romero type zombies in the movie, and don't except to see a lot of gore and mayhem, and don't expect to see any real decomposition in the animated corpses either. So if you put these expectations aside, then \"War of the Dead\" is actually a good, wholesome entertaining movie from Finnish director Marko Mäkilaakso.","user":"paul_haakonsen","rank":[23,28]},{"title":"War of the ... sense?","rating":5,"date":"6 May 2012","review":"This movie does everything a B-movie needs to do, to get your attention. It's pretty trashy, it's pretty out there (who cares about historical accuracy anyway, right? ;o) ) and it does have some extreme ideas and still some decent acting (all judged by the limitations of budget of course, don't compare it to a blockbuster). If that sounds intriguing to you, than do not mind the silly name of the movie (though maybe the silly name prepares you somewhat), but do watch the movie and just enjoy it as it is meant to be.<br><br>Having said that, if you can't fathom the idea of mistakes, ridiculous behaviour, OTT acting or OTT special effects at times, plus some explicit scenes of violence, than you might want to stay clear of this. It is not a great movie by any sense, but it will entertain you, if you let it.","user":"kosmasp","rank":[24,35]}]