[{"title":"Great movie","rating":10,"date":"20 August 2015","review":"I dislike Tom Cruise in general, so I was reluctant to see this movie. I was so worried it would be another asinine Misson Impossible movie. I'm so glad my wife pushed me to see it, as it was terrific. None of the super slo-mo CGI Matrix-type bullsh*t, just a Dirty Harry style movie with a great story and great bad guys and great fights. I don't believe there is any CGI in this movie at all! Amazing! Very old school, very surprising, very well done. I loved it and haven't seen a movie of this type that I enjoyed in a long, long time. I loved the way it ended... Fairly easy to see through the plot and figure out what is going on, but still very enjoyable. This is a MUST see for anyone who loved the Dirty Harry movies, or ones similar. Minimal fluff, no stupid romance, a believable plot and a good car chase. And bad guys killed the way they should be. Fantastic!","user":"samsinthebigredbarn","rank":[70,79]},{"title":"Jack Reacher is an entertaining throwback","rating":7,"date":"4 May 2013","review":"There was a time—let's call it \"The 80s\"—when action movies didn't need CGI cheats, shaky-cam and ADD-editing to entertain us. They also didn't have to destroy ten city blocks, have a \"clever\" hook or feel the need to tack on a social message to justify their carnage. No, all they needed was a reason for some good old steak and potatoes action and a star to anchor it all. 2012's Jack Reacher has these qualities in spades.<br><br>Maybe this won't appeal to the eGeneration who need to have their senses constantly bombarded, but for the rest of us, Jack Reacher is a solid bit of retro-refreshment.","user":"Fluke_Skywalker","rank":[192,232]},{"title":"Watch this film","rating":8,"date":"20 April 2013","review":"First of all i would like to ask how any of the other reviewers could possibly give this film 1 out of 10? They must have some deep rooted personal reasons for this i guess.<br><br>I nearly didn't watch this film for all of the negative reviews. I would have so missed out on something good.<br><br>The film was excellent! Great plot. Creepy bad guy and a reasonable amount of suspense. I have never read the Jack Reacher books, so cannot compare Cruise to the title character. I imagine that some people might have been disappointed at the lack of huge explosions and transforming robots etc etc, but this was a fine old school action thriller with many new tricks which i haven't seen before (check the buss stop scene. Classic!). I loved the pacing and the great interaction between players. Sure, some of the one liners seemed a tad forced, but they were not so common. Well done Cruise again.<br><br>Do yourselves a favour. Ignore the negative reviewers and give this a go.","user":"charlesdickins","rank":[314,408]}]