[{"title":"Peculiar adaption of a contemporary character study","rating":8,"date":"25 January 2010","review":"Walking into the cinema, I didn't know what to expect. I'd read David Foster Wallace's book years ago and I enjoy The Office (Particularly Krasinski's performance) but I was doubtful the two would be able to cross over successfully. While I certainly will say that I was wrong, there are quite a few flaws that the movie has. First off, certain aspects of the film felt undeveloped. From the book, I realized that she'd asked a question before each interview that we weren't able to hear, but in this for the uninitiated you were expected to rely on various lines scattered across the movie to solve it all. Secondly, Julianne Nicholson, while an interesting character felt undeveloped (Which I understand was the purpose of the movie, for her to be disconnected) but other than her, there weren't any other characters for the audience to grasp onto and truly connect with (One of the key rules of all movies: That you should allow the audience to quickly gain an emotional connection with the character from their back story and not simply rely on it from the point that they're the main character) Other than those minor viewpoints though, I must say that I was impressed with Krasinski's debut and with such a difficult source material he did a fine job and I have certainly gained respect for him. I would advise this movie perhaps for watching and re-watching in an attempt to understand the movie entirely and all of its little subtleties.","user":"exitmusic7","rank":[20,24]},{"title":"An extremely powerful movie","rating":9,"date":"27 March 2010","review":"I honestly can't figure out the low score on the site(as of writing this it has a 5.7). Brief Interviews with Hideous Men was one of the most powerful movies I've seen. Usually John Krasinski is a happy-go-lucky fun loving guy. But here you can really see a darker and much more serious side of him. His end monologue is one of the most intense stories I've ever heard.<br><br>The story revolves around a researcher studying the different effects of feminism on men by interviewing them. She interviews many different men, and they all have problems. At first, it may trick you into thinking that this will show you a bunch of dumb stories, but it continuously gets darker and darker. You get to hear some truly powerful and gripping stories about different men's lives. They all really hit hard but never feel like they are specifically designed to shock you.<br><br>The editing is probably the most potent ingredient in the mix. While it can be a bit disorienting at times, it almost always has a powerful effect on the viewer. Also, it doesn't throw everything out for you to see. You have to read between the lines for some of it before it tells you anything, really. The final few scenes pull the whole movie together so well that I really hope Krasinski writes more screenplays soon. <br><br>This was an extremely intense movie to watch. It's not something you will pop in on a regular basis, or indeed watch more than once or twice, but that's not say that it was anything less than powerful and a great piece of storytelling.","user":"nkl6564","rank":[11,14]},{"title":"Intelligent Storytelling with Great Performances","rating":8,"date":"20 February 2010","review":"Although you're unlikely to see it if you live the UK, with only a fourth quarter 09 release for 'Brief Interviews' in the States, and curiously Greece, at the Athens Film Festival, John Krasinski's adaptation of American maverick David Foster Wallace's book of the same name is something that you really shouldn't allow to go under your radar.<br><br>This shortish film (eighty or so minutes, dependent upon the version you see) has many head-spinning nuances that warrant your attention. Personally, this was a surprising turn for Krasinski, who displays a brilliant eye for a project and impresses upon his audience an ability far outweighing his popular persona of goof or funny man. It is delightful to see a harder, more serious edge to him. I was both shocked and delighted by this film and have happily become a convert of Krasinski's work, but on a whole new level.<br><br>Having not read the Wallace book and knowing little about the film prior to watching it, I feel I have benefited from not having any pre-conceptions about the story or how Krasinski decided it should be filmed.<br><br>I am grateful for the fact that I went about my usual business and avoided the reviews that had gone before me, as most reviewers have found that they either love or loathe it. Regardless, the film cannot be ignored once seen, and opinions abound about its relevance. Such is the subject matter and wealth of passionate feelings it both incites from its audience and the messages it dares to tell us about ourselves.<br><br>The 'Hideous Men' of the title are few and far between, however, and this may be different in the book, but the majority of a clearly hand-picked multitude of talented actors come across as having opinions on women that are heard all too infrequently. You get the impression that these voices would have remained unheard had a tape recorder and a camera not been placed in front of them and the right type of questions posed from an apparently unassuming and coercive questioner.<br><br>The acting talent throughout is exemplary, with one notable exception. Our lead Julianne Nicholson came across as slightly average through an uninventive, passionless and oblique performance as Sara Quinn. This is quite possibly due to her fellow performers and who can be surprised. These hideous men we come across all deliver outstanding monologues with Krasinski, Dominic Miller, Michael Cerveris and Frankie Faison being particular examples of unmissable, gripping talent.<br><br>The story is simple enough, Quinn is interviewing men on the back of a project to understand the progress of feminism and decides that the best way to understand at least half of that would be to interview men on their feelings about women, taking a broad cross-section of subjects to get as broad a result as possible.<br><br>What we get is a warts and all (and I do mean all) story about how some of these men view women in general. How some are unmoved in their philosophy and how others, at the more cognitive end of the masculine spectrum have started to realise that maybe this isn't their world after all. While some are bitter or delighted, most are confused by their relationships with the women in their lives, but all of them are nonetheless vocal about their feelings, even if those feelings are not what Quinn would really like to hear.<br><br>With an impressive cast, who appear to be mostly right on form, a screenplay adapted by Krasinski that is at times witty, funny and above all brilliantly observed by Wallace and some impressive editing by Zene Baker and Rich Fox, Brief interviews With Hideous Men is both a lesson of our times for men and women everywhere with meaning in every line. This makes romantic comedies seem dire by comparison and I would suggest that even though this is most definitely a look at relationships as much as anything else, it would be wise to avoid it when picking a DVD for a second date, as this raises some uncomfortable questions that are thankfully not glossed over with comedy.<br><br>A real treat for fans of rational thought and superlative acting skills.","user":"steve-662-178237","rank":[21,30]}]