[{"title":"Absolutely incredible","rating":10,"date":"2 September 2012","review":"My boyfriend and I went to see this at the Cinerama in Seattle. For those wanting to see this movie, I highly recommend seeing it in a theater, if possible. It's one that needs to be watched on a big screen with a great sound system to add to the amazing visual and auditory impact. It was also thought provoking and gave us plenty to think about and discuss afterward.<br><br>Visually, this movie is one of the best I've ever seen. The time lapse photography as well as the vivid colors and detail... I don't even know how to describe it, as it was like nothing I've ever seen before.<br><br>This film screams loudly, despite the fact that not a single word is spoken. It's a journey around the world, showing the immense beauty and the grotesque horrors of humanity, interspersed with stunning natural landscapes and the fallout of natural disaster. Nothing is held back from us and, rather than make a specific point, each viewer is able to take from the film what speaks to them. The filmmakers were able to show some incredible juxtapositions and contradictions, calling into question much of what we take for granted and don't bother to contemplate. On more than one occasion, I was moved to tears, either by the sheer beauty of the scene or out of pure disgust.<br><br>The score was so perfectly matched to the scenery that, in some places, it was impossible to believe that the music was not present when the scenes were filmed.<br><br>This is definitely a must see and I sincerely hope that we'll be treated to another installment from the filmmaker.","user":"elizabethkurilko-466-280216","rank":[113,124]},{"title":"It took years to perfect and an instant to ruin","rating":10,"date":"16 September 2012","review":"Samsara is a depressingly accurate account of shallow human materialism, the widespread ungratefulness of our culture, and the incredible arrogance we continue to proudly possess. It features images too powerful to be computer generated and humanity too sincere to be fiction. Even though not a word is spoken, the film's images pack well over a thousand words, making Samsara, hypothetically, the longest work of poetry ever written.<br><br>The film chronicles the living conditions, the activities, and the day-to-day routines of many different people across twenty-five different countries. We never do get a true answer where we are at, which works as a method by the filmmakers, I assume, to prevent assumptions and judgments on the places and the people. We are shown many things in these evocative, unforgettable one-hundred minutes, and more depth and enigma than many will experience in their lifetime.<br><br>Shots are presented in crystal clear 70mm (if you're lucky enough to find a theater with the proper projector, but regular theater projectors should work efficiently enough), and we get a beautiful look at life in the slums, life in mansions placed delicately on the coastlines, and living conditions in countries such as Ethiopia and the United States. We see early religious rituals carried out, such as Tibetan monks engaged in their prayers or youthful baptisms, as well as contrasting lifestyles that involve dance mobs, suffering, and habitat destruction.<br><br>Director Ron Ficke's imagery and global cinematography is gripping and astounding, with long shots centered on characters, groups of people, or sometimes, aerial shots that feature a wide coverage of the surrounding land. My favorites are easily the time lapse sequences, sped up to breakneck speeds, sometimes showing haunting images of uncertainty or simply the fast paced nature of our world.<br><br>There are two sequences in particular that are the most haunting, and describing them will be no easy task. One involves a man sitting behind a desk, who begins to smear modeling clay on his face, before grabbing a tiny paint brush and stroking black and red paint all over himself as well. He begins to vigorously do both things at once, ripping clay off his face only to smear it back on, throw dust in his eyes, stick pencils in his face, etc. The long-shot becomes faster and faster, while jolting music plays in the background. The scene alone is more horrifying and surreal than anything I've seen in 2012, with the exception of Battle Royale.<br><br>The other lasts about five or six minutes, involving a barn full of chickens helplessly being sucked into a large, ominous tractor that will kill them and prepare them for tomorrow's meal. From birth to death, they live their entire life in fear and darkness, barely being able to move due to their heavy breasts and increasing plumpness. We too get a look at pot belly pigs, also too heavy to move, as they lay still and allow their piglets to drink milk from their nipples. We then see those same baby pigs hanging from a long line in the air at a condensed factory, being prepared into the bacon you will eat tomorrow for breakfast.<br><br>These images are nonetheless painful, but it all resorts back to what I called Samsara in the first paragraph - depressingly accurate, more haunting than fiction, and silently nudging us when we're left agape, saying, \"hey, we're to thank for this.\" And we are. One of the final shots involves a beautiful mural of tiny colored specs being swept away in seconds by men brushing the table it is on. We are stunned that such a beautiful thing would be carelessly wiped away, but it all returns back to the idea that we were too given a beautiful slice of life and the world and we took it for granted and nearly destroyed it. We weren't able to take a second look.<br><br>Fricke paints Samsara, which is Sanskrit for \"the ever turning wheel of life,\" as a film that sometimes can laud human activity and then turn around and condemn it. It is predominately a loose picture, that wants you to search for meaning in its images, but unlike Jean-Luc Godard's Film Socialisme, a horrible exercise in a similar field, we can see the images represent something and there's enough ambiguity that we are able to extract many different messages from the source material and are able to provide sufficient evidence to back up our claims. To put it simply, this is one of the best, most intellectually stimulating films of the last ten years.<br><br>Directed by: Ron Fricke.","user":"StevePulaski","rank":[103,113]},{"title":"The greatest visual experience that my eyeballs have ever witnessed.","rating":10,"date":"19 September 2011","review":"I just saw a screening of Samsara at the TIFF, at the brilliant TIFF Lightbox theatre. <br><br>Wow.<br><br>A film that took 5 years to make and co-ordinate. Shot in Panarama 70mm, across 26 countries, needing major government and regulatory clearances, having to wait for certain seasons or lunar phases to get the light to hit the way director Fricke wanted...carefully strung together with a massive 7.1 surround sound design and music score from Michael Stearns, Marcello de Francisci, and Lisa Gerrard (of Dead Can Dance).<br><br>The 70mm negative has been digitally scanned and oversampled at 8k resolution (much like the 'Baraka' Blu-ray); the TIFF Lightbox theatre installed a brand new Christie 4k projector (Christie Projection Systems rushed the projector before its release to the market specifically for this event) making it the first true 4k screening of it's kind. <br><br>From sweeping landscapes to time-lapse sequences of the night sky and from exclusive looks into the processing of food to the consumption and effects it has on the human body, Samsara is nothing short of astounding. Modern technology, production lines, and human robotics are juxtaposed against a backdrop of deserts, garbage mounds as far as the eye can see, and traffic congestion in modern centres. The time-lapse footage is simply transcendent. In fact, I caught myself questioning the reality of some of the landscape vistas and night skyline montages...they looked so hyper-real that I thought they must have come from a CG lab somewhere. Simply astonishing. The richness, depth and clarity of colour and image achieved within the processes utilized gives birth to the most beautiful visual meditation that I have ever witnessed.<br><br>As one film journalist noted, \"That Samsara is instantly one of the most visually-stunning films in the history of cinema is reason enough to cherish it, but Fricke and co-editor Mark Magidson achieve truly profound juxtapositions, brimming with meaning and emotion. It sounds preposterous, but it's true: In 99 minutes, Samsara achieves something approaching a comprehensive portrait of the totality of human experience. If you're even remotely fond of being alive, Samsara is not to be missed.\"<br><br>If you ever come across the chance to see this film in a decent theatre, run, and let your eyeballs (and earholes) feast upon its brilliance.","user":"rosielarose","rank":[184,206]}]