[{"title":"Perhaps the most authentic and accurate version you'll ever see","rating":9,"date":"17 December 2006","review":"If you believe that Mary, Joseph, the baby Jesus and everyone else in the actual events were white, Anglo-Saxon Europeans living in Central Park in New York or in California, you will be disappointed with this movie. If you want to see how people really appeared, lived and responded to the actual culture in Israel at the time of the birth of Christ, this is a work of art.<br><br>\"The Nativity\" is an excellent depiction of the actual events as we know them from the Bible. While it has very minor \"flaws\", these are buried under the number of things that make this film accurate and authentic.<br><br>Mary does not wear her piety on her sleeve and get hysterical and dramatic at every turn in the story. Instead she is accurately portrayed and played as a simple peasant girl in a very traditional culture with strict rules of behavior. She responds hesitantly but with faith to the events that focus on her.<br><br>Joseph is equally realistic as a young peasant just beginning life, and any man who has ever faced marriage for the first time will appreciate the dilemmas facing Joseph and his reactions to them.<br><br>Herod is an historically-accurate and ruthless jerk, but the movie does not overdo his part. The balance is just right; he's on camera enough to convey his wickedness and his part in the plot, but not enough to distract from the message.<br><br>The wise men are great! Instead of being simple plastic figures in a nativity scene on your mantle, they really come to life, add a lot of context to the movie, and provide a lot of information about how and why things happened as they did. The timing of the wise men's arrival may be off - but no one is 100% certain when they did arrive so this is not a big deal.<br><br>When the shepherds are visited by an angel to announce the birth of Christ, the angel is not followed visibly by \"a heavenly host praising God\" - but you can hear them.<br><br>I could go on and on and on, but the point is that this is an excellent depiction of events that occurred in Israel 2,000 years ago. If you want to learn about and marvel at what life was really like at that time, see the movie. It will bolster your faith. If you want to see Adam Sandler playing a Jewish Santa Claus to celebrate Christimas, this is probably not the movie for you.","user":"jhammell-2","rank":[34,36]},{"title":"A tender telling of the Christmas Story","rating":9,"date":"17 December 2006","review":"I really liked this movie! I thought all of the acting was very Very good-- and I loved the fact that all of the actors looked and acted very much like you would expect the people of that region to look and act... this was not a Hollywood whitewash - but a genuine, tenderly done telling of the birth of Christ... a real Christmas gift to the movie-going public.<br><br>I also appreciate very much the efforts the filmmakers have gone to tell the story accurately-- aside from the fact the wise men most likely really showed up a year or so after Jesus was born..<br><br>Get some real Christmas spirit - go see this movie.","user":"maryk-6","rank":[16,16]},{"title":"This is no low budget attempt at portraying the Biblical account","rating":9,"date":"15 November 2006","review":"This is no low budget made for TV, direct to DVD, or \"preaching to the choir\" type film. Quite the contrary. Like Mel Gibson's The Passion, The Nativity Story delivers the quality acting, cinematography, musical score, special effects, direction, sound, production, etc. we've grown accustomed to receiving from the most skillful members of the Motion Picture industry.<br><br>I was particularly appreciative of the way phrases in the Bible which can often be overlooked like, \"Joseph...not wanting to disgrace her, planned to send her away secretly.\" came to life on film. We see just how they would have very likely played out in the very personal lives and communities this all took place in. I found the scene riveting when Joseph labors to come up with that initial plan to send her away, and then announces it to Mary and her parents who are there with him. Also, the courage and faith needed by Joseph and Mary to believe God took on a whole new understanding when seeing how the culture they likely lived in brought intense pressures which would have very well been cause to shrink away in fear in the face of had not they obeyed the angel's charges to \"do not be afraid.\" <br><br>A real strength of the film, I believe, was in how scenes that were straight from the Bible either used the words of the Bible practically verbatim, or at least there was just unspoken acting out the heart of the scene, with little to no unnecessary additions to the Biblical account. This, I believe, let's the Bible speak for itself for the most part and for that I send a big thank you to Mike Rich as the screenplay writer in getting to the heart of the personal lives of those involved in Jesus' conception and birth while seeking to be true to the text's original meaning. And to Catherine Hardwicke and all others involved in getting the Biblical account onto this media with all their professional skills, I say thanks as well. I'd love to see many more \"Accounts\" (the connotation of the word \"Story\" weakens the impact in my mind...but that's just me) from the Bible put to film by this great team assembled to produce The Nativity (Story).","user":"carl-stubblefield","rank":[155,184]}]