[{"title":"Nice guys finish first.....","rating":6,"date":"28 June 2009","review":"Danny DeVito lends his presence to what is essentially minimalist entertainment. The acting and character development are totally acceptable, but the story is very simplistic, and is further weakened by unnecessary voice overs. There are moments of black comedy, romance, and action, but the film suffers from an identity crisis, because none of the above features are very strong, leaving \"Just Add Water\" with sort of a questionable genre. Marginally recommended for those who like isolated desert towns, with goofy characters. The closest similar movies I can think of would be \"Sordid Lives\" or \"Hold Me Thrill Me Kiss Me\" - MERK","user":"merklekranz","rank":[8,8]},{"title":"Doesn't quite make it","rating":6,"date":"3 April 2009","review":"Is this movie a satire, comedy, vigilante, romance ...? It works for the first hour or so as a satire and then becomes a combination syrupy romance and revenge-vigilante movie.<br><br>Some of the acting is good - the male lead is, but the female grocery-girl love interest is simplistic. The dead-beats and loser-town America were well portrayed and this gave the movie some authenticity - the homes and interiors were certainly not taken from 'Town and Country'.<br><br>But when it's said and done the ending is a lame-brain fairy tale. Too bad because I did feel 'sometimes' that this film was going somewhere.","user":"MikeyB1793","rank":[5,6]},{"title":"Modest, formulaic, but nice.","rating":7,"date":"24 July 2008","review":"This is a quite enjoyable movie, well-made and pretty much an atmosphere piece, which is extremely formulaic (you'll know everything that's going to happen more than half-way through), but actually succeeds at being the sort of 'heart-warming' stuff that so many films market themselves as and fail at.<br><br>The humor is just offbeat enough to be particular, and I was actually quite happy to see that there were practically no pop culture references; this is significant, because for me, this means there's an actual story sustaining itself, rather than 'shout-outs' to the audience's immersion in contemporary culture.<br><br>And finally, perhaps most significantly: Jonah Hall, who I have disparaged in other posts, and whose acting I generally dislike, was actually quite good in this film. In other films, I've felt as if he was simply trying to imitate 'Cartman' from Southpark; there is a bit of that in this film, but Hall makes the role his own, and actually becomes a character you really care about, and feel Ray's pride and disappointment in. Perhaps Hall is developing as an actor, or perhaps this movie simply allowed him to do a better job.<br><br>This is a pretty nice 'date movie'. One of the only 'feel good' movies I've ever seen that wasn't saccharin and annoying.","user":"I_saw_it_happen","rank":[10,15]}]