[{"title":"Highly underrated masterpiece","rating":10,"date":"17 January 2014","review":"I really don't understand all the bad reviews of this movie. The only explanation that I can figure out is that those people watched it with a lot of expectations and they did not found what they were looking for, or they just went to see that movie being in the wrong mood I must admit that I had to watch it twice in order to give it a 10 out of 10. The first time I gave a 7. The second time I really watched it with a clear mind and I really was able to appreciate each frame of it The actors are perfect, the camera framing is a delight to watch, the costumes are fabulous and each line of the script is well written. It is rare that I give a higher rating at a second viewing, but this movie is that kind of masterpiece","user":"SBenoit5","rank":[56,75]},{"title":"Underrated.","rating":8,"date":"30 October 2016","review":"The Wolfman its a remake of the 1941 horror classic The Wolfman, both movies are really good and rely on their atmosphere and their effects.<br><br>This movie its actually a bit better than the original but its a very disliked film, for some reason.<br><br>The film has everything that you want from a horror monster movie, the Gothic atmosphere, the gore, the effects, the characters.<br><br>The make up effects are the work of Rick Baker, who has worked on another really good werewolf film, American Werewolf In London.<br><br>The directors cut its amazing, I don't know if the original Theatrical release had this much gore, but its great anyway.<br><br>The film takes the best from the original universal classics and the best from the Hammer era, a must from horror fans.","user":"MonsterVision99","rank":[15,18]},{"title":"I really liked it","rating":10,"date":"21 February 2010","review":"Being in the late 50's in age, I grew up on Universal horror and truly love the originals. But I have to say this remake exceeded my expectations. There are many suspenseful moments and the movie makers seem to have a clear grasp of what the objective was. Also there is a clear difference between a Hollywood werewolf (looks like a big wolf on two legs) and a \"Wolfman.\" The wolf-man looks like an indistinguishable combination of both. A monster. I like the werewolf movies but this tops the bill. Forget the professional critics. They get paid to say negative things and most often don't seem to know what they are talking or writing about. If you like this type of stuff, it is top shelf. I may see it again.","user":"dbjdpb","rank":[126,190]}]