[{"title":"Make absolutely certain you do not miss this film","rating":10,"date":"9 November 2007","review":"This is by far the most unusual movie I have ever seen. I am a die hard Sci-Fi buff and found myself wondering why no one has released a movie like this before. I was totally engrossed... the story pulled me in like a Black Hole, I found myself wanting more and more.<br><br>This film is tantalizing, not to your eyes, not to your ears, but rather where it counts the most...your brain. What a breath of fresh air, I felt satisfied in the end and invigorated. If I had paid 50 dollars to see this film I would not have been disappointed.<br><br>For anyone who has an intellect, is open minded and ready for an adventure born of thought, Ideas and possibilities, make absolutely certain you do not miss this film.","user":"brmelez","rank":[1,1]},{"title":"One of the most thoughtful and well written scripts put to film in ages.","rating":10,"date":"16 November 2007","review":"I cannot speak about the depth and art put forth in this film without giving away details that will rob enjoyment from you if you have not seen this film. Suffice it to say that I highly recommend this film for anyone who enjoys a film that reaches to the stars and does not depend on CGI.<br><br>This is a film without pretense or smoke and mirrors.<br><br>It is so nice to see a film that depends solely on story and dialogue. I highly recommend this to SF readers before viewers. <br><br>A true masterpiece.<br><br>A true shame this film never got any publicity to speak of. All though it did not cost tens of millions to put to film, it is a winner in any category.","user":"rareandfirsts","rank":[1,1]},{"title":"Educational","rating":10,"date":"9 November 2007","review":"A seriously engaging film with a small twist at the end. Lots of small inputs of educational facts and figures but stay alert as they come quick and fast. I thought the mix of characters was excellent and the tale outstanding, but that is down to Bixby the writer. The acting was a little wooden but the story-line was fast enough (after a slightly slow start) to save dwelling on this. A sci-fi film with absolutely no special effects, relying solely on the story and a room-full of actors.<br><br>A highly recommended film that needs some concentration and thought to fully appreciate, and that might even cause a tear if you become fully immersed. A nice change from the usual no-brainer special effects charged tear-aways.","user":"phalanges1","rank":[648,813]}]