[{"title":"Well, not Everybody's Fine in this, nevertheless, very fine movie","rating":8,"date":"31 January 2010","review":"If trailers were ever suggesting that Everybody's Fine might be a comedy, or even only a light-hearted drama, they were truly misleading, and a simple drama denominator from its poster does the movie better justice. Though, and not the least thanks to occasional humorous undertones, evidently somewhat a weaker part of the movie, and despite really uneasy feelings that story frequently brings out (viewers are often ahead of father in whatever sad facts his not-everybody's-fine children have concealed from him), one can get almost exhilarated with quite an optimistic ending when the father, Frank Goode (Robert De Niro), on his disastrous cross-country tour to meet his children, one by one, not without a trouble of going through serious health problems, finally reconvenes with surviving ones (Kate Beckinsale, Sam Rockwell, and Drew Barrymore) and, postmortem, reconciles with his long ago estranged, ultimately lost son, finally coming to terms with his artistic limitations, even seeking to buy one of his paintings. An early sketch he discovers speaks volumes within the running metaphor of Frank's life, with its working part spent in putting coating on telephone wires that should connect people. However, when those wires, in the times subsequent to his wife's demise, continue transferring embellished pictures of lives of his own ones, in order not to disappoint fatherly expectations, unfairly, in their young lives, so highly imposed on them, ties get easily broken where it hurts the most, between father and his children.<br><br>One inevitably wonders how such a depressing story, full of toned down, bitter emotions, has even been considered to be made into a Hollywood movie? It becomes easier to understand after discovering financial support (Miramax) and creative mind (British director Kirk Jones) behind it. Times and again, inspiration for such a movie has been drawn from an overseas' predecessor of the same, literally translated original Italian title, Stanno tutti bene, from directorial output of Giuseppe Tornatore, best known for his masterpiece (Nuovo) Cinema Paradiso.<br><br>After a longer while, this movie finally offers a role deserving of Robert De Niro's great talent, often wasted on mediocre films. His latest, truly emotional tour de force, rather different from his memorable, primarily physically demanding roles earlier in his career, made his character here, though fully resonant, yet quite independent of whoever he associates with, whether he interacts with his own, up to his high hopes underachieving one, or talks to a total stranger whom he meets while on his tour.<br><br>As coincidence would have it, it is interesting to notice: Robert De Niro was 66 years old in 2009, while shooting Everybody's Fine, the very same age as the late Marcello Mastroianni at the time when he had done Stanno tutti bene, in 1990. An old-fashioned (meant as a compliment) song, (I Want To) Come Home, from a year older Paul McCartney (67) is featured in the movie and accompanies the end credits.","user":"Davor_Blazevic_1959","rank":[116,127]},{"title":"This may be DeNiro's Best Performance Since Awakenings","rating":9,"date":"5 December 2009","review":"I saw this movie last night in a crowded theatre with persons of varying ages. At the conclusion of the film, I noticed smiles and tears in the eyes of the older viewers and some boredom and rush to leave in the younger ones. This is a movie for parents and will probably not appeal much to the under 25 set.<br><br>That said, this is a beautiful, heart-felt, and sometimes painful story of a father recognizing and coming to grips with the reality of his parenting and his lack of control over his children's lives. It is about truth and how we try to spare others pain or discomfort. It is about how many parents still see their grown up children as small children who we are responsible for.<br><br>While the supporting cast turn in good performances, this is Robert DeNiro's movie. It is his best performance since Awakenings (he deserved that Oscar, and not just the nomination).<br><br>I suspect that this film will get a lot of nominations, but don't think it will win many awards. I base that on the idea that they younger voters have not yet been in the shoes of the older ones and will not be fully able to appreciate the character or his growth and understanding.","user":"jalapenoman","rank":[126,147]},{"title":"Everybody's Fine: The family that came unglued find a reason to stick together","rating":9,"date":"4 December 2009","review":"Once the trailer hit the internet, I knew I was going to see this movie. Nostalgia, De Niro and Barrymore were the primary reasons. Of those reasons, Nostalgia and De Niro were most responsible for the big lump in my throat and regret that I had no Kleenex.<br><br>We go to movies to either escape reality or simply live in fantasy, don't we? I have to say, so much reality existed in this movie, escapism and fantasy seemed totally lost. The subtleties of everyday life can mean so much in retrospect. Every little thing that we do, no matter its importance, can come back and haunt us. That, surprisingly, is what makes this movie so real and endearing.<br><br>Nothing about Everybody's Fine is lacking if you can find yourself or someone you know in this movie. The beauty of it is, you will find someone you know. If you haven't tricked yourself into thinking this might be like Christmas Vacation or Planes, Trains and Automobiles, then I hope you can appreciate its evenly paced, nostalgia filled beauty.<br><br>De Niro has outdone himself with this simple heart-filled \"grown family\" film. I can truthfully say I liked him more in this than anything else he has done, although I also believe he probably didn't have to dig too deep into his soul to be Frank Goode. I will be surprised if he has not turned the heads and hearts of those who can nominate him for an Oscar. While all the characters were easy to relate to, this movie was more about Frank Goode's journey from state to state and through life.<br><br>Believe me, Everybody's Fine is more than just fine.<br><br>9/10 and one giant hug for everyone involved in making this beautiful film.","user":"MovieZoo","rank":[149,176]}]