[{"title":"Absolutely Hysterical","rating":9,"date":"29 June 2007","review":"I just saw the first screening ever of Hot Rod at the Los Angeles Film Festival.<br><br>As a fan of The Lonely Island, I went into this movie with high expectations. I can happily say that not only were they met but they were exceeded. This is by far the funniest, strangest and most ingenious comedy of the summer. The movie has some of the most random gags ever seen on film. This film is not for everyone: it has no stars and the comedy is very strange. But give it a chance and you will not regret it. The directing and editing of the film is both stylish and fast paced. Andy Samberg is hilarious as always but the supporting cast truly shines, particularly Bill Hader, Will Arnett and Ian McShane. Also look for an INSANELY hilarious cameo from director Akiva Shaffer. If you love the SNL digital shorts this movie is for you. Hot Rod is destined to be a cult comedy classic.","user":"jonok0","rank":[129,182]},{"title":"Give it a shot.","rating":10,"date":"4 August 2007","review":"Few movies in recent cinematic memory have fit into the category of \"Love it or Hate it\" as well as this one. Its humor is so varied, oftentimes so random, that you either find it hysterical, or you think it's stupid. Me? I'm going with the former... I think this movie's completely hilarious.<br><br>It possesses a goofy, charming quality, and has a lot of moments that left me laughing while asking my wife, \"what the hell the was that?\" It seems to echo a Family Guy style of humor in that regard. I personally found the characters all pretty likable...the kind of characters you enjoy watching. There was an obvious (and effective) effort to give each character a real personality, quirks and all.<br><br>In the end, I suggest you keep an open mind, sit back and enjoy the utter ridiculousness this movie affords you...and I'll bet you find yourself laughing, even if it's in spite of yourself.","user":"outlawstar14","rank":[92,129]},{"title":"Funny? Hell Yeah.","rating":8,"date":"25 July 2007","review":"My wife and I saw a screening of Hot Rod. From some the comments posted here I thought we were going to be bored. Nothing could have been further from the truth. This film was really funny! So funny, that I'm wondering if the people who say they hated it actually saw the same film. No, its not fine art, its a summer comedy, and it delivers plenty of laughs. I am middle-aged guy whose not into early Adam Sandler, or Napoleon Dynamite type comedies, and this movie had me laughing hard. Sure, not at every single joke, but at most of them. If you are into absurdest humor, or enjoyed movies like Hot Fuzz, or Super Troopers, you'll find plenty to enjoy. P.S. My wife liked it too.","user":"thekiltedhammer","rank":[128,185]}]