[{"title":"Dark Comedy Showcases Leoni's Talents","rating":8,"date":"11 July 2007","review":"\"You Kill Me\" is as dark a comedy as you can get. It may also be the first artistically successful romantic comedy noir. Directed by John Dahl (best known for his indie-noirs \"Red Rock West\" and \"The Last Seduction\" and the underrated killer trucker flick \"Joyride\"), the film depicts a hit man (Ben Kingsley-deep in character) forced into Alcoholics Anonymous by his \"family\" because his drinking has been affecting his ability to kill people. Shipped off to San Franscisco to start his 12 Steps, he picks up a part-time gig at a funeral home and meets a sassy single woman with \"boundary issues\" (Tea Leoni-hilarious) after her step-dad dies and proceeds to start an unconventional romance with her while struggling to stay on the wagon and learn how to kill again.<br><br>The film starts off very low key, and Dahl keeps such a consistently dark tone it's hard to adjust to the cadence. As good as Kingsley is here, the show really belongs to Leoni. When she finally arrives on the scene, the film reaches a level of hilarity you weren't expecting. Her facial expressions, comic timing, and interplay with Kingsley as she learns the truth about his past are pure gold. Leoni has had her fair share of commercial successes (\"Bad Boys,\" \"Deep Impact,\" \"The Family Man\", and \"Jurassic Park III\") but it's in this type of offbeat low-budget comedy where she really shines. She was dynamite in \"Flirting with Disaster\" and was the best foil for Woody Allen since Diane Keaton in the otherwise forgettable \"Hollywood Ending.\" Here all her comic charms are on display, and she proves that at the age of 40, she is aging not only gracefully and naturally, but with all her sexiness and innate talents in tact.<br><br>While the film goes through the predictable motions in its final act, it's the gooey goodness of the middle portion (especially one laugh-out-loud montage of Leoni helping Kingsley train for his return to \"work\") that will leave a smile on your face, with Leoni's luminosity as a comedic actress scorched into your mind.","user":"WriterDave","rank":[80,93]},{"title":"Hits the mark","rating":7,"date":"28 September 2007","review":"Hollywood loves assassins. You can't go more than a few weeks without a new hit-man movie hitting (sorry) the multiplexes. Hell, later this year, there's a movie coming out literally called \"Hitman\".<br><br>The new trend seems to be putting comedic twists on the assassin film. I guess we can thank Tarantino for that. Within the past few years, stuff like \"Mr.&amp; Mrs. Smith\", \"The Whole Nine Yards\", \"The Matador\", \"Grosse Pointe Blank\", and \"Lucky Number Slevin\" gave us clever little plays on the assassin genre. If you're at all familiar with those films, you'll feel right at home with \"You Kill Me\".<br><br>Ben Kingsley plays Frank Falenczyk, a hit-man for the Polish Mob out of Buffalo, New York. Frank's an alcoholic, and recently it's been affecting his work. As a result, his superiors send him to San Francisco to attend Alcoholics Anonymous until he can sober up.<br><br>The movie doesn't win any points for originality, but it does have a lot to offer. Kingsley puts on a capable, sympathetic show - pretty impressive for a guy who spends the majority of the film getting hammered. Téa Leoni does well enough as the obligatory love interest. The age difference took a little getting used to. Dennis Farina and Philip Baker Hall are a treat to watch playing essentially the same roles they've been playing forever. Hall is the soft spoken head of the Polish Mob Family, while Farina is the loudmouth villain heading up the Italians. Bill Pullman also has a small role as a sleazy real estate agent. Anyone who's seen \"Lucky Numbers\" knows that Pullman has a talent for quirky lowlifes, and he shines here.<br><br>This is a very light movie. It won't blow you away in any regards, but it is a solid 90 minutes of easy entertainment. The script is essentially Frank's struggle to fight his habit. We also get a light love story and a touch of crime thriller. It's a strange juggling act, but Kingsley and director John Dahl pull it off. Don't get discouraged by the bland name. With just enough laughs, drama, and action  this is a small movie than just about anybody can have fun with.","user":"Slickflix","rank":[46,52]},{"title":"Very Dark, Very Entertaining Comedy","rating":9,"date":"8 November 2008","review":"This little dark comedy is made a real treat by the professional, understated acting by all of its stars and direction that has produced pure entertainment rather than a silly mess.<br><br>The plot of the film couldn't be any more far-fetched. Frank Falenczyk, a hit man for a low-level crime family in Albany, New York, is not performing well because he has an alcohol problem. He is sent to kill the boss of a crime group who is muscling in on the territory. Instead of doing his job, he passes out from drink in his car while waiting. What follows is probably the weirdest family intervention scene ever filmed in which Frank's boss and other members of the crime family tell him that he must go to San Francisco to seek rehabilitation.<br><br>Frank is packed off to San Francisco, but it is clear his heart is not into the rehabilitation idea for his first two purchases are a gun and a bottle of vodka. He goes to an AA meeting and views the whole process with disdain. After leaving the meeting early, he is approached by Dave the realtor who arranged for Frank's apartment and a job as an undertaker's assistant. Dave has some sort of connection with Albany, and Frank is told in no uncertain terms that this is his last chance. Dave assures Frank that he will be reporting regularly to the head of the crime family back East.<br><br>With no other choice, Frank starts going to the meetings where he meets Tom. Tom is a gay toll booth attendant at the Golden Gate Bridge who is wise to the ways of AA. One of the elements that impressed me about the script of this film is how Tom's character is handled. Yes, he is gay, but there is no gay angst associated with his character, and there no Gay Tom subplot. Tom is just a normal guy who just happens to be gay - a refreshing change to the way most gay characters are dealt with in films.<br><br>Laurel shows up at the funeral parlor with a pair of bowling shoes for her dead stepfather, and Frank is immediately attracted as it is clear that she is no shrinking violet when it comes to the harsher realities of life. They begin dating.<br><br>Putting all of these elements together could have easily produced an over-the-top mess of absurdity, but You Kill Me is not. Instead - as alluded to regarding the character of Tom - it is a perfect blend of excellent acting and subtle direction that produces unadulterated entertainment.<br><br>The cast is headed by Ben Kingsley playing Frank, and Kingsley gives us a man we can believe can murder in cold blood, yet possess the weaknesses of a man addicted to alcohol and smitten by a sassy woman.<br><br>As for that sassy woman, Téa Leoni is perfect in the part. Her voice and facial expressions convey worlds of irony mixed with amazement when it comes to her character's relationship with a killer.<br><br>Luke Wilson gives a wonderfully understated performance as Tom. Dave is played to his quirky best by Bill Pullman, and the respective leaders of the \"good\" and \"bad\" crime families are given credible umph by Philip Baker Hall and Dennis Farina.<br><br>Add numerous other distinctive character types revolving around these main characters and tons of incredibly witty lines delivered by Frank and his friends, and you have an extremely entertaining - although very dark - comedy.","user":"nturner","rank":[17,18]}]