[{"title":"Flawed but enjoyable remake","rating":6,"date":"1 October 2011","review":"The plot: Bewildered young man stumbles into a tense game of chance when he impetuously steals a dead man's invitation.<br><br>I really liked the original French movie, though I found it to be a little pretentious. The American remake excises all of the art house elements in favor of big name actors, a curiously extended back story for Mickey Rourke's character, and some really bizarre (but awesome) acting from Michael Shannon. The original French version was also a bit more bleak and nihilist, which I think was watered down for American version. Despite this, I've seen several people complain that this movie was too bleak and nihilist! Wow. I guess some people were expecting a traditional, by-the-numbers thriller with car chases and shoot-outs rather than a pensive, darker drama. Unfortunately, a lot of the tension was also streamlined out this version, though I might be misjudging because I already knew the plot. Still, the brutality and nihilism of the original, made all the starker by the black and white stock, really stuck with me, and I didn't feel as though I had quite the same experience when watching the remake.<br><br>I'm not one of those snobs who thinks that the original movie is always better than the remake, but, in this case, I think it's true. If I hadn't seen the original and liked it so much, I'd probably rate this a bit higher. Judged on its own merits, I think this is an enjoyable movie, but it doesn't live up to the original. For a movie billed as a thriller, it's lacking the tension that audiences expect, and, as a Jason Statham movie, it's lacking in Jason Statham scenes, which audiences will also expect. Despite my criticism and lukewarm rating, I still liked 13, and I'd probably recommend it to people who haven't seen the original. However, I'd highly recommend you see the original, instead. It's a better movie.","user":"krachtm","rank":[11,13]},{"title":"Preposterous in a bad way","rating":3,"date":"12 February 2011","review":"This film is about an underground \"game\". It a game of pure random chance. You have a 78% chance of being killed, 17% chance of surviving, and 5% chance of walking out with a little under two million dollars.<br><br>Rich people dress up in tuxedos, act all high-class, and bet on which participant will win. The bookies offer odds. How can they offer odds on a game of pure random chance? It doesn't make sense. It's a dumb excuse for voyeuristic sadism.<br><br>Jason Stretham enters his brother into the game three times in a row, giving him a 99% chance of dying. Why would the brother do this? Why would Stretham? Why would he act all surprised when his brother dies? Okay, so the plot is particularly stupid. The characters in it are preposterous. Also the pacing is ponderous. This film has no redeeming qualities.","user":"ljw1004","rank":[47,75]},{"title":"Gambling Can Be The Death Of You!","rating":24,"date":"24 November 2011","review":"Georgian writer Géla Babluani found such success in his film 13 Tzameti n 2005 that he decided to recreated the story, this time placing it in the United States. Co-writing this version with Gregory Pruss is the only aspect of this adaptation he shared. The story is a tough one to watch, not unlike 'Fight Club', but with higher stakes. It share how far gambling men will go to get their thrills, making cock fights seem very tame. The game at hand is based on gathering quasi-desperate men (prisoners, men deeply in debt, criminals who have little to lose, etc), placing them in a room with tee shirts bearing numbers, giving them guns, placing them in a circle, and on the command of the master of ceremonies they are to fire their gun into the head of the person in front of them. A smarmy form of Russian roulette, at first each man's gun has one bullet in the chamber, but as the game goes on more bullets are placed and the game continues until there is one man left alive. The gamblers place bets on the various numbered men and the stakes are high. This process is performed in a isolated meeting space and is closely scrutinized by detectives who seek to uncover the scheme and stop it.<br><br>Vince (Sam M. Riley of 'Control' and 'Brighton Rock') is a young electrician whose father has been in an accident resulting in sever injuries that require multiple surgeries. Vince's family must put their house up for sale to pay the expenses unless Vince can find a quicker way to make big money to pay the hospital and surgeons. Quite by accident while doing an electrical job he over hears the house owner discuss a 'job' that promises to pay a lot of money. The man plans on doing the job, receives an envelope with instructions, but then shoots up heroin and dies of an overdose. Vince helps the police who investigate, but before leaving the house Vince takes the envelope that contains instructions and a cell phone and a piece of bark with the number 13 printed on it. Vince follows the instructions and ends up in a complex scheme - the ultimate result of which is the fact that he becomes #13 in the gambling game. Others sequestered for the killer game include Mickey Rourke, Ray Winstone, and among those involved in the offensive debacle are Alexander Skarsgard, Ben Gazzara, and emcee Michael Shannon. The ending of the film is a complete surprise and revealing even part of it would ruin the impact of the film.<br><br>This is definitely not a film for the fainthearted. That such a gruesome gambling scheme could exist is terrifying. But the production and the acting and the grisly atmosphere is well worth the moviegoer's attention. <br><br>Grady Harp","user":"gradyharp","rank":[16,23]}]