[{"title":"Would you sell your soul to be 'king' ?","rating":21,"date":"21 October 2010","review":"Have you ever wanted to be the best at something but always knew you never would be? What would you do in order to achieve the success &amp; recognition that you think you deserve? These are the questions that are about to plague Taz (Simon Rex); an ambitious young, but slightly egotistical drug baron who is walking in the footsteps of his once kingpin father, Norman (Ving Rhames). Taz lives somewhat of a double life peddling his dope, women &amp; money on the side whilst trying to maintain a family man facade. The biggest problem in Taz's life right now is Dunnie Jnr. (Cesar Ferriat), the current \"king of the avenue\" (or in other words-leader of the gang). He is the only man standing between him &amp; what he refers to as his \"birthright\". Anyway one night, Taz wakes up to see the Devil seated before him. The Devil tells him that Dunnie Jnr. is not just planning to kill him but he is also planning to murder his wife &amp; son. The Devil then propositions Taz; let the current reality take its course or seize the opportunity to become the next 'king of the avenue' (yeah I know I should probably trademark that term) by resurrecting his dead father as a demon &amp; ultimately damning his soul for all eternity. Let's just say, the decision he makes won't surprise you...<br><br>Anyway I need not expand on the plot anymore than that because up until that point, the film was actually a promising crime drama. I prefer to remain positive about all this but I truly find it hard to fathom why a self-respecting director would choose to turn his film into a schlocky thriller when he has already established something different &amp; definitely more realistic in the first 25 minutes of his film? Also please don't get me started on the script (which was written by the director Ryan Combs)...it was so shockingly bad that most scenes in the latter part of the film show Ving Rhames with an undeniable smirk on his face like he can't get a bad joke out of his head! I don't see Ving Rhames as a particularly bad actor so all I can say is; he must be in this project for the cash. I also have a need mention that all the narration sequences with Simon Rex are just the repeatedly spoken thoughts of what he &amp; all the other characters have already exchanged through their dialogue- yet another insult to the audience's intelligence!<br><br>Perhaps I have become too used to watching high-budget films that are so technically perfect that any other indie flick like this that even aspires to compare is looked at by me as inferior? However with that said I do think most people will agree with me on this point that the plot unnecessarily morphed into an abysmal mess after what was a very good introduction. Simon Rex was pretty mediocre as Taz &amp; most of the time played a very unconvincing character through the choices he made. I can't say much for any of the other cast members because they all played such cliché crime &amp; friend/family figures that I never really had any emotional investment in them. In total honesty I couldn't have cared less what happened in the end of this film...I was just happy to see the credits rolling!<br><br>Now with all that said &amp; done if the Devil himself visited me right now &amp; gave me the choice of either surrendering my soul to him or watching this film over &amp; over again for the rest of my natural life...I would probably have to think a little harder than usual about it.<br><br>1.5/5","user":"TheCornProject","rank":[18,19]},{"title":"Bad plot, even worse dialogues.","rating":1,"date":"7 June 2011","review":"This is one of the worst movies I have watched in the last months along with \"Perfect Hideout\" (which may have even been worse, because it also had a much worse plot on top of it all). At no point at all could I feel in any way connected to any character in the film or even feel anything for them. Be it love or hate. I could only feel sorry for them for having to act in such a bad movie. If you have a bit of taste, it's practically unwatchable. When Ving Rhames and his son say their \"I love you\"s just before or after Rhames executes some former associate of his... you can just roll your eyes at the amateur-like writing and directing. Enough is enough. Make up your own mind. But don't say I didn't warn you.","user":"david543210","rank":[13,14]},{"title":"crazy drug dealer turns violent","rating":5,"date":"3 December 2011","review":"The movie is about drug dealer Taz, whom has a wife and family that don't know he's a drug dealer. He has a separate house and girl on the side. He wants to be King of the Avenue, like his father was before he was killed. Enter the devil that makes him an offer. He sends a demon whom needs a loved one's body to exist in, so Taz uses his father's body, Norman. So Norman comes back and all these really terrible and gory things happen to the other bosses. They meet violent ends paving the way for Taz.<br><br>Then at the end there is the twist ending. The question is: was there really a demon or was Taz committing all the murders? The film explains it in the end.<br><br>FINAL VERDICT: About the only thing the movie has going for it was some cool death scenes and blood. Plus Ving Rhames is just plain cool. Worth checking out if you can catch it on cable.","user":"MLDinTN","rank":[3,3]}]