[{"title":"Evokes an Era most will not care to remember","rating":10,"date":"24 November 2013","review":"Much has already been written about Matthew McConaughey and Jared Leto's astonishing transformations, and brilliant performances. Solid and true, yes. They both deserve enormous accolades, Golden Globe and AMPAS-worthy, for these transformations and the effort of their craft. But I think the true heroes of this project are the Producers who took a chance on such dicey subject matter. Some reviews hail the project as \"A Crowd Pleaser,\" and yet, you realise, these are TRULY marginal characters, and not entirely likable, as some have already said, in an Era (1970s-1980s early AIDS crisis) that is nearly forgotten in this age of HIV exposure-as-a-managed-care-condition, rather than a death sentence, as it was between 1979-1995. As much as this could be a feel-good film for the discovery and pioneer of protease inhibitor cocktails, it is a compelling character study of a time of crisis that has not been well-captured or documented adequately in quite some time. BRAVO to the Producers of this movie for giving this project the Greenlight, because the sexually-active youth of today would never know the Plague and tragedy that preceded their coming-of-age without a reminder like this.","user":"whirrrrl","rank":[256,290]},{"title":"A Facisnating True Story with Gritty Realism and Excellent Performances","rating":9,"date":"20 November 2013","review":"One of the best films I've seen this year! A raw, gritty, and incredible true story about a HIV diagnosed man who went to extraordinary lengths to survive at a time when the AIDS epidemic was at it's worst.<br><br>Matthew McConaughey who lost a significant amount of weight to play the role gives the performance of his career along with Jared Leto who's equally as good here. The two give quite possibly the best performances I've seen in a film all year in which I actually forgot I was watching actors in a film and instead felt as if I was watching real people. There's no doubt they will both receive nominations for Best Actor and Best Supporting Actor.<br><br>While this kind of story does feel a bit familiar overall, it's excellent screenplay and sense of realism along with the excellent performances make up for it. While it's defiantly not easy viewing and a bit of a downer to watch, it's a truly inspiring (and important) true story and one of the years best films.<br><br>McConaughey has been made out to be a bit of a laughing stock after starring in a series of really mediocre films. His recent performances however, have shown that the man truly is one of the best actors working in the business right now. Dallas Buyers Club is only further proof of this.","user":"Rebel_With_A_Cause_94","rank":[186,219]},{"title":"I like Your Style","rating":7,"date":"11 November 2013","review":"Greetings again from the darkness. It's not unusual for an actor or actress to alter their physical appearance for a movie role. Sometimes those changes become the story: Robert DeNiro in Raging Bull and Christian Bale in The Machinist are two that come to mind. Regardless of the transformation or make-up, what really matters is the performance and the character. Just ask Eddie Murphy (Norbit) or Gwyneth Paltrow (Shallow Hal). In The Dallas Buyers Club, we actually get two incredible transformations that lead to two stunning performances.<br><br>Matthew McConaughey and Jared Leto each lost approximately 40 pounds for their respective roles as Ron Woodroof, the redneck, three-way loving, alcoholic, drug-addicted electrician/rodeo cowboy; and Rayon, the sensitive, street-savvy, would-be transsexual so desperate for a kind word. Their physical appearance will startle you more than once, but is quite effective in getting across the struggles of those infected with HIV virus in the 1980's. The numbers impacted exploded and the medical profession was ill-equipped to properly treat the patients.<br><br>This is based on a true story and a real life guy (Woodroof) who became a most unlikely beacon of hope for AIDS patients. Woodroof fought the medical industry, Pharmaceutical companies and the government (FDA, DEA, IRS). It's impossible to miss the message and accusations that most of these had a single goal of increasing profits, rather than curing the disease. And that's where the story lags a bit. Michael O'Neill and Dennis O'Hare are the faces of greed and bureaucracy, while Jennifer Garner, Leto, and Griffin Dunne represent the side with a heart. Woodroof seems to be a guy who just doesn't want to die, sees a business opportunity, and even learns a little bit about humanity along the way.<br><br>There have been numerous other projects that deal with AIDS, including: Philadelphia with Tom Hanks and the recent documentary How to Survive a Plague. This may be the first with a protagonist who is simply unlikeable, despite his passion and strong survival instincts. McConaughey doesn't shy away from the homophobic personality and cruel manner of speech that Woodroof possesses. We never doubt his frustration at those controlling the big picture, but we never really see him connect with those his brash tactics help.<br><br>McConaughey is on a dream run as an actor right now, and it certainly wouldn't be surprising to see him garner an Oscar nomination. But it would be a mistake to chalk that up to his losing so much weight - he really delivers a character that we won't soon forget. And let's not overlook Mr. Leto, who has been away from acting for 4 years touring with his band. He is a remarkable talent and a true screen presence. Compare this role to his Mark David Chapman in Chapter 27. It's not just the range of weight, but moreso the range in acting that so impresses.<br><br>Also worth noting here is the outstanding cinematography of Yves Belanger. This movie is shot in a way that brings out the intimacy of the moments, while not losing the big picture. Director Jean-Marc Vallee (The Young Victoria) and co-writers Craig Borten and Melisa Wallack work together for a solid foundation, but it's McConaughey and Leto that we will most remember ... and of course, the pics of the great Marc Bolan on the wall. www.MovieReviewsFromTheDark.wordpress.com","user":"ferguson-6","rank":[177,209]}]