[{"title":"'The Messenger' is powerful and engaging film.","rating":8,"date":"11 January 2010","review":"Brilliantly acted film depicting two soldiers whose job it is to inform families when loved ones are killed in battle. Harrelson has never been better and Foster more than matches him all the way. It's emotional and engaging and genuinely painful at times. I had always thought how hard it must be to carry out such a job but had never really considered just what psychologically damage it could do long term to the person doing it. Harrelson depicts a man who has been doing the job far too long brilliantly and Foster in turn shows just what it can do to you initially. It's a perfect blend and the chemistry is excellent from start to finish. Deserves a much wider release and is with out doubt one of the best films of last year.","user":"Jared_Clay","rank":[69,82]},{"title":"Restrained and ambitious","rating":9,"date":"7 August 2010","review":"THE MESSENGER is by far and away one of the best works of art that addresses the deep tragedy behind the current U.S. war in the Middle East that I've seen. THE MESSENGER is an attempt by Director Oren Moverman and screen writer Alessandro Camon to place themselves between the ears of two career soldiers who serve a vital place in U.S. Army Special Services, Casualty Notification teams who inform the families of soldiers that their family member has been killed in battle. As someone who remembers full well the devastating feeling you got in your insides when you saw these teams turn up at the quarters of friends and their families when my own father was serving in Vietnam in the late 1960s, I found the film an important effort.<br><br>Staff Sergeant Will Montgomery (Ben Foster) is a Iraqi war veteran recovering from a battlefield wound who is reassigned to a State Department and United States Army Casualty Notification team, which is led by Captain Tony Stone (Woody Harrelson). Montgomery is also facing an impending breakup with his girlfriend Kelly (Jena Malone), who is playing him off against a wealthy, established suitor. When he is assigned to Stone's team, he is at first resentful. The military decorum which is demanded of the Casualty Notification Team is very exacting, with learned routines that come from a spit and polish military professionalism that requires a distance that is extremely difficult to attain. <br><br>What follows is a series of well connected vignettes, in which the younger soldier is asked to stride this nether world between the jaundiced, dry-drunk outlook of the seasoned bearer of bad news, Captain Stone. Stone is a bitter man with some frustrated ambitions of his own, which are revealed late in the film. Obsessed with sexual victories and teeter tottering between professional sobriety and complete emotional collapse, Stone is far from a steady colleague mentor. Encounters between he and Montgomery go into emotional roller coaster as each man learns to accept the other on his own terms while acting out an extremely trying professional military role.<br><br>In short time, Montgomery comes into contact with the widow of a soldier who sparks his interest, and becomes torn between professionalism and attraction to the young widow Olivia Pitterson (Samantha Morton). Montgomery is forced to grow into himself, despite his outward cynicism, and in short time begins to mentor his mentor, Captain Stone. The story has an open ending, with Montgomery seeking to be part of the life of widow Olivia as she is seeking to reestablish herself in New Orleans. No morals are offered, and this is the true strength of the work as a whole. There isn't much humor to be found here, but watch for the scene where a bender fried Montgomery and Stone attend the wedding reception of the woman who has broken Montgomery's heart. The lampoon of upper middle class phoniness is priceless.<br><br>The beauty of THE MESSENGER is that it does not fall into the usual pro war or antiwar camps that film making in an era like our own are usually so encumbered with. The film makers are ambitious and restrained. I have no idea whether the plot line is itself \"contrived\" as some here have argued, which I have to say is a rather ridiculous critique given that movies are rarely anything but \"contrived\", and this is particularly true of the genre we call the war film. Some who have written here seem to believe that the film discredits the \"professionalism\" of those who do the work of Stone and Montgomery, as though \"professionalism\" were itself some sort of fetish that protects one from emotional or mental illness generated by both war time trauma and the mystique of military culture. Such are the times in which we live, ideological blather is rampant.<br><br>THE MESSENGER is important because, in the words of that great Vietnam war era politician, the late President Lyndon Baines Johnson, it is art, it shows us who we are, not who we say we are, not who we think we are, but who we are as a people, and as a political culture. At various moments, it is clunky. But it is an early effort to give some true definition about what the debacle in Iraq has done to our culture, and to the people who are expected to do the dirty work of the empire's war machine. It is a rare gem in mainstream contemporary U.S. film making.","user":"oyason","rank":[30,35]},{"title":"An Emotional Look Into the Psychological Effects of War","rating":7,"date":"6 January 2010","review":"The Messenger has incredible acting by Ben Foster, Woody Harrelson, and Samantha Morton. <br><br>The film has a curious flow to it. It begins predictable, yet remains engaging, exposing a heart-breaking consequence of war no family wants to face. Although the news remains the same, emotions run just as deep at each door. Every scene is handled marvelously through subtle performances by the actors. As the film unfolds, the viewer sinks into the complex characters on screen, discomforted by the internal struggles that slowly surface. <br><br>The Messenger is a non-linear, character-driven film with exceptional performances but might not be for everyone.","user":"DjMethod","rank":[55,68]}]