[{"title":"Other REVIEWERS have lost their innocent sense of Humour","rating":8,"date":"16 March 2013","review":"The problem with most reviews today is that people have lost their innocence and playfulness the world once new.<br><br>The days when the family would go to the cinema together and buy popcorn and coke and it was a rare treat for all seem to have been replaced with an over critical and harsh assessment of anything!! The film itself deals with a similar subject when Burt Wonderstone loses his ability to realise that to somebody, even an old trick is a new one that can bring wonderment to even the oldest audience.<br><br>Lets stop and look at the film for what it is! Its not supposed to be a drama or intense film like The Green Mile. Its a innocent throw back to the era of stage magicians when rabbits from hats would trigger gasps of amazement by crossed legged kids watching in the front row.<br><br>The introduction of a 'Criss Angelesque' character was to show the shift in social attitudes in regards to what we consider entertainment is (and jim carrey does it hysterically).<br><br>Yes the story is not meant to be compared to anything of a serious nature but does have some underlying content that should make us think a little.<br><br>Today when films like 'Kickass' and 'Jackass' seem to warrant high ratings and are viewed by kids its sad to see such a fun, innocent and laughable film getting a bad rap.<br><br>In Australia at my cinema everyone was in hysterics (and this was a late session 1/4 full).<br><br>If you liked Jerry Lewis and can still laugh ... you'll love it if you enjoyed the fun of films like back to the future ... you will love it If hearing a 13 year old girl in kickass say \"Suck my &amp;*#$\" was funny to you... then you missed the boat on what funny really is.<br><br>Take a chance be amazed and let yourself laugh like no one is around... let it out and let the joy of \"Burt WOnderstone\" lighten you heart for just a couple of hours.","user":"user-634-758817","rank":[256,339]},{"title":"An Enjoyable Watch","rating":6,"date":"22 May 2013","review":"A lot of times I go into a movie with an opinion already formed about it. It's not based on any research or critical reviews, simply on the trailer. That was case with The Incredible Burt Wonderstone. My opinion of the film was not too positive going in. I was dragged to it by a friend of mine with questionable taste in movies to begin with. I could have not been more surprised. I found myself laughing through the entire feature.<br><br>The movie is pretty farcical to say the least, at some junctures borderline silly, but found myself quite enjoying the humor. It was a nice change of pace from all the recent comedies that have to go to the extreme with language and sex humor to make their point. It pokes fun at inter-workings of the illusionist and the final scene before the credits is classic.<br><br>The characters were very well cast. It is no secret based on past films and TV that Steve Carrell has experience in magic tricks, and he pulls it off in the film. It was also refreshing to see Steve Buscemi reprise a comedic role and carry, an impressive contrast to bootlegger Knucky Thompson. And as you would expect, Jim Carrey steals the show as the antagonistic shock magician, Steve Gray. For those who like these actors, The Incredible Burt Wonderstone is a silly, light hearted but enjoyable hour and forty minute movie.","user":"cynthia-ostrich","rank":[52,64]},{"title":"The Combination of Magic and Comedy Work Wonders","rating":7,"date":"11 March 2013","review":"Burt Wonderstone may be more pleasant than it really deserves credit for. Maybe it's because the past two months have been such a wasteland for films, or maybe it's because I am somewhat easily amused. None the less, this is a pleasant film. It didn't blow me away or leave me crying from laughing so hard, but the combination of the comedic chops of the delightful cast and the entertaining magic tricks left me smiling when I left the theater. In a time when there is little in the theater to get excited about, this is a film I quite enjoyed.<br><br>Steve Carell plays magician Burt Wonderstone, the boastful, self-indulgent, and obnoxiously asinine half to Steve Buscemi, who are partners, and best friends since childhood, in the magic business in Vegas. However, both Burt's obnoxiousness and a new street magician, played by Jim Carrey, soon get in the way of his success, and he's forced to re-examine what his career means to him.<br><br>While the magic might be a mystery here, the plot isn't, and it's a plot that goes through all the motions and hits all the points. But if you're someone who doesn't mind that, you will find yourself enjoying this film for it's bright points. Steve Carell is both pompous and lovable here, an idiot savant so to speak, but as a magician lampooning well known, silly performing magicians in Vegas, he's hilarious. Jim Carrey is the second part of the equation, at his best since years. Jim hasn't been this funny in a long time and steals the show every time he's on screen. Rounding out the cast are an underused Steve Buscemi, who disappears for a good chunk of the film, Olivia Wilde who seems like a bit of a mismatch for the goofy Carell, and James Gandolfini as James Gandolfini running a casino. There's also a wonderful appearance by Alan Arkin as an aging and inspirational magician.<br><br>There's a lot here that works, and a lot that doesn't. All of the mockery towards magicians of all kinds are spot on. Carell and Buscemi are perfect as send ups of well known magicians like David Copperfield and Jim Carrey is likewise as a caricature of \"street magicians\" like Criss Angel. And there's just enough Jim that he's hilarious, but not obnoxiously overused. Olivia Wilde gets her own spotlight to shine and she's as pleasant as ever here. And the combination of magic and comedy are a great and somewhat refreshing mix. I'll also add that just about everything with Alan Arkin is hilarious.<br><br>However, the film is pretty formulaic and there's a lot that feels forced. The love story, for one, feels generic and plastic. It's hard to believe that, after everything Olivia Wilde's character goes through with Carell's character, she falls for him (though there is a particular scene between the two that is pretty hilarious). Most of the plot points also feel very by the numbers. Most of the comedy comes from gags and one-offs.<br><br>But, in the end, it all adds up to a fun and entertaining time. If you're going expecting something amazing, you'll probably be disappointed, but if you're going expecting to have a fun time, then I think you will find yourself pleased.","user":"cadillac20","rank":[121,159]}]