[{"title":"SPOILERS:this movie is incredibly underrated!","rating":8,"date":"1 July 2017","review":"Caution: spoilers may abound. I think this movie is severely underrated. Most complaints I see are of people who can't let go of the vision of superman they got from Christopher reeve who played a superman who was a god among men who never made mistakes and always knew what to do. That's not someone we relate to in this day and age because in our cynical and jaded society it's impossible to be that morally upright. I like Henry Cavill's superman because he plays a man who has to learn how to be superman. He's not perfect out the gate and he doesn't automatically know how to handle every situation right out the gate. Because of this a lot of lives are lost in the battle of metropolis and superman is forced to end zod because there is no other recourse because there is no way to contain him on earth with all the kryptonian tech is destroyed. Whatever you can say about how believable it is that superman didn't have a choice it's still set up well. Krypton was very beautiful and Russell Crowe made a great jor el. As far as the plot for the movie I understand the criticism that the flashbacks don't make sense but I think the death of Jonathan Kent is done very well because it's a sacrifice intended to keep Clark undercover. All in all its not perfect but it's far from terrible.","user":"cristiandelgado-72603","rank":[155,180]},{"title":"An Epic Ride!","rating":10,"date":"21 July 2014","review":"At first I was very nervous at the prospect of another Superman movie. Especially considering how horrible \"Superman Returns\" was; however, \"Man of Steel\" was a roller coaster of a ride as we not only witness Kal El's (Clark Kent's) origins, but we are shown Superman the way he is supposed to be.<br><br>With expert direction brought to us by Zack Snyder and the assistance of Christopher Nolan, \"Man of Steel\" is packed full of action and emotional depth. No Superman movie has ever come close to achieving the atmosphere illustrated in the comics or the cartoon series until Zack Snyder's \"Man of Steel\". Sure it has a lot of action, but anyone who is a true Superman fan knows that Kal El's battles were almost always explosively long. Furthermore, the biblical metaphors were absolutely brilliant! As Superman was intended to be portrayed as a \"Christ Like\" figure, you see his journey in \"Man of Steel\" not all that much different from the New Testament. (Ex: When Clark Kent asked the priest for advice, behind him was a stained glass window of Christ praying to His Father before He was arrested and crucified. Next scene Clark Kent willingly submits himself to be arrested, ascends into the \"heavens\", and than descends in a crucified form) As Superman's story is not about becoming the best, but an immigrant facing the challenge of home VS heritage, we see Zack Snyder's portrayal of Superman reflect the \"Man of Steel\" originally designed by Joseph Shuster. <br><br>Furthermore, who could forget such actors like Henry Cavill (Clark Kent),or Amy Adams (Lois Lane). Every actor in this movie left their mark, but I needed very little convincing to believe that Cavill was the face of Superman, or that Adams could be a persuasive Lois Lane. And although I am not particularly a fan of Michael Shannon, he was the perfect General Zod. With the level of ferocity Shannon provided, not to mention his one liners, this was by far his best role yet!<br><br>This movie soared through my expectations and it will be the first time I ever give a Superman movie a perfect 10!","user":"crimson_knight_7","rank":[207,265]},{"title":"Man of Steel","rating":6,"date":"24 February 2020","review":"The dark tone of \"Man of Steel\" probably fits well with some people, but for me, it just seems like they wanted to make Superman the same way Nolan made Batman back in 2005. The darkness of this movie doesn't help the story even the slighest and it actually makes the movie a lot more flat and boring, because it doesn't fit with the character of Superman. The first half of the movie is pretty well-made, but the second and third halves are really just a visual aspect of something that we never asked for.","user":"MR_Heraclius","rank":[41,49]}]