[{"title":"a really solid film ... but it's a real shame","rating":3,"date":"3 June 2007","review":"The real shame is that someone might come to IMDb, see that this film is rated 2.6, think it's a legitimate rating, and not see this film. This is truly a solid film.<br><br>Yes, the film is predictable, and at times cliché. Most of these inspirational films aimed at young people are. But this film rises above most others. It hits it's notes very well, and the direction and choreography are on point. The performances - acting and dancing - were very good.<br><br>It's a shame that so many people have such hatred in their hearts that they won't expand their own minds by learning of cultures outside of their own. It's a shame that so many people who have obviously never seen this film used their time and energy to rate this film a 1. How pathetic is that? I'm glad that this film was a financial success, despite the \"haters\". I just feel sorry for the kinds of people who would make spreading hatred a part of their lives.<br><br>You can see by some of the comments made by some of the IMDb commentators, so to speak, that they never saw this film. It's also obvious that they know nothing of the subject of this film, stepping. These are the people who might want to see this film and learn of something new.<br><br>I, for one, am not big fan of \"Greek\" organizations. Still, I thought that the messages in, the performances in, and the overall execution of this film was better than any in this recent group of college age/friendship genre films.<br><br>I enjoy films of all types, and I can honestly say that this is a solid film for this genre. Also, it's new in subject matter, which makes it different from it's peer films.<br><br>If you're on the fence about seeing this film. You should see it. It's pretty much what you think it is from the trailers, but it's a very well made version.<br><br>I'd give the film a strong 7/10. For it's genre, however, it's as good as there is.","user":"ReelReal","rank":[114,141]},{"title":"No Masterpiece but entertaining!","rating":6,"date":"29 May 2007","review":"I know. The idea is not really original, but yet i have to admit the characters and the acting is not bad. The moves are pretty good, too. What i really did not like was the plot points. Everything was so obvious. Especially in the end. I knew exactly what was going to happen. Yet a gread show<br><br>I actually enjoyed the leading actor very much. <br><br>I've seen Street Style and Step up. Whereby i think Stomp the Yard cannot keep up with Step up, it is definitely betther than Street Style. <br><br><ul><li>2 stars because it is not a genuine idea - 1 star because the plot points a very easy to foresee - 1 Star for bad dialogue sometimes</li></ul><br><br>... which leaves 6 out of 10 for an enjoyable movie. If you like the genre, go see it.","user":"tyler-johnsen","rank":[26,35]},{"title":"No prefacing...the movie was GOOD!","rating":7,"date":"23 November 2007","review":"Does this movie deserve a 2? No Way. I don't know why people feel the need to preface their voting. Did you like it? Yes. Period. I wasn't expecting a lot and perhaps that's why I had so much fun enjoying the film. I'm an indie filmmaker and sometimes it's a challenge to take off my filmmaker hat and just simply enjoy a movie. I was able to do it with this film. It was exciting, beautiful to watch and I was surprised by the storyline. People who slam a movie because it has a moral to the story or an uplifting theme should check themselves to see if they have too much cynicism running through their veins. As a black man, it was nice to see a film where characters used their wits and intelligence to avoid confrontation or deal with another's blatant disrespect. *****Oh, and the cinematography for this film was CRAZY!!! Great dance sequences, great camera work. It was SICK to the Nth!!!! Solid film to watch!!!","user":"DarkAngeloX","rank":[24,33]}]