[{"title":"There's something about Mr. Brooks all right....","rating":8,"date":"20 May 2007","review":"This movie was not what I expected, but in a good way. I saw that Kevin Costner was in it, and figured it would be a light-hearted drama. Then I read that it was suspense, and figured he was a good-guy spy or something. Not so.<br><br>I don't want to spoil exactly what Mr. Brooks is (even though it's revealed in the early part of the movie), but let's just say he's not a good guy. He is cold, brilliant, methodical, and heartless. Definitely not the traits we normally expect from Kevin Costner. And yet, it's fascinating to watch. I found myself rooting for him, and then had to kick myself because his character is so despicable. Top notch acting from him.<br><br>Dane Cook seems an odd casting choice for a suspense thriller, and yet he is believable in his role as a cowardly average joe trying to get the better of Mr. Brooks.<br><br>This movie is surprisingly graphic and brutal in some scenes. Yet it is so engrossing that you will be hooked on every twist and turn (and there are some good ones).<br><br>Not for the faint of heart, not your normal Costner flick, but a very good movie.","user":"mrband99","rank":[467,557]},{"title":"Nice alternative to the torture flick du jour","rating":10,"date":"23 May 2007","review":"I saw the trailer for this one, and thought it was an interesting premise, but Costner movies are so hit or miss. He's the LAST person on earth that I'd expect to be playing a serial killer. His demeanor is too gentle and even. WOW was I right, and that's what makes the movie. That slow, gentle, deliberate pace gives it a surreal sense of unease that a lesser actor couldn't match. It is exactly his everyman persona that makes this movie work.<br><br>In the tone of the movie, I was thrown by Costner's previous work as well. He's best known for somewhat light and under-realized fare. Mr. Brooks is anything but. This is a very, very dark movie, to the point that it's uncomfortable in places.<br><br>Kudos as well to William Hurt, who isn't known for playing this sort of role either. His character could easily descend into cliché, but it doesn't. He holds the right note, and the chemistry between him and Costner is tangible.<br><br>Over the top torture/gorefests have been the flavor of the month. Don't get me wrong -- I love High Tension and it's ilk, but it's nice to see a film that doesn't have to go for the visceral reaction to achieve it's tension. This is an assault to the mind, not the eyes, and it's exceptionally well done.","user":"mrmatt14","rank":[336,411]},{"title":"Unusual, creative storyline and scripting, exceptionally well done.","rating":9,"date":"1 June 2007","review":"The real star of this drama is the story, and the script. Costner's portrayal of a highly complex, sometimes tortured, character is superb in that he is seemingly always in control, always one step ahead of the challenges. One of the best stories in some time, this one covers all of the bases in a satisfying way, keeping the viewer completely involved from start to finish. There are just enough plot twists, blended seamlessly with just the right amount of predictability, to make this story completely believable, and totally satisfying.<br><br>Mr. Brooks, Mr. Citizen, is a soft spoken, highly intelligent man of the community, always in control of his job and family, despite the adversities he faces throughout the movie. Very enjoyable is the intricacy, detail, and discipline he is able to maintain throughout the chaos that befalls him throughout the entire plot. His total control of all of the challenges almost makes him a super hero in terms of skill and control in the performance of his self assigned, gruesome tasks at hand. The blending of his alter-ego, bad conscience side, Marshall, is seamlessly accomplished in this psychological escapade, to the point that one almost has to root for \"them\". Marshall, although the psychopathic side of Brooks, is almost likable, in a twisted sort of way. The ongoing dialog between the two is perfect, in that almost everyone can relate to conscience issues at some point in their lives.<br><br>The added sub-plots concerning detective Demi Moore, the would be wanna be killer Mr. Smith, and the ex-gold digging husband and his attorney, are extra, intriguing elements that are very well done. Though told with a considerable dark tonality because of the theme, one finds himself cheering for Mr. Brooks and his incredible ability as a master craftsman. Ironically, one can also cheer for the detective that is out to capture him.<br><br>If you are ready for a story that is intriguing, suspenseful, gripping, and present day, then this movie is a good place to start. Costner, Moore, Cook, and Hurt are all splendid. Each one is intense, tormented, fun, and believable in his respective role. Another positive feature about the storyline, and it's conclusion, is that it lends itself to, perhaps, a very interesting sequel potential. Kudos to the directors, producers, and entire cast.","user":"brentsoffcenter","rank":[210,268]}]