[{"title":"An impossible task","rating":8,"date":"19 December 2006","review":"Converting anything of Terry Pratchett's to film was always going to be difficult. Getting it right for everyone, impossible. However I was pleased to give this, made for TV, movie 8 of 10 for a sterling effort. The effects were a little crummy at times, Death's face was just a mask and the monster under the bed was just a bloke. Some liberties were taken with the plot, but overall the story was given the care it deserved and the the acting was solid. I liked Michelle Dochery as the singularly stolid Susan. It's hard to be that beautiful and still get Susan's character right and Marc Warren as Teatime was excellent for the job, possessing just the right amount of menace without overplaying it. Nicholas Tennant as Nobby, too, was brilliantly cast.<br><br>There were some scenes, particularly those with Death in them, where a little more care would have been good. The Hogfather's Grotto scene and the little dead girl scenes among them, but it's hard to act in an inflexible mask (Unless you're Darth Vader).<br><br>I know that there will be millions who will disagree with me because you just can't do justice to Pratchett's imagination in a movie, but I still think this movie made an excellent stab at it.","user":"anthony-horwood","rank":[79,89]},{"title":"As good as it could be....","rating":9,"date":"20 December 2006","review":"Adapting Terry Pratchett's work for TV is a difficult task. Sure, he is a great writer and I had much fun reading all his novels at least 3-5 times but his writing style lacks a certain TV-compatibility. He uses much narrating and footnotes which is very hard (if not impossible) to transform into a movie. Having said this, I must admit, this adaption with real actors is probably as good as it can be. Sure, I missed a few funny character conversations (Like the \"Give-the-Dean-a-bag-of-money-gnome\" or the Cheerful Fairy), it also lacked certain elements of the book, including the YMPA, Igor's Bar or the Death of Rats (who is much more important in the book) but you cannot include everything from a 300 page novel into a say 100 page movie script. The producers did the best they could and they did a really great job. The characters looked almost as if Paul Kidby drew them into life and the acting was good. The only minor problem with the movie (which couldn't be prevented I guess) is that it's hard to follow for someone not knowing Pratchett's work before. If you never read his novels and watched this movie, I recommend you do so now. Trust me, the movie is great but the books are even better ;-)","user":"SoWhy","rank":[44,51]},{"title":"Perfect to the very last detail!","rating":8,"date":"19 December 2006","review":"I've grown up on Discworld. Where do I start with this absolutely perfect adaptation? The spot-on casting - Susan, Death, Albert, Nobby Nobbs, Ponder Stibbons, all brought to life wonderfully. The faithfulness to the story - keeping it at nearly 4 hours to ensure the minimum amount of cutting. The perfect locations - Death's Domain, Unseen University, the Tooth Fairy's castle, all brilliant! I'm so glad Pratchett let them do this, and I can only hope and pray that they continue - let's see The Last Continent, Jingo, Maskerade, Reaper Man, Small Gods!<br><br>If I have one tiny, insignificant complaint, it's that we didn't see Ankh-Morpork in all its bustling, grimy glory - no shots of the River Ankh, marketplaces awash with grubby punters and, of course, Cut Me Own Throat Dibbler! But I will say this - Sky One, Vladim Jean and the rest involved did a wonderful job on such a small budget, and gave us a far better and more faithful adaptation than Hollywood could ever have mustered.<br><br>Full marks, it really gave me a buzz in the Christmas season. 10/10 for making a Pterry geek very happy indeed! :-)","user":"punk_gee","rank":[63,77]}]