[{"title":"Great little indy film","rating":8,"date":"5 August 2008","review":"This is what I look for in independent film. Well drawn characters, competent movie making, and a pleasing ambiguity that a big studio wouldn't dare leave in, lest the audience actually decide how to feel for themselves. The guys are great - desperate, sleazy, charming, funny and sad. The girls are also portrayed fairly - scheming, sweet, sexy and innocent. Leguizamo's character is believable to me as an aging playa, chafing against middle age and lusting for Waterson's Shirley. And Shirley is the best on-screen pimp in recent memory. To be fair: things unfold a little quickly, people accept their situations a little easier than they might in real life, but this is a pretty short movie, and throwing in more angst would be overkill and overlong on screen. No one comes away clean, and no one comes away as the absolute bad guy. Moral absolutes would kill this film, and I'm glad it got made the way it did.","user":"uncre8tv","rank":[51,61]},{"title":"Great idea, poor execution","rating":4,"date":"13 April 2015","review":"I can imagine some director sitting down and going \"Hmm. I've got a great movie idea. Check this out: a high school girl recruits her friends to be call girls under the auspices of babysitting and turns into a ruthless pimp.\" Good idea for an edgy movie, right? Probably so, but the execution was pretty bad here. There were so many holes in logic and obvious plot devices that it made it very difficult for me to willingly suspend my disbelief. For instance: <br><br>What high school doesn't have security cameras in it? How many 16- year-olds are willing to sleep with 40 year old men in one high school? What high school keeps all sorts of paint and such around for kids to just grab? What man with a wife and two kids keeps three hundred bucks of totally disposable income in his wallet three to four nights per week? How dumb are these wives to not pick up on any of this? Kids break into a school and the cops don't come, but John Leguizamo stands near a train track and his wife freaks out that he might get arrested? How does a girl with OCD decide it's a good idea to destroy a school? For that matter, how does that same girl use the vandalism of the school to threaten her wayward hookers? \"I threw paint on your lockers. Don't f*** anyone without my permission or next time it won't be paint.\" \"Well, you smashed in the trophy case. That'll teach me to keep my legs closed.\" And on and on.<br><br>The idea was a pretty good one. This movie had a lot of potential in it for something gritty, chilling, and dark. As a finished product, however, it seemed to just be some indie schlock that was trying for profundity and wound up falling face-first into some dad's lap.","user":"beornmatt","rank":[8,8]},{"title":"So much more than I expected","rating":10,"date":"31 August 2008","review":"Stuck at home and recovering from a viral throat infection, I was looking for a couple of nice little cheesy movies that didn't take much brain power. What I found instead, was one utter piece of dross (Black Ribbon, don't bother watching it), and this absolute gem. <br><br>Not at all the Debbie-does-Dallas style piece of cheese that I was expecting from the description I had read, I found this film really rather touching and thought provoking. The acting was excellent, especially considering the apparent young age of some of the cast. Katherine Waterston shone as Shirley, and managed to convey all of the awkwardness of her slightly neurotic teenage character, whilst still being completely convincing in later scenes where her inner core of steel shows through. The range of different personalities amongst the girls as a group was excellent, and each character was thoroughly fleshed out. If there was a weak link here, I would say that perhaps there was not quite enough focus on the reactions of the teenage boys to what is going on around them - Scott's reaction to Shirley later in the film appears to come from nowhere. Perhaps a deleted scene? <br><br>The sex, whilst somewhat explicit, was never gratuitous, and there were a couple of uncomfortable scenes that had me on the edge of my seat. Whilst I certainly never got involved in anything like this as a teenager, I found I was reminded very strongly of the amoral thing I once was, and rather grateful, in fact, that I was never given the choice that these girls are offered in the film. The lack of any real analysis of their actions only serves to make these teens more convincing in my view - what teenager really considers the consequences of their actions before taking them? <br><br>My recommendation: Get hold of a copy of this film, grab yourself some popcorn, and watch it through, and be prepared for some introspection afterwards.","user":"theofficialmaxine","rank":[42,54]}]