[{"title":"This bread's hard to chew","rating":7,"date":"21 December 2006","review":"The recent film \"Fast Food Nation\" imposes a fictional narrative onto the factual expose of Eric Schlosser's informative and horrifying book about (among other things) the industrialization of agriculture. The documentary \"Our Daily Bread\" makes no such concession to its audience's need for story, presenting virtually wordlessly scene after scene of modern food production in action.<br><br>It's a cliché at this point to note how modern consumers are alienated from their diets, making no connection between the plastic-wrapped pieces of muscle they purchase in the supermarket and the animals they were once part of. Still, Austrian director Nikolaus Geyrhalter presents dozens of memorable and fascinating images, not all of them of the gross-out variety. In fact, there's even an abstract beauty to some of what we see, at least until we realize it's all part of a vast killing machine.<br><br>Difficult to sit through, \"Our Daily Bread\" is nonetheless an important record, invaluable for those with the courage to watch it.","user":"ecko_47","rank":[30,31]},{"title":"Our Daily Bread","rating":8,"date":"30 December 2011","review":"In contrast to the well-meaning but didactic and dry FOOD INC., this documentary explores the process of mass food production without preaching or judgment. Because it is entirely wordless (well, not entirely... we hear some of the workers chatting, but since it's left untranslated, I assume it's the inconsequential small talk it appears to be). While this might make it less informative, the images speak volumes about how cold and impersonal the process is. Machines invented for extremely specific animal-rendering tasks (the \"chicken vacuum\" is a total mindf*ck), people performing repetitive and methodical jobs, massive facilities crammed with rigidly parceled animals. The cinematography is superb, with framing that is Kubrickian in its sense of scale, depth and symmetry. The film is hypnotic and meditative, giving the viewer room to form his own opinions, to wander down different avenues of thought regarding how we produce and consume food. Geyrhalter is careful not to dehumanize the workers, no matter how inhuman the process is. We often see them hanging out, or enjoying their own meals. Don't hate the playa, hate the game. And one doesn't get the sense is Geyrhalter is merely finger-wagging. Although there are brutally disturbing images (maybe worse than any other slaughterhouse footage I've seen), there is almost an admiration for how efficient these routines are. But again, any conclusions you draw are your own. Will I change my consumption habits? Knowing me, probably not, but it certainly got me thinking about it.","user":"MartinTeller","rank":[10,10]},{"title":"Documentary of the food industry in Europe","rating":10,"date":"20 January 2007","review":"The quality of the this film, how it focuses on the various aspects of large and highly advanced agricultural processes used in Europe is very interesting and seems to include a great amount of detail in the various processes that result in the meat and vegetables that are destined to show up on people's dinner tables. From feeding beef cattle to harvesting Irish potatoes we get fine quality shots that include so much information both close-up and deep shots. Most of us are so distanced from how our food is produced. Most producers I would imagine don't really want to let us in on what goes on before the products shows up in our market showcase. The candidness of the images that show the operations where the food is grown and processed is great. I bet that few food producers in the U.S would allow such filming in the establishments","user":"bobby-conn","rank":[29,34]}]