[{"title":"Why so many haters","rating":7,"date":"25 April 2007","review":"I will never understand the haters of the zombie genre. Just like romantic comedy these gems are not made for everyone.<br><br>The few people who appreciate a good zombie movie will see the originality and joy in this movie. Granted it is not scary..AT ALL and it isn't nearly gory enough, but still this movie deserves its due. It took a concept that has been done to death, people locked in a confined area fighting back a zombie invasion...(Night of the Living Dead being the blueprint) and gave it a twist that I really appreciated.<br><br>Being trapped in a confined space with the Zombies, leaving you with zero room to hide and none of that long drawn out psychological mind-screw most films rely on to kill time.<br><br>I loved this movie, and if you love zombie flicks, I'm sure you will too.","user":"my-boomstick","rank":[67,89]},{"title":"You'll wish it were *just* snakes on a plane!","rating":7,"date":"7 April 2007","review":"This demented and adorably over-the-top gory zombie flick was presented and introduced here at the Belgian Horror &amp; Fantasy Festival by its writer/creator Scott Thomas. He claims that, in spite of all the obvious plot-similarities with \"Snakes on a Plane\", his film is definitely NOT a quick cash-in on the huge success of the 2006 summer-blockbuster and that the basic concept and the pre-production phase of \"Plane Dead\" actually predate \"Snakes on a Plane\". Well, I don't know if all that is true, but I tend to believe Thomas because he's such a nice guy and he seemed very confident. Moreover, even if \"Plane Dead\" simply was a rip-off of the popular Sam L. Jackson hit, I still wouldn't care that much, because it's such a tremendously entertaining and enthusiast splatter-flick! As long as you don't expect new and groundbreaking story lines and/or highly intellectual dialogs, \"Plane Dead\" honestly can't fail to amuse you. In most departments, it's even far better and more appealing to horror fanatics than \"Snakes on a Plane\", because it's a lot faster, cheesier, gorier and shamelessly features all the standard clichés us genre fans love so much. Safely protected in the cargo-hold of the red-eye flight from L.A. to Paris, a mysterious scientific experiment is transported out of the US by its malicious creators. The unscrupulous Dr. Leo Bennett and his loyal researchers developed a virus that rapidly destroys human DNA, only to revive the infected victim again as a bloodthirsty and unstoppable zombie. He plans to sell his formula to the military in order to create the ultimate soldier, of course, but some unanticipated turbulence and noisy passengers on the 747-flight cause the female \"test-case\" zombie to resurrect a little early, and she immediately begins to feast her way through crew and passengers. Once bitten, the victim turns into a zombie as well, and pretty soon the plane is overrun by seemingly more zombies than there were passengers in the first place. It perhaps takes slightly too long before the zombies run loose on the plane, but when they do \"Plane Dead\" turns into a non-stop series of laughs, creative deaths and extreme gore. Apparently, only stereotypes were allowed aboard this flight and it's always a lot of fun to watch those getting killed off one by one. Naturally it's the elderly pilot's last flight before retirement, there's the heroic copper  who eventually has to save the day - transporting a witty criminal, arguing teen couples, sexy yet empty-headed stewardesses, couples with marriage issues and Tiger Woods' biggest competitor himself! The gore is guaranteed to please people, as the script features several ingenious new methods to kill zombies, like an umbrella through the head, nine-iron golf clubs and of course airplane engines. Be honest, what would you rather get face-to-face with whilst stuck in an inescapable location: ordinary snakes, albeit a little venomous ... or filthy, virulent, ravenous and outrageous zombies? There are quite a few recognizable faces in the cast, like Kevin J. O'Connor (the creep from \"Lord of Illusions\" and \"Deep Rising\"), Erick Avari and Richard Tyson. The lines and characters are often very funny, the make-up effects are delightfully campy in an old-fashioned way and there even is an occasional moment of genuine suspense. \"Plane Dead\" is awesome horror-entertainment and I hope Scott Thomas will enjoy the success he deserves with it.","user":"Coventry","rank":[68,92]},{"title":"Not a masterpiece, but fun and worth watching.","rating":6,"date":"2 June 2007","review":"If you're a zombie fan, this is worth watching, but it's not one of those gems, like Undead or Dead Meat, that you could watch again and again. Ideal for a good one-night rental.<br><br>There are tons of really awful zombie flicks out there, with stupid dialogue, bad acting, and even worse makeup and F/X. Then there are the few really awesome offerings, that just hit on all cylinders, and keep you on the edge of your seat and begging for more. This movie is neither. It's truly not a bad movie, either in the general sense, or simply as a zombie flick. In fact, it's actually kinda fun. The worst thing going for it is simply that it's virtually impossible to come up with anything new, since it's all been done before, so you can't help but make comparisons. Had most of the events we see in this movie not been seen before in some guise, this would probably be considered a keeper. But, since we have seen it all before, it's important to ask yourself one, simple question: Did I enjoy myself while watching this. And the answer is yes.<br><br>It's true that there are slightly campy moments. It's true that there are back-to-back scenes where in one someone hears a distant moan, but in the next doesn't hear gunfire from the same location. It's true that some of the dialogue is cheesy, and you feel the pain of the seasoned pro doing his best to recite them without feeling silly. Nevertheless, if you just allow yourself to sit back and be drawn-in to the story, and can sustain a little suspension of disbelief without falling back on the tried-n-true (albeit fun) habit of nitpicking every little mistake and silly bit, I really think you'll enjoy yourself, and can kill and hour-and-a-half that you may never get back, but won't mind losing. :)","user":"The-Kurgan","rank":[29,40]}]