[{"title":"Very Well Done","rating":21,"date":"21 August 2006","review":"In an age of silly anime and dumbed down cartoons, this Ultimate Avengers franchise is more then a breath of fresh air. Films like Ultimate Avengers 2 (and that's just what it is ... a full blown feature film)take the classic Marvel grandeur and add a modern twist. The action is intense and the story flows so very well. Classic Marvel characters like Iron Man, Captain America and the Black Panther (the worlds first African-American superhero) really shine in this format. My only real disappointment lies in the fact that the Hulk wasn't really used and that the Thor depicted is nothing but a watered down version of the classic Thor. Still, the other characters and the riveting story more then make up for any shortcomings. The alien threat from the first film is handled and resolved brilliantly while doing so without it being necessary for the viewer to have seen the first movie. That's a hard thing to pull off but, like the rest of the movie, they did it so very well.<br><br>Great animated movie that's well worth anyone's time and effort.","user":"sidfargas","rank":[20,28]},{"title":"Ultimate Avengers II: A step up from the first","rating":5,"date":"16 December 2017","review":"I walked away from the first Ultimate Avengers movie somewhat underwhelmed, I felt it lacked depth and a decent antagonist.<br><br>Though this suffers from many of the same issues I consider it an improvement. Although there is little story to speak of its direct continuation gives it an additional star from me.<br><br>Telling the story of the Chitauri returning to attack Africa and the Black Panther joining the Avengers to fend them off. Pretty standard stuff, but its been done relatively well.<br><br>I'm just not keen on the \"Ultimate\" stuff, I like consistency not alternative dimensions and timelines. Because of this there are bits here and there that bothered me more than they really should.<br><br>A harmless effort for fans of Marvel anime but don't expect much.<br><br>The Good:<br><br>Improvement on the first<br><br>Great antagonist<br><br>Direct sequel<br><br>The Bad:<br><br>Some characters look weird<br><br>Panther powers, really?","user":"Platypuschow","rank":[7,8]},{"title":"Pretty Good","rating":7,"date":"9 August 2006","review":"I really liked it. However I think when you have that many characters it's probably not a good idea to introduce a new one, especially a character like the Black Panther. He's cool, he's just not that well known. I wonder if they introduced him because there might be a Black Panther movie coming up? Anyway, my main gripe with the movie is the Hulk. He's the reason why I and a lot of others watch the movies in the first place, and then after the first one they just sideline him? What kind of logic is that? The Hulk is money in the bank (green). Way way way underused/abused. Bring him back. I think the creators (who have done a great job) should look at Bruce Timm et al.'s Justice League series to handle that amount of characters and still please everyone. I think JL was done in such a way (that is, after the first season's somewhat rocky start)that the episodes played to each of the characters strengths. I don't think this has happened in the Ultimate Avengers 2. The first one was much closer to accomplishing that. Also, after the first one and waiting for the second I was disappointed with the plot, same villains, same set up. I was like, \"The first movie all over again...\" It obviously wasn't exactly like the first but I thought it would have played better if the creators broke from the first one altogether and started a new plot. I was disappointed with the plot in UA2. Over all, it's very good. Animation is great, action is great, voice talent great. It's great to see Captain America back the way he always should have been. I think with these creators we're in very good hands. But bring back the Hulk!!!!","user":"dylanmiles1","rank":[15,22]}]