[{"title":"A pleasant surprise","rating":7,"date":"27 March 2009","review":"Let's get this out of the way first: I'm not a huge fan of DreamWorks Animation. Usually consisting of nothing more than unfunny pop culture gags, I think the majority of their films are mediocre at best, with the only ones that I really enjoyed being the first Shrek and Kung Fu Panda. The trailers for Monsters vs. Aliens did get me interested, though, and the voice cast seemed pretty impressive. Even so, I was still fairly skeptical about how it would finally turn out. Now, having seen the film, I have to say that I was very pleasantly surprised.<br><br>There isn't a whole lot in the way of story and character development, but suffice it to say, it serves its purpose. What makes Monsters vs. Aliens such an enjoyable film is how it works as a comedy. The pop culture references are still present, but I found them to be more clever and funny this time around, and in much smaller amounts. I was smiling through virtually the entire film, and had about 5 or 6 hard laugh-out-loud moments throughout. As expected, I was also very impressed by the voice cast in this movie. Hugh Laurie does a fantastic job as the voice of the sophisticated (though mildly insane) Dr. Cockroach, and most of the laughs are generated by Seth Rogen's performance as B.O.B.. Even Reese Witherspoon helps you feel some sympathy for her character near the beginning of the film, and Stephen Colbert does a surprisingly solid job as President Hathaway.<br><br>The 3D, while not used as effectively as it was in Coraline, is still one of the more impressive showcasings that I've seen, and that's largely due to the film's incredible action sequences. Seriously, this is some of the best action that I've seen in an animated film; as far as I'm concerned, it's right up there with that of The Incredibles.<br><br>Overall, I found Monsters vs. Aliens to be a surprisingly entertaining film, with clever and witty dialogue, as well as terrific action. I'm not usually in favor of sequels, but if they're able to keep it as balanced and charming, I would honestly like to see this become a successful, long-running franchise. Nice job, folks at DreamWorks Animation.","user":"Apemangalore","rank":[117,153]},{"title":"A little underwhelming, but still good fun.","rating":7,"date":"6 April 2009","review":"Okay, I'll admit I'm not big on CG movies as I always find 2D animation much more convincing and involving but I had a good time with this (along with a some relatives) and it's a pretty cool movie. However, I kinda felt a little underwhelmed; the story is good, but there's just wasn't enough substance along with the characters and action. I just felt it needed more. But it's a treat to see all the nods to '50s classic era of films that Monsters Vs Aliens pays homage to along with some good messages about being true to yourself and looking beyond one's appearance in order to know someone. Seeing the film with 3D glasses was a cool idea but in my view, 2D will suffice but still, it's good family entertainment for an afternoon. Hopefully the next film will have more ooomph, more \"Monstrosity\".","user":"johnnymacbest","rank":[32,42]},{"title":"Great Animated Film. Don't listen to the naysayers.","rating":23,"date":"23 July 2010","review":"I honestly don't know what some of these people who've reviewed this film were expecting.<br><br>Sure, it's called \"Monsters Vs. Aliens.\" No, that DOES NOT mean that it HAS to be about five thousand monsters fighting five thousand aliens. You people watch too much Predator vs. Aliens.<br><br>What this was was a story about one girl, what happens to her and the challenges she faces.<br><br>And it's funny. Very funny, in an adult, dry and quirky way. It's not trying to be generic, which seems to be what some reviewers want. It's not trying to be a spectacle, like other reviewers expected it to be.<br><br>It's a well told comedy about this girl Susan.<br><br>My three year old has seen this movie somewhere in the range of 40 times. I've had to sit through it at least half of that and, quite honestly, it doesn't grow old for me like A Bug's Life or something in that vein might.<br><br>Too many people with too specific expectations - and no concept of what's good. Must be why Transformers made so much money.","user":"LOQUE9","rank":[19,24]}]