[{"title":"What's The Deal With Nicholas Cage?","rating":7,"date":"14 January 2009","review":"Is it my imagination or has Nicholas Cage been involved in a lot of B-type films the past decade? I pretty much enjoyed this movie, don't get me wrong - but it's still not what you'd call a classy movie, not the kind of film he'd be involved with years ago. Now, he seems to prefer playing total wackos in stories that don't have a lot of credibility. <br><br>Here, he's a Joe The Hit-man in Thailand, who falls for Miss Wholesome, and then turns \"Rambo\" by killing 50 people while en route to saving his protégé. The only thing not a cliché was the ending; that was a bit of a shocker.<br><br>Shahkrit Yamnarm costars as \"Kong,\" a man who becomes \"Joe's\" student. He's the one Joe saves. Charlie Yeung, a winsome Hong Kong actress who is almost 35 years of age but could pass for 21, plays Joe's love interest. Get this: she's a pharmacist, beautiful and wholesome as they come, and a deaf-mute! Yet, sleazy Joe sweeps her off her feet in no time! <br><br>Man, you have to really enjoy the stylish visuals and sound (which ARE very good), the pretty good.....and leave it at that, to enjoy this movie. It's better to just watch it with your brain on hold and enjoy it, because if you start thinking about it, the film gets dumb and dumber.","user":"ccthemovieman-1","rank":[55,81]},{"title":"Lame, boring and obvious","rating":3,"date":"9 September 2008","review":"I don't care how interesting the scenery is if you know the entire story arc in the first 45 seconds - and you haven't even watched the trailer. Nic Cage looks like a corpse and his acting isn't much better. The relationship that the film puts forward is as believable as a love affair between a squirrel and a stuffed alligator. Plus of course the story has Cage break every rule he says is important - but never offer a plausible motivation. Maybe the original was really something, but this version is dead on arrival and should be saved for the second DVD in a video night, when you want everyone to leave your house and let you get some sleep.","user":"azgalarneau","rank":[144,242]},{"title":"If you understand a bit of Asian philosophy, but in the same time like brain numbing action movies, this is for you","rating":7,"date":"24 November 2008","review":"It wasn't bad. Nicholas Cage looked really fat and tired, not his usually fit and tired self, and he played the cold assassin part with ease. But when it went into the 'shy in love assassination teacher that cares about his student and doesn't kill the good guys' part, it kind of felt rushed. I am sure you can see the problem here.<br><br>Basically it is a film about a man that rediscovers his soul... then dies from it. Not a fresh thing in Asian movies, but something that the (re)makers of this film bet the Americans will find cool. I, myself, understood the idea, but saw no reason in remaking the Thai movie that had the same idea and add almost nothing to it other than production costs.<br><br>Bottom line: sad-good-assassin story, with no twist. If you like stuff like that, watch it. Better than Hell Rider, anyway.","user":"siderite","rank":[28,41]}]