[{"title":"An unexpected gem.","rating":8,"date":"22 December 2010","review":"\"All I ever wanted was for Juli Baker to leave me alone.\"<br><br>Flipped is easily the best love story/relationship movie I've seen since (500) Days of Summer. I'm the kind of guy that you couldn't pay to watch a Nicholas Sparks movie, but that doesn't mean that I can't appreciate a good movie about the highs and lows of love. In a year of formulaic, mind-numbing flicks with no imagination or heart like Letters to Juliet, Flipped is a welcome breath of fresh air.&nbsp;<br><br>It's about 8 or so years in the lives of two kids who meet when when one of them moves into a new neighborhood. Juli (played by Morgan Lily and Madeline Carroll) is instantly smitten by Bryce (Ryan Ketzner and Callan McAuliffe) the second she sees him drive up to his new house. Bryce, being a typical second grade boy, finds her attention embarrassing and unwanted. As they get older, that dynamic between them remains pretty much the same, but we wouldn't have a very interesting movie if that's all there was to it. Eventually Bryce finds himself on the other side of the equation (flipped, get it?), and has to win back the girl he never knew he always wanted.<br><br>How odd is it that a movie about a couple of kids handles the topic of love in a more mature and genuine way than almost all of the adult-oriented romantic comedies that we're buried under each year? There's no doubt about it that Flipped will make you say \"aww\" on occasion, but there's a lot more to it than just kids being cute. Humor, issues of class, family conflict, and the lost idealism of youth are introduced into the story by Bryce and Juli's respective families, and there are several outright bittersweet or poignant scenes within the story.<br><br>The movie is shown from the POV's of both main characters, and often the same event will be shown from each of their perspectives. It works really well, as it really helps the viewer to \"get\" both Bryce and Juli. The kids chosen to play the older versions of the two (Carroll and McAuliffe) are both great, the fact that the story is set in 50's or 60's suburbia adds a believable sense of innocence to it all, and there is just a fresh feeling to the movie that I can't really describe with words.<br><br>I heartily recommend this to anyone who likes a good, well-written movie, regardless of the genre. You can tell that a lot of heart went into making Flipped, and it shows. Great movie.","user":"lewiskendell","rank":[112,116]},{"title":"\"Flipped\" has all of the comedy, naiveté and bewilderment of first love","rating":8,"date":"13 December 2010","review":"Juli just had to take one look at Bryce's blue eyes, and she knew it was true love. Bryce just had to take one notice of Juli's manic desperation, and he knew it was going to be a friendship of torment. I just had to take one look at the film's artfully designed poster, and I knew \"Flipped\" was a film to be savoured.<br><br>A beautifully told film of first love, we flip from Juli's point of view to Bryce's point of view, very effectively giving us the true nature of their friendship, love and respect they have for each other. Except in the case of middle-school graders, that love and respect can frequently look like embarrassment, mistrust, and shame. All of those emotions are told with intelligence, subtlety and humour.<br><br>\"Flipped\" has all of the comedy, naiveté and bewilderment of first love. It takes the romantic comedy farther by actually giving us characters with real depth. There is more going on than just Juli and Bryce figuring out their love for each other, and every aspect of this film is well written, touching and relevant.<br><br>\"Flipped\" is a cute film for everybody who fondly remembers that fiercely independent girl or the guy with piercing blue eyes that lived across the street.","user":"napierslogs","rank":[49,53]},{"title":"A simple, classic, heartwarming story","rating":8,"date":"28 November 2010","review":"Of all the movies I've seen lately, Flipped was amongst the most refreshing. If it had been done by a different director and had different screenwriters, it might be a terrible cliché. Story of first love, known each other since kids, bla bla bla, we've all heard it before.<br><br>But this movie, it was so pure and so realistic, which is what I love about it most. It wasn't over the top romantic, but it was enough to tug my heartstrings and made me go \"awwww\" instead of going \"ewwww\".<br><br>The characters felt like real people, and the issues faced in the story felt so real and believable, it made me believe in the basic form of love once more, and that it still existed in real life (even though I know it's just in the movies, but still).<br><br>Anyway, if you're looking for a story that is refreshing yet vintage, and wanting to have a lovey-dovey grin plastered on your face, then this is the movie to watch.","user":"nutsbout_you","rank":[66,73]}]