[{"title":"fantastic trip","rating":9,"date":"21 April 2007","review":"The discussion about this movie is wide. Some people hate the movie, some people adore it. Probably it will be a movie which will be much more popular in time. For me it was one roller-coaster of laughing and an experience i wont forget for a long time. At the same time i saw people leaving the cinema because of the rough, unpolished use of language. I have been living in Belgium for a few years, which is an advantage to understand the humor of the used dialect. The brilliant thing about the movie is that it is a one on one translation of the writer Herman Brusselmans. I saw the movie and asked myself the question, how would i have directed this book differently. I couldn't find an answer. This is Belgina cinema on his best. A fabulous devastating trip.","user":"ruud-35","rank":[45,57]},{"title":"A Shock to the System","rating":8,"date":"4 February 2007","review":"It stands to reason that a film version of perhaps Belgium's most controversial author (the revered and despised Herman Brusselmans) would produce an experience every bit as extreme and sulfurous  with audience response to match  as his books. He regularly spits in the face of \"political correctness\" with outrageously misogynist or downright misanthropic remarks, sometimes about local celebrities, which has landed him in court on a few occasions. Graphic descriptions of sex and violence have become so prevalent in his work to the extent that they could serve as its very definition in the minds of many. First-time feature director Koen Mortier (responsible for a couple of well-received shorts, rarely seen outside the festival circuit though, and a really striking commercial starring Olympic swimmer Fred Deburghgraeve) had his work cut out for him then with this (first) adaptation of a Brusselmans novel, arguably his most popular literary effort to boot.<br><br>Transposing the action from Ghent to the coastal town of Ostend (a virtual stone's throw from where I live, in fact)  apparently because of the people ultimately cast came from around there and spoke the local dialect  the story is told from the point of view of the writer's alter ego, Dries (Vanhegen, who looks and sounds remarkably like a younger, sexier version of Ostend's most successful export, singer/songwriter Arno), who receives the unusual request from a trio of physically challenged musicians to join their band and take part in an upcoming rock rally. Intrigued, Dries accepts the offer, which prompts a series of events that will lead to death and/or dismemberment for most characters. Unlike most other writers, Brusselmans goes against the grain and makes his own character the undeniable villain. Intellectually superior to the other band members, and smugly aware of it (allowing him to assume the role of misplaced moral judge), Dries cruelly manipulates his newfound \"friends\" with all the dispassionate detachment a professor might display towards the lab rats in his experiments. This has the effect of some sort of shock therapy for the audience, opening their eyes to the plight of people they might otherwise all too casually dismiss, pointing out their similarities to our own superficially superior human condition rather than the glaring differences most other media (think tabloid newspapers and TV's despicable \"reality\" shows that are usually anything but) pounce upon.<br><br>Characters may appear grotesque, but the cast makes them human. Stand-up comedian Gunter Lamoot shines as gay farm boy Jan, living with his demented, strapped to the bed dad (the inimitable François Beukelaers, leading man of Marc Didden's despairingly downbeat BRUSSELS BY NIGHT) and bald as a billiard ball, wig-wearing mum (an absolutely unforgettable performance by Bernadette Damman). Dancer Sam Louwyck, a good friend of Deus front-man Tom Barman and star of his directorial debut ANY WAY THE WIND BLOWS, turns in a highly physical performance as ever, of course, only this time he also proves to possess sufficient dramatic clout to fulfill the part of the deaf guitarist Ivan, living the derelict life with his drugged-up wife and bawling baby girl. It is TV actor Norman Baert however who provides the movie's greatest revelation as the psychotic Koen, whose continuous ranting and raving against women makes for some of the funniest as well as most harrowing moments when words lead to violent actions.<br><br>With something to seemingly offend anyone whether you're female, homosexual, of a different race or religion, this inflammable material is approached with admirable restraint for most part by Mortier. Unlike the morally bankrupt Dries (hey, we only share a first name, right !), he doesn't judge but merely observes, to the point of scrutiny even. A few distancing effects (characters walking on ceilings or moving backwards) are thrown in for good measure but never to the extent that they detract from what's really important here. Rather, they create a false sense of security in the movie-savvy audience (allowing for a TRAINSPOTTING reference or two to placate the oh so knowledgeable), only to hit them hard when the narrative moves from humor to horror in one fell swoop. A further tribute to Mortier's prowess as a filmmaker comes from the local media's hysterical reactions to the movie, leading to a subsequent ban from cinema mogul Kinepolis (temporary, as they relented by the second week of release due to fairly impressive audience figures at rival theaters), screaming of extremes that are ultimately far more implied than actually shown. Proving that viewer imagination's a potent thing, this does in no way make EX-DRUMMER any less of a radical movie-going experience. The music (by the likes of Flip Kowlier, Millionaire and, yep, Arno) may shatter your ear-drums, but the story breaks your heart. None of these people are anywhere near monstrous or caricatures (even a character whose nickname translates as \"Big Dick\", played by the phenomenal Jan Hammenecker from Fred Fonteyne's MAX ET BOBO, is granted a surprising humanity) so that in the end they force every single one of us to take a long hard look at ourselves, our so-called \"dark side\", warts and all. Perhaps the movie's best joke, conspiratorially played on us by Brusselmans and Mortier, is that its nihilist surface covers an enriching  dare I say \"life-enhancing\" (or should I leave that to the Prozac-popping folks at Hallmark ?  experience. But don't take my word for it. Go check it out for yourself. Pronto !","user":"Nodriesrespect","rank":[33,42]},{"title":"A work of pure GENIUS","rating":10,"date":"28 November 2014","review":"I have rated 755 films on IMDb; I've watched many more, I suspect. Finally, a film has caused me to write a review out of pure respect to the creators.<br><br>If you like:<br><br>surreal cinema, extreme violence, dark humour, transitions from guilty laughs to gut-wrenching, sickening imagery, thought-provoking intelligent drama which superficially looks and sounds unintelligent<br><br>then you may well feel the same about this film as I do.<br><br>Quentin Tarantino is one of my all-time idols. If he had made this film the world would have raved about it.","user":"OscarZetaAcosta","rank":[16,19]}]