[{"title":"Rob Reiner's best film since the turn of the millennium","rating":8,"date":"5 May 2016","review":"Lovely, thoroughly enjoyable movie with lots of nice words and thoughts exchanged, some to make you laugh, some pretty profound to make you ponder on. Who would've ever thought that a story about two dying men could be such fun. Edward Cole (Jack Nicholson) and Carter Chambers (Morgan Freeman), so far complete strangers, with rather different economic and social backgrounds (billionaire hospital magnate and body shop mechanic), both terminally ill, thus inevitably at closing stages of their earthly lives, meet and, in order to try to experience things from their \"bucket list\" (a list of things to do before one \"kicks the bucket\", i.e. dies) before the final curtain falls, embark on nothing less than an amazing journey. Although age-wise much too \"developed\" for many youthful activities they engage themselves in, and despite their individual differences, however sufficiently open-minded and open-hearted, two protagonists, through their earnest performances and their great interaction easily draw us into their well believable story (with single fantastic twist at the end... (spoiler)... realization that rather than through eyes of the still surviving one, the story was told from the mind of his ensuing spirit), whether (constantly) putting smile on our face or tears to our eyes, ergo covering (well, for us viewers) one of listed items, \"laugh till I cry\".<br><br>...On a more personal note, eight years ago when I first saw this movie in a theatre, I was a solitary man, going fifty, thinking that I have already experienced things which could make my \"bucket list\" (climbed high mountains (Mont Blanc, Gross Glockner, Triglav, Durmitor, Fujiyama, Kilimanjaro... to name a few), visited Great Pyramids, well not Great Wall of China, but at least Great Wall of Ston, well not Taj Mahal, but instead many other magnificent temples (Angkor Wat in Cambodia, temple of Karnak in Egypt, temples of Nara, Japan... to mention a few), been on safaris in Tanzania and Rwanda...) to reference those matching items pursued in the movie. Now, after its second viewing, coincidentally on my wife's birthday, I'm almost sixty realizing that only by starting a family and having this cute little toddler of ours to chase and play with every day (and... quoting another listed item, in \"kiss(ing) the most beautiful girl in the world\", compete with her mother), I have pushed my life's wish list much closer to completion...<br><br>Finally, after a decade of his successes in 80-ies and beginning of 90-ies with movies that I have enjoyed watching very much (\"This is Spinal Tap\" (1984), \"Stand by Me\" (1986), \"The Princess Bride\" (1987), \"When Harry Met Sally...\" (1989), \"Misery\" (1990), \"A Few Good Men\" (1992)), \"The Bucket List\" marks Rob Reiner's successful comeback and it stands as his easily the-best-of-the-new-millennium directorial effort thus far.","user":"Davor_Blazevic_1959","rank":[71,76]},{"title":"Put two Brilliant Actors together and what can you expect","rating":10,"date":"21 December 2007","review":"A simple premise done magically is all I can say about this movie.<br><br>Morgan Freeman and Jack Nicholson are by far and away two of my favourite actors. Jack Nicholson is just funny, no matter what he says or does, ever since Terms of Endearment he has made me laugh so hard that I cry and Morgan Freeman is just the best actor going around. I find it hard to remember a bad movie that he has done.<br><br>Probably not everyone will like this movie but it is definitely up there with the best feel good/sad movies that I have seen....and it has a moral that most of us miss in our hectic, live for the now short lives.<br><br>This is going to be up there with the best at the Oscars in 2008.<br><br>It will make you laugh and cry all at once...it did me.","user":"nowego","rank":[328,431]},{"title":"As much silly as serious","rating":14,"date":"14 December 2007","review":"\"The tragedy of old age is not that one is old, but that one is young.\" Oscar Wilde, The Picture of Dorian Gray<br><br>Now and then I should rethink what I've been learning all these years as a critic because I predicted The Bucket List would have all kinds of holes in it. It did, but they were tiny blemishes in an otherwise solid frame. This is a good movie, as much silly as serious. And therein lies the skill of director Rob Reiner, who makes sure Jack doesn't kill the lines with bluster and Morgan doesn't drown them in vocal sweetness.<br><br>Edward (Nicholson) and Carter (Freeman) meet in hospital where they have been given less than a year to live because of cancer. They bond, create the \"kick-the-bucket\" list of ten things to do before dying, and then do them. The hokey process shots at several of the world's wonders indicate the surety of Reiner's direction where he evokes the old Hope and Crosby road pictures and emphasizes that the journey is the important thing, not the destination.<br><br>Both men laugh and cry and change in subtle ways that make this not a maudlin exercise in death denial but rather a celebration of love through friendship, regardless of the grim future. Although Justin Zachman's script is overall weak given the actors' worth, there are lines that save it all from mediocrity: As Edward the cynic says, \"We live, we die, and the wheels on the bus go round and round.\" As Carter the humanist says, \"You measure yourself by the people who measure themselves by you.\" The two philosophies, fate and love, caress in a slow dance to recognition of life's true value.<br><br>The Bucket List is not half as sappy as I sound so far; it is a sober rendering of life's lessons at the end by two different men who find their common humanity.","user":"jdesando","rank":[233,306]}]