[{"title":"An eye for an eye, and soon the whole world is blind","rating":7,"date":"25 December 2008","review":"It's very easy to understand why people hate this movie.<br><br>Blindness is directed by acclaimed film-maker Fernando Meirelles, with a story based on a novel by award-winning writer Jose Saramago. It stars Julianne Moore and Gael Garcia Bernal. What could go wrong? <br><br>Well, this is one the most depressing movies I've seen in recent years. <br><br>Don't be fooled, the genre of this movie is Horror, albeit done in an ultra-realistic way, much like the Brazilian movie wave of the 70/80's - gritty, violent, dirty, and ultimately hopeless. <br><br>However it's not a horror movie in the common sense. It's not scary because it has ugly monsters. It's not frightening because there is a lot of gore and blood. What freaks me (and others) out over this movie, is that it tells a story that could happen, and actually, is happening. If one can't see that, then one is as blind as the characters in the film.<br><br>The movie is technically brilliant, with great acting and top-notch effects. The story takes place in a non-specific city, but some of it was clearly filmed in São Paulo. The movie poses the question, \"what if suddenly everyone in the world became blind\"? This is a practical question as much as a metaphorical one.<br><br>I don't think this movie can be \"enjoyed\". The violence is suggested rather than seen (which IMHO makes it scarier). It can, however, be appreciated, as its shocking nature is nothing more than a wake-up call for humanity.<br><br>Having said that, Meirelles took a huge risk (the novel was considered to be un-filmable) with this film, and the result was a lynch-mob reaction from both critics and audiences. I wonder how this will impact Meirelles' future works.<br><br>I will dare to suggest that, if this had been filmed in Spanish or Portuguese, it might have been hailed as a cult movie. As it is, it's too alienating for audiences that are used to happy endings and fake-violence, or people who watch movies solely to pass the time.<br><br>This one is for 'hardcore' movie fans - don't watch it if you're depressed or sad. And it offers the viewers very little in the way of comfort. However, it's so well-executed and disturbing, that you can't help but agree that their goal was reached. Unfortunately, the marketing and the names involved with 'Blindness' misled many viewers who otherwise would never dream of watching this.<br><br>It's not a perfect film by any means, though. The music (specially in one crucial scene) just feels out of place sometimes. And If you can't picture yourself as a blind person, some things may not make a lot of sense, too. There is a scene however in which one of the characters sings a very popular song in a slightly different way - one you are not likely to forget anytime soon.<br><br>Approach with caution, and preferrably, alone. You don't want to lose any friends or potential dates. But I also think that to miss out on this movie is like losing a chance to watch one of the most thought-provoking films of this year.<br><br>7/10","user":"pmdawn","rank":[267,367]},{"title":"Opens your eyes for something you don't want to see","rating":8,"date":"15 August 2009","review":"The movie has its merits. It brings you into the story, making you feel all the emotions felt by the characters, and in my opinion this is why some people didn't like it; it opens your eyes for things that nobody wants to see. I'm not saying that a disease like this one could happen, but others may come, and that's a reality.<br><br>The movie makes you feel extremely uncomfortable; I caught myself thinking about leaving the room sometimes. The atmosphere that Fernando Meireles built is so heavy and dark (even thought the whole movie is full of bright colors) that it makes you feel something like depression, sadness, and you keep thinking in the movie after it has finished. The acting helped a lot in this aspect; all the actors did their best to give a perfect sense of reality.<br><br>If you want just to spend some time watching a good apocalyptic movie, this is not the one. It may be considered as \"cult\" in someway, by the fact that you don't watch it to get entertained, but to reflect about it.<br><br>If I had to grade this movie based on how I felt during it, I would give it a 0, but I have to say that, above everything, it is a great movie.<br><br>8/10","user":"guynaba","rank":[112,155]},{"title":"Disappointing if you have read the book","rating":6,"date":"22 February 2011","review":"An adaptation of the allegorical eponymous novel by Jose Saramago. It tells the story of a group of people who are confined in an old abandoned asylum by the Government after the spread of a global pandemic of a strange contagious white blindness.<br><br>The movie follows well the book story, but completely forgets the human and social critique, and the philosophical and political questions embedded in it. In fact, the original title of the book is Essay on Blindness, and it is part of a series of philosophical-literary essays on different themes related to humanity, social and political structures. In other words, the soul and insight of the book are lost in translation.<br><br>The book is confronting, shocking and much harder and darker than the movie. The movie is a succession of weird shocking events that have no point, a confrontation between good and evil in an apocalyptic world... Wrong and simplistic. This is so because the scriptwriter and the director missed the most important elements of the book, or, simply, thought that the viewer would not want or understand more complexity.<br><br>Part of my disappointment has to do with the acting. Most of the actors are uninspired and badly directed, and some of them miscast. I did not believe them at all in their roles, especially Ruffalo and Moore, who seem not to believe the roles they are playing or the circumstances in which they are placed. I found stereotypical and offensive the use a Hispanic -played by Gael Garcia Bernal- as the bad guy; I mean, that's typical of mainstream stupid Hollywood movies, and it was not in Saramago's book.<br><br>It is great that we can experience the white textured involving blindness that the characters suffer, which is beautifully portrayed in the movie. However, there is too much clarity and whiteness in the movie, which is overwhelmingly white and on-purpose blinding, so we, the viewers, become a little blind too. I did not thing that was necessary. I think the director could have shown the white blindness from the point of view of the people getting blind, so the viewer can imagine what it is like, and then make the movie darker and moodier. The viewer is going to watch the movie, but cannot be part of it.<br><br>Miralles shows his savoir-faire in some of the most difficult scenes, the ones involving the women going to ward 3, shot with great sensitivity (they are raw and disturbing in the book), more suggesting than showing, creating and atmosphere that shows the drama but not the raw facts. It works perfectly. I also found great the depiction of the desolated city, the chaos and dirtiness the city -unnamed- is reduced to, and the life of the gangs of blind people and dogs in the streets. The music is beautiful -a mix of ethereal, quirky, strange and delicate elements- and serves the story very well. To add another positive element, Saramago's book is not easy to read, among other things, because of his literary style, so the movie is an easier approach to the story and it is still interesting.<br><br>Saramago, who never agreed to sell the rights of any of his books to any film producer, did so in this case and after a long negotiation. Miralles directed the movie always having Saramago in mind, and what he would think about his cinematographic options while adapting the novel. Saramago attended, side by side with Miralles, the premier of the movie. A video in Youtube (watch?v=7XzBkM_LdAk), shows the end of the movie, in which Saramago is visibly moved, and says that he feels as happy at watching the movie as he did when he finished his book. Well, as a reader, I can't disagree more.<br><br>The movie has bad reviews in general and, in this case, I think they are deserved. To me, is the lack of depth and soul, the mediocre acting and the poor direction in major subjects ruins the interesting premises and storyline. Not all viewers are morons, and it is up to the director to direct and edit the movie, and lead the actors to the point in which they become the characters they are playing. Don't expect the viewer to fill the gaps and inconsistencies of any movie and make an essay on blindness from a bunch of apocalyptic events.","user":"Imdbidia","rank":[36,47]}]