[{"title":"bad bad bad and bad, I had all caps but IMDb told me not to shout","rating":1,"date":"9 October 2006","review":"It is only getting one star because there isn't an option for a complete zero. I have seen better day time cartoons than this movie. Not only was the plot stolen from SAW, it almost seems as if you're watching the movie again but yet through the eyes of a 2 year old. Awful acting, poor script, VERY VERY BADLY DIRECTED, I really just don't know how to tell you to stay away from this movie other than please.. rather than waste your time watching this, just think of all the harm you could be doing to the ozone.. or maybe even go to your kids softball game, or just stick your finger down your throat and induce vomiting to get the effect of how you will feel after watching this movie knowing you will never be able to get this part of your life back forever. LOL","user":"oojijoo","rank":[60,76]},{"title":"Garbage!","rating":1,"date":"22 January 2007","review":"Garbage. That's all I can say about this piece of crap. I was rooting for the killer. The main characters were so irritating and stupid, I wish they would have died earlier. Didn't the killer think about the fact that these \"teens\" would tear out those low hanging cameras? How about the dumb loud mouth girls standing in the middle of the room in the only light available making enough noise to raise the dead. Stupid! Most annoying people I have ever seen in front of a camera (I will not call these people actors, they couldn't act their way out of a paper bag). Never mind that the movie is a blatant rip off of another movie. Even if it wasn't, I'd still call it a piece of crap. When are they going to stop making these \"teenagers in peril\" trash? I'd almost rather see remakes. There was nothing entertaining, sexy, or interesting about the film. What a waste. I'm never renting Lion's Gate garbage again. After Mr. Jingles, I should have known better anyway. Save your money and watch \"Saw\" again. There's nothing but stupidity here. The only good thing about the movie is...hopefully all the casting agents will see the crappy actors in this dung heap and refuse to ever put them in front of another camera. I hated this movie! No doubt about it! I hope some of the technicians involved used a fake name. They deserve better than have their name on this piece of trash.","user":"c-f-eller","rank":[19,22]},{"title":"cheap saw imitation","rating":3,"date":"18 September 2006","review":"Are You Scared is a cheap imitation of Saw. A madman kidnaps a bunch of teens who apply for a reality TV contest. Turns out the show is way too real for everyone as they all start dying in contests where there is no way to win and there is an audience of one. Everything moves pretty fast, which is nice when the effects and dialog are well below average. Lighting was terrible, camera work was fine, screen play was OK. Directing was marginal, and editing was good. Some twists at the end made it a little more interesting. One thing I noticed is that I didn't feel sorry for the characters when they died because they were all pretty annoying. Even the police and FBI characters didn't generate any real sympathy.","user":"wrlang","rank":[32,40]}]