[{"title":"Great performances all-round and directing make this well worth watching","rating":8,"date":"20 January 2011","review":"Despite not having seen Gone Baby Gone, I've heard a lot of good things about Ben Affleck's switch to directing and so I decided to watch The Town, which put simply is about band robbers but to expand on that, the film is also about the leader of the group, played by Ben Affleck. <br><br>When watching the trailer it easy to draw comparisons to Heat and The Departed but this is different. Many films about crime make the audience side either the police or the criminals yet The Town allows the audience to see people from both sides of the law fairly. Jon Hamm plays an honest working FBI officer while Ben Affleck plays the criminal. The film is shot predominately from the criminals perspective, therefore the audience feel the same sense of urgency that they do but we don't want to see them gun down the FBI and police and let them get away with their crimes. It is a difficult challenge for the director to deal with but he does it well and the end result is very good.<br><br>The entire cast are all fantastic even when given smaller roles, for example Chris Cooper and the late Pete Postlethwaite steel the scenes that they are in. Jeremy Renner has earned a lot of attention from his role and he deserves it, giving an honest performance, which clearly took a lot of research to perfect. An almost unrecognisable Blake Lively and Rebecca Hall are both great. Ben Affleck and Jon Hamm as the opposing forces are also great but it is Renner's performance that stands out.<br><br>As a crime film, it is important that the action doesn't turn the whole film into an all guns blazing film. The action scenes are handed pretty well and the car chases through the minor roads of Boston are really exciting to watch.<br><br>The Town is not only only a solid action/ crime film but also marks Affleck as a great director. I strongly recommend this film if you are interested in the genre. While it is not perfect, it does so much well, that you would be missing out if you didn't see this.","user":"lekgolah","rank":[63,74]},{"title":"One of the finest pieces of ensemble acting in years","rating":8,"date":"17 September 2010","review":"To say that The Town is everything Takers tried to be and failed at would actually be an insult to Ben Affleck's latest film. Mentioning that bland rehashing in the same breath would imply they even exist on the same plane, but the honest truth is this gritty Boston crime drama is something special and the best film of the early fall season.<br><br>Affleck's first foray into directing with the Dennis Lehane adaptation Gone Baby Gone shocked viewers and the critical community in kind, showing that a fading acting career does not mean one is down-and-out in Hollywood. Affleck marries his two passions in The Town, directing, producing and writing the film as well as starring in the lead role, his first since 2003's Paycheck. He owns this comeback performance, successfully wiping any lingering distaste from duds like Daredevil or Gigli. This is by no means a one-man show, but The Town has nothing close to a weak link, in fact, this may be one of the finest pieces of ensemble acting in years.<br><br>Joining Affleck in a supporting role is Jeremy Renner, fresh off his best actor Oscar nomination for The Hurt Locker and he beyond a doubt proves he is no one-hit wonder. This is Oscar-worthy acting yet again for Renner, nailing his Boston accent along with his loose-cannon mentality. He is terrifying, but impossible to pry your eyes away from. The most shocking revelation comes from Blake Lively (TV's \"Gossip Girl\") as a doped-up mother with more than a few issues. She is not only unrecognizable, but owns her role, never calling attention to her drastic deviation from type. Substantial buzz was also placed in the way of John Hamm from the acclaimed television drama Mad Men. He is sufficiently pompous as a dedicated FBI agent also scoring a number of the films laughs.<br><br>Before I wander too much further into specifics, the characters in The Town populate a Boston suburb called Charlestown, which an introductory message informs us, is the world-center for bank robbers. Affleck's Doug MacRay heads a team of those in such a profession including Renner as James Coughlin and two others played by Slaine, and Owen Burke. During one of their routine bank heists, they are forced to take a hostage (Rebecca Hall) during their hasty escape. Afterwards, to make sure she does not know anything incriminating following her release from captivity, MacRay follows her and inadvertently falls for her in the process.<br><br>There is nothing particularly revelatory about The Town, there are few surprises or much that deviates from a standard crime drama. But Affleck directs with such skill and confidence while showcasing yet another peek into suburban Boston that it is never less than riveting. There is an overlying sense of impeding dread that perforates The Town and a handful of sensational action sequences do little to let up the firm grasp the film has on our windpipes. Propelled by faultless acting and a pitch- perfect script, this slice of the Boston criminal underworld is everything for which we could have hoped following such a bland summer. Affleck has always been a star, and if he continues to produce films of this pedigree, then there might be hope for the movies yet.","user":"Simon_Says_Movies","rank":[114,152]},{"title":"Take a bow Mr. Affleck....you have certainly earned it.","rating":8,"date":"14 September 2010","review":"My Oh My how Ben Affleck has had a up and down career. Starting out as the cheesy yet funny guy in those Kevin Smith flicks, to the academy award winning writer of \"Good Will Hunting\", all the way back down to the pathetic string of acting he produced only 10 years ago. But there is a silver lining....with his directorial debut in \"Gone Baby Gone\", and his much improved acting in \"Hollywoodland\". Ben Affleck is beginning to once again prove his worth in Tinsel Town. Hopefully he can continue to feverish pace.<br><br>Well i can say with complete just, that this is the best \"Heist\" movie since \"Swordfish\"......Now i know most of you may not like \"Swordfish\", but what other bank robbery movie can you compare it to in the past 10 years? Maybe \"Snatch\"? \"Lock Stock\"?....eh, if you classify those movies as \"Heist\" pictures, than okay, it's the best heist movie since \"Snatch\" or maybe even \"Oceans 11\"....either way, it's a big compliment.<br><br>Ben Affleck has certainly proved that \"Gone Baby Gone\" was not a fluke. He can actually direct a major motion picture. And not only can he do it, he does it very well. Sure the movie had some minor flaws, but nothing that takes too much away from the overall big picture. The best way i can compare it is.....it's like an east coast \"Heat\". Now, the group is not as fool proof or professional as the gang in \"Heat\"......well, let's face it, you will probably never top that group in movie.....ever. But never the less, the style of film making really pulls you into each sequence, whether it be the action packed bank robbery, the emotional dialog between characters, or the intense decisions the players all must endure.<br><br>The movie doesn't try to WOW! you by offering a different style of bank robbery. Which is a good thing, because you really run the risk of tripping over your own two feet in the process. But i really think the major factor in this film, was the acting. Everyone came to play ball in this one........but i can also say this with complete confidence.......Ben Affleck was the best actor in this movie. Yes, i know it's hard to swallow for some of you, but he really showed us all, what he is truly capable of doing. So Mr. Affleck, let me tip my hat to you and say job well done sir. You took a lot of crap to the face, and you wiped it off, and came back strong.<br><br>Bottom Line......Yes, i can honestly say that this is one of the best movies of the year so far. Sure the movie gets a little sappy at the end, but it's pretty necessary. But overall, your very well entertained.<br><br>I read an article a few months ago about even after \"Gone Baby Gone\", people still wouldn't hire Affleck as a director. And he had to fight tooth and nail to land this deal. Well, hopefully now you can find more work buddy, because you have certainly earned it.","user":"blackmambamark","rank":[226,323]}]