[{"title":"Wesley Snipe's career returns from the dead and feasts on spaghetti using Leone and Joderowsky's silver spoon","rating":5,"date":"11 July 2015","review":"Synopsis: In an arid wasteland created by too many lacklustre Hollywood mash-ups, critics think they've put the final stake in Wesley Snipe's career, but surprisingly it returns from the dead and feasts on spaghetti using Leone and Joderowsky's silver spoon.<br><br>Verdict: Ambitious, imaginative and visually impressive film that warrants obvious comparison (Leone), but seems more indebted to El Topo's art direction and non-linear, Gothic, psychedelic spaghetti westerns like Matalo! and Django Kill, if You Live, Shoot! Personally, I enjoy this sort of thing, but I can see why many do not; it is brazenly uncommercial and unconventional (a brave choice at this point in Snipe's career decline), and that's part of its appeal.<br><br>Several reviews have complained about the incoherent (or completely lacking) plot, but being a fan of spaghetti westerns, I've become accustomed to going along with the film's visuals - like following a good jazz number. I found the plot to be simplistic and classic western: man seeks revenge, flashbacks ensue, he gets revenge and - here's the twist - the people he kills come back from the grave ... so man seeks young apprentice to help him kill them once again.<br><br>To some degree, I agree with the negative reviews. I did find it a frustrating and uneven watch. I couldn't help but think that a much better film was possible. Several scenes are cut in a manner that implies not enough footage was shot (made all the more infuriating by the fact that most of the film is extremely well photographed, making excellent use of the Namibian locations). There's also some reliance on rather cheap looking CGI - although the removal of heads and spinal columns was quite impressive. The voice-over narration - always problematic - sounds like a bad advert for men's cologne. The narration is made even worse by two narrators, possibly a necessity stemming from Snipe's three-year prison sentence in 2010 for failure to file income tax returns (Gallowwalkers was shot just before Snipes went to prison).<br><br>The music, so important to any spaghetti western, is also disappointing, veering from more appropriate classical to some sort of alt-rock. Lastly, the climatic journey into the \"spirit world\" looks like it was shot in an underground parking lot. After that, an incongruous animated credit sequence rolls by, suggesting Gallowwalkers wants to position itself with the postmodern, ironic works of Rodriguez and Tarantino. Clearly, it should have remained true to its spaghetti western DNA.","user":"cameron_straughan","rank":[17,20]},{"title":"Trying to be a cool graphic novel style, but failing to be comprehensive film.","rating":1,"date":"10 August 2013","review":"It seemed like they weren't really sure what it was.<br><br>Some things that may make you LOL in this dire bore-fest:<br><br>I laughed so hard when that well bucket was just sat on ground level, and when he dropped it back in the well, it sounded like it fell on to some metal on the ground! Really, really atrocious filming in that scene. Were they all high or something when making this?<br><br>The 'bad' guy doing a 'muhahahahaaa' on the gallows scene was just hilarious.<br><br>And what was with that cave thing about, holy crap! Was the entire scene just removed?<br><br>The actors delivered the tired script straight and awkwardly like some kind of cheap SciFi channel TV movie. They all appeared somewhat self aware and miserable. Cringe making at times, Snipes does his best not to laugh in places it feels, although he's good at the Blade poses as usual.<br><br>And don't me started on the music, trying to be all Spaghetti Western from the 1960's, but cheesing it up really badly in places. But to be honest the music was the best thing about the film! Which says a lot.<br><br>It has decent gore effects, surprisingly, and I guess it was memorable for some reason, perhaps all the bad wigs and head pieces made it memorable. Not in a good way though.<br><br>I honestly felt sorry for the editor of this, but it got into such a mess anyway. I suspect too many hands (guys in suits) got involved in the final cut.<br><br>Sorry it's not a proper review like review, but it really wasn't worth caring for. Avoid. Unless, no, just avoid.","user":"All_Seeing_Fly","rank":[30,38]},{"title":"Absolute garbage","rating":2,"date":"25 July 2013","review":"The only reason I'm not giving this movie a flat \"1\" is because of the respect I used to have for Wesley Snipes as an action star.<br><br>This movie does not deserve a real in-depth review seeing as how it's difficult to take it as a real movie at all. But let me shoot off some issues I had with it.<br><br>Plot. The plot is a classic tale of revenge. Snipes is out to avenge his beloved who was violently gang raped while he was off with his adopted mother selling animal skins. They apparently gang rape her and leave her otherwise completely unharmed, to the point where the rape only comes to knowledge because she becomes pregnant. Then for some reason when Snipes finds out...he vanishes for 5 years. One presumes it was to track down the rapists? It's not explained...he just leaves for 5 years. In the mean time she dies from child birth...which maybe if he'd been there to support her in the first place she might have lived. Whatever. It's dumb.<br><br>While the plot at it's heart might be simple, that being revenge, none of the other elements add to the plot whatsoever. For some reason he frees a random prisoner...killing an entire sheriff posse in the process. They don't bother to explain who he is, why he's a prisoner, why Snipes even knows WTF he is. There's this \"whore\" that is seemingly an important part of the plot...except THEY FORGET TO TELL YOU WHO SHE IS OR WHAT HER POINT IS. Villains spring up and die at random with no explanation why they exist in the first place.<br><br>The editing is god awful. This director is obviously an amateur and so is whoever was behind the editing. Scenes immediately bleed into each other with zero warning or explanation. There's a rough 15 minutes where scenes constantly fade into each other...it's like someone playing with an editing program. I was expecting scenes to fly out in gold stars like an 80's PSA.<br><br>The acting was atrocious by everyone. I have no idea what Snipes was going for...but it failed. It's not even him most of the time, it's long distance views or filming him from the back the majority of the time.<br><br>Dialogue wasn't even laughable...it was just poorly written. I'd expect better from a grade school student.<br><br>Nothing in this movie worked. There's surprisingly little action and it's all anti-climactic. There's long narrative sequences that do little to explain what's going on. The sets are a complete joke, literally cobbled together tents and wooden structures in the middle of nowhere with a minimum of extras.<br><br>Well this ended up being pretty long for a review. This movie is bad and amateurish to the extreme. It appears they had somewhat of a budget because the quality of the camera work isn't bad and they had a few cameos that were completely wasted...but the actual handling of the camera is a complete mess. Close ups at the worst moments, the cameraman clearly running around swiveling the camera trying to give a \"mystic\" feeling. This movie is embarrassingly bad...no one should ever watch this. Sorry Snipes...but this is actually one of the worst movies I've ever seen. And I never say that.","user":"terrencepatrix","rank":[60,81]}]