[{"title":"Count me as another who enjoyed this film","rating":8,"date":"2 July 2010","review":"I watch a lot of movies, though not when first run at theaters -- generally I'll wait until the DVD price falls. This is why I only now getting around to viewing this film that \"won\" Sandra Bullock her Razzie.<br><br>And I believe that the Razzie voters were mistaken. I feel that Bullock did a nice job of playing a quirky, annoying person. Surely there were plenty of performances far more deserving of this award.<br><br>Although the character could be annoying, she still seemed like someone that would also be good to have as a friend, particularly as she evolved by the end of the movie. I think that it would not be a stretch to compare Mary to PeeWee Herman in \"PeeWee's Big Adventure.\" <br><br>It was a nice cast and I felt that all of the actors really did fine work in this fun little comedy and will be viewing it again.","user":"imdb-7660","rank":[49,57]},{"title":"No Doubt About It","rating":7,"date":"7 September 2009","review":"This review DOES contain spoilers, so if you haven't seen this movie yet, and finding out about it beforehand will upset your enjoyment, go see it and then come back. Or don't see it. A lot of people are unhappy with this flick and I believe I understand why.<br><br>One of the reasons this movie has been getting bad reviews is that it is being advertised as a romantic comedy, and it isn't one. You have Sandra Bullock, who has been in some very good romcoms, and two good-looking guys (including Thomas Haden Church who is always willing to mock his immobile good looks and deadpan delivery); the advertising campaign looks like a romantic comedy. What else can it be? Answer, it's a pure clown comedy, with a lead who starts out unlikeable, but goes on an inadvertent voyage of self-discovery. Its antecedents are not the romcoms you grew up on, but classic, flat out farces like Keaton's THE NAVIGATOR and Harold Lloyd's WHY WORRY? in which we start out disliking the hero heartily. In these movies, we wait for the comic to get kicked in the pants, because we don't like him..... but by the end of the movie, he has grown in wisdom and self-reliance, and we wish him well. Or, in this movie, her. It's a difficult balancing act and some people think Miss Bullock has fallen off the wire. Since she starts out as an unbearably smart motormouth to whom people are an utter mystery who winds up stalking Bradley Cooper, it's easy to write her off as insane and give up.<br><br>But I didn't and it took me about half the movie to realize what the film makers were doing. It's not something done often since movies learned to speak, and among female leads, I can only think of Katherine Hepburn in BRINGING UP BABY and, of course, Goldie Hawn's movies in which her characters break out of their molds and walk away as good people; although her most financially successful outing was probably PRIVATE BENJAMIN, she did something even more extreme than the transformation that Miss Bullock undergoes here in OVERBOARD. One of the problems that people may have with this movie is that this is so rarely done, and Miss Bullock has the courage needed to bring off a comedy: she isn't afraid to look stupid or foolish or dress in outfits that don't suit her or fall into a hole in the ground. So many actors are.<br><br>Miss Bullock doesn't change much here. She does become more self-aware as she talks endlessly about crossword puzzles, cicadas, hurricanes in Galveston and so on. The people she picks up on her voyage of self discovery are nerdy, not too bright, but quite willing to put up with her peculiarities because she will do as much for them; meanwhile Steve, Hartman and Angus, whom she pursues, make up a news team, and are busy worrying about how to get air time, usually by inserting themselves into news events as reporters, making themselves of interest when they have nothing much to offer. The actors do a good job, even when the roles are not well written or some key piece of celluloid seems to have wound up on the cutting room floor.<br><br>This is, by no means, a great movie, but it does have enough grace notes scattered throughout to have kept up my interest. If you sat down to watch it, I hope you will agree. If you read this despite the spoiler warning, perhaps you will give it a chance. I don't guarantee you will not be disappointed: Miss Bullock's character may strain your patience beyond recovery before the story turns around, but then again, you may have a very good time, as did I.","user":"boblipton","rank":[76,94]},{"title":"You know what I really like this...","rating":7,"date":"11 December 2009","review":"I really don't know what everybody was expecting when they went to see this movie. I expected a good date movie and a fun watch. Instead I got a light hearted movie about a woman who is like the rest of us, normal in our own world but crazy to everybody else.<br><br>I really enjoyed this movie, I thought the acting was good and the plot was decent. It is a very enjoyable watch and if it is one I would advise you to see it. It has a very good core value to it. That one person kinda different or not can make a change in one persons life. I have a friend who is like this and it makes me only appreciate her personality even more, I like her the way she is..<br><br>Don't listen to everybody else, see this movie yourself, and give it a chance. You might like it.","user":"Deathkneeler","rank":[113,145]}]