[{"title":"All the Enthusiasm of Finger Paints","rating":8,"date":"27 July 2008","review":"Gake no Ue no Ponyo is like something you might get if you mashed My Neighbour Totoro into The Little Mermaid, then put the entire project in the hands of a five-year-old animation prodigy. The film is simultaneously stunning in its beauty and endearing in its simplicity, unrestrained enthusiasm walking the edge between inspired brilliance and mind-addling delirium.<br><br>In the opening sequences, literally thousands of individually animated fish swirl across the screena task Western animators wouldn't touch without a room full of computers. And yet the film's omnipresent water is defined by hard lines that seem to have been drawn in with crayons and coloured by pastels. In style and content, this is clearly a children's fantasy, and yet it isn't.<br><br>Remarkably, Miyazaki has yet again achieved what he created in Totoro: a film that draws the viewer indelibly into the world of children, reminding us of the time when every discovery was unique, every possession precious, and the agony of loss crouched behind every well-meaning mistake. Perhaps this is why the film has appealed more to adults than to children in Japan: children still live in this world. They need no such reminders.<br><br>Sousuke, a five-year-old who retrieves the eponymous Ponyo from the ocean, is not another Pinocchio-like screen caricature. He is a real boy. He is intelligent yet careless, deeply conscientious but distracted by impulse. He grounds us in a world that wavers between the real and the surreal.<br><br>Wide-eyed wizard Fujimoto, voiced with narcoleptic mania by comedian Tokoro Joji, is by far the most rational of the film's fantastical creations. He's an oddball, but he makes sense. But when waves begin to lap at the doorstep to Sousuke's hilltop home and the townsfolk jovially pile into rowboats to scud over a swollen sea of prehistoric fish, we begin to wonder whether this is the real world or some beatific daydream. Miyazaki draws no clear distinction.<br><br>Gake no Ue no Ponyo is a children's love story, driven with monomaniacal ferocity by Ponyo and Sousuke's pure mutual affection. Composer Joe Hisaishi underscores this intensity, calling up mighty swells of strings to accompany Ponyo's first ascent to the surface, and later evoking Wagner's Ride of the Valkyries in a stunning sequence where Ponyo chases down a speeding car while running atop a cascading tsunami of gigantic fish.<br><br>While the film loses much of its energythough none of its eccentricityin the final act, Miyazaki has nonetheless succeeded in creating yet another modern fairy tale. It is a simple, pure vision, guilelessly washed across with a devoted kindergartener's finger paints.","user":"tinulthin","rank":[190,204]},{"title":"A Nutshell Review: Ponyo on the Cliff by the Sea","rating":10,"date":"25 December 2008","review":"Hayao Miyazaki's magic continues with this absolute crowd pleaser Ponyo on the Cliff by the Sea, his latest animated film, which turns on the usual sweetness to charm your socks off. I thought that the trailer featured its song which was quietly hypnotic, and I didn't have to wait for an invite to make sure I got my ticket for the sneak preview of the movie, scheduled to open here next week.<br><br>For fans of Studio Ghibli films, you'll probably know what you're in for, as Miyazaki has yet another winner in his filmography, that will win new fans over. I'm embarrassed to say the least that I've so far watched only My Neighbour Totoro (eyes that pile of Ghibli DVDs) and love it to bits, but I guess this would serve as a final push for me not to continue missing what would likely be animated films that I would enjoy.<br><br>Ponyo (voiced by Nara Yuria) is a magic goldfish that yearns to know what is life beyond the sea, with her constant forays in a bubble to the surface of the water to sneak a peek. Nonetheless these ambitions do not bode well with her humanoid dad Fujimoto (Tokoro Joji), who harbours some hatred toward the human race for pollution, and briefly touching a subplot on environmental protection / revenge by Mother Nature as well. An accident one day sees Ponyo being washed ashore, and picked up by five year old boy Sosuke (Doi Hiroki) who lives on a house on the said cliff with his mother Lisa (Yamaguchi Tomoko), while dad Koichi (Nagashima Kazushige) is mostly out to sea since he's a sailor. And you can expect some moments of throwback to the likes of The Little Mermaid, or Splash made for kids. Saying anything more would be to spoil the fun.<br><br>The artwork here is still simply astounding even though it's in 2D glory, knowing that each cell is painstakingly worked on. There are so many things going on at the same time within the same frame, that you'll probably be game for repeated viewings just to spot them all. This definitely beats any 3D or CG animated production any day given its beauty coming from its simplicity, and not only from the artwork department, but on its story too, despite complaints coming in that it took a leaf from the Hans Christian Andersen classic. While there are avenues to make this film extremely dark, it only suggested certain dark themes, but opted instead for a film with more positive emotions, suitable for both kids and adults alike.<br><br>At its core, its about love, that between the family members of Koichi, Lisa and Sosuke, and especially between mother and son. More so, it's about the love between the boy and his new pet fish which he christened Ponyo, and I tell you Ponyo herself has enough cuteness in her to beat the likes of Bolt, WallE and Eve all hands down. Characterization here is top notch, and it's hard not to fall in love with Ponyo, in whichever form adopted, especially when she's such a playful being who doesn't hide her emotions - if she's upset with you, either she turns away or you could expect a jet stream come spewing from her mouth into your face!<br><br>Ponyo on the Cliff by the Sea is a definite shoo-in to my top films of this year without hesitation. And the next time I go to Tokyo, I'm sure as hell going to make my way to the Ghibli Museum to bask under the magical world brought to us by Hayao Miyazaki. Highly recommended film, so don't you go missing this on the big screen!","user":"DICK STEEL","rank":[81,96]},{"title":"Another Classic Miyazaki","rating":10,"date":"19 July 2008","review":"Whenever Hayao Miyazaki does the \"tri-fecta,\" (writes, directs, and animates a movie) he makes a classic film for the ages. He has done it again with Gake no ue no Ponyo.<br><br>The story is about a girl fish who is kept on a very tight leash along with her younger sisters by her father, a bitter ex-human wizard named Fujimoto. The fish escapes from her father and rides a jellyfish to shore, where she is caught up in a dredging operation and finds herself stuck in a bottle. This underwater sequence must be one of the most elaborately drawn animated scenes ever undertaken and stands on its own as a reason to search out the theatrical release. Miyazaki, who shows no fear of having a busy scene, has outdone himself. There were literally hundreds of individually-drawn sea creatures of every imaginable size all in motion at the same time.<br><br>When the fish escapes the dredging operation while still trapped in the bottle, a five-year old boy named Sousuke spots her in the water and is able to break the bottle, saving her. Since she is the result of her father's magic, she is capable of magic herself--and her father actively tries to retrieve her. The boy names the fish Ponyo. Just when Sousuke learns that Ponyo can speak, her father successfully retrieves her back into captivity.<br><br>After a war of wills with her father, Ponyo manages to escape again with the ability to change herself into a human. She meets up again with Sousuke in a storm and the story continues from there in many interesting ways. There is a cuteness factor in this film rivaling and arguably surpassing that of Tonari no Totoro. Joe Hisaishi, once again, provided outstanding musical support.<br><br>The story itself is simple--as are Miyazaki's films in general--and should appeal to a broad spectrum of viewers. While I haven't viewed it enough to be sure, the film doesn't seem to be one which will keep scholars in long discussions as Sen to Chihiro no Kamikakushi did. Nonetheless, this is the ultimate feel-good entertainment movie. I gave the movie a ten out of ten rating.","user":"dballred","rank":[111,136]}]