[{"title":"Faithful adaptation that still offers something new","rating":7,"date":"19 October 2009","review":"Just got back from seeing THE ROAD.<br><br>I had been very impressed by the novel and was concerned about how it would be adapted. The tone of the novel is almost unremittingly bleak and a 100% faithful adaptation would be very difficult to watch.<br><br>I'm happy to report that the film is very good indeed. It solves the problem of being unendurably depressing by concentrating on the emotional impact of the unspecified Armageddon, rather than the day to day fight for food, shelter and so on. So while at times it remains very upsetting it is shot through with hope rather than despair. I always felt the end of the novel was somewhat out of kilter with the rest of it but in the film it seems quite appropriate.<br><br>I think the film is more about the collapse of civility rather than civilization: for a film that shows the last remnants of mankind struggling to eke out an existence it is remarkably concerned with relationships. That's probably why the exact cause of the catastrophe is left blank: the film isn't really about the end of the world so much as the end of society. It's an interesting companion piece to NO COUNTRY FOR OLD MEN in which an ageing man sees nothing but horror in the modern world. In THE ROAD a man convinces himself, for the sake of his son, that humanity will abide even in the face of appalling conditions.","user":"DanielKing","rank":[319,383]},{"title":"\"You must think I'm from another world.\"","rating":9,"date":"21 October 2009","review":"The wonderful thing about the Road is that it will more than likely please the two camps: the one that has not read Cormac McCarthy's Pulitzer prize-winning book, and the one that has. There's the nervous feeling one gets when watching the theatrical trailer, though - will it be this super action-packed spectacle, will those images that open the trailer with \"THE END OF THE WORLD IS NEAR!\" stick around, and will Charlize Theron actually be in the movie that much? As it turns out, if you liked the book very much and worried about how its uber-bleak and incredibly dark and (especially) gray landscapes would appear, it provides that perfectly. And if you haven't read the book... it still works as a movie, as a simple-but-not story of a father and son survival drama- and clinging on to their humanity- first, and then a post-apocalypse thriller far second.<br><br>To describe the plot is not impossible but sort of unnecessary. All you need to know going in (if you're part of not-read-book camp) is that a father and son, after becoming on their own after the mother of the house exits, are traveling together across a true post-apocalypse landscape to a coast. We never are given a fully clear explanation as to why or how the apocalypse happened. This is more than fine; because John Hillcoat's film centers on the father and son (called in the credits simply Father and Son, played by Viggo Mortensen and Kodi Smit-McPhee), there doesn't need to be anything really specific. At least this will be fine for most people who may be by now tired of the usual viral or religious or (damn) 2012-type explanations. We're given hints though, to be sure, that there may have been mutations or some kind of earth-bound phenomenon (earthquakes happen a couple of times), and past this we, like the travelers, are left to our own devices.<br><br>How it happened isn't as fascinating and visually compelling, anyway, than how it looks. The Road provides us many scenes and vistas that are precisely grim and desolate and terrible. Some of these are full of visual details like big city-scape shots, and others, like when the Father and Son are on the ramp of a highway, is intimate and hard (this setting also provides one of the most touching moments as Mortensen's character finally 'lets go' of two important details from the deceased mother of his son). And other times Hillcoat lets us just take in the gray-ness of everything, just as one could take in the sight of masses of flies in his film the Proposition. It's against this backdrop of rain and sludge and grime and decay that imbues this intense bond between the father and son so greatly, and the complexity that comes with not just staying alive but retaining humanity and dignity and doing right and wrong by the people they encounter.<br><br>This may not be news to people who read the book. I still, having read it two years ago (which sadly seems like long ago in usually remembering specific images of a book), can't get the descriptions of scenes out of my head, or the stark manner of how characters talked and dread and existential horror was relayed. But, again, the film not only respects this but gives it further life. Dialog scenes in the movie- save for a couple of the flashback scenes with Charlize Theron's Mother character- are never obtrusive to the storytelling, which is a rightful concern to have with an adaptation of the book. And, more importantly, the acting and chemistry between the two leads is incredible. Mortensen is a given to be an actor embedded in his character, so much so that when he takes off his shirt we see his bony torso as being really that, and watching him is magnetic. Yet it's also crucial to see how good the kid Smit-McPhee is too, especially when it comes time for scenes where the boy has to deal with his father's growing desperation or the electrifying showdown with a thief.<br><br>To be sure, a couple of walk-on roles by Guy Pearce as another fellow traveler and especially Robert Duvall as a \"90 year old man\" as his character says provide some needed space, and Hillcoat has a couple of very wise flashback/dream bits with The Man and his wife (namely a very small, brilliant moment at a piano), but it's the all on the two main character to lead the film, and it's on them that it delivers so strongly. As long as you know that this is a film centered not on big action sequences (though there are a couple), and not on big special effects (though there's that too), and it's more akin to a life-or-death-and-what-else story not unlike Grave of the Fireflies, you'll know what you're getting with the Road. <br><br>It is very depressing on the whole, and not exactly what I would recommend as a 'first-date' movie - unless you're so hot for Mortensen and/or Cormac McCarthy you don't care either way. However, it's *good* depressing, and equally the best adaptation of the book possible while a tremendous, original vision for the casual movie-goer.","user":"Quinoa1984","rank":[507,632]},{"title":"Very important movie ...","rating":28,"date":"28 November 2009","review":"I just got home from seeing \"The Road\" and my stomach is still in a knot. I never read the book and therefore won't be making any comparisons. I'll simply comment on the film. <br><br>I can't imagine the performances being any better from any of the actors, starting at Viggo and working my way down to the smallest roles. I can't imagine the bleak post-apocalyptic world being portrayed any more realistically. I can't imagine the general feeling of sadness, desperation, hopelessness, terror and pain being captured more accurately. If that was the goal, the people involved in the making of this movie did their job magnificently. <br><br>Having said that, it isn't for everyone. I saw this movie alone because I had a feeling my wife wouldn't be into it. It's tough to watch. However, in the midst of this recession brought on by greed and materialism, I think it's a movie that everyone of age SHOULD see in order to put things back into perspective, if only for a day. <br><br>I had a lump in my throat through most of the movie and was desperate to get home and hug my two boys through most of it as well. I also felt like downsizing our entire life in terms of the unnecessary \"stuff\" we have. I imagined how many homeless people wander the streets right now with that feeling of hopelessness and desperation. What more could I ask from a Saturday afternoon at the theater? It's this kind of movie that helps maintain a degree of integrity in the film industry among the inaneness that surrounds it.","user":"filmy1","rank":[219,268]}]