[{"title":"Langella's Nixon","rating":8,"date":"12 November 2008","review":"A remarkable performance by Frank Langella as Richard Nixon transforms this unexpected Ron Howard film into a gripping and unforgettable experience. The behind the scenes of the famous David Frost, Richard Nixon interviews pale in comparison to the compelling sight of Nixon/Langella thinking. It was difficult to forget that Michael Sheen was not Tony Blair but David Frost. Sheen's Frost is an entertaining foil to Langella's somber,sad, desolate portrait of the former president. Ron Howard finds a winning pace giving the true tale a fictional slant. Unfortunately I never saw the stage production and the film never betrays its theatrical origins. In a bizarre sort of way this is Ron Howard's most cinematic film. I highly recommend it.","user":"filmquestint","rank":[156,189]},{"title":"Great cast, excellent screenplay","rating":15,"date":"15 December 2008","review":"The Frost/Nixon interviews are fascinating. Not every second of them, especially not when Nixon rambles on and on, avoiding questions by offering anecdotes in place of answers. Yet, they are an invaluable historical document, which allow us the rare privilege of seeing a major politician as a human being and nothing else. As interesting as the interviews themselves is the lead-up to them, the circumstances surrounding them, and the characters involved, particularly Frost and Nixon, of course. One could say that you only need to watch the actual footage, but there's ample room for a great dramatization, but it needed an even-handed approach, and certainly needed no political preaching.<br><br>I have a personal dislike for Ron Howard as a director, a result of my sensibilities mainly, I suspect. Howard strikes me as a particularly heavy-handed, didactic director who has wasted many great concepts on mediocre films (out of 18 films I've seen by him, I only genuinely liked \"Apollo 13\". I was expecting the worst with \"Frost/Nixon\", but instead was met with one of the most entertaining films in a while, and a remarkably well-acted, even-handed, quality character study. I suppose I should have been prepared for a quality screenplay given the success of this Peter Morgan play in New York and London, but I was hardly expecting something this good. It's glib, funny, well-paced, expertly-structured, clever, observant, and intelligent. It creates a fascinating Nixon, played brilliantly by the great Frank Langella, though this is not quite up there with the likes of Oliver Stone's sadly under-appreciated \"Nixon\" or Robert Altman's endlessly fascinating \"Secret Honor\". The film is almost surprisingly well-directed, although there is a bit of the old TV trick of shaking the camera a bit, panning too often, to give the illusion of motion and energy when there's really just people in a room talking. The conversation's interesting enough, there's no need for that. Oh well, I suppose I am nitpicking.<br><br>As far as Nixon movies go this is lightweight entertainment with plenty of comic moments largely leading up to two or three scenes of real human vulnerability. Aside from these scenes (which are truly, truly excellent), Peter Morgan conceives the meeting as something of a chess match with the unpredictability of a boxing match. To use J. Hoberman's words 'a prize fight between two comeback-hungry veterans, only one of whom could win'. On paper this could have been very heavy on amateur psychoanalysis and low on entertainment value but Morgan and I suppose Howard as well are clever enough to have some fun with the idea. This is not a criticism at all, the film has moments of surprisingly real depth and intellectualism, but overall the nature of the script works in its favor, makes those scenes more interesting, more ultimately rewarding.<br><br>\"Frost/Nixon\" is an entertaining, exciting film, around as populist as I expected but in a very different way. This is the sort of writing we don't see enough of, particularly not in today's films. It's vaguely reminiscent of a particularly good BBC television drama. The cast is certainly good enough for that. Langella and Michael Sheen are outstanding, both manage to accurately portray the real-life men they are portraying while still adding some characterization and mannerisms of their own. Langella's Tony-award winning performance might be up for Oscar consideration soon, but Sheen's Frost almost upstages him at times. No heavy-handedness, no political 'messages', just a fun, clever script and a great cast in a well-made film.","user":"ametaphysicalshark","rank":[127,159]},{"title":"Not to be missed! Vey rewarding","rating":9,"date":"16 October 2008","review":"I had the pleasure of watching this gripping movie at the opening night of the British Film festival. Ron Howard's direction and story telling ability are in top form with this effort. From the very first scene a carefully crafted and very credible 70s's atmosphere sets a solid stage for the superbly cast film and quickly transports the viewer into the political jungle that was \"Tricky Dickey's\" playground.<br><br>The acting duo of Frank Langella &amp; Micheal Sheen (Nixon &amp; Frost) are set on a collision course that finds two deeply passionate personalities at the mercy of their insatiable desires. Both actor's portrayals are a study of affectation and body language, pleasurably accurate and yet not simply an impersonation. Indeed, the film never strays from the distinct Howard format that breathes so much life (read intimacy) into this familiar and yet mysterious relationship that exists for so many people who lived through the exceptional event.<br><br>Make no mistake, this is by no means a two man show, quite the contrary. In fact, the wealth of supporting roles is perhaps the finest feature of this production. Bacon's devoted and stalwart marine practically glints of gun metal and polished shoe leather. The trio of Gould, Platt and Rockwell portray effortlessly the roles of the men who, brick by brick, constructed the platform from which Frost so successfully and serendipitously elicited one of the greatest unspoken confessions of all time. Rebecca Hall is delicious and demure, constantly filling scenes with her elegant presence.<br><br>Perhaps the richest praise should be reserved for Peter Morgan, who has, without question, penned a truly captivating and insightful story that delivers not only a satisfying comprehension of a complex time in US history, but captures a generation's struggle to come to terms with the frailty of leadership that still echoes today.<br><br>Not to be missed, this film can be enjoyed on multiple levels and will undoubtedly be regarded as seminal for it's engrossing insight and expert depiction.","user":"IMDb-627","rank":[90,113]}]