[{"title":"Kevin Hart's best performance and sporadic laugh-out-loud moments, but it ultimately clutches onto the same tropes and beats as other movies of its ilk.","rating":6,"date":"26 December 2015","review":"I really wanted to like this movie, mainly because I think Kevin Hart has had a rough few years. Not financially of course; the guy has been starring in more than a few comedies the past couple years, but critically, none of them (Ride Along, Get Hard, About Last Night) can be called a genuinely great movie. The Wedding Ringer is the best of the bunch, though. This is Kevin Hart in his element - his most dynamic performance and playing a Hitch-style role where he gets hired to be people's best mans for guys who don't have any friends. Josh Gad plays the loser character, and he and Hart have great chemistry and some very funny back and forth moments. I was actually surprised at how much I was enjoying this movie for the first half, but then the problems became too glaring to ignore.<br><br>The premise feels fresh and fun in the beginning. It felt like a cross between Wedding Crashers and I Love You, Man without directly copying either of them. The problem is, those movies had more character depth beyond their two leads. Here, every character besides Hart and Gad are cardboard cutouts. The biggest offender is Paige, played by Kaley Cuoco. She is the most shallow caricature of a woman I've seen in comedy in a long long time. It's a shame because Kaley does what she can, but her character is so one-dimensional you can't even connect with her on any level. The random groomsman have their moments, but they're still only caricatures. There's the buff guy, the fresh out of prison rapist, the guy who likes pulling out his penis, the socially awkward guy, etc. They may have defining traits, but not one of them feels like a fleshed out character.<br><br>Structure is another problem in this movie because after an excellent setup, it starts going down the list of the same tropes and beats as every other zany wedding comedy. Competitive family football scene? Check. Guy finding out girl is actually a bitch? Check. Guy and employer who have a strictly business relationship actually become friends in the end? Check. It's a shame because when Kevin Hart is given a chance to shine, he shines. But those moments become less and less often as the movie tries to tie itself neatly with a bow in the third act.<br><br>The Wedding Ringer is good for a few laughs, but in the end it's just another Kevin Hart comedy that had potential but didn't explore it. The man has proved himself to be a comedic force to be reckoned with. Now it's just a waiting game until he finds a script that fully plays to his strengths. Until then, The Wedding Ringer seems to be the one to beat, and as far as raunchy comedies go, you could do a lot worse.","user":"lnvicta","rank":[30,34]},{"title":"Another Feel-Good Comedy","rating":7,"date":"6 February 2015","review":"There's honestly not much more to say on this movie. It did exactly what it seems it set out to do- make people laugh and have them walk away with the warm fuzzies.<br><br>The characters have great chemistry on screen, especially Kevin Hart and Josh Gad. The plot is pretty easy to predict, but there are still a few surprises on how some points are executed. There are some great laugh-out-loud moments, even with a couple of cringe-worthy ones (was the view of what the dog chomped on really needed?).<br><br>All in all, I had a good time watching it. I kind of wish I had waited to see it in the $2 theater, but I'd watch it again if given the chance.","user":"ipseclewis","rank":[43,56]},{"title":"You will laugh so much","rating":8,"date":"20 April 2015","review":"I haven't laughed this much watching a movie in a very long time. It was truly a entertaining movie filled with laughter and comedy. A very positive and fun movie that will leave you with a big smile on your lips.I totally recommend this movie to anyone. Kevin Hart was great in his role, so was Josh Gad as well. I didn't expect this movie to be THIS good and funny. Loved every scene in this movie and each character in this movie was super hilarious. The only thing i can think of that wasn't that great was actually Kaley Cuoco-Sweetings acting, she was a bit annoying in this movie. But it doesn't matter everything else is perfect. You will not get disappointed in watching this movie, it will leave you with a big big smile on your lips.","user":"LenaS15","rank":[27,35]}]