[{"title":"A Man For All Seasons and a Legendary Hockey Hero","rating":10,"date":"1 November 2013","review":"A person would need to be born before 1950 or 1960 to truly appreciate what Gordie Howe meant to professional ice hockey in North America. More importantly all the professional hockey players who succeeded Gordie Howe in the National Hockey League (NHL) through the past four decades need to bestow credit and praise on Gordie Howe for raising awareness between the disparity between what the NHL owners were raking in in profits, and how NHL players salaries climbed after Gordie Howe un-retired from the NHL and signed with the WHA Houston Aeros. Due to Gordie Howe's and Mrs. Howe's endless loyalty to the management of the Detroit Red Wings, this biography depicts how the executives running the NHL believed they controlled what players would be making in salary and bonuses 'til death made them part. However, when the World Hockey Association (WHA) was trying to establish itself as the \"other league\", the NHL did not consider the WHA to be a serious threat to their monopoly because the two biggest hockey stars were playing for the NHL's Detroit Red Wings and the Chicago Black Hawks. <br><br>The two biggest names in the NHL in the 1960's and early 1970's were Gordie Howe (played extremely well by Michael Shanks) who held most of the NHL's prestigious scoring records, and the younger Bobby Hull (played by Lochlyn Munro) whose physical attributes reminded many of Hercules, and Bobby had a booming slap shot with the scoring touch. Mr. Hockey provides some good historical detail about the younger Bobby Hull's exodus to the WHA for an unheard of (for the time) one million dollars per year. Bobby signed with the WHA shortly after, the old guy, Gordie Howe retired from the Detroit Red Wings and took a job in their front office. The movie depicts how much Gordie was missing the on ice action and was enticed back in to professional hockey by the WHA as part of a three man deal Mrs. Colleen Howe arranged with the newly formed Houston Aeros, which allowed the biggest name in hockey, Mr. Hockey himself, get to play professional hockey with his two skilled sons Mark and Marty Howe.<br><br>In my humble opinion, any true hockey fan has to see this movie as a tribute not only to Gordie Howe, but to the entire Howe family whose legacy is a life in hockey itself. This movie gives us all some insight in to the close knit Howe family ran by mom Colleen, played well by Kathleen Robertson, their daughter Cathy Howe, played by Emma Grabinsky, and Gordie and Colleen's two sons, Mark played by Andrew Herr and Marty played by Dylan Playfair.<br><br>On a personal note, I had the opportunity of a life time to meet with Mr. Howe during a stopover in a Boston airport late one evening. I approached him very gingerly as he sat alone. I respected his right to privacy, and he appeared to be suffering from a bit of jet lag. Mr. Howe could not have been nicer to me, he insisted I sit down and converse with him. We talked for a good 10 to 15 minutes. He asked if I had any children and if I would like his autograph for my boys. I told him I did not want to bother him, but instead he asked what their names were and he wrote a special something for each of my sons. <br><br>Mr. Hockey portrays Gordie Howe as a father first, a hockey legend, a six time winner of the Art Ross trophy winner, a sports celebrity who always gave his autograph freely.....but put skates on this man and a hockey stick in his hand and look out for \"Old Elbows\"!!!!<br><br>All hockey fans should see this Made For TV Movie, which is a deserved tribute to the single most important man in professional hockey both for his scoring prowess and his longevity. Gordie Howe played at the highest level of the game well in to his 50's, he truly is an amazing man our Mr. Hockey, and because of the class act Gordie Howe has been for his entire life this film deserves nothing less than a perfect 10/10, just as Gordie Howe has always been a perfect 10. Thanks for so many great memories Mr. Hockey!","user":"Ed-Shullivan","rank":[11,12]},{"title":"Elegant view of Howe's 1973/4 WHA season","rating":9,"date":"3 May 2013","review":"This docu-drama presents a solid depiction of Gordie Howe's decision to leave Detroit for a possible pro career in Houston. The spoiler alert? This is not a cradle-to-quit biography. Instead, the focus remains on the effect the move would have on the entire Howe family. The facts are easily verified; the impact Mark, Marty, and Gordie had on the fledgling WHA was resounding.<br><br>Two mandates drove Howe; in order, family and hockey. By accepting the chance to play in a new league, the Detroit Red Wings' management lost any control they may have had over using Howe to keep other players in line. Their resentment was both bitter and public.<br><br>The characters of Leaf owner Ballard and Wing owner Norris were especially good. The recent (1967) NHL expansion had lined their pockets, but the WHA would not; that was the underlying current. <br><br>It was against this backdrop that the Howes' made this decision. <br><br>Kudos to Kathleen Robinson as Colleen Howe! She found the perfect balance between wife, mother and businesswoman. Michael Shanks portrayed the aged Gordie as both a dad and a teammate with just a touch of larceny...well done!<br><br>This film will fill a void in the hearts of hockey fans everywhere. Enjoy!","user":"pecora_324","rank":[9,11]},{"title":"A movie for all hockey fans","rating":10,"date":"16 May 2013","review":"Gordie Howe was a simple, quite man off the ice but on it, he is a force to be reckoned with. Nicknamed \"elbows\" due to his frequent use of them to other player's faces, he became \"Mr. Hockey\" by scoring 786 goals in his NHL career. After retiring from the Detroit Red Wings and taking a job in the head office, he decides to join the new World Hockey Association when a former teammate lands a job coaching the Houston Aeroes and drafts Gordie's 2 sons who are too young to play in the NHL. This is a great story of his rise to the top of the new league and also shows how gentile, yet firm, he is raising his own family. Respect for others, dignity and perseverance are all positive themes shown throughout this film. If you love the game or know someone who plays Hockey on any level, you will appreciate this great story based upon the real life of Gordie Howe.","user":"treuaiodmol","rank":[9,13]}]