[{"title":"Major spoilers in second half of post.","rating":10,"date":"31 August 2007","review":"I saw the premiere in NYC tonight. Ryan Reynolds and one of the producers (Bruce Cohen) spoke beforehand.<br><br>I thought this film was first-rate. It quite bent my mind. Often after seeing a film that affects me I can't get up from my seat (like most people do) when the credits roll, or even when the credits end (like everyone else does) because I need to process what I have just seen, plus it's hard to bring my self back to reality when a film has taken me to a profound place, like this one did.<br><br>What I noticed after this film was that practically the whole theater sat in pensive silence until the end of the credits, something I think I've never seen. For me it was stunned silence.<br><br>I can't see The Nines playing in the big Multiplexes, but no bother. Most of the best films don't.<br><br>____________________<br><br>Spoilers start here.<br><br>____________________<br><br>I think I understand about 75% of the script, the rest I figure is ambiguous or inscrutable. Here are my takes. I'd love to hear other's:<br><br><ul><li>He is a god (i.e., a \"Nine\"), not The God, but one of many. For 4,000 years he has been creating Universes for his amusement. He is addicted to doing this. - In each Universe he has a different persona. At some point, he eliminates the Universe and starts another one. (Why doesn't he know Who He Is in each incarnation?) - The 3 recurring characters (Hope Davis, the guy who plays the policeman, and the woman who plays the prostitute) are from his cosmic \"world.\" They are trying to bring him out of his addiction and get him to return \"Home,\" i.e., back to being a celestial being without a body. - I'm not sure of the Melissa McCarthy character(s). She is clearly a human (a Seven) and is very attached to him. She is trying to keep him on earth because she enjoys, loves, needs him. There is a battle between her and the Hope Davis character(s) over keeping him human versus spectral. I think this is why several times Hope tells him \"We had to get you away from her,\" because she (McCarthy) is the embodiment of his addiction to being human.</li></ul>","user":"crisnyc","rank":[99,136]},{"title":"A predictable 9 for The Nines","rating":9,"date":"7 December 2007","review":"I wrote this without reading any of the other reviews, mostly cos i didn't want them to influence my own, and partly cos i'm lazy. This was a very interesting film that left some to the imagination and a lot to interpretation (but not too much).<br><br>The film consists of 3 stories: the first about a house-arrested destructive TV star, the second a TV show writer with a new show in the works and the third a computer game creator stuck in the woods with his family. All three are played expertly by Ryan Reynolds. He is supported by two women, Hope Davis and Melissa McCarthy, who are also very good at enforcing the bizarre yet irresistible vision of John August, who has a good track record of writing screenplays, most notably with Tim Burton (it's worth ignoring the Charlie's Angels jobs though). The three leads play different parts in each. That alone should prepare you for the world he has created in The Nines.<br><br>It is difficult to talk of the story without giving too much away, John August has found a great concept and worked it brilliantly into a interpretable screenplay and image. The world he has created seems very real, with characters that operate in abnormal situations, but ones in which i think we all can relate, given our excessive access to reality TV and celebrity.<br><br>The direction is good, you know from the very start that the green woollen wristband holds significance, and the witty, experienced, inflective screen writing is a joy (though at times August gives a little more away than is necessary).<br><br>The film is a fantasy and the nines are a mystery, both collaborating in a way that captures the imagination. The three stories intersect and overlap with themes that confuse and inspire, which will leave many audiences pondering for awhile. But it is not as confusing as it may appear as the plot unfolds fairly intricately to those paying attention. All of the stories hold explanations, and the last explains it all.<br><br>I saw this with a friend who i wasn't expecting to enjoy it, but surprisingly they did. I giggled, guffawed and gasped, while we exchanged plot ideas and interpretations, throughout. Sometimes it became a little dry, but on the whole this a very well thought out drama mystery thriller with an excellent philosophy.","user":"standeman1984","rank":[149,229]},{"title":"Look For The Nines","rating":10,"date":"1 February 2008","review":"I started watching this movie after looking it up on IMDb. The plot summary said: A troubled actor, a television show runner, and an acclaimed video game designer find their lives intertwining in mysterious and unsettling ways.<br><br>I thought it sounded interesting, but never did i expect it would be such a thoughtful, intelligent and awe-inspiring experience.<br><br>At first, I'll be honest, I didn't understand it. It was extremely random and didn't seem to make much sense. It seemed like Ryan Reynolds' character might be a little insane or something, as he played these three different personalities, whose only connection was the people in their lives. But as the movie progressed and I learned more about what 'the nines' actually are, it starts to dawn on you that this movie has a very unique twist.<br><br>When the whole thing comes together and the big secret is revealed, everything else in the film falls into place. It is very rare for that to happen in a film, especially in such an effective way, and it is a product of fantastic writing. To have the audience realize what the whole movie has been about at that one revealing moment is a great achievement. And it is accomplished in this movie.<br><br>So don't worry if you have trouble understanding what is going on at first. When you do find out what the movie is about, I guarantee you will experience an \"oh i get it now!\" kind of feeling.<br><br>This movie is sensational and subtle at the same time and i recommend it to anyone who wants to have their minds blown!","user":"kixbooty","rank":[107,163]}]