[{"title":"deeply disturbing art horror film but definitely not for everyone","rating":8,"date":"20 December 2008","review":"Watching \"Funny Games\" is a bit like coming across a major accident on the highway - you know you should continue driving on past the scene, but you just can't keep yourself from slowing down and gawking at all the wreckage.<br><br>The premise of the story does not sound very promising at first, as the idea, or a simple variation of it, has served as the foundation for countless such films in the past: an innocent family of three is held hostage in their home by a couple of sadistic killers who systematically abuse and terrorize their victims for their own twisted pleasure.<br><br>So many horror movies are predictable and formulaic that it's a pleasant surprise to come across one that actually makes an effort to break free of its bonds and make its own way in the world. And, indeed, \"Funny Games\" busts through the horror movie conventions with an almost ruthless determination. In this Americanized version of a film he made in his native Austria in 1997, director Michael Haneke scrupulously avoids obvious camera setups and editing techniques, bypassing virtually every storytelling, visual or audio cliché endemic to the genre. There is no background music, for instance, to cue us into the scary moments, no screeching cats jumping out of the shadows, and no point-of-view shots designed to generate easy suspense. Unlike in most films of this type, the violence here happens in an entirely haphazard and random manner, making it all the more frightening in its unpredictability and plausibility. Haneke refuses to cater to the expectations of his audience, making them face the reality of the nightmare he's showing them rather than giving them what it is they may want to see.<br><br>Michael Pitt and Brady Corbet are cringe-worthy and terminally creepy as the smarmy psychopaths who get their jollies out of watching other people suffer, while Naomi Watts, Tim Roth and Devon Gearhart engage our full sympathy as the hapless victims who have come up against the blank wall of two twisted minds they are woefully unequipped to even understand, let alone wage battle against.<br><br>This is one of the most memorable and artful horror films of recent times, but it is also one of the most unnerving and difficult to watch. The movie gets into your bones, no matter how much your better angels may be telling you to keep it out. It's depressing and disturbing and is certainly not intended for all audiences, but it is a movie that it is very difficult to shake off once you've given yourself over to it.","user":"Buddy-51","rank":[164,240]},{"title":"You might hate it or love it but everyone should give this a chance","rating":8,"date":"2 April 2009","review":"One way to get the most out of Funny Games is to have your expectations open before watching it. It's not a standard horror film aiming to fulfill your needs as a viewer. It's about horror films and us, the audience who gets pleasure from suffering as entertainment. It shows what real horror might look like in an awful situation, and how it psychologically debilitates and paralyzes the people involved.<br><br>Although this is almost identical and I liked this remake, I prefer the 1997 Austrian original version. It was one of the most disturbing and effective films I've ever seen. Here the acting is good especially from one of the best actresses out there Naomi Watts, but somehow the original works better. Maybe it was Arno Frisch, who played the main bad guy in the original, an absolutely ice cold character. Arno played it so well, there was a threatening menace underneath the polite and clean-cut exterior. Michael Pitt in this U.S. Version doesn't quite have that, but even so I still think he does well.<br><br>One possible flaw that I agree with others is the family seemed too passive. In the beginning the two bad guys are armed with only a golf club. Naomi Watt's, who is in amazing shape at 40, looked like she might have done something more to get out of it. However, an argument can be made that the family reacted realistically because they were portrayed as rich, docile people who listened to classical music and went boating. People who are not violent and erroneously think everyone, even these two sick guys, have a better nature they can appeal to by simply saying \"why don't you just leave us alone and go?\" They've been sheltered from people who are simply evil and lack empathy and just don't give a sh*t. Their comfortable existence has been shattered and they don't know how to react. We're so used to Hollywood b.s. where everyone is a hero and fights back and we all cheer and go home. Yeah that's entertaining too but we've seen that a million times already. Maybe some people would be paralyzed out of fear like this family. Either way, I was willing to put their passiveness aside because everything else in the film was done so well.<br><br>The original right now has a rating of 7.7 at IMDb and many glowing reviews, yet this U.S version is a lot lower at 6.4 and many b*tching and moaning 1 star reviews. Not to sound condescending, but maybe people who watch subtitled non-English films are more accepting of weird, offbeat films that don't follow conventional Hollywood style dialogue, plot and presentation, and they're more open to this movies style of direction, like the very long takes of people just sitting there in misery. I'm not stupid enough to say one has to like this film, I get annoyed at some indie type films and their quirkiness myself, but some of the 1 star reviewers sound like a bunch of crybabies.<br><br>Funny Games slaps you in the face and taunts you and it rarely gives in to what you need as a viewer, and that may be frustrating at times but at least it's something different.","user":"Bigbang","rank":[111,169]},{"title":"Why?","rating":6,"date":"23 October 2007","review":"When I heard Michael Haneke was re-making Funny Games in America I wondered why: what purpose could it possibly serve? The set-up to both versions is simple in that a bourgeois family is subjected to a torturous ordeal by a couple of ever so polite psychopaths. Moreover, like the original the re-make is a cruel exercise in exposing our fascination with the violence depicted in the media - the \"our\" specifically meaning the middle classes, comfortable in our existences and oblivious to the horrors of the world. <br><br>However, Haneke is on record as saying that he always considered Funny Games to be an \"American story\", as he regarded the use of violence as a form of entertainment to be a specifically American phenomenon. No matter that this is a bit of a flawed viewpoint: having the aggressors seem straight out of the O.C. gives the impact of their sadistic actions an even more discomfiting air. Michael Pitt (charismatic and barbarous) and Brady Corbett (seemingly dopey but utterly vicious) are both excellent, but their performances leave one feeling a bit um \"seen it all before\". <br><br>Which takes me back to my first thought: what is the point? Cosmetics aside this is exactly the same film, right down to the assumption that the well to do like to listen to classical music and that the audience may be unsettled by playing them some thrash metal. Haneke even has Pitt address the camera and manipulate the film, so re-using the trick about playing with reality and focusing the viewer on what actually counts as real. It is just that this playing around does not carry the impact it did 10 years ago. <br><br>In fact, due to the unconventional nature of the film and the vast disparity it offers with reality it's hard to care much at all. Yes what happens is horrible, but it does not feel at all real. I'm waiting for someone to point out that, that is Haneke's point, but frankly, I don't care. No amount of intellectualising can make this watchable. <br><br>You would think Haneke would know better too. His most recent film Hidden took a genre film and flipped it about to deliver one of the most surprising and intellectually challenging thrillers of the decade. By stringing the audience along and offering some sense of catharsis and understanding of character motivation he offered a way in. Funny Games U.S. offers no such intrigue or tension and is ultimately a big step backward. He may see it as an American story, but it worked better as a small Austrian film, set in anywheres-ville Europe.","user":"Axel-9","rank":[290,495]}]