[{"title":"Not as good as the classic Clash of the Titans","rating":6,"date":"23 February 2020","review":"The Clash of the Titans remade is more like a brute version of it. It's fun but its a mess. It's more of a spectacle rather than telling a story bout the whole mythology epic with its characters though I'm seeing a lot of CGI extravaganza with over the top results which my eyes are bleeding like hell . This is one of those films where there are a lot of super good casts in a bad production.","user":"MR_Heraclius","rank":[36,37]},{"title":"Occasionally entertaining, yet ultimately hollow","rating":4,"date":"2 April 2010","review":"Ah, the pre-summer action movie. Admittedly, due to word of mouth from those who had attended earlier screenings of the film, my expectations for Clash of the Titans were fairly low. On top of that, many of the initial casting choices appeared to be somewhat suspect. So, what's my verdict? Well, I didn't hate it <br><br>The plot of Titans is extremely straightforward – practically to a fault. Often, the film acts as though it's in a hurry, attempting to get from one action sequence to the next as quickly as possible. The scenes that occur in between each of these battles ultimately amount to nothing more than brief segments of exposition delivered by Perseus' \"guardian angel\" of sorts, Io (Gemma Arterton). So, while the film never really drags, it feels very soulless.<br><br>And while we're on the subject of these action sequences, none of them end up being particularly memorable. About half of them are so frenetic to the point where they're almost disorienting - honestly, I'm glad that the 3D screenings were sold out this time 'round. On top of that, there's virtually no character development outside of Worthington's character (and even he isn't all that likable), so I never really cared about the outcome of these action sequences either. Also, as I mentioned earlier, my biggest fear with Titans was in regards to the acting, and thankfully, most of the cast do what's expected of them. Neeson's Zeus aside, none of the performances truly stand out, but they're nothing cringe-worthy either.<br><br>Ultimately, Clash of the Titans ends up being a forgettable piece of entertainment with a couple of gaping plot holes, hit-or-miss action sequences, and performances that fail to leave much of an impression. It's not horrible – just hollow.","user":"Apemangalore","rank":[329,459]},{"title":"Garbage from beginning to end","rating":2,"date":"2 April 2010","review":"There are SPOILERS here, so beware....<br><br>I remember years ago, a friend and I discussing how awesome a remake of Clash of the Titans would be. 10 years later this comes along. The remake deviates way too much from the original. I get the attempt to make a stand alone movie, but this remake is pointless. In the original, the whole journey is for one reason only: Love. Perseus is attempting to save Andromeda from the wrath of the Gods. The remake makes it a journey based only on revenge. Perseus in the original was a young, naive boy who discovers his inner hero. The remake shows Perseus as a defiant muscle-bound idiot who automatically has the kind of skill the warriors he travels with have devoted their lives to attaining. in the original, Perseus had to tame and gain the trust of Pegasus. Not here.... he just shows up. Convenient. Bubo, the golden owl (as cheesy as he was) is nothing more than a sight gag in the remake. Calibos poses no threat here. He was such an integral part of the original. The addition of the character Io is just annoying. Her presence is completely unnecessary. The Medusa training/seduction scene...ridiculous. The Medusa scene was easily the best part of the original... here it is anti-climatic. The Kraken? Besides the creature being way too big, the whole movie hinges on what a threat this monster is. Yeah, it looks cool (I'll give it that)... but for being such a threatening monster, he sure is dispatched easily. Perseus spends more time chasing a blurry harpy around than actually dealing with the Kraken. Perseus's relationship to Andromeda is nothing more than casual, the 3-D and slow motion are pointless and there is no giant vulture. Sam Worthington should not be allowed to work again until he can do so without his accent. The director, Louis Leterrier is just the wrong person for this job. Transporter 2...sure. This? No. Liam Neeson, Pete Postlethwait and Ralph Fiennes are truly slumming it on this one. I'm sure no matter what is said, people are going to line up for this one. I'm aware of how I sound here. But this movie truly is a let down on every level. While they had the chance to make a fun popcorn movie in the vein of Jurassic Park, Iron Man or even Star Trek (2009), they really missed the mark here. The film is terribly cast, acted and directed. A true waste of the title... but, hey... it sure looks pretty, doesn't it?","user":"bryanchristopher11","rank":[266,393]}]