[{"title":"It was a gamble, but good film!","rating":7,"date":"11 April 2008","review":"Smart People - Smart People had a 46% on Rotten Tomatoes, but it's far better than that. Lawrence Wetherhold (Dennie Quaid) is a \"holier than thou\" widowed professor you unfortunately meet once in awhile. He's the sort who's deeply invested in his subject but can neither make it accessible nor allow the students any time to discuss it. He's a brilliant asshole essentially. He meets a physician in a hospital after a head injury and begins to reevaluate his life and his happiness. He has a dead-beat brother-in-law (Thomas Haden Church who steals every scene he's in), a daughter (Ellen Page) who is a young Ann Coulter in the making, and a son (Ashton Holmes) to whom he never talks.<br><br>This film is quite funny! Page and Church were definitely the stand-outs, but I appreciated Dennis Quaid and Sarah Jessica Parker, two actors who I rarely ever have liked. It deals with a couple familiar rom-com problems (pregnancy, the \"other woman\" thing), but the film never feels overly sentimental or cliché. It's satisfying watching Quaid's character get some richly deserved socks to the stomach once in awhile, but you're with him anyway by the end. The humor is a little on the biting cold side, which goes well with my tastes, maybe not with some. Smart People overstays it's welcome a bit near the end, but a good movie overall.<br><br>B.","user":"joestank15","rank":[86,99]},{"title":"Familiar, but well done dramedy featuring some stellar performances","rating":8,"date":"13 April 2008","review":"An indie comedy about a quirky family of self-hating misfits. We've seen this before, am I right? Well, so what, I say. When it's done well, I don't care too much whether the concept has been done before. And Smart People is done quite well. Dennis Quaid stars as a college professor and widower who hasn't been out with a woman since his wife died an unspecified (but long) amount of time ago. He lives alone with his daughter (Ellen Page). He has a son who goes to the same college at which he teaches and an adopted brother (Thomas Haden Church) who likes to mooch off of him. After an accident, Church moves in with Quaid and Page. Quaid also meets a former student (Sarah Jessica Parker), now a doctor, who had a crush on him. They start to date. The plot isn't anything special, but the dialogue is witty and the relationships are well observed. And this is also a case of fine actors who make something merely serviceable into something special. Quaid has never been better. My feeling about his work as an actor is that he is very uneven. He can be excellent, such as in The Right Stuff, but usually he's adequate, and often, perhaps too often, he's awful. But this is definitely one of the excellent performances. Church has kind of a sitcommy role, but that's fitting for an actor who was really good in sitcoms. He's hilarious here, too. A lot of the time, I was thinking of the movie as somewhat akin to a sitcom, but a good sitcom. There have been such things, you know. Page, fresh off her star-making turn as Juno (though Smart People was filmed earlier), is an actress I've liked in a couple of movies I disliked (Juno and Hard Candy). Finally, a movie with her that I actually like! Feels good. And she's great in it. The character is similar to Juno, but not quite so despicably precious. I like how the writer and director invite the audience to dislike all four of the major characters, at least a bit. They are recognizable people, which is, unfortunately, a rarity in movies. I liked the movie, and recommend it.","user":"zetes","rank":[74,96]},{"title":"Good, but don't go in expecting a comedy","rating":7,"date":"24 April 2008","review":"When I saw \"Smart People\" the trailer, I have to say that the first thought that came into my mind is \"Sideways: Part 2\". It had the same formula and characters. But I really wasn't as into Sideways as everyone else was, so I wasn't so excited to see this movie. But today I just decided to go ahead and give it a chance, I'm more grown up since I've seen Sideways, so why not just see what the film had to offer? I have to say while the movie does not excite me, I also see it doesn't excite too many people here on IMDb, it's a decent enough movie and worth the watch. The solid performances make the film likable and the story is interesting to watch, while it's not something that everyone can relate too, it's a good movie.<br><br>Lawerance is a college professor who isn't the most popular guy on campus, he's pompous, arrogant, and puts himself higher above his students while ignoring their plea's for extra help on assignments. His son hates him, his daughter admires him and is quite the over achiever, and his adopted brother is a scam artist. But when Lawerance has an accident while jumping fence, he hits his head, and meets former student, Janet Hartigan. They start to date, his daughter, Vanessa, goes through her life realizing she's never really had fun, and his adopted brother, Chuck needs this family just as much as Lawerance needs it.<br><br>Smart People, the major problem is that this was advertised as a comedy, it has some funny moments, but they're not what you would call laugh out loud. I'd say this is more of a drama with comedic elements, kind of like \"Dan in Real Life\", so Smart People didn't have \"Smart Advertisement\", but the movie is worth the watch. I would recommend it, it's an interesting film, not thrilling, so I would recommend probably waiting for the rental. But the cast pulls the movie together and makes it into a good drama.<br><br>7/10","user":"Smells_Like_Cheese","rank":[62,83]}]