[{"title":"It's a B-flick, but an okay flick nonetheless.","rating":6,"date":"28 October 2013","review":"This is actually a pretty decent movie. The writing is a bit weird, but the story is compelling and you really get involved with the characters after a while. This is more of a thinker, not an action-filled CGI-flick, but somehow it has its' own﻿ tension and several exciting moments. I've never been a Nick Stahl fan, but he does an okay job in this (even though he's a bit monotonous). It wouldn't've been the same without Mia Maestro though. She does great, and whatever weirdness is portrayed is only due to the script. Good flick.<br><br>The concept could've been way more evolved, and with a super-budget and a different lead role, it could've been a blockbuster. The editing is at times awkward, and some scenes feel unfinished, but the main story is kinda cool. It leaves you with a weird feeling, mostly in a good way. If you've got nothing better to watch, and enjoy some semi-mindplay by mediocre actors (except Mia), it's worth a shot.","user":"thomas-lyngstad","rank":[7,7]},{"title":"I know exactly what you're thinking...literally","rating":4,"date":"5 July 2011","review":"In the wake of the ultra budget blockbuster super-hero flicks, \"The Speed of Thought\" enters as a small link on the chain in the people-with-special-abilities genre. There are going to be less camera setups, bombastic-less music, no flashy costumes but instead more story and dialogue to concentrate on.<br><br>A telepath named Joshua Lazarus (Nick Stahl), who works covertly for the NSA branch of the government, has a degenerative disease as a result of his ability. He's told no one survives past 28 yet the pills he's given will stale the inevitable. He's got nothing to lose if there's no future ahead of him, so he hangs loose with drinking, gambling, call girls and awaits madness to take hold, as the voices that were once controllable start to pile up. A light at the end of the tunnel appears and he gains some hope on one of his last missions in Uruguay when he meets an attractive woman named Anna (Mia Maestro) who also has the mind-reading ability known as \"scoping.\" <br><br>Joshua has a mentor named Sandy (Wallace Shawn) who runs \"The Home\" in which special people of his kind are kept for training and treatment. Sandy eases the pressure of withering away with sympathetic talks as he's dealt with many in the same situation. His slightly older friend Kira (Taryn Manning) starts to show symptoms before himself, yet at the same time she oddly starts to gain some new abilities. With Anna, Joshua finds a true connection when they mind meld memories together. Instead of showing shots of the characters' faces in person and a voice over top, this switches to an isolated area that has them dreamily talking to each other face-to face in what looks like they're physically standing there.<br><br>This is as much of a slow moving drama as it's a love-at-first-telepathic-reading type of movie in the vicinity of \"Hereafter\" though without being exactly the same. Joshua and Anna form a forbidden connection as she's a natural who could never share her secret and he swore secrecy to the people he works for who keep a very close eye on him. They become personal in their heads but yearn for that physical touch. Together they make an attempt to get away from it all to be together no matter where that is but are sucked back into it when the company gets hot on their tail and some revelations are unveiled about who's really who and what it all means.<br><br>\"The Speed of Thought\" is a simple movie to escape with as you get the special abilities side that comes with its own set of rules and there is also some romance to make it more personable. If they shaved off some time it would have made a decent enough hour long TV pilot to get engaged in. But as is, the dialogue frequently overemphasizes to nail the point home and it causes the flow to get stuck in a lower gear and become somewhat tedious. Blair Brown, who plays the boss, feels tight casted from Fringe. There's some chemistry among the characters though it doesn't always leave much to read between the lines for what they're feeling or how it works. Usually filmmakers find a balance in the middle of stating the obvious and being too vague yet this continually steps over the line towards the former. Confusion--nope. Subtlety--what's that? Nearly every thought and movement is laid out in plain view, which sucks out the passion and challenge after awhile when it started out on a higher note. For a film about the mind, the dialogue doesn't always leave much to the imagination and drags down some of the rest of the film with oversimplification. (Also submitted on Cinema Freaks, http://docuniverse.blogspot.com)","user":"TheHrunting","rank":[27,41]},{"title":"How did THAT part of the script not get fixed?","rating":3,"date":"4 July 2012","review":"Mustresistobvious jokeabout how at leastthis is notthe worst thing ever createdby an Oppenheimer! Yeah, whenever a movie makes you wonder if the residents of 1945 Hiroshima and Nagasaki really had it all that bad, you know you've found a truly stinky chunk of cinema. When the special effects in a 2011 film look like they were produced with the green screen technology of a late 1970s episode of The Electric Company and that's STILL not the worst thing about it, you know you've found a motion picture you have to warn people about. Terrible. Awful. Atrocious. Even those words fail to describe The Speed of Thought. You've got to reach down for terms like hapless and pathetic and sad. I mean, Wallace Shawn is in this thing. Wallace Shawn! There should be a law that if you're ever in something as good as The Princess Bride, you're not allowed to be in anything as bad as this. We should be handing out government stipends or something to prevent it.<br><br>Joshua Lazarus (Nick Stahl) is a young man withokay, let's start right here. Lazarus? Seriously? You could forgive something like that if this was a story about reincarnation or near death experiences, but this is about telepathy. You could overlook it if this was an action flick starring Jean-Claude Van Damme, but this is a sci-fi drama. Joshua LAZARUS? That's like a 12 year old boy naming the main character in his story Nick Steele or Rock Hardman. If you can't avoid the painfully low rent cliché of giving your characters names that sound \"cool\", don't even bother with the whole writing gig.<br><br>Anyway, Joshua Lazarus is a young man with the ability to read minds. Called a \"scoper\" by his government handlers and Sandy (Wallace Shawn), the Professor Xish guy who's gathered Lazarus and other young telepaths to try and help them with their abilities, Lazarus uses his talents for spying and more exotic assignments. His latest one is to beat a Uruguayan dude at poker until he's bankrupt as punishment for defying U.S. demands. When he's not doing that, Lazarus spends his time drinking and whoring because he just turned 28 and \"scopers\" never live past 29 without going insane. It turns out, though, the Uruguayan dude's daughter (Mia Maestro) is also a secret \"scoper\". She's also 31 and in fine mental health. With his world turned upside down, Lazarus tries to escape his NSA masters with the help of another telepath (Taryn Manning) and his Jewish, mobster, Holocaust survivor of a father whom he hasn't seen in 20 years. Yeah, that's right. Jewish, mobster, Holocaust survivor of a father whom he hasn't seen in 20 years. I'm surprised writer/director/dolt Evan Oppenheimer didn't make the dad transgendered while he was at it.<br><br>Anyway, Lazarus is recaptured and discovers the true extent of the lies which have dominated his whole life. And we get to see a chick's bare ass at the beginning of the movie. That's pretty much everything.<br><br>I figured out The Speed of Thought was going to suck early on and when it got to the pitiful green screen effects, I expected that to be the low point of the production. They would have looked bad back in the 1980s on some syndicated sci-fi show. 20some years later, they're less special effects and more a cry for help. \"Stop me before I CGI again!\" I will grant that expectations have been raised to ridiculous heights and any effect now that doesn't look 100% real and natural sticks out like a sore thumb. However, The Speed of Thought takes that sore thumb and sticks it right in the viewer's eye. High school film projects have been special effects than this.<br><br>I thought the effects were going to be the worst this film had to offer. My mistake, and I know what you're thinking. Was the worst the whole \"Jewish, mobster, Holocaust survivor whom he hadn't seen in 20 years\" thing? Nope. The true nadir was one of those things where you literally cannot understand how anyone could have come up with something so stupid. Imagine you're 28 and you have a condition where everyone who's ever had it has gone insane by 29. Then to meet someone with the condition who's older than 29 and not insane. Wouldn't finding out how that's possible instantly become the all consuming passion of your life so you can save yourself and everyone else with the condition? That's certainly how I'd react. Joshua Lazarus reacts like the Uruguayan dude's daughter told him she was a Presbyterian. He doesn't do anything with the information. They don't even discuss it. It's just a plot point that gets filed away until it needs to be brought back later in the movie. Overall, the script for The Speed of Thought is bad but not grotesquely so. However, Lazarus' indifference to the whole \"not going insane at 29\" revelation is one of the worst bits of writing I've ever encountered in any genre or medium. Every single person who read this screenplay should have noticed such a gargantuan flaw. That it remains in the final product defies explanation.<br><br>I'm sure Oppenheimer started his work with the best of intentions. The end result is still a bomb. Damn! I almost made it.<br><br>Needless to say, don't watch this movie.","user":"MBunge","rank":[9,13]}]