[{"title":"Let the child in you enjoy this adventure","rating":8,"date":"28 September 2012","review":"Cute movie. Has a couple of great messages -- especially one about prejudices. There are some adult jokes, some childish jokes, lots of laugh out loud moments but most importantly the following messages: Hatred against those we don't know is wrong; Let yourself get to know a person before deciding whether they are good or not; and go along for the ride and let yourself enjoy life.<br><br>I also love the fact that this is a Dad raising his child situation. There are really few movies that show a Dad can step up and do the right thing for their children if given the chance.<br><br>While I didn't particularly care for the fart joke or some of the childish parts the kids in the theater laughed and laughed.<br><br>Well done!","user":"jancr57","rank":[91,122]},{"title":"Very enjoyable experience","rating":10,"date":"28 September 2012","review":"I gave this a complete 10 because both the wife and I (as well as the other movie-goers -going by their reactions) thoroughly enjoyed it from the beginning to the very end.<br><br>Was it predictable? Of course. Its an animation geared towards children (what would you expect?) -but like most of the animation movies of today, there were quite a few 'hidden humor' spots as well which would be completely missed by the younger audience (not unexpected since it is the adults, after all, who are forking over the bread and it doesn't hurt to keep THEM entertained as well). The movie is fairly fast-paced and the animation well done. I'm usually a little apprehensive when I've harbored good expectations from a movie based on clips/previews, but in this case I felt it truly delivered. This one will be added to our library when it (eventually) hits the shelves. Too many people look for a great amount of depth and unpredictability in animation movies -but THAT is a bit unrealistic (no pun intended) -think about it: These things USED to be called CARTOON MOVIES for a reason. They weren't intended to fit that kind of expectation. They ARE intended to be fun -and this movie is just that: FUN.","user":"nightbiker-1","rank":[118,170]},{"title":"One of the best (funniest) animations I've seen in years!","rating":9,"date":"29 September 2012","review":"I went to see Hotel Transylvania last night in a small group of adults aged 24-30 and I LMAO as did the others. The theater was packed with little children who mostly laughed at not really funny parts and adults who laughed when the children were quite silent. The story is about Count Dracule trying to raise his only child safe and sound away from terrifying humans and invites all the monsters to his hotel to relax and celebrate his very young daughter's 118th birthday which is accompanied by a surprise visitor! <br><br>This is a really funny movie with a simple predictable story line and tons of characters that you will love. My favorites were the zombies who were the hotel staff and it took them forever to finish a task. I recommend this movie to anyone who like monsters ( so afraid of a little boy licking ice-cream)and want to have a good laugh and take a break from Disney.","user":"eshghefilm","rank":[105,153]}]