[{"title":"The last 30 mins is hilarious n gory.","rating":7,"date":"3 January 2020","review":"I first saw this in 2007 on a dvd which I own. Revisited it recently.\nConsidering the budget n the team's inexperience, flaws can be overlooked n the last 30 mins will compensate the initial 50 mins boredom.\nIt is about a loner n depressed guy living alone with his cat named Sir Lancelot. The guy wants to watch a horror film on a Halloween night but his cat doesn't get up from his chair n so our guy goes out to a private party uninvited after finding the invitation card on the road, unknown to him that the hosts has plans to murder the guy for some art collection.\nNothing happens for 50 mins but the last 30 mins is full of bloodbath and hilarity.","user":"Fella_shibby","rank":[27,29]},{"title":"Refreshing Horror Comedy","rating":9,"date":"23 October 2007","review":"Well done. Not just a horror movie that gets laughs from the horror gags. The humor was steady throughout, if you like dark comedy. I found the story to be refreshing as it doesn't \"keyframe\" its story with cliché. Whether it be Hollywood formula, cinematic guidelines, director's guild tribal knowledge, or actor's schizophrenia, this movie doesn't rely on these tried and true methods. It's shock value is in the twist of fate scenario(s), and the absurdity of human behavior.<br><br>The gore content was only at a level as what was necessary, not over the top. Some may disagree here, but think about all the zombie movies. Okay, the \"art\" room may have been a little graphic, emphasizing \"little\", but it was... \"art\", eh? Even the attempted gore had humorous tones. I didn't laugh out loud... but it was funny! <br><br>For those of you who like dark comedy, horror movies and action, and want something new and refreshing, watch Murder Party.<br><br>Oh, yeah, after watching it you'll learn that even a \"cat\" will understand that the master has had a really, really bad day.","user":"mindsclay","rank":[60,76]},{"title":"Not bad for a very low budget","rating":6,"date":"26 February 2019","review":"I stumbled across 'Murder Party' last night on Netflix and thought it looked worth a watch. It was apparent pretty early on that this was filmed with a very low budget (the trivia section claims it was made with \"no money\"). The actors were unrecognisable, the sets were reasonably basic and there were not going to be any special effects at any point in the film clearly. None of that means it can't be a good film however. Hell, look at Kevin Smith's 'Clerks' for proof.<br><br>The director of 'Murder Party' has gone on to make some very well received horror/thriller films, so it very cool to see where he, Jeremy Saulnier, got his start. There are some elements to the film that would indicate there was class behind the camera. A lot of the dialogue is quite intriguing and surprisingly well written (a must for a low-budget film). Also considering the budget the horror scenes that feature later in the film were very well created. The film is short at only 80 minutes and even then feels like it could have shaved 15-20 minutes off. The pacing in the first half of the film is a slight issue. Also I wouldn't have minded seeing a more creative ending. All in all though this is a watchable enough film if you stumble across it on Netflix late one night.","user":"jtindahouse","rank":[8,9]}]