[{"title":"Demands A Viewing","rating":9,"date":"2 October 2008","review":"Two things about this film took away a star. One was that Bill Maher spent so much time with the ones he tried to make look bad that he didn't meet with enough experts who could further the points he was making. The second problem is that the people he interviewed could have easily made fools of themselves without him cutting them off and lecturing them. That being said, let's get to the good points.<br><br>For one thing, he makes it so clear how illogical the mass amount of people can be. He exposes phony beliefs and shows how they can become very protective against his film crew. The film stock they put into use is done masterfully. Plenty of laugh out loud moments (particularly the image of Jesus as a teenager, you will see). My word must be taken as truth when I say that the final part of the film MUST be seen. This isn't just about cracking jokes on faith. This film is about the human race taking responsibility of itself and stopping the damage it has been doing for far too long.<br><br>I truly hope religious people are not quick to brush this film off. For once, listen to the side from someone who is sincerely concerned about all of our futures.","user":"ctg0724","rank":[238,328]},{"title":"Contemplative Religiosity For The Masses","rating":7,"date":"5 August 2008","review":"Saw the world premier of this at the Traverse City Film Festival. I am a big Bill Maher fan and this was definitely the movie/documentary I was most looking forward to at the festival.<br><br>I was not disappointed, though I think it could have been developed a bit more. It seemed to play to the lowest common denominator in that a lot of issues were touched on, sometimes in rapid fashion, but none was examined closely for any length of time. Any astute viewer of Real Time already knows what Maher thinks about religion and many of his arguments with regard to the same. I was hoping for a more in depth analysis of some of the primary aspects of how religion can negatively affect our world in ways that people might not intend. The documentary did that only on the surface. I suppose that shouldn't be surprising as the need to draw people into contemplative thought in this area is probably more of a priority than retaining those that already are there (not to mention selling more tickets).<br><br>Subsequent to the showing, director Larry Charles had a discussion on stage with Michael Moore, with questions from the audience. Larry pointed out that he had many many more hours of footage that didn't make it into the final cut, and that he thought maybe a series could be released on cable of this material. I would very much like to see that happen as I think it would quell the thirst I had for more substance with less of the fluff.<br><br>However, kudos for Maher and Charles for doing this. If it is successful in getting people to think about religion in real world terms, then it has accomplished its goal.","user":"toniintc","rank":[313,439]},{"title":"Fantastic","rating":10,"date":"6 October 2008","review":"I found this movie exhilarating. I'm with you, Bill Maher! That said, this film attempts to cover the basic tenets and idiocies of several of the major religions, namely Catholicism, Judaism, and Islam. It also encompasses evangelical/American/born-again-type Jesus-focused religion, which considers itself \"Christian\" but I have never understood that title, since Catholics revere Jesus also. But anyway...<br><br>Maher is a smart man, and I would like to think that he considered the points I feel were left out of the movie and chose not to include them for the sake of condensing the film. However, there are several facts that I think would have made an even stronger case against mass religion in general: <br><br>1. Although Maher mentions several times that the Judeo-Christian Bible was written by men, and therefore contains the fallacies of men, he does not bring up the fact that the Bible has been constantly rewritten, translated from language to language, and amended to suit the needs of those in charge of its distribution -- for most of history since Christ, this was the Catholic Church and its founders. And for those of you who don't know, translation is not an exact science. Languages just do not translate word for word, and the accuracy of the translation depends on the skill, vocabulary, and motives of the translator (a human being, don't forget).<br><br>2. Catholicism was successful because it incorporated many old religions. Greek and Roman gods are just a few of those who have direct equivalents among the Catholic saints. Mahar discusses the inherent flaw in a monotheistic religion with bunches of demigods, but he does not point out that Catholicism deliberately found supposedly Catholic replacements for the more ancient, household-type gods. Why? Because those who wanted the religion to succeed decided that people would be more likely to convert to it if it weren't too different from what they were used to. Why did these men want the religion to succeed? For the same reasons that people promote religions today: to gain money and power, particularly in the form of influence. Maher reminds us that the story of Jesus Christ included many elements of older heroes or gods, but the film presents this as a matter of fact, not pointing out that Catholicism was built upon the success of these preceding stories and histories. The types of dramas that move the human spirit have not changed over thousands of years--they have simply been retold and reinterpreted.<br><br>3. My third point is more of a question. I was raised as a \"nouveau\" American Catholic, so I feel that I know a little bit about that religion, but I know next to nothing about Islam. However, it is my understanding that Mohammed did not want images of himself used to promote his teachings. Is this why some Muslims get so mad when an image, ridiculing or not, of the prophet is publicized? I wish Maher had included this, as he did talk a lot about the violence specified in the Koran.<br><br>This is a terrific film. It is funny and has a great soundtrack. My hat is off to Maher for his nerve in interviewing people who become belligerent when their religion is questioned. I guess it partly comes from being a comedian--one must have guts and a thick skin! The message of the film, however, is not humorous at all. It is truly terrifying to think of all the murder, torture, and oppression that is perpetuated in the name of religion. Why then, is someone who calls himself \"Godly\" or \"religious\" considered to be a person with wholesome morals?","user":"JumeirahSun","rank":[218,316]}]