[{"title":"Pointless","rating":3,"date":"12 June 2010","review":"I don't know what this movie was trying to be, but I can tell you it did not succeed. Even after seeing it I'm still not sure what it was about. I understand the plot was deliberately mysterious, and even that that was the main aspect of the movie, but it never travels down that required path of unraveling the mystery. Part of the problem is the production values are fairly low so you are never certain if the reason it doesn't make sense is because it was meant to be that way and you are supposed to figure something out for yourself, or it was just poorly made. I can't point to any one aspect of the film that was particularly bad, but like the acting the whole thing was incredibly average.<br><br>The plot revolves around two men and two women who find themselves waking up in strange places together. Through a series of flashbacks we see that they had a past together. I don't know how much of a spoiler this is, but I have to take a crack at what I think it's about. We find out the one guy, while not exactly evil, was not very noble, let's say, when his friends needed him. So I think he is in purgatory reliving his failures. But who knows. Like I said, it's never resolved in the film. Which might be alright if it is interesting enough along the way or has some other redeeming features, but sadly it doesn't.","user":"lerner-3","rank":[18,23]},{"title":"Not sure what to say","rating":4,"date":"29 February 2016","review":"Well this wasn't an awful movie. It had a lot of mystery and kept me intrigued all the way through. The acting was actually pretty good. Except for the guy trying to be Jessie Pinkman the entire movie. Other than that though it was really good.<br><br>I did notice they stole the music from Batman Begins several times in the movie. Not sure that fit very well.<br><br>The biggest draw back to this move was that they never really explained what happened at all. I like movies that leave the story up to the viewer to interpret, but this one didn't give you any where near enough information to figure out what the heck happened. <br><br>So, basically, not a bad movie, but very confusing.","user":"tmdarby","rank":[2,3]}]