[{"title":"We can't have our law officers beatin' people half to death for no reason.","rating":8,"date":"3 October 2010","review":"Appaloosa is based on the 2005 novel of the same name written by Robert B. Parker. It's directed by Ed Harris, who also co-writes the story with Robert Knott. Harris also stars alongside Viggo Mortensen, Renée Zellweger, Jeremy Irons &amp; Lance Henriksen. Music is by Jeff Beal and Dean Semler provides cinematography on location in Albuquerque, Austin and Santa Fe.<br><br>Appaloosa is in the grip of bully boy rancher Randall Bragg (Irons), who finally oversteps the mark when the latest Marshall and his deputies are killed in cold blood. The townsfolk decide enough is enough and hire no nonsense travelling lawmen Virgil Cole (Harris) and his sidekick Everett Hitch (Mortensen) to protect and serve the town. Ruling with a rod of iron, Cole &amp; Hitch start to bring order to Appaloosa, but the arrival in town of pretty Allie French (Zellweger) causes quite a stir between the two men. Bad timing too since the guys are trying to get Bragg to his rightful execution.<br><br>In the modern era the Western has been the hardest genre for film makers to tackle. You can probably count on one hand the number of great or agreeable ones that have surfaced post Costner and Eastwood's efforts of 1990 and 1992 respectively. Enter Ed Harris, who undaunted by the long odds of getting a Western to be successful; and suffering worrying overtures from his backers at New Line Cinema, got Appaloosa made. Well made as it happens.<br><br>Since the story itself is etched like the Wyatt Earp legend, there's really no fresh perspective on offer here. In fact, anyone familiar with Edward Dmytryk's excellent Warlock from 1959 will feel some narrative déjà vu. But Appaloosa does have strong performances and lush landscapes to see it successfully home. Slotting in a good helping of action, romance and humour also goes some way to making Harris' movie a worthy modern day Oater. True, the cliche's are many, but Harris wasn't after revisionism, he wanted (and got) old fashioned Oater values. A film that follows those old beloved B movie Western conventions, but one that still retains a topical criminal thread.<br><br>The best reward in the film comes from spending time with Harris &amp; Mortensen. Their characters are nicely drawn and not over cooked by the script. Cole &amp; Hitch are devoted to each other, lots of straight love and respect exists between the two men. Their bond is believably brought to life by Harris &amp; Mortensen, who formed a friendship when making A History Of Violence for David Cronenberg in 2005. Zellweger and Irons too are not without high merit value. She (stepping in when Diane Lane walked over delays), is pleasing and captivates in what is the critical glue role. While he is dandy dastardly supreme, a well spoken villain of much intelligence and crafty as a cat.<br><br>Appaloosa is a subtle film, both in story and as a technical production. Beal's score is unobtrusive, while Semler's photography manages to deliver that old fashioned feel that Harris was after (the low lighting for the interiors is particularly on the money) . Harris' direction is smooth and unhurried in pace, with the odd inspired bit thrown in for good measure (check out the up-tilt camera work during a train on a bridge sequence). While the production design can't be faulted. All that and you got the likes of Henriksen and Timothy Spall in the support cast too. A lovely film that is as tight as the friendship at its core. 7.5/10","user":"hitchcockthelegend","rank":[46,50]},{"title":"A Real Western","rating":9,"date":"2 October 2008","review":"I saw Appaloosa last night. Absolutely fantastic. Whether it is because he is a bit older I don't know, but Ed Harris obviously actually understands westerns.<br><br>A straightforward western tale with very little revisionism, with real men doing \"what men have to do\". The sense of space, the wish to be part of civilization, the bad men resisting that encroachment, the sense of the mythic; it was all there.<br><br>A little bit more modern in approach than a classic 50's tale, particularly in how Renée Zellwegger's character developed, but a real story nevertheless; good guys, bad guys. Jeremy Irons is very good as the baddie. Timothy Spall is good comic relief and Ed Harris and Vigo Mortensen a terrific pair, carefully nurturing their relationship while understanding exactly what they have to do.<br><br>The pace was very good, allowing the story and character to develop properly. Even so, it could have and should have been shorter - John Ford, or more likely Anthony Mann would have got through this story in about 90 minutes, but very satisfying nevertheless.<br><br>Costner did a pretty good job on Open Range (that was really miles too long), 3:10 to Yuma was pathetic (why they bothered to remake it when the makers so totally misunderstood the thrust of the original I will never know).<br><br>But this was the real deal, or at least as near to the real deal as we are ever likely to get nowadays. Too bad it will disappear without a trace.","user":"Stamp-3","rank":[176,244]},{"title":"Superb!","rating":8,"date":"4 October 2008","review":"One reviewer remarked how \"Ed Harris understands (the) Western (genre)\" I couldn't agree more. This film is a delight. The writing is solid, the dialog sparked with humor, the heroes are more than caricatures and cardboard cut-outs, the villains are worthy anti-heroes and the back-up is wonderful. The performances of Ed Harris, Viggo Mortensen and Jeremy Irons as the main protag-/antagonists are sterling. Harris is the lonely paladin, uncompromising in his ethic, drawn in by the warmth and softness of a needful woman, artfully and convincingly played by Renee Zellweger; Mortensen is the slightly jaded sidekick who both respects and doesn't completely understand his hero. A parallel villain is offered by Lance Henrikson, a kind of poor man's Clint Eastwood, giving an interesting twist to the story. Some comic relief is offered by veteran character actor, James Gammon and fine British actor Timothy Spall without reducing the tension in the story line or reverting to a burlesque. The mythic theme of the knight-errant works well in this presentation brought to light by the competent direction of Ed Harris. My only fear is that it being devoid of ballet-type ritual killings, CGI and only a mild spattering of violence, it will likely fly under the radar of much of today's theater goers, which is a shame. It's a fine film.","user":"artzau","rank":[174,245]}]