[{"title":"First Class Nora Roberts TV Film","rating":6,"date":"21 February 2007","review":"Fantastic portrayal of a Nora Roberts novel which had me spellbound from the very beginning of this film to the very end. This film captures your attention on two very young girls swimming in a lake and one of the girls, Claire Forlani,(Tori),\"Hooligans\", has the ability to see visions in her head that tell her deep dark things that have happened or going to happen. Oliver Hudson,(Cade Lavelle) and Josie Davis,(Faith Lavelle) both give great supporting roles along with Jacqueline Bisset,( Margaret). There is some torrid love scenes involving Faith Lavelle along with a few laughs and bad child abuse scenes which happened to Tori when she was very young. This is a first Class Nora Roberts TV film and is definitely not your routine television entertainment. FIRST CLASS Enjoy","user":"whpratt1","rank":[31,49]},{"title":"I guess the book was pretty good.","rating":4,"date":"19 February 2007","review":"I read a lot of high hopes from readers of the book that this would be a faithful adaptation of Nora Roberts' story. Not having read the book, I don't know if this adaptation was faithful but I do know it wasn't good. Actually, the screenplay was the best part of the movie so kudos to Nora Roberts.<br><br>I planned ahead and watched Carolina Moon because of Claire Forlani. I've never been sure if she's a good actress. She's been decent in some movies, average in others and really bad in this one. But, Forlani wasn't alone. The performances were all over the place. Oliver Hudson was wooden and boring. Josie Davis was hammy. Then, amidst all this B-rate acting, there's Jacqueline Bisset! She didn't have a lot to do other than portray bitterness but, even sleepwalking through that, she was miles ahead of the others.<br><br>Still, Forlani remains one of the most breathtaking women in movies and I was not disappointed in that capacity here. I believe Forlani can be more than eye-candy but, until she turns in a good performance in a good movie, she continues to excel at that. And, I'll continue to faithfully watch everything she participates in. Fandom is fun that way.<br><br>This movie though, Carolina Moon, was pretty bad. In addition to the bad acting (fake Southern accents are really distracting) the direction was pedestrian. It wasn't horrible. It was just the boring made-for-TV caliber you're used to seeing on Lifetime.<br><br>If you're a fan of any of the stars you can probably enjoy Carolina Moon for that reason, as I did. If you're a fan of the book you might enjoy seeing the story on the screen, albeit in a lackluster form. Otherwise, this movie is unremarkable.","user":"CMUltra","rank":[23,37]},{"title":"*Warning* this is one bad movie!!!!","rating":2,"date":"2 October 2007","review":"The story is about a psychic woman, Tory, who returns to her hometown and begins reliving her traumatic childhood past (the death of her childhood friend and abusive father). Tory discovers that her friend was just the first in a string of murders that are still occurring. Can her psychic powers help solve the crimes and stop the continuing murders? <br><br>You really don't need to find out because, Oh My God! This was so so so so bad! I know all the Nora Roberts fans will flock to this movie and give it tons of 10's. Then the rest of us will see an IMDb score of 6 and actually think this movie is worth watching. But do not be fooled. The ending was predictable, the acting TERRIBLE (don't even get me started about the southern accents *y'all*) and the story was trite. Just remember....you were warned!","user":"kreidler","rank":[28,52]}]