[{"title":"Very well done but the documentary might be something you're looking for if you want all the details.","rating":7,"date":"30 April 2014","review":"\"Devil's Knot\" is a slightly fictionalized account of a famous triple murder that happened in West Memphis, Arkansas back in 1993. Three young men were convicted of killing three small children and much of the evidence presented in court was testimony that the alleged perpetrators were young, listened to heavy metal music and had an interest in the occult...along with about 10,000,000 other teens at that time! The film talks a lot about the conflicting evidence, recanted testimony and holes in the case. And, it gives two other possible perpetrators who were never prosecuted. But, because the community was looking for convictions and because there was a strong cultural belief in the existence of satanic murder cults, folks seemed more than willing to see these three teens convictedand so they were.<br><br>The film does work very well in convincing the audience and providing an entertaining film. Your heart will certainly get caught up in the film and it will have a strong impact on viewers. The director, production staff and everyone associated with the film did quite well. When it comes to the acting, it was also very good all around. I was particularly impressed by Colin Firth--who sounded amazingly NON-British in the movie. This came as a bit surprise. <br><br>If you are looking for a thorough examination of the killings, the folks involved and subsequent trial, this film may leave you a bit cold, unfortunately. For dramatic reasons, the film chose to focus on one particular mother (probably because she was played by Reese Witherspoon) and completely ignored the other two grieving families--a very, very odd omission to say the least and something that seems a bit offensive. If you are interested in all the details of the case, then see \"Paradise Lost: The Child Murders at Robin Hood Hills\", \"Paradise Lost 2: Revelations\", and \"Paradise Lost 3: Purgatory\"—three documentaries about the infamous 'Memphis Three' directed by Joe Berlinger and Bruce Sinofsky<br><br>Overall, the movie is a good, well-constructed drama and a reasonably fair representation of the case--albeit far from a perfect one. It's worth seeing and entertaining but not a film for kids to see because of the subject matter. And, if you do watch, you might want to keep some Kleenex handy...it has a few gut-wrenching moments.","user":"MartinHafer","rank":[63,78]},{"title":"Paradise Lost series makes this a little flat","rating":6,"date":"30 April 2014","review":"\"The Devil's Knot\" is the true story of the Robin Hood Hills murder. The movie itself kind of falls flat for me compared to the documentary series that followed the story all the way through.<br><br>Reese Witherspoon and Colin Firth are strong actors, but this story is well documented from start to finish and it was only a matter of time before a movie was made, especially because people in Hollywood got involved in this one early.<br><br>I don't think there was really anything wrong with the movie itself. It is a compelling story and needs to be told. It is just that the \"Paradise Lost,\" series that followed the real players in the story was full of twists and turns that Hollywood's top writers couldn't make this stuff up.<br><br>I watched the first documentary when it came out and I was a kid (I was a Metallica fan and their music was used). A couple of years ago I watched the 2 follow ons. If you haven't watched those I say watch this one first. I say that because the series were absolutely captivating when you get into it, and if you watch this first I think you will feel that this falls flat to the real deal. I say the documentaries are captivating, I know that sounds bad given the real crime involved, but it was kind of unbelievable. Then again it is good to illustrate these to a new generation that don't know much about this story. So maybe I am too old to appreciate this movie.<br><br>The child's voice narration in this movie just really should have been something they cut in this movie. I understand why it was inserted, but it really wasn't handled very well. It was out of place. If it was done to unnerve people and highlight something, it did, but not exactly in the way that it was meant to do. It's something that has to be done perfectly otherwise cut it, In my opinion, it should have been cut out.<br><br>WARNING: Do not read beyond this point if you don't know the story, because this may be a spoiler.<br><br>I am still a proponent of the death penalty after the details of what happened here. The system is broken in many ways but it is the best we have. I think some of the appeals process needs to be fixed, and a lot of convicts that were convicted before a lot of the DNA and forensic science that we have now today should be allotted more consideration/appeal hearings in order to be sure of their guilt or innocence as well. <br><br>The big part of the system that failed here in my eyes is that the Appeals process just continued to go back to the same Judge. I have all the respect in the world for the occupation Judges serve in and the incredible pressures put on them and the difficult job they do. BUT sometimes when you have that kind of power it is easy to remember you are a human being and can and do make mistakes. If the same Judge gets to handle an appeal he is essentially being asked to admit the prosecutor, jury, or he, himself made a mistake. That's a tall order.","user":"Tcarts76","rank":[16,18]},{"title":"What to Expect: Devil's Knot","rating":7,"date":"15 April 2014","review":"Why You Might Like It: This movie is an above average murder mystery/courtroom drama. It is based on real events, which is something that definitely makes the film more intriguing and interesting. The cast is well put together and the acting is on par for the most part. Witherspoon and Firth deliver solid performances and the supporting cast do a fine job. I thought the movie had a nice flow to it and the some of the cinematography was well done. I do give the director credit for some of the scenes in the film that are a little troubling to watch because I believe it is important to the final product. I don't believe I would make the trip to the theater to see it, but it is well worth a rental.<br><br>Why You Might Not Like It: I will say that the content is disturbing and there are parts of the movie that are really hard to watch. Afterall, this movie is about the brutal murder of three young kids. This isn't something that is depicted off camera, but instead there are parts and images shown in plain view that will bother most viewers. There are a couple of the roles in the movie that seem to be a little overacted and stereotyped, but that is just my opinion. I also thought there were a few spots in the movie that were a little choppy, which had a minor effect on the way the film plays out.<br><br>Acting/Casting: 7* <br><br>Directing/Cinematography/Technical: 6.5*<br><br>Plot/Characters: 7* <br><br>Entertainment Value: 6.5* <br><br>Total - 7+6.5+7+6.5 = 27/4 = 6.75* - Well worth a rental","user":"ck10101980","rank":[64,84]}]