[{"title":"love this movie highly recommend","rating":9,"date":"24 February 2020","review":"Sandra Bullock is rapid and compelling in this true story of tragedy-turned-triumph. The Blind Side is an enjoyable that some may consider a bit too soft or safe. Though it won't completely win moviegoers over, they'll still be in awe of the bold lead actress.","user":"MR_Heraclius","rank":[39,41]},{"title":"I can see why Michael Oher was unhappy with this film","rating":5,"date":"11 October 2010","review":"First of all, Quinton did a fine job in the lead role. Let's get that out of the way. Great acting job. He took the material he was given and played the role very well.<br><br>However, this film is pure Hollywood sap, a \"feel good\" movie that picks and chooses factual elements and builds a fictional tale around them. The film loves the character of Leigh Ann (who is really not that interesting, although she is kind hearted and generous), and as a result, Oher is relegated to a shy over-sized charity case with no clue and no skills of any sort, other than his natural kindness and resilient character. That strengthens the focus on Leigh Ann's rescue actions, how she \"saved\" this poor aimless kid and gave him all the life skills he needed to succeed on and off the football field. It resonates with white suburban do-gooder audiences, but it's just not accurate.<br><br>In truth, Michael Oher was already a very good football player when the Tuohy family took him in. And he had a bold, confident personality that rubbed off on everyone and made him a natural leader. He was a motivated, focused kid who knew what he wanted, but came from an environment where no one really cared or provided support. He was NOT a shy, introverted pathetic case. He just came from a terrible domestic environment and found stability with a nice rich family. The real story of Michael Oher is how he caught the luckiest of breaks and escaped the ghetto jungle and was able to leave all that soul crushing crap behind, and focus on academics and athletics in a completely different upper middle class environment. It's a study in how important environment is in the life of kids and teenagers, and how it can make a huge difference.<br><br>But what we, the audience, receive is a Hallmark channel film that is nothing more than a lazy, formulaic, fictionalized \"warm your heart\" chick flick couched in a football world. Sassy dialogue, woman-takes-charge scenes, tender moments, etc -- all the usual stuff is there. The film would have been FAR better had it focused on Oher as the lead character, instead of Bullock. No offense to Bullock, who is a fine actor.<br><br>It is well known that real life Michael Oher was very displeased with this film, and how it portrayed him.","user":"itszombietime","rank":[129,161]},{"title":"Better than I thought","rating":8,"date":"21 November 2009","review":"I've been reading lot of horrible comments that are based solely on the issues surrounding the movie rather than the movie itself. I wasn't excited to see this movie, I'm not interested in sports at all. The movie kept my attention though and well. It moved along quickly and pulled me into the story and left me feeling inspired. I wasn't excited to see a blonde sandy bullock in a sports movie, I think that's what might have turned me off the most, but she did really good job! It's rare to see a movie where there's a really strong lead female character. Whether you like Leigh Anne Touhy or not in the end, she is certainly entertaining and Sandra Bullock does a great job of bringing her onto the screen. The youngest son did an amazing job! So much talent in him. The character of Mike I think could have used a few more lines, even if he's supposed to be shy and reserved. All the actors really did a great job though for the most part. No it's not an epic Oscar winning film, although I wouldn't be surprised if Bullock got nominated for something for her acting. It is NOT loaded with propaganda as the other reviews might suggest. It's a light entertaining pick me up film that would be an excellent choice to bring the family to, most likely the reason why they released it over the Holidays.","user":"momomomomo","rank":[168,227]}]