[{"title":"Surprisingly convincing","rating":7,"date":"12 March 2010","review":"\"She's out of My League\" is a solid 7, a romantic comedy that scores a few good laughs and does a nice job of being convincing. Jay Baruchel (Tropic Thunder) stars as Kirk, a pathetic dork with the build of Woody Allen who works a menial job in airport security. Through a cell-phone mishap, he winds up at a party being thrown by Molly (Alice Eve), a 10 on the very attractive scale. He knows she's way more attractive than him and she knows he's normally not the guy she would usually date but Molly looks deep down and sees Kirk for the nice, unthreatening guy he is and they hit it off. There are some funny moments here. Kirk's family is especially demeaning to him (they even embrace his bitchy ex-girlfriend as one of their own) and his friends are clueless match-makers, which leads to a very funny man-scaping scene between Kirk and one of them. What works best in \"League\" is just listening to people talk though. Kirk's friends (played by Mike Vogel, Nate Torrance, and T.J Miller) are identifiable idiots, too wrapped up in over-thinking things like the rating scale (both their number and womens) and Disney fairy-tales to really understand women. Their scenes with Kirk are enjoyably like a crude, vulgar, sexual \"Breakfast Club\". The way the scrawny, nervous, and unconfident Baruchel interacts with the beautiful and engaging Eve is also very likable and they do a nice job of handling the ups and downs of forming an honest, meaningful relationship (an almost foreign concept in today's star-packaged romantic comedies). The way they finally handle the elephant in the room is also very effective. This is feel-good stuff, but it works.","user":"C-Younkin","rank":[79,95]},{"title":"A surprising winner.","rating":7,"date":"31 March 2010","review":"Expectations weren't exactly through the roof for SOOML. No big name actors, a director with no feature film experience and a screenplay by the same guys who brought us Sex Drive. It is with great delight then, that what we get is 100 minutes of laughter and light-hearted entertainment. Is it clichéd? Sure is. We've seen the 'underdog gets the girl' story repetitively since the dawn of cinema, but at least scripters John Morris and Sean Anders inject it with humorous variations to ensure we forgive their shortcomings in originality.<br><br>Jay Baruchel was another unknown quantity. His supporting turns in Knocked Up, Fanboys, Tropic Thunder and Million Dollar Baby (remember the weakling who frequented the boxing hall despite his complete lack of talent – that was Baruchel) have provided laughs galore, but being the main star is different altogether. His geeky exterior and small frame isn't exactly leading man material however Baruchel's great comic timing and willingness to make a fool of himself if required makes him a likable headliner.<br><br>On the opposite end of the gender pole is the drop-dead gorgeous Alice Eve who, like Molly, is a hard ten. It's not just her looks that makes her popular with the men though, she's genuinely cool and doesn't have a whiff of ego. Elsewhere in the cast you'll find the previously unknown T.J. Miller as Kirk's best mate Stainer – a character who resembles Napoleon Dynamite if he were on crack cocaine – who delivers a handful of memorable one-liners and plenty of laugh-out-loud moments.<br><br>A charismatic cast and some hilarious jokes makes this a surprising winner.<br><br>3.5 out of 5 (1 - Rubbish, 2 - Ordinary, 3 - Good, 4 - Excellent, 5 - Classic)","user":"Troy_Campbell","rank":[59,71]},{"title":"Nice Little Surprise","rating":8,"date":"23 May 2010","review":"In all honesty, I have no idea why I went to see this movie. It clearly falls in one of the most clichéd of all film genres and stars only one person I have ever heard of. But I went to see it anyway and I was glad I did.<br><br>I think I liked it mostly because of the leads. I liked the guy because he never tried to impress the girl, he was just himself, even when it was painful and difficult to do so, and I liked the girl because once you got past her looks, you found an interesting person underneath.<br><br>The other big reason I liked it was because it managed to take one of the oldest romantic clichés ever--racing to the airport to declare your love before that Perfect Someone leaves--and put a nice twist on it. Kudos to the writers on that one, that alone was worth several points on this scale.<br><br>This is actually one of the better movies I've seen this year, I highly recommend it.","user":"dukevega","rank":[24,29]}]