[{"title":"Great Family Film","rating":10,"date":"19 May 2010","review":"I don't know what the rest of these reviewers were watching but I took my 11-year-old to see this at the theater; and she used her hard-earned money to buy it on DVD as soon as it became available.<br><br>It's a feel-good story of a jaded and cynical man who realizes that it's okay to dream; it's okay to believe in things you can't see and hope for a better tomorrow. Why on earth is this a bad thing? Sure, parts of the movie rate an 11 out of 10 on the cheese-o-meter but, once again, why is this a bad thing? <br><br>No, I don't think that this is a good date movie, or something that a bunch of adults would find entertaining, but when watching it with a group of kids, or just one 11-year-old little girl, it's a winner.","user":"anastasia4470","rank":[50,67]},{"title":"Toothless aggression?","rating":6,"date":"8 October 2010","review":"Dwayne Johnson proves once again, that he is more than just muscles. And his eyebrow of course. He can jump from action into a kids movie just like that. Something a few stars in the 80s had big problems with (at least commercially speaking).<br><br>And this movie delivers. It never set out to be, the best movie in the world. It is there to entertain. And entertain it does. The viewing experience get enhanced if you watch it with teenagers or kids. They will just love the movie. And so will you, if you watch it with them.<br><br>Of course it is very predicable and it has a few other flaws too. But the charisma of Dwayne, the wit of Merchant and the overall good design of the movie, might make you forget about that. Just relax, sit back and enjoy.","user":"kosmasp","rank":[9,10]},{"title":"A winning movie for kids 12 and under; a \"not bad\" for adults","rating":6,"date":"7 February 2010","review":"So what are you going to take the kids to see? Legion? This movie was a delight for kids - we were in a packed theater in San Francisco (well, actually Daly City), and the room was half-full of very young kids. Their spontaneous laughter at the slightest nonsense throughout the film was, in its own way, musical. And these reactions, without any \"potty humor.\" I had never seen Rock in a movie, and barely knew who he was. But I do know Julie Andrews and Billy Crystal, and those two are enough to establish the picture's bona fides as cinema. The movie has enough site gags and silly talk to keep the kids involved, and enough in it to let the accompanying adults enjoy the moment too. It was cartoonish in execution and this without the typical special effects hammers usually found in fantasy movies. I enjoyed the hockey scenes, loved that every bad act had a satisfying response.<br><br>I do have to laugh at some of the critics who apparently expect Ingmar Bergman touches in all movies, and frown on any non-political movie that doesn't need subtitles (at least to English-speakers). Note to the humorless: this is not high art and was not intended to be. It was a fun and funny send-up of what happens if you let cynicism govern your life and the rewards of reform.<br><br>Go! Take the kids!","user":"GoUSN","rank":[27,36]}]