[{"title":"Antichrist","rating":10,"date":"22 May 2009","review":"This movie drained me...<br><br>Without a doubt the most unpleasant and despairing movie I've ever watched. It's not just the graphic imagery that got to me, but the overall tone of the movie was incredibly dreadful and you could almost feel a presence of some sort of \"evil\".<br><br>This is a hard movie to review. It crosses all barriers when it comes to movie making...ALL. It makes you question yourself about what art is and if there's anything as going \"too far\"?<br><br>But don't dismiss this. It's certainly much more than just being graphic for the sake of it. First off, the cinematography is absolutely flawless. The opening scene had me in absolute awe. Beautiful... And my deepest respect to Willem Dafoe and Charlotte Gainsburg. I could only imagine how much this would drain the actors both mentally and physically. They are amazing and deserve Oscars.<br><br>I have to mention the violence too, since it's a critical aspect. This isn't \"torture porn\" of any kind. It's natural (it's looks almost too realistic), physical sexual violence. That's why it works so effective on the audience. You can almost feel their pain. Never before have I watched a movie where I felt the urge to look away. You would think that, in the end, all this violence and self molestation is just a shock tactic, but I assure you it's not. There is actually a plot and a sensible progression of the movie. I of course won't say too much. People need to see it.<br><br>I can understand why some people wouldn't like it, and that's okay. This is most definitely not for everyone.<br><br>It may not be a movie that made me feel good, but it made feel something and had an effect on me. It's beautiful, sad, poetic, horrific and in the end, oddly uplifting. A genre masterpiece.<br><br>A must see.<br><br>10/10.","user":"theisbj","rank":[757,1]},{"title":"Chaos Reigns","rating":5,"date":"5 October 2009","review":"Lars Von Trier directs \"AntiChrist\", a film comprised of six clear segments.<br><br>Prologue: Whilst a husband and wife have sex at home, their toddler climbs out a window and falls to his death. In the film, the husband is a therapist and is known simply as He. Similarly, the wife is a researcher into the history of witchcraft and is known simply as She. Note: He is played by Willem Dafoe, who famously portrayed Jesus Christ in Martin Scorsese's \"The Last Temptation of Christ\".<br><br>Chapter one (Grief): She collapses at her child's funeral and is hospitalised. He takes over her treatment, believing that He can cure her with the miracles of Science. His theory is that she must \"re-live her deepest fears\". She says she associates fear with Eden, a cabin in the woods where she spent the previous summer trying to finish her dissertation on \"Gynocide\" (the killing of women). The duo travel to Eden (the Biblical cradle of mankind) and hike through the woods. He sees a deer whose stillborn fawn is still partly contained in its womb. At this stage, Mother and Child, Nature and Woman, aren't yet at war.<br><br>Chapter two (Pain): He directs her in therapeutic exercises. \"I understand that everything beautiful is perhaps hideous,\" she says. \"All things cry, all things die.\" Out walking, He sees a wounded fox which speaks: \"chaos reigns.\" <br><br>Chapter three (Despair): He discovers that She was deliberately injuring their child. Why? He confronts her. She knocks her husband unconscious, batters his genitals, masturbates him, and bolts a lathe wheel onto his leg. He manages to crawl into a foxhole where he finds an injured bird. It is unable to fly, he is unable to walk, both creatures bound to the land. Hands reach out from the Earth, man and nature re-embrace.<br><br>Chapter four (The Three Beggars): It is revealed that she was watching their son as he climbed up to the window. She let the kid die. She mutilates her own genitals with scissors. Her scream alerts the deer, fox, and bird, which come to the cabin. Seeing Him about to extract the wheel, she stabs him. He fights back, strangles her, and burns her corpse on a pyre. A modern man of science becomes a medieval witch hunter.<br><br>Epilogue: He limps away from Eden. Human bodies litter the landscape. He watches a host of women, their faces smudged, climb up a wooded hillside. Film ends.<br><br>Confused? Bergman on cocaine, \"AntiChrist\" is essentially the result of director Lars Von Trier's very public rejection of religion (which followed a prolonged bout of depression). An act of embracing a certain existential hopelessness, the film also sees Von Trier penalising himself for all the \"wrongs\" of Catholicism. In this regard, the film calls itself anti-Christ because it is broadly against Christ, Willem Dafoe becoming a collapsed version of pseudo-science and Christianity who is symbolically castrated and turned over to a hostile world in which Nature, wild and vicious, becomes the atheist's new Godhead. Von Trier then fetishizes his newfound pessimism (the ugly cruelty of nature, vagina, birth, death etc), the Godhead - more Satan than Saviour - symbolically sodomising the holy child back out of Mary whilst faceless women are resurrected from the very bowels of the Earth. <br><br>Everything is now wrong and we are already in hell. Nature has revealed itself as the relentlessly cruel, profoundly disgusting and indifferent monster it always was. Human nature is even worse, and women are as disturbed and disturbing as anything because they are nature embodied, able to create, bound to the cosmic cycles of menstruation, pregnancy and birth. Discovering this leads the wife to self hatred, self-mutilation and infanticide. Destroy the penis and the vagina and end the spread of Satan's church. Like Godard's masterpiece, \"Hail Mary\", Von Trier's women perceive themselves as being controlled, raped and duped by a Nature which does nothing but inscribe its will upon all bodies. She tries to fight back, to kill her child, but it's futile. You do not belong to \"yourself\". Everything about you is contingent upon the Beast.<br><br>The film is graphic, but more so for the paradoxes it raises. Men find it hard to reconcile the comforting warmth of the vagina with the monstrosity it becomes at birth. Menstration is itself now ambiguous, the regular heavy flow of blood stymied by a world of plastic bags, sanitized hospitals, air fresheners and pre-cooked meat. Female nature is likewise experienced in a bizarre, almost entirely individualised way. Biology, sex, defecation, in their raw and visceral states, have receded back into the realm of the private and the professionally managed. Eyes are shut. Doors are closed.<br><br>When the couple are later kept awake by acorns falling on the roof of the cabin, She tells Him that it takes a hundred years for an oak to reproduce itself just once. The tragedy of the only child dying is the fear of the modern age. Less than a century ago, over-investment in any given child would potentially be a massive waste of time - far better to churn them out and hope that some survive. Nature: brutally pragmatic.<br><br>\"Antichrist\" is not, however, straightforwardly an anti-Christian film. It is a heretical film in the Gnostic non-tradition. There is no hope, no salvation, no righting of order, a fact which brought about a profound state Antonioni-like depression in Lars Von Trier. But Despair, Grief and Pain (the 3 encountered animals), as Dafoe's character points out, don't even exist. There is no separating the natural from the unnatural, right from wrong, life from death.<br><br>7.5/10 – \"Blair Witch Project\" with a sprinkling of Herzog, Antonioni, Bergman and Dreyer, \"Antichrist\" fails to both produce a new mythology of despair or even horror. Of course its scenes of mutilation and have a visceral power, but this is cheaply achieved. Worth two viewings.","user":"tieman64","rank":[160,213]},{"title":"A gruelling tale of mythical grandeur","rating":8,"date":"22 December 2009","review":"An eerie yet gorgeous tapestry of lingering close-ups; parallels, cuts and slow-motion photography, Lars Von Trier's Antichrist is a gruelling tale of mythical grandeur: a bizarre yet beautiful film chock full of sadism and shagging, Satanic dogma and similes. Most of which, I don't understand. So you'll be pleased to know that I have no intention of harping on about the director's bent meditation on gender, nature, genocide, motherhood, misogyny and astronomy. I find all that stuff interesting, don't get me wrong, but when things get Freudian I'm way out of my league. Therefore, I'll stick to what I know.<br><br>Albeit seething with emotion, Antichrist refuses to adhere to some of the general \"rules\" of the classical Hollywood narrative, meaning it lacks clarity, unity and closure. For example, there're only two characters, both of which remain nameless and have indefinite; pasts, motives and are somewhat difficult to identify with. The film rejects conventional morality. It is a difficult and uncomfortable experience that'll unnerve even the most robust of film fans. So if you like your films light, clear and conservative, stay away. If, however, you're a fan of, say, Nicholas Roeg's Don't Look Now, director David Lynch or you just dig a bit of alternative cinema, then brace yourself for a hugely demanding tableau that film critic Anita Singh of the Sunday Telegraph dubbed \"the most shocking film in the history of the Cannes Film Festival.\" Willem Dafoe plays \"he\", a therapist and husband to \"she\" (Charlotte Gainsbourg), the female half of the cast whose line of work we never really learn. After a quite miraculous opening montage that juxtaposes the couple making love with the accidental death of their child, the embedded tale follows the pair as they flee to \"Eden\", their isolated cabin in the woods, where \"he\" attempts to aid a severely grief stricken \"she\" through her bereavement.<br><br>Book-ended by a masterfully conceived prologue and epilogue and split into four focal chapters entitled \"Grief\", \"Pain\", \"Despair\" and \"The Three Beggars\" (don't ask), the film takes on a ghostlike tone from the outset as the boundaries between the real and surreal become blurred. Alas, things get weird, edgy and very, very nasty. The sheer mass and rate of dense motifs and metaphors at hand regarding sex, Freud, the devil and the soul is a little overwhelming. Not to mention the force and intensity of both Dafoe and Gainsbourg's turns in addition to the film's strong, emotional undercurrent.<br><br>In spite of large and sustained periods of quite brilliant film-making, Antichrist contains some of the most violent and deplorable images ever committed to celluloid. For the ladies there's self mutilation. For the gents there'sI, I, I can't even say it. Put it this way, it ain't good ladsAnyway, add to the unthinkable gore a whole host of outlandish set-ups, half a dozen scenes of a sexual nature and one or two jolts in tone and you'll be scared silly. Remember- sometimes in cinema, you fear what you don't understand, especially when the camera is an unflinching eye inside the head of a disturbed, Danish poet. Lars Von Trier is an excellent filmmaker, but even his biggest fans will find it hard to swallow this, never mind stomach it.<br><br>Dedicated to the memory of legendary soviet filmmaker Andrei Tarkovsky, Antichrist is truly as haunting, delicate and poetic a film as you're ever bound to see. Though shrouded in scenes of unspeakable cruelty, the film eludes to the work of Tarkovsky in a big way: Von Trier's warped Adam and Eve parable is a moody, metaphysical affair cloaked in hypnotic, dreamlike imagery that calls to mind the likes of Mirror, Solaris and the brilliant Stalker. The trancelike photography; sound, score, and editing demonstrate a predilection for atmospheric, art-theatre sensibility. Tarkovsky would have loved it. This, after all, is a film that simply has to be seen to be believed. Not necessarily for its aesthetic grandeur, gore or technique, but for its harrowing portrayal of a soul in torment.<br><br>What's it all about? Who cares?! Antichrist is an unusual, atmospheric horror film that's guaranteed to provoke. The performances are honest and strong, the aesthetics are bold, the direction is brilliant and the outcome is something that is ultimately hard to come by these days: authentic film-making.<br><br>Jack Harding","user":"jackharding89-1","rank":[177,250]}]