[{"title":"Chris Columbus should be ashamed!!!!","rating":1,"date":"12 February 2010","review":"When this movie first arrived in trailers, I like so many adults, who have become fans through our children was excited. We could overlook Pierce Brosnan playing Chiron which gets both the age and nature of the character wrong. We could overlook the character of Percy obviously being older than the books stated age of twelve, however almost everything else was so far removed from the books that have become so popular including storyline, that this movie should not even be allowed to carry the \"based on the books\" tag. The characters were completely miscast, the storyline was a weak abominational blend of books one and two..... kind of..!<br><br>He (Chris Columbus) invented places for the movie to go that have nothing to do with the story in its origination, he omitted too many details that are so pertinent to the actual storyline that it may be impossible for any new director (and I believe if future films are to take place a new Director IS NECESSARY) to repair the damage that has been done.<br><br>For a story that has millions of fans who will be buying tickets to movies for a very long time, this does heavy damage to Chris Columbus's reputation as evidenced by post movie chatter in which most if not all was incredibly negative. Negative both to the movie as a whole and to Chris Columbus personally. Many there seem to believe he did the same to the Potter movies he has been involved with and feel at this point anyway that they will think twice before seeing another movie with his name attached to it. Lets' face it, as one young fan said, \"not sticking completely to a Potter book...understandable, they are 1,000 pages each...Not coming close on a book 350 pages long...not forgivable.\" <br><br>So, if you are going to see this movie because of the wonderful scenes in St. Louis, Denver, The Santa Monica pier, or to see his step father get his, etc etc etc etc save your money, they are not in there. Neither is Clarissa, Lukes scar, Mr. D, Aries, Kronos, and so on. If you would like to see a movie that completely rewrites the creation of Rick Riordan, then by all means, spend your money on a mildly entertaining theft of a wonderful idea.","user":"buckeysooz","rank":[224,293]},{"title":"Did they even read the book? Worst Movie of the YEAR! If not Ever!","rating":1,"date":"14 February 2010","review":"The first question I must ask myself is if Chris Columbus can even read... Because obviously he never read the books. Well maybe he read the back cover summary, its the only reference to the book in the movie. <br><br>As for the book, Rick Riordan should be ashamed for letting anyone slaughter, I take that back, Massacre, his artwork in such a way. Not only were critical details left out of this story but the entire story was altered in such a way that a remake and an refund should be in place for all readers. <br><br>The story line itself may have needed a little touching up for the big- screen but leaving out Kronos, Mr. D, Clarisse, The Oracle, blaming Hades, and everything else (I can go on for 375 pages) is unforgivable. If the plan was to make one lone movie and never touch Percy Jackson again, they were successful. I will never again be able to attend a Chris Columbus movie. Not even a free one.<br><br>In their defense, if you had never read the books the cast did a good job on a kids movie. The amount of money spent to screw up a story this awesome is mind boggling. Please do not support the future career of the screen writer and director by spending your money. They should both be banished to Tartarus for such a crime!<br><br>Long story short It is difficult to even write a review as it makes my blood pressure skyrocket to unhealthy levels.<br><br>Signed,<br><br>Devoted, Story loving readers of Rick Riordan","user":"emiele4","rank":[141,186]},{"title":"Oh Zeus, Poisidon, Hades, Hermes... Help us all...","rating":4,"date":"19 February 2010","review":"Christ... <br><br>The film scriptor, editor, director, and near to, if not all, other staff and actors and actresses need a good firing...<br><br>To be honest, I did not think that the film was going to be the best... Especially because I had read the books and Absolutely loved them, but this! This is tragedy in film form... As I was walking into the cinema, I had someone comment that the main character seemed very pretentious and that it was unlikely he was chosen for his acting talent, which turned out to be exceptionally true. Logan Lerman just did not cut the Percy Jackson role and left out a huge proportion of awe and \"OH MY GOD! I'M THE SON OF POISIDON!\" and instead cut straight to the bad puns and obvious brand advertising! Great... A new generation of idiots thinking that the iPhone will defeat Medusa/Urma Thurman. <br><br>The film effects were mediocre, action-style we've-seen-it-all-before. The acting from almost everyone with, maybe, the exception of Urma Thurman who was the only actress with any kind of strength to her acting, either exceptionally weak or the actor/actress were wrongly cast, such as Pierce Brosnan. Lots of plot and characters were either completely changed, or just simply missing... I miss Dionysus T^T. What happened to Percy not finding out his powers as soon as he arrives? Nearly the whole of the Camp Half-Blood scenes were useless or wrong. Where were the days and months spent there? I understand that they wanted to make the film shorter, but they are just cutting plot and it's WRONG! What about Luke? He had some REAL background and was a much more interesting character, although, Jake Abel plays his part reasonably well considering he doesn't really have ANY reason to hate the gods... Okay, he doesn't really like them and wants to overthrow them... WHY? It's explained in the book and just left alone in the film and how is he playing COD on PS3? It doesn't happen! Surely they could have just given him a 360 controller? Nope... Guess what... It's MORE brand advertising! Yay...<br><br>I apologise for just slagging this film off, but not only did they manage to create a film tragedy that is nearly on par with the pile of *$%!£ that is named Eragon, but they managed to ruin ANOTHER great book...<br><br>Still... <br><br>Good points! Let's be positive... Humm... This may take a minute... Well, it was good as a stand-alone film, if it had nothing to with the book and was called something completely different. I'm sure there are a few more positive things about that film, but I don't remember because I was too busy trying to ignore the awful parts.<br><br>I'm sorry if I have upset and depressed you all with this review, maybe you should put down all Percy Jackson merch. and film and go see something less... Bad...","user":"teddies_are_cute","rank":[32,39]}]