[{"title":"The Coens' funniest film since \"The Big Lebowski\"","rating":12,"date":"12 September 2008","review":"I'm not the only one to notice the pattern in the Coens' filmography: \"Blood Simple.\" was followed by \"Raising Arizona\", \"Fargo\" by \"The Big Lebowski\", and \"No Country for Old Men\" by \"Burn After Reading\". The main concern one had about this film is whether it would be an \"Intolerable Cruelty\" or a \"Big Lebowski\" for the Coens. Let's put it this way: the reviews have been mixed, especially from major mainstream media critics. Guess what other Coen comedy received mixed reviews and was accused of being a somewhat tired mess? Yep, \"The Big Lebowski\".<br><br>The Coens' sense of humor is very distinctive, and I'm not talking about stuff like \"Intolerable Cruelty\" (this one the mainstream media liked, go figure) and \"The Ladykillers\", which featured numerous commercial concessions. I'm talking about the vicious, cruel, misanthropic farce that gets self-important critics' knickers in a twist. Describing \"Burn After Reading\" as a screwball spy farce makes it sound much more \"Austin Powers\" than it is. There is a lot of silliness, but the sort of silliness one finds in a Howard Hawks comedy, not in most comedies that have been made recently. It's a screwball comedy but a pretty dark one.<br><br>This is most certainly an acquired taste. It is not going to go down well with people who can't laugh at murder, things going terribly wrong for innocent people, or the Cones' trademark dialogue that pops up even in 'serious' movies like \"Fargo\" and \"No Country for Old Men\". However, \"Burn After Reading\" was seemingly tailor-made for my cruel sense of humor, as I found it to be easily the most inspired comedy script in a long time. It's a conspiracy espionage thriller with no stakes, nothing to fight over, a bunch of complete fools and idiots caught in the middle of it (\"a league of morons\" if you listen to John Malkovich's character), and disastrous consequences for just about everyone. Take out the jokes and you could have a tragedy but as it stands this is the funniest movie the Coens have made since \"The Big Lebowski\", if not the best, and that includes \"O Brother, Where Art Thou?\". <br><br>One really shouldn't know anything about the plot or how it unfolds prior to seeing it, as this is a film which is far more intricately-plotted than most critics are giving it credit for. The basic concept is that Frances McDormand and Brad Pitt's characters come across a disc they think contains top secret intelligence. What follows is, as described above, a thriller with no stakes and a bunch of idiots. It's one of those movies where you really shouldn't be laughing (for ethical reasons) but are, and it will have you laughing through your disapproval for basically the entirety of the film after the opening fifteen minutes or so, which are rough in comparison to the rest of the film, and to be honest the only thing that keeps this film from being absolutely brilliant and the Coens' best movie since \"Lebowski\". Just don't go in expecting a movie that looks as beautiful as many of their movies do- Lubezki is no Deakins, at least not based on his work here, and the Coens are very clearly attempting to emulate in many ways the look of the sort of thriller they're basing this on. It's functional, well-shot, and well-directed, but the writing and acting are the main attractions here.<br><br>Of course, \"Burn After Reading\" will be dismissed as having little worth and for being a disposable farce by many. Well, if only they knew how hard it is to do comedy well. I'd reckon this was harder to write than the (admittedly tremendous) \"No Country for Old Men\", which was adapted from a novel that might as well have been a screenplay if formatted correctly. The movie may not start brilliantly (not that it isn't good even early on), but once the Coens start firing on all cylinders they never stop, and the dream cast certainly doesn't either (Brad Pitt has a smaller role than most cast members here, but he is absolutely brilliant in the role), showing tremendous comic skill that few would have guessed most of them had. The final scene may very well be one of the best I have seen in a long, long time. <br><br>\"What a clusterf-ck!\", indeed.<br><br>9/10","user":"ametaphysicalshark","rank":[441,668]},{"title":"A Bright American Farce","rating":8,"date":"13 September 2008","review":"Nobody is quite there in this new bright farce by the Coen brothers. The plot is a smart excuse for a movie about nothing but appearing to be about a lot of things. Going backwards and forwards at the same time. Talk about \"The Russians?\" or planning to write a memoir. Brad Pitt is priceless and the innocence of his character is so believable that I wondered how many more surprises this actor has up his sleeve. He is a joy. George Clooney is also terrific and the Coens move through their crossed purposes with speed and elegance. I was totally immerse in their universe even if I didn't quite care what was going on. John Malkovich, Frances McDormand, Richard Jenkins and the unnerving Tilda Swinton complete the package of this movie that feels as if it was made for the sheer pleasure of it.","user":"katiemeyer1979","rank":[305,467]},{"title":"Very funny adult comedy","rating":9,"date":"14 September 2008","review":"The point here is that this movie is for adults, with adult themes and adult situations. As with all Coen brother movies, there are going to be people who love it and people that hate it. There doesn't seem to be much middle ground. I loved this movie. It was entertaining, dark and very funny. I really liked \"No Country for Old Men\" but I have to say, \"Burn After Reading\" was a more enjoyable film for me. Some of the reviews here have said that the film rambles around pointlessly, without any clear direction; well I have to disagree, if you are paying attention and you are an adult, you should have no problem understanding what is going on. The best part of the movie is watching this great cast perform brilliantly with the odd-ball material they are given. They are all straight men for the Coen brother's antics. There is violence, bad language, and everyone is sleeping with everyone else, especially George Clooney. But the movie is very funny and while the rest of Hollywood seems to have lost there way, the Coen brothers continue to put out intelligent, entertaining and thought provoking material.","user":"tomrito","rank":[283,466]}]