[{"title":"Lake Mungo succeeds at being not only a chilling ghost story, but a film about grief","rating":9,"date":"3 February 2010","review":"With all this hype about the good, yet overrated Paranormal Activity, Joel Anderson's debut film Lake Mungo lies forgotten. This is a total shame, seeing as this is much better, and way creepier. Lake Mungo really is a very simple film, it follows the Palmer family as they deal with the loss of Alice (their daughter/sister). It is filmed in a documentary style, in which the family/friends/work associates are interviewed by an unseen person, with pictures and video footage shown as well. Eventually we discover Alice had many secrets, and the family try to find out about them and if they had anything to do with her passing.<br><br>The plot does not sound enticing, in fact, it sounds rather plain, however, this is not case fortunately. The documentary style really suits the film, and the actors are incredible and almost seem like they are not acting at all. The scares spaced throughout are genuinely freaky, and really got under my skin. Anderson makes sure the atmosphere is kept dense throughout the whole film, making every minute feel ominous. However, Lake Mungo does not just focus on the horror, but also how the family deals with the grief, and what they are willing to believe and do to help each other and themselves. The scenes in between the supernatural images and occurrences focus on how each family member (and some friends) deal with all that happens, and it is done in a refreshingly realistic (not over-blown, sentimental, or dramatic) way. There are a few twists along the way, and the final scene is very well-done, and will stay with you for a long time. Do yourself a favour, go see this movie, support movies which are actually good and don't rely on cheap scares. Recently my awesome homeland have been releasing some damn good horror movies (see Wolf Creek, Rogue, Black Water, Dying Breed, Lucky Country) and Lake Mungo is one of the best.<br><br>4½/5","user":"LoneWolfAndCub","rank":[107,129]},{"title":"excellent movie","rating":27,"date":"27 August 2010","review":"As a fan of psychological horror films, I'm so glad to have stumbled across this little gem in my local rental store. The movie pulls you in, to the point where I did a google search to double check that it wasn't a real documentary. It helps a great deal that there are no big name actors, or over-the-top special effects. Alice's family and friends really come across as people who are not only struggling to get past their loss, but aren't sure how, or even if it's okay to. The flat affect of her parents, particularly,reminded me of real people I've encountered while working in a hospital, who are, in a lot of ways, still in shock long after the loss itself. If you like your horror exclusively blood and gore, or need big Hollywood special effects to enjoy a movie, you will undoubtedly be disappointed, but for anyone who appreciates films that slowly get under your skin, and stay with you long after the end credits, Lake Mungo is a must-see.","user":"barbara-oiler","rank":[53,64]},{"title":"The best of the trendy Horror \"Mockumentaries\"","rating":9,"date":"21 December 2009","review":"After \"Blair Witch Project\" the scary \"mocumentary\" business went through the roof. Ten years later, the trend is still going strong, with at least a couple dozen films with the same concept of hand-held terror. \"Lake Mungo\" is by far the best since \"Blair Witch\". It accomplishes much more than this year's other big effort, \"Paranormal Activity\", which, I found rather tame at best. Played almost as a television news special, \"Lake Mungo\" is the most believable entry thus far. The downplayed, monotone performances of the actors is very effective. The naturalism they maintain only adds more edge and anxiety to the story. And speaking of story, unlike most of the other first person horror movies, \"Lake Mungo\" actually has a good one. It's an honest mystery, full of secrets and lies, wrapped around a paranormal thriller. It has enough twists, turns and enough surprises/scares to keep anyone's attention. Rarely have I experienced so many chills in one sitting. Don't wait for the Hollywood re-make already in the works, there's no need, the Australians got it right the first time (unlike you, Hollywood.) Don't miss one of the best horror films of 2009.","user":"s_twcramer","rank":[102,140]}]