[{"title":"I wish I hadn't read the book","rating":5,"date":"26 July 2009","review":"I am sorry for all the readers, but I don't know where to begin.<br><br>Let me say at first that I'm not a big Dan Brown fan, but I read Angels &amp; Demons with great pleasure. The book deals a lot with the eternal question of Science vs. Religion and that made me think a lot about that subject again. That big battle is totally lost in the movie.<br><br>A lot of the important lines in the book (CERN, Maximilian Kohler, the scepsis of the Swiss Guard, the love relationship between Robert and Vittoria, the Hassassin, the relationship between the Camerlengo and the pope) are lost in the movie screenplay. This makes the movie a very cut-down and over-simplified version.<br><br>Would the movie be any good if I hadn't read the book? I still doubt it. From scene 3 on, the movie is a 'chase-movie' without interruption. There is no time for contemplation or depth. No story-line, no backgrounds. It's just a chase movie in a GREAT decorum.<br><br>You would think that with a running time of about 140 minutes a movie is able to bring more. Much more.","user":"Nevele","rank":[167,230]},{"title":"A Nutshell Review: Angels & Demons","rating":7,"date":"9 May 2009","review":"Tom Hanks returns as Dan Brown's symbologist Robert Langdon in his first adventure Angels &amp; Demons, which Hollywood decided to make after The Da Vinci Code, given the latter's more controversial subject striking a raw nerve on the faith itself. The Catholic Church was up in arms over the first film, but seemingly nonchalant about this one. And it's not hard to see why, considering Ron Howard had opted to do a flat-out action piece that serves as a great tourism video of Rome and Vatican City, and would probably boost visitor numbers given the many beautiful on-location scenes, save for St Peter's Square and Basilica which was a scaled model used.<br><br>So I guess with the bulk of the budget going toward the sets, the ensemble cast had to be correspondingly scaled down. Ayelet Zurer tried to step into the female void left by Audrey Tautou, but given Tautou's character then having a lot more stake in the film, Zurer's scientist Vittoria had a lot less to do other than just waiting in the wings to change some batteries on a canister filled with anti-matter. In the book she's the fodder of course for Langdon to converse his vast knowledge of the Vatican, the Illuminati and the great feud between the two, but here she's neither love interest, nor his intellectual equal.<br><br>Ewan McGregor on the other hand, chews up each scene he's in as Camerlengo Patrick McKenna, who is temporarily taking care of the Papal office while the other prominent cardinals are in the Sistine Chapel to elect a new Pope. And he plays Patrick with that glint in the eye, with nuances enough to let you know there's more than meets the eye. There's no surprises here for readers of the novel, but McGregor's performance here is one of the highlights of the film as Hanks plays well, Tom Hanks.<br><br>The book itself is rich with arguably accurate content as always, and had a lot more plot points on science versus religion, and a wealth of information that Dan Brown researched and linked together in an engaging fictional piece of work. While reading the book some years ago, I thought that should a film be made of it, it's easy to lapse and dwell more on the set action pieces. Sadly, that's what this Ron Howard film did, with a pace that doesn't allow a temporary breather. Unlike the first film where you had the characters sit down for some \"discussion time\" over a cup of tea, this one moved things along so quickly, it's like reading the book all over again, page after page being skipped just to get to the thick of the action.<br><br>Catholic reviewers have called Angels &amp; Demons harmless, because I guess it didn't dwell on its many controversies, unlike The Da Vinci Code which struck a raw nerve at the centre of the faith. And if anything, this film served as a great tourism promotional video with a nice showcase of the many prominent touristy landmarks that would entice many around the world to go pay a visit. Naturally certain areas like the catacombs beneath St Peter's Basilica, and the Vatican archives remain out of bounds, but the walk along the Path of Illumination, now that's almost free.<br><br>Nothing new for those who have read the book other than to see it come alive, but for those who haven't, this film may just compel you to pick up Dan Brown's novel just to read a bit more about the significance about the landmarks, and characters such as Galileo, Michelangelo and Bernini who are intricately linked to the plot, but much left unsaid. Satisfying pop-corn entertainment leaving you with nothing spectacular.","user":"DICK STEEL","rank":[253,374]},{"title":"Pull the other one","rating":5,"date":"21 May 2009","review":"I usually try not to spoiler: in this case I shall do so wholeheartedly. Don't read on if it bothers you.<br><br>First I must comment on The Da Vinci Code phenomenon. Angels And Demons,(the movie) is a vague sequel (albeit the book precedes the Da Vinci book). While Da Vinci was hardly deathless prose, it told an interesting, unusual story at breakneck pace in an easy-to-follow manner. It was pacey and entertaining. It sold shedloads, and deservedly so. The movie adaptation was faithful, but lost the novel's immediacy: it still had broad appeal and did well at the box office, hence this sequel.<br><br>So to Angels And Demons (where I haven't read the book). In the run up to the Cardinals' voting in Conclave for a new Pope, four of them are kidnapped. Despite reservations about Robert Langdon (Tom Hanks, hardly pro-Catholicism in Da Vinci) the Vatican consults him. He figures out that this is the work of the Illuminati, a secret group dating back to the Renaissance, who seek revenge for the Vatican wiping out many of them in the 16th century for their pro-science, anti-Catholic views. Together with a lady scientist whose research generated an antimatter bomb stolen by the Illuminati, intended to wipe the Vatican off the map, Langdon engages in a clue-laden race against time, looking for the missing cardinals and the bomb. He is helped by Ewan MacGregor's Camerlengo Patrick McKenna (Camerlengo is acting Pope until the Conclave comes up with a new one - a functional rather than authoritarian position) and hindered by Stellan Skarsgard's head of Vatican police. Armin Mueller-Stahl is a Cardinal who may have his own agenda. There is further jeopardy from the fact that the Illuminati have probably infiltrated the Vatican at the highest level.<br><br>So far, so not-very-spoilery. Much action, racing around, convoluted clues etc., key factors which made Da Vinci so successful, albeit with a noticeably less credible plot. We even have have a couple of likely suspects - Starsgard's unhelpful police chief and Mueller-Stahl's cagey Cardinal.<br><br>Now for the rest of the plot. Three Cardinals are killed, but the fourth is saved. The bomb is recovered. However, there is insufficient time for it to be defused. McKenna takes it up in a news helicopter, and bails out. The bomb detonates, the shock wave causes relatively little damage, but McKenna's gesture in saving the Vatican and thousands of lives means he is certain to be voted in as Pope by popular acclaim. Of course, he turns out to be the villain, having murdered the old Pope and arranged the whole thing. Thank you, Robert Langdon, the end.<br><br>This pleased me in one respect - while the film still had you believing that the Illuminati existed, I wondered why they would leave a series of clues pointing to where the bomb was? Of course, as it was all McKenna's masterplan, he wanted the bomb found.<br><br>But then I started thinking about this masterplan. Let me list the parts of it (McKenna never does the standard explanatory monologue, you're left to figure it out yourself): <br><br>1. Steal antimatter; <br><br>2. Make antimatter bomb; <br><br>3. Poison Pope; <br><br>4. Recruit professional killer to kidnap and kill Cardinals; <br><br>5. Create trail based on incredibly complex clues from poem in priceless 16th century book in Vatican archive):<br><br>6. Rely on Langdon solving clues in time; <br><br>7. Make car bomb to blow up professional killer; <br><br>8. Rely on helicopter being nearby once bomb is recovered; <br><br>9. Rely on there being sufficient time to get helicopter, fly it high enough to avoid total destruction (despite nobody having the slightest idea exactly what effects of antimatter bomb might be), bail out, get to ground safely; <br><br>10. Rely on hero factor being sufficient to result in being elected as Pope.<br><br>The rationale (I think) was that, as Pope, he could prevent the Catholic Church living happily with science.<br><br>As a plan, I thought that this was risibly implausible. I happily suspend disbelief and willingly did so while the hunt was on, but the revelation of who the baddie was (and, therefore, what his plan must have been) was, to be frank, utterly idiotic - so idiotic, in fact, that it devalued the rest of the film.<br><br>There was some other stuff which made me scoff with derision:<br><br>McKenna is branded on the chest: a large glowing brand, maybe 20 cm square, is applied forcefully to his chest for upwards of 5 seconds, following which it is dropped to the floor where is sets the carpet smouldering. Yet this doesn't seem to phase him in the slightest - he races through tunnels and flies helicopters with nary a whimper (he does hold it as if it's a bit tender later on, though).<br><br>Earlier in the film McKenna tells a story about his military service which ends with him explaining that's where he learned to fly helicopters. It would have been a good deal less clumsy if he had simply whipped out a sign and hung it round his neck reading \"I'm going to be flying a helicopter later in this movie.\" <br><br>Langdon rewinds the security video stored on the police chief's computer. The computer makes the noise of an audio tape being rewound across the replay heads! <br><br>My favourite bit was when the girl scientist tears a page out of a priceless 16th century book (the page which carries the all-important clues to finding the Cardinals and the bomb, in the form of a poem in English printed in watermarks in the paper!), not because it was an inherently good bit, but because I was immensely tickled at the gasp of horror coming from a lady in the audience.<br><br>This film was mistitled. It should have been called \"Angels, Demons, And Complete And Utter B*ll*cks.\"","user":"neil-476","rank":[105,150]}]