[{"title":"\"BarbWire was better than this\"","rating":1,"date":"27 July 2007","review":"That's right, my girlfriend turned to me in the movie and said, \"I think BarbWire was better than this.\" Her opinion and mine seemed to carry through to the whole audience in the advance screening we went to last night. The audience was laughing at the horrible acting, terrible script and crap camera work.<br><br>Specifics: Lohan works in a strip club where women are topless, yet she never takes the top off and even in sheer bra has pasties on (or were the pasties on top of the bra?). I could care less about seeing her naked, but if you are playing a stripper you might have to at least imply nudity with well placed hands.<br><br>Someone decided to inject humor into the movie into the most awkward places. The biggest problem was trying to figure out why people were laughing more during the \"serious parts\" than the \"funny parts\".<br><br>Characters come in, spout some wisdom and disappear behind a rock like the Dungeon Master. I have a feeling that they are supposed to be angels, maybe God himself? <br><br>The twists in the movie are tough to swallow. I will not even come close to ruining them, they are not even worth ruining. Someone thought they could write a M. Knight script, but failed.<br><br>Overall, this movie would be worth a rental from the dollar kiosk at the grocery store, as long as everything else is sold out. I am glad I got in for free. If you do decide to spend money to see this movie, send me the cash instead, I will then hit you in the groin, you will enjoy it more.","user":"chuckreis","rank":[335,484]},{"title":"I'm so sorry I went","rating":1,"date":"29 July 2007","review":"Look, I have a strong stomach, but I have no use for Torture Porn in my entertainment. A few weeks ago, I saw a preview of this film that gave no indication of it's true nature. This, plus the intriguing poster led me to believe this was going to be a brooding drama in the Hitchcock tradition. Instead, I found myself watching the ugliest, most disgusting film I have ever attended of my own free will. I should have guessed when the cashier gave me a funny look while getting my ticket.<br><br>The first thing I realized was the script was by an amateur. The scenes and dialog jumping around with no thought or subtlety. Like other reviewers, I knew who the torturing villain was within the first few minutes. But, I still had to sit through several scenes of dismemberment and pain, which made me sick. Sick that I had spent money to watch this disaster.<br><br>I can't imagine why Lindsay Lohan would agree to be in this production. There are other venues to stretch her acting talents. Neal McDonough and Julia Ormond's rent must have been due.<br><br>The story, such as it is has at it's core an interesting premise. A top director might have made a respectable film out of it with a total rewrite, without the gore and more atmosphere.<br><br>This movie is an absolute, total disaster. No one involved has anything to be proud of.","user":"Mark-129","rank":[213,315]},{"title":"Oh God","rating":1,"date":"29 July 2007","review":"I went into this movie with a friend thinking it would be a cheesy, fun horror movie - just a good way to pass the time on a rainy day.<br><br>Oh god, was I wrong.<br><br>It's as if the director spent the film's entire budget acquiring Lindsay Lohan and disregarded everything else. EVERYTHING within this film is bad - the scary parts aren't scary (or even remotely suspenseful), the dialogue is awful, the acting is questionable at best, and, I am very sorry to say that Lindsay Lohan's stripping/ sex scenes were not sexy at all. On top of everything else, the killer was obvious and the plot didn't even make a whole lot of sense. Even the quality of film used is inferior to the type normally used (yes, you can tell).<br><br>Some films are so bad they're good. This film was just SO BAD.<br><br>Don't wait for the DVD. Just don't watch it.","user":"thou_mayest","rank":[199,299]}]