[{"title":"ignore the user votes, this movie was actually fun to watch","rating":7,"date":"21 March 2009","review":"I gave this movie a fair 7/10. I would ignore the nonsensical 1/10 and 10/10 ratings and give it a fair shake if you're into Japanese food and culture. I was pretty surprised at how they portrayed Japanese culture...not totally accurate, but not a travesty either. I also wouldn't consider this to be a remake of Tampopo -- totally different characters and story lines. But it was fun seeing the main cowboy hat-wearing guy from Tampopo doing a small role as the ramen grand master. His expressions and eating reactions were hilarious! The filmmakers obviously have a love of japan and its culture, and I can feel their sincerity in sharing this joy through this movie. This movie isn't perfect by a longshot (the whole subplot with the British guy and the southern girl was useless and irritating), but there were some genuinely fun and funny moments. Keep your expectations in check and just enjoy the movie for what it is.","user":"megafan-1","rank":[88,107]},{"title":"More than just a romantic comedy","rating":29,"date":"29 December 2009","review":"This film is about an American girl who uses a Ramen shop as her haven after being dumped by her boyfriend. There, she experiences and learns more than she unexpected to.<br><br>\"The Ramen Girl\" is actually enjoyable to watch. I particularly like the way that it treats Japanese culture with respect. This can be seen by not Americanising the Japanese characters, using plenty of Japanese language in the film and also using actors who actually speaks fluent Japanese. Hearing a Japanese ramen chef explaining the spirit of ramen is quite inspirational, as one could see so much dedication and respect for something seemingly insignificant. \"The Ramen Girl\" is more than just a romantic comedy or a \"Lost in Translation\" rip off. It is a good way to introduce Japanese culture, values and traditions to other cultures. I enjoyed \"The Ramen Girl\" a lot, and I hope it reaches a wider audience.","user":"Gordon-11","rank":[25,28]},{"title":"Pleasant comedy about girl finding her spirit...","rating":7,"date":"18 May 2009","review":"I think a large part of the negative reaction comes from expectations about what the film is or should be.<br><br>First of all, this is not a remake of Tampopo, nor is it about food. It actually borrows more from \"Like Water for Chocolate\" than Tampopo, but the food subplot is an afterthought and a bit of a distraction.<br><br>It isn't really a rom-com though there is a romantic interest in there. Nor is it really a East meets West type of thing either though that certainly is an element.<br><br>It is a story about a young girl, who like many young people have wandered aimlessly expecting that life will just happen for them. The Japanese expectation that a big company will take care of them for life is not that much different from the American expectations. Our ramen girl discovers that such a lack of passion and spirit, even when the ingredients are there and all the right steps are followed will lead to a bland soup. A simple metaphor but done fairly well.<br><br>Brittany Murphy is surprisingly good as the ramen girl and her interactions with the gruff ramen-nazi (wonderfully played by Toshiyuki Nishida) are hilarious. The development of the relationship between the two of them was very well done.<br><br>I quite enjoyed this film and recommend it as a light pleasant diversion that brings a smile to your face - like a good bowl of ramen should...","user":"lhhung_himself","rank":[59,71]}]