[{"title":"Just saw it at the theater down the street from my house...","rating":10,"date":"18 April 2008","review":"In gong-fu movie lore, it has long been foretold that one day two of the greatest stars of the genre would come together one day on the screen. That day has come in \"The Forbidden Kingdom,\" which stars two of the latest and greatest stars of the martial arts movie genre - Jackie Chan and Jet Li.<br><br>Combined, both men's careers span over 30 years and over 100 movies, in their native China and here in the United States; that's a lot of kung-pow kicking and punching. They both decided to make their American crossovers around the same time during the 1990s - Chan's first hit in the U.S. was \"Rumble in the Bronx\" (1995) and became a mega-star due to the \"Rush Hour\" movies, while Li made his American debut as the lead villain in \"Lethal Weapon 4\" (1998), received his first English-speaking starring role in \"Romeo Must Die\" (2000), and earned critical respectability with \"Unleashed\" in 2005.<br><br>Now, we're at \"The Forbidden Kingdom.\" I like both stars. My friends and I, like many other martial arts movie fans, have eagerly awaited this cinematic pairing for some time.<br><br>Starting in the present - 2008 - an American teenager named Jason (Michael Angarano) who has an obsession with gong-fu movies is magically transported back in time to ancient China by the long-lost staff of the fabled Monkey King (Li, in one of two roles in the film), where he learns he has been chosen to return it to him. 500 years earlier, the mischievous martial arts master Monkey King had been imprisoned in stone by the Jade Warlord (Collin Chou).<br><br>On his journey, Jason comes across the drunken beggar Lu Yan (Chan, in one of two roles in the film), who teaches him gong-fu so that he will be able to take on the Jade Army. They are also aided by The Silent Monk (Li, in his other role) and the orphan assassin Sparrow (Yifei Liu). There is one particularly funny sequence where Lu Yan and The Silent Monk fight over how to train Jason to defend himself - with Lu Yan's unorthodox methods and the Monk's more traditional approach.<br><br>\"The Forbidden Kingdom\" is one fast-paced and entertaining martial arts flick that keeps you watching just because of the know-it-all/seen-it-all before charisma of the star talent. With nods aplenty toward the martial arts movies of yesteryear (chiefly old-school Shaw Brothers movies, as well as plenty of helpings of Taoist philosophy and the Jeet Kune Do teachings of Bruce Lee), \"The Forbidden Kingdom\" is perhaps what Quentin Tarantino has fantasized about so much during countless cinema grind-house outings as an impressionable teenager and later as an adult realized on the screen in his \"Kill Bill\" films.<br><br>But Tarantino is nowhere in sight. Behind this production, is American screenwriter John Fusco (who based the script on the epic story \"Journey to the West,\" which is cited as one of the four great novels of Chinese literature) and American director Rob Minkoff (of \"The Lion King\"). This production, put simply, is probably the best combination of American-Chinese talent since \"Enter the Dragon\" way back in 1973. Choreographing the fights with plenty of wire-work and CGI pizazz is Woo-ping Yuen, known for his work with both Chan and Li, as well as \"The Matrix\" (1999) and \"Crouching Tiger, Hidden Dragon\" (2000). It's pretty impressive that although it's fairly obvious that wires are being used in the fight scenes, it doesn't really take away from the action like it often tends to in American features, but actually enhances their intensity here.<br><br>I got a lot of enjoyment from watching \"The Forbidden Kingdom\" and watching the magnificent grace of Jackie Chan and Jet Li. Despite occasional script deficiencies, I found this picture working from the opening credits, which was a sure sign that what was about to come would surely satisfy the martial arts movie fan inside of me. For many martial arts movie fans, \"The Forbidden Kingdom\" may perhaps be the movie they've been waiting for since the untimely passing of Bruce Lee 35 years ago.<br><br>10/10","user":"dee.reid","rank":[201,287]},{"title":"This is a must see movie","rating":10,"date":"20 April 2008","review":"I read some of the comments including the one from the user named \"AlecBaldwin\". He left early because of graphics and too many myths. Another didn't like it because the English was hard to understand. Another said it was a kids movie and Chan/Li were out for the dollars only. I'll tell you that I went to the movie theater and sat back and let the movie go wherever it wanted. I was intending on enjoying it and I downright did. It is a great graphical movie with fantastic choreography and editing, and an acting masterpiece, as well as action packed. If you go into the movie theater and take the negative comments with you, you will not like it. You need to understand that this is a rare appearance by two masters who will probably never get together again. As for the English, don't fret on that. I have a lot of trouble with these kinds of movies. This was the ONLY one where I could understand the English. It's simple. Go to the movie with popcorn and soda in hand and an open mind. Get ready for some fast action and a good story line. And finally, ENJOY!","user":"cohru01","rank":[230,335]},{"title":"An incredible movie on multiple levels!","rating":9,"date":"16 April 2008","review":"This movie will be enjoyed by any Jet Li or Jackie Chan fans, certainly. The cinematography is wonderful, with stunning views, excellent use of CGI without overdoing it, and decent acting. Jet Li plays his role marvelously, and the continuity of the various plot themes is fantastic. There are subtleties to this movie that will require multiple viewings to catch! Pros include the acting and scenery, and the way language is dealt with. The only con is that the viewing I attended was a bit rough around the edges, with a couple of minor bobbles in editing and film quality. I'm sure this will be corrected in the final production for the theaters, though! Overall, this is a good action/fantasy movie. For those who like the \"chop suey\" kung fu flicks, this will be a blast from the past. Jackie Chan shows off his unique style of martial arts, while keeping the laughs rolling. Jet Li is NOT playing the 'baddie' for a change, and has a surprisingly entertaining role in this film. There isn't a lot of wire work in this film, and what is done on wires is done judiciously.<br><br>A must-see film for this summer!","user":"revallyson","rank":[154,231]}]