[{"title":"Disappointing","rating":3,"date":"26 December 2008","review":"I was very excited about The Spirit because I am a big fan of Sin City and was looking forward to see Frank Miller in action again. Also, the cast seemed to be a great lineup. However, it doesn't matter how good the actors are if the plot and script are lame, and I am here to tell you -- I don't even think the likes of Anthony Hopkins and Meryl Streep could have saved The Spirit for this reason.<br><br>I kept waiting for the story to intrigue me and for the characters to develop. I watched a couple of people walk out of the theater about an hour through... Finally, I checked the time (never a good sign when you're watching a movie), only to discover that the movie was nearly over, and there would be no chance for redemption.<br><br>Aesthetically, The Spirit was interesting, but I couldn't help feeling like I'd seen it all before. The cinematography and graphics were pretty much a carbon copy of Sin City. I expected to see similarity (Frank Miller's style is distinct, after all), but not identical visual imagery.<br><br>Bottom line, I rarely see movies in the theater because it's expensive! For three people, we spent over $50 in downtown Seattle for this experience, and it was so disappointing. I hate to waste that much money on such a poorly written, boring movie. My recommendation is to skip The Spirit altogether (really, the plot and script are that bad). But if you're really curious, save your money and rent it when it comes out on DVD.","user":"rainbowlightbrite","rank":[275,369]},{"title":"A real review from someone who saw it - no spoilers - just my opinion","rating":3,"date":"21 December 2008","review":"I must say that I was somewhat excited when my friend told me she got us tickets to the premiere of \"The Spirit\", especially since I've never been to a real premiere. It was an entertaining experience, all except for when the film was rolling. <br><br>I liked Sin City a lot, and I thought 300 was intriguingly well made and quite entertaining. Let's just say that compared to 300, \"The Spirit\" entertains more like Howard the Duck. The entire film seems like a total farce, an unfortunate mockery of Miller's unique style himself. It has been a very long time since I've seen a film with such little (to no) heart, and hardly any soul. I must say that Sarah Paulson gave the greatest performance by far of anyone else, as the Spirit's unconventional doctor. She is the sole source of any feeling or depth in the film. Macht was also at his best in the lead role when sharing scenes with Paulson, otherwise, he barely filled the part. I don't know if that was his fault however, given that the character himself was depicted with very little depth overall. I never read the graphic novel, but I'm going to go ahead and guess that this doesn't do it justice. How can I say that? Because novels build key characters into \"people\" that you care about, whether you hate them or love them, the characters stimulate your mind on some level or another. This is far from the case in this film. There is very poor development of the characters, which the majority of potential watchers are unfamiliar with. Sam Jackson has unfortunately chosen another terrible role, as the non-intriguing villain, the Octopus. Jackson however does give us some of his crazy wild eyed antics that we've grown to accustomed to, although his character falls flat for the most part, especially considering his opposite on the screen, Scarlett Johansen. It almost seems as if Miller was asleep on the set when her scenes were shot. She's THAT bad in this film, with a deeply sub par android-like performance. Eva Mendes did what she could to somewhat save the film from being a complete and total joke, although it's pretty close to being just that. She plays the bling digging female lead opposite Macht. Now quite possibly the most annoying character(s) ever portrayed on film are the Octopus's cloned henchmen, which were frighteningly reminiscent in annoyance levels of.......... dare i say it... Jar Jar Binks. My four year old nephew would surely find some entertainment value there. <br><br>This film ultimately succumbs to its poor writing and direction, which are almost cleverly masked by the signature visual style of Miller, which is hypnotizing at times. Unfortunately, it's hardly hypnotizing enough to mask the true, soulless identity of \"The Sprit\".<br><br><ul><li>Crimsonica</li></ul>","user":"crimsonica","rank":[311,441]},{"title":"decent film","rating":6,"date":"11 July 2013","review":"wasn't quite sure what to expect from this one,, not being a real comic book fan I decided that I would give it a chance, second, I wasn't expecting Sin City, which by the looks of the boards most of you were. Samuel Jackson did a great job in this movie,, Gabriel Macht was wonderful as our hero, and Eva Mendez sexy as ever. our hero is in charge of doing good in the city and saving as many people as he can,, there are lot's of people who would rather not have him around Central City, especially the loathsome Octupus,, play by Samuel Jackson,, there are lot's of sexy women in the film,, good action, thrills, suspense , a lot of the good vs evil theme, I like the whole approach the movie took,, it takes you on a mythical journey to somewhere where you can only imagine,, a lot of people bash this movie because it's not like Sin City, well so what,, I didn't want it to be that movie,, this is a decent movie,, worth watching,, won't win any Oscars, but I really don't think that it was attempting to.","user":"kairingler","rank":[15,17]}]