[{"title":"Kind of nice that Hollywood can still offer a non-commercial, very moving film like this one","rating":8,"date":"9 November 2010","review":"Craig (Keir Gilchrist) is depressed. Although his parents (Lauren Graham and Jim Gaffigan) are nice, they are a mildly over-achieving duo who try to gently push their teenage son in a certain direction. This means going to a competitive high school and following a specific curriculum. But, even though Craig is quite intelligent, his stress level is very high and he dreams of \"jumping off a bridge\". One morning, before sunrise, he sneaks out of the house to contemplate his own suicide but ends up going to a hospital emergency room. The teen insists they admit him. They do. However, the adolescent ward is undergoing renovations and doesn't have room for Craig. Instead, he is placed in the adult psych ward, with a nearly catatonic roommate, Muqtada (Bernard White). In short order, Craig wants to go home but his new shrink, Dr. Eden (Viola Davis) says that is impossible, he must remain for five days. Fortunately, he soon makes friends with an affable patient named Bobby (Zach Galifianakis) and casts his eye on a lovely young female Noelle (Emma Roberts), who bears telltale scars on her wrists. These three strike up a friendship, with Bobby schooling Craig on how to \"dress up like an employee\" and leave the ward, at least temporarily! It is quickly evident, however, that Bobby has some dark secrets, as does Noelle, and Muqtada seems to be going nowhere fast. Can Craig get the help he needs, even as he helps others? This is a lovely film which highlights the topic of mental illness in a sensitive, intelligent way. Yes, there are patients with more severe troubles than others but all remain part of the human race, as shown here. The cast is great, with Gilchrist doing a fantastic job as the film's main character. Galifianakis, Roberts, Davis, and especially White, do great work too, as do all of the lesser actors. The setting is fairly limited, as most of the action takes place in the hospital, and the costumes are suitably drab, although Roberts looks very pretty in whatever she wears. Then, too, the script is comically insightful while the direction and camera work are quite nice. All in all, if you are hoping to watch a great film that touches the heart, with depth, view this one kind of soon.","user":"inkblot11","rank":[91,107]},{"title":"Lift","rating":9,"date":"4 December 2010","review":"An important movie, and an original movie whose originality is not its reason for being. That is, \"It's Kind of a Funny Story\" has emotional chops. Musical chops as well, but that's another review.<br><br>Yes, the shadow of a memory of \"One Flew Over the Cuckoo's Nest\" came to me while watching, but I have to say this echo did not lessen \"Kind of a Funny Story\" by comparison. It's not an angry movie. It's not a star vehicle. It's not a plot-fest. It is not ego-driven. It is not desperate for laughs, though I laughed hard on several occasions. In fact I'll see it again to remember those lines.<br><br>This movie gives you time with interesting people. Defenseless and ordinary, and beautiful people. Teens need to feel, we all need to feel compassion for ourselves and everyone around us pushed to depression. \"Funny Story\" while not grimly realistic is realistic in heart. <br><br>Zach Galifianakis has transcendent scenes. Keir Gilchrist is just lost enough. Much to admire in the film-making. This one should not sink under the radar.","user":"barbarakayrich","rank":[84,104]},{"title":"Fun and moving story about a teenager under pressure","rating":9,"date":"19 September 2010","review":"\"It's Kind of a Funny Story\" is based on the book of the same title in which Ned Vizzini tells of his experience checking himself into an adult psychiatric ward at the suggestion of a suicide hotline. The film by Anna Boden and Ryan Fleck is lighter than their previous two films, \"Half Nelson\" and \"Sugar\", which deal with drug addiction and an immigrant's experience. Still the issue of teenage suicide is a serious one, even though Vizzini's book, and Boden/Fleck's screenplay, treat it with many comedic moments. Keir Gilchist from \"The United States of Tara\" is nuanced and convincing in the lead role, and is backed up by a strong supporting cast led by Zach Galifianakis and Emma Roberts. If you can remember or relate to what it is to be a teenager under pressure from school, parents, friends, and life in general you will like this movie. It will make you laugh, cry, and be glad to be alive--isn't that what film is all about?","user":"jlf-849-617310","rank":[94,118]}]