[{"title":"\"Family Guy and Star Wars-Truly funny\"","rating":9,"date":"27 February 2008","review":"When i first heard that Seth MacFarlane, creator of Family Guy and American dad was doing a Family Guy Star Wars episode entitled \"Blue Harvest\" i thought 'oh this is too funny and i have to see this' and after many months, i finally got to see it, but not on TV but brought the DVD just this month and i could not stop laughing! Being a Star Wars fan first before i was a fan of Family Guy, i knew the Star Wars movies well and after seeing Family Guy episodes, i knew it would be full of gags and laughs, \"I sited my pants\" Stewie as Darth Vader says to Lois as Leia and Adam West as Tarkin and having Herbert as Obi Wan Kenobi was truly well casting as Chris was Luke Skywalker. i thought having Cleveland as R2 was very original and funny, lines like, \"Yeah! that's how we do it in my neighborhood, b*****!\" or Peter as Han Solo, \"Oh you mean that thing you just found out about three hours ago and are now judging me for not believing in it?\" <br><br>The DVD contains scenes that were not on the television broadcast, that i did not know about until the commentary pointed out, which goes through all the details that went into making the story, including guest stars of the episode, not to mention features such as \"The making of Blue Harvest\" \"A conversation with George Lucas\" \"Family Guy Star Wars clip show\", it's amazing to see how many Star Wars gags are in the episodes and an \"Introduction to Family Guy\".<br><br>If you love Star Wars and Family Guy, then this is for you, you'll laugh like you've never laughed before","user":"sexystarwarslover","rank":[14,15]},{"title":"IMO, this was one of the best Family Guy episodes to date...","rating":10,"date":"23 January 2008","review":"Being a fan of both Star Wars and Family Guy, I was absolutely excited once I heard of \"Blue Harvest\" being produced. I immediately knew this episode was going to ROCK! Plus, I also thought it was VERY cool of Lucasfilm to gave their blessing to produce this hour-long episode.<br><br>After watching this episode repeatedly, I can honestly say without a doubt that it was one of the best Family Guy episodes EVER. Filled with tons of Star Wars-related gags and the usual hilarious absurdity, it was definitely the hardest I'd ever laughed watching Family Guy.<br><br>If you're a fan of Family Guy or Star Wars (or both like me), you definitely need to watch this episode.","user":"73Zero","rank":[26,34]},{"title":"For Full Experience, Watch the DVD.","rating":10,"date":"21 January 2008","review":"I saw the episode, thought it was funny, and being such a fan of Family Guy, knew how much Seth McFarlane loved the Star Wars references. I knew it was only a matter of time before a full-on remake of the film was created.<br><br>Then, I saw that a full-length DVD was coming out with extended and added scenes. Yeah. You thought it was good on Cartoon Network. Nothing compares to Stewie's diaper going over to the Dark Side. There is so much more adult humor. Everything is uncensored, and uncut.<br><br>The DVD extras include excellent commentary with Seth McFarlane, David A. Goodman, and Dominic Polcino (the episode director). My suggestion is to watch it once without the commentary, and once with. There's a fantastic interview with George Lucas, and a look into how (and why) Blue Harvest was made. I had no idea just how much of the original film was actually used. Direct quotes from Star Wars, scenes taken directly from the film, even 95% of the score is the original score with short edits and the Family Guy adaptation from Walter Murphy. The detail of the animation, right down to the explosions that look like effects taken directly from Star Wars (but aren't), was all done so well. George Lucas should be proud.<br><br>Seth McFarlane and his team put a great deal of effort into making this a quality and hysterical revamp of a Lucas classic. You can't get the full experience until you see it on DVD, though. Seth, you're a freaking genius.","user":"buffychik","rank":[27,36]}]