[{"title":"Very important subject matter which is hard to watch, but must be","rating":7,"date":"17 August 2011","review":"The vast majority of the time one hears the words 'government contract' it is safe to assume it is not the best and brightest people who are volunteering to go for extended periods of time to locales termed war zones. Sure, there are those altruistic few who take up the charge to make the world a better place, but routinely, it is just someone willing to exchange six months of their life in exchange for a juicy paycheck. The Whistleblower's heroine, Kathryn Bolkovac (Rachel Wiesz) is one such person. She was a Nebraska police officer who signed on with a company called Democra who had a security contract with the United Nations.<br><br>For six months of her time and $100,000, Kathryn was to monitor the local Sarajevo police and advise them on proper police procedures. Very quickly, she discovers the word monitor means turn a blind eye as Serbs, Croats, and Bosniaks abuse whatever power they have to continue a sort of undeclared war on each other. The Serb policemen will not investigate or prosecute domestic violence cases, especially if the woman is Muslim. Kathryn successfully leads Bosnia's first case against domestic violence earning her a more visible job as the department head for gender affairs.<br><br>Now her scope includes far more than standard local police issues. Young Eastern European and Russian girls are turning up on the streets and shelters looking severely assaulted and sexually abused. To her shock and dismay, Kathryn learns that United Nations employees from all nations are not only the girls' customers, but frequently aid local human traffickers in their transport and have an interest in holding the girls against their will.<br><br>Nobody in any position of authority ever raises their hand for a scandal, so all of Kathryn's investigations and findings are swept under the rug and she is ostracized from the rest of her compatriots who are either not interested in obtaining justice for the girls or believe so much in bureaucracy and paperwork that they sometimes send the girls right back to their rapists. On Kathryn's side is the High Commissioner for Human Rights rep played by Vanessa Redgrave and an internal affairs agent played by David Strathairn.<br><br>Frequently, the subject matter and scenes of girls undergoing sexual abuse and torture are stomach churning. The film can be relentless at times showing various punishments and cruelty. Human trafficking, especially if it involves a trusted world organization and its sleazy contractors, is an extremely important subject to cover and make films about; therefore, be ready to adjust uncomfortably in your seats as you watch downright disgusting and brutal activities perpetrated against teenage girls.<br><br>The Whistleblower deserves applause for bringing to light the company Democra which still carries out government contracts to this day. However, when the film takes a break for showing the girls' plight, it focuses on Kathryn's personal life and back story which are choppy and do not come across as fully thought out. There is her home life back in the states which she left, including her daughter, and an awkward budding romance with a Dutch security contractor. Including romance and relationships in a film with this disturbing subject matter would be tough for any director, and this first time feature director does not quite pull it off.<br><br>It will take this reviewer some time to get over some of the images in The Whistleblower; tread at your own risk. But this story deserves to be told and shown in all of its brutality.","user":"chaz-28","rank":[111,117]},{"title":"the truth hurts","rating":28,"date":"28 August 2011","review":"what is it that makes us human? the thing that separates us from the animals? the whistleblower doesn't answer these questions. in fact it asks the question even more. this movie was hard to watch but also hard not to. Weisz is outstanding as the woman that exposes the men with control and power over their weaker fellow man...or woman in this case. you must watch this movie for the human story. expecting to be \"entertained\" by drama and the like should not be your goal here, the director has done an excellent job ensuring that. if you want to be entertained then watch transformers... if you're not afraid to be moved by the real events on which this story is based, then this movie is for you.","user":"franmol01","rank":[62,66]},{"title":"An excellent but depressing film","rating":9,"date":"1 September 2011","review":"The Whistleblower is an excellent film, but it left me depressed. However, its message is undoubtedly important and I think that it definitely deserves an enthusiastic recommendation, not exactly as an entertainment, but as a testimony of a horrible situation which is unfortunately extended all around the world, even though the story from the film is set in Serbia and Bosnia. Which one of so many possible atrocities does The Whistleblower deal with? The human trafficking; and even though it does not offer solutions (probably because they don't exist), it at least brings us new reasons to feel ashamed of the human genre.<br><br>Having established the importance of the message expressed by The Whistleblower, I will proceed to focus myself into its many cinematographic attributes. The screenplay is fascinating, and it kept me in suspense the whole time, because even though it does not have the structure from a traditional thriller, the crusade undertaken by the main character demands a strong emotional response; and as well as we share her hope of a positive solution, we also feel her frustration when she faces the constant obstacles she finds from the mafia, the bureaucracy and even the enslaved young women, who are too scared in order to testify against their captors. The only thing I can say against this film is that the screenplay should have explored a bit more some of the subjects it deals with.<br><br>Rachel Weisz brings a great performance in the leading role from The Whistleblower, due to the wide range of emotions she perfectly expresses with her character. Vanessa Redgrave, Monica Bellucci, David Strathairn, Roxana Condurache, Paula Schramm and Nicolaj Lie Kass also bring perfect works. So, in conclusion, The Whistleblower is a hard but brilliant movie whose finality is not amusing us for a while, but illustrating us about a sad reality which is lived by millions of people every day. I guess that it is difficult to think about that when we have our own problems (which are undoubtedly minor, even though they affect us daily), but that apathy is exactly what companies like DynCorp need in order to enrich themselves at the expense of the human misery. Even though I think that exactly the same can be said about any government.","user":"Argemaluco","rank":[62,67]}]