[{"title":"Miserable","rating":1,"date":"31 August 2008","review":"Let me begin by saying this. I am taking time out of my day to sit here and write about how awful this movie is. Rarely do I ever write a review on here. I only do so if I really like a movie, or can't stand a movie so bad that I think others should be warned about going to pay to see it. All told, I've written probably four reviews. This is hands down the worst movie I've seen in the last five years. Sadly, I thought the previews made it look alright. Seeing as how I'm 23 and recently graduated from college, I also thought that this movie could bring back some nostalgia from my recently deceased college years. Me and three ex-fraternity brothers from school went to catch this movie with hopes that it would at least provide us some decent laughs before going out. We were dead wrong. Not only is this a blatant rip off of Superbad, Accepted, The Girl Next Door etc., it also is host to three of the most annoying main characters in the history of film. The jokes suck, the situations are beyond dumb, and the portrait it paints of college is completely wrong. In order to hang out with frat guys you have to take shots of tequilla from a dude's a$$ crack? Really? Don't remember seeing that in my college days. Annoying fat kids hooking up with hot blondes? Yeah, no, don't recall that either. College kids even caring that high schoolers were at their parties? Not the case. Where I went to school they were introduced and greeted with a beer. No one f**king cared if they were there. I could go on forever, but the bottom line is save your time and money. Go rewatch Superbad or Dazed and Confused or something. Or better yet, save your 10 bucks, get a 12 pack of shi**y beer, get drunk, and let the night unfold. There's a more realistic college experience for you.","user":"russell-grimm","rank":[104,142]},{"title":"Super BAD.","rating":1,"date":"28 August 2008","review":"Well, there's bad movies and then there's BAD movies. I didn't expect this one to be high art, but I didn't expect it to be this bad. \"COLLEGE\" is a low budget, uninspired, horribly written waste of time.<br><br>The most amusing part of the movie was watching the fat kid try to mimic all of Chris Farley's mannerisms as an acting style. Pathetic.<br><br>I've seen a LOT of \"teen comedies\" and \"raunchy comedies\" and enjoyed them. But \"COLLEGE\" is an embarrassment to those types of films. To be honest, it was just...boring.<br><br>The three main characters<br><br><ul><li>pale ripoffs of the three main \"Superbad\" characters, by the way...there's a Micheal Cera clone, a Jonah Hill wannabe, and a poor man's McLovin...it couldn't be more sadly obvious - </li></ul><br><br>spent most of the movie covered in urine, vomit, and feces.<br><br>And THAT, dude, is the joke. For the ENTIRE movie.<br><br>\"Whoops, we've got pee thrown on us. Whoops, we were thrown up on. Whoops, now we're covered in pig crap.\" I can't remember the last time I was willing to just walk out in the middle of a movie at a theater. But, had I paid to see it and not gotten a free pass, I would have left and asked the manager if I could see something else.<br><br>I've got no personal stake in this, and it obviously won't affect me if people see or don't see this film. But, I'm telling you, you'll kick yourself for paying money to see this movie.","user":"creditdauphine","rank":[124,171]},{"title":"Seems like the Spammers are out in droves","rating":1,"date":"26 August 2008","review":"I have also caught a screening of this movie....Seriously, the comments about this movie look so set up and not authentic. Each commenter leaving a positive review says almost the exact same thing in the exact same amount of words. They re-hash the same stuff until they hit the minimum amount of lines for a comment. Plus, look at the demographic that has given the highest scores for votes....middle aged and elderly women. Also, the group that has the best chance of enjoying this film (18-29 yr old males) have one of the poorest ratings. If they are this desperate to get a good word out about this movie and are failing at doing so, I'd avoid this trash heap.","user":"jscheibel","rank":[119,171]}]