[{"title":"Funnier than I imagined","rating":8,"date":"20 March 2008","review":"I recently went to see the sneak preview Tuesday, going in I thought it'll be so-so in the humor department. This isn't a smart make you think comedy, but it had heart in the right places and it was very funny none the less. It has a few plot holes, but nothing too obvious to the viewer. <br><br>I really enjoyed watching the characters, Owen Wilson is really great at these types of comedies. In the end though I've got to say that the kids they casted really stole the show. They fit their roles perfectly.<br><br>In the end all I can say is that this movie is redemption for geeky fresh meat everywhere.","user":"hnd7302","rank":[79,114]},{"title":"Another inventive comedy from the Apatow crew","rating":8,"date":"26 February 2008","review":"I love IMDb.com. I just came here (after seeing the movie) and saw that John Hughes (using a pseudonym) was one of the writers of this movie. That makes sense, because the movie covers the awkwardness, danger and constant potential for life-ruining humiliation that is freshman year high school. Being \"skinny, scared and lonely\", as Drillbit Taylor puts it.<br><br>One of the other writers is the awesome Seth Rogen, co-writer &amp; co-star of \"Superbad\" and co-star of \"Knocked Up\".<br><br>Owen Wilson is funny, sexy and heartwarming in this role. The trio of geeky lads who hire Owen as their protector are all played by wonderful young actors. The Apatow organization seems to have a genius for finding great and funny teen actors. I was especially impressed by Alex Frost (he plays the bully) who I think has stardom in his future.<br><br>The small roles of the film are filled by standup comics and \"The Daily Show\" alumni. Good talent all around.<br><br>The movie is not perfect. It's front-loaded -- meaning the first half has so many laughs you can't hear all the lines for the laughter. Then it suddenly slows down in the second half. It's still interesting -- just not as funny. And when you get to the violent fighting, that dries up the laughs.<br><br>Overall though, any film from the Apatow organization is going to be 6 times funnier and more inventive than the average movie comedy out there. So go have some laughs.","user":"hellokristen","rank":[97,147]},{"title":"Owen Wilson: Army of One","rating":22,"date":"22 March 2008","review":"It's been a while since I wrote one of these but thanks mainly to Owen Wilson for another hilarious (yes and interchangeable) role, this movie was funny enough to get motivated once again.<br><br>The premise is obviously pretty simple and has been done before in both bodyguard and teen movies (Superbad and My Bodyguard come to mind...duh). The beauty of this movie it combines the two genres with Owen Wilson's natural comedic talent and three capable younger actors resulting in a mostly funny comedy that is unique from the rest.<br><br>There was an interesting metaphor contained in one of the trailers showing Drillbit telling the kids he's taking them under his wing. The reason I say this is interesting is because this is how it mostly worked for the movie's humor. It took almost 15 minutes for it to really get started. Don't get me wrong, there were some funny parts that didn't involve him like the bodyguard interviews (gotta love Frank Whaley's cameo), Ryan's rap off with the bully and the two hitting each other but the biggest laughs for me were from Owen Wilson. To be fair though, Owen was at his best when the kids were involved. I loved the way he approached this \"job\" with one part seriousness, one part B.S. and two parts hilarious. I was dying when he was holding up that kid's burning popsicle stick project up to the sprinklers and just the general training conversations just to illustrate that recipe.<br><br>Overall, this storyline was nothing brilliant but as in You Me and Dupree, Owen Wilson manages to take something that could be rather mediocre turning it into an enjoyable and endearing comedy. True, he really didn't do it by himself as I'd try to make you believe. I mean the way the bullies were portrayed was a very convincing and effective factor that helped sell this one as well and who could forget the lovely Leslie Mann in an interesting and sometimes funny romantic subplot. To sum it all up, if you liked the trailers you're going to like this movie. And a shout to all the people who replied in my thread that convinced me to go myself. You were right.","user":"Robert_Scott","rank":[57,84]}]