[{"title":"Out-and-out teen comedy with a lot of laughs","rating":8,"date":"12 June 2008","review":"I saw this on HBO lateish last night and should have gone to bed with an early start today, but I stayed up with my girlfriend to watch it all the way through. Glad I did.<br><br>Films always have something they're trying to achieve. This film's there to make you laugh, particularly if you're sub-30 and probably sub-20 and for that it's great. It's not meant to be deep - it's stupid with a lot of good gags.<br><br>I scrape in sub-30 and so remember Ferris Bueller's Day Off from the 80s. Like Family Guy figuring copying the Simpsons set-up was the best idea, so they've copied the set-up almost completely - High School student getting away with party day, getting his girl, graduated sister half-covering for him and Principal chasing him around town (with fat secretary holding the fort). Oh, and a dead relative.<br><br>You know it's shallow, but that's why it's good. Does what it's supposed to, hence the 8.","user":"british_jim","rank":[25,36]},{"title":"My Review","rating":5,"date":"7 September 2008","review":"Senior loser Adam Harris (Gary Lundy) is invited to the senior skip day party at Principal Dickwalder's (Larry Miller) house. But he accidentally slips the news to the Principal, and the whole senior class now wants his blood.<br><br>But Adam and his two friends come up with a plan - have the party at his house instead! So he invites all the seniors to come, and a huge party ensues, with the Principal driving all over town trying to find out where the senior skip day party is at.<br><br>\"Senior Skip Day\" tries too hard to be this generation's \"Ferris Bueller's Day Off,\" but fails in every aspect. Sure, some of the jokes are funny, but the stock characters and lack of character development in the lead all leads the viewer to an overall disappointing feeling after viewing this direct-to-DVD teenage comedy.","user":"joemamaohio","rank":[6,7]},{"title":"Don't waste your time","rating":1,"date":"30 December 2008","review":"AWFUL!<br><br>This movie is by far the worst movie I have ever seen. The main character was a horrible actor. The entire movie it seems as if he is trying to be Ryan Reynolds performance in Van Wilder and it doesn't happen.<br><br>This movie has plot holes galore. And ten minutes in will leave you wondering if you missed something.<br><br>The characters in this movie are either the obvious stereotype that we've seen a thousand time (The Overly Out Of Touch Stoner, The Cheating Football Playing Asshole Boyfriend, The Gorgeous Long Time Crush Of The Main Character (Who Is Still A Virgin... Somehow) etc.) or they are totally over the top and annoying (The Physically Violent Principal, The PETA Member Who Gives Up Her Morales After 2 Beers And A Bong Toke, etc.)<br><br>This movie is the Dane Cook of movies. They took the best parts from all other teen movies, but made them so outrageous and obnoxious they not only aren't funny anymore, they actually inspire hatred and make one consider murder.<br><br>Things This Movie Taught Me: - Mobsters don't know how to lock doors, always carry copious amounts of cocaine, and are very trusting of people they just met - All black people know at least one Hip Hop singer - If you really love a girl and she's just about to sleep with someone else... Don't worry, Something always goes wrong - High School students are very accepting of the outsider especially when he dances like an idiot by him self, in fact his individualism will cause them to accept him even more - Beautiful women take being tricked very well, in fact they can not tell the difference between a legit photographer and an 18 year old with a fake mustache. But don't worry even if they do figure it out IT'S OK!!! Just admit you tricked them and they will take their clothes off and stay for your party, because they have nothing better to do with their life's.<br><br>I have more but, you get the idea. As Jeffery Ross would say:<br><br>This movie had to be filmed in Hi-Def, because the only way someone would enjoy it is if they were High and Deaf.","user":"anderwtetnowski","rank":[11,16]}]