[{"title":"Some hot 20 minutes one afternoon in New Orleans","rating":8,"date":"21 August 2013","review":"The power of few is such a strange bird of a film, and as a very experienced movie watcher, I from the start felt this was different. There's so many of the usual and ordinary ways of making a film, that one often tend to get bored, or rather, is less impressed about. We've seen it all before, you could say.<br><br>However, this is a fresh breeze of a film. The film is full of little tricks and strange ways of doing things. Fresh takes, you could say, being in the wrong place. The idea of this film is things happening seen from different persons view or angles, happening just after 2 p.m. one hot afternoon in a gritty, crime ridden part if New Orleans. The film soon reveals this, but still it keeps the tension, though it starts over and over with the same time frame seen again from a different viewpoint.<br><br>It is easy to hate some of this as well, because things which happens here is the quite opposite of what you want. I can't tell more without revealing major story telling points, so I will not.<br><br>There's a bunch if great actors here, and the two biggest stars, Christopher Walken and Christian Slater are not doing the best job here. The best acting is done by one of the minor roles and the third segment of this film is letting the rest of the film down, like Devon Gearhart and Tione Johnson. <br><br>The instruction of the actors are not anything compared to the start. It looks like the actors was acting in another type of film, less serious than what the others are doing. Such a pity, but I think that this is due to different actors being able to be filming at different times, so that the feeling the actors have is different from the whole. The film also take a funnier twist than it should, according to the start. However, if you see through this, which I chose to do, due to the great start, the film is still good.<br><br>What I really love here is the cutting and editing. It's different and very interesting. The storytelling is superb. It reminds me of \"Lola rennt\" (\"Run Lola run\") by Tom Tykwer, which I loved when I saw it in the cinema back In 1998. Or you could see resemblance with great films like \"Sliding doors\" or \"Mr. Nobody\". The camera movements and the music is stylish. Many will be expecting more from the end, but I liked it.<br><br>I would recommend this to film lovers which wants something quite different from the ordinary. Storytelling, takes, techniques and originality makes this a gem! A cult movie, no doubt!","user":"OJT","rank":[15,18]},{"title":"A movie that shows the same event from many different perspectives. I love movies like this. This one is very good. I say B","rating":7,"date":"25 June 2013","review":"\"Have you ever bit the inside of your cheek?\" A stolen religious artifact, a baby who needs medicine, a delivery driver who meets a man on the run from a gang, two agents looking for someone and two homeless men all become connected in one tragic event. This is the kind of movie where a series of events connect groups of people that otherwise have nothing in common. This one event is shown from everyone's point of view and how one person can change everything. I love movies like this. Movies that show the same event from many different perspectives. No movie has done it better then Rashomon but there have been many attempts since then. Most recently movies like Crash, 11:14 and Vantage Point have all used this style of filmmaking. I have enjoyed all those movies and I enjoyed this one as well. The only problem I had with this one is that some of the stories went on a little long and started to slow the movie down, but overall the movie was enjoyable and really keeps you watching and sucked in. Overall, a fun movie done in a type of style that I really love, which may skew my opinion but I think it's very much worth watching. I give it a B.","user":"cosmo_tiger","rank":[24,32]},{"title":"Should be great, but only manages very good.","rating":7,"date":"25 May 2013","review":"This is one of those films that is 'a little bit different'. <br><br>It has plot and feel aspects of 'Run Lola Run', 'Vantage Point' and 'Donnie Darko' but doesn't manage to inspire anywhere near the same excitement as the other titles.<br><br>The plot is non-lineal with the same scene being repeated multiple times from a different view point or dimension. The writing is excellent, most of the characters are interesting and engaging. There is some great casting too - especially the girl on the moped who is both incredibly beautiful, and a bit odd looking.<br><br>Great camera work, settings, lighting and performances all around, etc. etc.<br><br>On paper this should be an easy '9' but I can't bring myself to go higher than a '7'. With so many films now that are 'a little bit different' they are in danger of becoming all exactly the same. Maybe I have just watched too many, but by the time the end credits rolled I realised my mind was somewhere else. The punch line was weak and a bit pretentious and I had spotted the ending from about twenty minutes in.<br><br>A movie that is magnificently crafted, but fails to be magnificent.","user":"thekarmicnomad","rank":[28,40]}]