[{"title":"Great Picture....needs to be in theatres soon !","rating":10,"date":"6 April 2011","review":"I skipped \"Red Dog\" in Berlin... I don't like \"dog\" pictures... <br><br>BIG MISTAKE ! <br><br>Fortunately, I had a chance to see it at Vail Film Festival, where it ran away with the \"Audience Favorite\" and it blew me away... it is a completely endearing tale of an isolated mining town in the far northwest of Australia, the bizarre characters that wash up there, and the unstoppable human drive to create community wherever we gather. And yes, the dog that inspires them to focus on what matters in themselves and in life. The characters, and in this town, everybody is one or they wouldn't BE there, are original, surprising, and compelling. And the landscape that holds them is truly other-worldy.<br><br>There is not one sappy minute in this film... but many genuinely hilarious ones, and quite a few touching ones. In it's emotional impact, it somehow reminds me of \"the Blind Side\", in all the best ways. Between the cineplex, on demand, and 2-3 film festivals, I see roughly 150-200 films a year. This is easily among the 2-3 best I've seen this year...some distributor is going to hit a home-run with this one.","user":"aligon-2","rank":[84,104]},{"title":"this movie is amazing","rating":10,"date":"12 May 2011","review":"i was lucky enough to see this last year in Melbourne for a exclusive viewing, then i got to comment on what i thought of it. This movie is amazing. it is now my favorite movie. Now i know that people will be like... whatever. but i joined this website and took the time to let as many people as i can know that this movie is by far the greatest Australian movie ever. It makes so laugh and cry. It makes you fall absolutely in love with red dog and really appreciate the companionship of animals. I have nothing bad to say about this movie. I really suggest everyone goes to see this in the cinema. I have already planned to see it another two times. 10/10","user":"sarah-eva","rank":[72,93]},{"title":"A True Aussie Classic","rating":20,"date":"20 August 2011","review":"A beautiful film shot in one of Australia's most iconic locations that reconstructs a true tale of an Australian larrikan in the manner that these stories are meant to be told, serious, but with a nudge &amp; a wink. It was refreshing that the Director (Kriv Stenders) &amp; the human actors never tried to upstage the true star of the movie Red Dog (Koko), letting him become the focus of the story.<br><br>It is important that Australian cinema continues to look at the 1,000's of little stories that make us what we are, the stories of towns &amp; people that are often overlooked in our desire to be recognized overseas. Movies like Red Dog are a window to our soul. <br><br>Also, an Australian film without the painful slow pace &amp; without the obligatory close up shot of something totally unrelated to the movie ... refreshing!","user":"csaw59","rank":[47,62]}]