[{"title":"What more can you ask of a Reboot","rating":7,"date":"29 March 2009","review":"I'll keep this short and sweet. This was gruesome and twistedly faithful to the original in spirit and effect. I totally expected to be the one tortured when watching, well I should have left my preconceived notions at the door. The acting was sharp, the plot devices made just enough sense that it never broke my disbelief and I admittedly had to briefly look away from some scenes.<br><br>The setup was stellar and the ending did not disappoint. I give it a 7 but if it was possible I would have given it a 7.5.<br><br>Good for the genre and great by comparison of other remakes.<br><br>I would definitely suggest it to anyone that enjoys the genre.","user":"xJrobx","rank":[159,206]},{"title":"I haven't said this in a while: THIS IS BETTER THAN THE ORIGINAL","rating":8,"date":"22 March 2009","review":"Let's face it, there are a lot of remakes, there are some good one's: The Thing, The Hills have Eyes, and The Texas Chainsaw Massacre. There are some average one's: House of Wax, House on Haunted Hill, and War of the Worlds. Then there are the bad one's: Halloween, The Fog, and Psycho. Last House on the Left, my parents had absolutely held me from the original movie, but when I became an adult I rented the movie and watched it by myself, I was just so curious what they were trying to hold me back from, I wasn't really shocked with the movie, I could see how it was gritty and brutal in the day, but after seeing movies like I spit on your grave, Hostel, Dirty Harry, Casino, etc, it just didn't really effect me. So I was actually looking forward to a remake of this just to see what they would do with the story and I have to say that they not only made it better, it was just a very great horror film that made me want to take 15 showers afterwards.<br><br>Mari and her family are going on vacation. When they arrive at the house, Mari asks to sleep in the guest house instead of in the main house. Mari's brother, Ben, had died one year earlier, and the family are still trying to adjust to his absence. She finds a necklace he gave her and puts it on. She decides to ride into town to see her friend Paige. Mari's mother, Emma, is cautious, but her father, John, lets her go. Mari meets up with Paige at the store where Paige is employed. A young kid named Justin approaches the counter and asks for a pack of cigarettes, which Paige does not give to him due to his age. Justin says that if they join him at his motel room, he will give them marijuana. Paige agrees and sells him the cigarettes. They drive to Justin's motel room and Justin and Paige enter. Mari waits in the car but notices they are taking too long. She enters the room where she finds Justin and Paige on the bed getting high. She joins them and they decide to give Justin a makeover. They are interrupted by Krug, Sadie, and Francis. Krug explains that it is too risky to let Paige and Mari live. They decide to not only murder but rape the young girls. The gang goes to Mari's house not knowing that's where she's staying with her parents, her parents welcome the gang in thinking they got into a car accident. But Mari somehow survives and comes back home; her parents discover that the people they've been helping are the same people that just tried to murder their daughter and now it's time for justice.<br><br>This is the movie that you cannot wait to see justice brought to these sleazebags, they were so disgusting, I was just screaming and cheering in the theater. Like the tag line said, if bad people hurt someone you love, how far would you go to hurt them back? If that was my daughter, you wouldn't wanna know the sick things I would've done to these slimy people. The thing that made this movie so horrific was how realistic it was. The rape scene doesn't show much but is one of the most graphic and disturbing in cinema, even my 25 year old boyfriend had to cover his eyes, he said he was just incredibly sick from it because he can't imagine the pain she was going through. The performances are on and the story is great. I would say this is one of the best remakes in years, this is not for the faint of heart though, but if you're curious about the remake, trust me, this was a very respectful movie of the original horror story of murder and revenge.<br><br>8/10","user":"Smells_Like_Cheese","rank":[110,150]},{"title":"Good remake that kept it's cruel nature","rating":7,"date":"13 March 2009","review":"As a fan of the original 1972 version, I wasn't expecting a lot, but at the same time, with Wes being brought in as a producer, I felt it had to live up to some expectations.<br><br>What I got was a fun yet torturous movie that had the audience with it the whole time. They were gasping, hollering, sighing, saddened, and later clapping, laughing and woo'ing. It really takes you for a ride from the first moment and only lets up briefly, only to take you back down again.<br><br>While the original scores higher for \"shock factor,\" this one still has plenty of gore and story. I'm not going to give anything away because I'm sure most of you know the story by the trailers, but overall this is an intense film that you won't forget anytime soon. If you know what happens, you'll be happy when the second half of the film picks up. If you have no idea, try to enjoy the ride as I'm sure you'll leave satisfied.<br><br>A few people in my theater left before it ended, so if you feel sick or faintful, just keep repeating to yourself: it's only a movie, it's only a movie, it's only a movie...","user":"freakinflax","rank":[131,193]}]