[{"title":"Truly awful","rating":1,"date":"22 September 2013","review":"Do not be fooled by the people on here who have given 9 or 10 stars. If you check their profile you will see that this is the only film that they have ever reviewed. Sadly this is a trend which has become all too prevalent on IMDb in recent years. I really wish the site would sort it out.<br><br>The film itself is a well-worn and tired theme and the funny lines are not funny. My advice is to avoid this film at all costs unless you feel particularly like being angry with yourself for having wasted an hour and a half of your life. To be honest, I am not sure what the intended audience for this film is. I am not opposed to films about social, religious or national groups if they are done well. Mel Brooks was a master at this in his heyday. Borat was a belly laugh a minute. However this film fails on so many levels. Avoid at your peril.","user":"martyncymro","rank":[55,75]},{"title":"A waste of time and talent. An unfunny film with poorly developed characters.","rating":1,"date":"20 September 2013","review":"I did not see the play, so I cannot compare the two works. I am Jewish and enjoy films that poke fun at Jews. A film that comes to mind is \"A Serious Man\" by the Coen brothers which is drawn from their upbringing in the Mid West. This was a very funny film with finely drawn characters. In \"Jewtopia\", the characters do not come across as real people but rather caricatures of real people. The humor is not clever but extremely silly and not funny. It shows a lack of creativity because there is a wealth of material to draw from and this is a lazy effort to poke fun at both Jews and non Jews alike. This is the kind of film that makes me angry because the effort is so poor. the story so weak that you have to wonder where it will draw an audience from. It does not deserve and audience! Once it opens in theaters I guarantee it will have a short run and generate very little income and no buzz. There are so many poor films being made and this one indicates the filmmakers have little faith in the intelligence of its audience.","user":"iraz","rank":[48,68]},{"title":"Disturbing, offensive attempt at gross-out humor. Avoid it.","rating":1,"date":"3 March 2014","review":"Self deprecating humor can be funny. Poking fun at your ethnicity's stereotypes can make you smile if done with affection and talent. I figured the large cast of well known actors meant this would be a good attempt at such screenplay. I guess I was expecting a Jewish \"My big fat Greek wedding\". Boy was I wrong.<br><br>What a stinker. Poorly written, poorly directed, over the top writing and, with a few exceptions, over the top acting make this little more than a string of Jewish (and Christian) family caricatures. It feels amateurish. To be clear, when I call this offensive, I'm not referring to the insulting ethnic stereotypes and jokes. I mean the movie was an offensive to me as the audience. Half way through all I could think of was \"how did they get this many people to lend their reputations to this poorly written, over-acted, poorly cast, sophomoric attempt at humor?\" Jack-ass and Bad Grandpa meets It's a mad mad mad mad world - with worse acting.<br><br>By the end it felt like I watched a \"film\" made by a bunch of drunk/stoned twenty- somethings with a camera who think themselves insanely funny and talented the louder and more obnoxious they act. Too bad I watched it sober.","user":"mgfuchs99","rank":[21,31]}]