[{"title":"Great film. Can't wait to see it again.","rating":10,"date":"1 February 2008","review":"Just watched this and was blown away, not sure when it is coming to cinema but can't wait to see it again.<br><br>There are not many well-known names in the cast but seems to have found the best of the British talent not yet ruined by Hollywood.<br><br>The initial story is about a factory worker called Danny who is down on his luck and close to suicide, he is recently divorced and even his kids start to see his weaknesses.<br><br>When he starts to involve himself with some new friends at a boxing gym, who work as club doorman, and explores new relationships with people he can trust, his life starts to improve.<br><br>With his new found lifestyle other stories start to evolve. Sparky is finding it hard to resist the pressure and the money coming from the local gangland boss Hennessey. Rob is on a crusade of removing the club of Hennessey's drug pushers and Louis, the head doorman tries to keep them in toe including his new found protégé Danny.<br><br>I was not old enough to remember the eighties but the film felt embroiled with fashion and music that seemed to show the culture of the time.<br><br>There are not many films I can remember getting goose bumps but I was effected several times throughout this film, which is even more surprising considering its genre.<br><br>I have just checked out the films website and there is a trailer, so have a look.","user":"monellion","rank":[34,40]},{"title":"Just Loved It","rating":9,"date":"16 January 2009","review":"To be honest, I reckon this knocks spots off any Guy Richie gangland type film. This is British Cinema at it's best and I was left wanting the film to just go on longer. The way it finishes with a blast of Bob Relf's northern soul number Blowing my Mind to Pieces just left you feeling excited about what had gone before. Yes it is brutal in places, funny too, as well as genuinely scary, not scary in the horror film type way but in the scared for the main characters. Brilliantly acted, the soundtrack of decent soul, Gwen Guthrie's Keep the Fire's Burning, Chic's Everybody Dance and even Willie Tee's One Way Street and the fact I found myself caring about the characters kept me hooked on the film right from the beginning. I can't recommend this film enough if you like a good hard film, well constructed with plenty of nostalgia thrown in.","user":"collioure_bee","rank":[27,34]},{"title":"Gripping drama with depth and integrity","rating":10,"date":"3 September 2008","review":"I really loved this film and I wasn't expecting to! I usually go to the cinema to watch romantic comedies, however I went as my friend had been an investor on the film and had been raving about it for months.<br><br>From the start I was drawn in. I found myself really involved in the characters lives and I really cared what happened to them. With each twist and turn of the plot I became more and more involved.<br><br>There were violent moments, which are to be expected with a movie about bouncers, however I felt that they were well done. They were very realistic and really added to the intensity of the plot.<br><br>All that I can say is that it is wonderful to see British cinema shining again. This is the type of film that the UK should be making - as it is what it is so good at. A film with a strong plot, engaging characters and a unique gritty style.<br><br>I will certainly recommend this film to others when it is on general release.","user":"livingjoy","rank":[22,31]}]