[{"title":"The Stepfather: Sub-par remake","rating":5,"date":"28 November 2017","review":"Of all the films to remake The Stepfather (1987) starring the excellent Terry O'Quinn seems like a really peculiar choice.<br><br>I personally enjoyed the original and to an extent its two sequels but went into this assuming the worst. I felt like it would miss the point of the original and overly gloss it with Hollywood sparkle.<br><br>Well, it's somewhere inbetween. The Stepfather is a bigger budget version of essentially the same tale, but simply not done as well. So it looks all pretty pretty but doesn't have the same impact that Terry O'Quinn provided.<br><br>As a thriller this is passable, just try to forget that its a remake and don't compare it to the superior original.<br><br>Dylan Walsh is okay in the role and the film also includes a young Amber Heard on the upswing of her career.<br><br>Watchable stuff, but it simply didn't need making.<br><br>The Good: <br><br>Surprisingly excellent soundtrack <br><br>Passable performances <br><br>The Bad: <br><br>The whole thing feels so unnecessary <br><br>Not as good as the original<br><br>Things I Learnt From This Movie: <br><br>We shouldn't live in a world where we need to background check potential partners, but we probably should","user":"Platypuschow","rank":[14,15]},{"title":"Not a great film but I kinda sorta enjoyed it =)","rating":6,"date":"8 April 2010","review":"I have a strict policy that states movies featuring either (a) a cat suddenly jumping out from a corner accompanied by an ominous sounding music chord or (b) a mirror that is empty of anyone but one character who turns away, then turns back and suddenly sees the killer in the mirror behind them...well these movies are only going to be so good. This movie has both, within about 60 seconds of each other. In spite of this, I have to say it's really not all that bad. I've seen many people complaining about the lack of originality, but when you're remaking a horror film from the 80's, it's almost inevitable that you're going to give the audience something they've seen before. That wasn't really bothersome to me though because the characters and anticipation overshadowed it for the most part.<br><br>Dylan Walsh plays the stepfather in a role that was actually likable for the first part of the film. He meets a single mom played by Sela Ward and all is picture perfect until her bad boy son comes home from military school. We only know he's bad by the way because someone tells us. He's a pretty normal, well adjusted kid considering that his dad is no longer around and his mother has engaged herself to a stranger in the span of 6 months. Far as I could tell, his behavior is still within normal range. It might have made for a more interesting film though if he really was a wild child.<br><br>So past that everyone knows what follows with the story. There is not a lot of gratuitous violence; even the killing scenes are low key which I don't really mind. If anyone is looking for lots of gore and clever death shots, this is not the film for them. The excitement is in the buildup, the experience of the characters finding out for themselves who the stepfather really is; especially when you have the one obligatory character, in this case the wayward son, who seems to intuit everything about the man from the first time he sets eyes on him. That standard plot device, a character who has it all figured out and NO ONE will believe him, well it's beyond old but it's moderately effective here.<br><br>The mindless and unnecessary adolescent dialogue, together with the many gratuitous bikini shots of the son's pale and too skinny girlfriend, tend to bring the quality of the film down. They were neither necessary nor helpful. But if you can look past that and the lack of originality (is it fair to expect that in this film really?) then you'll find an adequate film that's worth a couple hours of your time. I've seen much worse in the horror/thrillers in the past few years.<br><br>6/10","user":"IheartCali5882","rank":[16,19]},{"title":"Doesn't have the subtlety of the original but still an enjoyable remake","rating":10,"date":"10 January 2010","review":"\"The Stepfather\" is a remake of the 1987 cult classic by the same name staring Terry O'Quinn. The story begins with Michael Harding (Penn Badgley) returning home from military school to find his mother (Sela Ward) happily in love and living with her new boyfriend, David (Dylan Walsh). As the two men get to know each other, Michael becomes more and more suspicious of the man who is always there with a helpful hand. Is he really who he says he is or could David be hiding a dark side ? Along with his girlfriend Kelly (Amber Heard), his father Jay (Jon Tenney), and Susan's friends (Paige Turco and Sherry Stringfield), they slowly start to piece together the mystery of the man who is set to become his stepfather, but they may be too late in getting to the truth... In the last decade we've witnessed a lot of remakes and spin offs, most of them unnecessary, and that's the case with this film. And the reason why it is unnecessary, is because it doesn't add anything to the original besides a groovy soundtrack. The film doesn't really have a voice of its own, instead it's almost a play by play remake with a few differences to make it up to date. Despite being unnecessary, this remake is still quite enjoyable, however, it doesn't have the subtlety of the original and also Terry O'Quinn was much better as a protagonist then Dylan Walsh. O'Quinn had more charisma and delivered his lines with much more impact. And then there's a few things that drag the film down, like the sexualization of Amber Heard ( numerous shots of the young actress in her bikini and underwear, which I wouldn't mind, had it been done more tastefully instead of being a deliberate attempt to please the male audience), plus the poorly done makeovers of David and the lesbian subplot which made absolute no sense to me and seemed out of place. Despite all this, The Stepfather is still a nice little thriller and quite enjoyable, just know that the original is far better.<br><br>6/10","user":"imdbbl","rank":[46,62]}]