[{"title":"Not nice....","rating":4,"date":"21 April 2019","review":"....or very interesting. Yeah, they changed up a few things. But the joy of the novel and the original movie was that the resurrected child in question was a toddler. His death was all the more tragic by this fact. And when he comes back as a murderous imp, it is all most chilling because of how he just wanted \"to play with you\". The tweenage girl's post-mortem descent was so fast that it wasn't rewarding or fun.<br><br>Of course the new ending implies that the ghoulish trio (and cat) will just murder and bury new Gage in order to remake a happily now-undead family. But so what. I never really emotionally connected with this group to begin with. The father was a blank-faced dud. The mother must have been listed as generic blond actress on the casting sheet. Lithgow was the only redeemable presence. Not even the truly terrifying Zelda subplot worked this time around.<br><br>A wholly unnecessary and underdeveloped remake that should have stayed in the ground.","user":"Otkon","rank":[120,144]},{"title":"Pet Sematary","rating":7,"date":"5 February 2020","review":"A chilling supernatural thriller, Stephen King's Pet Semetary is adapted for the silver screen once again. When the Creed family moves into their new country home they discover a pet cemetery on the property, and unbeknownst to them there's an evil spirit in the woods that has designs on them. Jason Clarke leads the cast and gives a fairly solid performance. And the writers do an interesting job at making this adaption different than the 1989 version and at adding new elements. Also, the cinematography and set designs set a dark and foreboding mood. Yet the scares are rather tame, and the suspense is often undercut. Pet Semetary is creepy and is good for a few scares, but it's not as powerful or frightening as the original (or the book).","user":"MR_Heraclius","rank":[44,53]},{"title":"Sometimes dead is meh","rating":3,"date":"28 April 2019","review":"The recent success of Stephen King adaptations must have inspired the creation of this film, I have not seen the 1989 version and I have only just now started reading the book, although I had knowledge of how the book ended. I was decently excited to see this film and it had some potential, but the final product is a serviceable but mediocre horror film that entertains but doesn't truly scare. The biggest issue with the movie is it's very hesitant to commit, the novel covers some very dark themes around the inevitability of death but the film only pokes the themes with a stick. Briefly introducing them in dialogue but not doing much else with them. The movie greatly suffers from being rushed, it never really takes its time to build up to characters or scares and just rushes its way from one plot point to another without giving any of them the time they need. What we end up with is a movie with decent acting, a few decent scares, a very messy third act and a stupid ending. Overall the film is mediocre but enjoyable, if you're a fan of the genre and just want a fun time at the movies it's worth a watch but it won't be one you remember, and it definitely doesn't live up to the legacy of the book.<br><br>One other thing I'd like to touch on is the abysmal marketing, the second trailer has to be one of the worst movie trailers I've ever seen, the trailer touches on every major plotline in the movie and spoils basically everything but the ending, it even spoiled the one twist they changed from the book. If that wasn't bad enough they released a third trailer a week before the film came out, and the opening shot of the trailer had major spoilers for the movie. This kind of marketing has sadly become a common practice with a lot of films and it really needs to stop, a film sometimes gets upwards of 3 trailers before it releases, what's the point in seeing the movie if the trailer has all the best moments and ruins all the surprises?","user":"n00bMLG","rank":[146,193]}]