[{"title":"Perverted OBGYN's, White Trash Father, Latino Witch and Redneck Man-Children abound!!","rating":9,"date":"22 September 2011","review":"I was impressed with the professional look of this movie. For the indie scene these guys did it right. The acting was on par with the old indie films of the early 80s. I have to say I really enjoyed the Redneck Father, his dialogue was great. Good actor. The girls were hot and played off the coy, sexy, teen-tease part really well. The overall story line was predictable but presented in a humorous fashion that made me laugh. I especially liked the hot-blooded Latino \"den mother from Hell\" part, that was an interesting twist from your standard white trash \"den mother from Hell.\" The fact that the Fat Redneck kid is named \"Jesus\" made me smirk. There were some impressive CGI visual effect head shots at the end that really took me by surprise. I would have liked it to be just a little bit longer but I can overlook that. I thought the ending was clever and well designed, though I would have liked \"Jim\" to hook up with \"Jen\" before they knocked her off. I half expected the kid in the overalls at the end to say something like \"F-ing Pineys\" when the truck drove by but I'll take it as it is. Great indie flick, very impressed with the cinematography and the editing. Highly recommend viewing this one.","user":"dbs630-697-952794","rank":[7,10]},{"title":"Enjoyably cruddy backwoods horror trash","rating":8,"date":"6 July 2011","review":"Awkward teen Jim Cavanaugh (a likable portrayal by Adam Scarimbolo) and his friends go searching in some remote forest for Jim's long lost mother. Naturally, Jim and company run afoul of a family of murderous rednecks. Man, does this uproariously awful and idiotic turkey possess all the right wrong stuff to qualify as a real four star stinkeroonie: The hopelessly inept (mis)direction by Jeff Roenning (who also wrote the nonsensical script), a meandering narrative that plods along at a poky pace, clumsy outbursts of raw bloody violence, the hit-or-miss acting from an extremely variable cast (Greg Travis does well as Jim's evil and abusive dad Tex while Mel Gorham overacts up an atrocious storm as shrill and venomous matriarch Dolores), the shaky hand-held cinematography, no tension or creepy atmosphere to speak of, an utterly inappropriate roaring rock soundtrack, the annoying one-note characters, a hilariously sick sense of seriously perverse humor (one of the hillbilly psycho's kills someone while sporting a huge erection!), the excessively profane dialogue, and the completely ridiculous \"you gotta be kidding me!\" open-ended sequel set-up conclusion all provide a wealth of unintentional belly laughs. As an added plus, the pretty Emily Grace shows a little skin and snippets of the infamous infectiously catchy VD jingle from an old 60's PSA TV spot can be heard throughout. An absolute schlocky hoot.","user":"Woodyanders","rank":[6,9]},{"title":"Amusingly Offensive","rating":5,"date":"9 August 2015","review":"Maybe I'm feeling charitable, but I thought Mother's Day Massacre was pretty fun. Not that it's not a total mess - there are a whole bunch of plot threads and some of them intersect and some of them don't (and some that do still don't make sense) but I thought it was an amusing play on the hillbilly horror subgenre and I was able to recognize quite a few nods to other exploitation flicks. Greg Travis has a blast as Tex, father of our main character and cause of all the action that ensues. The teens are likable enough, the villains are over the top, and what it lacks in explicit gore it makes up for in perverse ideas. I can't really disagree with those who hated it, because this is only gonna work for a select few but I'd always prefer to watch an entertaining mess over a competent bore-fest.","user":"FilmFatale","rank":[4,6]}]