[{"title":"Underrated and gets an unnecessary amount of hate","rating":8,"date":"27 July 2017","review":"How does Borat have a 7.3 and this only a 5.8? Both movies follow basically the same formula: A crazy, super exaggerated walking stereotype played by Sacha Baron Cohen goes to America, getting involved in wacky antics and meeting some celebrities along the way, often in front of real unsuspecting crowds. Do people hate this movie because its the same formula again? I guess you could argue Borat is a little funnier than Bruno, but even still, its hard to get a laugh out of me and I involuntarily burst out laughing at least 15 or 20 times. Is it because of offensive, overly exaggerated gay stereotypes? I know this movie goes a bit far at points, but come on people, have a sense of humor! Pointing out Americans' ignorance of foreigners with funny accents is OK but doing the same thing with gays is too much? Sure. I often find myself rating movies lower than the average score, but this is a great movie, and I'd easily give it a 7 or 8. I honestly have no idea where the hate for this movie is coming from. Granted, its a HARD R and some of its more extreme content might be a little off putting to some, but come on people, this movie is hilarious!","user":"jonsefcik","rank":[75,81]},{"title":"Eccentrically funny","rating":9,"date":"15 November 2009","review":"As a child of the age of Aquarius, I found myself liking this movie. I thought it was completely hilarious in an unusual way. When Brüno puts himself in various situations (and some dangerous situations), and finds himself speechless; it almost makes you think that Sascha Baron Cohen couldn't possibly come up with any semblance of a clever retort. But exactly at those times is when he wows you with his virtuoso-like skill of improvisation. If I wasn't when I saw Borat, I am now completely convinced that Cohen is a genius. I highly recommend watching the DVD for its alternate, deleted, and extended scenes; and a highly pertinent interview with Brüno's unknowing agent after the fact. I highly recommend this movie, if for his skill at making a story into the various peoples he meets.","user":"bryanus","rank":[34,40]},{"title":"Too bold for uptight America","rating":9,"date":"29 February 2012","review":"Granted, the DVD I rented began to skip about halfway through the film and I didn't see the whole movie, I believe that the only reason that this movie doesn't get the same reviews as Borat is because the American audience is too uptight. Yes, the movie is gross and at times cringe-inducing. Some of the more extreme scenes could have been hampered down, but I believe at the expense of the humor. Posters say they have never met anyone like Bruno, however have they ever met anyone like Borat. Neither exist in the real world and that is why the movie works. Cohen is a brilliant improviser and always two steps ahead of his targets. Some of the pranks don't deliver, but that's okay. I admire his audacity. For all the people who say it was too gross, imagine if the film was filled with explicit heterosexual sex, I'm sure the reaction would be much different. The aversion to this movie is primarily because there is a deep seated disgust to homosexual activity within the American psyche and even the most tolerant liberal is likely to be disgusted at some point. That's okay, that is why the movie works, it asks us what it is and why we are appalled.","user":"sinkoenator","rank":[64,85]}]