[{"title":"Gritty and realistic","rating":7,"date":"19 August 2007","review":"Sugarhouse is the story of a middle class man trying to buy a firearm in the UK, and all the things that go wrong with that transaction, from the crackhead who is selling it to him, to the psychotic drug dealer who owns the gun, to the reasons he wants the gun in the first place.<br><br>This isn't a witty and convoluted Guy Ritchie gangster film, these characters are low-level criminals engaging in their day to day enterprises with the addition of a middle-class gun buyer throwing everything out of kilter.<br><br>Andy Serkis played the psychotic drug dealer with his usual flair, you could almost smell the rage he was putting off. The other actors did a fine job of representing their characters, production values were high, dialog was good.<br><br>This is an above average crime drama, with a lot of dialog and some action thrown in during the more intense moments. My American ear had some trouble with the accents, but in general it's easy to understand what's going on and why.","user":"slake09","rank":[31,37]},{"title":"Rather Good new Brit Film","rating":6,"date":"4 March 2007","review":"I got an invite to see a Preview screening of Sugarhouse Lane last Wednesday &amp; it was a well attended affair in a Hotel screening Room.<br><br>The film is set in London, but not the tourist type London you'll have seen in most British Films. Thankfully there's no shot of 'The Gherkin' building which seems to have plagued all films set in London since around 2000.<br><br>Most of the action (if thats the right word) takes place in around a derelict warehouse in/or around a Council estate. D takes Tom to this place in order to do some business but has other plans. Unfortunately this is were the films Stage origins let it down because, the film becomes wordy &amp; rather confined to this single location. The film is beautiful to look at, the DoP should be very proud of themselves. I saw the film in the company of a Film Director and that was a comment he agreed with. Look out for the final Crane shot at the end of the film which is just great..<br><br>As to the performances, there's a really great performance from Ashley Walters as D a Crack Addict/Hustler. IMHO it much more than the clichéd \"Blackman Druggie\" part British Black actors are asked to play. It's a really convincing turn as an addict up there with Willie Ross's Drunk Father in 'Rita, Sue and Bob Too' and Samuel L. Jackson's performance in 'Jungle Fever'. There's also a good performance from Andy Serkis as Hoodwink a Northern Irish hard man. Oh, look out for the girl who plays Hoodwinks girlfriend I think in the titles she's called 'Pregnant Girl'. She's in the film for no more than 5 - 6 minutes tops but there's something really striking about her. <br><br>I must admit I was expecting something different but that said, I was pleasantly surprised. The film is much better than say other films set in London with Urban theme's like 'Breaking and Entering'. A film well worth having a look at when or if it gets a UK Theatrical release.","user":"BlackNarcissus","rank":[31,39]},{"title":"Coulda","rating":5,"date":"15 February 2008","review":"So, so tempting to paraphrase the legendary two-word review of Spinal Tap's \"Shark Sandwich\" here, but such an arch dismissal does something of a disservice to what could have been a strong, idiosyncratic movie. <br><br>Anyway, this half-baked bunch of Sh*thouse is actually one of the strongest post-Lock Stock crime capers yet, which is praise so faint that these very words are vanishing from my screen as I type them. Once you put aside the fact that the film's mere existence is thoroughly depressing (at this rate, that bone-chilling term 'post-Lock Stock' is going to outlive influenza) you are free to admire its considerable directorial panache, some large stretches of very strong writing, and, most graciously, the way that it goes out of its way to discern itself from its infantile genre brethren.<br><br>It is an odd and very stagey three-hand chamber piece, featuring lead characters whose dynamic fundamentally doesn't make any sense. A sketchy, homeless crackhead (Walters, way, way OTT) lures a dead-eyed businessman (the ever tedious Steven Macintosh) to an abandoned warehouse in central London (which, rather helpfully, has running water and electricity) in order to sell him a stolen handgun. A deranged, skin-headed drug dealer (Serkis, in a performance clearly discernible from outer space) enters the mix shortly afterwards, after discovering that the weapon in question is the very same one that had been pinched from his bathroom the night before.<br><br>After a gripping opening, this very early instant is precisely where logic runs and hurls itself out of the nearest window. This is one of those movies that simply wouldn't exist without its main character's constantly inane and illogical behaviour. The calamitous trio's entire encounter is one gigantic assemblage of excellent reasons for each of them to leave the warehouse and never return, but none of them choose to. The tables are turned frequently but to no dramatic avail; in one scene, Walters plans to shoot Macintosh and run away with his money, and in the next he's cowering, gun in hand, in a toilet cubicle whilst Macintoff struts around on the other side of it cursing noisily. And as for the resilient, smirking bond that suddenly (and I do mean suddenly) forms between them in the finale? I've seen richer and more plausible moments of emotional heft in the Naked Gun flicks. <br><br>Although large chunks of the dialogue are authentic and peppy, playwright Dominic Leyton often tries to invoke profundity and gravitas via some very silly shortcuts. The most extraordinary example of this involves Walters having a very brief, tearful rant about the intricacies of the British class system, which manages to single-handedly convince our businessmen friend not to buy the gun from him at all. Why? Because guns is bad, blud. Its a scene so misjudged and absurd that you can't help feeling terribly sorry for the actors, who all rather admirably treat the material like Chekov. <br><br>These characters are all utterly shameless archetypes (Serkis is a volatile psychopath that dotes on his family; Macintosh the privileged white wimp, in over his head; and Walters' brash demeanor masks, quelle surprise, a heart of purest gold) but the whole notion of having actual characters in a film of this type, routine or not, is something of a novelty. <br><br>So yes, this is basically yet another shallow, stupid mockney slap 'em up. But despite the relentless implausibility of it all, if it had just relinquished the pretentious and simplistic posturing, it'd be easily recommendable to fans of this sort of thing as a lazy Sunday afternoon rental.<br><br>It is, at least, stylish and occasionally interesting.","user":"DelBongo","rank":[13,15]}]