[{"title":"A plea for understanding of a mysterious condition","rating":9,"date":"16 March 2008","review":"It's a pity this film will not be more widely seen. It is an authentic demonstration of what it's like to live with one of the most enigmatic of mental disorders, autism, which afflicts about one person in 1000 (the more common and milder Asperger's syndrome affects about 6 in every thousand). Elissa Down, the maker of the film, has personal experience – two of her brothers are autistic – and with the aid of some truly accomplished acting she avoids cheap dramatics and conveys some genuine feeling.<br><br>The family portrayed has its eccentricities but you could not describe it as dysfunctional. Dad (Eric Thompson) and Mum (Tony Collette) not only have a strong love for their autistic teenager Charlie (Luke Ford) but they have learned to cope with his behaviour. The dramatic tension comes from younger brother Thomas (Rhys Wakefield) who loves the brother he has grown up with but finds the effect Charlie's' behaviour has on other people hard to take. Charlie has a few less than endearing habits like throwing tantrums at supermarket checkouts and bursting into other people's houses to use their toilet. The general adolescent horror of people who are different doesn't help much either – having a \"spastic\" as a brother is not good for the image. Yet Thomas's developing relationship with neighbour and fellow lifesaving squad member Jackie (Gemma Ward) gets a positive push from his situation.<br><br>As director, Elissa Down has a nice light touch, and the prejudice and distaste the family have to deal with are neatly sketched in. There are plenty of amusing moments; when a fight breaks out in a bus queue outside a high school several male teachers try ineffectually to stop it and it is the tiny but determined female lifesaving coach who, furiously blowing her whistle, restores order. Tough army NCO Dad holds conversations with his teddy bear and the two brothers wind up on stage together as dancing monkeys after Charlie's original partner throws a tantrum.<br><br>It has been suggested that autism, which has a strong genetic component, is a variation on normal rather than a defect, but its severely disabling nature means it has to be regarded as a malfunction. Autistic savants with freakish mathematic powers a la \"Rainman\" are extremely rare. People with mild forms of autism can function quite well in society, but Charlie is not one of those and will require care for the rest of his life. All this film is asking is for a little understanding of the pressures on families who have to support people like Charlie. I wish one of the commercial channels would show this in prime time instead of the usual reality show crap.","user":"Philby-3","rank":[64,73]},{"title":"Sterling","rating":10,"date":"10 March 2008","review":"Thomas (Rhys Wakefield) has just started at a new high school. His father serves in the armed forces and the family has to relocate regularly. His brother Charlie (Luke Ford) has severe Autism and Attention Deficit Disorder. He's not able to speak and because he's the size of an adult, caring for him is not easy. At the start of the film we see him grunt with delight as he tramples a newly-bought carton of eggs into the kitchen floor.<br><br>While Thomas's mother (Toni Collette) has accepted her son's condition, Thomas has not. He wants to keep his brother a secret from his new schoolmates but when one student (Gemma Ward) learns of his sibling, she's not put off.<br><br>It's been a number of years since I've connected with an Australian film to the extent that I did with THE BLACK BALLOON. From the interesting title sequence at the start, we're drawn into the challenges of life with a family member suffering a developmental disability. While, I suppose, an outsider could never fully appreciate just how demanding such a life could be, the film gives us a very good idea.<br><br>One of the film's many accomplishments is its successful blend of drama and comedy. It could quite easily have been a depressing affair but many of the brother's outrageous acts prove most amusing. On other occasions, they're heartbreaking.<br><br>Equally fine is the performance by Luke Ford. Playing a handicapped character is a challenge for any actor, but Ford is totally convincing as Charlie. Never do we consider he's an actor playing a role. <br><br>Toni Collette is first-rate as the ever-loving mother. She's heavily pregnant and when complications arise from her pregnancy, we can't help but wonder if the third child will be like Thomas or Charlie.<br><br>The most likable of the characters is Thomas's classmate and later girlfriend, Jackie, played by Gemma Ward. Her acceptance of Charlie and her solid support for Thomas makes her most appealing. It's interesting to note that while Thomas sees Charlie as a burden, his formal introduction to Jackie and the development of their relationship has much to do with his brother.<br><br>THE BLACK BALLOON is the work of first-time director Elissa Down, who studied film-making in Perth. She has done a sterling job. Having grown up with two Autistic brothers, it must be a profoundly personal work. The screenplay, by Down and Jimmy the Exploder, is honest and moving and the photography by Denson Baker is fine. I particularly appreciated his low- angle wide shots.<br><br>THE BLACK BALLOON won the Crystal Bear at this year's Berlin Film Festival. It's an important film and deserves to be seen. The Australian Film Industry, sadly, does not have a good reputation, at home or overseas. But if we make films like this one, that's sure to change.","user":"Burdrew","rank":[49,56]},{"title":"Realistic and heartwarming","rating":10,"date":"7 March 2008","review":"I saw 'The Black Balloon' last night as a charity event for our local disability services. All who attending the movie premier were people who live and breath disabilities. There were teachers from special schools, carers and parents of disabled children. I am a parent of an autistic boy and employed to work with special needs children, I found this movie to be funny, heart warming and realistic to memories of my own child. The movie is based on the everyday effects of living with a disabled sibling which I'm sure many siblings will relate to (I know my older girls will). The amount of attention given to Charlie is felt by Thomas and the enormous responsibility of caring for a disabled sibling at the age of 16 years was heartbreaking for him. I gave this movie a 10/10 because I felt the movie portrayed exactly how life is for a family with a disabled child. Luke Ford was excellent with portraying Charlie and Rhys Wakefield's exceptional representation of having to live with a disabled sibling will hopeful make the public think about the family life of a disabled child/adult before they stop and stare and whisper. Offer help and do not fear them for they are angels in disguise.","user":"deb-cartwright","rank":[53,65]}]