[{"title":"Introducing a Major Comic Talent","rating":7,"date":"12 September 2008","review":"Anna Faris makes this paper thin attempt at comedy overwhelmingly worthwhile. She is an original that reminded me of some other glories, from Carole Lombard to Goldie Hawn. Her innocence is so believable that we go with her wherever she decides to go. I wish the producers and responsible for this movie getting made had gone all the way and provided this extraordinary comic talent with a more substantial script and direction giving her the opportunity to shine even more than she shines here and here shine she does, big time. Just look at her listening, trying to make sense of what's happening around her. Deeply moving, very funny, kind of unique. I hope she soon finds her Garson Kanin and her George Cukor. I have the feeling we ain't seen nothing yet","user":"hollyfairbanks-usa","rank":[107,136]},{"title":"One-liners give this bunny bounce","rating":7,"date":"11 January 2010","review":"Brains do not need to be engaged for this movie. But it does produce a few wonderful - and hilarious - surprises that make it a very enjoyable 90 minutes.<br><br>One is Anna Farris, who does a great twist on the archetypal dizzy blonde beloved of Hollywood since time immemorial.<br><br>But the real kickers are the jarring one-liners that pepper an otherwise sweet and predictable film. Several reduced this viewer to paroxysms of laughter, tears rolling down cheeks, beverage spurting across the room.<br><br>These moments, when they arrive, are so unexpected that the effect is one of firmly-flicked kipper on unprotected jowl. And none are in the \"gross-out\" style that one might have expected in a film of this genre.<br><br>Very bunny indeed.","user":"gimpo","rank":[26,30]},{"title":"Anna Faris makes this movie watchable, likable, and enjoyable for anyone, even guys.","rating":6,"date":"22 August 2008","review":"Let me just say that I'm 19, a guy, and straight, and DAMN was I having a great time watching The House Bunny. To sum it up, THB is basically an Adam Sandler movie for girls, with Anna Faris breathing life into an otherwise flat movie with her uncanny comic ability and unbeatable charm. In short, she makes the movie watchable, and in some moments, likable and entertaining.<br><br>I see this film as one that most will easily dismiss without a second look, and I really discourage you from doing that. Anna Faris alone deserves your attention in this movie, as she is brilliant. I even heard a few people in my theater say that she could get a Golden Globe nomination for Best Actress in a Comedy. I honestly wouldn't be surprised. She's lovable, adorable, intelligently stupid, and of course, roll on the floor hilarious. She's the reason the Scary Movie series is so much 'better' than the other movies in that series (Date, Superhero, Epic Movies), and her charm and charisma carries over here.<br><br>In addition to Faris, the strength of the film is the supporting cast (except Hugh Hefner, who gets a pass for simply being Hugh Hefner). The funny thing is, most of the performers aren't even actors. I'm not going to lie and say Rumer Willis is brilliant, because she's not, but she's funny and is good looking enough to surprise us. Katharine McPhee doesn't get enough screen time, but she does do a great job with what she's given. The last of the 'non-actors' is the frontman for The All American Rejects, Tyson Ritter, who is tolerable in a bit part.<br><br>Now, unsurprisingly, the best supporters are Kat Dennings and the WONDERFUL Emma Stone (Jules from Superbad). Stone is so likable and adorable that she's the best character in the movie after Faris. Colin Hanks is...well, I for one was surprised that he did this movie, but he was an asset nonetheless.<br><br>I'll go ahead and get my complaints out now. First and foremost, whoever edited this movie is absolutely terrible. Whether it be changing hairstyles, continuity errors, or bad cuts, the editing is noticeably bad, especially towards the end. I also didn't like the direction the script took in the end, as it turned the film into a parody of itself (which was weird considering the entire film was a parody of stupid girls and stupid men), and displayed several out of character moments. The jokes were a tad lame and predictable outside of Faris's character (there was NOTHING bad about her), but it was okay. There were some smart jokes that actually took some time to get.<br><br>The final plus for this movie is that it is LOADED with cameos. Since you know who the production company is, you already know the group that will be appearing, plus a surprise appearance from 2 NFL quarterbacks (one retired QB, and one current) in the beginning. All in all, The House Bunny is surprisingly funny, all because of Anna Faris and Emma Stone, both of whom have very bright futures ahead of them. Faris is definitely one of the funniest ladies alive.","user":"The_Amazing_Spy_Rises","rank":[126,164]}]