[{"title":"007","rating":6,"date":"23 February 2020","review":"Sandwiched between the triumphant \"Return of Bond\" in Casino Royale and the fantastic Skyfall, Quantam of Solace was a step back for the franchise. Craig's Bond for once doesn't bed anyone which would have provided the only true action in the film. Ultimately forgettable.","user":"MR_Heraclius","rank":[45,50]},{"title":"We loved Moneypenny, Q and M. Why did you take it all away?","rating":1,"date":"12 November 2008","review":"I went twice to see this movie. First on the Berlin Premiere, second time a week later. Why? Well, on premiere night I had tickets in row 7, of a huge theatre. I was hugely excited to see the new Bond (as I always have been for the past 25 some years). But hey, I had to LEAVE the theatre after 15 minutes. You simply can't watch that fast edited MTV Style movie in row 7 (!). No chance, absolutely. Okay so I went again, this time a nice seat all the way at the end of the same theatre. I could endure the MTV cuts, but not the massacre the producers did to Bond. (the director can't be held responsible, since the producers chose him and not vice versa). <br><br>In 21 previous Bond films, one could really like the British super spy. His character, his smartness, some cool one liners, and yes, Ms. Broccoli, we the audience loved the gadgets. We loved Moneypenny, Q and M. Why did you take it all away? Why? We may never know...<br><br>This Bond is just another action flick with a really mediocre storyline. For heavens sake, change the characters name, and you are not in one single moment reminded of the great super spy. Why bother then? <br><br>For the action: Filming hand held and edit MTV style does not mean action automatically! The great Frankenheimer knew that, when he filmed some of the best car chases in \"Ronin\", Foster probably never saw that classic....<br><br>For a reminder, since it comes up so many times in reviews on IMDb, Bond and Borne are two completely different franchises. Borne is chasing after his history, while Bond is saving the world. Just because Borne was such a huge success, don't try imitate him. Arrgh what a terrible film, it is such a shame. Regardless of what the box office says! <br><br>P.S. and then you even dare to take away the gun barrel montage in the beginning, and no more \"Bond, James Bond. Are you people mental?","user":"AccessCardRequired","rank":[167,222]},{"title":"Poor filming, chopped up action sequences","rating":1,"date":"6 November 2008","review":"Thought this was one of the worst Bond movies ever. Nothing of the magic that made many of the other 007 movies so special was to be found here. The cutting of the film is terrible. masses of 2 second sequences thrown together - for no apparent reason. (as the movie is so boring I found myself counting \"one...two...) over and over again. If the action is poor it appears a cheap trick to try to \"create interest\" by chopping it all up and using 25 cameras to shoot that which has no interest. It just comes across as irritating and silly.<br><br>The car chase sequence in the beginning might have been good, if the filming thereof had been better. What could have been fantastic was destroyed (again) by the poor cutting of the movie. masses of sub second fractions thrown together making everyone confused as to who was being chased, who crashed etc.<br><br>The race scene in Siena was utterly stupid. The cut back and forth from the Bond action to the race action again and again was utterly unrelated and therefore pointless. <br><br>The scene in the movie were Bond discovers the underground lake and states \"he is draining all the water\" as an explanation to the central \"badness\" that the villain is about to do is utterly laughable and silly. <br><br>The end scenes with the building which is designed to explode step by step was the last straw. I have rarely seen anything more staged and unbelievable. I considered leaving a few times as the movie was so boring but then I thought that \"can it get any worse\"? and yes, it could and did.<br><br>We want James Bond 007 back again, lets pass this \"experiment\" into history and forget that it ever happened. <br><br>The previous movie Casino Royale was a good action movie, though it wasn't a Bon movie (either). The Jason Bourne formula works, but Bourne is Not Bond and this is not a Bourne movie, i don't really know how to classify other than \"utterly pointless\", I couldn't see any redeeming features, no plausbile plot, no interesting characters, no fantastic sceneries, awful title song, no \"Bond\"-ness - at all","user":"unggrabb","rank":[365,510]}]