[{"title":"Frank Lama as Detective Peters","rating":5,"date":"29 August 2007","review":"I was able to attend the premiere in Baltimore a few weeks ago. It was fun to meet some of the cast and see them milling around in the lobby after seeing them up on the big screen. What was especially cool was having a chance to talk to Frank Lama for a few minutes after the show. He was really gracious and modest about his performance in the film and even let us snap a few photos with him before jumping into a limo to attend an after party. I hope lots of people see Fear of Clowns 2 for Lama's performance, which I thought was incredible. I could definitely see him on TV or in bigger budget movies, which is not always the case with actors in low budget feature films. He played Peters with humor and intelligence -- awkwardly bumbling when he tried to make a human connection with the clown artist Lynn but cool and tough when he tangled with the clowns. Peters was a very believable and likable character, which is saying something in a movie with three killer clowns! I hope to see Lama in other films that showcase his obvious abilities.","user":"BeauJones","rank":[4,10]},{"title":"Shot on video slasher nonsense","rating":1,"date":"22 February 2018","review":"I should note at the outset of this review that I haven't seen the first film in the series, not that it matters much. FEAR OF CLOWNS 2 is another stupid horror flick about a killer who goes around murdering people while dressed as a clown. It's every bit as bad as one of those interminable CAMP BLOOD sequels. The only difference is that this film has an urban rather than woodland setting. It's just one of those amateur productions with no redeeming features.","user":"Leofwine_draca","rank":[0,0]},{"title":"Even worst than the first.","rating":1,"date":"25 August 2015","review":"Honestly...I did not like the first one either.<br><br>But it sometimes happens sequels are better than the original and thats why I decided to watch this one. While the first had some cheap scares and some good chase scenes, this one has non of that.The movie is to long and all that time is wasted on romantic development which easily fills half the film.<br><br>Few years back I searched quite some time for a good \"clown horror\" movie.Until this day \"stitches\" with Ross Noble is the best one according to me and a sequel for this would be a welcome one.Only \"Stitches\" and \"it\" bring high quality to this horror sub genre.<br><br>Point is, there is something better.<br><br>Both the \"fear of clowns\" films and \"clownstrophobia\" are about the worst you can get in this sub genre.<br><br>\"Clown\" released in 2014,I think?,showed great promise but was numbed down to much probably to reach a bigger audience,so that was really a shame. <br><br>Keeping my hopes up for a \"stitches\" trilogy.<br><br>Go Noble!","user":"djangozelf-12351","rank":[0,0]}]