[{"title":"A Journey Into Madness and Pain","rating":7,"date":"1 September 2008","review":"Nick West (Andrew Howard) brings the easy and filthy Sammy (Polly Brown) to the abandoned Blackwater Asylum for using acid and having sex. They find a weird chair and Nick proposes kinky sex to Sammy; however the device traps and kills Sammy. Nick is arrested and considered insane, being sentenced to the Hildon Mental Institute in spite of claiming that supernatural forces killed Sammy. Four years later, the honorable Cambridge professor Dr. Willard (David Gant) proposes Nick's psychiatric Dr. Clairebourne (Nadja Brand) to release him under his custody for an experimental treatment, exposing the truth to Nick bringing him back to the crime scene. Dr. Clairebourne opposes, explaining that Nick still has severe delusions, but in the end she accepts, with Dr. Willard assuming full responsibility for Nick. Dr. Willard, his assistant Melissa (Louise Griffiths) and the students Rachel Fowles (Elize du Toit) and Brett Wilson (Matt Berry) head with Nick to the Blackwater Asylum finding the dreadful truth about the devil's chair.<br><br>\"The Devil's Chair\" is an original and extremely gore horror movie that explores a dark journey into madness and pain. The story is disclosed in an environment of a nightmare and has an awesome plot point. Andrew Howard gives a magnificent performance in the role of a man considered clinically insane and delusional that believes that fights against demons and supernatural forces. The gorgeous Elize du Toit is also excellent in the role of a student that intends to help Nick and finds the truth of the devil's chair. The graphic bloodshed in the end is visually impressive and gruesome. My vote is seven.<br><br>Title (Brazil): \"A Cadeira do Diabo\" (\"The Devil's Chair\")","user":"claudio_carvalho","rank":[25,32]},{"title":"Sit on it, Mason!","rating":2,"date":"19 June 2010","review":"When Nick West (Jason Statham lookalike Andrew Howard) and his slutty girlfriend Sammy (Pollyanna Rose) decide to explore an abandoned insane asylum, they discover a bizarre looking chair and use it as a prop for a spot of acid-fuelled sex. But as the couple begin to go at it, their pleasurable experience turns into a nightmare: the chair—actually a portal to a hellish realm inhabited by a rapacious tentacled demon—traps Sammy, impales her with metal spikes and tendrils, and then whisks her body away.<br><br>Unable to adequately explain his girlfriend's disappearance, West is declared criminally insane and spends four years residing in a mental hospital, after which he is eventually released into the care of Dr. Willard (David Gant), who, along with assistant Melissa (Louise Griffiths) and psychiatry students Brett (Matt Berry) and Rachel (Elize du Toit), unwisely takes his patient back to the scene of the crime to face his demons.<br><br>According to the opening waffle from West, his story will be worth our while, but as the film ultimately reveals, he's not a man to be trusted: The Devil's Chair is a massive waste of time.<br><br>After over an hour spent building a fairly intriguing story around the premise of a supernatural chair, writer/director Adam Mason attempts to pull the rug from under the viewer's feet in the film's closing moments by revealing that virtually nothing that we have seen has actually happened, but has instead only taken place in the warped mind of Mr. West.<br><br>It's a hackneyed, over-used plot device from a director desperate to make sense of his very muddled movie; matters are made all the more irritating thanks to the smug nature of the script, which positively delights in the fact that us horror fans have once again been shafted by a film-maker with no ideas of his own (even his visual style is trite and unimaginative, with an over-use of nasty editing techniques—particularly freeze-frame).<br><br>As well as displaying utter contempt for his intended audience, Mason also fails to deliver on a more superficial level: the movie's supposedly ultra-graphic outcome is quite bereft of satisfyingly nasty gore (there's loads of blood, but the film shies away from showing us too much juicy detail); and rather inexcusably, neither busty ex-Hollyoaks babe Elize du Toit nor tasty brunette Louise Griffiths get nekkid (du Toit strips down to her bra, but reveals nothing she hadn't already shown in the Sunday morning soap).<br><br>When all is said and done, however, I should probably thank Adam Mason for making The Devil's Chair: now, rather than waste my time explaining exactly what it is that I loathe about much of today's horror output, I can simply point in the direction of this film and say 'there you go'.","user":"BA_Harrison","rank":[14,17]},{"title":"An Interesting Spin on the Classic Horror","rating":8,"date":"12 September 2007","review":"I just got back from seeing this movie at the TIFF and I will start out by saying that if you are the type of person who likes to have everything clearly spelled out for you in a movie, this film is not for you. Likewise, if you are looking for a non-stop gorefest, you are likely to be disappointed. All of that aside, I thought the movie to be very interesting and certainly worth the watch. I've never been a fan of movies with narration, but this one executes it quite nicely. The narrative dialogue is witty and often injects a bit of humor into the film. The main story follows a man (Nick) in a mental facility for the criminally insane after he and his girlfriend enter an abandoned asylum and she dies. Nick insists that she was taken by a demonic chair. 4 years later, a doctor has him released, so that Nick, the doctor and his team can explore the scene of the murder and thing quickly go down hill from there. The cinematography in this film is interesting and the sound effects give the movie a lot more edge considering the gore is minimal aside from the liberal use of blood. Overall, this movie was definitely worth watching and I look forward to its release on DVD so I can watch it again!","user":"vivisected","rank":[39,57]}]