[{"title":"Sweet Family Film, Better Than Many Theatrically Released Disney Films","rating":8,"date":"27 September 2008","review":"Saw this movie today (9/26/08) with my young nieces at a special El Capitan Theatre preview in Los Angeles. We were all delighted by Tink's excellent backstory, the ingenious story and the handsomely rendered 3-D animation. Cast is uniformly excellent, including Lucy Liu, Kristen Chenoweth and Anjelica Houston. This was much better than some of the theatrically released Disney animated films I've seen (notably \"Atlantis\"), making it among the best of the Mouse's direct-to-video titles. Well worth checking out with your kids, but don't be surprised if you find a tear in your own eye at the conclusion of this delightful surprise.","user":"brettster","rank":[53,59]},{"title":"Sweet and charming CGI Disney movie","rating":26,"date":"26 October 2008","review":"I saw this movie last Saturday when they showed it randomly on Disney Channel (in Norway) and I was pleasantly surprised. I've seen some trailers and clips from this movie and the animation looked quite good, so although my expectations weren't the highest, I still hoped that \"Tinker Bell were going to be a watchable picture - which it turned out to be.<br><br>It's a shame that this film wasn't released on theaters, cause, like Brettster said, it was much better than Disney's recently theatrical releases (\"Chicken Little\", \"The Wild\") and a whole lot better than the previous \"Peter Pan\"-cartoon, \"Return to Neverland\".<br><br>Anyway, about the movie; It is very sweet in many ways. The mood is reminiscent at the Disney features from the 90's. The animation is absolutely beautiful and detailed and the delightful score (which is sometimes Irish inspired) provides the sweet, enchanting mood of the film. The characters are cute and adorable and the moral is a good one. The movie is a film that families can safely watch together.<br><br>And then there's the songs; \"Tinker Bell\" doesn't contain many songs, which is good, cause often the songs on Disney's non-theatrical releases are quite mediocre. While the songs on \"Tinker Bell\" aren't memorable, they are not disturbing neither and are quite all right.<br><br>So do your self a favor and check out \"Tinker Bell\"","user":"StartingAllOver14","rank":[36,41]},{"title":"A very sweet and funny film","rating":9,"date":"30 January 2009","review":"I admit, I am a fan of Tinker Bell (something a 22 year old MALE wouldn't approve of, like me), and I've always wanted to see this enchanting but short film. It's magical in every way.<br><br>Tinker Bell is born as a tinker, a fairy who makes teapots out of nuts. She does not approve of this and wants to be like the other fairies that travel to the mainland. But when she tries to be something that she isn't, she creates disaster. She soon learns that being who you really are can be useful if you just believe in yourself.<br><br>What really surprised me in this film was the cast. Most of these cast members you'll already know, like Mae Whitman (best known as Katara from Avatar: The Last Airbender), America Ferra (TV's Ugly Betty), Rob Paulsen (Danny Phantom) and even Steve Valentine (TV's Crossing Jordan).<br><br>Overall, this is a very sweet and funny film that, despite its short running time, will leave its magic mark of pixie dust with you forever. It certainly did it on me! ^_^","user":"wliia","rank":[23,26]}]