[{"title":"Not only does justice to the book but takes its own sweep of originality and charm","rating":8,"date":"18 September 2009","review":"Anyone involved with the elementary school world as at least heard of the Barret classic \"Cloudy With a Chance of Meatballs.\" As a teacher, I was thrilled to learn it was to be made a movie. As usual, however, that leads to the problem of whether it would stick too much to the book to be entertaining for the screen or a Hollywood catastrophe that steals only the title?<br><br>I know it's irritating to read from those book loyalists, but it's only a fair comparison. I felt this movie found a perfect balance of big-screen awesomeness and the charm of the book.<br><br>For book enthusiasts, they pretty much had everything right. This film does indeed follow the plot of the book. Entire illustrations are recreated for the movie with stunning nods to Ron Barret's artwork. Then again, one must keep in mind that the book was an extremely general plot. The movie goes into detail, very much into detail, of what was going on in the town. <br><br>We have the classic nerd, Flint Lockwood, a lovable and goofy character who embodies the wannabe coolness and social awkwardness and desperation of every social outcast. He's almost painful to watch, but I think it's what makes him so likable--you feel sorry for him. Anywho, in a desperate attempt to prove his worth to his father, he invents a machine that turns water into food. And hence the coming of the trademark weather of Swallow Falls (later renamed to Barrets' Chewandswallow). <br><br>Honestly, I was surprised at the plot they got going out of this--while still maintaining the basics of the book. It had an ADHD spirit with wonderfully over-the-top characters. This will probably annoy many a soul, but I thought it a winning combination for those who can put up with it all. Really, you need the heart and mind of a child for this, but if you can summon those up, you will be impressed.<br><br>I saw it in the normal format, but I'm sure it was an intense hoot in 3D. That might have been a bit much for me, but I'm sure the kids loved food flying at them. Regardless, the animation was stunning, combining a tribute to Ron Barret's amazing illustrations in background with pleasantly cartoony characters. <br><br>This was much better than expected. It was creative, extremely fun, and paid reference to everything from \"Independence Day\" to \"The Twilight Zone\". You may need the heart and mind of a child for this, but if you can summon those up, you will be impressed.","user":"timeaftrtime","rank":[106,127]},{"title":"Surprisingly imaginative, original and very funny","rating":8,"date":"22 September 2009","review":"Living in the UK, I had never heard of the children's book Cloudy with a Chance of Meatballs and to be honest, I thought it sounded a little too peculiar and odd for my tastes going by the title and trailers. However, being a big fan of animated movies, I decided to take the risk and judge the movie for myself; and I'm so glad I did.<br><br>Not only does Cloudy with a Chance of Meatballs have a quirky, thoughtful and imaginative storyline, it also exudes humour through its likable characters, discerning messages and vivid visual style. Telling the tale of a young man's quest to become an inventor, the film shies away from numerous Disney clichés creating a unique and original world full of colour and inspired characters. Unlike most Dreamworks animations, the characters are fully developed and rounded without the need for countless A-list celebrity voice-overs. The screenplay is similarly outstanding in terms of humour with countless laugh-out-loud moments that will appeal to both adults and children alike.<br><br>The animation and visual style of the film isn't up to the stunning beauty of the latest Pixar movies such as Ratatouille or WALL-E but it certainly exudes a similar level of ingeniousness, creativity and originality as seen in such movies. Albeit, amongst the wild plot and genuinely hilarious dialogue lies a subtle moral tale of parental recognition, portion sizes and personal confidence.<br><br>Cloudy with a Chance of Meatballs took me by surprise, I went into the cinema expecting an average computer generated movie incomparable with today's best of the genre and came out astonished by the sheer creativity oozing from every aspect of the film.<br><br>8/10.","user":"Magic_Lantern","rank":[120,145]},{"title":"Sublimely Ridiculous","rating":8,"date":"22 September 2009","review":"From the title through every character right to the end this film is a roller-coaster ride of absolutely ridiculous fun that will have kids and adults alike doubled over with laughter. I personally nearly choked from laughing so hard at one particular point.<br><br>What makes this movie so great is the characters...you can't go wrong with Bill Hader ever and Anna Faris I wouldn't be a fan of at all but she is cast completely out of character here and you would never guess it is her. The real entertainment lies in the support cast though. James Caan is outstanding as the father and Mr. T as the loving father and over enthusiastic local cop will have you in tears. Benjamin Bratt and Neil Patrick Harris didn't have much work to do with their characters but even with so few lines they are stars, particularly Steve the 'talking' monkey. There was one bit character that I found highly entertaining who had the best line in the whole thing when referring to hamburgers as tasting \"significantly better than sardines\".<br><br>I would consider myself a bit of a movie buff and my leaning is very much toward the art-house. On a recent Saturday afternoon, I choose to take a risk and cross the sticky floor, trying to avoid stepping on one of the many screaming kids running around, my heart beating fast and hard with nervousness and anxiety that maybe this was a mistake. When the time came I casually donned my 3D glasses and 90minutes later with a pain in my side I wanted to go again... It's been an long time since that has happened!","user":"tkeane-1","rank":[63,87]}]