[{"title":"What I learned from watching this movie","rating":5,"date":"19 December 2006","review":"1. Sorority girls like high school guys 2. Girls are willing to show their tits on command 3. Eugene Levy has a lot of depth as an actor 4. Lingerie/underwear parties are very common 5. You can drink where ever you want on a college campus 6. People find it hilarious when you walk around a party erect and even drinking games take place because of ityou become the life of the party 7. The continuing development of the pool table to lose your virginity shows the lack of talent by the writers 8. Girls love virgins and inexperienced guys 9. When guys climax they kill grandparents<br><br>Overall, this movie has some entertaining qualities, and if you are a male, you will enjoy the massive amounts of frontal nudity.","user":"kovalchukyou","rank":[92,121]},{"title":"not that good","rating":5,"date":"25 October 2009","review":"Before I saw this movie I expected to see the story about another popular adolescent who is the leader of the group and is admired by everyone... but it was more than what I thought. It's about a boy like you or your best friend or neighbor: Erik Stifler.<br><br>Erik is forced by his friends to do what all Stifler's men do: being a winner and getting laid. His girlfriend acts like a total bi*ch and refuses to have sex with him so then she gives him a pass to do whatever he wants for a weekend at a \"Naked Mile\". This movie isn't funny at all, more romance.<br><br>The characters are pretty likable but its not as great as the first three American Pie movies. This one simply doesn't have tat same spark as the others.","user":"Floated2","rank":[7,7]},{"title":"Boring, predictable, lots of breasts","rating":6,"date":"26 July 2008","review":"The title says it all. I need to really screw my brain to fill the required 10 lines. The actors are completely unknown, the script is not that complex and it's rather bad. The mandatory opposition to the \"team cool\" is a bunch of evil midgets that somehow are better at American football and getting girls.<br><br>Storyline: virgin couple in high school are forced by peer pressure to go have sex with other people. It doesn't work and they get finally reunited. In the meantime a lot of teenage party and a bunch of people running naked for a mile.<br><br>Bottom line: uninteresting, badly played, nice girls.","user":"siderite","rank":[20,28]}]