[{"title":"It works because it's fun","rating":8,"date":"19 October 2014","review":"You will laugh, be entertained and enjoy as a child with this movie. It's one of the better live action adaptations that I've ever seen. It doesn't concern itself with slavishly following the original manga and isn't afraid to make radical changes or new additions to serve the strengths of the film medium. So, you don't have to read the manga or watched the anime to understand what's going in this movie.<br><br>The manga styles and movie styles fit the genre perfectly without downplaying either medium, mostly for two principal reasons: a great visual and a great cast. <br><br>Shun Oguri is perfectly cast as Lupin and Tadanobu Asano seems the best Zenigata ever.<br><br>Beside the script is based on a series of clichés thousand times played in other films it works because it's fun.","user":"graybarrygray","rank":[47,55]},{"title":"Excellent live action adaptation of an anime","rating":9,"date":"23 September 2014","review":"I really enjoyed this film. <br><br>I've seen the anime a few times, but I could never get into it. The film leads someone with no experience carefully into their world while (according to my friends who've seen it) pay a nod in all the right places to the original work.<br><br>I can see where a non-Japanese audience is going to have problems with the film:<br><br>How do you shoot a film with an international cast which live in a world where Japanese is the lingua franca? You dub it. I came close to leaving the theater to tell the staff the tracking was off but it quickly became obvious what they were doing. Honestly, it could be distracting but if you think about it, every animation works on the same principle. <br><br>(One benefit to the dubbing is that they could use actors with animation quality voices to fill the voice roles for many of the actors, or allow the principals to animate their voices in a way that would look unnatural in real life.)<br><br>Also, they shot the film in HDR (high dynamic range) which really animated the facial expressions and heighten the the boundary between real and imagined scenery -- a huge plus in this kind of film, and especially beautiful to watch on the big screen.<br><br>Oguri Shun's performance was top notch. He nailed the role. The other characters hit their character's tone, too. And when you see the situation the characters will find themselves in, you'll see they are not played as one dimensionally as the typical anime/cartoon to live action film. Their situations are complex and multifaceted. <br><br>I recommend this film. It's entertaining, beautiful to watch, presents the genre in a new way, and gives you a dose of Japanese-isms.","user":"cteavin-1","rank":[51,62]},{"title":"Very entertaining and it's kid friendly","rating":10,"date":"15 September 2014","review":"I really enjoyed watching this movie, I found it very entertaining and exciting and I even noticed the mix of the Asian cultures and the usage of different languages. It shows on all the action and fight scenes, there are also a lot of cameo clips from the original anime which is very good. The reason why I really enjoyed watching this movie because it made me feel like Im watching a cartoon with live actors playing the roles. I just have a slight concern with the use of language on some scenes, i noticed some parts where the inspector was talking in Japanese with the HK police, that part is a bit inconsistent for me, but the delivery of the actors were really good. Lupin the 3rd has a great costume designer, since everything is very accurate with the anime, but even so, it was converted into what you can actually wear in real life. I found Jigen's costume particularly nice, because of his bad-ass approach and how he carries himself. Its textbook perfection.","user":"ivan-co","rank":[11,16]}]