[{"title":"Surprise Solid Comedy","rating":9,"date":"19 March 2008","review":"I often go see advance screenings in my area, especially now that I must officially be on \"the list\" as I am constantly finding tickets in my work inbox. This was the second Apatow production I've seen in advance and just like \"Superbad\", this did not disappoint. At the same time, while many of the cast members may be recognizable, there seems to be something different about this installment than I've seen in the likes of \"40 Year Old Virgin\", \"Superbad\", or \"Knocked Up\".<br><br>For starters, there was a definite presence of the \"TV actors on the big screen\" theme here, but I am pleased to report that Jason Segel, Kristen Bell, and Mila Kunis take to movies like naturals. Like many Apatow productions, Segel penned the script and takes over as lead Peter Bretter, proving yet again that with this crew the writer is best suited for the leading role. Segel delivers a character we all know too well from our own personal experiences and never breaks role from the shocking beginning to appropriate ending. I even give Segel extra credit for not completely victimizing his character and pointing out apparent flaws on both ends of the ending relationship.<br><br>Kristen Bell plays Sarah Marshall, the iconic ex of the film, but her role sits on the back burner along with the truly hilarious Aldous Snow (Russell Brand) to make way for a leading role in Mila Kunis. From the beginning it is clear that her not-too-smart and shallow role of \"That 70s Show\" didn't follow her to \"Forgetting\"'s script. Kunis plays Racheal, a hospitality girl for the hotel that \"Forgetting\" takes place, and subsequently deals with Peter as he tries to get over Sarah Marshall. Her character is intelligent, charismatic, and appreciative of the good in people, a strong juxtaposition to the seemingly selfish starlet Sarah Marshall. Kunis owns the role with pride, even slipping in gestures and glances that didn't seem to initially be in the script. Hopefully this will open her up for more serious roles than \"American Psycho 2\" and the typecasting that often happens with TV actresses like her.<br><br>The star of the film, in my opinion, easily has to be Russell Brand, who plays the over-conscious over-sexed rock star Aldous Snow. Snow adds the necessary level of comedy that could have been missing from what is truly a tragic plot. About halfway in the film, I couldn't help but snicker to myself just with the presence that Brand creates (complete with perfect costume choices). The only downfall to a character who is truly the Mercutio of this tragedy is that Brand clearly overshadows Bell's performance as Sarah Marshall, who is ironically the most forgettable character of the film.<br><br>The writing flows with well-timed jokes, apathetic digs, and shocking vulgar humor. There is even a few moments where you feel Segel was digging on the cast with jokes involving crime dramas (Segel did time on \"CSI\") and TV actresses in horrible horror movies (Kunis did the atrocious \"American Psycho 2\"); not sure if it was intentional, but I caught what I thought was a reference. Just as with most Apatow productions, leave the kids at home. Unlike the rest, however, the crude humor doesn't overflow and turn off most audiences (like I noticed with \"Superbad\"). It also doesn't get very heavy in the least (which is what I felt hurt \"Knocked Up\"). I think Apatow has found a great balance with this production and Segel's script. I also want to give credit to Nicholas Stoller , who proved that he can be successful as a director after the hit he took from helping write \"Fun with Dick and Jane\".<br><br>All in all, this comedy is just another example of a good time for adults. It keeps a consistently flowing script, unlike many recent comedies that seem to lose pace as they close the story. While crude, the jokes are just light enough to appease most adult audiences and the short 100 minute run time will ensure you won't be glancing at your watch waiting for it to end, just laughing hysterically.","user":"unscripted1","rank":[254,368]},{"title":"Funny and sweet without seeming too formulaic","rating":8,"date":"13 November 2008","review":"Forgetting Sarah Marshall - A slacker composer Peter (Jason Segel from \"Knocked Up\") has a breakdown after his girlfriend Sarah (Kristen Bell of \"Heroes\"), the star of a hit TV show, dumps him for a British pop star. Peter goes to Hawaii to try and forget about Sarah, which proves to be a poor choice when he finds Sarah is not only in Hawaii, but they are staying at the same hotel. Paul Rudd, Bill Hader, Jonah Hill and Mila Kunis co-star.<br><br>This was a funny movie! It's a more mature than your average comedy. It survives comedically without leeching off too many other bits of pop culture, unlike Knocked Up. There is the exception of some funny spoofs of CSI and Ghost Whisperer, two fatted calfs rip for killing. Everyone is allowed to be funny, even the women, and they are. I enjoyed the occasional \"Scrubs\" style cut-aways which were frequently funny. The best one has to be the week Peter spent in the same pair of sweat pants.<br><br>This was a lucky stroke from from first time director Nicholas Stoller and first time writer (in addition to lead actor) Jason Segel. I hate making comparisons to other actors, but I kept thinking of Judge Reinhold when I saw Segel. Not that that's a strike against him.<br><br>Segel is a fresh face in the comedy genre, and is adept at playing sympathetic slacker and funny man in one. Kirsten Bell acts much better in this than Heroes, and it's a nice change of pace to not recognize Paul Rudd in appearance and character immediately. Bill Hader is funny as always. What really comes across in this film is that everyone, even Sarah Marshall, seems like a 3-dimensional character. Hopefully the days in comedies when people are bitchy or vile just for the hell of it are gone. Even the shallow pop star Aldous Snow (Russell Brand), who is the rival to Peter, is likable. There's no animosity between the two men. It's nice to have a comedy where we don't have to demonize anyone.<br><br>It's a cute film, sometimes hilarious, but the first half is definitely funnier than the second half. I might pick it up on DVD sometime.<br><br>B+","user":"joestank15","rank":[61,87]},{"title":"A miraculous movie!","rating":16,"date":"16 January 2009","review":"I normally do not go out for sappy, romantic roller coaster romantic fare; and Forgetting Sarah Marshall (FSM) pretty much falls under the romantic \"date flick\" rubric.<br><br>And I can't, for the life of me, quite figure out why I liked this so much. I guess the filmmakers succeed in making the welter of comic bits, scenes, and images come across like genuine romantic sweet chaos. How they succeeded is beyond my comprehension.<br><br>And maybe that's the point. Some films are good, some are bad, and some are sort of like miracles. Their power is inexplicable; and that's how FSM felt to me.<br><br>It was boffo, a bit over-the-top, a tad muddled, a mix of character study, revelation, and farce. And, as things unfolded, by dint of pacing and sheer comic/character acting power, I came to really care about the characters; and I loved it! I glowed through most of FSM.<br><br>Here's a way of looking at it: FSM was sort of like Shakespearean romantic farce. Maybe that explains why I liked it; because my mind already has a little engine for processing this kind of narrative stuff, built up from past experiences watching Shakespeare In The Park!<br><br>It also comes down to artistic sincerity. Most romance flicks are a little insulting because they're not sincere. There was something, in the end, believable and therefore redeeming about the characters and their silly little Hawaiian comedy of errors and feints.<br><br>And that's a miracle, in my book! This is not an ordinary date flick.","user":"rzajac","rank":[68,102]}]