[{"title":"Underrated Animation","rating":8,"date":"10 December 2010","review":"On the day that Shrek rescued the cursed Princess Fiona from the tower where she was kept prisoner of the dragon, her parents King Harold and the Queen were ready to sign a contract with the cunning Rumpelstiltskin delivering the kingdom Far Far Away to him. On the present days, Shrek feels bored with Fiona, his family and friends and near a breakdown, and he misses the years when he was a terrifying ogre. Rumpelstiltskin overhears a discussion between Shrek and Fiona and meets Shrek, offering a deal to make he feels a frightening ogre again. In return, Shrek should deliver one day of his childhood to Rumpelstiltskin. Shrek is lured and Far Far Away is distorted under the reign of the tricky Rumpelstiltskin. Now Shrek misses his family and friends and has to win Fiona's heart again to save Far Far Away, his friends and himself. <br><br>I have just watched \"Shrek Forever After\" and my expectations were very low, based on the IMDb user's rating and a couple of reviews that I had glanced. However I liked this underrated animation a lot, which has a good story with many hilarious moments. Once again, Donkey \"steals the movie\" and this character has been for years the best role of the wasted Eddy Murphy. My vote is eight.<br><br>Title (Brazil): \"Shrek para Sempre\" (\"Shrek Forever After\")","user":"claudio_carvalho","rank":[54,62]},{"title":"Best Shrek Forever","rating":10,"date":"5 April 2018","review":"Best Shrek. It is a special movie, one of the best movies of all-time. It is a masterpiece on par with the mona lisa. What is so masterful about Shrek is its ambiguity. We never are certain if Shrek really did believe in the values that he professed. At the same time that he sets himself up as above the world, he longs for the affection of the common people. This is symbolized by his exploitative, and patronizing love for a chorus girl, Fiona. Her character is given a paper-thin characterization, the closest thing to a flaw in a perfect movie. Despite the film's pessimistic outlook, it is studded by moments of joy, beauty and emotional truth. The supporting cast of characters, most of them regulars from Wells' Mercury Theater are also superb. So many scenes in this movie linger forever in the memory, one is left with a stirring vision of the frailty of the human condition, the film gives us no easy answers and while being fiercely critical of many of it's characters is universal in it's compassion and sympathy, this is perhaps the most vital ingredient for great art. It's influence, was immediate, incalculable and mostly unacknowledged, the film was a box office and critical failure due to Hearst's efforts and it was not until years later that this film got the respect it deserved. Nowadays there is not one living film director of serious artistic intent that has not been deeply influenced by Shrek 4ever after. It's not just a masterpiece it's a creative touchstone.","user":"shrekever","rank":[87,105]},{"title":"Much better than \"Shrek the Third\" and is a surprisingly good film","rating":8,"date":"29 June 2010","review":"\"Shrek Forever After\" is a surprisingly good film. Though it is not as great as \"Shrek\" or \"Shrek 2\" it is a HUGE improvement over \"Shrek the Third.\" The movie helped the franchise gain some of its heart back that was lacking in the third film and had some terrific action scenes. The first time I saw it I didn't think it was very funny, but when I went back to see it a second time I was laughing plenty of times. The film also teaches an important lesson that if you have a good life you should not give it up for anything. If Shrek had never met Fiona or any of his friends they all would have had rough lives. Overall, the movie is a great conclusion to the film series.","user":"abrady8103","rank":[18,20]}]