[{"title":"What Time Is It? Time To Cash In! (and why HSM does exactly that)","rating":9,"date":"14 August 2007","review":"I've finally found out the reason why the High School Musical phenomenon is such a success. Why the first movie's soundtrack was the top-selling CD of last year. Why there are ice shows, stage productions (amateur and pro), karaoke CDs, and karaoke DVDs to boot. It all traces back to the 90s.<br><br>You see, the 1990s gave birth to NSync, Backstreet Boys, the Spice Girls, Britney, Christina, Jessica, what have you. But their time wasn't meant for the 90s. They had come too early. Music honestly wasn't ready to cycle back to the confectionery, syrupy, Velveeta meets cotton candy of the late 50s/ early 60s. But now is the time.<br><br>The reason that High School Musical, and now Part 2, are such a success is because 1990'S POP MUSIC IS BACK WITH A VENGEANCE!!! High School Musical was the Reset Button, if you will, setting kidz-bop-pop back in its rightful place. Adults have their music, their innuendos, their profane-angry-paranoid-hurtfully honest songs. Why not give the kids a break? A place to be a kid? <br><br>The sequel does a great job of avoiding the urge to fix what's unbroken, but instead to polish it. This film isn't darker, but it is spunkier. More attitude, and even more confidence (if that's hard to imagine). This film is strictly for A) kids, and B) people who not only remember but enjoyed being kids. High School Musical 2 is a burst of joyful exuberance. Winks towards adult audiences have their place, but so do productions where a kid isn't talked down to or expected to grow up too fast.<br><br>The straight-up theater pop of the first has been replaced with more of a Hip-Hop/ Arena Pop edge. Less Broadway, more Billboard. Plus, the mythological task of defeating high school cliques has been replaced with simply earning a check for the summer. The movie wants to feel bigger than the last, but it's actually more intimate. That's an unintended plus.<br><br>The cast goes through some drama this time around, and some changes are made, character-wise. This was the biggest surprise. Disney Channel could have simply done a rehash of the first film, but everyone involved truly did a great job. I forgot that, as corny as the premise - the whole franchise - is, these guys can really act. And sing. And dance. No wonder Disney gonna's make a fortune.<br><br>And no wonder musical theater is so rough. Every single participant has to be a Triple Threat. But that's part of the fantasy of the first film: making the audition, giving it your all, and gaining the applause and support of your peers. What's great about this second movie is, really it's about the reverse of that. LOSING the support of your peers. Losing yourself in search of something you don't really need, not yet anyway. It's a good message: The future will come soon enough. Enjoy being a kid and being with the ones who love you while you still can.<br><br>Still, if this second movie doesn't match up to the first, it's because of moving it away from the dream of Triple Talent Status. No longer a musical about a musical, it instead becomes a musical about a country club. Instead of risking social status to be yourself, to find yourself, it is now about the dangers of losing yourself, by giving into social status. More dramatic, sure. A stroke of genius, I would say, except for the fact that it's still a freakin' High School Musical movie, not a Country Club Musical movie.<br><br>By moving into more complex territory, it grows up. But by default, it is less fun, just a smidgen less, than the original. To its credit, it isn't stale (the new setting keeps it fresh), but Disney Channel, Ortega, and all company involved will be hard pressed to create a three-quel that's just as fun, lively and CHOCK FULL OF 90'S POP as the original. A return to the theater would be welcome.<br><br>As for the songs themselves, let's just say I've been fair enough to comment that I enjoyed the MOVIE for what it was. Disney's been great at soundtracks but they'll have to do a lot better for part 3. Aside from the opener and a baseball game/swing number, there's not much to enjoy this time around, once again due in part to the removal of the high school locale.<br><br>The kids will LOVE IT, the parents will Tolerate it, Disney Channel will collect money hand over fist, and everyone else will have no idea what is going on because they've failed to realize (A) what it meant to be a kid, (B) that 90's Pop Music is back with a vengeance, and (C) everybody wants to sing and dance, even if they don't want to admit it.","user":"nivekj1","rank":[127,219]},{"title":"A great sequel","rating":10,"date":"29 December 2007","review":"I understand that a lot of people feel that this wasn't as good as the first movie, but personally I think it's as good, if not better than the first one. The cast seem a lot more comfortable with each other and their characters, which make their characters seem a lot warmer and welcoming.<br><br>I also like that this film concentrates a little more on the importance of characters such as Martha, Kelsi, and Zeke. In my eyes, they're just as important as the main six, and I can't imagine the movie without any of them.<br><br>As with the first movie, the singing and dancing are flawless and perfect. My only problem is that there isn't a song that is as amazing and climatic as Breaking Free. The equivalent in this movie would be Everyday, but it's nowhere near as powerful.<br><br>Nevertheless, an amazing film that you'd be a fool to miss, no matter what age you are (take it from a 19-year-old!)","user":"TheArgentWolf","rank":[22,33]},{"title":"One of the Best Musicals Ever!","rating":10,"date":"12 August 2007","review":"It is shocking to think of how big the High School Musical franchise has become for Disney. In 2006, the first film became a surprise hit, and the sequel is expected to follow along the same lines. It is embarrassing to admit, but I bought a month's subscription for Disney Channel on Demand just so I could see High School Musical 2 before anyone else, and it definitely didn't disappoint. Let me say it right here and now: High School Musical is thousands of times better than the first film, with improvements in every category. The movie is longer, most of the scenes are more realistic, the directing and the acting seem to have vastly improved, and most importantly of all, the songs and the music are just AMAZING. These are the type of songs you would expect from a Broadway film or production, not some TV movie musical! The lyrics are beautiful, and nearly all of the songs are spectacular. All of the original cast members return for High School Musical 2, including Zac Efron, Ashley Tisdale, Vanessa Hudgens, Lucas Grabeel, and Corbin Bleu.<br><br>The plot this time around is incredibly different from the first one, and much more structured. It has a certain unique flow to it. Summer has arrived and Troy and Gabriella's love has to stand the test of time. Summer break just happens to be the ultimate test. Sharpay's parents own a country club, and she allows them to hire Troy, but all of the Wildcats come along for summer jobs. Sharpay will stop at nothing to tear apart Troy and Gabriella. Troy must discover who he is and what the future really holds for him along the way.<br><br>The best thing about this sequel is the fact that Disney seems to care so much about it. It's not one of those crappy sequels like Inspector Gadget 2 with none of the original cast returning. This sequel brings back the entire cast, and fleshes out the backstories for each and every one of them. With a longer length, there is more time to develop the characters, and this time is utilized wisely with a number of songs with amazing lyrics. Each and every song brings something new to the plate and is a realization of one thing or another. Every song has its own sound and feel that is much more unique than the first one. The soundtrack is simply amazing, and even the one song that didn't make it into the movie (Humuhumunukunukuapua'a) ended up as one of my favorites.<br><br>The acting is considerably better this time around as all of the cast members have had a year or so to work on their acting. Lucas Grabeel steals the show as Ryan, who finally breaks free from being Sharpay's accomplice in everything. Zac Efron gives a flawless performance with some amazing vocals, and it's very easy to see why he has become such an icon so quickly. Everyone's hairstyles and clothes look much better this time around, and there is much less of that corny Disney-Channel-show feel to it. The writing and the script are very well-written, and there are very few scenes that don't come out the right way. The dialogue and the music and lyrics balance themselves out perfectly in the movie.<br><br>High School Musical 2 is not only the best Disney Channel Original Movie ever made, but it is also sure to become a classic, and one of the best film musicals I've ever seen. It is better than the first film in every way imaginable with better humor and comedic moments, better writing, and much better songs. Don't miss this filmyou won't be disappointed! It is nothing short of amazing.","user":"PoisonKeyblade","rank":[124,248]}]