[{"title":"Actually pretty good fun","rating":7,"date":"20 November 2014","review":"I always find that Will Ferrell's films can be a little hit and miss. He's either funny, or he tries a little too hard to be funny. Luckily, in the case of 'Semi-Pro,' he's the former. The film is clearly his vehicle, so whether it works or not is largely down to him. Here he plays Jackie Moon – the owner, coach and player of a low league basketball team who are about to get disbanded, unless they can scrape fourth place in the league.<br><br>For a start, you don't have to know or like basketball. I know nothing about it, but I enjoyed the film anyway. Yes, Ferrell is a little over the top here and there, but his performance never really borders on 'annoying.' It's not a long film, only an hour and a half, and most of it is packed with gags (all pretty adult in nature) and the majority of those work.<br><br>There are minor plot lines, but they're all secondary to Ferrell. Most other characters are only there to tee up Ferrell for him to deliver the punch line. Woody Harrelson is about the second most important character and he has a little more screen time. He's totally functional too, but Semi-Pro is still Ferrell's baby.<br><br>Basically, Semi-Pro won't win any awards. It's daft, loud and dumb, but ultimately very watchable if you're in the mood for a film like that.<br><br>Just beware of escaped bears!","user":"bowmanblue","rank":[6,6]},{"title":"You Like Will Ferrel? Go on ahead and see it then...","rating":6,"date":"14 March 2008","review":"This movie hinges on one simple fact: do you or do you not just enjoy Will Ferrel? <br><br>If the answer to that is yes, then you will enjoy this a lot. Because there's not much new doing here: it's Ferell as another idiotic, self-loving, loud and beef-headed, dim-witted professional...insert obscure profession or athlete. This is just \"Anchorman\", \"Ricky Bobby\", \"Blades of Glory\", or what have you, except in basketball. If you enjoy those movies, and Will Ferrel's shameless antics (I'm not saying they're bad, I'm just saying I want to see him try something else now and then) then here's one for you.<br><br>But I also give kudos to the supporting players (like Woody Harrelson, who in a stroke of brilliance, is acting like he's in a real drama and not a spoof), the inspired 70's soundtracks and references. 6/10","user":"retrorocker1980s","rank":[53,74]},{"title":"Needs more Doctor J","rating":7,"date":"8 February 2008","review":"One of the joys of being a university student is getting invited to free sneak previews. I went to one last night, where the front half of the theater was packed with students while the back was filled with members of the writing team, taking careful notes on which jokes we did and did not laugh at. For the most part, the reaction was positive, and the jokes that failed miserably will probably get edited out by the time the movie officially opens.<br><br>The movie was pretty sports-comedy formulaic, with the down-and-out lovable losers getting a big chance, then introducing a new character who will inspire them, and a few montages later, the big finale. The R-rating was used mainly on adding in lots of cuss-words, with mixed humorous results. There was a really funny joke about masturbation. I was hoping for a little more basketball craziness, but oh well. <br><br>The highlight, of course, was Will Ferrel meeting the 70s. I myself was not alive in the 70s, so I only know about the culture through the disco-funk lens of caricature cinema. Ferrel is one funky mofo so he thrives. I would say this was one of his better efforts, topping Taladega nights, Elf, and the ice skating one. It's not as good as Anchorman, mainly because it's just not as quotable. <br><br>In short, if you like Will Ferrel, or 70s funk (the soundtrack is hella dope), see this movie.","user":"jkauf3","rank":[130,200]}]