[{"title":"Reprehensibly bad, one of Argento's worst movies and a pitiful wrap up to the \"Three Mothers\" trilogy","rating":1,"date":"30 April 2009","review":"MOTHER OF TEARS sucks. It's one of the worst movies I've seen in years. The fact that it was made by Dario Argento surprises me despite the fact that Argento has made more than his fair share of stinkers.<br><br>Sure, there are a few decent moments. A demon screaming into a phone until his jaw is impossibly extended is a creepy image, Sara descending a staircase into \"Hell\" is atmospheric and Argento delivers one good jolt with the old \"did I really wake up or am I still dreaming\" gag. But these scattered effective moments are crushed underneath a movie that looks like it was shot by a fanboy trying to make a movie like Dario Argento.<br><br>Asia Argento, who is a decent actress, is embarrassingly bad here. Her performance is so wooden and monotone she looks like just showing up to the set everyday was enough of a chore. Most other performances are lousy as well. The dependable Udo Kier fares the best in the role of a priest who shows up just long enough to spout out a few convoluted lines of dialog which connect this movie to SUSPIRIA and INFERNO before being hacked to death.<br><br>And that brings up the already infamous gore. MOTHER OF TEARS is likely to forever have a place in horror history as \"one of the goriest movies ever made,\" but that honor is obligatory at best. Yeah, there are several outlandishly gruesome set-pieces, but they are all taken to such an extreme that they become ridiculous rather than horrifying. A woman being disemboweled and then choked with her own intestines is unintentionally funny, more like Peter Jackson's work in DEAD ALIVE than the surreal horror of SUSPIRIA. The scene is also not helped by the fact that the \"intestines\" look more like industrial extension cords than actual innards (even more so in an equally absurd moment in which a woman's intestines are being sucked out through her anus).<br><br>A monkey which serves as a familiar to the Mother is sort of creepy at first, but when it kept showing up and screeching it started to grate on my nerves. Even more irritating is Sara's mother's ghost, who repeatedly materializes to give her advice, even after telling her it's the last time she'll be doing so. The special effect used to place her in front of Sara is so bad it was hard not to chuckle every time. Unfortunately the unintentional humor that may have made these scenes amusing is killed by the excruciating banality of their dialog.<br><br>Worst of all, however, is the Mother herself. Turns out the \"Queen of All Evil\" is a runway model with fake boobs. She's about as scary as Paris Hilton. Maybe this is why the only witches who show up to honor her are the ones who wear ten pounds of make-up and have no fashion sense. For a secret society these ladies sure haven't nailed down the art of inconspicuousness. Argento apparently thinks all witches dress like Madonna circa 1985. And I expected it to take just slightly more to vanquish the Mother than to simply throw her T-shirt on the fire.<br><br>If this was just a random movie, with no connection to two of the most unique and surreal horror movies ever made, then MOTHER OF TEARS might be fun in a PLAN 9 FROM OUTER SPACE sort of way. As the final entry in an intended trilogy, however, this movie is inexcusably awful.","user":"squeezebox","rank":[41,50]},{"title":"Dear Dario,","rating":4,"date":"16 June 2008","review":"I know this is going to be hard for you to hear, but I have to get this off of my chest: I'm leaving you. <br><br>We had a good run for years, but now its time to move on. I'm not going to patronize you by using the tired \"its not you - its me\" cliché. In fact, it IS you. You've changed, and I'm not in love with your movies anymore.<br><br>In the early days, we had a blast. Your films were artistic, original, vibrant, gory and scary. They were lush with complex themes woven into horror films that broadened my mind...<br><br>In the Eighties, we had a rocky period. Your films became sloppy and convoluted. Yes, the honeymoon was over - but we still stuck it out. I had faith that we (you) could work through this and get back in the game. <br><br>Towards the end of the millennium, you did have your flashes of brilliance - glimpses of our blissful beginnings... Sadly, as I now see, those were merely the final stages of your decline. Your brief and violent death throes before truly going off the rails.<br><br>I am writing to you now after seeing \"Mother of Tears.\" I had such high hopes for us again!! All the planets were aligned: Late night screening - full house - open mind - belly full of tequila and lime... and the NEW DARIO ARGENTO FILM!!! What could possibly go wrong! Then it starts... Gore right off the bat! Then witches!! THEN a very wicked little monkey!! This is going to be great!<br><br>Then... oh god, then.... I'm not sure when it started exactly, but at some point pretty early on the plot twisted off into nowhere - followed shortly thereafter by any pretense of acting. I mean - I love a b-flick, but this was just pathetic. Especially when you know everyone can do better. (Oh, Udo, my secret Lover... Why? WHY???) <br><br>What bothers me the most was that it seemed that you, Dario - the once great horror maestro- didn't care about this one. Where was the signature color palate? Why would you let the one of the brilliant Goblin boys write one great Argento-esquire piece, followed by half an hour of hackery? <br><br>I hate to say it, but after your last three flops - I'm done. Thanks for the great years, Dario, but you and I are through.<br><br>We'll always have the 70's, my Love. And I will remember them, and you, fondly. Good bye, Dario.","user":"doctorprogress","rank":[184,254]},{"title":"Let's just pretend this didn't happen...","rating":5,"date":"15 July 2009","review":"This was one of the biggest disappointments for me in a long time. <br><br>If you've ever heard the name Dario Argento - it's probably because in 1977 he crafted one of the most stylish and genuinely creepy horror movies of all time, called \"Suspiria\". It's one of my personal favorite movies of all time, from one of my favorite directors. If you can appreciate horror, or even if you can't but you're an open minded person, I suggest you give SUSPIRIA an hour and a half of your life because it's unlike any other horror experience you will ever have. <br><br>SUSPIRIA was intended to be the first movie in a series of three, known as the \"Three Mothers Trilogy\". After Argento's crowning achievement, he did the 2nd in the series in 1980 which was called \"Inferno\". Although Inferno was just as stylish and just as mysterious, it was not quite as effective or fulfilling as Suspiria in the end. Yet, it is still a bizarre cult classic. The soundtrack from Keith Emerson is probably even better than the movie itself.<br><br>Anyways...Argento decided to hold off from finishing off the trilogy, and ended up holding off for 30 YEARS..., so finally in 2007 he decided it was time to create the finale, The Mother of Tears.<br><br>What can I say? There are maybe one or two gratuitous murders that are worthy of the Argento name, specifically the very first in the movie which comes out of nowhere and may have you clenching your mouth to make sure your teeth are still there. It is always lovely to see Argento bringing back actors and actresses from classic Italian horror films - in this case it's Coralina Cataldi from his awesome 1987 film, Opera, and the roller-coaster ride that is DEMONS 2.<br><br>Aside from a few memorable deaths, this movie really has almost NOTHING to offer. It is nice to see someone making movies about black magic, demons, and sorcery since no one else really does that anymore. The concepts are wonderful but unfortunately NOTHING is pulled off effectively here.<br><br>For one, the CGI totally abolishes the legitimacy of the movie. It's some of the cheesiest CGI i've had to bare with in some time. I figured Argento would be smarter than this - but then again, he is getting really, really old...<br><br>Asia Argento (the director's daughter and lead actress) can act but she isn't given much to work with here. The script, as usual with Argento's films, is the weakest part. The dialogue is far too basic to keep your emotions invested in the characters. No one else stands out as a particularly great performer either.<br><br>The saddest thing of all is that the movie completely lacks atmosphere. The setting and atmosphere was always the absolute BEST part of the director's classic films. And the fact that one of my favorite bands of all time, Goblin, provided the majority of soundtracks heavily added to that. But they've been out of the picture since his 2001 movie, Sleepless. The sets were completely plain and in no way stand out. I appreciated the shots of the creepy old mansion like building towards the very end, but even that building looked fake and CGI-induced...and it was clear that it was not actually filmed there - which took a lot away from the entire finale.<br><br>The finale was probably the most depressing part. It felt extremely rushed, and aside from that, the \"lead villain\" who is supposed to be \"the most evil of the three mothers\" was SO half assed. A good looking chick with nice tits and some black make up around her eyes?????? c'mon!!!!!!! what IS this?!?!?! I wanted to laugh at it but was way too saddened by the film overall to have a good time with it. And then all of a sudden, it's over...<br><br>I was so let down!<br><br>I guess I'll have to depend on Asia Argento to make good movies instead from now on. Her last one, The Heart is Deceitful Above All Things, was a masterpiece of it's own kind!!! See it!","user":"Stay_away_from_the_Metropol","rank":[22,27]}]