[{"title":"Good Old Fashioned Fun","rating":7,"date":"19 April 2018","review":"I was worried it would fall into the pitfalls of comedy sequels like Anchorman 2, American Reunion, and Zoolander 2, films that just were not nearly as funny as their genius predecessors. But thankfully this film did not disappoint me as many comedy reboots/sequels do, I found myself laughing hard at many of the silly and outlandish situations and jokes. I laughed much harder than the aforementioned sequels. And the film, like the first, does not take itself seriously, it knows the first is a cult classic and they don't try to out shine it, they just are as they are. One should not come to such a film thinking they will experience emotional, introspective, and thought provoking cinema, this is a silly old fun time that had me laughing several times, a long with everyone else in the theater,<br><br>And as far as it goes as a sequel to such a cult classic, they honestly could have done infinitely worse knowing how some reboots/sequels have turned out. Like I said before it doesn't try to outshine the first, but rather play on the things that made the first one so great. Its stupid, but fun. And without giving too much away, there are more than one joke relating to the original that fans such as myself will enjoy seeing. So no, it had no beautiful cinematography, had no introspective character development, and had no greater message, but honestly, who gives a s***, it a fun and stupid movie that I enjoyed because I knew this film was intended to not be taken seriously, its a comedy for crying out loud. People will review saying its lame, but don't listen, hey are flat out wrong.","user":"neener3707","rank":[83,109]},{"title":"The Boys Are back... & Show Their Age... Or Maybe We Do?","rating":6,"date":"12 July 2018","review":"The first Super Troopers came out 17 years ago, and while the first movie is extremely funny, and the other Broken Lizard movies, like Beerfest &amp; the Slammin Salmon, are funny, this movie either tries too hard to be a rehash of the first, or the comedy just doesn't hold up the same over time.<br><br>You don't really get to see much of the boys actually out as \"cops\" until the second half of the movie, as the first half is mostly spent on \"fish out of water\" stuff, aka America vs Canada shtick that isn't all that funny. The whole \"Canada is different than America, Eh? Soorry!\" stuff didn't appeal to my funny bone, but once the boys hit the \"crisis\" point in the movie and had to actually hit the road as \"cops,\" there were some good moments. I just wish it didn't take so long to get there. From that point, it's kind of a paint by numbers Super Troopers 1 plot remade for a sequel. <br><br>It's pretty much a one time watch, then forget.<br><br>Oh, and the funniest part in the entire film is a Fred Savage cameo that happens during the credits, so don't miss it. They build up to it during the film.","user":"dootmoot","rank":[16,19]},{"title":"The plot is terrible, but it doesnt need to be good","rating":8,"date":"20 April 2018","review":"I went and saw this as a double feature with the original. Hadnt watched the original in years but it was fun to see again. The second one is just like the first. Bad plot, funny movie. I laughed harder than I have in the theater in a long time. The comedy is at times, brilliant, stupid, uncomfortable, memberberry, but it is pretty constant throughout with making you laugh. My stomach still hurts a bit. Anyone who is bashing this movie in a review....I dont know what they expected, but this one is worth a watch. If you liked the first one, you should like this one.","user":"gilgie74","rank":[57,79]}]