[{"title":"Excellent Medieval Film About Honour And Values","rating":8,"date":"12 August 2008","review":"It seems that most reviewers here want sword fights and action.<br><br>Arn is more interesting than that: it is a surprisingly complex film about honour and medieval notions of chivalry and values.<br><br>We REALLY enjoyed this - the characters are fleshed out and the plot develops at a drama pace, rather than at a dramatic pace. It seems a lot of thought went into the characterization and settings - this did cost $30,000,000 making it the most expensive Swedish film ever - and it did very well at the box office.<br><br>Those wanting just action had best look elsewhere those wanting both action and character, and a real exploration of the values of knighthood then this will definitely be your cup of tea and something to savour.<br><br>It is kind of like Braveheart in its values, and less like Kingdom of Heaven than you'd expect. Yes, it is quite elegiac, and that fits its Nordic roots well.<br><br>Overall, one of the better films about the crusades and the choices made for people living in a time when individual freedom was lost and subjugated to church and kings.<br><br>Recommended","user":"intelearts","rank":[89,98]},{"title":"Good film.","rating":24,"date":"24 December 2009","review":"I'm sorry I can't think of a better title for my comments. I thought of comparing it to \"Kingdom of Heaven\", the film trend in Hollywood, and a bunch of other things. But the one thing that really stands out for me is that it's just a good movie.<br><br>But the film's history reminds me of a personal anecdote regarding one of my former managers early in my film career, and his effort to get a medieval epic off the ground in the late 80s regarding Robert the Bruce. Without going into too much detail he lost control of the project, and the film that eventually came out of his efforts was \"Braveheart\", only \"Braveheart\" was the market competitor that was designed to compete with my manager's film, which never got made.<br><br>So it is with \"Arn the Templar\" in regards to \"Kingdom of Heaven\", only unlike my old boss's film \"Arn the Templar\" got off ground, and flourished into an impressive medieval Nordic epic. There's little to criticize about this film, other than the drama itself never really hits a high point. But perhaps that's as it should be, because it seems a bit more real. There's little in the way of over dramatizing the characters, which obviously holds back a more emotional film. This in turn allows the background itself to become a character.<br><br>We're taken to medieval Europe and Outremar. The landscape is barren, harsh, and most of all for the audience, real. The north is rich when love is in bloom, but cold when violence reigns. In the wastes of Jerusalem all is hot, parched, and full of death. The desert runs with blood.<br><br>The other plus in regards to this film are the costumes. The actors are made to look of the land. Those who trudge the desert are covered in dust, dirt, and caked mud via perspiration. And the costumes look to be of the period. Unlike another film I reviewed, \"1066\", the armor in this film looks like armor of the period as with the rest of the costumes. Such authenticity helps offset some of the notable lack of energy in the drama. In fact this film's art direction is perhaps superior to \"Kingdom of Heaven\".<br><br>Why is that? Because there is no CGI in this film. SFX for this film go back to golden era Classic Hollywood; i.e. no miniatures and no CGI. Everything you see is real. Which would help explain why this film was so expensive to make for Scandinavian film makers.<br><br>Negatives, and there're a couple. There's maybe two, possibly three oddly cut sequences where the alleged 180-degree camera rule is violated, and shots are put together in an unconventional way. But it's so minor that you hardly notice it. The only other criticism I'd make is that the film feels like a Scandinavian effort to make a Hollywood film. Not that that in itself is a bad thing, after all Europes Scandinavian types are finally mining their culture and history for some quality films.<br><br>All in all I liked what I saw. In fact I liked it better than \"Kingdom of Heaven\" for a number of reasons. First and foremost there are no real villains as such, and therefore unlike Ridley Scott's film this movie doesn't present us with one-dimensional sociopaths as the cause of main emotional propellant for the action. That is to say we don't need individual characters to help push the geo-politics. Outremar is there, and so is Saladin's army and the political forces driving both. We know this. Nations fight. They always have. They always will. The collective mind that nations create will always vie for power. It's the story of the individuals that are caught up in the maelstrom that we're interested in. This is what Arn the Templar is all about. <br><br>So, in the end does this film deliver? I think it does, but it does lack that extra bit of emotional muscle to really push it into the classic film category. That, and it does get somewhat reminiscent of classic films in the end. Still, this is a very solid piece of commercial cinema that should entertain.<br><br>Enjoy :-)<br><br>NEW SCREENING 12/13/2010<br><br>I ordered a DVD import of the entire mini-series, and all I can say is ... my god, no wonder this thing was so expensive. The producers essentially shot an 8+ hour feature film for was supposed to be a TV series. Mini-series or no, if you spend this much time and care setting up the shots and getting all the particulars right, then is it any wonder this project cost so much? <br><br>From Arn's child hood to his eventual death, we look at his life and that of his love interest. But in a movie of the week format, not even a regular dramatic TV format, but a series that took the care and production values of a feature film, and injected them into an epic that makes the old epics pale in length. Imagine taking Coppola's \"Godfather\" and making a TV series out of it where every shot and prop was tended to with extra care. Well, that's what the mini series is.<br><br>Good stuff... even if I can't understand Swedish :-)<br><br>Check it out.","user":"Blueghost","rank":[40,43]},{"title":"Poetically made","rating":8,"date":"3 January 2008","review":"Once I heard about this movie I felt pride for my country for making such a big production, hoping for it to be able to challenge big productions such as Troy, King Arthur and maybe even 300. I hoped so, but I expected otherwise. I know my epic movies pretty well, and in the trailer some months before release I notices some bass tones of the music score were identical to a part of the Gladiator music. I feared a cheap American epic movie ripoff with flawed actors and fake-looking special effects. Luckily, I did not see what I expected.<br><br>Arn has one big difference from the epic movies we know - it is made in a country where an epic movie of this size has never been made before. Naturally, many will expect to see the same of what we've seen in epic movies so far. Many will expect to see a hero or a group of heroes slaughtering hordes of enemies for the pure obsession of it that they call glory, but they won't. What they will see is the tale of the medieval life told in the most simple way. A mother promising away her son to God to serve him. The obsession of power between kings. To get to know your worst enemy and respect him as a man, and to meet anguish of having to kill him on the battle field without really knowing why.<br><br>During the first half of the movie at some point the storytelling got a little over hand, which is understandable while the balancing between being informative and entertaining is a hard thing to perfect. Though, it would be a shame going to the theater to see this film waiting for the heads to start rolling to the right and to the left, missing out the whole experience of having an honest story about the medieval life being told right in front of your eyes by common people.<br><br>This is the first part of the story of Arn. Now I have my hopes up for the second movie to round up this tale as well as or better than this first part started it.","user":"nm_johnsson","rank":[111,138]}]