[{"title":"Jessica Chastain is outstanding","rating":7,"date":"6 December 2015","review":"\"Jolene\" is, in spite of a lot of previous comments, better than average. Jessica Chastain, playing the eponymous character is outstanding. Yes, her journey is repetitive in a way, and she never seems to learn from her experiences and continues to make terrible decisions in her life. I tend to assume that this is the point of the story. Every other part in the movie is somewhat small, as Jolene moves on and never goes back. But good work is done here by, among others, Frances Fisher, Theresa Russell, Denise Richards, and Shannon Whirry. Rupert Friend and Dermot Mulroney's characters were creepy in the extreme, which probably makes it more fun to play them. There are no likable characters in this film, including Jolene, and this is probably what turns off so many reviewers.","user":"smatysia","rank":[10,12]},{"title":"Jolene shines at the Seattle Film Fest","rating":9,"date":"23 June 2008","review":"Of all the films I saw at the 2008 Seattle International Film Fest, \"Jolene\" is the one that stayed with me. Jessica Chastain gives a multi layered, complex, superlative performance as the title character. A girl drifting through her life looking for love in all the wrong places. The film stays away from sentimental payoffs giving it a very distinctive tone. Are we suppose to sympathize with Jolene? Dan Ireland, the director, leaves that to us in another honest and wonderful tale of longing and hope. From Rene Zellwegger in \"The Whole Wide World\" to Joan Plowright in \"Mrs Palfrey At The Claremont\" Dan Ireland has shown a remarkable flair to bring out the best on his female characters and more. Frances Fisher gives an Academy Award worthy performance in a part so far away from anything I've ever seen her do that it took me a while to realize it was her. Michael Vartan, Dermot Mulroney, Chazz Palmintieri and in particular Rupert Friend give vivid, powerful performances. \"Jolene\" is unique in a year of sequels and TV adaptations. I can't wait to see it again. Congratulations Mr. Ireland and thank you for your passionated and coherent commitment to the independent soul.","user":"totalwonder","rank":[42,66]},{"title":"A Predator's Fantasy of a Teenage Drifter","rating":3,"date":"27 January 2018","review":"I love Jessica Chastain so I decided to give this movie a try. I had a difficult adolescence so I thought I'd identify with the character. But I should have known-this film was written by men and therefore, the character lacks depth and the edge that a girl who truly went through what this character is portrayed to have dealt with would truly develop. Throughout the movie, older male characters are shown as benefactors rather than victimizers of Jolene, and she is shown as not a confused teenager who out of desperation uses her sexuality and attention from much older adults to survive in otherwise bad circumstances but a horny nymph who sometimes acts robotic but is also seductive and not much of an emotional being. She gets to survive using her sexuality as she's basically raped, and has orgasms, according to this movie.\nThe movie starts with Jolene, at 15, marrying a rather young man named Micky, a sweet and rather awkward man who really does seem to care for her. When the sleazy uncle of the boy takes a predatory interest in Jolene, she finds this appealing and succumbs as a willing participant, which leads to disaster and a series of other adults who find Jolene irresistible and she uses them for her own comfort and survival, which DOES happen in real life, but not without much worse consequences generally. She enjoys art and art is another tool employed to try to make the perversion of this teenager as more legit. This movie portrays the systematic exploitation of a young girl as no big deal and not damaging or hurtful to this young girl- in fact quite the opposite...the writing attempts to show her as \"artsy\" and steering her own ship instead of a victim who has serious problems. It was only after watching 3/4 of this movie and being disgusted that this continued, that I checked and verified for myself that the writers of this movie were men. Well OF COURSE they were! Who else would write a female lead who has been mistreated by men and had to use her own sexuality with sleazy older men to survive and ENJOYS IT and THRIVES instead of becoming a broken and sad drug addict or worse. \nWhat I ended up taking from the movie is that this is a movie for men (and women) who would do things like the men (and women) in the movie to young girls and justify it as if the girl is enjoying and benefitting from this attention and behavior-a way to live. Jolene is shown as mainly a sexual being, a conquest, and a willing participant in her own abuse and exploitation, but not as a person with many feelings outside of sexuality. Even the \"religious guy\" is a pig and a rapist. But after being anally raped, and showing a tad distress for A MOMENT, she's fine and happy. Her range of emotions were confined within very shallow male's idea of what it's like to be a female, especially a female who has a history like Jolene's. After years of abuse, she has a child, and is IMMEDIATELY fulfilled and believes in God. Then after being beaten enough shows the fortitude to move on, but just as fast as she found God in her child, she gives up on him and fantasizes about going back someday, embraced by her son now as a movie star. That's redemption? What a load of crap. \nI found it actually rather disgusting but typical of male-created female lead. Don't waste your time, especially if you care about real stories about the female experience.","user":"uwsupergirl-701-304435","rank":[21,31]}]