[{"title":"Good but slightly flawed","rating":7,"date":"30 September 2010","review":"Did most of these reviewers actually watch the same movie as me. There will be spoilers in this review so watch out :)<br><br>The basic story of the movie concerns a young girl, clearly struggling with life and her relationships. After a car crash she 'awakens' in a mortuary only to be told that shes dead. The rest of the movie covers Liam Neeson (the undertaker)and his attempts to convince her that she is in fact dead and help prepare her for her funeral. But is she really dead?<br><br>This movie is not about life after death. Its not about what happens when you die. This movie is about people not really living their lives, wandering through life like they're dead already. I think its fairly obvious that the main character is in fact very much alive when taken to the undertaker. Numerous clues point to this in the movie, breath on the mirror, the 'muscle relaxant' that shes injected with and the fact that shes walking around and has to be locked in :)and finally to confirm that Neeson is lying, in the final scenes he clearly kills the boyfriend. But the movie has several scenes that seem to ruin this, and push the film to seeming supernatural grounds. With numerous scenes, or nightmare scenes like the confrontation with her younger self, and the old woman's corpse walking and talking. These slightly detract from the overall focus of the storyline, but keep you guessing if she is alive or dead.<br><br>In the end, this is a good movie, with an interesting story and direction, only slightly let down by some of the scenes. Well worth a watch.","user":"skywarp-10","rank":[47,58]},{"title":"Good idea gone wrong","rating":5,"date":"28 August 2010","review":"Driving carelessly in the rain one night, Anna Taylor has a car accident which kills her. She is DOA, or is she. Anna wakes up in the basement of the local funeral home, and the funeral director tells her that she is dead (with a certificate to prove it). He also tells her that he can talk to the dead. Anna wants out, but he will not let her leave, claiming that she must accept the truth. Is she really dead or is he nuts?<br><br>After Life has a great set-up, but from there, things get worse. What keeps the viewer hooked is the promise of an an upcoming climactic twist, like that in the Sixth Sense (the film which After Life has its roots in). Unfortunately, with each passing chapter, it becomes more evident that the outcome we would like is not going to come. <br><br>Yet what is more bothersome about After Life is that frankly it is dull. I see an idea here, but I don't see a movie. After Life recalls Awake in that it functions well as an experiment in psychologically related themes, but it doesn't provide exiting or suspenseful material. After Life has really nowhere to go, but down. Despite being partial fantasy, its inability to make sense is aggravating and not acceptable. After Life could have and should have been way more potent than this.","user":"Samiam3","rank":[71,94]},{"title":"A confused, clumsy piece of pretentious melodrama.","rating":3,"date":"12 August 2010","review":"Ah, here we see yet another self-assuming, clunky mess of a film. We should have known, having seen the pretentious dot that has been placed between the two words of the title for no apparent reason.<br><br>The opening is somewhat promising, involving a bored and depressed Christina Ricci, who gets involved in a budget-effective car crash and wakes up in a funeral parlour with the grim Liam Neeson looming over her, explaining that she is in fact, dead. That he tells her her blood flow has stopped before promptly injecting her with drugs (a rather pointless endeavour for someone with no circulation) denies the essence of her film-long confusion. But that doesn't seem to bother anyone at this point, because we like to give movies the benefit of the doubt, don't we. Unfortunately, Ricci's sole demonstrable skill in the film appears to be going from squeaky desperation to grim, monotonous acceptance and back again in a matter of minutes. This simply serves to add more confusion to the already bizarre plot, and ultimately makes us unsympathetic during the final scenes.<br><br>The problem with the film is that it has no idea what it is. The director has clearly been hoping for a cut above the average horror flick, but there is not enough originality or wisdom to transform it into anything else. The result is a cheap and excessively melodramatic B-side horror, which lacks the spooky scares that make its tawdry counterparts so much more exciting. The fact that the film takes itself so very seriously throughout makes it all the more infuriating.<br><br>One of the film's very few silver linings is Liam Neeson's understated performance as the unhinged funeral director, convincingly dishing out a mix of soothing sobriety and chilling psychosis, and managing to drag some life out of the clumsy and repetitive script. But then, you'd expect that from a man so undeniably bad-ass that he's even played an actual lion in a film.<br><br>A diluted and overlong episode of The Twilight Zone, for horror completists and fans of Ricci's feminine form only.<br><br>POSSIBLE SPOILERS BELOW<br><br>I find the ending worth a mention. Downer endings are all well and good in the right context. When the film's content is strong, and there is method and moral to the disappointment, one can still come away from it feeling rewarded, or at least provoked into contemplation.<br><br>Unfortunately, none of this is applicable to After.Life. The film's plot relies on the prospect of a recovery and reconciliation between its two leads; the character development is too thin and plot points too few and far between to allow for anything else. So, after having sat through an hour and a half of dreary nothingness, we as a now solidly popcorn-eating audience expect the alleviation of some form of resolve, to reward us for enduring the rest of the film and to tick one final box in the series of clichés that it has been following so avidly throughout. But unfortunately, the film seems to think that a negative finale is a one-way ticket to critical acclaim. And once upon a time, it was, but now this is simply not enough. And so, we are left with an uninspired and underwhelming descent into rigor mortis, with the bad guy living to strike again, and again, and again. God forbid.","user":"furtherintime","rank":[93,127]}]