[{"title":"Good production spoiled by a weak plot","rating":5,"date":"18 January 2008","review":"Actually for once I was disappointed after seeing a Renny Harlin movie because I had high hopes for this one. Usually I've known in advance his movies would be bad but \"Cleaner\" seemed that it might actually be really good for a change. It's not really bad, but it isn't anything great either.<br><br>Samuel L. Jackson and Ed Harris did their job very well in the leading roles and Harlin's direction was also good. Eva Mendes' performance wasn't anything to hooray for though. The movie started off well and I thought to myself: \"This might be it. The movie that puts Renny back on the top.\", but sadly no. The script is just too basic. You've seen different versions of this script on the screen many many times before. The characters and the world they live in might be totally different, but it's still the same generic plot. One thing that bugged me a bit was the musical score which didn't fit in some places at all.<br><br>But as far as Harlin's movies go this is one of his better ones. It just needed that original surprise twist in the end that never came. I can't really recommend you go see this in the cinema, but it's worth a rent.","user":"pabloz","rank":[99,129]},{"title":"Yet Another Twist on Police Corruption","rating":5,"date":"8 June 2008","review":"CLEANER is somewhat of an enigmatic movie: it starts out as though it is going to be a sassy comedy about a retired cop whose job it is to 'clean up' after homicides (a distinctly messy and repulsive job), turns into a rather grisly crime investigation story, adds a dollop of 'ain't life grand', and finishes as an exposé of police corruption. The story line by Matthew Aldrich is further fragmented by being so full of holes that the audience has to toss credibility overboard in order to make it through, and the method of direction by Renny Harlin can't seem to settle on which style to take. It is all kind of a mess and justifies the straight to DVD move. The saving grace of the film is a cast of stalwart actors who can make even a shaky script palatable. <br><br>Tom Cutler (Samuel L. Jackson) is a 'retired' cop who makes his living cleaning up the gory remainders of criminal acts of homicide and other grisly crimes. We learn his wife was murdered some years ago, leaving him as a single father of the bright and charming teenager Rose (Keke Palmer). Cutler happens on an assignment to clean a particularly gruesome homicide scene in the home of one Ann Northcut (Eva Mendes in a nicely understated role) and as the convoluted story develops, Cutler realizes that the crime scene represents a culmination of forces that threaten to uncork a long history of police corruption - a history that involves him and his best friend Eddie Lorenzo (Ed Harris) and the tough Detective Jim Vargas (a terrific Luis Guzmán). How the story ties together and ends is too loose to convey and would ruin the minimal drama present. <br><br>Each of the actors, even the minor roles played very well by such artists as Jose Pablo Cantillo and Robert Forster, give it the full court press. But the see-through script and the jumbled camera work and direction prevent this from being a significant film. Grady Harp","user":"gradyharp","rank":[43,53]},{"title":"Beautiful Photography, Boring Plot and a Poor Ending","rating":6,"date":"2 April 2008","review":"Cleaner is a surprisingly boring and lackluster movie beautifully photographed. The casting is superb and would seem to be a sure recipe for cinematic success--Samuel L. Jackson, Ed Harris, Eve Mendes and Luis Guzman. The dialog is decent and well acted. The plot is where this movie just completely drops the ball.<br><br>The plot begins mildly unbelievably--A crime scene cleaner becomes unwittingly immersed in the cover up of a homicide--and then just snowballs downhill from there into a huge police cover-up (I don't want to \"spoil\" anything for any potential viewers) with an unbelievable plot twist and then ends in a thoroughly stupid and highly implausible ending.<br><br>The upside and downside is this movie is beautifully filmed and with such talent, thought and effort that the cinematography itself keeps you thinking it has to get better and it only gets worse.<br><br>I hope Ed Harris got paid a lot of money to do this film! Ed does a great job with the little he has to go with and proves what a great actor he is. Eva Mendes does a poor job playing a recent widow to murdered husband (is she angry/sad/sexy/conspiratorial/or just a gold-digger who married a sugar daddy who just got knocked off?). Luis Guzman does a solid job as usual.<br><br>I seem to enjoy the movies where Samuel L. Jackson plays a supporting role or shares the lead rather than being the sole lead e.g. Pulp Fiction, The Negotiator, A Time To Kill, etc... In Cleaner he does a reasonable job with a poor plot until the end where his acting coupled with a bad plot twist left me wondering what I could have done better with the time it took to watch Cleaner.<br><br>All in all I wish this cast and DoP would have had a better script. I would recommend that Matt Aldrich stick to acting and give up the script-writing. As I think everything was done well except for the storyline/plot aka the script. I give kudos to Renny Harlin (director) for a job well done.","user":"ryan-1237","rank":[66,93]}]