[{"title":"Semi-Original, Not bad, but sorta falls apart","rating":6,"date":"28 March 2008","review":"Went into this expecting a bunch of gore, but instead go an interesting story and premise. The idea is a merging of quite a few ideas you may recognize, but was done very well. Up until a certain point.<br><br>The last 25 minutes or so seemed that they ran out of ideas on how to tie up a thought out start with a decent ending, so they just went for a typical and somewhat predictable end.<br><br>By no means is it a horrible movie, and there are some good performances in it. Just don't expect to walk away stunned at the end.<br><br>Oh...while not overloaded with CGI - what they do use is amazing looking.","user":"Sabalon","rank":[42,56]},{"title":"Really good horror film (it will help if you know as little as possible)","rating":7,"date":"24 December 2007","review":"Hey wait a minute a low budget horror film thats actually pretty good. Despite bumpy start this is a good film about a guy who is being killed again and again, each time jumping into a new life. I don't want to say more since the film is solving the puzzle as to what's going on. This is a good story that seems like an extended episode of one of the better horror anthology series, while it probably could be trimmed down a bit, the film is mostly a solid little thriller that puts the story and characters first instead of the effects. Yes there are effects, but they aren't over used nor are they over done. if you like good, pulpy horror stories give this a try.","user":"dbborroughs","rank":[49,74]},{"title":"Not a bad little film","rating":8,"date":"6 September 2008","review":"First of all, IMDb, please refrain from using kids comments and reviews as the default. TheatreX doesn't know what he's talking about but I guess it creates controversy and creates more reviews like this one so... Anyhow, on with the review.<br><br>No, it's not some ground breaking plot device (love conquers all). But come on, even Lucas said Star Wars was nothing more than a Western shot in space. No, it's not some special effects extravaganza like Star Wars or Raiders of the Lost Ark. No, it's not going to win any Academy Awards. But, jeez, at least it has a story that makes sense. There Will Be Blood and No Country For Old Men were raved about by critics and viewers alike but I found both films to be mediocre at best. My friends and I took shots every time Tommy Lee sat down to jaw jack or read the newspaper and I can assure you we were drunk as skunks in no time. So much for public taste.<br><br>This film itself certainly doesn't bring anything new to the genre but it takes what's available and executes it in pretty good fashion. I expected a lot of blood and gore and bad acting right from the beginning but was pleasantly surprised to find neither. The plot and storyline unfold slowly and despite what others say, including TheatreX, nothing goes downhill after that fact. It's as good as anything else you'll see on the big screen and not a bad way to spend some time curled up with your girl in a pitch black room some weekend. Grats to Stan Winston for the production and effects and Dario Piana for the direction. I'll rent the others for sure.","user":"rfrenzel2002","rank":[34,51]}]