[{"title":"Both Sides of Forgiveness","rating":8,"date":"1 March 2008","review":"POOR BOY'S GAME is a little film with a big message: hate can only be altered with forgiveness, remorse and redemption. The highly respected Jamaican director Clément Virgo (episodes on 'The Wire', 'The L Word', 'Soul Food', and films 'Love Comes Down', 'Lie With Me', etc) here takes on the tough subject of racism and the accompanying backlash of consequences and with co-writer Chaz Thorne produces a small but pungent film that touches many aspects of the schism between whites and blacks in the seemingly tranquil town of Halifax, Nova Scotia. Isolating the story in such an unlikely place serves to heighten the core problems the film addresses.<br><br>Donnie Rose (Rossif Sutherland) is released from prison, having served nine years for the brutal beating of Charles Carvery (K.C. Collins) which left the victim severely brain damaged. Upon release Donnie returns to his old neighborhood to live with his mother and find work as a security guard in a bar. Largely due to the bad influence of Donnie's belligerent and bigoted brother Keith (Greg Bryk), Donnie has to struggle with his family situation, trying to avoid the pain and guilt of his past while coping with his own dark secrets. His victim's father George (Danny Glover) stalks Donnie with the intent of killing him for the damage he has inflicted on both only his son and wife (Tonya Lee Williams), but the racial tension he encounters magnifies the underlying tragedy of the past - a factor both Donnie and George must face. Violence between the blacks and whites erupts and the resolution is to be decided in a boxing match between the superior boxer Ossie Paris (Flex Alexander) and Donnie. After a touching encounter following a tragedy, George and Donnie bond and George trains Donnie for the fight, the first sign of erasing racial tension. How the crucial fight preparations proceed and how the fight results from the resolution of the critical conflict that has eroded the town and these people forms the surprising closure of this story.<br><br>The cast is strong with the quiet lead from Danny Glover and the smoldering, conflicted Donnie by Rossif Sutherland, the fine young Canadian actor whose father is Donald Sutherland and whose half brother is Kiefer Sutherland. The film very quietly explores other conflicts, such as Donnie's sexual and emotional life with his black cell mate in prison, adding to the exploration of human behaviors that influence interpersonal schisms and barriers. This may be a low budget movie but it is a solid work well worth viewing. Grady Harp","user":"gradyharp","rank":[18,19]},{"title":"Very good drama about forgiveness and redemption","rating":8,"date":"20 February 2008","review":"After seeing this film at the Pan African Film Festival, I was struck not just by the importance of its message but the universal appeal of the film as a whole. This is a story that truly crosses racial boundaries. Danny Glover is excellent as usual, but the entire cast is talented, and the lead actor, Rossif Sutherland, is definitely one to watch. The story begins with a vicious attack by an almost unreedemable lead character. His journey through the prison system to the boxing ring forces him to confront his inner demons, and to ask forgiveness from those he has harmed. Definitely worth seeing at a film festival or anywhere you can find it!","user":"sttaresss","rank":[11,13]},{"title":"a fascinating, moving movie with real characters","rating":8,"date":"15 February 2008","review":"***spoiler alert*** it struck me as i watched the final showdown fight scene that i didn't know what was going to happen in the fight, i didn't know what any of the characters (except ossie) really wanted to happen, and i didn't feel that any of it made a huge difference in what i thought of this film.<br><br>so much happens in the body of the film, real characters with often uncertain personal motivations (thankfully a movie w/out bland expositionary dialogue or voice-over--i mean, when my girlfriend and i have a conflict, it's not like i have a voice-over guide to what's happening. i'm just in it, and have to figure it out on my own), and the resolution is very real also--no explosions, no shootouts, no grand speeches, no great epiphanies of startling brilliance--omigod! it's almost just like real life.<br><br>this is a movie that takes on race, class, sexuality, anger, fear, pride, remorse, and does it all with great acting, great script, and great directing. well worth the price of admission for those tired of the bs canned movies that Hollywood likes to try and feed us.","user":"gonetotvheaven","rank":[9,12]}]