[{"title":"Not bad at all...heavily flawed though","rating":6,"date":"22 July 2008","review":"It was refreshing to see they reclaimed much of what made the first movie great when making Marauder. The filmmakers tried to copy the 'style' of the first movie, and in some aspects they succeeded. In others however, they failed miserably. Nevertheless, I think they put a lot of effort into the movie this time. For example, the federation broadcasts of the first movie were fantastic because they carried a lot of atmosphere and had so much subtle irony included. In the third movie, I think they overshot the mark a bit. There are a lot of broadcasts and they do a good job helping to create the film's atmosphere, but they are so openly ironic and sometimes it's almost comedy. One would think the officials are crazy to actually air that (Strongly in contrary to the first movie's broadcasts). <br><br>The story is not too bad. If you are willing to overlook some flaws you might find to like it. They even implemented a plot twist, which however was not very surprising at all. What I really could not stand was the needlessly exaggerated part about religion. <br><br>The cast is OK, but I think the filmmakers should have brought more old characters. It was nice to see Rico again; however it seemed the main characters were actually Lola and Dix instead of him. Dix's character also acts unreasonable on several occasions. And I found that the cast for the sky marshal was good, he has some charisma.<br><br>CGI effects are not very impressive. The bugs seem slightly worse animated than in 1997. So do explosions and the settings. The space ships and broadcasts look nice though. <br><br>Music is very average. Aside from the great song in the first broadcast there are no themes that would grab your attention. You would expect much much more of Klaus Badelt after his Pirates of the Caribbean score. Maybe he should have oriented his work more on the fantastic score of Basil Poledouris from the first movie. There is perhaps just one tiny little moment towards the end, where you would notice the music as great support for the scene. But once you notice it, its already over. <br><br>Writing this review I feel that there is actually not much positive to say in detail. But the composition of all these clearly average components is slightly better, because the atmosphere was right. It can be seen that this is in fact a Starship Troopers movie and not only shares the same name, as the second one did.","user":"alexanderwiebe","rank":[127,174]},{"title":"A true Sequel to Starship Troopers","rating":8,"date":"25 August 2008","review":"It's obvious to me that the makers of Starship Troopers 2 simply did not understand the original Starship Troopers movie. Starship Troopers was a great social satire, and is more relevant today than it ever was before. The makers of Starship Troopers 2 thought it was just a dumb war action flick and created their sequel based on that assumption.<br><br>But Starship Troopers was not a movie about a war; it was a movie about the society which waged this war.<br><br>The people who made Starship Trooper 3 did not make the same mistake. They understood the appeal and the message of Starship Troopers, ignored the abysmal second part, and made a true sequel, even expanding on a lot of the themes started in the original.<br><br>If you liked Starship Troopers but did not like the second part, give this one a try (and if you haven't seen part 2, simply assume that Starship Troopers 2 never happened and go straight to 3). You will not be disappointed.","user":"imdb-211","rank":[128,193]},{"title":"starship bloopers","rating":3,"date":"16 July 2008","review":"Usually 'hinsight' created sequels aren't as good as the original and this (part III) is no exception. In fact i sat it out, but was increasingly annoyed by the lack of creativity and intellect. The last half hour is more like a crusade for religion (happens more and more in Hollywood it seems) than a serious attempt to make a good sci fi shoot'em up style movie. So the story is lame, the acting is doable, effects are OK, but nothing new or exciting.<br><br>In the beginning old friends meet again, but these are all new actors (apart from Rico) and this is quite confusing. Obviously the makers found that a problem too, since the emphasis is overdone. The war turns into showbiz and commerce, which is too realistic maybe (?!) and a battle is lost at some secret planet somewhere (its top secret so we aren't supposed to know either) The brass flees from the planet and ends on some other secret planet due to a flat tire, after which Rico has to go get them. And thats good for Rico, since he joined up in a hanging party, which have become in vogue. To 'spice' it up a bit, we get some boob shots and then Rico saves the day. Alls well that ends well, so they overkill a new bug-brain by destroying the whole planet its on. Or at least i hope so, or there will be another sequel. (To stay in sync with the movie) God forbid!<br><br>You can miss it.","user":"jack-964","rank":[39,59]}]