[{"title":"A strangely captivating movie","rating":8,"date":"25 May 2010","review":"\"Valhalla Rising\" is a strange movie that will split the audience into lovers and haters like you can see in the comments here. To me its these movies that are most interesting. If a movie goer sees a movie like this with breathtakingly beautiful and artistic cinematography on a low budget and still rates it with one or two stars, its either pure ignorance or something was struck that resonated in a negative way.<br><br>I already loved the previous movies of director Winding Refn but this one goes into a totally different direction. Its hard to explain the plot because most of it happens in the viewers head. What you see is mostly mythological and religious symbolism all revolving around the main character \"One eye\". A warrior who fights with a raw power of which we never know its human or not because he is mute and keeps the same empty expression in his face throughout the movie (only in some scenes it seems like hints of a smile shine through).<br><br>The movie starts with \"One eye\" held captive and has to fight battles to the death in which he always prevails. This first part of the movie has some raw violence in it and could be viewed as the \"most entertaining\" part because after this \"Valhalla Rising\" turns into a slow moving journey to an unknown place with barely any dialog and a droning ambient soundtrack.<br><br>Its hard to say what really happens in the several segments the movie is split into but the religious tone (\"Hell\", \"Sacrifice\") already show this is not a movie on a more existential level. And as I am still trying to piece the impressions of \"Valhalla Rising\" together I find that its a movie that sticks with you long after watching if you let yourself dive into the dense atmosphere. The imagery is stunning throughout, the most simple shots like a close up of knifes being washed in a river look like a beautiful painting and the constant difference between the beauty of the cinematography and the cold colors, raw violence and the dark droning soundtrack are as captivating as Mads MIkkelsen playing the cold expressionless \"One Eye\" like a force of nature.<br><br>I can't put my finger on what sucked me into this movie but \"Valhalla Rising\" is an experience open minded movie fans should not miss and I am looking forward to future projects from this promising director.","user":"dschmeding","rank":[276,363]},{"title":"TIFF 09: The boy said he was from hell  Valhalla Rising","rating":7,"date":"21 September 2009","review":"Sometimes a movie comes along that is almost indecipherable, but for reasons unknown, still can't be shaken from my consciousness. Nicolas Winding Refn's Valhalla Rising is one such example. It concerns a one-eyed, mute Norse warrior's quest to discover his lot in life and/or death  I really don't know which. It could have been the fatigue of being the fourteenth movie seen in less than four days at the Toronto International Film Festival, or perhaps it was intentionally vague to utilize its mood and gorgeous environments as the true focal points. Winding Refn said before the screening that he always wanted to shoot in an exotic place, and this was the chance to make that a reality. So, with the lavish hillsides of Scotland, he and co-writer Roy Jacobsen brought a tale of Vikings searching for the Holy Land—or a place to set up a new one—with them, listening to heavy metal in order to get into the mindframe of the hell that would take over. I do think all involved understood that the story would be left up to audience interpretation, making it more a journey rather than a strict plot, because star Mads Mikkelsen left us with a cryptic message himself before the projector started going. He said, \"Sit back, relax, and enjoy that imaginary joint.\" It all starts with Mikkelsen's One-Eye in captivity, being used as a fighter against other Norse tribes' best—able to take a beating and always shell out more to achieve victory. Helped by a young boy, Are, (played by Maarten Steven), he soon escapes and kills those holding him captive, taking the boy with him as he travels on, visions of red violence coming into his mind, leading him to an inevitable fate. Using the boy as translator to those they cross paths with, a bond is formed between the two, one that holds One-Eye accountable to protect him no matter what. Eventually finding passage with a Viking vessel of Christians, the captain of which sees the use of having a man of his powers as an ally, a fog soon rolls in as they sail to an unknown land. Conditions become dire as food and drink deplete and the water surrounding them becomes salty and undrinkable. Tensions run high and blame is passed to the warrior, calling him a beacon of evil, already having been told by the boy that he came from hell.<br><br>The visions become more frequent as we wonder if One-Eye is going insane, is a vessel himself for a higher being, or just supernatural in both strength and mind. Red soaked passages eventually come true in the dull, cold palette used to show reality. Violence runs rampart throughout, allegiances, tenuous at best, and survival playing a large role in everything. Maybe this God of a man is some sort of reaper taking the Vikings on a journey to their destruction or perhaps he has only involved them in the trip to his own, but either way, the graphic nature of combat and battle—dirty and personal, just as you'd think it would be with savages such as these—is prevalent at all times. Right from the start we are exposed to the gruesome fights, seeing two men battle in the mud, feeling each punch connect, a battle ending with the decapitation of the loser by the chain holding the victor in place so as not to escape. Brutal in execution and still beautiful in its hellish visuals, one cannot deny the power of image.<br><br>Winding Refn's Vikings are physical specimens of humanity, not exactly giants, but fierce in their mentalities and demeanors. You would not want to get into a fistfight with any, as they would rip you apart limb from limb. It is this gritty realism that helps in the success of the movie, showing this world as being without rules and governed by strength. The leader will be the general that can keep the rest safe, his hold of power only as strong as the respect given him by those he leads. It only takes one moment of weakness to become expendable, killed and tossed to the side as the next warrior rises up. But then you have One-Eye, a man who could take on anyone or all and be victorious. He is not out for the glory or riches that come in war; he is on a spiritual march to whatever future is coming to him in bits and pieces when he closes his eyes.<br><br>Norse mythology is often made into large blonde men wearing horned helmets and furry clothing, weapons at hand to bludgeon and beat. Valhalla Rising doesn't buy into these clichés or stereotypes, instead digging deeper into the mentalities of these people, the rage and religious fervor that lives inside. The Christians want to find salvation or safety of some form, and they aren't afraid to spill blood to find it. So it becomes a combination of mythology and Christianity and survival, men without answers on a journey through hell, or into it. I was a little surprised to hear that distribution rights were purchased after it screened in Toronto, not because it doesn't deserve them—it is a cinematic feat that earns the right to be seen and dissected—but because of its lack of mainstream appeal. So much of the movie is internal, watching actors act without words, making the audience think and decipher what is going on. I just hope the Hollywood machine does not fall into the trap of selling it as a battle royale of Vikings on the sea, a 300 type epic adventure. That would be the greatest disservice of all. The film merits an audience of introspective thinkers and open minds to let the sumptuous nature of all on screen—whether beautiful or disgusting or both—wash over them and grab hold. It isn't so much a movie to be seen, but one to be experienced.","user":"jaredmobarak","rank":[144,203]},{"title":"In the land of the blind, the one-eyed man is king","rating":10,"date":"5 June 2010","review":"Well, I'm not sure how to put this.<br><br>This isn't the movie you would expect. This is a raw and gritty movie, a festival for your eyes, a rare piece of art that dispenses with dialogue, plot and laws of logic for the sake of great cinematography/photography, gripping ambiance and mythology. VALHALLA RISING rendered me speechless. I can't even tell you if it's good - I just want to tell you that it's worth watching. Every minute of it. It is an experience.<br><br>We do not learn much of our (anti-)hero: a warrior-slave, Mads Mikkelsen, is freed from captivity and bands with a group of crusaders who intend on heading to the Holy Land, yet end up, well, in their own little hell.<br><br>There isn't much more to say to the plot, for it hardly matters - mythology matters here, the grand sceneries matter, and the underlying message matters. It aims at showing us how superfluous the Christian God seems in a world of violence; life as a farce in the face of intangible evil. Will you desert your (Christian) God when the time has come? Here lies its main agenda: in a world of the blind, the one-eyed man is king. He is indeed, he ties us to the elemental powers, and rises above.<br><br>A piece of art. Take your time, be patient, and you will enjoy it like no movie before.","user":"nicrok","rank":[261,380]}]