[{"title":"OK but not spectacular","rating":6,"date":"21 October 2009","review":"Every now and then, for reasons known only to itself, the movie machine promotes a movie as being one thing when it is actually something very different. Love Happens is a case in point. The trailer sells it as a romantic comedy: it isn't. Sure, there are some smiles during it, but it is actually a light drama dealing with bereavement and grief.<br><br>Aaron Eckhart is good in a role which stretches him rather further than usual, and Jennifer Aniston is satisfactory in a part which demands little of her than to look attractive, occasionally pleased and, more often, rather puzzled. Martin Sheen is OK in a role which is deceitfully sold initially as one thing but turns out to be quite another. Judy Greer has a small, but entertaining role.<br><br>But pride of place must go to John Carroll Lynch with a strong, sympathetic, and very believable performance in a supporting role.<br><br>I enjoyed this movie even though I felt that it was rather glib in the way it dealt with some elements of the story (the resolution of the relationship between Eckhart and Sheen for instance).","user":"neil-476","rank":[16,17]},{"title":"Not quite what I was expecting","rating":7,"date":"16 September 2009","review":"I went to a preview of this movie last night with my husband. I was expecting the standard romantic comedy chick flick. Although there are plenty of funny moments in this movie, it has an emotional depth that is very appealing. It also has another really great performance by Aaron Eckhart, who must be one of the most unappreciated actors in the business. I'm no Jennifer Aniston fan, but I have to admit she's a talented actress and not just a celebrity when I see her in a role like this. Judy Greer and Dan Fogler are great in supporting roles.<br><br>It's difficult to say much about the plot without giving most of it away. The script is full of the physco-babble you would expect in a movie about a self help guru; sometimes it comes across as intentionally silly, and sometimes it seems to have real meaning. There are small revelations made all the way through the movie that lead up to the final conclusion.<br><br>There is also unexpected eye candy in the form of beautiful floral arrangements that contrast well with the gloomy Seattle weather.<br><br>I was afraid my 56-year-old husband would complain about driving 45 minutes to see a movie like this on a week night. But he also enjoyed it, and there were no complaints. Most of the people in the theater also seemed to enjoy it, although I have to admit that they didn't laugh as much as we did. Not a \"must see\", but if you're looking for some good entertainment, you could do far worse.","user":"gasawaye","rank":[65,83]},{"title":"I enjoyed it, good study in human grief and the difficulty in overcoming loss.","rating":18,"date":"18 May 2010","review":"Aaron Eckhart is Burke. He has written a book after his wife died in an unfortunate car accident 3 years earlier. The book has led to wildly popular seminars where men and women come to spend a week in workshops to help them overcome their own personal losses and move on with their lives. \"You can't move forward as long as you are still looking in the rear-view mirror.\" And as the story is told there is a company working to seal the deal to have Burke DVDs out and a daily one-hour TV show, I suppose along the lines of Dr Phil.<br><br>But Burke his hurting. The seminar this week is in Seattle, and he didn't want to go back to Seattle. That is where his wife died, and where hi in-laws live. He has helped many, but he has not been able to deal with his own grief.<br><br>That is where Jennifer Aniston as Eloise Chandler comes in. She is a single, local florist who provides flowers for the hotel where Burke is staying and holding the seminars. When he first notices her, and approaches her she doesn't speak but tells him something in sign language, which he doesn't understand, and she shrugs and goes off. But the next day he sees her again, at the desk conversing with the clerk, and he dresses her down, for fooling him, for choosing to push away a stranger rather than risk an human interaction. All that sets the stage for the next 90 minutes of off and on interactions between the two. She spots his issue quickly and makes him confront it, even when he doesn't want to.<br><br>Dan Fogler is very good as Lane, his friend and manager who sets up workshops, acts as the Emcee, deals with outside interests, and tries to keep Burke on track and on time. <br><br>The story gets quirky at times but I continually found the Burke and Eloise characters believable. Good movie.<br><br>MAJOR SPOILERS: Burke tells people, and describes in his book, how his wife died, she was driving, a dog came into the road at night, the street was wet, she swerved to avoid the dog and slid into a tree, killing her instantly. But all that was a lie, he was driving, they were arguing over paint colors, and as he eventually tells, \"I killed my wife.\" He was never able to forgive himself, but after he did, and made amends with his in-laws, was able to begin to move on.","user":"TxMike","rank":[10,11]}]