[{"title":"Not Alrightey Then","rating":1,"date":"2 January 2010","review":"This movie is to be avoided if you like the other Ace Ventura Movies, heck avoid it if you liked the cartoon. This movie is almost painful to watch. The kid is a terrible choice for the role being as how he did not look anything like Jim Carrey. The humor also is not on par with the other 2 movies and this movie misleads consumers to capabilities of iPods. This movie should be titled as \"Ace Ventura wouldn't come anywhere near this script with a 100 foot pole cause it just stinks that much\". I couldn't even make it through the whole thing since Knight Rider was on opposite of it when I was watching it and I chose that show to watch instead.","user":"brailsford","rank":[31,31]},{"title":"Why ask why?","rating":1,"date":"2 March 2009","review":"Why was this even attempted? Why did someone think this was a good idea? Why did Art Lafleur waste his time by being in this fluffy kiddie dross? Why is it that the same director that gave us the fantastic The Sandlot couldn't give us a better movie than this? Why is it that the screenwriters for this unfunny cornball dreck think that humor that wouldn't appeal to kids that have heard those same jokes 100 times before would appeal to them now? Why is the main star of the movie(Josh Flitter) only goal is to ape Jim Carrey's character of the original Ace Ventura movies? Why are all of Josh Flitter's screen-mugging antics in vain? Why did they think that him being the son of Ace Ventura was supposed to make us care about his character? Why couldn't the writers of this movie come up with better plot than one that involves the title star trying to free his mom from jail from a case involving a missing panda? Why does all the slapstick and lame gags(farting animals and stupid pratfalls) fall flatter than Suge Knight after one punch? Why is it that the only people that would find this stale movie funny and good are the same deranged people that though that Superbabies, Ed, Master Of Disguise and Baby Geniuses were good movies? Why cant a movie of this type appeal to all ages(like better family movies in the past have done)instead of just kids? Why cant money be spent on better movie ideas than laugh-free bile like this? Why ask why? <br><br>You get the drift. Canned acting by all and corny brain-rotting jokes and gags written by morons that assume that all kids must be morons. Here's a joke: What do you get when you cross a rhesus monkey with Reese's Pieces? A Rhesus Pieces monkey! That stupid and cheesy joke best describes the humor in this movie. So if you found that joke funny you'll love this film. If not then stay far away. Do not let these greedy Follywood executives have the last laugh or the jokes on you... literally. HEE HEE HEE, HAW HAW HAW, HARDY HAR HAR!!!","user":"Newsense","rank":[26,26]},{"title":"I say these words as a HUGE 'Ace Ventura' fan...","rating":1,"date":"15 October 2009","review":"What the f*ck! Seriously, i am probably the biggest Ace Ventura fan and when i heard the news about a 3rd movie some years ago i was very excited. And from following the updates of this film from beginning to end, my expectations slowly started to decrease...and when the trailer hit the internet i was speechless... literally.<br><br>And that was just the beginning, the film came out on DVD and as curious as i am, i went and got it... and that was most likely the biggest mistake of my life.<br><br>From beginning to end, i felt like i was being tortured yet i couldn't look away... i couldn't believe my eyes... i couldn't believe what the f*ck they just did to Ace Ventura!","user":"GMFinneyProductions","rank":[49,52]}]