[{"title":"Fantastic Lovecraftian Horror And Hard-Hitting Political Allegory: One Of The Most Faithful King Adaptations To Date","rating":27,"date":"27 March 2019","review":"In the hands of a lesser filmmaker than Frank Darabont and processed through the mind of a typical studio screenwriter (like, for example, Akiva Goldsman), a Hollywood film adaptation of Stephen King's novella THE MIST would undoubtedly have become your run-of-the-mill monster movie: creatures from another dimension devour people trapped in a mall (presumably the monsters pick them off one-by-one, ten-little-Indians style). But the most captivating thing in King's story is not really the plot about the monsters and the \"breach\" into another dimension (although I love that idea): it's how the human characters react to it and what happens between them.<br><br>In staying faithful to the source material, Darabont uses the microcosm consisting of the people trapped in a small town supermarket to explore the dynamics and power shifts that happen very quickly within a society when a powerful outside threat appears. Just like King's excellent novella, the film is a hard hitting allegory for how easily even seemingly civilized countries become susceptible to the messages of demagogues when they are faced with a serious crisis. And it not only manages to perfectly capture the subtext and political undercurrent of the novel, Darabont's film also gives the audience a true sense of the Lovecraftian horror King unleashed on the page. As it is, THE MIST isn't just one of the most faithful King adaptations to date, it's one of the best horror films of the new millennium.<br><br>P.S. (for new IMDb users): In case you don't know whether to trust this review or not, because you have no idea what my tastes in film are, just click on my username - gogoschka-1 - and you'll see a list what my 50 favorite movies are.","user":"gogoschka-1","rank":[70,86]},{"title":"One of the best horror films I've seen in a long, long time","rating":10,"date":"29 March 2008","review":"On first impressions The Mist doesn't remotely seem like the kind of film anyone should be excited about. The Mist, what? A bit like The Fog, then. Stephen King's The Mist, oh, that makes it even worse. Directed by Frank Darabont, since when did he direct horror films? Okay, so he scripted Nightmare on Elm Street 3 and The Blob, not bad films, but not classics in any sense. Starring Thomas Jane, has anyone seen The Punisher. And, to cap it all, The Mist died a quick death at the US box office. It'll probably go straight to DVD in the UK.<br><br>The only reason I bought and watched the film was on a recommendation from a friend. He pleaded: \"You have to see this film. You won't believe how good it is.\" So I put his judgement to the test.<br><br>And thank God. This is a great horror film. From the opening scene, Darabont sets a tone that's creepy, sinister and beautifully judged. The script is realistic, the character are believable and the direction... Darabont has almost reinvented himself. The Mist is dark, scary and even funny (intentionally). You care about the characters, the scary scenes are scary, and the whole film is carried off with an efficiency, a lack of pretension and a strong idea of what makes a good, if not great, horror film.<br><br>And the ending... how dark can you get? I can understand why this didn't do well at the box office. But neither did Shawshank Redemption...","user":"arichards22","rank":[418,592]},{"title":"\"The Mist\" is worth watching!","rating":9,"date":"22 November 2007","review":"I've been a member of IMDb for many years now and rarely do I take the time to comment on a film. In addition, I watch, on average, about 10-15 films a month, split among all genres including horror. Lately though, I've been very disenfranchised with most horror films especially with the proliferation of shock/gore/splatter/torture-porn films such as Hostel 2, The latest Saw film, Captivity, etc. Enter \"The Mist\" and I leave the theater saying to myself \"this is why I go see movies\".<br><br>Frank Darabont should be the only one adapting Steven King novels and short stories...period. He brings a human balance that's missing in most horror films these days. You can have the most unbelievable, and maybe even the most ludicrous, situations and events, but if you make the characters believable and further peel the layers to expose fear, prejudices and vulnerability then you have the foundations towards making an effective film. I was absolutely gripped during the entire film, and that all-too-rare-these-days sense of dread permeates through almost every scene and left me emotionally exhausted at the end. And speaking of the ending, isn't that what almost everyone is talking about? I'm not going to give anything away, but in my opinion, I loved it. I can see why it can split into camps of \"loved it\"/\"didn't like it\" but for me it was a great conclusion to the entire storyline of the human condition. I wouldn't have changed a thing.","user":"Groovespeed","rank":[473,691]}]