[{"title":"I Don't Know What Haters Were Expecting But It Did Exactly What It Set Out To Do","rating":10,"date":"3 May 2008","review":"and that would be, entertain.<br><br>I can't describe how many times I thought 'whoah!' it's one of those moments that could only ever happen in cartoons or 'whoa!' that was anime level crazy! This film set out to create a literal live action adaptation of a lovable &amp; cheesy retro cartoon anime. That's exactly what it did.<br><br>Let's start with the PG rating, this was appropriate not because this film is 'aimed' at kids (which it wasn't clearly, as box office disconnect showed) but because it's a 'family' film for all ages based on a cartoon that most of the older generation watched when they were kids, the source material barely even bordered a 12A and yet the film managed to in fact surpass it's source material in maturity. <br><br>Fans of anime will seriously lap this up despite what the recent comments have said. Not only has every care been taken to preserve elements of the source material but it also has those cool retro and also modern anime moments. Good and bad guys with crazy cartoon anime hairstyles, crazy over-the-top kung fu, elaborate motion line effects just like in mangas, crazy death defying races, cheesy as hell dialogue which fits perfectly in context! Performances were quite impressive given it's a predominantly 'kids' PG film and that they were filming against green screen.<br><br>I also commend the Wachowski's use of such a strong colour palette.They didn't tone it down or diverge from the theme and each scene had a contextual wash of colour.Serious or more intimate moments had darker shadows while remaining colourfully vibrant. They were bold and not shy about what this film was going to look like.<br><br>To the haters again i say ,'what exactly where you expecting? The Matrix with cars?, people getting there throats slit?, symbolic commentary on capitalism,corruption, religion or the new world order? Go into this movie expecting high adrenaline scenes and all campy fun that only a 60's anime adaptation can provide, but don't just to go and watch it just to 'see what the fuss is about' until you actually understand what the source material was like. That way the movie will exceed your expectations.<br><br>I don't have complete praise for this movie however, in that towards the end of the film they got a little overboard with the editing and i was really let down by the final antagonist type drivers. Speed seemed to have a harder time in the casa cristo race in the film where the other drivers were far more menacing. It seemed like 'Cannonball Taylor', 'Gray Ghost' and especially the bad ass, white haired yakuza driver (for musha motors by the way) were just a flash gone by and Speed just beat them without any problems at all. Let's hope they make more of a presence in any semblance of an extended/directors cut","user":"moinsyyed","rank":[425,606]},{"title":"A good family movie","rating":8,"date":"6 May 2008","review":"I have to say, it seems that those who hated it were obviously not doing their homework beforehand to know that SR is not supposed to be a thought-provoking film like The Matrix. It is based on a wonderfully simple cartoon with a simple message for kids. If anyone knows anything about cult fans, they want films to reflect the original medium as much as possible. Thus, if you go to a children's movie based on a child-friendly anime, expect it to be such and not some mind-blowing,challenging film. Especially these days, we need films like this one to take our minds off the usual violence and such found in so many other so-called family movies. Take it as it is, a great family flick for ALL ages to simply enjoy.","user":"nicib32","rank":[249,365]},{"title":"First Place Winner","rating":9,"date":"4 May 2008","review":"I must admit that I know, or knew rather, very little about the story or history of Speed Racer- and his TV series - and maybe that is why I enjoyed this movie so much. Although, this is still a different type of situation where one who was a big fan of the shows might be seriously critical of every little detail of the turned movie. I don't believe anyone who considers themselves truly knowledgeable about Tatsuo Yoshida's work can say that this was not represented well on the big screen. I'm now intrigued to go back and check out some episodes of Speed Racer.<br><br>That aside, as far as it being a movie and a work of art, I would give this movie high marks in both categories. For it being a movie, it was nice to see something so different as far as the approach to making it go. Also, having such an incredible cast makes it all the more intriguing. I don't see anyone else having portrayed any of these characters any better than the cast that was hired to do so.<br><br>On an artistic level, it is extremely hard to think of any other movie that comes close to being in the same league. I did not see The Matrix, but I would say that anyone who liked Sin City for its cinematography and graphic elements, would love Speed Racer. The use of bright photography that's added behind a green screen makes for a far more dramatic effect. <br><br>Take the artistic elements of this movie, and put it together with the amazing cast (both looks and talent) and throw it together with a very different but coherent plot, and you've got yourself an extremely enjoyable movie that is definitely worth seeing. And seeing at the theater no less! My hats off to The Wachowski Brothers, and the rest of the cast and crew for putting together something different for a change.<br><br>GO...","user":"ingloriousbasterds","rank":[282,424]}]