[{"title":"Compelling and Layered Costume Drama","rating":7,"date":"5 September 2008","review":"The Duchess is a superior slice of costume drama which manages to craft interesting, multi dimensional characters and an involving storyline from the well worn confines of the genre.<br><br>Keira Knightley plays a very similar role to the one she played in Pride and Prejudice, a feisty, modern woman trapped in a male dominated society. However, whereas Lizzie Bennett's heart and character inspires affection, the Duchess of Devonshire's fosters only reproach and punishment from her traditional and patriarchal husband. Her performance is a standout and demonstrates why she is so highly rated in the face of many disappointing roles in other films. She brings both strength and weakness to the character. Able to deliver withering put downs at her husband and others, whilst showing the pain of her loveless marriage etched into her face.<br><br>If Knightley is the lynchpin of the piece then it is Ralph Fiennes that elevates it above a crowded genre. Resisting the temptation to play his character as evil, instead he simply plays him as a man of his times. In Fiennes' hands the Duke feels no need to win any bouts of verbal jousting with his wife as he is secure in the knowledge that, as a husband, he is in complete control of the relationship. The Duke also clearly sees very little wrong in his treatment of his wife and acts, as he sees it, in a logic manner making the whole film feel more believable and, as a result, tragic.<br><br>In terms of the cast the only misstep is Dominic Cooper as Charles Grey, who lends the wide eyes of a political dreamer but doesn't have convincing chemistry with Knightley and plays one of the more one dimensional characters in the piece. However Hayley Atwell impresses by playing her character so well it is possible to describe her as scheming, and manipulative as well as sympathetic and loyal without it seeming a contradiction.<br><br>The film is deliberately paced so as to give characters and events time to breathe, encouraging the mood that the marriage is a car crash in slow motion, inextricably drawing all the characters further into the muddled mess of their relationships. Overall it's a fully recommended slice of real life costume drama that draws a multi layered drama full of compellingly deep characters from what could easily have been a one note story.","user":"milofromtheblock","rank":[153,195]},{"title":"ignore the critics, the duchess is spellbinding","rating":9,"date":"14 September 2008","review":"After reading copious amounts of mediocre reviews for \"The duchess\", I wasn't expecting much from this film. However, from the first scene I was utterly absorbed.<br><br>The film isn't \"just another period drama\", it is an absolutely beautiful and heart-rendering tale of the tribulations faced by Georgian woman. Georgiana, Duchess of Devonshire, who although is the key character in the film (as you can probably infer from the title), represents the situation of all woman belonging to a patriarchal society, not just the aristocracy.<br><br>Keira knightly is exemplary in this role. Her facial expression tells more than a script ever could. I enjoyed her performance in \"atonement\" but this was in a whole new league. Ralph Fiennes was also excellent. My best advice is to ignore the critics and come to your own conclusion. My only negative criticism was the rapidity with which Georgiana bonded so intimately with Bess. However, I don't know enough about the social context of the time to really make a judgement.<br><br>All in all, a deeply moving tale that shouldn't be neglected.","user":"ekartawick","rank":[165,229]},{"title":"An entertaining film which promises much for the future","rating":8,"date":"13 September 2008","review":"The career of Keira Knightley has been somewhat of a mixed bag. She has had strong moments, invariably under the direction of Joe Wright, and she has had her less brilliant moments, mainly in the later \"Pirates of the Caribbean\" films. But, in \"The Duchess\", an entertaining and moving portrait of Georgiana, the Duchess of Devonshire, she truly shows signs that she is coming of age with a performance of subtlety and nuance.<br><br>The film has been marketed with not so subtle emphases on Georgiana's relative, Diana, Princess of Wales. The tagline for the film, \"There were three people in her marriage\", is not only, by my count, a miscalculation (a serious miscalculation if you count the dogs) but also guilty of creating a subtext which simply isn't in the film. Anybody looking for a film about Diana will be disappointed. Anyone looking for an entertaining film won't be.<br><br>The film is a moving portrait of a very tragic figure, brought to life by a career best performance from Keira Knightely. Her abilities have grown over recent years, with \"Atonement\" being her previous best, but here she shows great potential. She is ably supported by Ralph Fiennes, who is on fine form. His performance never descends into caricature or cartoonish villainy, but maintains a sense of humanity, no matter how selfish it is, underneath his characters various inexcusable actions. There is also a fine performance from Charlotte Rampling, though there is a weak link in the person of Dominic Cooper, who is too young for his part and struggles with it.<br><br>The witty and emotive script has a lot to recommend it and its characters are put into an engrossing and lavish world, successfully created by the director Saul Dibb. Extraordinary costumes fill the extraordinary locations, and there is a beautiful score by Rachael Portman to accompany it. The result is a fairly stylish affair.<br><br>The film's exploration of unfortunate innocence and the loss of freedom is at times poignant and adds to what is an extremely satisfying experience at the cinema and provides a great deal of promise for the future from its director and its star.","user":"blackburnj-1","rank":[125,180]}]