[{"title":"Alicia Vikander is superb","rating":8,"date":"14 February 2016","review":"Because of the subject matter in The Danish Girl I wasn't sure this was going to be a film that I would particularly like but I need not have have worried because I thought this was a fascinating movie that justified it's plaudits. This is the story of Danish artist Einar Wegener (Eddie Redmayne) who realised that despite being born a man he is really a woman and that woman is called Lile. Although Redmayne will quite obviously get all the praise for his role as Lile but I think the outstanding performance of this film comes from Alicia Vikander who plays his wife. As an actor she is exposed unlike Redmayne who has the make up to hide behind. Instead of being about Lile this film for me is more about the love of his wife who will do anything to make her husband happy. Even if that means losing him. in the process.","user":"valleyjohn","rank":[78,90]},{"title":"Excellent Performances from the Two Leads","rating":30,"date":"30 January 2016","review":"The Danish Girl (2015)<br><br>*** (out of 4) <br><br>The semi true-story of painters Einar (Eddie Redmayne) and Gerda Wegener (Alicia Vikander), a married couple who find their lives changing when Einar dresses as a woman so Gerda can have someone to paint but it brings something out in him. Soon Einar is going around as the Lili character and soon decides that he's a woman on the inside.<br><br>THE DANISH GIRL is another beautiful looking film from Tom Hooper, the director best known for his Oscar-winner THE KING'S SPEECH. Like that film the director has no problem with the visual look of the film and Hooper certainly knows how to put you in the period setting. It also doesn't hurt that we've got some excellent performances and a rather interesting and conflicted love story.<br><br>I think the real draw here are the performances with Redmayne once again delivering a remarkable piece of work just a year after his Oscar win for THE THEORY OF EVERYTHING. A lot of actors have played male/female characters to perfection. In my mind the greatest was Dustin Hoffman in TOOTSIE but that there was a comedy whereas this here certainly isn't. It was really remarkable seeing how well Redmayne played both the male and female character and he was certainly believable as both. Whenever the Lili character was on screen you really did feel as if you were watching an actress and not just a man playing a female. Vikander is also excellent as the woman who finds the man she love slowly turning into someone else.<br><br>The film features some beautiful cinematography, a great music score and I also thought the screenplay was very good. The story itself drags a tad bit during the first portion but I think it asks a lot of really good questions about what love is and of course what one feels about who they really are. I thought the flow of the film was quite good and there's no question that it nails the costume design and sets. THE DANISH GIRL isn't a masterpiece but it's certainly a very good movie with some excellent performances.","user":"Michael_Elliott","rank":[31,37]},{"title":"Vikander shines but overall it didn't connect with me as expected","rating":7,"date":"4 January 2016","review":"The new cinema year has got off to a robust start with the new movie from Tom Hooper (\"The King's Speech\", \"Les Misérables\"). <br><br>We have seen many depictions of physical torture on the screen over the years, from the interminable teen-slasher pics, through 'that chair scene' in \"Casino Royale\" to the stylized presentations of Quentin Tarantino and Martin Scorsese in films like \"Reservoir Dogs\" and \"Casino\". \"The Danish Girl\" is also in its way a film about torture, but more akin to the mental torture seen in films like \"Buried\" or \"Flightpath\". What must it be like to be trapped with a sexual orientation that you feel is not your own? To possess physical body parts you don't believe you should have? And all in a time (the 1920's) when an exposed ankle was considered slightly daring.<br><br>Based on a true story, Oscar-winner Eddie Redmayne (\"The Theory of Everything\") and Alicia Vikander (\"Ex Machina\") play a bohemian married couple Einar and Gerda Wegener, apparently happily married and trying for a child in 1920's Copenhagen. Einar is a renowned landscape artist with his wife a struggling portrait artist living in his shadow. After taking part in a cross-dressing modelling session, strong feelings are awakened in Einar. As a bit of a 'game' Gerda encourages him to explore the character of his alter-ego \"Lili\" further: a big mistake, as Einar is swept into a spiral of confusion and self-doubt.<br><br>Eddie Redmayne is surely up for another Oscar-nomination for his brave performance as Einar/Lili, using his expressive eyes to great effect and delivering a truly heart-rending performance. With all this said however, I never quite believed I was watching the character of Lili but more Redmayne acting the character. Perhaps this is unfair, as Einar/Lili is such a bizarrely multi-dimensional person no one could perhaps have played him/her to my satisfaction. But I suspect (particularly as Redmayne won last year) this won't bring Redmayne the Oscar double. <br><br>Far more impressive for me was the delicious and delightful Alicia Vikander, once more turning in a fantastic performance as the increasingly desperate (both psychologically and sexually) Gerda. With Rooney Mara, Vikander must be one of the brightest actress talents in today's cinema. <br><br>Also turning in a strong performance, in what is a very limited cast list, is Matthias Schoenaerts (\"Far from the Madding Crowd\") as a Parisian art dealer with a link to Einar's past. The omni-present (sorry, that should read \"hard-working\") Ben Whishaw turns up again as a party guest with an unhealthy interest in Lili and Sebastian Koch (most recently seen in series 5 of \"Homeland\") plays Dr Warnekros who is a pioneer in the new and risky business of sexual reassignment surgery.<br><br>Another star of the film is the luscious Danish capital, filmed in vibrant colours, as if from the artists' palettes, by Danny Cohen, a Hooper favourite. Also a big surprise to me was the gloriously photographed Danish countryside, seen at the end of the film, with mountains and seascapes I never knew existed.<br><br>Another Hooper alumni, Alexandre Desplat, supplies the soupy but very fitting score.<br><br>While the film features a compelling story and much impressive acting, I never personally felt as connected to the story as I was to \"The King's Speech\". This isn't helped by a rather stagy script by Lucinda Coxon that feels lightweight at times. Perhaps its because we are in Oscar- season but, to me, it all felt a tad pretentious and (no pun intended) could have done with a few snips in places to reduce the running time by 15 minutes or so. That being said, and as an alternative view, I should point out that my wife was in tears for a good proportion of the film and disagrees vehemently with my views. I say \"my wife\", but since watching the film she's started wearing braces and smoking cigars – so I'm rather confused as to WHAT exactly is going on. :-)<br><br>(For the graphical version of this review, see bob-the-movie-man.com. Thanks).","user":"bob-the-movie-man","rank":[76,104]}]