[{"title":"Slick Mayhem","rating":8,"date":"3 January 2011","review":"Frontier(s) is a fast-paced, very violent thrill-ride from Xavier Gens. While it won't be everyone's taste, for fans of full-on gruesome action it's a must. It's basically a very decent version of 'Hostel' with a couple of thugs on the run from riot-torn Paris who seek refuge at a seedy hotel, unbeknownst what lies ahead. It's not a great film by any means but it is a thrilling one. The lead actress did a great job, but there's also good stuff the actor who played Farid and the actor who played the meathead lunatic. Its style is slick, just what I enjoy watching. Fans of the genre will know what to expect, others may not. But I recommend 'Frontier(s) for a mind-f*ck of a night. ***/*****","user":"seany_c","rank":[23,27]},{"title":"Lives not closely up to the hype","rating":5,"date":"31 March 2008","review":"Damn, after really good french movies like A L'interieur and High Tension I was really eager to see Frontieres from reading all the positive reviews. The movie starts out kind of different with political riots and some kids who seem to have stolen money in the hassle. After some dramatic departure of one gang member they flee and split up to meet at the border to go to the Netherlands. The first two take a break in a hostel (Yeah, Hostel everyone!) where they soon meet some strange backwoods girls and a butcher guy... after some uninspired sex with the girls the action breaks loose just waiting for the other 2 to arrive You can pretty much guess what happens... like in a million other movies they were killing tourists for years (clicheed pictures of boxes full of cellphones and passports and abandoned cards hint to that like in Wrong Turn etc.). Its exactly the old TCM Theme with a real messed up family which in this case happen to be the followers of some cliché Neonazi who talks a real fake mix of french and German. You get some violence and torture and like the french love it the only girl turns out to be the toughest of the gang. The cinematography is nice, the acting is OK, the gore is kind of average considering that we live in the age of torture-porn Saw/Hostel movies and the violence is not as over the top as I expected. What bothered me about Frontieres is the strange pacing... the movie is way to long and beginning and end are strangely torn by some cheesy dramatic elements (the female main actor real overacts the last sequences... it seemed way off to me how they were all permanently crying in this movie or telling each other how the love them). The main part of the movie is stretched and seems kind of random in how the family story is implemented. Its just puzzled together with a decrepit slobbering grandma, then some deformed children in the basement, Nazi Daddy and the obligatory good character in form of a seemingly sick girl who lends a helping hand in the backwoods mess. Most of this stuff is just thrown in, dropped off and doesn't work as creepy as e.g. the family story in TCM2 but rather seems like a patchwork of loose ideas. Frontieres is not a bad movie but it suffers from a kind of stylistic inconsistency that throws it from drama to hostel-horror to weird action-style shootouts and back to drama. I am a friend of movies that try to break the genre boundaries but this one didn't quite work. I think A L'interieur did that way better. If you just rent this for he violence you can fast-forward this but you won't see anything you haven't seen in other movies before... OK, maybe I never saw a messed up girl in such a bloody bloody white dress but the whole idea was there ... in other french movies of the recent past. Overall a rather average movie that obviously stole too many ideas from here and there.","user":"dschmeding","rank":[47,67]},{"title":"A decent enough movie, worth the watch.","rating":7,"date":"15 October 2015","review":"If you're a fan of over the top blood,gore and violence,then Frontier(s) is most definitely the film for you. I was hesitant before I watched this,mainly because of the reviews I had seen prior to watching the film.But,I had to take all of that out of my head,and watch this film going in with an open mind.I have to admit,though the film was not an absolute masterpiece,I was pleasantly surprised. The film itself was decent.The story wasn't exactly strong,and was not exactly original.You literally know after 20 minutes of the film what is going to happen.It is far too predictable,but it is still an entertaining watch! The problem is,this film has too many elements of other well known horror films,that most horror fans will have seen and will notice these similarities.I would say this film is like a French version of a mix between The Texas Chainsaw Massacre,Saw 2,Hostel and The Hills Have Eyes,maybe. Due to the fact it is basically about a group of young Europeans,that go to a hostel,which is occupied by some f*cked up cannibalistic Neo-Nazi family,which they hunt down in a maze and torture and kill them,but the main character of the film escapes in the end.Basically the same old,same old. It's a good film,very entertaining.I would recommend renting/streaming this,but don't waste money on buying this on DVD.","user":"yourmumisawhore","rank":[4,4]}]