[{"title":"Awful. A Waste of Money","rating":1,"date":"20 April 2009","review":"Very disappointed. I thought this was going to be an action movie.<br><br>What I got was a boring family drama that is more like a bad after-school special.<br><br>Felix (Leguizamo) works as a bank driver in the slums of L.A. and he's the all-around good guy with loving family (Rosie Perez plays the cliché role of the wife). Then he's shot in the head and becomes a real angry person. The police think it was an inside job and suspect Leguizamo, who in turn tries to find who really did the robbery.<br><br>Yes, we've seen this story before hundreds of times, and done much better. If there was more action and less family drama, this might have been watchable, but this is a boring, predictable movie that will put you to sleep.","user":"minigiraffe6","rank":[34,53]},{"title":"Begins Well, But Then Turns Dumb. Is It Too Much To Ask For A Little Physical Reality?","rating":3,"date":"11 April 2008","review":"At the end of this film, as the hero John Leguizamo is chasing the villain Tyrese Gibson down the crowed streets of LA, Gibson fires his weapon at Leguizamo multiple times.<br><br>In the cross fire, one innocent passerby is shot and a cop is killed, but there are no other casualties despite there being at least 100 other people standing around watching. I understand that the laws of physics in movie-land mean that stray bullets never hit anyone else down the block, but this is pushing it a bit.<br><br>And apparently, no one in downtown LA has a cell phone, or if they do, they have either all used up their minutes or their batteries are dead because no one even attempts to call the police.<br><br>Furthermore, I counted 18 shots fired by Tyrese Gibson (give or take a couple) and he never re-loads his handgun. Is this even possible? Perhaps it is. I am not a handgun expert so I do not know what kind of gun Gibson had or how many bullets are in each clip.<br><br>One thing I do know is that if I am more interested in counting the gunshots during the climax of this film instead of caring about the resolution of the story, then something has gone very wrong with the film in question.<br><br>This is a shame because The Take starts off so well and for over half its running time it is an original and compelling story, only to fall apart at the end with cliché dramatics, dumb characterizations and ludicrous plot points, not to mention physical impossibilities that would have embarrassed Jerry Bruckheimer, and we know how impervious he is to cinematic embarrassment.<br><br>John Leguizamo (a personal favorite actor) stars as a family man who works as a driver for an armored car company. One Friday, he is out on his usual run when his truck is hijacked and with a gun held to his head and the threat that his family will be harmed if he does not cooperate, Leguizamo is forced to take the bad guy Tyrese Gibson (in a one note performance) around collecting money from the various businesses that have a contract with the armored car company.<br><br>Back at the company garage, the bad guys shoot several other guards and in a final moment of meanness, Gibson shoots Leguizamo in the head and leaves him for dead.<br><br>At this point, we follow Leguizamo as he is taken to the hospital, undergoes some of the most realistic brain surgery I have ever seen in a film and then goes through a slow, difficult recovery complete with slurred speech, wild mood swings and a general depression and frustration at the turn his life has taken and how it affects his family.<br><br>This is all great stuff and not usually seen in films for the mass audience. Even the FBI investigation of the robbery (why the FBI is involved and not the LA Police, I do not know) begins properly with the always good Bobby Cannavale determining early on that the heist must have been an inside job (we know that it was), but then things turn stupid when they try to build a case against Leguizamo as the inside guy even though the FBI knows for certain that Leguizamo's partner that night was definitely the guy involved.<br><br>This makes no sense what so ever and neither does Leguizamo deciding he has to track down Tyrese Gibson himself. It is at this point, just past the halfway point that The Take begins to devolve into a clichéd muddle of astounding proportions. I have never seen a film start out so good and end up so bad as this one does and it's a real shame.<br><br>For the record, John Leguizamo is very good in the early part of the film and I am glad to see he still doesn't mind playing a character who's a bit of an asshole. Rosie Perez is good too and I get the feeling a lot of her performance may have been cut out of the final film.<br><br>One thing I did not like was the strange look of the film. It has a dark grainy look with desaturated colors in a weird and limited palette.<br><br>I have no idea what the filmmakers were trying to do with this color choice, but it was very annoying and there was not a single shot in the entire film where I said, \"Hey, that's a nice shot\". Not even at sunset and I have seen LA at sunset.<br><br>But then, to me no LA film has ever looked as good as when cinematographer Theo Van de Sande filmed Miracle Mile there 20 some odd years ago presenting us with the most beautiful nighttime cityscapes I have ever seen.<br><br>The director of The Take, Brad Furman was at the film today and held a brief Q &amp; A after the screening and while I was discussing my disappointment in the film outside the theater, someone pointed him out to me, but the young man (who seemed like a decent sort) was engaged in conversation with some fans who obviously liked the film. He didn't need me to rain on his parade.<br><br>Besides, I'm not entirely sure the faults in the film were the directors. I have a suspicion the script let him down or maybe the producers insisted on something more cliché at the finale to make up for the originality at the beginning.","user":"Michael-70","rank":[25,40]},{"title":"Excellent","rating":10,"date":"13 April 2011","review":"Woah.<br><br>The Take is a drama starring John Leguizamo, Tyrese Gibson, Bobby Carnavale, and Rosie Perez. Leguizamo plays an armored truck driver named Felix who is shot in the head in a robbery by Tyrese Gibson. The film mainly involves the aftermath of the shooting and how everyone was affected by it as well as Felix wanting revenge.<br><br>This movie is excellent. Leguziamo gives an extraordinary and very powerful performance. Tyrese Gibson gives the best performance of his career as a very brutal and frightening villain. Rosie Perez and bobby Carnavale were also excellent.<br><br>There are plenty of reasons to hate this movie. It's low budget. It's slow paced. The camera is a bit shaky at times. But this didn't bother me. The storyline is very engaging and the conclusion is very intense and satisfying. Get past a few plot holes and you'll be satisfied.","user":"dbean66","rank":[7,9]}]