[{"title":"More of the same. But Bloodier.","rating":6,"date":"30 August 2007","review":"Mutated hillbillies can be a real pain in the arse. And eye socket. Basically, more of the same from the franchise that wants to be the next Texas Chainsaw Massacre. This time out, instead of Eliza Dushku, we get the quite gorgeous Erica Leerhsen (from... wait, you'll never guess - The Texas chainsaw Massacre remake) and the less than lithe figure of Henry Rollins as the main characters. <br><br>A reality TV show show called The Apocalypse sets up it's cameras in the same mutant-infested forest as the last film and the local residents quickly set about slicing and dicing the interlopers like an enraged Gordon Ramsey. Body parts fly off in every direction and blood gushes, spurts, leaks, drops, squirts and cascades in virtually every scene. If you could define this movie in one word, it would be \"wet\". There's a gratuitous boob shot and obligatory sex scene to keep the titillation quota up in between the carnage, but there's so little story that you could write it on the back of a matchbox. Not that story actually matters here one little bit. <br><br>Rollins is an ex-marine turned TV presenter who, when he realises the hills not only have eyes but bear traps, axes and other assorted blunt and sharp weaponry, turns into Arnold Schwarzenegger faster than you can say \"Last twenty minutes of Predator\". I'm not giving anything away by saying the bad guys get killed and the prettiest girl survives, but poor old Hank? Well, let's just say he's not likely to feature in another sequel... <br><br>All in all, it's your typical teens/twenty-somethings against psychos scenario. All is played out with arse-numbing inevitability, with only the gore and death scenes to keep you wondering what's going to happen next. Basically, if you didn't like the first one, then you'll hate this. Oh, and it contains probably the most unintentionally stupid tagged on twist ending I think I may have ever seen. One of those moments that if you're watching it at the cinema, you'll burst out laughing, feel embarrassed for a second or two before you realising everybody else has done exactly the same.","user":"Darkweasel","rank":[43,53]},{"title":"gory, entertaining","rating":6,"date":"30 August 2007","review":"First, i must say, I'm kinda bored by now with the variations of inbred, genetically deformed n so on cannibals, but i thought i give it a try as a no-brain movie, the only real reason to watch being the participation of Henry Rollins. Also, its quite entertaining how the genre tries to outbid the last movie with even more cruel gore than the last one. I guess its become a practice , in which they have a violent film, that gets an uncut edition on DVD, so it might sell more. As i said, as a no-brain, its entertaining, a great film to watch not alone, but with friends-so you can comment on the gory parts.But honestly, the remakes and the stealing of old ideas has become so lame","user":"sabine-krahl","rank":[73,103]},{"title":"A Replay of Many Other Movies  But with More Gore and Originality in the Deaths","rating":7,"date":"30 November 2007","review":"In Greenbrier Back Country, West Virginia, the retired military Dale Murphy (Henry Rollins) is hosting a tough survivor show where the winner takes US$ 100,000.00. The proposal of the reality show is to survive in the woods in the most adverse conditions, following predetermined rules. Sooner the contestants find that they are really fighting to survive against a strong, sadistic and violent cannibalistic family with the appearance of monsters. Further, Colonel Dale discloses that many years ago, an abandoned pulp mill released chemical wastes on the creek, killing the animals and transforming the descendants of a local family in deformed mutants. Without animals to hunt or fish to catch, the next generation chases travelers to feed themselves.<br><br>\"Wrong Turn 2: Dead End\" has an unoriginal story that I have seen many times, and seems to be a replay of parts of many other movies, like for example \"The Texas Chainsaw Massacre\", \"The Hills Have Eyes\", \"Timber Falls\", \"Wrong Turn\" plus breasts of a sexy girl and a collection of clichés of the genre. However, this film is surprisingly good, having more gore and originality in the deaths than the usual; and works, hooking the attention of the viewer until the very last scene. The death of Kimberly Caldwell in the beginning gives a great introduction of how bloody this film is. When I see this type of movie, I try to guess what will happen to the potential victims, if they will survive or die, and the gore resolution of this movie is good. The make-up and the special effects are impressive. In my opinion, fans of the genre will not be disappointed with this film. My vote is seven.<br><br>Title (Brazil): \"Floresta do Mal\" (\"Forest of the Evil\")","user":"claudio_carvalho","rank":[27,39]}]