[{"title":"A provocative Road to take","rating":10,"date":"9 April 2008","review":"A full six months after Reservation Road was supposed to release in theaters (it did, only in a very quiet handful), the film is finally, and again, very quietly put out on DVD. I had been looking forward to this film for some time and had been shocked by it's ill-treatment from Focus Features. After receiving it from Netflix and viewing it, I went out the very next day to purchase it. Where I was expecting a slow, wrenching exploration of grief and loss, this film actually surprised me with an untold amount of suspense and thrills. It certainly is not a \"thriller\" perhaps, but where the story goes and how these characters react leaves you on edge in several instances where you're not only unsure of what they will do next, but you're not sure what you would do next.<br><br>I had read a lot about this movie before seeing it, so there were some reveals that I already knew about from my own curiosity as well as some misguided choices in what is shown in the trailer. I would have liked to see it fresh, so I will give plot points sparingly. Ethan and Grace Lerner (Joaquin Phoenix and Jennifer Connelly, respectively) are a well-to-do couple living in an affluent Connecticut town who lose a child in a hit and run accident. Dwight Arno (Mark Ruffalo) is speeding home to deliver his young son to his ex-wife (Mira Sorvino) and leaves the scene. The unfolding story effectively explores how the Lerner family struggles to cope with an unimaginable loss to an unknown perpetrator, and how Dwight wrestles with his fragile conscience while trying to hide his crime from the authorities. I think it works better to not know how Ethan and Dwight meet and proceed to dance around this event, but when they do, is when the real enjoyment of this film begins.<br><br>Sorvino does a fine job, and Connelly, in a larger and more difficult role, does a very good job, but this film belongs to the male leads. Ruffalo is great playing a seemingly decent man who commits a heinous crime he desperately tries to hide. This is Ruffalo's best work to date and if this film had been appropriately marketed and acknowledged, it would have been a breakout for him.<br><br>As our main lead, Phoenix is just wonderful. Ethan is a devoted husband and father whose world suddenly ceases to make sense following this tragedy and seeing him pull away from his family as he gets lost in his depths of grief and fanatical in his quest to find the killer gives Phoenix room to further display his remarkable range. An actor who is blessed with naturalness and unbridled by affectations and shortcut tendencies, his portrayal of a man eaten away by unspeakable sorrow and incalculable rage is harrowing. There is a confrontation scene late in the film when Ethan is so incensed he's physically shaking, his words come out as a jumbled growl, and it's startling to witness. Seeing Phoenix actually show that level of anger makes you wonder how or what he did to get to this place. That I can't know, but I do know that it's terrifying to see this man come undone from the inside out.<br><br>Reservation Road is sad, but it doesn't wallow in a way that feels exploitive or cheap. It's a dual journey into one man's struggle to deal with a tragedy that feels beyond him, and the cowardice and humanity of a hunted man dogged by his own shaken ethics. This is a provocative, moving story that really deserves to be seen.","user":"bemorecynical2001","rank":[71,83]},{"title":"Two fathers","rating":7,"date":"5 April 2009","review":"\"Reservation Road\" is a difficult movie to sit through. The tragic death of a boy is something no one expects. It's a parents' nightmare to go through the loss of a child. If that death is caused by a hit and run driver, is even worse. Unfortunately, in most cases, guilt and shame play highly on the mind of the perpetrator. While the decent thing to do is to stop and go back to the scene of the crime, most people will run out of fear of facing their own responsibility.<br><br>Ethan Learner and Dwight Arno are two men that love their children. In the case of Dwight, a divorce has limited the way he can share time with his son Lucas. Ethan suffers a tremendous blow when Josh, who has strayed from the parking area to liberate fireflies, is killed by what appears, by all indications, of the carelessness of a drunk driver, or some other person who decides to flee the scene of the crime. Both men go through hell in different ways. Dwight, suffers the guilt of his cowardly act, and Ethan, because after losing Josh, he can't stop planning to get his own justice when everything else fails him.<br><br>This film was an adaptation of the novel by John Burnham Schwartz, we haven't read. It was adapted for the screen by the author and the director, Terry George, whose \"Hotel Rwanda\" made an impression on this viewer's mind. Mr. George makes a character study of the two fathers at a time of crisis.<br><br>The ensemble cast does a good job. Mark Ruffalo comes out best as Dwight. Mr. Ruffalo clearly shows why he is one of the most versatile actors of his generation. Joaquin Phoenix, who plays Ethan, does justice to Josh's loving father. In a way, it's a shame Mr. Phoenix has decided to abandon his film career in order to pursue his music. Jennifer Connelly is Grace, the grieving mother of Josh, who sees in horror how she is losing her husband who is hellbent in avenging Josh's death. Mira Sorvino appears as Dwight's former wife, Ruth.<br><br>Despite the uneasiness we felt watching this film, it is worth a look to see how an act of carelessness affects the lives of two men.","user":"jotix100","rank":[13,14]},{"title":"A Nutshell Review: Reservation Road","rating":8,"date":"4 January 2008","review":"You wonder what goes through the minds of those involved in hit and run accidents. In that split second after impact, you are presented a choice, and your life will change, one way or the other. One probably has to consider whether to stop and render assistance, and in doing so owning up to the accident, but having a chance to save a life if the circumstances allow for it. Or to hope that nobody saw you did what you did, and bolt. Negligent drivers, either through drink driving, or being distracted while on the road, probably won't elicit much sympathy, especially so from the family of the victim, and in Reservation Road, powerful drama is weaved amongst the characters on both sides of the hit and run equation.<br><br>Reservation Road refers to the scene of the crime, where the Learners - dad Ethan (Joaquin Phoenix), mom Grace (Jennifer Connelly) and daughter Emma (Elle Fanning) lose their son/brother in an accident, caused by a man in a baseball cap, driving an SUV. On this angle, we follow through the pain of the family who suffer a terrible loss. The dad Ethan slowly degenerates into an obsessive wreck, trying in vain to pursue the perpetrator who's out there, through his own dogged investigations when he realizes that the cops can only do what they can given extremely limited leads which yielded no progress. The mom Grace, while at first finding it hard to accept the truth - and in the initial days, the simplest of reasons to pin the guilt in, will resonate deeply - but we see how she draws strength in the hope of keeping the family spirits up. And the daughter finds ways to cope with the loss through channeling her energies into performance.<br><br>On the other angle, Mark Ruffalo plays Dwight the lawyer, who's estranged from his wife Ruth (Mira Sorvino) and has visiting rights to their son. When the accident happens, in that split second he made the inevitable decision for self preservation, and while he may have momentarily escape from justice and the law, negative karma dictates that he will live his life being tormented by guilt from that point on, all this while trying to provide reason that he based his decision on being able to be free from jail, to continue seeing his son. Confession and owning up will see himself in the slammer, and probably losing everything. I thought this part of the story was the more interesting one. On one hand we judge that he's a coward, of not being a man in owning up to the wrong that he did. On the other, we also realize his pain and his fear - it takes a lot to own up, especially when it involves lives being taken away, and from people we remotely know, no thanks to six degrees of separation.<br><br>Based on the novel by John Burnham Schwartz who also co-wrote the screenplay with director Terry George (Hotel Rwanda), some might wonder if the coming together of the key characters are a tad convenient. We have father to father in a lawyer-client position, and one mother being the teacher of the other's child. Putting them together will lead to the inevitable, but it is this unravelling of the truth, that keeps us engaged to a gripping ending. Scenes that will make you seethe with rage, and probably whisper a silent curse, will be those where opportunities for confession are presented, but each time spurned. As the saying goes, a lie begets a larger lie, and it will snowball before you realize that the lie becomes to difficult to cover up.<br><br>Kudos go all round to the entire cast, save for Sorvino's role which is more cameo than supporting, mainly also because the tanglement of the complicated situation doesn't affect her character directly. Ruffalo put on a commendable performance as the man wrecked by guilt, and he fleshed his character with incredible nuances we usually associate when we are fearful, and guilty. You can feel pain through Joaquin's performance of the dad looking for justice, but finds himself being unsatisfied by the system of the law, and learns that sometimes the law and justice conflict each other, and offer the layman little or no protection, unlike those such as diplomats who have powers at their disposal. Jennifer Connelly of late plays nothing but pained wives/mothers/girlfriends (A Beautiful Mind, Hulk, Dark Water, Little Children), so there's nothing really new in her role her. But I would like to single out little Elle Fanning. While her role here is fairly simple, I thought she had exhibited much more screen presence and likability than her more illustrious sister Dakota, who has disappeared after her last outing in Charlotte's Web. Hopefully we get to see more of Elle taking on challenging kid/teen roles in time to come.<br><br>Reservation Road is recommended for being a powerful drama with excellent an excellent cast. Usually movies like these will have the mothers bawling and the picture being a weepy drama, but here, the movie shifts its focus to the love of fathers toward their sons, and that makes it well worth a watch.","user":"DICK STEEL","rank":[52,69]}]