[{"title":"Sickened by Syrup Overdose","rating":3,"date":"13 February 2010","review":"I was the classic husband dragged to see this on Valentine's Day weekend as a goodwill gesture. It was every bit as bad as could be possibly imagined. Half of Hollywood's A List star as vacuous stereotypes, moronically obsessed with the holiday in question. This despite the fact they are all living millionaire lifestyles, with perfect tans and the whitest of teeth. It's Love Actually, without a sense of humour or any depth whatsoever. No- one and nothing is remotely realistic - every storyline has a trite and convenient resolution and none is convincing or interesting. There is a perfect and unlikely ratio of ethnicities and sexualities. The sex trade is entirely trivialised and sanitised. No-one stays upset about relationship breakdowns for more than one scene. People break into spontaneous dance sequences in which everyone knows the pre-rehearsed moves but the film doesn't have the conviction to show it for more than 3 seconds... Just utter pointless and patronising bilge...","user":"AndyInThePieWithAlmonds","rank":[272,363]},{"title":"Revisit Love Actually on DVD instead.","rating":3,"date":"11 February 2010","review":"Did you read that cast list? Gives the term 'star-studded' a new meaning. Imagine what kind of film you could make with all that talent. Well, Valentine's Day is not that film. Far from it in fact. This who's who of a cast hampers any chance of real emotion due to the need to share screen time among them all. When you start getting interested in a character you'll most likely not see them again for another 45 minutes, pretty annoying when there are so few likable characters in the first place.<br><br>What is perhaps the scariest is that despite a plethora of plots, subplots and sub-subplots – all intertwining somehow – there isn't a shred of originality. Sure, you might be surprised who Bradley Cooper hooks up with at the end, but one small unforeseen twist barely counts. Bulge and fluff replace characterization and narrative development whilst the corny dialogue comes off as cutesy more than cute. It all goes back to the bloated cast: with over 20 stars that need their quota of jokes, sobs and happy endings filled, it's majorly difficult to dedicate any real time to exploring the unique intricacies of love and loss. See the far superior Love Actually for how it's done.<br><br>Saving it from complete dreadfulness is a handful of these big names – probably not the ones you would suspect – who manage to squeeze a laugh from their one-dimensional roles. The two Taylor's, Lautner and Swift, play their love-struck high school couple with a cheerful amount of tongue-in-cheek; Kutcher proves his charisma can go a long way as a heartbroken florist; and Cooper and Roberts (Julia, that is) are intriguing as plane passengers who don't know each other. Biel should hang her head in shame though, her standout woeful performance surely an early front runner for this year's Razzies.<br><br>Save your money and revisit its British counterpart on DVD instead.<br><br>1.5 out of 5 (1 - Rubbish, 2 - Ordinary, 3 - Good, 4 - Excellent, 5 - Classic)","user":"Troy_Campbell","rank":[178,248]},{"title":"If you loved 'Love Actually' do NOT see Valentine's Day","rating":1,"date":"10 February 2010","review":"All star cast, great premise and timely release unfortunately do not make up for poor script, tacky comedy and a general go nowhere film. Basically a Hollywood rip off of something that the UK has already done to glorious success. While each of the characters were stand alone acceptable the need for the script to somehow tie them all together in a Love Actually fashion became tiresome and somewhat irrelevant. After watching the film you'll find yourself counting how many of the stars and starlets on the poster were even necessary in the film and start realising that the number of 'name' actors in the film is directly proportionate to the number of dollars it cost you for the ticket. Had they dropped 8 of the major players out and actually investigated the remaining stories a little further, rather than jumping back and forward between around a dozen limp ones, it may have been two dollars well spent. Don't waste your money - $12 will buy cheap roses from the petrol station and will probably be a more memorable gift to your significant other.","user":"shandance","rank":[185,287]}]