[{"title":"A very nice surprise!","rating":8,"date":"22 February 2008","review":"Outpost was quite a surprise for me, and that means in a good way. I remember hearing about it a while ago but forgot all about it. I had the chance to see the movie recently and I sat down without any expectations at all. I figured it would be your typical B movie with horrible acting, but boy was I wrong. The first 10 minutes of the movie had me convinced that it would be a lot better than I had anticipated.<br><br>Memories surfaced of Dog Soldiers, mainly because a large portion of the Mercenaries team were of British, Scottish and Irish background. The cast mainly were from UK, which was nice to see them all acting different roles (Russians, etc, however poorly they did the accents).<br><br>One of the great things about Outpost is the setting. You really get a feel for a war torn country and the bunker itself seems rather eerie. The cast did a great acting job and to actually see some proper firefights for once was nice and realistic. The Mercenaries acted in a team, calling out when they are moving, setting, reloading and giving off information that would help the group move to cover, etc. Nice touch! The actual story was pretty good as well, but I won't ruin that here. Basically it is a mixture of horror and action with lots of suspense. The director deserves credit for being able to make a lot of things believable, as well as putting together the story into something that isn't a mess.<br><br>I gave this an 8 out of 10, because in my opinion, this is on the same level/quality as Dog Soldiers. Not a mega budget, but the actual story/acting/casting/direction all deserve credit. I would have paid to see this in the cinema, it was just that good. A movie that will probably go missed by lots, but for those who watch it then it most likely will be a surprise just like it was for me. If you watch it, don't expect too much from it and then you'll be able to enjoy it that much more as everything unfolds into \"Wow, this is much better than I thought it would be\".<br><br>Don't miss this, it's definitely worth it.","user":"hereugo","rank":[126,155]},{"title":"Nice scifi/horror/war/action movie","rating":8,"date":"9 March 2008","review":"If you ever played the famous game (PC and console) Wolfenstein, you will love this movies.<br><br>I like too much stories mixing horror and ominous Nazi scientific experiments. It's a very interesting and prolific genre. Sometimes you get some very poor stories, but it's not the case of this one. It's simple, it's plain and it's interesting with a nice mix of suspense, horror and action.<br><br>I like the way the actors played the characters, they are very realistic. Production is also very nice, no CGI at all, but only the good old way of creating weird and dark places.<br><br>If you want to see a cool mystery/horror movies with no fuzzy plot, this is the one. I recommend.","user":"charlesdias","rank":[87,111]},{"title":"A good way to spend an evening","rating":7,"date":"14 March 2008","review":"I had no expectations when I started watching this movie. I had some time on my hands and it seemed decent enough to kill some time with. I have to say that I was pleasantly surprised.<br><br>The idea around the movie isn't all that unique but it delivers it with an atmosphere and style that is nothing short of wonderful. The acting in this little gem is top notch. The setting itself enhances the story and events that take place, and with minimal special fx I might add. I am somewhat of a veteran to the chiller movie genre, but this one did send a shiver or two down my spine. Nice to see something that can provoke a reaction without relying heavily on gore.<br><br>All around I would say that it is well worth watching.","user":"Frostborn","rank":[50,63]}]