[{"title":"Snitch","rating":6,"date":"24 February 2020","review":"Okay. The rock's great here, as is most of the supporting cast. The story and characters are pretty disjointed though, and full of some serious plot holes. I won't spoil anything, but when you're actively trying to contemplate these plot holes instead of paying full attention to the movie, you know there's something wrong. Decent action movie though...you might like it if you're a fan of the Rock.","user":"MR_Heraclius","rank":[38,39]},{"title":"Much much better than I expected","rating":7,"date":"22 February 2013","review":"I have never been much of a fan of The Rock. My love of professional wrestling tapered off around the time I was about 15 years old, and that was before The Rock's heydey. His movies (the ones I have seen) have been marginal at best in my opinion. But for a guy who was ushered into the field of acting to capitalize on his popularity and not to win Academy Awards, he has come a long way from The Scorpion King. What I liked about \"Snitch\" is it's the anti-action movie. I expected a movie like the terrible \"Last Stand\" starring Ah-nold Schwarzenegger. I expected fabricated car chases and shootouts where the bad guys must be shooting blanks because they are unable to shoot the good guy even when they have a clear shot. I expected scenes where The Rock would beat up 10 guys who all take turns coming at him instead of simply jumping him. But \"Snitch\" was different. It's a story of the lengths a father will go to help his son. I don't want to give away any spoilers but he goes very far. The Rock -- he's credited as Dwayne Johnson (I guess so viewers take the movie seriously) -- is very believable and does himself proud with some consistent good acting. He shows the trepidation and vulnerability of a father who puts his life on the line to save his son, who is imprisoned after committing a dumb crime. But the actor who steals the movie is John Bernthal, who plays an ex-con trying to live an honest life but is dragged back to the dark side in order to help The Rock, whom he works for doing construction. Michael Kenneth Williams will forever be known as \"Omar\" and is typecast but does a good turn as a drug dealer. The other supporting cast, including Susan Sarandon as a district attorney, are excellent. \"Snitch\" moves at a deliberate pace, which gives it more of a natural and believable feel. The few action sequences are good and do not seem overly exaggerated. I will go out on a limb and say this movie will not be nominated for Best Picture, but compared with the junk I've seen so far this year (including the latest Die Hard), I recommend \"Snitch\".","user":"edwin1030","rank":[154,182]},{"title":"Surprising","rating":8,"date":"24 February 2013","review":"I'm going to be somewhat vague about the plot to not give away anything.<br><br>My wife and I decided we wanted to go see a movie, both of us enjoy action movies and both of us enjoy Dwayne Johnson as an actor. Neither of use really thought it was going to be anything but a bunch of explosions, gun fights, and ass-whippings. I was amazingly surprised at how far Johnson has come in his acting ability since Mummy 2/Walking Tall. He showed real and believable emotions in his interactions with his \"family\" and others. Jon Bernthal was the perfect choice for his role. He showed even with this supporting role he is ready to be a major lead in my opinion. Susan Sarandon played her job as a career politician to the absolute limit. <br><br>If you are looking for a generic action movie, go see Die-Hard. If you want to see the story of how far parents will go for their children see this movie.","user":"jfrink1984","rank":[96,118]}]