[{"title":"An Understated Classic","rating":10,"date":"28 November 2013","review":"No extended fight scenes. No unnecessary pyrotechnics. Simply a story of ordinary people conducting themselves in extraordinary fashion when faced with the hell of Hitler's Third Reich and World War II. <br><br>The literary vehicle of Death as the Narrator is a masterstroke, as is the overall emphasis of words/books/art overcoming evil. <br><br>And it's all done with compassion for children at their best and most vulnerable, and adults bypassing the convention of the era to display kindness, caring and understanding.<br><br>An understated classic, there aren't enough movies like this being produced.<br><br>And that's a damn shame.","user":"mkelly54","rank":[297,355]},{"title":"Simply Beautiful","rating":9,"date":"30 November 2013","review":"9.5. I'd love to give it a 10, but having read the book, I know there were a couple of things they could have done to make it even better. The film was stunning nonetheless.<br><br>I had very high expectations going in and honestly, from the trailer, I was prepared for a let down. Nothing of the sort. The scenery was breathtaking and captivating, and I felt transported, insulated from the realities of a terrible war in a terrible time by the endearingly human performances of the actors and the depth they lent to their characters.<br><br>The only complaints I have would be slight spoilers for both the movie and the book and since I highly recommend both, I'll save them.<br><br>A powerfully emotional treat you won't regret. Go see it!","user":"dclark46","rank":[145,172]},{"title":"Riveting, Thought-Provoking, and Powerful","rating":10,"date":"29 November 2013","review":"This is without a doubt one of the most riveting, thought-provoking, and utterly powerful movies for young people (or any people, for that matter). Unlike most movies for young people, which usually encourage selfishness, lust, and who knows what else, this is a film that promotes such qualities as self-sacrifice, courage in the face of unspeakable difficulties, and using your life to make a difference for others.<br><br>Based on Markus Zusak's novel, The Book Thief expertly tells the story of a young German girl named Liesel, who is thrust into the horrors of World War II Germany and its many complications. The scope of the story is seen through the eyes of Liesel, making it quite an intimate tale that is less about war and more about the importance of remaining human in inhuman surroundings, and affecting those around you in a positive and profound way.<br><br>The film is hauntingly beautiful, and moves at an effortless pace- not too fast, not too slow- allowing the viewers to become immersed in the realities of Liesel's situation. Lovely Sophie Nelisse is stunningly perfect in the role of Liesel, capturing both the bright-eyed innocence and the eventual world-weary quality needed for the role. Liesel's good-natured friend Rudy is also expertly and realistically portrayed by young Nico Liersch. It is a delight to watch such wonderful young actors at work. Geoffrey Rush and Emily Watson, of course, are their usual extraordinary selves as Liesel's adoptive parents.<br><br>This is truly a movie that is not just for young people. It operates on many levels, as a commentary on the disastrous effects of World War II or a poignant tale of one small soul fighting for her own sense of humanity. While it might be a bit intense for small children, a film such as this should be mandatory viewing for older children and teenagers- a thoughtful and heart-tugging reminder of the fragility of life, and the importance of looking beyond yourself. It is the sort of film that will leave viewers young and old just a bit speechless.","user":"mkramer-693-816493","rank":[202,243]}]