[{"title":"\"Diamond\" is a Real Gem","rating":10,"date":"9 September 2010","review":"\"The Loss of a Teardrop Diamond,\" is a real gem but it is not for everyone. If you are not a big Tennessee Williams fan, you probably will not like it. If you are unfamiliar with Tennessee Williams, then you are better off watching \"A Streetcar Named Desire,\" or \"Cat on a Hot Tin Roof.\"<br><br>Admittedly, this is not one of Williams' best stories. The reason the film works so well is the acting and directing.<br><br>I had seen Bryce Dallas Howard in a few other films but they did not prepare me for this absolutely thrilling performance. This is not just the best performance of the year but it is the best performance in the past several years. She brings the character of Fisher Willow to life the way that Vivian Leigh did for Blanche DuBois. In many ways Fisher Willow is like a young version of Blanche. <br><br>Fisher is a typical Williams' heroine. She initially comes off as a selfish, self centered, Southern Belle but underneath she is much more fragile than anyone suspects. Bryce Dallas Howard is able to bring this out with such complexity and nuance that we can sympathize with a character that we should not care about so much. Even in her best moments she seems as though she could shatter at any moment.<br><br>This performance alone is enough reason to see this film. <br><br>The story follows the familiar themes covered in other Tennessee Williams stories: loneliness, loss of wealth, fall from grace, and battling interior demons. The teardrop diamond could represent the wealth and status her family once had. It is not just a $5000 jewel. It is a symbol of what her family once was and what was once the old South.<br><br>Jodie Markell does an impressive job directing. Her style is old school. She knows when to let the camera linger and when to let the scenes play out. The film does not seem rushed and it never drags. The cinematography is gorgeous with burnished orange dominating the color palette. <br><br>\"The Loss of a Teardrop Diamond,\" may not be one of the four best movies made from a Tennessee Williams story but it is not far behind. This is mandatory viewing for any fan of Tennessee Williams.","user":"brenttraft","rank":[27,31]},{"title":"cool evening river wind","rating":7,"date":"23 January 2011","review":"This Tennessee Williams period story focuses on life in the south in the late twenties. Williams enthusiast and director Jodie Markell brings the overlooked play to the screen. While not for everyone, Loss of a teardrop diamond is a change of pace and refreshing as a breath of cool evening river wind. <br><br>The story begins with the character of Fisher Willow, who returns to her father's Mississippi river plantation after an education in Europe. Fisher is played by Brice Dallas Howard and is as smooth as Jack Daniels in this sultry southern role. Social troubles have plagued Fisher after her father has committed a despised act toward the southern end of the community by blowing the river levee on his property. Fisher becomes rebellious and indignant to a society who blames her for her fathers sins.<br><br>For reasons unknown to the audience Fisher has developed a strong attraction to Jimmy Dobyne. It seems that Jimmy's family has seen better times. Since the years his grandfather was governor of the state, his family has fallen from prominence into near poverty. Jimmy's alcoholic father finds himself dependent on employment from the Willow family.<br><br>It appears Fisher's Aunt Cornelia is in control of the family and demands Fisher complete her social debut. Fisher employs Jimmy to escort her to the debutante parties, that her aunt Cornelia, has insisted she attend. Jimmy who feels manipulated and somewhat controlled resists Fishers advances toward him. <br><br>The story, while somewhat tame does contains some racy scenes that center around a Halloween party where things get out of hand. These scenes would have been tricky if not impossible to film in the fifties. No doubt from experiences in his early life, and probably from places like New Orleans, Williams creates a mosaic of wildly contrasting characters to illustrate this story. With the lives of so many different characters coming together, the sparks begin to fly toward the end of this film.","user":"Bogie27","rank":[18,20]},{"title":"Surprising, interesting, with an excellent cast and a wonderful dramatic feel","rating":8,"date":"10 January 2010","review":"For those of us who don't get to the theater much and depend on the cinema for our acting thrills, this film is just downright fun. The fact that it got made in this century is a pleasant and amusing surprise. Like \"An Education\", this film features a few strong unknown cast that are outstanding. It also features phenomenal stars Ellen Burstyn and Ann-Margret in wonderful, surprising cameos. Chris Evans shines-has their been a sexier role for a young actor? Bryce Dallas Howard is a wonder, and really pulls off a very demanding leading place in this film. Now blink you eyes and the plot takes you to a movie experience from before 1950. But that is exactly what is so fun. Southern style romance, twisted identical twins, dead bodies up the stairs-it is also somewhat predicable but very lovingly portrayed. I really like this film, exactly because I love the experience of pulling up to a movie theater on a cold winter night a getting the same good time my parents did in their day-a warm, sweet and somewhat bitter romance with a clear sense of time and place.<br><br>Don't go to this film expecting fireworks. Go for movie magic served Southern style by actors who are real and very good. This is what entertainment is about, and unfortunately it is a lost art these days.","user":"zken","rank":[34,42]}]