[{"title":"Visually and aurally breathtaking cinema","rating":8,"date":"2 January 2008","review":"Can light have sound? So what is silent light? Something surreal, somehow related to the hymn \"Silent night\"? The intriguing answers are provided in the film to the patient, thoughtful viewer. This is not a film for the impatient viewer. \"Starlight\" (accessible cosmic wonders) begins and ends the filmsilence dominates the soundtrack, except for sounds of crickets, lowing of cattle, and an occasional bird cry.<br><br>This opening shot sets the tone for a film made with non-professional actors. The film won the Jury's Grand Prize at Cannes 2007. It is a spectacular film experience for any viewer who loves cinema. This is my first Reygadas film and I have become an admirer of this young man.<br><br>Mexican filmmaker Carlos Reygadas writes his own scripts. He is one of the few filmmakers of importance today who does that-alongside Spain's Pedro Almodovar and Japan's Naomi Kawase.<br><br>Reygadas' stunning movie \"Silent Light\" is centered on a collapsing marriage within a religious Mennonite community in Mexico, speaking not Spanish (the language of Mexico) but a rare European language (Plautdietsch) that mixes German and Dutch words, leading up to the eventual renewal and strengthening of this fragile family. Reygadas begins the film with a 6-minute long time-lapse photography of dawn breaking to the sounds of nature and ends the film with twilight merging into the night.<br><br>The opening shot was lost on many viewers; a noisy viewer kept talking three minutes into the film, unaware that the film was running, until I had to reveal this surprising fact to him at the 12th International Film festival of Kerala. The film's opening shot was so stunning that after the 6th minute the audience who grasped what was happening began clapping, having savored the effect. The last time I recall a similar involuntary reaction from an audience was when Godfrey Reggio's \"Koyaanisqatsi\" was screened decades ago in Mumbai at another International Film Festival.<br><br>There is something magical, supernatural in nature if we care to reflect on a daily occurrence. There is a touch of director Andrei Tarkovsky in Reygadas' \"Silent Light\" as he captures the magical, fleeting moments in life that all of us encounter but do not register as such. There is a touch of director Terrence Mallick's cinema as he connects human actions with nature (a heartbroken wife runs into a glen and collapses trying to clutch a tree trunk). And there is a touch of director Ermanno Olmi in the endearing rustic pace of the film. Whether he was influenced by these giants of cinema I do not knowbut many sequences recall the works of those directors.<br><br>That the film recalls Carl Dreyer's \"Ordet\" (1955) is an indisputable fact. \"Ordet\" was based on a play by a Danish playwright Kaj Munk. Reygadas film is based on his own script that almost resembles a silent film because of the sparse dialog. Both films are on religious themes, on falling in love outside marriage, and leading up to an eventual miracle. Reygadas uses these basic religious and abstract ingredients to weave a modern story that is as powerful as Dreyer's classic work by adding the realistic and accessible components of natureautomated milking of milch cows (without milking, the cows would be in distress) and a family bathing scenedo seem to be included as daily occurrences that have a cyclical similarity to the main plotthe collapse and rebuilding of a marriage. Reygadas' cinema invites the viewer to look at nature captured by the film and discover parallels to the story-line. This film is one of the richest examples of cinema today that combines intelligently a structured screenplay, creative sound management, and marvelous photography that soothes your eyes, ears and mind.<br><br>Early in the film, the \"family\" is introduced sitting around a table in silent prayer before partaking a meal. The silence is broken by the tick-tock of the clock. The children are obviously unaware of the tension in the room, except that they would like to eat the food in front of them. The adults are under tension. When the head of the family remains alone on the table (symbolic statement) he breaks into uncontrollable sobs. He gets up to stop the loud clock (symbolic) that evidently disturbed the silent prayer. This action becomes important if we realize that the clock never bothered the family silent prayers before. All is not well. Time has to stand still.<br><br>Composition of scenes of scenes in the film remind you of Terrence Mallickthe balancing visuals of men and children sitting on bales of hay on traileragain recalling a cosmic balancing force in life Both \"Silent Light\" and \"Ordet\" revolve around a miracle, where a woman's love for a male lover and tears for his dead wife leads to calming a turbulent marriage. The film is not religious but the Mennonite world is religious. Religion remains in the background, In the foreground is love between individuals, lovers, husbands, wives, sons, parents, et al. What the film does is nudge the viewer to perceive a mystical, cosmic world, a world beyond the earth we live in, which is enveloped in love. There is a cosmic orbit that the director wants his viewers to notesimilar to the erring husband driving his truck in circles as though he was in a trance on the farm, while listening to music. Mennonite children who are not exposed to TVs seem to enjoy the comedy of Belgian actor and singer Jacques Brel in a closed van. While Reygadas seems to be concentrating on the peculiarities of a fringe religious group, the universal truths about children's behavior and adult behavior captured in the film zoom out beyond the world of Mennonites. They are universal.<br><br>The film begins in silence and ends in silence against a backdrop of stars in the night. The indirect reference to the \"Silent night\" hymn is unmistakable. For the patient viewer here is a film to enjoy long after the film ends.","user":"JuguAbraham","rank":[74,83]},{"title":"Stillness speaks (but not to everybody)","rating":7,"date":"17 December 2007","review":"This is certainly not a film for everybody and I will be careful in who I recommend this movie to. It is challenging because it is very unsatisfying to the 5 senses we are used to (over)feed. This movie is like meditating, you need to surrender to it, ignore what your mind is telling you about what a movie should be, surrender to the slowness first and then to the lack of almost everything we are normally used to in a movie. There is so little you can chew on, no acting, inhibited emotions, no laughter, even the acclaimed picture is unsatisfying (don't see this movie for that reason). Everything is internal, barely reaching the surface. If you can tune in though, like in a meditation, you will become ultra sensitive, sense the subtle and begin to enjoy. Some scenes may even totally fill your spirit. One word of caution though, if you intend to see this movie in a theatre: it is very likely that some people will become uncomfortable and leave, keep talking, protest etc... which makes it even more difficult to watch it with serenity so renting it as a DVD may be a more suitable option. If you are the kind of person enjoying a walk in the countryside contemplating nature without talking you'll probably enjoy this movie. If you prefer talking or being entertained then chances are that you will not.","user":"Serge Bosque","rank":[51,64]},{"title":"About what it takes to be truly alive","rating":9,"date":"8 June 2008","review":"Set in the austere Mennonite community of northern Mexico, Carlos Reygadas' Silent Light is not about suffering and sin but about the enormous power of compassion and what it takes to be truly alive. Filmed in consultation with the Mennonites, a Christian sect of European descent who speak Plautdietsch, a German dialect, the film is paced very slowly, almost excruciatingly so, but its meditative pace allows those with patience to enter the interior lives of the characters in a way that is normally not possible in cinema. With outstanding performances by non-professional actors that reminds us of Bresson and Tarkovsky, the film's physical beauty brings poetry to ordinary events such as machines harvesting crops, the milking of cows, and the faces of children having their hair shampooed. <br><br>Johan (Cornelio Wall), a father of five young children, is involved in a love triangle that has made him remorseful and uncertain of God's approval. Torn between his wife Esther (Miriam Toews) and his lover Marianne (Maria Pankratz), he openly confesses his adulterous behavior to his wife as he entertains thoughts of abandoning his family. In obvious pain, Johan sits alone at the kitchen table and weeps after Esther and the children have gone out following the morning ritual of breakfast and silent prayer, but his remorse does not prevent him from continuing to meet and have sex with Marianne. After Johan goes to a garage to pick up a crankshaft for his tractor, he tells his friend Zacarius (Jacobo Klassen) about his affair, then, when a familiar song comes on the radio, turns up the volume and sings along in an outburst of sudden joy while driving his truck in circles. <br><br>Later, he stops by his parent's farm to tell his father about his affair, explaining that he has told Esther about Marianne. His father, a preacher, hints that the devil may be responsible but also admits that he once also had an affair with a woman other than his mother. In one of the warmest scenes of the film, Johan and Esther take the children bathing in a nearby pond, a gesture of love that made his infidelity all the harder for Esther to bear. When they are driving alone in a ferocious rainstorm, she complains of chest pains and has to get out of the car and walk to a nearby tree, in obvious discomfort. <br><br>A long and quiet film, Silent Light, touches on some profound themes but keeps its emotional distance. Because there is little emphasis on religious beliefs or the real nature of his emotional and spiritual crisis, the film's final homage to Carl Dreyer is not placed in a context where it can achieve either radiance or power and comes off as a second hand copy. Yet though Silent Light doesn't quite overcome its inertia and reach the heights, its visual beauty is consoling and at times overwhelming. An exquisite six-minute tracking shot frames the film, an opening and closing sequence that attempts to connect our mundane lives to the ineffable beauty of the universe. As the illuminated stars slowly give way to sunlight and we are caressed by the ambient sounds of nature, we sense the light slowly beginning to illuminate our planet as we move into a new age, long forecasted in Hopi and Mayan tradition.","user":"howard.schumann","rank":[23,28]}]