[{"title":"No love to be found here","rating":1,"date":"21 June 2008","review":"Mike Myers can't seem to get enough of himself in The Love Guru. He's constantly giggling at his own jokes, and mugging for the camera as if he thinks his latest comedy creation is the funniest thing he's invented. I had a very different reaction. Pitka was born in America, and traveled to India to study under the cross-eyed Guru Tugginmypudah (Ben Kingsley), who taught his students lessons by having them hit each other with urine-soaked mops. Pitka devotes his life and his teachings to helping other people out with their relationship troubles, and hopes his words of wisdom will become so popular, he'll wind up on Oprah.<br><br>This is information we learn early on in the film (after Pitka serenades us with a Bollywood-style musical number of Dolly Parton's Nine to Five during the opening credits), and I pretty much knew right there that The Love Guru was going to be a very long 90 minutes. The movie makes a grave miscalculation with its lead character. Guru Pitka is not funny or likable. It's simply Myers talking in a funny accent, and coming up with as many alternate ways for saying \"penis\" as he can without losing the film's PG-13 rating. Pitka is not even a real character. Myers plays him more as an experiment, as if he's still testing the character out, and we the audience are the guinea pigs being subjected to the experiment. It's been widely reported that the reason why Myers hasn't done a live action film in five years is because he's been fine tuning his Guru Pitka at various comedy clubs until he felt he was ready. He was not ready, and he probably should have spent another five years if the end result is any indication.<br><br>Pitka is approached by Jane Bullard (Jessica Alba), the owner of the struggling Toronto Maple Leafs hockey team. Her star player, Darren Roanoke (Romany Malco), hasn't been performing up to the best of his abilities ever since his wife, Prudence (Meagan Good), left him for the goalie on the rival team - a French player named Jacques \"Le Coq\" Grande (Justin Timberlake, embarrassing himself here) who is known for his over-sized \"manhood\" as much as he's known for his talent in the game. The character exists simply so that Myers and co-screenwriter Graham Gordy can have the characters say cock a lot more than humanly necessary. The Maple Leafs have a chance at winning the Stanley Cup, but not if Darren doesn't have his head in the game. The team's pint-sized coach (Verne Troyer) doubts that Pitka can turn the situation around, but the Guru is determined to help. He'll do this by finding a way to distract Darren from his problems (By forcing him to watch two elephants having sex, thereby taking his mind off of his problems with his wife. You figure it out.), and help him confront his over-bearing mother (Telma Hopkins), who has long cast a shadow over the star player.<br><br>The Love Guru is not a comedy, it is a cry of desperation on behalf of Myers and everyone involved. Comedy is funniest when it seems to come naturally out of the material, but everything seems so forced and strained here. It's almost like if they can't think of something funny to do, they'll throw in elephants humping each other, or light a midget on fire. And if that doesn't work, they'll throw in another couple references to male genitalia. If there's a bigger cry of comic desperation than limp innuendo humor, then it has to be out of the blue musical numbers that are not funny in themselves, the movie just expects us to laugh at the fact that the characters are suddenly singing for no reason. You know, I think I'm going to have to take that last statement back. There's an even more desperate form of comedy, and that would have to be building an entire scene around the fact that Guru Pitka has a different kind of food stuck in his beard each time we see him, building up to a sight gag where his entire beard is cotton candy. This movie has so many scenes of just plain wrong-headed desperation, you'd almost think it was intentional.<br><br>While Myers cackles and mugs his face with glee, pretending that he's having a great time, the rest of the cast kind of look like they wish they were somewhere else. Jessica Alba looks uncomfortable, and her scenes where she's supposed to be warming up to Pitka look more like she's hanging out with him out of pity more than anything else. It's not unusual in a comedy to have the supporting players stand in the background so the star can do his thing, but the cast here seem just as confused as I was as to what we were supposed to be watching Myers doing. <br><br>There is not a single laugh or moment of inspiration in The Love Guru. It's just a sad, depressing slog through material that's not funny to start with, taken by actors who seem to know it's not funny. It's bad enough when a comedy can't generate any laughs, but it gets even worse when you start feeling sorry for everyone up on the screen. You want to ask them and their agents what they were thinking when they signed up. You want to remind Myers of just how funny he can be, and why this material and character don't suit him. But most of all, you want to be able to somehow turn back time to before you gave the ticket counter your money, walk back out the door, and figure out another way to spend 90 minutes.","user":"keiichi73","rank":[137,206]},{"title":"Bad karma or just bad movie-making? The Love Guru is a contender for worst film ever made","rating":1,"date":"20 June 2008","review":"I don't throw this statement around lightly. As someone who frequently reads reviews, I find that it is thrown around far too often, especially when there are so many bad movies out there. But I can say, without a doubt in my mind, that The Love Guru is the worst movie I've ever seen. It has officially dethroned classics such as Die Hard Dracula and Dark Harvest 2: The Maize. Those movies were made on minuscule budgets by no-talents. In comparison, The Love Guru was made on a huge budget by Mike Meyers, the creator of comedy classics Austin Powers and Wayne's World, which makes this train wreck of a film all the more painful to watch.<br><br>With The Love Guru, you can tell Meyers is trying to create another success along the lines of Austin Powers, but failing miserably. The thing about Austin Powers was despite being a dumb comedy, the movie had a likable, fun protagonist. In Meyer's latest outing, we get the Guru Pitka, a Charles Manson look-alike who has an obsession with penises. It's somewhat fitting that he resembles Charles Manson, a notorious cult leader, as by the movies end I had a strange urge to kill myself. Not only is the Guru creepy, he's also very unfunny. Whether he's making lame puns about \"life\" or talking about penises, he never manages to elicit any laughs whatsoever. It could be that his jokes are just bad. Certainly using jokes straight out of a children's joke book isn't a recipe for success. It could also be the fact that Meyers is so desperate for a laugh, he himself laughs at every joke and continuously looks at the audience, attempting to entice them to laugh along with him. You get the sense that he realizes the jokes are unfunny and the glances at the audience are his last failed attempts at getting a few laughs. Guru Pitka's character development just adds injury to the insult. One minute Pitka is being hailed as a spiritual healer who lives to help people and the next minute he's insulting a midget for no particular reason. There's no consistency to the character at all, which is what this movie is missing in comparison to Meyer's last few. Wayne Campbell and Austin Powers felt like real characters, where the Guru doesn't really have any character; he randomly does whatever moves the plot along forward.<br><br>Speaking of plot, the storyline is almost as ill-conceived as the title character. A stupid plot in a comedy is acceptable if it manages to be funny, but there's nothing amusing about a Guru's quest to go on the Oprah show. That's just plain stupid. It would help if the film wasn't filled with every cliché ever known to cinema-goers, but it is. The Guru has a self-revelation at the end and changes his greedy ways. The good guys triumph. And of course, Blur's \"Song 2\" plays during one of the hockey sequences, which has become the most commonly used (and groan-inducing) tune for any sports-related film.<br><br>Even if you can put aside the annoyingness of the Guru Pitka, the movie still fails to deliver anything remotely funny. The most common joke is to have a characters name resemble something vulgar, such as \"Dick Pants\" or some other Grade 3 level joke. The next most common is the Guru's constant repeating of \"TM\" after one of his catchphrases. It wasn't funny the first time, what made Meyers think it would be funny the tenth or fifteenth? There's also the repetition of jokes from Austin Powers, ranging from the plane to even the casting of Verne Troyer, the midget who made one of his only popular appearances in the Powers films as Mini-Me. Finally, there are the gags that are just plain lame. These involve elephants humping each other, the Guru wearing a chastity belt, the Guru having a battle using mops soaked in urine, the Guru sticking his head up his own ass (which is actually far less funny than it sounds), the Guru getting punched in the groin, the Guru doing battle with a rooster and the Guru engaging in two very long song and dance numbers on the Sitar, one a rendition of Dolly Parton's \"9 to 5\", the other a ear-splitting variation on \"Space Cowboy\" by Steve Miller Band. Both are in there for no particular reason whatsoever (and I really do hope it wasn't for laughs).<br><br>The other actors are fairly bad, although they really don't have much to work with. Jessica Alba continues her tradition of playing practically the same exact character, giggling and acting ditsy. Justin Timberlake is atrocious as Jacque Grande, although to be fair, his character was a one-note joke about Quebecois people. I'm bemused that Meyers would think Americans would find a joke about a people they likely know little about funny, especially when I didn't find it funny and I'm a Canadian. Verne Troyer just proves that the only reason he has even a semblance of a career is because of the novelty that he's a midget.<br><br>It really is hard to describe how utterly bad The Love Guru is. It's a stupid comedy, yes, but I'm a fan of those. I'm the guy who gave You Don't Mess With the Zohan a positive rating, so if anything this should be right up my alley. Instead, it's the worst movie of the year for sure (leaving Meet the Spartans way behind in its dust) and has reached it's place, for me at least, as the worst movie ever created. It's painfully unfunny and left me in a sour mood for a good hour after viewing. I'd rather wear a chastity belt for 30 years like the Guru rather than sit through this pile of crud.","user":"dyl_gon","rank":[174,287]},{"title":"Self-indulgent mess","rating":1,"date":"11 June 2008","review":"It was heavy-handed, painful and endless. The opposite of funny. An excruciating bunch of penis jokes strung together with some gross-out scenes. Wow! Penises can be short! Penises can be long! Oh, hahaha! Oh, and who can forget the musical numbers. Did I mention that they were choreographed? Mike Myers has lost the charm he exhibited in the Austin Powers franchise. And it's clear that he picked an inexperienced director for this so he could control the shoot. And why does Jessica Alba keep doing crappy movies like this and \"Good Luck, Chuck\"? Did someone tell her she was a comedienne? And Justin Timberlake -- well, no wonder he wears a wig and moustache throughout. Ironically, though the material is definitely for teen-aged boys, they probably won't go to see it because of the title. It'll maybe have one weekend, then go flaccid. Incidentally, the only truly memorable line in the entire mess is from Verne Troyer in an outtake run with the credits. But it's not worth watching the entire mess to hear it.","user":"megco-1","rank":[249,423]}]