[{"title":"I really enjoyed it!","rating":7,"date":"13 May 2009","review":"I payed my money and saw this movie expecting a laugh and to leave with a smile on my face. I wasn't expecting Oscar acting, a great storyline or something that would leave a lasting impression on me.<br><br>The performances were good, I especially enjoyed Michael Douglas's glam OTT character. The main actors also impressed and I was drawn into their romance as the film went on. So much so that I shed a little tear at the end.<br><br>When I left the cinema I was smiling and during the movie I laughed out loud along<br><br>with many other people. I got what I paid for and had a good night.","user":"james211967","rank":[105,151]},{"title":"I liked the movie","rating":8,"date":"11 May 2009","review":"The film started out a little slowly but began to move well. I thought that there was really good chemistry between the two main characters. I liked the film for its well conveyed message about commitment and what it means to care for people. In order to receive you need to give and vice versa. The film used Dickens as a clever vehicle for its plot and it worked for me anyway. I am not saying the film is a classic but it was a pleasant way to spend a couple of hours and I definitely would recommend it to people I know. I thought that the acting was terrific and the characters were well developed. I think the film is definitely worth seeing.","user":"trig51","rank":[73,105]},{"title":"Nont quite rom-com","rating":4,"date":"4 May 2009","review":"For a rom-com, Ghosts of Girlfriends Past is as dramatic as it could be, more Dickens than Apatow. Matthew McConaughey as womanizer Connor Mead is type cast as a rake waiting to be changed into a loving human being, The plot with returning dead lovers to teach him a lesson about having feelings is not quite as exotic as it sounds, for it is a device mainly to show him as a callow youth squiring and losing the love of his life, Jenny Perotti (Jennifer Garner). The drama is the disaster he makes of his brother's wedding and the tears he witnesses from the women he has seduced and left.<br><br>Since we all know enjoying casual sex is a no-no for descendants of Puritans, the outcome of the ghostly apparitions' lessons is secure in cliché land. Following the party line about scoundrels getting what they deserve is ghost of Uncle Wayne, a sort of Gordon Gekko gone good, an oily ex-Lothario played with relish by another spot-on bit of casting, Michael Douglas. His flowing hair and Hollywood-tinted big glasses call to mind producer Robert Evans (The Kid Stays in the Picture). Although Uncle Wayne is a recovered womanizer, at least for now, his speeches about loneliness and broken hearts ring true only for the moment, but long enough to affect the hero.<br><br>It's an enjoyable film with a smart cast, a preposterous story but a serious message about true love and selflessness. Not quite a romantic comedy, but very close indeed.","user":"jdesando","rank":[47,69]}]