[{"title":"Bad-ass descent-amazing superhero MCU action flick defenders of the earth my favorite","rating":10,"date":"2 July 2017","review":"Marvel's The Avengers (2012) is an awesome descent MCU superhero action flick that is spectacular and a real good one. The first time I watched it on my computer I loved it. I have seen this movie many times in the row I have this film on DVD and Blu-ray. The movie features an ensemble cast that includes Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Jeremy Renner, Tom Hiddleston, Clark Gregg, Cobie Smulders, Stellan Skarsgård, and Samuel L. Jackson. Joss Whedon did a fine job directing the film and I loved it is definitely in my top 10 favorite MCU superhero films. In the finale battle in New York the moment right there.. WILL NEVER... EVER.. BE AS COOL.. LIKE THIS WAS A COMIC MASTERPIECE.. I don't even read comics, but I did superheroes when I was younger.. I have a feeling justice league will never have this cohesion... this team work.. and will never be able to recreate this feeling.<br><br>Robert Downey Jr. does a good job as a Iron Man he has a lot of good moments when he talks with Loki. In the third act he has to fight Thor that was cool then in the third act he had to do a lot of stuff, did the final stuff to safe the world. He is very much star of the film, that is why he number 1 star of the film he was payed a lot of more money then the other actors did ,but he deserved it he did a good job. Chris Evans as Captain America was spectacular I love his character I love how he defended and safe those people in the restaurant against Loki's army I thought that was descent. He does kick some ass when Thor hits him he uses his shield when SHIELD's ship was attacked he and Iron Man were trying to fix the ship I loved that. <br><br>Mark Ruffalo was okay as The Hulk I thought he was better than Edward Norton's Hulk at least that is my opinion. Chris Hemsworth I liked him as Thor he was great. Scarlett Johansson as Black Widow was fantastic what does she do? She deals with the Hulk and Hawkeye the evil Hawkeye which I think is great. Jeremy Renner I like him a as an actor he is cool, he is mostly the bad guy in the film till the third act. In the third act he did a lot of cool stuff, he is cool with arrows. Loki he did fine the actor did fine as the villain I like him and Samuel L. Jackson as Nick Fury did fine. <br><br>In the film, Nick Fury, director of the peacekeeping organization S.H.I.E.L.D., recruits Iron Man, Captain America, the Hulk, and Thor to form a team that must stop Thor's brother Loki from subjugating Earth.<br><br>The pacing to me I thought it was little boring and it was too long but the third act was really was fast paced and the movie interested how 6 superheroes become a team who turn in to Avengers I think there was a lot of action scenes in the film that were really well done. I like special effect, I had a lot of fun scenes Hulk punching Thor or punching Loki when he said is emperor. That was fun, the film it self had a lot of action it self's. <br><br>It was entertaining, the CGI was really good, Robert Downey Jr. had a lot funny moments and hilarious dialogues. I have more enjoyed Captain America because he cared more about people and of course Iron Man he saved the world from Loki's invaders. I thought it was an alright and I love it. It is definitely my favorite MARVEL superhero movie.<br><br>Admittedly the first half or so isn't nearly as epic as the final 30 minutes. And the plot isn't that original. But I got what I paid for with this flick, Awesome action with Earth's Mightiest Heroes kicking alien ass.<br><br>The Avengers in my honest opinion was better than Man of Steel because right next year DC superman movie come out that I have hated it and I wish I could have get the money back. I am going to try and sell the movie out. <br><br>Marvel's The Avengers (classified under the name Marvel Avengers Assemble in the United Kingdom and Ireland), or simply The Avengers, is a 2012 American superhero film based on the Marvel Comics superhero team of the same name, produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures. It is the sixth film in the Marvel Cinematic Universe. The film was written and directed by Joss Whedon. <br><br>I have reviewed 2 years the second movie twice and as a MARVEL fan I can say I have enjoyed this movie much more than Avengers: Age of Ultron. I am waiting now on Avengers: Infinity War and of course Spider-Man: Homecoming which is a spin off Captain America: Civil War like I said I have enjoy all three Captain America Films and I enjoy both Avenger films and I love Iron Man and Iron Man Three I am one of the fans that I liked that films. The rating I give is 10/10","user":"ivo-cobra8","rank":[136,202]},{"title":"An Unstoppable Force of Awesomeness! All Hail The New King!","rating":12,"date":"12 April 2012","review":"I have got to tell anyone who will listen that this is one of THE best adventure movies I've ever seen. It's almost impossible to convey how pumped I am now that I've seen it. I purposefully avoid hyping myself for movies because when expectations are too high, nothing seems to be able to reach them. I usually avoid the hype train whenever possible. That said, I was jacked to see this movie and was fully aboard the hype train. It couldn't be helped. So, I was certainly open to intense disappointment had this movie not been good. I'm so happy to report just the opposite has happened.<br><br>The only word I can think of to describe this movie is AWESOME. It's amazing work and everything I had hoped for and more. It's exceptional entertainment for the uninitiated but it has everything a fanboy could want to be sure. It has every little nuance of what a fanboy wants to see. One of the MANY things I loved was the tension and flat out conflict that arises between team members. It's not a two dimensional \"team wonderful that bands together to fight crime ho ho ho.\" Most don't like each other at fist and there is so much texture to be played. That is great because so many of these characters are larger than life. They have egos and the big guns aren't used to working with other people or even playing by the rules. Stark, Thor and Banner all work \"the other side of the fence\" so to speak. Then there's the Widow, Hawkeye and Captain America who are used to following orders and playing within a command structure. They are all thrown together in a wonderful and, best of all, believable fashion. Again, more than I ever dreamed possible.<br><br>The entire cast really delivered. You needed more than just action actors or stunt doubles to play all these parts. The pathos is there but so are the timing and true deep performances. Look, I was missing Ed Norton as much as anyone on that hype train I talked about but I'm so happy to say that Mark Ruffalo won me over. I hope he's locked up for the long haul because we don't need any more changes. Three was the lucky number for movie Banners. Every other actor in Avnegers that we've seen before is BETTER than their previous incarnation (EVERY single one) with the possible exception of RDJ as Stark. He's great but it's hard to top his take on the character from the original Iron Man in an ensemble movie. I also have to fully disclose that I'm insanely attracted to Scarlett Johansson. I thought her Widow character was amazing but I'm definitely judging that through rose colored glasses. The character arcs that run there course during this film will surprise a lot of general audiences expecting nothing more than a Transformers type popcorn scarfdown.<br><br>I honestly don't want to give away ANY of the movie with this review because this is one film that needs every scene to be savored. Do yourself a favor and remain unspoiled. It's how I saw the movie (apart from what the trailers showed) and even though you're obviously reading this review, read no others with any kind of spoilers whatsoever. Experience the awesomeness for yourself. Avengers as a movie and as a team on screen is an unstoppable force. I'm just going to say, Hulk &amp; Thor combination equals AWESOME and leave it at that. This movie defines MUST SEE.","user":"krieg8814254","rank":[882,1]},{"title":"They balanced everything masterfully. As Good As It Gets!!!","rating":19,"date":"19 April 2012","review":"If you're a fan of epic adventure movies, then this is your dream come true. This is the type of film you fantasized about growing up! It really is the ultimate superhero mash-up and it's done perfectly. The makers of this film certainly understand spectacle but they also get the intricacies and depth these type of characters can provide. That right there assures this instant classic will be thought of as the best as well as the biggest film of 2012. The depth of this movie really did surprise me. Even though the high quality of the actors involved and there previous work as these very same characters seemed to indicate otherwise, I was expecting a wild popcorn movie. I was wrong in thinking it was too much to convey in one film. I couldn't be more pleased because they balanced everything masterfully. Sure, there's the popcorn fun we were all expecting but there's also a definite soul to the film and a smart plot as well. It's truly a stupendous movie regardless of genre.<br><br>Marvel did it, they pulled off the culmination of a master plan that's been taking shape for years. They deliver a movie the likes of which we've never seen before and as good of a film that's ever been made in its genre.<br><br>There's a reason this grand of a movie has never been attempted before now. How do you fully flesh out, care about and establish this vast group and still deliver a fun, crisp and coherent story? It's extremely difficult to navigate that edge-of-your-seat excitement while at the same time caring about each one of the characters and their struggles. One of the most impressive aspects of The Avengers is that they managed to get each hero their time in the spotlight and their own character arc. Every single main lead steps up and is treated with remarkable intelligence and given room to shine.<br><br>I loved that the stakes in this film are ridiculously high and the threat so impressive that there really is a need for these diverse characters to come together. That could have been a stumbling block in terms of story but it's treated just right. It's also a great idea that they chose to introduce all the characters to the audience as if you've never seen them before. Sure, the other films set up and give depth to each character but even if you missed their solo films, you'll still know and care about them in this movie.<br><br>It's also wonderful that everything is as big as it should be. This truly is the comic book epic of our lifetime (the fanboy version of Gone With The Wind circa 1939 if you will) and it all shows up on screen. Everything looks GREAT and feels epic. The equipment (love that Helicarrier), the relationships, the stars, the characters themselves and the battles are all huge and as fully mesmerizing as they should be. There are scenes that are emotional and there are scenes that are going to make any audience member scream \"BADASS!\" and mean it.<br><br>I'm serious when I say that the big, explosive moments are as grand as they should be but it's the smaller character moments in this film that really take it to another level. At this point, we've all seen how good some CG action can get but grounding it with a great story and with meaningful quieter moments is what makes a movie good. That's the ace up the Avengers sleeve. This is NOT some CGI video game movie. Cut out the action and I'd still want to see this movie. So, it's safe to say that they are replicating the comic book experience on the big screen. Years of depth coupled with spectacle and advanced fiction is a treat for non-comic book and comic book fans alike. That's is The Avengers greatest power... the ability to entertain all comers!","user":"NORTHPOINTMJM","rank":[437,705]}]