[{"title":"eh","rating":2,"date":"31 January 2010","review":"I rented this movie because it had Justin Long in it. I'm normally a fan of his. But no matter how much of a fan I am of his, this story was incredibly unfunny. I did enjoy Rob Corddry's performance, but that was not enough to save this from being a long boring film.<br><br>As usual, Emmanuelle Chriqui was stunning to look at. I think she has solid acting chops as well, but her character just wasn't likable at all once you find out she's cheating with the mayor. And it was a bit unbelievable that the mayor's wife still wanted to help her after finding out.<br><br>I need to stop renting movies I've never heard of just b/c Justin Long is in them (he was in \"Just Add Water\" as well, and that was another awful movie). I don't know why he does films like those. Wanting \"indie cred\" is fine, but he needs to pick scripts that are actually interesting or entertaining. This film was neither.","user":"indiefilmmaker77","rank":[19,29]},{"title":"Great indie flick","rating":9,"date":"28 July 2010","review":"This endearing and thoughtful indie effort is well worth the watch. There are some hysterical scenes, particularly those between the hero (Justin Long) and his best friend (Keir O'Donell), and everything the Mayor (Rob Corddry) does. The story has a few small holes, but that doesn't get in the way of recognizing that this is a powerful satire of small town America down on its luck. The narrative exposes the fragility of American values when greed and corruption take hold. The hero turns out to be the only one in town that remembers why America is America, and for that his neighbors decide he must pay a price. Lots of turns that you don't see coming, including a big one at the film's climax.","user":"doubleodd","rank":[12,22]},{"title":"More like taking blind stabs","rating":2,"date":"26 July 2011","review":"Independent films are like someone shooting at a shooting range. The person shooting is the film, and the gun is how the film is executed. There is a board with a bullseye a few yards away. It can hit dead center and be an excellent film, hit in the circles around it and be pretty good, hit close to the top and be only fair (but at least you hit it), and some can either clip the top of the board or just fly right over. Taking Chances is fired straight as if it were going to hit around the circles just outside of the bullseye, but then arcs right over the board making for an almost complete bust. Just tragic.<br><br>Part of the reason for this is because Taking Chances is trying to tackle too many genres. Like a kid putting his feet in the pool. Before he can fully submerse himself in water, he notices another pool, runs over there, and puts his feet in that one before going to the next. Taking Chances sinks its feet in the comedy, drama, romance, and social commentary pools before just saying \"hell, lets mix the water together.\" The movie is about an economically challenged town by the name of Patriotsville. The town was the place of The Revolutionary War battle, and due to the money problems, Mayor Fishback (Corddry) wants to build an Indian casino over the battlefield. A history geek named Chase (Long) is heartbroken by this, and teams up with a mysterious girl named Lucy (Chriqui) to try and save the town's biggest piece of history.<br><br>Right off the bat, this could've spawned a number of great genres to touch upon. The problem being the movie never really thought of how it wanted to approach this idea. Should this be a big joke, let's hire Rob Corddry. Wait! We can make this a pretty decent drama, hire Justin Long. He's dependable and likable. But wait, give him a girl to work with so we can get a love story going here. You know, this would be a great time to add maybe some social commentary about history. By the time this movie script was complete, it was a messy, incoherent, and unorthodox piece of work the crew must've said \"just make it.\" Not to mention, the film has an R rating, but constantly the town mayor keeps saying \"f this,\" \"f that\" without actually saying the word. It's almost like the film was trying to edit for PG-13 after it got the R rating. It begs an explanation why this film didn't pursue the R rating after being granted with it. If anything, this could pass for a sizable PG-13 rated film.<br><br>I really like Justin Long. I've liked everything he's done up until this point. Why he did this makes sense because not only does he want Hollywood rep, I assume, he wants Indie-cred as well. Which is perfectly fine with me. I dig multi-talented actors. And I assume he liked the script and his character. But, he failed to look at one thing and so did the directors - there is no point in this film where anyone takes any chances. Are they taking a chance by standing up for what they believe in? If so, make that a bit more obvious please. The original title was Patriotsville. That sounds more like an independent movie Clearly, nothing is consistent in this film. And it's sad because such a good idea was thrown away in the process of constructing this film. I applaud the two leads for doing the best they could under the given circumstances and limitations of the budget, but the end result is calamity.<br><br>Starring: Justin Long, Emmanuelle Chriqui, Rob Corddry, Keir O'Donnell, and Missi Pyle. Directed by: Talmage Cooley.","user":"StevePulaski","rank":[4,8]}]