[{"title":"Hello. I am dying from cancer.","rating":10,"date":"17 February 2010","review":"I am a terminal cancer patient. I pray everyday that somehow things will get better. Every 3 months I get another PET scan and the tumors have either grown or spread to another area. I remain optimistic and continue to hope and pray. I love my son and my wife and it hurts me that they must suffer with me. What I can do is make the best of what I have. I spend precious time with my family and tell them how much I love them. I do the same with my mother. She is so wonderful. In fact, all the people around me have been so helpful in anyway they can. I am so thankful for this. Whether I get better or not, I am so thankful for the life I have been given and for all the people around me that have been involved in my life.<br><br>In the beginning I didn't understand what was happening in this movie. When the pieces fell into place I realized why this movie is a 10 and why no other film could possibly stand up to it. Given the state that I am currently in, I have often asked myself if I am a good person. Have I done enough? Have I made enough sacrifice? What do I deserve? This movie gives words like caring, sharing, sacrifice, etc. a whole new meaning. Yes I was moved by this film and I still pray for myself. I also pray for others and am thankful for the life I have been given regardless of what lies in the future. If I have sparked your curiosity at all, then please do watch this film. This film portrays a value that words cannot describe.","user":"schafer100","rank":[224,247]},{"title":"Simply Beautiful","rating":10,"date":"28 December 2008","review":"This is the first time I have ever posted. I saw this movie and it made me want to post. IT seems Seven Pounds is getting a lot of negative press and I felt like I need to do my part to let some people know that this movie is SIMPLY BEAUTIFUL! For me, this was a rare movie that stays with you. I found everything about this movie beautiful..the acting, the music, the directing and especially the beautiful story. A story of giving..sacrifice with purpose. I am not the biggest Will Smith fan, but I must say that his performance for me was ASTOUNDING. I felt his pain and was moved by what his character was doing. This is not a easy story to tell in 2hrs and I think they did a really fantastic job. This movie will not be for everyone...it moves slowly and may be confusing..until you figure it out...then the reality of his purpose will crush you emotionally and at the same time it is so beautiful....SWEET PAIN (it did for me anyway)....Seven Pounds is a wonderful movie that will stay with you long into the night and next day.....Thanks","user":"radiopearl","rank":[579,690]},{"title":"Definitely worth seeing!!","rating":10,"date":"17 December 2008","review":"I don't give out 10 stars easily unless it's a film that can keep me guessing. A film that will make me want to see it through to the end, not because I paid hard earned cash, but because I truly care about the characters and where they're going to end up. If you like me, then you're going to want to see this one.<br><br>Will Smith has always been an interesting actor for me. I watch everything he does because I'm a huge fan. I must admit that the idea of him playing another heartbroken, distanced from the world individual (Hancock, I am Legend) made me a little annoyed, but this one was a home run. The character Ben Thomas is such a mystery that you want to know what he plans to do; for others, for himself, etc. As the story unfolds, so does his intentions and not in a really simplistic way. He's a complex person, but not so much that he aggravates me. He's intriguing.<br><br>The connection between Will Smith and Rosario Dawson is so well done and so believable. This is how it's supposed to be done. There's a chemistry in their acting that I haven't seen in about 10 years or so. I'm not exaggerating. I haven't seen too many films where the chemistry is genuine; kudos to the both of them.<br><br>It is very touching and sad, yet heartwarming. Geez, did I say that? I walked away from this one feeling good. That's what it is in the end. A feel good movie.","user":"datdudesketch","rank":[678,897]}]