[{"title":"Lars Has an Anatomically Correct Girlfriend","rating":9,"date":"14 November 2007","review":"Lo and behold, a film that still believes in simple human kindness.<br><br>There's been a severe lack of that on our movie and television screens lately, which is why I found \"Lars and the Real Girl\" utterly irresistible. I imagine this is the kind of movie that's either going to work for you or it's not. I can guarantee that if you go into it and pick apart all the ways in which it's not realistic, you're not going to enjoy it.<br><br>Ryan Gosling has rocketed to the top of the list of my favorite contemporary actors. He's given two of the best performances in the last two years: here in \"Lars\" and last year in \"Half Nelson.\" The success of \"Lars and the Real Girl\" depends almost entirely on Gosling's ability to sell this character to the audience, and he does so flawlessly. Lars is a sweet teddy bear of a man who also happens to be intensely lonely. He orders a life-size and anatomically correct sex doll and proceeds to make a companion of her, taking her to parties, to church, to family dinners. A psychiatrist (a marvelous, as usual, Patricia Clarkson) tells the family that the best thing they can do for Lars is to encourage his delusion until he works through whatever is causing it; they relay that to the townspeople, who take it to heart. As a result, Lars's \"girlfriend\" is completely accepted by the town, and even gets elected to the school board.<br><br>Ultimately, \"Lars\" probably isn't very realistic, but isn't it nice to think it could be? That a group of people could be this warm, kind and accepting, simply because they happen to like somebody and want to see him get better. The film is full of wonderful performances from everyone. In addition to Gosling and Clarkson, Emily Mortimer shines as Lars's caring and worried sister-in-law.<br><br>It really irritates me that critics were divided on this movie on the basis of it pushing the boundaries of credibility, when they almost unanimously praised \"Gone Baby Gone,\" a film so melodramatic and heavy handed as to be no less implausible, and that goes down as two of the most unpleasant hours I've spent in a movie theatre for a long time. Has our culture now decided that a film about good kind people is too unrealistic to stomach, and that the only movies that ring true are ones about human depravity? <br><br>So far, \"Lars and the Real Girl\" is one of my favorite films of the year.<br><br>Grade: A","user":"evanston_dad","rank":[302,337]},{"title":"Don't let the synopsis put you off","rating":9,"date":"16 October 2007","review":"There is just no way to explain the plot of this film and not have it sound rather silly and this film is anything but foolish frivolity. I found it utterly charming and carefully and delicately directed. There are moments of belly shaking humor and quiet tears as Ryan Gosling brilliantly evolves from a reclusive soul with the help of a silicone woman and a kind hearted community. I want to know these endearing people. There is a moral point to this film, perhaps more than one. Don't be put off by the synopsis, or trailer. This is not your standard Hollywood fare. See it for the humor, or the humanity, either way, you will be glad you did. I see very, very few films twice- this one is on my list.","user":"angela-373","rank":[355,404]},{"title":"Touching and Original","rating":10,"date":"13 October 2007","review":"This is one of the most remarkably original films that I have ever seen, providing a refreshing comment that we can learn and expand our horizons from each other if we approach everyone's foibles with a degree of kindness. It is laugh-out-loud funny, but it is also thought-provoking and moving.<br><br>Ryan Gosling provides a spectacular tour-de-force as a dysfunctional young man in a small town who only begins to blossom when he starts a \"relationship\" with an expensive love doll. When he takes the risk of introducing \"Bianca\" to the tightly-knit community in which he lives, the \"relationship\" is met with an unexpectedly heartwarming response.<br><br>Strong support is provided by the always-refreshing Emily Mortimer, Patricia Clarkson, and by Kelli Garner as the sweet thing who becomes \"Bianca's\" rival. But Gosling provides the heart and soul of this remarkable film that never strikes a false note.<br><br>The movie has an incredibly powerful and positive message about the ability of a community to heal and nurture a troubled soul by treating it with acceptance and compassion. It should be required viewing by anyone who feels alone in the world.","user":"madbeast","rank":[308,359]}]