[{"title":"Likable film with a lot of heart","rating":7,"date":"22 May 2011","review":"I think critics have been conditioned to think that any movie with Jennifer Aniston in it these days has to suck. I happily declare that this one doesn't. It has a likable romance. The dialogue is actually funny (especially anything that comes out of Jeff Goldblum's mouth). Based on the premise - which comes off much less implausible than it probably should - I was expecting a lot more lowbrow comedy and was pleasantly surprised. And Jason Bateman is a wonderful and underrated leading man. The voice-overs are perhaps a bit insipid and probably could have been skipped entirely, but that's a minor complaint. I enjoyed the film. 7 out of 10.","user":"cerule14","rank":[30,38]},{"title":"Quite Enjoyable","rating":7,"date":"29 March 2011","review":"Unmarried Cassie (Aniston) wants to have a baby and has a Sperm Party with donor Roland (Wilson) in tow. The deed gets done, but the specified cup gets switched by Wally (Bateman), who gets so drunk he doesn't remember doing it. Neurotic Wally has a thing for Cassie, but does nothing about it. Seven years later when he meets Cassie's son, Sebastian (Robinson), Wally sees many of his mannerisms in the kid. This should be interesting. Funny too. <br><br>First of all, there is nothing uncomfortable in here. But, it is Sebastian who will get to you. The banter between Cassie and Wally is good, but when Sebastian comes on the scene, you know you have to see this through. Believe me, the kid will get to you. The lines (and not entirely easy ones) that Thomas Robinson has to say as Sebastian are unbelievable in that they are flawless and to the point. Amazing for a 6-yr old going on 30. <br><br>There is comedy but it comes between Wally and Sebastian and it's quite enjoyable. You find yourself wishing there were more scenes with Wally and Sebastian. These scenes are the hooks and why you stay. There is some adult humor too, but it's old hat and kind of expected. <br><br>Nice to see Jason Bateman getting a lead and this should be a stepping stone to other leads. The chemistry between Bateman and Aniston was good for the characters they portrayed. Aniston is still Rachel (character from the Friends TV show) and seems most comfortable with that role so there is nothing new with her in here. Hey, we like Rachel. What's not to like? She had a chance to branch out when she did DERAILED, a good drama with with Clive Owen, but that was just a one-time thing apparently. Too bad, as she was good in that one. Jeff Goldblum performed well, as always, but still has that Gary Shandling look on his face like he is going to burst out laughing hysterically at any moment. All the cast performed to expectations and that was very good. <br><br>This does play out like a made-for-TV movie, but the chemistry between Bateman and Robinson makes it all worthwhile. This was their show. <br><br>Violence: No. Sex: No. Nudity: No. Language: No.","user":"bob-rutzel-1","rank":[29,37]},{"title":"Tired Insemination Premise Gives Rise to a Surprisingly Sharp Comedy with a Smart Cast","rating":8,"date":"21 March 2011","review":"If the Hollywood studios still made the type of urban comedies they made back in the early 1970's starring George Segal (usually) as a neurotic nebbish, then Jason Bateman's big-screen career would certainly be secure. As he displayed consistently on \"Arrested Development\", the actor's dry delivery and slyly observant manner are a perfect match for Wally Mars, the comically cynical equities analyst he plays in this sadly overlooked 2010 romantic comedy co-directed by Will Speck and Josh Gordon (who much to my surprise, helmed the Will Ferrell figure-skating comedy, \"Blades of Glory\"). Although he is the true protagonist of the story, the movie was marketed as a Jennifer Aniston vehicle. She plays rising TV producer Kassie Larson, his long-ago girlfriend who has relegated him to the \"friend zone\" even though he obviously hasn't gotten over her.<br><br>Written with verve by Allen Loeb (who also co-wrote Aniston's recent 2011 movie, the Adam Sandler starrer, \"Just Go With It\"), the story revolves around Kassie's ticking biological clock. In a seven-years-back flashback, she is seen deliberately bypassing Wally as a possible sperm donor in favor of a more predictable candidate, Roland, a struggling associate professor at Columbia, who happens to be married and drop-dead handsome. At an \"insemination\" party, Wally gets wasted and drops the carelessly placed vial of Roland's semen down the bathroom sink. This leaves Wally no choice but to replace the sample himself. Kassie eventually becomes pregnant and moves back home to Minnesota. Flash forward to the present, and Kassie returns to Manhattan with her six-year-old son Sebastian in tow. The fact that Sebastian acts like a miniature version of Wally gets completely past Kassie but not Wally who slowly realizes that out of his stupor years ago, his son was conceived.<br><br>Although this indiscretion would seem like the perfect excuse for Wally to reveal his true feelings for Kassie, complications ensue when she starts a relationship with Roland, now desperately on the rebound from a bitter divorce. At the same time, Wally forms a close bond with Sebastian who naturally gravitates toward him because of their mutual idiosyncrasies. Bateman handles Wally's evolution from self-absorbed fatalist to paternal protector with aplomb and surprising depth. Aniston is better served here than in most of her standard-issue romantic comedies, and the sharp interplay between these two actors, especially in the beginning scenes, is refreshingly rapid-fire like a modern-day \"His Girl Friday\". With his constantly forlorn expression interrupted by moments of genuine happiness, Thomas Robinson is terrifically understated as Sebastian, and his unforced scenes with Bateman represent the true high points of the film.<br><br>A crack supporting cast has been assembled. As Wally's best friend and manager, the sarcastic ladies' man Leonard, Jeff Goldblum takes a predictable role and gives it his special, off-kilter twist. The result is his funniest turn in years, for example, his use of the term \"ill-advised\" during the moment of revelation is hilariously unexpected. The same can also be said for Juliette Lewis, who plays Kassie's constantly inappropriate best friend Debbie with her spacey delivery intact as she slings clever putdowns at Wally. Even Patrick Wilson, saddled with the no-win role of the golden boy Roland, who has no capacity for honest introspection, is funny in a role that gets diabolically transparent as the proceedings get complicated. The 2011 DVD/Blu-Ray offers a standard set of extras - a fifteen-minute making-of featurette (\"The Switch Conceived\"); about ten deleted and alternate scenes running for nearly half an hour in total, one a more purposeful variation on the central scene; and a brief blooper reel. Give it a try.","user":"EUyeshima","rank":[26,34]}]