[{"title":"A solid character driven action film.","rating":9,"date":"25 June 2010","review":"Right from the opening with the brutal murder of billionaire, Neiro Winch, to the end of the film with Largo finally accepting who he is, Jerome Salle, has created a strong, character driven, action film in adapting Jean Van Hamme and Philippe Francq's fantastic graphic novel. From the introduction of Largo - saving a girl from very large soldiers - Salle keeps the story and character beats strong throughout his action sequences. And the way he frames his shots truly shows off the beauty of the world wide setting of a Largo Winch story.<br><br>The story is very well done, both in writing and as shown on the screen, concentrating on Largo's life as he searches for his place in life as oppose to action sequence after action sequence.<br><br>Tomer Sisley is spectacular as Largo Winch. Playing the role with passion, wit and cockiness. He owns the screen when he's on it and doesn't give an inch to any of the extremely strong actors he's playing against. Kristen Scott Thomas is deliciously slimy as Group W's number two. She needs to play villains more often. My personal favourite scenes are every one with Tomer Sisley and Karel Roden together. Two fantastic actors that both went for it and didn't give an inch to the other.<br><br>This is a fantastic action film that has more heart and story then most north American films. Highly recommended for anyone who enjoys well written action/espionage film.","user":"LucasNorth","rank":[25,28]},{"title":"Great movie but not in the Hollywood style.","rating":9,"date":"11 June 2010","review":"I just can't read all those comments. You are complying that this movie isn't similar to Batman, Superman or James Bond? It's very disappointing that US rating is at 6 points. You liked District 8 - strange camera views and shaking hands, You like Tarantino with his time jumping scenes, and You are complain about movie that has both features. For me, Largo Wintch is real. It isn't a guy who uses laser weapons and flying cars loaded witch tons of explosives. He can't fly - it's an issue. He is in jail, and doesn't want to be rescued by cash - money isn't everything - movie says (at least few times). That movie carries a huge emotional load. I think that this film is voted so low, because it doesn't fit to classic Hollywood scenario of action movies like Superman, X-man e.t.c. Largo is to real, so any complaints are about his way of getting out of trouble.<br><br>I was enjoying this film from the beginning to the end. It was unpredictable, well played and well showed. At the end, i didn't know that comic book was precursor.","user":"morpi-600-332582","rank":[65,89]},{"title":"A good Action/Thriller Movie. Proof yet again that France can deliver good movies in the genre","rating":8,"date":"6 April 2011","review":"A good Action/Thriller Movie. Proof yet again that France can deliver good movies in the genre. After reading the 14 reviews that preceded mine and doing a little digging, I was able to find out the origin of the character, specifically that it is a character from illustrated or graphic novels created by Jean Van Hamme and Philippe Francq. I also noticed that there was a television series based on the same work. <br><br>Well that being said, I admit enjoying Julien Rappeneau and Jérôme Salle's scenario adaptation. I am not in any way attempting to critique or compare the movie adaptation to either the graphic novel or the TV series. The movie, as a standalone work, was most entertaining.<br><br>The pace is fast but has necessary slower scenes allowing us to get to understand the characters and the circumstances, instead of being driven solely by action and special effects, both of which are not lacking in the least. I was unfamiliar with most actors in this movie and I thoroughly enjoyed the performances, particularly the one of the lead role. Familiar only (to me) was Kristin Scott Thomas who plays the key character Ann Ferguson which, based on the later scenes in this movie, will certainly, and sadly for me, not be back in the 2011 sequel (which I look forward to seeing), also a Jérôme Salle written and directed movie.<br><br>I don't like to read reviews that affirm either Hollywood or Euro made action and thriller movies being better than the other; it's a matter of taste, not opinion which means those who can enjoy both have the best of both worlds. I am very happy to see Euro made action and thriller movies as a welcome change of perspective and culture. Pity for those who only want to eat fried chicken and potatoes; they are missing out on all the other culinary delights. So it goes for movies and books. The graphic novel The Heir – Largo Winch, is not one of a super hero like so many American ones are; instead it is a novel based on a regular person living an extraordinary life and that type of adventure put to screen is one I hope you will like as much as I did.","user":"JohnRayPeterson","rank":[9,11]}]