[{"title":"More than \"A Man and His Dog\" film","rating":9,"date":"3 January 2009","review":"After reading some of the outlandish bad reviews, I had to comment on this film. I know people's perceptions differ, but some of the bad reviews are so exaggerated and are, lack of a better word, incorrect! I was hesitant about going to see just another generic man and dog film. It was my girlfriend's idea, and I figured it would be another corny chick flick about how a couple get a dog and how it brings them together. After I began watching, it grabbed my attention and never let go! I don't think my review of this film will be able to capture the true essence and emotions this film captures, but here goes: The film was very gripping in its realistic portrayal of the development of a family and their pet from the couple's wedding until the film's end approximately 40 years into their lives. I think for most people, the couple's relationship and even a troublesome pet will seem familiar(imperfect, but yet believable). The movie isn't solely about the dog, but how the dog is a bit of a nuisance at first, but matures along with the family. Giving many more details may ruin the story, so I'll hit some of the points that need attention.<br><br>Some people argue that this film lacks comedy, but it's subtle comedy(the type real life offers...nothing exaggerated and unbelievable...like too many Seth Rogan films). Owen Wilson is more toned down, but he adds his spin to a more down-to-earth role as a husband that chooses his life as a husband over the dream life he had pictured. Aniston delivers one of her best performances, in my opinion. I'm not a big fan of her acting, but she gives an undeniably good performance as Wilson's adoring wife.<br><br>Regarding the \"nudity\" and \"sex\", yes they hint at having sex, but nothing is shown nor sounds like sex. There is NO NUDITY!!! There is a shot of Aniston's naked BACK(not her backside, her back). All of the film's sexual innuendos are while they are married! If anything I think this sends a positive message to younger viewers that this is the way it's supposed to be...fun isn't over after marriage and in some cases, it's when the real adventure begins. Children these days have seen worse than this film shows on network TV and MTV. I didn't hear any bad language that isn't on TV already. It wasn't what most people consider the worst words. And lastly, the sad part of the film is realistic not morbid, murder, or uncalled for...sometimes I think people are so used to films like The Dark Knight that when they see a wholesome, realistic film they're disappointed because they're wanting something epic.<br><br>Give this film and chance and realize going into it that it's not the mindless, idealistic comedy that Hollywood has stuffed down our throats lately. It's heart-warming, wholesome, and true to life.","user":"rage_212","rank":[342,407]},{"title":"Surprisingly Good","rating":8,"date":"28 December 2008","review":"When I first saw the previews for Marley and Me, I thought, ugh, another desperate attempt by Jennifer Aniston to resuscitate her career. I used to be a huge Aniston fan back in the \"Friends\" days, but it's been years since I've seen any of her movies. And as for Owen Wilson, he always seemed like a goof who rode on the wave of his older brother's success. This movie proved me wrong on both counts.<br><br>Marley and Me is about a dog, definitely, but it's just as much about a man (John Grogan, played by Wilson), his wife (Jenny, played by Aniston), and his growing family. The film follows John from his wedding night to the peak of his journalism career a dozen years later, years that are chronicled in his weekly columns for a Florida newspaper. Marley, the lovable but horribly destructive yellow lab, enters his life as a puppy, in an attempt to prepare him and his wife for future children. The dog, as expected, tears apart the house, makes wild escapes, humps the dog trainer, and lovably terrorizes other people. But the film effectively intersperses those episodes with tender, sincere moments of human/dog bonding. Marley is there to comfort Jenny when her husband cannot, adjusts to the children as they grow older, and intrudes on the family's most private moments. He is a constant, and at times, annoying presence, but Marley underscores the emotional tone of the film without dominating it.<br><br>Similarly, both Wilson and Aniston deliver understated performances that convey the ups-and-downs of any marriage. While it is the bond between John and Marley that the film explores most deeply, Jenny provides the link between dog, family, and children. In the end, she realizes what Marley has become, and what he has always been, to the two of them. The film's overall tone - light, humorous, but at times very real - builds up to an ending that is surprisingly moving. <br><br>Marley and Me is a tender-hearted, easy-going film that will appeal to any dog-lover. But it will also, I think, appeal to anyone who can look back on his or her life and trace a common thread through each passing year. A beloved pet, like Marley, has that unique capability. I wish I could thank my own dog for that. But, as one of the children in the movie tearfully says, I'm sure he already knows.","user":"socact-1","rank":[205,254]},{"title":"There was sobbing...","rating":9,"date":"26 December 2008","review":"Every year I go to see a movie on Christmas Day. It's been a tradition since high school. This year's Christmas movie was \"Marley &amp; Me\". I was more excited by the fact that it was something that everyone could go and see; including my mom, who doesn't venture out to the theater very often. Anyway, I was happy that she and my girlfriend were excited to see this.<br><br>As I am sure many posters will repeat this phrase, if you've ever been a dog owner, this movie really rings true. The movie itself is very simple; it chronicles the growth of a couple and the impact their pet Labrador has on their family throughout their life. <br><br>It is really the simplicity that makes the story work so well. This isn't \"Old Yeller\" or \"Lassie\", though some elements are there. This isn't a dog movie focused on the relationship of the canine and a kid (a la \"My Dog Skip\"). This is a true depiction of what it is like for most people to get a puppy early in their relationship and how it can develop into them becoming a member of the family.<br><br>There aren't many people in the cast. Jennifer Aniston really does the best job in the picture. I'm a fan of Owen Wilson (I know many aren't), and it was nice to see a serious side since we really hadn't seen one since \"Behind Enemy Lines\". He did a good job, but he really would've sold me if he had shed some full on tears when it was required. But he was very believable nonetheless.<br><br>The film really humanizes the characters and their relationship with Marley with such realism. I haven't had a chance to read the book, but I have a feeling the movie captured the essence of the story. <br><br>I have been a dog owner my entire life. I had 5 from childhood through college and have experienced the beginning act of the movie having purchased a puppy with my girlfriend 2 years ago. He is now a 2 yr old member of our family, and we would be devastated if we ever lost him. Most can relate to the experience of being a pet owner, and even if you can't, there are messages here you can still connect with. I definitely recommend this for ANYBODY, but try to take the family. If you never wanted a pet before, I challenge you to not change your mind after viewing this. And yes, men, women and children alike were sobbing by the end","user":"pktbishop","rank":[184,233]}]