[{"title":"The wait was worth it!","rating":9,"date":"22 March 2019","review":"\"The Dirt\" Drinking Game: take a shot of Jack Daniels whenever you hear the words \"dude\", \"man\" or \"chicks\". Take a shot for each bare breast you see. Check yourself into rehab 1.5 hours later.<br><br>I had been waiting to see this film for 12 years - ever since 17-year-old-me first read \"The Dirt\". It doesn't disappoint. In fact, it was way more enjoyable and fun than I thought it would be. It's cringeworthy, cheesy as hell and over-the-top - but then so is 80s rock. \"The Dirt\" seems self-aware of this though and doesn't take itself too seriously. It regularly breaks that fourth wall to hilarious effect.<br><br>It's basically a comedy with a side of debauchery, partying and drug addiction. Oh and there's occasionally some awesome music thrown in too. It follows the four band member narratives just like in the book - and it works. I came away with Mick Mars having become my new favourite member of Mötley Crüe. I feel they got the personalities dead-on.<br><br>Given the length of the book, this rollercoaster felt like it was over all too soon. Still, it was fun while it lasted - much like the career of Motley itself. Go into this with an open mind, don't take it too seriously and just enjoy the ride.<br><br>Most fun I've had watching a movie in ages. I'm off to go spin my copy of \"Dr Feelgood\" now!","user":"maccas-56367","rank":[258,313]},{"title":"Great movie even if your not a fan","rating":9,"date":"22 March 2019","review":"I know some die-hard fans are gonna whine about how not everything in the movie was accurate but hey, neither was Bohemian Rhapsody (.. and look how well that went!). If you want historic accuracy, read a book. The Dirt was an ENTERTAINING two hours and hell, I enjoyed it even though I'm not the biggest fan of the Crüe. And would watch it again.","user":"megavahinko","rank":[160,208]},{"title":"Great escapism and nostalgic movie 🎥","rating":8,"date":"22 March 2019","review":"Great movie that takes you back in time and if you lived through that time then its a nostalgic trip.\nIt's rude, loud and crude, but that's the Crue, so if you're offended then why the hell are you watching it.\nSure some timelines are a little all over the place and there are a number of key Crue moments that are left out or glossed over. However at 1hr and 48mins it's to be expected.\nThis is a movie that should have ran for a full 3 hours and really dragged you in, but instead it was nearly 2 hours of fast paced fun, debouchous, alcohol (and drug) fueled escapism, which is what the Crue are and were all about for many growing up.\nThrow in there the tissue moments as well as the self reflection and you've a movie that could easily see a sequel.","user":"stuart-42348","rank":[102,136]}]