[{"title":"Absolutely delightful film!","rating":9,"date":"8 April 2010","review":"I saw this film at an early screening and couldn't have been more delighted. The film is charming, adorable, and sweet with many laughs to be had as well. The message of romantic love being timeless and one that can cross many generations was very well appreciated and felt. The scenery of Italy in the film is gorgeous. There are breathtaking shots that make you want to hop on a plane after the film is over and go there yourself.<br><br>It was also truly refreshing to watch a film that I don't believe contained a single cuss word or sexual innuendo. (We need more of these movies). You could see this movie with your teens or your grandmother without the slightest bit of concern about being embarrassed of what might show up on the big screen. You walked out of the theatre feeling happy and remembering your own love story -- or hoping for your own love story to come.<br><br>Don't miss this one if you get a chance to see it. You will not be disappointed.","user":"ltoner1","rank":[160,213]},{"title":"Unexpectedly good","rating":8,"date":"15 May 2010","review":"I had expectations of seeing a nominal quality love story going in. I was pleasantly surprised that this film was a noticeable cut above the average. I enjoyed it a great deal; and judging from the audience, so did everyone else.<br><br>A long time ago I realized that the way the best love stories work is to make the audience wish they could be the character on the screen. This movie does this in spades.<br><br>The major weight of carrying the film rested squarely on the shoulders of Amanda Seyfried. Other than being very lovely shoulders, she did an excellent job of portraying her character. She has a great range of endearing expressions. I've seen her in a couple of other films that I enjoyed her in, but none better than this; even considering the broader production values of \"Mama Mia\". She was radiantly beautiful and added just the right note of intelligence, warmth and charm. In one scene where her character described her excellent education, it didn't seem ludicrous coming from her as it has in the past from other actors. I'm looking forward to seeing more of her - and not just because of her radiant beauty either.<br><br>The rest of the cast did an admirable job as well. Gael García Bernal did well in his role of Seyfried's distracted workaholic fiancé. Later in the film, the arrival of Christopher Egan as counterpoint to Bernal was handled with better than average skill by Egan. His grandmother, played with subtlety by Vanessa Redgrave, was the focus of the story and has never seemed more sensitive and caring. But hey, fellas, whoever was wrangling the script (Rivera/Sullivan), she wasn't believable saying she was 65 when she's 73. But that was the only off note to me. Finally, Oliver Platt added an enjoyable aside as Seyfried's boss.<br><br>Finally, the rest of the productions elements, sets, costumes, locations, etc are all right on the money for the theme and feel of the film; nothing out of place of awkward looking. Excellent entertainment all around.","user":"bjones","rank":[83,107]},{"title":"True Love does not Have Expiration Date","rating":7,"date":"18 November 2010","review":"In New York, Sophie (Amanda Seyfried) is the efficient event checker of The New Yorker and her fiancé Victor (Gael García Bernal) is an enthusiastic chef that is opening an Italian restaurant of his own. They decide to have a pre-honeymoon traveling to Verona, where Victor will visit his suppliers. Once in Italy, Victor does not give much attention to Sophie, spending his time with the meetings. When he decides to travel to Livorno, Sophie prefers to stay in Verona to sightsee the historical places. She visits the house of Juliet, where tourists leave love letters and she finds a group of women called \"secretaries of Juliet\" that reply the letters. She joins the group and finds an unanswered letter from 1957 from a British woman named Claire Smith (Vanessa Redgrave) hidden behind a brick and she decides to reply the letter. A couple of days later, the snobbish and skeptic prig Charlie (Christopher Egan) visits the secretaries of Juliet and Sophie leans that he is the grandson of the widow Claire that has just come to Verona to seek out Lorenzo Bartolini after receiving the letter written by Sophie. She meets the old lady and they decide to search her former love together. There are seventy-four Lorenzo Bartolini in Italy, but true love does not have expiration date. Meanwhile the estranged relationship between Sophie and Charlie changes.<br><br>\"Letters to Juliet\" is a delightful romance highly recommended for romantic viewers. I have seen the trailer that is a spoiler indeed and I postponed the DVD to watch it later. But the movie is worth, specially watching the performance of Ms. Vanessa Redgrave, who is still a very elegant and beautiful lady and gives credibility to Claire Smith. The witty and sparkled Amanda Seyfried seems to have fun performing Sophie and Christopher Egan completes the charming young lead couple. For those like me that have never had the chance to visit Italy, the journey of Claire, Sophie and Charlie is an awesome sightseeing in this beautiful country. My vote is seven.<br><br>Title (Brazil): \"Cartas para Julieta\" (\"Letters to Juliet\")","user":"claudio_carvalho","rank":[36,44]}]