[{"title":"Not your average animated feature...","rating":2,"date":"2 December 2007","review":"...in fact, there is nothing average about this film. Traditionally animated in black and white flashbacks, it tells the story of a French-speaking woman's childhood and young adulthood in Tehran, Iran, and in Vienna during the 1980s and '90s.<br><br>Marjane Satrapi grew up in a family of revolutionaries against the Shah's regime and the Islamic government that subsequently took hold, and the film literally illustrates her feelings and thought processes as a little girl, following her as the government control in Iran got more and more strict. When her parents insist she leave the country, we also see her struggling to deal with adolescence and missing her beloved family; when she returns, she is also coping with the increasing repression of her freedoms as a woman. Most of all, you see her own personal conflict as she tries to stay true to herself.<br><br>This movie beautifully balances both the historic and personal issues and pulls the threads together into a compelling narrative, made a bit quirky by the style of presentation, resulting in work that is altogether touching. Along with intelligence and humor, a deep and strong sense of truth infuses every part of this film, making it even stronger. One of my only qualms was the feeling that it ended somewhat abruptly without much of a conclusion.<br><br>Overall, though, it was fantastic - definitely worth watching.","user":"nonsequitur247","rank":[167,179]},{"title":"Animation in black-and-white, autobiographical, growing up in Iran during the reign of the Shah and later, the Islamists","rating":8,"date":"3 July 2007","review":"The black-and-white animation, highly stylized and two dimensions which doesn't attempt to render the usual cartoon 3-D, summarizes in quick, intelligent flashes, often impressionistic, growing up in Teheran and Vienna from a highly personal point of view. The narrative is as original as the art. The narrator, Marjane Satrapi, only daughter of an educated Teheran couple, first sketches in briefly how the Shah first came to power,only to lose it and have it replaced by the fanatical religious regime of today. Educated in a French school, she and her family are rapidly alienated from the so-called revolution; she is sent to Vienna to continue her education, falls in with a group of punks and eventually returns both depressed and disillusioned to Teheran where, with other university students, she must submit to the rule of extreme Islamists.<br><br>The story covers a great deal of ground from the point of view of a young pro-Western culture radical, and is told with humor and intelligence. She laughs at herself as much as at the semi-lunatic Guards of the Revolution.<br><br>Satrapi's hold on reality is much strengthened under the influence of her highly honest grandmother who teaches her not co compromise, not to betray and not to give in.<br><br>This is no fairy tale with flying horses and beautiful princesses, but a serious, unsentimental and sometimes brutally honest film covering, among other events, the story of the millions of Iranians and Iraqis who died in a now forgotten seven year war around the Persian Gulf.","user":"collingonze","rank":[182,205]},{"title":"A very personal yet universal account of the Iranian revolution","rating":8,"date":"19 August 2007","review":"I came out of this movie feeling as if I knew Marjane Satrapi. The way in which the story is told is fantastic - it really is as if you're reading her journal. As she grows up from being a young girl to an adult, at each age the story is told with a corresponding maturity, and highlighting things which seem like very personal memories. As a young girl, the stories she is told are very black and white, and as she gets older the complexity increases, which is exactly what you would expect. Although there is lots of political activity, she makes fun of herself and highlights her own shortcomings as much as she highlights the repressive elements in her homeland. By telling of her own experiences it really is extremely easy to see how so much of it is common to a whole generation of Iranians. Her love of her family and her country came across very strongly, and you really felt as if she had laid herself bare. A moving and entertaining movie as much as it is educational about post-1979 Iran.","user":"inglis-5","rank":[127,148]}]