[{"title":"Original and intriguing","rating":8,"date":"16 October 2008","review":"I've just come back from the premiere at the London film festival and I've thoroughly enjoyed, it but before I say anything, do not expect it to be \"a mix between V for Vendetta and the Dark knight\" which is a complete nonsense I read earlier, it's nothing like it. <br><br>In fact, the sci fi element is only a small (albeit crucial) part to the story, most of it taking place in present day London. <br><br>It's more of a psychological drama, a bit of a slow starter as well until all the pieces are put together and it starts making sense. To be honest the less you know about the story, the better otherwise it will ruin your enjoyment <br><br>The acting is excellent, I would say it really is Eva Green's movie, she shines throughout the movie with a rather difficult role and is absolutely beautiful. Sam Riley and Ryan Philippe are very good too although they have a little less material to play with. <br><br>I think it's going to be hard sell as it is unlike anything I have seen, and if they try to market it as an action/sci fi movie, it will be very misleading but I still definitely recommend it if you're looking for something a bit different.","user":"ldealberti","rank":[101,132]},{"title":"One In The Eye For The Attention-Deficienct Popcorn Cattle","rating":7,"date":"28 April 2009","review":"Yes, it's a slow, slow build-up featuring seemingly unconnected story threads, fantastical settings and comic-book characterisation. Yes, it's all a bit of a muddle at times, and plays like the disconnected fast-cut chapters of a cynically devise modern supermarket bestselling novel.<br><br>But it's different.<br><br>Not out-there different, just stoically different from the average Hollywood committee-designed faux art-slice. It's a film that refuses to bend to the will of popular expectation and also to the viewer's clamouring desire for exposition.<br><br>For that it's to be applauded; it seems remarkable it managed mainstream distribution given the fact so many will be 'bored' ('man') awaiting the connections to satisfy their anticipation.<br><br>And you may well gather what's going on before it's explained (with a little ultimate dubiety) on screen, but this is still a well-executed piece of cinema with a solid cast that dares to offer something a little different to current lame traits after seemingly setting itself up as just another by-the-numbers collage.<br><br>Clever at times, atmospheric, beautifully shot with a good cast. Worth, nay deserving, of a watch as a mild antidote to patronising Hollywood mainstream. A solid seven out of ten.","user":"thesandfly77","rank":[99,132]},{"title":"Distorted Minds","rating":7,"date":"10 November 2012","review":"In a parallel world, the dark and chaotic Meanwhile City is ruled and controlled by religious Powers That Be. The masked vigilante Jonathan Preest (Ryan Phillippe) seeks out the evil Mr. Tarrant (Bernard Hill), who has abducted the eleven year-old Sarah to force her to join the Duplex Ride sect. Preest uses the scum Wormsnakes (Stephen Walters) to find Mr. Tarrant to rescue Sarah. However he is betrayed by Wormsnakes and imprisoned along four years by the religious agents. He learns that Sarah was murdered and when he succeeds to escape from the imprisonment, he chases Mr. Tarrant to kill him and bring justice to Meanwhile City.<br><br>In London, Emilia Bryant (Eva Green) is a suicidal that misses her father and despises her mother. Milo Franklyn (Sam Riley) is a young man that was left by his wife Karen and seeks comfort with his friends Dan and Laura. Milo has the sensation that he has seen his red-haired childhood sweetheart Sally (Eva Green) on the street and decides to go to his school to research Sally's address. However, he meets her at school and they schedule a date in a small restaurant. Meanwhile, Peter Esser (Bernard Hill) is seeking out his missing son David Esser (Ryan Phillippe), who is disturbed with the loss of his sister Sarah, and he meets Bill Wasnik (Stephen Walters) that gives an address to him. Peter goes to visit his son that is wanted by the police and waits for him in the same restaurant that Milo will meet Sally. <br><br>The worlds of these characters are entwined with revelations about painful truths.<br><br>\"Franklyn\" is an intriguing and original movie about distorted minds protecting painful truths. The screenplay keeps the mystery until the very end and the visual concept of Meanwhile City is twisted like the mind of David Esser. Eva Green is impressively beautiful even performing a character without glamor. The beginning is hard to follow but if the viewer gives a chance, he or she will will not be disappointed. My vote is seven.<br><br>Title (Brazil): \"O Justiceiro Mascarado\" (\"The Masked Vigilante\")","user":"claudio_carvalho","rank":[26,32]}]