[{"title":"A great family movie and a history lesson to boot!","rating":9,"date":"1 December 2006","review":"I watched this movie with my six year old daughter and my Mom. First let me say that this a good family movie...they seem to be rare today! We all enjoyed the story of Molly and her family set during WW II. It was a first glimpse of the WW II era for my first grade daughter. My Mom was in fourth grade when her father went off to serve in the war so she could really relate to the story and enjoyed it a great deal. At one point during the movie my mother remarked \"this is quite a history lesson\". The story is so interesting that most kids won't even realize that they are learning as well as being entertained.<br><br>This a a must see for everyone, not just American Girl Fans. A very interesting history lesson!","user":"Ameliasmama2000","rank":[10,10]},{"title":"A very touching family movie!","rating":9,"date":"26 November 2006","review":"This movie was done extremely well. Even though the trailers make it seem like it's all about dancing, it's so much more than that. You won't want to leave your seat for anything! You'll learn to appreciate what you have, and to be willing to give that up when it is needed elsewhere. I've actually never read the Molly books, but I plan to soon! I feel that the acting was done very well. Molly and all her friends and classmates looked like regular American children. And the people that worked behind the scenes did a really excellent job in making it seem like you had been transported back to the 1940's...I was actually really surprised to come on here and find out how recent this movie was done! Overall, this movie will definitely cause you to grab a tissue and hug your family members really close, because you never know when everything will change.","user":"Eveningstarz_4","rank":[18,23]},{"title":"Best American Girl Movie So Far","rating":8,"date":"28 November 2006","review":"I've enjoyed the Samantha and Felicity movies but the Molly movie rocked. Maybe it's just that I am a sucker for WWII movies, but it is also that I thought this was just a perfect movie for 21st century American children to get an idea of what it is like to live during wartime. Maya Ritter did a credible job in the title role; I also enjoyed David AaronBa ker as Molly's dad, and Sarah Manninen as Molly's teacher. But truly, Tory Green did steal the show as Emily, an English girl who stays with the McIntires to keep her safe from the London bombings. Disney should scoop this child up for one of their tweener shows. Very enjoyable, with some cute moments, and some poignancy. I would think most parents will enjoy watching this with their American girls!","user":"carolchic19","rank":[7,8]}]