[{"title":"Good character study with a bit of a Rounders feel to it","rating":7,"date":"20 June 2008","review":"Nice character study of a female pool player whose life is going in smaller and smaller circles and simply wants out, but knows no way to get out.<br><br>Excellent performances from Famke Janssen who brings a real underplayed performance, and particularly Rip Torn, who I normally tolerate - as it always seems to be a variation of the MIB character - here he plays the pool hall owner and gives a very good performance indeed - nicely underplayed.<br><br>The plot of pool player trying to find meaning in her life with her estranged son is good - but the film is at its best when it's playing pool - just wish there had been more and more of that - very nice. The hustling is never glamorized and feels authentic and kind of grubby.<br><br>All in all a nice small indie movie that delivers a satisfying character study of the type normally given to guys - and for that alone it is notable.<br><br>For first time director Chris Eigeman whose previous acting credits are more in the romantic comedy line or TV shows - this ain't bad at all...","user":"intelearts","rank":[39,50]},{"title":"A movie about a pool player that uses a poker reference for a title. That kind of says it all.","rating":4,"date":"15 October 2010","review":"This movie sets up an explosive and compelling situation. It then completely wimps out by refusing to take a stand on any of the moral and ethical questions it raises and then stumbles into an ending that makes you wonder if writer/director Chris Eigeman ever knew what he was doing.<br><br>Kailey (Famke Janssen) is a haggard, working class pool hustler who's always looking for a game. The only thing that matters to her as much as pool is her son, Gully (Jaymie Dornan). He lives in New York City with his dad David (Matt Ross) and his stepmom. Most of Gully's contact with Kayley is the letters they exchange through a pool hall owner named Quinette (Rip Torn), but now she's back in town with a half-formed plan. She wants to take Gully and run to Canada, making a new life for them both. To do it, Kailey needs to get $60,000 dollars for phony passports. That's hard to do hustling pool for a $100 dollars a rack. Quinette comes up with a plan that might get Kailey the money, but it's not at all clear that Gully will really be better off with his mom, even though there's something not right at home with his dad.<br><br>Turn the River could have been a very powerful story. A woman separated from his only child. A father insecure and resentful of his own son. A man and a woman whose lives are defined by terrible mistakes they made years ago. Kailey, who lives moment to moment by the skin of her teeth, fantasizing that she can take care of a young boy. David, seething under the disapproving glare of his own mother. What it's like to be a woman in the world of pool hustlers. There's a lot here to work with. This film falters, though, because it refuses to make up its mind on the most basic elements of its story.<br><br>Is Kailey acting selfishly or does she truly have Gully's best interests at heart? The movie never says, and I don't mean it's ambiguous on the matter. I mean sometimes it clearly portrays Kylie as being motivated by what she wants, while other times she's clearly set up a noble mother trying to protect her son and there's never any effort to reconcile those differing aspects. The film very deliberately sets up David as the bad guy, then it throws in a scene where he's suddenly a good guy who cares about Gully. David's mom is on one hand put forth as the source of all of David and Kayley's troubles, yet she's also the only one of the three who seems to have her head screwed on straight. The movie never commits to saying this character is good and that one is bad, this person is right and that one's wrong. But instead of creating shades of gray, the story flounders around in mush.<br><br>Turn the River is a good example that sometimes an actress can be too beautiful for her own good. Famke Janssen plays a character who's ratty and grimy and worn down. The film does just about everything it can to make her look grubby and plain. The problem isyou could peel off most of Famke Janssen's skin and she'd still be pretty sexy. Kailey is supposed to be a woman who's lived her life on the wrong side of the tracks, but she looks like a model who got hit on the head, developed amnesia and started hanging around in pool halls.<br><br>And then there's the ending, where I don't have the faintest idea what writer/director Eigeman is trying to do. Now, I'm not the brightest bulb on the Christmas tree, so it's possible I'm just not getting it. But the conclusion to Kailey and Gully's run for the border doesn't appear to have anything to do with anything that came before it. It's as though when Eigeman got to the end of his screenplay, he just flipped a coin on whether it would have a happy or sad ending. Then the coin came up heads when it should have been tails.<br><br>Janssen and the rest of the cast do fine work and the movie looks okay, but the story is never strong or certain enough for you to notice or care.<br><br>Turn the River is a film about pool that gets its title from the world of poker. That kind of encapsulates the mixed up nature of this movie.","user":"MBunge","rank":[7,7]},{"title":"Famke Janssen excels in this absorbing indie drama gem","rating":9,"date":"16 May 2010","review":"Shrewd and scrappy pool hustler Kailey Sullivan (a splendid and mesmerizing performance by Famke Janssen) wants to rescue her loving son Gulley (winningly played by Jaymie Dornan) from her strict, demanding, and abusive ex-husband David (a fine portrayal by Matt Ross) and start a new life for the both of them in Canada. However, Kailey needs $50,000 bucks in order to accomplish this particular goal. Writer/director Chris Eigeman's debut feature scores strongly with its beautifully well-sustained brooding and melancholy tone and a flavorsome and fascinating evocation of a fiercely competitive underground sports culture. Better still, Eigeman admirably eschews sappy sentiment and lurid melodrama in his hard-boiled approach to Jailey's dire predicament. That said, the scenes between Jailey and Gulley are nonetheless still quite touching. Janssen positively shines in a juicy lead role; she brings a truly riveting and nuanced blend of toughness and vulnerability to the compellingly rough-hewn character of Jailey. Janssen receives bang-up support from the always wonderful Rip Torn as Jailey's wise and supportive mentor Teddy Quinette, Lois Smith as Gulley's snippy and meddlesome grandmother Abby, Marin Hinkle as David's sweet new wife Ellen, Terry Kinney as the antsy Markus, John Juback as formidable professional pool player Duncan, and Tony Robles as polished young upstart Ralph. Herman Micheal Otano's slick and prowling cinematography brims with style and energy. The moody'n'melodic score by Cloggs likewise hits the harmonic spot. This picture earns bonus points for not punking out with some phony happy ending that wraps things up all nice and neat in a bow; instead the conclusion is absolutely devastating in its startling bleakness. Highly recommended.","user":"Woodyanders","rank":[7,9]}]