[{"title":"Not Afraid To Be Horror","rating":8,"date":"8 July 2010","review":"I've read reviews off and on that dog this movie. I wonder sometimes if the people that dislike this movie so much, dislike the horror genre. If I were to rate a musical, I would probably give it a low score myself. <br><br>This movie is not perfect, but because the horror in it is done well enough, it is worthwhile to suspend some disbelief to go along with the ride. This isn't a PG-13 teen scare. People tote the term \"torture-porn\" I think because the killing is done is such an unapologetic, organized fashion. Every kill is planned and gruesome. In the horror genre, what actually is wrong with that? <br><br>While Rob Zombie and others are destroying monsters (Zombie basically killed the icon of Michael Myers) by humanizing them too much, it is refreshing to have a new killer killing for killing-sake. Isn't that worth a ride (assuming you are into horror)?","user":"t-g-orrell","rank":[98,143]},{"title":"Visceral fun","rating":31,"date":"31 July 2010","review":"Arkin is an ex-con turned handyman who cases the houses that he works on. When his wife needs money to pay off some dangerous loan sharks, he decides to break into the house that he's currently fixing up, that of the wealthy Chase family, ahead of schedule. The family is all set to go on a vacation, so he figures it shouldn't be too much of a problem. When he hits the house late at night, everything seems normal aside from a suspicious guard dog leashed in the front yard. Arkin shrugs it off and goes for the safe, but while attempting to crack the combination, he hears someone moving about in the house. You see, Arkin isn't the only intruder on the property. A sadistic madman has beaten him to the punch, only he isn't interested in collecting gemstones. He's interested in collecting people that he deems worthy, and those that he doesn't will meet a most unpleasant end.<br><br>Going into this film on the weekend of it's theatrical release, at the very least I had hoped for a pleasant diversion. It had certainly caught my eye, but the director's connection with the atrocious Saw franchise gave me reservations. Fortunately, not only did I have nothing to worry about, but seeing it wound up being the best time I had in a theater last year. What transpires for the majority of the film's running time is a tense game of cat and mouse between Arkin and the collector. You can tell that the latter suspects someone else is running around the house, but Arkin manages to avoid him while trying to rescue the family in the process. In fact, the collector never would have known about Arkin, as he was out of the house without ever having been spotted. That damn kid!<br><br>Marcus Dunstan and his crew really did a lot with the budget they had. The film has a unique look and sound design. The look is a large part of what drew me to the film in the first place back when the TV spots were airing. Solid use of music as well. It's fierce, it's visceral and it's nasty, but the atmosphere created here is what sets the thing apart from others. That and the collector himself, a wicked villain who goes after his victims with an intensity that I found refreshing. No slow slasher walk here. The eyes were a nice touch too, reflective like those of an animal.<br><br>The security system from Hell is an intriguing twist on your typical home invasion setup. It certainly makes for some unique situations. There's a different trap around every corner, so no running at full blast to make an escape and you had better watch where you fall. The boyfriend's fate is the film's best set piece, almost Grand Guignol in it's execution. There's also one demise that can best be described as human flypaper.<br><br>There are some suspension of disbelief flaws in there, but I enjoyed the ride too much to really mind in this case. It's a mean horror film that is strong on mood and takes itself seriously. Hard to believe it's from the guys behind various Saw movies, as I can't stand any of those.","user":"Cujo108","rank":[50,71]},{"title":"Way better than Saw and the sequel is really good too!","rating":8,"date":"29 March 2019","review":"I truly enjoyed this movie. It was really good all the way around from my point of view. I definitely felt it was better than Saw, and if it had half the marketing that Saw did, I feel it would've made a Huge \"cult\" following. If you liked Saw you probably will like this, but even if you didn't like Saw you still might like this, lol. It has a different plot line, decent acting and not too far fetched. If you watch this and happen to feel the way I do, you will like sequel \"The Collection\" too. Enjoy!!","user":"dejavuicutooo","rank":[15,19]}]