[{"title":"Good performances, but predictable plot twists.","rating":4,"date":"29 April 2008","review":"Jonathan McQuarry, is an accountant who strikes up a friendship with a lawyer called Wyatt Bose. After accidentally swapping phones, McQuarry starts getting calls from women who are part of a group of people who meet purely for casual sexual encounters. During one of these, McQuarry meets a blonde woman whom he becomes close to. When he's attacked and she disappears, he discovers more going on than he realized....<br><br>From the above plot description some people can figure out where the story is heading. I for one did. It's a sad fact that the script written by Mark Bomback holds no surprises at all. It also doesn't help that there are plot holes that aren't explained or dealt with. The direction by Marcel Langenegger is okay, but he doesn't add any tension into the movie.<br><br>What does save the movie are the three main performances. Michelle Williams is suitably enigmatic as the girl involved, Hugh Jackman as Wyatt Bose brings charm and charisma to the part, and Ewan McGregor as Jonathan McQuarry convinces as the straight, lonely accountant seduced into the events played out.<br><br>However the performances alone can't save the movie from being a disappointing, predictable thriller.","user":"kevin_crighton","rank":[81,108]},{"title":"Mostly rubbish","rating":4,"date":"28 April 2008","review":"Two things to say about this film.<br><br>Firstly, what an astoundingly rubbish title for a movie. \"Deception\"??? Oh, come on. Can you think of a more non-committal, less interesting, less imaginative title for a movie? I can't. All thrillers are about deception, of one kind or another.<br><br>\"Deception\" originally went into production under the title \"The List\". Hmm... Well... OK. I admit it. That title is also pretty bad. Then, \"Deception\" was going to be called \"The Tourist\". Now, I kind of like that. Sounds art house and kind of strange. Conjures up images of an observer, an outsider. Somebody not in the loop. In fact, pretty much the character that Ewan McGregor plays.<br><br>Secondly, what a completely rubbish movie! OK, maybe not completely rubbish. Just mostly rubbish.<br><br>\"Deception\" is a good 20 minutes too long. After a while it just seems to go on and on. The climax is misjudged and mistimed. The sex is typical Movies 24 soft core erotica, or maybe a Friday night Channel 5 movie from the early Noughties. You know the kind of thing. Soft focus humping to a soundtrack of screaming saxophone driven jazz. (Mind you don't trip over the cliché, there chief!) Also, every plot twist in \"Deception\" is signposted way in advance. If you don't get at least one of the major plot twists then, frankly, you really should give up watching movies. Pretty lame, pretty dull, pretty bad movie.<br><br>I said 'mostly rubbish', so some of it must have been good. Yes?<br><br>I did like the film's chilly, European ambiance. I liked the idea of powerful people, too isolated and too busy to develop human relationships. I liked Hugh Jackman's well dressed and cold instigator, Ewan McGregor's lonely accountant and Michelle Williams' bruised vulnerability. I thought all three leads made the most of their underwritten roles, but sadly it was not enough.<br><br>There is plenty of space in this world for a good, sexualised thriller (see the original \"Basic Instinct\"), but sadly \"Deception\" was nothing like a good sexualised thriller.","user":"seawalker","rank":[145,215]},{"title":"\"Derailed\" All Over Again","rating":5,"date":"8 May 2008","review":"I went into the theater because of the interesting star combination of Hiugh Jackman and Ewan McGregor. I did not have an idea what the story would be about. However, the simple (and unimaginative) title was a give-away of the plot. Within the first ten minutes, you already feel you have seen this movie before. I immediately thought of the Clive Owen-Jennifer Aniston movie \"Derailed.\" (The initial chance seduction occurred at a train station, as well.) <br><br>John McQuarrie (Ewan McGregor) is a lonely accountant/auditor with zero social life. He gets hooked into a sex \"list\" by the magnetic man's man Wyatt Bose (Hugh Jackman). There he meets the girl of his dreams simply known to him as \"S\" (Michelle Williams). Of course, since the title gives away the plot, you knew this set-up was all an elaborate deception, and nothing is really what it seemed.<br><br>As for the plot, there were a lot of improbabilities that weaken the story (some spoilers follow later for those interested). The suspense was a bit muted because the director was generous with the clues. Or may be we have just watched to many of these variations of this story in movies.<br><br>The sex \"list\" set-up (which was the main thing of interest that set this movie apart from others like it) was most likely inspired by real such social clubs. These lurid circles where busy people just call each other randomly for some anonymous commitment-free sex, I am sure, ordinary guys like us will never get mixed up with in real life. This movie does give us a vicarious teasing peek into this alternative lifestyle, though.<br><br>I did like the triumph of good at the end though, because there were no strings attached.<br><br>I could not help but compare this film with \"Derailed\" because they were so similar, and \"Derailed\" was clearly better in all aspects. That said, this film \"Deception\" is really not that bad as the cheap local posters (that resort to sexy photos of girls in lingerie) would suggest.<br><br>***********SPOILERS FOLLOW************** These are the questions that the movie requires you to turn a blind eye on: How could Bose possibly assume that McQuarrie would do his criminal bidding just because of \"S\"? At that time, McQuarrie had only met \"S\" twice, and they did not even have sex yet. And indeed, can an auditor actually gain access to perform multi-million dollar money transfers from the company he is auditing? Also, is it that easy to create fake passports? Especially in the case of McQuarrie.","user":"3xHCCH","rank":[13,16]}]