[{"title":"Fun movie for the young and slightly older","rating":7,"date":"21 October 2006","review":"This Tom &amp; Jerry movie details the struggle of three pirate brothers to find the 'Treasure of the Spanish 'Mane'' and the subsequent conning and struggling of a cat, a mouse, and sometimes a dog.<br><br>Those of you who are used to and love the Old School Tom &amp; Jerry skits might be taken off guard by the animation which, although excellent and seamless in quality, is undoubtedly modern to the point where it is clear that some scenes use advanced 2D rendition programs. One might say that the movie looks far too smooth and some of the skits are too predictable and are found to lack humor while they are most likely trying to signify a revisitation to the old 60's series, but this is offset by quite a few comical moments; the continuous skit of Tom and Jerry trying to con each-other out of a treasure map in a resoundingly PC and courteous way while dodging monkeys, a dog, marine life forms, the pirates and the terrain itself allows for quite a few laughs, while the pirate brothers, their parrots and the skull of the treasure provide non-slapstick, verbal comedy throughout the movie, which I presume will appeal to the somewhat older. One thing is sure; though a bit modernized at times, the music is clearly reminiscent of it's original '60 predecessor; it still has the old WB stuff and doesn't mind showing it.<br><br>T&amp;J Shiver Me Whiskers incorporates elements which I suspect are meant to offset the modern vibe of the movie somewhat; static objects have a generally acrylic and solid feel, adding to the atmosphere of the picture, whereas many backgrounds and statics also bolster a purposefully slightly granular consistency. Also fun was the nods this flick made to recent movies; it clearly inherits a little from 'Pirates of the Caribbean', proved by the fact that one or two melodies seem to be alterations of Klaus Badelt's compositions. But most importantly, I feel as though this movie has retained - or regained - some of the heart of the old Tom &amp; Jerry many know and love. This movie has helped me see that some of the old and gold does have the ability to evolve without losing the essence of what makes it fun.<br><br>For being a clever and fun adaptation of a great series, for trying to ignore the newer - inferior - series, and for holding my attention for the full 75 minutes of its running time, 3.5 of 5, ***","user":"AlecWingerd","rank":[14,14]},{"title":"Colourful and mildly enjoyable film, if rather formulaic in plot","rating":7,"date":"27 August 2009","review":"Tom and Jerry in Shiver Me Whiskers was an enjoyable film, that kids will definitely love, and adults will be mildly entertained by. The animation is very colourful, and the voice cast, including Mark Hamill, Wallace Shawn and Kevin Michael Richardson were top notch. Where the film is lacking though is the rather formulaic plot, and the dialogue is nothing special. It probably doesn't help the film is a tad too short though. Of course it is reared more at kids, but adults will enjoy the voice cast, and they won't be disappointed in any of the characters, because Tom and Jerry are still great characters, and the music is very nice indeed. I do admit I love anything to do with pirates, after loving films like Pirates of the Caribbean:Curse of the Black Pearl and Muppet Treasure Island. Overall, Shiver me Whiskers, is colourful, easy to like, and very enjoyable. 7/10 Bethany Cox","user":"TheLittleSongbird","rank":[5,5]}]