[{"title":"WOW......SAD BUT WOW","rating":8,"date":"23 February 2020","review":"Heartbreaking yet captivating, Changeling's story was fascinating all the way through, even if the first half was a little slow. It certainly was a compelling story, shot beautifully, and written well. Angelina Jolie gave a mesmerizing performance as grief stricken Christine Collins, as well as the many young actors in the film. It's certainly worth the time.","user":"MR_Heraclius","rank":[39,40]},{"title":"Interesting period piece","rating":9,"date":"2 November 2008","review":"Watching this film is like taking a look back in time. Everything is picture perfect, the beautiful automobiles, the red electric street cars, the telephones, the switchboard station with roller-skating supervisors, the house appliances, and the outstanding clothing, from dresses to hats to police uniforms, everything is meticulously detailed. The story, which we are told is true, is complex and multifaceted. Angelina Jolie, who plays Christine Collins, gives an outstanding performance as a single mother who returns home from work to find that her son is missing. This puts into motion a series of events that exposes the reality of what Los Angeles society was really like in the late 1920's. Corrupt Police, uncaring and self absorbed mental health professionals and the basic premise that people left to their own ambitions will do anything to secure their own prosperity. Although this paints a bleak picture of the human condition, the film show that the actions of a few good men can make a world of difference, John Malkovich as Reverend Gustav Briegleb, is determined to expose the corrupt Police in his radio talk show, Michael Kelly as detective Lester Ybarra, although hampered by his superiors, uncovers what really happened to the boy and the unlikely hero, a powerful attorney who takes her case pro-bono comes to her rescue. If indeed this is a true story, then to see these people stand up to the powers that be is a ray of hope to all of us that there were people who were strong and principled. We can only hope that there are still people like that out there today.","user":"tomrito","rank":[191,234]},{"title":"Eastwood and Angeline deliver a strong punch","rating":10,"date":"2 November 2008","review":"There is nothing more reliable than Eastwood behind the camera, with his assured touch his films are never boring or deliberately confusing, hiding technical devices or special effects that detract from the most important part of movie making: a good screenplay, a good story, good acting. For the past 10 years, many films have been unduly praised because they have one or two great performances, unfairly leaving many good and deserving movies without the recognition they deserved. Eastwood has however, given us the whole package time after time, with movies as varied as \"Mystic River\", \"Letters\", \"Million Dollar Baby\" and now \"Changeling\". True, there is a link, they are all strong films, with themes that deal with pain and loss, but the stories are different, the settings require an amazing attention to detail, what they all share is a strong focus, and interestingly enough, superb performances.<br><br>Eastwood has paved the way to acting honors for Penn, Freeman, Swank, Hackman, and others that were continuously ignored by the Academy. There is no denying the power of their performances in Eastwood's movies, and that leads to the center of this film: Jolie. I read recently that her performance has been attacked as being affected and the attempt of a star to look normal. Putting aside those silly and biased remarks, let's state something clearly, the lady has given us a fantastic tour de force, proving that she can be both a star when looking at the other cameras, but that when she is working for a director, she gives her best, regardless of what our perception of her private life might be. If you are a critic with a personal disapproval of that persona, keep it to yourself, concentrate on the film and the work of the performer.<br><br>As the mother who desperately wants the truth about her child, Angelina is flawless. We can read the pain in her eyes, the determination and the disturbing reality that her obsession might be having unexpected results, but one thing is clear, there is a drive that won't quit, and it's admirable for those of us who want her to be reunited with her child, and it's quite inconvenient for the people who have other interests at hand.<br><br>Her battle with the folks at LAPD is of epic proportions, and it is amazing that she held on to her goal of exposing the corruption that she encountered as she searched for her missing boy. There are some horrific moments in the film, as we relieve some of the injustices and Gothic horror of places like the hospital in this film. There are also some background scene that might or not reveal what really happen. There are moments when one is a bit exhausted from all the information the film delivers, but every moment is worth it. It is all framed with an expert hand, and it is anchored by the very powerful work by Jolie and the rest of an amazing cast that brings to life emotions such as madness, anger, pain, sorrow, and many times, disbelief that humans can be capable of such terrible actions.<br><br>The film contains amazing production values, as we are taken back to an era that doesn't exist anymore. The recreation of the time Los Angeles was on its way to being a real city is incredible, as we see it before it fell apart and spread all over a gigantic geographical area, losing its identity. The musical score is a sweet melody that hints at the love and pain themes in the film, and there are some moments bound to become classic, as children tell the stories that adults might not want to face or believe.<br><br>All in all, \"Changeling\" may be very difficult to sit through, but it is not less impressive, effective or good than any of the last five films Eastwood has made. As a matter of fact, it's just one masterpiece from the man who could teach Hollywood a few lessons.","user":"aharmas","rank":[307,392]}]