[{"title":"Epic:Be enchanted!","rating":17,"date":"17 May 2013","review":"Animation movies are all about the feel.Epic is a movie where the feel while watching the movie is brilliant.The level of detail that has gone into each frame in creating this world is mind boggling.The result is an aesthetically pleasing experience that deserves applause.The characters are all likable and well imagined.The snails are funny.I especially loved Mary Katherine,endearing and innocent.The 3-D is decent and the background score good.The overall experience is enjoyable.<br><br>Kids will love this one!If you are an adult,just let out the child in you and have fun :).","user":"vishalsmail33","rank":[109,141]},{"title":"Hardly epic, but good","rating":8,"date":"29 May 2013","review":"My Rating: ***1/2 (out of ****)<br><br>The way things a currently looking, this might very well not be a Pixar year. A much as I might enjoy Monsters University and possibly Planes, they may very well not be my favorite animated films of the year, and they probably won't be. The Croods is already my favorite animated film of the year, and this movie, Epic, in my opinion, is also pretty good.<br><br>The main protagonist of the film is Mary Katherine, or M. K., a likable (and cute) teenage girl who, after her mother's death, goes to live with her eccentric and reclusive father. Her father believes that there is a miniature world of magical little people and creatures that live in the forest, and of course other people, including M. K., don't believe him. However, she soon magically shrunken and discovers this little world, which she must save.<br><br>And so on. I admit, the movie is not very epic; it is a bit generic and has just about every cliché possible: good vs. evil, balance of nature, dysfunctional parent/child relationship, etc etc. The film resembles a number of other films, such as FernGully, Avatar, and Honey I Shrunk the Kids, among others. One of the main characters, the Nod, even resembles Flynn Rider from Tangled pretty strongly (but this wasn't a problem for me). However, I disagree with everyone who is calling it charmless, forgettable, too reliant on visuals, and weak in terms of character, plot, heart, etc. That's right, I actually enjoyed it.<br><br>I actually thought the movie was handled fairly well and has a decent, solid, enjoyable, well- paced plot. The film started out a bit slow, but I started to get more interested as trouble started brewing in the miniature forest world and then M. K. gets shrunken; from then on the movie was much better, and I got interested and emotionally involved in the story. The film also has likable characters and relationships, and good voice performances by Amanda Seyfried, Josh Hutcherson, Colin Farrell, Beyonce Knowles, and the rest of the cast. It even had some good humorous parts, including a pair of mollusks and a three-legged dog.<br><br>The best part of the film is the animation; dazzling, lively, meticulously detailed, and it helps bring everything to life. Like Avatar, this movie has what I found to be an interesting, immersing, well-designed setting. Also, like Avatar, it has a good, strong ecological message, which I appreciate. It also has heart, charm, and genuine emotion, and additional good moral messages such as friendship, love, bravery, and selflessness.<br><br>Bottom line: If you ask me, Epic is hardly epic, but it's good. And it was especially enjoyable for me on the big screen. Kids will certainly love it; and if you are an adult, like me, just let out your inner child and enjoy the film.<br><br>For more reviews, visit my review blog: http://robertsreliablereviews.blogspot.com/","user":"Kane20","rank":[43,59]},{"title":"No surprises not detrimental to satisfaction","rating":7,"date":"5 June 2013","review":"The pretty standard stuff of elfish lore, where magical faerie folk protect the woods and the life enclosed inside. Led by the Queen Tara ( voiced in English-language version by Beyoncé Knowles) the minuscule forest inhabitants guard the essence of creation from the destructive appetite of the agents of blight - creatures called Boggans - and their malevolent leader, Mandrake (Christoph Waltz). These forces of good are led by the seasoned warrior Ronin (Colin Farrell), who together with his elven battalion mount hummingbird steeds. His special protégé is independent-minded brash Nod (Josh Hutcherson), who disregards structure and rules. However, each faerie Leafman must become a part of a bigger tree, in order for the forest to survive. Especially now, when a rare astronomical occurrence brings about the necessity to name a new queen, chosen through the use of a magical bud. This ceremony is disrupted by the onslaught of Mandrake's forces. Meanwhile a somewhat crazed and estranged Professor Bomba (Jason Sudeikis) seeks proof of little green forest men residing in the woods, much to the distraught of his only daughter Mary Katherine (or as she prefers to be known M.K.) (Amanda Seyfried), who moves in grieving after the death of her mother.<br><br>What can I say say? I love me some faeries and the magical allure of nature. Here \"Epic\" delivers with aplomb the visual feasts of an enchanted forest coupled with ages-old tales of combat between good and evil - or as portrayed here as a conflict between life and decay. The obvious flaw to be pointed out is the generic and predictable storyline, which delivers essentially what was to be expected, failing to really instill any sense of novelty. With some well-placed humour, thankfully low on the adult kind and more focused on family laughs, \"Epic\" does however deliver on its base promise: offering entertainment for both adults and children. Visually appeasing with some engaging story lines, apt for parents or simply for adults looking for a good time, are sure to be satisfied by the magical light-hearted tones, just perfect for disassociating yourselves from the mundanity of everyday life.<br><br>Some fault can also be found in a somewhat underwhelming formation of characters, mostly feeling like poorly fleshed out cardboard cutouts with only the touching relationship between father and daughter really hitting home. Some of the secondary characters are just poorly conceived comedic relief (like the slug and the snail), while the overall story seems somewhat overloaded given the running time. Especially the character of Nod seems to be a missed concept, as he fails to have enough structure to really develop any relationship with either Ronin or M.K., thus adding a certain sense of superfluousity to his role in the movie. Nonetheless, the underlying weaknesses fail to prove detrimental from family viewing, making it a rewatchable feast for the eyes and imagination, without ever truly hitting classic animation territory.","user":"p-stepien","rank":[31,42]}]