[{"title":"Perfect casting is what makes this movie wonderful","rating":8,"date":"1 July 2008","review":"I was completely astonished the first time I saw the movie, Definitely, Maybe. It truly was, as my summary suggests, absolutely wonderful, and that has mostly to do with the performances by the casts' dedication, though the plot and execution of the entire film was remarkable, as well, and the whole atmosphere and the way the movie folds out is incredible.<br><br>It was so touching and completely entertaining from beginning to end, while being humorous and overall fun at the same time. The acting was great, as I have said, and the script was great, because of everyone who worked on the films' professionalism and believability. They did a perfect job on this movie, and I thought they couldn't have done better with what they had to work with. <br><br>There was some material I found a bit iffy, and at one point I felt as if I was losing interest, just a little, but this movie is so uplifting that I couldn't manage to look away, and it kept being miraculously beautiful and enchanting that I couldn't help but be so interested. It deserves any positivity it receives, and I hope that many more people will watch it, because it is an excellent movie, that needs to be spread around for it's wonderfulness. Go see it if you haven't!","user":"Dragoneyed363","rank":[59,68]},{"title":"Great storytelling makes otherwise ordinary rom-com something special.","rating":9,"date":"21 March 2008","review":"When his ten-year-old daughter starts asking awkward questions about his impending divorce - and his life before she was born - a thirtysomething Manhattan dad sits her down and tells her the story of his three great loves. He changes the names to keep the surprise of who he eventually married, and he spins a charming story - spanning fifteen years - of loves lost and found and lost again.<br><br>And found again.<br><br>Ryan Reynolds (one of my all-time favourite performers) has seldom been better, Abigail Breslin (who appears frequently to comment on the story being told) is as genuinely charming as ever, and all three girlfriends are wonderfully cast. The story moves along at brisk pace and it's easy to see why the hero would fall in love with each in turn (at various stages in his life). What's not as easy to see is which one he will eventually marry. And, as well as successfully concealing the identity of the mother, the film makes you wonder many times how it will all end. Yes, it's a romantic comedy, so you're conditioned to expect a happy ending, but this isn't your typical romantic comedy so you're expecting a non-typical ending.<br><br>And you're right.<br><br>The ending is just as clever as the rest of the movie and it makes for a great story overall. It's a very modern story. I think it would have been called \"a sophisticated sex comedy\" in bygone days. Which just means the characters are a bit more mature and closer to real life than you normally find in this genre.<br><br>What could have been an enjoyable B-grade rom-com is lifted up by unconventional storytelling and a little extra effort spent to get the ending just right. Grade \"A\" from me.<br><br>http://yetanotherfilmreviewblog.blogspot.com/","user":"RikerDonegal","rank":[44,51]},{"title":"Definitely a must see movie","rating":9,"date":"9 April 2008","review":"I just saw this movie today and I loved it. I was the only teenage guy in the theatre also. The movie had a great message to it about always being happy. The little girl in this movie was also great she brought a lot to this movie, with out her this would not have been a good movie. The acting was good and the direction was especially good as well. I saw this with my dad today and it brought tears to his eyes. So this movie was also a tear jerker. For someone that loves romantic comedy movies I think would love this movie. It was a little slow moving but I kind of expected it to be. After it got near the end of the movie though it really got you thinking and wishing for him to end up with the girl he was meant to be with. It kind of also took little twists which were good as well. Ryan Reynolds did a terrific job in this movie playing a father who is going through a divorce. Then his daughter tries to help him find his true love. This movie was everything I hoped for so I think that you should definitely take someone to see this movie and have a great time.","user":"robertallenandersonjr","rank":[149,192]}]