[{"title":"Not really bad, just not good","rating":4,"date":"10 November 2007","review":"This film left me confused. The story's not bad in itself, reminded me a bit of Re-Animator, but that's not a bad thing at all. Also, the acting was better than I expected for most parts. Some of the characters behave really really odd though, especially the detective guy. That is THE most irrational cop (or character overall) I've ever seen in a film, and this time it's a bad thing. Most of the dialogs are pretty annoying, too: Most of the time you only see the face of one character filling the screen saying his line, then the next character filling the screen saying his line. It's surprising how rarely you actually see the two or more characters taking part in the dialog in one shot. That made the dialogs really stale and sometimes painful to watch. The overall editing wasn't too bad, with some exceptions where a cut left me totally clueless what's going on. I also got the feeling that some important things were left out. This movie's budget must have been incredibly small. The special FX that are used in the ending of the movie would have been a shame in the early 80s, now they're not even funny anymore. The rest of the effects (make-up effects) aren't bad. So the only scene where the effects are really awful is at the very end of the movie. One thing that was bad throughout the movie was the music: I mean, yeah, eerie is one quality music in a horror movie should have... sometimes. But the music should fit the movie, not just be eerie all the time, even when the \"eerie\" moment is long gone. The only exception here to eerie music is no music. Most sound effects sound out of place, too.<br><br>This comment probably sounds worse than the movie actually is. It's not that bad and if you've got nothing better to do and nothing else to watch you might watch this, but if you're not used to low budget films you might have a tough time watching it to the end.","user":"matches81","rank":[25,32]},{"title":"bad actors and writers make really bad movie","rating":29,"date":"29 January 2009","review":"I have one word to describe this film, \"unwatchable\". Within minutes it was obvious that I was in for some really bad acting which almost made the film out to be a comedy. And can anybody get away from that white van? I mean come on. Run through a yard or something. And I guess there is only one cop in the entire town. How about creepy doctor's decomposing sidekick. The guy can't even run and nobody seems to be able to out maneuver him. This move was inspirational in a way because now I feel like if movies like that are being released I could do just as bad if not better with a Polaroid camera and a sketch book. Do not under any circumstances watch this movie. Any good reviews are from paid employees or mental patients.","user":"byronhere","rank":[8,9]},{"title":"\"Sam. I like you.\"","rating":1,"date":"15 June 2009","review":"I rented this out of boredom on a Sunday night, and I regret it. I love bad movies. I feel an affection for them akin to what one feels for a special education kid. They try, and fail a lot, but you appreciate the merits of the attempt and recognize it for what it is.<br><br>That being said, there is really one way to surmise this film is awful. I have survived viewing of BloodRayne and the un-MST3K'ed Manos: The Hands of Fate. I and my wife were riffing this ten minutes into the film.<br><br>The only redeeming feature in this is the story, which was unique compared the usual fare (Hollywood could take a lesson here in looking for source material). However, everything else just fell flat...face first on to the concrete.<br><br>The acting was bad, even for a B- film. The dialog was painful, the acting uninspired. I've seen more convincing effects in homemade animated films, and the editing looks like it was done by a six year old kid riddled with ADD.<br><br>Honestly, only the most hardcore of Lovecraft fans will appreciate this. I respect his work, but I think he was rolling over in his grave when they wrapped on this pickle.","user":"stormofwar","rank":[9,11]}]