[{"title":"An awful and downright stupid excuse for a comedy","rating":3,"date":"20 September 2012","review":"The Babymakers tries to take elements from a hundred other gross out raunchy comedies and re-hash it again and try to make it funny. Instead, it serves to remind us just how unfunny just being crude and showing nudity can be. There are a group of middle aged men behaving worse than seven year old kids and if you had a group of talented comedians behind that premise it might work, you might laugh despite yourself but no one in this film are talented comedians or actors. Their performances are downright rotten, wooden expressions and just plain awful comedic timing. Stupid pretty much describes everything about this movie. I'm giving it a slightly than zero score simply because I did laugh once or twice and the insane antics and the last scene in the film was actually almost cute but watching the rest of this movie was downright excruciating. How does someone get this crap made? <br><br>Paul Schneider should be ashamed of this film. He has an extensive background in film and this is simply way beneath him and dragged him. He wasn't the worst member of the cast playing the husband trying to give his wife a baby, but he was dragged down significantly. Olivia Munn who I thought was supposed to be a \"rising star\" as of late looks like a plastic barbie caught in headlights throughout the whole movie. She delivers her lines like a deadpan fish and shows about as much charisma as a wet towel. Kevin Heffernan is Schneider's best friend in the film and despite some mildly funny physical comedy is mostly wasted with stupid lines and even more stupid antics. Director Jay Chandrasekhar plays Ron Jon, the Indian Mafia man they turn to for help. He could have actually been a funny character but he goes for raunchy and stupid the whole time so he is as wasted as everyone else. He should be ashamed for directing this disaster.<br><br>Chandrasekhar has a lot of experience as director and writer of all kinds of comedies and TV shows. Its amazing to me that you could direct and co-star in something like this that is so incredibly amateur and think that it was a good idea. This is worse than drivel. It barely passes for entertainment and it certainly isn't funny. Its like watching a group of kids put on a really awful grade school play that happens to be full of nudity, and a constant barrage of stupid masturbation jokes and antics, and a poor attempt at a decent comedy. 3/10","user":"Robert_duder","rank":[11,13]},{"title":"Some very funny moments","rating":5,"date":"25 December 2013","review":"But also some not so funny moments. While it does have some genuine things in the script, it also goes completely crazy in other places. It's almost a shame, but let's focus on the good things. The chemistry between the wife and the husband is good, which is something that is needed, especially later on in the movie.<br><br>There are quite a few clichés thrown into the mix and the ending is just crazy (not in a good way). On the other hand, we have a few scenes, that are not as funny as the filmmaker thought they would be. Still a nice little comedy that might work as movie for couples (even if they have the same \"problem\").","user":"kosmasp","rank":[4,4]},{"title":"Come in laughing, come out wincing","rating":3,"date":"3 August 2012","review":"One must approach a Broken Lizard film with the idea that the actors obviously have a lot of fun making these fun, energetic romps. Sometimes more than audiences like watching them. Broken Lizard hit a home run with me when I saw Club Dread, an inspired parody of slasher films with entertaining characters, and I found Super Troopers to be \"fun, lively, and good-natured.\" These characteristics are totally absent in their latest flick, The Babymakers a dirty-minded, prepubescent comedy with repetitive jokes about semen, sperm banks, genitalia, masturbation, sex, you get the idea.<br><br>The Apatow-idea of \"mixing heart with raunch\" doesn't work here, because any attempt at humanity and sentiment is disregarded so things like sex puns and lame gags can take their turn on film. The leads are the laidback Paul Schneider and G4's gorgeous Olivia Munn, who are sadly not given much to do because the screenplay is so close-minded to nonsense. The two play Tommy and Audrey, a suburban couple who, after three years of marriage, are eager to start a family. After nine months of failed attempts, the two begin to question if one of them has a problem, whether it be Tommy with his sperm count or Audrey with her ovaries. Wow, took you nine months to realize that constant sex and no baby wasn't a good sign? I'd get nervous after attempt three.<br><br>They both get tested, and it is revealed that Tommy has a very low sperm count. One thing Audrey doesn't realize is that, in order to pay for an engagement ring, Tommy frequented a sperm bank twenty times for roughly eighty-five dollars in cold, hard cash each visit to pay for it. When she finds out, she's strangely disgusted and Tommy devises a plan with his pals (Kevin Heffernan and Nat Faxon) to try and stage a break in to the sperm bank warehouse to get the samples back. And she's completely cool with that. As an exercise, ask your spouse whether they'd be more aggravated at you for donating to a sperm bank or robbing one.<br><br>But first, Tommy learns that one of his samples is out on the market, and it has been purchased by a local gay couple. When Tommy goes to visit them it sets up a cruel and wholly unnecessary ten minutes involving some of the most awkwardly exchanged dialog this year. It's scenes like this that simply don't belong in a comedy, but The Babymakers is chock-full of scenes like that.<br><br>In order to try and pull off the heist in a coherent manner, they hire the walking stereotype, Ron-Jon (Jay Chandrasekhar, who also directs), who was rumored to be a part of the Indian mob. You can imagine how many jokes just this past sentence can set up and, let's just say, the film doesn't miss its chance to try and say all of them.<br><br>The real tragedy behind this picture is that in the mix of creating juvenile setups, crass gags, and scenes that stretch far beyond their reason lengths (take for example Kevin Heffernan's character, who during the sperm bank heist spills dozens of test tubes containing semen and spends minutes slipping and sliding around on the floor), the script successfully undermines both Munn and Schneider's chance at erecting believable, substantial chemistry, as well as both their acting talents. Schneider worked in successful independent flicks, and Munn has consistently proved herself to speak to the geek culture, much like other filmmakers such as Joss Whedon and Kevin Smith. They deserve better than this trite.<br><br>Jay Chandrasekhar is a reliable actor, but this is second time he has chosen to direct a film, involving the Broken Lizard team in lackluster material, with the first being The Dukes of Hazzard film adaptation. What this film needed in order to work was, one, a reality check. These events are highly implausible, yet are taken in the manner of sincerity and reality. Two, it needed a script more observant and intelligent. It could still be a raunchy comedy and fulfill this proposition, so my question is, why didn't it? And three, it needed to give both its leads some much deserved screen time instead of subjecting them to ridiculously contrived arguments about donating sperm to a sperm bank multiple times, uncomfortable discussions with the neighbors about possible donations, not to mention other sequences involving homosexual humor and a montage of blows to the scrotal region. I came to laugh, but I did far more wincing - one thing that is almost immediately fatal to comedies.<br><br>Starring: Paul Schneider, Olivia Munn, Jay Chandrasekhar, Kevin Heffernan, and Nat Faxon. Directed by: Jay Chandrasekhar.","user":"StevePulaski","rank":[31,50]}]