[{"title":"Will NOT Disappoint Fans Of The Series!","rating":8,"date":"24 July 2006","review":"The Skibz has always been a major fan of 'Teen Titans' (mainly the series; I've never even read the old 60's DC series, but maybe because I'm just a young punk); he's seen all the episodes, read all the 'Teen Titans Go!' comics, collects a couple of little figures (purely for decorative purposes to impress the nonexistent ladies that visit his \"pad\")...even to the point of writing fanfic. The point *is* is that he's a fan.<br><br>After five awesome seasons, 'Teen Titans' has been cancelled, and since it never really received a proper series finale, what better time than to make full-length movie, even if said movie does take place between seasons four and five? Needless to say, the Skibz had his doubts. But, despite what he believed, he lined up 90 minutes early on July 22nd in order to see the world premiere of 'Teen Titans: Trouble In Tokyo', with about 2,500 other rabid fans. After a brief introduction by Glen Murakami, David Slack, and the obviously stoned Greg Cipes, the film began.<br><br>Standing...ovation.<br><br>Yes, 'Teen Titans: Trouble In Tokyo' meets every expectation that one would have towards an awesome 'Teen Titans' movie. The Skibz shall now review it.<br><br>The plot...the plot is thus: A mysterious, seemingly indestructible superninja called PsychoTech attacks the Titans's city, bombing the hell out of everything, including Titans Tower. Having captured him, the gang learns that it is, in fact, a *Japanese* ninja (who'd-a thunkit?), who confesses that he was sent by a figure known as 'Brushogun', right before he vanishes into thin air. The Titans decide to take matters into their own hands and take a trip to Tokyo and find this 'Brushogun', much to the dismay of Beast Boy and Cyborg, who wish the trip to be nothing more than a much-needed vacation. Upon arriving, they are met by a shady detective (I don't remember his name) and his army of supercops, who informs the team that 'Brushogun' is nothing more than an urban legend, and that they are better off just going back home. But the Titans are not to be brushed off that easily, so they go their separate ways to find out more about the mysterious villain known as 'Brushogun'; a quest that just might cost them their lives. But who cares about that? The *real* plot of this movie is the relationship between Robin and Starfire, and what exactly is to become of said relationship. I'm not going to give a definitive answer, because The Skibz ain't no stoolie, but I will definitely state that the immortal question 'Will Robin and Starfire ever get together' is finally answered.<br><br>Anyhoo, this film is more than just a longer version of an episode. The plot is much more complex and thematic than you would find on television. The art is beautiful; the Tokyo backdrops are particularly pretty. Um...what else? Well, it's just simply pure 'Teen Titans'; a perfect ending to an amazing show. The movie is not without it's flaws, however. The first half-hour is particularly heavy with the comedy and the wacky animation, it puts off the actual plot for too long (however, it also happens to have some of the funniest moments the show's ever had; for instance, Starfire striking a 'Sailor Moon' pose, Beast Boy singing a badly translated karaoke version of the theme song, and \"Super Twinkle Donkey Gum\"). Another flaw, although I don't think anyone would mind, is that parts of it are really predictable; you know who the bad guy is from the first couple minutes, but it didn't really distract me or take me out of the movie. A strong point of 'Teen Titans' has always been the characters and their development. In 'Trouble In Tokyo', Robin and Starfire are really the only touched upon and the only ones to show any emotion. Cyborg and Beast Boy are really only there for comic relief, and Raven probably has the least amount of screen time, but I'm trying not to complain...it was a very entertaining movie. And I have two personal problems: one, doesn't anybody find it really creepy that Beast Boy tries to have relationships with *human* women? I just think...ew. And two, what else am I going to watch now that 'T.T.' is off the air? The new season of 'The Batman' looks promising...<br><br>I have to keep this review short, so I'll sum it all up in a quote a guy who sat behind me said: \"Dude, this is f***ing brilliant\". This is a magnificent addition to the 'Teen Titans' franchise, and will definitely not disappoint fans of the series.","user":"Skibz777","rank":[35,37]},{"title":"Awesome way to end the series!","rating":9,"date":"17 September 2006","review":"Although I missed the first five minutes or so of \"Trouble in Tokyo\" because I was out getting myself some dinner, I greatly loved it! Right from the beginning, when you see each of the Titans packing (It was especially funny to see the ways that Cyborg and Starfire packed), the movie kept me entertained all the way to the ending. I'll now list what I liked and disliked about it, starting with what I disliked (That way, I'll save the good stuff for last):<br><br>1. They could have done a good deal more with Raven. 2. The sudden twist at the film's climax (Don't worry, I'm not giving anything away) was, I thought, rather predictable. I could see it coming.<br><br>Now, the stuff that I did like: <br><br>1. Very, very funny! I especially liked Cyborg pigging out at that restaurant (Let's just say he looked like he'd make a good contestant on \"Fear Factor\"), Starfire at the arcade playing a game which looked like a bizarre combination of \"Dance Dance Revolution,\" \"Guitar Hero,\" and Whack- A- Mole, and of course, Beast Boy singing karaoke. I was kept laughing all throughout the film, which I'm sure was their intention. 2. Many of the fight scenes were very well- done, particularly the final one, which was really intense, and might even be too spooky for younger viewers. 3. Great character development for Robin and Starfire. 4. Very good voice acting, as usual. I'd have to salute Hynden Walch for her job as the voice of Starfire, as in this movie, she's able to display a vast range of emotions and does so in a very believable manner.<br><br>All in all, \"Teen Titans: Trouble in Tokyo\" was a great film, a great addition (And conclusion) to the series, and a definite must- have for my DVD collection, whenever it comes out.","user":"Primate84","rank":[22,23]},{"title":"Couldn't pick a better ending to the series!","rating":10,"date":"1 October 2006","review":"The Titans are back, and this time they're headed to Tokyo on the trail of a villain called Brushogun. *Beast Boy- VACATION WHOOO! Robin- WE'RE NOT ON VACATION! Heroes don't take vacations, you nOOb!* But after discovering that Brushogun turns out to be a myth it turns into a vacation anyway. Beast Boy runs off after a cute Japanese school girl, Cyborg goes to the All-You-Can-Eat buffet, Raven wanders off to find something to read, and Robin and Starfire go off and do stuff. Alls well until they're attacked by Brushogun's henchmen (each resembling a character from another show, like Kaonashi from Spirited Away and AstroBoy) and Robin ends up in jail! *gasp* Well that's what he gets for going overboard. Anyway, so now he's a fugitive and he has to steal this guy's clothes for a disguise (and might I add he looks VERY hot in this new getup :D) and off he goes to seek out information about Brushogun. After a very exciting motorcycle chase, a close shave with the Tokyo Troopers, and a romantic moment with Starfire, Robin meets up with his friends to track down Brushogun and take him out!<br><br>I was overjoyed that this movie finally answered the number one question that I wanted it to: \"Will Starfire and Robin ever get together?\" The answer: WATCH THE MOVIE AND SEE! :) Apart from that, the music score was awesome and I loved the beginning credits when they're packing and when they're flying to Tokyo (Aqualad appears briefly! ^-^) Some fans may not appreciate it because of some of the weaker aspects, but if you overlook those you've got a great movie. I laughed through most of it, especially at the parts where the characters turn chibi :) Packed with action, adventure, humor, and romance all set in the beautiful and colorful city of Tokyo, Japan, this movie is almost certain to please any die-hard Teen Titans fan. 10/10 TEEN TITANS, GO!","user":"musichead-2","rank":[16,19]}]