[{"title":"By Crom this was a bad remake.","rating":6,"date":"23 February 2020","review":"A lazy script and under developed villains really hurt this Arnold remake. The only thing this movie did right was casting Jason Momoa as Conan, not only does he fit the part, he plays it to the best of his abilities. Failed attempt but see it for Momoa's performance.","user":"MR_Heraclius","rank":[36,37]},{"title":"The Terrible Wrath of Darkest Gods","rating":2,"date":"18 August 2011","review":"Director Marcus Nispel is undoubtedly the long-lost offspring of trash master and fellow German, Uwe Boll, as this film is so profoundly awful on every level that it's hard to think that it wasn't intentionally made this way.<br><br>Remarkably, the movie gets bad immediately and stays that way. One of its most jarring aspects is that it begins with Morgan Freeman's narration, which sounds so utterly out of place, with his comforting, slightly Southern drawl the total opposite of everything bloody and Cimmerian, that it instantly comes across like self-parody, as if we were seeing some schticky Mel Brooks interpretation after the fact. This ham-handed disregard for appropriate tone haunts every frame of the film.<br><br>The story fails to find the real Conan -- who in Robert E. Howard's stories is a smart, tough, brutal survivor -- and instead seems to reveal to us the underwhelming idea that Conan's just another hunky sword dude with a knack for slaughter.<br><br>The script inconsistently sticks to any epic poetic flair in the dialog, so that when such words are delivered, they feel forced and flat. The noted line \"I live, I love, I slay, and I am content,\" is meted out with such lack of panache or feeling that I wanted to wash out Jason Momoa's mouth with soap, right after forcing him to watch Schwarzenegger -- not a great actor, by any means -- deliver the unforgettable tagline: \"To crush your enemies, drive them before you, and to hear the lamentation of their women.\" But then again, John Milius bothered to direct his actors.<br><br>Stephen Lang (Colonel Quaritch of \"Avatar\") is the half-assed villain Khalar Zym, who inspires zero awe and no respect on his whatever quest for some supernatural thingy, which is such an afterthought that you constantly forget about it. And post plastic-surgery Rose McGowan as his witchy daughter Marique is so outrageously goth that you half-wish for a Sisters of Mercy musical cue every time she steps on camera; if only her performance received the same attention as her over-the-top costumes. Ron Perlman, as Conan's father, is simply wasted. Weep!<br><br>I'm totally sick of the short-attention-span style of storytelling. The filmmakers are so afraid that if some big action sequence doesn't occur every ten minutes, that we'll be bored; and of course, this quickly has the opposite effect, as we instead become bored from so much pointless, poorly shot and edited action unsupported by character or story. Video games often have more character development than this film, and yes, I'm specifically thinking of the comparatively Shakespearean struggles portrayed in Donkey Kong.<br><br>I bestowed two stars on this flick, as the second is for unintentional hilarity, of which the film has much. Its hyperbolic Hyborian cartoonishness makes you either wince or chuckle derisively. Hopefully, as many heads as roll on screen will also roll in Hollywood for this abortive, dreadful garbage.<br><br>Perhaps the noble Conan will someday get his proper due in a modern film. But not today.","user":"wordmonkey","rank":[486,644]},{"title":"Flashes of good with a majority of bad.","rating":1,"date":"18 August 2011","review":"First, I would like to say I love Howard's stories. I also like the 82 film. So that this deviates from Howard a little (or a lot) isn't really a bother to me.<br><br>Now, before I get to the review I want to say to anyone out there studying film (like myself) to watch this movie. It will prove to you that no matter how much action, blood or one liners you squeeze into a movie, if the story and characterization are missing you don't have a movie.<br><br>Without ANY disrespect, I would urge Mr. Nispel to do a film course, as he clearly needs to learn story telling at its most basic. This is not an insult, this is advice, because I believe once he has a better grasp on it, he will make a fine film maker.<br><br>Conan the Barbarian is a summer movie. Sadly this also has become synonymous with stupid, bad movies. And this film doesn't escape that. Clearly this film had a lot of trouble, by the looks of it at the conceptual stage. The fact the Sean Hood had to rewrite on set proves the material they had to work with was a disaster, and it shows.<br><br>Donelley and Oppenheimer (forgive my spelling) did a poor job on the script, if, what was shown in the final cut was more or less what they wrote. Mr. Hood's rewrites I heard were quite well received, but I also hear they cut most of what he wrote out of the cinematic cut...<br><br>This film, cursed with a poor script fails at even just an entertainment level. Sure, there is lots of action and fighting, but there is no emotion behind it. I was actually bored half way through of the fighting and wanted some damn character scenes, of which there are none of note. And that is another problem, after the first act (young Conan) nobody has any character. They walk around, kill or die and that is all. Their motivations are given to us in a single line and that is all.<br><br>The cast were good, but they had nothing to work with. The directing was inconsistent, the mood was all over the place, at times it smelt of a less fun Scorpion King with Artus and Elan-sha (I know I got those names wrong) being out of place \"comic relief\". Stephen Lang, as usual is good, but again, he has nothing to work with, so he stands and acts mean a lot.<br><br>The one thing that really took me out of the world of the film, is the dialogue. Which lacks any sort of finesse, culture, period etc. It sounds like modern speech... which is one thing it shouldn't sound like. Imagine watching a Western where they all talk in modern American slang, that is what this dialogue felt like. It was dialogue you write in your first draft, then go back over and make it good...though it seems no one did in Conan.<br><br>The film looked nice, I'll give it that. Some scenes were too bright and conflicted with the mood, but again, the mood changed as often as it would in an angst ridden teenager. The CGI wasn't bad, it wasn't great but it was serviceable.<br><br>The Dweller scene was pathetic. There was no choreography, set up to it, Momoa literally stood in one spot for most of it and did just ducked around a lot. Clearly a complete failure in the directing department for this scene which had no climax.<br><br>Costume and wardrobe design was impressive. Lang's armour and get up were nice, McGowan looked sexy in a freaky kind of way. So visually it almost always worked.<br><br>Overall, I suggest seeing it if you are curious, it isn't the worst thing to happen to cinema by a long shot. But, with no story, at least none that is told in a coherent way, no character development or motivation and no sense of culture or the world the characters (caricatures) inhabit it not only fails as a Conan movie, it fails as a movie. It fails as a coherent story told with moving pictures, it breaks the very foundation of cinema's rules. It cannot engage an audience, because there is nothing for us to care about. As a video game, this would kick arse. As a movie, it falls on it.","user":"Sausage_Demon","rank":[350,476]}]