[{"title":"An excellent remake.","rating":9,"date":"1 February 2009","review":"While many people are just so put off by this film for many reasons, I was very surprised by how it actually turned out.<br><br>Although the original, \"A Tale of Two Sisters\", was an epic movie that delivered certain moods and feelings that this movie (and most other films to date) couldn't quite capture, this film was still just great.<br><br>One thing to understand was that this movie was completely westernized. Remakes such as \"The Grudge\" take place in Japan, but the main characters are replaced with an American or European cast, and sometimes the story just doesn't quite fit the way it should with that type of a cast. In this film, the \"A Tale of Two Sisters\" story is completely translated into an American setting, in the north in a small town. The characters are tweaked a little to accommodate the new setting, and so are some of the scenes and plot lines. This is where many fans of the original get upset and get their panties in a bunch.<br><br>If this film was truly remade true to the original, it would just be the original film itself being remade 5 years later with the same cast and same script. This film is honestly one of the best Asian-horror remakes that has been made in the past 3 or 4 years if not ever. The cast gives solid performances and there were little or no plot holes. There were actually less plot holes in this film than the original. Of course I liked the original more, but I'm just saying this film executed certain things that the first film didn't, just like the first film executed certain things this film didn't. They are meant to be similar but different, and that is what makes both of them worth seeing.<br><br>8.5/10","user":"pokeballzlol","rank":[150,208]},{"title":"Surprize, surprise, you can still make a good horror movie","rating":9,"date":"16 April 2009","review":"It's not easy to make a horror movie these days. The critics will hate it by definition: their expectations are always high and mostly unsatisfiable. They will call them uninspirational, uninteresting, and not original enough. With time, the horror genre has become an underdog of the movie industry. Prior to watching this movie, I had no knowledge about the plot whatsoever and it turned out to be good for me. I won't beat around the bush: I'm not a horror fanatic, but this one, I enjoyed from the beginning until the very end and I was pleasantly surprised with the outcome. The thing I appreciated the most was the great amount of mystery: at some point the movie becomes more a mystery movie than a horror movie. The plot is interesting at the very least: and it does make you think who the main villain might be. I personally had many guesses and I though I got it right, but the ending surprised me. And there's nothing I enjoy more than an ending I did not see coming. The surroundings are beautiful and the movie is very well shot. Visually, the pictures are very satisfying, another thing you would not expect. The acting is also professional, along the score: all these parts, I have no complaints about. The movie was, for some reasons I don't fully understand, certified as not fresh enough. I do agree, some moments are painfully cliché, but in this case, I found it charming. Isn't it a part of the horror movie to expect that a hand will try to reach you under the bed? It will make you jump in your place either way, so what's the deal? As long it's not cheesy, it's good enough for me. I think that if the creators maybe took a risk and avoided those couple of clichés, the movie would have been praised by critics. But who cares about their opinion anyway? The movie is really enjoyable and if that is what matters to you, don't hesitate and watch it. You won't regret it.","user":"peterkowalski","rank":[149,211]},{"title":"Spooky and Classy Horror Flick - Fear is Welcome in \"The Uninvited\".","rating":9,"date":"30 January 2009","review":"\"The Uninvited\" is about teenager Anna (Emily Browning), who spent time in a psychiatry institution after the accidental death of her sickly mother in a fire. But after ten months, she returns home to her spacious New England house that rests on edge of the coast. While happy to be back with her older sister, Alex (Arielle Kebbel), she is not so happy with her father's (David Strathairn) new girlfriend, Rachael (Elizabeth Banks), a nurse who took care of her mother up until the accident, and is now living in her house. Rachael seems to be hiding something, and the girls become convinced that she was responsible for the fire that killed their mother. As they dig deeper into Rachael's past, more suspicions arise, and Anna finds herself being contacted by the ghosts of both her mother, and three mysterious children that have a connection to Rachael...<br><br>I was somewhat skeptical going into this movie, seeing that it was a remake of the Korean \"A Tale of Two Sisters\", and the fact that it was a PG-13 horror movie, which is often a bad sign. But I was pleasantly surprised with \"The Uninvited\", because it ended up being much more than your typical teenage horror thriller. First off, the screen writing is wonderful here. The same \"evil stepparent\" setup has been done before, but there are a number of plot twists, turns of events, and nice little quirks that keep it from being too average. The film overall was really unpredictable in most respects, that is unless you have seen the original Korean film (which I have not, so I was very interested all along). The supernatural lacing in the story is well done too, combining ghosts and spirits with real-life danger that threatens our two leading ladies.<br><br>The cinematography is impressive, and setting is remarkable too, as the entire film unfolds in the confines of a beautiful, large New England home that sits perched on the side of the rocky ocean cliffs, a location that gives plenty of space for creepy action to unfold. It's atmospheric because of this as well, and has a comfortable - yet, more often than not, creepy- feel to it. I like the fact that the film takes its time building itself, shying away from being too shocking and posing plenty of questions in its first act, and then kicking into gear in the second and tossing the shocking truth behind all of the events right at your face. The ever-tiring jump scares are limited here, with suspense being the more the main focus, which was really welcome and a change from the norm. The pacing is delectable, and the tension is present as it grows toward the climax, which is nothing short of jaw-dropping.<br><br>Also, I'd like to mention the cast here. Emily Browning (of 2002's \"Ghost Ship\") plays the leading role as the curious and quiet younger sister, playing her role perfectly with the face of an angel. Arielle Kebbel is also very good as her older, party-loving (but serious) sister, who aids her in the uncovering of Rachael's past. Rachael herself, the devilish stepmother figure is played by Elizabeth Banks (whom I have seen mainly do comedy work), and manages to be threatening and elusive despite her good looks. Also notable is David Strathairn (whom I recognized from \"Dolores Claiborne\") as the unbelieving father. The ensemble of actors here is strong, and their chemistry with each other surprisingly really works, which I think added a lot to the film.<br><br>As far as the ending is concerned, I won't spoil things, but it's clever, really. It completely came out of left field for me, and I was dumbfounded and giddy with anxiousness within the final ten minutes. Sure, similar plot twists have come about before - but it was really unexpected- and the funny thing is, after thinking about it, there are clues that are dropped along the way. Problem is, they're so subtle that the viewer doesn't even notice, and I really liked that. I was completely caught off-guard. And the final shot is an innocently creepy seal on the envelope of a clever and entertaining horror movie.<br><br>Overall, \"The Uninvited\" is a very welcome change from the standard PG-13 horror pictures, and has the caliber of much more sophisticated horror movies. The classic horror atmosphere, creepy sets, and tense character interactions make this movie work, not to mention the twisted ending which is an unexpected smack in the face. \"The Uninvited\" is an enormously fun, well-constructed flick that retains an elegance that most horror movies nowadays (especially PG-13 thrillers) fail to achieve. (Also note: this film is in no relation to the 1940s ghost film of the same name) 9/10.","user":"drownnnsoda","rank":[64,95]}]