[{"title":"Most beautiful movie ever","rating":9,"date":"22 March 2009","review":"What you will definitely notice first is the animation. The drawings are beyond compare I have never seen such beautiful artwork in anime ever. This is 11 of 10 stars, not one less.<br><br>So, the plot. I don't think there is anything more beautiful in the world as pure, young love, everyone who was in love as a child can emphasize with that. No hesitation, no questions, just two souls melting in harmony. I fear as we grow older, most of us loose their capability of feeling that way, there is just to much stress and influence on us, what a pity. So... to the point; never has a movie (not just anime) projected this feeling of a young soul desperately in love more precise and moving than this one. I am a 26 year old man and I don't know when I cried the last time, but at a certain point in the movie I found myself dropping a big tear.<br><br>But beware: the movie is about chapter one. The second, still beautiful and honest, with a great metaphor and the very nice idea of changing the lead character, giving another angle on the subject, can just not compel with the first. And as many others, I did not like the last chapter either, but it is need to be said, that this plot does not harmonize with a good old fashioned Hollywood happy end, as most of the viewers would expect, or rather demand, I could say. This is a Japanese movie and Japanese movies take another angle on life itself. Just take it as it comes. This is definitely art.<br><br>If you are a romantic one, and open to art movies, this will become a piece of your soul. Honest thanks to the makers.","user":"bencuska","rank":[154,178]},{"title":"A Beautiful Experience","rating":10,"date":"8 January 2011","review":"This, for me, is quite probably one of the most touching animes that I have ever seen and one of the more heartfelt pieces of cinema that I have ever experienced. Basically, 5cm Per Second is a short movies split up into 3 episodes, the first one being 30 min, the second one 20 min, and the last one 15 min. Each of these three episodes portrays a pair of people and their relationship during childhood, adolescence, and adulthood. The story that it has is very simple and could be summarized in a few sentences but that is not the point of this series. The real point is the volumes of material that could be written about the emotion, feeling, and beauty that can found in this masterpiece. As you watch this, you will be able to distinctly feel for these characters and you will be able to connect with them as if you actually knew them because of how human and relatable they feel. You will be able to feel exactly the same as they do because in your childhood you will have felt precisely the same at some point and this connection comes through wonderfully. Only adding to this sense of wonder is what might by some of the better pacing in a series to date. Simply the way the characters progress and the way that it seemingly ends as soon as it starts will haunt you for hours or days afterwards. What strongly supports this anime is the excellent animation which stunning and the music, which while not jaw-droppingly amazing, still does not leave anything to be desired.<br><br>In short, do yourself a favor, take an hour out of your day to watch this beautiful work of art.","user":"valentin-frank","rank":[62,71]},{"title":"I registered just to review this movie.","rating":29,"date":"29 March 2010","review":"This movie blew me away - it was amazing. I can't tell you anything more other than it revolves around love, life and time.<br><br>This film is stunning you simply must watch it! Don't be put off if you're not interested by the end of the first episode because by the end of the third episode everything comes together in one amazingly beautiful package.<br><br>If ever a film deserved 10/10 this was it. If you have ever felt love you will adore this movie because it captures that feeling flawlessly.<br><br>This is the type of movie that was made by dreamers, for dreamers. By romantics for romantics. <br><br>This movie is pure art. Miss it and you're denying yourself something special.","user":"maximusdecimusborrilias","rank":[106,125]}]