[{"title":"Wow!","rating":8,"date":"5 April 2008","review":"This is a very good movie. I have laughed out loud and cried real tears, and that doesn't happen often! There are elements in the movie like in Shaolin Soccer, and it has some of Gremlins. Not everything that happens is possible (like in Shaolin Soccer), but that doesn't disturb the slightest, on the contrary, it's very funny. The young boy is a very good actor; amazingly so (he appears to be at most 10 years old). If anything is wrong with movie then it's that it's too short. I wish it was twice as long! I can highly recommend to watch this with children, but don't let them watch alone, as it contains a very sad scene that might need some hugging to get through.","user":"imdb1","rank":[40,49]},{"title":"Truly wonderful story, humorously narrated","rating":8,"date":"2 April 2008","review":"For someone like me, born and raised in China in a poor family, Chow's work was absolutely fantastic! CJ-7 constantly reminds me of those poorly happy times I have spent with my friends and family during my childhood, flashing to my mind those very basic and simplistic values of living to an average Chinese boy like myself. Nostalgic with a touch of humor, to me this movie is simply a 10 star hit! But, viewing it from a more literal perspective, people will see this work as \"the same old stuff\"... over and over again... that is true, from the use of mo lei tau comedy to computer CG, Chow has not made any improvements not to mention innovation ever since his \"Shaolin Soccer\" world class movie debut. This generally deducted the 2 stars from the rating.<br><br>But compared with a lot of the 3rd rated movies released in 2008 out there, this is sure worth the time!","user":"ukidding","rank":[27,34]},{"title":"A great film for kids and their parents!","rating":10,"date":"5 May 2008","review":"Let me start by saying that this film isn't in English so make sure you watch a version dubbed into English if you happen to be watching with children.<br><br>Im 41 years old yet this film provoked me into both laughing out aloud and softly shedding a tear or two. It certainly hits the mark. Don't expect anything too sophisticated - this is a simple story told through the eyes of a child.<br><br>All of the acting is competent and Jiao Xu steals every scene he's in. CJ7 is adorable and I can only image there will be a soft toy/animatronic on the Asian market by the time you read this.<br><br>Well worth the 90mins of your life! 10/10","user":"jaffacake2k","rank":[42,56]}]