[{"title":"Surprisingly Good","rating":7,"date":"12 December 2016","review":"First, let me say, this is the best Christmas movie I've seen in a long time. While the idea behind it seems to be a stereotypical Hallmark Christmas movie, the movie addresses the issues in a decidedly non- Hallmark way. It doesn't just resolve with everyone forgiving each other because of \"Christmas Magic\" and it doesn't treat serious issues in a heavy handed way.<br><br>While it has plenty of comedic moments, you shouldn't consider it a comedy. If you do, then it fails because, while the antics of the characters are pretty funny, it isn't a fall-off-your-seat-laughing sort of movie. It is a genuinely good movie about a dysfunctional family, children questioning the magic of the world, and a father who is desperately trying to be a better dad than his was.<br><br>It is extremely well written and the performances by Joel McHale, Lauren Graham, Candice Bergen, and (of course) Robin Williams make this movie a must see for any Christmas or Robin Williams fans.","user":"emilykeeter","rank":[9,13]},{"title":"Not Really a Comedy More like a Drama","rating":6,"date":"8 November 2014","review":"This was pretty hard to watch as it star one of my idols the late Robin Williams who dose a fantastic job a playing this grump old former alcoholic father who was never really there for he's kids, he's performance is as away perfect its such a sad time to see a great actor pass from us. Although i wouldn't really say this is a comedy in a way as it very depressing &amp; bleak at time's but you get why this is as it set a tone more as a drama than a comedy as you see the son Boyd Mitchler played by Joel McHale who seem to hate his father for never being around &amp; always being drunk. The story goes along at a stead pace as you see the character's develop, it soon becomes this family bonding time with his father as he force to go back home to get something for he own son. What clever is this film show just how damaging curtain bad thing happen in family's can be this is where this film start to take on a bleak dark tone of sadness, it not really a funny comedy its more of a black comedy drama type film in a way but still worth watching. <br><br>Dislikes : Comedy's are meant to lift you up &amp; make you feel good, this just ended up making me depressed just because of the tone of the film, although i thought it was good film, but this is far from a comedy lack the laughter &amp; light humour.","user":"gerry_barnaby","rank":[16,28]},{"title":"A great cast..but .a big disappointment of a film","rating":1,"date":"12 December 2014","review":"I found this movie on Netflix, and I wondered how come I didn't see a trailer for this in the theaters or on TV? With such a solid cast, it should be good? After watching it, the best word that comes to mind is \"disappointing\".<br><br>Whomever wrote &amp; directed this clunker shouldn't quit their day job. I would imagine that they lost big money after paying this cast. The story is terrible and stupid. Such a waste of great talent like Candice Bergen and Robin Williams. They aren't even believable as a married couple.<br><br>It's very sad that this was Robin Williams' last films. Especially when you think of all the classic characters that he played over the years, that he would choose such a badly written/directed film. The movie is depressing &amp; lame.<br><br>Now I know why it wasn't successful in the theaters. A total clunker.","user":"billkexel","rank":[13,22]}]