[{"title":"Feed it to the croc","rating":2,"date":"10 June 2007","review":"Junk. Pure and simple.<br><br>An unnecessary and useless sequel to the self-mocking and campy comedy/horror Lake Placid. Not one of the original cast signed on for this dog, a very good decision on their part. Well, the baby crocodiles you see in the closing of the other movie apparently have grown up, and now have decided to pick up where their parents left off, and eat lots of people.<br><br>John Schneider is the sheriff, and just grins a lot. Cloris Leachman reprises Betty White's nut job (as her sister), but without the funny lines. A big game hunter with grenade launchers fails to match Oliver Platt's role, and the Bridgette Fonda look-alike also does nothing. Sheriff John has summertime custody of a poor actor teen son, in order to introduce some annoying cardboard cutout screaming teens. Since Croc Jr. seems to have an appetite for annoying cardboard cutout screaming teens, you quickly realize what their function to the story is, and you find yourself rooting for the croc to eat them as soon as possible. There's one idiotic scene, apparently ripped off from the 3 Stooges, where a croc victim is talking while the creature behind him waits patiently for him to shut up, before devouring him.<br><br>Nothing interesting happens. Really a bad movie, that fails at both horror and comedy. All it does is waste your time.","user":"MartianOctocretr5","rank":[43,50]},{"title":"Not worth the time","rating":3,"date":"28 April 2007","review":"I'd seen Lake Placid at a friend's house one night, and thought it entertaining, so I was happy to see a sequel was going to be shown. Now though, I have to say I wish they hadn't bothered. Overall, the movie is just poorly done. The acting is terrible; even John Schneider, who I usually enjoy, disappointed me. I'd equate the acting in the film with a middle school performance. And something was off with the sound- it almost sounds like they pre-recorded all the lines, and just matched it up with the film. <br><br>The special effects, if possible, are even worse than the acting. Very fake looking, and extremely amateur; this looks like a high school project! There are several times when you can see parts of the crocodiles magically pass through things. <br><br>On the plus side, little as it is, some of the characters were mildly entertaining in the sense that the acting was so terrible. There's one actor in particular who screamed like a girl, and that made me laugh. I'll also add that if you saw and liked the first, you may want to watch this just to satisfy your curiosity. Beyond that though, it's not worth it.","user":"akashenson","rank":[36,42]},{"title":"I wanted to like it.","rating":3,"date":"29 April 2007","review":"The first Lake Placid was the type of movie that you loved or hated. I loved it. The actors had chemistry. The script was clever. The key was to take it for what it was. A lot of people did and it developed a cult following.<br><br>I wanted to love II. But, it wasn't there. I think they tried. But chemistry and hitting the exact same note is hard. I think they put together a good cast. The writing was supposed to make you grin. It just didn't pull together tight enough. Nice Try. Lake Placid a tough film to duplicate on any level.<br><br>I think a lot of the fans of the first one went into it with the right frame of mind. If you didn't see the first one you may not understand the choices they went with as far as corny dialogue and silliness. Maybe they can bring back Ms. Fonda for 3!","user":"Babyfaceref","rank":[23,26]}]