[{"title":"Awesome movie, watched it multiple times","rating":10,"date":"23 February 2020","review":"This film is every definition of the word \"impeccable.\" Scorcese's fantastic storytelling ability mixed with phenomenal acting from DiCaprio, Hill and the rest of the cast makes for an awesome combination. The film is never boring and gives you a glimpse into the life of a man who had everything in the world only to have it taken away.","user":"MR_Heraclius","rank":[42,50]},{"title":"DiCaprio gives the best performance of his career.","rating":9,"date":"24 December 2013","review":"In the mid-1990s, Jordan Belfort (Leonardo DiCaprio) and the rest of his associates from brokerage firm Stratton Oakmont became the very definition of excess and debauchery, their offices a boiler room fueled by cocaine and greed. High pressure sales tactic and less-than-legal behind-the-scenes manipulation bred plenty of twenty-something millionaires, and Belfort built himself an empire at the top of the heap. His rise and fall is chronicled in The Wolf of Wall Street, based on the memoir of the same name.<br><br>Under most circumstances, the actions of Belfort and his cronies (including Jonah Hill in a howlingly funny turn as Belfort's business partner) would be viewed as disgustingly abhorrent, but Martin Scorsese frames this tale of greed with a comedic lens that allows us to laugh at things we probably shouldn't find humorous. Whether it's a clumsy attempt at fisticuffs between two characters overdosing on Quaaludes, or the categorization of prostitutes using stock market terminology (\"blue chip\" hookers make you wear a condom and typically accept credit cards), the film is outrageous from start to finish, and rarely falters in its quest to entertain the audience for three hours.<br><br>Belfort manages to delude himself and his pals into thinking they can live like this forever, but the audience knows better, and Belfort's eventual comeuppance is hardly surprising. But the path is paved with hilarity, especially in a scene aboard the mogul's luxury yacht, where he surreptitiously offers a pair of FBI agents everything from booze to girls to cold hard cash in exchange for their silence. And let's not forget his punishment for drunkenly piloting a helicopter into the backyard of his estate at 3am, raising the ire of his trophy wife (Margot Robbie).<br><br>Scorsese has always managed to elicit astounding performances from his actors, and his fifth collaboration with Leonardo DiCaprio results in one of the most charismatic, despicable, offensive and captivating characters to ever appear on screen. As financial bad boy Belfort, DiCaprio swaggers from scene to scene ingesting eye-popping amounts of narcotics, groping and fondling nearly every female within reach, and spouting more profanity in three hours than an entire season of The Sopranos. Belfort is the kind of person that any sane person would detest in real life, but thanks to Scorses and DiCaprio, we can't take our eyes off him.<br><br>-- Brent Hankins, www.nerdrep.com","user":"BrentHankins","rank":[493,706]},{"title":"High energy and wonderfully excessive as it delivers an engaging true story, but the lack of morality anywhere was a limiting factor","rating":17,"date":"17 January 2014","review":"This film arrived in the UK with awards and Oscar nominations all around it, adding an expectation which it really didn't need adding since even without any of that it is ultimately a Scorsese film with a big name cast. It also arrives with some other stuff because the film has been criticized for near glamorization of the excesses that Belfort was able to experience with his ill-gotten funds and, to be honest, it is an impression that isn't helped when you consider that this film was put forward to the Golden Globes in the Musical/Comedy section. Now I am sure that was a political move by the studio, but it does say something about the film because indeed for most of it we have stuff so unbelievable and so excessive that it is hard not to laugh at it. It is hard not to enjoy it.<br><br>And this is a problem, because the first 2 hours and a bit of this film is really engaging and enchanting in how much of a rush it gives you, how enticing it is and just how much vibrant energy it all has. The viewer is swept along and I guess to a point this is the film doing its job well because not only are we being told a story but we are first hand seeing how easy it is to get caught up in the grab for success, for money, for status. In this regard the film works really well because throughout the film I really was glad to be part of it and wanted it for myself; I don't think the film goes out of its way to glamorize this excess and this life, but for sure it doesn't do much to balance it – and this really is my problem with the film.<br><br>The structure, subjects and delivery of this film is so inherently similar to Goodfellas that it is hard not to mention it. If you remember the opening of Goodfellas you'll remember that it opens with a memorably violent scene where an near-dead man in the back of a car is stabbed by Hill and his colleagues in a scene that is oppressive and violent but yet ends with the narration telling us \"as far back as I can remember I wanted to be a gangster\" and snaps to credits under a big track from Tony Bennett. This scene is important because it works as a microcosm of the whole film – the appeal but also the cost, all in one place. Wolf of Wall Street never has any of that and it hurts it. I suspect the message of the film is that our financial systems are screwed and that ultimately the rich will never be in the same world as the average person, because this is what I took from the rather sobering final scenes. However if this is the point it is trying to make then it really hurts itself with the rest of the film seeming to say \"so why not get on board\". I know this is not the case but the lack of a \"point\" or an agenda it the film means that it naturally fills it with its own, which is a weird feeling.<br><br>But then again – I guess it is a comedy. So the infamous Quaalude scene is not horrific but rather hilarious, the scenes of excess and of criminality are not equally appealing and repulsive – they are almost totally appealing, we hardly get the other side or get to see a victim here, and a few seconds on the subway with the FBI agent really does nothing but yet again make the suggestion that \"it's all broken so why not at least get rich yourself\". Getting away from this, it is a well made film. Scorsese makes this award season's second film to owe a massive debt to Goodfellas (American Hustle being the other) and he directs the film with energy; music is used well as one would expect and the editing makes the film pop. DiCaprio is great in the lead – OK he doesn't find the heart of the character, but the film doesn't ask him to. Instead he is charismatic and energetic, drawing the viewer in and giving the film its energy. The supporting cast is deep with names and familiar faces and it is a statement about how well the film holds the viewer, because it isn't distracting no matter how many famous faces or supporting character from TV appear (although I did notice that this and American Hustle had lots of faces from HBO's Boardwalk Empire). Jonah Hill is over the top in a way that works, although I am surprised to see him getting an Oscar nomination for it in such a crowded year.<br><br>Wolf of Wall Street has had a lot of praise and this will continue as the Oscars approach and are awarded. Personally I enjoyed the film as a funny true story delivered with energy and excess but in many ways it is not Goodfellas and the most important of these is that the film lacks a moral core to itself, to its characters and to its message. I don't mind the \"it's all screwed so who cares\" message that it ultimately seems to give, but I didn't feel comfortable with how wide a smile it had on its face while it was delivering it.","user":"bob the moo","rank":[181,263]}]