[{"title":"Very disappointing","rating":4,"date":"12 December 2008","review":"Why do these movies feel they need to include a bratty, spoiled, overbearing kid?? The ridiculous performance of Jaden Smith added annoyance to the empty script.<br><br>The movie starts off well enough, and then tries miserably to develop the characters and make us care for them. The Bates role is absurd; Cleese's role has virtually nothing to say this amazing encounter. The military point of view is typical; as if there's only one area where the military is useful (I would expect nothing less from \"Hollywood\").<br><br>There were some very interesting ideas (the sphere-like ship, the nanobots, the Gort acronym) and the effects were top notch, however Gort (the one thing the movie had going for it) was on screen for less then 10 minutes.<br><br>Keanu was perfectly cast and Connelly does a good job with what's given to her. All in all, another flop of a remake. This actually makes the War of the Worlds remake shine.<br><br>I saw this movie in IMAX - if you're going to see it, find an IMAX theater. Lastly, am I the only sick of seeing the same old New York back drop? I love New York City, but come on! Be original!","user":"toby007","rank":[548,730]},{"title":"The Day the Audience Shrugged Their Shoulders","rating":1,"date":"14 December 2008","review":"\"The Day the Earth Stood Still\" is a stunningly inept remake of the 1950's classic of the same name. It's one of those big-budget films so unfathomably dull and inane, you wonder how it ever got made. Whereas the original warned of the dangers of nuclear armament, this modern update boldly chides us for being mean to each other and not taking care of the environment. Gee, Hollywood, thanks for the swell insight! This Christmas season Hollywood teaches us that people can sometimes suck, but only that special kind of film can suck totally. <br><br>Although the entire production is horrible from top to bottom, the inert direction of Scott Derrickson and the randomly asinine script from David Scarpa bear most of the blame. The screenplay clearly went through arbitrary rewrites, perhaps after being focus-grouped to death, and shows not a single breath of imagination. Around every turn, it wastes opportunities and insults the intelligence of the audience and gives us not one authentic character or moment to connect to. Even when it thinks it's being cool (like the lame reveal that those alien spheres are actually \"arks\" trying to save animal life before the world is annihilated) the script fails miserably. One sphere that is shown on the back of a pick-up truck being attacked by flame-throwers in some foreign desert town inexplicably contains squid, because, well, the shadows of squid inside a giant sphere look kinda neat, that's why! At least the script teaches us one thing. Apparently all you need to do in order to survive an apocalyptic robotic alien insect attack that devours everything in sight is to hide under a bridge in Central Park!<br><br>The saddest part of the film is how the director wastes his talented cast. The always wooden Keanu Reeves was perfectly chosen to play the alien Klaatu, but even he seems to be disbelieving the words that are coming out of his mouth. Poor Jennifer Connelly, an immensely emotive and alluring actress, appears to be in physical pain or constipated for most the film, obviously stunned she agreed to star in this junk. Kathy Bates and John Cleese apparently showed up only for their paychecks and sleepwalk through their lines, and at one pivotal moment where Bates' Secretary of State attempts to show regret for some bad decisions made, she actually appears to fall asleep in her chair. And then there's poor little Jaden Smith, who appears bored to tears throughout the film and is given no direction from Derrickson except when he is asked to cry on cue in the supposed emotional climax of the picture that left me feeling sorry for all involved.<br><br>However, if anyone should be hung for this travesty, it's the producers, who must've run out of money at some point and filled the gap in funds with some nauseating product placement. How else do we explain Klaatu's trip to McDonald's for an important meeting with another of his kind? <br><br>\"The Day the Earth Stood Still\" is easily the worst film of the year. At least \"The Happening\" had its accidentally humorous moments. This clunker offers no such relief. Even the special effects are done in a lazy and unimaginative manner. It's so awful, I was stunned into stillness while the rest of the audience seemed to shrug their shoulders.","user":"WriterDave","rank":[192,252]},{"title":"Mildly entertains, but never reaches its potential.","rating":10,"date":"10 December 2008","review":"The epic science fiction blockbuster is slowly but surely becoming a dying form of cinematic entertainment. Not since the days of cold war paranoia and the initial splurge of CGI technology back in the nineties has the genre seen much love either from its core enthusiasts or those looking for something big but different. Yet there are numerous obvious reasons for its decline in demand, most of which are unavoidably apparent in this, the latest and arguably first of its kind for over a year now, The Day the Earth Stood Still.<br><br>Based upon a movie from the genre's heyday, director Scott Derrickson's version lacks the same sense of awe, conviction and relevancy to our current social climate. Bombarded with underdeveloped themes, an incoherent plot and extremely rough characterisation, the movie suffers not just from a lack of significance in its arrival, but also in its implementation. Most disappointing of all however is that in spite of the many technical flaws present, the biggest let down is that the movie simply doesn't convince; the effects are impressive and the story can be gripping through its thick layer of foreboding atmosphere from time to time, but an overall lack of substance hurts the film's ability to truly draw you in and take off. It's a routinely enjoyable experience sure enough, but an over reliance on this safe-play structure stops the feature from excelling beyond mere light entertainment.<br><br>Telling a first contact story that involves rather heavy handed themes of a doomsday like prophecy, like most good science fiction movies big to small, The Day the Earth Stood Still retains a sense of wonder and mystique to its tale, particularly early on. During these initial moments of exposition which come to an eventual climax of contact with an alien presence visiting Earth for unknown reasons, the movie achieves its only real piece of coherent and engaging drama; the way in which it unfolds is magnificent and capitalises on the movie's big effects budget in ways that feel impressive and yet substantially eerie at the same time- there are moments when this big shot sci-fi movie actually feels like a genuine product of imagination and heart.<br><br>Disappointingly however, this does not last very long. From here on in the feature slowly but surely declines in both mystique and interest, culminating in a third act which is about as convincing as it is exciting; which believe it or not, isn't much at all. It's around this point that things take a drastic turn from intelligent and insightful science-fiction to big dumb blockbuster action movie; the themes that are brought up during the movie's initial stages are belittled to a deux ex machina that never quite seems justified, and the climax if you can call it that- feels stunted and perfunctory for the sake of giving a clean feeling of catharsis. It's perhaps the biggest reason why most major productions based on sci-fi scripts never seem to work; the balancing act between catering to the mass public and those wanting intelligent drama is a hard one to pull off, and nobody here seems quite sure how to do such a thing.<br><br>If there is one thing that I can praise the movie for, outside of its opening act that is, it would simply be within its excellent aesthetic design. From the dynamic score penned by Tyler Bates to the often endlessly interesting photography of David Tattersall, The Day the Earth Stood Still gets most of its outer shell right, even if everything that lies underneath is a less than inspiring mess. One also has to draw attention to lead star Keanu Reeves who plays Klaatu, the alien/human hybrid visitor and mediator who is welcomed to Earth with a less than hospitable, but terribly human introduction. Reeves is an actor known for his alien-like, wooden style- which is why he is so often found in these kinds of films- and it suits his character adequately enough here. Co-star Jennifer Connelly holds her own too, and while she isn't given much to work with throughout, she does a fine job in playing as Keanu's contrived human sociology lesson.<br><br>When the credits roll however, despite the movie's impressive effects, imaginative premise and somewhat entertaining moments, The Day the Earth Stood Still simply feels like an empty experience. As science fiction, the movie conjures up some intelligent questions and yet David Scarpa never seems quite up to the task of taking them any further; and as popcorn fodder, the movie simply doesn't do enough rule-breaking to come off as anything but standard fare. This awkward need to balance both crowds irrevocably results in a feature that indeed avoids polarising, but only to the point where mostly everyone will leave feeling under-stimulated. It has its fair share of compelling and visionary moments, but a distinct lack of development, coherency and substance stops The Day the Earth Stood Still from being one worth remembering. Light sci-fi with a dash of social intrigue that mildly entertains, but never reaches its potential.<br><br><ul><li>A review by Jamie Robert Ward (http://www.invocus.net)</li></ul>","user":"Otoboke","rank":[403,550]}]