[{"title":"Do NOT buy into the negative comments!","rating":8,"date":"20 December 2009","review":"First off, you need to know that I joined IMDb purely to undo the diabolically misleading rating that this movie has gotten. I must say, I was not expecting much from it, but as the credits rolled by, I quickly made the decision that this movie was going up on my facebook list of favorite movies.<br><br>Milla Jovovich has never been a spectacular actress in my book. She's great in action flicks (I am a massive fan of the Resident Evil series!), but I've always found that she goes a bit overboard when taking on dramatic or real life roles. I was more than pleasantly surprised when it dawned on me just how good a job she did on this film! Granted, no one needed Oscar worthy acting to pull off their roles; every actor in this film held their own. <br><br>From beginning to end, I was totally drawn in - both character and story-wise. Sure, you come across some clichés here and there, but that's totally to be expected. The entire movie is cleverly put together and is sure to keep you guessing every step of the way. The characters are well developed, the acting is great, the scenery and cinematography are outstanding - some very inventive shots towards the climax of the film - and the story will definitely leave you with the feeling that \"it\" actually hasn't all been done before. <br><br>Every person that has rated this movie low falls under one of two categories: Either they missed an integral part of the story (I watched the film twice just to make sure I was right about this), or they have ludicrously high standards. <br><br>Movies are by no means my life. I'm sure my rating of 8 is probably a bit biased (for some reason, this movie really did it for me on pretty much all fronts), but any rating below a 7, in my humble opinion, says more about a lack on the reviewer's end... not the film's. This is definitely a must see for anyone into this genre! One for the collection, even!","user":"oiblay","rank":[210,303]},{"title":"Much better than I expected.","rating":8,"date":"7 August 2009","review":"A Perfect Getaway was nowhere near a perfect film, but it was certainly a good film. The trailers made it out to be a much more non-stop, action thriller than it really was, showing the last 20 minutes. The majority of the film centers around paranoia. It is true though that the plot twist can be seen coming from a mile away, but how it is delivered is where it succeeds. While I personally wasn't surprised, how the twist was presented was quite original and chill-inducing. I'll leave it at that. Where this film really succeeds is in the cinematography and acting, both of which are superb. The locale is beautiful, all the colors are vibrantly displayed and everything looks crisp. There are some scenes with intriguing camera work that works well to add intensity and be intuitive. All the actors really give it their best and create believable characters. Milla was good as usual, but Zahn really surprised me. I never really gave him credit for how good of an actor he is until about now. Overall, it's worth the watch and is ultimately very entertaining with wonderful characters.","user":"ValianceInEnd","rank":[152,219]},{"title":"Good thriller. Keeps you guessing.","rating":7,"date":"9 August 2009","review":"This is a good movie. However, it will probably not get a fair shot by most. The reason is the way the story is structured in which apparently nothing happens in the first 45 minutes. For today's average 18-34 audience this is almost intolerable as they are now conditioned to expect cheap CGI thrills and impossibly huge explosions in the first two minutes of the film (not necessarily a bad thing BTW). What underrated Director/Writer David Towhy is doing is actually putting your brain to work during the first two acts of the movie, all the while enjoying some incredible visuals of the Hawaiian tropical rain forest. Towhy concentrates on subtle character development. The acting is good. Mila Jovovich and Timothy Oliphant are the two that carry the film throughout. All in all I have to say that Towhy put out a fairly plausible story here with none of the CGI generated hyperbole that we see so much of nowadays.","user":"dustyjoe","rank":[138,207]}]