[{"title":"Well above average indie flick!","rating":9,"date":"30 March 2009","review":"Just saw this film at the AFI Dallas Film Festival. I was very impressed with all elements of the film: acting, direction, editing (though the dialog transitions were sometimes a little shaky), cinematography, etc. Dallas Roberts (Matt) and Jeremy Renner (Sam), who had not worked together previously, establish an amazing on-screen chemistry as best friends struggling to run a novelty gift business. The dilapidated storefront they operate out of is the emblem of their entrepreneurial disconnect: high on energy and ideas, low on success. Ayelet Zurer, the smoldering Israeli beauty, plays Matt's long-suffering wife Gina with nuance and flair.<br><br>I would recommend this film not only to indie fans who like a fair amount of high-speed comedy mixed in with their drama, but also to *anyone* who has ever tried to run their own business, and really put themselves out on a limb for an idea or a dream.<br><br>All great films (and this is surely one of them) have a key line or scene that summarizes the film. Without giving anything away, I will tell you that in this film, it is the closing scene atop a mountain with Matt and Gina.<br><br>Jeremy Renner was at the screening for a Q&amp;A. He was funny, quirky, and candid, much like his character in the film. I can't wait to see this guy in more vehicles, even the television series \"The Unusuals\" that he's making with Amber Tamblyn.<br><br>Two thumbs way up!","user":"kevingi-1","rank":[21,27]},{"title":"Very Entertaining","rating":8,"date":"21 March 2012","review":"I saw this at a special showing at The Loft (one of the best independent theaters in the country) last month. While everyone in the theater had a special affinity with the film (it was shot entirely in Tucson and every street scene brought a gasp of familiarity from the audience), there was more to the buzz than just local pride. The story is believable and fun, and while some of the circumstances might have been exaggerated, the characters ring true and there is a wonderful spirit that flows through the entire production. It's the kind of film that doesn't seem to get made these days, and it sat in unedited limbo for quite a while waiting for financing to finish it up. I can see why, because the marketing will be tough since there is no obvious target audience. But when it shows up in wider spread distribution, go see it. It's an evening well spent.","user":"tucsondave","rank":[7,10]},{"title":"light but serious","rating":7,"date":"29 April 2009","review":"I saw this movie at the 33rd Cleveland International Film Festival, where it bore the honor of being the Opening Night flick. As such, it worked well, being an accessible, pleasant crowd-pleaser. Based on producer Mike Cram's own story, it follows the travails of several young adults seeking to make their own way in the business world by marketing their own inventions.<br><br>Dallas Roberts as Matt, Ayelet Zurer as his wife Gina and Jeremy Renner as business partner Sam make up an interesting triangle (of sorts). We are thrown into Matt and Sam's business with opening scenes that represents the failures they have had up to this point: numerous failed \"can't miss\" inventions are mentioned, we find they are not at all business-savvy as they are involved with a unctuous telemarketer (played with a shark-wide smile by Richard Kind) and we find out about their shared gambling addiction. Oh, and Matt gets his ideas by standing on a small mountain surrounded by numerous communication dishes and \"listening\". Gina provides the regular income in the family, and has been through enough as an addict's co-dependent. She gives Matt his last \"last chance\", putting us into the heart of the story.<br><br>There are enough unpredictable elements to provide a good narrative structure, with pretty good acting all the way around. The film was fine technically, I was told a story and I cared/knew about the characters. I especially liked the scene of \"grand-theft cactus\" and the conclusion up on Matt's mountain, ambiguous in a satisfyingly Indie way.<br><br>Lightbulb delivers a good package of entertainment, some comedy and a load of empathy for anyone who has endeavored to make their own way in the world.","user":"fnorful","rank":[4,5]}]