[{"title":"Missed the Point of the Story.","rating":2,"date":"13 December 2010","review":"I felt really disappointed when I saw this film. Sure Ben Barnes was great eye candy in this movie but other than that there wasn't anything to enjoy.<br><br>The book was this adventure story showing the change of Eustace, a self-centered, no-nonsense boy who didn't believe in anything. The movie was a flash from one island to another showing some made up villain in green smoke which was half-fast and not even slightly thought out.<br><br>I guess the script writers weren't able to grasp what the story was really about and they thought there had to be some visible villain to fight. The whole book was about Man Vs. Self but by throwing in this green smoke that makes you see what you fear it seemed to take away the realness of how horrible even good people are inside. They really managed to destroy their own movie by making that the center of their story rather than having it be the growing up book it really was.","user":"PinkWeeds","rank":[64,82]},{"title":"Why bother adapting a book if you're just going to rewrite the plot???","rating":6,"date":"11 December 2010","review":"I was SO looking forward to the Voyage of the Dawn Treader, and was sorely disappointed. <br><br>The film felt like they took the original story, chopped it up, then threw it in a blender with seven magical swords and some ridiculous green mist! <br><br>While the film stayed true to main themes of the story, much of the character development and purpose to each of the minor island stories was lost. Unfortunately this meant that most of the magic of the story was lost as well.<br><br>I gave the film 6 stars due to the redeeming qualities that were the stunning visuals, some excellent acting (notably by Will Poulter as Eustace), and a beautifully executed final scene.<br><br>If you haven't read the book, then you may enjoy this film immensely, but if you are a true Narnia fan, don't go in with very high expectations.","user":"mistels","rank":[101,140]},{"title":"Splendid adaption if you get over some bad dialogue","rating":7,"date":"30 November 2010","review":"I have watched this film in 3d at a preview screening in London.<br><br>First of all, I do not recommend anyone watching this in 3d. It is too dark and the action is just a motion blur. It's dreadful.<br><br>As for the film, there is much to enjoy with excellent visual effects, action set pieces (though ruined for me by the 3D) and a couple of stand out characters. But unfortunately there is also much to cringe at in some bouts of terrible dialogue.<br><br>The characters of Reepicheep (the kick-ass warrior mouse) and Eustace, (the obnoxious brat cousin) were the most fun with the actor playing Eustace demonstrating excellent comic timing. The relationship between them was funny and touching. And they even brought much needed zest to the action.<br><br>But alarmingly, Edmund and Lucy seem to have deteriorated as actors. Some of their emotions are too forced which is a pity. Not sure why, as I would expect them to improve with each film as did the young cast of the Harry Potter movies.<br><br>Overall, the story has surprisingly been well adapted considering not a great deal actually happens in the book. But the pacing is good, even though a little episodic. There are much more Christian analogies once again which would please many and irritate others. But I rather like all of the analogies.<br><br>I do feel however, that amongst adults, mostly those who enjoyed the Narnia books will enjoy this more than non readers of the books because the story is too bizarre even for a fantasy! But I think most children will enjoy this immensely, regardless if they read the books or not.<br><br>With better written dialogue and better handling of the child performances (namely Lucy and Edmund), this could have been a much better film but as its stands its an enjoyable enough entry in this series.<br><br>Oh and I will say it again, do not watch this in 3d.","user":"theycallmemrglass","rank":[117,169]}]