[{"title":"Guilty or innocent, \"The Conspirator\" gets it all right","rating":9,"date":"21 May 2011","review":"\"The Conspirator\" is an impossible trial to win, but it's tried by the best cast in the best manner possible. Heroes returned home from the Civil War to be greeted by the Secretary of War, Edwin Stanton (Kevin Kline) and other high-profile members of the War Department. President Abraham Lincoln was occupied elsewhere.<br><br>After the assassination of Lincoln, we follow not so much the trials of the conspirators, but the trials of lawyer Frederick Aiken (James McAvoy). McAvoy has quickly forged an incredible career where he has a propensity to play the man next to historical figures and provide us with an inside view (like the doctor to Idi Amin in \"The Last King of Scotland\" or secretary to Leo Tolstoy in \"The Last Station\").<br><br>Here, McAvoy is the very patriotic soldier-turned-lawyer defending Mary Surrat (Robin Wright), the lone female conspirator. The film focuses only on Surrat's part of the trial of the conspirators, mostly because this film is about her lawyer. A devout supporter of Stanton and the Union, Aiken believed that Surrat was guilty and spent just as much time proving her guilt as her innocence. His internal struggles accepting everything that he had to do and what he should do were rather profound. I also think they make up McAvoy's best performance of his career. Too bad that the Academy will have forgotten it by the time the Oscars come around.<br><br>Like the best historical dramas, Redford never comes out and says if he believes that Surrat was innocent or guilty. \"The Conspirator\" isn't about that. This is about the trial. His views on the use of a military tribunal versus a civil trial are clear.<br><br>I was blown away by the impeccable production, the cast, and the sheer atrocities committed by so many of the characters not on trial. There may have been a few artistic licences taken, but I doubt it was with the extremes to which some military personnel will go. The great Kevin Kline and the up-and-coming Johnny Simmons play the two least sympathetic characters in the movie. Phenomenal casting is just one the great aspects of \"The Conspirator\".","user":"napierslogs","rank":[51,53]},{"title":"Presents its message in a clear and powerful way","rating":8,"date":"14 May 2011","review":"Robert Redford's The Conspirator dramatizes the military trial of Mary Suratt, a boarding house owner accused of harboring conspirators and being involved in the plot to assassinate President Abraham Lincoln. It is a strong, if somewhat obvious, drama that depicts the mood of hysteria that followed the assassination, and suggests its relevance to today's politics. Written by James Solomon who spent fourteen years researching the story, the film opens with a brief introduction showing the agony of combat troops in the Civil War, then focuses on the assassination of the President on April 14, 1865 by actor John Wilkes Booth (Toby Kebbell), a Southern partisan and his companions Lewis Payne (Norman Reedus), David Herold (Marcus Hester), and Samuel Arnold (Jeremy Tuttle) at the Ford Theatre in Washington, D.C..<br><br>Stealthily entering the President's box, Booth shoots Lincoln in the head, then leaps onto the stage shouting \"sic semper tyrannis\" (thus always to tyrants), and escapes on horseback. The assassination results in an outpouring of grief all over the country, and prompts the Secretary of War, Edwin Stanton (Kevin Kline) to vow revenge against the conspirators. After a two week search, Booth is found hiding in a nearby barn and shot to death, while seven suspected co-conspirators are arrested including Mary Suratt. Suratt is tried by a military tribunal where the rules state that only a majority vote is required for a guilty verdict and a two-thirds vote is needed to sentence a defendant to death. It is a court where a defendant is prohibited from testifying in their own defense.<br><br>Senator Reverdy Johnson (Tom Wilkinson) from Virginia and a former U. S. Attorney General agrees to defend Suratt on the grounds that she is innocent until proved guilty. The Senator, however, withdraws because he fears that being a Southerner might prejudice his case, and asks Frederick Aiken (James McEvoy), a northern attorney to defend her. Initially reluctant and dubious about her story, Aiken resolves to prove her innocence after seeing that the defendant was up against an overbearing prosecutor (Danny Huston), a biased head of the tribunal (Colm Meany), and the behind-the-scenes antagonism of Secretary Stanton.<br><br>At great cost to his personal life, Aiken tries to prove that Ms. Suratt knew the boarders who lived in her house, but was not involved in their conspiracy. As the case progresses, it becomes apparent that only her son John (Johnny Simmons), a known conspirator who fled to Canada, can save his mother by surrendering. While there is limited dimension to the characters, The Conspirator is true to the historical record and the film presents its message in a clear and powerful way. Redford, long a champion of civil liberties, implicitly reminds us that the Fifth Amendment to the U.S. Constitution expressly guarantees that \"no person shall be deprived of life without due process of law\" and provides no exception for war.<br><br>It is not only an important message for those unfamiliar with our nation's history, but is strikingly relevant to the present day in which hundreds of detainees at Guantanamo still languish in prison without trial, where a U.S. citizen, suspected of terrorist activities, is targeted for an assassination attempt without having been charged with, let alone convicted of, any crime, and where the ideal of due process and the presumption of innocence is slowly being replaced by unlimited violence, the repudiation of legality, and the undermining of democracy.","user":"howard.schumann","rank":[72,80]},{"title":"A very historically accurate, dramatic film.","rating":7,"date":"15 March 2011","review":"I had the pleasure of viewing this film at a press screening recently, as well as hearing an interesting Q&amp;A afterwords. I was very impressed with this film. <br><br>I've read extensively about the topic of the Lincoln assassination, and came into the theatre expecting another Hollywood style period piece, one that minces facts and creates story lines where there are none. I came out feeling very contented, and a little teary. This movie is very well acted and truly conveys the emotion felt by the characters in history, unlike some civil war films. <br><br>This movie truly is about the struggle between justice and country. I won't give much away, but the emotional conflicts in this film are very deep and strong. I was very surprised at James Mcavoy's handling of the character, and more so his good American accent :D. Robin Wright and other supporting cast are also superb. Do see this movie when it comes out! It's a fantastic drama that will keep you at the edge of your seat, mixed in with fantastic period details. Any fan of American history and the civil war will enjoy this.","user":"anneboleyn15","rank":[101,122]}]