[{"title":"How a strong 9+ becomes a 6- in just 30minutes.","rating":6,"date":"14 May 2010","review":"I had very high expectations and who wouldn't? Ridley Scott directing a great adventure with a very solid cast and a high budget.<br><br>The movie didn't really start the way I thought it would. The pace was quite slow but very interesting, and I was gripped. The interaction between Robin and his fellow soldiers was quite believable and entertaining, and the story about the English crown succession was also nicely done.<br><br>The entire chapter about Nottingham and its citizens is also at a nice and slow pace, but its never dull. Von sydow is a pleasure to see as usual, and both Crowe and Cate Blanchett delivers. You just sit and smile, when things suddenly goes very very wrong...<br><br>It starts when Walter Loxley explains Robins past to him. The scene is rushed and it seems a bit far-fetched. Also the following scene when robin goes to the meeting of the barons. Ridley must at this time peeked at his watch and noticed that he let most of the movie pass without telling much, and start to massacre the script.<br><br>The Nottingham action scene is where it's starting to go seriously wrong. You can't really get to understand how Robin suddenly is in command of an army, and speaking to lords as their equal. Especially when they call him by his common name in a scene later. The pace is really off here too... Action scene-Action scene-Short grief scene- Love scene- And on horseback against the French again in a 5min gap. Set in contrast to the feelgood mode you were in this is a very rude awakening.<br><br>After this you are handed a fighting scene that is absurd in every way. The landing craft is from WW2 (what possible use does the landing bridge have on these boats?). The battle is a slaughter, the French never stand a chance(not very interesting). <br><br>When suddenly Marion appears on the beach with the local teenage runaways on ponies I just shake my head... why?! It's just stupid?! Also they seem to be trained by ninjas and easily takes on trained French soldiers.<br><br>There is an ending after, but its thrown together in five minutes.<br><br>In one line.<br><br>This movie had a lot of potential, but it's thrown away on hasted parts and plain stupid scenes.","user":"logadof","rank":[441,528]},{"title":"A disaster of a movie","rating":3,"date":"15 May 2010","review":"I went to see Robin Hood with an open mind. I didn't read any of the reviews, I didn't watch any of the previews, and early on I thought that it was a pretty good film with a few loose ends that would surely be wrapped up by the ending. I was wrong. Nothing got wrapped up and there were so many plot holes and loose ends that left this movie a disaster of a film. Here are just a few examples:<br><br>1) Who are the kids in the forest with The Strangers masks on their faces? <br><br>2) What happened to Prince John's first wife? We see her looking through a keyhole at her husband in bed with another woman but that's it. John tells his mother that he has written to the pope seeking an annulment but his mother tells him that it will never be granted. So happened to her? <br><br>3) Early on, the priest who is leaving Nottingham to deliver the grain tells Marion Loxley that she can't have the grain because \"she reaps what she sows.\" What did Marion Loxley, other than conveniently leaving all her grain in a storage shed outside the main walls, do to deserve this \"reap what you sow\" punishment? <br><br>4) Robin comes to Nottingham and schemes with the Loxley's to pretend to be Robert Loxley who has been gone for 10 years. No one in the village catches on so we are to believe that EVERYONE in Nottingham either a) are new to Nottingham and didn't know Robert Loxley before he left or b) conveniently forgot what Robert Loxley looked like? <br><br>5) Robin tells us that his motivation for returning to England is to seek land and fortune. He's there to take advantage of the situation. Marion Loxley has him sleeping on the floor with dogs and they have no apparent relationship other than keeping up with the scheme that Robin is Robert Loxley. Why then does Robin go out of his way and risk life and fortune to help Marion get her grain back?<br><br>6) Robin gets the grain back and we see a small group of them casually tossing the grain around on the ground. When Marion Loxley wakes from her afternoon nap Robin tells her that her fields have been planted all 5,000 acres?? <br><br>7) If you want to remember forgotten things from your childhood all you have to do is close your eyes and vivid flashbacks will suddenly appear. <br><br>8) The French had landing craft Saving Private Ryan style in the 12th century? <br><br>9) We see an army of horsemen riding fast through the mountains to get to the beach to meet the French landing craft. Before they go down to the beach they decide the horsemen will ride to the beach and foot archers will fire from the cliff side. What archers? In the battle scene we see thousands of arrows striking down the French on the beach? Where did they come from because they obviously didn't ride in with the horsemen? Did they fly in on helicopters? <br><br>10) Before the battle on the beach against the French I thought, \"This is going to be a slaughter.\" It was. That is supposed to be interesting how? <br><br>11) Where is England's standing army? You know the tens of thousands of men in red uniforms with swords, bows and arrows, cavalry, pikes, and all that shiny equipment like we saw in the movie Braveheart? <br><br>12) We see Prince John an arrogant young man with a mistress in his bed early in the movie, then he confidently fires William Marshal and sets Godfrey off to the north with an army to collect taxes. Then when civil war \"unexpectedly\" sets off Godfrey is suddenly \"not the friend that he thought he was\" and John seeks to unify the angry mob because England conveniently doesn't have a standing army. Robin interrupts the meeting, gives a little speech, and they all ride off to war together. Then before the beach battle scene we see that John is useless because although he is suppose to be leading the army he doesn't know how to place the troops and instead relies on William Marshal to make a battle plan. In the battle we see that John is just a bumbling idiot, swinging his sword around randomly even after the battle is over. But in the VERY next scene we see that John is confident again, going against his word to sign the charter and declaring Robin to be an outlaw. Will the real King John please stand up? <br><br>13) Somehow on the battle on the beach, even though they were just fighting victoriously along side one another, we are supposed to believe that King John is jealous of Robin because the French surrendered to him? King John asks William Marshal, \"Who did the French surrender to?\" and William Marshal points to Robin. The thing is, it seemed to me that the French didn't surrender to anyone. The King of France ordered his boat to turn around so they could \"fight another day\". Was the whole \"they surrendered to Robin\" just thrown in to move the plot along? <br><br>14) How did King John determine that Robin was lying about his identity?<br><br>15) What is the motivation for the kids with The Strangers masks on their faces? Early on they are evil looking thieves who steal the grain from Marion Loxley but by the end of the movie they are little ninja warriors on ponies fighting not just alongside Marion, but being led by her.","user":"justin55839","rank":[322,461]},{"title":"The Legend rewritten to fit Star's Ego","rating":1,"date":"18 May 2010","review":"Robin Hood was an Outlaw in England. The idea that Robin Hood followed King Richard in the Crusades is from the Sean Connery movie \"Robin and Marion\". Robin and Marion was made in the cynical 1970's. Robin and Marion is not a movie that gets watched a lot (I wouldn't sit through it again) and it's theme didn't need to get expanded in to a two hour epic. The traditional Robin Hood takes place in England for it is the story of the British People Saxon's vs the Norman occupiers. Green is the symbolic color of the native people of Briton (e.g. Gawain and the Green Knight). The traditional Robin Hood of legend wore green for he is part of the pagan history of Briton, not some cynical inner city trendy who wears black. There is this idea that people in the past wore depressing clothing and were dirty all the time. Yet if you look at the paintings from the time of King Richard the first you will find that people wore bright colors. Only bums dress badly in any age.<br><br>If Christian Bale, Cary Elwes, Jeremy Irons, Johnny Depp, Robert Downey Jr. or Kevin Kline had played the part of Robin Hood we could have expected a more extensive range of emotions and with a better English accent. But Crowe has a limited range of emotions. Emotionally Crowe only does the self-serving stuff very well, you know; angry, self pity, prolonged contempt etc. Crowe is also very good at being \"intense\" which accounts for his screen presents and is often mistaken for acting ability. But the emotions required to do \"The Merry Adventures of Robin Hood\" are way, way beyond him. Being jovial, generous, good natured, romantic or even nice are outside his ability.<br><br>In the Errol Flynn version, Robin Hood is bested by Little John and comes up laughing at himself at having been beaten by another man. This sort of self-demeaning humor and good will are way off the chart for Crowe. Crowe doesn't do humble. The character of Robin Hood had to be retooled to be more like the Gladiator so that Crowe could play the part. So Robin Hood the cunning fox had to be changed to become Robin Longstrides the bossy grumpy bear.<br><br>Crowe can't do love or Romance very well. In Gladiator they had to cut love scenes out of the script. Crowe can only really do 'intense needy love' or 'self-pity mercy love' but not Romantic Love. To make matters worse Crowe hasn't held onto his youthful good looks in the ten years he's been a star he's really aged badly. Tom Cruse has been a star for almost 30 years still has his looks. As does Brad Pitt. Kevin Beacon who has been in the business for almost 35 years still has his looks. But because Crowe has let himself go so badly the part of Maid Marion had to be drastically retooled as well. The first Maid Marion Sienna Miller was fired from the movie because she looked too young and thin next to the aging and hefty Crowe.<br><br>The movie was shut down for two months and the part of Maid Marion was changed and rewritten to that of an older woman. Maid Marion became the Widow Marion (Cate Blanchett) and the romance became a marriage of convenience. Crowe can't do romance. Gone are the scenes where Errol Flynn and Olivia De Havillandand flirted playfully on screen. The unromantic Crowe doesn't flirt well and can't woo. His on screen romances have always been rewritten around this so that the woman does most of the work while he looks angry, confused and full of self-pity. In this case Crowe's Robin Hood doesn't really like Marion (anger) he's just doing a friend a favor by sharing her bed. It's hard to believe that Robin Hood spent 10 years in the army with surrounded by men and isn't attacked to Marion. But Crowe can't play \"attracted\" there's no self pity in it.","user":"deedeevolpe","rank":[146,204]}]