[{"title":"A Wonderful Surprise","rating":9,"date":"11 April 2008","review":"I wonder why this gem of a film was released in secret, at least in the USA. I was literally dragged to see it by some friends - to whom I'll be eternally grateful. The film lives on its own with glances to the great Jacques Demy. Rains and umbrellas, songs and impossible love. Louis Garrel must be, by now, considered one of the greatest film presences of the new millennium. He is devastating and his relationship with the doomed Ludivine Sagnier has all the warmth and sexiness of the great romances. The entrance of the adorable Gregoire Leprince-Ruignet takes all our preconceptions and turns them around. This sensual coupling full of innocence has the power to seal a tragedy with love. I adored this movie and the makers should protest vigorously as the way the film was distributed in the United States.","user":"hollyfairbanks-usa","rank":[98,104]},{"title":"A contemporary (timeless?) film about human relationships","rating":9,"date":"26 October 2010","review":"How to put into words a film with this sensorial density? It's clearly not the simplest task. \"Congratulations Christophe Honoré\" could be a good approach, maybe the best.<br><br>As a Portuguese, a traditional nation in the \"European standards\", I may say that this film surpasses my bounds when speaking of, let's say, \"relational experimentalism\". Even so, I found it astoundingly beautiful and I guess that picking-up the gay issue would be to diminish a film about life and what we make of it in our nowadays living.<br><br>To have lived in France for over a year, eventually helped me out to remark some interesting French particularities in the characters.<br><br>I found the humor in this film to be typically French. There's a scene were Ismael is Wrapping a pillow making a baby of it, asking everybody in the room to remain silent not to wake up the child that had just gotten asleep. Then, unexpectedly, he throws the \"baby\" right out of the window as he gets tired of the staging. This kind of uncompromising performances, risking the ridiculous, were undoubtedly a \"déjà vu\" for me.<br><br>The music is also a key element in the film and gives it a Parisian melancholical aura. The music is often used by 2 or more characters in the form of a dialog where they show their feelings and points of view. As they sing, the scenes are incredible well filmed either outdoor, in the endless avenues of Paris, or indoor in the cosiness of a warm bed in a cold winter night. Sometimes I felt as I was one of the characters right in the scene.<br><br>The anguish, the indecision and above all, the solitude are the marking subjects in a film that exposes in a crude manner how individualistic the society is becoming in France, and why not, in Europe.<br><br>It's a contemporary (timeless?) film about human relationships. In my opinion, the antithesis of the blockbuster cinema: The extravagance is replaced by beauty, the free nudity is replaced by sensuality and the easy laugh is avoided. The dialogs are intelligent, complex and they have ambiguous interpretation.<br><br>At the end of the movie, a phrase synthesizes it all: \"Love me less but for a long time\".<br><br>To assume the compromise revoking the emotional hurricane brought by fleeting relations will bring peace, at last.","user":"a25112","rank":[21,22]},{"title":"The Unbearable Lightness of... Life?","rating":9,"date":"12 December 2007","review":"I wish I could see this film at least another 3 or 4 times, before making this comment, but I can't wait telling the world (ah ah) how much I loved it! This film is a huge and wonderful homage to a great deal of things. 'Great things' such as love, life, death... and more 'minor things' (?) such as youth, friendship, music, Paris, actors and actresses, directors such as Stanley Donen, Jacques Demy, etc. And still, this film manages to stay incredibly fresh, new, full of veiled references (I couldn't help smiling with delight, when seeing Chiara Mastroianni under her transparent umbrella, a reference to her mother, Catherine Deneuve, in The Umbrellas of Cherbourg). And the film goes on like that, like on a tight rope, with actors perched on their frail voices, never ridiculous, always moving and/or witty. It keeps moving (never a dull moment) and it keeps moving you. Never vulgar, never cheap, never shocking. A marvel of lightness. Could it be the unbearable lightness of what we call life?","user":"Pasky","rank":[62,76]}]