[{"title":"Fantastic footage","rating":8,"date":"28 May 2008","review":"I went and saw this in IMAX 3D yesterday. The footage is spectacular and the 3D is the best I've seen. The music is also very serene. There is footage of several different species of water mammals (mostly Cetacea), including Humpback Whale, Beluga, Right Whale, Bottlenose dolphin, Common Dolphin, Manatee, and more. Daryl Hannah narrates the film and she does a great job. There is a little bit of conservation preaching that seems a little abrupt at the end, but not something that I am against. <br><br>Though this film is short, and perhaps not the most educational due to the brevity, it definitely provided a great IMAX experience.","user":"lydianali","rank":[3,3]},{"title":"He's no Jaques...","rating":4,"date":"23 February 2008","review":"Like the gentle giants that make up the latter half of this film's title, Jean-Michel Cousteau's latest production has grace, but it's also slow and ponderous. The producer's last outing, \"Sharks-3D\" had the same problem. It's hard to imagine a boring shark documentary, but they somehow managed it. The only draw for Sharks was it's passable 3D, which is always fun when dealing with wondrous worlds beneath the ocean's surface. But even that was only passable. Poor focus in some scenes made the production seems amateurish. With Dolphins and Whales, the technology is all but wasted. Cloudy scenes and too many close-ups of the film's giant subjects do nothing to take advantage of IMAX's stunning 3D capabilities. There are far too few scenes of any depth or variety. Close-ups of these awesome creatures just look flat and there is often only one creature in the cameras field, so there is no contrast of depth. Jean-Michel Cousteau is trying to follow in his father's footsteps, but when you've got Shark-Week on cable, his introspective and dull treatment of his subjects is a constant disappointment.","user":"sydneycook23","rank":[6,8]},{"title":"Impressive and relevant","rating":8,"date":"7 October 2017","review":"\"Dolphins and Whales 3D: Tribes of the Ocean\" is a 42-minute nature documentary from 2008, so this one has its 10th anniversary next year. It was directed by Jean-Jacques Mantello, who actually shot quite a few underwater documentaries in his career and as the title says the focus in this one here is on dolphins and whales. And it may be his best career effort so far. It has a very clean structure. You read the name of the species on the screen and afterward see video recordings while listening to the narrator provide some information. The narrator in my case, i.e. the German version, was successful actress Martina Gedeck, while audiences from the English-speaking countries get to listen to Daryl Hannah and Charlotte Rampling. As for Gedeck, I think she did what was necessary and overall delivered fine narration. The few moments where the texts get a little too poetic for their own good are nothing you can blame her for. Another minor criticism: The way in which the environmental message got rushed in near the very end was not too adequate I would say, but I guess it is still better than leaving it out completely. Other than that, I think it is a great success. The video footage is nothing short of amazing, the audio manages to be interesting and informative without ever getting too scientific or not scientific enough. I may be a bit biased as I am indeed a sucker for animal documentaries, but this little IMAX movie was really good and I think I am neutral enough to say that still as fish and underwater documentaries are frequently not as much to my liking as documentaries about prairie wildlife for example. But this one here is, even to a level where IO would say that this is at this point right now my favorite short film of 2008. Do not miss it. Final note: Manatees are the coolest thing ever.","user":"Horst_In_Translation","rank":[0,0]}]