[{"title":"The Fighter is a winner.","rating":8,"date":"23 December 2010","review":"The story of Micky \"Irish\" Ward and his boxing career with his crack addicted brother at his side. Apparently Marky Mark was so hell bent on getting this film made that he stayed in \"shape\" for years and years just in case the film went into production. That's dedication and passion for you, yet the man still manages to be the weak link. <br><br>It's not really his fault, David O. Russell packed the film with a lot of talent. Christian Bale plays Dicky Ecklund, Micky's crack addicted brother who tells the same story over and over again, about him knocking out Sugar Ray Leonard. It's his claim to fame. There is a film crew following him around, he thinks it's going to be about his comeback, yet it's really about the harsh realities of crack addiction. Bale, again, submerses himself in the role. He is pure method. You can not like him as a person, or even an actor, but you can't deny his passion for the art. He is on the thin side again, with thin balding hair and brown teeth. He looks deathly ill in every scene. The man has one of his finest roles to date and will no doubt be nominated come award season. I hope he actually takes home the award. He is without a doubt, the most interesting character in the film. <br><br>Their mother is played by Melissa Leo, another performance worthy of recognition come award season. Her desire to see her kids rise to fame blind her from the truth. She denies the drugs and the failures and believes she knows what's best for her kids. This means not letting them get a real chance because it would be with a real manager and she would be left behind. Family is important to her and she wants to keep everyone very close, even if it harms their chance at making a name for themselves. She of course, doesn't realize this. Amy Adams is the love interest, you know there had to be one. She manages to pull Micky away from the family that is dragging him down. They don't like her for it. She has her own inspirations too, yet the story isn't interested in them. The main focus of the film is with Micky's bumpy road to the championship fight. Since this is based on a true story, I can't really fault it for becoming a bit formulaic and predictable, yet it is. <br><br>David O. Russell is notorious for getting angry and violent with his crew/cast. He was in a physical fight with George Clooney on the set of Three Kings and anyone can go on youtube and check out the melt down he and Lily Tomlin had on the set of I Heart Huckabees. Both films coincidentally star Mark Walhberg, so it seems he doesn't have a problem working with the combative director. I can't deny that the man has talent. I really love Three Kings and found I Heart Huckabees to be an ambitious project for the sheer weirdness of it all. With The Fighter, he plays to a more conventional audience. In terms of boxing films, it works. It plays on the down and out character, the poverty of his life and the sheer determination he has to make a name for himself. It's no Rocky, or as others have mentioned Raging Bull, but it is good enough to be mentioned with them.<br><br>Russell always has an eye for a creative shot. Check out Three Kings colour scheme for what I mean. Here he uses TV cameras for the boxing matches. Interesting move, it feels like we are watching it at home and are not really in the ring with them. I admire directors who think outside of the box. Russell does this, no problem. He also decides to include real footage of the characters. The film has some home video segments throughout and during the credits we get to meet the real Micky Ward and Dicky Eckland, which is even more reason to appreciate Bale's performance. <br><br>The film trips a bit because of the lack of emotion from Walhberg. I dig the guy and enjoy his films, but his range isn't there yet. When given a role that he can play the absurdity of, he scores. Watch The Departed for that. For a film where the audience needs to get behind a character, to root and cheer for them to overcome their obstacles, he falls a little short. Thank goodness the film makes up for this with the performances from Bale and Leo.<br><br>The Fighter features great music, engaging performances and a predictable, yet true story. I felt attached to the characters and hoping they would make smart decisions. If a film can get me to care about the characters, I say bravo. <br><br>The Fighter is a winner in my books.","user":"Matt_Layden","rank":[81,94]},{"title":"Wahlberg's Corner","rating":9,"date":"28 December 2010","review":"In many ways, \"The Fighter\" is the film of 2011. A family drama with a pugilistic background. The punches, physical and emotional in and out of the ring took me completely by surprise. What didn't surprise me was Mark Wahlberg's signature all over the place. Let me explain: Many years ago I was at a lecture by director Martin Donovan when during the Q&amp;A somebody made fun of the fact that Calvin Klein underwear model Marky Mark had played a part (his first acting role) in Donovan's made for TV \"The Substitute\" Donovan with elegance, wit and firmness destroyed the guy asking the question, describing Wahlberg's strengths and ended up saying \"Mark Wahlberg will be one of the top actors around and he will probably be running Hollywood within a decade\" I had Donovan's words buzzing in my ears when I sat speechless watching \"Boogie Nights\". Wahlberg also produced \"Entourage\" and the startling \"In Treatment\". He now produced \"The Fighter\" and his performance, interior and powerful, dominates the film allowing other members of the cast, to shine in truly showy roles, Christian Bale for instance - really good. Melissa Leo is a stand out as the mother/manager. Superb. So I won't be surprised to see Mark Wahlberg receiving the top honors at the next Academy Awards, as an actor and producer. He certainly deserves it. Bravo!","user":"littlemartinarocena","rank":[206,256]},{"title":"Supporting Roles stole the limelight","rating":7,"date":"15 March 2018","review":"This a great American family drama movie. Shows the ups and downs of a big crazy family with 2 boxers in the family. The big ''legend'' Bale and his young brother Wahlberg. This story is about how the younger brother who looks up to his crack addicted older ''legend' brother for guidance and advice, has to turn away from him and his toxic family to succeed in his boxing career. <br><br>It shows the struggles of a young fighter as he attempts to turn his life around after always living in the shadows of his brother. How he faces dilemma's when confronted with his family and newfound love interest (amy adams) about what is good for his career. <br><br>Walhberg does a good job with his role but the supporting cast take the cake. Bale, Melissa Leo and Adams all acted incredibly and are worthy of the awards. This just shows how well acted this whole film is.","user":"CarpeDiem12","rank":[9,9]}]