[{"title":"The Movie and the Case","rating":9,"date":"22 June 2010","review":"I think there are two distinct cases to discuss: the case in the movie; the case about the movie.<br><br>The case in the movie: it is 1964 and in a Catholic school in Bronx a conflict erupts between the principal (Meryl Streep) and the priest (Philip Seymour Hoffman). The principal is Sister Aloysius, a nun very strict about the discipline. The priest, Father Flynn, is just the opposite, a very natural guy, open to people and to the world. The nun suspects him of pedophilia. The suspicion will never be confirmed, never thrown away. Eventually it's up to us to decide, and our role of spectators is played in the movie by Sister James (Amy Adams), a younger nun who is trying to understand what really is, oscillating between the two. By the way, genial idea of using male names for the Catholic nuns, to stress out the strictness of their rules.<br><br>The case about the movie: the epoch Doubt was made and the epoch the picture takes place are very different. The sixties were the years of Vatican II; the Catholic Church was opening largely its windows. It was the conflict (often brutal) between new and tradition, between progressives and conservatives. This was then. Today the Church is facing the scandals of pedophilia (and the way they are handled by the Catholic hierarchy).<br><br>So, if we take the epoch of the sixties, we take the side of Father Flynn, a man open to modernity, empathizing with the youth, with their questions and their way of seeing the world, speaking the language of his epoch, a wonderful man suspected by a retrograde nun.<br><br>Only the movie is made today, for today's viewers, and we are focused on today's issues. So here is the question: once the nun had suspicions that the priest was a pedophile, what was the right way to take? To not follow a case without positive evidence? Or, by the contrary, to follow the case, to force him to come with proofs of his innocence? What was more important: his right to privacy or the safety of the boys? We can say that the movie leaves the case open. Nothing demonstrates positively that the priest is a pedophile; nothing demonstrates that he isn't.<br><br>Well, the movie brings something more: what if? What if the boy is born with another orientation and the priest is just understanding and protecting him? Maybe just because the priest has the same orientation? There is a key scene in the movie, the discussion between Sister Aloysius and the boy's mother (wonderfully played by Viola Davis), leading to an unexpected outcome.<br><br>And I think here is the doubt the movie is putting forward: more than the doubt of Sister James (is Father Flynn an abominable pedophile, beyond his openness?), more even than the doubt of Sister Aloysius (was she right in following a man without positive proofs?), there is the doubt of humanity. Human behavior is complex, each human case is unique and cannot be assimilated to a general pattern. Things aren't every time what they look like, we should always consider this question, what if?","user":"p_radulescu","rank":[62,76]},{"title":"To Doubt Is Human","rating":8,"date":"22 December 2008","review":"\"Doubt can be a bond as strong as fear.\" If ever there was a time in our country's recent history where that line carried the force of relevance, it's now.<br><br>And though it's set in the early 1960s (roughly a year after the Kennedy assassination), there's no doubt that John Patrick Shanley's adaptation of his own Pulitzer-Prize winning stage play is a response to these dark times, when the only thing that seems to be uniting Americans is their collective insecurity and ever-weakening belief that things are going to get better.<br><br>At the center of \"Doubt\" is the mystery of whether or not a priest (played by Philip Seymour Hoffman) is guilty of taking advantage of an altar boy. The priest's primary (and really sole) prosecutor is Sister Aloysius, the uber-stern and terrifying principal of the Catholic school that provides \"Doubt\" its setting. Watching Hoffman and Streep spar is like watching two professional tennis players at their best, and fans of expert movie acting should waste no time in seeing the sparks fly between these two. The movie purposely never clarifies the ambiguity of the charges -- is Hoffman's priest truly guilty of something, or is Sister Aloysius simply on a mad witch hunt? Streep's character is the most fascinating. From one perspective, she's a nearly maniacal harpie, intent on ruining a man's life and career for no clear reason. However, if her accusations are legitimate, she's a sort of hero, demanding justice from a male-dominated world that's willing to look the other way. Streep's performance is something fascinating to behold -- she can convey more with an arched eyebrow than another actor can with his entire face.<br><br>Amy Adams gets the pivotal role of a young, innocent nun who first brings her suspicions about the priest to her superior, and then sees them become Frankenstein's monster. In many ways, Adams' character is us, the audience, placed in the position of having to come to a conclusion on our own when empirical evidence is lacking. Adams' role is the least showy, but she does much with it.<br><br>And then there's Viola Davis, who, in five minutes of screen time, decimates the audience with some shocking conclusions of her own as the altar boy's mother. The insulated, hushed world of the Catholic Church is blown wide open by this struggling mother, who's seen more of the world than any of the priests and nuns sheltered behind the church's walls, and who puts the film's running themes of racial and gender inequality into harsh perspective.<br><br>The central conflict in \"Doubt\" in many ways comes down to each individual's view of the world and his or her ability to accept the ambiguity of day to day living. There's a lot about the world we will never know and much about our futures we'll never be able to control. So what's better -- anticipating the worst and therefore being prepared when it comes; or believing in the best and running the risk of being disappointed when it fails to arise? The movie just poses this question -- it doesn't try to answer it. <br><br>\"Doubt\" is not a fancy movie and will win no awards for its cinematic audacity. But in looking back at the movies of 2008, I imagine it will stand as one of the best-acted films of the year.<br><br>Grade: A","user":"evanston_dad","rank":[211,297]},{"title":"American Film's heavyweight acting champs square off.","rating":8,"date":"29 December 2008","review":"There are no better actors working in American film today than Meryl Streep and Phillip Seymour Hoffman. Streep has been on top for some time now and Hoffman has an unmatched resume of fine performances over the past five years. Pairing off as adversaries in John Patrick Shanley's stage play brought to screen they parry and prod throughout with each landing hay makers along the way.<br><br>Change is in the wind in 1964 for both the world and the Catholic Church (Second Vatican Council) as the country moves from conservatism to liberal thought. Sister Aloysius (Streep)is the principal of an inner city Catholic school who rules with an iron fist. Lamenting the loss of tradition (she thinks Frosty the Snowman is a song about worshiping false idols) she crosses swords with the popular and laid back Father Flynn who takes a more liberal view seeing the need to keep up with the times. His progressive ways gnaw at Sister Aloysius and she is soon suspecting Father Flynn of inappropriate relationship with altar boys even though she is without concrete proof.<br><br>The scenes between Streep and Hoffman are riveting from start to finish. Both attempt at first to be civil with each other but eventually they end up at each others throat bullying and threatening. It is a titanic emotional struggle that makes for a gripping drama flawlessly acted. I'm no big fan of Streep, finding the adopted accents she employs in some of her films false and hollow, but as the self righteous Nunzilla her pugnacious style and inflection rates with her Sophie's Choice performance. Hoffman has his work cut out for him to keep up with the formidable legend but he holds his own with equal footing.<br><br>In supporting roles Amy Adams is very effective as the unintended go between Sister James. Seized with doubt she like the audience mirrors our own misgivings as conflicted objective observers. Viola Davis as a troubled boy's mother has one lengthy powerful and painful scene that begins to tie loose ends together but offers no easy solution.<br><br>Writer director John Patrick Shanley does an admirable job in keeping the plot nebulous with ambivalent scenes and peripheral characters that purposefully enhance the suspense. Scenes are tightly edited with sparse but effective dialog giving the film its steady pace. Other than some jarring oblique angle shots the camera compositions and set design provide a somber ambiance for the drama and an arena for the perfectly measured performances by two masters of the craft in this fight to the finish that remains absorbing from beginning to end.","user":"st-shot","rank":[169,236]}]