[{"title":"I thought it was cute","rating":6,"date":"19 January 2008","review":"My friend and I were looking for a movie to see this weekend and Mad Money was the only movie that looked like fun. When we finished the movie, the audience was happy and we were happy, this was a fun and cute movie. So I have to say that I am very very surprised by this harsh rating on IMDb, I mean, a 4.4?! You have got to be kidding me, this is by no means movie of the year, but for what it was, this was just a fun comedy to watch. There wasn't any major problems with this movie that deserves that kind of a rating that makes it look like the first major flop of the year. Diane Keaton, Queen Latifah, and Katie Holmes were absolutely adorable together and had great chemistry. They made the story an Oceans Eleven for the girls, sounds like such a chick flick, but I think this is one that most could actually enjoy.<br><br>Bridget and her husband, Dan are in major debt, really bad debt, like 282,000 dollars in debt. They are about to loose everything they own, so Bridget gets a job as a janitor for the financial bank. When she notices the ultimate torture of how they shred worn out money, she gets a clever idea with the help of two other girl employees, Nina and Jackie, to find a way to break the system and get that money to get out of their poor situations. Once they get what they need, Bridget is so satisfied with how smooth everything went, she wants more and they go for it, but they should learn not to get so greedy since someone is on their tale.<br><br>Mad Money is a chick flick, but it's one of the rare one's that I liked. I didn't think there was anything wrong with this film. I think they could have explained the situation with the boss of the bank a little better, I don't know if he was in on it or what, but it's something that could slide I think. Queen Latifah was just so funny and Diane Keaton was a perfect choice for Bridget, Katie Holmes was pretty decent for the comic relief. Please don't take the rating on IMDb seriously, I think that Mad Money was just a fun little comedy that deserves a better chance.<br><br>6/10","user":"Smells_Like_Cheese","rank":[83,112]},{"title":"Interesting Idea for a Financial Stimulus Package","rating":7,"date":"19 January 2008","review":"\"Mad Money\" has reasonable entertainment value, great characters, and even a nice little unexpected twist at the end to satisfy the escapist movie-goer. The essential plot of Mad Money is not that original as heist movies go. The formula usually goes something like this: the characters are in a bad financial or similar situation, they find out about some booty supposedly completely unobtainable, devise a scheme to lift the booty which has some intriguing element(s) to it, and then go about getting the booty. Along the way there are some twists and turns to keep it interesting. If it's too easy, it won't work. Part of the fun is whether or not they will get away with it, and how they will do it. Heist movies are almost a dime a dozen these days, with fair such as \"Oceans 11\" (both the old and the new versions), its subsequent sequels, \"Heist\", \"The Score\", etc.<br><br>What gives \"Mad Money\" a unique flavor is the characters who enact the heist, essentially the Neapolitan kind: vanilla, chocolate and strawberry. Most Hollywood heist movies star middle-aged men devising elaborate schemes requiring PhD's to perpetrate the heist. In \"Mad Money\", the team of schemers are three women working at below-sea-level jobs at the Federal Reserve building: a white grandmother of the upper middle-class variety (Diane Keaton), a middle-aged African-American single mother trying to stay above water (Queen Latifah, who actually stuffs packs of bills into a large shredding machine), and Katie Holmes as a 20-something scatter-brain who will probably lose the better part of her hearing by movie's end. How Holmes ever landed a position at the Federal Reserve is one of the many intriguing mysteries of the movie. A rather unlikely swashbuckling gang of hoodlums who sport wash cloths and garbage bags instead of swords.<br><br>Keaton and Latifah have the most at stake in their interesting idea for a financial stimulus package: to lift ragged and torn bills from the Federal Reserve before they are about to be shredded. In other words, stealing money that really isn't money. However, I wouldn't try this at home. Year-round, the Federal Reserve acquires tons and tons of ragged and worn bills from banks and other large financial institutions and swaps them for new crisp clean bills. The ragged bills go by way of the shredding and pulping machines. <br><br>How they pull off the heist sort of works, although it does fray into a little bit of the fantastic as stealing from a Federal Governmental agency like the Federal Reserve is sort of akin to trying to raise the Titanic. It probably ain't gonna happen. However, a unique chemistry between the actors somehow makes the movie work, and the writers took the story seriously enough to give a lot of unexpected laughs, the way comedies of this type should be written. In other words, luckily the writers didn't try to make the movie \"funny\".<br><br>On a final note, the outstanding talent of the cast has to be Queen Latifah who does an excellent job of portraying a single mom who wants the booty but has ambivalence about the entire scheme. In fact the entire cast is excellent, with Diane Keaton believable as the guiding force behind the heist, and Ted Danson as her bewildered husband. My only criticism is that I would have liked a little more of a hint regarding the twist at the end which did come out of left field. Enjoyable and worth the price of admission, although I doubt I will shell out another 20 bucks for the DVD.","user":"classicalsteve","rank":[48,72]},{"title":"Underrated heist comedy","rating":7,"date":"5 August 2008","review":"Directed by Callie Khouri (best known for writing the famous Ridely Scott film \"Thelma &amp; Louise\"), Mad Money tells the story of three women working at the Kansas Federal Reserve Bank (though the movie was shot in Louisiana) who work out a system to steal money that is about to be shredded. Obviously, stuff happens.<br><br>Mad Money is far from being the best heist film out there. Recent efforts such as After The Sunset, The Italian Job, The Thomas Crown Affair, Entrapment or The Ladykillers are all much cooler. But just as Steven Soderbergh's \"Ocean's\" series is extremely overrated, this widely panned film is quite underrated. Actually, though it is central to the plot, the movie doesn't really focus on the heist element that much preferring to stick with character interactions and light comedy. Here also it's far from the funniest movie out there, but the humor is pleasant and harmless.<br><br>The acting is pretty good all around. Diane Keaton is certainly better here than in her horrible performance in the previous year's Because I Said So, and while some may find baffling that Katie Holmes chose this over The Dark Knight, she certainly does a better job here at playing a ditz than her uselessness in Batman Begins. Who knows? Maybe she just doesn't like Batman, maybe she wanted a role that would center more on her, maybe she just loves Thelma &amp; Louise and is willing to have a lower paycheck, which, being married to Tom Cruise, she can totally afford to do. Queen Latifah is her usual self and it's always cool to see Ted Danson and Christopher McDonald (even if it's little more than a glorified cameo).<br><br>The movie has flaws yes, and shouldn't really show up on anyone's top 10 or top 200 list. The flashback narration doesn't really work that well and the ending is pretty ludicrous, but what the hell it's just a movie folks. I don't think anyone involved in the making of Mad Money declared that this movie will radically change your views on life. It's just simple harmless entertainment, something pleasant to watch if you stumble upon it.","user":"Happy_Evil_Dude","rank":[19,26]}]