[{"title":"I Enjoyed Sucker Punch","rating":22,"date":"22 September 2019","review":"It had several elements i look for in films: entertainment, amusement, something different, visuals and of course an interesting character.\nIt does not hurt that the main actress was an eye candy and flaunted a pretty body (yes, I am male), but she was interesting and her various narratives and sequences were each done with the viewer's interest in mind.\nThis was better than Jumanji by far as far as story and visuals even though that is the more famous video game movie.","user":"tremoncyprian","rank":[47,53]},{"title":"Just like Stanley Kubrick's ''Eyes Wide Shut''","rating":9,"date":"30 August 2018","review":"Don't look at the movie the way it is. You can hate it for whatever reasons you like but this movie isn't just stupid, soulless and pointless sexual fantasy. There is more thought put into it than you could ever imagine. Too bad critics panned the movie for the things that couldn't comprehend and the audience went with it.<br><br>The whole thing is a big fantasy that does not exist or happening in the real world. The movie is actually about Sweet Pea(Abbie Cornish). She is the star of the show. Snyder made that very clear from the start. Babydoll(Emily Browning) is a figment of Sweet Pea's imagination. She is the physical embodiment of Sweet Pea. She is the 5th thing. She is the guardian angel that Sweet Pea created to deal with her trash life. The entire film is a reflection of the internal struggle of Sweet Pea. That's why she is the one who's narrating the film. The stuff that we've seen with Babydoll during the first act, that's all Sweet Pea acting out her past trauma in her mind, just as she was taught to do in the mental institution. That's why the movie opens on a stage that direct parallel to how Sweet Pea is acting out that same trauma on a stage when Babydoll first arrives in the mental institution aka the theater. After that, the lobotomy comes, the key to everything that happens in the movie. Reimagined through Babydoll perspective, Sweet Pea disassociates from reality when the needle plunges into her brain, retreating into her mind in the same way she's taught to by Dr. Gorski. She's not in the real world anymore. This is also what happened in Sweet Pea's real life. And the effect of that lobotomy is the goddamned movie. Yes, this movie is the result of a lobotomy. Just one big subconscious coping mechanism for Sweet Pea to find peace. And this girl is able to interrupt the lobotomy, intruding on her own story. She's even able to repurpose the accidental killing of her sister into a deliberate and necessary sacrifice on her sister's part to save her. In this second layer of fantasy, Sweet Pea imagines herself and the rest of the girls working in a brothel, objectified and lusted after by an audience. This mirrors us tuning in to see these girls perform for us in various outfits. This connection is made clear from the opening of the film, which lets us know that we're the audience watching all this unfold on stage. By choosing to watch the movie, we are complicit in everything that's happening. Of course, this doesn't mean to condemn you for wanting to see nubile girls kicking ass. What this movie is really about is the difference between empowerment and exploitation. This is represented through three layers of fantasy, first was the mental institution, second is the brothel, third is the fantasy-action scenes, each exploring a different set of social values, each aligning with different phases of the feminist movement. First up is a grim incarnation of the '60s -the mental institution- set during the second wave of the feminist movement, when gender inequality was much more widespread. That gender inequality is amplified in the second world -the brothel- which takes us back even further, to a time when women were literally treated like property. And finally we have the pop culture world -the world of today, action scenes- which imagines Babydoll's dancing through various aspects of modern geek culture, dressing the girls up in all the typical fetishistic attire we've come to expect video games, TV, movies, etc... Sweet Pea is aware of how sick this is and rejects that Baby Doll's dancing could possibly be empowering. It's only through seeing its effect on men does she start to see how much power they really have, as the girls start taking back the control they've lost by using men's objectification of them to their advantage. By embracing their sexuality instead of fearing it, they learn that their inherent femininity can be better used as a means of holding men under their sway. Suddenly, it's the men who become helpless instead of them. Point being, men may be in a position to physically overpower women, but women have the power to psychologically overpower men, thus inverting history's long-standing power dynamic between men and women. This is then mirrored to very much the same effect in the action fantasy scenarios - a symbolic gesture on Snyder's part to show women taking back geek culture, which men have been dominating with their boy club mentality and pervasive misogyny for far too long. This is demonstrated further once we cut back to Babydoll's lobotomy after Sweet Pea has found peace. While Sweet Pea busy imagining that she's taking the magic school bus to a better world, Blue has plans of his own. But its no use, she's already escaped, even if it's only mentally. Sweet Pea sacrifices her body -Babydoll- and retreats into the comfort of her own mind, a paradise over which nobody has control of but her. Blue may have control over her body, but without her mind, he has nothing. The importance of this is also apparent during Babydoll's encounter with the High Roller, who recognizes that the choice to truly be with someone lies with you and you alone. As the scene with the High Roller reaffirms, the distinction between exploitation and empowerment all comes down to personal choice. And that is just half of the point this movie trying to make. Women deserve just as much control over their bodies as they have over their minds. You can interpret this movie so many ways, it's beyond belief. It gives you so many options to think. It's really funny that the one who made this kind of a movie and the one who is trying to defend it is a male. But it is what it is. If this movie made by someone like Stanley Kubrick, probably everyone would have tried to decipher the depth of it and wouldn't have even minded the bad reviews.<br><br>It's really sad that people turn off their brains and see everything literal, and never uses their brain to read the images that appear on the screen when they see a Snyder film.","user":"nothimme","rank":[243,299]},{"title":"Not What You've Heard","rating":10,"date":"5 April 2011","review":"In a world filled with mindlessly violent movies and flimsy plots with practically nothing to substantiate the actions of the characters, I went into this movie looking for mindless violence and girls-with-guns escaping reality and an asylum and not much more.<br><br>What I found instead was apparently missed by a lot of other people out there. I read reviews that said this movie was soulless and pointless sexual fantasy. I don't know what movie they sawbecause that wasn't this movie.<br><br>This movie wasn't about a girl escaping reality by setting up a fantasy within a fantasy and using those fantasies to escape an institution in reality. This movie was about a young woman who had accepted a hopeless fate, but is saved by someone she eventually calls an angeltold from the angel's point of view. This is not Babydoll's story. Yet she still brought down the beast.<br><br>This movie was not about a boy's fantasy about girls in short skirts and fishnets holding big guns and a really cool sword. For one thing, boys tend to like bloodshed. Girls tend to like looking awesome. (Please note, I am using the phrase \"tend to like\" on purpose. I do like bloodshed on occasion and I am a girl. I know those of the male set of the species who also like to look awesome. I'm making a separate point here.) There is very little bloodshed in this movie. The steam-work soldiers did not bleed. They're already dead. The other creatures, the robots, the dragons There's practically no blood shed within the fantasy. There is a highly sexual look to the movie. Babydoll is sexually objectified by her stepfather and the orderlies and the guards. Is it any wonder that her first reality-escaping-fantasy is a brothel? And then, within that fantasy, she uses her ability to dance provocatively to render the men motionless, thoughtless, and incapable of noticing anything else around them. It's called a power trip. Every woman wants to be sexy. Every woman wants to be that capable of holding every man's attention that completely. It was Babydoll's way of using that sexual objectivity as a weapon. And that weapon carries into the next level of her fantasy, becoming a handgun with cartoonish animal charms dangling - taking a weapon and adding a distinctively feminine touch to it - and a really sweet katana engraved with intricate and delicate designs.<br><br>This movie was about heroes and self-sacrifice. It was not about women in lingerie holding weapons. It was about using everything you have to fight for freedom - and that your freedom is not the only freedom worth fighting for. This is not Babydoll's story. It may not be yours. But it's still worth telling.<br><br>Oh yeah, and one more thing: If someone fights for your right to breathe free, fight for the next person's right. You won't know whose story this is until the end.","user":"imaniac","rank":[270,355]}]