[{"title":"Easy charming fun - perfect summer fare","rating":8,"date":"16 July 2010","review":"The same people who to me are surprisingly rudely negative about this film would probably say I'm too easily pleased, but I enjoy movies as escapism for the most part and see no need to pick this very enjoyable vehicle to death. Actually, some early negatives I'd read had me worried that I would be irritated I spent the money, instead I've already decided to buy this when it comes out.<br><br>Overall, I'd say if you like romping easy movies like The Mummy, National Treasure, and Lake Placid you'll like this, plus refreshingly (without being sickeningly sweet) there is not one swear word or sexed-up scene, so take the older kids and Grandma. I thought Nicolas Cage was excellent, he looked great and can wear a leather duster better than most, and there was some nice chemistry between Cage and Baruchel. Alred Molina looked like he was having fun and is such an enjoyable villain. Baruchel does a good job - he is so geeky at times it is a tad painful - and I found myself rooting for him. The 2 main female characters are lovely and appealing personalities.<br><br>More pluses: A lively pace and I never lost interest plus a fair number of laughs. Some interesting character twists with the oily young rock-star magician helping Molina, and some very funny cheeky nods to the original animated Fanatasia - watch for the nod to Star Wars. Great and interesting special effects that made sense when they were used. Even the way the actors moved when they were doing magic was very good (for some reason the wand-waving in Harry Potter sometimes reminds me of people using a flyswatter or shaking a bug off a stick, that didn't happen in this film).<br><br>So no, this isn't some classic of cinema, it is what it is and is a bit thin here and there, but it's also quite good for a \"magical romp\" and is in no way a bad film or a waste of money. I could have done without the occasional background songs which seemed designed to emphasize romantic angst or appeal to young teenagers, but that was bearable. I saw this at an early evening show and there were not many people in the theater, but we all laughed and there was applause at the end, and we left the theater smiling. Personally I think the critics panning this are full of BS or are trying to prove what intellectuals they are. In the meantime see this with your family or take your friends, and then go out and get some ice cream and sit outside and enjoy summer. Hope they make a sequel, too.","user":"archravenstorm","rank":[188,238]},{"title":"Fun","rating":8,"date":"25 July 2010","review":"Dueling sorcerers, a compelling back-story, top-notch acting talent, and the Disney brand bring the idea born of Fantasia's Sorcerer's Apprentice to the big screen in a live full movie adaptation. While this film did not fully live up to its potential, it is a fun movie which will find its way into the collection.<br><br>This is silly and sappy just like any other live action Disney movie, and if allowed, will worm its way into the heart in a disingenuous way. If you view this film expecting Casablanca or the Godfather, you WILL be unimpressed. But if you go in expecting to be entertained, you shouldn't be disappointed.<br><br>The action sequences between Cage and Molina aren't elevated as much as many would expect, due to the story centering around the kid's battle, not Balthazar's. This is another standard Disney formula wherein the kid is undeserving, unprepared, and uneducated in the ways of the Samurai but is thrust into the center of the fray, regardless. Those who would rail against this formula, obviously weren't there to see a Disney movie.<br><br>All in all? The five of us ranging in age from 45 to 15, loved it. It is clever, and creative, marrying the science of magic known by today's standards with the arcane stories of our past. I found it intriguing and adventurous enough not to be preachy, while still managing to educate even the most unwilling movie goer.<br><br>It rates an 8.4/10 from...<br><br>the Fiend :.","user":"Elswet","rank":[110,146]},{"title":"Great fun, cynics need not apply","rating":8,"date":"17 July 2010","review":"Jay B. is funny and charming in a believably nerdy fashion; Cage is at his quirky but charismatic best; the effects are plentiful and top notch; there's both a tragic love story and a young cute one plus a healthy dose of clever references to Disney's epic Fantasia (from which this film is partially inspired). If you read this list of attributes and it caught your interest and like the idea of centuries old sorcerers doing battle across New York in spectacular fashion then it wont matter what any other review says, you're going to want to check this flick out. It's funny, the cast is likable and there's a freaking dragon tearing up Chinatown (and that isn't even the finale!). On the other hand if all of this made you cringe, well nothing is going to persuade you to see it either. The truth is SORCERER'S APPRENTICE is fairly predictable, and the opening few minutes suffer a great deal from a completely distracting (and not needed) bit of narration but it is also solid matinée fun that I know I (and apparently the theater of folks I saw it with) really enjoyed.","user":"supercygnus","rank":[99,134]}]