[{"title":"There really isn't a whole lot to say about this other then it's worth a watch but probably only once.","rating":5,"date":"29 December 2014","review":"\"Why would a best selling author go into hiding?\" When a motivational book takes the world by storm. An actor, convict, mobster, and a rapper all swear by the book. Everyone is trying to find out just who the mysterious writer really is. Teddy (Berenger), the author has gone into hiding. When young reporter Roger (Astin) finds him he is the one that tries to motivate Teddy to revel himself. This is a pretty decent movie but there were some flaws in it. First of all there really isn't a standard plot in the movie. This is a movie along the lines of Crash, or the recent Third Person where there are many different stories going on that end up connecting in some way. I did think the movie was OK but it never really grabbed me and made me totally engrossed in it. Stallone really steps out of his comfort zone in this and while not terrible I can see why he sticks to action movies. There really isn't a whole lot to say about this other then it's worth a watch but probably only once. Overall, a movie with a great cast that was just OK. I give this a B-.","user":"cosmo_tiger","rank":[13,18]},{"title":"Intrigueing turns into giant yawn.","rating":3,"date":"2 December 2014","review":"This movie had me very intrigued at first as I was trying to figure out the characters and I really thought there would be much more to this. Then eventually I started to notice many inexplicable events throughout the movie and that is when I realized that the movie itself was going nowhere and had no real, deep meaning whatsoever. When Teddy is giving his speech at what is falsely portrayed as Redondo pier he begins reciting absurd platitudes in the background and talking about the basic fears of all people (i.e. fear of going to prison). The entire movie is nonsense and about nothing. What really bothered me was when they kept referring to Redondo Beach and showing Venice Beach. Note to Hollywood - We do not have homeless people digging through trashcans in Redondo Beach.","user":"chrismiller88","rank":[27,43]},{"title":"Reaching Rock Bottom","rating":1,"date":"8 January 2016","review":"'Reach Me' exemplifies the potential pitfalls of a vanity project. Financed by crowd-funding, this mess of a movie demonstrates how producers and bean-counters can prevent an egotistic writer/director from delivering a self-indulgent, audience-tormenting fiasco. Ostensibly the film relates how an inspirational self-help book by a reclusive author affects the lives of a collection of individuals. Unfortunately the platitudes of the fictional book and the embarrassing final product reek of complacency and the loss of critical faculties.<br><br>Only dope-addled stoners will be able to perceive any coherence in the muddled plot. In addition, most of the characters possess annoying personality traits, and the script obliges them to act out endless sequences of scenes depicting imbecilic behavior. Hopefully the film's brutal rejection by distributors and the public has been a sobering experience for those who conceived the idea, donated their hard-earned cash or allowed themselves to be flattered into participating.","user":"tigerfish50","rank":[11,17]}]