[{"title":"Home is not where the heart is","rating":6,"date":"5 May 2011","review":"Christopher Rocket (Jimmy Fallon) returns home after news that his father is dying. Home is Florida, where he was raised by his emotionally-abusing, distant and womanizing father (Tom Arnold) and his soon-to-be-hippie and emotionally-abused mother (Sharon Stone). Home is not where the heart is.<br><br>We have many flashbacks of the out-of-whack dynamics of Chris's childhood. Most of which weren't need, primarily because these are good actors, so we only needed a scene or two to see that Chris never got the love and support that he should have.<br><br>Chris as an adult is an emotionally-distant and cynical young man. His beautiful girlfriend Anne (Lucy Liu), beautiful on the inside and out, thinks he can grow up, accept his parents and then enter into a mature and committed relationship with her if he has a heart-to-heart with his father in the hospital. You know, the father who's in a coma and the one who has never said a meaningful word to his son in his entire life - oh, how naive some supporting characters can be. The almost brilliantly funny scene of Chris attempting a conversation with his father in the hospital only landed him in jail. Maturity will have to come later.<br><br>This is Jimmy Fallon playing a very sullen man in a drama-comedy that is mostly drama. Almost completely drama with a lot of slow scenes building up to emotionally-abusive results which we already knew from previous slow scenes building up to emotionally-abusive results. These struggles with maturity have been seen before, either in other dysfunctional family dramedies or in the first few scenes or trailer of this film since they didn't have too much more to add, but \"The Year of Getting to Know Us\" is a pretty good film, well acted and with solid characters.","user":"napierslogs","rank":[4,4]},{"title":"Very Good Film. Vintage Sharon Stone","rating":8,"date":"2 June 2008","review":"I saw this at Sundance earlier in the year. I didn't know anything about it going into the festival and it blew me away. Sharon Stone was terrific. I'm not a huge fan of hers, but the scenes of her and her son when he was a boy were terrific. Tom Arnold was also great as her car sales/womanizing husband. Jimmy Fallon was oddly serious throughout the film. I was hoping he'd crack a jock every once in a while, but he was supposed to play is straight and he was good. Lucy Liu was also good as his girlfriend. The movie was a thoughtful/funny meditation on the father/son/family dynamic...of loss, love and regrets. Surprisingly good film.","user":"camillemurray82","rank":[21,34]},{"title":"I want to see this movie a third time!","rating":10,"date":"9 December 2008","review":"I saw this movie at Sundance and thought it was totally compelling (particularly Sharon Stone as the unhinged mom) and found many scenes profoundly reminded me of my own dysfunctional family. I caught myself laughing out loud a number of times, especially at Tony Hale - you know, buster from Arrested Development. I did find, however, the film seemed a little long and somehow unfinished - like a couple of other movies I saw at the festival which, I assume, is quite common. Imagine my surprise, when I recently heard from a friend that the movie had been shortened by the director and he was having a small screening of the new version. Wow - I thought this movie was good the first time I saw it, so I couldn't believe how much better it was the second time. Jimmy Fallon and Lucy Liu are fantastic together and the whole movie is smart, funny, moving and totally satisfying. I hope I can see it for a third time in theaters. You should see it too! LM","user":"linkmagnum","rank":[10,20]}]