[{"title":"Crash Lite","rating":7,"date":"21 February 2009","review":"This ensemble multi-ethnic cast turns in solid performances in this formulaic treatment of the everyday dramas faced by the hard working folks at Immigration and Customs Enforcement. Mexican, Chinese, Palestinian, Australian and Persian plots carom off each other like Olympic Billiards as Harrison Ford, (whose obviously impending retirement is thankfully never mentioned), his heart bleeding from frame one to the credits, leads a solitary existence in an apartment at what has to be the Alimony Arms Hotel. There is no attempt to patch over the Crash/Babel formula; the film embraces it and comes up with some fine set pieces like a gripping intervention (Cliff Curtis and Justin Chon) during a convenience store robbery/shootout. The aerial views of L.A. will make natives want to freeze-frame future DVDs to ID where we are. The climax (NO SPOILER) is played against an attenuated rendering of the National Anthem and packs a punch. Unfortunately, there has to be another five minutes of Tying Up Loose Ends. Does it sound like I didn't like this much? On the contrary, it was 113 minutes well spent and shouldn't have been relegated to the Purgatory of February. April, maybe?","user":"yogi-14","rank":[89,123]},{"title":"Far superior to muddled Crash","rating":7,"date":"15 September 2009","review":"Unlike Crash, another recent disparate-people-dealing-with-a-sociological-issue movie, Crossing Over is poignant, stirring, and rousing, capturing what must be the wrenching experience of being an immigrant, legal or otherwise, in the United States. Led by Harrison Ford, the ensemble cast touches all the bases. Although the movie can be very difficult to watch at times, owing to its subject matter, it's a tough-minded look at the often-tragic issue of immigration.<br><br>Ford plays Max Brogan, an INS agent stationed in Los Angeles, who decides to help an illegal textile worker (Alice Braga) by making sure that the woman's son is taken to his grandmother (the woman's mother) in Mexico when the woman is detained. Meanwhile, Max's partner Hamid Baraheri (Cliff Curtis), struggles to reconcile his job with the culture of his family (Iranian) and the reckless behavior of his younger sister. Ray Liotta plays Cole Frankel, an adjudicator who determines the status of immigrants and their green cards; Alice Eve is an aspiring Australian actress who has to degrade herself to lengthen her stay in the country; Ashley Judd plays Liotta's wife, who defends immigrants in status cases. In a parallel storyline, a young Korean youth, days before his family's naturalization ceremony, makes a decision that could have terrible consequences.<br><br>All of these story lines are intricately intertwined, but here's where the movie differs from Crash: the interactions of the various characters never feel forced or insincere, and the characters themselves are not simple good people doing bad things or bad people doing good things.<br><br>The acting is uniformly grand. Ford, who rarely plays nonhero roles let alone supporting roles, is excellent as the crusty, world-weary agent, trying desperately to solve a serious crime that may hit close to home while also doing the right thing by the young textile-worker mother. Also shining is Judd (and, to a lesser extent, Liotta, although he plays the same character in many of his movies now - a slimeball), but really sealing the deal is Curtis (10,000 BC, Sunshine) as the conflicted agent of Iranian descent.<br><br>Like the issue of immigration itself, the movie is complicated, almost detrimentally so, but the conflict should certainly resonate with its audience, even if one is not an immigrant or part of a family that has recently immigrated. Certain scenes are almost deadly with their pathos, figuratively rending your heart as they play out. Emotionally gripping scenes such as these (particularly near the end of the film) exemplify precisely the kind of psychological gymnastics that a director must undertake for a film like this to have any sort of positive effect on its audience. That is, the entire issue of immigration is fraught with anger, deceit, terror, and sadness, and it can be tricky to walk the line between one feeling or another, lest one be accused of bias.<br><br>Crossing Over falls into none of the traps that Crash fell into. Its character-driven storyline is brimming with plausible conflict that eclipses the usual cops-and-illegals pastiche, choosing instead to deal with problems on a more individual level. The result is an honest, illuminating look at a sometimes-vexing subject, although it is clearly not for all tastes.","user":"dfranzen70","rank":[34,44]},{"title":"A Nutshell Review: Crossing Over","rating":7,"date":"10 April 2009","review":"Like Crash, Fast Food Nation and Babel before it, Crossing Over consists of multiple story lines bound together by a common theme examined, sometimes with just a few characters straddling across the narrative threads to link them up explicitly. Writer-director Wayne Kramer examines the issues behind the illegal immigrant problem in USA who are either trying to lay low in avoiding the law, or trying their best to gain legal residency with each experiencing different challenges that lie ahead in their quest.<br><br>And it's quite ambitious for Kramer to try and pull off no less than seven parallel threads in the film, which to a certain extent I felt was largely successful, despite some being almost peripheral if not for the presence of a recognized star. Anchored by Harrison Ford as Max Brogan, an Immigration and Customs Enforcement (ICE) agent, the film weaves in and out of the different threads without feeling too forced, or the need for some compulsory and carefully designed moments to link the stories up intricately. Sometimes like the six degrees of separation, the film captures the fact that we don't have full details of that web of links, and it will feel very artificial if everyone knew everyone else, or if one event would impact severely on another.<br><br>In any case, each of the story lines were engaging enough, some employing deep emotions to argue their case, while others even had to build to a crescendo of all out action, such as a supermarket shootout (one of the nicely executed ones I've seen). There's an illegal Mexican woman (a very short role by Alice Braga) who begs Ford's Max to look after her young son in the care of unfriendly relatives, a Jewish musician (Jim Sturgess) who's waiting to qualify for residency and willing to do just anything to get there, his Australian girlfriend (Alice Eve) and Hollywood actress wannabe who had granted 2 months worth of on-demand sexual favours to an Immigration official (Ray Liotta) in exchange for a green card, whose wife (Ashley Judd) wants to adopt a child placed in a detention centre, who meets an Iranian girl (Summer Bishil whose essay failed to condemn the terrorists of 9/11 and gotten her and her family into hot soup. Then there's a Korean family who is waiting to be naturalized whose eldest son got involved with thugs (ala Gran Torino rites of passage style), and another ICE agent (Cliff Curtis) whose family cannot stand their estranged sister whom they feel is a disgrace of their values, tradition and custom by adopting the lifestyle of Americans, yet strangely ironic as they too pursue to be American citizens.<br><br>Phew, and all this with a little murder mystery thrown into the mix as well. It's about how one aspires to live in a country, yet uncompromising in one's position to adopt and adapt to the new environment. Which brings about some xenophobia, especially if one's too different from the rest, and things are made worst with the citizens unwilling to understand and lend assistance in assimilation to a new country and its idiosyncrasies.<br><br>But what seemed to be a common theme here, is how power can be either used to do what's probably morally right, versus abusing it for personal gain. Given three of the lead characters here are law enforcement or in responsible positions in government agencies, it's easy to abuse privilege, and it's nothing new too, even in local context, where sexual favours get traded for leniency or the closing of an eye pertaining to illegal workers, or those here without the proper papers. And since the law is fixed (and sometimes perverse by those who interpret it), and justice blind, I suppose there are times we may be compelled to lend a hand to a stranger out of nothing but on humanitarian grounds, in doing what's right and decent for a fellow human being.<br><br>Crossing Over presents many of such situations and while it may be a mixed bag in its narrative, it certainly pushes the right buttons with its star-studded ensemble cast in making the audience think about, empathize with, and examine if the issues presented could have existed in the local context, with similar challenges in the treatment of those who are illegal immigrants.","user":"DICK STEEL","rank":[71,98]}]