[{"title":"Solid, old fashioned, sword and sorcery flick","rating":8,"date":"23 May 2010","review":"If you took the time to find it, then you wont be disappointed with this solid, old fashioned sword and sorcery movie.<br><br>The tales of Solomon Kane have been around longer than most, the character first appearing in mass market print back in the late twenties, but they've not been filmed. Many others, borrowing from it have been filmed so you will be quite familiar with the twists and turns having seen them elsewhere. The saving grace here is that it's all done quite well. James Purefoy is every part the tortured warrior and it's good to see Max Von Sydow and the legend that is Pete Poslethwaite up on the big screen. It's a creepy, dark movie at times and the extra effort they've put into the set design and cinematography really helps to set the scene. The story nips along to a satisfying conclusion. The fight choreography is very well done and FX are good as well.","user":"StevinTasker","rank":[119,145]},{"title":"It could have been so much more","rating":6,"date":"24 February 2014","review":"'Solomon Kane' does twice as much with half the budget of similar genre films such as 'Van Helsing', 'Season of the Witch' and the recent 'Conan the Barbarian' (Which, like 'Solomon Kane', is based on a character created by Robert E. Howard). Unfortunately, doubling up those films still only adds up to average.<br><br>For a while it feels as if 'Solomon Kane' might actually be something special. Anchored by James Purefoy (channeling Hugh Jackman), and supported by strong performances from Rachel Hurd-Wood and the late Pete Postlethwaite, the first act firmly establishes a character and stakes that we care about. But around the half way point it begins to run out of steam, settling for generic genre conventions executed with little of the flair and none of the human focus evidenced earlier in the film.<br><br>'Solomon Kane' had all the pieces to be something special. That it ends up merely being a serviceable time-waster is ironically more frustrating than if it were simply a bad film.","user":"Fluke_Skywalker","rank":[9,9]},{"title":"A good dark fantasy film.","rating":8,"date":"21 February 2010","review":"in my book there are 3 classes of fantasy.<br><br>high, full of goblins elves and knights in shining amour.<br><br>low, a fantasy world without all the classical elements no elves no fairies no blazing swords, <br><br>and dark, born from madman's nightmares and populated with them dark place dark worlds and a serious take on the genre.<br><br>Kane falls into the latter,<br><br>for a low budget film its certainly well done, the character is fairly close to the story's, the props and costumes are reasonably accurate.<br><br>the fighting direction is also true to the character no frivolous swashbuckling here lethal moves to great effect.<br><br>Kane was not some marvelesque hero wasting motion and energy in his strikes, as one character in a story put it \"he is the most lethal swordsmen I've ever seen\". (paraphrased).<br><br>some parts of it could have been handled better the ending or a slight tightening up of the exposition parts, but all in all well worth watching.<br><br>is it worth seeing yes. but bear in mind this is not a lord of the rings style film, nor is this die hard 1600. <br><br>there is a lot of dialog and a lot of religious references. this is a dark fantasy film with a touch of horror, aiming to reveal Kane's hitherto unknown origins.<br><br>if you like to support good independent films go see it if all your interested in is mindless action..... do what you will.","user":"vorec2001","rank":[132,179]}]