[{"title":"Nice movie","rating":6,"date":"20 April 2011","review":"Loved the first one but I think this is somewhat weaker movie. Great Computer graphics Image, very nice directing, loved the looks of the movie, very pleasant to the eyes but the story isn't as appealing as the first one. Maybe that is a problem common to all trilogies, being the second one the least appealing of all. I have seen the first in French version, this one I watched in English, loved both versions but I think the English one is slightly better because as the actors are speaking in their natural language things seem more natural when in real life scenes It is a very nice movie to show to our kids and can be used as a nice entry level movie for European Cinema, for preteen kids. It keeps that good French tradition of great care with image and details. all looks so wonderful! Still it is good fun and in the end it seems to open the door for an absolutely fantastic 3rd one! Hope my expectations come true.","user":"pdl12345","rank":[10,12]},{"title":"It's only half a story","rating":4,"date":"3 January 2010","review":"Didn't see the first movie, but I'm not very much inclined to go see it now. My 11-year old was very disappointed with the way the story abruptly ends with a 'to be continued' and I could only agree with her.<br><br>Although all the elements for an exciting adventure are there, somehow it isn't put together very well. There are too many details that have not been worked out well, specifically with a lot of the characters. The villain from the title doesn't appear until the last quarter of the movie, and just when you think the story is finally going to unravel, it's finished! Open endings can be interesting, but I wouldn't call this an open ending. The boy is still not back, his (grand)parents are still searching, the central matter that most of the movie evolves around has not been solved in any way and even in the end I had no clue to what the revenge of Malthazar was going to be. Being big and in the real world couldn't be all of it, could it?<br><br>To me it seemed like only half a movie, or the first part of a miniseries on TV. Outrageous that I was nowhere warned for this!","user":"tessa-625-335484","rank":[12,18]},{"title":"It's a fun movie(if you watch in french dub audio)","rating":8,"date":"11 January 2011","review":"Really enjoyed the first one(the french dubbed one, with all the scenes intact) and enjoyed the second one as well. Fun movie, funny humor(it's not tenacious d funny, I mean come on It's a still a kids movie). Watch in french with English subbs, sounds better and makes a whole lot of sense cause the animated segments are made by french people(They recorded it in the suits, with all their gestures and stuff, and were originally made in french, and you can notice this(in all of the movies) cause they speak really fast, and if you watched french movies ever in your life, you'd know they have a fast tempo. Fun, enjoyable and easy to watch movie, i recommend it to kids as well as older people Enjoy :)","user":"fichindarktower","rank":[7,11]}]