[{"title":"Something Went Wrong","rating":3,"date":"7 July 2014","review":"Nine friends take a holiday at a Victorian home on a private island and uncover a game that when played brings out the worst in each of them. Jealously, greed, hatred, lust, all of the things they keep buried deep inside themselves rise to the surface and come to a boil.<br><br>Something went terribly wrong when making this movie. It was written and produced by Sean Clark, one of the greatest human beings in the horror community. It stars James Duval, Danielle Harris and Robert Patrick... that alone should sell it to fans. Even the effects and story are pretty decent.<br><br>Despite this, something about it makes the film boring. Probably the directing, but it could be more than that. Duval in some scenes is great and in others makes no effort to act. Were not enough takes shot, or did he not have the heart? Almost as bad, the distributor (Anchor Bay) seemed to have no love for the film. Clark put together a nice package of extras (which he gives away for free) that Anchor Bay turned down. Why? A bad film is a bad film, but some features might have at least explained what happened.","user":"gavin6942","rank":[4,4]},{"title":"Moderately fun \"Evil Dead\" knock-off","rating":12,"date":"12 October 2013","review":"This recent movie is kind of in the vein of \"Evil Dead\" and is certainly no worse than the recent remake. Three couples (including Danielle Harris), a slutty female friend (Mirceau Monroe), and another male (James Duval), who is persona non grata with the most of rest of the gang, all show up on an island owned by the grizzled uncle (Robert Patrick)of one of the guys. In an effort to entertain themselves during a power outage, the group decides to play a strange board game they find in the attic (that no one outside of a horror movie would even recognize as a board game, let alone decide to play). The strange game quickly brings all the groups simmering resentments to the surface and eventually results in the usual full-blown demonic possession and gory murder. The end though has a nice twist.<br><br>The movie features no less than three horror/genre cult figures in Danielle Harris (of the \"Halloween\" franchise), James Duval (\"May\"), and Robert Patrick (\"The Terminator 2\"). Robert Rodriquez's two identical twin nieces (the \"Babysitter Twins\" in his \"Planet Terror\" part of \"Grindhouse\") show up as a couple of, uh, bickering identical twins. There are also TWO black guys-- Harris' proud-to-be-black boyfriend and his back-stabbing \"oreo\" friend and co-worker, who has been promoted over him at work. Then there's Mirceau Monroe and her impressive breasts (who really should have received their own credit as they constantly upstage their owner). This is definitely a strong cast, especially for an \"Evil Dead\" knock-off that has been sitting on the shelf for several years.<br><br>Of course, it is not a particularly SCARY movie. It also makes the mistake of promising a lot more sex than it ultimately delivers. Sure, you get Monroe (and her breasts) in a brief shower scene and the \"Babysitter Twins\" (or, more likely,their body doubles) running around in thong underwear. But the movie also PROMISES an identical-twin sex scene that never materializes, and a lesbian scene between Harris and Monroe that tragically takes place entirely off-screen (oh, the humanity!). The movie is still fairly effective without such sex scenes, so why even promise them in the first place? Despite these flaws though, which are pretty typical of a lot of sex-obsessed yet strangely prudish modern-day horror flicks, this is still a moderately fun horror movie, which I guess I'd recommend--yeah, why not?","user":"lazarillo","rank":[3,3]},{"title":"Pan's Pulsing Peril.","rating":6,"date":"11 May 2014","review":"I expected the worse, where given some of the outright scorn poured on Gabriel Bologna's independently produced TV style movie, has been quite scary in itself! Truth is, is that it is very much same old same old as regards genre tropes, but it at least does it well enough to not make this a complete waste of time.<br><br>Set-up is via a prologue that establishes something murky and menacing happened back in Turkey 1927. Forward to the present day and a bunch of horny young adults converge on a cabin and find a mysterious board game that might relieve the tensions. Said game is of course a left over from that Turkey curse thing, a game which brings out all the pent up bile and fantasies that were previously lying dormant in this so called bunch of friends.<br><br>What transpires is hardly surprising, the group turn on each other - and turn each other on as it happens - where Bologna throws all the \"cabin in the woods\" staples into the pot. Blood does flow, shrieks do feature, as does ink streaming out of the protagonist's eyes. Robert Patrick is under used as the creepy vodka swigging guardian of \"his\" island, and much of the youthful cast struggle to impact with conviction.<br><br>Yet as the thongs and boobs cater for the like minded under sexed, and as the gore (refreshingly not over killed by CGI) keeps on a coming, The Black Waters of Echo's Pond still fills out its run-time with honest horror movie intent. Not one to rush out and grasp with bloody hands, but as late night cable time fillers go it passes muster. 6/10","user":"hitchcockthelegend","rank":[6,8]}]