[{"title":"Not as bad as it sounds","rating":6,"date":"12 December 2007","review":"\"Rated R for terror and violence, nudity throughout\" - perfect line for your average snuff movie.<br><br>Yet, this movie has a bit more quality. The nudity is non-pornographic. The sexuality shown is sometimes erotic, but not perverse.<br><br>The plot: Sadistic killer versus innocent, naive, girl. Seen often before.<br><br>After the first 10 minutes I thought of giving this a 4 out of 10 or less, for its stereotypes, standard patterns of story development and rather bad acting and camera work. But as the story developed, it actually became an entertaining movie. I thought the naive girl was believable in her actions, and somehow the camera and sound work seemed to improve as well. Even the nudity was fitting in without being exploiting.<br><br>I try to avoid spoilers in the first comment for this movie, so I just try give you an idea of what you might like about it: You don't have to turn away every other scene thinking: wow, this is stupid, why in world would he/she do that? Meaning it's mostly believable. And it's not explicit - meaning that even thought this movie contains cruelty, it does not show it off with lots of gore. It's quite subtle at it.<br><br>It's still your basic thriller with some mild horror elements mixed in. No greatness in the dialogues or in the action scenes (well, the ending line it great). I found it enjoyable, only the acting of the supporting cast and the sound sometimes irritated me. I'd recommend this to anyone wanting to see a not-too-violent thriller with some depth and a few surprises.","user":"imdb-5096","rank":[67,76]},{"title":"MUCH better than it sounds!","rating":8,"date":"7 March 2008","review":"'Naked Fear' opens with a terrified naked woman being stalked and killed by a faceless hunter. The premise of hunters stalking and killing humans is of course nothing new, from 'The Most Dangerous Game' to the 'Predator' movies, but rarely has the idea been done as well with a low budget. Danielle De Luca stars as Diana, a naive young woman who ends up working in a seedy strip joint in a town where game hunting is an obsession and women seem to be disappearing at an alarming rate. However as they are all drifters, strippers or prostitutes, nobody cares except a newly posted cop Dwight (Arron Shiver). After a night at work, Diana wakes up naked in the wilderness with an armed killer on her trail. 'Naked Fear' could have at this point simply turned into a boring exploitationer with the main purpose for the camera to linger on De Lucas' nude body as she runs from her nemesis, but instead director Thom Eberhardt crafts a suspenseful and enthralling movie. De Luca is naked for a long section of the movie, but the director shoots the movie in a way that it's clear the fate of Diana is what is important, not her nudity. Eberhardt also underplays the gore as he never shows any of the torture the hunter inflicts on Diana before letting her loose in the wild. I found this refreshing after watching Eli Roth delighting in the torture of women in the risible 'Hostel II' &amp; Danielle De Luca is very good in a demanding physical role which must have taken a lot of bravery to do. As the story unfolds 'Naked Fear' stays believable,as Diana does not suddenly develop kick boxing skills or make elaborate traps like Rambo. Also, the actions of the local townspeople from Dwight to Diana's flatmate Rita (Lisa Hill) never seem unrealistic (though the ending did seem a little out of place after everything which had gone before it). <br><br>The underlying message of the movie is that Diana, Rita and the other strippers and prostitutes to many of the townspeople are as worthless as the deer the locals kill for fun. Don't be put off by the nudity as the worst thing about 'Naked Fear' is its rather lurid title.<br><br>If you find the idea of a killer hunting naked women as game preposterous, this movie is amazingly based on real life killer Robert Hansen. In the late 1970's Hansen kidnapped female dancers and prostitutes before stripping them naked and hunting them down in Alaska. He killed 15 women before he was caught.","user":"kimberlymhn","rank":[37,43]},{"title":"Naked Fear","rating":7,"date":"4 October 2009","review":"Unique variation on The Most Dangerous Game has quite the interesting twist..the prey is an attractive and NAKED stripper(..who becomes stuck in the position of dancing in front of bar slobs due to a run of bad luck). Reluctantly, she responds to the advice of a roommate, for a little extra cash, by getting in the car with a stranger she meets in her club, attempting to back out, but her choice of a pick-up was lousy..an expert hunter, who has graced the cover of magazines devoted to the sport, who likes to hunt down prostitutes on the side! When she attempts to escape from his jeep, he cold-cocks her, not long after, she finds herself in the middle of a wilderness buck naked. He, of course, is equipped with proper clothing attire, cross bow, and rifle. While, he has been successful as a predatory hunter(..he does have considerable advantages), this choice could be his undoing, for she's quite resourceful and strong.<br><br>From the director of Sole Survivor and Night of the Comet, Thom Eberhart tackles to survivalist adventure genre and Naked Fear adds a certain spin never to be topped. Kudos should be heaped on Danielle De Luca who goes far beyond the call of duty, her character naked and bruised in the middle of New Mexico wilderness..certainly a breathtaking setting to have this naked girl running about. <br><br>Not only does she deserve credit for baring everything for a large portion of the middle of the movie, but for her credible performance as a frightened victim who pushes herself to continue moving, despite her difficult circumstances. The role is incredibly demanding, and De Luca wasn't just some actress hired for how she looked in the buff. While spending a great deal of time, once her character awakens to find herself a quarry for the psychopath, running and hiding, trying to catch her breath at times, De Luca maintains our sympathy for her character's plight started from the very beginning and is established as a common occurrence in New Mexico..young, pretty girls snatched away from what they've known as a civilized world, flung into stripping and prostitution thanks to a series of events, call it fate if you wish, that landed them there. <br><br>JD Garfield is Colin Mandel, the psychotic predator who is so hellbent on catching and killing Diana(De Luca), he even assassinates a father and his two boys whose presence he wouldn't allow to thwart his mission. Arron Shiver is Dwight Terry, a newly hired deputy, fleeing from a past that haunts him, who suspects Colin when he discovers that Diana is the latest girl missing, and evidence builds against him. Joe Mantegna adds some respectability to the movie as a cop, Tom Benike, who attempts to warn Dwight against going down the road of investigating his friend(..Tom and Colin are hunting buddies). <br><br>Colin houses his victims' keepsakes in a tacklebox and we get a chance to witness his despicable antics as he pursues Diana, often bragging and grinning about his handiwork. He's such a loathsome scumbag, it doesn't take much to root for Diana to get the upper hand. <br><br>The plot might ask a leap of faith from the viewer concerning the idea that Diana could actually overcome her dire / grim situation, gaining an eventual advantage, using cunning and whatever weapons she could get her hands on in order to fight back against her stalker, but that's all part of the fun. If you can make it through the opening act, which sets up the characters involved in the movie, it'll be worth the wait...I felt that the movie could've been trimmed a bit and still would've been effective. Admittedly, sometimes you become side-tracked ogling De Luca's body(..or, at least, I did) despite her harrowing ordeal, the action sequences and exhilarating location are assets that accompany the eye candy.","user":"Scarecrow-88","rank":[17,19]}]