[{"title":"The Great Day of the Flyers","rating":6,"date":"20 April 2009","review":"The Land Before Time XII: The Great Day of the Flyers, the 12th installment in the Land Before Time series, not the best sequel, but still very cute. I can't believe how many sequels there are, not that I'm complaining, just I feel like I'm becoming a dinosaur after seeing all these movies. But I digress, the Great Day of the Flyers is a fun little sequel that deserves more notice and credit than it's given. As silly as these movies are, they provide great lessons, fun animation, good songs, and how could you not enjoy your time with Littlefoot and his friends? It's fun to see who also might be added into the group and I like that the writers are continuing some of the stories like with Cera and her father being with his new girlfriend, Tria. Also this story provides what a lot of kids have to go through, the curiosity of having a new brother or sister added into the family. Or how Petrie doesn't feel so special and wants to be like his brothers and sisters that can fly well. That's why I think these sequels are great for the kids, just a new way of expressing a story to make them feel a little more relatable, except for the flying part, but you get what I mean.<br><br>Petrie is having a difficult time preparing for \"The Day of the Flyers\", an important day for all of the flying residents of the Great Valley, when all of the young flyers must participate in a very precise flying exhibition to prove that they are ready to fly with the adults. Always a nervous flyer, Petrie has even more trouble flying with his siblings in precise group formations he's more of an independent, free-style flier. At the same time, a strange newcomer to the Great Valley has Littlefoot and his friends trying to help figure out just exactly what he is. The creature's name is Guido, he's the strangest looking creature any of the Great Valley creatures has ever seen, especially since he's covered with feathers, and has never seen another like himself. Cera is having her own troubles, as her grumpy dad and his new mate, Tria, get ready to welcome a hatchling to the family. All of these issues come together on the night before \"The Day of the Flyers\", when Guido starts to figure out what he is, inadvertently leading all of the gang on a perilous adventure into the Mysterious Beyond.<br><br>The Land Before Time XII: The Great Day of the Flyers is a fun little sequel and I can't believe that I'm almost done with these stories, but knowing the writers, I'm sure we'll have a Land Before Time 25 before I die. But I do seriously recommend watching these movies with your family, they're great for the kids and even the adults can get into them. It's silly fun, and I love watching them as cheesy as they may be. My friend says that she won't watch them because of the singing and silly story lines, which I think is a problem for most viewers and not to mention that people are just upset that there are so many of these sequels, but give them a break, they're very good movies. How could you ever not like Petrie or Ducky? If you don't, you have no heart.<br><br>6/10","user":"Smells_Like_Cheese","rank":[4,5]},{"title":"A good LBT","rating":8,"date":"21 January 2008","review":"This is one of many animated sequels to \"The Land Before Time\".<br><br>As far as LBT sequels go, this one is actually pretty impressive in places. The new character seems quite mature, thinks practically and is not quite as babyish as some of the other new LBT characters. The music in this sequel is often very well done and beautiful, lovely violin goes on at a few points. This film has its flaws too, it possesses a lesson like every other LBT sequel (luckily a good lesson) and wobbly animation - but good pencil lines. An enjoyable, good LBT all the same, not as cringe-worthy a lot of the others.<br><br>About our favourite cartoon dinosaurs, in this LBT Petrie is practising for the great day of the flyers. Petrie has to fly among his siblings, but he always becomes so nervous, that he spoils everything. Then, the strange Guido comes along...<br><br>Good for LBT fans and people who like cartoon films with good gags, songs and music, enjoy LBT12!","user":"Mightyzebra","rank":[5,7]},{"title":"Entertaining with Good Values","rating":7,"date":"1 March 2014","review":"This movie is good to watch and it is light and uplifting. There is a bit of an 'Ugly Duckling' theme going on with Petrie (and also with Guido) and it also shows how a new sibling as a kid can feel. The song 'Flip, Flap and Fly' is quite good and catchy and will make you feel more happy for Petrie. As usual, with all the HD 'Land Before Time' movies, it is bright and colourful. I am sure all Land Before Time fans will like this as well as children. I have given this a 7/10 because it is a very decent 'Land Before Time' sequel and isn't one of the worst and teaches that it is better to be yourself and make a revolution than trying to fit in when deep down you don't. In some parts of the movie, it probably does drag on a bit such as a certain scene near the middle-end. Overall, it is a good 'Land Before Time' sequel.","user":"emmajonesemmajones","rank":[2,2]}]