[{"title":"A Solid Ending for Season 10","rating":8,"date":"17 March 2008","review":"The Ark of Truth was the kind of satisfying finale to season 10 that I was hoping for. Great stuff - a lot of fun.<br><br>The Ark of Truth was well written and directed, and felt like a direct continuation of season 10. The actors continued to do what they do with these characters (which is a good thing), and the action was very good (although they've done better before). As for the special effects, I thought they were excellent (not $100 million budget excellent, but for a straight to DVD movie based on a cancelled TV series they were fantastic).<br><br>The only gripe I had about it was that they threw in everything but the kitchen sink (all of the prerequisite SG1 subplots were there). Paring it down and eliminating one of those subplots might have made the movie a little better (Sam and Teal'c don't get quite enough to do in the movie as a result), but as it is I still think it's a damned entertaining movie - as long as you've watched the last 10 years of SG1. If not, you're going to be lost.<br><br>Clearly, though, this was not made to win over new fans. This was made for the fans who have been following the show for the last decade. This was made for the fans who weren't happy about the Sci-Fi channel cancelling the show in a cost cutting move, and as one of those fans I am very glad they made this movie. I enjoyed the hell out of it.<br><br>Finally, the resolution of the story is what they've been setting up for the last two years of the series. No major surprises, but it was carried off very well.<br><br>For those familiar with the SG1 series (particularly seasons 9 &amp; 10) The Ark of Truth is highly recommended. For anyone who has NOT seen seasons 9 &amp; 10 of Stargate: SG1 I would advise holding off until you have seen those seasons to put everything in proper context.","user":"b5erik","rank":[58,64]},{"title":"Very Good, definitely worth buying.","rating":8,"date":"1 March 2008","review":"The wrapped up nicely from the questions left at the end of the TV series, but still left plenty of openings for the next Stargate movie.<br><br>While the production was top notch as I would expect, it did feel very much like an extended episode rather than a blockbuster movie, which is essentially what this was, a way to wrap up questions and not leave fans hanging for answers...<br><br>The problem I had was it felt very much like it was the basic storyline for a season arc, but squashed to fit in a 90 minute slot.<br><br>I recommend any Stargate fan to buy this, but unless you are a fan, this will have little appeal, since it ties into what happened in the last SG1 season.","user":"mrxavia","rank":[69,85]},{"title":"A great tie-off to the series","rating":8,"date":"6 March 2008","review":"I just watched Ark of Truth last night and I found it a great film (a term I use lightly - it really is more of an extended episode). The script was enjoyable, the actors were as always at their peak and it concluded all the story arcs that needed concluding.<br><br>Admittedly, the only factor in the film that annoyed me was the 'ark of truth' itself. It felt to me a little contrived that all of a sudden there was this 'ark of truth' that would solve all their problems. When they were fighting the goauld and they had to work out everything themselves, however with the ori all they're trying to do is find things that the ancients left behind.<br><br>Still, a great film and I'd recommended it to any fan! It really isn't for non-fans tho. This film wasn't made to get new people into the stargate 'verse, but to finish off the story for those people who are already fans. There is too much assumes knowledge for non-fans to enjoy it.<br><br>8/10","user":"salsa89","rank":[32,38]}]