[{"title":"Delivers the action... Awesome plot!","rating":7,"date":"23 February 2020","review":"I found this thriller to be enjoyable. Lots of action - some of it pretty unbelievable - and some twists in the story. Very well acted on all parts. I really like Jolie much more in these action movies than the dramas she does.","user":"MR_Heraclius","rank":[44,48]},{"title":"Good action, good story. Bad image of Russians.","rating":8,"date":"29 January 2011","review":"Just watched the BlueRay of this movie and I really liked it. Good action, exceptional acting, good story. Not a mind blowing, but still interesting.<br><br>I've also listened to the director's commentary for the movie where he said that the Russian people had a negative reaction after watching this movie. In particular, that they were offended of the way Russians are shown in the movie. Well, I hope the director reads the reviews on this website and I would like to make a tiny remark. He completely missed the point of why they were offended.<br><br>It was not due to the fact that Russian government had (or has) spies in the US, but due to the image he gave to the Russians in his film.<br><br>1. Russians don't address each other as \"comrade\". Never did. 2. Russians don't drink vodka on every other occasion. And certainly don't carry a bottle on their person just in case. In fact, Russians drink more beer than vodka. 3. Russians don't kiss each other as a form of greeting. Only if they are very good friends (or would like to seem so) or relatives and either both girls, or of opposite sex. Russian men never kiss each other, even if they are best friends or relatives. Male relatives kissing is much more common in Europe and even US, than in Russia. 4. The Russian spies that were caught in the US last year were not observing the life of US. Any simple person can do that without being a spy. For example, I often talk to my relatives in Russia and tell them how I live in the US and how life in the US is in general. Of course, I don't tell or know any secrets; THAT is the spy's job.<br><br>Also, just a side note to others, who might only know about Russia by films such as this one: Russian people don't dream of attacking US (or any other country for that matter). They have problems of their own. So please, stop exploiting these beaten-to-death stereotypes in the movies. Otherwise, the cold war will never really end.<br><br>Other than that -- great movie. Enjoyed it very much.<br><br>Just to clarify: I am Russian and lived in Russia for 26 years.","user":"MarkusOctavius","rank":[46,58]},{"title":"Good Action Flick","rating":7,"date":"27 August 2010","review":"Many reviewers here have stated that this movie isn't realistic because 'Salt doesn't get bruised enough' or 'no one her size could...' Have these people ever been to an action movie before? NO ACTION MOVIE IS REALISTIC. They are all written to be over-the-top because that's what makes them entertaining. We suspend disbelief to enter the world of the action-hero (or heroine) and we go along for the thrilling ride that is sometimes so over-the-top it's ridiculous! But that's what makes it fun. If action movies were realistic, they would be slow and boring. This movie does not cross the line anymore than any other action movie.<br><br>Salt delivers exactly what is promised -- a solid 100 minutes of action. It keeps you watching, it keeps you guessing (even when it turns out you were right in some cases), and it entertains from start to finish. If you like the action movie genre, chances are you will enjoy this movie.<br><br>As for the reviewers who criticized the way Russians are portrayed, the action genre plays to comic book-like caricatures. The villains are no more realistic than the heroine! This isn't a documentary! <br><br>If you like action movies, give Salt a go. Angelina won't disappoint.","user":"geekroad","rank":[294,427]}]