[{"title":"Awful...","rating":1,"date":"15 January 2011","review":"It blows me away that people thought this movie was, \"surprisingly good.\" It's not. It's bad. Really really bad. Lets put it this way, I have not walked out of a movie in who knows how long, since Ishtar? And this was that bad. <br><br>Yes I did laugh a few times. But Seth Rogen, just plays himself as he has played that same character in dozens of other movies, except this time he has money, a side kick and weapons, devised by the sidekick. He plays Britt Read as a super loud and obnoxious character without being endearing. Reid's not smart or witty, but brash and annoying. <br><br>Now one could say that there are these great fight scenes thanks to Kato (played by John Cho). But there so over the top special effects laden as to be completely unreal and not enjoyable. It's like the viewer is playing a video game when we see from Kato's perspective in a fight.<br><br>The bad guy, has a bad guy insecurity complex with wanting to be perceive as scary, but has a name that nobody can pronounce and of course, owns and hide's out? at a cement/construction company. <br><br>In the end, this movie is tedious, predictable, annoying, and worse, unenjoyably campy. Save yourself the money and god forbid the 17$ it costs to see it in 3d. Because 3d does nothing but make you angrier you spent that much more money on a waste of 2 hours.","user":"jrargonaut","rank":[242,360]},{"title":"Really annoying film","rating":1,"date":"21 January 2011","review":"The trailer got me all excited to watch this, but boooooy was I wrong. I was really hoping this was going to be like Iron Man but instead it felt like that darn Streetfighter film with Van Damme. Like Streetfighter, the movie felt really short, because there was not much of a plot. Heroes were generic and same with the villains. You see the bad guy in the beginning, but there wasn't much character development which made the villain very generic (which also made it obvious how the story is going to end). Kato's role was generic as well, like he was a typical Asian foreigner who does all the hard work but no play. Now I understand why Nicolas Cage turned down the role of the villain and same with Stephen Chow as Kato...lame. Besides the cheesy characters, the fight scenes were done in slow motion which made it seem fake and derivative of the Matrix, Seth Rogen (green hornet) was annoyingly loud most of the time, I didn't really understand what Jay Chou (Kato) was saying sometimes because of his heavy accent (which also made his acting kind of wooden), and Cameron Diaz felt like she was there just for star power for some reason. Even the action scenes (especially towards the end) was very boring, (believe it or not I actually fell asleep during the middle of an action scene), my brother tapped me on my shoulder to wake me up. There was nothing in this movie that was really interesting other than maybe the black beauty (green hornet's car) and maybe his hornet gun, and that's about it. And what was up with the 3- D? The glasses made the movie too dark and did nothing to the experience (I am getting really sick of 3-D).","user":"mattjohnson532","rank":[150,238]},{"title":"Cameron Diaz Ditches Shreck For A Radio Tale","rating":7,"date":"8 May 2011","review":"It is important to recall history when you look at this movie and understand why the script is designed the way it is. The basis of this is actually the old time radio series, not a comic book like other movie series in this genre. Because of this, the script is trying to update the 1940's to 2011. In some ways it does so successfully. My take on the lead characters development: The Green Hornet - Seth Rogan- the writers here decide to make him into Seth Rogan. That way the script can exploit his comedy and sprinkle his usual comedy into the script. So the Hornet is an airhead trying to do comedy. Is this successful - pretty much. He is no where near the radio hero.<br><br>Kato - Bruce Lee created an interesting image in their 2 year ABC series. Most of that is scrapped here. What we get instead is a more traditional Kato. While he is still a major martial arts fighter, he is more of a tech-no geek and without him the Hornet is a dreeb. This works too and allows the technological leap from the radio dramas to 2011.<br><br>The brains- there is Cameron Diaz as Seth's secretary. Her character makes perfect sense in this context. Kato is too busy to be the brains. The Hornet is too stupid to be the brains. Diaz makes the script work &amp; I readily accept a 39 year old Diaz playing a 36 year old. She pulls off this support role perfectly.<br><br>The film is kind of like the radio series on steroids action wise. The first half is dominated by Rogan's comedy and even Kato sneaks in some punchlines. The films two villains, the nasty drug lord and the corrupt politician are pretty much traditional types of crooks the Hornet deals with. The film even manages to pull off the fact that these guys aren't considered good guys.<br><br>It is strange, but about 2/3rds of the way through the movie, Rogan actually has a flashback episode that clears up the plot line malaise that the viewer feels in about 5 minutes. Once you see this revealing sequence, you get along with the movie a little better. This sequence is like a flashback on steroids to explain the Hornets father's death.<br><br>This is a pleasant mixture of comedy and action which should please Rogan fans and it is pretty successful at bringing fresh life into some characters which date back many years as the last time it was done was in the 1960's and it was not real successful then as only Bruce Lee is remembered from the TV series.","user":"DKosty123","rank":[10,12]}]