[{"title":"Just a shattered movie with no heart and identity","rating":2,"date":"26 July 2018","review":"This was such a good downgrade, it's unbelievable. The movie doesn't shelter a soul. You can't show feelings to it. It's ugly. There isn't much thought put into it. It's like not a part of the Trilogy: Forced and lame jokes, casual and uninspiring score, stereotyped and predictable plot, cheesy and generic writing, undeveloped villain, inappropriate atmosphere, wrong character development... I mean how does one go from this ''Tell me, do you bleed'' to this ''There's something definitely bleeding'' It's like a 'joke'. Who wrote this garbage? I mean why, what was your motive?<br><br>Apart from the garbage writing, the coloring sucked too. The whole movie was ugly as hell. After Superman's resurrection, the fight scene was completely miss edited. Why is the sun rising? Do you guys wanted it to make more colorful? Is because Superman takes his power from the sun? Because of this garbage coloring, the VFX and the CGI looked garbage.<br><br>Where is the villain? That villain shouldn't have wasted like that. He made a pretty good entrance, but the movie didn't capitalize on it afterwards. We didn't get to know him. He was in exile, Superman died so he has sent to earth to destroy it. Yeah, sure.<br><br>Fight scenes were a big downgrade too. Although there were some good shots, especially where Amazons and Steppenwolf fight, most of the fight scenes were just casual and emotionless.<br><br>Overall, this movie is just another ''Batman &amp; Robin''. Back then, due to its darkness, they gave Batman nipple. Now, due to its darkness, they gave Batman ''Do you really talk to fish'', ''There is something definitely bleeding'' lines. The history repeating itself.<br><br>They gave $300,000,000 for this movie, but it doesn't look like that big of a movie, right? WB really did something. They've disposed of movie's original composers. They've re-edited and rewrote the whole movie. They've brought a new guy, who doesn't care about the characters or bother to know them, as a writer and director to make the movie look more like a Disney movie. And with that guy, they added a bunch of reshoots which doesn't add too much to the movie other than garbageness and a bad CGI mouth. This version of Justice League is just wrong, doesn't add up, doesn't lead anywhere. Every storyline that we started, every future we were building up to gone with this movie. It just depressing.","user":"nothimme","rank":[774,987]},{"title":"Warner Bros. should be ashamed of themselves.","rating":1,"date":"23 November 2017","review":"Everyone knows by now that due to unfortunate circumstances, Zack Snyder (Director) and his wife, Deborah Snyder (Producer) had to leave the project for personal reasons, which enticed to the studio (Warner Bros.) to bring in 'Avengers' director Joss Whedon and ''finish'' it. <br><br>Ultimately, the film seems to have been almost completely re-written and re-shot. I've read a fair amount from people claiming that the film is still around 80% Snyder's vision, I don't think so.<br><br>The films original composer (Junkie XL) was quickly dispatched and replaced by Danny Elfman (One could argue that a films score makes up 50% of the film, easily).<br><br>Danny Elfman's score is completely flat and heartless. There isn't a shred of emotion in a single note. It sounds out of place, is consistently uneven and the little homages to past themes seem to be thrown in and are used at completely the wrong times.<br><br>Almost every scene where Superman appears, he has a ridiculously expensive, computer generated botch job of a mouth to cover up a moustache that Henry Cavill wasn't allowed to shave off for the re- shoots, due to commitments to another film.<br><br>As I can recall, there was one scene for Superman where he didn't have the CGI mouth.<br><br>The tone and atmosphere of Snyder's style is almost completely lifted from the film, something I'm sure was tampered with in post- production.<br><br>It doesn't have any kind of atmosphere at all really, it just feels empty.<br><br>The actors are all fine and deliver worthy performances for the characters, it's not their fault that the film which is built around them is a complete disaster.<br><br>It just goes to show that the studio couldn't care in the slightest about delivering a serious and decent production. They had a release date and they forced themselves to stick to it, regardless of the outcome.<br><br>Most of the film feels completely rushed and cheap, which it shouldn't, given it had a budget of $300 million.<br><br>It's simply unacceptable for something of this capacity and scale to be the epitome of a mindless product from a bloodsucking and power driven cooperation.<br><br>Would it have been such a loss to put the project on hold until Zack and Deborah Snyder returned, or delay the film until everything was as good as could possibly be? Apparently yes.<br><br>There's been absolutely no respect for the source material, the vision of the original director or the target audience from Warner Bros..<br><br>Zack Snyder's complete version, I'm sure has its faults and flaws, but nothing can compare to this lacklustre effort.<br><br>This should have been the best superhero film ever made, but has been dropped and fallen straight to the bottom of the barrel.<br><br>I could go on and on, but I'll stop there.","user":"d-beckton","rank":[374,555]},{"title":"Justice League is, unfortunately, plagued with post-production issues.","rating":6,"date":"25 February 2018","review":"Here we are. The Justice League. DC's greatest superheroes come together to save the world...and what is the first scene you ask? Henry Cavill's CGI'd shaved face. Ohhh dear...yup...we're in for quite a ride. So with Superman dead, Batman and Wonder Woman must arrange a team of gifted individuals to stop the world destroyer Steppenwolf from, you guessed it, destroying the world. Sighhhh...I kinda just want to hug this film and repeatedly whisper \"there, there...it'll all be alright.\". Apprehensively, I went into this unmotivated and expecting the worst superhero film since Suicide Squad. Fortunately, this isn't that bad. But, it's not great either. The film's greatest achievement is the coalition of the Justice League members. Their interactions, mannerisms and even their physicality was pretty much on point. Aquaman, although absolutely useless in this, had the physical prowess of a beastly underwater warrior. The Flash was quirky and provided several comedic moments. Cyborg was essentially the technological logistics manager. Wonder Woman and Batman were the parents who lead their children into battle. Heck, she even refers to them as children! Yet it all worked so well. Remember, this is a comic book adaptation, so the humour and light hearted nature of its source material does show. The human CGI for the most part was actually executed well (far better than \"Thor Ragnarok\") and the slow motion scenes with The Flash were gorgeous to watch. Snyder is typically style over substance, which is apparent here. The story is so boringly uninspired that it defines the word \"lazy\". I cannot be dealing with another 'save the world' situation. I'm also becoming irritated with underused, bland and weak villains who are supposed to be absurdly powerful. Steppenwolf was wasted potential. Constant use of green screen, hit and miss script, rushed third act...just too many flaws I'm afraid. Was it too soon for a Justice League film considering no origins for Aquaman, The Flash and Cyborg yet? Personally, I think so.","user":"TheMovieDiorama","rank":[67,95]}]