[{"title":"Depressing but worth the watch.","rating":8,"date":"19 January 2011","review":"'RABBIT HOLE': Four Stars (Out of Five) <br><br>David Lindsay-Abaire adapts his tragic play about a couple who lose their young son in a car accident. The film is directed by actor turned director Cameron Mitchell (who also directed 'SHORTBUS' and 'HEDWIG AND THE ANGRY INCH', in which he also played the title character). It stars Golden Globe nominee Nicole Kidman (who also produced the film) and Aaron Eckhart (who's equally impressive). The film is full of tough hard to watch drama and strikes a very realistic and believable tone. Depressing but worth the watch.<br><br>The film focuses on how each spouse copes differently with their tragedy. Becca (Kidman) wants to get rid of everything that reminds her of her son, including the dog he chased into the street the day he was struck by a car. Howie (Eckhart) wants to hold on to all the things that bring him cherished memories of his son, including videos he constantly watches and the dog (which he brings back into the home after getting into a heated argument with his wife over it). The couple's marriage nearly falls apart as each looks for comfort in different ways. Becca finds peace in an odd relationship with the teenage driver (Miles Teller) who struck their son and Howie finds happiness with others outside the home as well including a mutual friend of he and Becca's (Sandra Oh) they know from a counseling group. Dianne Wiest plays Becca's mother who also lost a son but, as Becca points out, an adult son to drugs.<br><br>The film has some dark comedic moments to lift the tension but for the most part it's a pretty hard hitting drama. The acting is all outstanding, especially the two leads, and the film is smartly written as well as nicely directed. Some might be afraid to watch it because of it's dark depressing subject matter but it does manage to find a little small ray of hope in the darkness. Of course there's no happy endings here but it has some nice commentary to deliver on life and coping with tragedy.<br><br>Watch our movie review show 'MOVIE TALK' at: https://www.youtube.com/watch?v=6xzh1FLmMq4","user":"Hellmant","rank":[36,38]},{"title":"A Beautiful Tale of Life. And Death.","rating":8,"date":"12 December 2010","review":"Rabbit Hole is a tragic tale that won't sadden viewers. That is simply not the purpose despite what the plot and trailer may show. Rabbit Hole is a story of how two previously happy couple cope with the loss of their four-year-old son. The what/who/where/why/how is what makes Rabbit Hole one of 2010's finest films.<br><br>Right off the bat you will notice what surrounds this couple; a world filled with joy and life at the worst moment in their lives. This feeling does not lend itself to that Oscar-feeling feel it may have wanted but it certainly works. <br><br>These actors give highly realistic performances that fit perfectly with this demanding plot. Nicole Kidman steals the show with her best performance (and movie) since 'Eyes Wide Shut'. Aaron Eckhart also gives a terrific performance as the grieving husband and father and, after 'Love Happens', shows that he is back to serious acting as he was in 'The Dark Knight'.<br><br>The best aspect of Rabbit Hole is how you begin by knowing very little about these characters but end up knowing them as if they were your own neighbors. You progressively learn what happened to their son and other details within their past that fit perfectly together without feeling as they are giving the audience answers. The dialogue also lends itself to this method and, surprisingly, never feels directed to the audience.<br><br>What I found unique is how with such a depressing feel to the film, it never actually makes the viewer sad, but interested. It is a film that will make you laugh more than cry and I found that impressive. It isn't your normal tear-jerker; you are watching this couple live their lives and deal with this death in an interesting way. Rabbit Hole never has a dull moment; my eyes were glued to the screen from the start.<br><br>Rabbit Hole is simply one of the finest films of 2010. Its execution is sometimes brilliant and the feeling of self-awareness and thought it lends to the viewer is unlike anything you may have ever seen. It's not your run-of-the-mill Oscar contender. Rabbit Hole is a beautiful tale of life. And death.","user":"Marjeez","rank":[70,82]},{"title":"One of Kidman's best performances.","rating":9,"date":"9 December 2010","review":"Following on from his first two audacious features in the niche of queer cinema, John Cameron Mitchell now enters relatively mainstream waters to bring us Rabbit Hole, adapted by David Lindsay-Abaire from his own Pulitzer Prize-winning play. It's a quiet, contemplative film, brimming with sadness and humor, and lead by a wonderful central performance.<br><br>Nicole Kidman returns to the theme that first brought her to international attention - that of a mother grieving the loss of a child, and the emotional aftermath that such a trauma entails. Of course in the two decades since Dead Calm was released, Kidman has explored of multitude roles and worked with some of the finest directors in the industry. She has gained such an authority on screen - yet somehow, here, she manages to strip away all of our preconceptions so that we are left with something as raw and natural as she was opposite Sam Neil at the age of 21. This is her most fully-rounded character and detailed performance in years - nimble, layered and completely magnetic.<br><br>Becca's journey with her husband Howie (Aaron Eckhart), eight months after the tragic accident that killed their son, is beautifully captured by Cameron Mitchell's lens. Despite the film's stage origins, the story never feels too talky or confined, shots are simple yet beautifully composed, the editing and pace have a fluid rhythm. The couple's facade of normalcy - making dinners, attending pious bereavement groups and keeping up appearances with friends and neighbors, begins to crack as the mementos of their son's life disappear. Becca gives his clothes to goodwill and takes his paintings off the fridge, she accidentally deletes a video of him playing on a swing - causing a distraught reaction in Howie. The difference in the way this couple deals with the loss is compelling, and the friction between them palpable outside of the few explosive scenes.<br><br>Their disconnect becomes more and more apparent, and Eckhart plays it with a wounded humanity that's really effective. Howie wishes they could \"get back on track\" and perhaps try for another baby, something which Becca is not prepared to do. Instead he starts hanging out with Gabby, a woman from their bereavement group, played by the always reliable Sandra Oh. Meanwhile prickly moments between Becca and her irresponsible sister Izzy (Tammy Blanchard) are very well played and Dianne Wiest provides a lot of warmth and wisdom as Becca's mother, but doesn't really get a defining moment. Becca both yearns to escape the reminders of her grief and seeks closure and solace in her pursuit of Jason, the young man who accidentally ran over her son. This strand of the story, exploring the idea of parallel universes and fate, gives the story a unique edge and Miles Teller is easily the stand out of the supporting cast.<br><br>Ultimately what gives this film its power is that Mitchell's focus is always fiercely rooted in the reality of the situation, side-stepping the potential sentimentality of the subject - biting humor undercuts the sorrow and there certain moments of confrontation between Becca, Howie and Jason that strike quite a visceral chord. The scenes on the bench between Kidman and Teller contain moments of such purity and depth as to be heartbreaking - and to me, the final montage is one of the most sublime and emotionally resonant endings of the past decade. I can't recommend the film enough, and if there's any justice in the world Kidman will finally be recognized again by the Academy.","user":"ecstatic-tickle","rank":[94,114]}]