[{"title":"An Unlikely Film of Soul...","rating":7,"date":"27 October 2008","review":"In this age of super-broad comedies and sexed-up teen films, there comes Nick and Norah's Infinite Playlist. It's all-too-easy to groan at the thought of sitting down to a high school film these days, yet 'Nick &amp; Norah' attempts to make you rethink that. It tries to achieve that so rare of an achievement; it tries to make a genuine and honest teen comedy.<br><br>It succeeds.<br><br>Michael Cera, that king of adorable dorkiness, stars as Nick, the sole straight member of a queer-rock band. Kat Dennings plays Norah, a rocking rich chick who is just as unattracted to teenage pettiness as the rest of us are. These two meet through a random encounter and together set out to try and find the secret show of the aptly titled rock band Where's Fluffy? They cruise the town like grown adults, yet underneath both are incredibly naive. They argue, fight, flirt, and, yes, fall in love; what makes the film great is how mature and honest a relationship they create. We know from the beginning that it is the destiny of Nick and Norah to get together, yet when they do it is nothing short of soulful. With a wonderfully witty script along for the ride, it's apparent that this is much more than your average teenage comedy. 7/10 stars! <br><br>Jay Addison","user":"jaddison383","rank":[81,95]},{"title":"Sweet and silly fun with an indie rock backdrop","rating":7,"date":"4 October 2008","review":"I was pleasantly surprised by this movie. It's not as raunchy as its teen comedy predecessors, yet not as cloying as the usual chick flick. Nick and Norah's Infinite Playlist manages to strike up a nice balance between the two with a dash of hipster thrown in there. However don't let the title fool you. It isn't all about the music! <br><br>The movie is very character-driven and, fortunately, the cast was strong enough to carry it. Michael Cera and Kat Dennings make one quirky and fun on screen pair. The supporting cast members also shine in their roles. Ari Graynor, for instance, plays one of the most ridiculously likable drunks I've ever seen. The performances delivered by this young cast are really what make this movie.<br><br>Overall I enjoyed what I saw and can't wait for the DVD release. You don't have to think too hard about this one. It's a quick glimpse into the NYC music scene, light on the drama, but romantic and funny where it needs to be.<br><br>Ah, and, for the record, you don't have to be into the hipster subculture to appreciate this movie. It's definitely an accessible story, whether you've heard of Vampire Weekend or not.","user":"lostmyhairbrush","rank":[68,88]},{"title":"It's about the atmosphere...","rating":9,"date":"4 October 2008","review":"All right. Listen up out there. You could say this is Juno without the baby...or almost as useless and watered down as a straight to DVD movie...but you would be missing the point--not that every movie has to have a point.<br><br>N&amp;N is not trying to sell something or be something--it's not even trying to be great...because most love stories that try to be great fail. When you see N&amp;N (and if you're in the mood for a lighthearted enjoyable movie, you should), don't go with an expectation of grandeur or even for the entire thing to be great. Alexis Diziena is as useless in this film as she is anorexic and whorish--her part is almost explicitly sexual. And there are so many subplots that their lives appear at times to be exaggerated. What matters almost seems to be camouflaged by what should be secondary.<br><br>The movie succeeds in a number of understated ways, though. Ari Graynor's part is by far the funniest character of the bunch and Ari plays the part extremely well. The gay band Michael Cera is a member of adds a quirky afterthought to his character's back story. And what's most important--the characters Nick and Norah act like slightly more interesting versions of normal people. They have their flaws and their disagreements but they're capable of finding the beauty in each other and their story along the way.<br><br>Movies should be about the creation and expansion of a spark of magic--not about giving you exactly what you expect or want. The perfection of the movie lives in its imperfections. The love is in the relationships that are real and what is fake gets left behind in a sketchy area near 10th street (that's not a spoiler). It amplifies grace with its soundtrack and hope with its random culmination of peculiar events over a single-night.<br><br>So just let the infinite playlist play and enjoy it already.","user":"Jobi14","rank":[124,174]}]