[{"title":"Prom Night 2008, how do I hate thee...","rating":1,"date":"12 April 2008","review":"...let me count the ways.<br><br>1. A title-only 'remake' that pulls out every cliché in the slasher handbook.<br><br>2. A plot so predictable that it becomes quite pathetic.<br><br>3. A completely weak execution of all attempts at suspense or thrills.<br><br>4. A PG-13 rating that insures no gore, violence, or sex.<br><br>5. A villain that is not frightening or even mysterious.<br><br>6. A cast of characters that are so thinly written and stereotyped that we couldn't possibly care about them.<br><br>7. A lack of any effectively creepy atmosphere (much unlike the original Prom Night).<br><br>8. A script of dialog that's beyond poor - it's mind numbing. <br><br>9. A series of cardboard performances (not sure whether to blame the actors or the lousy aforementioned script for that).<br><br>10. A completely inept teen-targeted slasher remake that's not brave enough to attempt to have an imagination - or even to show a puddle of blood.<br><br>It's a no-brainer horror fans, save your money.<br><br>BOMB out of ****","user":"Nightman85","rank":[276,355]},{"title":"Could be used in horror film school as a textbook example of what not to do...","rating":1,"date":"22 August 2008","review":"Good grief I can't even begin to describe how poor this film is. Don't get me wrong, I wasn't expecting much to begin with. Let's face it, a PG-13 slasher flick is pre-destined to be missing the ummm... slashing, so no one should be surprised by the lack of gore. But it was the level of incompetence and cliché on display in all the other aspects of this movie is what really blew me away. <br><br>We have a protagonist who is quite simply so completely useless that you find yourself rooting for the bad guy. And here's a turnup for the books... SHE NEVER CHANGES - hence breaking the cardinal rule of basic screen writing - character development. If you think by the end of this film the poor little girl is going to turn around and finally kick some arse then think again. <br><br>On top of this, we're handed possibly the least intriguing (and definitely the least scary) killer ever to grace the genre. I'm not joking when I say that Dora the Explorer has scarier villains than this movie.<br><br>Finally, because all the potential for tension or gratuity is removed by the inept (and apparently thirteen-year-old) director, what could possibly be left to fill up 2 hours of screen time? <br><br>Closets, that's what. <br><br>Lots and lots of closets: big closets, small closets, mirrored closets, closets to Narnia, so many damned closets you'll not want to dress yourself for another year. In fact this movie should have just been called \"CLOSET\", and had a picture of a big scary coathanger on the DVD case. On the back it could have had a photograph of the audience falling asleep and a quote by Roger and Ebert - something to the extent of: \"what the f*@! did we just waste our time watching!\"","user":"The_Dead_See","rank":[46,55]},{"title":"Less scary than the kid toucher episode of Webster","rating":1,"date":"12 April 2008","review":"Prom Night is shot with the artistic eye someone gives while finely crafting a Lifetime original film. You know the one. This October, Lifetime takes a break from the courageous tale of a woman surviving (insert disease name here) to tell the somewhat creepy tale of a woman pursued by a stalker ex-boyfriend. It's dramatic  it's sappy  it's immensely dull. It does nothing to further a genre, tell an original story, or strive for ANY sort of newness. Prom Night shares this plight. Watching the killer poke holes in his victims, we sit silently as they slump to the floor with not a drop of blood spilled. It occurred to me that this was the cleanest killer in movie history.<br><br>Our director is working with a fairly good-looking killer so he is forced to pour on the camera angles to make him appear creepier. Think about Matthew McConaughey coming at you with a knife. You'd probably go  \"OH! Good lookin guy is going to kill me? Naaaa.\" Not scary even for a second, so the director throws Schaech into shadows and over the shoulder in the mirror. This mirror shot is repeated to the point of sickness as it practically becomes a fetish of the creator. You'll get 15 jump scares in this film, 2 of which made my date jump (I might mention she is afraid of EVERYTHING). I'd also mention she decided to take a nap halfway through the film and at one point threatened to leave me.<br><br>As if this film were not disjointed enough, it appears to be cut to shreds. I'm not saying it looks like key points were left on the cutting room floor as the crew scrambled to salvage some semblance of a horror film; I'm saying as the film moves from scene to scene, you often get a jarring jump. This is the kind of thing you'd expect when a film catches fire and a projectionist is forced to splice ends together, cross his fingers, and hope for the best. The editor should be shot.<br><br>With a plot you can pack into two sentences, one stray spray of blood, an emo killer, and the tension of a very special episode of \"Silver Spoons\", we're left with no reason to support horror this weekend  at least on the big screen. In fact, this is the sort of film that should be punished. Is it really that hard to make a scary movie? Was this crew even aware they were making a horror film??!! A complete waste of my time and yours. I bit the bullet to get you this review. Don't let my sacrifice be in vain. DON'T GO INTO THE MOVIE!!!","user":"nomad-48","rank":[171,226]}]