[{"title":"An insight into the humanity of the inhumane","rating":10,"date":"20 February 2010","review":"Before I start reviewing, let me say something personal: As a German, one can hardly watch movies about the Holocaust, WWII or any related topic unbiased. As I have discovered myself, no German family is without a history related to the Third Reich, almost none are without grave guilt, or at least the fear thereof, and most who say otherwise either lie knowingly, or simply try to evade further inquiry. <br><br>Reading some of the other reviews, I realized that for me, the movie conveyed something slightly, but decisively different: It is not so much about understanding HOW people could ever do the things they did, but rather how it is possible, that people we love, and people that have been loved by people we love could be so guilty and so loving, so despicable and lovable at the same time. It is about how we expect the guilt to show up somehow, how we expect to know the killer, the monster, at first sight and say: how could anyone not have seen it? Yet we have to admit sooner or later, that we were wrong, or were we? The question really is: How could I have ever loved someone who did things as horrible and disgusting as Hannah did? And just as much: If I am unmerciful now, having learned of their guilt, is it because they did what they did, or because they disappointed my own belief in their innocence?<br><br>At one point, Hanna Schmitz asks the judge: \"What would you have done?\", and I think that therein lies an even more disturbing and unsettling question: What would I have done? What would you have done? How can anyone know for sure what WE would done? It is too easy to think of oneself as morally sound, with a firm belief in what is right and wrong. It's what Germans call the \"mercy of late birth\" - the luxury of not having been in the position to make that choice. <br><br>So, what made this movie worth giving the full 10 points out of 10? It is well-crafted, well-played, believable, at times even beautiful. It captures both the fascination Michael feels with Hannah, and his disbelief, even disgust while exploring the ugly truth about her past. It conveys the struggle between our compassion and the reluctance to show mercy against the ones who did not. It leaves the viewer with the same, disturbing questions that have not been answered sufficiently in the past 60 years (nor will they ever be). It does not provide simple answers, but rather raises more questions, left to be unanswered. As Lena Olin's Character says: \"If you want Catharsis, go to the theater!\"<br><br>Other than providing beautiful, well-toned cinematography, a well-written script, love of detail and convincing performances even by the supporting cast - what more can you expect from a truly great movie?","user":"topz-1","rank":[138,144]},{"title":"Winslet Impressive In This Two-Movies-In-One Story","rating":9,"date":"3 May 2009","review":"Kate Winslet is just outstanding in this very interesting film that is almost two stories-in-one. The first part is a sexual story of an older woman having affairs with a teenage boy and the second part is her war crimes tale and what happens afterward. The first is a somewhat happy jaunt of a short story and the second is a very serious and depressing story. That's where Winslet really shines. Obviously, she's developed into an an outstanding actress.<br><br>The second part is what most people, I assume, will remember about this film. Can \"Hanna Schmitz,\" a Nazi employee (so to speak), who was part of concentration camps, be a sympathetic character? To me, that's what it looked like that's the question the story was asking. The answer may have come in the final minutes of the movie when her ex-lover \"Michael Berg,\" now grown up and played by Ralph Fiennes, confronts a survivor of the camp. That, too, was very intense and interesting scene. Lena Olin is riveting as \"Rose/Illana Mather.\" <br><br>\"The Reader\" was full of quiet, but intense scenes. This is a very thought-provoking film, especially for one that doesn't start off that way but look almost like some soft-porn flick to get our attention. It is anything but that.<br><br>For Germans, this film must bring out many emotions and thoughts. Guilt and forgiveness are just two of the issues that are dealt with in this unique film. \"Hanna Schmitz\" turns out to be an incredibly simple-yet-complex person, unlike any I've encountered on film in a long time. You see her in all kinds of light, both good and bad.<br><br>Kudos, too, to David Kross' acting as the young Michael Berg. It must be strange for someone his age (barely turned 18) to do the scenes he did with 30-something Winslet.<br><br>Overall, a very different and excellent film that stays with you and makes you ponder its main characters.","user":"ccthemovieman-1","rank":[121,133]},{"title":"The Reader is a brilliant, sexually charged, and oddly heartbreaking tale about the complexity of human morality and the lifelong repercussions that result from our actions.","rating":10,"date":"8 January 2009","review":"There's an urgency in human nature to understand. When it comes to the Holocaust, history's bleak, unsettling period, it doesn't matter what book you've read, film you've seen or account you've heard; in the end, your response it halted by its incomprehensible conclusion. How could humanity course its way towards such a violent, destructive path? How could people knowingly send men, women, and children to their impending doom? Most puzzling, how could the world allow it? Even though its been 63 years since the blood-drenched annals of World War II, its aftermath today is still bone chilling.<br><br>After a six year celluloid dry spell, Stephen Daldry returns to the director's chair in a brilliant, sexually charged, and oddly heartbreaking tale about the complexity of human morality and the lifelong repercussions that result from our actions. Adapted from Bernhard Schlink's best-selling German novel, \"The Reader,\" Daldry's visual translation is a powerful, emotionally absorbing film that is one of the year's best. It's superbly crafted.<br><br>With World War II over, Germany, in 1958, is still recovering. Deep within Heidelberg, Germany, Michael (David Kross), a young pubescent teenager haven fallen ill, is comforted by Hanna (Kate Winslet), a hard working woman who is twice his age. Taken by her generosity, Michael revisits Hanna to offer his gratitude. What begins as an awkward reunion escalates into a seductive, forbidden affair that intensifies when Michael begins reading to the distant, empty Hanna, who is deeply awakened by Michael's spoken literature. Too young to understand love's complicated implications, Michael is emotionally devastated when Hanna suddenly disappears. Nearly a decade later, unable to forget his passionate summer while studying law, he attends a Nazi trail, and to his dismay, hears Hanna's distant voice.<br><br>\"The Reader\" is a complex film; maybe a little too complex for some. Though the film pertains to Nazism and the \"sins of our fathers,\" in essence, \"The Reader\" is a film that reflects the emotions inside all of us. During a lecture, Michael's professor comments, \"Societies like to think they operate on morality but they don't.\" In this cynical age, how far from reality is that statement? During Hanna's trial, she's questioned why she participated in the Nazi party's horrendous war crimes, broken she replies, \"It was my job.\" Oddly enough, that seems to be the justification most people use. Surprisingly, though, \"The Reader\" isn't about her exposure as a war criminal, but an exposure on an individual who took the wrong path. She's not a bad person; she's simply made wrong choices. However, when it comes to having involvement in the Nazi's liquidation of the Jews, how \"wrong\" can you get? \"You ask us to think like lawyers,\" cries on student, \"what are we trying to do?\" A distraught Michael replies, \"We are trying to understand!\" But, just who exactly is trying to grasp a deeper understanding: the court or Michael? How can Hanna's past be forgiven? Director Stephen Daldry brings the much needed emotional layer that a character such as Hanna Schmitz desperately needs. Although her actions are beyond unforgivable, strangely, we sympathize with her. Maybe it's her other shameful secret. Maybe it's superb character development.<br><br>\"The Reader\" is a film that is driven by it's raw performances. In one of her finest hours, Kate Winslet gives the performance of a lifetime. It's a haunting and heart-breaking. David Kross, who's only 18, is impressive as the teenager with raging hormones; it's such a daring performance. Winselt and Kross bring this picture together. Their performances are jaw-droppingly brilliant. Completing the role of Michael, as the tortured grown man, is Ralph Fiennes, who balances Michael's despair through his melancholic emotion when he encounters a grown Jewish woman, played by Lena Olin, who was also at Hanna's trail. Although her scenes clock in less than 10 minutes, Olin, too, is breathtaking.<br><br>When \"The Reader's\" credits rolled, I sat quietly shaken by what I had witnessed. It's a film that is impossible to forget. When a grown Michael asks Hanna, \"Have you spent much time thinking about the past?\" Heartbroken, she replies, \"It doesn't matter what I think. It doesn't matter what I feel. The dead are still dead.\" She's right.","user":"The_Film_Addict","rank":[457,533]}]