[{"title":"not gonna lie,..i cried","rating":7,"date":"31 May 2010","review":"For starters, i'm not a big critic of movies. And sure, this one wasn't very complex, the characters weren't surprising and there was no big twist at the end--but i thought it was compelling. I had just seen Amanda Seyfried star in letters to Juliet, and was surprised at the contrast in her two characters..so that has to say at least SOMETHING positive about her. plus i just think she's cute and likable.<br><br>and who knows, maybe i'm just a sap, or i watched it at the wrong time of day, but i did cry. It's the classic tragic love story. the relationship that everyone wants but no one really ever gets. and things just keep falling apart. Everyone knew the dad was gonna die and Savannah was gonna move on from John while he was gone..but something about seeing channing tatum cry broke my heart and i sniffled the rest of the movie through.<br><br>i certainly don't think you should buy it. i probably wouldn't watch it again. ( i rented it on 99 cent Monday at my local movie store) but my time wasn't wasted at all. you just have to be a girl in the right mood :)","user":"kirahheffner","rank":[25,28]},{"title":"I found it quite difficult to watch","rating":8,"date":"23 May 2010","review":"I will start by saying I have never read the book so I'm basing my review solely on the film.<br><br>I actually found the film very hard to watch and cried most of the way through. It is a very beautiful film but I think what is unfortunately overlooked my many is that the strongest relationship in the film is that between John and his father and it is this relationship that made the film very emotional for me. In particular scene following his fathers stroke where John was reading the letter was beautifully done and very well acted and was the scene I found most upsetting.<br><br>I think the film explores a number of important aspects in particular having an autistic parent which I could only imagine would be exceptionally difficult for any child, particularly when said parent is their only carer. As seen with the characters of both Aaron and Johns father relationships are often quite difficult for those with some types of autism, routine is important and going against a routine can cause a lot of angst and distress. Its unfortunate that a number of people continue to see autism as an excuse for peoples bad behaviour and I think this film brings and important note to an often misunderstood illness. It also points out the issue of autism in parents which is another issue often overlooked.<br><br>The relationship between John and Savannah is only secondary to that of John and his father and I think its well acted by Channing Tatum and Amanda Seyfried. To me both actors seemed to really feel and understand their characters and the hurt between them and I did like how the ending between them was really left open to interpretation.<br><br>In all a very well done film which explores some important social issues but no review will ever truly do this film justice. I for one could not watch it again because it made me so upset but this just goes to show how emotive the film is. Its a film that needs to be watched, even if it is only once.","user":"samyy_866","rank":[15,16]},{"title":"A lovely story with great characters","rating":8,"date":"5 March 2010","review":"Not having read anything about the film (or book) beforehand, I went into the cinema with no expectations, (though I was worried it might be a soppy, pull-at-the-heartstrings epic like The Notebook).<br><br>This wasn't the case. There were so many times when I thought 'Oh, I hope this doesn't happen', or 'I hope they don't do what I think they're going to do', and they didn't. There are moments of sadness, but some of them could have been made a lot worse.<br><br>The story isn't unique, (neither is The Notebook) but it is executed in a way that makes you feel as though you're watching something new. Channing Tatum is the lovable beefcake reminiscent of Marky Mark, and Amanda Seyfried is cute, delivering well executed dialogue. And I did actually think they had good chemistry, despite what other reviewers have said. Channing's John is an army boy who had a lot of issues growing up, so you can't expect him to be overly forthcoming with his emotions.<br><br>Richard Jenkins gives a great performance as the father, and even Henry Thomas is likable as the neighbour (I must be the only person in the world who hasn't seen E.T. so I didn't recognize the name at first).<br><br>To me, this was acted out a lot better (and even structured better) than Twilight: New Moon, which I assume is meant to appeal to the same audience. I know to some that isn't saying much, but perhaps our expectations are a bit high these days. If you want to see a sweet love story with likable characters, then you might just enjoy this film.","user":"misskirsty","rank":[56,70]}]