[{"title":"Funny.. worth a watch","rating":6,"date":"15 February 2009","review":"This movie is strangely filmed with comments from the actors every five minutes after something slightly interesting happens. It's a funny film with a few exciting scenes, kind of predictable but worth watching once if you have a few hours to kill! The acting is laughable at times with many parts reminding you of a school theater production, but this adds to the laughter and makes it more interesting. Kaley Cuoco doesn't bring much to the role apart from her great looks, she should really stick to TV and rolling out one-liners. Tries to be gory but doesn't make you want to hide behind a pillow! Swear words are thrown in a lot which make things slightly more entertaining but in the long run remind you more of watching a porno! Overall this movie was as expected, probably funnier if watched in a Cafe in Amsterdam, if you get my drift..","user":"dgilmartin-1","rank":[12,16]},{"title":"Above Average","rating":7,"date":"7 June 2010","review":"Compared to 90 percent of the horror films released over the past little while this one stands a head and shoulders above the competition. There is a blend of comedy and horror which works well since the entire concept of horror has fallen by the wayside due to the vast number of similar films that have been made in the genre. Horror isn't frightening the way it used to be, so why not make fun of the genre? A mostly younger cast work well here, playing off the fact they are younger and pretty much regarded as mental light weights by the general public. They are really not that dumb when you get right down to it. Good Job...","user":"alienworlds","rank":[9,14]},{"title":"killer movie: not your typical slasher","rating":10,"date":"20 April 2008","review":"\"Killer Movie\" succeeds because of three elements that are sorely missing for the majority of horror films these days: thrills, titillation, and wit. This is a diamond in the rough.<br><br>A long time ago in a galaxy not so far away, the slasher genre was a reliable source of entertainment. Sadly it has devolved into a breeding ground for the most shallow, talentless people in the film industry. It seems there is no room to make a movie that's actually, well, GOOD, just profitable. Every \"creative\" decision is borne from the desire to make money. And of course, throngs of people flock to the theaters and eat it up.<br><br>Against such a grim backdrop, it is a cause for celebration when a movie like \"Killer Movie\" comes out. Here's a slasher film that adheres to all of the conventions of the genre without pandering to the lowest common denominator. Horror fans will love this, and I predict it will do extremely well commercially. <br><br>The story is of personal relevance to its director (a former reality TV director), and the results are funny and scary, often at the same time. Fisher had previously worked on shows like The Simple Life and Real World, and it's easy to see how the experience affected him. I guess the best way to segue from reality TV into the film industry is to make a film about a reality TV show crew being MURDERED.<br><br>\"Killer Movie\" is an impressive debut, and I look forward to whatever Fisher does next.","user":"Leven321","rank":[21,49]}]