[{"title":"Mary & Max - wonderfully unique and personal animation","rating":8,"date":"14 April 2009","review":"There's a constant stream of animated films these days, but mostly they're either glossy Hollywood product (Pixar/Dreamworks), or Japanese anime. For adults wanting something different we have to wait for the likes of The Nightmare Before Christmas, Waltz With Bashir, Persepolis, or Aardman's films to turn up. Mary &amp; Max is one of these films that comes as a complete departure from all the others, both in visual and storytelling style, and sticks in the mind because of it. I won't repeat the plot here, so I'll just mention a few pros and cons. The cons are obvious. Some people will be put off by the almost constant narration (which took me a while to get used to), the rather numerous calamities (a lot more than you'd expect if you thought this was just a kids film), and the sadness within some of these people's stories. It's actually a little surprising that the film got made without the people financing it demanding a script that was more tailored to appeal to a wider audience. What we get is something that feels a whole lot more personal than the higher profile animated films. It feels personal, and therefore real, and the explanation is that it was written from life by a director who has a real feeling and sympathy for people who don't quite fit into the world, and feel alienated or are misunderstood by others. Mary was partly inspired by the director's own childhood (and there's a little bit of Toni Collette's Muriel Heslop thrown in I suspect), and Max is also based on a real person he's been pen friends with (but so far has never met in person). The way the film handles his Asperger's Syndrome just feels different to how you'd normally see such an issue handled on screen. There's a constant stream of humour (ironic, black, childish), and I really enjoyed the small perfect touches on growing up in an Australian suburb in the 70's and 80's, and the depiction of grey New York, as it appears to the easily frightened Max. The animation is constantly a joy to watch, and I highly recommend seeing it on the big screen where it can be properly appreciated in all it's hand-made glory.","user":"MatthewInSydney","rank":[166,191]},{"title":"Masterpiece!","rating":9,"date":"31 October 2010","review":"To say it short, this movie is about a friendless 8 year old girl in Australia who befriends an obese 44 year old male in New York by writing mails to each other.<br><br>I'm not a big animation fan, so I wasn't looking forward to see this movie. I am currently working on the IMDb Top 250 list and Mary and Max just entered the IMDb top 250, so I took a look at it.<br><br>I watched it with a small screen on my computer while chatting with someone on Facebook. But then I logged out because I got hooked by the fantastic but sad narration mixed with humor by Barry Humphries, so I watched it with a big screen. Thank God that I did that, because this is an unforgettable and heartbreaking cinematic experience! It got fantastic narration and dialogue that will make you laugh and cry!<br><br>PS.There are many scenes that will choke you up, so bring some tissues.<br><br>PSS.Don't watch this movie with your kids!<br><br>I hope this review was useful!","user":"jon-larsen","rank":[52,59]},{"title":"lovely oddball and admirably complex","rating":10,"date":"22 March 2010","review":"Coming from Australia, Mary and Max is one of these few films you'll remember all your life. This amazing claymation touches upon an unlikely friendship between two pen pals: a young girl living in Australia and an aging Jew from New York. It's unbelievable what a precisely structured narrative this is. Director-writer Adam Elliot blends odd scatological, yet clever humour with poignant dramatizations to a splendid effect creating one of the best tragicomedies of the past few years. The fact that it's in the form of claymation only helps to enhance uniqueness of the whole experience. The movie was 5 years in the making and this is visible in its every frame. Elliot masterly captures the motion in an endlessly creative manner. Most importantly though, his lovably oddball characters are well developed and admirably complex with all their awkward traits and quirks. Due to its serious themes and dark tone, Mary and Max is an adult movie aiming much higher than its big studio counterparts. It happens to be more contemplative, and intelligent mimicking the real life with all its ups and downs. Calling Elliot's movie an extraordinary piece of art is certainly not an overstatement.","user":"manicman84","rank":[80,95]}]