[{"title":"Sweet movie! Good laugh and night in. Enjoyed it a lot!","rating":7,"date":"10 December 2007","review":"Having not seen the previous movies to this, I am judging this movie solely as a standalone. Firstly I don't really like movies where there is no action/suspense and fighting (typical guy movie) but to be honest I quite enjoyed this movie. The movie has a good mix of characters with their own reason for joining a cheer leading team. Throughout the movie you do understand why they would want to join such a team. The movie has a good selection of songs and very cool dance moves with a lot of hot girls ;) The movie isn't just another teen flick to come of the Hollywood conveyor belt because it does actually flow and have a fun story line to it. I would not go out and watch this in the cinema because personally I don't feel that its a big hype movie. Non the less it is very fun to watch and does not bore you. I watch some movies and they are so rubbish that most of the time its on I just wonder about something else. There was not one moment in this movie that I was bored by it! Great movie to watch in with your partner and would highly recommend! Cheer leaders rule!!<br><br>*** *** SPOILER WARNING!! DO NOT READ IF YOU DON'T WANT TO KNOW WHAT HAPPENS!<br><br>The movie has a basic plot outline; a team of rival cheerleaders want to make it through a competition to represent America in the internationals. The two rivals the Sharks (the goodies) and the jets (the baddies) meet at a camp where they must compete to win. During the visit they are given a lucky charm by an instructor which they can't lose...what do they do&gt; lose it! Due to this an an evil curse is released upon them leading to catastrophe. To have a chance of making the internationals they must join forces to take on a highly skilled opposition team! In between this there is a love story between sharks captain and a member of the jets leading to a lot of trouble and mischief. The dance moves are awesome! and carried out well. I won't tell you who wins the competition...watch it!!","user":"killer_instin29","rank":[28,34]},{"title":"Pretty and lots of fun","rating":8,"date":"14 December 2007","review":"This movie was fun to watch. If you like cheerleading and just watching it with some upbeat music playing in the background, that's what Bring it On: In it to Win has to offer. There was an obligatory spirit stick and cheer camp, and some East Coast vs. West Coast rivalry with a few references to West Side Story, but mostly it was a lot of excuses to have some cool routines on camera. They cheer in a camp that is sort of a pseudo-Disneyland, which was pretty interesting in that they have a lot of fun backgrounds that can look sort of fake but fun and vacation-ish. Everyone is pretty, from the blonde captains and vampire goth girl to the black best friend and \"gay\" guy. Oh, and the half Filipino-half German love interest of the protagonist is really cute, and the first scene he is in, he is topless. In any case, this was brainless eye candy that was fun and just, a lot of fun.","user":"kathleen-pangan","rank":[16,20]},{"title":"Slender and Fit","rating":8,"date":"28 December 2019","review":"Athleticism, slender legs, pretty legs, thin legs, eye candy chicks and very natural (but unusual for fattyville middle America).\nNot 10/10 because it has too many attempts at humor.","user":"hnjilcp","rank":[11,13]}]