[{"title":"Taut and well acted but with a nearly unforgivable ending","rating":7,"date":"23 October 2008","review":"Seven. Yes, seven. No, I'm not talking about the David Fincher directed thriller, nor am I referring to Samurai, Dwarfs or the lucky number. In this context, seven denotes the number of wince inducing minutes it takes for Lakeview Terrace to throw it all away.<br><br>Particular genres of movies tend to have a nasty propensity to ruin their final acts, the foremost of those being thrillers and horror films. May it be an amateur director not knowing how to complete their vision, studio intervention sucking the life from the screen or the commonly occurring revelatory \"shocker\" ending which tries to jam too many ideas in the viewer's already bleeding sockets. Oddly, director Neil LaBute's latest offering does not succumb to a conventional destructive timeline, but instead opts to cataclysmically implode in literally the final scenes, a feat which few films can boast. Perhaps I am being an iota harsh, as I am recommending this film and the majority of this review will be skewed favourably, but chiefly, my unbounded feelings of contempt towards the finale should stand as a testament to their standalone absurdity which contrasts harshly with the preceding 90 or so minutes.<br><br>Samuel L. Jackson has had a vibrant career portraying characters in two spectrums of the acting realm. On one side we have his depictions that can be lumped into the loud-mouthed anti-hero category (Pulp Fiction, Die Hard with a Vengeance, Snakes on a Plane), and on the other, his more nuanced (as nuanced as Sam Jackson can be) roles. (Black Snake Moan, Resurrecting the Champ, Coach Carter) Lakeview Terrace to some extent blurs this boundary, but for the most part Jackson plays his role straight, and he is very good because of it. Jackson plays Abel Turner a veteran, but widowed LAPD officer who lives his daughter Celia (Regine Nehy) and Son Marcus (Jaishon Fisher) on Lakeview Terrace in the hills. He is strict to be sure and his protective nature sometimes obscures the obvious affection for his children. It is touches like this, and similar additions by LaBute that makes his character all the more menacing when the tension later builds, as he is not so much a faceless villain, but a deeply flawed everyman. Despite an encroaching wildfire, things are routine on Lakeview; Abel patrols the neighbourhood at night, loves his job and wants nothing more then to protect his family. Things change however when a new couple move in next door. The fact that husband Chris (Patrick Wilson) wife Lisa (Keri Washington) are interracial is only the fuel for Abel's contempt, and when his children witness a late-night skinny dip by these two newlyweds, the fire erupts and Abel and Chris' lives spiral out of control.<br><br>Fashioning Abel as a cop is an intelligent choice, as per the television advertisements indicate, what are they going to do, and who are the authorities going to believe; who will police the police indeed. The tension for the duration is so high, you don't even need a knife to cut it, and a definite sense of dread and menace perforates the narrative. LaBute, truthfully, makes few mistakes, he allows for character development, and as I mentioned not just regarding Chris and Lisa, lets the story develop at a slow burning pace, with the hillside fires mirroring the escalating tempers. The story is also far more insightful and caring then I ever would have anticipated regarding the complicated issue of race and marriage, without feeling shoehorned into the thriller template. As you can clearly discern I have a fairly large amount of admiration for Lakeview Terrace, which brings me to the ending.<br><br>Few endings I have seen have represented such a radical shift in tone, and made its characters undertake such ridiculous and uncharacteristic actions then we see here; and I assure you it is jarring. The immediately preceding act, is an iota off kilter with the acts preceding, but does not draw attention and properly illustrates the consequences when things are taken too far in the name of retribution. I was fully under the impression that things were going to end sharply until Abel's character jolts erratically from intelligent saboteur to volcanic lunatic and makes a series of choices that are against both his nature, and what the audience would want to see transpire. Either Abel lost his mind, or the director did. Those who seek out this film in theatres may be disappointed and feel the conclusion somehow managed to bilk them out of their cash like a sneaky pickpocket. LaBute's finale does not so much embody a slap in the face, but a swift hard kick to the groin.<br><br>Read all my reviews at Simon Says Movies: http://simonsaysmovies.blogspot.com/","user":"Simon_Says_Movies","rank":[98,138]},{"title":"if only they could've come up with a more CREATIVE ending","rating":7,"date":"15 December 2008","review":"There's an inherent problem with making a movie of this kind: unless you're a creative genius of your time, these sorts of movies have the potential to turn real generic, REAL fast. <br><br>Reminiscent of Denzel Washington from Training Day, we see Samuel L. Jackson play an overly aggressive cop with an agenda, with the movie focusing on the problems he's causing for his new neighbors. A completely realistic situation that can take place anywhere. Problem is, because a movie like this is completely character driven, after you have the nice slow build up to the climax, once the tension snaps, you're relegated to basically a generically default final act of the movie where \"the bad guy finally comes out of the proverbial shadows and literally chases the hero.\" (i.e. Disturbia, The Glass House). It's a shame too because the buildup on this was very good. Samuel L. Jackson was really scary here, he played that bullying, obsessive character perfect. The only acting problems I saw were 2-3 moments from Kerry Washington where her sad face was done poorly, with overly done lip quivers and facial movements (similar to Kirsten Dunst's crying scenes from the Spider-Man movies, except done in a BAD way).<br><br>With a movie like this, you pretty much have these possible outcomes: <br><br>1) the generic, semi-predictable ending (like we got here). 2) tragic ending with hero dying at the end. 3) an unpredictable twist coming out of left field (this has the potential to be very good or very bad). 4) a Great ending.<br><br>Unfortunately we usually get number one, since they wanna give the satisfying, safe, effective, tried and true, Hollywood ending. Most people are content with those types of cop out endings. I'm not.","user":"Netscape_Navigator","rank":[71,98]},{"title":"Probably the first movie about racism that doesn't just spout tired clichés.","rating":6,"date":"2 October 2008","review":"We've all heard the \"racism is evil!\" thing preached, preached again, and then preached again. We get it: racism is bad. I'm not racist. I don't know anyone who is racist. Why does every single movie have to remind us of something we teach our children before they're old enough to talk? After I watched Hairspray and Be Kind Rewind in the past year alone, I officially had enough. And not only me. At the time, my best friend, who was born and raised in Africa then moved to the US, said the same thing: why can't movies just stop beating a pointless, dead, blood horse? If someone is racist, I doubt a movie is going to change their mind. Then, out of nowhere, Lakeview Terrace comes along and defies every cliché you thought you knew about racism movies. And that is really all I have to say about the topic: thank God that someone, anyone, in Hollywood gets that we're sick of being force-fed clichés. Why is Lakeview Terrace cliché-defying? It focuses on the gray aria of racism, not black-and-white. It focuses on racism held by blacks, not by whites. It veers so far from the \"racism is evil!\" standpoint, and makes you make up your own mind about the over-the-top plot and who was right, who was wrong. It's been so long since Hollywood actually let the audience make up their own mind, this is like a breath of fresh air.<br><br>Lakeview Terrace is labeled as a thriller, which is half true. The first half builds up the social boundaries of real life, testing them, and then building them up stronger. It doesn't jump straight to action, but soaks you in reality before plunging into the over-the-top ending. When the action starts, near the ending, it is really worth the weight because it has you in a state of social tension. Anyone who says this isn't realistic doesn't understand realistic human behavior. Even in the most outrageous parts of the film, there was not a single thing done by anyone that was hard for me to believe could happen in real life. Maybe that's because I have a lot of cops in my family, or maybe it's because I'm just more tuned into reality than the optimistic-happy-\"Humans are perfect!\" people that are reviewing this film and calling it unrealistic.<br><br>The directing, writing, and technical details are all fine. They're not artistic or \"find cinema\", but they're done in a way that makes the film work. The acting from Samuel L. Jackson is flawless. The casting from certain other characters is a little off, but it works out in the end.<br><br>Overall, I liked Lakeview Terrace a lot. I'm the kind of person who loves thrillers, but as I said, this really isn't a thriller as much as a drama with a thriller-like ending and some thriller-like scenes scattered throughout. It's a nice break from the unintelligent mess that has become an anti-racism subgenre, and a nice break from the intense hardcore horror and action movies I enjoy watching. With that said, it didn't bore me, which really surprised me. Lakeview Terrace isn't perfect, it's not a work of art, but it's intelligent. I found it very much worth watching.<br><br>6/10","user":"Jacques98","rank":[89,136]}]