[{"title":"The Critics Were Wrong...","rating":8,"date":"23 May 2010","review":"\"Not only is Singer's film-making aesthetically frustrating (lacking coherent visual rhythm) but his juvenile regard of the July 20, 1944, plot to kill Hitler -- one of 15 documented attempts -- is intellectually insulting...\" New York Press The above is the usual negative commentary you'll see regarding this film. Critics bashed it for being insulting, unoriginal, and unmoving. Let me make some corrections for them so that they can save a little face.<br><br>I'm no Tom Cruise fan. A buddy of mine, too, is so peeved at Cruise that he refuses to watch anything the man stars in. Mostly this has to do with Cruise's personal life and beliefs (just watch an episode of South Park to see how some people view him and you'll see what I mean). People have similar feelings toward Mel Gibson ...but I digress.<br><br>VALKYRIE, as most of you probably now know, is the final of 15 attempts on Hitler's life. Shortly after this (about nine months) he committed suicide in his bunker. But this is about the one time where it almost succeeded. I'd heard about this attempt and read bits of it in history classes, but never really gave it much thought. I mean, the mustachioed murderer offed himself, so that was that. But what gives this film much of its umpf! is how true to history the story sticks (that and how closely many of the actors resemble their true-life counterparts). It is also riveting coming from director Bryan Singer (who did one of my all-time favorite films, THE USUAL SUSPECTS).<br><br>Tom Cruise did a great job (probably one of his best since COLLATERAL and MINORITY REPORT). His Colonel Claus von Stauffenberg character was spot-on ...with one exception that seems to be a sticking point for many: his accent. It is true that none of the actors attempts a German cadence in their speech. Did this bother me? No. I think it would have bothered me if they'd TRIED to do one and made it sound forced or ridiculous. So there's that...<br><br>What makes the film a success was Cruise's rock solid performance and the amazing supporting cast: Kenneth Branagh, Bill Nighy, Tom Wilkinson, Terrence Stamp, and Eddie Izzard just to sprinkle a few names.<br><br>It is also noteworthy to mention that they filmed nearly everything on-location and in the exact same spots where the original incidents took place, including the subsequent trials and executions of the conspirators. Phenomenal authenticity.<br><br>If the cadence of their speech bothered some, then I failed to see how the cadence of the film could. It was absolutely perfect. It gradually built up suspense (even though we knew how it would end for the conspirators), and never slowed, right up until the very end. I am forced to use a cliché here in that \"I was on the edge of my seat\" throughout the second half of the film.<br><br>So if you're looking to tear apart Tom Cruise, you might look at WAR OF THE WORLDS or LEGEND. But not here.","user":"fwomp","rank":[24,25]},{"title":"The Failed Plot Against Tom Cruise","rating":8,"date":"9 January 2009","review":"I'm appalled at the way the specialized and not so specialized media attacked Tom Cruise for this movie. Why? He's not just good but very good in his against type performance. I've heard critics calling him \"distractingly bad\", how ridiculous and nasty. The film by the great craftsman Bryan Singer is a suspenseful, beautifully made historical thriller with a remarkable attention to detail. In an effort to be accurate the Jews are never mention because in fact the attempt to assassinate Hitler had nothing to do with that. The real reason? The war had turned against the Germans, it was clear that they were entering a down spiral and Hitler's madness was at the center of that. Regardless of the fact we know how the story ends, the movie manages to be a gripping tale based on real events. Well done Mr.Cruise, you won! Your Valkyrie is performing stupendously at the almighty box office.","user":"marcosaguado","rank":[313,385]},{"title":"Great movie and thank god for IMDb!","rating":8,"date":"25 December 2008","review":"First, I want to say that some time ago I learned to distrust critics and instead read the reviews here on IMDb. I've never been misled, even when an equal number of viewers liked and disliked the same movie because that let me know there was a matter of taste in play, and that's fine. Sometimes a movie pleases everyone, but that's so rare I cant really think of one. People have different tastes and that's good. But the value of IMDb reviews is that they are based on a genuine response to the movie - not a bias, or some other agenda.<br><br>For example, the Fox critic Roger Friedman listed this movie as one of the worst of 2008 - without having seen the movie. That's right. He rated it without seeing it. It was a classic and reprehensible case of bias and perhaps even bigotry since he was engaging in Tom Cruise bashing which is usually practiced in conjunction with dissing Tom's religion.<br><br>So I don't trust critics to tell the truth or give an unbiased review.<br><br>I saw Valkyrie and enjoyed it immensely. I've studied the Hitler period and was familiar with most of the events but the movie educated me while it thrilled and entertained me. It is a movie I was happy to take my teen-aged children to see because it also educated and entertained them. I thought the cast did a great job. The script was outstanding and the direction excellent. Tom Cruise gave a dimension to Von Stauffenberg that deepened my understanding of the events. The supporting cast were brilliant. <br><br>I highly recommend it.<br><br>PS. It's some time since I wrote this review and I took thirty minutes tonight to read the other reviews on this movie, not surprisingly they are mostly very positive and unanimous in praising it. Interestingly, the critics, including the one named above, who trashed the movie without even seeing it, obviously did so in an effort to kill it at the box office. While many other reviewers noted this too, I'd like to point out that those critics and possibly some of the people who 'dont like Tom Cruise because of his weird religion' are actually following the same path that made it possible for Hitler to kill off millions of Jews who also had a 'weird religion'. Considering the historical background of Valkyrie I find that quite ironical.","user":"petsteph1","rank":[713,922]}]