[{"title":"Definitely a Sci-Fi film to remember","rating":9,"date":"17 April 2011","review":"The future of movies doesn't seem too bright since all we're getting are remakes, adaptations and unnecessary prequels/sequels and that's why original stuff like SOURCE CODE can really make my day.<br><br>Honestly, the trailers and initial premise didn't seem promising; some soldier can travel back in time and has to stop an some evil terrorist from bombing America. At first glance it looked more like some patriotic Steven Segal movie written by Tom Clancy with a higher budget and better actors. And then you watch it.<br><br>Like INCEPTION, this is one of the few movies that you can't spoil since even the smallest detail could accidentally reveal a twist or two. The story itself is a very original blend of thriller, sci-fi and drama and it works. Full of unseen twists and with a high octane pacing, SOURCE CODE will keep you wanting for more as each answer is slowly revealed. The script helps too but its the actors, who deliver the lines well, who drive the movie into emotional levels. My only problem with the film is some weak foreshadowing but it thankfully doesn't affect the movie in a bad way and to give any more details would spoil the film. <br><br>To keep it short and to avoid accidentally spoiling a plot detail or two, SOURCE CODE is a must watch. It's one of the few original films out there in a market full of crap and it's definitely worth your money. It's just a pity that Hollywood doesn't seem to be supporting these kinds of films.","user":"darkraven_109","rank":[224,284]},{"title":"Intellectual Thriller","rating":8,"date":"8 April 2011","review":"My first glance, I thought it's gonna be an ordinary action movie. The guy will look for the bomber, He'll find the bomber, he wants to save the girl, Eventually he saves the girl. But the movie isn't like that. The movie ends up having mysteries with unpredictably smart revelations. It's not an action blockbuster cookie cutter. It's a unique kind of movie that intrigues the whole cinema and let us enjoy the ride in a new way.<br><br>\"Source Code\" is not a clichéd mediocre action blockbuster. The movie avoids being predictable and wants to be smart and mind-bending. Duncan Jones isn't the kind of director who cares about the action. By the way this is his first action movie but he's smart for not making super cool unrealistic action scenes. He cares about the story. The movie have many intriguing subplots that is not easy to figure out. The movie wanted to be as smart as possible.<br><br>The performances were great. Jake Gyllenhaal made the whole game exciting. Michelle Monaghan shows her role's innocence. Vera Farmiga is obviously good in here. Jeffery Wright is the best among the four. The rest of the filmmaking, Chris Bacon's music score sounds old fashion and I liked it. The effects isn't really that great but it doesn't matter. The script is indeed smart. The movie also has a heart.<br><br>\"Source Code\" is as good as \"Limitless\". Both of them had the same reason why is it good. It's smart, intriguing(I've said this word many times in this review), and indeed original. Most action movies these days wanted to be super cool and super loud. \"Source Code\" doesn't really have a big action but it's more fun, made more sense and it's super smart.","user":"TourettesPersonal","rank":[285,393]},{"title":"Suspenseful thriller with a twist","rating":8,"date":"11 March 2011","review":"I was very fortunate to be at the World Premiere at SXSW in Austin and attended the Q&amp;A after with James Duncan, Vera Farmiga, Michelle Monaghan, Jake Gyllenhaal and Ben Ripley. The story line keeps you on the edge of your seat and adds in enough humor to make it a thoroughly enjoyable experience. There is amazing, subtle chemistry between Jake and Michelle which really is the star of the film, performances by all the actors are excellent. Beautiful cinematography that will make Chicago proud. The ending brings up more questions than answers, but it feels right, so that's OK with me. I am not a big sci-fi fan, but this film delivers on romance, suspense, mystery and thrills. Highly recommended.","user":"lmelnick-999-260424","rank":[281,399]}]