[{"title":"An ode to Cinema","rating":8,"date":"28 December 2012","review":"Since its release, I've been confused why Martin Scorsese made this film. I knew very little about it of course, only that it was an adventure movie about an orphan boy living in the walls of a Paris train station. It certainly doesn't sound very Scorsese-like.<br><br>However that is merely the framing for what is an ode to the earliest days of cinema, and in particular one of its true pioneers, Georges Melies. With references to \"Arrival of a Train\" – one of the world's first films by the Lumiere brothers, Melies's \"A Trip to the Moon\" and many others, this really is a treat for movie fans. Yes on a very basic level it is a children's movie, but really there's far more here for adults. Scorsese wonderfully juxtaposes his most technologically advanced film yet to demonstrate the genius and inventiveness of cinema in its earliest days. <br><br>There are fine performances from the two children, as well as Ben Kingsley as Melies and Sasha Baron Cohen as a determined and love struck station inspector. I actually thought that Helen McCrory stole the show as Melies' wife Mama Jeanne. <br><br>I never got to see Hugo in 3D, but the blu ray version looks truly sumptuous, with some breath taking imagery of early 20th century Paris. The film does tailor off significantly towards the end, with Scorsese seemingly unsure of what to do with the final act once the children had solved their mystery. What comes before is truly magical though and this film gets a big thumbs up from me.","user":"mike-wright-1","rank":[21,22]},{"title":"Martin Scorsese's Love Letter to Cinema","rating":9,"date":"30 May 2012","review":"Martin Scorsese's HUGO is a family movie that will probably only cater to a niche crowd: people who appreciate movies as art (e.g. cinema snobs, though I use the term endearingly). I'm not saying it won't appeal to the general masses. It's still an interesting story, wonderfully acted, and packed with talent both in front of and behind the camera. But let's face it: this isn't your average movie, it's a love letter. Scorsese has been a vocal supporter of restoring old movies in hopes they'll be saved from oblivion (rightfully so) and this movie, based on a children's book by Brian Selznick, is his method of beautifully pleading his case before millions of people who've probably refuse to watch black and white movies on the basis that they're, you know, black and white (yes, I know those sorts of people). HUGO is a film meant to bring out attention to the movies long-forgotten and remind us of the magic behind them, told through the adventure of a young boy named Hugo Cabret. Hugo is an orphan whose father died in a museum fire, and he lives behind the walls of a Parisian train station. When he's not busy with his job of keeping the station clocks ticking, Hugo spends his time repairing an old automaton his father rescued from museum storage. An encounter with a curmudgeonly toy store owner and his granddaughter Isabelle will send Hugo on a journey to repair the automaton and discover its long-hidden secrets.<br><br>As I mentioned, this movie will only really appeal to certain people. Scorsese fans might be put off by the fact that this film is a family-friendly adventure; it doesn't exactly fall in line with Scorsese's usual subject matter. The family crowds will probably enjoy it, but younger children will likely be put off by it's slow pacing and lack of excitement. It's not so much an adventure as a journey of discovery, and little kids might not find themselves too involved in the story. My own daughter (4, going on 5) gave it an honest try when we sat down to watch it and made it 40 minutes or so before she fell asleep. Unfortunately, HUGO will probably be one of those films that fades into the background (if it hasn't already) and find most of it's loving coming from the film school crowds. The movie incorporates a loose interpretation of the life of Georges Méliès, a stage magician and an early innovator in world of cinema who realized the potential for the new medium of storytelling. At a time when most \"movies\" were just real-world situations recorded to celluloid (such as the famous train pulling into the station), Méliès created fantastic stories and mythical tales to entertain, filling his films with special effects and dramatic costuming. The movie focuses on the fact that so many of Méliès' films were lost over time and the tragedy of these classics from one of the earliest, most important filmmakers, ceasing to exist.<br><br>Scorsese makes his message perfectly clear in the final half of the movie, which happened to be my favorite part of the film. Ben Kingsley is Papa Georges (Méliès) and, in the film, he is a defeated man who mourns the death of his legacy following World War I. Kingsley is perfect here and the highlight of the movie. The children in the film, Asa Butterfield and Chloë Moretz, do a serviceable job but, as is usually the case with younger actors, their performances come off as forced and wooden most times. Even Moretz, who's performances I freakin' loved in KICK-ASS, doesn't feel real here. Maybe it's just that Scorsese isn't accustomed to working with younger talent and wasn't able to bring out the best in them, but it's a shame because the two of them are the key players in the movie. There's a handful of other minor roles filling out the film with talent: Christopher Lee, Ray Winstone, Jude Law, etc. My favorite would probably be Sascha Baron Cohen (yes, Borat) as the station inspector. With his Doberman patrolling by his side and the frame providing support for his bum leg, he was almost cartoonish. I loved him, and he was more than capable of toning down his usual eccentricity. HUGO is a movie with a lot to love, even more if you're a cinema snob. I really enjoyed it, but a slow first act and weak performances from the kids mean it's far from perfect. HUGO has my full recommendation for anyone who might want a glimpse into world of a true film-lover.","user":"brando647","rank":[60,71]},{"title":"A Wonder for Any Cinema Lover","rating":9,"date":"2 March 2012","review":"In the late 20's, in Paris, the orphan Hugo Cabret (Asa Butterfield) is a lonely boy that lives hidden from the cruel Station Inspector (Sacha Baron Cohen) behind the walls of the train station, keeping the clocks working. He survives stealing breads, milk and other nourishment from the station stores. Hugo's father (Jude Law) was a watchmaker that had taught Hugo how to fix clocks and gadgets and died in a fire in his workshop. Then his alcoholic Uncle Claude (Ray Winstone), who is the responsible for keeping the station clocks working but vanished months ago, brings Hugo to work with him. <br><br>Hugo is trying to fix an automaton, the only memorabilia he has from his father, stealing parts from the bitter and cranky owner of a toy store, Papa George (Ben Kingsley). However it is missing a heart-shaped key to make it work. Hugo believes that the robot possesses a last message from his father. When George holds Hugo, he takes a notebook from the boy with the notes that he is using to repair the automaton. <br><br>Hugo follows George and meets his granddaughter Isabelle (Chloë Grace Moretz), who is raised by her grandparents after the death of her parents. Isabelle befriends Hugo seeking to live the adventure of her life. When Hugo sees that the girl has the key that he needs, he brings her to his hideout and the automaton works and draws a poster from 1902 George Méliès' film \"Le voyage dans la lune\". Hugo and Isabelle continue to research about the filmmaker and they find a hidden secret about George Méliès.<br><br>\"Hugo\" is a wonder for any cinema lover, with a great tribute to George Méliès. Martin Scorcese delivers his best film after many years, with a wonderful story of a boy that fixes machinery and ends fixing the heart of an old man.<br><br>It is unbelievable that users without any cinema culture give low rating to a film that is a great homage to the silent movies, with many references along the story. The boy Asa Butterfield, from \"The Boy in the Striped Pyjamas\", gives another excellent performance and the girl Chloë Grace Moretz, who has a lovely smile, shows a fantastic chemistry with Asa Butterfield.<br><br>It is intriguing that at least three movies nominated to the Oscar 2012 have points in common: \"The Artist\" is a film about the transition from the silent movie to the spoken films; \"Hugo\" is set in Paris in the late 20's and has references to actors, actresses and directors of the silent movies; and \"Midnight in Paris\" is also set in Paris in the 20's. My vote is nine.<br><br>Title (Brazil): \"A Invenção de Hugo Cabret\" (\"The Invention of Hugo Cabret\")","user":"claudio_carvalho","rank":[38,51]}]