[{"title":"Thumbs up for St Trinians","rating":7,"date":"22 December 2007","review":"St Trinian's was never going to be a classic of British cinema and I am glad that it doesn't really try. The worst I can say about the film, is that it is constantly entertaining, which I find is a rarity now days. It could and should have been a complete disaster, fortunately it is harmless silly fun. The plot is dumb and the humour is never laugh out loud funny but I always had a smile on my face and I left the cinema more cheerful than when I went in, which is always a good sign.<br><br>I was quite happy with the acting in the film. Russell Brand is not the greatest actor in the world and a few of the girls are a bit grating but most of the main characters are OK, with good performances from Gemma Arterton and Talulah Riley. Colin Firth plays it gloriously straight though out and has some wonderful moments, whilst Rupert Everett is a constant joy to watch as Miss Fritton/Carnaby Fritton.<br><br>I won't go on about the behind camera stuff because that would be a bit pointless, apart from to say that it does the job. The editing had its moments and I did enjoy the little animated scene half way though. Although not really my taste in music generally, I thought the soundtrack was very good and suited the mood of the film well, although I would have like to have heard the St Trinian's original theme at the beginning of the film, if even for a few moments.<br><br>I was over all very happy with the film and am glad I went to see it, it ticked most of the boxes which I wanted and rarely let itself down.","user":"michaellaing71","rank":[91,130]},{"title":"I enjoyed it, more than I thought I would","rating":9,"date":"4 January 2008","review":"I was a bit nervous about going to see St Trinian's, because I've seen all the previous films and was worried by the title and the trailer-glimpses of Rupert Everett that this film would try to 'overwrite' the original. It doesn't. This is why I think it works. Like the sequels from the first film, once again St Trinian's moves the concept into its own era. It's jam packed with innuendo and humour and a new plot line. Perhaps it'll never be as good as 'The Belles' but then, none of the other sequels were as good as 'The Belles' either, and they didn't try to be. The spirit of the thing was there and it was good fun to watch.","user":"Localfreak","rank":[32,46]},{"title":"WARNING- This film WILL surprise you.","rating":8,"date":"8 January 2008","review":"From the ashes of Ealing rises a film worthy of the studio name.<br><br>A fun packed, good natured, girl-powered romp complete with obligatory wacky robbery plot so beloved of the studios' classics. Though the plotting wavers the abundant energy carries it through with hardly a glitch. Rupert Everett is a revelation and Colin Firth wisely plays it straight even whilst sending himself up. <br><br>A very UK film with lots of in-jokes for us 30 somethings (loved the 'Another Country' line), funny lines and nicely sketched stereotypes for younger girls to admire and younger boys to fancy.<br><br>Great for a family trip or as a personal time-passer, it sold out continuously in Glasgow for weeks, although a sequel really isn't warranted.<br><br>Enjoy it as the stand alone little gem it is, harking back to the days when films were self-contained little classics rather than potential sequel spinners.<br><br>My comedy of 2007!<br><br>P.S.- Remember to stay for the 'Girls Aloud' title song credits!","user":"bml84","rank":[41,61]}]