[{"title":"So Flawless It Looks Effortless","rating":10,"date":"15 June 2008","review":"Cherry Blossoms was just one of 15 films I have seen this year at the Seattle International Film Festival, and it has beaten my previous favourite from the festival this year, 'The Home Song Stories', into first place. Cherry Blossoms was not just my favourite film of the festival, it has probably got to be the best film I have seen in a long time hands down.<br><br>To be honest, when the film opened up with the cartoon like drawings of Mount Fuji I was a little dubious, but as soon as the first scene kicked in I was hooked! We are slowly drawn into the life of Rudi and Trudi Angermeier, opening up with Tudi being told by doctors that her husband does not have long to live and that maybe they should go on a vacation, an adventure. Through Tudi's character and voice over we begin to learn about who her husband is and what might make him tick. This is all done at the top end of the film before we move on to see Rudi and Trudi visit their children, now grown up adults with their own busy lives in Berlin. They have another son who lives in Tokyo who we meet later in the film.<br><br>What follows is a very heart-felt exploration of an older couple very much in love. It was interesting to see how badly their children seem to treat them. We later find out in the film that is because their children believe that Rudi had kind of suppressed Trudi throughout her life and not let her do what she really wanted to do, instead she devoted her life to her husband and children. Whilst that may have been true on some levels, we also see a very different side between Rudi and Trudi in their intimate moments. They seem very much in love with one another and Trudi in particular seems to have been happy to have spent her life looking after the ones she loved. It seems like the children thought it was one way, but the reality was very different. I wonder how often that kind of assumption can come up in real family life? Probably quite common I would think.<br><br>So just when we are enjoying the movie, and smiling as we get to know these people, a big twist happens. I won't tell you what it is, but I will say that I did not see it coming at all and it changes everything from that moment on.<br><br>And here my friends, is where I have to stop incorporating elements of what happened in the film into my review, for fear of spoiling it for you.<br><br>The film incorporated a lot of threads and various symbolic elements along the way, but none of them ever seem forced. They all fit nicely into the flow of things.<br><br>There is a massive transition between where Rudi's character in the film starts out, and where he ends up. His journey is wonderful and it seems very natural. There isn't some kind of sudden flip, it is very gradual and perfectly done. Often in films when you let a scene drag on or spend too long telling one element of the story it can obviously seem very tedious and boring, but this was not the case here at all. Everything had it's own place and played it's part it helping to tell the story in a very natural and honest way.<br><br>It takes a lot for me to cry when watching a film (I'm a guy!), but Cherry Blossoms did it for me, and I cried more than once. The reason for this I believe is two fold. The first being that as I watched this couple, I couldn't help but make my own personal connection to it. Thinking about my own relationship with my wife and how we may be when we get to Rudi and Trudi's age. The other reason is that you begin to care for these characters so much that when something happens to them, it makes you just want to physically reach out your hand and help them. This is all VERY powerful cinematic stuff! If a movie can take you on a sweeping ride where you laugh and cry, then that is a REAL movie! So many films you see are OK, fine, whatever, etc, etc, but it is very rare that you come across a film which really gives you something back in such a powerful way.<br><br>I can see that the writer/director had a very intimate understanding of the people and places. Whether that be from personal experience or just observation and thought. Whatever the case, it was brilliantly executed. The film was so perfect, that when I go back and think about the film, I remember other elements I had forgotten about, elements which just make it so much more perfect in my mind. It really felt like the writer just sat down and poured out the film onto paper, not over thinking or analysing it all. The truth I would guess may be quite different, but I think that's part of the charm when you see a perfect film. It's so flawless that it looks almost effortless!<br><br>From this moment forward, I shall be furiously stalking the works of the writer/director, because this is an artist to be reckoned with. Cherry Blossoms is a masterpiece which shall immediately be going on my very small list of all time top films that everyone should see!","user":"alex_smithee_on_film","rank":[79,86]},{"title":"Shadows","rating":10,"date":"28 March 2009","review":"If you would've told me prior to seeing this that I would fall head-over-heels for a film that's about a frustrated Bavarian Butoh dancer, with a tale of homelessness, loneliness, a pink telephone, cabbage rollsand recycling all in the mix, I'd have laughed out loud.<br><br>In fact, I did laugh throughout the course of this wonderful, delicate film (that has the most selfish progeny since \"King Lear\"). In the opening scene a wife tells a physician, \"My husband doesn't really care much for adventure,\" and, boy, does he have treatand a trialin store for him. But so does the audience.<br><br>The film's heart is about grief and how we can never really prepare for it. \"I'd like my ashes scattered upon the sea,\" a spouse says to his partner. Fearfully, she says, \"Why do you say that now?\" And why indeed since we can never plan our end and its circumstances? It takes a young, marginally sane street performer, to tell us exactly what the Great Mystery is all about.<br><br>And the use of stunning images from nature, as well as the contorted gestures of Butoh theaterand the equally contorted emotions from a family unaware of who the others are that this film brims over with so many rewards that it can be enjoyed over and over again.<br><br>The family dynamics are almost farcical which keep the weight of the subject matter from spilling over into despair. And while the central character's own despair is the subject of the film, it's thrilling to watch him find his way out of it.<br><br>Exceptional performances, shimmering cinematography, a truly great film.","user":"Michael Fargo","rank":[47,53]},{"title":"Hanami - Kirschblüten","rating":10,"date":"22 May 2008","review":"One of the best films I have seen the last years. It is not a film for the big audience that likes the common \"Hollywood\" violence and action without substance. It's a film with a deep and tender story about the contacts and the feelings between an elderly couple and their children and the lost chances to deal with each others lives. Beautiful scenes in Japan with great pictures offer the frame for the main part of story. It is fascinating to see the big contrast in the Japanese culture in modern Tokio and the older Japanese traditions at \"Fuji San\" as the old man - after his wife has died - makes up a visit to Japan, to fulfill the wishes of his wife. Remarkable was, that after the end of the film the whole audience silently waited till the name part and the last note of the film music was finished. They also were very impressed.","user":"rudolf-20","rank":[34,39]}]