[{"title":"even worse than \"The Room\"","rating":1,"date":"19 May 2011","review":"All the \"excellent\" reviews on this film are clearly fake.<br><br>I caught this while on vacation in LA out of curiosity, as I've never seen a mainstream Filipino movie before. The Western names on most of the movie poster credits seem to indicate that it might be OK.<br><br>Boy, was I wrong.<br><br>Biggest pile of poorly written/acted/cast sh*t I've ever seen in my life. And in bad fake 3D!<br><br>After a quick google, the director appears to be some rich idiot banker with too much money on his hands and fancied being a \"director\".<br><br>It turns out that the theaters this film was only being shown in are:<br><br>ALSO OWNED BY HIM.<br><br>If there's any justice, the film negative should be burned and recycled into something useful, like a toilet roll holder.","user":"zinof","rank":[41,47]},{"title":"Worst movie ever seen","rating":1,"date":"23 April 2011","review":"Please don't waste your time watching this very, very, very bad movie. It's honestly the worst movie I've ever seen. What a waste! The acting is horrible, the story doesn't make any sense, the cinematography and the editing suck big time. The music is great, and that's the only positive comment I'm going to make. Why do people get money to make this film? It doesn't make any sense. Whoever made this film has clearly not a clue of filmmaking. It feels like a bunch of film students got together and decided to do a film. Well, that's not fair. Film students would do much better films, guaranteed. Deep Gold - what a joke. I want my money back!","user":"lugaluga-888-449492","rank":[38,54]},{"title":"Worst movie ever!","rating":1,"date":"1 May 2011","review":"I saw Deep Gold a few days ago. Honestly, I did not expect anything good because I always highly doubted Philippines could ever compete with other Asian film industries (Japan, China). It did not disappoint in that respect, it was an absolutely horrible movie, a total waste of my time and money.<br><br>The plot is reminiscent of other great work (sarcastic) by Fred Bailey who still somehow manages to sell his scripts and have movies made out of them. If you check most of his scripts here, the ratings are all around 3, the ratings do not lie. However, the ratings will lie here for a while because the only people that rated it 8, 9 or 10 are either workers of Bigfoot company or some really close friends of the owner.<br><br>The story is just atrocious and SO ordinary that it will never stand out. The acting is terrible, that's what you get from using models as actors. You must have a huge ego to be both director and actor, unfortunately it rarely works, only Tarantino manages to break the barrier. The action scenes had NO tension whatsoever, the danger happens always AFTER the hero is safe and sound, especially during the library scene. The story is predictable and offers no twists whatsoever so I don't know how anyone can say it's the best 3d movie of 2011 (of course it's an employee review).<br><br>After reading more about Bigfoot online, I found out that it is ruled by the owner who disregards ALL other people's opinions though having no film training whatsoever. And all other Bigfoot films are B-movies at best, but most lower than that.<br><br>Stay away from this horrific movie and spend your money more wisely. Watching golf is more exciting than watching this.","user":"Hellsinger","rank":[27,37]}]