[{"title":"well, I quite liked it","rating":8,"date":"27 November 2008","review":"I've read quite a few negative reviews but i think some of the people who have read the book need to realise this was a children's film that would no doubt have to be simplified and draw people in from the start. It hasn't had an easy launch either because it's been competing with High School Musical 3, when i went to see it the cinema was empty apart from me because everyone else had gone to see a certain other film.<br><br>It wasn't great and i am certain that if i had read the book i would have hated it because the characters were not brilliantly written and it was a messy mix of excellent fantasy sci-fi with the appropriate special effects and corny American generic children's movie. But it was good fun.<br><br>The girl in it displayed a superb acting performance the general set and costumes and well mise-en-scene in general was excellent and well worth watching just for that.<br><br>It was good to watch in the cinema and throughly enjoyable if a bit predictable. As i say, generally i liked it.","user":"mysteriouspersonage","rank":[115,157]},{"title":"Very good movie","rating":10,"date":"20 October 2008","review":"I wasn't expecting much from this film, but I ended up loving it quite a bit. It's a great kid's adventure, lots of mystery and action, good character development, and plenty of cool settings.<br><br>Bill Murray and Tim Robbins do a fine job in their roles, but they are mostly supporting cast. It's the two kids who are the real heart of the story. I also love how the filmmakers created an entirely plausible distant future where beauty still thrived despite crumbling infrastructure. Above all, this is a movie about hope for the future.<br><br>If you are looking for a good adventure similar to THE GOONIES, check this out. Great for kids, and great for folks of all ages who enjoy light adventure.","user":"existenz-6","rank":[82,116]},{"title":"City of Ember","rating":6,"date":"10 October 2008","review":"Having just taken 129 eighth-graders who read the book to see the premiere, everyone left the theater disappointed with what director Kil Kenan and screenwriter Caroline Thompson have given us with this translation from the page to the screen. Thompson, an accomplished screenwriter, deserves more of the blame in their (and my) opinion.<br><br>Books rarely translate better to film and this one suffers for many reasons. Jeanne DuPrau's book is an amazing trove of metaphors (candles, the library, the seed, the Pipeworks, and the city itself). When works of literature work on multiple levels, the filmmakers should at least offer us more than one. In fact, this book could be a metaphor for metaphors -- there are things below the surface that exist whether we acknowledge them or not; it is our job to find the tools to excavate the \"deeper\" level of what exists for others only on the surface.<br><br>Having sacrificed the novel's intellectual depth, the film version does a great disservice to the dedicated reader: we are given special effects that defy logic and re-focus the story unnaturally and unnecessarily; there are included scenes of hyped-up action they are neither satisfying nor helpful with advancing the plot; we lose some of the intricate details of character development; there's an unnecessary inclusion of giant scary creatures that offer distracting (and bizarre) thrills; and the mystery of what Ember is is destroyed in the first minute of narration.<br><br>The design of the film is great, but as in design, the beauty is found in the details. I believe that the greatest details of the book are missing, hidden away like the people of Ember. Let them come into the light!","user":"ActOne","rank":[154,235]}]