[{"title":"Dedication","rating":10,"date":"24 September 2008","review":"Hunger (2008) ****<br><br>Bobby Sand's story has been told before on screen, but never with such raw intensity and unrelenting artistry as in Hunger. The film is directed by Turner Prize winning artist Steve McQueen. While his art has often been part of the film medium, this is his first entry into feature film-making.<br><br>The film sparked both controversy and applause at this years Cannes Film Festival, with both disgusted walkouts and rousing ovation. It the end it landed McQueen the Camera D'or.<br><br>While the film follows the final weeks of Bobby Sand's hunger strike, it is equally about recreating the atmosphere and conditions inside the infamous Long Kesh Maze Prison. Its nearly a half hour into the film before we even meet Sands, in fact. We're introduced to a prison guard, who outside nervously checks his car for bombs, quietly avoids his comrades, then becomes as vicious as any other when brutalizing the inmates. We're also first introduced to a new inmate, who, as per the IRA standard, refuses to war a uniform and instead goes simply wrapped in a blanket. He and his cellmate smear the walls of their cells in feces as part of the no wash protest.<br><br>Bobby is played by Michael Fassbender, who gives a quietly powerful performance. For the film he underwent a medically supervised crash diet, one rivaling - if not outright surpassing - that of Christian Bale in the Machinist. He moves throughout the film with a sense of determination and dedication.<br><br>It is difficult to go into any detail about plot, as the film more or less moves patiently and quietly towards the inevitable. And the key word may be quiet. McQueen claimed that he originally envisioned doing the film dialogue free. Indeed, much of Hunger is free of dialogue. However, McQueen, as he puts it, felt it would be more powerful to go from vocal silence into an avalanche of dialogue. And so the films centerpiece was born - a 20 minute stationary shot of Bobby speaking with his Priest. In a film that is filled with a dark heaviness in a cruel prison atmosphere, that meeting lifts a weight for a time, before slowly descending into a sad sense of inevitability. Though that inevitability is liberating, it is nonetheless a profoundly sad one. The film also does not shy away from the cruelty of the British towards the Irish, though it also does not deny the brutality of the IRA at times - as characterized in one shocking moment. However, anyone with any inkling of rational knowledge on the Irish struggles knows that the IRA was never simply a terrorist organization, but a rebel group that did from time to time employ terrorist tactics. Like all anti-state organizations, however, the IRA did not exist for the sake of conflict, but because of callousness and cruelty. McQueen reminds us of the cruelty and arrogance of the British particularly through the cold words of Margaret Thatcher, speaking shamelessly about Sands' strike.<br><br>There have been many fantastic films about the Irish Struggles, with some of the best coming in recent years (Ken Loach's fantastic Wind that Shakes the Barley, and Paul Greengrass's Bloody Sunday, to name two of the better). This one, I think, may be the best. At least from an artistic and purely visceral standpoint. McQueen captures his scenes in jarring compositions, with all the skill and artistic imagining of a true artist. From the opening sequences, Hunger promises something more than just the standard. Whereas most political films focus all their attention on the message, Hunger focuses on the feeling, and never strays from its artistic goals. This is art, from its opening to closing frames. It's a boldly crafted and brave film. The cinematography and direction are assured, moving slowly and unexpectedly, always beautifully even in its darkest and dirtiest moments.<br><br>I believe this truly is a great masterpiece. McQueen has proved himself as a masterful artist of film-making as well with Hunger.","user":"MacAindrais","rank":[194,239]},{"title":"Finding beauty in the horror.","rating":9,"date":"28 September 2008","review":"This debut from former artist turned director Steve McQueen will leave you breathless. In its own understated way it is epic, bold, brutal and beautiful. Telling the story of the last six weeks in the life of Bobby Sands the Irish republican hunger striker the film pulls no punches in showing life inside the maze prison and what the prisoners did to try and win political status. From the outset the shots are amazing with McQueen utilising his artistic eye to bring the best out of the very cold prison environment, his attention to detail is simply stunning making every single frame fantastically watchable despite the sometimes gruesome subject matter. Also his approach of less is more adds to the atmosphere as he has shots that have no sounds or music, like the guard cleaning the corridor with its fixed camera unflinching for several minutes the only sound the eerie echoing scrubbing. Unofficially split into three the first part deals with the incarceration and subsequent no wash protests while the last deals with the hunger strikes but it's the central piece that separates which most will remember for its ability to captivate despite just being a conversation between Sands and a visiting priest. Again shot from a fixed angle and superbly lit Sands (Fassbender) explains the morality behind his decision to stop eating. The acting and the monologue will stay with you long after the films finished and cements actor Fassbender firmly in the role to the point where you start to feel for him as he begins to waste away. When the film premiered at Cannes it caused walkouts and standing ovations before walking away with the Camera d'Or for best debut and rightly so, not only is it one of the best films of the year it is one of the most powerful I've seen. Regardless of where you stand politically the message is universal and just like the circle of faeces smeared on Sands cell wall, McQueen has crafted something beautiful out of something horrible.","user":"come2whereimfrom","rank":[90,114]},{"title":"A courageous piece of art","rating":8,"date":"15 September 2008","review":"I saw Hunger at TIFF. I heard it was a hot ticket, and pre-festival buzz was good so I was elated when I got tickets. McQueen uses very little dialogue throughout the film, instead choosing to communicate through strong visuals and raw imagery. The film is less about the politics behind the IRA conflict, and more about the suffering of the prisoners and the dehumanization of them at the hands of the guards. It is not an easy film to watch. The imagery is so strong and raw that I couldn't help but grimace during some parts. The lady sitting next to me had her hands covering her face at one point, and was visibly crying. McQueen holds nothing back. The prisoners are shown smearing excrement over their cell walls and pouring their prison food over the floor until it goes bad and are covered with bugs. McQueen demonstrates the unwillingness of the prisoners to be stripped of their dignity (by conforming to prison demands), despite being stripped of everything else. There are some very long takes with no dialogue, with a particularly long one of a prisoner cleaning himself for what seemed like forever. The atmosphere in these scenes is so visceral that one can almost feel the filth and smell the stench of the prisoners. There is also one particularly brutal scene where the guards make two lines, and each nonconforming prisoner is marched through the middle while being repeatedly beaten by batons. Afterward, one of the officers walks outside and weeps. It is then that we learn to see the guards as human; perhaps even victims trapped within a conflict with no resolution in sight.<br><br>The story of Bobby Sands takes precedent about half way into the film. The most dialogue in the films occurs during the scenes between Sands and his priest. Unfortunately the Irish accents are thick, and I found the scene hard to decipher. The final scenes in the film are tough to watch as we witness Sands' slow dissent into the throes of starvation. It is hard to imagine anyone subjecting themselves to such suffering, yet 9 other prisoners followed suit. Fassbender is very good in the role; giving us a character that is unrelenting in his choices and beliefs. He genuinely believes his suffering serves a purpose, and though some may disagree with his choices, one can't help but admire his conviction.<br><br>Hunger is an artfully done film, which is no surprise considering McQueen is a visual artist. It is visually moving and challenging piece of work. It is hard to believe that it's his first feature, and easy to understand why it won the Camera d'or, and now the Discovery award at TIFF. I would have preferred a bit more back story to the conflict (I know close to nothing of its history), but then again, choosing to put more focus on politics may have taken away from other elements of the film. Lastly, I appreciate McQueen's unwillingness to take a stand on the conflict/protest in his film. He allows the viewers to make their own judgments; he's merely here to tell the story.","user":"warholmuse","rank":[65,83]}]