[{"title":"Holy god","rating":2,"date":"29 November 2009","review":"\"Old Dogs\" is simply mind numbingly awful. It's like two hours of being raped in the face by fart jokes. Is it funny to see Seth Green pretend to get hit in the balls? Well then this is totally up your alley. When people talk about how films are getting worse this is what they are talking about. The inexplicable amount of decent ratings for this mess of idiocy kind of explains why the publishing industry is tanking. I refuse to admit I live in a world where those who enjoy this dreck actually know how to read.<br><br>\"Old Dogs\" is an ugly artless stupid film that has been created only to keep your kids quiet for a couple hours; although making them sit through this should legally be on the same level as child abuse. In a couple years we will forget this ever existed.","user":"bradlewis98","rank":[182,298]},{"title":"Much better than expected...in fact, I sort of enjoyed this","rating":6,"date":"25 November 2009","review":"I went to see the new family comedy Old Dogs expecting not to like it. The only reason that made me think it wasn't gonna be garbage was the great cast, so I gave it a shot. I was surprised to say I actually sort of liked it. The film stars Robin Williams and John Travolta as Dan and Charlie, two businessmen and long-time best friends. One day, Dan's ex-girlfriend, Vicki (Kelly Preston) takes him to dinner and says she's going to jail. She tells him of how her friend's gonna to watch after the kids and how he needs to check in on them every once in a while. To further explain this scenario, the kids are Dan's kids. When Dan puts Vicki's friend in the hospital, Dan is forced to watch after the kids with a little unenthusiastic help from Charlie. If this plot sounds bad, then you're on the same page as me. The surprise element of this movie is that it's actually pretty damn funny. It doesn't hurt that a great supporting cast including Lori Loughlin, Justin Long, Matt Dillon, Seth Green, and the late Bernie Mac are in it. Obviously this is not a perfect film, nor should it be, and it's not for everyone, but I certainly found it funny enough. Check it out because you may feel the exact same way I feel about this film walking out of the theater.","user":"Jackpollins","rank":[60,96]},{"title":"Not as bad as I Expected","rating":6,"date":"26 November 2009","review":"While looking for a family Thanksgiving movie, I realized I had only 2 options, this or Twilight. Since there was no way in hell I was going to see Twilight I decided to read some review and go see this. Oh god the reviews were awful. After seeing this film I will admit, its not THAT bad. The acting is for the most part good, and some of the jokes are funny.<br><br>Admittedly this joke runs way to long, and not to spoil it but the producers could have cut at LEAST 15mins out of it, that drag the whole movie down. Id go see it again, at least it doesn't have glittering vampires.","user":"bubble4629","rank":[72,123]}]