[{"title":"heavy but good","rating":8,"date":"22 January 2008","review":"Woo, this is one violent film (and i like that sort of thing) but be warned. Ill admit i automatically (flinched) looked away at one scene and i have seen some pretty horrific videos and not been moved.Pizza anyone! <br><br>Aside from this the film portrays the thugs fairly accurately. It may seem over the top too some but this is just what life was like in the peak days of football violence in Britain. As someone who has lived in a football obsessed city surrounded by football casuals and witnessed running street battles i thought the fight scenes were very well done. if your unlucky enough to see this type of thing in real life then you will realise just how scary they can be. <br><br>Shocked me as much as The Firm (Gary Oldman one) did although with The Firm i felt slightly for the characters (peer pressure, vulnerabilities etc) but with this film i had no sympathy whats so ever for the players in this story. Basically their a bunch of nutters that got what they deserve :) <br><br>Remember this is based on an true account of the time and is severely brutal with savage characters and moments. This was and still is life for some people. Avoid if you cannot handle the brutality of real life.","user":"allyrd","rank":[51,60]},{"title":"Decent - don't believe the reviews","rating":7,"date":"9 September 2007","review":"I've just seen this at the cinema, and I can't believe it's had such bad reviews. I can only think critics are offended by the subject matter, as this is a pacey, well-acted, stylishly shot exploitation movie. Yes, the central characters are unpleasant, but when did that have anything to do with the quality of the film itself? That's like saying Guernica is a bad painting as it portrays a bombing, and bombings are NOT NICE...<br><br>Seriously though, if you like hard-boiled, brutal, gripping \"TOUGH GUY\" cinema, you will enjoy this. The 80s/90s period detail is captured very well, with haircuts, fashions and soundtrack, and the violence doesn't let up. I was half expecting some sub-Guy Ritchie cringe-worthy thing, but it's not like that at all. The plot focus does shift from Leach to his cohorts in the film's latter half, which some viewers seem to have a problem with, but not I. ROTF barrels along and seems shorter than its near-two hour running time. Plenty of brutality, nudity, swearing and drug abuse. Sweet!","user":"noahbbrown","rank":[84,116]},{"title":"Brutal but gripping British gangster movie","rating":9,"date":"5 November 2007","review":"I'm always wary of saying that a film is excellent after only seeing it once, but me and my wife and friends have been talking about this film since we watched it.<br><br>Although extremely brutal in places this movie is one of the best British gangster titles i have seen in years now.<br><br>The story is gripping and the football firm fighting scenes although perhaps a little over the top with the blood make sorry titles like green street and football factories seem like a walk in the park.<br><br>I was extremely impressed with Terry Stone (known to those who have been in the rave scene as terry turbo) and as a fan of this genre was delighted to see some great bad boy actors from eastenders (jonny allen and dan for those who know).<br><br>A great take on a subject that has certainly been done before, but it was also nice to see the early rave scene being covered as well, something i'm sure as time goes by we will see a lot more of. <br><br>All in all if you are a fan of the genre i have little doubt you will enjoy this movie. <br><br>I have a feeling once it is released on DVD this will become a cult movie. And rightly so.","user":"russelledwards001","rank":[57,79]}]