[{"title":"Everything I ever wanted","rating":10,"date":"3 July 2008","review":"I was really hoping that this movie would bring back the feel of the first seven seasons. A warm and cuddly SG-1. I am very happy to say it lived up to all of my expectations.<br><br>I enjoyed every moment of this movie, and it is without a doubt a spectacular finish. People familiar to Stargate will find that this movie does not go through too much spectacular special effects. The lines are not drawn out and the story makes this a very nice watch. Old and new characters combine to do what SG-1 does best... Save earth.<br><br>I would not like to go into too much detail as I would want all of you to watch it for yourself, and take it in for it's full meaning. It goes above and beyond the realm of Stargate.","user":"bAchilles","rank":[97,118]},{"title":"Stargate SG-1 Comes Full Circle","rating":9,"date":"30 July 2008","review":"Following on the release of The Ark of Truth, Continuum is the second Stargate SG-1 movie to come to DVD. Unlike Ark of Truth, Continuum is not potentially weighed down by having to overtly tie up loose ends left by the series. While, in fact, it does tie up a few loose ends rather nicely it also does something else: it brings Stargate SG-1 full circle.<br><br>The plot is classic SG-1: the last of the system lords Ba'al (played by the ever villainous Cliff Simon) is about to be executed with SG-1 and Jack O'Neill in attendance. Suddenly people start disappearing and SG-1 members Daniel Jackson, Samantha Carter, and Cameron Mitchell flee through the Stargate to a world where the Stargate never made it to America just before World War II thanks to Ba'al meddling with history. After facing alternate versions of people they know and being dismissed, Earth comes under attack from Ba'al, his queen Qetesh (aka Vala) and his first prime Teal'c. The team must find out how Ba'al changed history and put it rightor else. Writer Brad Wright brings together two of the series' best threads: time travel and the threat of Goa'uld invasion together to bring the series not only full circle but what could also be called SG-1's greatest hits.<br><br>One of Continuums biggest pluses is that it brings the original cast back together. Richard Dean Anderson appears once again as General Jack O'Neill and while he does not appear in the entire film, his presence his certainly welcome and makes for a great addition to the film. Also returning for this film is the SGC's original leader, General Hammond. The late Don S. Davis makes his final appearance as Hammond in the film's alternate time line and while it's a shame that he doesn't know the team in those scenes, his appearance (like O'Neill's) is a welcome addition to the film.<br><br>The big thrill of Continuum is watching familiar characters in the alternate time line. It is here more then anywhere else that the film brings the series full circle. We get to see the Goa'uld system lords back together again even SG-1's first nemesis Apophis in a surprise appearance. On top of the alternate versions of Teal'c, Vala, Hammond, and O'Neill we get to meet alternate versions of Hank Landry and President Henry Hayes. Landry is played masterfully by Beau Bridges who is able to make the lines between the \"real\" and alternate Landry's almost indistinguishable. Hayes, played by William Devane and last seen in SG-1's seventh season finale Lost City, is much the same as the \"real\" version we've met before; skeptical at first and then forced to face the incredible with a brave face. Their appearances are what separates Continuum from Ark of Truth and marks an improvement.<br><br>The film also makes a fine blend of the cerebral and action sequences. While ostensibly an action story, Continuum also takes moments to explore, on the personal level, the effects of seeing a world and people you know be almost completely different. Yet when the film needs action it has action from submarines rising in the Arctic, to dogfights and gun battles the film shows what SG-1 could be at its best: intelligent and yet action packed.<br><br>The stand-out aspects of Continuum are the amazing location photography, special effects, and music. The location filming in the Arctic (done in below zero temperatures) is amazing, beautiful, and breathtaking all at once. Considering this is a relatively low-budget film it's an incredible addition and it makes the film feel even bigger in scope and scale. Scope and scale are the purpose behind another one of the film's highlights: the special effects. From dozens (if not hundreds) of Goa'uld ships to dogfights and extensions and additions to sets, the special effects in Continuum continue SG-1's proud tradition of bring feature film quality effects to the small screen. Then there's Joel Goldsmiths' score which like Ark of Truth evokes the epic feel of the film. Each of these make Continuum stand head over heals above many of the direct-to-DVD sci-fi films released all the time.<br><br>Continuum is not only an excellent addition to SG-1 but brings the series full circle. From classic elements to the return of favorite characters and villains to outstanding photography, effects, and music Continuum takes what could have been a boring attempt to tie up the loose ends of the series and creates a action packed adventure. Continuum may well the end of SG-1 and if it is, Continuum is it going out on top.","user":"timdalton007","rank":[52,66]},{"title":"Thoroughly entertaining story concludes Goa'uld plot arc with finesse","rating":7,"date":"4 July 2008","review":"You may find reviews of 'Stargate: Continuum' inflated because of its contrast to the preceding 'Ark of Truth'. Whereas 'Ark' was in many ways, but not completely, a huge disappointment, 'Continuum' is and does everything 'Ark' failed at: the plot genuinely grips you, and is in no way linear; it surprises you, twists unexpectedly, rolls back on itself and weaves several arcs together, just like any good story should; there's genuine, fantastic character development; and a deepened attention to detail and realism. Take your pick on one of the best ever 'Stargate SG-1' episodes, and imagine it being given the royal, feature-length treatment. 'Continuum' finally realises this notion without the symptoms of a clumsy transition between 42-minute episodes and an attempted epic that 'Ark' suffered from.<br><br>For any of you who are new to the Stargate franchise, I will provide a brief explanation  but thankfully 'Continuum' doesn't make 'Ark's mistake of being incomprehensible for someone who hasn't watched Stargate for 10 years. The Goa'uld are a snake-like race of aliens who implant themselves inside humans, thereby taking total control of their bodies. Some of these aliens have amassed huge power, controlling vast fleets of ships and armies of \"Jaffa\" warriors, by using various technologies to give the impression that they are gods. Known as the System Lords, they have been conquering the galaxy for millennia. Near the end of 'Stargate SG-1', the System Lords were all but defeated  except for the most cunning, Ba'al, who managed to clone himself in an attempt to render himself unstoppable. 'Continuum' picks up after our heroes, SG-1  the primary five-strong team taking orders from the U.S. Government to counter such inter-galactic threats  believe they have the last Ba'al remaining.<br><br>But Ba'al is tricky as ever and, as ever, Cliff Simon plays him with a delicious mix of scheming genius, elaborate malice and exuberant vanity that has made Ba'al the villain we love to hate and hate to love. Indeed, Cliff Simon gives his singularly best performance of Ba'al to date, and is without a doubt the star of the show. In one dedicated, extended, excruciatingly well written and delivered sequence, Ba'al's character is really given a playground with the feature-length treatment he's always deserved: if you know Ba'al already you won't be able to stop grinning; if you don't you will fall hopelessly in love. This scene is rivalled only by one of the tensest hostage sequences I've ever seen on a film.<br><br>In 'Continuum' SG-1 probably faces the toughest trials it ever has, causing the usually gentle-mannered Daniel Jackson to exclaim in profanities twice throughout the film. Initially this shocked me, as care is usually taken to ensure Stargate productions can be watched by all ages  but actually this elevation of maturity really added some welcome grit to the story, and is matched by a handful of graphic, gory killings. This grittiness is enhanced by the aforementioned attention to realism that a full-length movie allows time for. In your typical Stargate episode, being stuck in an ice cavern isn't all too bad  you'll find your way out soon enough. In 'Continuum' this entails that there's no light, you can't light a fire, your fast, hard breaths billow visibly through the air, you're shivering uncontrollably and eventually you'll get frostbite with dire consequences.<br><br>At its heart, 'Continuum' is a time-travel story  a staple of science fiction and certainly of Stargate  but handled much better than usual. Whereas the 'SG-1' episode 'Moebius' thought it could hush the time paradoxes it generated aside, 'Continuum' deals with them head-on. However, like the best sci-fi, it doesn't attempt to deliver you pseudo-scientific explanations, it just highlights the puzzles for your attention  they're interesting issues as questions alone. Of course, the time-travel itself is no real focus of the film, but more of a device to shake things up; in a sense, 'Continuum' is one, big, Stargate-themed \"What if?\" Characters are tested to extremes, are forced to interact with completely different roles, and the opportunity is seized to throw in more guest appearances of old characters than you can count.<br><br>Besides all this praise there are some things 'Continuum' really lets itself down with. Some very awkward dialogue between the SG-1 members at the beginning reeked of the writer not really knowing what else to say  although there is an extremely bold speech from Vala, which is impressive purely on account of the boldness of writing it in. Some crucial plot moments are swept over far too quickly  how quickly do you think you could be persuaded that your mortal enemy is actually your friend if you'd never met him before? Well, pretty damn quickly, 'Continuum' seems to think  although again there is enough material for the hardcore fan to \"explain away\" this kind of problem. It was also disappointing that Joel Goldsmith's score was disappointing  many scenes that really needed a strong sense of drama are overplayed by bright, bouncy music, which slightly jars; one thinks, \"Aren't people dying here?\" That said, it equally has its moments of grandeur.<br><br>'Continuum' seems to have proved that both Stargate, and science-fiction as a whole, have moved on for the better. Whereas 'Ark' was written and directed by veteran Robert C. Cooper, 'Continuum' was the work of original developer Brad Wright, with the direction of the more recent Stargate talent Martin Wood. And it really shows - watch out for an extended tracking shot in the first few minutes of the film that climaxes with the entrance of the heroes, and which would give 'Atonement' (Joe Wright, 2007) a run for its money. Whereas 'Ark' doesn't at any point seem to know quite what it's doing, 'Continuum' really takes you for a ride, with perfect pacing and just the right emphasis placed on every part of the plot: the people behind this were right on the cutting edge of what Stargate is today.","user":"Aquillyne","rank":[68,93]}]