[{"title":"Fantastic Comedy!","rating":10,"date":"24 February 2016","review":"This is one of those movies that you will be quoting for the rest of your life with your friends! Tropic Thunder is a great satire that I was honestly expecting to be terrible. <br><br>The story was actually perfect to make fun of action movies and Hollywood. The situational comedy was genius as these actors were forced to actually survive a war like setting. The action scenes themselves resembled really action movies and were nicely done. They added the action in with the hilarity, and all of it worked perfectly.<br><br>There were two characters that really stand out. Robert Downey Jr and Tom Cruise were both comedic gold! You won't recognize either of them, but they fit the roles fantastically. Some people find Downey's character to be inappropriate, but please take it for what it is supposed to be. Downey Jr was making fun of method acting and taking that concept to a completely new level with this role. I didn't realize Tom Cruise was in this until the credits. He is in a role that I never thought I would see him in. He is outrageous and over the top. His scenes are some of the most memorable from the movie.<br><br>I don't want to give too much away since I don't want to spoil any of the comedic gold. Just know that you will be kept laughing the entire time, and the movie will just keep getting better. This is a great watch and definitely worth your time; 8/10.","user":"samfischer88","rank":[44,50]},{"title":"RDJ should've won the Oscar nods - Legendary comedy!","rating":10,"date":"18 June 2019","review":"Originally saw \"Tropic Thunder\" in theaters, that was fun! Gargantuanly hilarious and witty; quite memorable too. Tom Cruise was gold, so was Danny McBride, Ben Stiller, Jack Black, Robert Downey Jr, Matthew McConaughey, Nick Nolte, and Jay Baruchel. Almost never get tired of watching this epic movie probably seen it 30 times since release! Hope this gets remembered for many years, sorry I didn't review it sooner.","user":"UniqueParticle","rank":[21,24]},{"title":"Ben Stiller's Best Movie!","rating":8,"date":"23 August 2017","review":"This is hands down Ben Stiller's best movie. It has great action, great dialogue, great acting, great music and great humor. This movie is filled with quotable lines and works very well. The performances I have to single out for praise are Ben Stiller, Robert Downey Jr, Jay Baruchel, Matthew McConaughey, and Tom Cruise. I feel like this movie approaches it's themes in a way similar to Blazing Saddles but Blazing Saddles has a lot more slapstick. The Tugg Speedman character is not as memorable as Derek Zoolander but this movie is far better than Zoolander is. This is my favorite Ben Stiller movie alongside Meet The Fockers, Zoolander, Starsky and Hutch, and Night At The Museum 1 and 3 but I still haven't seen There's Something About Mary. I honestly prefer Robert Downey Jr as Kirk Lazuras over him as Iron Man but they are both fantastic performances. Tom Cruise is awesome as Less Grossman. He owns his character that is very different from everything else he has done. I hope Ben Stiller is proud of this movie because to me this is his best one.","user":"benaboo","rank":[27,32]}]