[{"title":"Better film than critics give it credit","rating":7,"date":"15 February 2009","review":"I was persuaded by my brother to see this film. I wanted to see another one but since he was visiting I agreed with his choice, and was surprised to find myself liking the film very much. OK, the script could be a little better, but the direction and acting were very good, even down to the supporting players such as the actors who portrayed the two NYC cops who assist the main character, Interpol agent Sallinger (Clive Owens), once the story moved to NYC. What I particularly liked was the way the story was told cinematically rather than through a lot of verbose dialogue. It seemed to me like a Bourne thriller for adults. No kinetic hand-held camera action, but smooth visually appealing cinematic exposition the way Hitchcock did it in his prime. Even the closing credits were used effectively to give a rather downbeat dénouement to the film.<br><br>In short, an entertaining movie that alleviated the February blues.","user":"tjm225","rank":[149,188]},{"title":"Worth a theater ticket","rating":8,"date":"16 February 2009","review":"No spoilers.<br><br>I pretty much had zero expectations for this film. I'd seen an ad or two and it looked conventional at best, clumsy at worst. The previews certainly don't do it justice. It starts smart and mean and doesn't let up. Not everyone will enjoy the unrelenting mood, but I found the picture intense and the rest of the audience in the theater seemed to agree. It helps that Clive Owen is believable as the protagonist and is highly watchable. A lesser actor in the role would have made the film much less effective. Armin Mueller-Stahl also adds credibility and depth. Other supporting actors were, for the most part, strong and gritty. There was probably pressure for a female lead, so in Noami Watts's defense, this is probably part of the reason why the character feels so irrelevant.<br><br>I'm happy anytime that a slick international thriller has some brains and isn't completely predictable, so I found the picture highly entertaining, if imperfect. It it flawed? Most certainly. But if you walk into the theater without pretensions, you'll probably be as entertained as I was. And I do think a theater visit is warranted, for the photography mentioned by previous reviewers, if not for the Guggenheim scene alone. I think it's dangerous to trump up a scene too much, because it inevitably leads to disappointment. But having no idea about what was coming... suffice to say, I didn't find the directing anything other than thrilling.","user":"strigah","rank":[163,213]},{"title":"Good film until...","rating":7,"date":"28 August 2009","review":"I was with them until they started a full on shoot out inside the Guggenheim. One shot fired in any building in Manhattan and the place is full of NYPD Blue within 3 minutes. Guys walking around a major tourist attraction spraying Uzi fire without 100 cops storming the place is insane. It's called suspension of disbelief, not suspension of sanity.<br><br>Clive Owen was entertaining and I liked that the Chief from Rescue me was one of NYPD's finest.<br><br>Regardless of your opinion about banks and multinational corporations, its a fun watch.","user":"jack-studer-1","rank":[18,21]}]