[{"title":"If Goodfellas and Scarface had an illegitimate son","rating":5,"date":"18 August 2009","review":"Four close friends from Pittsburgh (Danny Masterson, Ben Crowley, Daniel London, Sean Derry) meet a couple of prostitutes (Bijou Phillips and Alexandra Breckenridge), and decide to hire them to start their own prostitution service. Well, the ringleader (Brian, played by Ben Crowley) decides, and the three others seem to reluctantly go along with it. A fifth member of the gang (Thomas Ian Nicholas) stays out citing moral objections.<br><br>The business plan quickly expands to involve drug dealing, which is where Ving Rhames enters the picture as the drug source. Incidentally, Rhames' part is not nearly as big as the movie poster would have you believe, amounting to a total of perhaps 20 minutes interspersed throughout the movie. Since the plot description already says this movie is about \"the rise and fall\" of a prostitution ring, I'm not spoiling anything by telling you that this business does indeed come crashing down in the end.<br><br>This movie starts out pretty slow. Things get more enjoyable once Ving Rhames makes his first appearance, which is fairly early on, but reminds you how much you don't really care about the other characters. I was looking forward to seeing what Danny Masterson could do (you know him as Hyde on \"That '70s Show\"), but he was just sort of \"there\", playing it real cool as the level-headed one, and perhaps a little too understated to be interesting. I didn't find Ben Crowley all that convincing as the ringleader/mastermind or the junkie bad boy he transformed into, and I thought his part was too big.<br><br>This movie is certainly no Hollywood blockbuster, but the effort is apparent. Many obvious cues were taken from Scarface and especially Goodfellas, eg. the ever-present voice-over narration. In the end I can say I enjoyed this movie, but only barely. The best thing I can say about it is that it's a pretty believable story, and does succeed in showing how easy it might be to make it big, as long as you're willing to sacrifice your morals and your future. Oh and Alexandra Breckenridge is very hot and fun to watch.","user":"equazcion","rank":[34,40]},{"title":"Good Flick...","rating":19,"date":"19 July 2011","review":"Sometimes you have to be from the streets to actually enjoy a movie about the streets so since I am not a movie critic I'll give it to you straight with no chaser. I enjoyed this movie because of the story. This is the story of five friends who live in Pittsburgh, Pa. They have been friends since childhood and growing up and going nowhere which is typical in the hood, any hood, with any race especially when poverty and ignorance are involved. They had no way of making any money and needed a grind which is a hustle/grift to make some easy money and that is where the movie really takes off. <br><br>These young guys came up with a brilliant idea, that is if you're from the hood, to make money. And even though the idea for their hustle was a bit far fetched they made it work. The movie involves drugs and a crooked cop which is usually typical in a B movie like this. The cop, played by Ving Rhames, was one grimy, I mean seriously grimy dude. <br><br>Rhames played that role very well which made the movie work. And as I said, if you're from the streets you probably know or have known cops like the one played by Rhames. If you're not from the streets and are of the WASP culture who looks at people from the hood as lower life forms and believe that all police officers are outstanding citizens then this movie truly isn't for you.<br><br>I've known of cops in Philly that were so low they could rattle around in a gnats navel and if anyone who reads this review knows of the corruption that is running rampant inside the Philly PD then you have a good idea of exactly what I'm talking about. I am not going to spoil the flick for those of you who haven't seen it, but in my humble opinion it was pretty damn good. What is really comical is that the idea could work, that is if you're willing to take the risk of spending a long time in jail, it really could. Enjoy.","user":"Phillyslugga2","rank":[3,3]},{"title":"The literary mix with the exploitive with the result its often silly and not as good as it should have been","rating":6,"date":"25 August 2009","review":"Four friends in Pittsburgh are always trying to make some big money fast. Stumbling into running a prostitution ring the guys soon realize that they are in way over their heads and they will have to fight to keep what they have made. <br><br>With narration that seems to have been lifted from a very literary novel and a sense of reality that seems to have been influenced by Hollywood this is an odd little film that seems to be neither fish nor fowl. The pieces don't really seem to fit together. Its kind of like the four friends who are the main characters, three seem like they belong together, but the fourth guy, the one who looks like an old Harpo Marx in a baseball cap and hoodie doesn't. The literary narration doesn't belong with the exploitation plot nor does the perfect sets seem to belong with the gritty nature of the story. Watch the opening party scene and try not to feel that this film little connection to reality (or how about the guys discovery of hookers on the street corner-priceless). <br><br>My reservations aside, this isn't a bad movie but it is often a very silly one. Give it points for trying to be more than a typical exploitation film. At the same time its hard not to take points away for it not hitting the mark. Its not fair I know but at the same time the various bits of the film don't mesh and the over whelming feeling you're left with is a disappointment at the film not being better. Its worth a try, but I'd wait for cable or a means of seeing it that isn't going to cost you money- or too much money.","user":"dbborroughs","rank":[6,9]}]