[{"title":"If you try to analyze Machete, you're doing something wrong.","rating":8,"date":"14 March 2016","review":"Machete is one of the funnest movies I've ever seen. Right from the beginning you know this movie doesn't take itself seriously. It's essentially a live-action cartoon with A-list actors. You have Danny Trejo - the antithesis of a leading man - carrying the movie as Machete, the unkillable badass Mexican James Bond. If you want to talk plot, this is basically a revenge story. Steven Seagal kills his family, then years later Machete gets caught up in a political scandal where Robert De Niro is playing a cross between George Bush and Donald Trump, and somehow Seagal's character is pulling the strings. It's as amazing as it sounds. Then you have Don Johnson as the head of border patrol or something, mowing down Mexicans all over the place, and Jeff Fahey as one of Seagal's enforcers in Texas. Now you may be thinking, \"Four villains? This sounds more convoluted than Spiderman 3!\" And you'd have a point if this was a traditional action movie, but it's not. At all. It's a comedy more than anything with some ridiculous action sequences and gratuitous T&amp;A all over the place. These characters just serve to forward the plot, and to give us some belly laughs, and somehow it all works beautifully.<br><br>Jessica Alba is one of the officers assigned to this scandal. Michelle Rodriguez serves as the leader of a Mexican resistance, oh and there's Lindsey Lohan playing Jeff Fahey's \"religious\" daughter. There are so many characters and somehow they all fit the movie perfectly. All of the acting is great (well, Alba is never \"great\" but she serves her purpose and she's as hot as a supernova so who cares). But you can buy Robert De Niro as a corrupt senator, Don Johnson as this racist megalomaniac, Fahey as this hard-ass enforcer, and Seagal as a Mexican drug lord. Yeah. And the best part is they're all having a blast. It's pure mayhem going on, and you're not bored for a second. Danny Trejo as the title character deserves much props though. He just looks like a guy who would have a wide array of knives stashed under his vest, and the guy is making out with some of the hottest women on the planet. It's the role of a lifetime.<br><br>Robert Rodriguez is amazing for making this an actual movie, and the cast are amazing for agreeing to be part of this project. It's so, so, SO entertaining. It's damn near impossible to sit through this movie with a straight face. I had a big fat grin throughout the whole thing. If you like silly action movies with fantastic actors and a surprisingly good plot, then look no further than Machete.","user":"lnvicta","rank":[65,81]},{"title":"Why is this not billed as a comedy?","rating":8,"date":"6 September 2010","review":"When I saw the trailer for this film I thought it had to be trash but I laughed almost from the beginning to the end. Tongue in cheek humour - it's all intentional, there is nothing unfunny about Machete.<br><br>I was ready for a lot of gore but it was all done in such a hilarious way that I hardly noticed how disgusting it was. I fact, I was still laughing 5 minutes after I left the cinema.<br><br>If he wasn't already so old I would say Danny Trejo was an undiscovered talent set for a meteoric rise, but the guy is already 64. I never could have guessed as the adrenaline and action pumped incessantly.... and hysterically this weather-beaten old dude also managed effortlessly to bed any chiquita he came across, and in style too.<br><br>Machete kills and maims and has sex all the way through the movie, but amazingly he is also a gentleman. you have to love him.<br><br>The best movie I have seen this year and the best movie of this genre for some time. Top marks for not taking itself one bit seriously but knowing exactly how to entertain!","user":"mike-3842","rank":[245,361]},{"title":"Machete delivers","rating":8,"date":"3 September 2010","review":"This film is what it says it is. Nothing less. And perhaps a little more. <br><br>Most of Machete's critics that have given overall negative reviews, have fallen into a trap of their own devices. Machete is an exploitation film and was advertised as such. By definition, and exploitation film will include excessive violence, gore, nudity, and be high on intentional corny lines while low on plot devices and character development. To give low ratings to Machete because of one's distaste for the genre, would be like saying \"The Shinning was awful because I don't like horror.\" <br><br>This is one of Rodriguez best films to date, side by side with Sin City (2005). Machete delivers on all accounts of action, gore, nudity, and corny lines. The plot is simple, but honestly, that's how it should be. The thing that sets this apart from other exploitation films is that the acting is top notch. I personally found that the three main female characters to be the most intriguing and diverse.<br><br>Jessica Alba plays the part of an ICE agent struggling with her loyalty to her nation and her people. She slowly begins to question her own logic on if people should follow law simply because they are laws. We see this struggle immediately, when she approaches a taco stand (apparently once every week) to by a coffee and lunch, despite her own people feeling from her site. Why does she continue this ritual? She says it is to check the papers of the character Luz, but really it is to try and hold onto a sliver of identity among her people. <br><br>Michelle Rodriguez plays said Luz (aka She) as an underground leader of illegal immigration. The character of Luz is a simple woman who believes in not bending to the broken system, but fighting for her people (the mirror image of Alba). \"She\" is only a myth on which Luz has built a cult following, understanding that sometimes being a myth can do more damage than flesh and blood. By the end of the film, Luz is reborn as the mythical She, just in time for the bloody battle.<br><br>Finally, the actress that surprised me the most was Lindsay Lohan. Despite only receiving 10-15 minutes of screen time (most are which she is undressed), she plays her character perfectly and flawlessly. The role seems to be written specifically for her and I applaud her for stepping up and taking on such a mature role. One of her first scenes is a tongue-in-cheek conversation about how she needs to give the people of the internet what they want, and that is more of her. Lohan played the part beautifully (in all aspects) and specks of talent are clearly visible. I hope that filmmakers and audiences (as well as herself) continue to allow her opportunities to showcase that talent. <br><br>Machete is an exploitation film at its finest. And, for the most part, if you are the type of cinema attendee who wants to see a movie called Machete in the first place, chances are you will be thoroughly entertained.","user":"jjohns33","rank":[235,380]}]