[{"title":"If you're going to remake a nearly perfect movie, don't botch it!","rating":19,"date":"19 September 2011","review":"This remake has no reason to exist. It is shallow and poorly acted and lacks most of the tense emotions and moral questions raised by the original. Hollywood at its worst, cellophane-wrapped, uninspired, made-for-TV quality, cookie cutter remake. Of course, it is padded with clichés, cheap effects and mass-appeal frosting to bring out brain-dead teen movie goers. Why did a great actor like James Wood let himself get suckered into this disaster? This could have been an so-so B-action movie but trying to cash in on the status of Sam Peckinpah's cult classic is a really cheap move. It also forces me to give it a 1-star rating rather than a 4 to 5 rating it could have earned if it didn't ask to be compared with the former. <br><br>If you consider watching this movie, please rent the original instead. It is still as intense as it was in 1971 and actually raises a lot of disturbing questions. A true classic.","user":"mikethevike","rank":[106,149]},{"title":"What was shocking in 1971 becomes dull in 2011","rating":7,"date":"13 February 2012","review":"The reviews here fall into 2 groups: those who've seen the original 1971 version, and those who haven't. The first group review by comparison with what was a shockingly controversial and influential film in its day.<br><br>But the second group saw the movie without preconceptions, and I'm interested to see they mostly found it dull, boring, slow, pointless and generally unsatisfactory, despite a decent cast and smooth production.<br><br>So, what was shocking in 1971 is boring to today's audiences? That may be the most shocking thing about this remake. I watched both versions back-to-back to find out for myself, and yes, the original is a good deal more daring (for its time), the retread pulls its punches while otherwise doing a decent job of relocating and updating without changing the story.<br><br>One other point I notice: the reviewers who know about the location - the US Southern Heartland - are the ones most critical of the way the locals are portrayed.<br><br>In this I must say the remake more than mirrors the original: Knowing rural England of the 1970s, I found all the local characters very unrealistic and badly acted. I know the original movie is highly acclaimed, but really, the local English actors all came across as bit-players from the old Ealing comedies, middle class city dwelling amateur dramatics types playing at being working class country folk, with dialog and mannerisms that only a foreign director could fail to detect as phony.<br><br>So, a polished but flawed remake of an unpolished, also flawed, but controversial original. 7/10 for effort.","user":"seanhimdb","rank":[16,19]},{"title":"What are You Capable of?","rating":6,"date":"18 September 2011","review":"Greetings again from the darkness. If you have seen Sam Peckinpah's classic 1971 original with Dustin Hoffman and Susan George, it is impossible to watch this remake without comparing the two films. Because of that, these comments will include some comparative notes. After all, it's been 40 years and most people watching this new version have never seen the original.<br><br>Director Rod Lurie follows the Peckinpah version pretty closely with the obvious changes being a move from the English countryside to the deep south (Mississippi), and the main characters are now a screenwriter and actress instead of mathematical whiz and ... well, whatever Susan George's character was in the original. Those are the obvious changes, but not the most significant. I really missed the subtlety and psychological trickery delivered by Peckinpah, especially in the relationship between David and Amy.<br><br>Lurie chooses to take advantage of the physical screen presence of Alexander Skarsgard (True Blood) as Charlie, the local stud and Amy's ex. Charlie's past exploits on the football field and his creepy leadership skills with his posse of thugs, provide the yin of physical strength to the yang of David's intelligence. It's interesting to note that this version spells out Sun-Tzu's description of \"straw dogs\" while Peckinpah left his audience to fend for themselves. But, of course, what this boils down to is just how far can a civilized person be pushed ... and how far is the bully willing to go? <br><br>James Woods is a welcome and terrifying addition to the new version. Since it is based in the small town south, high school football must play a role. Woods is the former high school coach who is now a violent drunk, and still leader of his former players. He is a sadistic type who picks on Jeremy Niles (Dominic Purcell), the slow-witted brother of Daniel (Walton Goggins) and constantly accuses him of inappropriate behavior with his 15 year old cheerleader daughter.<br><br>James Marsden (Hairspray) and Kate Bosworth (Remember the Titans) play David and Amy. They come back to Amy's childhood home so she can rest and David can have some peace and quiet while writing his screenplay on the Battle of Stalingrad. Well, we couldn't really have him writing a rom-com, could we? From Day One, the peace and quiet is clearly missing and Lynyrd Skynyrd wins out over Bach in the battle of radio volume. Tension builds and David is tested daily over what it means to be a man ... tested by the local hicks and doubted by his lovely wife.<br><br>Things turn from bad to worse when the locals invite David to go hunting with them. What happens with Charlie and Amy during this time changes everything. This sequence was the key to the controversy of the original and what caused it to be banned in many cities and countries. Lurie chooses to handle it in a very straightforward manner - plus, times and mores have changed quite a bit in the last 40 years.<br><br>For me, the Peckinpah original remains a classic film with brilliant psychological undertones which left me feeling very uncomfortable and questioning what I might do in this situation. Lurie's new version offered little of that but does work fine as a straightforward suspenseful thriller.","user":"ferguson-6","rank":[61,84]}]