[{"title":"Suffers from \"Middle of the road\" syndrome.","rating":4,"date":"26 June 2010","review":"No, you're not having an acid flashback, and you don't need to text ChaCha, that is Joel Greco from trash TV show \"Cheaters\". I recently subscribed to \"Indieflix\", which, if you don't know, is like Netflix instant watch, only for independent film exclusively. It's a good service, if you would like to check it out, and it provides countless hours of independent cinema at the click of a button. Last night, I saw a vampire/comedy film available by the name of \"Nightcrawlers\", Having never heard of the flick, and it being so close to the release date to the latest mind numbing entry into the Twilight Saga, I gave it a go. Having a brisk runtime of only 74 minutes, it wasn't much of a commitment.<br><br>\"Nightcrawlers\" follows two friends in a hick town. Rob, played by Lee Trull, who has just discovered that his girlfriend is pregnant, and is desperate to get his act together, and Coop, played by Gabriel Horn, the town slacker, who also happens to be running for mayor. The duo have a run in with a mysterious outlander with a business proposition, but in order to hear said proposition, the two have to meet him at an abandoned barn outside of town, in the middle of the night. Sounds shady right? Well, after being told that there is a potential to make tens of thousands of dollars, they decide to give it a go. The job is simple, sneak into a creepy house that is rumored to be haunted, open a safe, grab the money, and the deed to the house. What could go wrong? Well, turns out it's not actually the deed to the house, but some sort of ancient scroll that vampires have been fighting over for centuries.<br><br>This is a hard film to review. It suffers from \"Middle of the road\" syndrome. It's not so bad that it's hard to watch, but it's just so by- the-numbers that it's hard to enjoy. It feels as if the writers were trying way too hard to be clever, and funny, and in turn, achieved neither. There were perhaps two moments in the film, that made me sort of smirk, but never was there an actual comedic moment. Both main characters played their roles well, but didn't have much by way of script to work with.<br><br>To call this a Vampire film would be a stretch. Yes, there are vampires involved, but they are far from central to the plot. We're treated to a few fang mugging close-ups, and that's about the extent of it. You could tell that the FX department were aiming to mimic the style of vampires featured in \"Lost Boys\" sunken eyes and all, and I suppose they did an OK enough job, it just wasn't enough to elevate my enjoyment of the film.<br><br>I'm not sure what the budget was, but I will say that it looks amazing. For what I'm assuming was a low budget production, they really worked well with what they had. I think there is some genuine talent behind the lens, but I also think that director Benjamin Wilbanks should adapt someone else's script for his next project. With a better screenplay, and some wittier dialog, this could have went theatrical in my opinion.<br><br>The third act tried so hard to be amusing, but I couldn't help hearing the sound of \"Yakety Sax\" in my head. It was a skit lifted directly from Benny Hill. Our main characters are running in circles across town from a horde of stumbling hillbilly vampires. It may sound entertaining to you, but I personally sat in disbelief of what I was witnessing.<br><br>I can't recommend \"Nightcrawlers\", but I can't suggest staying far away from it either. It's so generic that it's impossible to call bad. Think of it as film purgatory. If you have 70 minutes that you would like to donate to an experience you won't remember, but won't regret, give it a go. If not, no worries, the world will not end.<br><br>4/10<br><br>http://www.liberaldead.com","user":"Strawberry_Typhoon","rank":[14,18]},{"title":"Not Terrible, Good to Watch With Buddies","rating":5,"date":"31 October 2018","review":"Decent monster movie with some fun. Action and plot is what t is. Movies like this needs more tits and asses.","user":"Dark_Lord_Mark","rank":[0,3]}]