[{"title":"A very well-acted study of three fragile souls.","rating":9,"date":"3 October 2008","review":"Three soldiers are home from Iraq; a 40-ish Tim Robbins out for good and the young Michael Pena and Rachel McAdams on a thirty day leave. Each has their own problem that they are faced with at the beginning of the film. Robbins comes home to a wife who wants a divorce and a son who needs $20,000 for college, Pena suffered a wound that has made him impotent and McAdams lost her friend and wants to find his family in order to return his guitar and live with them since she's lost any ties with her own. Think every problem is going to be solved in a little bow by the end? Well, you'd be right. Think that it's going to really typical and schmaltzy? Not so much on that one. It seems like a film that's made for the obvious ups and downs throughout but it actually manages to be quite original and refreshing. Instead of feeling like a film that's just about resolving the individual situations, it's a lot more carefree and a lot more about these three people simply enjoying life together and keeping one another joyful.<br><br>Of course there are many different stops on the way to their ultimate destinations in order to give us some situations of them interacting in the real world, but each one is a lot of fun and we gain a little more depth to the characters at each stop. All of the characters are well-fleshed out and don't feel like just another retread of stereotypes we've seen over and over again. One of the things that really surprised me is that when a little romance starts to bloom between Pena and McAdams, I didn't roll my eyes like I would have expected but instead I smiled and enjoyed watching this flirtation grow between the two of them in a non-typical way. And all the way through we are treated to three strong performances from three solid actors.<br><br>The real star is Rachel McAdams, who I'd say is Oscar-worthy. She keeps the laughs coming all the way through and steals every single scene with her bright eyes and southern drawl, but you can tell that there is real emotion brimming just under the surface. She's a girl who has every reason to hate life with a fury, but she remains optimistic and tries to get those around her to enjoy living just as much as she does. One scene in particular, when she finally meets the family of her fallen friend, is a showcase for what an extraordinary actress she is. This is her best performance by a long shot, and definitely one of the best of the year. The Lucky Ones is something that could have been obvious and clichéd, but ended up being just the opposite; a refreshing and very well-acted story that I wish wasn't destined to be forgotten come awards season.","user":"dead47548","rank":[64,74]},{"title":"A Gentleness That Rings True","rating":7,"date":"30 January 2009","review":"Three soldiers who have received non life threatening wounds in Iraq are together on a plane to New York. Two of them are on thirty day leaves while the other has served his time and is on his way home. Due to a power outage, all flights out of New York have been canceled. The three agree to rent a car together in order to continue the trip to their destinations. Thus begins a road trip that is highly dramatic with its share of comic events.<br><br>Fred Cheaver is the middle aged father figure of the three - a man who never really expected to do anything in the army except serve his domestic reserve duty. He is glad to be rid of the whole thing and is headed home to his wife and son. The two young soldiers who accompany Fred are Colee Dunn and T.K. Poole. Colee is a bright-eyed innocent who is on a mission for a fallen comrade who saved her life. T.K. is a no nonsense soldier from a family of soldiers who plans to make the army his career and move up the chain of command.<br><br>Whereas, Fred's quest is to return home to wife and son, Colee's and T.K.'s goals are to travel to Las Vegas for two entirely different reasons. Colee wants to return her dead comrade's treasured guitar to his family. T.K.'s reason is somewhat mysterious, but we know it is related in some way to his injury that has left him temporarily impotent.<br><br>As with all road trip films, the experiences and interactions of these three lead to conclusions not expected by them or the viewers.<br><br>Unlike most films featuring vets returning from the horrors of war, this film is not filled with dark angst - not to say the characters are not well-fleshed and genuine. These three are real people with real problems, but their depictions are not heavy-handed.<br><br>During this film, the viewer gets to enjoy the work of three excellent actors. Tim Robbins gives his usual fine, understated performance as the older man facing some totally unexpected twists of fate. Rachel McAdams gives Colee a likable innocence but also reveals some darker layers of her character. Michael Peña is very, very good as the macho guy with a heart who only wants to be a good soldier. Watching these three interact is a real treat.<br><br>Some may consider the treatment of the subject matter of this film too light handed, but it has a gentleness that rings true. It is surely worth watching.","user":"nturner","rank":[31,35]},{"title":"an awesome quirky little film.","rating":8,"date":"6 February 2009","review":"Neil Burger's offbeat, quirky, dramatic movie is a triumph. It succeeds in all the aspects, from the technical parts to the acting, I can't find a single negative thing about it. Burger doesn't dilly-dally around, he went straight to the point of his subject, giving a fair amount of time for each of the three characters (McAdams, Pena and Robbins) to develop and eventually you can't help but really like them...a lot. Especially McAdams but more on that later. The script is tightly wound, the chemistry between the three protagonists doesn't seem forced, the movie doesn't force you to like them the moment the movie starts but instead, these colorful characters will gradually grow on you.<br><br>Tim Robbins, one of my favorite actors, doesn't disappoint. 2008, I have seen him in two movies the other one being The City of Ember. And as long as a movie has Tim Robbins in it, I'm sold. That's why I watched the movie in the first place. Michael Pena, another great guy, gives off a good vibe towards the movie and once you know what's been bothering his character, you can't help but laugh at how one-sided and ridiculous his problem is. Pena gives one of his greatest performance on screen. And of course, the belle of the ball, the star of the show, Rachel McAdams gives a quirky, zesty and joyful performance as a lovable Southerner and I can't help but be reminded of another quirky, zesty and joyful character, Amelie. She just keeps the laughs rolling in and steal every scene she's in. She gives the character such depth that one might come off as one dimensional had it been portrayed by a lesser talent. Definitely an underrated performance for 2008.<br><br>Highly recommended.","user":"mr_popcorn","rank":[22,25]}]