[{"title":"Really, an excellent film","rating":9,"date":"7 May 2011","review":"I think there are 3 reasons some reviewers did not like this movie. First it was placed in the \"suspense\" category and it is a drama. Second, some of you may be used to fast reactions to conflicts and the sometimes violent retribution many movies contain. Third, you may be young. I am old and have had friends who had affairs, some who wanted to, and didn't. I have seen many happy marriages and many lonely sad marriages. I found the movie honest and extremely well acted. The husband had all the rage, anger and desire to kill the lover, until he got to know him. The lover, at first glance, is smug, a playboy, easy to hate. But in the end, the husband sees the lover for the deeply sincere, but flawed man he is. He finally sees himself as his dead wife had seen him, more than the boring software engineer. He is better than that. The lover is much less than a rival, but they deeply loved the same woman. The husband realizes how really devastated the lover is and how his wife had loved and deserved both men in her life. As life usually is, there was poetic justice. She died a painful death after hurting her husband. He finally forgave and found peace. The lover was forgiven, often a reason for shame, his secrets open to those around him. He lost the woman he loved, and a women who loved him for what was inside, not the phony outward role he played. You know he will never find that again. There is a lot going on in this movie, all under the surface. I kept wondering if it would revert to the standard murder scenario, that was the suspense for me. The outcome was real, not Hollywood.","user":"kathynorris1","rank":[48,60]},{"title":"Great cast, interesting premise, terrible direction","rating":29,"date":"29 August 2009","review":"Liam Neeson plays Peter, the husband of a famous shoe designer named Lisa(Laura Linney). After some suspicions Peter realizes that his wife hasn't been faithful and when he finds the address of Ralf(Antonio Banderas), the man his wife cheated on him with, he travels to Italy to confront him. When I saw the trailer for The Other Man, I immediately thought the film had a great premise; a man finds out that his wife has been cheating on him and then he tries to track down this man and execute some kind of revenge. That is what you get from the trailer, however, the trailer is incredibly misleading, the story doesn't pan out like that. Not even close. But what really ruined this movie for me, was the direction. Most of the scenes seemed glued together. You're watching a scene and all of a sudden you're watching something completely different and you're left wondering if you missed the last 10 minutes of the film. The reason why the film is like that, is because the director introduced a twist near the end but, until that moment, nothing makes sense, and when the reveal finally comes, it's a terrible letdown. This premise and cast on someone's else hands could have been something great. Unfortunately, all Richard Eyre's was able to do, was a boring and poorly executed movie.<br><br>5/10","user":"imdbbl","rank":[74,107]},{"title":"An Atmospheric Gem for the Thinking Viewer","rating":10,"date":"17 October 2010","review":"Sick of explosions and car chases? I am. The Other Man is a surprisingly atmospheric and complex story about a grieving man (played intensely by Liam Neeson) who discovers his wife has had an affair. Obsessed with discovering the identity of the other man (played excellently by Antonio Banderas in a very different sort of role) he tracks him down and befriends him without revealing his identity. The scenes where the two men pay chess, and the dialog over the board are revealing, and the torment subtly played by Neeson, is masterful. Banderas and Neeson are superb in this movie, which is both a mystery and a psychological thriller, all filmed with exquisite attention to light and atmosphere in Italy and England. If you rent it, I highly recommend you watch it a second time with the director's commentary turned on—but not the first time; it gives too much away. You may want to watch it a third time.","user":"VeeIMDB","rank":[31,42]}]