[{"title":"The Thing","rating":7,"date":"13 February 2020","review":"This film deserves the criticism it gets and while flawed and nowhere near the classic Carpenter film, it did finally tell the tale of how the Thing was discovered. Also the limitations of the Thing not being able to replicate metal was a clever touch in my opinion.","user":"MR_Heraclius","rank":[45,50]},{"title":"Pales in comparison to Carpenter's classic with nothing new or interesting to offer of its own.","rating":5,"date":"23 May 2016","review":"It's hard for anything to compare to John Carpenter's The Thing. It's one of the greatest horror films ever made, some would argue *the* best. Thankfully, they didn't go the remake route here and instead opted for a prequel that depicted the events that happened in the Norwegian camp prior to the '82 version. In that regard, this movie does an impressive job at tying some knots like showing how the two-faced thing came to be, as well as the origin of the dog from the start of Carpenter's Thing. Sadly, that's where most of the praise ends. <br><br>The Thing suffers from what plagues many horror movies these days - underwritten characters and overwhelming CGI. One of the scariest things of Carpenter's version is the practical effects of the \"thing\". They were horrifying. Here, all subtlety is thrown out the window in favor of huge CGI monsters. It's effectively used in a couple scenes, but the monsters lose their scariness after a while and it just becomes gratuitous. The characters themselves are paper thin. What helped make the '82 version so fantastic is that we got to know the characters, their quirks, their personalities, and we were able to empathize with their situations. In this movie, half of the characters are interchangeable. I didn't even know most of their names. And worse yet, I didn't care about any of them. There's one particular scene that calls back to Carpenter's infamous blood test scene where I realized that most of these people are really dumb and I don't care if any of them die. That's not good in a horror movie. By that point it was just a waiting game for them to get picked off one by one.<br><br>The lead performances are strong. For the material they were given, Mary Elizabeth Winstead and Joel Edgerton do a fine job. But that simply isn't enough to carry a movie like this. The Thing is supposed to be scary, and for the most part, it isn't. That's a failure by horror standards. There's some face-value entertainment to be had here, but if you're looking for a substantial prequel to Carpenter's masterpiece, you'll be sorely disappointed.","user":"lnvicta","rank":[92,114]},{"title":"Movie done with great respect for source material","rating":8,"date":"8 October 2017","review":"I didn't go see The Thing in 2011 for two reasons. One, I was reluctant to support a prequel when what I had really wanted for thirty years was a sequel. Two, the movie seemed to have vanished from the theaters only after a few weeks. In the meantime, I only heard negative things(no pun intended) about this film so I didn't feel like I was missing out.<br><br>However, something really weird happened when I finally caught it on HBO. I liked it! No, I mean I really liked it. To be clear, the criticisms about it being an unnecessary and almost too similar story to John Carpenter's classic are all fair. And, like most sic-fi movies today, there is more cgi than I would care to see. But the people making this movie clearly worship Carpenter's movie every bit as much as any die hard Thing fan. They go to great lengths to match up to the events suggested from the 1982 version and I personally appreciate them doing so. I also liked their method of detecting who was the Thing. It was different than MacReady's test but it was original.(Nothing will ever top the petri dish sequence and dialogue, Carpenter and Russell just nail it).<br><br>If you're a fan of the original looking for something completely different or a \"new take\" on The Thing From Another world, than this movie is not for you. But if you're like me, and always wondered who put that ax through the door or what events led up to the two-headed thing burnt up in the snow at the Norwegion compound than I highly recommend this flick.","user":"JGDragov","rank":[55,69]}]