[{"title":"Credit crunched","rating":7,"date":"10 February 2009","review":"Economic ruin seems to be all the rage these days - since the Japanese have gone through it all in the 90's they have a bit of a head start over addressing it artistically. This is Kurosawa's take on the humiliation job loss delivers to the Japanese male, and the ennui of modern middle class Japanese life.<br><br>Someone once wrote that every Japanese film maker eventually does his 'Ozu' movie, and for the first hour this seems to be Kurosawa's. It starts out as a beautifully observed family drama, when a very ordinary Japanese family goes about their business, unaware that the father Ryuhei has been made redundant - his company realises they can cut costs by shipping out all admin to Dalian in China. In very Japanese fashion, he pretends nothing has happened, going to 'work' all day, which consists of sitting around waiting for food handouts, then coming home pretending everything is normal. In the meanwhile his oldest son fails to find a meaningful job and his youngest is struggling at school. His wife Megumi (a very fine performance by Kyoko Koizumi) keeps the family ticking over.<br><br>It seems to be well on its way to a quiet drama about a family coping under strain, but then the Ozu gives way to a bit of Haruki Murakami style magical realism - all sorts of unlikely events and coincidences take place, forcing everyone to confront their failures. This includes a frankly bizarre subplot featuring Iraq and what seems a pointless one about a kidnapping. It all ties together with an ending that thankfully falls just short of too much sentimentality.<br><br>It is an intriguing film, and one that does at least attempt to tackle real issues and themes in family life. Unfortunately, I think it is ultimately something of a failure - too often it meanders away in a manner that made me suspect the film maker just didn't know where the narrative was going. I think in making this Kurosawa watched a lot of Ozu - its a pity he didn't listen to Ozu's advice that too much plot means you are manipulating your characters, and if you are manipulating them, you are not respecting them. I would consider this film to be an honorable failure, but still a failure on its own ambitious terms.","user":"GyatsoLa","rank":[32,37]},{"title":"I highly recommend this film.","rating":10,"date":"16 April 2009","review":"At first I thought this film would be a depressing story to watch, but I was surprised that the film was actually very uplifting. Although it's a sad story overall, it has a very powerful message if you watch it to the end, a message that will encourage you to move on even when life gets to its darkest moment.<br><br>This story is about problems of people in Tokyo, all sorts of problems. The leader of the family lose their job and was afraid to tell his family, the elder son join American army and go to war, the younger son wants to learn the piano but the father forbids him, the wife is depressed of trying to hold the family together. The film is so delicate and beautiful. It captures the feeling of each character and the whole depressive atmosphere of Tokyo very well. The pace is slow but it's not boring because you can follow the story very easily and you can sympathize with each one of the characters. It doesn't even have any Hollywood boring formula of sentimental film. This is a real work of art.<br><br>I'm not gonna spoil this movie. I just want to tell you to go watch this film and watch it to the end although you feel that it's getting darker and darker. For me, this is not another good movie. This is a \"great\" movie because after I watch it, I feel that now I can go on with my life.","user":"khemass","rank":[40,50]},{"title":"A hard look at Japan","rating":8,"date":"13 September 2009","review":"For a foreigner like me, Japan is a mystery, both wonderful, weird and hard to understand, especially since most of my information about the country is anecdotal or (worse?) coming from mangas. I've met people having the greatest respect for Japanese customs and people who completely badmouth the country.<br><br>From this perspective, Tokyo Sonata is a bit of a gem, showing me how ordinary Japanese people live and think. There is the family, standard issue of father, mother and two children, and there are the roles: head of the family, respectful housewife, rebellious teenager and confused child. What do they do when the economic crisis and the traditional value system clash?<br><br>I thought the actors were good, the soundtrack as well (to be expected given the title), and the plot was slow but crisp. There must have been a lot of expectations on a guy directing movies when his last name is Kurosawa and not related to Akira, because the movie was overall an excellent film. However, given its two hour length and slow pace, I advice you look at it when in the mood for cinematography, not some easy entertainment. Also, it is a pretty sad drama in places, so be ready to empathize with some hard hit people.","user":"siderite","rank":[30,38]}]