[{"title":"The Hobbit","rating":9,"date":"14 February 2020","review":"It's definitely no LOTR...But it's still a pretty cool movie. Sure, it took it's time to try to tell the story and dragged on for a little too long, but other than that, the special effects were great, and it was entertaining as hell. It's a good introduction to The Hobbit franchise.","user":"MR_Heraclius","rank":[48,50]},{"title":"A visual feast but yet I wasn't gripped by the story or characters as much as I should have been","rating":26,"date":"26 January 2013","review":"When I heard that there was to be a film version of The Hobbit, I was quite looking forward to it as the big finish of Lord of the Rings was still in my mind and, unlike LotR, I had actually read The Hobbit several times many years ago. When I heard that it might be two films I wasn't surprised but the news that it was to be three did rather dampen my spirits as I don't know if I had the interest for this story to be concluded as 2016 rolls into town. Regardless I did of course watch the film because it is still a large blockbuster and, at a time of the year normally filled with overly earnest Oscar contenders, I did quite like the idea of returning to this world again.<br><br>With this in mind I did wonder why I watched it with a surprisingly detached air and why I wasn't able to get into it like I should have done. I had some reservations with the first film in the LotR trilogy but this seemed different because it certainly wasn't a lack of action and forward motion that gave me a problem here. Quite the opposite actually because, once the first 45 minutes or so are out of the way then the action set-pieces come thick and fast and noisy. The opening hints at the power of the dragon to come before settling down for a gentle reintroduction to the Shire and then the characters we will follow; this section I found a little longer than it should have been and I could have done with a bit less noisy banter from the Dwarfs, since the film would provide much more from them. The majority of the film is the journey (or at least that bit of it that this film covers) and it produces plenty of action with great special effects really well integrated into the live action. So visually and technically there is plenty here. Problem is that little of it felt urgent or tense and actually the delivery of the constant action does rather detract from it.<br><br>With Fellowship of the Ring, the group was smaller and the development of the plot better; additionally the action was more scaled down and comparatively simple. Here we have set-pieces where it feels like everything has been thrown at the screen and every inch of every frame has been filled with movement wherever possible. This tended to overwhelm me rather than draw me in though and in effect the noise prevented me really getting into it. Likewise by the time I had seen the characters survive impossible situations and defy gravity for the third or fourth time, the film sort of lost the ability to make me believe there was danger involved – which is a problem given I was already being pushed away by how busy and noisy it all was. Tellingly the scene that worked the best for me was with Gollum; this scene had tension, had uncertainity, had threat and did it all with small movements and dialogue; also worth noting that while Gollum is of course another special effect, you don't notice it in that scene because you are focused on the content instead of the visual.<br><br>The cast sort of fit into this approach as well. While everyone is fine and does as required, at times they do tend to become part of the noise and effects rather than being characters. Freeman is a good Bilbo and his mannerisms work well (which helps negate his limited range) while of course McKellen is always welcome. The dwarfs didn't make much of an impression on me though, even if they all looked the part and delivered a few laughs. The rest of the cast are all fine but to be honest the effects are the main stars here and technically it is very impressive even if it is a bit overdone at times.<br><br>I didn't dislike The Hobbit but at the same time I was disappointed in it. The action is noisy and busy but there isn't enough to draw me into the story or to make the action thrill me so much as it did overwhelm me. Hopefully the second film will see the characters and plots grow me on so that I am more emotionally bought into the films, but for this first one I must confess to being surprised by how much the film seemed content to have me watch from a distance rather than draw me in and engage me.","user":"bob the moo","rank":[222,305]},{"title":"An Unexpected Disappointment","rating":6,"date":"13 December 2012","review":"I was convinced the (many) criticisms I read beforehand were exaggerated and wouldn't bother me. To my surprise, quite some criticisms seemed justified in the end ...<br><br>***THE SCRIPT***<br><br>ADDITIONS: On paper, the additions looked like a great way to create added value. However, while I understand why they included them, they all feel out of place.<br><br><ul><li>Opening scene: Ian Holm just looks too dissimilar from his appearance in FOTR (especially his haircut), which is really distracting. The frame story doesn't blend in naturally and the history of Erebor has too much to show in too little time.</li></ul><br><br><ul><li>Radagast: He appears as suddenly as he disappears. His scene in Dol Guldur really threw me out of the movie.</li></ul><br><br><ul><li>The White Council: I know the screenwriters want to underline the growing dark powers (hence the - preposterous - finding of the Morgul blade), but the empty talk about things of which we all know how they've played out in the LOTR films isn't convincing at all.</li></ul><br><br><ul><li>Azog: An appallingly one-dimensional character, who feels most out of place (the fact that he looks like a creature from a cheap horror movie also doesn't help ...). His scenes have a strange \"un-Tolkien\" vibe, particularly the battle of Azanulbizar (the worst scene of the movie), which doesn't feel like a fierce and thrilling battle at all.</li></ul><br><br>FROM THE BOOK: The episodic structure prevents the film from having a fluid narrative and squeezes the tension out of every new dangerous situation: the events just leave you cold.<br><br>In the book, we experience everything through Bilbo's eyes, which creates a strong connection between the reader and the main part. This is missing from the movie: Bilbo even seemed to have more or less disappeared between the troll encounter and the stone giants' battle. His homesickness, his doubts, all of this isn't really developed in the script.<br><br>The emphasis on Thorin is a good thing, but also not perfect: during the enclosure by the Wargs, I didn't buy Thorin's charge towards Azog and especially Bilbo's sudden \"action hero saves the day in the nick of time\" intervention. The latter seemed like a very inappropriate way to illustrate Bilbo's courage.<br><br>There were actually only two great scenes: Riddles in the Dark is amazing, but ironically, it also painfully shows how mediocre the rest of the movie actually is, because this is the only moment that comes close to the level of LOTR. Also, Bilbo's speech after they've escaped Goblin Town is a very welcome, for rare touching moment.<br><br>***THE PACING***<br><br>It's quite astonishing some people complain about the pacing, because the film was over before I knew it. In fact, I think the pacing is about just right and proved it would have been really difficult to adapt the book in just one fully-fledged movie. But since I didn't like the additions, I'm doubting whether a third film is necessary after all (but I suspend my judgment until 2014).<br><br>***THE CINEMATOGRAPHY***<br><br>One of the biggest (unpleasant) surprises is the cinematographic style. I'm not talking about the bright colors or the digital images, but the (lack of physical) camera use. Whereas LOTR has stunning \"real\" camera movements and an extremely accomplished \"handicraft\" feel, AUJ often feels like a video game. The camera is flying and whirling so limitlessly that it just doesn't feel like an authentic movie anymore. This is particularly apparent during the Orc chase and above all the absurd Goblin Town escape. The CGI is perfect, but too much is just too much.<br><br>***THE MUSIC***<br><br>After my long list of complaints, I'm truly relieved to say there is at least one thing that unconditionally gets my support, which is the score. The people who unfairly label Howard Shore's work as a \"re-hash of LOTR\" obviously didn't pay full attention, because when you listen to the score multiple times (and I admit it also took me several spins to really appreciate it), you discover a new rich and diverse musical tapestry once again masterfully woven by Shore. OF COURSE you hear the same themes when EXACTLY THE SAME places are visited as in \"The Fellowship of the Ring\" ... If someone deserves credit for \"The Hobbit\", it's Shore: his music is in my view the only aspect of the movie on par with the level of LOTR.<br><br>***3D &amp; 48 FPS***<br><br><ul><li>The 3D was good, no complaints about that. However, although I have no problems with watching movies in 3D, I start questioning its necessity.</li></ul><br><br><ul><li>I am bewildered many people claim that 48 fps creates a \"TV-look\" with \"actors with clear make-up on a fake set\". I didn't have that feeling at all, but on the other hand - and this was the most surprising - the difference with 24 fps isn't THAT spectacular. After 30 minutes, I even had to remind myself: \"Oh, I'm watching 48 fps, right?\". Yes, the images look very clear and it does smooth fast movements, but the latter (which is positive) only sticks out a couple of times (and no, the motion never comes across as \"sped up\", so I was never distracted by the higher frame rate). All in all, I consider 48 fps to be an improvement over 24 fps (without diminishing the \"cinematic\" look of a film), but I didn't have the feeling I had witnessed a \"revolutionary new cinema experience\".</li></ul><br><br>***** CONCLUSION *****<br><br>I didn't expect (or want) a replica of LOTR, but while \"The Hobbit\" isn't a bad movie, it isn't good either. I'm still perplexed I don't feel any urge to go see it again, unlike the LOTR films. We can only hope that Jackson recovers in time to save the next two films from unnecessary additions, lack of focus on Bilbo and a video game feeling. Well, at least we have new brilliant music to listen to!","user":"gorbadoc25","rank":[628,921]}]