[{"title":"Green Light For Green Zone","rating":8,"date":"3 February 2010","review":"Green Zone is the latest Iraq War inspired motion picture. I wasn't expecting much and ended up being pleasantly surprised. It's a fast paced and riveting ride from the get-go. The war being fought in the film is more between the Pentagon and the CIA than the US v Iraq which makes it all the more interesting and the film allows you to see things from Iraq's perspective for a change. The premise set up in the film regarding the 'Intelligence' regarding Weapons of Mass Destruction used to justify the invasion is entirely believable. Matt Damon is well suited to his part as a unit leader Roy Miller, as is Brendan Gleeson as the CIA man and Greg Kinnear is refreshingly nasty as Poundstone from the Pentagon - all turn in good performances. Shot on location in Morocco, Spain and in England I could have sworn we were in Bagdad the whole time - settings are very convincing. Yes, there is too much hand- held camera movement that quickly brought on discomfort followed by a headache but that is my only negative and as the film doesn't outstay its welcome I'm willing to concede the shakiness probably lends an 'embedded' realism. Is any of the plot or characters based on real events or people? I have no idea other than learning the film is based on the 2006 non-fiction book 'Imperial Life in the Emerald City' by Rajiv Chandrasekaran, a journalist for The Washington Post. I haven't read the book so I can't comment on how closely the film follows it. I spent a few moments of the film wondering about the story's authenticity but as a piece of cinema entertainment in its own right Green Zone gets the green light from me.","user":"briandconnor","rank":[287,375]},{"title":"Were the characters real? You betcha!","rating":8,"date":"13 July 2010","review":"This movie is not a sequel to Bourne flicks. It is more in the spirit of Costa-Gravas or Oliver Stone. MET Alpha is Mobile Exploitation Team Alpha. The 85th XTF is the 75th Exploitation Task Force. CWO Miller is CWO Gonzalez. The reporter is, of course, Judith Miller, the New York Times (not WSJ) reporter who sold out to the Bush administration to get bylines. She used her position as shill for Rummy to keep MET Alpha in Baghdad, chasing their tails while American soldiers died trying to find non-existent WMD, for the sole purpose of backing up Bush's lies. Miller's folio is full of information from Curveball (Magellan). The CIA, who knew Curveball was a liar, was also warning Miller. A perpetually smiling Ahmad Chalabi keeps popping up. He is no doubt thinking how fine it is for the US Army to hand him an entire country along with a treasury of several hundred million dollars.<br><br>Miller is angry because he knows his intelligence is bogus, the CIA has told him that much, even though the Army vouches for it, and tells Miller to shut up and follow orders.<br><br>The Pentagon puke tries to bribe Miller with a job if he plays along, and offers a veiled threat if he doesn't.<br><br>The movie is history, and not a simple action adventure flick. It follows actual events very closely. Knowing the facts makes the movie much more fascinating.","user":"dsnider-790-336398","rank":[35,41]},{"title":"Exciting action but some tough questions too","rating":19,"date":"19 March 2010","review":"British director Paul Grengrass + American actor Matt Damon = \"The Bourne Supremacy\", \"The Bourne Ultimatum\" and now \"Green Zone\", so we know what to expect here - and we're not disappointed. From the opening seconds, we're into the action with the trademark Greengrass 'in the action' frenetic camera-work and sharp editing. Although the film is said to be inspired by the non-fiction book \"Imperial Life In The Emerald City\" by Rajiv Chandrasekaran, a journalist for The Washington Post, the conspiratorial storyline is the invention of Greengrass who developed the original script.<br><br>If the tension isn't as excruciating at that other Iraq movie \"The Hurt Locker\", at least \"Green Zone\" has a narrative and poses some questions, hard questions that many American viewers would probably were rather not aired: what was the source of the 'intelligence' that Saddam Hussein possessed weapons of mass destruction? why was the source so readily believed when the evidence was so thin? could the bloody insurgency which followed the relatively easy initial occupation have been avoided if the Americans had been willing to work with elements of the Iraqi army? <br><br>See the movie and think about the issues. As a central Iraqi character puts it: \"It's not up to you to determine what happens in this country.\"","user":"rogerdarlington","rank":[141,181]}]