[{"title":"Oh, Goody! Let's Watch More Pretty Twenty-Somethings Die...","rating":8,"date":"12 July 2008","review":"You already know the drill. You've seen what this genre can produce before, and you're pretty sure you've seen the best and the worst of it. From bygone days, JUST BEFORE DAWN. HELL NIGHT. MY BLOODY VALENTINE. LAST HOUSE ON THE LEFT. THE HILLS HAVE EYES. THE EVIL DEAD. And from the past couple of decades, HOSTEL. TURISTAS. WRONG TURN. JOY RIDE. <br><br>And of course, the film to which THE RUINS will probably get the most comparisons, CABIN FEVER. Except instead of being set out in the middle of CHAINSAW territory, now it's an ancient sprawl of Mayan ruins. The fact that Four Beautiful Gen-X'ers are involved is about where the similarities end. Mr. Eli Roth, I'm sorry to inform you that you got served.<br><br>Because just when you think that THE RUINS is really nothing more than just another yawn-inducing slasher movie, it takes this turn into THE OUTER LIMITS that you don't ever expect it to. And it's so much the better - and more terrifying - for that.<br><br>Jonathan Tucker (HOSTAGE, Showtime's MASTERS OF HORROR), Jena Malone (BASTARD OUT OF CAROLINA), Shawn Ashmore (the X-MEN series) and Laura Ramsey (LORDS OF DOGTOWN) star as two best friends and their respective boyfriends on vacation in Mexico, for a period of beaches, booze and \"knockin' da boots\" before Tucker's character, Jeff, takes the educational equivalent of the Bataan Death March: attending med school. <br><br>The whole nightmare starts pretty simply, as nightmares often do in these things. The two couples meet cute with a German tourist, Mathias (Joe Anderson), whose own girlfriend, an archaeologist, has gone to her latest dig with Mathias's brother. He invites his new friends to come with, and since there's not much more excitement to be had, other than getting fit-to-puke drunk on too much cheap tequila, they take him up on his offer.<br><br>Really. Bad. Move.<br><br>The Fearless Foursome go to the dig site with Mathias and his friend, Dimitri (Dimitri Baveas) and nothing too alarming or remarkable happens along the way. It's when they get there that the fajitas really hit the fan. Because this set of ruins is no ordinary dig site. And if you have prepared yourself in advance for the ghost of some ticked-off Mayan god ready to rip out the hearts of these intruding Americanos, you are way off-base, my friend. What they find is more insidious, horrific and literally creepy than anything you've seen in a long, LONG time. <br><br>Kudos must immediately go to Scott Smith, the author of A SIMPLE PLAN, for adapting his page-turner of a runaway bestseller into something that should make Stephen King green with envy. The core idea is not an original one, but the way Smith uses it and his depictions of how it affects the characters involved is Grade-A 100% pure classic horror. Director Carter Smith, with his major movie debut, is great at ratcheting up the scares and the gore quotient as he wrings some pretty genuine performances from his cast.<br><br>But the nasty creepiness and dread are just the black frosting on this rotting cake. Dig underneath and you get some super bonuses: one scene that will forever make the \"hobbling\" scene from MISERY seem like a Sesame Street cakewalk, and one unbelievably goose-bump raising sequence that will forever have you getting freaked out about your cell phone. I can't tell you why...because the less you know about it, the more terrifying it is. <br><br>Yes, the creative forces here make the most of milking the themes of isolation, hopelessness and impending death. But it's the HOW, not the why that sets THE RUINS apart from any other movie of its kind that's been made before or since.<br><br>Right now, I would rank this one right up there with Neil Marshall's THE DESCENT as one of the Top Ten Best Horror Films made in this decade.<br><br>Gee, in spite of all the remakes still ongoing, maybe there is still some hope for horror after all. <br><br>I can promise you this much: THE RUINS is as good a description for what your nerves will be like by the climax, as it is the title of a very good horror thriller.","user":"cchase","rank":[83,104]},{"title":"Got Under My Skin","rating":8,"date":"19 April 2008","review":"I wasn't expecting too much going to see this, but knowing that it was an adaptation from a novel I figured it had to be a decent story at least. I was pleasantly surprised. It definitely wasn't your average 'horror' film, if you want recycled bullshit go see the travesty that is Prom Night. This is different. It literally got under my skin at a few parts and made me squirm, and that pretty tough to do to me. The story resembled a Stephen King-esquire short story. It was grim, unpleasant, and gory. It didn't use conventional scare tactics (which are so overdone these days) but used a tone of dread and hopelessness to get to the viewer. Check it out if your looking for that type of film, cheers","user":"flyroundee","rank":[176,230]},{"title":"The Day of the Triffids with Cabin Fever","rating":7,"date":"22 June 2008","review":"Director Eli Roth should take note of and learn from this film. It is what Cabin Fever hoped to be... spooky.<br><br>Two twenty-something couples are vacationing in Mexico when they are invited to witness the excavation of some ancient ruins. Instead of fun and excitement, however, the four are held captive at top of the ruins by the locals. But it isn't long before they find they may be in even greater danger. Something cunning, hungry, and green has a taste for human flesh and the four vacationers have rung the dinner bell.<br><br>The characters seemed real. The mood was gripping. There were some good scares. I enjoyed it.","user":"Kashmirgrey","rank":[97,135]}]