[{"title":"Wonderful and beautiful animation, not so interesting story","rating":7,"date":"27 August 2008","review":"Ever since Disney's \"sequels\" department has been under new management, there has been a HUGE upgrade in quality. There have only been two animated releases so far, Cinderella III and The Little Mermaid: Ariel's Beginning. I am not sure if any more sequels are in production.<br><br>Consistent between both films is the very high quality animation. TLM:AB keeps CGI to a minimum and much effort has been made to keep the characters close to the original character models (and in many cases, character models have heavily improved over the original). This is probably as good as it will get without the original team of animators.<br><br>What saves this film is the fantastic hand-drawn animation in the age of ugly CGI and lazy flash-drawn cartoons. I would go as far as to say that the animation here is on-par or higher than the original 1989 release (the original was plagued with off-model animation). Unfortunately, the story is only so-so. The plot is very weak but effort has been made to develop all of the sisters' personalities, which I really appreciate (they are believable sister to sister relationships). I think Disney recognised that without Alan Menken, the music for TLM would not have charm or beauty. Disney did the right thing for this film by keeping songs short and to a minimum.<br><br>This film highly deserves a chance to be seen by many, unlike the rushed and horrible Little Mermaid II: Return to the Sea.","user":"djepic1","rank":[30,34]},{"title":"Very charming prequel, and rather sad...","rating":7,"date":"7 October 2009","review":"This prequel was very enjoyable and charming. I don't think it isn't as good as the classic first film or the series(a childhood favourite of mine), but I do think it is an improvement over the rather average Little Mermaid 2:Return to the Sea. Here, the animation is breathtaking, beautifully fluid and colourful, and fairly true in terms of style to the original. The music, while not as catchy as Alan Menekn's score in the original, is still surprisingly delightful. I Remember was outstanding. And the voice acting is great, Jim Cummings is a worthy replacement of Kenneth Mars as Triton, and Jodi Benson(who also voiced Thumbelina in the Don Bluth movie, Ariel isn't the only role she's done, it's just the role she's best remembered by) is just amazing as Ariel, with a fantastic singing voice that makes me want to sing with her. Remember the song in the series' episode Wish Upon a Starfish, Daring To Dance, amazing song, amazing vocals that reduced me to tears. Marina-marvellously voiced by Sally Field- is an improvement over the bland Morgana, Sebastian is hilarious, there is nice character development and Benjamin is so cute. And the beginning with Ariel's mother brought some poignancy. However, the film is too short, the plot while a wonderful idea is rather so-so in execution and takes time to get going, and Flounder's voice was more teenage than innocent-sounding, the latter suited the character more. Still it is a very charming prequel and well worth the look. 7/10 Bethany Cox","user":"TheLittleSongbird","rank":[10,11]},{"title":"That's one fine \"prequel\"","rating":10,"date":"26 August 2008","review":"I just picked this movie up today, of course wanting to hear Jodi Benson's gorgeous voice yet again. I had to wait a while before I was able to watch it, but it was worth the wait. It became an awesome movie that tells the \"tail\" of young Ariel. Personally, I love anything with mermaids and music in it. This movie did justice like the other one, \"Return to Sea\". Ariel's got six headstrong sisters, how they slept in the same room, it almost appeared as a sea-dormitory, and her father, Triton look so cute when he was younger. Even her mother, Athena, looked much like an older Ariel. Flounder himself was awesome, it was neat how both Ariel and Flounder met. This movie hadn't disappoint me at all, loved just about over %100 of fun, laughter, and music in this fine piece of brilliance. I always wondered what happened to Ariel's mother. But seeing a younger adult version of Triton was even just as unique. I also admired how Sebastian was into music heavily himself. I could watch this movie over and over again! Probably going to watch it in a few minutes, because that's how great it was! Awesome work, Disney! Ten stars is what I gave this comment for, it was brilliantly made, and it's a movie that I also recommend to anyone who's in love with the first two \"Little Mermaid\" &amp; \"Little Mermaid: Return to Sea\" movies. As said before, you won't be disappointed...","user":"FastFan","rank":[10,12]}]