[{"title":"Neeson is the vodka of James Bond's martini","rating":10,"date":"13 July 2008","review":"The most thrilling movie I've seen in a long time. Neeson is what we would fear if James Bond went to hell and came back for revenge (I doubt big budget Quantum of Solace will top this). I loved Jason Bourne; but where Bourne is confused for half the movie, Neeson is looking down a barrel of a pistol 3/4 of the time. In a three way spy battle, I would put Neeson edging out Bourne, who would be a step ahead of Bond.<br><br>Between the jaw-dropping action sequences was the subject matter of international trafficking, which was pretty miserable to watch. Although killing is wrong, death was never more satisfying to watch.","user":"danube83","rank":[1,1]},{"title":"Probably the fastest 93 minutes of my life !","rating":9,"date":"26 April 2008","review":"Wow - I had already read reviews of this movie, and with the writer being one of my favourite directors, Luc Besson, I just had to go see this movie as soon as possible...<br><br>I was not disappointed... I'm not sure if this was intentional but there were no trailers before the movie, so being thrown strait into the film unexpectedly with people whispering \"is this it then ?\" only helping build up some initial tension and excitement.<br><br>The film starts nicely, but with overtones of spy thrillers like \"Day of the Jackal\" coming to mind. Neeson seems a bit pityful at the start, but soon overturns that impression with a taste of his handywork after around ten minutes of the thriller.<br><br>Then, before you know it, it's over. 93 minutes, gone in a blur of fighting, fear, chasing and excitement at serious pace. The artwork and direction is nicely done, giving you the feeling of being the one attacking and the chair squirming feeling of being the poor gits who get annihilated in almost every way possible.<br><br>It was one of those films that I wanted to applause after the film, I actually clapped about three times, but no-one joined in... too afraid of being the only two people clapping I suppose...<br><br>Neeson was great, and I can't wait to see the movie many more times. I only gave it 9 out of 10, as it was too short ! The film could have been easily stretched to 2 hours in my opinion, with some more development and intimacy with the characters. But I guess this may have not made it so exciting... still, well worth the money to see this in the big screen.","user":"talanish","rank":[765,942]},{"title":"brilliantly executed film","rating":8,"date":"13 July 2008","review":"First thing to say is, this is a great and fun movie from beginning to end. If you like the Bourne titles then you will love this movie. The fighting style and the way things get done is similar to Matt Damon's character and it doesn't get old and is interesting and great to watch throughout the whole film.<br><br>The movie has a similar plot to other action thrillers, but even though you may know the outcome, it is the journey that counts in this movie. It is the way he does what he does, the way that he fights and overcomes problems that draws you into the movie and makes this movie so great to watch.<br><br>Liam Neeson is such a great cast for the main character, he delivers an outstanding performance. I love to see an actor that can portray themself in anyway, a good guy or a bad guy and in this film he fights for his daughter and he will not stop for anything. You love to watch him seek revenge and feel for him the whole time, maybe just because its Liam Neeson, can you help yourself from loving this guy? He is such a great actor and shows himself as a badass with charm. <br><br>Great, great , greatness i loved this movie so much and had great fun watching it. If you love the bourne titles you must see this movie. All i can say is its so much fun to watch it, love it and go check it out.","user":"mitrismaster","rank":[374,482]}]