[{"title":"fun for the whole family","rating":7,"date":"19 April 2008","review":"My kids and I really enjoyed this movie. The kids loved it so much, they saw it twice. The \"Double Dutch Bus\" scene was just terrific. Donny Osmond's character was so funny and I was glad my kids got a chance to see him since I was a big fan of him back in the '70's. The kids are big fans of Lucus Gabriel and Raven and I thought they gave great performances. Raven is such a talented person. I liked how her character in the movie was ambitious and determined to excel academically and still have friends and be pretty. We also enjoyed the scenes in the sorority with the stern Sorority supervisor. Nice to see all those college girls being supervised! And Grandma with her friends were big fun. The pig added a lot to the movie's fun and it was so cute. Although he did a fine job with the material, Martin Lawrence was a bit wasted in this movie. The kids didn't notice cause they don't know how incredibly funny he can be. The overall best thing about this movie was the music. The music had us dancing in our theater seats; we can't wait to get the sound track of this movie.","user":"asilber-1","rank":[20,23]},{"title":"Pretty good; It's receiving too much, harsh treatment","rating":7,"date":"20 July 2008","review":"I honestly don't see what the big fuss over College Road Trip is. It wasn't a bad movie, in my opinion. It was actually really lovable, and even though it was certainly mediocre most of the time, and I felt as if at some parts they tried too hard to please the audience with mediocre jokes, it was still very entertaining, and contained a pretty good amount of laughable, and that's laughable in the humorous way, material.<br><br>It was also nice seeing Raven Symone in this movie, because I am always used to seeing her in what she's famous for, That's So Raven, and it was enlightening to know she played a role, because I love her in that show. Also, even though Martin Lawrence isn't one of the best actors, and definitely isn't one of my favorites, he's not a terrible one, and if you ask me everyone in this movie could act well for their roles, to some extent. There were scenes where I felt as if the antics were outdated and some lines were just not pulled off to the best of the casts' abilities, but when it was over I ended up having fun with it, and that's what it was meant to be in the first place.<br><br>It was of course no masterpiece, and it could have been handled a lot more professionally than it was, but doesn't a ton of movies fall under those categories, and yet, many people enjoy them. Overall, it was a good little movie, that isn't as horrible as the rating and negative comments let on to be, so if you're any bit interested in seeing this movie, go ahead, because it wasn't bad or disappointing at all.","user":"Dragoneyed363","rank":[31,38]},{"title":"I thought it was a real treat!","rating":8,"date":"16 March 2008","review":"I know not many people enjoyed this film, but I really did! I did go to see the film, NOt the actors, so I was VERY pleased when I saw Lucas Grabeel as one of the characters (Especially since HIGH SCHOOL MUSICAL is one of my favorite films!) I really enjoyed the movie... a great idea for high school seniors! ALso... for Lucas fans... don't worry, his BEST scene is in the last minute of the film... LiterallY!<br><br>I enjoyed it and I think that it was fun<br><br>A great family film<br><br>I hope you enjoy it<br><br>I really do!","user":"RoseTaffyRed","rank":[21,25]}]