[{"title":"Patience is a virtue and this film has virtues aplenty","rating":8,"date":"29 July 2009","review":"I have a confession: I adore Kelly Macdonald's Scottish accent. It makes me go all weak in the knees, sends my heart aflutter.<br><br>She is the reason I went to see \"The Merry Gentleman.\" I like Michael Keaton, too, and thought his performance in \"Game 6\" (2005) was exceptionally good. I wasn't too sure how good a director he would be, but after watching \"The Merry Gentleman,\" I can safely say that Keaton is a very good filmmaker.<br><br>The story of \"The Merry Gentleman\" could very well point to all the trappings of a formula: An abused woman inadvertently sees a hit man and then he befriends her with obvious intent.<br><br>Given filmmakers' penchant these days to turn this sort of subject matter into yet another Tarantino or Guy Ritchie clone, the calmness with which \"The Merry Gentleman\" unfolds comes as a wonderful surprise.<br><br>I realize that film-goers who want to see every hit man movie turned into another fast-talking Tarantino imitation might be sorely disappointed or even bored by \"The Merry Gentleman.\" This film takes its time. It's in no hurry to get where it's going and it doesn't pander to its audience with needless bloodshed, non sequitur riffs or slam-bang car chases. This film might be about a hit man and the witness, but it is not an action film. This really is a splendid character study, paced deliberately so that we would get to know, understand, appreciate and grow to love these people.<br><br>This film relies on its two main characters, Frank (Keaton) and Kate (Macdonald), to carry the film. And these two fine actors do not disappoint. Their scenes together are strikingly powerful, even when they say little. And there are many such moments in this film. Even their meet-cute, which could very well have turned into a typically corny moment, is handled with grace, charm and just enough humor to make you smile.<br><br>This is a drama about human connections, more than anything else. An unconventional love story as Frank and Kate, a depressed professional killer and the mousy abused woman, slowly work their way through each other lives, through the uncomfortable moments, trying to steal moments they can share.<br><br>Keaton could very easily have played Frank for a chuckle or two, given him a frenetic edge, as he often has in films. Instead, he plays him low-key. Perhaps too low-key, some could argue, but that is what I loved about his character. He really is more than a man struggling with the morality of what he does; he's a man struggling with life and all its vagaries. What he does for a living seems almost inconsequential to his struggles. Keaton finds the fine edges to his character and realizes there's more to reveal in what Frank doesn't say than in what he does. There's nothing false about Frank's weariness or sadness. This is truly a finely-tuned and subtle performance by Keaton - one of his very best.<br><br>Macdonald is completely charming as Kate. Her glorious accent aside, she brings a delightful sweetness to her role. This is a real woman with genuine problems and we understand Frank's desire - and even need - to take care of her. She has suffered much and it all seems so unfair that such a creature would be in such pain. Macdonald is marvelous. She has always been a remarkably astute actress capable of immediately drawing the audience to her. Just watch her in \"The Girl in the Cafe\" (2005) and you will promptly fall in love with her. She also gave the severely under-praised performance in \"No Country For Old Men\" (2007). This is yet another wonderful performance from a terribly under-appreciated actress. Macdonald never disappoints.<br><br>There are two fine supporting performances - from Bobby Cannavale as Kate's husband, and Tom Bastounes, as a cop investigating Frank's killings and also harboring a crush on Kate. Cannavale's outburst seems a bit noisy for a film this solemn, but he makes it work. And Bastounes, as a not-too-tidy cop, is just priceless. His dinner scenes with Kate contain terrific bits of acting.<br><br>At a time when \"Transformers: Revenge of the Fallen,\" \"Terminator Salvation,\" \"Public Enemies\" and other Hollywood films gain all the attention, it is too bad that a film such as \"The Merry Gentleman\" seemingly just gets lost in the shuffle.<br><br>This is a gem of a film. It is not for anyone seeking an adrenaline rush. But is for those seeking a tender, sweet, deeply moving, at times startling film about deeply damaged people and their attempts to find some sort of solace, happiness and meaning in this life. \"The Merry Gentleman\" is a richly rewarding experience for those who appreciate good movies.","user":"anhedonia","rank":[35,41]},{"title":"The most poetic crime drama you'll ever see in your miserable life","rating":8,"date":"31 December 2010","review":"The main character doesn't say a word for the first half hour. But in that half hour, if we're paying attention, we get more insight into the depths of a man's soul than if we had just read his 500-page autobiography.<br><br>The Merry Gentleman is billed as a crime drama, but that label hardly does it justice. The same way \"The Spy Who Came In From the Cold\" broke the spy genre, the same way \"2001: A Space Odyssey\" broke the scifi genre, the same way \"Pink Floyd -The Wall\" ain't no average musical, this film is anything but your average crime drama. For starters, there's not a single car chase, gunfight, blimp explosion or any of the standard crime drama clichés. Instead, the tension &amp; suspense is masterfully built around secrets. We begin with a secret which only the main character and the audience know. Then there is a secret which the 2nd character only knows (which the audience must slowly piece together). And finally, we have the main character's ultimate secret which is so cryptically presented that it may take you a few days of introspection before you figure it out.<br><br>This film is very much like a challenging poem whose meaning is elusive at first glance but whose mood &amp; style sinks into your mind over time. Dialogue is sparse, but every line packs a whollop. In particular, pay attention to the analogy of ghosts &amp; angels which crops up several times both verbally &amp; visually. One of the characters says something like \"Ghosts and angels are the same, except ghosts are haunted while angels are blessed.\" OK, it may not mean much at first, but by the end of the film the significance is absolutely beautiful.<br><br>Which brings me to the cinematography: absolutely beautiful. I'm no film school student, but I know what images affect me, and these scenes certainly did. Contrast (gleaming white snowflakes at night), perspective (long corridors at the morgue), symmetry (a lonely theatre marquee) and surrealism (a Christmas tree burning in a wheat field) are just some of the artistic touches you have in store. I can honestly say that I cannot think of a finer directoral debut than Michael Keaton in The Merry Gentleman.<br><br>I won't even get into the first rate acting, the haunting musical score, or Katie's adorable accent. This movie is just about perfect. The only reason why I'm giving it only 8 stars instead of 10 is that I'm a real hardass.<br><br>By the way, DO NOT WATCH THE TRAILER. DO NOT READ THE DVD DESCRIPTION. AVOID ALL DISCUSSION OF PLOT. This movie is best enjoyed if you know absolutely nothing about the story. The challenge (and the fun) will be even greater.","user":"rooprect","rank":[16,19]},{"title":"The Merry Gentleman","rating":14,"date":"14 July 2009","review":"The Merry Gentleman is one of the most patient and subtle American films I've seen in some time. It involves two characters who will meet, who both have secrets, and who are both alone. We know their secrets. We know their predicaments. This film is not about plot, suspense, mystery, but about two people and their relationship.<br><br>Frank Logan is a hit man. No film that I can instantly recall has told such a subtle and human story about man of that occupation and it has been covered extensively. We have our hit man comedies, we have our hit man dramas, we have our hit man action, we have our hit man at a crossroads stories, we have our idiot hit men, we have our desperate hit man stories. The list is so substantial that making a film about a hired hand is almost one of the least original stories that could exist. Merry Gentleman seems to have contradicted that claim though, but it does so by not making it the centerpiece of the film. We see Frank Logan kill. We know Frank Logan kills others during the film. However, he could just as easily not be a hit man. In this film his being a hired killer is only a device to meet the character Kate. That we don't look at him as a hired killer, don't think of him like that, is the genius of him happening to be one.<br><br>Kate Frazier starts the film leaving her husband. She was beaten. Again, this is a familiar situation in films. We have our full gamut of battered wives films. Kate's story, like Frank's, is not about being a battered wife. Again, it's just a reason for her to leave, to find a new job, a job that when leaving she'll see Frank, standing on the ledge of the building across the street. She yells and startles him to stop him from jumping. He falls backwards. Of course, Frank was on that roof to shoot a man that worked in the same building as Kate. Frank and Kate actually meet when he helps her bring her Christmas tree into her apartment building – a scene that may have been a little forced. Again, Frank is there attending to business and again he encounters Kate. From this point on a friendship is formed.<br><br>That the film keeps their relationship a friendship is admirable. They both just need a friend. Their lives are complicated enough, although that doesn't stop most films from adding a romantic line when it makes no sense. Kate, naturally doesn't know that Frank was the one on that building, what he was doing there, and why he was really showing up at her apartment. And Frank knows nothing of Kate's reasons for her sudden relocation. Why are so they good for each other if they don't really know each other? The film leaves that open to interpretation. Where does the film go? Well, that can't be explained but it comes to a head when Kate's husband shows up.<br><br>What is so enjoyable about the film is having way more knowledge than the two characters. We know the secrets of both sides and Keaton lets the film play out so patiently that the film is enthralling. It has its humor, it has a bit of twists, but the film is all about the nuanced friendship that grows between two people and where that inevitably has to lead. We know where this film has to go – the characters have to figure out what we know. Don't they? And when they do what will happen? These are the questions that Keaton allows a very moody atmosphere to hide in the back of our heads while he tells and portrays half of the Frank and Kate friendship.<br><br>It's always interesting when a long-time actor directs their first picture. For Michael Keaton, who went from decent 80s comedies, to being Tim Burton's go-to guy for a stretch, to a string of mid-90s romantic dramas and comedies, and spending the last ten years appearing sporadically primarily in kids movies, it was hard to know what to expect. It's safe to say that Keaton was never in a film reminiscent of The Merry Gentleman. For an actor that does have a good amount of range but has always been a little spastic and energetic, his performance was impressively understated and well played. His acting mimics the patience and mood of his filming, everything is allowed to happen in its own time.<br><br>The film makes a point of showing Kate as looking like an angel when Frank looks down at her from the rooftop. Frank regards her as a gift when he finds her trapped under her own Christmas tree. Kate makes a comment halfway through the film that their isn't much difference between a ghost and an angel, one guides you and one haunts you but they both need something. It isn't clear if Frank and Kate are angels and ghosts to each other, but certainly they came into each other lives as we expect angels and ghosts do. We fear they'll have to leave each other just as a ghost and angel would as well. In the film, we'll question whether these characters are real at all, and what does it means if they're not. The ending of this film is as bittersweet as a story about ghost and angels would be. This is a film of sacrifice and of two people being gifts for one another and also of having to be ghosts and angels for each other too.<br><br>B+ (67.5) @ A Reel Perspective","user":"iwishicouldthink-1","rank":[14,17]}]