[{"title":"Under-rated, unappreciated","rating":8,"date":"3 December 2014","review":"The trick with these sorts of reviews is perspective.<br><br>Even today (2014) the rebooted BSG series is considered one of the best produced and written series of all time, addictive, as much a game changer for TV as Buffy or Breaking Bad.<br><br>Once you understand that, the question you need to ask yourself is, what purpose do these feature length \"fillers\" serve? Many of the other reviewers here were expecting greatness, something new, something important, and, having failed to find it, got a little peckish.<br><br>I believe that these features are simply a chance for the producers to unwind, to show off, to experiment. Almost like having a fast car that you can't drive fast because you're in the city. Take her out on the hiway and see what she can do...<br><br>In that context, this is a solid little entertainer. Great use of flashbacks (compared for example to the over-use in series like ARROW).<br><br>Great acting. I believe BSG showed us many actors who were capable of greatness if given a chance, yet, post-BSG, we never really saw much of them again.<br><br>The scenes between Michelle Forbes and Stephanie Jacobsen are electric. Both deliver far more on-screen wattage than their resumes would suggest. And Jacobsen's exotic looks (she was born in China) once again showcases the ability of the casting director to pick the right actor for the correct role.","user":"A_Different_Drummer","rank":[21,25]},{"title":"What a disappointment","rating":4,"date":"25 November 2007","review":"I watched the televised version and felt like there was a lot missing, like focus and a storyline. This show was predictable right to the lame ending. I had hopes of seeing the war from the point of view of the Pegasus crew instead they spent the whole time focused on the character of Kendra Shaw and her role with Lee Adama as her commander and only small flashbacks to her serving under Admiral Cain and even then gave very little of her story. They hint that she used her mother as clout to get her first position but we never found out whom her mother was.<br><br>Most of the story lines we see in this version are very similar to what we have already seen on Galactica. The shooting of the civilians for example was done in season 1 of Galactica when the troupes shot several people on one of the ships while trying to transfer supplies. The storys sub plot of the old style Cylon's looked like it was almost an after thought with little to do with anything other then to point the audience suspicion to Staruck and her newly discovered path to earth. <br><br>There was very little new in this special and most of it was seen in seasons 2 and 3, I may rent the DVD version to see if the story has any more depth but as of seeing the Sci-Fi channel version I need to give this a thumbs down.<br><br>Here is an update, I just saw the extended version. Not any better","user":"robnels2000","rank":[115,161]},{"title":"Choppy, Contrived, Disappointing","rating":3,"date":"24 November 2007","review":"As someone who's been completely immersed in the new BSG, it comes as a great disappointment to say that RAZOR was almost a total letdown. Watching this show spiral into self-indulgence (Ron, enough with the messiah and \"chosen one\" crap already. We had to put up with it on DS9 and it's now being rammed down our throats on BSG) in its third season has been a real bummer. In the first two seasons, BSG was one of THE MOST RELEVANT shows on television in any genre. It forced us to look at ourselves in a time of national crisis and made us ask difficult questions, namely - How far are we willing to go to protect our way of life? Unfortunately, the wacky obsession of one of the show's creators and pressure from the network to crank out stand-alone episodes in season 3 has BSG circling the drain. <br><br>**SPOILERS** <br><br>All in all, RAZOR is a major disappointment. The plot is both completely contrived and lacks any kind of focus, with a structure that is more than a little fragmented. The plotting is scattershot, with non-revelatory flashbacks to the Pegasus just after the initial Cylon attack intercut with poorly written and realized scenes on the \"present day\" Galactica and Pegasus. <br><br>We're introduced to Kendra, a recently arrived lieutenant on the Pegasus who becomes something of a protégé to Admiral Cane. The flashbacks show Kendra's \"trial by fire\" in the moments after the attack. Scenes that take place in the \"present day\" (their choice of words) contain painfully clunky expository dialogue to fill in the blanks. It's a clumsy device that even a novice screenwriter will recognize as more than a little obvious. <br><br>Razor follows Kendra as she watches Cane commit atrocities in the name of keeping the fight going. Then, Kendra slowly begins to fall under Cane's spell and is soon participating in these barbaric acts. <br><br>In the \"present day\", we see Kendra brood over her actions. Did she do the right thing? Was Cane a strong commander or a madwoman? A little bit of IV drug use helps her forget. <br><br>The film felt like it was put together from leftovers of previously shot scenes and sequences that ended up on the cutting room floor. Kendra is NEVER in a scene with Bill Adama or the President. Mostly, she's shot in close-ups or two-shots with Lee Adama, making one think that short, cheap filler scenes were shot in order to tie together fragments of pre-existing scenes/sequences. Was somebody tasked with finding a way to use old scenes? <br><br>The script is something of a failure and is loaded with the kinds of contrivances overused by rookie writers. We've got the malfunctioning bomb timer, the clichéd, metaphor-rich speech  \"We all have to be razors!\" and the appearance of yet another 6 to expose Cane's \"special relationship\" as sheer manipulation. The inclusion of the clunky 80s \"tin man\" Cylons was simply lame. <br><br>The story ends with more tired \"chosen one\" BS from a cylon-human hybrid who somehow possesses omniscient knowledge of mankind's fate and Kara's special destiny. <br><br>The only revelation in all of this is the actress who played Kendra. Stephanie Chaves- Jacobsen is simply frickin' (not fracking) hot! She's got a unique, sultry look  her striking face was the only thing that kept me watching. <br><br>It's a real shame that BSG has devolved from a carefully rendered, thought-provoking, politically relevant series into mere violent, pseudo-spiritual, sci-fi eye candy. Sure, I'll watch every single episode of the final season, but my hopes ain't high.","user":"nicksita","rank":[128,181]}]