[{"title":"worthwhile psychological thriller","rating":8,"date":"4 April 2008","review":"After seeing an advanced screening, this film honestly delivered more than expected. Not being a fan of the gruesome torture-porn films so wide-spread in recent years, nor of the writers previous film (utterly ridiculous, in my opinion), I had reservations going in. Not in regards to the abilities of the cast, but as to how the concept of the film would be handled on the screen. The first 10 minutes, while well done, gave me pause as to whether the filmmakers would get beyond showing how extreme and outrageous they could be to an actually engaging story. In the end, I found the graphic and brutal nature of some of the scenes to support the development of the story and it's well drawn characters as well as the effective exploration of the darker potentials of the human psyche. My final impressions were of the solid performances of the cast and how the film was able to accomplish making the outrageous and often twisted ways of its characters seem both natural and plausible given the context of the story. I highly recommend giving this film a shot, even if it isn't a genre you'd typically see.","user":"nunyabiz1973","rank":[117,157]},{"title":"WARNING: This movie may cause you to throw beer cans at your telly","rating":3,"date":"6 August 2008","review":"I like tasteless movies, sexy movies, twisted horror movies and I also liked Crank, which was penned by the writers of Pathology. So, I was looking forward to this one.<br><br>If you imagine the Lost Boys, crossed with CSI, Saw, throw in some Cronebourg type sex and that should give you some idea of the concept behind Pathology. Sound good doesn't it? Now imagine a team of brilliant young doctors who are also serial thrill-killers who go into a psycho-sexual frenzy when performing post mortems on their colleagues victims. Not terribly plausible you may think.<br><br>Now can you imagine an even more brilliant young doctor joining the hospital, he's arrogant, he's the top guy from Harvard, he's loaded, and within minutes he's a serial thrill-killer who goes into a psycho-sexual frenzy when performing post mortems on his colleagues victims. Having trouble? Incredibly, it's even more ridiculous than it sounds. But completely unbelievable is not completely unforgivable.<br><br>My real moan is that no one is likable, and there is clearly no attempt to make anyone remotely sympathetic. So the reasoning behind purpose this can only be for the gore and the kinky sex. This would make it an exploitation movie, which I normally love.<br><br>So what's the problem? Well, it's the \"level of unlike-ability\". Everyone is so detestable, that it goes beyond the type of movie where you're waiting patiently for characters to be get naked or be bumped off. Here they take you deep into the realm of the really bloody irritating. Everything about them makes you hate them so much that their faces become more and more punchable as the minutes crawl by. Their witless babbling and pseudo-philosophy grates on you so much that their frenzied pervy couplings just make you glad they've shut up for a minute.<br><br>Borders on unwatchable.","user":"johnnycandle","rank":[53,70]},{"title":"Gory, enjoyable nonsense!","rating":8,"date":"11 April 2008","review":"When brilliant Doctor Ted Grey gets a job working in a University Pathology lab, he falls in with a group of young brilliant doctors led by Doctor Jake Gallo. Grey discovers that the others are playing a game where one doctor kills a person and the others have to work out how it was done. As Grey gets caught up in this, can he find a way out, or is he in too deep....<br><br>Pathology is written by Mark Neveldine &amp; Brian Taylor. They wrote the insane and fun action movie CRANK. This movie while not as funny as Crank is still insane! The plot is quite daft, and it has to be said full of plot-holes. This could be the result of scenes being cut from the movie, but this didn't bother me at all.<br><br>Simply put, this movie was fun.<br><br>The cast led by Milo Ventimiglia as Grey and Michael Weston as Gallo are all good. The direction by Marc Schoelermann keeps things moving at a brisk pace. As befits a movie about Pathology doctors, it is quite gory and bloody, but it is never over the top.<br><br>Although not a movie that will win many awards, for it's running time, it is very enjoyable and worth watching if you don't take it seriously. One thing though... it may put you off doctors for life!!","user":"kevin_crighton","rank":[80,114]}]