[{"title":"Absolutely faithful to the original","rating":10,"date":"2 February 2008","review":"The original comic New Frontier was a lavish, loving tribute to both the heroes of DC comics and the spirit of 1950s America, and this movie captured both almost as well. Many of the comments here that are critical of this film apparently are not at all familiar with comics of that era, and don't realize what this story tries to evoke. Some of the incongruities (Batman and Superman's costumes, the white Green Lantern) are NOT errors or sloppiness. These were depictions of the characters as they were nearly a half century ago. Remember, there were visions and versions of these heroes that existed prior to the Cartoon Network, and this is their story. <br><br>I love the Justice League cartoon, and this movies stands shoulder to shoulder with the best of that show.","user":"rrlane","rank":[57,71]},{"title":"A Step Outside The Regular Series (contains spoilers)","rating":9,"date":"30 January 2008","review":"I can remember 40 years ago reading DC comics that would \"step outside\" the regular series to explore \"what if\" plot ideas: what if humans advanced in 100 years to be almost as powerful as Superman, or what if the Legion of Superheroes were caught in a planetary concentration camp, or what if Superman lost his powers and became a superhero similar to Batman using Kryptonian technology (and similar plots).<br><br>This movie is based on a graphic novel using a \"what if\" type of idea: it's the same characters as in the Justice League comic book series (and other series characters), but with variations as necessary to develop the plot.<br><br>As long as you don't expect the usual and familiar, this movie takes the characters in interesting new directions with more adult themes.<br><br>By the way, since this is more adult you may not want very young children to view this (or at least watch it without them first before you decide to let them see it). The beginning of the movie in particular may not be suitable.","user":"brianedwardgreen","rank":[21,27]},{"title":"they did a good job with this one!!","rating":8,"date":"25 January 2008","review":"I'm always checking out these animated superhero movies, and most of the time they're very disappointing. For example all of the ultimate avenger movies, superman: doomsday etc.<br><br>But this one did not disappoint,they did a great job with it, and it's one of the best animated movies I've seen in a longgggg time. <br><br>As a fan of the justice league series, I had big expectations for this movie, and it may not have been as good as the series but it was still very enjoyable to watch.<br><br>I advise any superhero fans to watch this. I hope they continue to make more animated movies like this one.","user":"zs_rambo","rank":[48,70]}]