[{"title":"Not nearly as good as the original.","rating":21,"date":"21 August 2010","review":"The Experiment is a 2010 American thriller film directed by Paul Scheuring and starring Adrien Brody, Forest Whitaker,Cam Gigandet and Maggie Grace.The film is also a remake of the 2001 German film Das Experiment, which was directed by Oliver Hirschbiegel. The experiment begins when 26 men are chosen to participate in the roles of guards and prisoners in a psychological study that ultimately spirals out of control. $14,000 for two weeks, it is easy-earned money. The study examines aggressive behavior in an artificial prison setting. At first the tenants are divided randomly into prisoners and guards, but soon a spiral of violence begins. <br><br>I had some hope for this film because I remember seeing the original Das Experiment more then a year ago and enjoying it. Although brutal the film was brilliant in the way it explored human nature, human instincts, and one's moral compass. It's actually quite surprising that it took such a long time (9 years) for Hollywood to assassinate, pardon me, remake this very interesting story which is actually based on the Stanford prison experiment that took place in 1971 and was highly criticized afterwords. The problem with this remake is that, as in most things Hollywood, it's all about big name actors and big fights and nice camera angles. What's most important, the characterization and the character development which are the things that make this story, were completely thrown aside. One of the consequences of doing so is that the film felt extremely rushed and therefor the payoff wasn't that great. I didn't think there was real tension, and the film lacked that gritty look of the original, instead it looks sharp and polished. <br><br>Also, it's one thing to put your own spin into a story but this remake eliminated an entire dimension of the original film. I'm talking about the people behind the cameras, the scientists watching and conducting the experiment. They played a big part in the original and in this remake they are nowhere to be seen and it truly diminished the story. Regarding the acting, I thought Adrien Brody did a pretty good job and Cam Gigandet was delightfully nasty as he usually is. On the other hand, Forest Whitaker was absolutely awful. In almost every film that see him in, he acts like he has a speech impediment and to be honest, it adds nothing to his performance. Overall, The Experiment it's somewhat enjoyable but not nearly as good as the original. <br><br>6/10","user":"imdbbl","rank":[148,192]},{"title":"Another crappy USA remake.","rating":3,"date":"20 October 2010","review":"It's as if the title 'The Experiment' refers to Hollywood finally trying to create a remake that surpasses the original. <br><br>It's a pale and poor remake of the brilliant German movie 'Das Experiment', which blew my mind first time I saw it. <br><br>None of that with 'The Experiment'... Even the presence of two gifted actors (Brody and Withaker) cannot rescue the poor cinematography and awful diluted script. I couldn't even properly empathise with the main character played by Brody. His actions seemed ridiculous put against the prison-experiment backdrop, so terribly written so that there isn't any true logic to his rebellion. It's also very obvious he's not doing half the acting that Moritz Bleibtreu performed in the original. <br><br>The casting was terrible, even before the experiment, I could immediately identify which characters were to become guards, and which ones prisoners. Mix this with the poor script-rewrite that put in unnecessary scenes and dialogues and that took out some of the most brilliant scenes in the original, and you get a straight-to-video production that will never be looked back on by movie fanatics anywhere, anytime.<br><br>If you have bought, borrowed or downloaded this copy, please burn or delete it. You will be much better off getting Das Experiment instead.<br><br>The Experiment has failed!","user":"dizfunx","rank":[151,209]},{"title":"How to Destroy a German Masterpiece","rating":1,"date":"21 October 2010","review":"The German \"Das Experiment\" is one of the best and most powerful movies of the Twentieth-First Century. Tense, powerful, having a wonderful screenplay and outstanding direction and performances, it is another great example of how the absolute power corrupts. \"Das Experiment\" is a must-see movie, which will certainly provoke reactions on the viewer.<br><br>Hollywood, as usual, made a remake showing how to destroy the German masterpiece. The decadent Forest Whitaker is awful, and he should have paid more attention in the acting of Justus Von Dohnanyi in the original film, as the sadistic Berus, instead of using grimaces. The writer and director Paul Scheuring is ridiculous, using sexual premises and sadistic situations freely. I feel sorry for the ridiculous reviews from viewers that have not seen \"Das Experiment\" and are happy watching this silly American crap. My vote is one (awful).<br><br>Title (Brazil): \"Detenção\" (\"Detention\")","user":"claudio_carvalho","rank":[169,249]}]