[{"title":"Vexille (2007)","rating":6,"date":"28 December 2011","review":"Excellent animation and an interesting story combine in this action sci-fi success. The voice work is sometimes clunky, and the characters are all dull as dishwater. In fact, I can't really tell you about the characters, they are all fairly similar. This results in visually stunning action sequences. But it's hard to feel involved and connect with the characters emotionally. Chases, robot fights, fast and well edited cuts, this is how action scenes should be seen. As a combination of both robot/zombie film, it would have been better for some not so obvious mad scientists. Enjoy the action, and try and make it through the dialogue.","user":"SnakesOnAnAfricanPlain","rank":[7,7]},{"title":"A good action CG to stand along side Appleseed","rating":8,"date":"3 February 2008","review":"Back story: Vexille 2007, Nihon Sakoku (Vexille 2007, Japan National Isolation) is set in the middle of this century, at about the edge of the foreseeable future. There has been rapid development in the areas of human-form robots, able to assist humanity with running it's civilization. Ten years ago, technology reached a point where completely human-made robots reached the peak of their potential. The trend shifted towards the augmentation of the human body, and the merging of man and machine. However, the basis and ethical implications of such technology were condemned by international treaties and organizations, and all development was banned. Japan (the world leader in robotics) was completely opposed to the condemnation, and the potential ban it found imposed on itself. Japan withdrew from the international community and went into national isolation.<br><br>Ten years later, there have been no visitors allowed in or out of Japan. There has been no cultural contact, and no shared media from Japan since the isolation. However, despite the self-imposed isolation, Japan remains the world leader in the field of robotics. The robots manufactured by the conglomerate DAIWA can be seen all over L.A., able to assist mankind with maintaining it's civilization. Before the isolation, the robotics industry was so vital to Japan that DAIWA had grown in to a colossal mega-conglomerate, with strong ties to every part of the government.<br><br>After two incidents of terrorism by DAIWA, outside of Japanese territory, America discovers that Japan may well have cyborg technology. Fearing the worst, America sends its most highly specialized team (Sword) to secretly infiltrate Japan, and gather intelligence.<br><br>The CG: There's no doubt that the CG is an important part of the appeal of this film, and for the most part, I think it comes off very well. Fans of the last major CG film released outside Japan will feel very at home with the visual style's blend of very photo realistic elements, such as mechs, landscapes, and high-paced action scenes, with low-polly toon-shaded actors. Although landscapes, mechs and characters are all very pleasing to the eye, the one complaint I have is that the characters sometimes suffer from very stiff movement, where motion capture seems to not have been used. Sometimes this stiff movement will happen between cuts in the middle of a scene, which tended to remind me that I was watching a CG movie.<br><br>The Music: The film also follows a similar flare to Appleseed, in its choice of dance and electronic artists such as Basement Jaxx, Boom Boom Satellites, Carl Craig, etc, and other more aesthetic tracks by Paul Okenfold. The blend of music does a good job of making the movie come alive, without sounding forced.<br><br>The story: The story was the most important thing for me, and probably the hardest to criticize. I enjoyed the story very much -- the progression is smooth, and easy to follow. The characters are presented well, and developed in enough detail to satisfy the viewer. The story progression starts very quickly, and immediately moves into meat of the story, which is infiltrating Japan. The story is spread out with a lot of action scenes, no doubt, because this is a CG movie. Most of which do a job in telling the story, but truth be told, are mostly for eye-candy value.<br><br>The main criticism I have of the story comes down to the complexity and presentation. I think as a CG film, Vexille didn't have enough time to devote to its story.<br><br>With a story so central to people and events of the past, I feel Vexille falls short in its delivery of everything it set up -- including the back story. Because of time constraints -- probably both in production and running time -- most of the story's revelations and plot points happen quite close together, which means the viewer's attention is often pulled away from one revelation to a new facet of the story, which does tend to dull the experience in the more dramatic scenes, and leaves little time to savour the experience.<br><br>In all honesty, I think a more expanded Vexille story could have easily filled another film, with a little bit still taken out. Of course, this is a natural part of cinema and story-telling, but it doesn't make it any less disappointing.<br><br>Final Verdict: I think Vexille is quite a solid CG film that stands apart from Applesed, with its own qualities, and enough differences to enjoy it for what it is. Although I was slightly disappointed by story in what I, personally, wanted to see, I think that just shows it to be a fairly well-balanced film, that I would recommend to anyone with a taste for action, CG or Japanese entertainment.","user":"seiferalmasy63","rank":[32,44]},{"title":"A Nutshell Review: Vexille","rating":9,"date":"29 December 2007","review":"This year had perhaps seen a bumper crop of anime movies making it to the theatres, with the likes of The Girl Who Leapt Through Time, Paprika, Brave Story, Doraemon, and now, a science fiction mecha genre anime by the producer of Appleseed, Fumihiko Sori.<br><br>Set in the middle of the 21st century, the world has become like that in Isaac Asimov novels, with robots having the intelligence finally to assist mankind in various tasks, which doesn't discount the fact that they'll be used in warfare too, with creations resembling those seen in Clone Wars. Coming from the largest factory in the world, Japan, for their technological genius, the world soon frowns upon their quest to fuse robots and humans (much like the brouhaha on potential abuse of stem cell technology), and Japan decides to shut itself off from the rest of the world.<br><br>Naturally, US foreign policy dictates that they are curious as to what's going on behind the iron curtain, so they send their crack paramilitary unit called SWORD to infiltrate Japan. They are afraid of the potential threat the robots give to humankind, and more so are suspicious of the largest conglomerate and robot producer Daiwa Heavy Industries, who are dabbling into questionable robotic research. Led by Leon (voiced by Shosuke Tanihara), it goes without saying that titular character Vexille (Meisa Kuroki) will get to save the day (hey, it's her name on the billboard). Interestingly enough though, this movie has its weight put on the strength of its female characters, Vexille, and rebel fighter Maria (Yasuko Matsuyuki)<br><br>There are many familiar elements in Vexille both character and plot wise, but that doesn't detract from the fact that there still are a number of plus points leading to the enjoyment of this movie. The designs of the mecha used by SWORD units, which is like an exoskeleton suit designed for middleweight, individual battles, are crafted to look like they just walked out of any generic Hollywood science fiction movie, as do the enemy's guard droids which look like they were heavily influenced by Robocop's ED209.<br><br>And with the many ships and transporters, can someone say Star Wars too? But the one that takes the cake, is the post-apocalyptic look at Japan, making it seem like the planet of Arakis from Frank Herbert's Dune, complete with their version of the Fremen with their tinkering prowess, and those monstrous, lethal sandworms too, which take on a mechanical facade over here, known as Jags. Even the inevitable finale seemed to have taken a leaf from Herbert's literary masterpiece.<br><br>As with any mecha-related stories, there's always a tussle between what it means to be a human and android (erm, Blade Runner?), and the hopes and dreams to preserve their way of life against a megalomaniac industrialist, who shares six degrees of separation with everyone involved. But we're not really here for rehashed cyberpunk stories involving the first 2 installments of the Animatrix, are we? <br><br>We're here for the action pieces, and boy, they don't disappoint. From the get go we're treated to a full scale assault and brought to see what SWORD can do, and it played out to John Woo-ish distinction with plenty of violence set to slow motion, with numerous guns blazing that would even make the master proud. Credit goes to designing the well crafted action sequences so they are vastly different from one another, and the best has got to be the massive chase/race sequence in the latter half of the movie. And a bonus here is the music, contributed no doubt by the genius of Paul Oakenfold. This one delivered perfectly, adding a huge dash of zing to complement the action, though I thought I heard a few bars off his Ready Steady Go!<br><br>The animation is in no doubt stunning with its photo-realism, and for a 2D movie, I thought it even beat Beowulf in the graphics, and intensity of the storyline. Vexille comes across as a recommended movie to catch before the dawn of the new year. Go see!","user":"DICK STEEL","rank":[37,56]}]