[{"title":"A beautiful and nightmarish masterpiece","rating":10,"date":"19 September 2010","review":"There are not enough words in the English language to describe the praise Darren Aronofsky deserves for Black Swan. It was one of the most talked about and sought after films at this year's Toronto International Film Festival (which I managed to snag a ticket for), and for good reason – it is a masterpiece that is just as much beautiful as it is nightmarish.<br><br>Nina Sayers (Natalie Portman) has toiled for years within a New York ballet company, always pushing herself. The company has fallen under hard times, and director Thomas Leroy (Vincent Cassel) makes the swift decision to put on a new rendition of the classic Swan Lake. With the company's go-to lead pushed into retirement, Nina is quickly selected to be the lead in the new ballet. With competition arriving in the form of new dancer Lily (Mila Kunis), and the demanding desire for perfection from both Thomas and her overbearing mother Erica (Barbara Hershey), Nina begins a journey into dark uncharted territory.<br><br>Black Swan is an enthralling and visceral experience from beginning to end. Aronofsky has used what he has learned from making the raw and unflinching The Wrestler and the cerebral horror and incredibly disturbing Requiem for a Dream, and has crafted a film that you will simply not be able to take your eyes off of. He builds up rather slow, but right after that first moment of off-the-rails insanity, he delivers one hell of an incredible piece of cinema. One that is not easily able to be classified to any one genre.<br><br>While you may have read suggestions that Black Swan and The Wrestler are two halves of the same film, make no mistake at looking at it any further beyond the comparison of being about two people toiling within two very different forms of art. Black Swan is never a low budget character piece. It is a film that navigates between being thrilling and horrific at the same time. While the horror elements start to take more prominence in the second half (specifically the rather squeamish elements of body horror, done in a way that would make David Cronenberg proud), the film never lets one completely overtake the other. It manages to maintain this sense of dread, darkness and rather graphic wound/injury infliction throughout.<br><br>The visuals and editing are the drive of what helps make the film so well done. Contrasting blacks and whites so frequently give the obvious hints of good and evil, innocence and darkness. But Aronofsky likes to throw in hints of ambiguity at every turn, changing the colours for each character depending on the scene, and depending on what they may or may not be doing. Even the scenery and set design is in plain black and whites, always making the audience guess the true motivations and intentions of both character and creator. Adding in the element of reflection, both in others and the self (mostly through mirrors), only helps compound these feelings of ambiguity and confusion. It will consistently keep audiences thinking about what is being shown and what is actually going on. The subtle visual effects and astoundingly well done score only help add to the greatness.<br><br>Aronofsky also deserves recognition for the film's lean running time. When so many films are often far too long and dragged out, this film maintains a sense of momentum that never gets lost at any point. The film's slow points are never dragged out, merely well padded out for the shift from Nina being innocent to adrenaline soaked horror as she descends into the realm of darkness. Rather gracefully, Aronofsky manages to balance the goal of Mark Heyman, Andres Heinz and John McLaughlin's script to blend Nina's tale with the story of Swan Lake itself, and never loses sight or direction at any instance. This is bravado style filmmaking at its finest, and more than suggests that the brilliant direction in Requiem for a Dream was not a fluke.<br><br>Portman, who has shown her acting merits before in the likes of Closer, delivers a startlingly intense and beautiful performance as Nina. At once you can see the innocent, sexually repressed little girl who just wants to please her mother, and the sexually depraved fallen angel, inching closer towards independence and adulthood. She is very clearly not \"well\" in the beginning of the film, and as the film progresses, you can practically chart her 180-degree reversal in character. She is downright terrifying in many instances, and more than proves her worth as an actress. When she finally dons makeup late in the film, her transformation from a once promising talent to a full blown powerhouse talent becomes simply marvelous to watch.<br><br>The supporting cast only helps to further complement Portman's extraordinary performance. Cassel is amazing as always as the slimy and twisted Thomas. We never really get more than hints at his true intentions, but Cassel makes every moment on-screen simply amazing. Kunis delivers a level of depth I never thought was possible for her. She commands the screen with every new scene, and this performance will easily act as a starmaking role for her. Hershey is even better; practically stealing the screen away from Portman's magnetizing performance. She makes Erica into that monster of a character everyone loves to hate, and brings a level of intensity to every mere moment she appears in. If anyone is even nearly close to equaling Portman's performance, it would be her. Despite only appearing for a few minutes, Winona Ryder is amazing in her role as the former lead ballerina Beth. I just wish she could have chewed up more scenery.<br><br>Black Swan is an incredible film from beginning to end, and will not easily leave you. It is a masterpiece of unheralded success, and is easily the best film I saw at TIFF. Watch out for it at Oscar time – it just may steal the show.<br><br>10/10.","user":"DonFishies","rank":[914,1]},{"title":"A Swan Dive into Darkness","rating":9,"date":"18 October 2010","review":"Darren Aronofsky's \"Black Swan\" makes ballet cool—and if that isn't a Herculean feat in itself, I don't know what is. It also happens to be one of the best films of the year, featuring one of the best performances of the year. Natalie Portman will be nominated for her devastating portrayal of petite perfectionist Nina the ballerina or I'll pull a Werner Herzog and eat my shoe.<br><br>\"Black Swan\" is cut from the same cloth as Aronofsky's 2008 film \"The Wrestler,\" if at the opposite end. Interestingly, before either project was realized, the director was reportedly mulling a drama about the relationship between a professional wrestler and a ballerina. Somewhere along the way, however, that concept was split down the middle—and thank God. \"Black Swan\" is brilliant, but it wouldn't necessarily play well with others.<br><br>Like its predecessor, the film examines a physically demanding and widely unappreciated art, and though thematically similar, the two complement each other via mutually exclusive cinematic vernaculars. \"The Wrestler\" is ultimately a safer film. Its emotional experience is directly conveyed via plot and dialogue. What Aronofsky attempts with \"Black Swan\" is riskier: he plays genre Frankenstein, taking established themes and transplanting them into that which feels initially least appropriate—horror.<br><br>Yet despite certain unmistakable cues, I'd hesitate to call \"Black Swan\" a horror film. Visually, maybe, but John Carpenter insists \"The Thing\" is a Western, and likewise there is more to \"Black Swan\" than is aesthetically obvious. It probably best fits the psychological thriller mold, but as Aronofsky suggests through his manipulation of mirrors, it is not a film that ever casts a clear reflection. For me, that dichotomy is what makes it so fascinating and rewarding.<br><br>\"Black Swan\" strikes an immediate haunting note that seems to grow louder with reverberation rather than quieter. In the first half, the director lays track work; in the second, he runs right off it. Nina begins her journey receiving the coveted role of the Swan Queen in a modernist production of Tchaikovsky's \"Swan Lake.\" Her practiced technique makes her ideal for the role of the goodly White Swan, but her lascivious director (Vincent Cassel) has reservations about her ability to portray her evil twin, the titular Black Swan—a character that embodies impulse and lust. Nina's process of unlearning takes her to increasingly dark, surreal depths.<br><br>The final act of the film comprises the most riveting 40 minutes I've seen on screen all year, though \"Black Swan\" is never the mindf**k some have improperly labeled it. Aronofsky deliberately builds atmosphere and anticipation toward a Kubrickian climax that is at once obvious and stunning. Tchaikovsky's score falls like an aerial assault, and that inherent theatricality collides with Aronofsky's narrative as they come to a dual boil.<br><br>Perhaps best of all, however, is that for all the audacity on display, the director knows when to dial it back as well. The casting of Mila Kunis (\"Forgetting Sarah Marshall,\" \"That 70's Show\") was idyllic. She plays a comic relief of sorts, with a comely, down-to-earth veneer but viperous eyes. Her performance is fantastically calculated—she provides derisive, but much needed perspective on Nina's deteriorating sense of reality.<br><br>\"Black Swan\" is a wholly effective work born from the shadowy underside of the mind, anchored by a career-defining turn by Portman. It is a quick, impulsive piece, but it explains artistic devotion and the consuming nature of obsession as well or better than any film I've ever seen. In hindsight, it feels more characteristic of the filmmaker responsible for \"Pi\" and \"Requiem for a Dream\" than \"The Wrestler,\" though the parallels between it and \"Black Swan\" run deep.<br><br>They may be cut from the same cloth, but the difference between the two is as stark as black and white. Hail Aronofsky, the Swan King.","user":"colinrgeorge","rank":[548,770]},{"title":"\"Perfect\"","rating":10,"date":"5 December 2010","review":"I had the opportunity to see Black Swan in one of the 18 theaters that it opened up on this weekend, although I generally do not do so, I was compelled to write a review of the film.<br><br>From top to bottom, this film is at the height of what it means to be true art in cinema. The various elements of the film, the mise-en-scene, was so incredibly structured by filmmaker Darren Aronofsky that one need only sit back and admire at the fluidity of his camera movement, or the marvelous hue of colors amidst a film which has it's color scheme largely dedicated to the symbolism of black and white.<br><br>The performances where spot on, Vincent Cassel was terrific as the suspicious teacher, whose brilliance and lust for the dancers in his show are both quite reputable, one often beating out the other. And Mila Kunis truly shines in this one, bringing out a side of her many probably didn't know was possible. She is absolutely beautiful and aptly portrays the black contradiction to Natalie Portmans white, a terrific contrast of good and evil. Kunis, however, as many may assume, is not meant to be there to spark a general conflict of good vs evil, but to emphasize the side of Portman that we have not yet seen. A side that will drive her to the brink of insanity to obtain.<br><br>And therein lies the true theme of the film, obsession and physical strain over all else. Much like \"The Wrestler\" we have the main character dedicated to an unappreciated form of physical art. Here, it is Portman's obsession with becoming the lead of the ballet Swan Lake which drives her into madness. You enter her mind as her teacher pushes her to become perfect, pushing her to let go of her fragile White Swan and become the loose and destructive Black Swan. As you follow her through the stages of her audition leading towards a booming finale she becomes less and less aware of what around her is distortion and what is reality. As she loses grip, Aronofsky's ability to depict psychological deterioration shines through.<br><br>And make no mistake, this film belongs to Aronofsky and Portman. As stated, Aronofsky captures everything beautifully in frame, his movement of the camera is almost as fluent and beautiful as the very dancers on the screen. His use of behind the head vantage shots has been a bit of a trademark of his, allowing as to see what the character is. And his use of lighting is nothing short of extraordinary. But now comes the true star: Natalie Portman. She blew me away, from start to finish, she displayed her transformation for the sweet girl to the physically and psychologically obsessed, all the way through attempting to embody the white and black swan when necessary, literally trying to become them in her mind, driving her towards insanity in the pursuit of perfection. Words cannot describe Portman's performance here, to say it is Oscar worthy would be a vast understatement, as the depth of her character goes so deep it would nearly be worthy of playing two separate roles. So fragile at time that you fear for her life, and so corrupted at others that you hate her. Acting at it's finest, Portman deserves an Oscar.<br><br>All things considered the film is nearly perfect, one of the best dramas I've ever seen, and one that is as iconic and intense as it is horrifying at times. Just to mention a few other things, Winona Ryder, in the small amount of screen time she had, was spectacular, and truly terrifying during particular scenes. And as always, when Aronofsky and Clint Mansell team up, the score is both epic and eerie, somehow simultaneously. The overcasting score of a distorted and intense version of Swan Lake itself brilliantly compliments the atmosphere throughout the film as these two artist have done before. It could nearly work as a silent film, that's how brilliant it is. If you get the opportunity once this film undoubtedly expands to other theaters see it, it's harrowing and at times difficult to watch, but that combination of beauty and horror makes it impossible to turn away.","user":"dpoll390","rank":[644,942]}]