[{"title":"An Important Little Film","rating":8,"date":"30 June 2011","review":"LIKE DANDELION DUST is a very small scaled film about a very large subject: adoption and the struggles that at times are associated between birth parents and adoptive parents. Adapted from Karen Kingsbury's popular novel by Stephen J Rivele and Michael Lachance and directed with sensitivity and fine pacing by Jon Gunn, the film succeeds primarily because of the exceptional acting on the part of the acting by Mira Sorvino and Barry Pepper. <br><br>Blue collar worker Richard 'Rip' Porter (Barry Pepper) is an alcoholic with anger management problems and as the film opens he is arrested for beating his wife Wendy (Mira Sorvino) and imprisoned for seven years. Simultaneously we meet the wealthy Jack Campbell (Cole Hauser) and his wife Molly (Kate Levering) who are playing with their six year old son Joey (Maxwell Perry Cotton) and interacting with Molly's sister Beth (Abby Brammell) and husband Bill (Kirk B.R. Woller) who are suggesting that Joey, being adopted, should be brought up in the church: there is conflict as Beth seems to feel Molly isn't caring correctly for Joey since he is adopted! <br><br>Rip is released form prison and is clean from his alcoholism and anger management problems and Wendy confesses that when Rip was incarcerated she had been pregnant and because of Rip's problems she put her newborn son up for adoption, having her mother sign for Rip. Rip is shocked with the news and at once wants to get his son back. An adoption agency is consulted in the person of Allyson Bower (L. Scott Caldwell) who is placed between the Porters and the Campbells in making the decision as to where Joey should be. Because of the forged adoption papers Joey is still the child of the Porters and they fight the Campbells for custody. Joey is in the middle and with Allyson's guidance tries to adapt to his birth parents on planned visits while the Campbells try every avenue to retain their beloved Joey. How the game is played includes errors on the parts of both sets of parents but the situation is finally resolved in a very touching manner. <br><br>Sorvino and Pepper are brilliant in their roles as the beleaguered Porters. The reason the film works as well as it does is the fact that the good and bad aspects of human behavior on the part of all the characters in the film is balanced. It is a realistic look at what appears on the surface to be polar opposite couples - and in the middle is the very finely tuned performance of little Maxwell Perry Cotton. This is a film that tugs a bit heavily on the heartstrings, but for anyone who has been involved in an adoption problem it will ring true. <br><br>Grady Harp","user":"gradyharp","rank":[17,19]},{"title":"See it if you can find it!","rating":9,"date":"9 October 2010","review":"One of the best movies with one of the most bizarre releases I've ever seen. In the Dallas area it is currently playing in one mall theater for only two shows a day, one in the morning and one in the early afternoon.<br><br>I can't comprehend how such a good movie gets so little theater distribution. <br><br>The six main characters are as multi-dimensional as fictional movie characters get. They act like real people would in real situations.<br><br>While there are a few times when the camera lingers too long for emotional effect, everything about this production is top rate. <br><br>If it is being shunned due to its Christian origins, that is a shame. The few references to Christianity are really only there to advance the plot.<br><br>I was a little surprised to realize at the end that I had just watched a great movie without any profanity or skin. It is still not a film for children because of its theme and some domestic violence.<br><br>If anybody knows, please post why this film is not enjoying wider distribution. This is a Blind Side caliber movie without near the preachiness.","user":"trey-866-847510","rank":[46,59]},{"title":"Gritty but very moving drama","rating":9,"date":"16 September 2012","review":"A relatively low budget but extremely good drama. This could have turned into a standard melodrama but is elevated far beyond this by an intelligent and believable script. <br><br>The real stars though are the actors who are all terrific. Barry Pepper has always been a favourite of mine and he excels himself in this role but there are no weak links in this film. A special mention must go to the actor playing the little boy, Maxwell Perry Cotton who is utterly convincing as the frightened and confused little boy. It was one of the best performances from a young actor I have ever seen. <br><br>The film does flag a little towards the end but finishes on an emotional high. I rarely watch films twice in a short period of time but I did with this one and enjoyed it just as much second time round. Recommended.","user":"MattyGibbs","rank":[10,11]}]