[{"title":"Visually stunning, perfectly done & thoroughly entertaining","rating":9,"date":"24 June 2013","review":"I never saw the original Tintin cartoons and before this film new nothing about it.<br><br>I watched this film this evening, two years after its release .. and i'm left thinking, why did I not watch this film before now?! <br><br>This was such an enjoyable film, it was much, much better than i thought it was going to be, there are so many great things about this movie:<br><br>THE VISUALS: Easily one of the most visually stunning films I have ever seen, i wish i had watched this at the cinema - especially in 3d. The animation is perfect. it's bright, colourful and scarily lifelike. The characters, scenery and landscapes all look incredible and so creative. Even the opening credits look fantastic! I can't stress how good the visuals are in this film.<br><br>THE DIRECTION: Spielberg has done an incredible job here, nothing could have been improved in this aspect. The way the movie flows and the way the scenes intertwine and change is beautiful. There are scenes where it switches from past to present and back again in such a way that you just get lost in it.. you will understand what i mean when you see the movie. There are scenes of fights and chases which are so creative and so imaginative, the way he uses angles and the way everything links on is a real joy to watch. Its hard to explain, watch the film and you will know exactly what I mean.<br><br>However, the film is not just a visual feast like many films are. It has a good solid story with likable, interesting characters - I found the story line kept my attention throughout. A very original adventure/quest film, searching for hidden treasure and defeating the bad guys along the way!<br><br>I cannot recommend this film enough, i was so surprised by just how good it was. As i said earlier I am sorry I didn't go and see this in the cinema as it really would have been a fantastic experience. <br><br>Watch it!","user":"MUFCOK","rank":[33,34]},{"title":"An intrepid report on The Adventures of Tintin","rating":13,"date":"13 October 2011","review":"First off, this is the first time I ever write a review in here. For once, I felt compelled to do it because... Well... because I'm Belgian and grew up on a steady Tintin diet, like most Belgians my age and older. The comics... not the cartoons. Needless to say I'm a old fan.<br><br>I also happen to be a fan of Spielberg's, probably since seeing E.T. when I was about 5 years old. The two could be mutually exclusive. I could take the role of the harcore comics fan who despises the adaptation, or the rabid Spielby fan forgiving everything. <br><br>Thankfully, after having the chance to see it before most people out here in Belgium and everywhere else thanks to a journalist buddy, I found out I can to be none of the above. Spielberg and Jackson and all the team behind the adaptation obviously gave the original material the love and respect it deserved, while making it their own.<br><br>To clarify the origins of the story itself, you have to know that it isn't the adaptation of one, but three Tintin comics. Its beginning takes root in \"Le Crabe aux Pinces D'or\", while the rest of the movie revolves around the two-albums story of the hunt for Rakham the Red's treasure, \"Le Secret de la Licorne\" and \"Le Trésor de Rakham le Rouge\". While it could seem like a lot of material for a whole movie, the choice of blending those three (two and a half) stories together turns out giving the movie a rather perfect pacing. <br><br>To kill a double controversy in the making, and like I've already read in a couple critics: Tintin has always been a \"bland\" character in the comics. He has no asperities. He is brave, always gets out of the tangles he gets in, he is a good guy, he doesn't know doubts... Tintin as a character has his limits, dramatically speaking, and even Hergé knew that... It is actually the reason for the appearance of Captain Haddock after a few albums. Haddock is the dark side of Tintin, prone to anger and shouting insults, hard drinker, natural born loser... Far from a being just a comical sidekick, Haddock is the human counterpart to the flawless hero that Tintin is (remember, this is a comic, originally aimed at kids and older kids). The movie has the intelligence of starting off the big screen adventures of Tintin with the two meeting up and becoming friends, a real turning point in the continued adventures of Tintin. <br><br>The movie also deftly skips what could have been a typically Hollywoodish mistake of giving Tintin exposition. But none of that nonsense here. Tintin is a reporter, that's all you need to know. That's all the comics ever told us about him. None of them ever showed Tintin doing actual reporter work. I don't think he ever used a typewriter, he has no boss, no workplace. Tintin just finds himself where adventure is. Because he's a reporter. Hergé never needed more, kudos for the guys behind this movie for keeping true to that. It will be held against them, but that will be coming from people who don't know the original material. <br><br>But I somehow had little worries about that, honestly. It was only obvious they wouldn't touch the spirit of what's considered a classic worldwide. Well, not those guys. I had more doubts about the transition from Hergé's \"Ligne Claire\" type of drawing to CGI's and even more so to the use of 3D. And that's where I was truly impressed. Not that I'm adverse to CGIs, mind. In fact it's the cartoons that bred those doubts in me. The varied 2D, celluloid adventures of Tintin always bugged me, because of that transition from the seemingly simple but incredibly dynamic looks of the books, looking so wrong when brought to animated life. Yet the movie did a great job of shutting up the Tintin geek. It simply looks stunning, and your mind easily jumps back and forth between forgetting these are cartoon characters and appreciating their transition to a 3D environment, respectful of the original designs but literally bringing them to life. <br><br>In short, all these elements drew me to the same conclusion, Spielby and co. managed to deal a great adaptation. One that has true respect for the original material, and the great ambition of adding something to it. Yes, not everything of it. \"Le Crabe aux Pinces D'or\" could have deserved a whole movie. Shortcuts are taken, and as true to their originals as they are, the characters have been redesigned. But in the end you have a movie that can be appreciated both by fans of the comics as well as people who have \"just heard about them\". It is fun, packed with adventure and action, enjoyable at all ages. And most of all, you can go see it without having to worry about seeing another piece of Hollywood-flavoured perversion, a fast-foodified betrayal. If that's what you like, note, there's been that Smurf thing, recently (another childhood favourite). You know, that other Belgian comics adaptation that took the little blue dudes from their tiny corner of European medieval forest to... Modern New York? But if you have more gourmet tastes, better bet your money on Jackson and Spielberg. Trust this true childhood Tintin fan.","user":"creepysammich","rank":[477,550]},{"title":"TINTIN","rating":10,"date":"11 February 2020","review":"Somany great things have been written down for this Movie, that are only few left for me. It is adventures, it is funny and a great journey with Tin Tin and his clever dog Struppi! ....and the captain with his rum. It was just somuch FUN to watch this Movie.","user":"MR_Heraclius","rank":[39,43]}]