[{"title":"What, no lesbian scenes?","rating":1,"date":"10 August 2008","review":"After somehow managing to sit through \"Zombie Strippers\" (thanks in no small part to the abundance of untethered breasts and jiggly backsides), I attempted to sit through \"Ninja Cheerleaders\" today, but just couldn't make it. Yes, I was surprised too. I mean, it had all the basic ingredients of a great film - the three lead girls were even community college cheerleaders by day and strippers and ninjas by night, but alas it was still totally unwatchable. Hmmm, perhaps if they had also been lesbian I might have at least made it to the middle of the movie, but I guess that sort of post-production armchair directing is like wishing more things had blown up in \"Lost in Translation\" and that there had been some hardcore sex in \"Breakfast at Tiffany's\". I suppose no movie is ever perfect (as those last two examples clearly indicate).<br><br>Anyway, I hope my inability to sit through \"NC\" isn't a sign that I'm now exiting my \"prepubescent fascination with anything female and jiggly regardless of how badly written, directed or acted\" movie stage. It'd really be a shame since that stage has basically been my defining characteristic up till this point and I'm not sure I'd recognize myself without it. Maybe I should watch \"Zombie Strippers\" again just to check? ;)","user":"dylan_spears_2000","rank":[35,47]},{"title":"Stupid but funny","rating":5,"date":"9 August 2008","review":"Seriously this is one of the worst movies ever and yet it is entertaining in a way I can hardly describe. First: The Title. A movie titled \"Ninja Cheerleaders\" is just a \"gotto see this movie\" to me. Anyway - the story is incredibly stupid (cheerleader strippers fight to get back the strip club of their ninja master against Michael pare - and to top it, they have to win a strip contest to get money for college....ha ha ha ha). This is a great setting for a really funny but stupid film, but the camera work, the directing work, the music, the actors - everything is just so bad. It is so badly made, it is sometimes hard to watch. But the girls are cute, they are brutal, they beat up everything they can - and then their is Captain Sulu as the master and Michael Pare. I want to like this film - if it was better edited and directed, it be a classic trash one - like this, it is just a film for men, who wanna see babes beat up guys.","user":"ronnymiller-1","rank":[21,27]},{"title":"It's bad. Seriously.","rating":1,"date":"9 August 2008","review":"I thought I should comment on this film, since it's really not as cute as it was probably meant to be. The film revolves around three girls who are determined to get into Brown College. To pay their tuition they strip at a local bar. The owner of the bar is a ninja master who lands into some heavy trouble and of course the ninja cheerleaders get involved.<br><br>The first thing that's off is just the title: Ninja Cheerleaders. It kind of sums it up. I got fooled by the ninja part. Almost everything in the film is tacky. Plot, writing, directing, lighting, fighting etc. A few of the older actors do deliver nicely, but they can't salvage this shipwreck of a film. The biggest disappointment is actually the poor quality of the fights, since I'm a huge fan of martial arts. <br><br>I'm thinking that the target audience for this film is young girls who need a strong role-model of a determined successful woman who doesn't need a man. Oh my god, did I really just write that? Another target group is probably teenage boys, who would be better off watching American pie, at least it has boobies in it.<br><br>P.S. I might ask the film makers what's up with the topless women between scene changes? Of very poor taste and utterly irrelevant...","user":"tirkkanen","rank":[27,39]}]