[{"title":"Turn Off Your Brain","rating":6,"date":"10 June 2008","review":"I walked into the theater with my brain shut off. And if you enjoy Adam Sandler, you have to. If you go by typical standards, all of Adam Sandler's movies are absolute garbage. But yet people still love them, I am one of them. <br><br>I went into this looking to have fun watching a movie, and I did. Yes, it was ridiculous in every possible way, but it was pretty much exactly what I was paying to see, Adam Sandler's sense of humor running rampant with all of his friends holding down bit parts. <br><br>If you are looking for a high quality, well thought-out story with twists and turns and an ending that ties it all together and leaves you walking out of the theater satisfied, look elsewhere.<br><br>But if you aren't easily offended and are a fan of Adam Sandler's work, then you'll have fun with the silky smooth goodness that Zohan brings to the table.","user":"newfnshow616","rank":[226,312]},{"title":"Comedy Gold!!!!","rating":10,"date":"7 June 2015","review":"This movie makes me laugh every single time I watch it. I am very much into the \"Slapstick\" type of comedy and this movie fits it like a glove. I Have always loved Adam Sandler movies because you always know you will be entertained. I can honestly say that there wasn't a point where I was watching this movie when I didn't laugh. If you love comedy WATCH THIS MOVIE you will not be disappointed. I really don't get why this movie has such a low rating. if you are looking for movies with deeper meanings and mind-blowing plots then by all means find a different movie.<br><br>BUT....<br><br>If you want to sit back, relax and laugh until you physically cant anymore then you've found your movie. Enjoy ;)","user":"tomlin-96710","rank":[53,72]},{"title":"Not as bad as everyone says.","rating":7,"date":"8 June 2008","review":"While I've never been a -huge- fan of Adam Sandler's films, I have watched them and laughed throughout most of them. I'm the type of guy who enjoys some slapstick, some raunchy humor, and a lot of zanyness.<br><br>I went into Zohan not expecting anything but pure frivolous humor. You don't go into films like this with any expectations, and I think that's where a lot of the reviewers prior to myself went wrong. They went in expecting to see an evolution of Sandler's humor, and while I would say that Zohan raised the bar a tad, it's still Adam Sandler. Yes, it's going to have a corny ending, a lot of physical humor, and a healthy dose of humor aimed at the more intelligent in the crowd as well.<br><br>Overall, I couldn't stop giggling, laughing, and chuckling throughout most of the film. After a long streak of not seeing any humor films, I thought it was the perfect thing to bring me back to comedies. The last few years, especially, have been incredibly lackluster in regards to comedies (if that's what evolution of the genre is, count me out, by the way), and I found Zohan refreshing.<br><br>I think another thing a lot of the other reviewers missed, is that the film in no way expected to take itself seriously. The only serious moments were cheesy, predictable, and ultimately corny, which is irony in itself and only contributed to my bemused chuckling. Yes, a lot of the humor bordered on racial stereotyping, there were a lot of over-the-top accents and allusions to the Middle East, so if you're the type to get touchy about that, feel free to skip. I found it to be a rather hilarious joke on the seriousness that everybody applies to the stereotyping. The stereotyping is, actually, rather fair and towards the end even shows plenty of \"good stereotyping\" (as accurate as stereotyping ever is, which is to say, rarely).<br><br>Really, the film laughs at itself. Are there some bum moments? Certainly, but it seems that's been the case for almost every film I've seen in the last few years, but it was grand seeing the cast and crew not try to make this the 'next great comedy' and just have a buttload of fun.<br><br>And if the cast and crew are laughing at themselves (which you can clearly feel through the screen), you can't help but laugh with them.<br><br>If you want to spend an hour or two snickering and have an open mind, give Zohan a shot. Don't expect an evolution of comedy. Don't expect the bar to be raised, because that's not what this film was trying to do. It was trying to be ridiculous and make people utter that ever so fantastic groaning-giggle followed by the heart chuckle.<br><br>Don't let the other critics fool you, they've probably forgotten the meaning of the word 'satire'.","user":"Egamstk","rank":[317,484]}]