[{"title":"Slick, thrilling, art-house action film.","rating":9,"date":"27 February 2012","review":"Having read some of the more negative reviews on this site, all I can say is that they all seem to have the same complaint in common. Namely, non-acceptance of certain plot contrivances. <br><br>So let me say straight off: if you are the sort of person who didn't like Inception because it made no sense, or the sort of person who didn't like The Matrix Trilogy because it made no sense, or indeed the sort of person who didn't like any of David Lynch's films because (ahem) NONE OF THEM MAKE ANY SENSE...in short, if you are an incurable pedant, you will not enjoy this film and you might as well stop reading this review. Seriously, stop reading, don't watch the film and go calculate Pi or something.<br><br>If, however, you have an appreciation for tightly-edited, emotionally engaging, aesthetically pleasing cinema with a brilliant soundtrack and at times breathless pacing, please allow me to take a few minutes of your time.<br><br>Hanna is the story of a teenage girl who lives in total isolation with her father. She has vague memories of her mother, and these memories, combined with her (literally) encyclopedic knowledge fuel her desire to leave the relative safety of her father's protection in the frozen hinterland of northern Finland.<br><br>In a way, I don't want to say any more than that. If you've read the other reviews on this site that give away more, then I'm very sorry for you, but if not then suffice it to say that her father's motivation for keeping her in this state of isolation appears to be protection, combined with a desire to train her in survival/assassination skills, in preparation for...well that would be telling. <br><br>Of course, you don't need me to tell you that she leaves her father's protection and the story proper begins. As Chekov said \"One must not put a loaded rifle on the stage if no-one is thinking of using it\" and boy, does that rifle get used. <br><br>Saoirse Ronan is brilliant as Hanna. At times seemingly invincible, at others pathetically vulnerable, owing to her complete inexperience of the world. We see the world from her unique perspective as she struggles to understand non-familiar interaction, the natural ease of recreation and even the basic electrical appliances that we all take for granted.<br><br>The story moves us from one location to the next, painting a rich tapestry of colour and culture, whilst simultaneously (and somewhat comically) contrasting Hanna's desperate need to traverse these territories with the bourgeoisie's seeming obsession with \"experiencing\" as many of them as possible.<br><br>The acting is solid throughout. The only truly great performance comes from Ronan, but Tom Hollander, Cate Blanchett and Eric Bana all turn out good performances that serve the picture well.<br><br>However the true credit for this film has to be laid at the feet of Joe Wright. None of his previous films could possibly prepare you for Hanna. Wright's mastery of both a tight, intricate plot such as in Atonement, combined with his incredible skill in making this beautiful, thoughtful, action-packed coming of age story mark him out as a director of real class.<br><br>It is true that Hanna suffers from a few plot holes, but that plot is delivered in such an appealing, exciting and above-all entertaining film that anyone who isn't compiling continuity errors for some god-awful TV programme that relishes in the fact that THIS ISN'T REAL LIFE, IT'S ACTUALLY ONLY A FILM!! should have a blast letting this film take them along for the ride. <br><br>If you want reality, watch a documentary. If you want a very good fiction, watch Hanna.","user":"gzuhgut","rank":[200,275]},{"title":"Beautiful. Don't let the negative reviews repel.","rating":8,"date":"30 November 2011","review":"I really wanted to watch this film but I didn't have the time when it was in theatres. So I recently treated myself to the Blu Ray copy. I decided to check the user reviews before watching it and was very surprised by the amount of negative feedback. The reviews were almost hate posts! So, I put the disc in with mixed expectations and afterwards, I sat, glued to the credits thinking \"what was their problem?!\" Truly a beautiful film. Don't set out expecting an action packed bad-ass picture (I think that was the problem with most of the negative reviewers). Though not as frequent as your everyday action film, the action scenes are just as exciting as ever. If you liked the fighting techniques in Taken, imagine a teenage girl pulling off moves just as hardcore, if not more. The visuals and sounds of the film are nothing short of artistic. I give it an 8 out of ten. Not the best film of 2011, but definitely not the worst.","user":"Joseph-Stevenson","rank":[109,148]},{"title":"Starts off as a good film, but ends up as a handful of good ideas, poorly strung together.","rating":12,"date":"12 May 2011","review":"Once upon a time, there was a little girl called Hanna (Saoirse Ronan), who was raised in a forest by her father Erik (Eric Bana). As an ex-CIA agent, Erik taught Hanna everything she needed: hunting, armed and unarmed combat, and all the languages in the world. One day, Hanna was sent out of the forest to assassinate Marissa Wiegler (Cate Blanchett), the woman who murdered her mother.<br><br>Joe Wright's latest feature is modern-day fairy-tale that is part revenge-flick, part coming- of-age drama. Like his last effort, 'The Soloist', 'Hanna' has some very good ideas that are let down by bad decisions and occasionally over-powering direction. <br><br>The film certainly has a very strong beginning. The concept of a killer child may be screwed- up, but this is offset by the curiosity it arouses. Why has Erik raised Hanna in this manner? Who is this woman they want to kill, and why did she become their enemy?<br><br>The storytelling is tight, intentionally drip-fed, which keeps the focus on the moment and makes the assassination plan more dramatic. Well, for the first 45 minutes. After that, Hanna sees the wider world for the first time and becomes distracted – which is both good and bad.<br><br>On one hand, it allows some insight into the effects of Hanna's blinkered upbringing. Having grown up killing her own breakfast and making her own fire, she is not prepared for her journey through the modern world. Seeing her flick light switches on and off in awe is one of several touching moments, which add a human side to what could have become another soulless gun movie.<br><br>However, Wright doesn't know when to pull back on the sentimentality. The film hits its low point when Hanna hitches a ride with a stuck-up English hippy family, which is meant to contrast the lonely, limited nature of Hanna's upbringing. Ironically, this family is even more dysfunctional than Hanna and Erik, and only succeeds in making Hanna's journey more irrelevant.<br><br>Her meticulous plan somehow becomes self-indulgent faux-art, featuring slow-motion Flamenco dancing. The film goes so off-course that it is questionable whether there was a plan in the first place. Is the story intentionally drip-fed, or is there just not very much to tell? For a child raised specifically to kill, Hanna doesn't end up doing very much.<br><br>That's not to say that there isn't any action. There are a handful of set pieces, and they are a delight to behold. From a fight in a subway to a chase through a labyrinthine cargo yard, the action is wonderfully shot and expertly edited. Long, tracking shots allow for a high level of clarity and immersion. Even this, however, is sometimes ruined with over-energetic camera-work, turning the film into a music video.<br><br>Saoirse Ronan is a good action star, throwing herself into her fight scenes with zeal, but her real strength is her acting. On one hand she seems so genuinely lethal that it's a little scary. At the same time, she has a delicate, innocent aura that makes it hard not to feel sorry for her. This is a layered performance that transcends the generic labelling of 'good' or 'evil'.<br><br>'Hanna' is not flawed, but sabotaged. Ronan is superb, and the action is fantastic, but even this is not enough to put the film back on course after Joe Wright steered it in the wrong direction. It started off as a good film, but ended up as a handful of good ideas, poorly strung together.","user":"ced_yuen","rank":[119,166]}]