[{"title":"A tense study in repressed emotion","rating":7,"date":"16 December 2018","review":"This Shakespearian-like social realism-tragedy is very well made. It would be strange to call it an entertaining film but it is engaging and superbly acted. Alex Pettyfer shows great depth as an actor here; and Juliette Lewis is exceptional as well. Her presence on screen leaves one with a lingering feeling of unease and sympathy. Thematically this piece of work is tough and hard to swallow at times (issues if child abuse, repressed anger and sexual urges, as well as poverty) but it is always watchable. Recommended.","user":"palovyper","rank":[20,24]},{"title":"Can't Turn Away","rating":9,"date":"11 March 2019","review":"Back Roads is like watching a train wreck in slow motion. It's the car accident on the side of the freeway at which you can't help but stare. Bad family situations and dysfunction grow progressively worse as more and more buried facts and emotions are revealed. So sad, it is on the scale of a Greek tragedy, except our hero is not to at all blame, making this a true drama/melodrama. Direction and acting are superb. This is not your typical action/horror/superhero bubble gum fare. This is for intelligent and sensitive adults with patience and appreciation for human suffering. One could argue it is heavy handed, with all the layers upon layers of misfortune and dysfunction, yet that clearly is the intent of the story. Our hero is so admirable and relatable, charged with the responsibility of raising, protecting, and otherwise caring for his three younger sisters, but in many ways, he is still a child himself, and a scarred one at that. Living in this impossibly chaotic and crazy situation on a day to day basis makes a predictable, restrained life in an asylum or penitentiary seem to be a step up. Now I want to read the novel.","user":"herrbrugger","rank":[16,21]},{"title":"One of the best movies I've seen this year","rating":9,"date":"12 March 2019","review":"Great movie. Not sure why people are suggesting its not. Heart wrenching, difficult to watch at times. Clearly didn't have the pressures of a big studio dictating the plot.<br><br>Give it a go and you won't be disappointed.","user":"liamscheath","rank":[16,22]}]