[{"title":"The Labyrinth Gangster Capitalism","rating":10,"date":"21 October 2008","review":"Gomorra (2008) **** <br><br>Much of Gomorra takes place in and around a crumbling housing project, that in establishing shots looks as if it were a rotting labyrinth pyramid. The very structure of the film's slums serves itself as a visual metaphor for the Camorra crime institution in Naples. It's a bureaucratic shuffle, rivaling a large capitalist corporation, equally ruthless but in different senses of the term. Their products are drugs, extortion, and toxic sludge. Their version of corporate take-over involves murderously shameless acts of extreme violence.<br><br>Matteo Garrone deftly directs Gomorra, based on the novel of the same name by Roberto Saviano. It contains a labyrinth plot serving to depict a labyrinth lifestyle. One storyline focuses on a young boy, Toto, who lives in that decaying pyramid, and wants to join up with the gangsters who run it. By the end of the film, his youth will be shattered, and he'll have done things to those around him that would have seemed unthinkable before. He's the ground soldier in the gangster empire.<br><br>Don Ciro is an aging money runner, delivering rations to the families of mob prisoners. He gets increasingly caught between the war between factions within the complexes, and before long takes to wearing a bullet proof vest in fear of his own safety.<br><br>Roberto is a college graduate, given a high profile job working with Franco, who runs a scheme disposing of garbage and waste from the city by burying it in the countryside - a move that has sent the cancer rate in the countryside through the roof. Roberto must face his own conscious as he becomes more and more aware of the corruption of work.<br><br>Pasquale is a talented designer, who's put to work by his friend and boss completing a contract for dresses in less time than he and the workers should like. At great personal risk to himself, he takes an offer from a Chinese factory boss to gives lessons to his workers. The job means crossing the Comorra, so he is hidden in the trunk on the drive to the factory, with a modified hole behind the backseat so he can stick his head out to breath and chat.<br><br>The other storyline follows two Scarface-wannabes who long to be the crime bosses of all bosses. They cross the local boss by stealing drugs from dealers, causing trouble, then by stealing weapons from a mob cache, raising Cain. They are knuckle-heads, a couple of kids too stupid to see the truth behind the phony glorification of the gangster lifestyle.<br><br>That phony glorification is entirely absent here. Garrone observes his gangsters with an eye of contempt. There is no Robin Hood imagery in Gomorra. It puts on full display the ruthlessness of the gangster culture. It's a gangster as capitalist world, one where turning to killing kids or a woman is looked down upon, but not off-limits.<br><br>The film starts off with a fantastic sequence of tanning machines and surprisingly graphic murder, which would lead one to think that they were moving headlong into a Scorsese-like blood bath of macabre. You'd be wrong though. Gomorra is a very patient film, slowly unraveling its stories. It's clearly influenced by the early Italian Neo-Realists, and also has elements that reminded me of the gangster pictures of Jean-Pierre Melville. Garrone shoots in a documentary style with hand-held camera shots. It jumps between its story lines with utmost patience, which might slow down the film's pace more than many would like or are accustomed to. If you do not realize the scope of the Camorra's activity in nearly all facets of commercial and communal life in and around Naples, the connection between the stories may seem unclear. But that's one of the main services of the picture, to show us just how entrenched the mafia has remained in parts of Italy.<br><br>Although mob movies are a dime a dozen, Gamorra enters as a gangster epic with freshness. It's a very European film, and as far as gangster pictures go, with its no nonsense documentary style, and only slowly escalating violence and patience it feels like a unique addition to the genre. Gomorra is sure to split, maybe even downright annoy audiences looking for something more conventional. It defies at least most of the genre's clichés, and aims high with its quiet ambitions.<br><br>Gomorra won the Grand Prix at this year's Cannes Film Festival, and has been slotted as Italy's official entry into the 2009 Academy Awards for Best Foreign Film.","user":"MacAindrais","rank":[138,186]},{"title":"Italian Gangster","rating":10,"date":"21 October 2008","review":"In 2003, Giancarlo De Cataldo, a judge-turned-novelist, wrote Romanzo Criminale (Crime Novel in English), a largely truthful recollection (only the names were changed) of the Magliana gang, a Roman crime organization he had sentenced to prison. Three years later, Neapolitan journalist Roberto Saviano wrote Gomorra, a first-hand, non-fiction analysis of how organized crime controls everything in his native region. The book was the result of months of direct contact with the people who keep the System (the gangsters themselves refuse to use the word Camorra, which can be considered the local version of the Sicilian Mafia) and became a huge success, the downside of which was Saviano receiving multiple death threats from the people he'd exposed and being forced to live with a permanent police escort. The reason I'm mentioning both books is they were both made into successful films (Gomorra even walked away with the Grand Prize of the Jury at the 2008 Cannes Film Festival), with one crucial difference: Romanzo Criminale is very good, but does at times, as implied by the title, feel like a novel, a fictional story. Gomorra, on the other hand, using the same raw, in-your-face style as City of God, throws the viewer into a new, scary world - the real deal.<br><br>Director Matteo Garrone, who co-wrote the screenplay with a bunch of collaborators (including Saviano himself), wisely decides to ditch the book's first-person storytelling, the only (possible) reference to the author being a young man named Roberto who helps businessman Franco (Toni Servillo) close a series of suspicious deals with various companies in the North of Italy (Venice is explicitly shown). Franco's line of work, which will sound amusing to anyone who's watched The Sopranos, is waste management, though not of the legal kind. His story is one of five that constitute the film's narrative: along with him, there's also Don Ciro (Gianfelice Imparato), who pays the family members of imprisoned crooks; Pasquale (Salvatore Cantalupo), a tailor whose life is at risk because of his contacts with the Chinese (Italians don't like competition) and whose work ends up being worn by celebrities like Scarlett Johansson (Angelina Jolie in the book); and then there are two different examples of young blood, one a loyal boy who runs errands for his drug-dealing neighbors, the other two young punks who have watched Scarface way too often (a reference to the fact that a real-life Camorra boss had his villa designed exactly like Tony Montana's) and think they can take over.<br><br>An ensemble gangster flick, then. Not quite: this is no Altman movie, which means the separate plot strands never once cross paths. This is because Gomorra doesn't set out to be a real, straightforward story, but rather offer a series of bleak, extremely real examples of how the Camorra (or the System, though neither word is ever spoken in the film) controls everything. Aside from the documentary-style cinematography and anxious cutting, the highest degree of realism comes from the cast: the only really famous actor in the film is Servillo, familiar from Paolo Sorrentino's filmography; the rest have a theatrical background or, in the case of the kids especially, were taken directly from the street (the movie was shot on location, and rumor has it the mother of a Camorra boss asked for a cameo). This shows most clearly in the way they speak: with few exceptions (Franco most notably), the characters' Neapolitan dialect is so strong the film had to be subtitled in most parts of Italy. Garrone and Saviano's message is clear: this isn't your usual genre flick, it's something else - something palpable, something real, something terrifying.<br><br>Gomorra's top achievement is that it doesn't play to the stereotype of Italy being nothing but the home of gangsters. On the contrary, it pinpoints a sad fact, its intent being to denounce and make aware, never to glorify. Sure, it opens with a shootout that could remind of Goodfellas (still one of the best first-hand crime tales) or The Sopranos, but even those masterpieces are too smooth and polished next to the gritty, unsettling universe that emerges from this film. It's dirty, brutal, scary. And it simply has to be seen.","user":"MaxBorg89","rank":[85,118]},{"title":"With everything into consideration, film is too well choreographed that it becomes as intimidating as the organization that it exposes.","rating":7,"date":"24 July 2008","review":"Garners more respect than a spot on favorites list, \"Gomorra\" chronicles five seemingly disconnected stories with one thing in common: all are heavily influenced by a criminal organization run by the Camorras, an ominous mafia organization with a tight grip on Naples, Italy. Stylishly delivered, with extra kudos on editing and cinematography, Film will no doubt attract fans of the violent underworld, but might be disappointed by its verite approach, even if it perfectly captures reality, as such. Absolute antithesis to depiction from the American mafia, film is gritty and has zero entertainment value but in retrospect, picture was produced with such depressing intentions.<br><br>Multi plot film features more on characters attracted by the allure of the Camorras than the Camorras themselves. The five stories were plucked out from a novel by Roberto Saviano: the non-fiction that thrived on the best seller's list in Italy. Stories range from a coming of age teenager wanting to be identified with the mafia to a fresh university graduate looking for a promising vocation. Through varying levels of perspectives: from the violent eyed to the diplomatic, \"Gomorra\" stuns as it lists the organization's almost totalitarian control over the underbelly of Italy. It creates the impression of a country rotting from the inside out. With each story written by a different writer, what could have been an interconnection disaster is controlled well by director Matteo Garrone.<br><br>Ambitiously edited, fine balance between chaos and narrative is clearly defined by Marco Spoletini. First 40 minutes won't bode well for viewers looking for an easy diversion, as it is edited to confusion creating the illusion that the film started midway. Nonetheless, the stories do emerge, to great relief and from there on out, film would have established its style to a keen audience.<br><br>Cinematography, too is top notch. Marco Onorato paints Italy with a dull set of colors, resembling more of a third world purgatory rather than a honeymooner's travel brochure. Even Venice's bright reds and blues are muted with grey and brown with a hint of overexposure. Overall effect adds stupendously to the film as it gives it a sense of space and absolutely squashes any sense of hope an over-reader might derive.<br><br>Accuracy is greatly appreciated here. Film tries to blurry lines between dramatic film and documentary with impressive results. Details are all intact: dialogue is accurately more dialect derived, shooting locations seem extracted from a news clip and most thesping is done on dead-on accuracy by first timers.<br><br>With production values on stratospheric levels, film's overall intention is transparent: absolutely naught empathy is allowed, allowing audiences to soak in the moody atmosphere and simply co-exist with the protagonists clearly tested by circumstance. This will be its main predicament in garnering a more universal success as it asks a lot from an audience whose expectations might lean towards the slick of \"Cidade de Deus\".<br><br>With everything into consideration, film is too well choreographed that it becomes as intimidating as the organization that it exposes. Multiple plays won't be troublesome as every single detail here has a sense of subtext of tragedy unwilling to be diluted by repetition. However, might only be uncovered by fans willing to revisit.<br><br>Picture won the Grand Prize of the 2008 Cannes Film Festival.","user":"crey014","rank":[126,181]}]