[{"title":"Blood, guts and vocal range","rating":9,"date":"7 November 2008","review":"There are two ways in which a movie can succeed. <br><br>Oneit can have a fully realized plot that works to explain some larger subtextual moral. It can demonstrate a mastery of technical and thematic areas and create an emotional response in the viewer. This is the route that most critics look for when giving a positive review. Films like Schindler's List. On the Waterfront. A Streetcar Named Desire.<br><br>The other way in which a movie can succeed is with ideas. This type of movie doesn't have to make sense in the same way that a traditional film does. It simply has to take you somewhere you have never been, and hopefully throw your mind through a few loops along the way. Films like El Topo. The Fountain. Eraserhead. Gummo. The Exterminating Angels. <br><br>Repo! The Genetic Opera definitely falls into the latter category. <br><br>The story, told entirely through song, details the intersecting secrets of people living in a world where a mysterious virus has caused random organ failure and forced people to resort to leasing cloned organs, at a very high price. <br><br>There is so much whimsy in this film that it almost becomes an absurdist fairytale. It skips and jumps from one homage to the next, cribbing notes from Rocky Horror in one scene before moving on to Rigoletto in the next. Genres and archetypes are thrown up against one another and mashed together with reckless abandon mixing Grand Guignol with Sondheim and Disney with Faces of Death. It cuts together the pieces of our collective pop culture consciousness the same way that the antagonists cut together new forms for their bodies. <br><br>And it's wickedly funny too. <br><br>Picking up where the ultimate consumers of Romero's shopping malls left off, Repo! makes for a brutal satire of consumer culture where human flesh is a commodity bought and sold with government approval. People have designer spines and get upgrades on their bodies when they go in for maintenance on their artificial organs. Starlets don't forget to wear panties, they forget to sew on their new faces. <br><br>Darren Lynn Bousman has made a name for himself as a go-to guy for over the top, operatic gore and he doesn't shy away from it here. Repo! is often tremendously bloody with sanguine spilling left and right, often directly on top of naked flesh. He takes what he learned making Saw II--IV and pushes in into overdrive as he uses it to skewer one satirical target after the next. <br><br>Normally I am one to shy away from sexualized violence. I find it repulsive and saddening, but here, Bousman has found that perfect mix between sexy and grotesque. Though the bloodletting is vicious, it never spills over into elaborate rape fantasy. It is a shame that he is no longer attached to the Hellraiser relaunch. <br><br>The cast, made up of a bizarre collection of geek favorites, musicians and world famous opera singers is almost weirder than the movie's central conceit. Paul Sorvino is brilliant fun as the patriarch who controls the world but finds himself unable to defeat cancer. Sorvino is fascinating to watch when he is let loose and he has a singing voice to rival any star of stage. Sarah Brightman is also quite good in a small roll that is entirely divorced from her signature turn in Phantom of the Opera. The rest of the cast is a bit of a mixed bag. Alexa Vega is strong as the cloistered daughter of the eponymous organ ripper and Anthony Stewart Head outdoes his Buffy singing, even as his role is too close to that of Giles. Meanwhile Bill Mosely is obnoxious and all over the place, playing his seventh version of Chop-top while Paris Hilton is actually shockingly watchable as Amber Sweet, a heightened reality version of herself. But the real standout is Nivek Ogre of Skinny Puppy. The man steals the show as a deformed lothario who has a nasty habit of killing his lovers. <br><br>At a point, the film becomes as scattershot as the cast list with some moments hitting it out of the park while others miss wildly. By the end of the film one would be hard pressed to explain how the characters all end up in the same place, but it has long since ceased to matter because you've either accepted that the film is fairly divorced from reality, or else, you've walked out of the theater. I stayed, and loved every minute of it. <br><br>When I see a movie like this, I want to be taken to a new world. Somewhere strange and alien. The futuristic retro-chic of the Repo's alternate dimension is vibrant and dazzling, it's a whirling dervish of colors and styles. And though it never comes together, the overwhelming strangeness of it is intoxicating. The music is not for everyone, and the bloodletting is extreme, but Repo! offers something rarely seen at the multiplex--originality.<br><br>A-<br><br>If you enjoyed this review, please visit www.collider.com for more.","user":"tawdry_hepburn","rank":[137,176]},{"title":"Repo the Genetic Opera is a breath of fresh air in a stale world of Horror movie copy cats","rating":10,"date":"20 July 2008","review":"We just got from seeing the Repo premiere and now I can't wait until November to see it again. The film was phenomenal! It was beautiful to watch and extremely entertaining. Repo far surpasses the Saw films in originality, creativity, and artistic integrity. This is not simply a slasher film, although there is plenty of violence to keep gore fans happy, there is a very interesting and unique story being told here. In fact, a whole world has been created in Repo and there is plenty of room for more stories to follow. Unlike many sequels, a sequel to Repo would be completely justified in respect to its content.<br><br>The music was catchy and I walked back to the hotel with it running through my head. There is a nice variety of songs featured in Repo and, as is natural with a collection of songs, fans will have their favorites and their least favorites. I can honestly say that even my least favorite songs were still necessary in the context of the film and I didn't really mind them. I was slightly caught off guard by how pop a couple of the musical numbers were, but again they were appropriate for the part of the film they were featured in.<br><br>Another surprise was the size of roles in the film. The roles played by Ogre, Bill Moseley, and Paris Hilton were not as prominent as I had imagined them being (and yes Paris gave a good performance). They seemed to have less screen time than the rest of the stars. This is not a serious complaint of the film itself, just a desire for more (especially Ogre). Skinny Puppy fans have never seen Ogre quite like this (just wait until you hear his voice). Other personal favorites (aside from Ogre) were The Grave Robber, Anthony Head, and Sarah Brightman.<br><br>Darren, the Cast and Crew, and the Producers of Repo the Genetic Opera have created a beautiful thing here. This is a horror movie with true originality in story and in visuals. They went out on a limb to make something new, something that hasn't already been proved to work and that type of effort needs to be supported; otherwise we will continue to be given \"New\" movies that it feels like we have seen before. I know the wait has been long, but I can now tell you with certainty that it is well worth the wait.<br><br>If originality is not supported it will continue to disappear.<br><br>Please support Repo the Genetic Opera.","user":"patriggle","rank":[127,184]},{"title":"A very cool modern opera that will surely be playing at midnight screenings as a cult classic for years to come","rating":9,"date":"20 September 2008","review":"This modern, actually futuristic, opera is unlike anything I've seen. Many of its qualities remind me of 'The Rocky Horror Picture Show,' a film that was never on my list of favorites. This is better simply because it's able to hold together a more plausible and serious story yet still present itself in the aesthetic of a psychedelic musical. It blends brutality with comedy and music very effectively, in fact, there were far more laughs in our theater than anything else. The interactions between the characters as they sing their parts make for great character development and story progression simultaneously. The character's themselves are all well performed, including Paris Hilton (what happens to her needs to be seen, not described). I'm not the type to like weird, cult films but this held my attention. It's definitely worth a viewing, and if you have time to immerse yourself, then it's definitely worth some good applause.","user":"zarrod","rank":[76,117]}]