[{"title":"Amateurish and spot off on almost everything","rating":2,"date":"1 June 2013","review":"I wanted to like this film. I love Elmore Leonard novels, and loved Get Shorty, 52 Pickup, Get Straight and Jackie Brown (Rum Punch). In the hands of a master like Tarantino, Elmore Leonard's complex and fast-paced plots, with numerous characters throwing witty street banter around, really shine.<br><br>Unfortunately, Charles Mattheau isn't up to the task, and characters are miscast, pacing is awful, even the score is wrong in so many places. This film often comes off as a bad TV tongue-in-cheek crime show, complete with dramatic musical flourishes when the camera zooms in on the sexy legs of actresses Sabina Gadeki and Breanne Racano. (Their legs and other beautiful body parts are the best things about these mediocre actresses, in my opinion). The explosion scenes are evidence of a severe shortage in the sfx budget as well as the actor budget.<br><br>Even the usually outstanding Crispin Glover as the spacey drunken rich guy Woody Ricks is tepid, either overacting scenes or underacting them. Everything seems out of sync in this film.<br><br>Perhaps I'm holding it up to too high of a standard with the aforementioned Leonard film adaptations. But it is what it is...and cool 70's sets and apparel (the novel was set in the 60s), witty Leonard dialog and clever plot apparently weren't enough for director Mattheau to pull this off. I have to believe Elmore Leonard is supremely disappointed in this effort, since as I recall he labeled this his favorite novel. One can only hope that someday a director like Tarantino remakes this film the right way, and captures the crazy 60's vibe from the novel.","user":"giallopudding","rank":[22,27]},{"title":"Holy Crap This is Bad","rating":3,"date":"31 August 2013","review":"I once again must ask who I must speak to to get my latest wild imaginings put on film as this is a sure sign that they will make just about any piece of garbage into a film. Elmore Leonard (RIP) has some great works out there and some of the film adaptations of his work have been fine films. Unfortunately Freaky Deaky by Charles Matthau is not to be listed among that group. Christian Slater is a fine actor and brings something great to each role he plays as well as does Crispin Glover, who is the poster boy for edgy character. The biggest mistake the producers made in this film was casting Beanne Racano in a role. She brings new meaning to the term \"wooden delivery\". Wow, what a stick she is. This women should never be allowed near a script again.If she didn't look like she does and had to audition for the role based on talent, well...... I could not finish watching this film.","user":"bmerrett","rank":[19,28]},{"title":"My kind of movie, but then you're not me.","rating":10,"date":"10 May 2015","review":"I really liked this movie, but I would be hesitant to recommend it without some qualifiers. <br><br>First, you are much more likely to enjoy this movie if you grew up in the 1970s, since the cars and fashions are a blast from the past. Being a car guy, I especially loved the cars, and there were a lot of really nice and interesting ones in this film. While others don't seem to feel that it captured the '70s well, I strongly disagree--guess it depends what you were exposed to then. <br><br>Second, I've never read whatever book this is supposed to be based on (or any other works by the author for that matter), but as far as this film goes, it is understated and will seem a bit slow to some; however, it never drags and has a number of laugh out loud bits, and, just generally, a lot of wit in the script. I am personally tired of \"Wham, Bam, Thank You Mam!\" film-making, so if a film takes time to build as this one does, it's fine by me. <br><br>This movie would never play well in a movie theater, but it was perfect for me kicking back late at night.","user":"carbuff","rank":[8,11]}]