[{"title":"It's not totally useless, but misses something","rating":5,"date":"30 November 2019","review":"Although engaging in a way, it misses something. It feels like a half-hearted christmas story, that is totally predictable and all and sure it's about family values and such. But it left me wondering, what am I missing...? Hence the half-hearted rating.","user":"Wordsmith","rank":[10,11]},{"title":"Unfortunately unlikable","rating":4,"date":"1 December 2019","review":"With the exception of Sonequa Martin-Green, there is not a single likeable character. She must have been exhausted carrying the whole damn movie!<br><br>It's not a *bad* film, but it feels about 3 hours long and the hideously unpleasant child characters kind of make you hope they have a crummy christmas.<br><br>Worst of all, sadly, is the dad... sheesh... wooden as a door!","user":"mouldypeach","rank":[9,12]},{"title":"Awful awful awful unwatchable tripe","rating":1,"date":"1 December 2019","review":"Problem with this kinda storyline is you have to care about the characters, bar the dead wife bit they are all just awful, jokes about 6 year old twins demanding stuff at knifepoint, an egotistical son who you could never root for, a mother in law as charismatically challenged as a shoe and a self centred selfish daughter, what a family. Then the dad who felt like an unfunny arrogant version of mike from my wife and kids was the worst, ignorant, arrogant and just plain irritating. Roxy was good but not enough to save this.<br><br>I struggled to the end but felt nothing, no warmth no nothing, a week after the masterpiece of klaus and let it snow which was fantastic it's back to cheap, stereotypical rubbish from Netflix.<br><br>I feel as well in 2019 they don't help by portraying black people in such a way. The attitudes, ghetto talk and stuff just feels dated.<br><br>Really unenjoyable from minute one. Beyond terrible acting and the worst kinda people you can't feel remotely sorry for.","user":"chrisrowexxx","rank":[16,25]}]