[{"title":"A very beautiful and unfortunately misunderstood movie.","rating":8,"date":"16 June 2013","review":"From the first scene as I was watching this movie it was made clear that it was not a romantic feel-good film. It was not about creating happy and beautiful couples. Even the adultery in the movie wasn't what this all was about. The main plot of the movie, the main theme, was the loss of a child and how it affected the parents and those in their close vicinity. Emilia usually gets a lot of critique from viewers - from what I've seen - because of her status as a \"homewrecker\". I'd like to add that this isn't what the movie is about. It is true that her character entered a relationship with a married man, but that relationship is never justified. The point of the movie isn't to paint her out as a terrific girl while his first wife (beautifully portrayed by Lisa Kudrow) is supposed to be painted out as a horrible person who deserved what she got.<br><br>Through-out the film it's clear that the ex-wife holds a grudge towards Emilia and she does act out on it a lot, delivering hateful comments and says things just with the intention to cause pain. But at the back of my mind this behavior was always justified. She had been wronged and betrayed, and I don't believe the creators were trying to make her out to be vindictive or spiteful - just hurt and angry because of that hurt. And Emilia was never given scenes where she tried to justify what she'd done, or where the viewers were supposed to choose her \"side\" in the whole ordeal.<br><br>The main theme of the movie was the child that Jack and Emilia lost and how that affected their relationship and most importantly how Emilia lived with the guilt of thinking she was the reason why their child had died. Jack points this out, saying that she hurts the people closest to her the most, and it affects their relationship so strongly that it comes to an end. The strongest scene for me, and the one scene that definitely showed what kind of person the ex-wife really was and where it became crystal clear that it wasn't about revenge or hatred but pain and betrayal, was when Emilia gets called to Carolyn's office so that the latter could make it clear that it wasn't Emilia's fault that her daughter died. Carolyn did this for her son, yes, but she didn't have to. If she'd been a horrible person, that a lot of viewers seem to think the director wanted her to look like, then she wouldn't have done it. This scene really implements that it was never about making anyone the victim or anyone the bad guy, but just about showing the situation for what it was and how everyone handled it differently, reacting as real human beings.<br><br>I saw no glorification or romanticism of the affair. I saw no trying to blame it all on the horrible ex-wife. I saw three people who ended up in each others life because of a mistake and they all handled it as best as they could.<br><br>As for the performances I thought Natalie Portman, Lisa Kudrow and Scott Cohen all did an amazing job. The movie itself is a very emotional journey if you're open to seeing the bigger picture instead of trying to find someone to blame or hate.","user":"QuintessentialBella","rank":[29,30]},{"title":"Quite a nice movie!","rating":8,"date":"18 September 2009","review":"I saw this at the Toronto Film Festival. I go to university in Toronto, and I decided on impulse to watch one of the movies in between my classes, and this one fit so I wouldn't have to be late for my next class. I'm very glad I saw it.<br><br>The film is about Emilia (Natalie Portman), who lives with her husband John (Scott Cohen), and her stepson William (Charlie Tahan). We watch as her story is told through flashbacks and we learn that John was married (to Carolyne, played by Lisa Kudrow) and had an affair with Emilia. He soon divorces Carolyne and marries Emilia. We watch as Emilia struggles to keep her life together with her marriage strained by the death of their 3-day-old daughter Isabel, and William's resentment towards her.<br><br>I really liked the acting in this movie. Natalie Portman is really natural in this role. Scott Cohen and the young Charlie Tahan were very good too, and Lisa Kudrow too, even though she didn't have a lot of scenes.<br><br>I liked the story, and I didn't find the pace of the film to be dragging. The characters were well written too- I was always able to see their side of the story and could sympathize and understand them, even when they contradicted with other characters.<br><br>To me, Love and Other Impossible Pursuits was a very good film overall.","user":"falcon83","rank":[62,85]},{"title":"The Growth of Natalie Portman","rating":8,"date":"9 February 2011","review":"THE OTHER WOMAN is a film that is a bit difficult to watch both because of the thematic material and because of the uneven quality of the film itself. Based on the novel LOVE AND OTHER IMPOSSIBLE PURSUITS by Ayelet Waldman (the original release of this film in 2009 used this title) and adapted for the screen by writer/director Don Roos, the story deals with SIDS (Sudden Infant Death Syndrome), divorce, step-parenting, the legal vagaries that surround divorce and remarriage, and loss. One of the reasons the film didn't make it on first theater release is that it was advertised as 'A comedy/drama that details the story of a woman's difficult relationship with her stepson.' Yes, that is a small part of the story, but this film is hardly a comedy and in fact it seems to have difficulty in deciding just what the main story is! <br><br>The opening credits begin with images of an infant girl but as soon as the action begins we are introduced to Emilia (Natalie Portman) and her husband Jack (Scott Cohen) and son William (Charlie Tahan) There is an undefined tension that is soon explained through flashbacks: Emilia fell in love with Jack who was married to OB/GYN physician Carolyne (Lisa Kudrow) and the love affair quickly developed into Jack's divorcing Carolyne and marrying Emilia. The newlyweds promptly had a baby girl who lived only three days, leaving Emilia in a prolonged state of grieving and denial. Carolyne is a controlling viper and makes the couple's life miserable, refusing complete visitation privileges with William, creating a toxic relationship between Emilia and her 'stepson' William. Emilia's friends (Lauren Ambrose and Anthony Rapp) try to make Emilia's life easier but the friction between Emilia and William as well as the constant interference by Carolyne eventually lead to a collapse in Emilia's and Jack's relationship. Some 'truths' come out about the death of Jack an Emilia's daughter and the response to those statements changes everyone in the story - including Emilia's divorced mother and father. Lessons in how to forgive and how to love complete the story. <br><br>Natalie Portman proves her acting chops in this difficult, multidimensional role and her performance is enhanced by that of Charlie Tahan as the young William. The rest of the cast is not of the same caliber, failing to make us care about their characters enough to find their significance in this rocky script. Though there are many flaws in the film making it seem to drag on too long (almost two hours), the opportunity to see the gradual growth of the acting career of Natalie Portman is reason enough to watch this little New York relationship drama. <br><br>Grady Harp","user":"gradyharp","rank":[30,40]}]