[{"title":"Good vehicle for (and by) Gervais","rating":7,"date":"11 August 2010","review":"I was pleasantly surprised by this film. From a simple premise as \"lying doesn't exist\" it develops into a thoughtful tale with a touch of satire. On the one hand it exposes early on the basic first impressions we all have of each other and of situations we find ourselves in. On the other, it touches on the importance of being honest about what we know and especially honest about what we don't know.<br><br>I could examine all the inconsistencies inherent to a concept like this. One would think that without the concept of duplicity, we should be far more advanced than we currently are. One would also think that without lying, there would be no imagination and therefore very few scientific discoveries and advances. The story requires that you don't think about that too much, just to enjoy the script as it moves along.<br><br>Gervais carries the film along as planned, in his quiet, self-effacing way. The humor won't have you rolling on the floor, but the frankness of the casual insights should make anyone snicker with self-awareness at the truth of it all.","user":"delibebek","rank":[65,78]},{"title":"constantly funny it may not be, but clever it is","rating":8,"date":"4 October 2009","review":"There is a certain re-training of the mind that a film expects of us in order to fully enjoy the place it seeks to take us. This film, in the first act we are taught, in a rather funny way that the world of this film is to say the least - honest. Everyone coldly delivers, whether asked or not - exactly what is on their mind. It takes a good 1/4 of the film to fully understand exactly the world where there is no opposite to truth. And those moments are worth the price of admission alone.<br><br>As a viewer I enjoyed the random interactions that a world where truth is embedded in the framework of all social interaction. With no deviation.<br><br>By the time Gervais comes across the knowledge that an alternate way of communication exists in \"saying what wasn't\" we embark on a tale of a man who essentially won the \"lying Lottery\".<br><br>The humour is subtle, the contrast of religious themes are not so, and that may have been the weakest of elements in the film. Sadly those who think there is a single element of disrespect towards religion from within the world of the film are I believe incorrect. While religious digs may have been the impetus for the films creation, from within the film, Mark's character seems to make a clear delineation between an evil lie and a white lie. And his character never seems comfortable for too long with a lie that affects the lives of many.<br><br>The film does have a one of the more sweet and quietly powerful scenes where Mark creates an alternate afterlife for his mother. Because I don't view this film through a filter of religious expectation I found this scene to be simply powerful and poignant.<br><br>I enjoyed it, as did my partner. We talked the whole way home, and recreated some of the laughs on the way to the car. That is not a lie.","user":"marc_dambrosio","rank":[262,335]},{"title":"Light Philosophy Delightfully Deceives as Romantic Comedy","rating":9,"date":"23 October 2009","review":"If one were to score this movie on a category-by-category basis, some of the categories might be laughability, cinematography, acting performance, direction, originality, script writing and social impact.<br><br>Weighting each equally would lead me to give a much lower rating for \"The Invention of Lying.\" 7 for laughability, 4 for cinematography, 5 for acting, mostly for the performances by Gervais and Fey. Some of the other performances including Garner's seemed lacking, but I'm not sure if this was the fault of the actors, the director, the script or all three. Some of the problem with the acting performances might have been an attempt to make the characters purposefully boring and one-dimensional as a result of the environment in which they live.<br><br>There were some good laughs, but not nearly the funniest movie I've seen. Although the cinematography was about a 5, it isn't the type of movie that demands extraordinary feats in this department.<br><br>9 for originality. Most movies that deal with lying take the opposite approach as in \"Liar, Liar.\" It was the originality of the concept that made me go see the movie. Certainly, the plot of the movie took an approach that caught a lot of the reviewers off guard.<br><br>But to me, the parts of the script that dealt with the philosophical ramifications of lying made up for all the weaker aspects of this film. It seemed clear to me that this was the focal point of the movie. Ironically, the trailers don't even hint at this, thus deceiving us into watching a philosophical movie in romantic comedy dressing.<br><br>As an atheist, I often am confronted with the argument that even if religion is a lie, the benefits it provides outweigh the negative consequences. I disagree, but understand there is an element of truth to this argument. Gervais explores this aspect more directly than any mainstream treatment I've seen if not in great depth.<br><br>To me, the strength of the philosophical treatment is the questions it poses, not the answers it provides. The movie doesn't really provide a lot of answers. When Bellison (Gervais) lies to his mother to give her comfort when she is dying, he has the best of intentions and ends up having to tell huge lies to cover his initial small lie. He attempts to use the utmost care in telling these new lies -- spending so much time concentrating on the exact wording that he grows a beard while doing so. Even so, when he reveals the ten revelations he receives from the \"invisible man in the sky,\" the masses immediately start scrutinizing the rules and reveal weaknesses in them.<br><br>Having thought about these issues quite a bit, there was nothing groundbreaking here for me, but it tickles me pink to think this movie might be watched by those who have yet to journey down that path. This alone accounts for 2-3 of my 9 stars.","user":"briankentjones","rank":[87,108]}]