[{"title":"GREAT Music, Flashy Nostalgia, Fascinating Cultural History","rating":8,"date":"21 December 2008","review":"\"Cadillac Records\" is a fun, fast, flashy introduction to the world of Chess Records. In the 1950s, Leonard Chess, a Polish-born Jew in Chicago, along with his brother Phil (not seen in this film) produced \"race\" records by African American blues and rock and roll legends like Muddy Waters, Howlin' Wolf, Chuck Berry and Etta James.<br><br>These artists' work had huge impact on popular music; the Rolling Stones are shown on a pilgrimage to Chess Studio. Their music is great and is played all but non-stop on the soundtrack, which is a very good thing. Flashy glimpses into the glamorous styles of the 1950s and 60s include loving looks at the many Cadillacs Chess gives as gifts to his star performers.<br><br>Jeffrey Wright is quietly compelling as Muddy Waters. Mos Def is a charming Chuck Berry; he really communicates the charisma that Berry exuded to his adoring female fans. Eamonn Walker is terrific, and appropriately intimidating, as Howlin' Wolf. Walker electrifies the screen with his every morsel of screen time; I wish that after they'd finished \"Cadillac Records,\" they had just kept the sets up and kept the cameras running and began a biography of Howlin' Wolf with Walker in the lead. Beyonce Knowles is very beautiful and pays worthy tribute to Etta James, the singer she plays.<br><br>\"Cadillac Records\" feels a bit rushed, and not as deep and probing as it could have been. Perhaps much backstory was cut out? A shame, because Adrien Brody, a brilliant and compelling actor, is not given enough to do.<br><br>So much more could and should have been said about Chess the man and his motivations, and the complex relationship he had with his singers. There is the story that Chess put Muddy Waters to work painting his ceiling. Some accused him of paternalism; curious viewers are advised to pick up Nadine Cohodas' book \"Spinning Blues into Gold: The Chess Brothers and the Legendary Chess Records.\" Also, \"Cadillac Records\" can't avoid the clichés inherent in music biopics: the innocent character is introduced to drugs for the first time, and is ruined by them; the self destructiveness of brilliant people, the exhilarating, brutal, rags-to-riches-to-obscurity trajectory of show biz careers. For all that, \"Cadillac Records\" is fun and it makes you want to learn more about an important cultural moment in American history.","user":"Danusha_Goska","rank":[53,62]},{"title":"This is mostly fiction and an insult to the artists and the history of Chess Records.","rating":3,"date":"16 December 2008","review":"Pretty much everything in this movie is the work of fiction. It reminds me of one of those Simpsons episodes where a TV studio does a biopic and makes up half the story for 'dramatic effect'. But this is even worse- honestly it was bad enough that the stories were fictional, but they are also just an insult to the people (for some strange reason(!) though all except the white studio owner that is, who was a hopeless romantic, who was also apparently the pioneer of the Chicago blues...all things to all men. He was a saint, everyone else, the musicians were anything but(!)) Let's get some facts clear- Leonard Chess set up the company with his brother, after working at another company Aristocrat Records. It was here they worked with Muddy Waters. So no- Muddy didn't meet Little Walter on the street and bring him into his house. And no, little Walter didn't have the hots for Muddy's wife Geneva. Although Leonard Chess was very much hands on when he started the company, by all accounts the guy who really pioneered the classic sound of the records was Willie Dixon. Who is criminally underused and treated as a one trick pony who could only write blues songs. He left in the late 50's to work at Cobra records after being underpaid by Chess- listen to those Cobra records and those at Chess- they sound pretty similar right? That's because Willie Dixon was the pioneer- Leonard Chess was the man stuck in the past.<br><br>One example of the film's dreadful portrayal of the individuals is the fictional scene where Muddy Waters meets Leonard Chess (ignoring their prior recording work at Aristocrat records). Little Walter is going to shoot another harp player who has hit him, and Muddy stands in his way. Yet the only story remotely like this in REALITY is when a friend of Little Walter's told his wife to leave a club, and she sat by Howlin' Wolf and refused to go. Little Walter was performing on stage, and had seen Howlin' Wolf get his gun out. He jumped down stage and told Wolf that if he was going to shoot his friend, he'd have to shoot him. He later arranged a meeting between his friend and Wolf, who in fact became friends despite the altercation. Which is why this movie is so frustrating- the REAL lives of these people is nothing short of fascinating, exciting and a great background to their music. By all accounts Little Walter was a bit of a loose cannon, but he was also a real person- not a one-dimensional madman who was out to destroy himself and everyone else around him. The story told in the movie is everything that is wrong with Hollywood- overblown, turgid and full of dreadful 'emotional' scenes (everything with Brody and Beyonce is so clichéd and hammed up that its cringe worthy). While the story here is just dull, the real stories have managed to fill biographies dedicated to each of these artists.<br><br>Some more inaccuracies; Little Walter never shot someone just for touring under his name- once again he was no angel, but neither does it seem was he a murderer as the movie suggests. Howlin' Wolf actually stayed with Muddy Waters when he first moved to Chicago- and sometimes they were friends, others professional rivals. Yet Muddy is chosen to be some kind of protagonist who we are supposed to feel sympathy for when another man tries to take his crown. Even worse some of the MORE fascinating characters (with all due respect to Leonard 'bore fest' Chess and Muddy Waters) of Bo Diddley, Sonny Boy Williamson II, Ike Turner or Jackie Brenston are completely ignored. Because these people were irrelevant- Chuck Berry invented Rock N Roll music all on his lonesome and no one else laid the groundwork for that (an especially contrived piece of storytelling when you consider that these guys recorded their seminal records at Chess.) But worst of all is the love story. The entire second half of the movie is dedicated to Etta James and Leonard Chess. Who by the way never had any kind of love affair- and neither did they speak like buffoons to each other about their 'feelings'. Etta James had already been a successful star before Chess- her career if anything went down hill when she joined. One of the more annoying things is that the actors do their own singing- few of them are up to the task. Beyonce is simply dreadful as Etta James vocal imitator. On a microcosm it is a perfect representation of why this is an awful movie. Beyonce's voice is overblown, she has no ability to control her vocal range without trying to jump from top to bottom every two seconds, and ultimately all the soul she tries to put on is clearly just that- put on. She doesn't have the understatement of Etta, the ability to lull you into a false sense of security before taking her voice from 0-60 in a second, and neither does she have that almost primal quality that Etta had back then. Like this movie, Beyonce's performance is overblown and lacks any character or soul.<br><br>I understand that some liberties might be taken with a story. For example, for what it is the Temptations biopic is enjoyable- yes there are discrepancies and some things that should have been more central to the story, but it did a good impression of the music and the stories behind them. Cadillac Records however is like the He-Man Masters of the Universe of music biopics- it has little to do with the source material except sharing the names and likenesses of the characters, but any representation of the source material is superficial at best. And that's the only word that really can describe this movie- superficial. You have been warned.","user":"Vannistelrom","rank":[124,172]},{"title":"Absolutely inaccurate","rating":3,"date":"28 April 2009","review":"As a piece of entertainment this movie may be OK. But why take REAL names of REAL people (some of them fortunately are still living) to tell a story which, for the most part, is completely inaccurate. IMDb reviewer Davo Sambo has rightly pointed out the most blatant inaccuracies that this film carries. But as I have seen and met most of the artists involved in the plot (and for some of them - like Muddy who went dining at my home in Lyon (France) - I've had the fortune to know them personally) what worries me the most is that their personnality are also very inaccurate. For instance, Muddy who had an incredible charisma is portrayed here essentially as a very tepid character who thinks mostly to chase women. And Howlin' Wolf - a tough man certainly but a very bright and articulate one - is here portrayed as the terrorizing Wolf he PLAYED on stage and never out stage. The true story of the Chess saga (and the Chicago blues) is yet to be told properly","user":"gerardherz-1","rank":[44,59]}]