[{"title":"\"I'm 40 and I haven't done anything\"","rating":9,"date":"3 November 2008","review":"Gus Van Sant's talent and humility allows Harvey Milk to be a the center of this remarkable story without putting himself in front of the camera. Sean Penn shines with a new and extraordinary light as Harvey Milk. His humanity is overwhelming at times. That permanent smile defining his face talks volumes about his faith in people, no matter what. His awareness is filled with truth and innocence, he worries he's about to be 40 and hasn't accomplished anything. Little did he know.The film is constructed brilliantly in a series of vignettes that builds up into a whole fluid narrative. Josh Brolin, as the disturbed Dan White is another standout in a complex and remarkable performance. No cheap shots here. Diego Luna, Joseph Cross and Emile Hirsch are also terrific as the boys around Harvey but it is James Franco who truly gets under your skin. His romantic turn is one of the most compelling gay love stories I've ever seen (and I've seen Brokeback Mountain). Highly recommended!","user":"jpm-onfocus","rank":[295,366]},{"title":"Sweet And Powerful Milk","rating":9,"date":"2 November 2008","review":"It happened only 30 years ago but it looks and feels as if it had been much, much longer and yet we're still dealing with many of the same issues. Gus Van Sant moves slightly and respectfully to mainstream to tell us this inspiring and tragic story. Sean Penn is superb as Harvey Milk, none of the traits that made him famous are present here, other than his talent that is, he exudes a positive sweetness that is compelling and contagious. Josh Brolin as Dan White, manages the impossible by giving the assassin an unexpected but welcome humanity. James Franco as Milk's lover is, quite simply, scrumptious. As it happens with most biopics we're forced to run from event to event to be fair and accurate and \"Milk\" suffers from that. I wanted more insight into Diego Luna's character - the most problematic - and into Emile Hirsch's character but the essentials are here and the essentials must be listed in lyrical terms. History yes but also poetry. Hope as a theme. A triumph!","user":"marcosaguado","rank":[249,308]},{"title":"Great Actors and a Great Filmmaker at the service of a Great Story","rating":9,"date":"4 November 2008","review":"Enormously moving film/document about the raise and fall of Harvey Milk. If you don't know who he was, you will. The most startling feature of the film is the casting of Sean Penn. A stroke of genius. I, personally, never would have though that the range of this fantastic actor was as wide as this. He took me over and convinced me. I was watching Harvey Milk himself and Penn with the extraordinary support of his director never betrays that illusion. I'm sorry \"Milk\" didn't come out a few weeks ago. For those in California having to vote for Proposition 8, it would have been easier to decide just by watching Anita Bryant ranting about the evils of homosexuality. She sounded ridiculous then, Im sure, but today she sounds ridiculously ancestral. The vision of Harvey Milk is still, unfulfilled but we're certainly getting closer. Gus Van Sant surrounds our hero by an extraordinary group of young actors, in particular Emile Hirsch, James Franco and a superlative Josh Brolin. Not to be missed.","user":"littlemartinarocena","rank":[276,345]}]