[{"title":"very feminine film which this man enjoyed","rating":10,"date":"20 October 2019","review":"Maybe a little slow for some however worked well and rewarded my patience. Far from being confused as to what genre it is, it seemed pretty clear to me it's a love / ghost story set in contemporary Dakar, Senegal.\nThere's something of a social commentary / realist element and for me it was interesting opening a window on to the lives of young Senegalese women, as well as the customs of an Islamic marriage in West Africa. There's a nice shot of the girls walking along the beach, dressed up to go to the bar, very much like their contemporaries would in any other major city - they wouldn't look out of place in Manchester say and that connecting felt nice, emphasising how much more we have in common than the differences.<br><br>There's repeating shots of a misty sea - the sea in Freudian terms symbolises the mother. The central character, a young woman getting married with the expectations of eventual motherhood. If the sea here is the mother it's also the cause of death - her true love, not the man she'll be marrying, has apparently become one of the many drowned in the mediterranean, making the perilous crossing from Africa to Europe in the hope of a better life. In death is life and so on. This is a movie working more on symbolism and allusion rather than straightforward narrative arc.\nThe sterility of a marriage built upon status and material possessions is contrasted with the vitality of a relationship built upon truth and love - the emptiness of the marriage bed, the sterility of the white room, the bland surroundings of the upscale bar where Omar drinks fruit juice from a straw, child like, perhaps a comment about the infantilising of the supposedly sophisticated.<br><br>The director produces something properly cinematic with superb composition, backed up with a marvellous synthesizer score, some very nice moody shots of the city at night. This film works best on mood and atmosphere, attempts at shoe horning it into the conventions of narrative are liable to be frustrated. You need to open yourself up and try to empathise with the character, the lead actress is fantastic in the emotions she conveys through expression and body language.\nIt's a film using the language of cinema as I say, symbolism, allusion. You need to 'feel' this film I think, it will frustrate intellectual analysis and to do so misses the point. It's there to be experienced.\nIt won't be for everyone. Still, I'm delighted to see the torch of the art movie now carried forward by a female Senegalese director and her team who can rightfully take their place in a distinguished canon of Senegalese and indeed African film artists.","user":"trpuk1968","rank":[46,65]},{"title":"Enigmatic Ghost Story","rating":8,"date":"5 December 2019","review":"An enigmatic film that unfolds like a satisfying ghost story.<br><br>Set in Dakar, Senegal, the film's main female protagonist is Ada, in love with Suleiman but promised in an arranged marriage to the wealthy Omar. Suleiman goes missing with a bunch of other men who set sail across the Atlantic for Spain and better opportunities, and the film is largely about the women they leave behind to think about them and possibly mourn for them. But the ghost story part comes in when mysterious occurrences suggest that the spirits of the men may be possessing various townspeople and carrying out the men's wishes in their physical absence.<br><br>Like many films I've seen this year, a theme in \"Atlantics\" is the disparity between the haves and the have nots. Omar promises Ada a life of sterile comfort, but Suleiman offers love and affection, if economic hardship. It's also a window into the world of those we hear about in the news but rarely see as people, those who emigrate to other places in an attempt to find something better. And it's also about the few choices available to women living in certain parts of the world. But none of this is communicated to us through preaching or lecturing. The movie is more than anything an ethereal love story.<br><br>Grade: A-","user":"evanston_dad","rank":[15,22]},{"title":"Beautiful haunting drama","rating":9,"date":"23 December 2019","review":"This film takes a sad story, makes it personal, then takes it to a whole other place. This film is for the women who are left behind, beautifully filmed and acted, one of the most original films of the year.","user":"catherinecolbourne-92237","rank":[11,18]}]