[{"title":"Know what you should expect","rating":6,"date":"6 September 2009","review":"My movie philosophy: don't blame a movie for not being what it's not meant to be.<br><br>To enjoy a movie, you don't need the movie to be amazing, great, or even good (sometimes). You just need to know what you should expect.<br><br>So what do you expect from gamer? If you want gore, violence, blood, nudity...go ahead and see it. If you want Gerald Butler running around shooting people, fighting people, baring his muscles and looking tough like action heroes do, go ahead and see it. If you want Michael C. Hall playing an evil guy trying to take over the world, and baring his muscles, and even showing off his Broadway background a little bit, go ahead and see it. (but you'd be a little disappointed since he shows up less than you'd expect as this is quite a short movie, only 1.5 hours). Even if you want to see some hot lesbian actions probably imagined by very non-lesbian people, or a cute teenage boy who probably isn't supposed to do anything other than being a cute teenage boy...go ahead and see it.<br><br>But If you want go in and find some surprise- and twist-filled plot, some complicated multi-layer character development, or some brilliant insight into society or even humanity, then no, don't go see Gamer.<br><br>The problem is, if you are really expecting the later things I mentioned, I think it's partially you fault that you are going to spend one and a half hour of your precious time sitting in a theater suffering from this movie and then hate it with a passion. Because really, those aren't what Gamer is meant to be, even though some people may actually believe that they are.<br><br>The reality is that while not what many would call a great (or even good) movie, Gamer could be thoroughly enjoyed, as long as you know what it should be. Because I think it's everything it set out to be. You just need to (maybe grudgingly) accept what it's supposed to be and either enjoy it for what it is, or realize that it's not a movie for your high level of intelligence and ignore it completely.","user":"deadisalive-1","rank":[400,514]},{"title":"A warning to those who dislike ADHD music video directing and editing.","rating":2,"date":"6 February 2010","review":"The first run around, I turned Gamer off after thirty minutes. The directing and editing was so bad - with no single shot seeming to last for more than half a second - that I could barely follow the story and found the action unintelligible and boring. It is shot like a 2-hour long music video. No establishing shots, nothing subtle, rapid-fire editing, overuse of shaky-cam and not one single shot that isn't angled weird or pointing up someone's nose.<br><br>Only three movies I can recall had directing and editing this distracting, annoying, and self-congratulating. Those were Catwoman (04), Vidocq (01), and Transporter 3 (08). If you could handle those movies then you might enjoy Gamer.<br><br>So yes, I turned it off, but then I decided to review it anyway to perhaps save a few folks like me (people who can't stand this new era of ADHD movie directing) some time. So the next day, I sat down and suffered through the last two thirds. And yes \"suffer\" is the right word.<br><br>It's a pity as I see it. Michael C Hall was a fabulous bad guy. Gerard Butler is a tried and tested action hero. The concept and script weren't altogether losses. But boy do these directors (yes, it took TWO of them to make something this awful) need to get over themselves and learn how to visually tell a story without getting in the way of it. It worked for Crank because the style matched the frantic subject matter and almost became part of the theme of that movie. It DOES NOT work with Gamer.<br><br>You know, I used to think Uwe Boll or McG, or perhaps Michael Bay were the worst directors in Hollywood today. Now I'm revising my opinion... Neveldine/Taylor take that dubious honor.","user":"The_Dead_See","rank":[26,34]},{"title":"Decent adrenaline rush with an interesting sci-fi twist","rating":6,"date":"4 September 2009","review":"The previews of Gamer didn't terribly appeal to me. However, after reading some initial reviews and seeing that the people over at Joblo found it to be pretty decent, I thought I would check it out. Was it what I thought it would be? Kind of. Was it entertaining? Sure.<br><br>Gamer is, first and foremost, mostly a brainless action film in the vein of Crank and other hyperkinetic actioneers, which is presented in fast, somewhat jittery cuts. There's plenty of ultraviolence here and a world of uber-tech that revolves around mind control and the next phase in adult entertainment. While the premise seems a bit silly, with some people subjecting themselves to more demeaning elements, it is a bit thought provoking, which is kind of nice in an action film. It does edge close to Schwarzenegger's Running Man, although this film stands on its own with a stern Gerard Butler and over-the-top Michael C Hall.<br><br>Still, you can't help but feel detached from everything. The film rushes itself, finally slowing down to a decent pace at the end, with an ending that is very fitting and entertaining. However, most of it is a mix between speedy action and lackluster dramatic scenes. Why Leguizamo is in this film, I have no clue. There is enough action and techno-gunk here, however, to make for an entertaining 90 minutes. There's also plenty of T&amp;A, which is rare in films these days, although I found most of it to be not veyr attractive. The interesting thing is that the film does do a good job of creating a world that could potentially exist. No matter how disturbing some elements in the film may be, they seem to have an air of truth, and that elevates this film just-above-average.<br><br>Although it is certainly a film with many short comings, it's entertaining and presents an interesting world with some scary realizations. Let us hope that, in our lifetime, we don't see this sort of thing happen.","user":"cadillac20","rank":[106,159]}]