[{"title":"A Delightful Movie for the Whole Family","rating":8,"date":"2 May 2013","review":"In New Orleans, the scientist Allan Topher (David Eigenberg) of the Kinetech Laboratories develops the robot with artificial intelligence Code 328 programmed to work as rescue and search machine and to learn the human emotions. However, the president and CEO Porter (Kim Coates) intends to use the robot as a weapon to search and destroy and sells one hundred units to the dealer Esperenza (Joaquim de Almeida) for 75 million dollars. Allan opposes to Porter's intention and is fired. However, before leaving the company, he deletes his files and steals Code 328. Allan and the robot are chased by Porter's security team and in the pursuit, he loses the robot that breaks in parts in a garbage container.<br><br>Meanwhile, the nerd boy Henry Montgomery Keller (Bobby Coleman) has just wined a prize for his project in the science fair of his school but he is bullied by the school bully and hides in the garbage container where the pieces of Code 328 are. Henry brings the robot home and fixes it. Then he names him as Cody and introduces him to his mother Joanna (Penelope Ann Miller) and his sister Meagan (Holliston Coleman). Cody becomes Henry's best friend and the pride and joy of the Keller family. When Henry seeks out Cody's \"father\", he does not know that Allan is looked on by Porter's men. When Henry and Cody meet Allan, they are hunted by the security guards. Now, Allan and Henry and his family have to find a way to save Cody and avoid the selling of one hundred robots to Esperenza. <br><br>\"Robosapien: Rebooted\", a.k.a. \"Cody the Robosapien\", is a delightful movie for the whole family. I loved the adventures of Cody and his friend Henry in New Orleans. The plot is predictable but anyway I believe that viewers that appreciate the genre family entertainment will find it enjoyable. My vote is eight. <br><br>Title (Brazil): Not Available","user":"claudio_carvalho","rank":[22,33]},{"title":"Pure children's movie but I enjoyed it in some way","rating":6,"date":"26 October 2013","review":"Yeah I know it may look silly but I wanted to see this movie because I like robot themes. This movie is specially for children but very few adults can enjoy it. Maybe you can watch it with your kid, that will make you a little more comfortable.<br><br>There were no surprises in the movie. This small Robosapien is called Cody who can do all the stuffs that Chitty does in 'Enthiran'. I guess that is what all the robots do, right. The graphics were not perfect but it was acceptable quality as per the mind of children.<br><br>The movie tells the story of a young lad who is a science geek. One day he accidentally meets the severely damaged Robosapien, he repairs it and names it Cody. Yes, just like the movie 'Iron Giant'. The Cody slowly remembers his past and reveals that he was chased by the bad scientists. So this boy helps the Cody to join his creator and you have to see to know how it all happens.<br><br>The movie was not bad as it rated in the internet but in was one time watchable. And then you will forget everything about it in a couple of months. But I had an excuse because I watched it with my niece, hehehe.<br><br>6/10","user":"Reno-Rangan","rank":[6,9]},{"title":"Watchable family movie / kid flick","rating":6,"date":"17 March 2014","review":"I had no expectations when I started watching - all I knew was it was about a robot. But it was a one of the few non-animated children's movie available at the time.<br><br>Basically, it's about man misusing technology and a kid rescuing the misused technology, in this case, a robot initially programmed for good but hijacked for nefarious purposes.<br><br>Acting is just average in this movie. Most of the kids in this movie do not seem to have much acting experience and it shows (some of the adults don't either), but the kids you're watching this with will probably not notice. They'll most likely be oohinh and aahing over the cool robot.<br><br>Typical storyline: robot invented for good, subverted for evil by no- good partner, robot damaged and found by kid, kid repairs and restores robot's, bad men chases kid and robot, kid's family is kidnapped, then rescued by robot and all ends well.<br><br>Not the best family movie there is, but it is good for 90 minutes of family bonding.","user":"Mike-DD","rank":[1,1]}]