[{"title":"Fantastic piece of British cinema...but not to be taken as a history lesson by any means.","rating":8,"date":"28 March 2009","review":"Set in 1980s Belfast, when the Troubles were devastating Northern Ireland; this is the story of 22 year-old Martin McGartland (Sturgess) who, in real life, became involved implicitly with both sides of the conflict. The film details how he worked firstly for the IRA and was subsequently sought after and enlisted by the British police as a spy; leading him to live a perilous double-life. The title (taken from McGartland's book) refers to the number of people he believes he saved whilst working undercover.<br><br>The film begins by establishing him as an ordinary young man growing up within the bleak setting of West Belfast during that time, making very little money by selling knock-off goods door-to-door. He is mostly concerned with making enough money to impress his love-interest, Lara (Press); but he is also an Irish Catholic, who vehemently opposes the British occupation of the country and believes in the cause of a united Ireland. However, when he begins to work for the IRA, he becomes a first-hand witness to some of the atrocities committed by them and begins to have doubts about his political standpoint. Meanwhile, a member of Special Branch, Fergus (Kingsley), wants him to become an informant on IRA activities. Initial attempts to recruit him are useless, but McGartland eventually accepts the proposition; the violence he had witnessed still being fresh in his mind, along with the offer of a substantial sum of money in return for his work. The remainder of the film is a tense and gripping set of events, all the while focusing on McGartland's inner conflict. He is portrayed as a confused young man, exploited by both sides and absorbed completely by the two equally tormenting responsibilities which he cannot escape: on one hand, he is betraying the cause which his ancestors had given their lives to for centuries  his long-standing belief of freedom for his country; but on the other hand he is stopping the all-too-real violence he encounters on a day-to-day basis which, no matter what history has taught him, he cannot find justification for.<br><br>Although there are films which handle this subject matter far better, I feel that Fifty Dead Men Walking must be praised for the social realism and consistently gripping drama that is conveyed from the outset through the locations used, the cinematography and the outstanding performances given by the main cast. Sturgess captures the complexity of McGartland's character and, considering how difficult it must be to imitate a West Belfast accent, he and Press do a convincing job. I was compelled to watch the film from start to finish and credit is duly given for this being a fantastic piece of British cinema. <br><br>There are also, of course, the (dubious) factual elements associated with the film. It was filmed at the very location where these events were taking place little more than twenty years ago, which adds to the sheer tension felt throughout. The film is highly emotive and deals with controversial issues that have been highlighted again recently, where a dissident group, the \"Continuity IRA\", has claimed responsibility for the murder of a policeman. The film will resonate with people on many levels. It is true that there are overwhelming accounts of horrific violence from the Irish Republican Army (a small part of which are shown graphically in the film), yet there are many discrepancies in the film and viewers may not know the vast complicated past associated with the Troubles and so, we are presented with yet another media representation of one side of the fierce conflict in which, truthfully, equal acts of brutality have been committed on both sides throughout history. Ultimately, I would urge people to watch the film for its brilliant script, performances and drama; but not to take it as a lesson in Irish history by any means. If anything, whilst much hostility still exists today between some Nationalists and Unionists, the film succeeds in demonstrating the futility of such violence after hundreds of years of warfare and above all else, the overriding desire for peace from those people who have had to live amongst the fighting and still live with the concern that it may one day return.","user":"sweet_lady_genevieve","rank":[60,74]},{"title":"Woefully Underrated","rating":9,"date":"19 June 2010","review":"I've never written a review before and don't really feel very qualified to do so, but I felt so strongly about this film that I wanted to do more to recommend it than giving the star rating.<br><br>Jim Sturgess turns in an incredibly moving and amazing performance as Martin, the young man who gets caught up with the IRA via his friends, only to be turned by \"Fergus,\" played by Kingsley in a very different and understated role than we're used to seeing him.<br><br>Martin is torn between the cause and his friends vs. the ever-growing violence against innocents. He becomes a father and ultimately decides to be a source for Fergus, infiltrating deep and high into the organization. We live through his angst, fright, joy, sorrow, regret, rage and pride as he evolves.<br><br>Kingsley's portrayal of Fergus -- a hard and closed-off guy who comes to uncharacteristically care deeply about Martin -- is played brilliantly, with just the right low-key nuance in manner of speaking and facial expression that allow you to see his emotional wall crumbling a bit for Martin.<br><br>But there are costs for Martin regardless which path he takes, just a grim and sad result of the fractious climate between the IRA and British soldiers/police.<br><br>The storyline, the style of filming (sorry, I'm not adept with technical terms), the wonderful development of the Martin character (and to a lesser extent, Fergus), along with the incredible performance by Sturgess (I would go so far as to say even Oscar-worthy) really make this film memorable and worth your time.","user":"BunnyNC","rank":[36,45]},{"title":"NOT a masterpiece but a damn fine film","rating":8,"date":"23 March 2009","review":"I read the book going by the same name many years ago when it first came out and it left quite an impression on me. I felt very sympathetic to Mr McGartland's predicament, so I for one am glad that his story can largely be told in this medium. Read the book to iron out the odd discrepancy and to get the time-line correct. The director of this film bravely attempted to show 'The Troubles' as viewed from both sides in the short time the film allows. Although not all of the events are true, the film does realistically portray the truly chilling times. It is violent, nasty and tense, and I congratulate the director on not pulling any punches and showing the sort of menace that haunted the streets in the province. The makers of the film did state: 'The screenplay to the film is INSPIRED by the book. Although many aspects and characters have been changed the screenplay was not written or approved by the writers of the book and is not a reproduction or adaptation of the book or any substantial part of it' at the end of the film. I would suggest that wording was inserted to cover themselves. Certainly, Mr McGartland was not happy with the film to begin with as it showed him to be present at deaths that took place, to which he claimed he was not. Obviously, there are faults with the film then. But the main thrust of the book/film for me was that Mr McGartland was young, naive but also courageous, he was used by both sides and yet eventually couldn't trust either side. Although the peace treaty has been signed and to 'all intents and purposes' the Troubles are over 'as we knew them', it is a well known fact that the IRA never forget those that cross them. So the film is a reminder to many that this man gave up his life as he knew it for very little in return and to be forever on the run. This is not your typical Hollywood fare and is all the better for it. A job well done!","user":"sjmd1156-1","rank":[36,46]}]