[{"title":"Good Teen Fun","rating":6,"date":"20 August 2008","review":"While this film won't be winning any prizes for being particularly deep and probably won't make you rethink your outlook on life, it's still good fun. There's some promising new talent, good laughs and sweet lines in this delightfully cheesy romantic comedy.<br><br>It's about a stereotypical Malibu Princess who annoys her father one too many times, resulting in her being sent away to an English Boarding school (much to her horror - the rain, the rain!). The film pretty much centers around her trying to get expelled from the school, and therefore sent back to LA with her father and sister. The film is about her journey from spoilt brat to English Boarding school-girl. <br><br>If you're into Rom Coms and you're between 12 &amp; 19 years of age I would definitely recommend this one for a good night in with the girls.<br><br>+ there's some magnificent Alex Pettyfer moments ;)<br><br>JUST WANT TO ADD - That there have been many complaints (mostly from British girls - of which I am) about the way British girls are portrayed in this film, but please rethink this and look at how Americans are treated! Our main character starts as a lying, self obsessed and vain brat and her best friend Ruby (American) proceeds to steal her boyfriend and backstab her! So you British girls who saw fit to complain - don't. This is only light-hearted fun, and Americans are treated far worse!","user":"marianne-grace-x","rank":[48,58]},{"title":"Light Hearted FUN","rating":7,"date":"14 June 2009","review":"Come on folks, lighten up here.<br><br>Yes... This isn't a deep and meaningful piece of classic cinema... It is a fun \"just sit back and have a good grin\" film.<br><br>I'm afraid that people who get on their high horse about films like this must have gone to the wrong cinema! I am male, in my 40's, have a degree and run my own company... I watched this together with my two daughters (14 and 16) and we all had great fun and a few really good laughs. So no... you don't have to be a 12 year old girl to find something fun in this film!<br><br>It is predictable, cheesy and the plot is VERY shallow and weak in most places... But you can't expect more from a film like this.<br><br>So if you want to watch this, just turn off your high-brow film critic existence, grab some popcorn and a fizzy drink and have a smile...","user":"rphillips-18","rank":[19,22]},{"title":"Not bad at all","rating":7,"date":"6 October 2008","review":"Wild Child may be predictable, but what it lacks in substance it makes up in character evolution. It is your basic wild child gets sent away and becomes reformed type of movie, but there lies a deeper meaning hidden in this movie. The poster before me recommended this to children, and I can't help but wonder if that poster was a teen him/herself. Adults will enjoy this movie more than teenagers; teenagers rarely understand coming-of-age movies as they have yet to experience it.<br><br>Wild Child is most assuredly a predictable movie, but don't let that stop you. It's also very heartwarming, charming, and may bring a tear to your eye. See it.","user":"caersai","rank":[55,72]}]