[{"title":"One of the best written of all the Disney TV movies","rating":9,"date":"31 August 2008","review":"This one is clever and funny and very well acted. The stories of time travel and and nerds becoming heroes have been done before, but seldom this well. The dialogue is fast-paced and funny, and unlike other teen comedies, is not totally dependent upon pop-culture references for its humor. The teen stars look like real high school students, and are not meant to look model perfect like in \"High School Musical\" or the \"Cheetah Girls\". (Okay, Chelsea Staub is the exception, but she's still perfect in her role). Like in real life, the good guys and the bad guys are not 100% good or evil, but are products of their decisions.<br><br>But more than anything, this is a very entertaining and fun, smart movie. If Disney had tweaked the special effects just a little, it could have been released in theatres, and I'd bet it would be a box office hit. Who knows? They are making a theatrical sequel to \"High School Musical\", why not \"Minutemen\"? I'd pay to see it. Well done.","user":"murray_mg","rank":[13,16]},{"title":"I LOVE this movie!","rating":9,"date":"3 March 2008","review":"I'm not a big fan of Disney Channel Original Movies (apart from the High School Musical films), so I was pleasantly surprised by Minutemen. I've only seen it twice so far, but it's become one of my favourite movies ever and definitely my favourite movie of 2008. The only reason it doesn't get a 10/10 is because it has that Disney Channel feel to it - and that's not a good thing in my opinion. But still, I can't wait to get the eventual DVD. I'll be there first day of sales! I don't know why some people don't like this movie, I mean, it's got a great young cast, a good story, good effects (for Disney Channel), so why the hate? Give this movie a chance. I'm sure you'll love it. I did.","user":"A_Random_Guy_22","rank":[14,22]},{"title":"Just One Big Do-Over","rating":5,"date":"27 January 2008","review":"Disney juvenile star Jason Dolley gets a chance to set things right so to speak in high school life in the new Disney television film, Minutemen. He and another young man get hung out to dry on the horns of a ram statue which is their high school mascot. After that it's nerd city for him and young Luke Benward.<br><br>But you don't mess with a young genius and Benward with the help of some purloined downloaded files from NASA invents a time machine. They get another assistant in 6'4\" Nicholas Braun who because of his height is also something of a high school misfit. And then with the best of intentions they go back in time and start righting a few wrongs as they see them. Life for them becomes one big do-over. Naturally as things work out some really unforeseen consequences occur.<br><br>It's a Disney product so the cast has that fresh scrubbed look, but the film is charmingly done and the performances are easy to take. I must make note of two other people in the cast. Young Steven R. McQueen is the grandson of the famous movie legend who if he were still with us would be 78. He plays the jock rival for Chelsea Staub who Dolley is crushing out on. You look hard and you can see some resemblance to Steve McQueen, but his character here is hardly the rebel persona of say, Nevada Smith.<br><br>One other cast member, J.P. Manoux took his character of the snoopy, supercilious vice principal from that Disney television series, Phil of the Future, and brought it over intact for this film. He's a pretty funny guy, Manoux, he's the best reason for adults to watch Minuteman.<br><br>By the way the title is something that Dolley, Braun, and Benward dream up to call themselves. They outfit themselves in white snow gear like they were going on a secret military operation in the polar region. <br><br>Well you didn't think it meant anything else? After all this is a Disney production.","user":"bkoganbing","rank":[15,27]}]