[{"title":"Ghost Rider","rating":6,"date":"24 February 2020","review":"Even though this film was intentionally suppose to be mindlessly entertaining, it is misguided in its attempt. There is some good action and some over-the-top Nicolas Cage but there is piss poor character development, storytelling and handling of villain(s). You don't have to dumb down a film completely for it to be entertaining and you piss off comic book fans as a result because of this film existing. Ghost Rider: Spirit of Vengeance might entertain you if you're high or drunk but if you want good entertainment go watch The Avengers instead.","user":"MR_Heraclius","rank":[39,40]},{"title":"A mindless CGI-fest that's so bad it's kind of funny.","rating":5,"date":"29 April 2015","review":"Okay, I'm a Nic Cage fanboy. Let's get that out of the way. I'll watch anything the guy does no matter how terrible the reviews are, and sometimes I'll be pleasantly surprised, as was the case with \"Seeking Justice\", \"Drive Angry\", and \"Kiss of Death\". The guy has some hidden gems in his career. Is Ghost Rider: Spirit of Vengeance one of them? Hell no.<br><br>The first Ghost Rider was campy and stupid, but it was a watchable popcorn action movie and it had Eva Mendes (hence, watchable). Spirit of Vengeance is just stupid. Everything about it is stupid. No part of this movie is fleshed out and none of it is interesting. It throws you right into the action with no exposition. It's just a bunch of things happening on screen oozing with CGI to make up for the complete lack of substance. You can tell this is the same guy that directed Crank: the difference is that movie didn't need any substance because the premise was so fun. This movie just pisses on Ghost Rider's origin (literally) and expects you to enjoy watching sh*t blow up for the sake of sh*t blowing up. The writing in this movie is especially horrendous; did they hire a 10 year old to do the screenplay? It sure as hell seems like it.<br><br>So you may be asking yourself, \"why give it a 4/10 if it's so awful?\" Well, I'm a sucker for laughably bad movies and this definitely qualifies. I mean, the dialogue alone tries to take itself seriously but ends up providing really good unintentional laughs. But I'll be fair, not all of this movie sucks.<br><br>Nicolas Cage is always enjoyable to watch. You can tell he's invested in the role, and his dedication really holds this movie together. Idris Elba is also in this movie for some reason and he's great in anything, even if his character is completely throwaway. The other acting is serviceable I guess. You can't really blame any actors here because it's obvious the filmmakers wanted it to be a massive CGI-fest with stupid dialogue to lead action sequence A to action sequence B. To their credit, the CGI in this movie is pretty cool. Ghost Rider looks badass, the visuals in the big set pieces are nice to look at, and if you have no interest in the story you can definitely shut your brain off and enjoy the insanity happening on screen. <br><br>So in a nutshell, you don't need to see this movie. You really don't. Not even the great Nicolas Cage is enough to hold this piece of trash together. But if you're really stoned or just want to see cool sh*t on screen for an hour and a half and there's literally nothing else to watch, go ahead and knock yourself out with Ghost Rider: Spirit of Vengeance. You may find a new B-movie comedy classic.","user":"lnvicta","rank":[104,118]},{"title":"Loved the first Ghost Rider, this one was TERRIBLE","rating":1,"date":"20 February 2012","review":"I was real excited about a sequel to Ghost Rider. I liked the first one. I was very disappointed. Everything is horrible about this movie. The plot, the writing, the acting, and especially the special effects. In the first move, the flaming skull was sharp, the bike was great, the riders expressions were great. In this movie, the flaming bike looked broken down, the skull wasn't sharp, and the jacket charred. The chain never lit up on fire either. And the penance stare was different. He didn't say look into my eyes or anything. Not to mention again that the writing and the plot were garbage. Don't waste your money on this one. 3d can't help this stink pot. Wait for cable.","user":"solutionpw","rank":[207,317]}]