[{"title":"OBVIOUSLY PAYING FOR FAKE REVIEWS/RATINGS!!!","rating":5,"date":"5 November 2019","review":"Cause this movie is TERRIBLE and poor quality to say the least. Hilarious how it was at a 5.1 rating and going down, and all the sudden it gets hundreds more ratingso and skyrockets. Utter garbage like this DOES NOT get a 6.7 rating. Period.<br><br>It's also hilarious how many of these \"reviewers \" have either A. Only reviewed this film and no other, or, B. Just started writing reviews.<br><br>So don't fall for all these reviews praising it, and everything about it. They're obviously either the director, one of the main actors, someone getting paid to write them, or someone who's been kidnapped and has a gun to their head. Cause ITS GARBAGE!!;","user":"ToBeloved","rank":[72,106]},{"title":"More of a \"WORSTern\" than a western","rating":2,"date":"30 March 2020","review":"As you may know, new westerns in this day and age are kind of hard to find, and most of them aren't very good. \"Badland\" is a western that unfortunately falls into the bad movie category, even for someone like me who really loves the western genre. I knew this was going to be a bad movie when I saw that the Cinedigm company was the distributor, and shortly afterwards when the first scene started to unfold, I instantly saw how incredibly cheap and tacky the production design looked like. But that was small potatoes compared to the real problem with the movie, which was how utterly slow and boring it played out. There's no grit, no energy, and no clear love of the genre. Instead, we just get a collection of various western clichés and dialogue executed in the flattest way possible. The presence of the charismatic Bruce Dern managed to lift my rating to 2 stars out of 10 instead of just one star, but only barely. Not recommended even as a movie to play in the background while you concentrate more on another activity in your home.","user":"Wizard-8","rank":[16,20]},{"title":"Good sleep aid!","rating":1,"date":"31 March 2020","review":"Well buffed out Pinkerton Detective/Cowboy - Mathias Beacher - who says little, wears all black and hunts down fugitive Confederate war criminals with his two Colt Peacemakers and Spencer carbine with the intent of hanging each one. His two bosses are both former slaves. First he offs fugitive rebel Trace Adkins and all his bros after a bizarre conversation in his barn. Then he tracks down one Confederate Capt Cooke on his ranch in the desert - played by an ancient looking Bruce Dern who is only shown in a white nightgown in every scene. Not a good look Bruce. Given that Bruce is already dying he spares him and at the same time falls for his sexy middle aged daughter - Mira Sorvino, looking pretty cute in her cow girl duds. She does not seem too bothered that Mathias came to kill her dad and falls for the guy. The bathtub scene is a bit much where Mira walks in on Mathias cleaning up his body builder body. But I guess she wanted to check out the merchandise before buying so to speak. Finally he tracks down a war criminal turned corrupt sheriff running the quaint little town of Knife Edge, a town filled with old geezer cowboys and surprisingly attractive prostitutes. The Sheriff even shoots one of the hookers over a $12 debt she owed him. What was that about? While Mathias manages to dispatch the sheriff and all his posse in a classic gun fight in the middle of the street, he ends up gut shot - basically a fatal wound. But that does not stop him from riding all the way back to Mira on her ranch. No real ending to the film to see what happened to the happy couple.<br><br>A good combination of a dumb story, bad acting, and unbelievable characters. And what is with Mathias's unusual affection for his horse. Not going there.","user":"mxsuba26","rank":[4,4]}]