[{"title":"Definitely flawed but not completely awful","rating":6,"date":"24 October 2019","review":"What I liked:\n<ul><li>interesting, original concept that feels strangely applicable to our modern society. Let's be honest: if we could really download an app like this, most people would.</li><li>decent acting.</li><li>surprisingly likeable and intelligent main character, which is kind of refreshing in this genre.</li><li>not particularly scary to me but probably pretty creepy to someone who scares easily. Which is a good thing.</li><li>no inconsistencies or plot holes I could find.</li></ul><br><br>What I didn't like:\n<ul><li>unnecessary romance is unnecessary.</li><li>the comic relief priest.</li><li>the weird sexual harassment subplot. I feel like they could've done without.</li><li>bit predictable at times, clichés throughout.</li><li>a couple of dumb jump scares.</li></ul><br><br>\nOverall not a terrible experience. Probably don't care to watch it again but if you're in the mood for a fun horror flick this'll do just fine.","user":"juliette-smits","rank":[138,180]},{"title":"For lovers of final destination","rating":6,"date":"25 October 2019","review":"The movie gave me the same feeling I had when I first watched Final Destination; trying to beat death with a few good laughs and nice characters. You know what's going to happen but still you're in suspense.<br><br>Not the best horror movie of 2019, but definitely enjoyable to watch around Halloween. And deserves a better rating than it has.","user":"jelliejune","rank":[76,103]},{"title":"Actually pretty good for PG 13","rating":7,"date":"25 October 2019","review":"Great times when a movie completely surprises you by being good. PG 13 horror movies tend to be mediocre but #Countdown was really good. A bit more to the plot than the trailers implied. Witty (snarky) dialogue and a great group of unknowns, with two great veterans dropped into the mix, Tichina Arnold and Peter Facinelli, whom I didn't even know were in the film. As a teen movie, everyone is gorgeous *eye candy* but the twist in the movie gave it more depth than anticipated. Two peripheral characters added an unexpected comic appeal for a \"horror\" movie. I think the Happy Death Day franchise has spun off a new genre \"com-horror\" maybe? Anyway, on a regular movie scale this is maybe a 7? but for the PG 13 horror rankings, a solid 9. Great date movie, as there is no nudity, or a movie to see with a group of friends for laughs and jump scares.","user":"bandblawrw","rank":[62,96]}]