[{"title":"Absolutely brilliant","rating":11,"date":"11 March 2008","review":"Rarely do we see a film so absorbing that offers no humour, no romance, no suspense (in the normal sense), little dramatic action and no challenge of controversial values (at least not explicitly). The latest Cannes Palm D'Or winner \"4 months\" is just such a one. You will not be \"entertained\" in the normal sense. Most will come out feeling depressed. But there is also a sense of elation in being privileged to a piece of art work that deserved to be described as nothing less than brilliant.<br><br>The plot is simple. In a time span of less than 24 hours, the audience witness and experience a chillingly realistic abortion. Without ceremony or preliminaries, the camera takes the audience right into a crummy apartment in 1987 Romania occupied by two students, where Gabita is packing to spend a few days in a hotel for an abortion while Otilia is helping her. However, this is really Otilia's story. In the next little while, we see her scrambling when the hotel booking falls through, having an argument with her boyfriend who wants her to come to his mother's birthday dinner in the evening and making initial contact with the man who will perform the abortion for her friend Gabita. The rest of the story takes place in the hotel where the abortion is performed and Otilia's boyfriend's place where she spends an hour to attend the birthday dinner.<br><br>Of the four characters, the boyfriend has been designed to be common and unimpressive. The man performing the abortion is no doubt a villain but comes across more as unscrupulously self-serving and utilitarian and rather than outright evil. It is in Gabita that we have an unusual type of \"villain\", one that you may end up detesting even more than Anton Chigurh in \"No country for old men\". In Gabita is the description \"clueless\" redefined  utmost irresponsibility, endless procrastination, lying for convenience (an illusion of an easy-way-out). All this doesn't really matter as you start to lose patience with and cares less and less for this character, until you see that as a result, what Otilia has to go through in unflinching loyalty to her friend refining the word \"hero\" (a word, incidentally, that doesn't need any and gender differentiation).<br><br>In today's Hollywood trend of film shooting, editing and cutting that leaves your head spinning and completely empty afterwards, the camera work of \"4 months\" is beautifully refreshing. At the start, there are some long shots covering physically moving scenes, giving you a realistic experience of being right there at the scene rather than watching at a distance. Wisely, these are not overused. There are also stationary shots reminiscent of Yasujiro Ozu. One particularly brilliant scene is at the dinner table where Otilia is positioned right at the centre of the frame, with her boyfriend and his parents beside her, as if you are one of the dinner guests looking across the dinner table. For full ten minutes the camera is completely stationary, as the animated conversion goes on around her and is sometimes directed at her eliciting brief, polite responses. With model minimalism, Anamaria Marinca conveys, pitch-perfect, Otilia's uneasiness in this less-than-desirable company, her growing anxiety thinking about her friend left alone in the hotel room waiting for the abortion device implanted by the \"doctor\" to take effect, the surfacing frustration with her relationship with her boyfriend and a whole range of layers of emotions  full ten minutes at the dead centre of an uncompromising camera. Just for these ten minutes, she should win an Oscar.<br><br>\"4 month\" does not have any background music (same as \"No country for old men\") and the life drama plays out naturally without any dramatization. Yet the palpable underlying tension makes you hold your breath. I don't recall a 90% full cinema ever being so quiet, particularly when there are long moments of complete silence on the screen, when you can hear a pin drop. The audience is so captivated that they hardly breath.<br><br>\"4 months\" does not preach. It is not a morality debate about abortion. What it shows mercilessly (to the audience, including the image of a jettisoned fetus at 4 months 3 weeks and 2 days) the brutal reality two young women faced in totalitarian Romania in the 1980s, in trying to get an illegal abortion as well as in daily life. One of the most deserved Cannes' winners in recent years.","user":"harry_tk_yung","rank":[28,31]},{"title":"Less is sometimes better...","rating":10,"date":"10 November 2007","review":"A visceral and emotionally draining experience. Those are not typical superlatives one usually conjures while commenting on a movie, yet in this case I dare use such a characterization as a positive rendering of what I felt when watching this film.<br><br>The spartan and minimalist style of the movie only adds to its potency. Though many might find it jarring to sit through, I can only hope that people will have the patience and resolve to watch this brilliant example of movie making. If you invest your time and emotions in this one, you will not be disappointed.<br><br>The acting, camera work, cinematography are of the highest quality, especially given the budgetary restrictions and scarcity of available resources.This movie is yet more ample proof that one does not necessarily need a 200 million dollar budget to make a great film. Creativity and originality can add untold dimensions to any physical limitations and barriers. <br><br>All in all a great \"little\" movie about a forgotten slice of history, a little known place and, a time of horrifying brutality and oppression i.e. the so-called Golden Age (epoca de aur), Romania and Nicolae Ceausescu. This movie, \"4 luni, 3 saptamani si 2 zile/4 Months, 3 Weeks and 2 Days\" is the first installment in a proposed trilogy entitled \"Amintiri din epoca de aur/Tales From The Golden Age\".<br><br>I'm looking forward to the next chapters...","user":"loco_73","rank":[124,156]},{"title":"Amazing & intelligent film","rating":9,"date":"14 September 2007","review":"I was fortunate to see this film during the TIFF last week. With Palm d'Or behind the title, my expectation was high and I was amazingly satisfied.<br><br>As an audience in TIFF, we also got to have a Q&amp;A session with Cristian, the director and it was apparent to me that he is a very intelligent man. Everything that was in the movie was well thought and planned. There is no accidents about this movie.<br><br>There are quite a few unclear scenes. However after, the director answered a few questions for the audience and I got to understand his point of view. It was clear to me what he was trying to show us. There is no wasted scenes or filler during the whole show.<br><br>There is a particular scene where many don't understand why it is so long and meaningless. Many viewers got frustrated, irritated and restless after a while. But that is exactly what the director wants us to feel. He plays with his audience through his film. What a brilliant idea ! For those who has seen it, will understand. Your feeling is exactly what Otilia was feelings.<br><br>This is not an anti-abortion movie as the director said. There is no political statement. It is just a daily life of a few Romanians during the period and you can feel it through this movie.<br><br>For all other foreign film fan, this is an absolute must see for this year.","user":"jo_kidsada","rank":[178,244]}]