[{"title":"Where is Van Damme's \"story by\" credit?","rating":4,"date":"26 April 2009","review":"Jean Claude Van Damme wrote and stared in this movie in 1990 when it was called Lionheart. His version was better.<br><br>In the original film - Lyon, played by JCVD, is down on his luck and comes across Joshua, a two-bit hustler/ fight promoter. They team up and make a splash in the underground, no holds barred fight circuit. In the end, Lyon must face Atilla and Joshua bets all of their money on Atilla to win! Lyon famously tells him \"wrong bet\" and goes on to defeat his foe.<br><br>In the new version - Shawn, played by Channing Tattum, is down on his luck and comes across Harvey, a two-bit hustler/ fight promoter. They team up and make a splash in the underground, no holds barred fight circuit. In the end, Shawn must face Evan and Harvey bets all of their money on Evan to win! I won't spoil it and tell you who wins in the new version.","user":"McNigel","rank":[42,50]},{"title":"Not a knockout !!!","rating":4,"date":"8 May 2009","review":"There seemed to be a positive attitude before the film started – which was given a helping hand by the \"star\" of the film Channing Tatum (who plays Shawn MacArthur) making a guest appearance before the film started to introduce the movie.<br><br>A bit of a poor man's Rocky, with (believe it or not) an even worse story. Delving into the seedy, underground world of bare-knuckle fighting – with no holds barred.<br><br>A new kid in town, down on his luck in the big City meets up with and becomes unlikely friends with a less than successful con man / fight promoter and his entourage of misfits and vagabonds. The fights get increasingly intense as each opponent gets bigger and stronger than the last, until the big showdown with a boyhood nemesis.<br><br>Meanwhile, as a sub-plot, the up-and-coming fighter tries to woo a club waitress by always turning up whenever she is around  alas, I suppose stalking has the same effect as a bunch of roses to some people today.<br><br>This was a poorly directed film, and the characters were pretty wooden, the story was very laboured and moved very slowly.<br><br>The redeeming features were some of the fight scenes (that were a bit on the brutal side), and the \"comedy\" performance of the girlfriend's Mother that kept popping into the room on the most inappropriate of moments! Although the fight sequences may be of interest to some – I would say that many others would find these quite off putting.<br><br>The film tries to save itself with some plot twists, but, unfortunately – you could see these punches coming from a long way off.<br><br>Channing Tatum in the opening introduction before the film started described the plot line of the movie as being loosely based on \"Midnight Cowboy\" – but it is a very loose connection both in story, acting ability or finished result – and this film definitely wasn't the winner.","user":"colin_coyne","rank":[42,58]},{"title":"Fighting leaves you battered, bruised and bored!","rating":3,"date":"18 May 2009","review":"Dito Montiel's film has been advertised as the 'Rocky of our generation', however I do believe they were referring to the fifth film in the Rocky franchise. Predictable, boring, tedious, lifeless are just a few words I could use to describe this film, but I really only need to use one; terrible.<br><br>Shawn MacArthur (Channing Tatum) is your typical working-class boy who is taken under the wing of an ageing con-man named Harvey (Terrence Howard) and given the opportunity to make his American dream come true by participating in various back-room bare-knuckle fights. Oh, and the stereotypical love-interest in the form Zulay (Zulay Henao) is also thrown into the mix. Now, despite this description describing various films from the last few years (never mind the last few decades), it contains three huge, jaw-shattering constraints: 1) Despite being named Fighting, the film ironically contains very little fighting or brawling in regards to its hundred-minute running time. And when we do get to see some face-bruising action, the Director seems to get incredibly giddy with the camera and what we are left with is some Paul Greengrass jerkiness that allows you to observe very little especially when the camera is thrown into the heart of the action.<br><br>2) Terrence Howard puts a little effort into his character and drags out a performance worthy of a film better than this, however Channing Tatum does not follow his lead. His stony expression and Brando-style mumbling is just plain annoying and unconvincing, yet he is the lead protagonist at the forefront of the film, and his performance drags the film down considerably.<br><br>3) Finally, Munic and Montiel's script has about as much weight as a feather and as punch as a fighter out-cold on the mat. We learn little about the characters until late into the film when there life stories seem to just be thrown around quickly to fill various plot-holes. While, the majority of the dialogue is just clichéd and cringe-worthy, most notably a scene at the end of the film that precedes the final fight sequence, which can only be described as hilariously idiotic.<br><br>Fighting is crime against cinema. It is a film which gives the audience absolutely nothing, yet takes from them their hard-earned cash in the form of their admittance fee. The only reason I can think why this film was distributed to theatres instead of being a straight-to-DVD affair, is down to the influence of having a star like Terrence Howard in the picture. Don't waste your time or money on this abomination.","user":"the_rattlesnake25","rank":[62,91]}]