[{"title":"Worth watching","rating":8,"date":"20 July 2014","review":"Great blend of action and comedy. I never felt that the humor and the small bit of romance (that they had to throw in to make the relationship between the two protagonists believable) detracted from the action. It seemed that every time I was about to think \"when's the next action scene\" the movie would stop the thought with a well timed laugh or another action sequence making me never feel like I was waiting for the story or the action to resume.<br><br>It was also refreshing to see Tom Cruise play a part that wasn't meant to be almost completely emotionally impotent. I've never before seen him play a character where his face actually SHOWED such a full spectrum of emotions. Cameron Diaz also runs a gamut of emotional and psychological states as she progresses from the sheltered, Midwestern blonde who's in way over her head to the semi-savvy (albeit awkward) companion/sidekick of a rogue spy trying to clear his name. <br><br>I found myself applauding at the end.","user":"carlin6580-679-396123","rank":[21,22]},{"title":"Not great, but solid fun","rating":7,"date":"17 June 2010","review":"Knight and Day\" is a comfort food movie. It's a pleasant diversion, a fun time at the cinema that doesn't ask a lot of of it's audience and offers an enjoyable ride. We've seen it all before, but it worked pretty well then, and it works pretty well now.<br><br>June Havens (Cameron Diaz) is an average perky blonde romantic comedy heroine who runs into the charming and mysterious Roy Miller (Tom Cruise) at the airport, and is sucked into a series of misadventures when Roy turns out to be a secret agent fighting rogue elements in his own agency . . . or maybe HE's the rogue agent . . . It depends on who she listens to. there's a mysterious device called the Zephyr that Roy is either protecting or trying to steal. All of this is fairly predictable, and, again, nothing new. But director James Mangold (\"Copland\", \"Walk the Line\", \"3:10 to Yuma\") always knows how to make a film play, and his skills haven't deserted him here. His pacing is brisk and fun, and he stages some terrific action (including one sequence from Diaz' point of view that did feel genuinely new).<br><br>Of course, this is a star vehicle, and whether you enjoy it will depend a lot on how you feel about Tom Cruise. Dismissing his personal life as utterly irrelevant, I find him to be a solid and dependable actor who does action better than almost anyone in Hollywood. And, here, he gets a rare chance to flex his comic muscles, and hie's quite funny (though too much of the best material is in the trailer). Diaz is pleasant, but tries a little too hard to be cute. And, occasionally, the film itself has the same problem.<br><br>But, overall, it's a funny little spy movie. part adventure, part romcom. Not destined for any Ten Best Lists, but enjoyable summer entertainment.","user":"ungy357","rank":[222,290]},{"title":"GOOD ACTION-COMEDY ROMANCE","rating":10,"date":"7 May 2018","review":"MINOR PLOT SPOILERS<br><br>The name Knight comes from the real name of Tom Cruise aka Rob Miller aka Matthew Knight. Plus he uses a toy knight to conceal an experimental battery that can power a whole city. I am sure there may be some other knight symbols, such as knight in shining armor etc., but the movie isn't designed to be that deep. Cruise bumps into Diaz (June) in an airport as they get on the same flight. After some innocent flirting Diaz goes into the airplane restroom and does some primping, trying to figure out how to hook up with Rob Miller (Cruise). While Diaz is looking in the mirror checking out her T&amp;A, Cruise is being attacked by everyone on the plane. Diaz comes out, has a drink with Cruise who explains that the pilots are dead.<br><br>Later in the movie Diaz attempts to have a serious conversation with her former bf. As she explains about the airplane, he ignores her and tries to talk about \"the relationship.\" The movie is filled with these numerous turn arounds, most of which come near the end. One chase scene reminded us of that \"Mission Impossible\" criticized impossible train explosion scene, as Cruise jumps to the wind shield of an automobile which Diaz is driving. Crusie jumps around building tops like The Phantom and at one point Diaz models a red bikini for us. Eventually Diaz gets into the whole spy thing and decides to take matters in her own hands. The movie is fun and clever. The action has impossible chase scenes, but what action movie doesn't. It would make a great date movie.<br><br>Occasional dropping of the F-bomb","user":"nogodnomasters","rank":[9,9]}]