[{"title":"Deep rapport","rating":9,"date":"25 May 2009","review":"To make a great documentary you must find a fascinating subject and follow it wherever it takes you. Tyson is such a documentary not just because Mike Tyson is a complex man, but because the filmmaker James Toback is his friend and becomes his collaborator. Toback provides plenty of historical footage of the fighter's turbulent career, but none of that would mean much if Tyson hadn't opened up to Toback's camera the way he did, looking squarely into the lens and telling his story as he remembers and feels it (and the visuals of Tyson talking are elegantly filmed). This is as close as you could get to seeing the world from Mike Tyson's point of view. But because he himself must admit that many of his actions are indefensible, you get a balanced picture. On both sides, Toback's and Tyson's, this is an exercise in trust.<br><br>Mike Tyson has the monumental sculptured features of some giant Pacific atoll tiki figure and he also looks like a thug. A Maori warrior facial half-tattoo enhances this complexity. He came from the worst kind of background, with hardly any parenting, growing up in a very bad part of Brooklyn in the early Seventies when New York was in terrible shape, a robber and a drug dealer. He was sent to a reformatory at the age of twelve. He had no kind of formal schooling, but when he talks, his vocabulary is ornamented with relatively sophisticated words, even if the syntax is a bit rough. This is a man who went very wrong, but not a stupid man.<br><br>It's a mystery to me what made Tyson such an incredible fighter when he was young. Perhaps the sheer ferocity of a terrified animal. Partly his monologue is a confession and one of his first revelations is that he has always been very afraid. But for boxing ignoramus like myself, scrutinize as I may the many early fights in which Tyson stages a knockdown right away and wins the fight, I can't see how he does it. He's big, strong, fast, confident, in great shape. But he's not the only boxer to have those qualities. What is his secret? That, the film leaves us to figure out for ourselves, if we can.<br><br>You don't have to be sympathetic to Mike Tyson to see that this is a tragic story. Tyson's mentor Cus D'Amato died and his world lost its center even before he had quite won the heavyweight title, though he was well on his way, and, at nineteen, the youngest ever to do so.<br><br>He married TV actress Robin Givens, who at first helped him with finances and housekeeping, but violent fights and public humiliation led to divorce, with Givens at first seen as the wrongdoer. At this point big-time black manager Don King entered Mike's life (his managers and trainers had all been white), and at first again King was helpful, but then began to manipulate and cheat, and soon he was in worse hands with King than he was with Givens.<br><br>Tyson did relatively very well financially, made millions and kept a lot of them, for a while anyway. He's a lot less rich now but he's not broke either; he says he never cared much about the money. He had a spectacular fight against Leon Spinks, a highly touted fighter, scoring a wining KO in the first 90 seconds. Then he lost the title to underdog James \"Buster\" Douglas. All this in four years, from youngest champion and role model rivaling Muhammad Ali to a battered and exploited loser. But not right away. He still had wins. But he was going downhill outside the ring.<br><br>Then he went to jail for rape. The story is cloudy but there's a lot of bad living around it. In the public mind, Tyson's rape conviction ruined his reputation and made him a target of late-night comedy. To the camera, he talks about some of the really ugly stuff that went on in jail, and his own time in solitary. Out after three years of a six-year sentence and evidently a Muslim convert, Tyson returned successfully to boxing.<br><br>However the film shows how eventually the motivation and focus and the will to train to superior fighting condition disappeared, and the glorious speed and rapid decisions of Tyson's first few years as a major boxer were never there. Since confidence was one of the keys to the success (fear or not), when the confidence, or the interest in the sport, really, is gone, the good fighting goes with it and the result is sad to see. A big surprise was Tysoh's defeat by Evander Holyfield. Disgrace followed the next bout with Holyfield when, however wronged by being repeatedly head-butted, Tyson successively bit both of Evander Holyfield's ears and incurred a $3 million fine and one-year suspension from boxing.<br><br>And of course this contributed even further to the utterly tarnished reputation and was further fodder for jokes. Tyson couldn't be spoken of in the same breath with Ali. And the film has more lurid material and scandalous behavior, brawls, a battle with Don King, cannibalistic threats to an opponent. Finally the film shows Tyson interviewed in the ring after a later fight saying he no longer wants to box; it's over.<br><br>As he speaks in the film, Mike Tyson is only forty. If he was in a room, you'd want to talk to him. In a brutish kind of way, he's highly articulate. He was a terrible husband, but he has a woman who has been a wonderful mother to his children, and he dreams of being a grandfather. Has he a chance to redeem himself? One can't say. But the power of Toback's film is that Tyson's vulnerability and openness balance the brutal story of triumph spoiled by hubris. This is a film that is both vivid and subtle. It achieves maximum sympathy but also maximum honesty.","user":"Chris Knipp","rank":[26,27]},{"title":"Iron Mike - for real.","rating":8,"date":"16 January 2009","review":"What a great documentary. For anyone who likes boxing, this is a must-see. You hear Mike talking, almost non-stop, throughout giving numerous details about his personal life. The techniques used to present the film were terrific, though it does require you to pay attention; at several points, Toback runs multiple moving split-screens - it's an interesting device as you are forced to \"follow\" the dialog as one screen box goes quiet as another picks up where it left off.<br><br>The fight footage is incredible. I felt like I was watching all this footage again for the first time.<br><br>Throughout, the viewer is given access to a side of Tyson I doubt any but his closest friends and associates have ever witnessed. At many points he chokes up, fighting back tears - it's an amazing thing to watch.<br><br>And there's a lot of laughs. I won't reveal them, but there is some really funny stuff.","user":"PureedMonkeyBrains","rank":[61,70]},{"title":"Wrong film?","rating":8,"date":"18 October 2008","review":"I think the person above has watched/reviewed the wrong film.<br><br>I've just got back from seeing this and it's purely a documentary featuring an interview with Tyson himself - no-one else, no actors.<br><br>I say 'interview' but you don't actually hear any questions asked - this is just Mike talking about his life/career almost as a monologue.<br><br>I thought it was a fantastic effort at just letting the user take from the picture what they want - there is no attempt to create a bias for or against Tyson in any way.<br><br>I never liked Tyson as a fighter/person but I realise having watched this that the person we saw tear up the heavyweight division in the 90s was a long way from the man himself. He now comes across as a humble man - though with few regrets.<br><br>The interspersing of his fights with his dialogue is superbly done - credit to the the direction of James Toback.","user":"Winkywoo","rank":[77,90]}]