[{"title":"Stays In Vegas","rating":7,"date":"24 March 2015","review":"Despite some bad rap this film is not really bad it just needs to be watch to understand.<br><br>What Happens In Vegas centers around Joy McNally (Played by Cameron Diaz) who travels to Las Vegas after being dumped by her fiancé Mason (Played by Jason Sudeikis) with her best friend Tipper (Played by Tipper)<br><br>Where the same time Jack Fuller (Played by Ashton Kuctcher) and Hater (Played by Rob Corddy) his best friend and Lawyer after Jack was fired by his boss/father Jack Fuller Sr (Played by Treat Williams). Unaware Joy and Jack ended up in the same room and end up after a one night stand getting married and when Jack used her quarter to win 3 million dollars. The Judge order them to make their marriage or they will never seen a dime of the money.<br><br>Which of course leads up to a series of events in the marriage. <br><br>Now the story is interesting and in a way original considering plus they have several creative humor in the film which makes you roll on the floor laughing and find yourself repeating.<br><br>Ashton and Cameron make for a interesting on screen couple through out the film and they do very well with making us laugh. Lake makes for a interesting best friend as does Rob.<br><br>The songs used in the film work as well as it helps the story in terms of story telling. The film is just not a classic but it is not a bad one either it is just one you have to watch to understand.<br><br>It has a original plot with some good performance from Ashton and Cameron so if you're curious give it a try.<br><br>I give What Happens In Vegas an 7 out of 10","user":"Terryfan","rank":[6,6]},{"title":"Enjoyable comedy without the usual Hollywood overkill","rating":6,"date":"9 May 2008","review":"I was in fear of going to see this movie.The reviews were appalling. At the last minute I relented and went expecting the worst. I was pleasantly surprised after 10 minutes my fears were dispelled and I actually started to enjoy the film. The basis of the film was predictable but the way the 2 central characters draw you in surprised me. They worked very well together and played off each other very well. Yes there are 1 or 2 silly scenes but it was still funny.<br><br>I think the best thing about this comedy was that it left it up to the audience to draw their own conclusions on the characters of the central characters without laying (on as Hollywood usually does)it on heavy with the romantic or schmuty character embellishment.<br><br>Just a funny story with 2 ( 4 including the supporting friends) very good comic actors. Give yourself a break its not overly typical Hollywood flick and I found it funny anyway ! PS I am not a teenager !","user":"quirke_j","rank":[137,203]},{"title":"Good comedy indeed!","rating":7,"date":"7 January 2010","review":"Recap: Both Joy and Jack has seen better days. Joy just got dumped by her fiancée, in front of all their friends, and Jack just got fired, by his father. They both go to Vegas to forget their miseries and after a drunken night out end up married, by mistake. But a 3 million dollar lottery prize complicates matter. But instead of giving them an annulment the judge orders them to stay married for six months, in order to get a part of the money. Now a bitter feud start where they try to sabotage for each other in order to get all the money for themselves.<br><br>Comments: A Hollywood blockbuster that actually works pretty well. It is funny, quirky and even if the main concept are unoriginal it has its own little fresh twists and turns. It got some really good jokes, and manages to hold a high level throughout the entire movie. It isn't just some small and few jokes that are funny, it is actually constantly funny. The best part however, is actually just after the story really ended, when they show what really happened in Vegas. Stay put and don't miss it, it got some good scenes after the credits too.<br><br>Ashton Kutcher and Cameron Diaz might seem like an odd match, but they work really well together. They really work as a pair, but don't forget that they both are solid comedians, veterans in these types of movies. And they certainly don't disappoint. But the supporting cast should get their credit too. The movies wouldn't be the same, not nearly as good without their partners in crime, played by Lake Bell and Rob Corddry.<br><br>I guess that this is something that almost everyone can enjoy, a perfect movie when there are different tastes. I suspect that most people out there will find this funny, because it is very well made, even though it is not an epic classic.<br><br>7/10","user":"Enchorde","rank":[5,5]}]