[{"title":"For a camp that supposed to rock no one can play instruments...","rating":3,"date":"21 June 2008","review":"I was very surprised at how bad they added the music to this movie. The scene by the water where he's singing to her with his acoustic where did the bass and background vocalists come from? Also the cast doesn't know how to lip sync to the songs, nor do they know how to play guitar (Peggy during her solo playing an E major almost the entire time up and down the neck of the guitar) and the strumming of the guitars never matched up to the music playing. The dancing sucked..one dancer looked like she was thirty. <br><br>The movie never had a beginning she wakes up sings...acts like she goes to school then boom she goes to Camp Rock.<br><br>This movie was great to make fun of...it seemed like Disney took recycled scripts from Hannah Montana and other Disney shows and made them into a movie that seemed to be poorly edited and unoriginal. The rich snobby white girl is overdone in ever Disney show and typical plot line to follow..they made the one Jonas Bros (the not so popular one..Kevin) and made him dumb and as flamboyant as Carson Kressley.<br><br>I'm sorry Disney but you could've put more time into this movie instead of rushing through it to make a quick million. Save your time people don't watch this.","user":"sillybilly21486","rank":[89,118]},{"title":"Preditable Mess","rating":2,"date":"21 June 2008","review":"The only reason I am giving this movie a \"2\" is because of the singing. The voices were very good, but the actors were not. Predictable roles: disapproving daughter, outcast, two girls ruled over by one \"teenage drama queen\", the cute troubled boy, and of course, the poor parents who happen upon giving their daughter (who is the disapproving)the chance of a lifetime. Disney movies are not what they used to be. I grew up on the classics; Sleeping Beauty, Little Mermaid, Cinderella, Snow White, and Aladdin. I did watch High School Musical, and was impressed. The sequel was a disappointment, but to be honest I only watched it to see Zac Efron. (a bit shallow, i know). I did watch Camp Rock, only because it was sooo heavily advertised and I wanted to see what the big deal was. High School musical was incredible for a few reasons: Little known actors who could really act, incredible voices, although predictable it was well scripted, cute people (shallow again), and left the audience with a positive message. Camp Rock, while incredibly predictable : SPOILERS!!!!! AHEAD:<br><br>-Poor Parents tell disapproving daughter she cant go to Camp Rock -Poor Parents tell disapproving daughter she can go to Camp Rock if she helps as a \"Cinderella\" in the kitchen with her mom -Disapproving daughter lies and lies and lies -Disapproving daughter is friends with hottie -Disapproving daughter is found out after hanging with the \"in-crowd\" -Disapproving daughter is dumped by hottie -Disapproving daughter gets into trouble by \"in-crowd\" leader -Disapproving daughter sings and in noticed by hottie -\"In-crowd\" leader is not all that tough -\"In-crowd\" wanna by leader sings and is crowned winner. (totally surprised by this honor OF COURSE!)<br><br>Camp Rock may have been better if the Jonas Brothers had not been apart of it. This may have been a publicity stunt, and they are just NOT actors. They can seriously sing. But COME ON! Disney has left me with two hours torn for me that I can never get back. <br><br>If you are contemplating on seeing this movie, let me make the decision for you; buy a couple of songs from the soundtrack and call it good. Don't waste your time.","user":"seniorrah08","rank":[32,42]},{"title":"Predictable Yet Entertaining","rating":6,"date":"20 June 2008","review":"Okay, DO NOT get me wrong. I love the Jonas Brothers and Demi Lovato to death but honestly, it feels like this film is missing something. I know this is supposed to be a Disney Movie and that it has been endlessly compared to High School Musical but I have to say that... High School Musical carries an element of magic that is missing from Camp Rock.<br><br>The songs are all catchy and entertaining and unlike the unpredictability of a musical, when the characters sings: It makes complete sense. The acting is mediocre, there were points where the actors delivered completely while in others, their ability comes into question.<br><br>The movie itself was relatively interesting and kept me vaguely hanging, even though there were times where I just got up and walked around (got food and refreshments). Shane Gray is a convincing jerk. Overall, you can see where the movie was headed from the moment it started. But it carries you through the movie and you believe that there is such a camp out there (which is something we all wish).<br><br>I NEVER said that the movie was bad, just predictable and half-hearted. But no matter what, THERE IS SOMETHING TO ENJOY. <br><br>Even though I was jealous of Demi Lovato when Joe Jonas sang to her lakeside. &amp; I had to pause my DVR when he got out of the lake because well... look at him.<br><br>Watch the movie and you'll find something you'll like but don't come in expecting Oscar standards.","user":"HollisterNights","rank":[47,65]}]