[{"title":"Handles tough issues with flair.","rating":8,"date":"9 May 2010","review":"80/100. This was so much more interesting than I was expecting. It tackles several issues and does so with finesse and without the over the top melodrama movies of this type so often have. It's touching, thought provoking and it is certainly not predictable. Nick Cassavettes deserves a lot of credit for creating a film that faces the issues without getting too maudlin and does so with sensitivity and objectiveness. The performances are good from everyone. The casting of Cameron Diaz isn't perhaps the best, but I admire the effort she put into the role. She did very well. The character development is outstanding, you get to know each character and you understand each of their perspectives. Joan Cusack is particularly affecting in an offbeat role for her. Good score, the subtle cinematography is effective.","user":"jazza923","rank":[19,19]},{"title":"This one's a keeper","rating":8,"date":"26 June 2009","review":"Nick Cassavetes is almost like a walking advertisement for Kleenex at this point. After such shameless melodramtic weepers like \"John Q\" and \"The Notebook\", I wasn't so keen on seeing \"My Sisters Keeper\", based on the book by Jodi Picoult. Yet, every once in a while, a chick flick comes along that touches the chick in every man.<br><br>Cameron Diaz plays Sara Fitgerald, who along with her husband Brian (Jason Patric), makes the decision of genetically engineering a child who will be a direct match to their leukemia-stricken 2-year-old daughter Kate. Abigail Breslin plays the engineered child at age 11. Her name is Anna, who since the age of 5, has had blood taken from her and been put thru medical procedures to help keep Kate alive. Anna loves Kate, played as a teenager by Sofia Vassileva, but when her parents want to give Kate one of Anna's kidneys, Anna finally says enough. Sure that no one is looking out for her interests, Anna hires a lawyer (Alec Baldwin) and sues for the right to her own body. Sara, a woman who has made caring for Kate her full-time job, is upset while Brian understands. Meanwhile, Kate feels guilty that her disease is tearing the family apart.<br><br>Cassavetes and co-screenwriter Nicholas Leven are dealing with a straight-up tear-jerker here but it's astonishingly free of heavyhandedness and it cuts deep with probing questions and real emotion. These are characters with feelings and concerns, torn between such complicated issues as saving a daughter by experimenting with another, sacrificing your own body even though you know it will diminish quality of life, and dealing with how a disease can burden a family. The movie uses flashbacks (such as Kate being diagnosed as a young child, her parents being given the choice of invitro, and a very young Anna disturbingly forced into operations) and forwards (Kate lying in a hospital bed, looking at a scrapbook of her family) that add dimension. As do the switching of narrators, each character getting a chance to offer their points of view and feelings about how the diagnosis, and everything after it, has effected them.<br><br>Unfortunately it's also going in a lot of different directions, and add in a dyslexic and lost-in-the-shuffle brother (Evan Ellingson), and it's sometimes hard for Cassavete's to keep track of all of them. The second act, in particular, has very little to do with the Sara-Anna conflict and the more light-hearted scenes, such as the family frolicking happily on a beach together, seem odd because you feel like there is some contentiousness between Sara and Anna that really doesn't come out til the ending courtroom scene.<br><br>However these are small problems rendered almost excusable by powerful performances. Abigail Breslin has surpassed Dakota Fanning in all-out maturity, juggling her characters fears for her own well being with the remorse of not being strong enough for her sister. And Diaz is strong-willed but obsessive, perfect as a one-track minded mother so intent on trying to keep one daughter alive that she's not even thinking about anything else. Jason Patric is the open and understanding father and Alec Baldwin is good comic relief, playing a lawyer so cocky, he sued God. And Sofia Vassileva is nothing short of powerhouse, her heartbreaking performance rising above all the cancer make-up and bloody vomitting and nosebleeds to find Kate's burdensome guilt and brave soul. And only stone-hearts won't share in her joy as she gets dressed up and goes to prom with another terminally ill boy (Thomas Dekker).<br><br>I'm not saying this movie isn't a cheap excuse to make you cry, but as far as cheap excuses go, this one is richly made. \"My Sister's Keeper\" is as surprising and heartfelt a piece of work as I've seen all year long, and the acting is about as good as it comes. With this and his previous, \"Alpha Dog\", Cassavete's signals himself as a real filmmaker as he rarely ever hits a false note. In a year filled with movies that I've seen fail at finding the humanity in their stories, this one is a keeper.","user":"C-Younkin","rank":[101,123]},{"title":"Good movie, fails the book","rating":5,"date":"8 July 2009","review":"If you've read My Sister's Keeper, you'll be disappointed. Was the acting good? In some cases great! Kate's character will probably get an academy nomination if not an award. Everyone did a great job as far as performances are concerned. HOWEVER,Hollywood made some big mistakes here that some of us won't forgive them for. For the sake of time, which is money, I understand clipping portions of the story that neither make or break it. Taking away the attorney's (Campbell Alexander) ex-girlfriend was understandable (but sad), but downplaying Jesse's arsonist revenge against mom and dad, which highlights how angry he is at being deserted in sissy's favor, is just plain wrong. There was too much time wasted on extended family involvement and not enough given to some of the other characters, including dad. We get the gist he's a fireman, but his role in the book was much more important than that. And as to the ending? HOW DARE THEY? The most important message in Jodi Picoult's story is how ironic/tragic it was that Sara worked so hard ruining Anna's life to save Kate. She could have loved Anna to nth degree while helping Kate but wastes so much of their lives, hoping for something that appears to be impossible. Then, when she begins to see the light and time for goodbyes have come, Anna \"dies\" in the auto accident and becomes a kidney donor for Kate after all--allowing her to live after all--and removing Sarah's opportunity to love Anna forever. Was it painful? Yeah! Was it a warning to all human beings who need to remember to love while you can and not take things for granted. Yeah! Did this movie deliver? No. Not for me. Was it a good movie for itself? Sure. Enjoy it. As for me (and Jodi Picoult), I'm just disappointed. Had they left the story intact and kept the \"messages\", both the obvious and the more subtle intact, I think this could have been an academy award movie. As it is, I think it will just go down as good.","user":"stietjen-1","rank":[44,53]}]