[{"title":"Ice Age 3 is the return of true family films","rating":10,"date":"11 July 2009","review":"Ice age 3 was really funny and it stays true to the series. Same old characters, a whole new adventure that everyone at any age can enjoy.<br><br>I saw the critics and I thought to my self that it would be good, but I didn't expect much, but I really did enjoy it more than I thought. It may not be the best compared to the other Ice Age films, but it still a great thrill ride that the audience can enjoy.<br><br>And if you find a theater near you that has it in digital 3D, go and watch it in 3D, because the action and adventure will excite you even more than it actually does.<br><br>Normally people think since it's a third part, then the movie won't be that great, but hear me when I say that keep that thought out of your mind and parents, take your kids with you, they are sure to leave with a smile and a long lasting excitement for more.<br><br>100% enjoyable, its a 10!","user":"bearfaceproductions","rank":[76,106]},{"title":"A Joyous Delight","rating":8,"date":"1 July 2009","review":"I haven't had so many laff-out-loud moments in a movie for a long time. There's about an even mix of verbal and visual gags in this 3rd installment of the Ice Age family saga, they're all fresh instead of hackneyed, and they all work. You wouldn't think a film set in the age of mammoths would be able to run a parody of the old \"red wire vs. blue wire\" time-bomb scenario, but they find an ingenious way to do it.<br><br>Now those among you who haven't fallen prey to creationism are well aware that mammoths are very large mammals (and hence quite recent in geological time), while the last of the dinosaurs went extinct 65,000,000 years ago. So how does the plot explain their coexistence? Well, it seems that there's this entire hidden tropical world underneath the eponymous ice, and our heroes literally fall into it. (Don't overthink it.)<br><br>Suddenly Manny the mammoth and his pregnant mate Ellie discover that they're not only not the largest creatures on Earth, as they'd thot, but actually pretty petite compared to the Mama T. Rex, who in turn has to look up to Dad. It's a classic tale of nature red in tooth and claw, except for nobody actually getting eaten. (Well, several critters are swallowed whole but subsequently disgorged, slimy with saliva but basically unhurt; family film, y'know.)<br><br>The animation is terrific. Judging from the end credits, apparently the Astor beaver trade, long thot to be extinct, has experienced a renaissance in the animated-fur factories of California. Dino babies and mammal kids are ridiculously endearing. The 3-D is likewise terrific, well used where appropriate (especially in conveying a sense of scale for the underworld) but not overdone. The one carp I have is that 3-D simply does not lend itself to dissolves between scenes; I'm guessing the filmmakers figured this out themselves, as most of the time they used cuts.<br><br>The characters, familiar now from the 2 previous films, are well acted with distinctive personalities, and the comic-relief possums have an expanded role. New to the cast is Scratte, a long-lashed female squirrel who, in a running subplot (including mini-cartoons to both start and end the flik), vies with the iconic acorn for the undying devotion of Scrat. As a devotee of the tango, I particularly appreciated their version of it. Also new is Buck, a bold, intrepid, 1-eyed buccaneer of a weasel, voiced by Simon Pegg with British accent in full flower.<br><br>Really, it's amazing to realize how much stuff they managed to cram into barely an hour and a half. Never a dull moment, never a missed step. Why, then, does it not get my top rating? Not at all because, as a comedy, it doesn't deserve to be taken seriously. After all, Dogma was a comedy, and it maxed out on my rating scale. But Ice Age 3 wasn't quite an entire story, more a collection of loosely related parts. Every one of those parts was well done, tho; indeed, I'd gladly take any of them over the entire 2.5 hours of the noxious Transformers; sadly, this much better film probably won't do nearly as well at the box office. Too bad.","user":"RichardSRussell-1","rank":[80,116]},{"title":"Ice Age 3 delivers the goods, and appeals to grown-ups and kids alike","rating":9,"date":"28 June 2009","review":"My wife and I attended an early press screening for the third Ice Age installment two weeks ago and had a wonderful time. The film easily tops the second outing of the series, and is right on par with the first - with just the right mixture of new characters and settings vs. the older ones we've all grown to love (especially Scrat. I can watch a whole movie with this guy).<br><br>This time around, Manny and Ellie are expecting a baby mammoth, something that leads to unexpected responds from Diego and Sid. When Sid decides to become a parent himself in return, he steals three giant eggs he accidentally bumps into, only to later realize they're dinosaur eggs that belong to a pretty angry mother. When mother-dinosaur kidnaps Sid, it's up to Manny and friends to return him home safely. Adventures ensue as they find out that underneath their icy world lives a land filled with enormous and sometimes menacing dinosaurs, one which our friends would need to cross in order to rescue Sid.<br><br>Ice Age 3: Dawn of the Dinosaurs is cute but not insulting, the visuals are stunning and if you forgive the obvious historical loophole (there were no dinosaurs during the Ice Age) you can actually have quite a good time. The dinosaurs add a lot to the plot, and there's actually a very cool, nice sense of adventure throughout the film, one that was somewhat missing (in my opinion) from the previous installment. All this adds to a fun and thrilling experience - alongside the visuals, jokes and general good atmosphere.<br><br>To sum things up - Ice Age 3 is an above average animated film, that'll appeal to grown-ups and kids alike. I gave it 9 out of 10.","user":"saarvardi","rank":[94,140]}]