[{"title":"Just Giant Piles of Fun!!!","rating":10,"date":"5 September 2019","review":"In certain corners of the internet there's an Orthodoxy around media and cartoons in specific. Especially with Scooby-Doo.<br><br>Someone will declare a thing to be good or bad, and those are the only choices, and those who follow the orthodoxy will mindlessly repeat the declaration w/o really being able to explain why they feel this way about the thing.<br><br>According to the Scooby-Doo orthodoxy, the first 4 Scooby-Doo movies, Zombie Island to Cyber Chase, are the best movies ever, and the new ones are trash.<br><br>The orthodoxy could not be more wrong. The early movies are fine, but the current stuff has the creative teams firing on cylinders. The recent Kiss and Batman films (as well as Tom and Jerry Spy Quest) are some of the best, most exciting and most imaginative animated films ever. And all of the fun.<br><br>And Return To Zombie Island is no slouch either. We more or less start with Elvira taking on Vincent Van Ghoul's role in the Mystery Incorporated series, and Boris Kreepoff in the final episode of The 13 Ghosts of Scooby Doo, as host of a TV show that shows horror movies. And she sends the gang off on their vacation where the three have promised Shaggy and Scooby that they won't find a mystery.<br><br>This movie doesn't have any of the \"Gritty Reboot\" flexing of the original movie. This movie doesn't think there is anything wrong with Scooby-Doo that needs to be fixed with a \"Gritty Reboot\".<br><br>This movie isn't as scary as the gator people or the zombie kids in the first season of Mystery Incorporated, but parents should probably watch it with young kids the first time to reassure them it is all fake.<br><br>2 characters spend a lot of time with the gang and both of their names are references to things. One refers to a character played by Lee Majors and the other is a whole very interesting thing that went from 1968-2000 and even had a movie about it and named after it in 1998. (No Spoilers)<br><br>One of the insults that the orthodoxy likes to hurl at projects they don't like, especially this one, is \"Lazy\". Hanna Barbera is known for their cost cutting measures. Characters have collars or other neck lines to avoid having the animators redraw the whole body every time when they can just redraw the head. Often crashes and fights happen off screen and you see the aftermath. And movement is usually in 2D left to right, or occasionally right to left, but pretty much never in any direction. So I was shocked when in an early scene the gang runs right at the camera. And there are several occasions when they were showing off their not cutting of corners.<br><br>This movie was an utter delight from beginning to end which was great after seeing people endlessly bash the film online before most people could even see it.","user":"mickdansforth","rank":[74,110]},{"title":"It's good, even if not what we asked for","rating":9,"date":"4 September 2019","review":"As a direct sequel to Scooby Doo On Zombie Island, it doesn't work. As a Scooby movie on its own, it's amazing. There's a lot of callbacks to various Scooby projects, and it's just plain fun to watch. I would've made a different commemoration for Scooby Doo's 50th anniversary, but I still think it does the job.","user":"blytheandferb","rank":[34,52]},{"title":"Underwhelming","rating":1,"date":"18 November 2019","review":"There was no continuity to the original Zombie Island. It felt cheap. Plus, the original plot was completely disregarded which made no sense. It makes no sense! I was just disappointed.","user":"angelg-85899","rank":[9,12]}]