[{"title":"Probably the most misunderstood film of this decade","rating":12,"date":"12 March 2008","review":"Given the vast majority of major criticisms levelled at this film, it would appear that a large percentage of the audience has completely missed the joke, or simply, didn't find it at all amusing. With Death Proof (2007), Tarantino creates such a loving homage to a notoriously cult cinematic sub-culture that many people seem unaware of how to approach it or even how to appreciate the sheer fact that the film purposely goes out of its way to ape the style of late 60's and early 70's exploitation cinema in look, feel and content. The film isn't meant to be taken entirely seriously, but rather, is a parody and/or pastiche of the kind of films that the vast majority of mainstream audiences simply wouldn't want to see. I'm talking about films such as Two-Thousand Maniacs (1964), Ride the Whirlwind (1965), Manos: The Hands of Fate (1966), Satan's Sadists (1968), The Big Bird Cage (1971), Boxcar Bertha (1972), Fight for Your Life (1977) or Satan's Cheerleaders (1977); low-budget films made with often-non-professional actors, little in the way of conventional film logic, and highly controversial in terms of plot, theme and content.<br><br>It also sets out to pastiche the \"grindhouse\" cinema phenomena, with the original idea of two films being shown as a double feature at drive-in movie theatres from state to state, with both films often being re-cut and re-edited, not by the filmmakers, but by the theatre owners themselves. This is evident in the amusing switch in title; with the film opening with the caption 'Quentin Tarantino's Thunderbolt', before awkwardly cutting to an obviously out of place title card with 'Death Proof' crudely emblazoned across the screen. This is also the explanation for the purposeful mistakes in continuity, the sloppy editing and the switch between colour and black and white, as well as the façade of severely deteriorating film stock. It's not sloppy film-making, but rather, a purposeful appropriation of sloppy film-making geared towards appealing to the kind of obsessive movie aficionado who gets the references and can appreciate the joke that Tarantino is attempting to pull.<br><br>With this in mind, it seems hard to understand what people are complaining about. Do audiences actual expect this film to keep them enthralled and entertained when the vast majority of them would balk at experiencing many of the low-budget, semi-obscure films that influenced it? Hardly! The accusation here that \"nothing happens\" is fascicle. The fact that there is film running through the camera is proof enough that something is happening, with the hilariously bland dialog deconstructing the film in much the same way as the purposely amateurish composition, editing and sound all intended to fracture the cinematic language in the same way that Godard did; by reminding the audience that this is the film and the point of the film is to experience the sights and sounds that unfold before us. Added to this the colourful iconography, the music, the characters, the girls in tight t-shirts, the for once entirely justified performance from the man himself, all reminding us that this is a joyous, darkly comic romp in which the point is not \"why?\" but \"why not?\".<br><br>The effect is reminiscent of Kill Bill (2003), which at times felt superficial or perhaps even too knowing for its own good, but still demonstrated to us the filmmaker's great use of tone, texture, colour and movement, as well as turning many people on to a whole new world of cult Japanese cinema; from the works of highly individual filmmakers like Seijun Suzuki, Kinji Fukasaku and Takashi Miike, to cult performers like Sony Chiba. Death Proof attempts to do something similar with the likes of the American revisionist road movie, the B-cinema of Roger Corman and the femsploitation subgenre of films like The Big Bird Cage (1972), Caged Heat (1975), Day of the Woman (1978) and Ms. 45 (1981); a coolly ironic series of films in which wronged women take bloody revenge in an often elaborate and over the top style, chiefly intended to give a feminist slant to the still rampant degradation and misogyny prevalent in the exploitation genre.<br><br>Other reference points are more obvious as they're mentioned explicitly in the film; notably car chase cinema such as Vanishing Point (1971), Two-Lane Blacktop (1971), Dirty Mary, Crazy Larry (1974), Gone in 60 Seconds (1974) and even Spielberg's Duel (1971). Some have complained that the film fails on account of its lack of action and emphasis on dialog and technique, but this seems churlish when you think of the films being referenced; with Vanishing Point featuring a number of cryptic, desert-set sequences in which characters talk and talk and talk, while Two-Lane Blacktop punctuates its scenes of hard driving and drag-racing with much in the way of meandering small-talk. Then we have the fact that films like Reservoir Dogs - which takes place almost entirely within a single setting - and Jackie Brown - which places emphasis entirely on character - use dialog to not only create the characters but to also tell the story.<br><br>Regardless of this, Death Proof is meant as a piece of entertainment. There's no real desire here for Tarantino to prove what kind of filmmaker he is because he's already done that with the number of great films that came before. Sure, it can be seen as self-indulgent, but surely those of us familiar with the style of film-making being referenced here will revel in this particular kind of extravagance, loving everything from the continually inane female banter to the awesome scenes of high speed carnage. If you're not a fan cult cinema or exploitation cinema or indeed a devotee of Tarantino's work then this film really isn't going to impress you. There's no shame in that. Some films are made for a niche audience, destined to be a cult in their own right. However, for those who get it, Death Proof has the potential to be a truly exhilarating, one-off piece of film-making.","user":"ThreeSadTigers","rank":[510,723]},{"title":"One of the most underrated films!","rating":9,"date":"22 August 2015","review":"I honestly think Death Proof is one of the most underrated films at the time I'm writing this (2015). A lot of people on this board seem to complain about the dialogue or the delivery of some of the actors. I personally think this movie has a lot of punch with a strong car chase sequence, very good actors, well-written script....and a perfect soundtrack!<br><br>I really like how the first part of the movie is a classic slasher/horror movie and the second part is a great throwback to \"car movies\".<br><br>Death Proof came out in 2007 and I remember watching this movie with my friend and having a really good time. I watched the movie another time a few years later and really enjoyed it to for other reasons, especially the classic car chase sequence. <br><br>Now it's 2015, I've just watched Death Proof for a third time and it's still a blast to watch. The music is perfect, the movie is very funny, and I love the performance from Kurt Russell, Sydney Poitier (Jungle Julia) and all the other supporting characters.<br><br>R.I.P. Sally Menke, I really love her work on this movie...not only for the great grindhouse \"jump cuts\" but also for one of my favorite scene halfway through the movie that I won't mention and the awesome 11-min well edited car chase.<br><br>I gave the movie a strong 9/10 and I hope this movie will have a better reputation 5-10 years from now. Great work from Quentin Tarantino!","user":"Matt-Canalcon","rank":[64,88]},{"title":"Dead Women Talking","rating":1,"date":"16 September 2007","review":"I love movies in general. I love obscure B-, C-, and Z-movies in particular - the dumber the plots and the less coherent, the better.<br><br>When I first heard of Death Proof, I was therefore understandably excited. Tarantino is undeniably a pro director, and though I personally think his trademark elements - bizarre dialogue about pop culture, foot fetishism - are somewhat annoying, I was willing to give him a try. He couldn't possibly screw up a movie that is SUPPOSED to be bad, I thought.<br><br>Suffice to say, he could. Oh, how he could.<br><br>We begin our long and arduous journey through the demented mind of Quentin \"I made two cult classics in the early 90s and am therefore beyond criticism\" Tarantino by joining a motley crew of four young women on their way to a local bar, tended by none other than Tarantino himself in an utterly pointless cameo role. Then, nothing happens. Twice.<br><br>I'm serious, the first hour of this movie (it might have been less but it certainly didn't feel like less) consists of absolutely nothing else but four women, whose admittedly good looks cannot mask the fact that they are about as intriguing to watch as display dummies and slightly less entertaining, drinking in a bar and talking.<br><br>What they are talking about, I have no idea. I really cannot remember a single sentence of note said in this torturous first hour (for the protocol, I cannot remember anything said in the second half either), but I am fairly sure that it involved some kind of prank about a lap dance one of them (don't ask me for the names) pulled on one of the others.<br><br>After meeting Stuntman Mike, whose introduction moves at about the same snail-paced crawl as everything does in this movie, and another twenty minutes of talking and an embarrassing lap dance, we finally get to the \"action\" part of the movie. The use of quotation marks is deliberate, since the much anticipated murder scene (didn't I tell you? Stuntman Mike is a serial killer using his car as a weapon. Don't ask why, though - there is no explanation given) consists of two cars crashing headfirst and what amounts to about three seconds of gore.<br><br>Cut: Stuntman Mike is hospitalized, but alive and kicking. The four broads are not. Throw in an absolutely pointless scene with two absolutely pointless policemen, which I'm sure is another one of Tarantino's look-how-subtle-I-am references/homages/ripoffs to/from himself.<br><br>Cut again: Four shallow and irritating women sit in a car and talk boring nonsense, interlaced with four letter words to boost the as yet slightly neglected \"controversial and provocative\" aspect of this movie. After another hour of talking - mind you, this time, it's an entirely different deli! Nobody can accuse Tarantino of repeating himself! - Stuntman Mike appears and starts bumping into their car for no discernible reason.<br><br>A car chase ensues, mostly consisting of the two cars driving alongside each other at high speed, with the women yelling at Stuntman Mike to cease the hostilities - during the chase, one of the girls lies on the hood and has some difficulties maintaining this condition - and for some reason refusing to, uh, stop their own car and thus prevent their friend from falling off. <br><br>After finally gaining the upper hand on Mike and wrecking his car (not so death proof now, is it?), they drag him out and beat him to death. That's it. The end.<br><br>I hate this movie. It's an insufferably boring and egomaniacal mess and there is absolutely no reason to see it. It's not funny, not even unintentionally so. It's not scary. It's not interesting, not over-the top surreal, nothing. There is no gore, no monsters, mutants, freaks, demons or at least a cool villain to hold your interest (Kurt Russell wasn't bad as an actor, but to call his character two-dimensional would be an exaggeration), there isn't ANYTHING in here that makes a good B-movie entertaining . Avoid it at all costs.","user":"MrGoodB","rank":[398,675]}]