[{"title":"Good Grief!","rating":8,"date":"27 February 2013","review":"How did they pitch this? QUARTET meets CALENDAR GIRLS? Vanessa Redgrave plays a Senior Citizen (in the north of England) dying from cancer who somehow finds the strength to sing with a local choir of fellow OAPs. Her grumpy old git of a husband (Terence Stamp) wants her to stay home and greet the Grim Reaper while he (Arthur) tenderly cares for her, but - guess what? The sub-plot involving Arthur and his estranged son (Christopher Eccleston) is over-familiar but also touching - he even has a cute smarty-pants daughter cloned from Shirley Temple.<br><br>OK, this is a very predictable story which shamelessly milks tears from the audience, but there is some pleasing humour as well as the somewhat heavy-handed tragedy. The performances - what did you expect from Redgrave and Stamp? - are nothing less than stellar. I see nominations for BAFTAs and maybe even next year's Oscars. Stamp gives perfectly judged grief. Gemma Arterton is excellent as the choir-mistress with an unhappy love life and it's a joy to see Anne Reid in the chorus line. All the supporting cast of yesteryear character players are splendid, as they were in QUARTET. Pensioner power is beginning to have an impact at the box office - about time too!<br><br>This is lightweight entertainment pitched at the Grey Pound and it is outrageously mawkish, but it sets out to warm the stoniest of hearts and it certainly warmed mine.","user":"davidgee","rank":[44,46]},{"title":"You'll be walking out of the cinema with a warm smile on your face.","rating":8,"date":"8 March 2013","review":"In his directorial debut Paul Andrew Williams gave us an impressive, gritty and bleak crime film, London to Brighton – a film shot in just 19 days on a budget of £19,000. In his latest work he goes on the complete other end of the spectrum to deliver us a heart-warming comedy-drama, Song for Marion. When looking at its exterior, most would easily jump to labeling it a sentimental film which it's one motive is to get you blubbering. It certainly succeeds in getting you to shed tears, but this is through the film's well developed relationships between the characters, especially that of Marion (Vanessa Redgrave) and Arthur (Terence Stamp). Marion is terminally ill and is cared for by her grumpy husband, Arthur – he reluctantly helps fulfil her wishes to attend local OAP choir sessions headed by a young music teacher, Elizabeth (Gemma Arterton). But of course as Marion's health begins to fade, Arthur finds himself becoming more and more desperate about the inevitable prospect of being alone without his beloved wife. This prompts him to become more involved in the choir's sessions, which builds up to the group's entry into a national choir competition – a beat very much in the vein of the 1996 film, Brassed Off.<br><br>The on-screen chemistry between Redgrave and Stamp is heart-wrenching; it's hard to fight back those tears as the two comfort one another during Marion's final months. But it's when Arthur finally confesses to Marion that he's scared about being without her that I finally let the tears subside – it's just beautiful stuff. Redgrave's singing performance of True Colours and Stamp's final belting delivery of Goodnight My Darling will also leave you and the theatre audience in a quiver of snivels. But on the side there is very funny and touching moments with the choir themselves which mix in well to not make you an emotional wreck for the majority of the film. Christopher Eccleston is effective on the sidelines as Arthur and Marion's son who struggles to bond with his stone-walled father. I felt Eccleston was slightly underused, but nonetheless enjoyable in the scenes he had; meanwhile Arterton is sweet and caring as Elizabeth, who tries hard to break down Arthur's cold exterior in order to get him involved with the choir.<br><br>This is a splendid British picture – Paul Andrew Williams proves here that he can tackle pretty much any genre, and if you take a look at his other genre films, you'll see that the man certainly has the knack – He's done horror, crime and now a beautiful British comedy-drama. The performances are splendid, the comedic and teary moments are balanced perfectly – but ultimately what makes the film work is that it doesn't try to break you down into an emotional wreck, it merely presents its characters in situations; bonding, caring and helping one another through the tough times. This is the kind of British film we need more of – you'll be walking out of the cinema with a warm smile on your face.","user":"tomfoster-2","rank":[30,31]},{"title":"Please see this movie!","rating":8,"date":"11 February 2013","review":"I was lucky enough to have free tickets for the preview screening. To be honest, if it wasn't for free, this movie would not have been a movie that I would choose to pay to watch. I am 24 and I don't think I would be interested in watching a movie starring with some oldies but I was totally wrong and I am so glad that I had gone to watch this movie. AND I WILL PAY TO WATCH THIS AGAIN! <br><br>This movie has a very simple storyline, but this story relates to all of us somehow. Many of us have had loved one(s) passed away and surely the hardship and grievance that Arthur has been through is not new to us. And the troubled relationship between the father and son.<br><br>It is this simple story with just good acting. It will make you cry! Not because of sadness but because of love. I don't see many people without a tissue wiping their eyes and noses during the movie. And this is what good movie does to you! <br><br>Please go and see this movie. You wont regret it.","user":"Erica_li_7","rank":[45,50]}]