[{"title":"A Good 7 Stars","rating":7,"date":"9 December 2019","review":"Truth be told, I'm a Hallmark guy. I love their Norman Rockwell-esque style. But Lifetime did pretty well with this movie! It was engaging, enchanting, and an excellent way to relax and put the day behind you!<br><br>Every role was excellently cast and the main characters are people you quickly fall in love with and want the best for. The Jewish faith was beautifully and respectfully portrayed, which is a nice change of pace coming from Hollywood.<br><br>I would have rated it 10 Stars but the movie completely ignored Christianity's view of Christmas. Instead, the woman learned about Hanukkah and the Jewish faith while the Jewish man learned about the generic, commercialized view of Christmas. No Christ, no Jesus, no nativity scene... just non-religious traditions. This would be fine but it lacked balance, comparing secular traditions with the Jewish faith. This does NOT surprise me about anti-Christian Hollywood. So it's not actually people from two different religions learning about each others Christmas/Hanukkah rituals.","user":"thegarbagecan-65646","rank":[9,11]},{"title":"What a Delightful Holiday Movie!","rating":8,"date":"8 December 2019","review":"Not sure which movie title this film is using..I saw it as Mistletoe and Menorahs on Lifetime Channel and was absolutely enchanted! The premise of the story is politically so relevant in today's culture. The two leading characters come from different religious backgrounds and each needs to learn about the other's religious traditions in order to impress someone in their life. Bravo to Lifetime for addressing the reality that there are different religions celebrating this season! The female lead needs to learn about Hanukkah and the male lead needs to learn about Christmas. Of course, we know that no matter how this adventure unfolds, it will end happily with a kiss. But on its way to that ending, the lessons learned are portrayed beautifully and respectfully, with both religions being learned about with joy and warm emotions. There is an abundance of historical meaning explained regarding both religions and their traditions.\nThe leading couple are two of the most attractive to be featured a holiday movie in a very long time. The heroine is not only beautiful, but is portrayed as intelligent, serious, not frivolous and giggling as so many holiday movie heroines are portrayed. Her smile is dazzling! The leading man is a new face for this viewer, handsome, with sparkling eyes and a really attractive personality. One wishes to see a great deal more of this actor.\nThe movie also ventures into yet another new territory, in that it portrays a gay marriage between two of the male characters..The relationship is presented with love, dignity and maturity. There is not one second of any inappropriate dialogue or characterization. Bravo to Lifetime for bringing its viewers into the 21st century!\nThe only characterization in the film that was a bit over the top was that of the Jewish grandmother, whose mannerisms and intonations were a bit of a caricature. She was lovely looking but somewhat excessively portrayed.\nOther than that, this is a glorious holiday film for everyone, and should be on a 'must see' list for this season. It is also appropriate for children to watch as the lessons it teaches about religions other than ones own are beautifully taught. I will watch it again.","user":"omijer","rank":[11,15]},{"title":"MISTLETOE AND MENORAHS","rating":9,"date":"9 December 2019","review":"Congratulations Lifetime, Kelley Jakle, Jake Epstein and cast and crew for making a beautiful story about Hannakuh, Christmas, showing how traditions are different. but the love of family is still the same. I really enjoyed this movie.","user":"amyrenea-07089","rank":[7,9]}]