[{"title":"why did this bomb?","rating":9,"date":"29 July 2009","review":"I watch a lot of films. I'll watch anything from a slasher fest to some weird arty film that videos bookshelves (well almost).<br><br>Last year I pretty much watched every romantic comedy in existence, as that is all my (male) house-mate would watch. I'll watch anything but I've seen enough to know the dire ones (well, we all have our own opinions).<br><br>I really enjoyed this film. Maybe it is because I expected it to be really awful. Maybe I got seduced by the good cast. Or I really am a secret girly girl and just thought all the shopping was fabulous.<br><br>But seriously, how did this get _that_bad an IMDb rating? I mean, I actually thought it was better than the Devil Wears Prada, which I thought was a bit of a let down. OK, the script is not original but it doesn't contain any big clangers and it doesn't try to hard. There is no wooden acting. No moments of cringe worthy awfulness, and some good cast chemistry. No, if you want to see a bad big-budget rom-com I still maintain Wimbledon is awful. Paul Bettany and Kirsten Dunst looked completely indifferent to one another.<br><br>As for being disappointed about books. Sheesh. If you love a book never go see a movie (e.g. Atonement) or accept it is going to be completely different.<br><br>Confessions is utterly predictable, but the characters and actors are kooky in a lovable non-Oscar lusting way. Its like cheap chocolate-you know it has hardly any rich content but you keep going back.<br><br>F*** it. I really like this movie. Not quite as much as Fight Club or Dawn of the Dead, but its moving up there. Seriously.<br><br>Now if only they'd do a sequel involving Christina Ricci and a load of blood...","user":"kaj-37","rank":[39,50]},{"title":"Confessions of a Shopaholic-aholic","rating":8,"date":"8 March 2009","review":"I confess. I fell for the Shopaholic. Isla Fisher is charming, funny, adorably goofy yet undeniably attractive. You can't help but notice her uncanny resemblance to Enchanted's Amy Adams, which is not a bad thing at all, yet she still maintains the same unique kookiness we all enjoyed in her role as Vince Vaughn's equal in The Wedding Crashers. The incredible job on the CGI'd mannequins, done by Lucasfilms' Industrial Light &amp; Magic, is also worth mentioning.<br><br>You're not supposed to go into the movie expecting it to be the next epic Titanic love story. You're expecting it to be goofy and sentimental yet genuine and entertaining, and it was all those things.<br><br>Confessions of a Shopaholic is a rare gem that's worth the guilty swipe of a maximized credit card.","user":"misterembryo","rank":[73,102]},{"title":"Becky Bloomwood's Alright with Me","rating":7,"date":"9 March 2009","review":"I have been a longtime fan of the Sophie Kinsella Shopaholic books, which feature the lovable but compulsive Becky Bloomwood. So I wasn't sure what to expect out of the movie version.<br><br>Rebecca Bloomwood is a lovely redheaded young woman who loooooves to shop. I am not talking about the reasonable kind of love where she goes monthly or even weekly to see what's new at her local boutique. I am talking about an addiction as powerful as any drug out there. When she walks past a store, the mannequins talk to her and convince her that this, only this, particular item has the power to make her feel better, more attractive, more alive. She shops using 12 credit cards, including her Gold Card, which is encased in a block of ice in the freezer in case of emergencies. The tone of the film is comic, so it's not a tragic type of addiction, but we understand that Becky has a problem and she needs some serious help.<br><br>Rebecca also has her own personal bill collector stalker type person following her around named Derek Smeath. All told, she owes Mr. Smeath some $16,000. After losing her job as a journalist, she decides to apply for her dream job: fashion correspondent for Alette magazine. For Becky, this would be equivalent to an alcoholic working in a brewery. The job gets filled before she can arrive, but a sister magazine from the same magazine group, Successful Saving, is hiring. The man at the front desk assures her that the magazine group is a family, and once you're in, you're in. The only problem is that the magazine that ends up hiring Becky is a financial advice magazine. Not exactly the type of place that suits Becky's lifestyle or assets.<br><br>Becky's boss is Luke Brandon, a handsome, wealthy man with lots of energy and a black sheep complex. He never feels he can please his parents and leads a life of stress. He's amused by Becky's antics and impressed by her candor. Becky's writing for the financial magazine is a surprise hit. She writes about financial restraint in such a way that the average layperson can relate, comparing it to shoes. It seems like everything's going swell with her new job and a surprise romance with Luke. Derek Smeath can't get a leg in since she's convinced her colleagues that he's an ex-boyfriend stalking her. But like any liar knows, Becky can't keep the truth from her friends and family for long.<br><br>I enjoyed this movie. It was fun and sincere. We like Becky because she is flawed. She doesn't have it all together, but her style and spirit charm everyone around her. Sure she's addicted to shopping, but we don't despise her for it. Instead, we relate, because what woman hasn't given in to the siren song of a signature scarf now and again. The pull of a good bargain is a powerful thing, and this film is bound to be a hit with the average female.<br><br>The acting is suitable for the film. Nothing revolutionary comes out of it, but Isla Fisher will likely be back in many a comic role. The pacing of the film keeps you involved, but there are enough heartfelt moments to keep us focused.<br><br>Some have said that the timing for this film couldn't be worse. With the world in an economic downturn, do we really want to smile and nod at Becky's need to buy, buy, buy? Well, I say this film is healing balm. The nation will recover from this mini-depression, but in the meantime, it's kind of nice to voyeuristically enjoy Becky's indulgences. I have had to natch my weekly Starbucks and batten down my bank account hatches, so I need a little reward, even if it's done through Becky's pocketbook. Also, anyone who watches the film will realize that Becky goes through her own hard time, and she finds a way to get through it. She comes up with her own entrepreneurial scheme to pay off her debt. This is what we all need to do during the difficult times. Find a way to get through. Becky is my hero.","user":"zeedunn","rank":[55,77]}]