[{"title":"Action packed fun U.K. flick","rating":8,"date":"17 July 2017","review":"This was Mark McQueen's second major film he directed, and he did an amazing job once again. This is an action packed low budget U.K. flick with great cinematography and editing. It's nothing great, but it is fun.<br><br>Writer and lead actor Craig Fairbrass kicks some as* in both his screenplay and his acting.<br><br>Sure the story has been done before many times, but I can never get bored of this type of U.K. action flick, especially as a low budget entry into this genre.<br><br>Rating this film on its merits and as a B-type low budget film, it's a fun 8/10 from me.","user":"TheTopDawgCritic","rank":[18,23]},{"title":"Better-than-expected British revenge flick","rating":6,"date":"7 January 2018","review":"LONDON HEIST is a low rent action vehicle for gruff hardman Craig Fairbrass, here playing the usual thick-skinned gangster type who goes gunning for revenge when criminals torture and murder his dad, played by a cameoing Steven Berkoff. Although low budget, this film has a decent pace and is generally pretty enjoyable, certainly more so than your usual Danny Dyer or - god forbid - Simon Phillips production. The violence is harsh and gritty and there's some action to give it energy and drive. Fairbrass remains likeable and is well supported by a reliable James Cosmo and Nick Moran, the latter appearing after seeming to be off our screens for a couple of decades.","user":"Leofwine_draca","rank":[5,5]},{"title":"Not as bad as people are making out.","rating":8,"date":"5 August 2017","review":"I quite enjoyed this Brit gangster flick, some well known actors and a believable story line. I get the feeling that some people out there won't like a film unless it has a bond like budget and all celebrity A listers. This film hits the mark and is worth a rental or purchase, story line was good, twists and turns kept you guessing; I've seen a lot worse. Give it a go, you won't be disappointed!","user":"davebrown-61763","rank":[9,12]}]