[{"title":"Good Family Movie","rating":7,"date":"29 December 2012","review":"When I read the reviews by the \"experts\" online I didn't want to see this movie. However, my three granddaughters 16, 13 and 10 insisted they wanted to see it on the recommendation from some friends. I am happy they did. It was much better than the professional reviews led me to believe. I would recommend that any parent or grandparent, as in my case, take take their kids to see this movie.<br><br>I will say this about the expert reviews, they helped give us excellent seats. Sometimes I wonder if they have lost touch with what movie goers want to see. They have gotten to wrapped up in the technique of the art to be able to recognize a good movie. Maybe the courses on movie making should modify their guidelines to include what the general public considers a good movie.","user":"avenger442","rank":[78,110]},{"title":"Bad source material but decent acting","rating":5,"date":"3 April 2013","review":"Parental Guidance is a pretty decent family comedy about bridging the generation gap, and the process of re-building relationships that have been neglected for a very long time.<br><br>It is obvious to me that neither Billy Crystal or Bette Midler get too many good movie roles nowadays, and I think you can clearly see their joy at being back in the limelight in starring roles. They deliver strong performances and have great timing, and it is a pity that the source material is so weak to begin with. The basic plot is okay with me, but some of the comedy is far-fetched and grandchild Barker's bizarre behavior is used as an excuse for comedy too many times.<br><br>I liked a couple of scenes, which deal with the pressure of constantly keeping up with the technological advances of this day and age, with Artie losing his job because he doesn't tweet or know what an app is. This is a very relevant issue and unfortunately it is lightly dealt with.<br><br>All in all, the plot is thoroughly predictable and the points the movie wishes to make are obvious to all without any hint of subtlety, but the strong acting performances saves it from being a train wreck.","user":"rolandddd","rank":[15,18]},{"title":"Billy and Bette are lovely, but too many silly scenes","rating":5,"date":"27 August 2013","review":"Alice Simmons (Marisa Tomei) is somewhat estranged from her parents (Billy Crystal, Bette Midler). When her husband Phil (Tom Everett Scott)'s work takes them away, she's forced to ask her parents to look after her kids (Bailee Madison, Joshua Rush, Kyle Harrison Breitkopf).<br><br>I like Billy Crystal and Bette Midler. I like their chemistry. I like their 'old fashion' ways. But some really stupid scenes destroy any chance this movie had. Grumpy Billy Crystal has some funny moments. Bette Midler is likable as the peacemaker. But by the middle of the movie, they just piled on one too many ridiculous premise to accept, and the movie falls apart.","user":"SnoopyStyle","rank":[12,15]}]