[{"title":"The Humanization Of Margaret Thatcher by Meryl Streep","rating":8,"date":"30 December 2011","review":"Biopics are always a problem. That's why the long form, HBO style is infinitely more suitable and altogether more satisfying. Okay, now, once that aside, let me talk about Meryl Streep. A miracle! She does the impossible, not only manages to inhabit Thatcher, she also reveals her under a slightly different light. The human light. No matter how much at odds I've been with her politics, I saw that human side through Meryl Streep's eyes and realized that I had forgotten to remember, Thatcher was a human being, a woman breaking ground. She loved her husband but put her career first, as most men in her position do. Her drive is a mystery as much a mystery as Meryl Streep's art. After seeing the film, me, a life long anti-Thatcher, I have to say that it's a fair portrait of the woman. The ones who never heard of Margaret Thatcher, and there are, two of them were sitting next to me in theater, I think they thought \"The Iron Lady\" was the female version of \"Iron Man\" but even them surrendered to the character trough the glories of this other giant of our generation, Meryl Streep.","user":"littlemartinarocena","rank":[217,282]},{"title":"Streep is mesmerizing, the film is not.","rating":5,"date":"27 December 2011","review":"There's no doubt about it: Meryl Streep will be nominated for her 17th Academy Award for her portrayal of Britain's most controversial Prime Minister, Margaret Thatcher, in this otherwise underwhelming biopic. Streep is mesmerizing as usual, but the mode of storytelling employed by screenwriter Abi Morgan and director Phyllida Lloyd – sporadic flashbacks among elongated stretches of following the elderly and mentally fragile Maggie – is a huge misfire. The scenes which recount her path from young adulthood through to local politics and then to her 11 years of turbulent leadership are intriguing, however they are too far and few between to really grip. Sure, it checks off the list as far as famous moments go, but a more in depth insight into how she ran the country would've been nice.","user":"Troy_Campbell","rank":[281,372]},{"title":"Meryl's good but the film isn't - disappointing biopic of Margaret Thatcher.","rating":4,"date":"12 January 2012","review":"In purely cynical terms, one has to wonder if the makers of The Iron Lady wanted to release a film about old age and senility but were warned that such a sombre topic would never perform well at the box office. You can almost imagine some studio executive saying \"no, no, no, we can't possibly promote that sort of movie. Unless you make it about someone famous that would make people go and see it.\" Although advertised as an account of the life and political career of Margaret Thatcher, the film doesn't come close to doing justice to such a vast topic. Instead we get a whistle-stop tour of key events – five minutes of the miners' strike, five minutes of the Brighton bombing, three minutes about Poll Tax, and so on. The nearest the film gets to real depth, politically-speaking, is when it devotes fifteen whole minutes of precious screen time to the Falklands War.<br><br>No, this is not a true political biopic in the usual sense. What we have here is a thin and rather dull story about an old lady's deteriorating health, punctuated along the way with flashbacks to the events that shaped her career. The fact that the old lady in question is Margaret Thatcher comes across almost as a gimmick. They could have made the film about any elderly lady, fictional or real - it would scarcely have mattered. All the important aspects of Thatcher's policies and the legacy her government left behind are dealt with in far too shallow a manner, while any insight into Thatcher as a person gets lost amidst an onrush of excessive newsreel footage. Indeed, it seems as if 25% of the film comprises of these old archival bits and pieces, which really is a case of overkill.<br><br>Since the narrative amounts to nothing more than a series of jerky flashbacks, all superficial and absurdly brief, one wonders if there is any reason to watch the film at all. Fortunately, there is one aspect of The Iron Lady that shines like a glowing beacon through the gloom – and that is the marvellous performance of Meryl Streep. Streep's portrayal of the former Prime Minister is a masterclass in screen acting. The voice, the mannerisms, the physical appearance, the haughty attitude she nails it all. There are some notable names alongside her in the cast too, but generally they are in sub-par form. In some cases they're undone by poor writing, like Jim Broadbent's cartoonish \"ghost of Dennis Thatcher\", while others simply have too little screen time to get their teeth into the part (Richard E. Grant for example who, as Michael Heseltine, is so under-used that he simply fails to register).<br><br>Some might say the film has been made a generation too soon, since the scars of Thatcherite politics still run deep in many parts of the UK. Nonetheless, a controversial but powerful biopic could and should have resulted here if anyone associated with it had shown the courage to take a standpoint. Timidly, the film neither celebrates nor condemns Thatcher. It wimps out by presenting its entire story through the eyes of her as a mentally fragile old lady, thereby avoiding the need to \"take a side\". All in all, The Iron Lady is a missed opportunity. Streep's performance drags it up to the level of a watchable curiosity item but that's about the best it can offer.","user":"barnabyrudge","rank":[94,131]}]