[{"title":"Avoid if you want to keep your memory of the series untarnished","rating":4,"date":"16 April 2009","review":"First of all I will say that this movie isn't as bad as it could have been but it got pretty close to it. Feel free to share what you think.<br><br>WARNING: Spoilers for both the movie a series to follow.<br><br>All the main ingredients to a bad follow up movie were there: Same character different actor, plot holes, contradictions to canon, characters acting out of character, corny dialogue, unresolved plot threads.<br><br>Firstly I'll deal with the plot holes or at least contradictions of previously established canon. Suspension of disbelief is one thing but suspension of disbelief shouldn't extend to ignoring the previously established rules within the fictional universe. That is just called bad writing.<br><br>Okay the first few episodes of Dead Like Me pretty much centred around the consquences of ignoring the rules. Each time George tries to ignore or get around the rules the consequences are bad. Yet we are meant to believe that Roxy of all people would start disobeying the rules. We know from the series that she disobeyed the rules deliberately and had to put up with Gravelings going after her. You get a pretty good idea the reapers in that group all know the consequences of not following the rules.<br><br>Now we are meant to believe that Roxy would go right ahead and ignore the rules because of a sleaze-bag like Cameron? Roxy is an established ball-buster and would not be even the slightest bit likely cosy up to a slease like Cameron, let alone listen to anything he says. It doesn't make sense for her character or her previously established history.<br><br>To a certain extent you could say the same is true for both Daisy and Mason, though it is slightly more believable that they would be tempted...esp Mason! The Cameron plot line made no sense. Some have suggest that he may have been there to deliberately tempt each character to see who would be the next head reaper. However if that is true it was a really poorly executed idea and gave no definite clues in the movie. The fact they successful cremated him and (seemingly) sent him to space seems to speak against him being a lackey for the Powers that Be. If he WAS meant to be a tempter that is probably even worse because even though that would explain his motives it would seem a bit stupid that the PTB would used this method to pick the best head reaper. Any idiot could see that It'd be either Roxy, George or a someone from outside the group. Mason and Daisy obviously aren't options for any sane PTB.<br><br>George being able to talk to her younger sister makes no sense. It has already been established that if a reaper tries to contact a relative in the living world the lose their memories and end up looking mentally ill. That is of course completely ignored because they wanted George to talk to Reggie. This I find very infuriating as I feel they could have solved the problem AND stuck to canon. For example in the series Reggie seemed to some how catch onto the fact that Millie is actually George. Perhaps they could have explained that in some way like maybe she has a rare ability to see reapers for what they are, in the same way only George seems to see gravelings directly (just a suggestion, perhaps a bad one, but at least it is an explanation!). Better yet they could have had it set during Halloween since it has been semi-established that they show their true faces on Halloween. Point is they could have found some solution based in canon for why she could talk to Reggie/reveal her identity without just ignoring the problem.<br><br>Joy wrting a book on grieving and heading up support groups is out of character. Joy has all the compassion of tin foil. That is just part of her character, that's why her husband and daughter were so distant from her - she just found it hard to connect with people and feel sympathy. However it starts off with her being all sympathetic with this woman at a support group. I agree that in 5 years she might have changed but the fact she is STILL having trouble connecting with her own daughter seems to speak against this change. While it is possible that she finds it easier open up to a group of strangers they had nothing in the script to explain that. If Reggie had a simple line like \"You can share your feeling with your support group but you can't do it with me\" it might have made a bit more sense but as it was it seemed incongruent.<br><br>The woman playing Daisy was just atrocious or at least the writing for her was. She didn't even sound vaguely like the original and acted completely out of character. She had none of the sass of the original. The sexual tension/latent romance with Mason was dealt with for about 3 seconds in one scene.They scripted as a bimbo whereas in the series she was cunning and manipulative but with a vulnerable side.<br><br>I basically felt that the original series was done a great injustice.<br><br>I should point out that even though the two writers did work in the original series they only did a couple of episodes in the first season and several in second season (the latter I didn't feel was as good).","user":"kcdl","rank":[15,15]},{"title":"Fan of the Series? Then Skip This.","rating":1,"date":"24 June 2009","review":"After reading a few bad reviews of 'Dead Like Me: Life After Death', I was prepared for something not very good. What I got was like watching a necrophiliac having his way with the corpse of that wonderful show. How Stephen Godchaux and John Masius, both regular writers on the series, could seemingly have so little connection to everything that made that series special is a deep mystery (and I don't feel good slagging this off, as I've enjoyed their work in the past).<br><br>Where the series had been original, lively, funny, poignant and quirky (in the good way, which is a rarity), this thing is irritating, boring, not even remotely amusing and feels disrespectful and opportunistic. The threadbare plot involving a callow replacement for the sadly absent Rube (performed with subtlety and wit in the series by Mandy Patinkin) is a bust that never goes anywhere or even resolves itself. That Rube's substitute is a man who was killed in the World Trade Center on 9/11 is in particularly bad taste, especially since it adds nothing to his character, who is a miserable creep; it's just a weird throwaway. The replacement of series original Laura Harris, as Daisy Adair, is also a major trouble spot. Sarah Wynter, in a word, is awful. Harris's Daisy was imbued with a knowing sadness under her surface superficiality. Wynter just devours the scenery playing Daisy as a vapid, talentless idiot.<br><br>It's nice that talented original cast members Ellen Muth, Callum Blue, Jasmine Guy, et al, got work, but they deserved a better vehicle than this shoddy, mawkish mess. <br><br>If you are a fan of the Showtime series, do yourself a favor and skip this. Once you've watched it you can't un-watch it and doing so will only make you mourn anew the premature death of the original. Which, I suppose, is apt.","user":"bobfingerman","rank":[56,67]},{"title":"Well. a BETTER send off than ShowTime fgave it..","rating":6,"date":"5 February 2009","review":"I thought Dead Like Me was one of the... funniest.. saddest.. smartest.. and just quirkiest shows ever on the air. This film takes place, picking up 5 years later, where everyone left off.. mostly. Now the biggest complain has been the absence of Rube (Mandy Patinkin) as the boss.. a tragic loss to be sure. and the recasting of Sarah Wynter in the role of Daisy Adair, formerly filled by Laura Harris. I will only say.. not to give too much away.. but they got MOST of the cast back.. and a pretty decent.. I won't say it is a definitive conclusion, as it could be left open to more DTV films. But at least it felt there was a punctuation at the end of the sentence which had been hanging for almost half a decade.<br><br>I will be the first to admit the movie has its MAJOR problems.. but over all, rough edges and everything.. it is a pretty decent representation of what the best of the show offered, although not quite as adeptly written, or acted.. its much harder to fill in a 90 minute film with so many characters as opposed to a dozen hour episodes yearly. This does seem more done for the \"fans\" who've missed the show. and its still a welcome return, if not at its best.","user":"mcgill_j","rank":[62,75]}]