[{"title":"Grandeur and noblesse, when death is seen as a prolongation of life","rating":10,"date":"9 November 2009","review":"The human dimension of this film touched me. Some of these things touched me to tears. I list a few of them.<br><br>1. The job of the professionals who prepares the dead for their last contact with the family (wake) and their passage to eternity (cremation). In the film, the characters who perform this job, teach the spectator a true ritual of respect and affection with the dead. \"Respect and affection with the dead\": feelings that the modern life tries to banish from its practices. In the modern world, the dead are inconvenient and dispatched quickly in funerals where the majority of those who are present, entertain themselves with parallel talks, instead of focusing on the reason why they are there.<br><br>2. The nobility and grandeur of this job that, in the film, is not associated with any religion, and is directly associated with dealing with human beings. This nobility and grandeur reflects also on to the dead, in the sense that it reminds us that the dead deserve our respect and affection, because a new stage of our relationship with them is starting.<br><br>3.The way Daigo grows, as he learns this job, and overcomes (i)the social stigma that society imposes upon the contact with the dead and, also, the people who have contact with the dead, as well as (ii) his personal repulsion with repulsive material aspects of death (odors, rot, etc.)<br><br>4. The way Daigo grows, as he incorporates the nobility and grandeur of the job he was forced to do because of the circumstances (he was jobless because the orchestra where he played cello was dismissed). And, when his wife discovers in what consists his job, and tries to force him to quit, he has grown so much that he chooses to keep the job instead to yield to his wife menaces.<br><br>5. The way Daigo grows and which leads him back to play the cello and celebrate life more than ever, playing outdoors and playing at home as he used to do when he was a boy.<br><br>6. The way Daigo wife grows when she has the opportunity to look close to the job of her husband, and begins to admire him and love him more. Wife who have the opportunity to convince Daigo to take care of his dead father, when Daigo runs away when he gets aware of his father death. Wife, who, when the opportunity showed up, says with pride to the individuals of the funeral, that were almost doing a dirty job with the deceased Daigo father, \"my husband will take care of him, he is a professional\"<br><br>7. The way Daigo grows when he encounter again the love for his father and forgive him for having abandoned the family, while he prepares his old man for the burial.<br><br>8. How death can be seen as part of life process, when it causes some people to become aware of how much love they missed, and how much they have been loved without being aware of it.<br><br>All this happens because Daigo goes back to his hometown, a small town. That is, the return to his origins helps to renew the ties with the traditions and helps the character to put himself together again.<br><br>I'm omitting many precious details that appear throughout the film. These details must be seen personally, because the film was made with great sensitivity and expertise, and deserves to be seen.<br><br>Roland.","user":"roland-scialom","rank":[79,86]},{"title":"A very powerful film","rating":20,"date":"20 March 2010","review":"This film is about an unemployed man taking up a job as a person who prepares body before putting into the coffin.<br><br>\"Departures\" is a beautiful film. It is about the last journey before a person is reduced to ashes, yet it never feels gloomy. In fact, it shows that all humans die one day, and it is how we view it and how those left behind cope with death that matters. Kobayashi treats the bodies with such enormous respect and dignity, which touches me a lot. \"Departures\" is a film to feel. It makes you think and feel about such a taboo topic which is not normally discussed. I commend the filmmakers for making \"Departures\". It's a must see.","user":"Gordon-11","rank":[18,18]},{"title":"The odd job","rating":10,"date":"19 March 2009","review":"\"Okuribito\", literally \"The person who sees off\", is about a supposedly untalented cellist's new job. After returning to hometown as a failure in the music world, he applies for a job with vague description. It turns out to be a job posting for \"encoffiner\", a person who performs rites and rituals before placing the body into the coffin. A 'tainted' job in the eyes of the society, but he eventually develops pride and purpose in this profession.<br><br>The movie started with subtle humor that had me chuckling for first hour, but I was slowly drawn into the story. It turned out to be a very touching and deep film.<br><br>The acting in this film was superb. Motoki Tomohiro's performance was especially amazing, hilarious at times, and played the serious and professional scenes very convincingly. I also really liked his narration, which really sets the mood and tone of the following scenes. Yamazaki Tsutomu was also excellent as the protagonist's cool mentor. The film had incredibly nice flow and very well-directed. Music in this movie played a huge role, expressing the protagonist's feelings and harmonized with every scene. It was simply beautiful.<br><br>This movie gave me a glimpse of the profession of \"encoffiner\", as a very respectable job, as it requires absolute accuracy, professionalism, and the respect for the dead even though it is looked down by the society. It is the encoffiner who sees off a person's last journey after dressing them up. This movie successfully depicts the pride in one's job, and questions the meaning of death.","user":"ethSin","rank":[106,120]}]