[{"title":"How is this getting a 6.7 rating???","rating":1,"date":"22 November 2019","review":"Second worst movie I have ever seen. Had to stop 4 times. NO military advisor which is evident. Colonel wears a Majors insignia throughout movie. \"HooRaa\" was NEVER said in WWII. Grenade blows bunker, kills all inside but no damage to the room. Looks to have about 5 Sargents in a 12 man company??? Only \"sergeants\" aparently get stripes. Patches are improperly placed and half falling off. BAR not shooting 30-06. \"Colonel\"s 1911 and a B AR has plugged barrels. Some times guns eject casings, other times nothing.&gt;??\nOne more \"HooRaah\" and I was going to turn it off. ....and ... there it was. In between bunkers the \"Colonel\" is screaming orders to everyone. He would give orders to the multitude of Sargents and THEY would pass on the orders. Then they go and send a couple Sgtss off as a team. No, no, NO! Sgts. LEAD the lower ranks. Oh, they only have one Pvt. and one Cprl. I believe.\nWatch this movie only if you have absolutely NO idea what the military is. Otherwise, it will drive you nuts. Ugh!!","user":"dberg-5","rank":[28,29]},{"title":"Low budget acting, script, and special effects spoil an important story","rating":3,"date":"10 October 2019","review":"I love World War II movies, but this one was so badly written and acted that it was embarrassing. Every cliche of war movies was here ( except there were no female sweethearts left behind) with actors delivering wooden lines. I tried to give it the benefit of the doubt after the first few awful minutes, but it did not get any better. The battle scenes are unrealistic, like video games. Prisoners without hands tied or mouths taped accompany heroes into ambushes. The soldiers do not learn that after \"clearing\" a location they still need to stay alert, and repeat their mistakes.\nThere likely was not a military consultant for this movie.\nThe producers apparently just tried to capitalize on the excellent Band of Brothers popularity in the year of the 75th DDay anniversary.\nThree stars for thinking about it.","user":"criticrasdvatri","rank":[14,14]},{"title":"Should be negative 10 stars","rating":1,"date":"14 October 2019","review":"This was by far the worst made movie about world war 2 I have ever seen. I barely made it about 30 minutes into the movie and stopped watching. What a waste of time and money. Poor acting some actors overweight . And it seems as though the producers and production crew from the very top didn't even try for accurately portraying the soldiers of ww2. Very poorly equipped and outfitted actors. Poorly made movie . Looks as if someone bought cheap military surplus not to mention modern civilian attire such as footwear green jeans etc and decided to make a backyard home movie playing ww2 like you would see children do. Don't waste your time and money","user":"mikski1270","rank":[20,21]}]