[{"title":"Deep and beautiful movie, requires a special mood and a bit of thinking","rating":8,"date":"29 May 2010","review":"It would have been hard not to like this movie, since I had early previews from friends that it is boring and pointless, so my expectations were really down. I did watch it, nonetheless, and I am glad I did. If you ever watched Tideland, you know Terry Gilliam is capable of works of terrible beauty, often concocted from the ugliest bits life can provide; such is this film.<br><br>This is Heath Ledger's last film, he died during filming it, but his character is not the main one, just the extra ingredient needed to take all the important ones out of their equilibrium state. Because of this tragedic death, other actors came to fill up the role, such as Johnny Depp, Jude Law and Colin Farrell.<br><br>And still, the important character, the Faust that can't keep himself from betting with a mischievous devil that isn't even very unfriendly, is Christopher Plummer's, who played marvelously at his age of 81. I loved the way the devil was toying with him, addicted to playing games that he didn't want to win in the end so that he keeps playing. The visuals were great, the atmosphere both miraculous and brooding, but rarely in the same time. And Lily Cole was cute and sexy as hell.<br><br>Bottom line: a weird film that you need to think about to get at his many hidden meanings, with beautiful imaginative imagery and great actors. What is not to like?","user":"siderite","rank":[28,29]},{"title":"The whole is not the sum of the parts - at least not on a single viewing","rating":7,"date":"14 October 2009","review":"Like so many of Terry Gilliam's films The Imaginarium Of Doctor Parnassus is one that is going to need multiple viewings to truly form an opinion on. Like Brazil, Adventures Of Baron Munchausen, Fisher King, Fear &amp; Loathing In Las Vegas and Tideland (even Time Bandits really) there is so much going on here that expectations or reputations get in the way and make it hard to digest and appreciate on a single viewing. No bad thing necessarily.<br><br>Of course Parnassus has the particularly insurmountable problem of being the late Heath Ledger's final performance and following on from his superb, Oscar-winning turn in The Dark Knight. It is impossible to see the film through eyes that don't see it as the film he died making. Some parts of the film may perhaps work even better than they may of done had he lived – some of the best films are triumphs over adversity and adverse conditions don't come much greater than your star dying mid-shoot. But whatever works and doesn't in the film it is hard – impossible on a first viewing – to divorce yourself from the knowledge you bring into the theatre.<br><br>On first feeling Parnassus seems patchy, and curiously it feels like a film that may not have worked as well as it does had nothing happened to Ledger. Don't get me wrong I'd rather have a Gilliam failure and Ledger still alive to put it behind him and move on than a wonderful film that is largely the result of his tragic death. But we don't have that so I'm just looking at what's there.<br><br>The fact is the film is at it's best when galloping around the fantastical worlds of the Imaginarium, with Ledger's character Tony now played by Johnny Depp, Jude Law and Colin Farrell. Depp and Farrell are particularly good and imbue the film with an energy lacking in much of it.<br><br>The casting generally is good. Christopher Plummer is steadfast excellence as always. Lily Cole is a surprisingly strong choice. I've never understood the viewpoint of Cole as \"sooooooo beautiful\" that the gossip sheets and magazines espouse but she has a quirky intrigue that works wonders in a Gilliam world and proves herself as an actress amongst a proved group of impressive performers. Hers is probably the best debut performance I can recall of a model or singer turning to acting. She puts a lot of professional actresses (no Keiras named!) to shame.<br><br>Andrew Garfield is that intriguing mix of annoying and brilliant. Like DiCaprio in What's Eating Gilbert Grape? I started out thinking he was terrible and then grew to realise it was just that I hated him, his character. He annoyed the hell out of me. In another words he had inhabited the character so fully, so convincingly that my negative feelings toward him where directed at the fictional character. A superb performance.<br><br>Tom Waits steals moments constantly. Waits hasn't been given such a juicy role that fit him better since Renfield in Coppola's Dracula and he revels as Dr Nick (the devil) here.<br><br>Oddly the performance that, again I specify on first viewing, leaves you a bit underwhelmed is Ledgers. It is not a bad performance but the expectations as you go in, knowing it was his last performance, means you expect something special. Brokeback Mountain/Dark Knight special. But of course not every role is as powerful as his in Brokeback or as scene-stealing as the Joker. I mean he didn't know it was his last performance for crying out loud. Therefore it cannot possibly live up to expectations and is destined to underwhelm until multiple viewings and some distance allow it to be judged fairly. That there was such a fully formed character there that three other actors could step in to play alternate universe versions of it entirely convincingly is arguably a testament to how strong a performance Ledger did give. It is not a likable character or a flashy character (it doesn't even really seem the main character until the alternate worlds with the alternate Tonys come in) and so Ledger's understated subtleties are easy to miss.<br><br>When you watch Fisher King the first time you remember Robin Williams, not Jeff Bridges. In Twelve Monkeys it's Brad Pitt that comes away with you not Bruce Willis. And yet on further viewings Bridges' performance seems superb, Willis' perhaps the best of his career. I suspect on repeated viewings I'm going to see the strength of Ledger's performance better. I hope so.<br><br>And of course this is a problem much of the film has. Gilliam doesn't make simple, overly explained films for the masses – thank Gilliam – you have to work with them. The problem here is that with your mind distracted with thoughts of Ledger and expectations built on that promise of Gilliam at his creative best, three step-in performances and Ledger's final performance it's hard to get your mind around the story and enjoy it as a piece of work.<br><br>Sometimes Gilliam films work, sometimes they don't. Sometimes they get better and better on repeat viewings (Brazil); sometimes they work instantly (Twelve Monkeys); sometimes they seem to work but the more you see them or think about them they crumble and ultimately don't (Brothers Grimm). Sometimes they just seem to be a mix of great ideas, wonderful performances and ingenious set pieces but hampered by an overabundance of theatricality and almost too much going on for its own good (Baron Munchausen). On a first viewing Imaginarium Of Doctor Parnassus feels like this latter. Bits work, bits don't. It's enjoyable in places but perplexing ultimately.<br><br>I will definitely revisit it though to see if changes on repeat viewings. I feel sure it will, but whether that's a good or bad thing, well, I'll have to wait and see.","user":"motta80-2","rank":[277,364]},{"title":"A Unique and Extraordinary Adventure","rating":6,"date":"10 January 2010","review":"The Imaginarium of Dr. Parnassus is a very strange film but it pulls together wonderfully. It was dark but funny at the same time. I really loved the imaginarium sequences. Gilliam uses dream-like imagery and odd behavior to construct a fantastic escape into imagination. Although the CGI was admittedly simplistic, it was fitting for the fantasy realm. Great performances, especially by Heath Ledger and Colin Farrell.<br><br>I don't think this movie is for everyone since it has received mixed reactions. I also would advise against having certain expectations going into it, because there's no way to anticipate what you will get out of the film. But for me, it was certainly a real treat and very enjoyable throughout.<br><br>6/10","user":"DjMethod","rank":[80,102]}]