[{"title":"Exciting, Inspirational, Craig and Scheiber are Fine","rating":8,"date":"20 January 2009","review":"\"Defiance\" is a very entertaining, exciting, suspenseful, and inspirational film about a tough topic: the Holocaust. Its many action sequences are well-paced and well-motivated. You know exactly why Tuvia Bielski (Daniel Craig) breaks into a home and points a gun at a man in front of his family. Daniel Craig and Live Schreiber are terrific as Tuvia and Zus Bielski, who lead a band of Jewish forest partisans during World War Two, thus saying over a thousand lives.<br><br>The movie is not perfect. Characters speak English with Slavic accents. In other scenes, they speak Russian or Belarusian. Craig and Schreiber manage very good Slavic accents, both when speaking English and when speaking the Slavic languages, but Craig occasionally lapses into his English accent when speaking English. Female characters are not particularly well drawn, or given much to do. While this film is very good, it doesn't have the production values to be a timeless classic like \"Schindler's List.\" The movie is controversial. Most of the controversies are shallow relative to the most important facts at hand. Many of those attacking this movie have axes to grind, including current events in the Middle East or feuds between Poles and Jews. The most important fact is this: the Nazis committed a genocide of six million Jews. In the midst of this Satanic nightmare, the Bielskis managed to save over a thousand Jews. That's the main, and absolutely true, point here, and it should not be lost in bickering over details.<br><br>Compared to other treatments of the Holocaust, this film is fair. It doesn't show Slavic peasants as uniformly Jew-hating collaborators. Nazis, not Slavic peasants, were the authors and perpetrators of the Holocaust. Some occupied peoples collaborated, often out of fear and for financial gain or as payback for old grudges. Some occupied peoples did everything they could to help Jews, as does a Belarusian peasant in this film.<br><br>The Bielskis were not immaculate. They did summarily execute captured Germans, as shown here. They did raid peasants for provisions, as shown here. They did work with the Soviets, but so did Uncle Sam. Remember that photo of FDR and Churchill smiling with Stalin at Yalta. The Polish IPN institute is investigating charges that members of the Bielski partisans, but not the Bielskis themselves, participated in the 1943 Soviet massacre of 128 people in Naliboki. Aron, the youngest Bielski brother, was, in 2007, accused of defrauding an elderly Polish woman. These failures of the Bielski brothers to be perfect in no way lessen their achievement, any more than any failure to be perfect lessen any hero's achievement. Again, in the face of genocide, the Bielski brothers managed to save over a thousand people. Were they perfect? No. Were they admirable, heroic, and worth learning about? Absolutely yes.","user":"Danusha_Goska","rank":[116,157]},{"title":"Through suffering and faith they defied their destiny.","rating":9,"date":"25 August 2009","review":"I was almost giving up seeing this film because of certain reviews which were not that good. To my amazement , the film turned up to be not good, but excellent. It shows people fighting for their lives, starving, getting to the point where many people loose faith and come close to being like animals. That is when you need a good leader which the Bielski brothers certainly were. And what good actors, Live Schreiber as Zus , what a performance, also Daniel Craig faultless as Tuvia. When you see all that killing, done by men (and women) trying to survive and also in some cases, revenge, you wonder how peaceful, good persons can change and become violent, when circumstances demand. And pray that those times will never happen to us. Spare us from being the Chosen People, says the Rabbi, overcome by anguish in a touching scene. But it is through suffering and faith that these people defy their destiny. My mother and father left Bielorus before the war. But most of their close ones did not.","user":"tmwest","rank":[70,95]},{"title":"Great movie, light on facts","rating":9,"date":"31 December 2008","review":"I enjoyed \"Defiance\" immensely -- there was humor and heartache, with a liberal dose of action. Not a brainless action movie, enough of a story to make it memorable, and fast-paced enough to keep me from becoming bored.<br><br>On the other hand, although the movie captures the spirit of the story, it is far from a documentary, and I'd have preferred a more historically accurate film. I'm biased, though -- I read the Peter Duffy book \"Bielski Brothers\" soon after it was released (\"Defiance\" is based on a different book), and I found the real story even more compelling than the Hollywood version.<br><br>Nonetheless, I live in the real world where directors have to shoot on a budget, and this was a good, diverting peek into a story that was long overdue to be told.","user":"eba-junk","rank":[193,284]}]