[{"title":"Fun at first, ultimately a waste of time...","rating":6,"date":"26 March 2017","review":"The set up for the movie had a somewhat interesting concept at its core: what do people do when they are trapped in a situation where the only way out is to kill others? Not a completely original idea, but it has some potential to be thought provoking if there is some kind of message it is trying to send, or some aspect of society it is trying to satirize. The resulting bloodbath is well executed, if you are into seeing office workers murder each other. I can't tell if the movie has a messed up sense of humor, or if a few people in the theater with me just thought some of the deaths were so ridiculous it was funny. Personally I never found any of the deaths over the top ENOUGH to truly find them funny, so the other people's laughter just kind of made me uncomfortable... After the bloodbath ends though, ultimately there was nothing there, no deep thoughts, no important message, no point at all really. The closest thing I can up with for meaning in the movie is that in the end, they basically admit there was no real reason for the experiment to be conducted, and so conducting cruel experiments without a purpose is a bad thing? But that seems obvious, right? When chaos ensues, different people react in different ways. It's sort of like the Walking Dead in that sense, but the Walking Dead has time to develop its themes and characters long enough for you to extract some meaning. In a way, the pointlessness of the experiment and the killing is reflected in the pointlessness of the movie itself. I don't know if that's kind of meta, or just a waste of time, but yeah, if you skip this movie, you won't be missing much except seeing a lot of talented actors who always play supporting roles murder each other in the center stage. If you want to see John Ghallager Jr in something better, watch Hush, or The Newsroom. If you want to see Meryl from the Walking Dead, watch The Walking Dead. If you want to see the ideas this movie brings up actually addressed in a thought provoking way, maybe try the Hunger Games, or Battle Royale. This was a fun little film that ultimately means very little.","user":"aserpentperplexed","rank":[78,98]},{"title":"A movie that's been done 100 times, but passes the time adequately.","rating":6,"date":"12 September 2016","review":"Eighty American workers in Bogota get locked inside their office building and an announcement over the intercom gives them half an hour to kill any two of the employees. When they don't comply, the rules are amped up, and an American Battle Royale (down to the 'collars') ensues. <br><br>The Belko Experiment managed to accomplish the difficult feat of never being boring, not even for a minute. It takes almost no time getting going, and at any given moment it is either action packed, or taking a break from action and descending into dark humour. Both of these were well-executed, with one particularly memorable action piece (the end of round 2, so pretty), and a spattering of interesting side characters, a lot of them hilarious in either attitude or demeanor. With that, it managed to entertain throughout, making it worth seeing. <br><br>However, where it fails is originality. The Battle Royale formula has been done time and time again, and here we get the straightest form of it, with zero deviation from the norm and zero unique perspective. Where a movie like Circle tries to infuse some kind of basic examinations of social themes, here there is no higher level to the killings. And for this, the movie never once surprises with a thought or an event. The characters are just shells of people; the bad guys are caricatures of evil, the protagonists of good. There is never ambiguity of character, in a movie where so much moral ambiguity should be present due to the situation. So from minute one you know exactly who will be a villain and who will be a hero, and the end game is obvious from the start. It's a waiting game for the movie to arrive where you know it is going, which makes it very unsatisfying once the action is over.","user":"horrorinpureform","rank":[111,150]},{"title":"Worth of watching it","rating":7,"date":"6 September 2017","review":"Not the best, not the worst. Has it's potential and million of possible outcomes and story lines. Some say it lack of originality and creative work, however, it was only one of the possible outcomes , either way, it seemed realistic, without bullshit inventions to make it, like many say, \"creative\".<br><br>It is interesting, yet, I dunno why people expect to watch a new version of matrix, fight club, either any other possible classic.<br><br>Sure the scenario is familiar, nothing new, neither old, just a new story exactly what a movie could give us.","user":"vladimirlisovets","rank":[24,32]}]