[{"title":"Best animated movies ever made","rating":10,"date":"15 February 2020","review":"This film is possibly one of the best animated films of all time as it tells an emotional moving story while being funny. As I said the emotion in this film is full of heart and even though I didn't cry it will make most people cry. The characters in this are perfect even if it is a small character like Ellie or big character like Carl everybody gets so much development even Charles Muntz the villain of the film is also given development, even more than some superhero films nowadays. Also this film has comedy some Pixar films now just want to make you cry but in the 2000s they had mix of sad and funny moments. So overall this film is as close to perfect as an animated film can get, it is has a mix of emotions it is funny and sad when it needs to be it has so much heart and the characters are perfect. This film in my opinion is the best Pixar film.","user":"MR_Heraclius","rank":[41,42]},{"title":"Brilliant, another Pixar home run","rating":30,"date":"30 May 2009","review":"If there's a list of great computer animation movies of all time, Pixar would dominate most of the top positions. Great story, great voice talent, great timing, great for all ages. It'd be hard to pick just one above another and perhaps another viewing of Up may be in order to figure out where I'd place it among so much stellar work.<br><br>Up is by far the most emotional human drama of any Pixar movies thus far, very heavy, so much so if you're looking for pure fun with some jaw-dropping chase and/or thematic scenes and no downer moments, Up may not be for you. I saw it in a packed theatre of about a 65% adult, 35% adult split audience and it's the only time I can remember being in ANY animated movie where there was sniffles and watery eyes, and that was within the first 10 minutes of the movie. There's an undercurrent of life after losing a loved one in this movie, which I don't feel gives anything away. It's pretty heavy subject matter, Pixar handles it, like they do everything they touch, incredibly well, but it doesn't make it any less sad to have the material threaded throughout much of the movie you're reminded of it, but I suppose it's up to one's own interpretation of loss and how to place it in your life that perhaps will have an emotional effect on you.<br><br>Story is what makes a great movie great. Without story, you don't really have anything, maybe some effects, some action, maybe some cute or clever sight gags, maybe some laughs, hopefully some emotion, where Pixar shines above all others in animation and over a good 99% of the movies out there is they can intertwine it all and do it seemingly effortless, which is an incredible feat. To do this in a few movies is one thing, but Pixar has pretty much nailed this now for their entire career of making movies, that's just simply unprecedented. <br><br>I should note I saw the 3D version which, to be honest, didn't really take the movie to the next level. One of the more well known syndicated reviewers had said you're better off seeing the non-3D version on screen, and I actually agree. The 3D glasses added little to nothing to the movie except for an eye-strain headache later in the night. It didn't take away from Up mind you, it just didn't add to it either. <br><br>Up is a great movie either way you slice it and it should be noted, the theatre I saw it in gave it a fairly loud round of applause at the end. It's pretty rare these days that an audience applauds after a movie, perhaps we as a society has become too jaded, or too just expecting of the goods or feeling we're entitled to the entertainment. It's nice when a movie hits on all cylinders and elicits such a range and emotional reaction people who don't know each other in a packed room all gasp, laugh, cry, and applaud together. Great movies however can do that and Up is truly a great movie.","user":"colan","rank":[207,246]},{"title":"Pixar hits it out of the park, again","rating":10,"date":"12 May 2009","review":"I was lucky enough to get a ticket to a special pre-release screening of Up at Pixar studios in Emeryville, organized by the San Francisco Film Society. After a hour-long reception in the atrium of their beautiful main building we went through some rigorous security (metal detectors!) and were treated to an hilarious short (Partly Cloudy) and Pixar's new high water mark, Up.<br><br>My favorites to date have definitely been Wall-E and the Incredibles, and Up is another slightly-left-of-center masterpiece. The emotional impact of the beautiful, wordless summation of Carl's life that opens the movie is the bass note that resonates through the whole film and is at least as affecting as the scene in Wall-E when he holds his own hands while watching Hello Dolly. The rest of the movie, of course, is breathtaking on just about every level, especially the tactile quality of all the characters and textures and the completely realized weather effects and action scenes. With no \"new\" technical milestones (fur in Monsters, Inc., water in Finding Nemo, realistic camera effects in Wall- E), the design is the main focus, from the hilariously stylized characters to the amazing setting of the tepui.<br><br>As the associate producer who participated in the Q&amp;A following the movie pointed out, the past three Pixar movies have not been easy sells to their parent company Disney (they'll be back in familiar territory with Toy Story 3 and Cars 2), but Pixar's commitment to inventive, story-driven films continues to pay off here. All of the good press is true, and I can't wait to see it again. Thanks for staying true to yourselves Pixar!","user":"choco_taco","rank":[380,470]}]