[{"title":"A glimpse into the eyes of Innocent Love!!!","rating":10,"date":"26 July 2016","review":"Take a breathtaking journey into a year in the life of \"The Young Messiah\". What was Jesus like as a kid? How do you explain what He went through to become who He is and was? Miracles are in this movie - A question-asking young boy who truly didn't know the power He would later use to save the souls of the Earth. Jesus is played by a beautiful young boy who is very good in his role. With his parents (Mary and Joseph), they flee the town they are in. On their journey, young Jesus begins to learn and do things He doesn't quite understand at first - Jesus as a child is so amazing because even with my being a Christian, it didn't make me look at Jesus any different than I do now (with respect and love) - Forgiveness was yet to be known - but Jesus was more than a forgiver, even as a child - Watch what happens and go see the movie - It's worth a watch.","user":"QueerVamp20","rank":[22,34]},{"title":"Tries too hard","rating":5,"date":"13 March 2016","review":"I think to make a movie about a non fictional character without any information or facts of the actual story, is a mistake. Especially this kind of story. There were things done in the beginning of this movie that were just plain wrong, and clearly wrong according to the biblical writings. He didn't do ANY miracles until the age of 30 the bible clearly states and i'll leave it at that. I wish people would stop trying to make Jesus someone other than He really was. This movie felt like it stole a little from 'Risen' which was a very good movie, surprisingly. Too much free license with this movie left me cringing many times at the things that were shown. The Devil, the ignorance of Jesus, Mary being worry full and Joseph being the strong minded one, quoting from the King James version of the bible which wasn't even made yet... Little stuff like that bugs me. If this wasn't a movie about Jesus, i could see it being a decent movie. But, it was. And it falls flat for me because they tried too hard to make it fit into what we would want it to look like if we could really see Him at such a young age. \"Risen\" had a great concept because it could have actually happened, but the way this move was written, it could not have happened the way it was portrayed. it is what it is i guess.","user":"SpiritMechanic","rank":[31,51]},{"title":"Jesus has no clue he's the Son of God.","rating":3,"date":"11 March 2016","review":"Be informed! The Young Messiah's high production quality probably makes its content more disturbing, because many people will see it and form a concept of Jesus from it. Like The Da Vinci Code, the film—based on a novel by Anne Rice (Interview With the Vampire)—is loosely based on Gnostic texts widely deemed heretical. (In those texts, the boy Jesus strikes a playmate dead and then resurrects him, makes clay birds alive, etc.) The story's main premise is that young Jesus has no clue he's the Son of God. As in the Harry Potter saga, the young hero gradually discovers his supernatural powers and struggles to control them and to discover his destiny. Yet it's being billed as a \"Christian-themed\" Easter film and even being supported by some big ministry groups. Mary and Joseph try to protect Jesus from the backlash from his accidental miracles. In a totally fictional suspense subplot, Herod discovers Jesus' name, age, home, and family and sends a Roman soldier to track and kill him. Don't be bamboozled—read the Bible for yourself.","user":"suegrise","rank":[65,116]}]