[{"title":"Predictable and Flawed Collection of Clichés","rating":4,"date":"25 December 2008","review":"In Arizona, the veteran Detective Miles Porter (Richard Roundtree) becomes obsessed for catching the murderer of his goddaughter Cindy (Michelle Sebek) and three years later he requests his retirement to dedicate to the case in full time. Meanwhile in California, Richard Alden (Roark Critchlow), his wife Kathy (Holly Marie Combs) and their son Sam (Max Burkholder) moves to the expensive condominium Hidden Glade Estates seeking security. Kathy is still traumatized by the attack of a burglar in their former home. They are welcomed by their next door neighbor Caleb Theroux (Patrick Muldoon) that befriends the family and Kathy becomes close to the divorced Brianna Fine (Traci Lords). Meanwhile detective Porter finds a lead to the killer of Cindy.<br><br>\"Point of Entry\" is one of those predictable and flawed collections of clichés that seems to be in a shelf of a studio ready to be filmed and broadcast. The plot is shallow, the identity of the killer is disclosed still in the beginning, and there is no explanation, for example, for the disappearance of Detective Porter in spite of the stringent security of Hidden Glade. The security guard Raul is totally naive, attending to an alarm signal after the visit of Detective Porter and the absence of Richard that have never left the condominium. Holly Marie Combs keeps the same uptight posture and body expression of Piper Halliwell, her character in \"Charmed\". My vote is four.<br><br>Title (Brazil): \"Perto de Casa\" (\"Near of the House\")","user":"claudio_carvalho","rank":[11,13]},{"title":"I thought the new century brought smarter lifetime movies!","rating":5,"date":"5 November 2007","review":"***spoilers***<br><br>I love Holly in anything she does, she has an immense talent that always brings a great depth to whatever she's in. That is sadly the only plus of this movie. The plot is formulaic even for a lifetime movie. It looks as though this is a first time writer, but still the story just skips along, like a rock on water, only giving you exactly what you need, and not very suspenseful at all. From the beginning you know who the bad guy is, his shtick is uninspired, creating fairy tale books of his obsession immediately after meeting. Who wouldn't know where to find this guy? When he leaves a body of work and picture of himself?? Richard Roundtree got stuck with the overused detective with a connection to the case, so it consumes him and leaves his family behind and angry. Plus he only had to look on the internet to find the guy. Not bad for a retired detective. And finally, once again this type of film leaves you wanting the psycho to get a little something more than what he did. You want her to really take charge and take him out (Like we all know Holly can!). But I wont beat it into the ground. It was good to see Holly back, and 5 stars to any film that makes it on TV. They got it made and that's always a victory. I hope Holly gets hold of something that really shows her stuff next time!","user":"sscole","rank":[11,21]},{"title":"Fear and loathing in suburbia","rating":6,"date":"4 December 2011","review":"***SPOILERS*** Worth watching just to see actor Patrick Muldoon's performance as the crazed murderous and possessive children's book writer Clab Theroux who does an excellent revival of the movie \"Psycho\" psycho killer Norman Bates. It's Clab who's obsession of breaking up the Alden's Kathy &amp; Richard, Holly Marie Combs &amp; Roak Critchlow, and thus keeping Kathy and her eight year old son Sam, Max Burkholder, all to himself that leads to the climatic bloodbath at the Hidden Glade Estates. It's Caleb's murderous rampage that shocked that peaceful and quite gated community down to it's socks and elevator and platform shoes.<br><br>We already get a clue what's to happen in the movie in a triple murder committed in Arizona who one of its victims included Phoenix detective Miles Porter ,Richard Roundtree's, goddaughter Cindy. Retiring from the Phoenix Police Deartment and going on his own to find Cindy and her parents murderer the road leads Porter straight to the Hidden Glades Estate Condominiums in far off California. It's there that children's book writer Calab Theroux resides who's using the pen name of Edward Parlman. It was Parlman aka Caleb Tharoux who wrote a children's book who's storyline or characters in it was eerily similar to the triple murder back in Phoenix that included Det, Porter's goddaughter Cindy! In fact Porter found a copy of the book at the Phoenix murder site and the person that wrote it was the wild eyed and a bit unstable Calab Theroux who now has his eye on Kathy Alden!<br><br>It through a number of staged,by Calab, incidents that Calab get's close to Kathy and her son Sam leaving her husband who's almost always away on business out in the cold. Caleb goes so far in splitting up the Alden's that he tips Kathy off to the fact that on Richard's latest business trip he had blond and sexy former girlfriend, before he met Kathy, Susan O'Quinn, Jennifer Gareis, come along to help him out with his very heavy and back breaking workload!<br><br>***SPOILERS*** Feeling that he now has Kathy in his back pocket Caleb really goes bananas in dropping his guard and going all out to get her to become his personal squeeze or woman. Caleb even goes so far as murdering Miles Porter, who came to visit or arrest him at the Hidden Glades Estates, as well as drug Molly's estranged husband, who by then she was on the outs with, in an attempt to get Molly &amp; Sam to accept him as the man and father, to Sam, in the Alden household! It's really Patrick Muldoons incredible performance as the crazed Calab Theroux that brings the film up a couple of notches above the usual run of the mill Lifetime Network made for TV movie. The man is completely cracked up in the head yet at first he seems harmless and even a bit likable. It's as he becomes more and more obsessed with Kathy, like he did back in Phoenix Arizona with Cindy, that his bad crazy and murderous side came to the surface.","user":"sol-kay","rank":[0,0]}]