[{"title":"Snorefest","rating":4,"date":"19 October 2009","review":"Having enjoyed Vince Vaughn and Jon Favreau in Swingers, I thought that this had a pretty decent chance of being a funny movie.<br><br>No dice. This film tries to be a zany comedy and a touching drama at the same time, and fails at both. It starts out well, but somewhere about 20 minutes in, seems to lose its way and it never comes back.<br><br>I have seen worse movies, and there are a few funny moments. But by halfway in, I was hoping it would end soon because it was just boring.<br><br>The best thing I can say is that this movie will have you wanting to visit Bora Bora because of all the beautiful scenery. Other than that.. meh.","user":"barnstormer-2","rank":[104,148]},{"title":"shockingly unfunny!","rating":2,"date":"11 November 2009","review":"What a wasted opportunity! They take 2 of our finest comedians, a beautiful cast of hard working actresses, and a great tropical setting and it comes out a stale, lifeless. laugh-free mess. Man, this was painful to watch. Vince fired off a few smile inducing one liners in the start-up domestic setting, and that was the last smile they got out of me. Once the cast was moved to the tropics, everything went wrong. Male on male embarrassment was overused -- about 5 times. Vince tried a few off the wall diatribes that fell flat. Young women swoon over Jon Favereau (huh?!?!) and he ignores the fabulous Kristen Davis?! The pratfalls to marriage are glossed over and play out badly. Every scene seems to last about 5 beats too long. Favereau gets not one, but two masturbation scenes. What??! Neither comes even close to delivering any humor. All 4 couples have shaky or totally damaged relationships and then in a 10 minute whirlwind finale, all solve their problems in a totally superficial way. And I couldn't possibly have cared less about the \"Guitar Hero\" duel. Yikes!! <br><br>I guess I blame the writing for being witless, shallow and lazy. The actors take that material and lay an egg with it. And a 1st time director (the legendary \"Ralphie\" of \"Christmas Story\" fame) either couldn't see it or was over-matched by having the writers and producers in front of the camera.<br><br>A huge disappointment for me, and shocking that this dribble can gross over $100M at the box office. Any evening of bad TV sitcoms would be just as \"enjoyable\", and $9 cheaper.","user":"bobm5508","rank":[105,160]},{"title":"DVD bargain bins beckon","rating":4,"date":"7 October 2009","review":"I'm unsure what is more worrying, that Vince Vaughn and Jon Favreau starred in such a mediocre comedy or the fact that they wrote it. Good friends and regular collaborators Vaughn and Favreau have had mixed results in their working partnership: Swingers is a bona-fide cult classic which tore up the indie circuit back in 1996; Made was a disappointment to all those expecting Swingers 2; The Break-Up was a successful guilty pleasure and Four Holidays (Four Christmases in the US) flopped massively at the US box-office. Where does Retreat fit in? Somewhere near Four Holidays – but at least they didn't also write that.<br><br>The target audience was obviously never decided upon as the humour seems to cater for everyone. One minute there are mature, real life moments that firmly fit into the \"funny because it's true\" category, the next there are gags revolving around untimely erections and masturbation that would be right at home in American Pie. Done in the right way and on their own either of these forms of comedy can be brilliant, however mixing them together makes for a muddled experience. There are a few hilarious scenes – the yoga session undoubtedly the most memorable – just nowhere near enough.<br><br>Of the cast Vaughn and Akerman come out best, their natural chemistry and adroit comic timing going a long way to keeping the movie afloat. The others don't fare so well. Favreau needs to leave the acting business and focus on writing and directing, it is practically impossible for him to be amusing on screen. Bateman, Bell, Davis and Love all fail to ever get us laughing, whilst the extended cameo from Jean Reno is possibly the worst stuff the experienced Frenchman has ever put on celluloid.<br><br>If you are looking for an easy comedy with fabulous locations (and women) then this might do the trick, but I definitely could not recommend spending your had earned cash to see this at the cinema. DVD bargain bins beckon.<br><br>2 out of 5 (1 - Rubbish, 2 - Ordinary, 3 - Good, 4 - Excellent, 5 - Classic)","user":"Troy_Campbell","rank":[114,178]}]