[{"title":"A very fun film...","rating":8,"date":"26 January 2012","review":"What a wonderful, fun film! The first thing that struck me right away was the film's score. Fantastic choice of music throughout. &nbsp;The tracks were fun, playful and also dark and suspenseful, all at the appropriate moments. &nbsp;<br><br>SPOILER AHEAD<br><br>Script was tight with some great one liners. The film was shot really well. Winning moment when mr mckee is standing at the end of the diving board, pauses, reaches down, collects himself and chugs from the bottle THEN does the shot. &nbsp;Perfect finish with \"drink king\" splashing into the pool. &nbsp;Good shot at the end too with Sam atop the school roof. &nbsp;Very iconic.<br><br>The film followed several stories that intertwined and worked really well together:<br><br>1 - teachers searching for meaning (cap, hutz) 2 - kids (freshmen) turning into men (sophomores) 3 - a father trying to find his way (mckee) 4 - students wanting to honor their heroic teachers 5 - young boys just being young boys (one especially who is learning lessons of passion/love)<br><br>All in all, a great effort by the director and his team. Beideck has a great eye and ear for film making. I look forward to his next project!","user":"Bottsie33","rank":[4,8]},{"title":"Dead Poets Society with a splash of Porky's","rating":9,"date":"29 January 2012","review":"For me Sophomore was a combination of Dead Poets Society with a splash of Porky's (both of which I loved) It was extremely well written and produced and some really good acting from the likes of Amanda Plumber, Patrick Warburton, Robert Keiper, Erin Foley and some surprising performances from the younger kids. There were numerous hysterical scenes that are not to be missed and well executed. There was a real through line that kept the film going and kept the audience interested and caring about the characters and their development. Nice to see something that was fun and entertaining. Go see it you'll be glad ya did!","user":"chennelly-278-679029","rank":[6,14]}]