[{"title":"Send someone to the cave in search for logic please...","rating":4,"date":"17 March 2010","review":"Descent 1 was probably one of the best Horror-Movies in the last decade. At least in my opinion that is. It had good actors, a great setting and interesting monsters. All things missing in most Horror-Flicks these days. When Sarah got stuck in that tunnel i thought my heart just stops beating. And there were not even any monsters in that scene. It were scenes like that, that made it a great movie. They never explained anything, you never knew what really happened. Did Sarah (and the others maybe too) just snap and did she kill all her friends? Were they only hallucinating? The sequel was a sure thing after the success. And a sequel of course destroys all of that. They need to bring explanations in a sequel, otherwise it's only lame. The story needs to be pushed further, that's what sequels are for. Descent 2 has no real story. A chubby sheriff forces a traumatized girl into a cave again, in which she nearly died shortly before? That's how they wanted to bring Sarah into the new Movie? Why did'nt they just use the other ending of Descent, where Sarah never escapes the cave? That way it would've made so much more sense for her to be there. How this chubby sheriff thinks he can climb down in that cave, makes you wonder too. He'd never be able to come very far in a cave like that. Then they find the camera, used in part one and you get proof that those monsters were not hallucinations of Sarah, they're on Film. One after another gets killed very bloody. Then they find Juno! Yeah the Juno we saw die in part one. The Juno who got jumped by twenty of these monsters after Sarah injured her badly. But we are to believe she survived all that. She became in the two days between part 1 and 2 an amazon-like fighter without any bad injuries. WTF? And she tells the others, she'd know the exit. So why is she still down there then and has'nt escaped already? The stupid sheriff meanwhile handcuffs Sarah to himself? Great Idea! No, actually more a desperate attempt to add some tension to the story. Things of course go wrong and the sporty sheriff of course falls down into a hole while Sarah lies above on the Ground screaming in pain. Instead of pulling him out of the hole (I mean, there were THREE girls there!) they decide to cut of his hand in a very bloody scene! Then Juno dies! Why pretend she survived only to kill her minutes later again? Sarah dies too. The other girl escapes the cave. But then the man that brought Sarah to the Hospital in the beginning of the movie finds her in the middle of a giant wood and knocks her out and brings her body back to the cave, apparently in order to feet the creatures. That's the end of the Movie. You never get to know why he did it, or more interesting why he did'nt do it to Sarah in the beginning, nor how and what he knows about the monsters. All in all this is not a real sequel but a poor try to re-tell part 1. You do not find out anything new. Nothing really interesting happens. And the thing with the guy is really stupid. It's a gory Horrormoie with some nice bloody scenes in it. But you'll find yourself desperately looking for some logic.","user":"patrigan","rank":[99,106]},{"title":"The Descent Part 2: A descent into disaster.","rating":4,"date":"27 April 2010","review":"Goodness. What a horrible, horrible follow-up to one of the best horror experiences of the past decade.<br><br>Where the first film was suspenseful and claustrophobic, this film displays constantly open cave dwellings and is repetitious to the point were no suspense can be truly built. I swear this takes place in an entirely different cave system, despite the film claiming it's supposedly the same exact one. Not even the revisited stomping grounds look the same.<br><br>The original film also used light sparingly in an attempt to actually make the audience feel as if they were trapped in a cave with the cast of the film. This sequel constantly shows bright surroundings, with light coming from unseen sources--particularly overhead, making it feel as if these characters aren't inside a cave system in the first place. Apparently the cave dwellers like to place small lava lamps and glow sticks around their territory because they... rave? I'm not sure where all this light was coming from! Strangely our characters can't seem to see what's going on even with all of this illumination and they keep bumping into each other in the \"dark.\" Maybe there were budget problems but that doesn't excuse the lousy script and characters. Shauna Macdonald tries her hardest to keep the film afloat (she's pretty solid with what she has been given to work with), but I imagine this would be like what Sigourney Weaver would be doing had she been trapped in an AVP film. She seems like the only honest character in the film, suffering from the events of the prior nightmare, but the supporting casts around her are nothing more than bumbling idiots.<br><br>You don't feel anything for any other member of the cast. Despite David Julyan's score swelling in some of the fateful scenes, I felt almost no emotion behind any of the events this time. None of the deaths or tragedies make an impact like the deaths of those in the original movie. In fact, one scene at the end tries to tie up a major story thread from the previous movie, but it simply comes off as tacky and against the grain of the characters we have come to know.<br><br>The final nail in the tragically shoddy coffin is the ending, which is also funny whether intentional or not.<br><br>Related Recommendations: The Descent, The Thing, Eden Log, Pandorum, REC, Cube, Pitch Black","user":"TheDeadMayTasteBad","rank":[68,81]},{"title":"More of the same but so what?","rating":13,"date":"13 May 2009","review":"Viewed at the Marche du Film, Festival de Cannes 2009 <br><br>Picking up almost immediately where The Descent left off, the bloodstained Sarah has made it out the cave system, is taken to hospital and then back into the caves as an unwilling member of a rescue party to find her missing friends.<br><br>If you saw the first film, then you know what happens in this one. If you know the horror genre, then you know who will get offed, too. None of which matters a hoot, because familiarity breeds respect and cast, director and writers, deliver exactly what viewers want. There are the crawlers, lots of blood, some nicely delivered shocks, plenty of gnarly special effects and women getting down, dirty and deadly with climbing axes, bare hands and lumps of rock.<br><br>Because all concerned have resisted the urge to widen the story, introduce new things for the heck of it (such as, I dunno, flying crawlers), The Descent: Part 2 is actually much stronger than is usually the case for sequels.<br><br>A left-field twist right at the end could be a set up for part 3, but it's hard to tell. While it didn't come as a surprise (those horror genres again), it did feel a bit tacked-on. But that's a very minor quibble and does nothing to detract from what is a great piece of horror entertainment and a worthy successor to its predecessor.","user":"Simonster","rank":[121,156]}]