[{"title":"Lousy Chinese movie","rating":3,"date":"31 August 2019","review":"Cringe worthy, some bad effects, horrible acting. Only China giving it good reviews. Truly appalling.","user":"thomasteckhin","rank":[11,18]},{"title":"rigid propaganda film","rating":3,"date":"2 October 2019","review":"The rigid propaganda film fully embodies the reality of the current system that only contends for contempt and only calls for rigid slogans, regardless of whether it is black and white. From the beginning, it shows a logical black hole. The firefighting needs to take the bridge. The fire brigade is set up unreasonably. The hot pot restaurant is on fire, which means that a lot of oil and water are fired.","user":"yoggwork","rank":[9,15]},{"title":"INCREDIBLE FIRE FIGHTING ACTION - FUN STORY","rating":9,"date":"20 August 2019","review":"Made in China, this film felt as big and action-packed and stylish as any Roland Emmerich (DAY AFTER TOMORROW) or Michael Bay (ARMAGEDDON) movie. Every scene had firefighters surrounded by walls of fire, explosions, collapsing buildings, flaming oil spills. It was really an amazing piece of movie making, I have no idea how they pulled off all the stunts and action. Everything looked VERY REAL that I was afraid for the actors, the scenes were that intense. The concept was cool and simple (slight spoiler here)--a fire starts at a port area in China, loaded with tanks of oil and chemicals. If some of the larger tanks explode, the blast and chemicals can wipe out the city--sending millions of people into a panic. We follow several main characters and one fire fighting squad trying to battle the blaze and cut off the flow of oil. A series of dramatic relationships get played out and kept my interest, but I was really just captivated by the stylish action and the smart way the stakes and danger kept increasing. It's a great example of what's going on outside the USA, the scope of the films and the great directors able to deliver mind blowing scenes and stunts.<br><br>Not to spoil too much, the story follows a massive fire that starts","user":"weisspop-63903","rank":[8,14]}]