[{"title":"Robert DeNiro and Al Pacino, actors of the most classic and memorable films now do a mediocre thriller","rating":6,"date":"15 September 2008","review":"Righteous Kill is one of those films that a lot of people have just been looking forward too because it has two of the greatest actors of our generation, Robert DeNiro and Al Pacino. I must add how I love in a lot of the TV ad's they're saying this is their first film together, true, it's the first time they are real co-stars together, but they've had two films already. Anyways, back onto the film, Robert and Al are both incredible actors, we know that, Robert is actually my favorite actor, so naturally I was looking forward to seeing this movie, I hate to say this, oh, man, I hate to say this, but this film was an utter disappointment. I'm not saying this was a bad movie, but this was a sad and very predictable thriller that could have been done with more average actors, Al and Robert are above this script and don't pull in their best performances due to that. The story is very mediocre compared to some of these terrific actors who looked so bored throughout the move.<br><br>Turk and Rooster are partners on the police force, having experienced over 30 years of constant bad guys going free, seeing the innocent's blood shed, and all the injustice in the world, they've almost lost it. Suddenly, there are murders involving the criminals they have arrested, along with younger officers, they try to figure out what is going on, but when one of the cops brings up that it might be a vigilante situation, Turk and Rooster are hesitant. Maybe they're hiding some secrets of their own.<br><br>Righteous Kill, don't get me wrong, it's worth the look, especially to see these cinematic legends on screen together, but like I said, for the script they were given, this was way too average and they are above it. I even hate to say it, this was very predictable if you've seen a lot of these thriller movies of today. Not to mention, I think Al Pacino, this must have been his third movie where he has worn that same leather jacket, I mean is it just me, or does anyone else notice this? Over all, it's not a bad movie, but it could have just been done with average actors, instead of all the hype that has been around it because of the actors. Just don't be fooled, it's a typical thriller, nothing special, I suggest waiting for the rental.<br><br>6/10","user":"Smells_Like_Cheese","rank":[249,312]},{"title":"Good Acting, Very Weak Script","rating":6,"date":"13 September 2008","review":"Turk (Robert De Niro) and Rooster (Al Pacino) are longtime NYC police partners, in this Jon Avnet thriller that has them trying to stop an unknown serial killer, a person who leaves a poem at the scene of each crime. Victims are law-breakers who were freed on legal technicalities. Two other cops, played by John Leguizamo and Donnie Wahlberg, become suspicious of the investigation, and this hampers the efforts of Turk and Rooster.<br><br>The script on which the film is based is rather poor. The setup is muddled; none of the characters are especially sympathetic, and secondary characters are not well defined. Further, \"Righteous Kill\" is not that much different from other serial killer or urban crime films.<br><br>The mood here is dark, and the tone is rather cynical. Characters go out of their way to telegraph their toughness by using lots of \"hard\" language. There's an edginess to the characters, and that's okay. But I could have wished for a character with some degree of softness. That would have provided much needed balance to the overall tonal savagery.<br><br>Without a doubt, the film's best element is the acting. There's not a weak performance in the bunch. Of course, the focus is on De Niro and Pacino. This is really their film. And it's their camaraderie, their back and forth playful banter, that makes the film worth watching. Production design and costumes are credible. Color cinematography is generally dark, consistent with the story's mood.<br><br>In spite of a weak script, \"Righteous Kill\" does provide some good plot misdirection that will leave viewers unsure as to the story's outcome. But the film's main virtue is the casting of De Niro and Pacino, two contemporary screen legends whose performances here are quite good.","user":"Lechuguilla","rank":[179,237]},{"title":"Disappointing thriller from legendary actors","rating":4,"date":"27 November 2008","review":"Surely with a movie that stars both Al Pacino &amp; Robert de Niro, you just can't go wrong? Both are legends of the big screen, and both are lauded for making legendary roles their own.<br><br>Yet sadly with \"Righteous Kill\" it just doesn't pay off. It's a thriller around a serial killer of various nefarious characters (pimps, drug dealers etc). The film begins with a confession by de Niro (a cop) that he is the killer, and we are led on a journey as he and his partner (Pacino) fight off another pair of cops who are suspicious that the trail leads to de Niro.<br><br>Having starred together in Heat, you'd expect some high standards, but for some reason the chemistry here just doesn't work and at points you think they really aren't interested. Fellow actors aren't too strong either, and much of the action seems to be just going with the flow. The storyline is interesting enough (with a good finale) but never seems to grip you through much of the film.<br><br>Overall, its a disappointment and you expect better from a film that has de Niro &amp; Pacino together in it.","user":"joebloggscity","rank":[60,78]}]