[{"title":"Disgraceful","rating":2,"date":"14 May 2009","review":"It seems the majority of the reviews thus far have been written by viewers who, after not enjoying either of the two previous films, decided to weigh in on what is ultimately a complete mockery of a great series.<br><br>First I'll tackle the good things about this film, of which there are few, but they deserve mentioning and as much of a reprieve as anyone can give them. Aiko Horiuchi replaces Takako Fuji as Kayako (creepy crackling voice lady) and picks up the role fairly well. Any fault in her appearance lies with the director, Toby Wilkins, who I will get to in a moment. The only other two notable performances come from the female leads, Johanna Braddy and Takatzuna Mukai and might not so much be notable as much as they just sharply contrast their terrible surroundings.<br><br>Now, on to the awful stuff. I think the large majority of the critics of the first two films, as I have understood them on here, find that the they were cryptic and difficult to follow. They have gotten their wish for an easy to interpret, spoon-fed, linear-flowing, cheesy horror film in The Grudge 3. Gone are the intelligent and subtle left-to-the-imagination disappearance kills. Artistic and suspenseful cinematography have been replaced by bland, formulaic and frightfully comical scenes. Brad Keene and Toby Wilkins have crafted an hour-and-a-half long slap in the face of director Takashi Shimizu who re-invented the haunted house horror film by making his own rules and breaking all the ones in the book.<br><br>Normally I am given pause when criticizing the artistic vision of writers, directors and actors who put their work on the line for what is largely a very unforgiving audience. In this case, however, the writer and director were toying with another man's vision and the hard work and creative energy he expended trying to bring something original into the world. I am dumbstruck by how a duo could miss the theme of a series so entirely. Ultimately, The Grudge 3 adds nothing to the mythology of the films and takes away a substantial amount.","user":"jpgoodson","rank":[48,63]},{"title":"Same Old Stuff","rating":4,"date":"1 February 2009","review":"To be honest, i was expecting perhaps something, probably too much, that would perhaps be original and new to the third grudge. But i think this was even worse than the others. Nearly the entire movie takes place in the same apartment building with the same stupid people who don't believe anything. This is simply the same story told yet again. The ending wasn't really surprising. It ends so that yet another Grudge can come out in the future. Grudge 4 will most likely be announced, if it's not already announced, in the near future. Rated R because more blood, but not really gore so much. i would say this is a decent movie other than the fact that it is the same old stuff. Come on Hollywood! Give us some originality! 4 out of 10","user":"HotShotC92","rank":[37,49]},{"title":"Every curse needs to to know when to hang it up and go home","rating":4,"date":"22 February 2009","review":"Okay but passionless tale of attempts to end the curse by a Japanese woman who goes from Japan to Chicago where the curse has situated itself in an apartment building. Much too by the numbers to really be considered anything (you could have called this anything and it wouldn't have mattered), this is a film where its clear its time to call an end to the series (hell, the Japanese did). You know you're in trouble when the creepy white skin kid now looks like a not so creepy white skinned teen with a bad haircut. Worse is the fact that the sounds coming from him are badly done and far from creepy. The series has lost its way and become a waste of time.","user":"dbborroughs","rank":[11,14]}]