[{"title":"Unoriginal but very entertaining","rating":8,"date":"29 September 2008","review":"In the plot of Eagle Eye,there are elements taken from the books written by William Gibson,the video game Portal and movies like Enemy of the State,I Robot and a long etcetera.But,in spite of that,I had a very good time watching this movie.There's no doubt it's unoriginal but the movie has an enormous energy that takes possession of the spectator,so the final experience is very entertaining.The action scenes are very well filmed : they are exciting and they feel realistic.The movie has a good tone because it never stops entertaining.The actors also did a good job.Shia LaBeouf,Michelle Monaghan,Billy Bob Thornton,Michael Chiklis and Rosario Dawson bring a lot of enthusiasm to their characters.I'm usually against the lack of originality but,there are some occasions in which,that fail is redeemed with a lot of good elements.Eagle Eye is one of that cases.I can easily recommend this movie.I had a very good time watching it and it did not bore me even a second.","user":"Argemaluco","rank":[205,288]},{"title":"A summer blockbuster at heart...just sit back and enjoy the incredibly unrealistic ride","rating":7,"date":"25 September 2008","review":"Ah, the seemingly perfect combination of Steven Spielberg, director D.J. Caruso, and everyman leading star Shia LaBeouf. These guys took us by storm with the pleasant surprise Disturbia last year, and pretty much anything with the name Spielberg on it has to be at least entertaining, if not excellent. That's what Eagle Eye is.<br><br>First off, I cannot stress this enough: don't take this movie seriously. Please don't get mad because the movie isn't realistic. I know it's unrealistic. You know it. Shia LaBeouf knows it. That doesn't stop Eagle Eye from being one of the most entertaining and effective thrillers of recent memory. Is it as smart or as gripping as other chase and mystery thrillers such as the Bourne series? Of course not. However, whenever Eagle Eye stretches our minds to the breaking limits with the insanity on screen, it manages to throw in a mind boggling action sequence or two right as we start to get mad.<br><br>The film, very well masked by trailers that really only show the beginning of the film and small pieces of the end, deals with cyber-terrorism and a secret military project dealing with destruction and national security. The US Secretary of Defense is portrayed (Michael Chiklis), it's incredibly unrealistic, has Shia LaBeouf, and has a prominent military character (Anthony Mackie). I can already here the Transformers comparisons flying in. The film also lacks in the originality department elsewhere, as elements of I, Robot and Live Free or Die Hard are also present and quite obvious.<br><br>I cannot give enough accolades to whoever thought up this action - Eagle Eye boasts arguably the best action sequences of the year. The CGI is seamless and more than worthy of an Oscar nomination. With car chases to rival the best of them, as well as one of the most clever \"on-foot\" chases I've ever seen within an airport, Eagle Eye never fails to grab your attention with the incredible action sequences.<br><br>Now to our cast, the headliners of which are two of film's biggest rising stars. Both live up to their names and reputations admirably. Shia LaBeouf revisits the \"troubled youth\" character he created in Disturbia, though his turn here is darker and has more depth. He really stretches some acting muscle in the beginning of the film, and it is because of this early success that we are willing to go along for the ride with him, following, trusting, and believing in his Jerry Shaw. Michelle Monaghan, long one of the most underrated in the business, also helps us believe in her character with a convincing show of emotion early in the film. The whole film, despite the action sequences, rides on the shoulders of the leads. If the audience doesn't like them, the film will ultimately fail. I'm pleased to tell you that they rise to the occasion and carry the film with ease.<br><br>Our supporting cast includes veterans Billy Bob Thornton and Michael Chiklis. Maybe it was the script, but Thornton's character was so stereotypical and overdone that it almost made him laughable - especially towards the end. Chiklis did great in his role as the Secretary of Defense - and the unfortunate \"victim\" of circumstance. Rosario Dawson and Anthony Mackie are acceptable in even smaller roles.<br><br>I remember when I watched my first D.J. Caruso film a few years ago (Two For the Money), and I remember how much I hated that film. However, Caruso has certainly grown as a filmmaker and has found his niche in the hugely entertaining action blockbuster genre, even if a lot of \"movie borrowing\" is done. This will be his breakthrough that will allow him a little more freedom as a filmmaker and possibly allow him to blossom into more than just an action film director. The touches of Spielberg are obvious, as the legendary director/producer's presence is only a plus.<br><br>Eagle Eye, in short, is a summer blockbuster released in September. It feels like a summer film, and has the components of a summer film: explosions, terrorism, and Shia LaBeouf. It is everything you want in an entertaining action thriller. Don't go looking for your super realistic epic here - Eagle Eye prides itself on blowing your mind every way possible.","user":"The_Amazing_Spy_Rises","rank":[168,244]},{"title":"If you have half a brain, wow did this movie blow...","rating":2,"date":"12 October 2008","review":"Where to start with this movie. There are so many unbelievable premises I don't even know where to start. Conspiracy theorists will love this movie. Everyone else will just constantly find themselves saying \"Riiiiight.\" &amp; \"You've got to be kidding me\" Let's just cover some of the premises we are asked to believe:<br><br>1. There is a Super-Super Computer (called Aria) designed to recognize threats to national security by monitoring every cell phone, computer, video camera, and radio frequency in the world. All by itself. Stupid evil Patriot Act.<br><br>2. Aria can make high tension power transmission lines overload and snap exactly where she needs to just so the wire can fall and kill someone that disobeyed her (Aria has a female voice).<br><br>3.Aria has decided that the President and his entire cabinet must be eliminated because they didn't listen to her advice on a missile strike in the Middle East, and thus must be a significant threat to the national security of the United States. Pres and his cabinet must be Republicans. <br><br>4. Aria can read lips and follow conversations just by observing the vibrations of the conversation on the surface of a cup of coffee. <br><br>5. Aria can hack into any security camera, cell phone, airport metal detector, remote controlled crane, etc. on a moment's notice and take control of them. Totally anonymously. <br><br>6. Aria can control anything and everything electronic in the world, but can't overcome some internal programming that prevents her from accomplishing her mission.<br><br>7. There is a newly discovered crystal that when properly triggered, a 1 carrot diamond sized piece of this crystal will demolish the Capitol building.<br><br>8. It seems we have remotely piloted vehicles (RPV) that look just like a Predator RPV sitting around the U.S. on military bases fully loaded with missiles and machine guns just waiting for a demented Super-Super Computer to take control of them. <br><br>9. Apparently it takes about 4 days to get to D.C. from the Midwest by passenger train. No wonder Amtrack is always in trouble...<br><br>10. If you slow your metabolism enough, you can survive a ride in the un-pressurized bay of a military transport aircraft.<br><br>11. A single missile strike in the Middle East triggers the 'real' Jihad world wide and threatens the U.S. and it's evil capitalistic interests.<br><br>12. If you dress like a cop, you can waltz into the Capitol building when the President and his entire staff are there and Congress is in session. With a sidearm. Oh, and there is a secret access tunnel under the Capitol.<br><br>13. The rest of the world has to pass through 20 layers of heavy security to get to Aria's secret level of the Pentagon. But, if you know the right computer, you can get direct access to Aria's level via a service elevator that is nowhere near any security.<br><br>It just goes on, and on, and on through the entire movie. Jeez I couldn't wait for it to be over and boy was I glad when it was! Uhg. Nothing in the movie was believable. I thought Vantage Point was a bad movie this was worse. Wait for the DVD.","user":"firedude34","rank":[162,252]}]