[{"title":"Good movie but took a lot of liberties","rating":12,"date":"12 October 2012","review":"This is a great movie. The story, acting, pacing, editing, etc. was just fantastic. Affleck's directing was solid, and the suspense will keep you entertained right through to the last seconds. I loved it. <br><br>It did have one irritating thing, though, kind of a big one. It pointed most of the accolades to Affleck's character and the CIA. This really was not true. It was Ken Taylor and the Canadians who really pulled 'the Canadian Caper' off so successfully.<br><br>\"When Taylor heard a few years ago that Mendez had sold movie rights to his book (which, to be fair, is much more generous than the movie about Canada's role), \"I said, 'Well, that's going to be interesting.'....\"The movie's fun, it's thrilling, it's pertinent, it's timely,\" he said. \"But look, Canada was not merely standing around watching events take place. The CIA was a junior partner.\"<br><br>\"The old postscript sent the message that, for political reasons, Canada took the credit. A sarcastic kicker noted that Taylor received 112 citations. The clear implication was that he did not deserve them.\"(Sept/Oct., 2012, thestar.com)\".<br><br>So the USA does another revision on history here. I believe 'Argo' goes this far. Yes, it's based on a true story - the movie does it's best to allude that it sticks to technical accuracy. And it really does, in some ways. Historical pictures of flag burners, rioters, gate climbers, etc.. up against Argo film stills run by during the credits make it seem that the facts were adhered to down to the tiniest detail. In reality, it wasn't Tony Mendez or the CIA who were responsible for the success of this operation; actually they were barely there. <br><br>Since the movie premiered, Ben Affleck has added emphasis on the movie postscripts since then that gives kudos to the Canadians' role. This was after Ken Taylor politely complained, as a Canadian would tactfully do. But Affleck did this only after pressure from Taylor himself.<br><br>I can understand the need to spice up events to make them as exciting and entertaining as possible, don't get me wrong. But this film needs to let the audience know that more explicitly than it does, even after the changed postscripts.<br><br>Still, a really entertaining and riveting film, very well done, and easily worth seeing. As a matter of fact, don't miss it.","user":"cheche1","rank":[375,484]},{"title":"Formulaic and historically inaccurate","rating":2,"date":"9 December 2012","review":"A reasonably competent movies from a technical point of view, but in other respects very misleading.<br><br>What I liked was Ben's restrained performance as the CIA field operative, and fun to see John Goodman in a straight role, but everything else was a bit lacking. Iran is an extraordinary, culturally rich and diverse country, but it is portrayed as populated entirely by thugs and fundamentalists, with the rest of the population invisible or cowering victims. I'm not being an apologist for a state with poor human rights and a dictatorial government - but it is not what is portrayed in this movie.<br><br>The basic fact that for a short period several American consulate workers were in hiding and were flown out under fake identities is true, but a lot is missed out. They first hid in the British consulate, but were moved to Canada House on British advice (as best as I can glean from various Internet sources), and the whole operation was a joint venture between at least three countries. What we get is a 'Yankwash.'<br><br>The film-makers have said that people forget that \"this is a movie\", and deliberate latitude and creativity is necessary for entertainment purposes to make it watchable and engaging. Okay, so if that is the case then what is left is formulaic: bad guys do something bad - maverick individual comes up with a daring plan - plan almost fails at the last minute - car chase - everyone alright now!<br><br>I'm sorry, but I just don't buy the excuses. This is a lazy way of film- making. The more accurate story could have been well told - with acceptable dramatic liberties such as condensing number of characters, timescales and even adding the (actually never happened) car-chasing-a- jumbo-jet-bit as they finally flee - without having to rewrite history t a degree that becomes offensive.<br><br>So, averagely enjoyable if it was fiction and a polished production from a acting and technical point of view, but a desperately inaccurate pastiche of what really happened - a great shame as the real story would have been just as good, if not better for being real.","user":"woodiphora","rank":[292,394]},{"title":"Based on the Truth?","rating":3,"date":"26 January 2013","review":"I am severely disappointed in this film for the main reason that we see US movie makers twisting the truth so that they come out looking like heroes. And I am not alone in this. The UK and French governments were quite rightly upset by the movie saying that their embassies had refused to help out the Americans in trouble. The UK embassy took the refugees in at great risk and kept them there until the Iranian guard was getting suspicious. Ben Affleck claims he had the refugees refused because he wanted them to appear to be isolated would be funny if it wasn't so clear that he actually wanted it to be the US who really saved them. At least the movie makers did have the Canadian embassy involved as it had been at the time. The movie should have said at the start that the facts had been changed in the name of drama. Movie makers have a responsibility when making movies based on the truth to let people know what really occurred. When they don't they are actually guilty of trying to change history and worse people believe what they see on the screen. And lastly seeing the guards at the airport chasing the jet in order to try and stop it was absurd. Why didn't they simply shoot at it or have the Iranian air-force force the jet to land. A joke of a movie so far removed from what actually happened and to say its 'based on the truth' really shows just how far the truth gets abused.","user":"jamesthealchemist","rank":[212,283]}]