[{"title":"A portrait of psychological pathology","rating":10,"date":"11 October 2019","review":"This film is a part of the \"On Cinema at the Cinema\" universe (podcast, Adult Swim series, many spin-offs), but it holds its own even without the background stories. (For those interested, there is a primer called \"Road to Mister America - 10 Minute History of On Cinema\" on YouTube.)<br><br>The mock documentary covers a run by Tim Heidecker (in character) for the office of D.A. in a small town, almost entirely for the purpose of taking down the D.A. who attempted to prosecute him for murder, for which he was let off by a hung jury.<br><br>The genius of this film is the exquisitely drawn portraits of characters drowning in their neuroses. In the case of the two stars, Heidecker is the overt narcissist (we are talking textbook), Gregg Turkington the almost-sweet covert narcissist-cum-middle-age-incel. Like all great comedic portraits of psychological pathology (Eric Cartman, the Bluth family, Fleabag) the performers thread the needle that has the audience not only wanting to hang out with these guys, but feeling great affection for them despite the awfulness of it all. Terri Parks, as Toni Newman, fits right in as she matches the subtle awkwardness of Heidecker and Turkington's fumbling human interactions that make up much of the humor.<br><br>Like \"Nathan For You\" and \"Between Two Ferns,\" series that also ultimately produced great movie-length projects, this is small-scale, ultra-human humor, and if you don't recognize these characters all around you or see them in yourself (I myself am part Gregg), the humor may zip over your head. Shout-out to the movie critics they are lambasting!","user":"hal1002","rank":[10,19]},{"title":"A delight","rating":10,"date":"12 October 2019","review":"Tim has created something special here, something witty and hilarious. Mister America is a laugh out loud comedy with a purpose. The genius improvisation by Tim while interacting with real people is the shining star of this film, but the amazing story pulls it together to be a movie worth everyone's time. Even people who weren't Heidecker fans before could very much enjoy this film. It feels real, and I applaud everyone who worked on it.","user":"cartsghammond","rank":[13,27]},{"title":"absolute slander to tim heideckers name","rating":7,"date":"11 March 2020","review":"Tim heidecker won that case fair and square and this movie hid information about tim heidecker such as how cool dekkar is or show us how many votes he got. you should all watch tim heidecker's great show decker to get insight into how these liberal spies control the media and convince that truth tellers such as tim heidecker are the enemy, when the liberals are the enemy. worst of all, they did not show us the hours of popcorn classics footage that greggheads such as me would love to see. how else am i going to learn about classic cinema?!<br><br>garbage movie<br><br>7/10","user":"coolomr2","rank":[2,3]}]