[{"title":"Bored","rating":4,"date":"21 December 2019","review":"2/5 stars<br><br>No spoilers.\nI've never seen the old original movie.\nThey clearly put a lot of work into the movie so I'm giving them some stars out of respect. Also I have seen worse. Also my disliking it might be in part to my usually not liking horror films and especially watching people being tortured.<br><br>Now I didn't hate the movie...but...if I had watched it in the theater I think I might've hated it. Especially if I had to sit through the whole thing in a theater. Most likely I would have walked out if that was an option. At home I was able to focus on some other things during boring the many boring scenes of which i was just waiting to be over. To clarify what I mean by hate...I hated Wolf Creek and I hated Devil's Rejects. So if you liked either of those then you might like this movie.<br><br>One of its only redemptions for me was the inclusion of a Radiohead song. Some of the acting was quite good too. I must also applaud it for what was, to me at least, an original and interesting concept. Granted I was quite bored by it, but I did find it a little interesting due to its originality. Without spoiling it I will say that during a minute in the last chapter of the film, when the screen is red tinted, was one of the most artistic moments I have seen in a film of recent years...granted what I mean by artistic...I am not a professional artist, so all I mean is simply that it felt like a painting in motion with a soundtrack in that scene. Kind of delightful.<br><br>Recommended? No. Unless you liked Wolf Creek and Devil's Rejects. That sort. Then maybe it is your cup of tea. Ever tasted straight yerba mate? Well....some people like it for some reason beyond my understanding so...yeah.","user":"davesawesomeinbox","rank":[11,13]},{"title":"Fans of the original will be highly disappointed","rating":1,"date":"20 September 2019","review":"How tf does this have a 6.8...this movie was as offensive a remake as the 90s psycho remake...","user":"snakehandler25","rank":[48,71]},{"title":"Starts off well, but after that....","rating":4,"date":"1 November 2018","review":"Suspiria, as I'm sure anyone reading this is aware, is a remake of the 1977 Dario Argento film of the same name. This time around, it's directed by Luca Guadagnino (Call me by Your Name) and David Kajganich (who worked by Guadagnino on A Bigger Splash and created the AMC limited television show \"The Terror\"), and expands upon the folklore of Agento's \"Three Mothers\" trilogy. 2018's Suspiria is less a remake and more of an expansion on the world of the Three Mothers, even boasting a post-credit sequence, like an entry in the Marvel Cinematic Universe.<br><br>Dakota Johnson plays Susie, an American ballet dancer who joins a world-renowned German dance company, that harbors a dark secret. It is, you see, run by a coven of witches. Anyone who discovers the secret, or goes looking too deep, disappears-usually in a violent dispatching. Their motives are unclear, but they feed off of the energy of the young dancers and when one goes missing, it's easy enough for them to find another to replace her.<br><br>Tilda Swinton plays Madame Blanc, the face of the dance company, a dancer and a dark entity that takes Susie under her wing. The most interesting scenes in Suspiria deal with their relationship. They're at once predator and prey, mother and daughter, and two old souls who've known each other since before time. Their interactions, and the way they involve, showcase a much, much better movie than the one we ended up getting.<br><br>The problem with Suspiria is that it's a mess-in every conceivable way, it's a mess. As a horror movie, it isn't scary; the scenes of suspense are taken to comical extremes. Whether these comical extremes are intended or not are up for debate, and in a better movie, that would be a subject of interesting conversation. Here, it's simply confusing. As a drama, it's incoherent. Twists in the plot occur without any real logic behind them. As a horror fan, I love movies that boast their own kind of self-contained logic, but that requires a certain suspension of disbelief that Suspiria just didn't earn.<br><br>Suspiria is a unique paradox of having both too much and too little plot. It has too much plot dedicated toward dead-ends and too little dedicated to big reveals, where they wind up confusing and pointless. In a movie where about five notable things happen, to say its 2.5-hour-long run time is bloated would be a generous understatement. In what will surely become the film's most infamous scene, Susie dances, while her movements magically contort and mutilate another dancer. This scene goes on and on and on, and the thing is, it's not even particularly well-edited. Susie will do a pirouette, and the victim on the receiving end of it will... just sort of crash into a wall, or her jaw will unhinge. None of the movements match. It would have been interesting to see one movement darkly mirror another, or vice versa, but instead it looks like we're watching two unrelated occurrences take place. It's like watching someone eat cereal juxtaposed with a violent car wreck.<br><br>I don't believe it's a spoiler to reveal that Tilda Swinton also plays the character of Dr. Josef Klemperer, because it's worth noting that her performance as him makes zero sense in the context of the movie. It's a distraction. She also has an annoying acting tic as the doctor in which she clacks her jaw or smacks her lips every three seconds or so. It's a bizarre choice that I think the filmmakers were proud of, but was a miscalculation from beginning to end. In an interview, David Kajganich said, \"Both Luca and I were adamant that the male gaze never intrude,\" and if that was their thinking here, it was a total failure.<br><br>Some of the more head-scratching decisions in the film can best be summed up the the terrorism subplot, an event never directly witnessed, but terrorists have kidnapped a group of people and a days-long event unfolds surrounding the school. At first, it adds a certain ambiance to the film, and it works really well in establishing the unease of the world outside of the dance company, as though the coven of witches are affecting the world at large around them. A girl named Sara (Mia Goth) hears something and pokes her head outside and says it was a bomb, that she can smell it. This helps put us, the audience, in the world with these characters. And then, this plotline just sort of drags along and becomes, strangely, a series of news reports, as though the movie we're watching is being interrupted by an unrelated documentary. It never ties into the narrative as a whole, it's just a distraction that, like the Tilda-as-a-doctor story, should have been left on the cutting room floor.<br><br>The film's finale, in which everything comes together, just sort of staggers into place. Usually, getting everyone together all at once for the finish requires events established earlier, where a character will do this or that and everything pays off. This is just a scene that sort of happens, doesn't have any real tension, and contains revelations that undo the entire plot that had preceded it. It's also an extravaganza of terrible-looking effects and smeary frame rate that looks like it was inspired by the German shot-on-video horror entry The Burning Moon, but The Burning Moon was made for maybe a few thousand dollars and is genuinely unnerving.<br><br>To me, it feels like 1977's Suspiria is the remake. It feels like that film took the 2018 version, looked at all the plots that went nowhere, trimmed them out, boiled it down to its purest essence, and made a crack rock of horror. The problem, I suspect, was the director's desire to make this the first part of a trilogy, instead of a standalone movie. So, as a result, we're left with some threads that may pay off later, but sure as hell don't pay off here.<br><br>Suspiria is going to be a love-it-or-hate-it type of movie. I could see loving it, it just had a certain divorce from reality I didn't think was earned; its surreal qualities weren't enough to afford its more outlandish aspects. Its grounded-in-the-real-world vibe clashed with the horror instead of holding up a mirror to it.","user":"scrappybilly","rank":[482,816]}]