[{"title":"2.9? Really? Come on, that's not being fair, this was a decent movie","rating":6,"date":"27 August 2008","review":"I know that this movie is getting a lot of hate, but I still wanted to check out The Longshots, once again, this is a movie that I am just baffled by all the hate. I thought this movie was actually decent and watchable, I know that the main reason why this movie is getting the bad reviews from IMDb users is because of Fred Durst, not to mention that everyone seems to hate Ice Cube's career choices. But honestly, this movie was inspiring and uplifting, there wasn't any harm done in this movie and it was different from other sport movies. We are used to the underdog usually being a guy in these movies, it's because of race, money, looks, or mental disabilities, for once we have a movie about the pressures of being a girl who is into sports who also enjoys being a girlie girl as well. The Longshots is also fun to watch and doesn't fall flat or becomes predictable like most sports movies.<br><br>Jasmine Plummer is a loner at her school, always having her head in a book, her mother works long hours and her father abandoned them. Her mom asks Curtis, Jasmine's father's brother, to babysit her after school while she's working, Curtis complains all the way and even has to be paid to do the job. But when Curtis plays ball with the town minister, he discovers that Jasmine has quite an arm and makes her try out for the football team while he trains her. Jasmine takes back the team's loosing streak and she and Curtis start to finally love each other.<br><br>The Longshots isn't movie of the year and it's not the best sports movie either, but I thought it was a decent movie to watch. Like I said, it's different and I thought for what everyone was expecting, Fred Durst did a good job of directing and Ice Cube is a lovable character that makes a great role model. I would recommend The Longshots for a matinée or a rental, don't take the IMDb rating so seriously, because I think it's just one of those hater's issues where the people who think it's going to be bad automatically just vote 1 without seeing it. So give this movie a fair chance, it's a good family movie to watch.<br><br>6/10","user":"Smells_Like_Cheese","rank":[32,40]},{"title":"just Ignore the low rating!","rating":10,"date":"6 October 2009","review":"A very good movie, Long shots is based on a true story of a run down town and a young lady that achieves confidence on the football field. Against all odds, the town as well as the girl learn to achieve simply by watching the girl overcome obstacles on the football field. This movie is good for all ages to see due to it is positive and it shows that anything can be done if you put the proper effort into it. The movie displays decent acting, humor and drama. Ice Cube, Keke Palmer, Tasha Smith, Jill Marie Jones, Dash Mihok did good work. The acting is very nice, Ice Cube, yes, (I've enjoyed his acting since the Boyz N the Hood days), Keke Palmer very believable as a tall misfit Jasmine Plummer, and the supporting cast. There's even a cool cameo by Garrett Morris (Saturday Night Live fame of the Chevy Chase / Steve Martin era). You won't be disappointed with watching this film.","user":"mosaddeghian","rank":[8,9]},{"title":"A warm family movie","rating":8,"date":"28 February 2009","review":"My entire family enjoyed The Longshots, based on the true story of an eleven year old girl who played quarterback on a Pop Warner football team. The movie makes no pretense of being the world's greatest sport movie. It is however an inspiring, wholesome story. Both Ice Cube and Kiki Palmer are excellent in this movie.<br><br>As the parent of two children of color, I appreciated the fact that even though the lead characters are African American and many of the other characters are White, race was not an issue in this story. Both my 11 year old daughter and 13 year old son (who is a quarterback) enjoyed the movie without feeling preached to. The Longshots is especially appropriate for that age range.<br><br>The Longshots might have a fairly narrow audience. It is not for young children, and is probably not exciting enough for older teenagers and many adults. The situations are not over dramatized to increase the tension in the story. The Longshots is an inspiring film that especially should be seen by pre-teen girls and their families.","user":"gkellymath","rank":[4,4]}]