[{"title":"So much wasted potential!","rating":2,"date":"18 January 2020","review":"Damn. You know when you watch the first 10 or so minutes of a flick and are excited about what's to come because the setup leaves room for endless possibilities? And then, you feel a punch to gut as almost every piece of potential is wasted and when the movie concludes, you are just dumbfounded as to how they messed it up so bad. That's the best way to describe \"Alone.\"<br><br>A blind woman who suffered some kind of loss (we know she lost a baby but we do not find out how or any of the circumstances surrounding it) goes to a secluded cabin to write. We know she knows the owners as they have invited her but due to only cryptic dialogue (thanks writers), we have no idea of the relationship between the woman and said owners of the cabin. The blind woman being afraid trope has been done to death but it does add a few moments of suspense here, especially when the audience knows something is going on at this cabin.<br><br>Then the movie stops and changes course, focusing on a group of very (so so very) unlikable teens to early 20 somethings who venture to the cabin for some fun. They are extremely annoying, with the usual bad dialogue we have come to expect. As it turns out, these characters are mostly one-dimensional who will meet their end in ways that are somewhat satisfying but you don't care all that much because they haven't been properly built up.<br><br>It has a very short run time and the final 20 or so minutes is a repeat of what we have already seen but this time, showing us what really happened, which you could have guessed without them even showing it to be honest. It was painfully obvious what was going on. Between the bad writing, a range from ok to bad acting, and a plot that both left too much out and laid the truth on a bit too thick, this was just a mess of missed potential.<br><br>It could have used a couple of redo's in the script and a better cast, though I'm sure budget constraints played a major role. Just disappointing.","user":"natnyc9111","rank":[10,12]},{"title":"Who really thought this was a good idea.","rating":1,"date":"20 January 2020","review":"Had no idea why any character did anything. Also they recycled what seems like 20 minutes of footage.","user":"d_harvell","rank":[6,7]},{"title":"One the worst films I ever watched. Stay away!","rating":2,"date":"18 January 2020","review":"The plot is so unbelievable as to have comic effects.","user":"robertopoletti","rank":[5,10]}]