[{"title":"A shabby patchwork quilt of other movies' ideas","rating":3,"date":"19 March 2010","review":"Just got back from the theater--walked in the door and turned on the computer--and am in agony! I was really excited about this movie and looking forward to seeing it ever since the previews came out. But, boy!, was I disappointed. All of the cute stuff (and pretty much the only cute stuff) was contained in those previews.<br><br>There is nothing original, and nothing funny enough or well-acted enough to make its unoriginality interesting. Jennifer Aniston did a decent job, given what she had to work with (though she does act like she does in most of her other movies). But the writing wasn't good, and the plot was weak and all over the place. Most everything you see, you've seen before--just done better somewhere else--and all of it combined into something very hodgepodge. It's like the storywriters just took a \"pinch of this\" and a \"dash of that\" from various comedies, romances, and action adventures, and tried to make a soup out of them.<br><br>The music was so bad I'm even giving it its own paragraph. I had no idea the music would make such a difference, normally I don't notice it's even there. Not so on this one! It was often agonizingly out of place, where you had to wonder what the score writers were thinking, or why they picked the song they did.<br><br>I left twice for the concession stand, and didn't even care to ask what had happened while I was gone. There were times I found that I was even having to remind myself to pay attention to the dialogue. As I don't go to the theater often, it's usually a treat to me, and most of the time I enjoy whatever I'm watching simply because it's relaxing and a chance to be out. But for once I was actually bored. It was about the quality of a TV show, but unfortunately lasted the length of a full movie.<br><br>The romantic/action with husband and wife fighting-yet-finding-they-might-still-love-each-other plot has been done before much better. \"Mr and Mrs Smith\" was GOOD. \"Fool's Gold\" was decent. \"Bounty Hunter\" was just downright poor. So disappointing!","user":"StarDragyn","rank":[83,113]},{"title":"Almost mediocre","rating":5,"date":"8 April 2010","review":"Andy Tennant's movies have been hit and miss. He directed Anna and the King and Hitch, but also Fool's Gold and this. He should have a better hand at choosing his scripts by now cause this one is a mess.<br><br>It's a hybrid of romantic comedy and action movie. It fails in both categories. The characters are one dimensional and under developed. If it weren't for Butler's natural charm I would've ended up hating his character, a drunken gambler who got thrown out of the police force. The action is cliché for the small amount of time it graces us with its presence, and most of the humor falls flat, maybe because you've already seen/heard the jokes before, from other, better movies.<br><br>For all their likability, both Gerard Butler and Jennifer Aniston seem to be on auto pilot. Gerard is his own charming persona and Aniston is, well, Rachel from Friends, though they exhibit some chemistry. Neither will benefit from starring in this movie. Side note: Christine Baranski is wasted in a role far beneath her talent.<br><br>That's not to say this is a bad movie. It has some fun moments, though familiar, and it will not seem a total waste of time. On the other hand it isn't a particularly good movie and you will forget about it as soon as it is over.","user":"wiseguyro","rank":[45,60]},{"title":"I waited weeks for this?","rating":5,"date":"20 March 2010","review":"I was excited when I first saw the previews of this movie. I am a HUGE Gerard Butler fan and I don't believe he's ever done a movie with Ms Anniston. The concept was fair enough...a romantic comedy with a little suspense thrown in. I left the theater feeling...\"that's it?\" Sure there were a couple cute things here and there, maybe a little suspense, but definitely not enough to carry a movie! The pace was much too slow for me, although I'm sure the actors did what they could with the script they were given. I loved seeing Gerard in Law Abiding Citizen, but this was truly disappointing! I am a big movie fan, but I wouldn't recommend seeing this to any of my friends :(","user":"kowgirl_tina-1","rank":[97,139]}]