[{"title":"A Brilliant And Courageous Departure For Jim Carrey","rating":10,"date":"11 July 2009","review":"A packed screening at the Sunset 5 in Hollywood. The audience rewarded it with a heartfelt applause and me among them. A stunning surprise. The film starts by telling us the story is true, really, really true and that adds to the already enormous surprise. A con man in the vein of Leonardo Di Caprio in \"Catch Me As You Can\" that deep down is overwhelmingly honest. After years of being a wonderful father and husband he confesses to his wife that he's gay. He remains friends and close to his family. Ends up in jail and meets the love of his life. The love story between Jim Carrey and the astonishing Ewan McGregor is a first for the screen. Miles away from the wonderful Brokeback Mountain because here their love is public without borders. I totally believe in the flame that both of them ignite looking into each other's eyes. It is so intimate and real that I realized I had never seen it quite like this on the screen before. The fact that this film couldn't get a distribution is beyond me. I'm certain it's going to be one of the hits of 2009 and Jim Carrey as well as Ewan McGregor will get Oscar nominations. I saw the film on the 8th, 4 days ago and I've been craving to see it again ever since. Look at McGregor's face when he realizes this man really loves him. The tenderness is nothing short of breathtaking. As if all of the above wasn't enough \"I Love You Phillip Morris\" is hysterically funny. Highly and warmly recommended.","user":"marcosaguado","rank":[175,223]},{"title":"The Power Of The Truth","rating":10,"date":"13 July 2009","review":"It's more unique than rare that a film affects me this much. The center, the emotional center of Phillip Morris has entered my subconscious in a way that I can't quite describe. It changed my perception of things. This is the first time I see two men kissing that made complete sense. I believe and understood like never before the \"normalness\" of the feeling. I liked \"Brokeback Mountain\" too but in that case, the torturous path of self-loathing that the Heath Ledger character goes trough, kept me at the periphery of the story like a sympathetic, moved spectator. Here I was part of it, of them. I'm sure Jim Carrey and Ewan McGregor have a lot to do with it. No cheap shots, no low comedy. They are so true that you can't help loving them and rooting for them, flaws and all. I predict \"I Love You Phillip Morris\" will become the sleeper of 2009.","user":"the-ppfitzgeralds","rank":[255,357]},{"title":"Carrey and McGregor create a first.","rating":9,"date":"1 December 2010","review":"Just when I thought Jim Carrey couldn't surprise me anymore, even if he tried...bang! \"I Love You Phillip Morris\" Here Jim Carrey creates the most complex and complete character of his career. A bisexual co-man of all things. An amoral guy who finds love and when I say \"finds\" we see him finding it. The romantic entanglement of Carrey and McGregor is a real first because we, even the ones who don't quite get the same sex thing, gets it. I saw the love between this two men and I believed it. \"Brokeback Mountain\" was easier to believe because the tragedy filled with deceit and self loathing fit perfectly with what I, and many others I suspect, believe that kind of union may involve. Here I saw romance in Ewan McGregor's eyes. His disbelief that somebody loves him is out of \"The Nights Of Cabiria\" - I will certainly see this again.","user":"lifeinmovies-912-787319","rank":[75,102]}]