[{"title":"Yes it's a bit cliche but it's still cute.","rating":7,"date":"21 November 2019","review":"It's a Christmas romance movie , being cheesy is a given , the actors are likeable , the movie is enjoyable therefore it's actually a pretty good Christmas movie.","user":"Sherif_Ali1","rank":[87,105]},{"title":"Disregard History and Common Sense and Enjoy the Scenery","rating":5,"date":"25 November 2019","review":"My daughter and I decided to watch the movie together although we're miles apart. We synced our Netflix and began.<br><br>Daughter: LOL, this is so dweeby.<br><br>Mom: Like a thirteen-year-old wrote it. But the scenery is pretty.<br><br>Daughter: She's a teacher, and she has a guest house?<br><br>Mom: Everyone is wealthy in Christmas movies.<br><br>Mom: Ah, the old slip, fall, and catch. Now we just need the interrupted kiss and a snowball fight to complete a Christmas movie.<br><br>Daughter: I hit you with my car, and you're definitely crazy. Come stay with me!<br><br>Mom: Like a person in the 1300s who depended on hunting to eat would try to hunt a skunk! Stupid.<br><br>Mom: He's reading a menu printed in modern English! I can barely read documents from the 1700s.<br><br>Daughter: GROAN<br><br>Mom: DOUBLE GROAN (I have no idea what this was in reference to, but there were many such moments)<br><br>Daughter: That's the most accurate thing I've ever seen. Give a complete stranger with no driver's license who doesn't know how to drive the keys to your car.<br><br>Mom: Oh, the poor little girl living in a multi-million dollar housing development has no mittens.<br><br>Mom: Aha! Finally, the interrupted kiss.<br><br>Mom: What did the red light with the old crone mean at the end?<br><br>Daughter: I have no idea. For a sequel? LOL LOL<br><br>Mom: LOL Imagine a sequel to this.<br><br>Daughter: Well, sorry Mom. You pick the next one.<br><br>Mom: Hey, I'd rather have absurdly silly than boring, and this was very, very silly. The leads were cute. Too bad they didn't have good scripts to work with. Or any research at all.","user":"bojojoti-971-130131","rank":[68,82]},{"title":"cliche & feel good","rating":6,"date":"21 November 2019","review":"Very cliche Christmas film but it will make you feel good inside.The actors were likeable but I felt that none of it was very realistic, but then again, romance never really is. Moreover, with Christmas coming up I think it would be nice to have more romance films like this. I just wish this film was a little more thought out.","user":"iDaanie","rank":[33,40]}]