[{"title":"Best teen movie so far","rating":10,"date":"19 December 2010","review":"Me and a friend just started watching this movie this morning when it came on on the TV. We weren't expecting anything good at all (even though we like these kind of movies normally despite being a bit too old for them).<br><br>We were very pleasantly surprised though. The acting wasn't anything special and the story predictable and unlike the other reviewers here we couldn't really relate but there was something very special about it. The whole movie had that special something. Even the mean clique was exciting to watch.<br><br>Also, the soundtrack was AMAZING for this kind of movie. And comments such as \"Oh my god, since you weren't there the party was totally UNBLOGGABLE\" was incredible. <br><br>All in all we really recommend this movie for anyone wishing to waste away a Sunday morning.","user":"natalie-handel","rank":[9,11]},{"title":"A Clique Worth Joining","rating":8,"date":"11 April 2009","review":"Spoiled rich girl Massie (an excellent Elizabeth McLaughlin) gets a literal wake up call when her dad announces that their guest house will be occupied by his college buddy and his family. This family includes a daughter named Claire (Ellen Marlow), who is the same age as Massie. Massie, the head of a seventh grade clique called The Pretty Committee, does not like this newcomer at all. A rivalry between the two girls begins. Will they ever be friends? <br><br>Although many viewers of this teen movie will surely predict the outcome, it provides enough laughs and drama to please most of the young girls the film is aimed at. I personally felt for Claire, even when she stooped to sending false e-mails to Massie's friends. (Haven't we all done something awful like this that we later regretted?) My favorite member of The Pretty Committee is Alicia (Samantha Boscarino), a shopaholic who is as idiotic as she is beautiful.<br><br>The film was based on a series of novels by Lisi Harrison, which I never heard of prior to watching this movie. As with many book to film adaptations, there will always be (probably rightly) those who prefer the book to the movie. Still, to pass on this movie just because it's not like the book would be a crime. There are many movies I saw before reading the book, and after I did read it I became a fan of both versions.<br><br>The Clique is definitely worth the 87 minutes it lasts.","user":"Cardcaptor_Jim","rank":[12,16]},{"title":"Better than I expected, but still not good enough","rating":6,"date":"19 November 2008","review":"As a fan of The Clique Series, I was very curious to see this movie. Mainly because the entire world of Massie Block, her exclusive clique and Claire Lyons is so relatable. The actors were not very well-known, it was going straight to DVD and there wasn't much of a hype for it. And like many novels turned into movies I expected the worst. However after watching it all, I realized it wasn't half bad. Not amazing (or \"ah-mazing\") but still tolerable. And the acting was pretty good for teen actors who are starring in their first movie. In my opinion, the actors did a good job of embracing their characters - despite how some did not exactly fit the descriptions entirely. The script even stayed mostly true to the story. There were only a few things I was disappointed with though. First, even though the acting was tolerable, it wasn't always up to par. At times I found what they were doing to come off as forced, as if they didn't really know what they were saying. And sometimes there was just too much yelling I couldn't take it. Second the setting of the school (OCD) disappointed me greatly. I expected a wealthy, stylish prep school, decorated and all. But I guess there's only so much you can do with a school hallway. Despite the negative things though, I really enjoyed the high end fashion. It was a good break from the usual we see on the streets everyday. But, sadly, it's not the clothing that makes a movie. All in all, I would recommend this to my friends, other teenagers who want a good laugh or style ideas. Or even pre-teens looking forward to junior high. It may not be the next \"Mean Girls\", and sure the acting is so-so but it was certainly better than expected.","user":"ecstatic_xx","rank":[15,23]}]