[{"title":"Save your ears... Do not watch","rating":1,"date":"27 October 2019","review":"I'm only two minutes in and felt compelled to create an imdb account to rate this to warn others.\nThe voices in this animated movie are so grating that it has me on edge. As I write this, even my four year old son had to turn this film off. What a waste of money renting this movie.\nI have no idea if the story is any good but in my opinion, it is completely unwatchable so it is irrelevant.\nI'll say it again, save your ears and do not watch this movie!","user":"ms_carmstrong","rank":[7,9]},{"title":"Just Avoid.","rating":1,"date":"12 January 2020","review":"I honestly believe \"The Halloween Family\" could be used to mentally impede the development of any viewer unlucky enough to be subjected to the film in its entirety. And if not at least physically reducing the amount of brain activity present in the viewer, then playing this film on a 24/7 loop, could at minimum, be used as a form of torture at Guantanamo Bay, or a a similar CIA/CPC black site. This film is better just avoided.","user":"Krempel_Soup","rank":[1,1]},{"title":"So this is what happened to the leftover CGI animations from the 1990s...","rating":3,"date":"11 November 2019","review":"I sat down to watch \"The Halloween Family\" with my 9 year old son, and we were both liking the movie's poster/cover.<br><br>10 minutes into the ordeal, I called it quits and gave up. I just had my share of atrocious CGI animation of lanky movement and genuinely badly animated characters.<br><br>It should be said that my 9 year old son's interest in \"The Halloween Family\" was also quickly fading, but he at least managed to endure 29 minutes, then he tossed in the towel and called it quits as well.<br><br>I wonder how an animated movie like this even makes it through the first rough drafts and actually make it to the movie market. Because this was reminiscent of something that appeared to be a high school film making course final project for passing the course.<br><br>Save yourself the time, money and effort and stay well clear of this.<br><br>My rating of \"The Halloween Family\" is a mere three out of ten stars. Why? Well, at least they managed to produce an animated movie, and that effort alone does warrant some appreciation. But as for this being an entertaining animated movie that you just have to see? No, don't count on it.","user":"paul_haakonsen","rank":[1,1]}]