[{"title":"Not that bad!","rating":7,"date":"5 September 2012","review":"There's a handful of directors who stand as tall as Joe Dante when it comes to movies a kid/teen growing in the 80s grew up with. Joe Dante is a legend, directing such classics as The Gremlins, Explorers, Innerspace, The 'burbs and co-directing Twilight Zone the Movie and Amazon Women on the Moon. Such nostalgia, but like many of his contemporaries, he didn't really make anything noteworthy after those.<br><br>Needless to say I was still looking forward to seeing The Hole, which in paper looked like he was kind of returning to his forte - sort of family horror comedy. And that's exactly what it was! I'm already out of the target group, but still I really enjoyed the movie. It's finally a Joe Dante movie that we've been waiting for a long time.<br><br>The story is great, a mystery Hole in the floor. Quite a few clichéd horror moments, but that's totally fine, clichés are OK when you do it tongue in cheek and not too seriously. Still I must say I was a bit surprised how tense it got here and there. Spooky stuff.<br><br>One of the only real gripes with this movie is the fact that it looks a bit low budget (I'm not sure if 10 mil qualifies as a low budget, it's an awful lot of money). It's got a bit of a TV movie feel. No big stars, good looking but rather small scale sets. Still old Dante fans will love a few cameos and familiar faces.<br><br>Other gripe with the movie is that I don't find Chris Massoglias characters very likable. I didn't like him in Cirque du Freak and neither in this movie. The kid brother was so much better actor creating a much more likable character.<br><br>Having also seen John Carpenters return movie \"The Ward\", I'd have to say Dante won this round. I hope these two 80s superstars will still return to form with a real big budget movie showing the younger directors what they're really made of.","user":"rlaine","rank":[19,20]},{"title":"Fun scares!","rating":8,"date":"7 September 2010","review":"The Hole 3D (not to be confused with the Thora Birch vehicle of the same name from 2001) is a good old-fashioned horror yarn for youngsters. No gore, no nudity, just good scares! A grumpy teenager and his little brother move with their single mother to a small town. They soon befriend the beautiful girl next door and they happen across a giant, ominous hole in their basement. The hole is seemingly infinite as the boys conduct a series of experiments including lowering a night-vision camcorder down and throwing a handful of nails in (to tremendous 3D effect, as you can imagine). What they don't discover over the course of these experiments is that the hole, once opened, lets loose your greatest fear which then proceeds to stalk you. A simple setup, but it is used very well, not only for thrills but as a sometimes thought-provoking look at the fears that you don't realise you have.<br><br>The very obvious but extremely effective \"evil clown doll\" is great for scares and a hammy throwback to old-school horror of The Twilight Zone or The Outer Limits. The other \"fears\" are somewhat more cerebral and as the film progresses, some of the fun tends to get lost in the family issues storyline. However, it is a well-written piece and the script reveals drips of information at a suitably subtle pace. The young cast do very well in roles that should have been very annoying and there is an element of class to proceedings overall. While this is certainly not by any means an important or a very original film, it is great to see films aimed at kids that refuses to condescend to them. The Hole plays it for scares, and isn't afraid to do just that. Children will be terrified and delighted in equal measure. The 80's gave us kids' adventures that dripped with real danger like The Goonies or Labyrinth, and of course Joe Dante's Gremlins movies. These films were quite nasty, and unlike most of the saccharine rubbish kids are dealt these days, they are quite menacing. The Hole is a worthy successor to these films and isn't afraid to push your nerves just that little bit further than you might expect.<br><br>From the poster and trailer I expected a tween adventure with a supernatural twist akin to Are You Afraid of the Dark or Goosebumps? To my delight, this was far more enjoyable than just a silly kids' film. It is certainly directed towards young teenagers but the great thing about The Hole is that it is actually scary! This film is full of menace but keeps the tone light enough to maintain the element of fun. Dante keeps you on the edge of your seat with constantly mounting tension and silly jumps that make the audience giggle as much as scream. This is as fun as horror gets and for once the gimmick of 3D is used as just that... a gimmick.<br><br>Certainly not high-brow but lots of fun and scarier than you might expect!","user":"chaaa","rank":[66,78]},{"title":"Much better then expected. Still geared toward teens but reminded me a lot of \"Don't Be Afraid Of The Dark\". Entertaining. I say B","rating":7,"date":"12 July 2012","review":"\"You've got a gateway to hell under your house and that's really cool.\" Susan (Polo) and her sons Dane (Massoglia) &amp; Lucas (Gamble) have just moved into a new house. Dane is upset about having to move again and that isn't helping to make the move easy. When he meets the girl next door he finally has a friend and they start to explore the house. When the stumble upon a door in the floor of their basement then unknowingly open a gateway to hell and become haunted by their darkest fears. Going in I honestly expected this to be a cheesy teen-ager type horror. While it was geared toward teens this movie was actually not bad at all. This is a horror movie but it's done by the same director of the \"Gremlins\" movies so it's not scary scary but it is very entertaining and fast paced. There are quite a bit of disturbing scenes and images in this but nothing that will keep you up with nightmares so that is always good. The movie was made a few years ago and just now getting released but I would compare this to \"Don't Be Afraid Of The Dark\" in terms of plot and idea. If you liked that movie you will like this one too. I enjoyed it. Overall, an entertaining and a little creepy movie that was much better then I expected. I give it a B+.","user":"cosmo_tiger","rank":[14,15]}]