[{"title":"Complex and beautiful as life itself","rating":9,"date":"29 August 2009","review":"Still Walking is an intimate movie about a family reunion. Its observations about family dynamics are the most true to life I have ever seen. The movie paints the entire gamut of emotional family experience with delicate yet powerful brush strokes but it's not a sentimental film, nor an opportunity for actors to grandstand. It's Japanese, so all the strong undercurrents of emotion are held in check by equally powerful restraint (both cultural and directorial). A brother and a sister attempting families of their own go to visit their parents in Yokohama. The parents have lost a son and the family's devastation hangs heavy in the air. You can actually feel it bearing down on your shoulders from the first frame. Anybody who has ever spent the night at the house of relatives will feel the weight of family history that this film captures so truthfully.<br><br>The parents are engulfed by their quiet, ongoing grief and the surviving children resent all the attention given to the one who is not there anymore. The movie is surprisingly mordant, touching, cruel, sad, funny: human. The mother is this wonderful woman who cooks up a storm (I so wanted to be invited to that house). She is from an older generation, which means she has been forever in the shadow of her husband the doctor, cooking and cleaning and feeding the children, but she is not a pushover, nor a saint. She is mischievous, catty and petty, prejudiced, funny, generous and cruel at the same time. She is a marvel, and the actress who plays her is astonishing.<br><br>This movie has many emotional surprises that make the audience gasp, but they are presented with a sure, light touch, never falling into easy sentiment, never shying away from human complexity. It's a film about family, and love and duty and regret and it is stunningly beautiful.","user":"grandenchilada","rank":[49,52]},{"title":"A Meditation","rating":9,"date":"17 July 2009","review":"Few other nations can capture the beauty of family drama with such subtlety and grace as the Japanese can. Perhaps it is a blessed legacy left behind by the master Yasujiro Ozu who in his lifetime made over 50 films, all of which are family dramas that often dealt with generational gaps. Japan, more than any other nation struggles with the problem of generational gap, being a nation that has continued to endure conflict between the young and the old, the traditional and the modern. Stepping into Ozu's shoes is the acclaimed director Koreeda Hirokazu, whose films \"Nobody Knows\" and \"After Life\" has already garnered universal praises.<br><br>\"Still Walking\" begins as a family reunites to commemorate the death of one of its members. With new members joining the family and old wounds resurfacing, everyone tries their best to pass the two day gathering with as little problem as possible. Sounds simple doesn't it? Well, therein lies the plain and subtle beauty of the film. From a few words exchanged between the grandfather and his new grandson to the laughter of three children as they caress a blossoming flower, these simple moments will linger in your mind with tasteful resonance long after the film.<br><br>While watching the movie, I found it hard not to be immersed by the beauty of Japanese suburbia. I could picture myself - like the characters, taking a stroll on a simmering summer day with the cool breeze in my hair as the gentle picking of guitar strings play in the background. Or perhaps eating lunch and drinking cold ice tea on tatami mats as the wind-charm tickles with the slightest vibration. \"Still Walking\" is a meditation on life and death that may just move you to tears...without even trying.","user":"allstar_beyond","rank":[54,60]},{"title":"A sense of naturalism and simplicity","rating":8,"date":"5 October 2008","review":"A middle-aged brother and sister and their families visit their aging parents on the fifteenth anniversary of their brother Junpei's death from drowning while saving another boy. Relationships between generations are strained, however, and patriarch Kyohei (Yoshio Harada), a former doctor, does not hide his resentment for his surviving son Ryoto (Hiroshi Abe), an out of work art restorer. Selected as the best film at the Toronto International Film Festival in a poll of film critics and bloggers, Hirokazu Koreeda's Still Walking is a family-oriented comedy/drama about generational conflict and the consequences of loss. Unfolding in real time over a twenty-four hour period, it has been compared to Ozu's Tokyo Story in its intimate interchanges that accurately capture the way families relate to each other but lacks Ozu's warmth and subtlety.<br><br>The day is spent with routine activities such as preparing meals and playing with the small children. Kyohei remains detached and hides in his office, pretending to be occupied with medical business. He only emerges to bicker with his wife (Kiki Kinn) and play with his grandson. Ryoto, who did not look forward to the reunion, is put off by his father's disdain for his profession of art restoration and his coolness toward his new wife Yukari (Yui Natsukawa). She craves acceptance for herself and her son Atsushi (Shoehi Tanaka) from a previous marriage in which her husband died. A picture of the deceased Junpei is placed in the center of the Yokoyama family house reminding Ryoto that whatever he does, he cannot measure up to Junpei, who was to be his father's heir.<br><br>He also notices that his sister Chinami (You) has no such expectations and her life with her car-salesman husband and two children seems outside of the range of family conflicts. When the boy that Junpei rescued visits the family, sneering remarks are made about his bulky frame and lack of ambition and old resentments come to the surface. After Chinami and her family leave, it is clear that Ryoto wishes he had not agreed to spend the night but conflicts seem to soften with the passage of time. Based on a novel by the director and occasioned by the death of his mother and the discussions of his childhood they had during her last days, Still Walking has a sense of naturalism and simplicity that is endearing.","user":"howard.schumann","rank":[53,61]}]