[{"title":"Kingsley and Peck craft a new classic coming-of-age tale","rating":8,"date":"14 March 2008","review":"\"The Wackness,\" director Jonathan Levine's eagerly-awaited followup feature to \"All the Boys Love Mandy Lane,\" premiered at the 2008 Sundance Film Festival and was immediately acquired by Sony Pictures Classics. I wasn't able to catch it at the time. Fortunately, \"The Wackness\" was presented in a special midnight screening not on the official SXSW Film Festival schedule. It was a special treat and quite an unexpected surprise.<br><br>\"The Wackness\" is basically a two-man show, with Ben Kingsley and Josh Peck as psychiatrist Dr. Squires and his patient Luke Shapiro. The twist? One deals drugs and the other takes them. But guess who buys and who sells? And did I mention that Luke not only doles out weed to his doctor but also dates his daughter? Ahh yes...the plot thickens. Yet Squires and Shapiro forge an unlikely friendship not unlike two college buddies -- the boy is just a bit too mature for his age and the man a bit too immature, and they meet at about the same intellectual level.<br><br>Penned by director Levine, it's a complex storyline but \"The Wackness\" is ultimately a character-driven piece. Kingsley's performance is a tour de farce in a daring and risky role unlike anything we've seen -- this ain't your father's Gandhi. Josh Peck, best known as television's Josh of \"Josh &amp; Drake\" and to indie lovers as George, the tormented victim in \"Mean Creek,\" is the biggest surprise here. He carries this film on his shoulders like a veteran. Olivia Thirlby (\"Snow Angels,\" \"Juno\") is delightful as the object of Luke's affection.<br><br>Production values belie the film's modest budget, especially given the cost of a location period piece -- \"The Wackness\" is set in New York City 1994. Music of the era naturally provides the backdrop for the duo's drug-dealing days and party nights. Drugs (selling and taking) seem to be ubiquitous in the films I've seen here at SXSW and \"The Wackness'\" overindulgence can be hard to watch at times. But what could have strayed into a silly variation on \"Dazed &amp; Confused\" (or the recent \"Charlie Bartlett\") is, instead, a touching coming-of-age story as relevant today as ever. The fact that the film remains grounded in semi-reality is a tribute to the talents of Kingsley and Peck in the hands of director Jonathan Levine. This director is a force to be reckoned with now that he has \"All the Boys Love Mandy Lane\" and \"The Wackness\" under his belt.","user":"larry-411","rank":[83,110]},{"title":"The Wackness > All The Real Girls","rating":9,"date":"4 July 2008","review":"This might get me into trouble with the film elite, but I found this film so much more real and absorbing than David Gordon Green's \"All The Real Girls.\" They both deal with young men coming of age thanks to first love, but this film has such superior performances and writing. Expertly directed and stacked with some of the best hip hop of the nineties, it's a film that is hilarious, sad and moving, populated with great characters you'll enjoy spending a couple of hours with.<br><br>I really wish a film like this had found me in my teenage years, because it's so refreshing and honest. It's nice to watch a movie that celebrates the time honored art of owning and embracing the pain that makes you who you are.<br><br>People whine and bitch about the glut of hollow Hollywood formula flooding the marketplace, but a great little film like The Wackness with a strong voice is not getting the support it deserves.<br><br>The entire theater loved it, as did my friends I brought along who knew nothing about it.<br><br>Do yourself a favor and go see The Wackness. You won't be disappointed.","user":"quelindofilms","rank":[99,133]},{"title":"Far from wackness.","rating":7,"date":"3 August 2008","review":"From Luke's opening monologue set to the strains of old school hip-hop through to a beautifully crafted story that is both poignant and funny and Ben Kingsley's wonderful turn as psychiatrist Dr. Squires this film is a winner. Set in New York in 1994 the story follows Luke Shapiro as he graduates school and becomes a dope dealer full time. It's a coming of age drama of sorts but equally as he is struggling to come to terms with embarking on life after school, parents, peer pressure and girls his psychiatrist Dr. Squires, who he deals to in exchange for counselling, is also coming to terms with growing old, a failing marriage and drug dependency. The two form an unlikely bond, Luke is in love with Dr. Squires step daughter and Dr .Squires wants to recapture his lost youth which opens the way for some charming and damn funny moments. Kingsley plays the good doctor like a cross between 'The Big Lebowski's' the dude and a drug addled Terry Nutkins, it's a great role and another that shows just how versatile he is as an actor. Luke is played by local boy Josh Peck and as well as being a perfect foil for Kingsley he is also great in his own right, very reminiscent of the lead from Thumbsucker all floppy haired and wide eyed. The music mostly nineties hip-hop, like A Tribe Called Quest and Notorious B.i.g to name but a few is balanced with classic rock as the two now friends swap mix tapes. Well paced and effortless in its execution this should be as big as say 'Juno' but due to its content and drug references it probably won't be, but don't let that put you off seeing this great little film.","user":"come2whereimfrom","rank":[42,56]}]