[{"title":"007","rating":10,"date":"13 February 2020","review":"The best film in the era of Daniel Craig as James Bond. Supremely well acted. The best performances are by Craig, Dench and Bardem who are prize. Great action scenes, big issue that touches past Bond and M which little is known. Sam Mendes does a masterful job directing this installment of James Bond. Realmete with this film you can compare Danie Craig Sean Connolly.","user":"MR_Heraclius","rank":[43,50]},{"title":"Skyfall- 007 Reloaded!","rating":10,"date":"8 February 2013","review":"'Could we discuss the next part of your performance over that drink?' asks the glittering Severine (Berenice Marlohe) from a suave tuxedoed James Bond (Daniel Craig). And indeed, this 23rd Bond outing, superbly directed by the usually reliable Sam Mendes, does just that, pausing appropriately to settle down leisurely over a drink, for some flirtation, some tense verbal confrontation, some self-reflection and brooding just before cutting away to some clean-cut, thrilling action. The result is the uniquely named 'Skyfall' a Bond film so full of the vintage charm and charisma yet fashioned in modern, urban and instantly accessible style that it ends up being one of the finest films of the franchise.<br><br>Yes, Mendes' film is a solid revamp of the Bond franchise, bringing in welcome dollops of humor, luxury and sensuality that went missing from the franchise with the last outing. And impressively enough, there is enough emotion without slowing things down, enough tension and action without making it too frenetic and the pacing is so, so perfect that you seldom feel the film falling short or dragging too long.<br><br>Pretty much everyone would agree that the 60s were the heyday of the Bond films. Those Sean Connery-starrers were primarily all about the leading man and his ladies but each was fashioned with such a slick ease, wise-ass humor and layer-cakes of moments that we embraced them all as subversive classics. 'Skyfall' fortunately, is a film that reaches up to that caliber.<br><br>Clearly, the best thing about the film is the pacing. Mendes is in no hurry to let the film unravel. The story begins in Istanbul, with Bond and his side-kick Eve Moneypenny (a sharp-tongued Naomie Harris, smarter than ever), chasing down a man with a list. The action scenes come in neatly and the opening pursuit shifts from a hectic bike chase on the rooftops to the cliff-hanging fight on top of the train and it all looks truly spectacular.<br><br>The plot is simple enough- MI6 is under attack from a former agent- a renegade named Silva (Javier Bardem) who has a knack for orchestrating terrorist attacks with a simple click of the mouse. But trust me, this has to be one of the smoothest Bond outings in recent years; Mendes smartly and adroitly navigates the action from Istanbul to alternately grey and sunny London and from the stunning Shanghai to the villain's lair- ideally an abandoned island and finally in Bond's ancestral home in rural Scotland's foggy moors, setting the stage for a truly dramatic experience.<br><br>And, boy, it delivers. For all the charm that it delivers, this has to be one of the most intimately dramatic Bond outing since ages. The plot is about how the ubiquitous computer can be used as a weapon for security breach but more importantly, this is a film that pairs both Bond and his nemesis in the same light- both are tortured souls, both were MI6 heroes who had been left for the dead in the name of protocol and duty and M, played superbly by Judi Dench, looms like a domineering matriarch over both the men. Silva's angst is against M's cold-blooded dedication to her duty, and Bond feels some of it as well but the latter clings to his morals out of loyalty to his nation. The stakes are downright personal and high and clearly each scene of action or searing tension feels immediate, urgent and the film gels with us on a personal level.<br><br>But none of it jars. Smartly enough, everything is on an even keel- the action feels perfectly urgent but it does not stretch, the drama is poignant and painful, the humor comes in like a fresh breath into the taut proceedings and it all works impeccably as smoothly as the click of a mouse itself.<br><br>'Skyfall' also proves quite what everyone is saying since 2006's 'Casino Royale- that Daniel Craig is the best Bond we had since Connery. This is a film where he is never as before- instead of the hardened, brutal action hero we were handed last time, here is a more relaxed Bond, clearly at greater ease, flirting with women and sparring with M and Q (an impressive Ben Whishaw) with equal dry charm and sarcasm. He makes his one-liners blaze and his quieter moments are played out with a subtlety. He rules the film without trying too hard. It is a solid, compelling act.<br><br>And he is matched by the villain as well. Super performer Javier Bardem shows up in an unforgettable role as the menacing Silva, a man whom you might cringe at yet a character who stays with us as long as he is there in the film. He flips between smooth talking to a nasty edge with superb ease and his confrontation with Bond is clearly the highlight of the film. <br><br>This is also an action film where the cinematographer also stands out. The work of veteran lens-man Roger Deakins is clearly one of the best things in this film. Deakins bathes each frame, from the action and suspense to the more reflective and emotional sequences with a fantastic play of light, shadow, shade, texture and perspective. Everything looks stunning, perfectly placed and in balance yet urgent and explosive.<br><br>'Skyfall' is clearly a Bond film for the ages. The layer-cakes of vintage moments are perfectly underlined with a modern style- the scene between Q and Bond is a moment of self-reflexive humor, clearly revealing the generation gap between the two and the one between the new and the old Bond. Clearly, this is a film that has something for both the fans of old and fans of new. And that is a grandstanding achievement itself.<br><br>Thank you, Daniel Craig. Thank You, Javier Bardem and thank you, Sam Mendes, for making me believe in James Bond again.<br><br>Now, give us some more. <br><br>Ah! It was worth the wait.","user":"zzzoeb","rank":[64,89]},{"title":"Powerhouse of a Movie","rating":9,"date":"14 February 2013","review":"Since the site has 1164 reviews as of this writing I'll just throw in my own two cents.<br><br>Two of the world's greatest actors, namely Judi Dench and Javier Bardem, lead the way here. Daniel Craig, I thought, turned in another strong performance as the droll fearless 007.<br><br>There's also wonderful support from Ralph Fiennes, as the new Intelligence Chairman, Ben Whishaw as Q, Albert Finney as the caretaker Kincade, and Naomie Harris as Eve Moneypenny.<br><br>I found the film to be filled with humor and the special effects terrific. The movie is also very capably directed by the accomplished British director Sam Mendes.<br><br>Perhaps, my only criticism would be the grand finale which I felt was somewhat drawn out and could have shortened the 2 hour 23 minute duration.<br><br>I was surprised at the very negative reviews on the first page of IMDb. I found, overall, this new Bond film to be a powerhouse and I thoroughly enjoyed it.","user":"larrys3","rank":[51,71]}]