[{"title":"A Good Time","rating":8,"date":"19 October 2015","review":"Goosebumps is a fun, family friendly movie. It captures the nostalgia from back when I was a kid, and I thoroughly enjoyed the movie throughout.<br><br>The essential storyline is, monsters are released from R.L. Stine's manuscripts and cause mayhem through the town. We follow as the main leads attempt to put an end to the madness.<br><br>The actors do a decent job throughout, and Jack Black really excels as R.L. Stine. Aside from him, the main cast is made up of relative unknowns, however they do an adequate job.<br><br>The special effects are very well done, and the monsters look real.<br><br>Overall, I don't feel this movie is going to win any awards, but if you just want to have a good time at the movies, then go check it out.","user":"wjets9","rank":[78,103]},{"title":"For anybody that is a Goosebumps fan, or will be after this movie.","rating":8,"date":"26 October 2015","review":"The Goosebumps book series where a big sellers in the 90's, so was the T.V. series, which was The Twilight Zone for preteens. R.L. Stine proves he had a creative mind with such bizarre tales and some insane plot twist. So having some of the Goosebumps characters come alive in the real world, is quite a tribute to R.L. Stine's work.<br><br>Jack Black is quite enjoyable, seems to having the most fun has Stine, at times he is a little over the top, but in a good way. Odeya Rush is good has Hannah. But it's Dylan Minnette and Ryan Lee who play Zach and Champ, really bring the comedy here, those two have such comedic chemistry they are like a comedy team. The effects are incredible, an amusing CGI fest. The movie never takes itself seriously, if you like The Monster Squad(1987), so I'll bet you'll get an good ride out of Goosebumps.","user":"DarkVulcan29","rank":[33,45]},{"title":"Highly enjoyable film!","rating":8,"date":"16 October 2015","review":"I remember when I was young the Goosebumps TV show, but I was never got into it, or the books they are based on past the the point of just knowing who R.L. Stine is.<br><br>It's a perfect treat for Halloween as a group of children accidentally unleash the monsters from Stine's mind, by unlocking the books they were written into. <br><br>It's a fantastic adventure as Stine and this group of kids attempt to put his monsters back into the books.<br><br>It's a fun story even if you are not aware of Goosebumps, but I'm sure if you are a huge fan, you'll get a real kick out of seeing some of the monsters from your favorite book make an appearance on the big screen.<br><br>It's not just a fun film as some of the monsters were real creepy. Like the Gnome army, the giant prey mantis and especially a ventriloquist \"puppet\" voiced by Jack Black (who also plays a fictional version of Stine).<br><br>It's a great time at the movies.","user":"subxerogravity","rank":[56,87]}]