[{"title":"Intense adult drama about repercussions of violence and war","rating":9,"date":"28 October 2010","review":"This movie tells a story held secret by most people who write about the Holocaust, which is the crippling effect of the Survivors' war experiences on their children. Studies have shown that the children of Nazi Holocaust Survivors share many if not all of their parents' psychological issues, particularly depression and post-traumatic stress. This film has the rare courage and honesty to show the bleak emotional damage left by that war, not only on its direct victims but on their children as well. The portrait of the mother is particularly bitterly real -- her seemingly inexplicably outbursts and fits of violence a near-mirror of the unexplained violence she witnessed as a girl; her narcissism and coldness linked to her own abandonment as a girl. Again, a poignant and tragic reality of the psychological landscape of all survivors of war. The actors were superb, the dialogue actually worth LISTENING to. Haas and Lucas put in beautifully nuanced performances and Bisset was outstanding in arguably the best, most emotional performance of her career, and looking more beautiful than ever.<br><br>This is not an easy film. It is most definitely not a family film (there are explicit depictions of sex). It is a disturbing portrait of broken people struggling to find reasons to stay alive. It's pretty great, really.","user":"bella-chase","rank":[25,31]},{"title":"Deep, dark and psychologically fascinating - a realistic portrayal of how \"anything repressed comes out in toxic form.\"","rating":14,"date":"14 July 2011","review":"Although at times I found this movie hard to watch, I think it is an excellent film about the things that human beings don't want to talk openly about,the underbelly of human life that we all experience and identify with in one way or another. This movie portrays these types of things with a good story, a good script and fine acting.<br><br>The filmmaker should be commended for his conviction to tell a story that was obviously important to him, by investing his own money to make this film. I see why that was required because society in general does it's best to push down out of sight, the very things that need to have the light shown in on. In my opinion film and theater are the best way to do it, and this movie does it authentically.<br><br>I agree with some of the other reviewers that this film's subject matter is very important for all of us as human beings to understand and not be afraid of, so that we may have compassion for others who may be \"acting out\" some neurotic compulsion that they have \"inherited\" or been left with from experiencing trauma, as well as compassion for our self. Human beings \"act out\", it is just a part of the human condition and being alive.<br><br>If you like intensity and a view into deep emotional scenarios this film is for you.","user":"venusianmovielover","rank":[10,11]},{"title":"Weak and indulgent film-making in all its glory","rating":3,"date":"25 January 2010","review":"What happens when the writer of some gems as \"The Punisher\", \"Dirty Dancing: Havana Nights\" who also directed crap like \"Uptown Girls\" decides to write and direct an artsy flick?<br><br>Death In Love is the answer. This film does not pull any punch when it comes to gruesome and explicit scenes. Writer/director Boaz Yakin had to finance this film all by himself because he had specific things in mind. This would never have been approved by studios and I understand why he got no financial backing. Having a specific vision, refusing to compromise are all laudable as far as I am concerned. <br><br>It's just that, unfortunately, Yakin's vision seems terribly limited. So are his skills as a storyteller. The founding story arc revolves around a Jewish girl who begins an affair with a doctor overseeing experiments on human in a concentration camp during WWII. Yakin goes all guns blazing trying to showcase the intensity of this relationship and fails spectacularly because there is a total lack of chemistry between the actors and the script is emotionally numb right from the start. She just supposedly falls in love at first sight, with a psycho doctor who looks like an extra in an infomercial. <br><br>The second story arc (which gets the most screen time) takes place in the present and features this woman again with her husband and two adult sons. All of which seem to be mysteriously as nuts as she is for no reason whatsoever. <br><br>In between, we get flashbacks from the time her sons were children and how she'd go nuts and scare them, but it's done awkwardly, like what you'd expect in a direct to video \"it happened for real\" melodrama featuring Melissa Gilbert or some other has-been. <br><br>The present-day story arc features the most interesting and intriguing scenes. The youngest son (Lukas Haas) is a total waste of screen time as an obnoxious man-child who has various phobias and still live with his parent. But the eldest son (Josh Lucas) gets a lot of screen time. He's almost 40 years old, seemingly jaded about everything. Of lot of his scenes (particularly with his co-worker played by Adam Brody) feature dialogue that, while not amazing, is still better than what the rest of the movie has to offer. <br><br>There are a few themes displayed but Yakin, in the least subtle way EVER implies a strong connection between pain and sexuality. In fact, so strong that he almost implies one is synonymous with the other. This could be a powerful and interesting theme to explore in a few characters but here, it's just not done well. Every character on screen has intense desire to masturbate, and it seems nobody is able to make love without beating his partner at the same time. It's just... amateurish. The story and characters feel artificial despite all the courageous grit Yakin put in the film. <br><br>There is also a strong undercurrent of self-loathing in all the main characters. Yakin is Jewish himself and I sensed that he was extremely critical of a segment of people who shun their origins and hate what they are. And I can appreciate his attempt to highlight that. One of the most powerful scene, to me, was a small one where the Jewish girl at the concentration camp (who receives favorable treatment from the doctor, her lover) refuses to give the rest of her meal to a starving Jewish violinist. Instead, she sadistically eats every last crumb, as if she renounced her Jewish heritage and what she really is.<br><br>All in all, I think Yakin tackled powerful issues in a very confusing way. This feels like a very personal film but unfortunately, the few powerful scenes in there, the great performances by Lucas, Bisset and Haas and the grittiness can't save a weak script and a weak story.","user":"Siamois","rank":[37,52]}]