[{"title":"Toni Jo Henry's heartbreaking story and 1940's murder trial....a must watch!","rating":9,"date":"26 February 2013","review":"The Pardon brings you, the viewer, front and center into the middle of the real-life story of Toni Jo Henry and the murder trial that ensues. Performances from actors John Hawkes, Jaime King and T.J. Thyne are gripping and evoke deep emotional connections with each character. While the subject of childhood abuse introduces us into the unveiling storyline, a more compelling bond of strength, friendship and resilience personifies the true heart of this film!The movie footage captures some amazing scenes, both in mood and context, while the close-ups of Jaime King give us a true \"look\" into the heart and soul of Toni Jo. A refreshing view into some perhaps forgotten pages of history. A remarkably well written and poignant movie you will not want to miss! Exceptional.","user":"patriciabarr82","rank":[15,23]},{"title":"Dramatic true story about a woman, Toni Jo Henry, who faces impossible odds in the Louisiana legal system in the 1940's.","rating":9,"date":"24 February 2013","review":"The Pardon is a very engaging film with exceptional acting that tells a dramatic, heart wrenching tale. It is based on the true life story of Toni Jo Henry and her sensational murder trial in the 1940's in Louisiana. The Pardon shows the dramatic influence that childhood abuse has in one's later life. It is the story of finally finding love and its power to heal. The filming and powerful aura created make this a movie that will stay with the viewer long after seeing it. And Jaime King, John Hawkes, and T.J. Thyne give great performances that captivate you the entire movie. I highly recommend seeing this film if you like a dramatic, well told story with excellent acting, mood, and filming.","user":"Bill-stricker","rank":[12,20]},{"title":"Although I hated the outcome.....","rating":9,"date":"6 July 2018","review":"I really can't see any basis for a poor review on this film. The acting was all done quite well, and the cinematography did a great job of reminding us of the time frame in which the story originated (other than it being colonized). It has a sad ending because of the outcome we were told about in the beginning, but the writers did a wonderful job skipping through her sad life and bringing us in touch with the abuse she faced at such a young age. Hope enough positive reviews help to bring the rating up where it truly belongs.","user":"sfheriford","rank":[2,3]}]