[{"title":"Slow and gets slower - Speedman's performance is the highlight","rating":5,"date":"17 September 2010","review":"There is not much to say about this convoluted story. Its based on a real event. It relies on lots of talk and minimal action. Atom Egoyan had full control in making this film, from writing to direction. The main pluses are the performances of the principal three of the principal actors. The main negative is the questionable use of \"technology\", particularly of teenage chat rooms, of older people chat rooms, of video cell phones and so on - the focus of these internet &amp; tech based products is to present talking heads by other means. There is also a violin, which is the one major non-tech focus of the story.<br><br>There is no doubt that this film has potential. It has the making of a compelling plot, given its built in twists, turns and periodic surprises. Could it have been presented in a more exciting and direct way? Maybe not given budget considerations, which are so obvious.<br><br>At an early point, the movie takes on that feeling of seeming to go on and on and on. But, there is an interesting, underlying story. And Egoyan is a skilled and always worthwhile filmmaker. So, one persists watching, with some judicious use of occasional fast forwarding of the DVD (particularly the seemingly endless, ridiculous multi-channel computer talkfests). The film has craft and is a serious endeavour. But in the end, it is boring. And boring is boring.","user":"janschbern","rank":[12,13]},{"title":"A very involving film with performances that are uniformly excellent","rating":9,"date":"23 May 2009","review":"Atom Egoyan's Adoration weaves a complex tale of a young man searching for the truth about his family by perpetuating a lie in order to witness its consequences. Simon (Devon Bostick), a young high school student, tells his class that his Lebanese father Sami (Noam Jenkins) was a terrorist who attempted to blow up a plane with a bomb carried by his pregnant wife, Rachel (Rachel Blanchard), a talented violinist. In his presentation to the class, Simon says that he is the unborn child, his mother was the innocent being led to her demise, and his father was the killer out to murder 400 innocent people to promote a cause. The only problem with the story is that it is not true. The incident never happened. The film exposes the ease with which people are willing to accept what they are told without question and how modern technology has become a useful tool for those eager to disseminate falsehood.<br><br>According to the director, the film is \"about people dealing with absences. He (Simon) imagines having a father who is a demon; he wants to go as far as possible into what that might mean.\" Adoration begins with an indelible image – a young woman standing at the end of a pier overlooking a river playing the violin while her husband and young son watch in awe. Moving forward and backward in time with great ease, the film slowly constructs the events which have led to Simon's school confessional. The key player is Simon's French teacher Sabine (Arsinée Khanjian) whose own family was killed in Lebanon by a terrorist attack. Sabine reads an article to the class about an incident that occurred in 1986 in which a Jordanian man, Nezar Hindawi, sent his pregnant Irish girlfriend on an El Al flight with a bomb in her handbag, of which she had no knowledge until it was discovered by Israeli airport security.<br><br>Heavily influenced by his bigoted grandfather Morris (Kenneth Walsh) to believe that his father intentionally caused his mother's death in a car crash, the vulnerable Simon constructs a parallel between the article read by his French teacher and the death of his parents. On his own, Simon posts his fake story on the Internet and has to deal with emotional responses from holocaust victims, holocaust deniers, students, and professors talking about terrorism, martyrdom, and heroism. It is a discussion that often sinks to the level of victimization as portrayed by veteran actor Maury Chaykin who blames the bogus airplane incident for \"ruining\" his life. Simon's uncle, Tom (Scott Speedman), who raised the boy after his parents' death, acts as a mediator between his nephew and the teacher who encourages Simon to tell his fake story in the school auditorium.<br><br>Tom is a tow truck operator with a short fuse who harbors a deep resentment against his father for the way he was treated as a child and his encounters with Sabine contain some of the film's most intense moments. Aided by a tenderly evocative violin-prominent soundtrack by Mychael Danna, Adoration is an intelligent and imaginative study of family conflict and reconciliation that serves as a compelling probe into human behavior and the ability to distinguish between fact and fiction. Though it contains a great deal of ambiguity and character motivations tend to be somewhat mystifying, Adoration is a very involving film with performances that are uniformly excellent, particularly Arsinee Khanjian as the emotionally-damaged teacher and Speedman and Bostock who provide enough tension to keep us riveted throughout.","user":"howard.schumann","rank":[34,45]},{"title":"Masterpiece requiring multiple viewings","rating":10,"date":"15 September 2008","review":"\"Adoration\" is, at its heart, a coming-of-age story. It's about that time of self-discovery when the question \"who am I?\" becomes an obsession. But what makes this film so startlingly refreshing is that it also has a classic structure rarely seen in contemporary cinema. The viewer is never quite sure whether or not the images on screen are real or imagined. Think of a chess game where each move prompts you to replay the entire game in your head. Such is the experience of watching \"Adoration,\" brilliantly conceived and executed by writer/director/co-producer Atom Egoyan.<br><br>Egoyan is a legend in his adopted country of Canada with dozens of awards and nominations to his credit (1997's \"The Sweet Hereafter\" earned him Oscar noms for writing and directing). The mere mention of his name widens the eyes of citizens north of the border, as I learned here at the Toronto International Film Festival, where I attended the film's North American Premiere (it debuted at Cannes, where it was nominated for the prestigious Palm D'Or). Locals hold him to a very high standard. For me, I prefer going in cold, knowing as little as possible about a film. Similarly, I won't reveal much about the story here.<br><br>After losing his parents under questionable circumstances, Simon (Devon Bostick) is reluctantly being raised by his Uncle Tom (Scott Speedman). Simon's memories of his mother Rachel (Rachel Blanchard), an accomplished violinist, and father Sami (Noam Jenkins) are shrouded in mystery. Enter Simon's teacher Sabine (Arsinée Khanjian), who might be able to help Simon unlock the secrets that are the key to his youthful confusion. What follows is a brain teaser which takes great concentration. The wheels are always turning, and the viewer is constantly challenged to figure out exactly what is real or perceived, and by whom.<br><br>The look of the film enhances the mystery inherent in the story. The use of single-point lighting allows shadows to fall upon already-obscure settings. Music is essential to the plot and, as such, Rachel's violin virtuosity is extended to a string soundtrack that is as haunting as the film itself. Paul Sarossy's cinematography is cleverly integrated with composer Mychael Danna's soundtrack, with tracking shots set to music as a visual ballet. Editor Susan Shipton had a tall order working with Egoyan to craft a virtual puzzle in which nothing is at it seems.<br><br>Speedman ably plays the father figure who isn't quite ready to take on the task of raising a teen but does so out of loyalty to his late sister. Khanjian's Sabine is simply chilling and central to the power of the film. Blanchard is a joy to watch -- simply an angel on screen (and shot that way, to boot) -- and Jenkins successfully remains an enigmatic personality throughout. But, most of all, this is Bostick's film to carry on his young shoulders. Appearing in almost every scene, it's his curiosity and angst which drive \"Adoration,\" and it's our empathy for him (weren't we all Simon once?) that gives the film its heart and soul. Bostick is one of Canada's most prolific young actors (he co-starred in Citizen Duane, one of my Top Picks from the 2006 festival) and will hopefully be introduced to a wider audience if this film gets the distribution it deserves.<br><br>The moment the credits began to roll I wanted to see \"Adoration\" again. If there were back-to-back screenings I would have remained in my seat. This is the first film in recent memory which has had that effect on me. There's nothing more exciting and intriguing than a film that plays with space and time, where perception matters more than anything else. What we see on screen vs. what is in our heads -- the spaces we fill with our own thoughts -- are artfully juggled by Egoyan and the result is simply a masterpiece.","user":"larry-411","rank":[45,64]}]