[{"title":"Awesome Action fourth installment. Fast & Furious is tremendous!","rating":9,"date":"18 October 2015","review":"Fast &amp; Furious (2009) is an awesome Action packed sequel, where The Fast and the Furious (2001) stopped. This is the real sequel to The Fast and The Furious. I love that Paul Walker, Vin Diesel, Michelle Rodriguez and Jordana Brewster reprise their roles back to the roots the way they were. This is my fourth favorite best film in the series, this film Is a seat to the edge from the beginning till the end. This movie kept me thoroughly entertained from beginning to end. Sure it's a little far fetched, but who cares? <br><br>It's a movie, and definitely not as bad as some people are saying. Besides, the point of watching a movie is to escape reality so I don't understand why people complain when movies are not realistic. Provided a cinematic equivalent of NOS to the franchise with a tone shift that helped make it one of the most popular and profitable action series in the last decade. Excellent flick. Much better than the middle two. Just forget those movies happened. This was good balls to the walls action with much better actors with the original 4 back together. Bad idea making 2 and 3 :) <br><br>Vin Diesel and Paul Walker re team with Michelle Rodriguez and Jordana Brewster for the ultimate chapter of the franchise built on speed! When fugitive Dominic Toretto (Vin Diesel) returns to Los Angeles to avenge a loved one's death, it reignites his feud with agent Brian O'Conner (Walker). But, as they race through crowded city streets and across international lines, they must test their loyalties by joining together to bring down a shared enemy. From big rig heists to precision tunnel crawls, Fast &amp; Furious takes you back into the high-octane world, which lives for speed, drives for the rush and breaks all the rules!<br><br>\"Maybe you're the bad guy pretending to be the good guy.\" <br><br>This film is more about stopping a notorious drug lord Arturo Braga and avenging the murder of Letty (Michelle Rodriguez). This film is set back in Los Angles when everything started, after 5.years of leaving the city of Angeles for Dominican Republic after Dom (Vin Diesel) and his crew become a Wanted Fugitives. Letty was murdered when she was mixed up in a drug racers mule cartel. She knew the people who hired her, will double crossed her, while trying to escape the flying bullets she was killed by a drug lord's henchman. That weary angrier Dom (Vin Diesel) brings him back to Los Angeles, to avenge his loved one's death and tracking down Drug Lord Braga and killing him. Brian O'Connor (Paul Walker), is now an FBI agent, and he is assigned to track down a notorious drug lord named Arturo Braga. Both men faces each other in a final showdown. Braga is looking for a fast drivers that are driving and smuggling trough desert New Mexico drugs. Brian goes again undercover only to find out that he and Dom (Vin Diesel) are been double crossed and set up on the same way that was Letty (Michelle Rodriguez) was. <br><br>This film is filled with full action, fast cars, full of stunts and beautiful women. Gal Gadot is tremendous as Gisele Harabo it was her first role in this film and she was awesome, she acted the character terrific. Paul walker was the best in this film, finally, finally they did something with the character, he become an FBI Agent which I love that with the character In this movie. I love that Dom (Vin Diesel) at the end of the film didn't run, he surrender and I love how Brian ( Paul Walker) was testifying for him in the court. Seriously this film Kicks ass, although I prefer Fast Five over this Action Flick, but that doesn't mean this film did not do the job right, it did! And this film is highly underrated and criticized by critics. Also Han (Sung Kang) has a small scene in the beginning of this film, that was before they killed the beloved character in The Fast and the Furious: Tokyo Drift (2006). <br><br>The rating I am giving to this film is 9. Anything below 7 would be ridiculous, if anyone would not say that this wasn't At least A GOOD ACTION FILM! (it is sure as hell better than all the comic movies that are getting high scores.)","user":"ivo-cobra8","rank":[81,87]},{"title":"Still fast, still furious","rating":7,"date":"31 March 2009","review":"Fast and Furious, or 4 Fast 4 Furious if you're keeping count, is a movie you can basically sum up in one sentence. Muscle guys, muscle cars, hot chicks, and incredible action sequences. Not much has changed in the four films other than who the muscle guys wind up being played by but nonetheless, if you're going to the movies strictly to continually watch these things, then not only will this series run forever, but you should have no problem sitting through this fourth flick. Of course the other thing to look at here is the resurrection of Vin Diesel's action star persona, and considering he's been doing movies like \"Babylon AD\" and \"The Pacifier\" for the past couple years, you can basically say this is one of his better performances in a real long time.<br><br>The plot is pretty thin but I'm sure for fans of the first movie it will be nice to see the two leads back playing their roles. Diesel reprises wanted felon Dom Toretto, who after escaping at the end of the first movie seems to have started a new life in the Dominican Republic knocking over trucks. What brings him back to Los Angeles is revenge for the death of his girlfriend (Michelle Rodriguez) at the hands of brutal drug dealers led by Braga. This brings him face to face with the man who infiltrated his gang in the first flick, Brian O'Connor (Paul Walker), now an FBI agent going after the same drug dealers. And wouldn't you know that driving plays a big part in Braga's whole smuggling operation so both Brian and Dom team up, amidst some trust issues, to bring down the drug cartel.<br><br>Hopefully director Justin Lin (\"Tokyo Drift\") gets the credit he deserves this time around. He's fantastic with these action sequences, not only making them pulse-pounding thrill rides but also letting you feel like you're in the car with these characters. The movie starts out brilliantly with a propane truck hi-jacking that turns life or death when things get out of control and the truck barrels down on the hi-jackers, and then just continues to go full throttle, staging a race on a crowded Los Angeles street and then chases in an underground tunnel shaft. Once these characters get in their cars you won't be bored for a moment.<br><br>Outside the car is a different matter though. Both actors do what they can. Diesel is adrenaline personified. With his gravelly voice, bulging biceps, and cool, playful way around a line of dialogue, he's a lot of fun to watch. And while still pretty wooden, I admit that Walker has a pretty-boy face and an athletic physicality that makes him a good hero. This pairing worked well in the first movie, sort of like an amateur, yet entertaining, version of the adrenaline-seeking- cop and criminal formula a la \"Point Break.\" Just after four movies it's all gotten stale and it's easy to see that the cars are the real stars here. The Dom-Brian conflict and Dom's vendetta against the cartel is mostly overshadowed and there isn't much for either character to do when away from their vehicles. Diesel and Walker try but they always seem to be a couple wheels short of competing with the four-wheel drive.<br><br>\"Fast and Furious\" deserves credit for doing the key things well. If your expecting much from anything other than the cars then it's a disappointment, but thanks to Justin Lin this has all the makings of a really thrilling action movie, making this fourth flick in the series a little bit better than its predecessors and a lot of fun.","user":"C-Younkin","rank":[114,143]},{"title":"I enjoyed this movie","rating":8,"date":"23 February 2020","review":"Fast &amp; Furious features all the things we know and love from its predecessors though this film does have some inconsistencies with its plot and certain aspects of the film. However you'll still be entertained.","user":"MR_Heraclius","rank":[38,49]}]