[{"title":"There are far better Christmas movies readily available...","rating":4,"date":"23 November 2019","review":"With Christmas just around the corner, the holiday movies are starting to pile up. I sat down to watch the 2019 \"Elfette Saves Christmas\" without really much of any expectations or hopes for the movie.<br><br>Why? Well, usually Christmas movies tend to be sappy and all much alike. But every now and again is there something that stands out as being a classic or actually as an entertaining holiday movie.<br><br>So was \"Elfette Saves Christmas\" such a movie? No. Not even by a long shot. And it felt like writers Christian Cashmir and Brielle Carter were aiming a bit too much off target, because the movie didn't really have any particular jolly holiday feel to it.<br><br>The storyline in this movie was just too boring and mundane, with parts of it being just downright idiotic. And director Christian Cashmir was just trying to make the movie a bit too politically correct with some parts of the movie, which ended up being ridiculous instead.<br><br>As for the acting in the movie, well, taking into consideration the limitation of the script and characters, then the actors and actresses weren't really doing all too badly for themselves. However, keep in mind that this is not going to have you in for a Shakespearian experience in any way.<br><br>This movie didn't captivate me, although I did manage to sit through the entire movie. And it was totally and fully lacking that special Christmas feeling that is required to make it a proper holiday movie. So this is not going to be a Christmas classic, nor will it be a movie that I will be returning to a second time.<br><br>My rating of \"Elfette Saves Christmas\" is a four out of ten stars. Watchable yes, but not overly entertaining, and definitely not a Christmas classic.","user":"paul_haakonsen","rank":[4,5]},{"title":"the worst of all Christmass movies i've seen","rating":3,"date":"3 December 2019","review":"Disappointing movie! I do like Christmas mobises and fun stories about Santa Claus or etc, but this is beyond all regrets seing. bad actors' play, bad dialogs, bad operator work...\nJust do not waste your time","user":"victoriavdlv","rank":[0,0]},{"title":"Holiday Fun, Elf style!","rating":10,"date":"25 November 2019","review":"This is a fun and entertaining holiday film following Elfettes journey to save Santa Claus!","user":"ZacharyVazquez","rank":[0,3]}]