[{"title":"Cheryl Dempsey makes the film worthwhile","rating":18,"date":"18 July 2011","review":"This horror flick is unique in the way it leaves a lot to the imagination. Most of the acting is poor, but the story of Cheryl Dempsey makes the movie worthwhile. In fact, her story, could have stood on its own. The character is portrayed well, and it is very hard to forget what happens to her and how she is affected. Because of how devastating her story is, and because a lot is left to the imagination as to how her story progressed, the movie is actually worth watching for horror buffs. If they'd left her story out, most of the movie would be a waste of time. Her story also makes the serial killer in the story much more engrossing, since it gives a kind of unusual psychological depth to his character which is often missing in horror.","user":"ratzzila","rank":[38,47]},{"title":"This is a gem.","rating":9,"date":"6 May 2007","review":"I'm so incredibly tired of the sequel-slash-remake factory of Hollywood horror. This film is a very welcome change.<br><br>I've heard some criticism of the performances, and I cannot concur. The lead actress who portrayed Cheryl Dempsey did a really wonderful job. The slight unevenness adds to the realistic feel of the film. Without giving anything away, I must say that the true horror is not to be found within the videotaped torture. As brutal and horrific as that is, the real frightening stuff lies in the aftermath.<br><br>The writer &amp; director Brothers Dowdle were present at the Tribeca screening which I attended along with two of the actors. The brief Q &amp; A after the film was thoroughly enjoyable. Envisioned as the first part of a trilogy, this is not to be missed by fans of the serial killer genre. I'm looking forward to the next installment.","user":"lolitaxxx7","rank":[100,143]},{"title":"The Profile Doesn't Fit The Tapes","rating":5,"date":"4 July 2009","review":"I was patiently waiting for this film to be released for some time now, and I had overall fairly high expectations. In the end I wasn't overly impressed, but I cannot say it comes as a surprise to me. Basically the movie is a mock documentary about the career of a serial killer, and I would like to start off by saying to those of you who rate this as \"bad movie\" simply because it's not violent, explicit or gory enough, you should at least figure out what you're rating before making an ass out of yourself. This cannot be rated as a standard horror movie, because it's not. Basically what you're rating is fake snuff, packaged into a fake crime documentary envelope the likes of which you don't get to see on \"american justice\" with the supposed snuff footage attached. So therefore, if you say it's a BAD movie because it's boring, then what the hell are you watching a mock documentary for in the first place?? Simply, if you find shows like \"American Justice\" or \"Cold Case Files\" boring or uninteresting, and enjoy pure gorefests and slasher flicks rather than real life crime, you will NOT like this movie. However if you are interested in crime profiling, and actually research criminal cases, you will probably find this interesting and it would be worthwhile to see.<br><br>The main problem I have however, is the whole profile of the killer. To me, \"The Brothers Dowdle\" made the mistake of trying to make the serial killer out to be an exceptional ultra meticulous serial killer, (unlike any the world has seen BEFORE!) rather than just an average serial killer. The biggest problem with this premise is that every time we see the killer on camera, he is usually doing extremely high risk things, which a clever killer wouldn't do, and in the end he seems extremely LUCKY half the time, rather than being aided by meticulous planning. Examples: The way he stalks Sheryl Dempsey for so long, putting himself in plain view before finally abducting her. Showing up and confronting Sheryl Dempsey's mother at her house while an ongoing crime investigation is taking place. And the worst is how he invites the 2 girls who live on his block into his house, while Sheryl Dempsey is hiding under the table. If they knew she was under there, or the neighbours had heard any screams coming from the house at any time, it would have meant instant death, much like when the neighbours of Jeoffrey Dahmer were concerned with the peculiar odours coming from his basement. Also the way he abducts young girls on their own property in broad daylight is very high risk, and he would have clearly had some failed attempts, thus having witnesses. I also really did not like how the crime investigators supposedly consulted Ted Bundy for advice on the case (He was in fact consulted for advice about The Green River Killer).<br><br>Another big problem is that when they find out exactly WHO the killer is and where he lived, they go into absolutely no detail as to what KIND of person he was in daily life, where he worked, how people around him regarded him, which again does not really give the viewer any chance to examine his character in any relation to the profile he's given. The almost comical fact of the matter is that when you closely examine serial killers on a personal level, they present themselves as plain and mundane, almost boring individuals most of the time, which in fact was what allowed a killer like Gary Ridgway to become THE most prolific American serial killer of all time, because though at many times he was a suspect, he was written off every single time because he seemed like such an average Joe, which by contrast the killer in THIS film was an extreme oddball. This fact is I suppose, a good excuse for the creators to keep him as mysterious and therefore menacing as possible, while at the same time making no real account for his apparent success at killing.<br><br>In the end after watching this movie, I came away with the impression of having watched an overall sloppy premise, and though it was an interesting attempt, these Brohers Dowdle clearly take themselves for something much more impressive than they actually are. Had they had consultation from real crime investigators when writing the script, which is what Martin Scorcese did, when directing his extremely impressive true crime based dramas, this film would have definitely been more impressive. In the end the ultimate point is, if you ARE interested in crime documentaries, why even bother with this fake contrived junk when you can watch the real thing in documentaries about real life killers? As mentioned before, you certainly won't be watching this movie for violence or gore.","user":"Brakathor","rank":[56,80]}]