[{"title":"Fair Effort - but non South African audiences might not enjoy","rating":8,"date":"9 December 2010","review":"Having enjoyed the book and grown up around that time I was anxious to see how the movie turned out. Many nostalgic memories were aroused during the movie. I thought it was well made and true to the book - a good mix of humour and the serious business of growing up. The acting was good (Cleese was brilliant - exactly how I pictured the guv) and the scenery was great - I love the Natal Midlands. <br><br>The crazy eight could have been better developed. I wanted to see more of Mad Dog and Vern.<br><br>Sadly I don't think it is going to appeal to a wider audience outside South Africa. I imagine that most guys from the US just wont get it or appreciate it as they will not be familiar with the historical context of the time. I hope I am wrong because it is a good movie.","user":"riker-918-665091","rank":[18,23]},{"title":"Spud- unique, touching and funny... off to the madness continues!","rating":8,"date":"2 December 2010","review":"I read the book Spud, a good 4 years ago and therefore have a very vague memory of what actually happened. But I can never forget the laughter it gave me and an awe of the crazy world Spud finds himself in.<br><br>I came into this movie, with a very positive attitude but with a clear perception in my mind that you should not compare the book to the movie, how can a one and a half hour movie encompass all what the book has to show and the story it tells. It is an impossibility, I accepted that and tried to watch the movie with a clear mind and a unbias approach (being a south African) to the film. This film is being released overseas next year. Therefore I am judging this movie not as a South Afican film, but an international one. Is it truly a good film, does it work? Well, yes it is and it does. In this review I will not mention the book again. This is a review based purely on a film...called Spud.<br><br>This Movie is shown, through the eyes and ears of John Milton- aka Spud. With the audience hearing his voice/ his thoughts. Spud tells us his story, we are guided through the movie with his voice explaining to us the ins and outs of his world. This by itself is unique, it immediately attaches us closely to spud and by the end of the first scene you are already feeling emotionally attached to the character. This technique is used extensively throughout the film, but only as a tool to help the audience become familiar with the circumstances surrounding spud. Crucially this is not overused which allows the movie to flow.<br><br>The characters in the film are strong and generally well cast. With two notable performances. Firstly the guv being played by none other than John Cleese. He is as you would expect, brilliant and funny. But it is the unexpected and sincere emotional portrayal he gives to the guv that makes it so special, so human. Troye Sivan who plays spud, is ultimately, well how do I put this... spectacular. It is his performance which makes this movie so good. His Facial expressions and the emotions he feels flows from the screen into our brain, into our hearts instantaneously. It is truly something special, something out of the ordinary. A Spud we can all be proud of.<br><br>This movie is of course funny, with many laughs traveling around the cinema. But its a movie with so much more than that, so much more than a cheap laugh. With all this being said, this movie as it stands so far in this review deserves a 10/10 but then why did I give it an 8? I must say not everything works in the movie, Character development of many important characters was very little and unmeaningful. Spuds interaction on a personal level with the crazy 8 was less then I would of liked and due to the book and thus the movie, the climax was, disappointing.The singing was prerecorded, which may make it sound better but also unnatural, not something I would of preferred.<br><br>Even with that being said, as a whole this film works and it works well. It deserves to be seen, to be enjoyed.Its Something Different, something special. May the Madness continue :D and may the tickets sell.","user":"Barney123","rank":[22,32]},{"title":"Pleasant, if predictable. Excellent performances.","rating":8,"date":"23 May 2015","review":"\"Spud\" is a pleasant coming of age comedy with stellar performances by Sivan and Royal. John Cleese delivers what is possibly his career best performance in a dramatic role. Other performances are generally solid, particularly Cope and Kriek. <br><br>The plot is familiar and often predictable; however, the execution is so organic that one seldom feels aware that one seldom feels conscious of viewing a film, even during the frequent voice-overs. <br><br>There are a number of unique elements to the story that seem largely squandered. The story is set in South Africa, but could just as easily have been set in Britain, Canada, Australia or a number of other locations. It occurs during a turbulent period in the country's history, but the school is isolated from political events. Spud attends a posh private school on a full scholarship, but while he is bullied, he's never bullied over his modest background. He reads \"A Tale of Two Cities\" and performs in \"Oliver Twist,\" but there is no effort to draw any parallels with the country's political events or Spud's circumstances. While the film seems predictable in many respects, one expects various elements to be more fully developed and to have a greater impact on the story. <br><br>Various subplots converge at the climax in manners that are not unexpected, but don't seem entirely earned. Spud is given an option that doesn't seem earned and The Guv's situation changes abruptly in a manner that doesn't seem the logical and necessary progression of prior events. The climax might have been more fulfilling if the characters had done more to earn the outcomes. <br><br>Production values are adequate. The pace is a little slow at times. There is one scene with Spud reading in the foreground while minor events occur in the background that serves to remind the viewer that the filmmakers don't do much with the background in most shots. <br><br>Overall, it's a pleasantly entertaining film that could have done much more with some of the unique elements in the story.","user":"ginocox-206-336968","rank":[3,3]}]