[{"title":"A love story deftly built on unrequited love.","rating":9,"date":"23 June 2009","review":"I haven't seen a romance this touching since I was the same type of single sad sack as depicted by the hero of (500) Days of Summer. <br><br>Tom (Joseph Gordon-Levitt) has his radar up for \"the girl of his dreams\" when he meets Summer (Zooey Deschanel). Too bad for Tom Summer is stuck on friends-with-benefits mode. Let the tension begin.<br><br>Director Marc Webb captures the feeling of innocent, naïve love expertly. Anyone who has taken the lyrics of the Smiths too closely to heart, would be moved by the idea of the person they are crushing on sing to them: \"To die by your side/is such a heavenly way to die.\" No wonder Tom soon falls head over heels for this girl.<br><br>As events unfold out of sequence, you know all along Tom has fallen for a time bomb of a woman, and he can't even see the countdown. When that bomb finally blows up in his face, it unfolds with powerful simplicity-- no exposition or dialog, just two juxtaposed events that capture the heartache of reality hitting a person who sees a person through the filter of deep-seated emotions that were planted at too young an age.<br><br>So many romantic films nowadays concern themselves with cute ideas; take 'He's Just Not That Into You' or 'Serendipity' for example. Even movies like 'Knocked Up' where a pot-smoking, video-gaming, narcissistic slob tries to turn his life around to try to be a father feels more contrived than real. These movies forget about human feelings. <br><br>Who cares about stock or cartoonish characters in love. The couple in (500) Days of Summer have true chemistry. There are some beautiful, subtle moments of tenderness as well as some heart- rending moments of disconnectedness between the two that never comes across as heavy-handed. The movie constantly reminds you that these are two different people with different ideas of a relationship, yet they stubbornly continue dating, and they remain lovable all the same.<br><br>An omniscient narrator sets the film up early on by noting \"this is not a love story.\" And, in a way, it isn't. It's a story about feelings. It just so happens (500) Days of Summer captures the sensation of falling in love better than most movies.<br><br>For more of my reviews, visit indieethos.com","user":"slowcloud","rank":[479,608]},{"title":"The Glorious \"(500) Days of Summer\"","rating":9,"date":"15 July 2009","review":"Let's face it. We've all done our share of \"dumping\". Whether it's the, \"Lets just be friends,\" or the all too familiar, \"It's not you, it's me,\" tactic, as long as you're not on the receiving end it becomes a question of, \"How quickly can I get this over with, so I can move on with my life?\" Equally, all of us (yes even Brad Pitt) have experienced what it feels like to \"be\" dumped and the complex emotions that unexpectedly follow. If you're one of the fortunate souls that have managed to escape the throws of relationship hell, you'll probably fare better with renting the newest addition to the Rambo series. For the rest of you who've at one time or another gotten your hearts ripped out of your chests and stomped into a million pieces only to turn you into unshaven, alcoholic hermits on the brink of starvationthis movie is dedicated to you. <br><br>Tom (Joseph-Gordon-Levitt) is a wanna-be architect turned professional greeting card writer whose life is thrown for a loop when he suddenly falls for the \"new girl\" Summer (Zooey Deschanel, Almost Famous). As one who appeared most certainly unattainable at first glance, Tom manages to charm her into what she coins as a, \"casual relationship.\" Eventually, Tom ends up questioning their status with one another, which manages to put strain on the relationship, causing her to request the dreaded \"time apart.\" (500) Days of Summer chronicles the bitter sweet beginnings, the untimely endings and all of that confusing stuff that takes place during the in betweens of a relationship that just isn't meant to be.<br><br>(500) Days of Summer is presented in an effective non-linear style that sets it apart from its romantic comedy predecessors, rotating back and forth between dates signified by a simple title card flashing in between scenes (2), (50), (150) and so on to represent the various days in the course of Toms roller coaster of a relationship. This seesaw method of bouncing to and fro successfully manages to force the viewer in a physically engaging shared experience of Tom's feelings, which is something every director aspires to elicit from their intended audience. <br><br>The real kudos go to Scott Neustadter and Michael Weber, whose script is practically flawless. You can't help but feel that their authenticity and attention to detail while constructing each scene through appropriately sarcastic and funny dialogue exchanges among all of the main characters involved, particularly those between Deschanel and Levitt which come across as heartbreakingly real and genuine. Their creative way of crafting the simple concept of a break up through unconventional story structuring is a refreshing concept that begs to be seen more in a world where most conventional films tend to play it safe. <br><br>Leads Deschanel and Levitt manage to bring something quite special to the screen in their portrayals of Tom and Summer (both \"last nameless\"). Their chemistry is really what makes the film a joy to watch. Mostly thanks to Neustadter and Weber's superb dialog, both actors seem so comfortable in their roles that their interactions with one another transcend the screen and naturally unfold before our eyes as if we were voyeurs to their unraveling, wanting so much to change the fate of their outcome, but helpless to do so. Deschanel is sexy, carefree and bound to be adored by males everywhere as Summer. Levitt captures the struggle of the neurotic \"boy in love\" exceptionally through all of his various stages of emotional imbalance. <br><br>(500) Days of Summer is a poem to every down and out guy who thinks he's the only one whose ever been dragged through the mill by their own Summer. What undoubtedly ends up making this picture so brilliant is how relatable it is to its victims and victimizers a like. When all is said and done, there is most definitely a lesson to be learned by Tom's experiences. Everyone you meet along the way, whether just passing through or sticking around for awhile, has a purpose. In the end nothing lasts forever, relationships begin, relationships end. Try to be thankful for all the people that broke your heart, they more than likely helped you find yourself in the process especially you, Summerbitch.","user":"amarcordforever","rank":[488,621]},{"title":"The Beautiful Days of Summer","rating":22,"date":"22 August 2009","review":"Everyone loves summer. It's a time for friends, family, and fun. Ballgames, barbecues, amusement parks, and movies, summer is just a time to sit back, relax and enjoy. Enjoy time off, good weather and whatever else it might bring. Am I missing something? Oh yes, love. Summer is a time for love.<br><br>The film can be pretty much summed up in one of the first lines of the film. \"This is a story of boy meets girl. But you should know up front, this is not a love story.\" But is it? 500 Days of Summer is not your typical romantic film. There's something to it, something more than your usual romantic comedy. Maybe it's the style it's done? Maybe it's the realistic nature? Maybe it's the wonderful music? Maybe its the beautiful cinematography? Maybe, its Tom and Summer...<br><br>Joseph Gordon-Levitt and Zooey Deschanel are the leads, Tom and Summer. These are real everyday people. Tom, a believer in true love. Summer, a doubter. Which reminds me of one particular scene where Summer questions Tom about believing in love. Tom replies, \"It's love, it's not Santa Claus.\" It is a real thing, a crazy little thing called love. Tom falls in love with Summer from the start. She doesn't. Tom is like every other guy, and every guy knows of a girl like Summer. The girl they want, but can't have. They try, to no avail. It's frustrating, and Tom is frustrated. He's happy then sad. He doesn't know what to think. Gordon-Levitt and Deschanel have great chemistry together and give solid performances. You really believe their relationship and hardships. It makes you notice the little things in relationships. The film highlights two young stars on the rise. With some great performances lately for Joseph Gordon-Levitt, his stock is rising... dare I say an up and coming Heath Ledger? <br><br>The story is not in direct order as it goes back and forth from different days Tom remembers his life and relationship with Summer. When remembering, we may not remember every detail in order. We choose what we want to remember. May that be the good, or the bad. For Tom, it's a little bit of both. Big props to the editing department. The film shows the good and the bad of love, relationships, and life. There's something about it that sets it apart from the usual romantic comedy.<br><br>500 Days of Summer is really refreshing now a days. It's funny, unique, and true to life. It's got something for everybody to like. Director Marc Webb shines in his feature film debut. I'm interested to see where he goes from here. 500 Days of Summer has quickly become a late summer highlight for me and surprisingly so at that.","user":"Billy_Costigan","rank":[251,343]}]