[{"title":"I reckon watchin' a varmint chasin' tumbleweed would be more a hog-killin' time than this prairie coal.","rating":3,"date":"5 March 2020","review":"I've seen amateur civil war reenactment gatherings by retirees being filmed by a 5th grade great-grandson turn out better than this film.<br><br>Shea Sizemore's writing experience in short films should've kept this screenplay as a short, instead of this terribly written with lame dialogued poor excuse of a western with comic relief 85 min mess. Even for an 85 min runtime film, the slow pacing and lack of any real unpredictable story made this film feel like 3 hours. Add to that the overbearing and annoying score, and you'll be pulling your hair out.<br><br>All actors seemed to act is if they were in a stage play, looking out to no where and overcompensating their lines, it almost felt like a parody.<br><br>This is experienced Camera and Electrical Department turned newb director Brent Christy's third film, and it really shows. He failed in directing his cast, proper camera angles and settings.<br><br>The cinematography and colors were the only redeeming qualities in this film. Watch the trailer, and you've seen this film. This has to be the worst western I've ever seen. It's a very generous 3/10 from me.","user":"TheTopDawgCritic","rank":[19,29]},{"title":"Worth the watch","rating":6,"date":"28 March 2020","review":"As someone who can understand that good westerns died with the 21st century, I didn't mind this movie at all. It had its flaws but it still had everything a western needs. There were a few parts I even found comical.","user":"melbrooker-801-173917","rank":[1,1]},{"title":"Terrible, unwatchable!","rating":1,"date":"7 March 2020","review":"This movie is a best test paper to check if your patience is limited or limitless. I've tried to watch it, but after 30 minutes, I gave up. Lot of unnecessary scenes from the very beginning jungle fights, then gradually deteriorated into an even worse situation. Two guys turned sheriffs or marshals, or whatever, but their law keepers' decals looked more like when Nazi tagged their Jew citizens with a big yellow David Star mark of death candidates, it's just looked so weird.<br><br>The screenplay just sucked big time, the dialog funny and clueless, the acting, well, contrite to the extreme since the dialog and the scenarios so awkward that forced them to act awkward and unnatural to match the script and the lousy dialog.<br><br>I could see that the production team really wanted to make this movie a serious after-civil war Western, but the lousy screenplay simply couldn't make it possible, even with some creditable actors signed up to get involved. This is another reason why the Western genre movies could never be revived after 1970, only a few among the a few barely got some not embarrassed box office.\nThe Western genre movies are officially declared dead and buried in 2020, there's no way and no sense to make even one more.","user":"Bad-Good-Great","rank":[5,13]}]