[{"title":"fun movie....i hope there's a sequel","rating":7,"date":"21 September 2009","review":"i wasn't to sure whether to watch this movie, the only decent movie like this that springs to mind is starship troopers, and yet i could name a million crap movies like this....but the IMDb rating told me to give it a shot....and im so glad i did!! its got a great storyline that doesn't need too much explanation, giving you the chance to concentrate on the characters! the movie keeps u glued and there's not a dull moment in it! its got a lotta comedy factor to it which is mostly brought to you by the main character! the effects are decent enough to look \"realistic\" and there's no stupid cgi that looks like a cardboard cutout floating across the scene!! i wont say too much but the ending makes you hope there's gonna be a sequel....i hope there is..and i hope its just as good as this!!!...7 outta 10 from me!!","user":"asdalovesme","rank":[31,40]},{"title":"A diamond in the rough","rating":25,"date":"25 October 2009","review":"I'm personally tired of and generally ignore the CG monster horror flicks that premiere on the SyFy Channel. I read that this was one of them. Well this one was done great! The jerk hero was actually likable in his purposely annoying way, very funny, and the story happens quickly, so you are in the bug infestation, what the heck is going on, just after the main guys humorful intro.<br><br>The other survivors are decent, the story paces along well, no argument lasts too long and no character however annoying, steals the show. There's that used dad-son expectation loss thing but it works well and lots of good natured character humor. The CG was done rather well, even though I still felt it was composited, it was at least fast paced.","user":"Worldofgrim","rank":[20,25]},{"title":"Better than expected, even with high expectations","rating":9,"date":"11 July 2009","review":"No reviews yet for this little gem, so I'll go ahead.<br><br>I went in expecting a low budget campy horror B-movie and wow, I certainly did not expect a movie that good in overall.<br><br>Most of the actors are quite good, even the extras, and the main character and his entourage are surprisingly well developed for this kind of movie.<br><br>I wouldn't call the movie fast=paced, but the action in well maintained throughout and starts after less than 10 minutes, so no long buildup, the bugs are there at the beginning, you get to know more about them as the movie goes so there are no long boring explanations.<br><br>The CGI is very well done and keeps you in the movie and there are plenty of bugs of a few kinds.<br><br>But what really did the movie for me was the dark humor, think Shaun of the Dead, but with insects. Even if the movie has a serious tone, you always get some well done jokes here and there, mostly by the likable anti-hero that just seems to try so hard.<br><br>A must see for the horror/comedy fans and for the critters fans in general.","user":"VVarlock","rank":[63,91]}]