[{"title":"Not for everyone .... but definitely entertaining to some!","rating":8,"date":"25 September 2008","review":"Maybe because I wasn't expecting Oscar material... maybe because I enjoy Dane Cook... maybe because Alec Baldwin can be funny in just about anything... I just really had a good time at this movie. I understand why it doesn't have huge box office appeal, but it certainly has appeal for a specific type of audience. Crude humor? Cheezy plot line? Bring it on! I'm sorry that more people can't enjoy 115 minutes of silly escapism.<br><br>Sure, most of it was predictable. Sure, Dane Cook was basically being Dane Cook. But if you let yourself catch all the RIDICULOUS lines (especially the dialog between Alec Baldwin and Dane Cook), and if you let yourself enjoy how cute Kate Hudson is ... you MIGHT just enjoy this movie a little.","user":"NicholasTuttle","rank":[68,99]},{"title":"Rude Crude and Real","rating":8,"date":"22 September 2008","review":"I can't say that this movie was amazing for story line or anything but I laughed my ass off almost the whole movie. It's basically like a male alternative to a \"chick flick\". Year it's rude and crude but.... IT\"S DANE COOK! if you went in thinking that it would be anything less then your just dumb, The trailers showed you exactly what you are getting.<br><br>One thing that I loved about this movie is that it wasn't so fake. most guys in chick flicks are so wonderful then they just make one mistake and spend the rest of the movie trying to fix it till everyone lives happily ever after. This movie isn't like that at all.<br><br>One last thing I liked is that I couldn't have predicted just how far he would go to mess things up, so the shock value of almost everything he says is awesome. Everyone in the Theater I was in was laugh through the movie too. I can't believe it got such a bad rating here but I guess I've also seen movies on here with high ratings that just sucked. whatever.","user":"jlarmstrong","rank":[23,31]},{"title":"Careless fun.","rating":27,"date":"27 November 2008","review":"The big screen very rarely ever treats its audiences to a romance where the 'asshole' of the story gets more than the simple role of causing friction and delay between the inevitable cathartic moments of bliss between the match-made-in-heaven. So what then does happen when the genre's example of the anti-Christ falls in love? What happens when his or her character actually rises above the clichés that so often dominates their two dimensional motives? The result is inevitably the anti-romcom. My Best Friend's girl is for all intents and purposes not the kind of a-typical romantic comedy affair that we are so often forced upon to see month after month of the year. Instead it presents immediately disagreeable, but in turn, real people to occupy its tale of romance. The result is one that will have audiences undeniably split; there will be those who will simply not be able to get by the ugly sides of this story's characters (particularly the lead male), and those who actually revel in a solid love story that doesn't try to be your charming friend all the way through. Essentially, the dominate colours here are not pastel pinks and blues, but blacks and greys. In real life, romance doesn't usually play out like it does in the movies, but with My Best Friend's Girl there's cause for dispute over this common belief.<br><br>When looking through traditional romcom eyeglass, lead character Tank (Dane Cook) isn't the most likable or even compelling leading man. A Rude, callous, chauvinistic and manipulative womaniser, Tank is certainly more fit to be the story's antagonist male than its protagonist. For a living Tank works at a call centre for a company that sells air purifiers, and yet this isn't where the majority of his income comes from (and that's just as well, because he's terrible at that one). As a way to make some money on the side (lots of it) Tank works as a 'nightmare-rebounder'; when a guy gets chucked to the curb his partner, Tank chats her up, treats her to a lousy date and in turn the woman realises how naïve she was presumably being. Of course, this premise has problems; it's contrived and yet clever in a masochistic sort of way. Most enjoyable of all however is that it at least provides as a refreshing change of scenery in this current climate of lacklustre romantic comedies. After wave upon wave of gag-inducing melodrama without any hint of real depth purging themselves upon us this year, it is strangely uplifting to be treated to a story that runs on low standards, morals and characters. Love isn't perfect; in fact it can be down right ugly at times, and while My Best Friend's Girl isn't out to dramatise that theme, it does well at poking fun of it.<br><br>Of course all of this simply wouldn't work if Tank himself was a lazy caricature of the worst-man-ever, but he isn't. Dane Cook does a great job here (and I am usually a detractor of his work) of giving Tank an under riding sense of good-heartedness that lies beneath all the callous games that he so eloquently plays with his one night stands. For all intents and purposes we shouldn't like Tank, and although many will not be able to see past that façade, I was definitely won over by Cook's charming and grounded portrayal. What works even more to the movie's ability to win the audiences over however is its ability to crack a chuckle or two. Sure, it goes without saying that much of the humour here is crass and gauche to the point where it may turn people even further away, but director Howard Deutch does a fine job of balancing his two core elements in ways that so many romantic comedies just don't ever get close to. That is not to say that the director gets everything right, because he doesn't. There are numerous problems arising throughout the feature, most notable of which exists between the lacking chemistry between Cook and his co-star Kate Hudson, but given the way in which Deutch presents Jordan Cahan's anti-romantic story, it's not something worth crying about.<br><br>To close things off I will say that My Best Friend's Girl certainly isn't hilarious, nor is it tear-jerkingly sentimental; instead it exists as a light-hearted by nevertheless emotive tale of untraditional love blossoming from untraditional circumstances. In this vein the movie distances itself from the immediate residents within the somewhat bloated genre, presenting a refreshing polar opposite view of romance on the big screen in all its imperfections. The movie itself as a whole certainly reflects this central point as it is nowhere near perfection thanks to a superfluous and unnecessarily neat ending, but for the most part Deutch succeeds in delivering something quite unique and satisfying at the same time. What is most refreshing of all however is that the movie very rarely succumbs to holding your hand and trying to get you to like it. So often movies of this nature will pile desperate devices upon tired clichés to get you to feel something and yet Deutch doesn't seem to care. To put it simply then I guess, if you are a sucker for the average romcom where characters are prestine, witty, awkward and immediately lovable, then My Best Friend's Girl probably isn't for you. Instead I recommend this to those who prefer edgier romance and even edgier comedy; this isn't your average fare by any means, no, it's better than that; like its lead character, it's actually good, no-brainer, careless fun.","user":"Otoboke","rank":[33,47]}]