[{"title":"For the love of god, if you respect the original series at all, do NOT pay to see this crap!","rating":1,"date":"4 April 2009","review":"Let me just start off by saying that there are no redeeming qualities to this movie at all. The multi-million dollar budget has amounted to a teen drama mixed with power rangers. The final product is insulting, to say the least.<br><br>The creators of this horrible, horrible adaption should take a good long think about what they have done and why they should have just followed the source material instead of taken it for granted. Do they really think that the entire Dragonball fan-base is this stupid? Akira Toriyama probably has a noose around his neck right about now.<br><br>To finish this off: The acting is atrocious, the butt-rock scattered through the soundtrack will make you want to punch the guy running the theater in the face, and the story is basically the manga's, but cut up, put into a blender, stuffed into sausage skins, and stitched back together with an American flag tied around it.<br><br>If you want your Dragonball fix, just buy dvds of the show instead, skip the movie, and if you don't skip it, then at least don't pay for this thing. I heard that a sequel is already in the works, and we don't need a trilogy, that would be three of these movies too many.","user":"vas_deferens","rank":[229,257]},{"title":"The perfect movie for anyone who hates Dragonball Z","rating":2,"date":"17 March 2009","review":"Watching DBE i can immediately tell the directors and everyone else involved have not watched more than a few episodes of the entire Dragonball series. The characters are only similar in name and the story feels like they chewed it up and spit it out and whatever stuck to the storyboard they went with. I wont ruin the story but its nothing like the anime, as i said before the characters are only similar to the anime by name. It almost seems like they wanted to make this movie as bad and as far away from the original story as they could. The only time an actor or actress acts like their anime counterpart is when they are first introduced speaking mainly about Master Roshi and Yamcha.<br><br>For one of the most action packed animes around they sure did the opposite with the movie. I can count the number of fight scenes with one hand and count how long they lasted with two hands. Its pretty pathetic when the first fight scene with Goku and the \"bullies\" is the best and he never threw even threw a punch. The big screen debut of the Kamehameha is sad and pathetic and all the Ki blasts look like different color fire balls. They don't look pure energy (like they are in the anime) but just like slow motion fire.<br><br>I could go on for hours about what they did wrong. If you have never seen the anime series don't watch the movie. The story is probably too confusing for anyone who doesn't know the entire back-story of the anime. The movie only gives you the who and the what but no why. In fact i think why sums up the entire movie. Why did they do this and why did they do that is all i was thinking during the entire movie. At the end of the movie all i could do was ask \"Why did they make this movie and who did they make this movie for?\" This is not a movie for the fans or anyone who has never seen the anime. It feels like they made this movie for the people who hate the anime.<br><br>As a fan of the series I will award this no points and may god have mercy on their souls.","user":"Monsoon77","rank":[564,663]},{"title":"Even the 7 Dragonballs Can't Save This Movie","rating":2,"date":"20 March 2009","review":"For manga and anime fans around the world, the story of Dragonball has to be at the top, or at least in the top 3 of their most beloved manga/anime stories ever written. There is already an existing live action Dragonball movie called Dragonball: The Magic Begins (http://www.imdb.com/title/tt0122050/) made in Taiwan back in 1989. That movie tried really hard to stay as close as possible to the original story of Dragonball as written by Akira Toriyama, but it ended up being more of a comedy. The entire story also only went up to the Pilaf storyline, which was way before the first Piccolo appearance. This movie, although aged and not exactly a direct interpretation of the Dragonball story, was still appreciated by most fans due to the comedic entertainment value.<br><br>Now, another live action Dragonball movie has come, called Dragonball: Evolution. When the first few pictures of this movie appeared on the internet, a lot of the fans already predicted that the movie would turn out horrible because the characters don't look like themselves. The characters were heavily changed and westernized too much, especially Piccolo, the main villain, who didn't look like the one from the manga and anime. Fast forward to a few weeks before the latest Dragonball movie was released, a trailer was leaked on the internet. That trailer spelled the certain doom of the movie to the fans of the show. Most of the comments described the movie as \"Not Dragonball, but another action movie\".<br><br>This writer was fortunate enough to be invited to a private screening of the movie, and boy was I surprised! I was already expecting the movie to be bad and not a \"real\" Dragonball, but what I witnessed was something much more horrible! Granted that the movie was really different, but the way the movie progressed, the introduction of characters, the fight scenes, oh wow, you'd think it was a movie created by elementary kids who had no idea what Dragonball was about, except for the \"Kamehameha\" move and the 7 dragon balls, just with the financial backing of a millionaire. <br><br>Everything seemed rushed in the movie and characters would just pop out of nowhere and decide to join together to beat Piccolo. The love angle in the story seemed forced as well, everybody was simply out of character. Goku's a powerful but lame school boy, Chi Chi's a martial art school girl who can't even open her own locker, Master Roshi's some crazy dude living in the city (at least he still wears a Hawaiian shirt and seems a little perverted), Bulma became Lara Croft and Rambo combined in another body with a bizarre voice, Mai (originally one of Pilaf's hilarious henchmen in the manga) became a cold blooded, shape-shifting killer, Yamcha became a weird cross between a desert bandit who can't fight and a hobo with unwashed hair, and Piccolo became a weird vampire whose outfit seems to be inspired by the Matrix. I think only Grandpa Gohan was close enough to the original character, except for the way he exits the movie early on.<br><br>The fight scenes were lame. Dragonball was about epic sized battles that could not be contained in one location. Characters would get punched through mountains, cities would be destroyed, the earth would rumble and split up due to the massive forces of the fighters. In this movie, everything seemed so lame. Even the Kamehameha attack was used to light some candles! Talk about total weakening!<br><br>The only \"good\" things about the movie were the special effects, although the energy blasts seemed very weak.<br><br>My advise is, if you're going to pay to watch this movie, DON'T DO IT. Listen to what almost everybody has been saying because they're right, the movie is worse than what you currently have in mind!","user":"classiccase-1","rank":[438,514]}]