[{"title":"Transformers","rating":7,"date":"5 March 2020","review":"This second installment of the Transformers series wasn't as fantastic as the first one but it was still pretty good. Shia LaBeouf, Megan Fox, and the rest of the cast did a great job in this movie. The plot to the movie was pretty good and the action scenes were pretty cool. A lot of people didn't like this movie, but I did and I would recommend it.","user":"MR_Heraclius","rank":[38,41]},{"title":"Great effects - story lacking","rating":6,"date":"26 June 2009","review":"As expected, the effects were spectacular. The fight scenes were extravagant and fast-paced.<br><br>The story though, couldn't keep pace. They kept stopping for a romance that was never developed (and no one really cared). The real thing that brought this movie down though was the constant stooping to this immature level. The had to have said @ss and balls 10 times (and that's a low estimate). Not only this, but those two twin autobots were introduced who were supposed to be \"hip\" maybe? They just turned out to be extremely annoying and to bring down the level of the movie as a whole.<br><br>As a fan of the original cartoon series, I have to say I was really disappointed they stooped the level of immature @ss-balls humor and creating new characters with low IQ's. They could have done better. The action though, was amazing and I am still glad I paid to see it on the big screen.","user":"brendan5","rank":[502,823]},{"title":"Too Much Comic Relief Undercuts An Above-Average Sci-Fi Saga","rating":7,"date":"2 July 2009","review":"Too much comic relief undermines the dramatic impact of director Michael Bay's visually impressive sequel \"Transformers: Revenge of the Fallen.\" If you skipped the original live-action \"Transformers,\" you may not understand the stakes in the sequel or the situation. The original concluded with the treacherous Decepticon jet Transformer streaking off into the sky, guaranteeing the survival of the villains. Original \"Transformer\" scenarists Roberto Orci and Alex Kurtzman are joined on this installment by \"Reindeer Games\" writer Ehren Kruger and they bring back the evil Decepticons for a rematch with the virtuous Autobots. <br><br>Clocking in at an hour and 49 minutes, Bay's epic length sequel features machine-like entities shape-shifting from various vehicles into gigantic robots with deadly appendages that discharge explosive broadsides whenever they unleash their titanic fury. The problem is Bay neglects the narrative for these massive transformations. When the Hasbro creations aren't changing from innocent machines into destructive robots, Bay and his scribes are slinging visual and verbal jokes as fast as you can blink. In other words, \"Transformers: The Revenge of the Fallen\" lacks suspense until the last quarter hour when the flesh &amp; blood performers inject some emotional gravity into this superficial smackdown between good and evil alien robots.<br><br>\"Transformers: The Revenge of the Fallen\" opens with a prologue in 17,000 B.C. when mankind initially runs afoul of the alien robots, before Bay jumps ahead to the 21st century when mankind and the Autobots have formed an alliance. U.S. Army Major Lennox (Josh Duhamel of \"Turistas\") and Sgt. Epps (Tyrese Gibson of \"2 Fast 2 Furious\"), command an elite squad codenamed NEST that consists of Autobots collaborating with U.S. and British soldiers to smoke out rogue Decepticons hiding anywhere in the world. The opening Shanghai sequence where NEST routs a gargantuan unicycle that wrecks more havoc than Godzilla ever visited on Tokyo gets things started off on the right track. The unicycle warns our heroes that the worst is about to befall them in the form of a monstrous entity named 'The Fallen.' <br><br>The sequel focuses on a thousand year old object called 'the matrix of knowledge' that provides loads of power to whoever acquires it. The scene shifts from Shanghai to the Witwicky homestead in California where Sam (Shia LaBeouf of \"Disturbia\") announces his plans to attend a prestigious Ivy League university and try to live the life of a normal twentysomething. Sam informs Bumblebee, the yellow Camaro that morphs into a monstrous robot, that he cannot accompany him. Freshmen aren't allowed to have cars on campus. Incredibly, Sam is leaving his super hottie girlfriend, Mikaela Banes (Megan Fox), who looks sexier than ever. After Sam's parents, Ron Witwicky (Kevin Dunn) and Judy (Julie White), get our hero situated in his dorm, they head off to Europe for a vacation. Sam and Mikaela are having their first relationship struggle. She wants him to utter the L-word \"love\" but he is content only to tell her that he \"adores\" her and they plan to maintain their relationship coast-to-coast via the Internet.<br><br>As Sam is unpacking, a shard of the Allspark falls out of his clothing from the first movie and weird things start to happen. Remember, the AllSpark was a mystical cube that contained the key to the Transformers' existence and was thought destroyed in the original movie. Optimus Prime shows up soon afterward and explains trouble is brewing and Sam has a role to play in its resolution, but our hero refuses to participate.<br><br>Of course, what Sam wants and what Sam ends up doing are two entirely different matters. In one of his classes, he scans an astronomy book from cover to cover and accuses Einstein of being wrong. Furiously, Sam starts scribbling enigmatic symbols. Later, the Decepticons return in force, steal parts of the AllSpark, excavate Megatron from the bottom of the ocean floor, sink half the U.S. Navy, and set out to destroy not only the Autobots but also the Earth. The Decepticons' primary target is Sam and they perform a full body scan to obtain vital information.<br><br>\"Transformers\" boasts some spectacular scenes. For example, a robot versus robot mêlée around Egypt's Giza Necropolis, with the evil Devastator, a remarkably mammoth mechanoid, absorbing several construction vehicles so it can scramble atop the peak of a pyramid, is truly a sight to behold. Again, Bay and his scribes cannot inhibit their humor and they show two huge wrecking balls dangling like genitalia between its massive thighs. The scene where the Decepticons resurrect Megatron from the bottom of the ocean is exhilarating to watch. The last thing that you should be thinking about is the nincompoop who decided not to melt Megatron done into a pile of metal so nothing like this could happen. Unfortunately, had they done so it is likely that there would not have been a sequel.<br><br>Mind you, \"Transformers: The Revenge of the Fallen\" qualifies as a big, dumb, noisy action-paced sci-fi saga that doesn't make any sense and revels in its larger-than-life idiocy. Humans take a backseat to the fracas between the mechanoids until the final moments when only Sam can save the day. Unfortunately, the humor gets entirely out of hand. Sam's college roommate follows him around the globe and spends more time screaming in terror rather than fighting. Agent Simmons (John Turturro) is back acting just as flaky as ever, too. The Ghetto twin Autobots are as obnoxious as Jar Jar Binks was in the \"Star Wars\" prequel. The gags and the pranks displace the drama. The language is often rude and verges on the obscene. The surprises are few and far between. Without enumerating them, we are asked to believe that essential characters can die and never be revived. Anybody who believes for an instant that the Decepticons will vanquish the Autobots is clearly delusional, though it would have been a nice cliffhanger touch on Bay's part to stage an ending similar to \"Star Wars: The Empire Strikes Back.\"","user":"zardoz-13","rank":[65,100]}]