[{"title":"WHAT Did I Just Watch?","rating":1,"date":"7 June 2018","review":"First of all, after not only watching this, but seeing reviews which say this is 'pretty realistic', I have to truly thank God in heaven that 1. I have never met a garbage bag as bad as the guys portrayed in this film; and 2. none of my friends are neurotic, crazy, desperate women like the women portrayed in this film. <br><br>Seriously. <br><br>Ginnifer Goodwin's character alone is enough to make you want to watch this with your eyes rolled up inside your head to spare you from rolling them up every 5 seconds of her screen time. Kudos to her as an actress, for making such a pathetic character truly come across as the pathetic character I imagine she is meant to be. <br><br>On the subject of actresses, and therefore actors - the cast is amazing in that there are a lot of well-known names in the credits. What a crying shame that they could not have lent those names to something way better than what is this trite, awful film turned out to be.<br><br>Skip like the plague, and if you have daughters, PLEASE teach them that this film does not depict what real girls and women are like.","user":"Her-Excellency","rank":[43,54]},{"title":"The chick flick with a little bit more in the tank","rating":8,"date":"14 March 2009","review":"The film starts with a little girl in a playground getting bullied by a boy, and her mother telling her that this means that the boy likes her, setting up the premise that the more a guy treats a woman like dirt, the more she'll hang around on the phone waiting for his call. From this point we follow the relationship woes of six (no eight, nine, is it ten?) different people and their relationships ups and downs, as one guy is trapped in a loveless marriage, one couple realise they want different things and one woman who is trying to figure out how to play the dating game, the stories cross and intertwine and from this comical situations ensue.<br><br>Now, from the tone of the last part of that sentence you may well have come to the conclusion that this is just another standard romantic comedy chick-flick, and, on paper, it should be. But it's not. The script is very similar in tone and feel to \"When Harry met Sally\" with \"supposed\" regular people introducing each chapter of the film, the insights are decent and the dialogue contains a lot of honesty that I think many people can relate to. The cast are all first rate with special attention going to Ben Affleck, who has so needed a good role in front of the camera for ages, and Jennifer Aniston as the couple who can't move forward, also good are Bradley Cooper and Jennifer Connolly in their respective roles. The big star turns for me though are Ginnifer Goodwin and Justin Long as the hapless dater and the hapless dating coach, who are really good. For Long it's another step up the Hollywood ranks (pretty much the direction he's been heading since \"Dodgeball\") and for Goodwin it is a star-making turn that should do for her what \"knocked-up\" did for Heigl.<br><br>The film of course has a number of elements and outcomes that are extremely predictable (it IS a romantic comedy) but there's enough other stuff in there, and definite surprises at the end, to make it more than just the sum of its parts. It's charming, clever and, when viewed with a pantomime-style audience that I saw it with, a lot of fun, and I'm a guy! A cross between \"When Harry met Sally\" and \"Friends\" that doesn't try and jump on the gross-out comedy bandwagon.<br><br>Good stuff","user":"cosmorados","rank":[102,144]},{"title":"Are we really that bad?","rating":8,"date":"7 February 2009","review":"My girlfriend and I, both at or approaching our 50's, saw this in a theater that was absolutely filled with high school girls. That surprised me actually, given that most of the stars in this film are well-beyond high-school age. But they, like the rest of the audience, seemed to really enjoy this film, as did we. The relationships were nicely intertwined without being contrived (\"Crash\" anyone?), and unlike the similar movie \"Love Actually,\" nothing portrayed was too outlandish. The convention of adding comments by \"real\" people to introduce story lines was well done and amusing. If I find any fault with the film, it's that all of the guys are presented as having relationship \"issues\" or as being total bone-heads. Hopefully there are more \"nice guys\" interspersed in society than what this film might lead you to believe (though I must say that the attitudes presented are definitely not inaccurate).<br><br>Overall, a very nice film whose 2 hour plus running time goes by rather quickly. If you've ever been in or tried to be in a relationship, you'll probably enjoy this movie.","user":"jordan2240","rank":[196,294]}]