[{"title":"A different, yet welcome, kind of slasher","rating":6,"date":"19 May 2010","review":"With only 4 reviews at this time, and 3 of those reviews being bad, I have to think that REYKJAVIK WHALE WATCHING MASSACRE is not getting enough praise for what it actually is... a different kind of slasher that is thoroughly entertaining to watch. Does it have its faults? Of course it does, but not enough to take away from the overall enjoyable experience of the film.<br><br>One reviewer says the title is good, but the movie is bad. Honestly, I think it's the other way around. I was expecting to be let down by this one because of the title. Another thing... not sure why this is being compared to THE Texas CHAINSAW MASSACRE. It is nothing like it, not even remotely close. I can only guess that it's because \"massacre\" is in the title? And it is NOT a comedy as one reviewer suggested.<br><br>In closing, I must say that I highly recommend this film to anyone that is a fan of slasher films, and most other horror films as well. There are some interesting death scenes with pretty good gore. The acting is overall decent. The setting is used very well to the film's advantage. It's not TCM and wasn't meant to be. Take it for what it is: A different, yet welcome, kind of slasher. A solid 6 out of 10. Watch it!","user":"Reaper-of-Souls","rank":[26,31]},{"title":"A very good effort !","rating":6,"date":"12 January 2011","review":"There aren't many horror films from Iceland; however, this one is a very good start. \"Harpoon\" has all the great elements of a horror film, despite its less than stellar subtitle \"Whale Watching Massacre.\" The director chose all the right performers to bring the characters to life; each actor did a great job at owning the person they were portraying; however, the director left much to be desired in the action department...and the film could've done without the few gasps of ironic comedy with the character Endo and the matriarch of the insane clan. Overall, the gore effects were good and a few surprising moments that the audience may not suspect. I really despised the ending because it disabled me from taking the film seriously overall, meaning the ending was too campy for this type of film. Kudos again to the actors who performed very well.","user":"jjdosha","rank":[7,8]},{"title":"A doozy of a title and a doozy of a movie.","rating":7,"date":"6 September 2010","review":"This might be the first solely Icelandic movie I've ever watched and it's not a bad one, really. It's set in Reyjavik, has an international cast, and is mostly in English. <br><br>The background story is amusing: A bunch of tourists go whale-watching but are beset upon by Icelandic redneck fishermen who're sore about environmentalists halting their livelihood of whale-hunting. <br><br>It's a slasher movie but with some welcome black humor. It's also filmed pretty well, with grainy shots for ambiance. I've two issues with the movie, one being the misogynism at the start of the movie. At least the movie shows it's not homophobic, since it has a heroic non-nelly gay man. <br><br>The other issue is the twists in the story. I have no idea how the movie ended the way it did. It has to do with a certain character who does an about-face in the middle of the movie and changes motivations and I'm not sure why... Maybe I wasn't paying enough attention, I don't know. Anyway, this was a fun and exotic slasher movie.","user":"eddax","rank":[7,8]}]