[{"title":"love this movie highly recommend.","rating":9,"date":"23 February 2020","review":"I think it's always difficult to portray hardship and endurance in films purely because you only experience it for a couple of hours or so. This had me understanding the terrible conditions for real....i think. The search for water in the Gobi desert had me thinking twice about attempting the same thing as a holiday. Make up was fantastic and the bleakness of the scenery was soo beautiful","user":"MR_Heraclius","rank":[42,43]},{"title":"I will never complain about going on a walk ever again!","rating":10,"date":"2 January 2011","review":"I went with my friends to see this the other day - we picked whatever film was on soonest at the cinema. The Way Back was on...and we went in. I had no idea what the film was about only that I'd heard that \"People walk out of Russia\". <br><br>This film really had you captivated for the entire journey - and you really connect with the characters within it, so much so you experience their emotions with them - you laugh with them, you are on the verge of tears at moments, and you feel their determination. <br><br>The acting was great - there were some familiar faces in the likes of Jim Sturgess (21) and Ed Harris (everything else)...and they do very well in their roles. Colin Farrell finds himself taking a respectable role in a respectable film - and does a very good job at it - and even manages to work a Russian accent, which he pulls off - and he pulls it off well. Surprisingly well, actually! Saoirse Ronan, at 15/16, is incredible in this. Given her youth, she manages to draw in the audience with her character's history and gravitas. The other actors within this, despite them being relatively unknown on the Hollywood stage, join the cast well, and the chemistry is there to make the journey and the true stamina of the group believable.<br><br>The cinematography was immense, with shots overlooking parts of Russia, Mongolia, Tibet, and India - just helps you realise the vastness of the journey. Most of the journey is filmed looking closely at the characters, but this is what is crucial to the audience enjoying the story. You can't have 2hrs and 13 mins of beautiful scenery and see the intimate struggles with each of the characters...therefore the director does well to mix the two. The audience can see just what the struggles and difficulties are...but are treated to some amazing shots of the scenery, which make you realise how incredible this journey was. (I even got a map out later and routed the journey they took)<br><br>I should expect that this film would receive some Oscar nominations, maybe for cinematography, director, perhaps even best picture, but I would love to see Jim Sturgess having a nomination for his role.","user":"sparsons-7","rank":[187,230]},{"title":"Epic Survival Tale","rating":8,"date":"23 January 2011","review":"This is a film for people who appreciate epic landscapes and survivor stories. It has some engaging characters but not brilliant dialogue or complicated characters. Mostly, it is a visual film, displaying the vulnerability of a few people in a harsh, vast, beautiful landscape. They must depend on each other, and they develop an intimacy based on their shared struggle rather than on deep conversations and emotional revelations, or at least, not until a young girl joins them. Weir seems to be commenting on the yin yang of masculinity/femininity at times in this film. I also liked the subtle underlying commentary on the brutal oppression of the Soviet regime under Stalin.<br><br>All of the actors were good; Farrell adds a touch of humor, Sturgess portrays anguish well, and Harris is a good tough old guy--his usual persona. By the way, Manohla Dargis in The New York Times complains that Farrell is too good-looking to be a Russian gangster. What this assessment is based on I can't imagine; doubt Dargis hangs with Russian gangsters.","user":"nyshrink","rank":[93,113]}]