[{"title":"Great film","rating":10,"date":"8 October 2014","review":"I don't know why this film has had so many poor reviews. Myself and my husband loved it. We've loved all of Adam Sandlers films and this one delivered just as well as the rest. The chemistry between him and Drew Barrymore is as good as 50 First Dates, it was funny, we laughed all the way through, the storyline was fun and held gentle messages to any families in this situation therefore approaching potential sensitive subjects with tact and diplomatic wit.<br><br>I watch and enjoy a range of film genres but in today's society where many things are far less censored and where daily we read in papers and see on our screens the horrible things people do in the name of whatever their intent and films that relay these and far worse depravities it's fun, refreshing and heartwarming to watch something like this.<br><br>I read somewhere that Adam Sandler said making his films was like having one big vacation if that's true then why not? Who wouldn't like a job that felt like a holiday! When watching any of his films there's always the sense that the actors were having fun. I hope he keeps on making these fun feel good films for a long time. If you don't like them then don't watch them. There's still a solid place for his films and many people will continue to watch and enjoy them.","user":"zhanna1963","rank":[38,44]},{"title":"I loved it","rating":8,"date":"27 June 2014","review":"I truly loved this film. It was heart warming, fun and had me laughing several times. Yes, it's totally predictable but that can sometimes be OK. You know what you are going to get, the freaky children and the inevitable romance. I like these two when there together and I like Sandler despite what the critics say. He is someone you can relate to. A great movie to chill out, relax or just something to make you happy. <br><br>The children's antics were annoying at times and the transformation from tomboy to beauty was slightly abrupt but I did like the the way that each parent dealt with the issues of teenage boys and girls, especially the constant 'self service' that the teenage boy was participating in while imagining his babysitter. After all, most blokes can remember that time in their life.","user":"insanemoviecollector","rank":[133,167]},{"title":"A touching comedy","rating":9,"date":"26 May 2014","review":"The lower ratings on this film are too harsh. This is actually a sweet comedy where two individuals who initially repel each other grow to like each other. The added touches are the children in this film, who are not only hilarious but also bring out the parental qualities in Drew and Sandler's characters. <br><br>The holiday setting in this movie is also fantastic and adds a bit more quality to the film. The backing singers who appeared every now and then made me chuckle. The various activities that you find on a 5 star holiday are all here, which really makes you want to visit this resort.<br><br>Overall it was really enjoyable to watch, I would highly recommend it","user":"Vega7473","rank":[186,259]}]