[{"title":"Was prepared to not like this, but...","rating":8,"date":"14 August 2011","review":"OK, so perhaps it's a bit formulaic. But getting through the process was unexpected. A very sweet story line, and some clunky transitions; however, the ultimate feel was very sweet and pulled at the heart strings. Life isn't simple, doesn't always go as expected, and requires a bit of effort. This film seemed to capture a wide variety of experiences and faced them with poignancy and humor.<br><br>I truly was expecting it to be all fluff, or very silly, and I didn't expect the film to tell the story as well as it did. Insight into different families, good times, bad times, and the mundane. No huge laugh out loud moments, but definitely some chuckles. I'm glad I gave it a shot. Give it a try sometime, and you just might be surprised, too.","user":"jimpowellsf","rank":[35,38]},{"title":"These reviewers are WAY too harsh, this is a quite enjoyable film","rating":8,"date":"30 October 2010","review":"My wife's choice of film made me miss \"The Town\" and \"The Social Network\" which I preferred, but I'm not regretting this night. As a mere film lover, I have no idea how the two leads managed to make this script believable, but they did. Katherine Heigl is a known, reliable entity who's graced many a movie, but the real discovery for me was Josh Duhamel who conveyed all of his feelings to me, another guy, extremely well in situations I've never really encountered, perhaps better and more agreeably than any other male lead I can think of. Now I'm not sure why. The guy's quite a bit more handsome than me and everything's done with a light touch, but somehow, he's effective and simultaneously non- threatening, if that's the word.<br><br>Anyway, this film is far from perfect, but what it's attempting to explore is a bit mind boggling. How would two people who initially dislike each other find enough common ground to come together in the best interests of a child? You won't find a 'how to' here, but all the small moves and incidents rang true to me, and the result in the end, seems quite plausible to me, at least. Things happen when two people get thrown together like this and I doubt you'll have it illustrated more enjoyably than this any time soon.","user":"socrates99","rank":[121,141]},{"title":"Very Real for a romantic-comedy","rating":8,"date":"9 October 2010","review":"I am not a great fan of romantic comedies because, honestly, they all seem the same. This one proved me wrong! I actually laughed (unexpected) and even cried (really unexpected) during this movie. There is great chemistry between all the cast members . The premise that the story is based on is presented as very believable. I found myself immersed in the possibility of this happening in real life, not just reel life! I think the director brought out the best in the actors. Katie Heigl has more depth as an actor than I gave her credit for. Josh Duhmel proves to be more than just a pretty face. I really loved this movie and was so glad I went to see it!","user":"valerieschechter","rank":[128,162]}]