[{"title":"\"We don't see France in the same way...\"","rating":9,"date":"28 October 2008","review":"Having been a huge fan of Jaoui and Bacri's films for many years, I have to admit I approach each one with a vague sense of trepidation in case they mess things up. I wasn't overly enamoured with their last film, Comme Une Image, as I felt Bacri's standard hapless-and-frustrated-but-ultimately-lovable character had become plain nasty and cruel. This time, I think they got it spot on all round. What I love about their films is that you can watch them again and again, taking something new from them with each viewing. Focusing on the minutiae of life whilst using delicate brush strokes to highlight the intricacies of human relationships via gentle but hilarious comedy is what they do best, and I found this film frequently hilarious. The actors are all superb, and the various characters give such a seemingly mundane story a depth not many films achieve, as French political life and its future are examined with a delicate touch by Jaoui, who credits her audience with much intelligence. The sight of an ambitious feminist politician leading a white middle-class man, a young French Arab and a flock of sheep down a hill, before the group get lost and are rescued by a pair of farmers, struck a chord with me, as did the relationship between Karim's mother and the bourgeois family for whom she works without being paid. There were some question marks, such as Karim's seemingly invisible wife he seemingly wants to cheat on when she herself appears affable and friendly, but overall it's a thought-provoking, entertaining and downright funny film.","user":"stenson77","rank":[29,36]},{"title":"An American opinion...","rating":28,"date":"28 October 2014","review":"When I say \"an American opinion\" I don't mean \"an idiot's opinion\" although that has been known to happen. No, I just mean that this is the opinion of someone whose approach to cinema is somewhat sociocentric--that here we only have access to films that are \"mainstream\" or, at best, foreign films that win awards at Cannes or are aggressively marketed for USA audiences. This film didn't win any awards that I know of, thus in popularity it plays second fiddle to writer/director/actress Agnès Jaoui's 2000 debut \"The Taste of Others\" which is similarly about the polite social &amp; racial barriers that exist in everyday life.<br><br>\"Parlez-moi de la pluie\" (literal translation: \"Speak to me about the rain\") takes its title from an old French song by Georges Brassens called \"L'Orage\" (\"The Storm\"), a humorously tragic diddy about a man who has a 1-time affair with the wife of a lightning-arrester salesman during a thunderstorm. Unfortunately, the song never appears in the film although it does feature a snippet of the beautifully nostalgic \"Twelfth of Never\" by Nina Simone. What is the significance of the title? I'm still not sure, but the film definitely investigates the theme of covert/forbidden love and the purgatory of those who dwell in such affairs (\"the other woman\" or \"the other man\").<br><br>There are 3 love stories intertwined: A filmmaker is making a documentary about a feminist activist who happens to be the sister of the woman he is having a secret affair with, while secondly, the activist is having trouble with her own love life because her boyfriend feels that her career is her only true love, and thirdly, the filmmaker's assistant is a married man growing increasingly tempted by the overtures of a young woman he knows at work. Add to the jumble the fact that the assistant is the son of the maid who has worked in the activist's home all her life, and you have a bona fide Shakespearean comedy of errors, right?<br><br>Well, not exactly. And this is where my \"American idiot\" possibly comes in: I just didn't find the script to be very funny. The movie is listed as a comedy, so I assume I was supposed to laugh, but instead I found myself taking the situations very seriously. The funniest bits came from the filmmaker (played by Jean-Pierre Bacri) who we soon learn is a bumbling idiot behind the camera. Bacri's hushed arguments with his assistant (Jamel Debbouze, famous for his role as the grocery boy in \"Amélie\") were pretty funny and served to freshen things up every few minutes. Other than that, I felt like this was a pretty serious drama, heavy on interpersonal relationships and the complexities of social barriers that we impose upon ourselves. If you're ready for something like that, not a breezy comedy by any means, then you might enjoy this film.<br><br>While investigating the barriers of love &amp; marriage, the film also focuses on social/racial barriers. Here I thought the film did an excellent job due to Jamel Debbouze's brilliant acting. Since he is the son of the activist's maid, he is conventionally subordinate to her and her family, even though they are now working together as equals. His facial expressions and short words say it all, like the scene where they are all having a garden party at an immaculately set table, and his mother is serving them. Jamel refuses to sit down and doesn't eat or drink anything, though nobody seems to notice his furious defiance. Later in the film, as his oppression comes to a boil, he exposes his \"employers\" with a powerful monologue--not about overt racism but about the insidious mockery of civilized bigotry that the elite commit without even knowing it. It really makes you stop and look at your own life, wondering if you may be guilty of the same offense.<br><br>And it's that last bit (and Jamel's memorable performance) that makes this a worthwhile film even though the comedy may fall short. Perhaps in France people understand the humor better. I do speak French but I still didn't really get any big laughs. But in the end I thought this was a nice character-driven story of everyday life. Agnès Jaoui's work has been compared to that of famed French director Eric Rohmer, and I can definitely see similarities to Rohmer's films like \"A Tale of Springtime\" in which simple conversations engender complicated human interactions. On the American side of the camera she reminds me of indy film darling Miranda July (\"The Future\", \"Me and You and Everyone We Know\") but without July's quirky humor. Or maybe Janoui's humor is there but I just didn't get it because I'm an American idiot ;)","user":"rooprect","rank":[5,6]},{"title":"Talking","rating":7,"date":"12 April 2009","review":"The French are good at it. These conversation movies, there most of the action comes from the talking and there the people only exist through that.<br><br>Here we meet the high-heeled Parisian feminist, who according to the rules she keeps, has decided to have a boyfriend, decided to live alone, decided to have no children. A success story, worth a documentary to the old humbug disillusioned film-maker and the younger and more idealistic Karim of Arabian origin. By the way, Karim's mother works as a maiden in the household of the high-heeled feminist's sister.<br><br>This is funny and intelligent and not sensational. You won't remember it, but in some ways, you won't forget it either.","user":"stensson","rank":[12,20]}]