[{"title":"'If you don't like the road you're on, starting paving another one'","rating":7,"date":"27 February 2016","review":"Director David Gordon Green has absorbed the story (screenplay by Peter Straughan based on Rachel Boynton's documentary) and in addition to creating a tense film about political corruption in Bolivia, he places before the public the corrupt tricky shenanigans inherent in US politics that we are watching daily on television and other sources of media manipulation as the contenders for presidential candidate throw even more crude moments our way. It is well-timed film – if only people will take the time to watch it.<br><br>The plot is well summarized: 'In 2002, Bolivian politician Pedro Gallo hires American James Carville's political consulting firm, Greenberg Carville Shrum, to help him win the 2002 Bolivian presidential election. GCS brings in Jane Bodine (Sandra Bullock) to manage the campaign in Bolivia. Battling her arch nemesis, the opposition's political consultant Pat Candy (Billy Bob Thornton), Bodine successfully uses American political campaign strategies to lead Gallo (Joaquim de Almeida) to victory against Victor Rivera (Louis Arcella). The depths to which these manipulators stoop are at first surprising until we realize that politics is a game run by media writers and crisis managers and money. Then we feel privy to the rotten side of political campaigns and realize we are all watching it live at this moment. <br><br>An eye opener – or is it? The performances by Bullock, Thornton, and de Almeida are excellent as are those by the supporting cast, which includes Anthony Mackie, Ann Dowd, Dominic Flores, and impressive newcomer Reynaldo Pacheco. <br><br>Worthy of your attention if you can tolerate the undressing of politics. Grady Harp, February 16","user":"gradyharp","rank":[18,23]},{"title":"Right On The Mark!","rating":8,"date":"30 October 2015","review":"It's been awhile since Sandra Bullock has been able to immerse herself in a role. It's wonderful to see her back on the screen. Her character here is a political strategist who's flawed in ways that make her appealing. No other actress does sarcasm and feisty in the same breath as well as Bullock. Especially when she does it with a subtle nod to humility. This is a movie which will not appeal to everyone because it's about a political campaign and campaigns are the same whether in the U.S. or in another country. Unless you appreciate the games played in getting anyone elected this will feel labored. The entire cast is excellent. Thornton and Bullock apparently are friends off-screen and their scenes together aren't nearly enough as they are out for the same result. One of the smarter movies I've seen this year.","user":"lisacarlson","rank":[50,77]},{"title":"Vote of the people. Signed, sealed and delivered","rating":6,"date":"14 March 2016","review":"While having quite the comedy value to it, \"Our Brand of Crisis\" is a simple introduction to politic, the glory and all of its schemes. The premise might be fictional but it presents a decently serious issue with commentary of less-than-subtle nature. The cast is entirely capable on creating mostly unscrupulous characters, although the theme tends to plod in midway point.<br><br>Jane (Sandra Bullock) is a campaign strategist who has infamous rap, often being dubbed \"Calamity Jane\". She is recruited into Bolivia election while she also has to deal with her personal issues. This is an occasionally dysfunctional woman, to say the least. She's not the people person even though her occupation demands her to engage with other colleagues and citizens.<br><br>The acting is strong and with addition of Billy Bob Thornton, Anthony Mackie and Anthony Mackie, it's an engaging race of votes. Some of these characters are more than one-dimensional workers, and their apathetic mannerism or idealistic views are compelling to give more depth to the subject. Its dirty smear strategy also gives insight on the sometimes overlooked aspect of an election.<br><br>Story holds up well, although there are a few points that might be repetitive. Its display of politic world is nice, and the underhanded tactics can be realistically relatable, but the humor can be a misfire as it doesn't connect properly and creates a jarring shift of tone. The issues are somewhat exaggerated which might undermine the authentic message it tries to show.<br><br>It may not be a landslide victory, but \"Our Brand of Crisis\" is sufficiently told with great cast and approachable view on politic to grab one's attention.","user":"quincytheodore","rank":[11,14]}]