[{"title":"A joy to watch","rating":9,"date":"27 December 2007","review":"This reminded me of the Sunday afternoon dramas that the BBC used to show when I was young. There was nothing to dislike about this; it had charm, an improbable story, over-the-top characters and a real feel of the period it was set in - the thirties.<br><br>There were lots of familiar faces; it was good to see Peter Bowles back on TV and anything with Victoria Wood has to be good. Emma Watston sustained the reputation she built up in the Harry Potter films - she is definitely going to be a big-name actress in the future. My personal accolade of Best Actress, however, went to Yasmin Paige who played Petrova, the girl who wants to be the aviator. You heard it here first folks - she is going to be a famous actress - and I'm not even her mother!","user":"julieinbrittany","rank":[31,39]},{"title":"TV films like this should really be more well-known.","rating":8,"date":"6 March 2008","review":"This is a TV film based on the book Ballet Shoes. It is about three adopted girls just after the First World War who all have different ambitions for the future.<br><br>This may come as a shocking statement to some, but I think this deserved to be in the cinemas just as much as Spiderman 3, Enchanted and that sort of thing. I like those films as well of course, but this is really something.<br><br>I like this for the brilliant acting from Emma Watson etc, the similarity to the Noel Streatfield book, a lot of the humour and the end of the story, it is one of my favourite parts of the film. It may miss bits out from the book, but those bits are the unnecessary parts and the parts left in are well-chosen. I cannot properly explain how and why I like this (the previous part of the paragraph was not totally what I meant), but I just recommend it to anyone who likes the book and people who like Emma Watson.<br><br>At the very beginning of the film, a young girl with no surviving relatives other than her uncle, goes to live with him in his huge house of fossils. Her life becomes happier, but it soon turns out to be hard work again when on his travels around the world, the uncle sends her three baby girls. These girls grow up to have bright personalities and mixed interests and talents.<br><br>Enjoy \"Ballet Shoes\"! :-)","user":"Mightyzebra","rank":[21,27]},{"title":"Sweet and Charming Little Film","rating":9,"date":"3 February 2008","review":"It is a rare treat to view a film like \"Ballet Shoes.\" It's one of the those films where everyone has a piece of the cake of a happy ending but more importantly the film steers away from fluffy clichés and mushiness. The story takes place during the 1930s in a small house in London. Sylvia Brown (the luminous Emilia Fox), the niece of eccentric, traveling paleotolongist Great Uncle Matthew aka \"Gum\" who brings along from his travels three orphaned baby girls and it is Sylvia and her plucky Nana (Victoria Wood) that raise the three girls who grow up into fine young ladies with dreams and aspirations. The eldest is Pauline (Emma Watson aka \"Hermoine Granger\") dreams and aspires to be an actress, Petrova (Yasmin Paige) is the tomboyish one of the three and wants to become an aviator, and finally, Posy, the youngest and boldest one of the three has ambitions to become a ballet dancer. But this small family are facing harsh financial times and set their house for room and board. Enter the tenants that impact the girls' and Sylvia's lives: Mr. Simpson (the expressive Marc Warren), a man with a tragic past but a keen interest in cars and airplanes. He is someone Petrova can talk to; The retired scholarly professors Drs. Jakes and Smith (Gemma Jones and Harriet Walter) who take on the task of tutoring the girls; Theo Dane (Lucy Cohu), a professional dancer and actress, who makes the most profound influences on Pauline and Posy. The film tells how the girls struggle with Sylvia to save their home and at the same time pursue their dreams. To add to their struggles, Sylvia is ill and the girls do all they can to provide for her as well. The words I have to describe this little gem are charming and smart. With a wonderful cast delivering equally endearing performances. Emilia Watson is as always lovely and sweet as Sylvia a woman who selflessly gives and gives without ever once asking for repayment with Victoria Wood as Nana providing as a strong front for her and the household. The girls are wonderful: Emma Watson as Pauline is wonderful. She proved me wrong that she really can act and she definitely is more than the Harry Potter franchise. This is a performance that will hopefully carry her even further. Yasmin Paige as the big hearted and adventurous Petrova is a star in the making. Every scene she conveys such honesty and most of all she is real. Lucy Boynton as Posy is very lovely. She brings her character to life as the bold and daring young lady with such grace and maturity. Her scenes with Eileen Atkins, who plays Madame Fidolia a Russian dance instructor and head of a prestigious dance school, are wonderfully done and acted together. The film is sweet, smart, wonderfully acted and written without the added fluff and mumbo jumbo of made for TV films. The only tragedy was that this film wasn't released in the U.S.A theatrically or at least on HBO. This is a little gem I hope to own on DVD.","user":"bondgirl6781","rank":[20,26]}]