[{"title":"An Honest Review","rating":1,"date":"7 April 2017","review":"Have you seen it? No? There is likely a very good reason for that...it stinks.<br><br>Like nearly ALL the endless remakes and reboots that have been plaguing movie goers for the past decade or so....all this is, is a heartless version of the original.<br><br>It has no heart.<br><br>It has no soul.<br><br>It is a retelling of a film that we all love and cherish...and it adds nothing to the story. It improves nothing but the special effects--which held up very well over time--and in some cases belittles the fans of the original...particularly in the fact that they remade the movie at all, without adding anything clever to it.<br><br>Like so many other remakes it is a hallow shell of the original.","user":"generationofswine","rank":[61,80]},{"title":"Was this made for TV?","rating":4,"date":"26 May 2017","review":"I was a huge Poltergeist fan when i was a little kid and was really scared of the original movies when i saw them on TV in the late 80s or early 90s. It had everything a good movie should have. a good script, good actors, good director... this one had none of those. the actors feel unmotivated. the script was rewritten to add the typical 21century Hollywood movie formula and the director didn't know what he was doing anyway...<br><br>don't watch this remake... stay with the original! its scarier anyway, even today!","user":"Mynameisroman","rank":[6,6]},{"title":"Time dumpster, even for horror fans","rating":1,"date":"18 September 2016","review":"Horror movies are my favorite, but I'm not the type of horror movie fan that will simply judge a movie on its horribly photoshopped cover or generally hold holier than thou attitudes toward technique, execution, writing, and cinematography (although I will bask in the glory of these done well), especially when it comes to remakes. I like to give them the benefit of the doubt. <br><br>Poltergeist (2015) was no different. I had wanted to see it for quite awhile but wasn't convinced that it was a movie I needed to buy for $14.99 (thanks iTunes for your options, btw). After watching it tonight (for free, streaming online) the only two things that keep resounding in my head are \"Thank you inner voice for telling me not to hit the purchase button\" and \"OMG. Worst. Remake. Ever.\" In fact, I will go as far as to say that it's probably one of the worst horror attempts I've ever seen. <br><br>I don't need to include spoilers here. If you've seen the original, you know the story. This \"remake\" definitely assumes you have and gives not even a second thought to the story, nor does it even pretend it cares. It's an afterthought, at best. Actually, this whole movie seems and comes off as an afterthought. This remake was not made by someone wanting to expand upon or do any service artistically to the original. No, this is a pure, unadulterated cash grab at best. At its worst, this is a slap in the face to the horror genre for a quick buck, to fans of horror and to the original altogether.<br><br>I won't pretend the original Poltergeist is the best horror movie ever made, it's definitely always been cheesy in its own way. Yet, it managed to make me squirm, creeped me out, and kept me entranced whethercwatching it as a child or as an adult. The original Poltergeist is everything that this film is not....<br><br>This \"remake\" is sloppy, careless, poorly executed and poorly written, all while the actors struggle to pull out performances (even a talented actor like Sam Rockwell comes off disengenuous). It is lazily shot with more early 2000s-esque CGI than anyone should be asked to swallow for 2015...and is as scary as a wet dish towel. <br><br>There are exactly two moments in this film that I was slightly taken aback, but most definitely not scared, shocked, or surprised in the least. Mostly, I laughed or shook my head in embarrassment or dismay from how awful what just happened on screen actually was. Definitely not a crowning achievement. <br><br>Yes, the young newcomer actress is cute, and does her best...but you're not given an opportunity to care about what happens to her character or her family. <br><br>My husband fell asleep 7 times (I counted), and afterward said \"People standing around in a white sheet have been scarier and more interesting\". I agree.<br><br>Some remakes are good, most are bad, and unfortunately for Poltergeist and horror fans this trainwreck is the latter. It's a shame in a way because if it had been done well, it could have been pretty awesome. <br><br>Watch it, or don't, just don't buy it. You'll regret it. I promise. And most of all, do not expect to be satiated, scared or impressed in the least.","user":"Evansbee","rank":[29,39]}]