[{"title":"I Loved This Movie and Story","rating":10,"date":"26 December 2009","review":"I have no clue why some of these unfair and off balance reviews. I was expecting this movie to be very simple and average, I was pleasantly surprised and found it very funny and to have a great story line and heart warming lesson or two. Perhaps some of the stereotyping offended some? I thought it was dead on and rather funny. The campy, just rolled outta bed, let's make some home made crafts and pudding Minnesota characters were dead on accurate from my experiences visiting Minnesota. Whoever did the research and background on Minnesota obviously spent some time there and put it all together in a nutshell just perfectly for what is a very funny and heart warming story. Where is your sense of humor people? The story itself for that matter was one of believing in the common good as we see the educated and professional city girl played by Rene Z learn a few good lessons about more every day people. She takes a bad situation and turns it into something very good, great in fact. By the end if you follow the story you are left with a tear in your eye. I loved her character, loved her, Harry Connick was great too and so for Rene and the people who worked hard on this movie, it was well worth the rental and I will watch it again today before I return it in fact. Don't listen to these snooty know it all critics here, especially if you are a Rene Z or Harry Connick Jr fan, you will love this movie and story, I promise.","user":"cream_bar","rank":[38,44]},{"title":"Underrated","rating":7,"date":"2 January 2010","review":"I think this film, while not a classic by any means, is being underrated at its current score. Admittedly, I came close to turning off the DVD ten minutes in, when it appeared to be little more than a cheesy send-up of life in the country. Yes, there are a few slapstick moments. And yes, the plot and its various \"twists\" are predictable. But if you suspend your cynicism and just take it in, it's not that bad of a way to spend an hour and a half. The film is somewhat unconventional in the sense that, unlike so many recent films set in small-town America, it does not portray residents as narrow-minded people in need of enlightenment. As the film progresses, the residents of New Ulm are increasingly shown as three-dimensional human beings. Their strong sense of family and communal ties is embraced, and in fact, portrayed favorably compared to the stark individualism celebrated by our mass culture. In its own way, the film suggests to the urban, \"sophisticated\" viewer that perhaps there is something to be learned from such people, or at least, that their cultural traditions should not be dismissed out of hand. A little sappy, yes, and predictable, but also heartwarming and a nice little glimpse into a slice of Americana we don't see portrayed that often on the big screen nowadays.","user":"sillyhat","rank":[8,8]},{"title":"A heartwarming comedy","rating":11,"date":"11 April 2009","review":"This film is about a business woman from a big city who got transferred to a small town. She encounters much trouble adjusting to the small town life.<br><br>\"New In Town\" is another romantic comedy with Renee Zellweger as a person who achieves despite her mischievousness. She is already heavily typecast, but then she really is adorable and likable so it is OK. The plot is very predictable, but is enjoyable mainly due to the small town warmth. Seeing acquaintances and colleagues help each other out, and giving hand made gifts is refreshing. It enhances the positive spirit of the film, and makes the characters more engaging.<br><br>\"New In Town\" is a heartwarming comedy, I enjoyed watching it.","user":"Gordon-11","rank":[41,51]}]