[{"title":"RUN to the theatres to see this one!","rating":9,"date":"3 March 2011","review":"We saw it tonight with about 30 friends at a pre-release screening in Atlanta. <br><br>Let me say I am a 50-yr-old female film-lover. Sci fi is not my favorite genre, but I have seen most of the sci fi classics. <br><br>I didn't know what to expect as I am not always a sci-fi comedy fan. For instance, although mildly entertaining, I wasn't wild about \"Hitchhikers Guide to the Galaxy\". I was wild about some of the cast members, but not really the film.<br><br>So, we arrived and the theatre was packed. They were turning people away at the door. Although I had qualms and wasn't sure I'd like it, it turns out I LOVED it! ALL of the audience members seemed to laugh themselves in to hysterics through much of the film. And the ENTIRE AUDIENCE CLAPPED WILDLY AT THE END!<br><br>WARNING: This movie is NOT for the devoutly religious or for those who are offended by swearing and sexual references. Period. If you THINK you might be offended by anti-religion humor, swearing, or sexual references, then don't go. And I would recommend it for older teens only; NOT young teens.<br><br>Amazingly, during the first 20 minutes or so, I found myself thinking 'This is delightful! If only they could keep it THIS funny for the rest of the film..... so many comedies start out with a bang and then are just \"tired\" by the end of the movie.....' <br><br>But I couldn't have been more wrong. It not only kept up a wonderful pace, but introduced many great characters along the way.<br><br>If you enjoyed \"Shaun of the Dead\" and \"Hot Fuzz\", this will be right up your alley. There were lots of sci fi movie references (Alien, ET, Close Encounters of the 3rd Kind, Star Wars, Aliens, Predator, etc.) It had an AWESOME cast, MARVELOUS character development, and a terrific script that went from sweet and moving, to hilarious, to scary, and back. It was really SO MUCH FUN! <br><br>It is lewd, it will certainly will be offensive to some American Christians, and it is totally sci-fi, but it's absolutely hilarious. So, you sci-fi comedy lovers, GO!! RUN to the theatre to see it on the big screen. Take friends and enjoy, enjoy, enjoy!","user":"dapplegrey13","rank":[284,402]},{"title":"A pleasant surprise that had me laughing all the way","rating":9,"date":"2 March 2011","review":"I lucked out and received tickets to watch an advance screening of this movie. I had 0 expectations, the trailer didn't really show much, and generally went in with an open mind.<br><br>Bottom line: no forced laughs and I laughed a plenty. The writing was absolutely brilliant. The gags are funny, and jokes come in smart and crude and those who are science fiction fans will get a huge kick out of how many hidden nods there are everywhere. Simon Pegg and Nick Frost did a fantastic job penning this script (as well as their acting)and well executed by Greg Mottola (Superbad and Adventureland). Simply put, I had a blast and it was just that much satisfying as a film overall.<br><br>Personally, I would have given it a 10, but it may be hard to recommend to a wide audience. I would expect anyone aged from 16 to 30 would enjoy it the most given the amount of vulgarity in the movie. Basically, I wouldn't recommend it to my parents because they definitely will get turned off by it.<br><br>I was initially skeptical about Seth Rogan voicing Paul: DON'T WORRY. He does a great job and you end up loving the character. All the actors in this film were great and you will enjoy their roles.","user":"n-kalimin","rank":[171,242]},{"title":"Ready to get probed?...","rating":8,"date":"8 June 2011","review":"From the trailers, I had come to expect quite a lot from the movie. Actually I had thought and believed the movie to be more than it actually was when I was done watching it. Now, I am not saying that the movie is bad or dull, far from it. The movie is pretty cool and fun, though there is nothing overly new and inventive about it. And that is what sort of made the movie a bit tame.<br><br>The storyline in \"Paul\" is good. An alien has crashed on Earth and now many, many years later he escapes from captivity and hits the road, where he accidentally bump into Graeme Willy and Clive Gollings. With the government in chase, Paul and his newfound friends are racing to get across USA and to get Paul home.<br><br>Right, well throughout the movie there was a bunch of subtle and not so subtle references to other movies. Many of these had me laughing, because they were hilarious and quite often in your face. And it was rather surreal to have a country/hillbilly band play the cantina band music from Star Wars, but it was hilarious.<br><br>As for the cast and the acting in the movie. Well, it has long been established that Simon Pegg (playing Graeme Willy) and Nick Frost (playing Clive Gollings) have amazing on-screen chemistry and they add a lot to each other. So it was nice to have another movie with them working together. Jason Bateman (playing agent Zoil; you will love his full name when it is revealed) also did a good job. He was cool and to the point, and his character was really awesome. Bill Hader (playing Haggard) and Joe Lo Truglio (playing O'Reilly) worked well together as a goofy police unit, and added some weird comedy to the movie. It was a shame that Sigourney Weaver (playing The Big Guy) had such a small role. But despite this, she always delivers a good performance. And I just loved what was said right after she got punched in the face. That was one of my favorite movie references in \"Paul\". Now, Seth Rogen (the voice of Paul) is not really one of my favorite actors, but he did a good job with the voice-acting in this movie.<br><br>For a comedy, don't expect to be laughing throughout the entire movie. The movie is driven by a good story and spiced with comedy here and there. Which in itself is a good combination, and it worked well for this movie.<br><br>Not to forget the CGIs in the movie. They were excellent. The character Paul was so nicely made, and the textures of his skin, face and eyes was off the charts. And those effects really helped carry the movie.<br><br>\"Paul\" is a great movie, though it is not Simon Pegg's and Nick Frost's best movie, it takes a lot to top \"Shaun of the Dead\". But it is a good enough attempt, and the movie works well enough all together. A movie with a great story, some laughs here and there, and it will take you out of this world.","user":"paul_haakonsen","rank":[66,90]}]