[{"title":"What's With You People?","rating":8,"date":"8 July 2011","review":"Three fourths of these reviews hate the movie and whine about the idiot decisions of the scientists. Well of COURSE they made idiotic decisions! Where's the film if they made perfectly sane decisions? What kind of film is that? <br><br>I actually thought the film was effing brilliant. I think it took a familiar premise and retooled it. The performances of Adrien Brody and Sarah Polley were exemplary, as always. I saw it for Sarah Polley as she is one of my favorite actors and one of the most underrated ones out there today. The actress that played Dren was also strong and had the perfect mix of human, alien, and innocence. <br><br>The film addresses many scientific issues, but does so with a moral and emotional center. I like that the film doesn't pull punches and I like that there are consequences for the actions of the scientists. I thought the complex relationship of the couple and their creation was skillfully rendered and and excellently acted. <br><br>Was it flawed? Sure. But it was also really kick ass and I'd see it again in a heartbeat. <br><br>If you want your horror sci-fi movies neat and tidy and pedestrian this probably isn't for you.","user":"alnora1227","rank":[115,145]},{"title":"Omg. Hahaha what did I just watch??!","rating":25,"date":"25 April 2012","review":"Lol... Seriously, what did I just watch?? I can't decide if this movie is brilliant, cheezy, profound, juvenile, disgusting or the biggest turn-on since \"I Spit On Your Grave\". I'm not sure if you'll love or hate this flick, but if you will definitely NOT forget it.<br><br>As you can guess from the movie posters, the story is about an artificially-engineered humanoid who's pretty hot. Let your imagination take it from there. What makes this story so memorable is that the writers aren't afraid to take it wherever it needs to go. And then some. Like if you thought \"Species\" was perverse, it looks like \"The Flying Nun\" compared to this.<br><br>Just to throw some words out there: incest, bestiality, rape, science, incest. And yes, I know I said it twice.<br><br>I found myself, in the depths of my twisted mind, thinking \"woah, wouldn't it be crazy if (such and such) happens...\" and sure enough it does, only to be followed by \"oh but they wouldn't dare let (such and such) happen...\" and sure enough it does again. Normally I would say predictability is a flaw, but in this case it's thrilling. The whole experience is like a voyeuristic romp, testing the limits of how screwed-up the writers' (and your own) imagination can get. The point being, I'm sure, to show just how morally wrong it is for scientists to engage in vivisection &amp; the creation of life. This is like Frankenstein on steroids.<br><br>Like seriously, my hippie brethren, put down your picket signs and just show this movie on street corners... You'll see an end to vivisection overnight.<br><br>Parts of this story seemed ridiculous &amp; comic booky, but just when I'm about to write it off as childish tosh it introduces some incredibly complex themes like a Greek play. You think Oedipus had problems? Hahaha Oedipus never saw SPLICE. It would make him go crying to his momma.<br><br>The more I think of it, I think this film is brilliant. Much like \"Starship Troopers\" was a deep socio-political satire disguised as a campy action flick, I think SPLICE gives us a techno-moral satire disguised as a thriller. But like I said, I have no clue if this is masterpiece material or just plain cheese. Most likely the filmmakers deliberately used elements of both.<br><br>If you like scifi satires like \"Starship Troopers\", \"District 9\", or scifi morality plays about the creation of new lifeforms as in \"Solaris\", \"Moon\", \"Alien Resurrection\", or the one that started them all, \"Frankenstein\" (2004 miniseries, the best version), maybe with a bit of \"Species\" eroticism &amp; \"Rosemary's Baby\" &amp; \"The Omen\" &amp; \"Mommy Dearest\" &amp; \"Flowers in the Attic\" thrown in, then this is for you. I think...<br><br>By the way, y'ever notice how aliens &amp; evolved humanoids always look just like Bjork? Just sayin...","user":"rooprect","rank":[34,40]},{"title":"Untruth In Advertising","rating":7,"date":"9 June 2010","review":"\"Splice\" is a step in the right direction for horror.<br><br>Every so often, I find myself pleasantly surprised by intentionally misadvertised entertainment, and writer/director Vincenzo Natali's genetic genre mash-up is the latest such example. From a marketing standpoint, its scare-tactics are clearly the easy sell, despite their comprising only a tiny percentage of its thematic intent. 'Hard sci-fi parenting metaphor' is, after all, a much tougher pitch.<br><br>So expecting the tasteless creature feature from the trailer, \"Splice\" impressed me in its pursuit of a more complex emotional response than fear, and is successful in burrowing into your subconscious and picking at your psyche. It's a thinking man's B picture, which plays with the idea of morality on both a scientific and personal level. That it remains intellectually stimulating, even when the surface-area film dips into more traditionally hokey horror territory, is its greatest strength.<br><br>What's so interesting about the story, in spite of what the trailer suggests, is that the creature artificially spawned by genetic engineers Clive and Elsa (Adrian Brody and Sarah Polley) is not an antagonist for the vast majority of the film. \"Splice\" isn't about a monster— It's about parenthood, and like with \"Rosemary's Baby\" or \"Eraserhead,\" taking the associated fears and filtering them through a horror lens. <br><br>Besides the tail and the pronounced facial cleft, test-tube baby Dren ('Nerd' backwards, heh) is essentially human, and a big part of \"Splice's\" inherent creepiness is that she's treated in turn as a subject and a child—Warmly received, but caged and abandoned for significant stretches of time. The realization of this character by French actress Delphine Chanéac, is another of the film's triumphs. Her general lack of dialogue sometimes forces the performance to rely a little too heavily on pantomime, but that we can both feel for and fear Dren simultaneously is a testament to the range of the actress.<br><br>Perhaps it's because \"Splice\" nails the big performances and the big ideas, and because the gears turning behind the action are so consistently fluid, that it's all the more apparent when it stumbles over little things, like stilted motivation issues, and superfluous, grating secondary characters. Clive's brother (Brandon McGibbon) and boss (David Hewlett), for example, are flat placeholder roles that transparently progress the plot instead of enriching it. The triangular relationship between Clive, Elsa, and Dren, and its weird morphing emotional permutations, is what \"Splice\" is at its core. It is a film with very few characters, but every moment not spent on that central dynamic feels like time wasted.<br><br>Still, that minor gripe is forgivable because \"Splice\" has two hugely important and rare qualities for modern horror—Original thought and fearless storytelling. The undercurrent of sexuality in the film, the internal dialogue on gender roles, is apparently one of the reasons no studio wanted to touch the script last year, but Natali's film is a cut above the rest precisely because it isn't afraid to make an audience uncomfortable. And it gets uncomfortable.<br><br>\"Splice\" gets a lot of credit from me in the abstract. The concrete film doesn't quite live up to the incredible promise of the ideas behind it, but the very presence of those ideas is reaffirming to a degree, and that \"Splice\" received a wide domestic release is more encouraging still. Granted, it went on to perform below expectations at the box office, but was positioned against more breezy summer fare like \"Shrek\" and \"Get Him to the Greek.\" <br><br>The other possibility, and this suggests more consumer confidence than an ad man may be inclined to grant, is that \"Splice's\" scare-tactics aren't the easy sell. Maybe, like me, potential moviegoers just saw a trailer for another crappy horror movie instead of the interesting, offbeat experiment it is.<br><br>It's Warner Brother's loss, and the audience's.","user":"colinrgeorge","rank":[203,278]}]