[{"title":"Familiar, but still first rate b-movie thriller","rating":8,"date":"22 November 2009","review":"Barbara Stepanksky directed &amp; co-wrote this little thriller with Alison Lee Bingeham. They wisely took plot developments from a few older familiar film PLUS a character from the classic. THE BAD SEED.<br><br>The cast is consists mainly of 5 people, mainly they are from various Television &amp; cable shows. It is almost a large one set film,(A near deserted auto Junk yard.)<br><br>A recent widowed women, a late-teen aged son &amp; daughter. This three-some move in with her quirky brother (owner of the junk yard ). these 4 nice people are trying to cope when a 13 year old young girl enters there lives..As I said above,. BAD SEED time again.<br><br>The cast consists of Melora Walters, William Mapother, Jackson Rathbone,Joanna Bradley &amp; Sofia Vassiliva. All 5 are first rate.<br><br>It is a well done minor b-movie, Since there are no explosions or naked scenes It was released direct to DVD.<br><br>I think this film deserved a better fate. See it &amp; I think you will agree.<br><br>Ratings: *** (out of 4) 87 points (out of 100) IMDb 8( Out of 10)","user":"jaybob","rank":[11,15]},{"title":"Meh...not terrible, but only mediocre","rating":5,"date":"9 December 2010","review":"I will start off by saying that I did not hate this movie. It was decent, and not a complete waste of a couple of hours. The acting was good, but if you've seen movies like \"The Bad Seed\" or \"The Good Son\", you have seen it all before. The only difference here is that the young girl pulling the trigger seems to have a semi-valid, though a bit twisted, reason to do the things she does. My biggest complaint is that this movie is pretty boring. There is not enough suspense to keep the more experienced movie-goer intrigued throughout the duration of the film. I would even say its slightly predictable at times. Also, it is classified as \"Horror\" on many websites and it most definitely IS NOT a horror film but a drama, with a little suspense mixed in. It felt very much like a Lifetime movie to me, which though somewhat entertaining, can often be just too tame for my taste. If you want a similar evil child movie, with a lot more suspense and plot twists, I suggest seeing \"Orphan\"...much more original and disturbing.","user":"MsKitty77","rank":[9,12]},{"title":"Another evil child movie","rating":5,"date":"1 November 2009","review":"I watched this for fun, trying to get the first review in. It's just another mediocre evil child movie.<br><br>The acting is good and the evil child indeed gets your blood boiling. But what drives this movie, for me, is the ineptitude of the family. How did they survive the death of their father and stresses of the aftermath and still be so incapable in life? The mood of the movie was good. The pace was slow and for a long time, you wondered what the hell was going on in the movie and then boom! You realize what's wrong with this evil child.<br><br>Emotionally, I did get upset and angry. I never got scared, which is what a horror movie should do. So as a horror movie, the writers failed. As a thriller, they succeeded, I think.<br><br>What I really liked about this one is the history of the storyline. Most evil child movies just explain that the evil child is bad. This one tries to explain that the child was emotionally hurt and it drove her to be the way she is. Is it possible? I'm not at all convinced that the children portrayed in these movies are capable of half the stuff they do, but hey...it's fun to watch.<br><br>If you're bored of PvP'ing in WoW or if there's nothing else on cable TV, you should give this movie a try. However, don't expect something spectacular. This movie is mediocre at best.","user":"IMDBer100575","rank":[14,23]}]