[{"title":"Harmonious blend of Horror and Drama!","rating":9,"date":"8 August 2019","review":"It's a promising movie to watch where there are no major faults in story plot or acting or cinematography. You are kept hooked always by Interesting elements throughout, making the long run-time of 129 minutes easily passed by unnoticed.<br><br>Great charisma and chemistry displayed by the two main actors, Ahn Sung Ki and Park Seo Joon. The big generation gap was well handled and they made a believable team to root for.\nReally impressed by the funny and warm moments between the Heroes in face of a serious battle against Evil.<br><br>Visually appealing overall whereby certain scenes made good impressions but unfortunately, not memorable enough to leave a lasting impact.<br><br>If I am to point out any major minus, it would be on lack of narrative of the Villain. Though Woo Do Hwan managed to portray a very sinister and powerful Big Bad character through his acting, his agenda (plot design) is simply not insidious enough to intimidate the audience. This is made worse by how little the interaction time between Villain and the Heroes. In my opinion, if the plot focus more on friction between the two sides instead of the Villain solo act of evil deeds, the result would have been different, a lot!<br><br>Summary in one word would be \"Harmonious\".\nWith some minor adjustments, it could have been \"Awesome\".\nThus, I give an additional star for Effort (it should have been 8/10) as I look forward to its sequel.","user":"enacycle","rank":[19,22]},{"title":"Better then it sounds","rating":9,"date":"20 November 2019","review":"The Asians do movies so much better then us Americans. This movie is so much better then it sounds. I usually don't like exorcist movies , just too stupid. This one will not let you down. There are a couple of spots English subtitles would have been helpful. Over all, I would watch this again.","user":"Mischiefboi","rank":[7,7]},{"title":"Fresh from the Oven..","rating":10,"date":"15 August 2019","review":"Nice Movie..<br><br>His drama is powerful at stirring emotions because it is built up gradually, from exposure to Yong-hoo's inner suffering to his \"enlightenment\". Even if there is still a lecture on \"Believe that God loves you\", it is not a driver of change in the protagonist's attitude. He changed after finding affection (again), and understanding how helpful and happy others also bring happiness to himself. Religion according to the definition of The Divine Fury is not (only) a matter of increasing ritual worship. The most important thing is to do good.","user":"billyfrelly","rank":[18,22]}]