[{"title":"A Nutshell Review: The Other End of the Line","rating":7,"date":"15 February 2009","review":"Much has been said about the outsourcing of call centers to India, but so far I haven't seen one portrayed in a film in this manner, where Ifelt the portrayal of its inner workings was one of the better moments in his romantic-comedy. As far as I can recall, those who make cold calls to me for surveys, credit sign up and the likes, seem to sound local, or have that distinct regional accent that wasn't disguised, but if things happen per the movie, I won't be surprised that I was duped to believe they're calling from somewhere locally, rather than from abroad.<br><br>So welcome to the world of tele-marketers/helpdesks agents/salespersons, where in-house training centres established take their employees through continuous training in order to ensure their accent are masked, their pop-culture knowledge brought up to speed, and they're well-versed in local colloquial terms, so that they seem to be your friend from next door when they talk to you, rather than a feeling of resentment knowing that their neighbours job has gone offshore. It's no easy training, and naturally one that calls for great measure of patience for facing phones being slammed down, or worse to stand up to verbal abuse in many forms.<br><br>The Other End of the Line is your standard romantic comedy, which in my opinion got lifted from mediocrity thanks to this aspect of the story that I had a peek into. However, like most east-west fusion films made by Hollywood on Indian culture or aspects of India, it does get romanticized a great deal, and shots of Mumbai looked far too much like it's being lifted from a tourism board promotional video, or some tourist's excitable travel video of an exotic locale that he came back from. Think along the lines of Mistress of Spice, and Bride and Prejudice, and you have an idea how this story by Tracey Jackson had been approached by director James Dodson.<br><br>Priya Sethi (Shriya) works in a call centre in Mumbai belonging to CitiOne Bank (no prizes here), and her daily night shift (to be on the same timezone as the USA) gets frowned upon by her conservative family (Anupam Kher from Victory as Dad, and Sushmita Mukherjee from Dostana as Mum), even though she's earning good money to become the chief breadwinner, versus than her insurance salesman dad. She adopts her Jessica David profile for calls she makes to CitiOne's customers, putting on a perfect American accent as she speaks to strangers every night, only to call on a handsome young man (she knows because she Googles) Granger Woodruff (Jesse Metcalfe of John Tucker and Desperate Housewives fame) who had his identity stolen and a whole host of credit card transactions erroneously billed to him.<br><br>The both of them strike up a friendship as they speak frequently to clear up and verify his credit card transactions, and with one thing leading to an impulsive another, they set up a date, even though she knowingly lives on the other side of the world in India, while fibbing that she's actually in San Francisco, a city which Granger would be going to for a make or break advertising deal with a hotel chain.<br><br>As with any romantic movie, the chemistry between the couple is important for it to be believable that they're falling for each other, and in this aspect both Jesse Metcalfe and Shriya excelled in, looking good on screen as they share plenty of romantic moments the plot had thrown at them. You'd find yourself inevitably rooting for them as they overcome expected challenges, knowing that these issues will probably not be show stoppers, since they conflict with the type of characters they are, strong-willed and stubborn as a mule toward tradition that the modern generation do not buy into, or just don't buy into spending time with someone they don't believe in.<br><br>Possessing some amazing powers and ability to hear from a distance, The Other End of the Line is a long-distance infatuation that took on a life of its own, where characters step out of their comfort zones to pursue what their heart tells them. Since it's just a few days after Valentine's, this movie got made and released now for a reason, to have you partake in some lovey-dovey movie with comedy courtesy of a traditional family thrown in for good measure. Need a movie for a romantic night out? Then The Other End of the Line will satisfy that objective. Nothing fancy, but it works.","user":"DICK STEEL","rank":[31,34]},{"title":"A pretty decent romantic comedy","rating":7,"date":"28 February 2009","review":"I really can't figure out why people have rated this movie so low, at least as yet. I won't say that the movie was exceptionally good in acting or directing or screenplay or whatever. But, on a whole, the movie did quite well in doing what it was meant for. Its a simple romantic comedy with a dream romance between an Indian girl and an American guy and it scored pretty well there. Some of the moments with Anupam Kher were really very very hilarious. Though, I would say that at some points the movie lifted up from reality and went into the ideal state. But, then again, romantic movies are usually like that only.I liked the movie to give it a decent 7/10. I'd suggest that you go and watch the movie, it'll be a real fun to watch!!!","user":"timebarrier","rank":[24,26]},{"title":"watch it...","rating":8,"date":"3 May 2009","review":"Well,I didn't have so much expectations from this movie.But the way it turned up,I kinda liked it pretty much. Its a perfect piece for 'getting-to-know' Indian women.Priya Sethi is well put up a character.Watch her character closely.There so much in it.And Shriya saran played it amazing,a perfect justice to the young innocent character dreaming high.You will definitely like Charlie(Austin Basis) too.Jesse metcalfe has done a fair job.Anupam Kher Also too good. This piece is much portrayed from Indian angle.Alhough sometimes the romance seemed to me induced sort of,but it went well at the spot.Women at call centres must watch it.<br><br>Fresh,alive,very much a positive romantic piece.Worth-watching!!","user":"AmitGoenka","rank":[22,24]}]