[{"title":"I'm not a rugby fan but this is a story to inspirer all","rating":9,"date":"21 October 2019","review":"As a kiwi I knew who Eddie Jones is and to be fair wasn't a big fan from seeing him in the news over the years. This doco changed my mind what a great leader and coach. You don't have to be into rugby to enjoy this ride/movie. I found it interesting and inspirational. Temuera Morrison did a good job on playing Eddie Jones.","user":"shanenz-56624","rank":[8,8]},{"title":"Inspirational","rating":10,"date":"19 October 2019","review":"Absolutely brilliant, moving and inspirational. Probably now the greatest rugby movie ever made, pushing Invictus into second place IMHO.\nMasterful portrayal of Eddie Jones &amp; Michael Leitch in particular. The real Eddie &amp; Michael and other Japan Rugby personalities pop up throughout the movie to add extra authenticity and poignancy in relation to the match story and their own personal journeys.","user":"clan-anderson","rank":[13,16]},{"title":"Brilliant and edgy -- I don't know what I just watched!","rating":10,"date":"7 December 2019","review":"I'm a big fan of that great romantic hero, the underdog who overcomes the odds and the obstacles to achieve the goal, to emerge victorious.<br><br>In that sense, The Brighton Miracle certainly does not disappoint. Still, that's not enough to warrant a 10/10 rating.<br><br>What I found to be unique, artistic, edgy and utterly creative was the way they blended the real world people with their dramatized versions, especially the most challenging: Eddie Jones and Michael Leitch. The movie moved seamlessly between the brilliant acting of Temuera Morrison and Lasarus Ratuere, and the commentary of their real life counterparts, slaughtering yet another sacred cow of cinema (the other sacred cow that was recently slaughtered was that of mixing real actors with animated characters). That wasn't just true for those two; the entire supporting cast made me a believer in the exact same way.<br><br>Conceptually, I \"knew\" when I was watching an actor act and speak lines vis à vis when the \"real\" person was sharing their commentary. At the same time, however, on a much deeper level, I was always aware, I always recognized that the persona I was watching in either case was one and the same. They merged to form something greater than logic: Myth.<br><br>That, in my opinion, is the measure of a true work of art. 10/10","user":"zkotpen","rank":[3,3]}]