[{"title":"David Benioff strikes again","rating":3,"date":"3 October 2019","review":"When I saw the trailer I thought \"Yea, I already know exactly how the story goes, but the deaging effects look nice\"<br><br>So I went into it expecting not much, but at least some average entertainment. But oh boy, the movie is kinda hard to enjoy. The characters have no depth, the story is totaly bland and the action in it's best moments is super average.<br><br>I was right on both my predictions. The trailer already tells you the whole story and it does feel like you've already seen it before. And also, the creation of a young Will Smith totaly worked.<br><br>The script is horrible and you can easily notice the flaws. There are some super obvious setups that are so randomly thrown in that you know it's gotta be important later, just to then be disappointed that the payoff is even worse. Speaking of \"Bees\".<br><br>Sometimes it feels like scenes are missing. Some actually important stuff just happens off-screen.<br><br>The finale is disappointing and unspectacular and also the special effects are super whacky. People jump and run so fast that it looks like an early 2000s movie.<br><br>Conclusion: Will Smith keeps picking mediocre movies, I can't recommend you watching this, I was really bored.","user":"AmonStarrick","rank":[638,817]},{"title":"David Benioff & his pen present: Another disappointment","rating":4,"date":"28 December 2019","review":"Gemini Man was directed by Ang Lee and stars Will Smith as an assassin who fights a younger Will Smith.<br><br>Gemini Man is one of the biggest disappointments of the year and the second disappointment of the year written by David Benioff. Character depth is non-existent, the story fails to be interesting and is often pointless and the action sequences are mostly let downs. Another big problem is the very underdeveloped supporting characters. Both Mary Elisabeth Winstead and Benedict Wong who are respectable actors are given very little to do and serve little purpose in advancing the plot. The main reason for that is the writing and no, not just David Benioff. This film has three credited screenwriters due to multiple rewrites and the ending result is a mess, to say the least.<br><br>Despite the poor writing, I can praise Gemini Man for great de-aging effects which were easily the highlight of this film. Also, Will Smith at least gives some effort to his character but without any succession due to poor directing.<br><br>Unless you want to lose close to two hours of your time skip Gemini Man and go watch Looper or other actually good films with similar concepts.<br><br>Final Rating - 4/10","user":"Aaron_Kyle","rank":[135,173]},{"title":"Great lead, great director, brought down by the poor writing of Beinoff","rating":2,"date":"3 October 2019","review":"I was excited to see a preview of this based off the trailers, it looked like it had such a promising premise, but that premise is wasted by poor writing and stilted dialogue. I didn't realize this was written by Beinoff until after I saw the movie but looking back on it it makes a lot of sense. This is exactly the kind of shlocky writing and stupid characters any fan of GOT has come to expect after season 8. I can feel the \"Well, X character kind of forgot about Y.\" throughout the plot.","user":"elect-h-allen","rank":[358,491]}]