[{"title":"Well done - clear, powerful and sad - just like her vocals.","rating":10,"date":"31 August 2019","review":"No need for pretentious bs and more tales of sex and drugs. Just a rare and remarkable voice surrounded by devoted musical relationships. The archival footage looks and sounds wonderful. Her thoughts on a dirty rotten business from early on are fascinating. She was something - no vanity. Crystal clear pipes that for youngsters should be a revelation. In the end, in English or Spanish - that voice knocks you back on your youthful heart.","user":"lauelxo","rank":[69,70]},{"title":"Must see if you love music and want to be inspired...","rating":10,"date":"9 September 2019","review":"This is an uplifting, beautiful chronicling of Linda Ronstadt's life and career. Her versatility, independence, goodness, intelligence and amazing talent are inspiring, and we sure need some inspiration these days.\nMany don't know that Linda has Mexican roots, and that her forays into so many genres (pop, country, folk, rock, opera, classics, Spanish-language albums...) were generated by the eclecticism of her early family life - from singing with family at home, and sitting by the radio (her \"best friend\" as a child) listening to musical broadcasts.\nThe movie emphasizes Linda's true love of singing, her commitment to being authentic, being one of the first women to lead in the male-dominated music industry, and her enduring friendships with both men and women. This is a wonderful documentation of someone achieving the American dream with honesty and authenticity - and overcoming limits for women via talent and presence of mind. And, ultimately, she teaches us by giving us this film how to LIVE after having been diagnosed with a progressive fatal illness in 2009 (Parkinson's).","user":"nlynn17","rank":[16,16]},{"title":"If you heard her music in its era, you will enjoy this film","rating":8,"date":"8 September 2019","review":"I loved this film, as Linda Ronstadt's music is part of my history growing up. It was great to see the vast range of her styles and variety of her many, many hits --something I didn't take note as it is happening amidst all the other factors of growing up.\nI would have given this movie 10 stars but it is more of a positive spin with some allusions to the obstacles she faced, rather than a revealing bio-pic. Nothing as telling as the bio-pics of Freddie Mercury or Elton John that are both truly superb pictures because as fans we gained insight into their struggles as well on their way to success.\nTo be fair, there is some discussion about drugs, sexism and health issues, but it is not critical to the film.\nI totally enjoyed the film because it was sort of \"greatest hits\" of LR, (her actual performances) with famous people commenting and some fun collaborations thrown into the mix. Well done and keeps your interest throughout.\nIf you like Linda Ronstadt's music, you will enjoy this film!","user":"nyccents","rank":[23,24]}]