[{"title":"Funny, happy and fluffy","rating":8,"date":"30 January 2008","review":"This is a movie which can easily be categorized as being exclusively for children and I am sure few grown ups will appreciate it. We all know how difficult it is to create a movie with children and animals but this is definitely a successful attempt. It is created for younger audience and it serves its purpose. It is not in any ways similar to \"Snow dogs\", so don't be misled by the name. There is some sort of a story line, which like in other Disney movies of that sort is simple enough. Children will fall in love with it and if you need a good doze of positive emotions from lovely pups you might check it out on a Sunday morning with your 6 year old.","user":"botev1921","rank":[36,56]},{"title":"the little 6 buds journey in spirit hope and glory","rating":6,"date":"11 December 2015","review":"In this spin-off of the Air Bud franchise, five pups follow an ice cream transport truck to a plane and end up flying with the ice cream shipment to Alaska. There they find a pup friend and a boy who needs five dogs for a big race. this film is lovely Xmas movie as a holiday classic with Kris kristoferson husky voice of a husky who guides animals this is a heart warming story for the family to love as we see 6 puppies called budderball, a rapping b dawg, a courageous rosebud, a mellow Buddha, a dirty dog called mud bud and a friend when they arrive in Alaska called Shasta as they find a trip to Alaska buy cold van they look for fun adventure excitement with power full dream and sense of travel and teamwork with a young boy looking for dogs to race faith just happens to intervene to give this boy hope in this film which I gave it 7/10 at 1hr24mins its one for you Xmas collection","user":"lark40","rank":[1,1]},{"title":"Cute, funny and inspiring","rating":28,"date":"28 January 2014","review":"Everyone's favorite golden retriever puppies are back again.<br><br>In Fernfield, Washington right before Christmas, the puppies are out playing and having a good time. B-Dawg makes the mistake of chasing a kitten, whose mom is the angry Himalayan Miss Mittens. One of the other puppies sees an open ice cream truck, so they all have to sneak in and have a treat. B-Dawg watches for humans. But he too must hide when Miss Mittens shows up, so our adventure begins.<br><br>It seems the ice cream is headed for Ferntiuktuk, Alaska, home of a legendary dog sled race. And our heroes are trapped.<br><br>In Alaska, Adam wants to race like his father Joe, who also runs the local general store. But Joe says it's too dangerous. And he lost some of his dogs when they fell through the ice the last time he raced. Among those dogs were the parents of Shasta.<br><br>Adam is good at hockey--if you're on the other team--and he is less than a model student. But we later see that if he really wants to do something, he is very determined and a hard worker. He makes a wish that he can have five more puppies to join Shasta.<br><br>Christmas arrives and there are five very sad children in Washington. The parents Buddy and Molly make an effort to find their puppies.<br><br>Adam is sad too when he opens his presents, but there is a special surprise later, which he must keep hidden from his parents. Yes, somehow the shipment with the puppies ended up out in the middle of nowhere and they couldn't understand why it was so cold and why the world was covered in vanilla ice cream which didn't taste very good. But Shasta rescued them, and all is well. Believe it or not, Adam is going to train these dogs to enter the race.<br><br>With the help of Talon, a wise old husky, he just might do it. And this implausible plot line can only succeed because of the kindly but incompetent Sheriff Ryan, whose trained rescue dog is St. Bernie.<br><br>But there are many obstacles. Among them are the evil villain Jean Georges, last year's winner, who admits he won only because Joe lost his dogs. Francois and Phillipe are Jean Georges' mean dogs that taunt the puppies and remind them that if by some miracle they make it into the race, they will not win! Other competitors come from Iceland, Russia and Japan. Jean Georges has no morals and will do what he can to sabotage their efforts.<br><br>So will Adam race? Will he win? What do YOU think? This is part of the Buddies series, after all.<br><br>This is no masterpiece, and you shouldn't look for great acting, though Kris Kristofferson impressed, on the same day he and other country music legends performed at The Grammys. Charles Stevenson as the bumbling sheriff is also quite good.<br><br>John Kapelos as the villain is the only human here who is genuinely a cartoon.<br><br>The dogs are very intelligent. But it's more than a little obvious several dogs play each part. And some of the dogs don't look quite real. But a lot is demanded of them.<br><br>There are a couple of \"only in Hollywood\" moments where a kid proves he can accomplish a lot.<br><br>Other than that, you pretty much know what to expect. But I can't say anything negative. if you're a kid, it's great. And there's nothing offensive, except for some potty humor that apparently qualifies as G-rated these days, and some minor but necessary violence in a race with an evil villain.<br><br>If you already enjoyed the Buddies series (and I did, even though I don't like dogs), you'll surely like it. If not, and especially if you don't care for kids' movies, well ...","user":"vchimpanzee","rank":[1,1]}]