[{"title":"Sturdiest Hand-held Camera Ever!","rating":1,"date":"30 January 2008","review":"... I do not believe that digital camera survived a nuke. I'm sorry, there you go. That was the final nail in the coffin for this movie, it just heaps one immersion-breaking sequence of events after another.<br><br>So, let's count off:<br><br>Cloverfield stops just short of carving 'all the characters in this movie die!' into your forehead in the first 40 seconds of the movie, making it impossible to feel any sort of emotional attachment to them? Check.<br><br>Magically-appearing army which arrives roughly TEN MINUTES into the monster attack despite the fact that one of the main bridges into Manhattan was destroyed not thirty-seconds earlier? Check.<br><br>Monster can't be hurt by weapons? Check. This is forgivable, it's a trope of all giant monster movies. Most make some attempt to explain it... in Cloverfield, they just assume you'll go: \"Oh, of course that doesn't work. It IS a giant monster, after all.\"<br><br>Monster drops off little baby monsters (in this case, parasites) that only serve to pad the movie and give the filmmakers an excuse to film someone (literally) exploding off-camera with no explanation as to WHY said character exploded because of the bite of a little monster? Check.<br><br>Exiting the subway into a conveniently-placed Army hospital? Check.<br><br>Baby monster bite that, while severe, doesn't slow down any of the caste UNTIL the poorly telegraphed \"I feel a little dizzy\" followed by the above-referenced character explosion? Check.<br><br>Skyscraper improbably leaning against another skyscraper without either of them collapsing? Check.<br><br>Girl survives roughly six hours with a rebar spike through her shoulder without bleeding to death... OK, this one's plausible. People have survived weirder, and the rebar MIGHT have kept her from bleeding to death.<br><br>Girl is capable of running not once, but twice, roughly ten minutes after being REMOVED from said rebar? Without being slowed down because of blood-loss, pain, nausea, or any other reason? Check.<br><br>Monster pulls a 'Dragonball Z' and gets back up despite lots of bombs and a huge cloud of smoke? Check.<br><br>Helicopter crashes in central park, and only the three main characters survive? Check.<br><br>Guy and his girl fiend wind up together at the end, complete with useless and weepy Blair Witch \"I'm scared, why is this happening to me?!\" dialog? Check.<br><br>Camera Footage survives a NUCLEAR ATTACK, despite the fact that a nuke's EMP will still erase digital footage even if it IS protected by a flimsy central park bridge? Check.<br><br>... and that's the whole movie. Seriously. Every scene contained something needlessly immersion-breaking which, coupled with the nausea-inducing camera-work made for a decidedly poor movie.<br><br>If given the choice of being bitten by one of the little monster-lice from Cloverfield or watching the actual movie, I'd take being bitten. At least then, you'll only feel sick for about half an hour.","user":"CSBurningDestiny","rank":[404,637]},{"title":"overrated","rating":1,"date":"21 January 2008","review":"i went in expecting a scary monster movie.<br><br>what i got was 15 minutes of bad TV dialog, and 45 minutes of shaky-cam running through the streets. the acting was OK but the characters were really unpleasant. not only did i not care if they died, by the end of the movie i was rooting for the monster.<br><br>there were a lot of plot holes and the decisions everyone made were totally unrealistic. it was hard to stay in the movie because of the constant lapses of common sense and logical flaws. those kinds of things really annoy me when they could have been fixed with a line or two of dialog.<br><br>finally at the end of the movie there were a couple minutes of cool special effects. the rest of the movie was a waste of time.","user":"jlira","rank":[230,362]},{"title":"Tremendous thrills!","rating":9,"date":"15 January 2008","review":"Some people have derisively compared this film to The Blair Witch Project because it was all told from the point of view of someone's shaking camera. Unless you have motion sickness, I don't think that's a bad thing. What matters is who's in front of the camera. While The Blair Witch Project featured annoying people screaming at each other, this movie actually made me care about the characters. In fact if it had continued with the romantic drama tone established during the first half hour, I STILL think it would have been worth watching and that's the biggest compliment I can give it.<br><br>Of course people will be watching this movie for the visceral pleasure and Colverfield delivers. Many thrilling visual and sound effects wowed me (there were a few times I yelled out in shock at a sudden scare). Any horror film will also benefit from a sense of entrapment and this movie pulls off the seemingly impossible feat of making New York City seem claustrophobic because there was seemingly nowhere to hide from the monster.<br><br>What is the monster? Whatever it is clearly is meant to be an allegory for the carnage 9/11 inflicted on New York, much the same way Godzilla was meant to be an allegory for the damage inflicted on Japan by the atom bomb. There are moments seemingly recreating the documentary footage from 9/11, and they give the film verisimilitude. Touching upon real life horror, plus creating characters that we can relate to and care about, and assaulting our senses with incredible sights and sounds leads to entertainment worth watching many times over. Perhaps the 80 minute run time will bother some people, but on the other hand I think that's better than a film wearing out its welcome. Great job J.J. Abrams and company!","user":"kanerazor","rank":[1,1]}]