[{"title":"whats so bad about it?","rating":7,"date":"28 February 2010","review":"I'm not sure what most of these people writing bad reviews wanted out of this film......<br><br>were they expecting some religious aspect of the whole \"apocalypse\" genre or something?<br><br>anyway, Legion is a movie you either love or hate, no doubt about it, but it sure as Heaven (cough) doesn't deserve the bad reviews.<br><br>1. the gfx weren't bad, or too much, they were there to show what they had to and thats it.<br><br>2. this movie isn't JUST action and blood and guts, it had a story and i liked the writers idea to pause the fighting after the first wave of the possessed to dwell a little more into the emotions of the characters <br><br>3. bad acting? not really, while Micheal might have had better lines he still accomplished his role. <br><br>4. some parts were funny like \"they aren't our regular customers\", why you ask? well the look on his face was \"i cant believe I'm saying this\", which any NORMAL person would think at such a sentence. <br><br>5. GOD was portrayed as a human, with a heart and a mind that contradict each other, also he was depressed, people might say this was a bad decision but i think it is correct, since humans are the image of god (according to believers he made us like him) <br><br>6. YOU SAW WHAT YOU WERE EXPECTED TO SEE, there are no plot holes!! because the director wanted you to see just this, and nothing more, if other people could understand this they might also understand the whole plot. <br><br>7. here is a hypothesis so you understand the baby's role. the baby was the second coming, and since god was angry at humans he didn't want to give them a second chance to survive, now since Jesus became god it would mean the baby becomes god in the end (of his life), thus bringing with him his happiness and love for humans... so humanity survives....<br><br>i could go on, but it'll take all night so in short:<br><br>Legion is a movie that you have to see without expecting it to be the movie of the year, and over analyze every damn second of it. go watch it ONLY for entertainment and to kill an hour or so I'm not a fan of any of the actors or the director but i watched this movie with a free mind and i enjoyed it","user":"devilhunter88","rank":[63,78]},{"title":"The last 30 minutes undo the previous 70 minutes worth of good will.","rating":23,"date":"23 January 2010","review":"I wanted to like this film, the only problem is it has very large shoes to fill. The two films that come to mind, obviously, are \"Tales from the Crypt: Demon Knight\" with Billy Zane (rated a 6.6/10 here) which tackled the whole \"end of the world/standoff in diner/lone hero fighting alongside the little guys against a legion of bad guys\" thing 10 times better and \"The Prophecy\" with Christopher Walken (also rated a 6.6/10 here) which tackled the whole \"good angel versus bad angel/showdown on earth\" thing 10 times better. Both came out in 1995 and while they didn't have the special effects that this one had, they had a cohesive story, GREAT acting and believable characters.<br><br>The internet is going to crucify this film, so I'm just going to break it down simply: The first hour or so is pretty good, and if it had stopped at the 70 minute mark, it could come close to the 6.x rating it's getting now. The last 30 minutes is a rushed, hatchet job that will make you regret seeing this film. <br><br>Also, SHAME on the editors of the film trailer for spoiling the two best scenes of the film (the old lady \"reveal\" and the ice cream man \"reveal\".) I hate when you do this. You stole all of the impact those scenes had and lowered my rating by a point.<br><br>Don't pay to see this film, rent \"The Prophecy\" and \"Tales from the Crypt: Demon Knight\" instead.","user":"turkishjade","rank":[279,386]},{"title":"Story might not be original, but performances are excellent!","rating":8,"date":"10 June 2010","review":"This movie didn't arrive in my country with much fanfare, so before I bought a ticket I did some research. Most reviews were negative, but I went to see it out of pure boredom. I didn't expect much and having read all the negative reviews I watched it with my critics glasses on.<br><br>I actually enjoyed this movie. Never have I given a movie 8/10 before. Why did I do it now? Performances. I reckon the people who went out to see this movie expected blood, guts and fecal matter flying all over the place. Instead they found hardcore actors doing what they do best. Even lesser known actors were up there doing it with the masters of the industry. Paul Bettany is one of the most underrated actors of our time. When has he ever given anything but a solid performance? Dennis Quaid? His prettiness might be a thing of the past, but as a performer he grows with every movie he makes. The same goes for the whole cast. They all acted like superstars.<br><br>You won't like this movie if you're into mindless B-grade BS. If, however, you like movies because the actors telling the story makes a fantasy feel so real you actually feel you're gonna break the armrests off your chair you should do yourself a favor and see this movie.<br><br>On a final note. Being a Christian myself I did not find this movie offensive at all.","user":"dean-harmse","rank":[34,42]}]