[{"title":"So nu? Who understands this \"Schroedinger's Cat\"?","rating":10,"date":"12 October 2009","review":"****SPOILER ALERT******<br><br>Several reviewers have commented on physics representing logical certainty. In this movie, the opposite is true, and I believe that is the fulcrum upon which this modern story of Job rests. Modern physics strikes at the very heart of faith, mystery and law<br><br>The dybbuk! The husband is caught in the world of the material and cannot believe that the rabbi before him is a spirit, but his wife...she is not fooled! She believes that the world is filled with mysteries, and her faith in this leads to decisive action--saving them??<br><br>\"Schroedinger's Cat\" is a modern mystery, and it is the single subject that Larry is teaching in his physics class. \"Bracket k bracket and it is equal,\" he says with finality, thinking that he has demonstrated the order of the world neatly. But \"Schroedinger's Cat\" is the ultimate expression of the rules of order, or G-d's work, leading off the cliff into the abyss of mystery.<br><br>In the example Schroedinger published in 1935, a cat is in a box with a \"diabolical apparatus\" which kills the cat if a random subatomic particle decays. Modern physics, being invented at the time, made the absurd prediction that until you opened the lid to check, the cat was in some sort of blurred probability space of being alive/dead, and it only became actually dead (or alive) when you opened the lid to check. Observation changed reality. The cat is in a mysterious state, beyond our comprehension or belief until we look. Do we have faith? Einstein didn't. He countered stating that \"G-d doesn't play dice with the universe!\" Schroedinger was doubtful, but insisted that the mystery was simply inescapable. This is the foundation for a rich allegory, indeed.<br><br>\"I don't understand the mathematics, but I understand the stories,\" Larry's Korean student insists. \"No, if you don't understand the math, you don't understand the physics. Even I sometimes don't understand the stories,\" Larry shoots back.<br><br>And in this lies the nub of the tale. Larry understands the rules--and follows them. His life is dreary and takes a seeming nose dive. Plague after plague arise and he is perplexed. One rabbi says \"We all question the existence of hashem (\"his name\" = G-d) and then we see the wonder in...the parking lot.\" HE GETS IT!! For him it is faith. Even the friggin' parking lot is a divine miracle! The next rabbi weaves a deeply mystical tale with a banal ending. Larry is outraged. \"What does it mean?\" \"How do I know. G-d does't owe us an explanation. The responsibility is the other way around,\" the rabbi responds. They each have their own understanding and advise. The young rabbi is not yet wise and advises faith. The next rabbi acknowledges mystery, but says it is beyond us to understand, so be a good person, \"or a better person.\" \"God doesn't owe us an explanation. The responsibility runs the other way.\"<br><br>It soon becomes clear that the Korean student and his father have a razor-sharp understanding of the \"Schroedinger's Cat\" story and thrust the paradox into Larry's life with a vengeance. If only Larry understood the paradox.<br><br>But he understands logic and rules. His faith is shaky, but he follows the rules. Sy doesn't believe a G-d is watching him, steals his friends wife, and G-d strikes him down in his path.<br><br>Even Larry's brother, believes in a crazy half-physics, half-Kaballah mystery and he actually wins card games with it, but he breaks the rules and is a pariah. <br><br>The last rabbi will not even talk to him. The most direct response of G- d being questioned by a doubting subject.<br><br>At the end, Larry feels he is through his trial and \"opens the box\" to check to see if there is a G-d there. Surprise! There is! He opened the box by breaking the rules. The cat is dead. All his plagues had only been in some sort of blurred probability space of having happened/not happened; his marriage, his tenure the whole chain of events. It was not until he tested G-d by breaking a rule that the very real G-d of the bible smote him and his eldest son down. <br><br>The original Job had actual punishments and kept his faith. Our modern Job has existential punishments and ends with a lack of faith. We must have faith, recognize the mysteries or obey the law according to our capacity, but to do none of these is an abomination.","user":"srcann","rank":[424,568]},{"title":"One of their best","rating":2,"date":"2 November 2009","review":"My wife and I saw the film last Friday. We talked about it for an hour over dinner and again in the evening. The more we discussed it the better we liked it.<br><br>It helps to be familiar with the paradox of Schrodinger's cat, a staple of quantum physics, which can be found on Wikipedia, before you go see this film. You might also want to understand the quantum concept of duality.<br><br>The entire movie examines Gopnick and his world==and to a lesser extent that of his teenage son--in light of these aspects of quantum mechanics. I could not find a single scene that did not address uncertainty and/or duality. The attempt to discern traditional religious meaning in this world is humorous in itself. The opening presents the paradox and is crucial to the rest of the film.<br><br>Unlike the local review for the film which described this as a \"typical Coen Brothers film\" and \"weird\" and \"no closure at the end\", I found this film to be quite literal and true to the principles of uncertainty and duality. The two major characters both find closure, and in retrospect, there is clearly a beginning, middle and end to the story the brothers wanted to tell.<br><br>But the movie continues after the closure, just as life continues on a daily basis, setting up another expectation of continual uncertainty.<br><br>Not being Jewish, I no doubt missed some of the double entendre and humor in the tradition. I would have liked to understand the Hebrew passage of the bar mitzvah ceremony, for example, and how it relates to the core theme of the film. But the movie is universal in its appeal, if you understand the basic concept of quantum mechanics upon which the film is based.<br><br>I rate this as one of their best films due to its intellectual foundation. Much more important to me than No Country.","user":"guypotok","rank":[294,425]},{"title":"I don't understand it so I will dismiss it as worthless and return to the familiar.","rating":8,"date":"16 May 2012","review":"I can see why many people would dismiss this. Like the reviewer who watched \"52 minutes\" and turned it off because none of the characters were likable so it would be a waste of time to continue.<br><br>Those who expect life to be a series of plausible outcomes, logically following some kind of cause and effect order are always disappointed by honest works of art, not to mention life itself. One of the very themes of this film are those kinds of people and their need to cling to some sort of tradition, structure, and belief in order to deny their fear.<br><br>Another theme was perspective and perception. That what may seem mundane and meaningless may be filled with the most profound meaning and that which we place so much value in may be worth absolutely nothing.<br><br>\"Receive with simplicity everything that happens to you.\"<br><br>If you can enjoy a movie that leaves you with questions as much as one that attempts to provide answers then I highly recommend a viewing.","user":"splodgeroonie","rank":[88,123]}]