[{"title":"Not quite as strong as the original, but still very good.","rating":7,"date":"17 October 2008","review":"There must have been comedians in the projection booth the night that some friends and I went to see a family friendly film. These particular friends tend to watch only light-hearted material and get upset for weeks whenever they see horror films or intense thrillers. They were totally unprepared for a 'Quarantine' trailer and it shocked them all so badly that we nearly had to leave and get our money back. Maybe it was because of their strong reaction that my interest in the film has stayed so high for the past several months.<br><br>This week I have seen both 'Quarantine' and 'Rec' the film that 'Quarantine' is a remake of. 'Rec' is not without flaws but it is a very solid and chilling horror film. 'Quarantine' is able to expand on several of the strengths in 'Rec' while falling into a few pitfalls of it's own. Both films are about a TV news crew taping a show about what a night in the life of a fireman is like. A seemingly routine call turns out to be something much more and the news crew is trapped in a quickly quarantined building.<br><br>Giving credit where it is due, 'Quarantine' kept me on the edge of my seat for most of the movie. It lures you in with a very relaxed opening ten minutes but once you reach the building and the cop in charge asks why the camera crew is there, the whole tone of the movie changes. The fun and games, the light-hearted banter is gone. We only realize how serious it is though when they enter the apartment of an injured old woman. For me the tension starts with the entrance to the apartment and never lets up. Each new segment that the TV crew starts filming holds potential terror. The set design and the lighting are terrific and 'Quarantine' walks a careful tightrope of character action. So often in horror films the audience is yelling with frustration at what characters on the screen are doing because it all goes against common sense. There is a little bit of that early on but 'Quarantine' does a better job of playing to the characters and their panic. Characters die not through naivety or stupidity as much as they do from inevitability and inescapability. The key performance comes from Jennifer Carpenter.<br><br>The film's greatest strength and weakness at the same time, Carpenter is the focus of the camera because of her role as the reporter and it isn't an easy part to play. She is solid for the majority of the film but terror essentially overwhelms her with ten minutes to go and she is reduced to a sobbing, shrieking, shivering bowl of jello. Would I or anyone else be any better in the situation that 'Quarantine' creates? Hard for me to say but probably not. The problem is that there were three primary acting choices for her to make in the final ten minutes: she could play it as a hysteric (which she does), she could play it as numbing down her fear like the cameraman does in order to try and escape, or she could have been so overwhelmed by her fear that she becomes a functional catatonic working on autopilot. Carpenter's choice is probably the 'truest' choice for how people would react. That doesn't mean that it is going to make for good drama. Her transformation from confident and outgoing to hysterical jabbering is so jarring that it feels forced instead of real. The camera man keeps telling her to calm down when they've reached a potentially safe room but she is far beyond the calming down stage and well into the years of therapy one instead. I found it to be just too much and actually pulled me out of the horror and towards comedy instead.<br><br>'Rec' felt a bit more organic and gritty than 'Quarantine.' The performances are decent in both but you feel less of a connection to the characters in 'Quarantine.' Many are clearly there to serve as fodder with no attempt to seriously develop them. 'Rec' does a much better job, particularly when the reporter interviews each of the buildings residents. The five minutes spent in filming those sequences gave more of a stake to the audience into the well-being of those characters. That never really takes off in 'Quarantine' and I regret that they didn't follow the lead of 'Rec'. One thing that I thought 'Quarantine' did a much better job of was in plot clarity and how they provided information. The clues to the source of what is going on are much more explicit and come very early in the movie. 'Rec' dropped a few hints for the viewer to put together but relies on the final five minutes to give the major clues about patient zero. What patient zero is spreading is clearer in the remake and I thought the clarity benefited the plot. Of course by the time you find out about patient zero, Carpenter's character is beyond being able to help provide the audience with anymore real analytical power. Don't blink or you'll miss everything you need to know.<br><br>I give the slight edge to 'Rec', but certainly recommend 'Quarantine' to horror fans. It's problems aren't severe enough to detract from a very decent effort.","user":"A_Roode","rank":[97,133]},{"title":"trying to review this without comparing to the original","rating":7,"date":"10 October 2008","review":"I have to say, this whole hysteria of America ruining foreign films is laughable. Yes, there are some really bad remakes, but that does not effect the original film. You cannot ruin a film by remaking it as the original film is still the same. If you are angry, you are angry because you feel that people who really deserve the fame and recognition are not getting it. This is a justified reason to be angry, but don't go saying the film has been ruined because that defies all logic of possibility.<br><br>I must say it's hard for me to review this film without thinking about the original, mainly because it is nearly a shot for shot remake. Obviously this takes away from the suspense and overall fear factor of the film. If you have seen the original, don't expect to experience the same level of terror that you had the first go round. You're going to know what's coming for the most part. If you haven't seen REC, this movie will probably scare you. If you actually have the option of seeing REC first, I would do it because I feel that it is still the superior movie. Of course, if you live in America your local video store won't have it and you'll have to download it illegally, so I guess you're stuck between a rock and a hard place.<br><br>I actually thought the acting was quite good for the most part. Jennifer Carpenter does a great job playing hysterical women. She did a good job being hysterical in the Emily Rose abomination and she did a good job being hysterical in Dexter. She does a good job being hysterical in this movie as well, so kudos to the producers/directors for making a logical choice to cast her. Her dialogue outside of being chased down by rabid tenants is laughable, but this actually makes sense when you consider the fact she's a reporter for a show no one would watch anyways.<br><br>The main difference between REC and this movie is the cause of the deranged building tenants. Surprisingly, I thought they made the story work and it played more on \"American\" fears such as government distrust, terrorism, and viral warfare. The only thing I think they failed on was the choice to use higher quality production. Part of what made REC really scary was the grittiness which gave you the feeling that what was happening was real. Although the camera work is choreographed well, the Hollywood quality takes away the grit and leaves you feeling like you've had a few too many before watching.<br><br>Overall, I think this is actually a decent remake. The producers and director realized that the story was already awesome and they didn't try to change it. I think if people would calm down and put aside their national pride and cultural elitism, they would realize that these kinds of remakes only help foreign films. How many people knew about REC before this movie, outside of a small demographic of people (imdb is not the 'norm')? How many people know about that great movie now? Lots of people visit these websites looking for reviews, and seeing \"REC\" pop up everywhere is only good exposure. Hell, if this movie does well you might actually find copies of REC in your local video store, and believe me, I'd be the first in line to buy a copy.","user":"iamyourruler2000","rank":[56,81]},{"title":"What a waste of time","rating":4,"date":"7 February 2009","review":"You need to see the original \"REC\" movie to know how bad this one is. It tries to introduce more zombie attacks than the original making it way boring. And it is a failure in its end.<br><br>1) To scare people you need to introduce pauses so there is thriller. In this movie they put too many zombie attacks compared to the original. It was much more explicit than REC so it becomes more a gore funny film than a horror movie.<br><br>2) You can't choose such a bad actress, she screams so much you quickly want her to be caught by a zombie. What a bad performance.<br><br>3) This is a Hollywood movie, it is supposed there is more resources, how can the zombies look so fake? the Spanish one was utterly superior. SPOILER The final monster is a joke compared to the original one. Incredible. The original monster was a girl and you could see her breasts, Hollywood censored this??? how funny. What about the night vision scene???? It didn't look like night vision at all!!!! It has to look like a negative or something, not like a dark version of a normal vision!!!<br><br>3)They skip the most important thing here!!! In the final scene, they turn on the tape and NO EXPLANATION OF WHAT'S GOING ON IS HEARD! In the original movie you can hear the guy living in the flat talking about how he kidnapped the girl from a church where they kept her in Portugal, about his experiments and how he tried to cure her. It's several recording sessions and you see how desperate he gets because he can't heal her and he thinks he won't be able to keep her UP THERE for much longer. You can figure out he has been a victim of her.<br><br>So the devilish nuance is lost in favor of the less scaring virus point of view. What made REC so good is that in the end it seems the girl (\"Niña Medeiros\") is some creature from hell it's not only about an infection.<br><br>All in all, another Hollywood waste of money, instead of welcoming foreign movies they copy them and make them a shame.","user":"ignitione","rank":[34,49]}]