[{"title":"I actually liked it","rating":7,"date":"1 October 2008","review":"This wasn't the best movie, but it sure was a good little action/crime flick to watch. It had enough plot turns to keep you seated and definitely didn't seem as near B grade as other projects \"Gooding\" has done lately.<br><br>I actually think this is one of his best since shadow boxer or boat trip. I really hope this film gets him back into doing good films as he has let me down with his past few. <br><br>So overall plot, hes a border patrol policeman that uncovers some dead bodies. And on his search to uncover the killer he brings back some past \"friends\" who cause more trouble then good. It actually relates pretty close to a history of violence but moves along a lot faster. <br><br>MY friends have a bad attention Span and this didn't make them walk away so my opinion is watch the movie if you want an easy going crime drama.","user":"gelooo69","rank":[35,44]},{"title":"Grasping for a chance","rating":7,"date":"3 February 2009","review":"It's a shame that some movies never get to the theaters. Lately, Cuba Gooding Jr. has been doing a lot of those movies, and though I haven't seen them all, I rent one from time to time: I think the man's a great actor. In Kevin Bray's \"Linewatch\", he gives a stand-out performance as Mike Dixon, a police officer who works for the border patrol and is suddenly haunted by the past. The actor is so subtle here, so committed to the role that we can't help desiring something better for him.<br><br>Movies like this one are not sold properly for the audience. \"On the border between the US and Mexico, the law is what you make it\", reads the tagline of \"Linewatch\". It's logical that you would expect a bad film with something like that on its cover. Sadly, sometimes the truth is different, like in this case. The border is just scenery in this movie, a nice place to shoot and develop some plot lines of David W. Wardfield's screenplay.<br><br>The script is about absolutely everything else, and though it doesn't develop its characters fully, it leaves a good taste in your mouth, and you feel you've watched something worthy of your time. The key however is in the casting, because when you have a slow film like this one with just a few action scenes, you need good actors to spend the rest of the time with. Sharon Leal is warm and caring as Dixon's wife and the girl who plays their daughter is especially good. The gangsters that come to bother Dixon and bring the past back with them all achieve good performances. Each of them is allowed to stand out from time to time, but they are at their best, natural and relaxed, when doing small talk as they guard Dixon's family.<br><br>Two of them are probably the most important in terms of the story though: Kimo (Omari Hardwick) and Little Boy (Evan Ross). I haven't told you the hold story yet, partly because I want you to go and rent this picture (the only way to see it), and partly because the movie doesn't tell it eitherI'll leave that for you to discover, saying only that it's a well developed plot for the genre that even leaves room for some small surprises.<br><br>Kevin Bray does everything right and never poses for something that his movie isn't. He knows how to create true tension and achieves it in two crucial moments that don't include fast-paced action, helped by Jeff Mcllwain's exciting score (which, by the way, also works perfectly in the action sequences).<br><br>The action is not the main attraction in \"Linewatch\" as it would be in, for example, \"Taken\". However, the fact that the leader of a gang bang doesn't completely look and act like we would assume a gangster would and some phrases that could be suppressed make this look like a B-movie. But then, \"Taken\" was also a B-movie (in the best sense and with the best production); and a good one. Maybe \"Linewatch\" is even better; a bit more humaneRealer.","user":"jpschapira","rank":[14,18]},{"title":"Attention: Patience required for viewing!!","rating":6,"date":"8 October 2008","review":"Well, just finished watching Linewatch, and i gotta say that it wound up being fairly enjoyable. The movie starts out very slow, not much action or dialogue, which is why i turned if off twice before finally convincing myself to give it a chance. I'm glad i did because it was more interesting than it began. It's not one of Cuba's best films in the least, but it definitely wasn't his worst. Pretty good plot that developed further into the movie. Once you get past the first 15 minutes of boredom, it is definitely watchable. Most people will probably not get past the first part, as I have done on a number of movies, but it was worth it in this particular movie. This will definitely not win any awards, but it is entertaining and interesting on the surface.","user":"ralphruff","rank":[19,27]}]