[{"title":"The American Way or No Way.","rating":6,"date":"10 March 2020","review":"Although it was set during the cold war era, Superman: Red Son is quite a representation of our current political situation in the USA and Russia. The question which the plot revolves around is, what if Kal-El ship landed in the USSR instead of the US and its ramifications on the world map and governments.<br><br>It's quite interesting to see both sides of the world, the USSR dictatorship which exports to the world a fake utopia of human equality, support and providing similar chances for everyone including the common worker to reach up places just by working hard while hiding the ugly truth of slavery and genocide against the weak members of their nation.<br><br>And on the other side we have the US with it's propaganda of fake democracy to everyone and declaring itself the shield and protector of fake freedom across the world when only it's shielding its own ugly truth of protecting only it's own interest, a country with a shadow government and programs that undertakes illegal experiments on humans intended to advance its military capabilities which is mainly used to harass or attack any group or nation that doesn't share its beliefs, Those are basically the fake truth that we are currently living regardless of the denial of both parties and their blind supporters.<br><br>Although the plot concept seems enthralling and few characters feels conceivable in their methods and actions like Batman, yet I believe the storyline could've been developed in a better manner and in more interesting way, not to mention he ending which felt silly an farfetched.","user":"Impartial-Critic","rank":[59,71]},{"title":"Nowhere Near the Brilliance of the Source Graphic Novel","rating":5,"date":"25 February 2020","review":"The animation was emotionless, the story was forced into a mere 84 minutes. The source material was so rich, so brilliant, that I couldn't believe I was witnessing this dumpster fire. The motives and character didn't come through, simply due to lack of time, and just bad dialogues. The final punchline, for example, was ruined by the verbosity. A TV Series could have done the material justice, because novels are best approximated by series and movies follow the structure of short stories more closely. Brilliant story, ruined by bad adaptation, I recommend people to try the graphic novel instead, and not to think of the novel lowly due to this movie.<br><br>I could have been a little biased because I've read the source material. I'm sorry, if that has colored my judgement.","user":"jonaqpetla","rank":[62,75]},{"title":"What?","rating":2,"date":"27 February 2020","review":"What did I just watch?\nThat´s not the adaptation of the novel \"Red Son\". It´s a mockery.\nWhat´s wrong? Pretty much everything. The movie doesn´t seem to know where it wants to go. Luthor sends a brainwashed zombie against Superman, and it ends with the victory of those who sound like the zombie.\nThe end of the novel was supposed to make you think. The end here is an insult. It´s low, so low.\nI don´t usually get upset because it´s \"just a movie\", but to massacre good source material like this should be punishable.","user":"mvezok","rank":[42,54]}]