[{"title":"Great film - sad story","rating":10,"date":"5 October 2008","review":"It was great to see Greg Kinnear in another flawless performance; here as Dr. Bob Kearns, inventor and professor. To me, I think of Mr. Kinnear as sort of the cocker spaniel of American actors. Perfectly companionable for just about everyone. He just feels right in so many roles it's hard to imagine anyone else having done them. This is another instance of his having added immeasurably to what may have otherwise been a more uninteresting character. After all, it's hard to imagine anyone making an engineer or professor seem interesting; but in this outing Kinnear certainly accomplishes that.<br><br>Adding her own note of quiet grace and perfect screen presence, Lauren Graham as Phyllis Kearns gives her character both charm and great heart, not to mention that she looks better in a plain white nightgown that just about anyone I've seen... well, except for my wife, of course.<br><br>There are other great performances here too, like Mitch Pileggi as the bad guy from any corporation in America, Tim Kelleher as his greasier side-kick and Dermot Mulroney as a slightly smarmy friend of Kearnes'. Likewise the hoard of young actors playing the Kearns children added a perfect familial note to the vehicle.<br><br>But, more than any of these fine people, the focal point here was the story as it always is in these social consciousness melodramas. Yes, Virginia. The wheels of American industry is greased with the bones of the cheated and betrayed genius of America. That is so universally true it's a well known sub-plot to all of America's engineers and manufacturers. What is also well known is what happens when they try to find justice, let alone an iota of truth; which is so accurately and skillfully portrayed in this film.<br><br>Speaking as an engineer who has worked in American industry for over 40 years, I can say that I have seen this more times than I can count. It goes on every day right here under your noses, America, and no one ever does a thing to change the way America fails to protect her fragile genius. That is deliberately so. That is so because the laws America uses to define how these things are handled are made by lawyers, for lawyers. It would cease to be profitable if the laws were crafted to actually protect it's most precious resource - it's creative people. But it's not; the laws are instead crafted to provide fat and frequent paychecks to every leach that slithers through the \"halls of justice\".<br><br>Just as Kearns did, I had to learn the hard way that justice in America belongs only to those with a fat enough wallet to buy it through the local outlet. If you don't have the six figures to hire a lawyer then you have no rights and no freedom in this country. Like a Wildebeest grazing blissfully in the middle of the herd, you have only not been awakened to that fact yet because no one has yet decided to attack you, or steal from you.<br><br>This has been the long way around to tell you that the creators of the film got it exactly right, with one serious flaw... for every Bob Kearns who has eviscerated themselves to win a Pyrrhic victory of the sort we witness here, there have been thousands who have given up for being too shallow in pocket or too short of mental fortitude or too short of the desire for self-flagellation required to press through to an empty, moral victory.<br><br>And even here, we see unmistakably that this \"victory\" costs Kearns what he valued most in his life. He didn't even live to see himself depicted as \"heroic\" in this fine film.<br><br>Still, thank you Bob, wherever you are.","user":"bjones","rank":[96,110]},{"title":"It's About Giving Credit To The Right Person For The Effort And Hardwork","rating":26,"date":"26 May 2009","review":"I, for one, strongly oppose any kind of plagiarism because nobody has the right to steal someone else's work and claim it to be theirs. 'Flash of Genius' tells the heartbreaking story of inventer Dr. Kearns. While windshield wipers may sound like a small thing that hardly many give consideration to (as Kearns's friends have told him), it's not a matter of the object at hand but the effort that went behind it and why should credit go to somebody else? I admire Kearns for putting up a fight and keeping up the battle for justice and even though it cost him his family, he fought to the end. I'm surprised as to how little recognition 'Flash of Genius' received considering that the story is extremely relevant even for today's world.<br><br>The director does a splendid job in telling this moving story. Greg Kinnear delivers a heartfelt lowkeyed performance which is among one of the best of his career. Unfortunately, he remains an underrated actor but I hope he keeps making the wise film choices and gets his due soon. Lauren Graham is wonderfully restrained and marvelous but she's risking getting typecast (she's played supportive wife in two other recent movies 'Evan Almighty' and 'Birds of America'). Dermot Mulroney too stands out as Privick. <br><br>Where the technical department is concerned, the director has used a lot of subtlety with the cinematography, soundtrack and visuals. It is only later that we realize what an important symbol rain is in this movie. The washed out colour adds to the tense, stressful and sad atmosphere. 'Flash of Genius' is definitely a worthy watch not only because it tells an engaging story but a very relevant one.","user":"Chrysanthepop","rank":[20,22]},{"title":"Is it Possible.. a Great movie without Sex and Violence??","rating":9,"date":"4 October 2008","review":"I cannot believe how much I enjoyed this movie! There was NEVER a moment when I felt bored,uninterested,or confused about the plot.It is based on the true story of Dr.Bob Kearns from Detroit Michigan.<br><br>The casting,I felt was perfect and Greg Kinnear definitely deserves an Oscar nomination for his performance as Dr.Bob Kearns, an engineer and inventor. His wife,played by Phyllis Graham,was the typical wife of the 50's. And her performance was also top notch..not over or underacted, but right on cue. I absolutely loved the clothes, decor and cars of that era..really brings back memories..the little blue \"frigidaire\", \"mixmaster\", and chrome kitchen set along with the rotary phones,and huge \"boat cars.\"(we would call them that) Life seemed so simple then. Mom stayed home and looked after the kids, cooked,and took care of her husband while dad brought home the \"bacon.\"<br><br>But things changed when Dr. Kearns stubbornly refused to give up his pursuit of justice when he felt he had been wronged by Ford Motor Company. The script is excellent and performances great. Even Alan Alda played the lawyer part very believable. I saw the movie a couple of hours ago and still feel so \"Up' having finally seen a movie with No special effects,No digitalization,No remake, but just a GOOD,GOOD STORY that happens to be true.<br><br>Although Dr.Kearns died in 2005, he definitely made the case for following your instincts and seeking the truth.We CAN fight city hall and all the money in the world will not make up for that vindication, even though it is a tough road with many losses by the wayside.<br><br>Listen,if you are tired of all the Superhero,Violent,Sex-driven,and Mind-Numbing Stupid movies out today,this is a very refreshing change, and All Ages will appreciate the solid entertainment and heart-warming storytelling! Digital is great but a good storyline is something we can all relate to for sure!!","user":"chaitov","rank":[19,21]}]