[{"title":"The Gangster, the Cop, the Devil","rating":10,"date":"3 February 2020","review":"Like so many of the genre that hail from Seoul and its suburbs, this one punches well above its weight with an inventive reworking of well-worn plot tropes and slick production values.","user":"MR_Heraclius","rank":[37,39]},{"title":"Efficient and enthralling","rating":7,"date":"16 August 2019","review":"This movie is somewhat alike <a href=\"/title/tt3914520/\">Nappeun Nyeoseokdeul (2014)</a>, with the surprising association of a cop (<a href=\"/name/nm3673844/\">Mu-Yeol Kim</a>) and a gangster who heads a local mafia (<a href=\"/name/nm3011350/\">Dong-seok Ma</a>) in order to track down side by side a villainous serial killer (<a href=\"/name/nm9541537/\">Kim Sungkyu</a>). An extremely unorthodox attempt but, after all, the end justifies any mean, doesn't it? In spite of a few far-fetched scenes, the dynamic tandem is excellently interpreted and this efficient film is globally based on a breathtaking scenario, spectacular fights and a dark atmosphere.","user":"FrenchEddieFelson","rank":[19,30]},{"title":"Classic","rating":7,"date":"23 August 2019","review":"The film tells quite a unique story of cops joining forces with gangsters to go after a serial killer.<br><br>If you single out all these elements (cops, gangsters, a serial killer, a cop teaming up with a gangster), then I've seen and enjoyed them many times before and yet, I don't think I've ever seen them all come together like this.<br><br>So, a unique story that relies on well known archetypes. I thought it handled them well enough.<br><br>However, if you're looking for a very plausible story line and a masterful intricate plot, well that's just not what this is about.\nIt's more of a fun, entertaining and somewhat gritty movie that mostly revolves around the dynamic between the cop and the gangster.\nAs such, it was also my main source of enjoyment while watching it.<br><br>I also liked the cinematography, the acting (cop, gangster and serial killer), action sequences and fight choreographies. It also has a comedic aspect to it, which surprised me but was very welcome and appreciated.\nMa Dong-seok's character was the one that stood out the most to me, then the cop. Like I said, the main strength of the film is the dynamic between them. At least that's how I experienced it.<br><br>One thing that frustrated me during this film is the dynamic between the cop and his superior. The dialogues were overly repetitive and I think that this is a good example of where the film is lacking.\nThere isn't a lot of depth in this movie and it suffers from it. Especially when you start to stray away from the dynamic duo (cop and gangster).<br><br>That's about it. I had a good time watching it and I'd recommend it to those who enjoy these kinds of detective stories and want to have some fun but don't expect exceptional writting and depth.<br><br>I give it a 7.5","user":"LiteKoi","rank":[13,20]}]