[{"title":"Just to elaborate a bit...","rating":6,"date":"23 January 2011","review":"This movie was entertaining and exceeded expectations. I love history and am a history degree holder with an emphasis and ancient Indo European culture. I'm not here to tear into this movie as a I felt it was just fine, but rather try to deflect some \"junk\" history that some people seem to throw into the mixed reviews. Please, if you're going to try to add your own mish-mash of history, at least make sure it's correct.<br><br>That's right, I'm talking about you \"Russ-was-here\". Firstly, your review is off base on many levels, I'll try to answer some of those in a light hearted manner...<br><br>The fact that you consider Braveheart to be a \"factual\" representation of history is laughable, by this alone we can't take you seriously in your review of this movie. William Wallace wasn't running around the battlefield in a kilt, hate to break it to you.<br><br>You noted the wide variety of accents here. Is this shocking to you that actors from around the world took part in a movie, and that they all had different accents? The Pict language has been dead for quite some time, while there are rumors that the last confirmed speaker of Pict died in the 1950s, are we to expect the actors in this movie all speak ancient dialects of dead languages? get real (yes, that applies to Latin as well).<br><br>Perhaps your biggest mistake in assuming history of this movie is your statement: \"Then comes the fight scenes and complete absence of interesting Roman tactics, when attacked and flanked on a long narrow path they simply form a 1 man thick shield wall and wait...\" If you had actually studied Roman history (which I'm certain at this juncture you have not even cracked open a Tacitus or Pliny or Martial or any other Roman historian) then you would know the Battle of Teutoberg Wald quite well. In fact the battle that takes place in this movie is a near depiction of what the Germans did to the Romans when they destroyed 3 Roman legions while walking through the Black Forest. Ah yes, some of us actually DO study history. The Romans had no choice but to march nearly single file through a road, when they realized they were flanked on both sides (the line was 14 miles long, thus the battle took place over a 14 mile stretch) the Romans had no choice but to form up as best they could in the road. This proved devastating as it forced Romans to fight hand to hand combat against German soldiers who were more skilled in the area of hand to hand combat.<br><br>You mention that the Picts were known for their chariot warfare. Celts (Picts were a Celtic people) were well known for chariot warfare, as were many peoples in the Roman world, as you can see in this movie (especially the battle scene) using chariots would be quite a stupid move as they were in dense forest (use your brain, boy). As we can see with the final battle between Boudicca and Rome, using chariots was not always advantageous. In fact Boudicca sealed her army's fate by following an infantry charge with chariots (effectively crushing her infantry between Roman shields and Iceni chariots).<br><br>You also mention they fought naked. Indeed, many Indo Europeans fought in the buff, but that doesn't mean they all walked around in the buff all the time. They were dressed like Vikings you say? You have an odd preconceived notion of what the Vikings dressed like, personally I saw no Pict wearing chainmail (something Normans and Vikings were well known for). Furthermore it's a myth to believe that all Celts, Germans or any other Indo Europeans always fought naked. Many barbarian tribes were incredibly well equipped by 117AD as armor proved to be more and more of a necessity. We also see that Germanic and Celtic armor had a direct influence on Roman armor (Romans borrowed their helmet style from the Gauls for example). As for the movie? It's setting is in the winter, it would make no sense for Picts to be in the buff all the time. This is common sense.<br><br>Is this overkill? Yup. But I find your post to be (how did you put it?) completely devoid of historical facts. Does this movie have clichés of the time? Yup. Is the acting Oscar worthy? Probably not. Should we sit here and cry about it? nope. Just enjoy the movie. Nobody here is claiming this is a spitting image of 117AD in the northern UK (shocking, I know), but your post is ill informed and misleading.<br><br>Anyways, this is an entertaining movie and you certainly get the feel for the day. Engaging and exciting, certainly worth a view.","user":"westenicho","rank":[355,424]},{"title":"Great film, badly reviewed.","rating":10,"date":"13 February 2011","review":"This is in direct response to davidfurlotte's fairly asinine 'review'.....<br><br>First of all, if you're going to claim to be an authority on these things, do some research. In practically every interview, Marshall made it very clear that the film was based on a myth, a legend, nothing more. He never once tried to claim that this was in any way a true story.<br><br>Also, where did you get that his Dad is a history professor?! He said his Dad loved history, and that's all. Again, do your research.<br><br>Finally, did you actually watch the battle? The Romans were stretched out in a long column for miles, surrounded on both sides. How do you move out of the way of fireballs when you've got men on both sides of you who are also trying to get out of the way of fireballs? You just end up with men piling into each other, utter chaos, and still achieving what the Picts intended in the first place, which was to break the Roman line. And since the Romans where back to back, if you did get out of the way, you're just allowing the fireballs to rolls into the backs of the troops defending the opposite flank. With that many fireballs coming in from both sides, into a densely packed column of Romans, there simply wasn't anywhere for them to go. The Romans were trained to hold the line. That's where their strength lay, in discipline and formation, and this is how the Picts (and the Germanic tribes) used their biggest strength against them.<br><br>The reason I defend this film is because I worked on it myself. And if it made a few mistakes along the way, like using the wrong kind of spears, I know it's because the budget was so tight they couldn't afford enough Pilum's for the number of troops they had. I know this sounds unbelievable, but it's absolutely true. This films entire budget was about the size of the costume department budget on Gladiator!<br><br>To make another simple comparison, on Braveheart they had 7 weeks to shoot just the Battle of Stirling. On Centurion we had 7 weeks to shoot the entire film, battles included. For the scene involving the fireballs, we had 3 days. So it's to be expected that through the almost constant barrage of compromise, a few factual mistakes may slip through the net. As filmmakers we do take exceptional pride in our work, and we'd love to have the time and the money to get everything absolutely perfect, but that's just not the reality of low budget filming in the UK. In the end, we do our best with what we've got.","user":"hoopyfrude-1","rank":[305,374]},{"title":"Battles, Blood & Warrior Women....what's not to like?","rating":7,"date":"27 April 2010","review":"This is a straight forward tale of a band of Roman soldiers being hunted down by Pict warriors in the stunning surroundings of the Scottish mountains.<br><br>Whilst the dialogue and script won't exactly win any Oscars, the film was entertaining enough with plenty of blood &amp; guts fighting scenes.<br><br>Olga Kurylenko was actually quite convincing in her portrayal of a brutal ice cold warrior, much better than Keira Knightley's portrayal of a female warrior in King Arthur. Perhaps Olga not having to utter a word in the entire film as she portrays a Pict who had her tongue cut out was a clever way to make her character more cold and mysterious.<br><br>I wouldn't quite go as far as one of the previous posters who describes the first major battle scene on a par with the opening scene in \"Gladiator\". Indeed some of the small criticisms I would level would be the use of very fast action shots during some of the fight scenes, i.e the camera motion is faster than your eye can register, think opening car chase in \"Quantom of Solace\" and you get the picture.<br><br>What really stands out in the film though is the stunning back drop of the Scottish mountains, It's like \"Highlander\" all over again only better!<br><br>Centurion, doesn't carry the \"epic\" status as other movies like \"Gladiator\",\"Braveheart\" or \"Kingdom of heaven\", no it's on a much smaller scale and doesn't really spend too much time on character development on either the Pict or Roman sides. I suppose in a way it helps this film as it doesn't get bogged down in lengthy dialogue, but concentrates more on action.<br><br>Whilst this film won't score too highly on the originality stakes, it's a good effort in an all too neglected genre.","user":"klam0500","rank":[94,131]}]