[{"title":"Easy to watch but doesn't really stay with you","rating":5,"date":"28 March 2014","review":"Amy Anderson (Emma Roberts - We're the Millers) has just graduated from a nice university and has much of her life already planned out. She is going to be a celebrated, world famous poet and YOU will know her name! This Sylvia Plath fan girl wants to write like Sylvia, feel the world like Sylvia and love passionately like Sylvia ... only Amy's life isn't going as planned as she has faced rejection after rejection after rejection since her college graduation. She has even thought of making an overly-dramatic Sylvia Plath-like exit from life but Amy's stove is unfortunately electric! And so ... Amy finds herself living back home with her parents as she is in serious debt from student loans and her poetry degree severely limits her job opportunities as she has no experience in the working world. She takes the only job she can find at Adult World, an adult video/book store where she befriends a clerk (Evan Peters - 'American Horror Story') with his own outlook on life.<br><br>While Amy has realized she must work to make some money, she hasn't given up on her dream of writing and so has decided to stalk an aging punk poet with a bad attitude named Rat Billings (John Cusack - 2012) who she hopes can mentor her and help her eventually one day get published. The reclusive writer doesn't take well to being followed but Amy doesn't let that stop her from absorbing everything she can from this man she highly admires ... most likely because he is nearby and has been published. Yes ... poor Amy.<br><br>The film is nothing spectacular but it kept my interest during its entire (short -- just over an hour and a half) runtime as it is a cross between High Fidelity and Wonder Boys (although not as good as either of those). While Amy may annoy, we can still feel her plight as she is welcomed into the Adult World and begins learning the lessons of life that actually matter.<br><br>Cloris Leachman co-stars as the quirky (surprise!!) owner of Adult World. And Cusack -- who seems to only make straight-to-DVD titles anymore -- has one of his best roles in years here.","user":"twilliams76","rank":[17,18]},{"title":"Not a great comedy, but not a bad movie.","rating":7,"date":"18 February 2014","review":"Don't go to this movie and expect a grand comedy, the jokes are not piled on to one another with just enough room between them for you to catch your breath. <br><br>I had never heard of this movie and just watched it because I love John Cusack, and when I became aware of it's existence I didn't read anything about it before watching (I like to do that, go in to a movie blank in mind, not expecting anything) and I found it to be a sweet movie. It's not the best movie ever, but it is not the worst. It had it's LOL- moments but they were few although not out of place, when I later watched IMDb and saw it was ranked as a comedy and not a drama I was dumbfounded. I would rank it as a comedy/drama at least.<br><br>Emma Roberts character felt a little ambiguous at times. And it was weird but actually really refreshing to see John Cusack in the role of the asshole, not a role he often plays without humor attached to it. <br><br>It's a movie well worth the watch, if you only keep an open mind to it going in. And I really liked it for what it was, a sweet movie about a girl trying to follow her dreams.","user":"MizzNijna","rank":[27,36]},{"title":"Not Entertaining but Not Bad","rating":6,"date":"24 January 2016","review":"I'm not familiar with Emma Roberts. But I thought she was quite effective here. I totally bought her rendition of a clueless college kid with lots of \"feelings.\"<br><br>It was a tad depressing to see a depiction of another brainless kid with massive college loan debt and no knowledge of anything under the sun. Why do parents buy into that scam. At least here the parents try to point out the danger of her absurd and spoiled pursuit. But of course they coddled her and bankrolled it for years.<br><br>The other silly notion that liberal arts grads. carry around is that they were all meant to do something unique and special. Cusack's character has some of the best lines in the movie when he reminds her that not everyone is talented or destined for greatness.<br><br>Congratulations to the writers for also having the young male lead remind our girl that she was a worthless, lazy employee and an elitist. With the help of these good friends, she manages to learn something.<br><br>We later learn that the young male lead has his own hobbies and passions which this self-absorbed pixie never bothered to inquire about. But it was refreshing that she was a virgin and that the young man took time to really get to know her.<br><br>I also appreciate the Syracuse in Winter setting. Like I've said in other reviews, not every movie has to take place in some glamorous mainstream city. There are plenty of human stories taking shape in gray places that no one would otherwise think about if they weren't the setting in a movie.<br><br>There's not much memorable music here, which is fine, because it was a dialogue and character-driven half-comedy. I don't need Indie mood music for such a film. <br><br>There are no sexy scenes worth mentioning by the way. Roberts goes without makeup and our old mentor played by Cusack is refreshingly not a \"perv.\"","user":"dansview","rank":[11,13]}]