[{"title":"Super funny guy!","rating":9,"date":"27 September 2007","review":"Very funny without having to use profanity. I laughed so hard I almost cried. He makes fun of himself does the usual cop jokes and throws in some all new twists. If you like stand up but are tired of the same old fart jokes and profanity for laughs this guy is perfect for you. Gabriel's impressions and sound effects are outrageous and right on! If you don't know this he is not fat he is just fluffy! He makes fun of the fact that he was only 6th on Last Comic Standing. They didn't have a clue on this guy. The opening acts are \"ok\" but don't let them disturb your vision of this great comic. \"We don't vote for Presidents. We vote for American Idol.\" This fluffy guy in the Hawaiian shirt is well worth watching!","user":"jonijr","rank":[15,16]},{"title":"Very funny","rating":7,"date":"30 July 2008","review":"I've heard Gabriel Iglesias before, so I was familiar with his style and had enjoyed his previous Comedy Central stand-up performance. For those who don't know who he is, he's a young comedian who's gotten a lot of attention lately because he is very talented and funny. His trademark are jokes about his extreme weight, his ability to do funny voices as well as tell stories.<br><br>This time, he's once again doing his stand-up routine and like the last one it is very funny. However, there are two hits against it. First, his earlier one was perhaps a bit funnier and it's hard to keep \"hitting it out of the park\". There's a tendency for the fans to expect the same very high level of entertainment and it's natural they'd compare the performances like I did. Secondly, and this is particular to me, I don't particularly like jokes about drinking--especially ones that make getting drunk sound funny or cool. And, since he had quite a few references to alcohol, I was a bit put off in the first portion of the routine. But, fortunately, while his stories weren't quite as funny as the previous special, they were still very good and I did laugh quite a bit.","user":"MartinHafer","rank":[5,15]},{"title":"Lmao","rating":10,"date":"11 July 2018","review":"I laugh so hard EVERY TIME I watch this and I've seen it many times! It takes true talent to be able to make you laugh even tho you already know the jokes. He has a way of lighting up the stage or anywhere he happens to be. Amazingly gifted man!","user":"celestialbaby23","rank":[0,0]}]