[{"title":"Alan Alda has not been this funny since Hawkeye Pierce","rating":8,"date":"21 January 2008","review":"Maybe Diminished Capacity isn't \"all that and a bag of chips,\" as a friend of mine is fond of saying. But I'll tell you what, it's pretty funny. I think I heard more laughing than anything I've seen at Sundance since Napoleon Dynamite and Little Miss Sunshine. That bodes well for the box office prospects of this film.<br><br>Alan Alda gives a terrific performance as Rollie Zerb, a small-town Missouri old-timer with Alzheimer's, who lives with his sister (and some hilarious but unidentified guy named Wendell in a trailer by the house). They are visited by Cooper (Matthew Broderick), who arrives at his mother's request to help talk Uncle Rollie into a nursing home. Cooper has mental problems of his own, due to a recent concussion. While back in town, he runs into Charlotte (Virginia Madsen), his high school sweetheart who is recently divorced from the town mayor. And somehow Rollie, Cooper, Charlotte and her son wind up heading to Chicago, where they are going to try to sell Uncle Rollie's rare baseball card of Frank Schulte, from the 1908 Chicago Cubs (the last Cubbies team to win the World Series!).<br><br>Broderick is solid, in his awkward, understated way. Madsen is the straight woman. But Alan Alda makes the movie as Uncle Rollie, and dominates the screen in almost every scene. And yes, if you squint you'll see shades of Hawkeye Pierce, but his Rollie character is a complete departure from anything he has done in the past, and probably his best comedic performance since MASH.<br><br>The script is very well-written, if a bit awkward at parts, and under the direction of veteran actor Terry Kinney, the action moves along briskly. There is probably more tension than there needs to be, which doesn't really fit. But when you're not wincing, you're generally laughing. There are some hilarious lines, and a plenty of feel-good vibe. Everyone will like this movie.<br><br>Sundance Moment: Broderick was much better on stage than I would have expected. He was there with his wife, Sarah Jessica Parker, whose movie Smart People had premiered at Sundance the night before. Alan Alda was charming as well. Bobby Canavale was in two movies playing at Sundance this year, the other being The Merry Gentleman.","user":"wmjaho","rank":[17,23]},{"title":"Sweet and touching","rating":7,"date":"3 April 2008","review":"I saw this film last night and I really enjoyed it. It showcased some human elements that have been forgotten by Hollywood. Sense of family, memories and bonds that are easily dismissed in today's world. Wonderful performances by the whole cast, especially Alan Alda and Matthew Broderick. Two comedic legends, but what touched me was the compassion that both their characters showed for each other. It was a comedy but personally, I found the sweetness more compelling than the comedy. I would recommend it for people who prefer dialogue and listening to the characters to the standard big noise movies that seem to dominate the film world.","user":"shayup","rank":[16,23]},{"title":"Solid Enough Cast But A Largely Disappointing Story","rating":3,"date":"2 March 2010","review":"Essentially you have here a \"B\" list cast of actors (Matthew Broderick, Virginia Madsen and Alan Alda) - none megastars, but all solid actors - who, as you would expect, put on decent enough performances. The problem with the movie is a story that misses its potential. I acknowledge that I haven't read the book. Maybe this worked better on paper, but on screen this was lacking.<br><br>Broderick played Cooper, an editor for a Chicago newspaper who suffers a head injury, and then is called away himself to help care for his uncle (Alan Alda) who's in the early stages of dementia. Madsen is some type of old flame for Cooper with whom he reconnects in his hometown. All three were fine in their roles but this movie had basically two directions in which it could have gone, did a little bit of both and, ultimately, because it had no focus on either, was a disappointment.<br><br>This could have been successful as a light-hearted comedy; a humorous look at dealing with the problems of dementia. Alda captured that well; he was believable as a dementia victim, and there were things like his fish-writing obsession that could have made this touchingly funny, but those moments were few and far between. Or, this could have gone the route of emotional drama, as we watch Alda's character of Rollie (and those around him) deal with his decline, but again those moments were few and far between. There was a moment when I thought the movie had made a choice - the very powerful scene when Rollie is missing and Cooper finds him in anguish in the bathroom at the card show; lost, confused and embarrassed at what's happened. But that moment also gets lost. Instead of that, the story focuses for some reason on the old baseball card - a 1909 Cubs card that Rollie's grandfather gave him as a keepsake and that he now wants to sell. Even that could have been touching enough, but the card ends up being used primarily as a prop for staging slapstick humour, especially the ridiculous \"fight\" scene at the end of the movie.<br><br>Also burdened with unnecessary characters (especially Donny, but even Madsen's Charlotte to an extent) this was really a disappointment. 3/10","user":"sddavis63","rank":[5,6]}]