[{"title":"Wild, bloody and deliriously entertaining: Fun with a capital \"f\"!","rating":10,"date":"9 August 2007","review":"Because of low box office returns in the USA (total gross: 25 million $; movie's budget: 100 million), that outrageously mouth-watering experiment known as Grindhouse was split in half for the European release: first came Quentin Tarantino's Death Proof, a masterful reinvention of the slasher flick, the main strength of which was focusing on characters and atmosphere rather than film references; and now comes Planet Terror, Robert Rodriguez's zombie opus which has \"excessive\" (read: fun) written all over it.<br><br>That this is going to be a different cinematic experience is obvious before the movie's even started, as it is preceded by the RIP (Rodriguez International Pictures) logo and the fake trailer Machete (the other three are not included in the separate cut), starring Danny Trejo: a bona fide B-movie advert, so gloriously OTT the MPAA would never approve it in real life (swearing, nudity and explicit violence: not good). After that, it's straight into the action: some virus turns people into flesh-eating freaks, spreading panic all over the country. While most poor fools get eaten, a small group organizes some kind of resistance. These people include Cherry Darling (Rose McGowan), a former go-go dancer, her ex-boyfriend and martial arts expert El Wray (Freddy Rodriguez), a nurse (Marley Shelton) who is about to leave her husband (Josh Brolin) and a few law enforcers (Michael Parks, playing Earl McGraw for the fourth time, and Michael Biehn). Against them, aside from the zombies, is the military, who for some reason wants to keep the virus around. And as the inevitable final battle approaches, the blood keeps flowing freely.<br><br>At first sight, Planet Terror may seem like the lesser of the two Grindhouse halves, mainly because the director, unlike Tarantino who made the separate version of Death Proof longer and better-looking, hasn't modified his segment at all (aside from reinserting half an hour worth of excised material): the scratches and aging signs are still there, and the \"missing reel\" (a love scene between the two leads) is still missing. But that's probably because Rodriguez, in true B-movie tradition, was more concerned with the style, of which the aging stuff is an integral part. So, while it is undeniable that QT's episode is superior artistically speaking (smarter script, better dialogue, more artful direction), it is equally undeniable that RR, knowing he can't bring anything new to the genre (George Romero and 28 Days Later... have already done it), puts all his energy in the execution (pun not intended) and delivers exactly what the audience demands: from sexy start to gory finish, Planet Terror is a 105-minute long, shamelessly overblown money shot, a picture that dumps all pretensions and sets out to simply entertain.<br><br>The focus on blood and guts (and there's plenty of them), however, does not make the film a mere exercise in style, because while he may not be as skilled a writer as his partner, RR manages to deliver some memorable lines (a satirical stab at Bin Laden being the standout) and craft excessive yet immediately likable characters, all played with almost puerile joy by a terrific cast: McGowan, who was killed off immediately in Death Proof, makes up for it here by giving flesh (and what flesh) to one of the toughest babes ever to hit a screen (the image of her with a machine gun instead of her missing leg is already iconic); Freddy Rodriguez, having stolen scenes for five years in Six Feet Under, is completely at ease in the role that should make him an A-lister; Naveen Andrews, best known for playing Sayid on Lost, has the fun of a lifetime shaking off his nice guy image as a testicle-collecting (!) scientist; and finally, people like Bruce Willis and Tarantino (whose part is ten times as crazy and hilarious as his Death Proof cameo) pop up briefly to memorable effect for one simple reason: they just want to have a good time.<br><br>A good time: that is all Planet Terror has to offer, no more, no less. And those seeking sheer entertainment, albeit delivered with gusto, should be able to enjoy this riotous adventure, as long as they are able to stomach sequences so insanely violent they make Desperado or Kill Bill look like children's flicks. In other words: this is a damn good \"bloodbuster\".","user":"MaxBorg89","rank":[228,323]},{"title":"A deliberate guilty pleasure","rating":9,"date":"20 October 2007","review":"While Quentin Tarantino's Death Proof seems to be a much more authentic representation of 1970s grindhouse pictures, Robert Rodriguez' Planet Terror is more of a loving caricature of 1980s zombie splatter films. Nothing in the film is played straight, and virtually every scene is accompanied by a wink and a grin at the audience.<br><br>If Tarantino's effort is accused of being slow (or deliberately paced, depending on your opinion), Planet Terror never even thinks about slowing down. From the exploitative opening credits through to the final frames of the film, this is a roller coaster ride of a film that doesn't let up.<br><br>With Planet Terror, Robert Rodriguez continues his \"everything and the kitchen sink\" mentality when it comes to his film-making by throwing everything at the wall just to see what sticks. While it sometimes feels like this technique gets in the way of Rodriguez finding a true film-making voice, it works quite well for a film like Planet Terror where there's no room for subtlety.<br><br>The cast that Rodriguez assembled is a glorious ensemble of bygone action heroes, horror icons, and Rodriguez stock actors. They all bring their parts to life in a cartoonish sort of way that fits the tone of the movie beautifully.<br><br>While the uncut DVD edition of Planet Terror doesn't change the film drastically in any way, it definitely improves the film. It gives the film smoother transitions and fills in some gaps in the plot (though that missing reel is still there and will always remain there as one of the many comical winks at the audience). The large cast of characters are also given more beats here and there that help fill out their personas a little more. All in all, this uncut version simply allows the film to breathe a little more, rather than having to jump frantically from scene to scene in an effort to make the 84 minute running time.<br><br>At the end of the day, Planet Terror isn't going to win any awards, and it's certainly not meant to. It's simply an extremely enjoyable guilty pleasure of a film that virtually anyone with the stomach for it can probably have a good time with, especially if you're a horror fan. Take a couple of classic John Carpenter films like The Fog and Escape From New York and throw them into a blender with a couple of classic zombie splatter films like Evil Dead 2 and Dawn of the Dead and you've got a pretty good idea of what Planet Terror is like. And at the end of the day, you could definitely have a worse combination of films to pay loving homage to.","user":"AntoNEO","rank":[113,158]},{"title":"\"I want to eat your brains... and gain your knowledge.\"","rating":9,"date":"8 March 2008","review":"Planet Terror, before becoming it's own movie-animal of sorts as a stand-alone feature released in most parts of the world (and on DVD), was a slightly shorter, near-perfect first part of a double-bill of the Rodriguez/Tarantino double-feature Grindhouse. Not to sound like I'm in a rocking chair rambling like it's old times (and it's not even a year since its North American release), but Grindhouse contained in it two features that just very simply, quickly tapped into that genuine spirit of B-movies out there, the art and power of sleaze and trash that might not be that when done right. And also as a treat, each film showcases, in all fetishized and stupendous glory, the skills of the respective filmmakers (this goes as well for the directors of the 'trailers' that ran between the two films). For Tarantino it's stylized long-shots, intellectual-cum-vapid dialog, and a penchant for bad-ass ladies and some sick violence.<br><br>For Rodriguez, it's what we've come to see as a sort of mix between his Mariachi films and From Dusk till Dawn: slam-bang action, truly absurd twists with the occasional shock factor (in this case the \"accidental\" death of a child), and raucous humor from dialog that, in its own right, is probably just as self-consciously clever as QT's. On its own, and in its extended and unrated cut form, as recently watched on DVD, Planet Terror luckily doesn't suffer as much from the added footage as Death Proof nearly did. There isn't some big block of specific scenes stuffed back in from the original cut, however the bits that are noticeable for those who are aware of the original 90 minute version- i.e. waking up at night to see the green-tinted moon, the extra bit at the police station, some extras at the hospital- don't really add much at all to the proceedings to make it any better as it is.<br><br>For what it's worth though, to those who will seek it out having not had the luck- as imposed by the what seems to be ironic monacher after the Machete trailer \"Brought to you by your friends at the Weinstein Company!\"- Planet Terror is a kick-ass, take-no-prisoners zombie flick, filled with enough ballsy attitude for two B-movies that deserve to get immediately dusted off and played to packed audiences of sick f***s who cant get enough of gruesome, over-the-top horror violence and tongue-in--so-deep-it's-breaking-the-cheek dialog. A simple premise is that a noxious gas is let loose by a military group, somehow in some deranged plot involved with a post Bin-Laden atmosphere, and it creates total havoc on a small Texas town over one night. And over this one night a go-go dancer, a crafty but vulnerable nurse, a Chicano who's \"got the devil in im'\", a BBQ maestro, and some various tag-alongs and police officers bind together to fight the combat the infectious plague.<br><br>Made with panache and visual as well as verbal wit (maybe funniest is how a sex scene is so hot it burns up the screen, literally, and when the scene comes back on the place is on fire!), Rodriguez has a nifty little classic of a comedy almost in the guise of an action film inspired by both Fulci and Carpenter (however much better than the former would ever produce). Watch it friends!","user":"Quinoa1984","rank":[62,90]}]