[{"title":"Better than expected :)","rating":6,"date":"24 October 2011","review":"I almost didn't watch the movie because I saw the reviews of others here on IMDb. In the end I decided to try it anyway and was pleasantly surprised. Sure, the story has been done before, and in the end it may not be the most realistic, but that's not why you should want to watch this movie anyway. It's a happy, feel-good movie about following your dreams that, when you finish watching it, leaves you with a smile on your face. I recommend this to anyone with a bit of extra time who just wants to watch a relaxing, cheerful movie like me (a 21 year old girl XD) or for anyone who wants a nice, clean movie to watch for or with their children. Enjoy!","user":"e-sterr","rank":[26,30]},{"title":"Excellent tween and teen movie!","rating":18,"date":"18 July 2011","review":"Monte Carlo is a charming movie for tweens and/or teens. Several other reviewers disliked the movie calling it predictable and boring but I have to vehemently disagree. If you are looking for a cute, adventurous movie with NO SWEARING, NO NUDITY, NO SEXUAL SCENES or INNUENDOS, NO SMOKING, and NO DRUGS then this is the movie for you (and us!)! This movie reminds me of some of the 1960's Disney movies that were plot-wise too old for little kids but still 'safe' for the not quite teenagers.<br><br>This is a classic movie about mistaken identity and learning to get along. The 3 main characters in the movies are all very different personalities but they grow and learn to accept each other by the end of the movie. They also have very different 'happy endings' but seeing how different they are, the characters should end happily-ever-after differently.<br><br>There are some funny moments, some thinking 'would I do that?' moments, and some 'good for her' moments. You genuinely like each of these characters (except the mean girl) by the end of the show whether you liked them at the beginning or not.<br><br>This movie is perfect for its target audience of tweens/early teens and I wish more movies like this were available with today's stars!","user":"FourInTheFamily","rank":[41,50]},{"title":"A sweet harmless movie that if not taken too seriously is quite enjoyable.","rating":6,"date":"3 October 2011","review":"Monte Carlo is a sweet romantic comedy in the same vain as The Lizzie McGuire Movie, the story is about a small town gal from Texas, her best friend and her uptight sister who all travel to Paris for a week, only to get separated from their tour group, they take refuge in the nearest hotel and one of the gals is mistaken for a wealthy British heiress and that's when the story takes off. Cue lots of awkward situations and a cute love story and there you have it.<br><br>Selena Gomez is quite nice to watch, as is Miss Meester and Katie Cassidy, all three girls have their own storyline throughout the film and each get their chance to shine. Full props to Selena for being entirely convincing as a snooty British snob, she nailed it. The one thing I didn't get was everyone in the movie from Texas has a Texan accent except Selena, I don't know if this was a deliberate mistake or just plain laziness, but for me it was the only thing that bothered me.<br><br>The movie is quite girly, not that that's a bad thing, that's the target audience, but for me it was still easy to watch and enjoyable enough. Give it a go, its not a classic teen film but hey, it's nice enough for a movie night with the girls. :)","user":"JimmyCollins","rank":[18,24]}]