[{"title":"A New Era for Chinese Animation","rating":9,"date":"17 August 2019","review":"I did not originally want to watch this film as I do not like the story it is based on but I am glad I did.<br><br>I am a huge fan of myths and legends of different countries and cultures and I liked the old Chinese animations.\n4 years ago, they made a Monkey King animation which I loved and finding out that that team helped on the Nezha movie was one of the reasons why I chose to watch it.<br><br>The core concept is about fighting fate and against how others see you.\nAnother point I loved about it is as it is a Chinese movie it is told from a Chinese perspective and from Chinese culture. This is great way for people to learn more Chinese people and culture. The down side is it is different to movies that we are used to and a lot will not be understood if we are not Chinese or know much about Chinese mythology. Also some of the jokes reference Stephen Chow's work.<br><br>The English title \"I am the destiny\" makes sense to Chinese viewers, it is meant to be artistic with deep meanings (I spent a day discussing the title with my wife who is Chinese, she was explaining why she understood this title while it would not have been her first choice). Think of it as \"I make my own fate\" or if they just chose \"Nezha: Fate\"<br><br>The animation is amazing, the difference between the characters (humans, animals, clouds) and the scenery is marvellous. I wished to look at more of the buildings but that's just me being weird.<br><br>The music is great. Very exciting and also a lot using traditional Chinese instruments (one part is a tribute to the Terminator movies with traditional Chinese instruments) also the credits music is a great song they made for the moive with a lot of great lyrics (in Chinese)<br><br>The action scenes are beautifully made and flow very well. Also the pacing of the movie is perfect, at no point did I feel they dragged a joke or a scene on for too long.<br><br>The story is a retelling so some people may be annoyed that it deviating from the original but Disney does it all the time so leave them alone.\nThe story is interesting and the changes makes it more relatable.<br><br>There are some bugs with the animation but they almost didn't finish in time for the summer holidays so I'm willing to overlook that.<br><br>What's more is the director's backstory. He studied medicine in University. His animation background, all self taught. Made a 3d animation by himself and won a lot of awards. The company he works for now collected a lot of animation companies together to make this movie. They risked a lot but this movie is the director's dream which he had been thinking about for years.<br><br>This can be seen in his attention to details. One of the charecters has a different accent because of where this character is from. And the director spent a lot of time to find the perfect voice actors for his characters (which I find to be a major failing of the Chinese animation industry in general, some beautiful animations ruined by frustratingly annoying voice actors)<br><br>Background information you should know.\nThe old guy is the most powerful in heaven.\nIn China, a master takes disciples for training. He is like a parent, teacher and master at the same time. Choosing a master or a disciple is not entered into lightly.\nAt that time, monster attacks are common and many people have lost family to them.\nMight need to find a Chinese friend to help explain other points you may find confusing<br><br>I've seen it 7 times and I advice you to watch it on IMAX, looks better.<br><br>I hope they get a good subtitles team, a lot of jokes will be hard to translate. I also hope that they don't dub it. The dubbed version of \"Hero is Back\" the Monkey King animation was terrible and ruined it\nAlso hope that they will release it in China with the English subtitles so that I have an excuse to watch it again","user":"nick-caddy","rank":[100,115]},{"title":"Best Chinese 3D animation movie ever.","rating":10,"date":"26 July 2019","review":"It's such a spectacular movie I was totally blown away while watching it in theater. The director is a genius with extraordinary imagination and a fully grasp of animation movie making. The story is rooted from Chinese ancient myths Nezha. The fantastic adaptation couldn't have been better. It has gained mountains of positive comments in China. Desperately expect it will be watched by more and more people.","user":"n-44597","rank":[119,141]},{"title":"Break all definitions!","rating":10,"date":"21 July 2019","review":"After seeing the posters and trailers, my first reaction was: nezha is so ugly. Feel ugly on the right, because this film is about to break the prejudice. As a lot of people look at this is diffuse, do not see; Or to see, see feel good also want to automatically deduct 20 points. In the movie, calling nezha a monster is politically correct. In addition to the film, scold domestic films, diffuse also become political correctness, as long as you scold it, someone will give you thumb up. In fact nezha is not a monster, he also wants to fall demon in addition to the devil wash name; Not all films are bad, but some people want to make a good film to prove themselves. Like nezha. The landscape of mountains and rivers is truly unrestrained and shocking. It embodies the objects that once existed only in the imagination and shows the infinite imagination of Chinese mythology incisively and vividly. Those familiar stories are no longer just stories, but can be seen, heard and enjoyed visually. With nezha this year and jiang ziya next year, the god movie universe is about to open. It's time to introduce Chinese culture to the world.","user":"g333","rank":[115,151]}]