[{"title":"Hydra lame","rating":3,"date":"8 June 2012","review":"Do you want me to start with the good news or the bad news? Well, the good news is that Hydra is not the worst SyFy's done, and it's not quite bad enough to be down there as one of their worst. The scenery is atmospheric, and the photography and editing are better than the choppy standard I have come to expect. Also the hydra itself actually looks good, not amazing, but compared to the cheap-looking and stilted-moving effects before and since this movie it is a considerable improvement. The bad news is that Hydra is still not a good movie, I have seen worse by all means but it was still lame. The main problem here was the story, a good idea on paper and is better paced than most SyFy movies but on film it was predictable and could have been developed much more than it was. The characters are the same, they are not as annoying as other SyFy efforts but still clichéd and you don't learn much about them. The hydra was not bad in look, but like the rest of the characters, you don't really feel threatened partly because the killings and gore lacked tension and had a you've-seen-it-all-before vibe and also that Hydra makes little to no attempt to expand on the hydra's origins and the like. The script is cheesy and doesn't feel like it's flowing naturally, and while they admittedly don't have much to work with the actors do nothing in their body language or their delivery to elevate the characters and script. For want of a better word, it all felt bland. All in all, a lame movie but I've seen worse. 3/10 Bethany Cox","user":"TheLittleSongbird","rank":[10,10]},{"title":"Not as Bad as Some say.","rating":4,"date":"22 February 2009","review":"This will never be Emmy-worthy, nor will this enjoy record-breaking DVD sales later when it is released, but this is superior for a Sci Fi Channel Original. Like Wyvern, the story and dialog is more involved, better detailed, and runs much more fluid than your typical Sci Fi Channel fare. The long shots and scenic vistas are new for Sci Fi Channel releases, and I have to say they add a great deal to the overall feel and effect of the work. But moreover, the CGI has been amped up a bit and looks like something in which you can suspend belief, for a change. That has been the greatest problem with Sci Fi Original movies, thus far...the horrible CG, trite dialog, and terrible acting ruin the possibility of enjoying a good suspension of belief, thereby negating its own work. Thus is not the case with Hydra. At least, not to the extent as is typically present.<br><br>It's not as bad as some say.<br><br>It rates a 5.5/10 on the Made 4 TV scale.<br><br>It rates a 4.2/10 on the Movie Scale from...<br><br>the Fiend :.","user":"Elswet","rank":[50,77]},{"title":"Yes it is... (as bad as some say)","rating":10,"date":"18 July 2010","review":"But that is the wonderful thing about all SciFi Channel productions. Cheesy monsters, wooden dialog, D list actors with porn names, military units outfitted in Cabella's catalog costuming, \"Soldiers\" with hair styles from the 1980's disco era, spurting blood, single camera/single take cinematography, re-used sets, cliché stereotyping, and an amazing array of Hooters waitress types who are geologists, physicists, astronauts, biologists, etc.<br><br>For a fan of the original B movies these low budget, filmed in a week and written in a day formula pieces are true movie magic.<br><br>And Hydra is just exactly as awful as you would expect.<br><br>May God forgive me, I do love these so!","user":"nat-parkinson","rank":[14,20]}]