[{"title":"Surprised at the low IMDb rating, 97% fresh on Rotten Tomatoes is more accurate","rating":8,"date":"4 March 2020","review":"Newb writer (along with Don M. Thompson) and director Matthew Pope makes his full length feature film debut with this low budget indie B-grade film - Blood on Her Name, and considering his inexperience, I feel he nailed it!<br><br>It's a small southern town neo-noir thriller written and directed very well - better than some big budget Hollywood blockbusters from seasoned filmmakers that I've recently seen.<br><br>Pope's screenplay was excellent coming from an inexperienced writer. It's slightly slow paced, but the 85 min runtime and the constant tension, suspense and twists, time flies by, especially with Bethany Anne Lind's convincing stellar performance. There were some plot and technical issues - I still don't know what happened with the mom/wife, but nevertheless, it was a well put together dramatic crime-thriller. The last 5-second ending was stellar - if you catch it.<br><br>Casting and performances all around were on point, with the exception of the son, Jared Ivers, who was very bland and stale. I get this is his third-ever acting role, but maybe with a seasoned director directing his character properly, he wouldn't have seemed out-of-it throughout this film.<br><br>Cinematography and score were also on point. I certainly recommend this little gem and will probably see it again. It's a well deserved and honest 8/10 from me. Click on my username to see more of my 1000+ ratings and 800+ reviews.","user":"TheTopDawgCritic","rank":[9,13]},{"title":"Tense and Confident Neo-Noir Thriller","rating":7,"date":"28 February 2020","review":"In its 85-minute runtime, this air-tight and confident directional debut, an exercise in Midwestern small town murder and revenge neo-noir, manages to do a whole lot, pleasantly surprisingly so. \"Blood on Her Name\" is primarily a character study, a study of guilt and remorse that shows how most of us could never cope with having committed a terrible and immoral crime. Compelling and tense story and its morale center teams with the equally compelling lead performance to highlight this top tier indie thriller.<br><br>In \"Blood on Her Name\" Leigh, a single mom with enough trouble on her shoulders, finds herself crumbling down in panic after having accidentally killed someone. Guilt takes over quickly and chaos ensues as she chooses to deliver the dead man's body to his family. It's a tightly made, consistently engaging movie, despite the plot being relatively small-scale and on simple terms. Via director's careful attention to the character's emotions and morales, dilemmas and the search for what's right, \"Blood on Her Name\" goes a level deeper and draws the viewer into experiencing the dark side of the human, a person in trouble, her actions and consequences. Morally complex rather than complex story-wise. \"Blood on Her Name\" is, by all standards, a bleak drama/thriller, filled with unrelenting tension and completely devoid of humor, which some might find that a little problematic. The movie is further supported by authentic performances, most notably the lead one, by Bethany Anne Lind. Will Patton offers up another good version of his seemingly frequent character of a bad-man-in-disguise &amp; main cast is concluded with equally good work by Elisabeth Rohm, Jared Ivers and Jimmy Gonzales. Visually \"Blood on Her Name\" might not be a stand-out of any kind, but it is undeniably shot and edited competently and effectively, further atmospherically tweaked with a subtle original score and befittingly grey and dirty color grading.<br><br>In the niche of southern gothic / small town murder / down-and-dirty psychological thriller and such, \"Blood on Her Name\" is great addition. Coincidentally, another spiritually very similar movie tcame out the same day as \"Blood on Her Name\" - \"Disappearance at Clifton Hill\". It has really been a great day for indie thrillers. My rating: 7/10.","user":"TwistedContent","rank":[9,17]},{"title":"Bad decisions all around.","rating":2,"date":"29 February 2020","review":"A woman who made some bad decisions all around. A very fast moving meh thriller, about a mom who covers for her son accidentally killing a man, but the mother is dumb as hell in everything she does to cover for him. In the end I was glad what happened to her happened because overall she was an absolute idiot. Watchable only once for a Sat afternoon. ..very meh","user":"whitemanfromtowne","rank":[9,18]}]