[{"title":"Wickedly funny black comedy that borders on satire - fantastic acting by all involved and just one hell of a ride","rating":9,"date":"21 July 2014","review":"This film is not at all what I expected from Herzog - I haven't laughed so much in a long time during a movie. What we've got here is an over-the-top, crazy ride with the best Nic Cage in years. Funny little anecdote on the side (as told by the director, Werner Herzog): when Cage asked for advice on how to best approach his role, Herzog told him to go with \"evil is bliss\". Cage obviously obliged - and the result is hilarious. <br><br>This film got a lot of negativity because apparently, people expected a serious, dark drama (knowing the original, I did, too). Well, Herzog had other plans: this is a wickedly funny black comedy that borders on satire. Fantastic acting by all involved, inventive camera and just one hell of a ride. Herzog's most entertaining film to date and Cage's best performance in ages. 9 stars out of 10.<br><br>Favorite Films: http://www.imdb.com/list/ls054200841/<br><br>Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/<br><br>Favorite Low-Budget and B-movies: http://www.imdb.com/list/ls054808375/<br><br>Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/","user":"gogoschka-1","rank":[78,97]},{"title":"Cage makes the movie","rating":7,"date":"23 November 2009","review":"One thing you can always count on when you go into a Werner Herzog movie is that you can always expect to find a story surrounding a very bizarre individual. With Bad Lieutenant, I saw both Herzog and Nicholas Cage in a new light, or rather a new darkness. Labeled as a black comedy, there should be more emphasis on 'black' than on 'comedy'. The film bears a strong resemblance to the thematically surreal and contrived nature of a Coen Brothers film, but the difference is that this one is more character driven than plot driven. More specifically, this is a film that lives on one performance. Nicholas Cage for the first time in a while has done something worthy of recognition, possibly even award worthy.<br><br>He plays New Orleans cop Terence McDonagh, recently promoted to Lieutenant. The film follows his latest homicide investigation. Due to a back problem and a drug addiction he is grumpy and unstable. He is sort of an anti- American hero, and the film concludes on a very bizarre note but clever anti- conventional/Hollywood manner.<br><br>Though not Herzog's best, it is certainly one worth watching. With each film I see from him, past or present he continues to intrigue me, but I think in this case, it might be Nicholas Cage who deserves the most credit.","user":"Samiam3","rank":[146,238]},{"title":"The Nicolas Cage we loved is BACK!!!!!!!!!!!!!!!!!","rating":8,"date":"24 October 2009","review":"I just watched this at London Film Festival &amp; went in expecting to hate it as I loved the original. But I have to say, the film is excellent, certainly Cage's best film &amp; best performance since Leaving Las Vegas. Herzog has done a brilliant job &amp; the film stands on it's own, apart from the Ferrara film. I won't spoil bits by mentioning them, but the film has several stand-out memorable scenes worth the price of admission alone. Herzog has always said that training for making films is 'life' not a stuffy film studies class etc. If you're familiar with his work or sensibilities, you'll get even more insight into how cool this guy is after watching this film. I look fwd to watching it again when it releases and getting the DVD!!","user":"k-comm","rank":[158,276]}]