[{"title":"Different and an entertaining super hero story","rating":9,"date":"22 February 2011","review":"As we all know Pixar and Dreamworks are two of the best studios producing amazingly awesome animated movies. There have been few misses but megamind is not one of those. With dreamworks releasing some fantastic and original movies in the recent past like kung fu panda and how to train your dragon I knew I had to see this one since it came out and I finally got time to watch it now.<br><br>Although it felt like one of the typical genre of super hero films, but with all those elements put together and a super brilliant character, MEGAMIND, who is a little flawed and evil, but is also lovable, earns our pity and \"gets the girl in the end\". It was smart, intelligent, witty and a well written story. The voice acting and animation were perfectly suited to the movie. I love how these studios pull such great emotions even with animated characters. When Roxanne leaves Megamind, you yourself will feel his pain which he shows with his eyes. I just love it..!!! This movie had some great around laughs and took a different spin at some conventional superhero movies and gave us a great surprise which I am sure you all would enjoy. This flick is for all ages. Right mixture of humour, seriousness and also a little suspense with a strong love interest will keep you laughing and entertained throughout the movie and the superb action and flying scenes which are very exciting, I feel, are made mostly for the \"3d\" experience but nonetheless its equally enjoyable in 2d. But 3d complemented the movie without being a distraction or annoyance. I guess it's everything I was looking for in a movie.<br><br>Also, the movie vividly captured many awkward and tragic human situations in a way only animation can. Like how society sometimes fails to accept a child who is different than his peers(because of his looks and intelligence) and just doesn't fit and he relates to them a bit awkwardly which in turn makes him feel alienated. In the movie MEGAMIND reasons that if he is treated like a bad kid, then he might as well be a bad kid, and thus takes place birth of an intelligent, genius criminal or as he says \"SUPER-VILLIAN\".<br><br>There's seriously nothing to complain about the movie except that I wanted it to go on for a little longer maybe.<br><br>Overall, a funny, exciting, entertaining and a really MEGA-AWESOME film that kids and parents, both, can enjoy and I would really like DREAMWORKS to keep going on with this and I am sure they will.<br><br>Enjoy. ;)","user":"appubhai007","rank":[30,30]},{"title":"Possibly The New Shrek!","rating":10,"date":"12 August 2011","review":"I don't remember the last time I enjoyed an animated movie this much! One reason being the gorgeous 3D animation-I mean...look at Minion's dome! I was gee-king inside and out on how detailed this movie is from the characters to the scenery. Every time I watch the movie, I always spot something new! Megamind shouldn't have been advertised as a full blown comedy, because this movie held plenty of deep lessons to be learned and so laughter was a little on the offside at times, but those tender moments were probably the best part of the movie! Will Ferrell, Tina Fey, and especially David Cross impressed me with their voice acting talent! I felt as though they ARE the characters...it just felt real to me.<br><br>Megamind has a lot of great lines and is a great family film! A must see!","user":"tabiosk","rank":[55,59]},{"title":"Megamind is the Charlie Brown of super villains.","rating":8,"date":"23 December 2010","review":"I am so glad that animated movies are coming back into their own. In the past few years we've seen some really good ones like Despicable Me and How to Train Your Dragon and now we have Megamind. The animation is great but what gets this film 4 stars is the fact that while the animation adds to the movie, it is only one aspect of the film's appeal. The dialog and characterization are strong too.<br><br>It is, of course, the thinly disguised story of Superman, but told from his arch enemie's(Lex Luthor) point of view. It's also a look at what happens when society fails a child who just doesn't fit neatly into a pigeon hole. Because Megamind is different than his peers(because of his looks and intelligence) he relates to them a bit awkwardly which in turn makes him feel even more different and alienated. At some point he reasons that if he is treated like a bad kid, that he might as well be a bad kid, and \" MegaMind, incredibly handsome criminal genius and master of all villainy! \" was born.<br><br>Megamind is also pretty even handed. When characters in this movie are bad,or cowardly, or act in ways that are beneath them, it's for an understandable human reason. I think the movie makes the argument that if people could reach a more mutual understanding of each other, then we might be able to start to eliminate much(but not all) of the evil and misery in this world. It has real heart That's just the underlying philosophy though. It's nowhere nearly as preachy as I might be making it sound. The movie is peppered with cool references to various Superman incarnations and plenty of humor.The animation is fantastic, especially Megamind's \"Death Blimp\". I saw it for the first time with a huge audience which consisted of both older animation fans and young families and everyone had a great time. I looked around occassioanlly and saw people of every description laughing through out the movie. There is something for everyone to enjoy in Megamind. It's a guaranteed good time for anyone with a heart beat.(Honestly, even the undead would probably crack a smile here and there.)","user":"Mike_Noga","rank":[31,33]}]