[{"title":"Stunningly accurate look at the bipolar life.","rating":9,"date":"29 December 2012","review":"I am bi-polar. I have been that way since I was a young man. I am approaching 60. I have been in treatment for many years. There have been relapses and time spent in hospitals. There have been good times. Before I received good treated, I left a trail of emotional, professional, and relational disaster behind me. It broke apart the lives of others as much as it did my own.<br><br>I did not know what to expect from this movie. It is a stunningly accurate trip into the mind of a BP sufferer. It shows the disease from the outside, too. It is amazing in its accuracy. The mood swings, the detachment from reality, the failure to learn from past errors are there. Here is a guy who has so messed up he is in the hospital. He is released into the custody of his parents. He improves himself physically yet cannot see what he has done, what he is now, and what the future portends with any sort of reality.<br><br>There are other situations in the film which mirror the BP life. There are job losses, broken relationships, unlimited optimism, anger, and a feeling that no one understands you. But he doesn't even understand himself. He thinks he is the only sane person around. He is in complete denial yet goes along with treatment just to get along with others.<br><br>The obsession with his estranged wife drives him. Everything he does is to make himself look desirable to her.<br><br>Then there is the hair trigger and the propensity toward violence which ultimately put him into the hospital. He has the belief that he sees with much more clarity than anyone else. There is also the hatred of medications and the belief that he doesn't need them.<br><br>Yet, there is hope. There is no miraculous cure. There is a negotiated peace between his illness and the way he must be to survive in the world.<br><br>The only thing I felt was missing was the crushing depression. But I understand that. Depression makes for lousy movies. The film is strictly about a manic life that wants to be better but cannot accept that he is badly off dead center normal.<br><br>If you are bi-polar and under control, see this film! If you live with or deal with a BP, see this movie. If you are untreated, you won't get it because BP clouds the mind.<br><br>My new wife and I went to see it. Up front I told her that I had this mental illness. She still married me. She is a health care worker with an understanding of illness and of treatment. After the film she asked me what I thought.<br><br>I told her that I was a bit frightened to tell her that the portrayal is spot on and that I had seen all of it before.<br><br>But like all bipolar sufferers, I wanted her to know that \"I was never that bad.\" The truth is, I was....but we BP people don't handle reality all that well.","user":"AdultAudienceMember","rank":[900,1]},{"title":"Excelsior Strategy","rating":8,"date":"24 November 2012","review":"Greetings again from the darkness. The film is exactly what you would expect from a screwball romantic comedy steeped in drama based on bipolar disorder, depression, OCD, Philadelphia Eagles fanatics, a ballroom dancing contest, adultery, Hemingway, and a lead character who jogs while wearing a trash bag. Maybe not exactly what you would expect, but more likely much more.<br><br>If you were told instead that the story is based on two damaged souls who help heal each other through dancing, you would have every reason to skip this one. However, as written and directed by David O Russell (The Fighter) and based on Matthew Quick's novel, this story is a frenetic, emotional roller coaster ride that provides a glimmer of hope for the two damaged lead characters, while reminding that each of us may be a bit off-center in some way. Now add in the best young actress working today (Jennifer Lawrence just turned 22), a rare performance from Robert DeNiro where he seems fully engaged, a pulling back the curtain on Bradley Cooper as much more than a pretty face, and one of the best and most precise soundtracks in recent history ... now you have one of the best films of the year.<br><br>What you notice very early on is that what could be considered a trite story line, is instead pounding you with sharp, witty dialogue that pulls no punches in directness. The many aspects of family and emotional support are given time thanks to Pat (Bradley Cooper) being released after 8 months in a mental institution. He was sent there when he snapped after finding his wife in a compromising position with another man. Perfectly understandable if you ask me, but clearly he is the explosive one despite his claims to the contrary. An uncomfortable dinner party introduces him to Tiffany (Ms. Lawrence) whose husband has recently died and her coping skills have been shared with most of those in her workplace. This odd couple spark immediately and the wild ride begins.<br><br>Pat's wife Nikki (Brea Bee) has issued a restraining order and Pat's strategy to win her back involves a positive attitude and maintaining control of his emotions. His supporters include his mother (Jacki Weaver, who was so great in Animal Kingdom), his OCD father (DeNiro) who so wants to re-connect with his son, his friend (John Ortiz) whose own marriage (to icy Julia Stiles) is a messy mess, his buddy from the asylum (a funny and not over the top Chris Tucker), and of course, Tiffany. The only real problem is that each of these supporters are teetering in their own way just like Pat.<br><br>The brilliance of this movie is the balance struck between the near violent emotional outbursts and the sharp, exacting words spouted by each of the characters. Director Russell once again shows his flair for working class northeasterners. He understands these tough as nails people who wear their emotions on their sleeves. These people are as likely to punch you as hug you ... and both are acts of love.<br><br>The soundtrack deserves special mention. It is very unique and varied, with each song serving an exact purpose. Especially keen are Stevie Wonder's \"My Cherie Amour\", Led Zeppelin's \"What is and What Should Be\", and \"The Girl from the North Country\" a Bob Dylan and Johnny Cash duet. When the music strikes a harmony with the scene, the movie is all the stronger. Rarely do we get the perfect storm of script, direction, acting, music and relevance.","user":"ferguson-6","rank":[216,309]},{"title":"Silver Linings Playbook is a refreshing addition to the rom com genre","rating":8,"date":"1 November 2012","review":"While most romantic comedies usually contain bad acting, sappiness, and a large amount of predictable moments; Silver Linings Playbook is the exact opposite. There may be a little amount sappiness in this movie but there is bound to be some in any romantic situations. In reality though, all of the sap in Silver Linings Playbook can be overlooked due to the fact that the film is completely original, extremely funny, and contains outstanding acting from the two lead roles.<br><br>Written and directed by David O. Russell (The Fighter), Silver Linings Playbook is about a man, played by Bradley Cooper (Limitless, The Hangover), who was just released from an eight month stint in a psychiatric hospital. He wants to get his life back on track but is being held back by his parents and his unstable condition. After a little while, he strikes up an interesting friendship with a female played by Jennifer Lawrence (Winter's Bone, The Hunger Games). Both of these characters are going through somewhat of the same type of problems which makes their friendship even more quirky and thought-provoking.<br><br>Because a large amount of romantic comedies are stale and overdone, Silver Linings Playbook is a breath of fresh air. Usually movies in this genre follow a very particular road map that entails: man is at rock bottom but then finds the perfect girl. After a while, man loses girl and must win girl back in a very cliché and unrealistic fashion. What's original about Silver Linings Playbook is that it doesn't follow that mediocre story line in the slightest making it unpredictable but at the same time, more relateable. Chris Tucker is in this movie and even he isn't predictable. Chris Tucker, the loud-mouthed actor who hasn't been in a film without the words 'Rush Hour' in the title for almost 15 years, was surprisingly mellow. Even though he was mellow, he was still very comedic and played a great role in the film.<br><br>The most surprising aspect of Silver Linings Playbook, however, was the performance of Bradley Cooper. Even though this is a comedy, Cooper plays what is maybe one of the most serious roles he's ever performed. After audience members witness his work in this film, there shouldn't be any more doubt if the man can act or not. Silver Linings Playbook is without a doubt Cooper's best work thus far in his career. Jennifer Lawrence has a performance of equal caliber but that is expected from the young Academy Award nominated actress. What was surprising about Lawrence's role in the movie, was how adult it was. Fans of Lawrence's work may have been worried that she would be stuck in teenage roles after playing the character Katniss Everdeen in The Hunger Games, but she should silence those doubts after this film with a very adult, yet professional, performance.<br><br>Silver Linings Playbook is full of creativity and minimal on romance clichés. It is hands down one of the best romantic comedies to be made within the last couple of years. This film contains many laugh out loud moments and a number of scenes that will warm your heart to the point where you can't help but leave the theater smiling. Silver Linings Playbook is the perfect date movie that both men and women can easily enjoy. A-","user":"cummingsjosh7","rank":[215,313]}]