[{"title":"Enjoyable stupidity!","rating":7,"date":"20 September 2010","review":"I don't understand why some people dismiss this movie as stupid. Isn't that what comedy is usually about. Aristotle himself says that comedy should deal with the \"ridiculous\". The part where Black's character Zed eats the forbidden fruit of the tree of knowledge and within seconds feels himself \"more intelligenter\", is hilarious. He starts ruminating like a philosopher and comes to the conclusion that \"everything is just so weeeird\". Of course, all this is for comic purpose. So who are more stupid? The makers of the movie who make such scenes in a comedy, which being low brow is not really to be taken seriously, just enjoyed. Or the ones in real life who actually read about such a tree and believe it to be true. It's a comedy. Just enjoy it for laughs.","user":"drakesh7","rank":[42,50]},{"title":"An underrated gem","rating":8,"date":"19 November 2010","review":"When Year One came out, I missed it in the theater. It didn't seem to last long. People didn't seem to receive it all that well either. Considering I'm not fond of either of the actors in the two main roles, I really wanted to see this film. When I finally got around to watching it, I now understand why it struck a chord with me.<br><br>Without ever claiming to be a tribute to Mel Brooks, that's exactly what it ended up as. If you liked History of the World Part One you will like Year One as our two cave men progress up through the early years of human civilization and culture, encountering various biblical figures and getting themselves in and out of various tight spots.<br><br>It was really a fun little film that I think most all fans of Mel Brooks would appreciate. It is as much a nod to JudeoChristian history as it also pans it. It is a nod to Mel Brooks without being a complete copy cat of Mr. Brooks. It is meant to be a romp and not a serious film.<br><br>People who brushed it off should give it a second chance and not try to over analyze or read to deep into it and just have a little fun. I gave it an 8, which is saying a lot from a person who doesn't like either lead.","user":"Moonspring","rank":[50,64]},{"title":"Exactly what it should have been, yet cruelly underrated.","rating":9,"date":"21 June 2009","review":"When I first saw the in theater preview for this movie, I was extremely excited. I went home and got onto Facebook and became a fan of the movie, which provided me with updates containing every video pertaining to Year One that was out there. I saw all of these videos and laughed hysterically, but I began to get a feeling that the movie would consist of what was in the previews and be nothing more than around 15 minutes of funny dragged out over a 90 minute period of time.<br><br>I was wrong.<br><br>When the movie started, I began to become even more worried I would hate it because within the first 20 minutes of the movie, at least 3/4 of the things seen in the previews were already said. I figured it was going to drag on from there. To my great relief, it did not at all. The entire hour and a half of the movie was constant laughing. The way Black and Cera got themselves into so much trouble and managed to get out of it every time was perfect. The ridiculous yet hilarious references to The Bible and how things that exist today were created were perfect. The movie was exactly what it was supposed to be: a laugh out loud comedy that was only meant to entertain.<br><br>I am still baffled as to why people keep bashing this movie. Comments like \"Worst Movie of the Decade\" anger me... What were people expecting with this movie? A heart warming story with a compelling plot and serious action? It is like everybody is sizing this movie up to expectations that it doesn't need to be sized up to. This movie was a great movie if all you want to do is go in and laugh. If you are looking for some deeper moral and other things that don't belong in a movie like Year One, you should go and see something else.","user":"raidersfan858","rank":[167,231]}]