[{"title":"Frustratingly cruel, not easy to watch.","rating":7,"date":"2 April 2013","review":"It's been a long time since I've seen this film, during the time when I still didn't bother to rate and review every Horror film I watch. Lately I've been re-watching some of those I liked especially, but as for Eden Like - I'll pass. Not because it isn't good, but because nobody in their right mind would define it as \"fun to watch\", that much I do remember.<br><br>However, what I remember most vividly is my utter sense of frustration, disgust and despair with humanity. Throughout the film I've kept feeling the urge to be there, so I could knock some hard painful sense into those no good hoodlums, and their sad excuse for parents! Very much like this decade's streak of \"torture porn\", Eden Lake plays on these emotions in the audience. Pity for the victim, rage against the assailants, and despair/helplessness.<br><br>Acting and cinematography are good enough, nothing special worth mentioning as far as I can remember (bear in mind it's been a while), but the story and some of the scenes are what sticks with you afterwords. Personally, I can't call the sensations I get out of watching these kinds of films \"fun\", but they are definitely, in a way, rewarding. Eden Lake isn't easy to watch, and seeing as how this is obviously its goal - it's a success. My relatively low rate is only on account of my personal experience with it.","user":"nitzanhavoc","rank":[72,89]},{"title":"Breaks you down","rating":8,"date":"30 June 2009","review":"I can't remember the last time a film evoked such raw emotions in me. I'm literally teared up and shaking - from anger, pain, frustration and disbelief. Watching this film is an experience more than words can describe, it plays on pure emotion. You're sucked into the whole atmosphere, to the characters - both the good and the bad -, and it really eats you up and leaves you with this bundle of emotions that catch you off guard and in the end, leave you empty-handed.<br><br>I'm sorry for not being very precise about the plot and the characters, but I simply can't write an ordinary \"this film opens with...\" review, the experience was just too much.<br><br>I highly recommend it, but not for the weak-hearted.","user":"cookie666","rank":[178,252]},{"title":"Horrible movie....","rating":2,"date":"7 October 2010","review":"I am a massive horror movie fan but this movie left me completely cold. It is mean spirited, cold, and above all else unbelievably frustrating and stupid at times. On the plus side the film is very well acted by all involved, and very well made. But such is the lack of logic in places and the complete lack of a satisfying pay off that any merits are quickly outweighed. <br><br>For example: we have a lead character here that thinks its okay to wonder around other peoples homes without their consent. The other lead then does the most bizarre and random thing with a mobile phone that any suspension of disbelief is lost and the only appropriate response is 'doh'.<br><br>And as for the ending! After so much horror and terrorisation I was expecting a decent pay off. But instead we get a downbeat, nihilistic sign off that has become popular in modern horror. I may be missing the point somewhat here, but all in all I just found the experience unpleasant. <br><br>All I can really say is that this is a movie you should really see for yourself. I hated it, but it seems to work for some people.","user":"smith-stu-856-31274","rank":[147,222]}]