[{"title":"Odd to say, but \"great chemistry!\"","rating":7,"date":"13 March 2009","review":"Kudos to the casting agents for this one -- it's fun and lively and moves along steadily to the predictable happy ending, but along the way the dialogue is snappy, witty, and oddly believable. Why so? Hard to believe, but it was the great chemistry of the two bromantic leads! They play off each other perfectly, and because they're sharply versed with each other, it's instantly believable that they're also sharply-witted with others. It's rare to have the sex-hungry jock teens be intelligent too (smart jocks? Who'd buy that?), yet it works! I bought it, I laughed (a lot!) and I never reached a point where I thought the lead characters had stepped to a point of groan-ness. So kudos to the casting, and the lead actors themselves -- should the chance happen again, I'd gladly see another comedy with these two -- they make a good 'bro' pair.","user":"olec-3","rank":[73,87]},{"title":"Not very memorable, but an entertaining juvenile comedy","rating":7,"date":"7 May 2010","review":"In general, the juvenile comedy genre disappointed me very much in recent years, due to the crowd of unbearable pieces of crap straight-to-DVD (such as, for example, Cougar Club and Picture This), which almost extinguished my taste for this underrated genre.So, without being a great film, I liked Fired Up, because it does not fall on the easy scatological humor; and even though it relies on the old formula of \"louts looking for sex\", it uses a context and a development which are enough different in order to separate it from many cheap clones of American Pie which try to occupy the niche created by gems such as Clueless, Weird Science and Can't Hardly Wait.<br><br>In Fired Up, the technical aspects are correct, but they do not have too much creativity; the performances are barely functional; and director Will Gluck drives the movie with a good rhythm, but he does not show too much vision (a few interesting transitions are not enough to bring a visual identity to the movie).Fortunately, the screenplay from the movie comes to the rescue by creating entertaining situations which on some way conciliate the message of equality and tolerance the movie proposes.Finally, the characters are interesting and their dialogs are well written.<br><br>In summary, Fired Up may not be a highly memorable experience, but it kept me entertained and it made me laugh, and I think it deserves a recommendation because of that.","user":"Argemaluco","rank":[15,16]},{"title":"one of the funniest stupid movies ever.","rating":8,"date":"20 February 2010","review":"first off, this is no monty python comedy. this is your standard modern comedy with a sub par storyline putting two people in an uncomfortable position and seeing the hilarity that ensues. this is not a thinking man's comedy. this is a \"watch if you wanna quote a movie for years to come with your friends\" comedy. i was skeptical at first because from the trailer, the movie just looks stupid. but a friend of mine said he went and saw it, expecting to sleep through it, and loved it. so i watched it, and i agree. the one liners are great, eric Christian olsen is hilarious as his usual lovable stoner character, and will gluck (who did the short lived series \"the loop,\" also hilarious) does a great job at directing this comedy. only reason it's not a ten is because it's pretty easily predictable, but hilarious nonetheless. if you're a fan of stupid humor, or the series will gluck's \"the loop\" you'll love this.","user":"Sammythecrab","rank":[26,31]}]