[{"title":"A very good concert album with introductions","rating":9,"date":"15 September 2019","review":"Instead of touring his latest album, Bruce Springsteen made this movie of its contents. It was mostly recorded in his century-old barn, with a 30-piece orchestra, some new vocal arrangements by Patti Scialfa, and an audience of a few friends and the horses in the stables below.<br><br>Each song is introduced by Bruce, often as a voiceover as various images play, some of which are Bruce's archival photos or home movie clips. The lynchpin song is Western Stars, about an old cowboy still going on, when many of his contemporaries have left their boots (a song likely to be self-referential, given his approaching 70th birthday).<br><br>I saw this film at the Toronto International Film Festival, but not at the premium-priced world premiere, so Bruce had already left, leaving fellow director Thom Zimmy to answer questions. Bruce's directorial contributions included writing and producing the song introductions, and co-selecting the archival material to include. The intros make it feel that this album is a collection of poems set to music. With songs about cars, trains, heartbreak, and love, I wonder if someone will do a full country re-creation of the material. The film ends with a bonus song (that fits the overall theme), which is more upbeat than Moonlight Motel.<br><br>Even being only casually acquainted with Bruce's music, I found this film fascinating. It is probably a must-see for actual fans, especially those who have already memorized the lyrics. It is expected to open commercially October 25.","user":"chong_an","rank":[28,39]},{"title":"Almost PERFECT!","rating":9,"date":"27 October 2019","review":"I was not a huge fan of Bruce Springsteen, until I saw this film! Gorgeous photography, incredible setting in an old barn, fabulous songs, accompanied by beautiful strings &amp; even an accordion! Writing, directing , &amp; performing in this film was labor of love for Springsteen. He bridged his performances with thoughtful insights into what each song meant to him. Well chosen archival video so interesting &amp; fun. The young cute Springsteen has become a handsome man of substance both musically &amp; otherwise. And I loved every minute of it.","user":"barbarapochan","rank":[9,12]},{"title":"Pure delight","rating":9,"date":"13 October 2019","review":"I am a huge Springsteen fan so this may not be the most subjective review. It's not the routine \"in concert\" recording, this is a beautiful piece of story telling that provides insight not just into the characters in the songs but into Bruce as well. It gives a whole new depth to the album and as a piece of cinema, well, just sit back and let Bruce work his magic on you. I dare you not to feel something....","user":"alansargeant","rank":[15,24]}]