[{"title":"Outstanding film, almost exactly to the detail from the debut novel by Albert S치nchez Pi침ol","rating":9,"date":"18 February 2018","review":"This film will not be for everyone (hence the disappointing low rating). For starters, it's almost an exact adaptation from the Spanish (Barcelona, Spain) award wining debut novel (translated to 37 languages) by Albert S치nchez Pi침ol, and directed almost perfectly by Frenchman Xavier Gens. <br><br>It is not your typical big-screen huge budget Hollywood action blockbuster with A-list actors, and thus should not be compared (as other reviews have) to The Shape of Water. Instead, it's an artistic piece shot extremely well that was written by a Spaniard and presented by a Frenchman - definitely no Hollywood here.<br><br>The directing, cinematography, landscape, vfx/sfx and score where outstanding - near perfect. The actors (never heard of either) performed exceptionally well and were very convincing. <br><br>Yes, there were some avoidable obvious plot issues, which was disappointing considering how great the rest of the production was. However I'm thinking that it was an editing issue and cutting scenes to get the length down to 108 mins, of which considering the slow pace, I'd be complaining on the length, yet it didn't feel that long. It could also be a screenplay adaptation issue from the two novice writers - they did squeeze in as much as they could from the novel, but maybe should have cut certain scenes shorter to fill in the blanks.<br><br>I've read some reviewers had questions about certain things that happened. Some of those issue are answered if you stop and think why this happened and/or dig a little deeper into the meaning. Others, you will need to read the book. I did, and have nothing to question, but do understand how others who didn't read the book would have questions.<br><br>A very impressive film, unlike any other I have seen, and needs to be appreciated for what it is, and how is was shown. Would I recommend it or see it again? Absolutely. Had better screenwriters adapted the novel, this would have been a perfect 10/10. But still is a well deserved 8.5 rounded up to a 9/10 from me.","user":"TheTopDawgCritic","rank":[114,145]},{"title":"Enjoyable dark eerie movie","rating":8,"date":"28 October 2018","review":"A dark story of what colonialism might have been to the indigenous habitats of a newly discovered land. Wonderfully shot cinematography followed by brilliant musical score and unforgettable story. Very enjoyable.","user":"desertship-78246","rank":[21,25]},{"title":"Unique","rating":8,"date":"10 February 2018","review":"Very good. Not sure how it's going to reach it's target audience (as I merely stumbled across it, thinking it was something entirely different than it is). If you like, moody, atmospheric, solitary, creature features, then this is for you.","user":"rykskelton","rank":[85,119]}]