[{"title":"A Good Batman Adventure For Kids","rating":7,"date":"22 August 2019","review":"After being bored with a board meeting after stopping Solomon Grundy from stealing a magic staff, Bruce Wayne puts a new machine revealed, Brother Eye, in charge, as he proceeds to sell Wayne Tech. However, this leads to Two-Face buying the company, and plotting to use Brother Eye to take other Gotham and destroy both Batman and Bruce Wayne. Also, Red Hood has arrived to challenge the Bat Family.<br><br>While some people may not like this, this is actually a good film for kids who are not yet ready for films like the ones in the DCEU or the Dark Knight Trilogy. As a result of this being a Lego DC movie, they did change Red Hood's origin story to be more kid-friendly, however, seeing as the Lego DC films are part of their own continuity, it should not be a problem. Also, the movie has some good references to classic Batman shows and cartoons (one scene has the bat poles from the 1966 Batman series, complete with automatic suit up, and another scene has a Grey Ghost playing as Batman and Two-Face duel with swords, a neat reference to the episode from Batman: The Animated Series).<br><br>However, there can be some annoying things (Nightwing and Batgirl keep bringing up a missed text that got them on non-speaking terms, which they never shut up about), but this is a good DTV movie and one that is perfect for younger kids or anyone into Lego or superheroes.","user":"jeremycrimsonfox","rank":[3,3]},{"title":"Full of action and funny scene! A quite entertaining animation film! Worth the time watching!","rating":6,"date":"2 August 2019","review":"This film start with Batman take down a bad guy called Solomon Grundy! As turnout, this film is about Jason Todd aka Robin disguise as Red Hood to take revenge on Batman! He accuse Batman abandon him and acquire Batman company and the A.I machine \"Brother Eye\" to ruin Gotham! He later use by Two-Face and turn back to good side with Batman again! Entire film full of action and funny scene! From beginning Batman take down Grundy, Batwoman fight with Killer Croc! Nightwing, Robin (this one is Batman's son), Batwoman and Batgirl driving two jet and fight with Penguin! Batgirl defeat Scarecrow gimmick! All this action scene actually quite watchable! I simply point out two funny scene! The Whiz reporter ask Batman donate him five dollar, after Batman really donate the amount, he regret saying should ask for ten dollar instead! Another one is, Batman ask a random guy \"Fred\" for using his vehicle, Fred ask Batman help him to buy things in return and ask for Batman autograph too! Later Fred saying Batman forget to buy ice-cream! At the end, Batman and his ally take down the Omac drone control by Brother Eye, and shutdown Brother Eye! At the very end, Batman playing video game with Robin(Jason Todd), and asking another Robin(Batman's son) walk his dog! Still have a post credit scene! The Whiz reporter actually is Billy Batson aka Shazam! He walk in a train at that scene! That's it! A worth to watch animation film!","user":"kwenchow","rank":[2,4]},{"title":"It's a OK direct-to-video animated movie.","rating":5,"date":"18 December 2019","review":"Although Troy Baker and the rest of the cast are giving their best to deliver great performances - it's not enough to save the movie from it's terrible writing, which includes the story, characters and dialogue as well as the mediocre and forgettable music.<br><br>While the animation is not as appealing as the theatrically released LEGO movies in \"The Lego Movie\" franchise - it's still very impressive to look at, even if people complaint that it looks more like a low-budget movie or a video game quality cutscene that the LEGO games have today. The sound is great, but it does include some stock sound effects that can be found in many terrible animated movie (also in comedy movies) and the cinematography is also great, however there was a moment where Batgirl falls from a great high in her hallucination, which was caused by The Scarecrow and for some reason they cut to six different shots of the same falling and it looks very bad.<br><br>Overall it was a enjoyable movie, but contains flaws, which can really ruin the experience for a lot of people and i don't think that many would want to watch it again after the first viewing, but even with it's problems - i'll still revisit the movie again in the future and \"LEGO DC: Batman - Family Matters\" gets a 4.6/10.","user":"Martinito_08183","rank":[0,0]}]