[{"title":"A Nutshell Review: Race to Witch Mountain","rating":7,"date":"14 March 2009","review":"If aliens exist, and if they have access to the films made from Earth, they would likely make a mental note to remind themselves that should they visit our planet on terms other than a hostile takeover or annihilation, to avoid landing in the USA at all costs. Hollywood has enough dough to continuously churn out effects laden science-fiction movies, and most of them are big budgeted action fests like Independence Day and Men In Black, which don't exactly paint a good picture of the extra-terrestrials. Aliens who have more benign intent, would be frightened by how trigger happy and violence prone the US is toward illegal aliens, even if popular culture meant the landing zone for extra terrestrials is the USA and not other larger countries.<br><br>Race to Witch Mountain being Disney fare means the toning down of practically everything to ensure that it is safe for the entire family to experience together. Dwayne Johnson seems right at home in family friendly flicks like The Game Plan (also directed by Andy Fickman), and I guess his action days on screen will be few and far between, especially when he gets to flaunt his dramatic and comedic flair. Woe is the fan boy like me who have grown up with The Rock, but there's no more people's eyebrow, and we should start to get used to seeing our idol in a different light on celluloid.<br><br>Johnson plays a Las Vegas cab driver Jack Bruno who has a colourful past that he tries to bury, in order to earn an honest living to buy his dream Mustang featured in the Steve McQueen movie Bullit. In a confluence of the stars he picks up a scientist who specializes in extra terrestrials, before chancing onto two of them when they boarded his cab without his knowledge. The brother and ssister aliens  Sara (AnnaSophia Robb) and Seth (Alenxander Ludwig)  are here on a noble mission, and are in hot pursuit by the shady government agents led by Henry Burke (Ciaran Hinds) as well as something like a Terminator from many light years away.<br><br>This naturally gives rise to your standard set action sequences where we get to see the alien twins exercise their rather innocent demeanour (\"they're only kids!\") to their advantage, behind which hides the immense powers they possess such as Telepathy and Density manipulation, which I thought was a very cool power to have. Imagine being able to pass through walls, yet having tremendous strength in the form of a road block, literally. AnnaSophia Robb whom I felt did a fantastic job in The Bridge to Terabithia, stars as the female child, and because of her character's ability, she brings forth a more trusting, and empathetic character, in direct contrast to the other alien Seth (The Seeker from The Dark is Rising is all grown up now), who's more direct, commanding, aloof and untrusting of humans in general, no doubt their initial experience was in having their space ship confiscated to Witch Mountain, and being chased for the conduct of experiments.<br><br>Carla Gugino, last seen as the aged Silk Spectre in Watchmen, got active only in the last third of the show, which was somewhat of a pity because she shared great chemistry with the rest of the cast, and got involved quite late into the thick of things. But of course if there's any consolation, like how the bits during the end credits would suggest, and depending on the box office results, there might be room for more in a sequel, if it comes. <br><br>There are references galore in the film given that there's a science-fiction convention event featured in the movie, and you can't help but also think about the potential for theme park rides with the yellow cab being pursued and pretty banged up. In fact I was wondering each time the cab got put through an action sequence, that it would make for a great 4D ride in Disneyland. You can't help it because it was quite in your face, with the sequences designed in that manner, deliberately or otherwise.<br><br>Despite some glaring plot loopholes, Race to Witch Mountain has all the ingredients for a great family outing. The story doesn't try to be more intellectual than it can handle, and doesn't let the special effects run wild and take over everything else. For being such a sentimental fool, the ending also got some brownie points from me, as it's tough not to shed a tear or two given the trials and tribulations from which a solid bond is formed amongst all the characters. Recommended for a family outing, but don't go expecting something out of this world (pun not intended), as everything's pretty formula.","user":"DICK STEEL","rank":[88,116]},{"title":"Fun movie","rating":7,"date":"15 March 2009","review":"Hey, don't believe the downers trashing this movie. It's fun. Non-action stop from beginning to the end. Dwayne Johnson, who finally shed his former wrestling nom de lutre, is a much better actor than people are willing to concede. He has a mobile face and uses his big body well with a lot more expression and ability than some of the other shoot'em up and knock-about action heroes. This film, a remake of the old Disney classics with a CGI uptake and story rewrite, is entertaining, engaging and full of witty little pieces for the watchful viewer. When the alien bad guy gets knocked for a loop and everyone ducks for cover and the 2 UFO-Trekkie-types rejoice, (Wow. Best convention ever!) and the one I liked best, one of the nerd bad guys named Analyst D. Pleasance, for the veteran character actor, Don Pleasance who played the bad guy in the Disney originals. Also, Irish actor, Ciaran Hinds makes a superb Man in Black Suit bureaucrat villain and lovable Cheech Marin as the sleepy mechanic gets his licks in too, albeit in a bit part. The beautiful Carla Gugino comes across as the UFO seeking academic and Director Garry Marshall as the nut case UFOligist makes for good comic relief. The two kids add the mixture with AnnaSophia Robb reminding me of one of my granddaughters and Alexander Ludwigs serious facial expression adding to the fun. I found this film fun from the get-go and recommend it highly.","user":"artzau","rank":[78,105]},{"title":"Good Movie for Kids-OK for Adults","rating":7,"date":"19 March 2009","review":"This is and is not a remake of the original Witch Mountain movie. It's more follows the guidelines and then takes off on its own in a more modern twist. If you liked the old one, you will probably still like this one too.<br><br>The actors did a pretty good job all the way around. The main bad secret agent guy was a really flat character, while everyone else was more dynamic. Dwayne 'The Rock' Johnson was great in this movie. He really keeps it going for the audience and is really funny. The kids are good as well. All the others did an alright job.<br><br>The plot has good twists to it and has multiple sides that are all crashing in together at the same time. The flow of the movie is a little jerky in a couple spots, but overall is an action packed ride.<br><br>The CGI effects are well done and believable. I enjoyed getting to see that aspect come to life, where the original Witch Mountain could only dream of seeing such cool stuff! Overall it is a good movie. Your kids will really like it and you will enjoy it as well. I recommend going and seeing it to anybody!","user":"mia_marauder","rank":[43,56]}]