[{"title":"Maybe the formula needs invigorating...","rating":6,"date":"3 March 2010","review":"I attended the Cast and Crew screening on Sunday, in Leicester Square, with high hopes for this film as it's without doubt the most exciting job I've had. This was my first feature experience, and working for Tim Burton was a hell of a way to start.<br><br>But, even as someone with a lot of time for his films, and a pre-existing bias, I couldn't really connect with this. The cast acquit themselves well, especially considering the noted difficulty in emoting to a tennis ball on a stick, but all their tics and quirks seem to be masking a void at the centre of what should be a free-floating, evocative trip. Sure, it's weird looking, but we've seen it before, and back then in films like Edward Scissorhands it had a sense of purpose. Now we're left exploring a CGI wonderland that seems to be without a great deal of wonder. The book revels in its bizarre environs, absurd dialogue and whimsical characters. This film grounds them, drains them of that mystery and leaves us with a colourful but forgettable retread. It seems intent on driving us to a narrative conclusion that few people will have had much stake in through its running time, simply because we're not giving much to care for.<br><br>With a source material so familiar, even to those whose knowledge is second hand references, there needs to be a degree of innovation (as in Svenkmejer's dark stop-motion version, or the co-opting of Terry Gilliam in to his \"Tideland\" narrative), or else a studious and inspired adaptation that completely returns to Lewis Carroll. What we end up with is a mid-point that fails to get to grips with what enchants people about the Alice story, and another chance to see a beautiful waif walk around twisted, quasi-Gothic landscapes to a score by Danny Elfman.<br><br>Not that this isn't an enjoyable experience in itself, and as seen in the vast Screen 1 at the Empire it is at times breathtakingly pretty. It's just inessential, and while it may be unfair to expect a classic from a favoured filmmaker every time out, when they tackle something with the pedigree and history of Alice In Wonderland you can't help but hope for something special. And that's the problem, that Tim Burton, while he is still making decent films, has been a long way off special for some time now.<br><br>6/10 (if they gave half stars it'd be 6.5), but that doesn't mean it's a bad film. It's possible that my grade is affected by high expectations and lost potential. If you have kids, I'm sure it'll be better than 90% of the dross that passes for family films now. At least there is some artistry involved, and while he might not be at his best I'll still always pay to see a Tim Burton film (although I got this one for free...)","user":"doibhlin","rank":[442,598]},{"title":"some stunning visuals, clumsy writing","rating":5,"date":"5 March 2010","review":"It is still worth the high price of the 3-D admission to see some of the amazing animation and design, but the writing is extremely boring and clumsy, and the performances cannot save it. Too many liberties were taken with the originals here, and in no way improve upon them, it only barely resembles either of Carroll's books in theme and some specific scenes. There are some \"Disney moments\" that literally set off a gag reflex as well.<br><br>The animation is quite stunning and wonderful though, as is the costuming and set design (in so much as there were sets and not just green screens, I'm sure SOME actual props were used). There are some clever elements that owe only to good visual design and direction I'm sure, as the only other clever bits in the dialogue were the parts directly lifted from the originals.","user":"ericpendley","rank":[314,483]},{"title":"Treading water in Wonderland","rating":3,"date":"22 March 2010","review":"Sometimes I think that I should like Tim Burton movies more than I do. Don't get me wrong, the man has made some excellent films, such as the masterful Ed Wood. But all too often, despite an agreeable tendency towards visual flamboyance, I leave his films feeling somewhat underwhelmed. Alice in Wonderland is a case in point. It's a movie where CGI effects rule the day. But the trouble is that the true weirdness that is at the heart of this story is not captured at all with all the computer-generated imagery on-screen. Sure it's very efficient and well-designed but like CGI in general, it's far too polished to really strike a chord and convince. There is a distinct lack of wonder in this Wonderland. The otherworldly weirdness is dissipated too by the use of overly-familiar voices to give life to the various denizens of this world, we are left thinking 'Oh that's Stephen Fry, hey isn't that Alan Rickman, I'm sure that's Christopher Lee and isn't that the bloke from Little Britain, etc'. It consistently takes us out of the movie and grounds the characters in a way that is just counter-productive. We want weirdness from an Alice in Wonderland film, not slick CGI and famous voice-over actors.<br><br>There is also a dangerously cosy predictability at play here too. Tim Burton, Johnny Depp, Danny Elfman – they say familiarity breeds contempt, well that's a bit strong but it IS seriously lacking in surprises and you cannot help think that all three individually talented men could do with taking a break from each other for the good of their careers. Depp's Mad Hatter is pretty uninspired by his standards, while Burton's visuals and Elfman's music are nice but ultimately completely forgettable. I found it very difficult to care for any of the characters in this film, and that is never a good thing. It also meant that the conclusion came across as deeply trite, as we have been given nothing to empathize with. We don't know or have any interest in these characters, so when Alice goes around her extended family one by one imparting her new knowledge onto them, it means nothing. It also doesn't help that the journey to Wonderland has made absolutely no difference at all to the title character's state of mind – at the beginning she does not want to get married to the upper-class chump and at the end she does not want to get married to the upper-class chump. So you are left wondering what exactly was the point?<br><br>I saw this in 3D and if there is one thing that this film has taught me it's that I am done with this 'new and improved' technology. I sensed it was a gimmick even before I watched Avatar; now I am certain. A bad film is a bad film, and no amount of extra visual depth is going to change that one iota. It's all surface-veneer, and really that's this movie's ultimate problem, there is nothing of interest within the CGI/3D. A great shame, as the source material is undeniably compelling.<br><br>I realize that I am almost done here but I have not even mentioned the worst thing about the film. What was it? It was when the Mad Hatter and then, subsequently, Alice do a truly cringe-worthy little dance near the end of the film. I couldn't believe what I was seeing. I half-expected Britain's Got Talent winners Diversity to pop up in a cameo appearance at this stage and join in with some urban street dancing manoeuvres. That didn't happen. And that is, at least, one saving grace.","user":"Red-Barracuda","rank":[189,292]}]