[{"title":"Enjoyable Flick","rating":7,"date":"10 August 2011","review":"The present rating the move has (5.1) while absolutely understandable, is completely undeserved. I have never ever read a Dylan Dog comic. In fact, I did not even know it was a comic series till a search query told me so.<br><br>I watched the movie without any expectations and it was enjoyable. Like most movies of this genre, it was predictable in most places, but that does not take anything away from the movie.<br><br>It was a nice blend of comedy and horror. In fact, it is more of comedy and very little horror. <br><br>For an easy evening watch (like what I needed) this movie is perfect.","user":"tejaswy-nalam","rank":[27,38]},{"title":"Lameeeee","rating":1,"date":"12 March 2011","review":"I'm a big fan of Dylan Dog, by the way, that is comic book, and the writer or writers of this movie haven't read a single page of it.<br><br>The story is not even close to this and the characters are all wrong presented. One of the most important character is missing, Dylan's sidekick Groucho Marx, who gives whole new dimension to the comic and is one of the reasons why is this comic so great.<br><br>This could be fun for the people who never read Dylan Dog but for us fans, this is desecration of a great comic. I'd rather recommend \"Dellamorte Dellamore\"(Cemetery Man) with Rupert Everett which was written by Tiziano Sclavi, the author of Dylan Dog.<br><br>For fans who like their comics with good stories and not with just \"smash-bash\", and who like supernatural stuff, i recommend you not to waste time with this move but to try to find comic Dylan Dog, and like me, to wait for someone to make a really good movie about Dylan Dog.","user":"chikoglonjo","rank":[148,243]},{"title":"A really enjoyable movie","rating":8,"date":"3 May 2011","review":"Let me first say that 90% of the people who will come to this page should ignore most of the bad reviews for this film. After looking through them, they seem to all have one thing in common - anger that this doesn't seem like a faithful adaptation.<br><br>I'm willing to bet that most of the US audience for this film has never read the Dylan Dog comics, and, like me, had never heard of Dylan Dog before hearing the title of this movie.<br><br>Now, putting aside the negativity that comes from fans of the source material, I think most fans of the genre will like this movie. It is very in the vein of things like Joss Whedons Buffy &amp; Angel as well as sharing some similarities to things like Constantine and the Dresden Files book series. Let's be honest, this is urban fantasy. Most people know if they enjoy the genre or not.<br><br>The film does a decent job of keeping a film noir tone, and using noir tropes to it's advantage. Routh is good as the title character, doing a nice job of trying to be the tired detective without being a weary stereotype. Sam Huntington is great as Marcus, who I think ends up stealing the movie because he really has the lions share of memorable moments.<br><br>Yes, chances are you'll figure out the who done it before the movie reveals it, and you'll figure out impending double crosses from the moment characters are introduced. That's the danger of being a genre film, but it doesn't detract from the fact that the movie is really fun, and very funny in quite a few places.<br><br>If you like things like Buffy, Constantine or Harry Dresden, give this movie a chance cause I think you will probably end up liking it.","user":"gavynhelfyre","rank":[81,132]}]