[{"title":"The latest of two versions","rating":7,"date":"11 April 2010","review":"This is an entertaining film version of The Runaways story. I say version because there is another film on this band called \"Edgeplay,\" which complements this movie perfectly. Essentially, \"The Runaways\" is Joan Jett's and Cherie Currie's version of things. In \"Edgeplay,\" which is a documentary, the rest of the band has its say.<br><br>But let's discuss \"The Runaways.\" <br><br>Kristen Stewart's portrayal of Jett is phenomenal. She's got the slouchy guitar playing, the gum chewing, the swagger and the foggy voice nailed. Jett is all girl and quite pretty, but she's always had the manner of a boy. Stewart gets it right. She is not just twitchy Bella, for sure.<br><br>If you've ever seen the real Kim Fowley (you can on YouTube), you will see that Michael's Shannon's portrayal of him is not at all over the top. In fact, many who knew him would probably say this depiction is too forgiving to the bizarre monster Fowley really was.<br><br>Dakota Fanning acquits herself well as Currie, the band's sexpot singer. The movie gives Currie the only family backstory, probably because the movie is based on her memoir \"Neon Angel.\" It would have been interesting to see Jett's back story depicted. The movie might leave you thinking she's a native Californian, but she didn't move there with her family until she was a teenager. She was born in Philadelphia and spent her childhood in Maryland.<br><br>Some may question things that happen in this movie. Did they really write \"Cherry Bomb\" on the spot for Currie's audition? Did Fowley really teach the girls to dodge garbage thrown at them on stage? Did the Japanese really go THAT apesh*t over the band? <br><br>Yes to all. Watch \"Edgeplay,\" where these and other facts about the band are discussed by the girls (now women in their forties) themselves in 2004. (The doc is available for instant viewing on Netflix.) This movie was made by Vicki Blue, one of the band's bass players (the actual band went through five bassists, which is why the bass player in \"The Runaways\" is a fictional creation called \"Robin\").<br><br>I have my gripes with \"Edgeplay,\" mostly about the jittery camera-work, which I guess is supposed to be edgy, but is just pretentious and annoying. But it is the truth behind the \"truth.\" \"The Runaways\" makes no mention of Currie's abortion while in the band or bass player Jackie Fox's suicide attempt. In \"Edgeplay,\" Fox, now a lawyer, even displays the scar on her wrist. \"The Runaways\" makes clear that these teenage girls fought. \"Edgeplay\" gets into why. In the doc, it is also stated openly that some of them were having sex with each other (and it wasn't just Jett and Currie). Hey, it was the Seventies.<br><br>Joan Jett declined to participate in \"Edgeplay,\" despite the fact she is portrayed in a mostly positive light as perhaps the most ambitious, talented and level-headed member of the band. I was a bit shocked that at the end of \"The Runaways\" when you get the obligatory \"what happened to them\" text on the screen, only Jett, Currie and Fowley are mentioned.<br><br>The most shameful omission here is the tragic Sandy West, the band's doggedly devoted drummer and perhaps the best female drummer in the history of rock (well, maybe until the Go Go's Gina Schock arrived). She and Jett essentially started the band, as shown in \"The Runaways.\" Her history after the band broke up is sad. She was reduced to construction work. Her post-band life was one of drug using, drug dealing, guns and jail. She died of cancer in 2006, but in \"Edgeplay\" you can see her two years before her death discussing the breakup of the band, which clearly broke her heart. She never recovered.<br><br>It is also wrong to ignore Lita Ford's post-Runaways modest success as a solo rock artist. She's also the most entertaining interviewee in \"Edgeplay.\" <br><br>All in all, I have praise for both movies. Both are candid portrayals of the first all-girl band in rock history, paving the way for the Go Go's, L7, Bikini Kill and, perhaps the most talented of all, Sleater-Kinney, a band that has also broken up, but in a much more friendly way.<br><br>You go, girl rockers!","user":"dave-sturm","rank":[151,170]},{"title":"Inappropriate and in your face. The way any movie about The Runaways should be.","rating":8,"date":"20 July 2010","review":"\"You hear that? That's the sound of hormones raging.\"<br><br>The Runaways is at the opposite end of the spectrum from most recent music biopics. Where movies like Ray and Walk the Line aim for emotional resonance and creating a connection between an iconic figure and the audience, The Runaways is about style, dramatics, and looking good. Which is pretty in line with what the band was about. The sobriety of those movies I previously mentioned wouldn't have worked for such a hyper- kinetic story as this one. Sure, the movie slows down a bit when the crash and burn sets in, but the focus on style, sound and imagery is never really replaced by anything else. And I mean that as a compliment.&nbsp;<br><br>Michael Shannon didn't really work for me as Kim Fowley, but the movie wasn't really about him, anyway. The five girls playing the group seemed to have an inappropriate amount of fun with their roles, and who wouldn't? You can't help but be impressed by their performances, they play and act like a real band. But no doubt about it, this is Kristin Stewart's (Joan Jett) and and Dakota Fanning's (Cherie Currie) show. They don't let you forget it. Not many actresses their age would have the talent and the balls to take something like this on. They do it, and do it right. I left the movie with a healthy amount of respect for both of them. &nbsp; &nbsp;&nbsp;<br><br>The entire movie plays out like a music video about all the things you would be mortified of seeing your teenage daughter doing, but of course, would make her cool to do. Which makes sense, as the director (Floria Sigismondi) is best known for directing music videos. The cinematography gleefully sells the same excess, ego, and intoxication that the Runaways' image did. All the band's songs that are woven throughout the movie keep it moving at a super-charged pace.&nbsp;<br><br>You have to tailor the tone of a film to its subject matter, in order for it to be successful. The Runaways is the true(ish), female version of sex, drugs, and rock &amp; roll, and I couldn't help but really enjoy every bawdy and inappropriate minute of it. Get in a Runaways frame of mind, or don't even bother with this one.","user":"lewiskendell","rank":[62,79]},{"title":"The Runaways (2010) **1/2","rating":6,"date":"21 March 2010","review":"I became a huge fan of Joan Jett with her first #1 single, I LOVE ROCK N ROLL, back in 1982. For years I remained a devoted follower of her albums, saw her in concert up close at small venues, and even got to meet her in person on a few occasions including getting to go backstage after a gig in 1985. It was only once she'd become popular that I discovered that she was originally in an all-girl rock band called The Runaways. Thus I found myself going back and collecting Runaways records too. So for me, this film was something to look forward to.<br><br>As Jett has confirmed in interviews, THE RUNAWAYS is mainly true, but there are some artistic liberties taken. The now-51, black-haired rock veteran stayed on the set so young Kristen Stewart (who portrays a teenaged Joan) could observe her movements and ticks, and also to make sure the story stayed somewhat in the right ballpark. The movie begins in 1975 and chronicles Joan's early years as a die-hard rock and roll chick with a rebellious nature who learns to play guitar and wants to form a hardcore, all-girl rock band (\"No guys!\" she insists). She stumbles upon the eccentric record producer Kim Fowley (a faithful rendering by Michael Shannon) who likes Jett's cool spunk and determination, but is more struck with the seedy possibilities of exploiting an orgasmic teenage girl band with guitars (\"Jail-F'ing-Bait!\" he exclaims with glee, pumping his fist). Together, Jett and Fowley seek out other band members. They comb the dark nightclubs where loud vintage '70s music by artists like David Bowie plays, for a blonde girl with just the right look to function as the lead singer for their group. It's there that they discover 15-year-old Cherie Currie (Dakota Fanning), who's not far removed from her first period and who is desperate to become a singer. The Runaways are formed with Cherie up front possessing no strong rock chops, but getting pushed by Fowley and Jett to vocalize and gyrate like a slut having an orgasm. The girls practice enough to eventually get signed by Mercury Records and take off on a trip to Japan by 1977, which was the only place they struck it big, almost becoming as huge as The Beatles there. As many familiar rock and roll stories go, Currie becomes absorbed in the drug world and ultimately tensions mount within the group.<br><br>THE RUNAWAYS was partly based on Currie's autobiography, and in a way she is the focal point of the story. Dakota Fanning does a pretty decent job handling this type of slimy material, considering she was only 15 herself during filming. It's too bad though that her character is just not that interesting and, for me, young Dakota never quite captured the presence of the real Cherie onstage. I'm admittedly more biased toward Joan Jett, but it's Jett's driving persona which is the most compelling ingredient of the film. I was concerned Kristen Stewart might think that sporting a dyed black haircut would be enough to become Joan Jett, but she actually nailed the aggressive nuances of Jett perfectly. Joan is portrayed as the one member in the film who treats the band seriously, loves and breathes the experience, is committed and tireless. It's a small wonder she had such a successful and long-running solo career after the group disbanded. And Kristen's singing just blew me away -- both Stewart and Fanning sang for the movie -- and Stewart sounds exactly like Jett as she belts out part of one of Joan's original early songs, \"I Love Playin With Fire\". Unfortunately, the movie only gets to see one song rendered in its entirety: \"Cherry Bomb\" (sung by Dakota), which was considered the band's only \"hit\", and was co-written by Fowley and Jett, specifically for Cherie to learn and sing. The rest of the soundtrack is pretty good, with background songs by Bowie, Iggy Pop, the Sex Pistols, and even the real Runaways themselves. As someone familiar with the original Runaways recordings, it was fun for me to pick them out in snippets here and there.<br><br>The problems I had which kept me from giving the film three stars were that this isn't really anything we haven't seen before, and it's something of a typical cookie cutter rock screenplay with no soul other than the determined presence of Jett. Really unfortunate was that the other three female band members were largely ignored. Not so much drummer Sandy West (who died of lung cancer in 2006); she gets a few lines and respectful moments. But lead guitarist Lita Ford (who had some fleeting success of her own in the '80s) was strategically left out of the action because in real life she and Joan Jett's camp have undergone some personal problems (Ford says Jett's longtime manager Kenny Laguna \"disgustingly\" offered to buy Ford's life story for a thousand bucks). Reportedly, Lita has threatened to sue if not portrayed accurately in the film. While she is largely disregarded, there are moments in the movie in which Ford (played by Scout Taylor-Compton of Rob Zombie's HALLOWEEN) completely comes off as a whining bitch. Most outlandish is that real-life bass player Jackie Fox was completely written out and is now replaced by a totally fictitious character called \"Robin\" (Fox is a lawyer today, so one may assume the filmmakers weren't taking any chances). In 2004, one-time Runaway Vicki Blue made a documentary called EDGEPLAY which is worth seeking out for the real dirt about The Runaways. Joan Jett refused to participate in that project, but it's got recollections from Lita Ford, Jackie Fox, and Sandy West. It makes a good companion piece to this film, and doesn't pull punches. I had some fun with THE RUNAWAYS, but it's something of a watered down version of what actually happened and could have been a bit tougher and more dramatic. **1/2 out of ****","user":"JoeKarlosi","rank":[85,118]}]