[{"title":"Eddie Murphy did a better Hercules than this","rating":9,"date":"9 January 2014","review":"Let me start off by saying I am a huge fantasy fan. I can usually enjoy any swords and sorcery type film and find something good about it. Now let me say Wow this movie was bad. I mean I thought this kind of clumsy, lowest common denominator filmmaking died in the 80's. It is bad when I asked the organizer to give me a refund on a free prescreening.<br><br>Where to begin? I don't expect much in this type of movie in terms of plot or characterization. In action \"porn\" like this, the plot is usually just barely coherent enough to move from one action sequence to the next and the characters are as black and white as a chessboard. This movie somehow delivers LESS than that.<br><br>It is staggering to me that with a mythology as rich and engaging to draw from, they choose a tired rehashing of Gladiator as the main focus of the film. No doubt holding the more interesting material back for future sequels. The laughable love story is unengaging, poorly scripted and given far too much screen time.<br><br>What really disappoints is the action sequences. Hercules is supposed to be a demigod that achieves the impossible; the movie portrays none of this. It wastes a good deal of time with a clumsy mix of fighting scenes in which Hercules is repeatedly captured and/or defeated. WTF? It is only towards the end that an attempt is made to show Hercules as he should be seen, but I had tuned out long before then. <br><br>Oddly enough, the blood and gore in this film is kept to a minimum, probably to keep it at PG-13 in hopes of duping the largest possible audience to drop money on it. It would have really benefited from a Conan-esque level of violence to give the movie more weight and better directed action sequences. The dramatic pause in the middle of the action (made famous in the movie 300) is in every single action sequence. <br><br>I really don't know what I recommend from this film. Everything in the movie has been done better in other films. I hope this film tanks but I doubt it. It will make a profit and encourage more of the same I'm sure.","user":"drojan","rank":[284,330]},{"title":"The Gods are not pleased...","rating":1,"date":"12 January 2014","review":"The Legend of Hercules is one of two Hercules movies in 2014, the other one is set for release in July starring Dwayne Johnson and Directed by Brett Ratner. And I gotta say, after seeing this movie, I'm really looking forward to the Brett Ratner version, and that's saying something. <br><br>Where do I begin? The acting is hilariously awful (Kellan Lutz and the villains especially). The romance is laughable. The fight scenes are a total rip off of 300 and Gladiator, with obnoxious slow-mo being used every 10 seconds. And for a movie with a budget of $70 million, it looks cheap.<br><br>The Legend of Hercules has some of the worst production values I've ever seen in a film. The costumes look noticeably cheap, The props are low rent, The green screen effects are amateurish. The 3D conversion is even worse. And the CGI looks worse than an Asylum movie.<br><br>Final Verdict: Unless you're watching for a cheap laugh, you should avoid this stinker like the plague.","user":"rileyjustin306","rank":[260,324]},{"title":"Unbelievably Awful","rating":1,"date":"14 January 2014","review":"It is absolutely shocking that this movie came out in today's market. The dialog was horrible: cliché and predictable. The entire film was, in fact, predictable. We saw the previews, we went to the film, and about ten minutes in we knew it was bad. We gave it a chance, hoping it would get better, that it would redeem itself in some way. It did not. It got worse. If you are just looking for an entertaining film, this is a major disappointment, to say the least. Obvious special effects, slow motion for every other move in every fight scene, and terrible, I mean tragic, dialog. If you are a fan of Greek mythology, it's downright offensive. Don't waste your time or your money.","user":"arlenlanglois","rank":[134,166]}]