[{"title":"Refreshingly silly & fun","rating":8,"date":"10 January 2020","review":"Remember when movies were fun and didn't preach present day politics with varying degrees of woke narratives? I didn't mind it at first, but eventually it became the norm. Crafting a story filled with fun likable characters seemed to be a chore and a burden to get through, after peppering social messages throughout.<br><br>By simply having a story that stays away from that made this movie refreshing and delightful. Every one of the diverse cast of characters were likeable and fun &amp; the story was simple escapism reminding me of teen comedies of the early 2000s.<br><br>Yes the story is silly but it's well acted and all the cast has good chemistry together. I'll be following them all in the future.","user":"eboogyman2","rank":[23,33]},{"title":"Great film if you want to kill time, funny and supernatural.","rating":8,"date":"10 January 2020","review":"Acting is good. Practical Effects are good.\nBeen a while since I've seen a film like this so it was really nice to come back to this genre. As I said everything is good, not great but good. If you have nothing else to watch throw this one, you'll have a good time. Dumb fun.","user":"thefastestweeb","rank":[13,19]},{"title":"Like a kebab when you're drunk, Scrumptious.","rating":6,"date":"13 January 2020","review":"I honestly don't know why this doesn't get more love. I thought the cast were perfect, the cinematography and clever use of direction was superb (a word there I've used maybe 3 times in my life) and the plot plays out fantastically well.<br><br>OK sure, the story is actually a bit basic, and the second half completely ruins the pace of the film but, it works for a film that doesn't take itself seriously and the 'monsters' were a bit \"meh\" but still, this is a film driven by the characters rather than the creatures.<br><br>I love it. I also now love Mary Nepi. Mary Call me.<br><br>Note: I'll also accept marriage from Halle Berry. Just in case.","user":"donttouchmeprimate","rank":[7,9]}]