[{"title":"8.1 - Are you kidding me??","rating":17,"date":"17 October 2011","review":"OK the only reason I write this review is because of the Rating here on this site. Normally I find the ratings on IMDb very reliable. Most of the time it is a good tool to differentiate good movies from crappy ones and the ratings correlate with my own taste in general. So i tend so sometimes watch movies which got a good rating on IMDb although they wouldn't appeal to me otherwise. And very often I had a pleasant surprise and found really good flicks that I wouldn't even have noticed otherwise. Not in this case. At the time I'm writing this the movie has a rating of 8.1 which is already very very good if you consider that classics like Gone with the wind or Good Will Hunting are rated equally high. So I decided to watch it solely because of the good rating and was extremely disappointed to have wasted about 90 minutes on this piece of garbage. It is a mediocre movie at the very best and I wouldn't even go that far. I have no idea how such a flick can get an 8.1. Maybe all the actors and their their entire families gave it a 10. I don't know and I don't care. My only motivation to deal with this movie a little longer than the 90 minutes it lasted is to prevent others from making the same mistake I did. So here is my review that says everything there is to say about this flick: THIS IS NOT A GOOD MOVIE. STORY AND ACTING ARE WAY BELOW AVERAGE. ITS NOT FUNNY OR VERY ENTERTAINING AND THE RATING OF 8.1 IS COMPLETELY UNDESERVED!","user":"derhonk01","rank":[37,60]},{"title":"Teen comedy slightly over the average...","rating":5,"date":"16 November 2011","review":"\"Mardi Gras: Spring Break\" seemed to be yet another of those mass-produced teen comedies with movie covers that all look scarily similar to one another. Despite that, I decided to sit down and watch the movie.<br><br>Having seen it now, it was not as I had initially thought it to be. The movie was actually enjoyable and had a good enough storyline, though there wasn't anything new to be seen here.<br><br>There were moments in the movie where I was laughing, especially the scene in the hotel with the over-sized turd. That had me laughing so hard.<br><br>The people they had cast for the movie were actually doing quite well. Nicholas D'Agosto (playing Mike), Josh Gad (playing Bump) and Bret Harrison (playing Scottie) were having great comedy on the screen and they worked well together. It was nice to see Regina Hall (playing Ann Marie) in the movie, despite it was only for a small supporting role. Of course the name to look at in this movie was Carmen Electra (playing herself). Now, I can't say that I am a fan of her in any way, so I didn't think it was a big deal to see her in the movie. One guy that cracked me up in the movie was Charles Shaughnessy (playing Barry, the Château Clerk), he was hilarious in that role.<br><br>\"Mardi Gras: Spring Break\" provided good enough entertainment for an evening's worth, but I doubt that it is a movie that I will ever make a second return to watch. It was funny at moments, but the movie was not making an overly lasting impression.<br><br>If you got no other plans and want to see a comedy, \"Mardi Gras: Spring Break\" is well worth a watch, if you have no other movie choices at hand.","user":"paul_haakonsen","rank":[13,21]},{"title":"Some funny bits, but this goes absolutely nowhere...","rating":4,"date":"8 February 2016","review":"\"Mardi Gras\" makes the audacious choice of putting its worst scene at the beginning: you know how sex comedies have to start with a big set piece, one huge laugh that pulls you in and never lets you go? Well, \"Mardi Gras\" starts with an elderly couple we'll never see again remembering their first Mardi Gras, which very predictably turns into an overly explicit conversation about sex. I've seen and heard some horrid things in this subgenre, but an elderly woman literally just describing how her husband ejaculated on her breasts, without an actual joke in sight? Not how you lure me in. It's only like a thirty- second vignette, but it easily feels like thirty minutes. Who writes this and honestly thinks he's struck gold? Oh, we'll get two elderly actors and write some sex-related words on a napkin, maybe it'll be funny by accident. It won't.<br><br>I'm glad to say that's the only cringe-inducing scene in the movie, it doesn't have laugh-out-loud moments but I got through it fairly well. \"Mardi Gras\" is hurt though by the fact that its plot just hobbles along. It starts of with two losers who can't get a girlfriend (not saying \"boobs\" in every sentence could help), then they turn on the TV and it's a report on Mardi Gras in New Orleans. So uh...let's go to Mardi Gras in New Orleans! If that's all the effort you're going to do to set this up, why not just start the movie at Mardi Gras? The lack of stakes also makes it difficult to connect: Bret Harrison was a believable nerd in \"Grounded For Life\", but even there he got the girl fairly quickly. We're honestly supposed to buy him as a desperate, 25-year-old virgin? Would have made a lot more sense to reserve that subplot for the obese friend who's desperately trying to be Jonah Hill. The movie quickly deteriorates into a collection of barely related sketches, which are occasionally good for a chuckle but never add anything to the meager story.<br><br>There is a saving grace though: Nicholas D'Agosto and Arielle Kebbel have a very natural style in their acting, and though their story is highly predictable it didn't really bother me. They both have likable characters, which is kind of a rarity in \"American Pie\" rip- offs. Hell, most of them don't even have characters. They really have great chemistry, I wish the movie didn't waste that much time in Carmen Electra's (does she ever refuse a role?) hotel room or showing not Jonah Hill naked. Come on not Jonah Hill, I'm trying to have popcorn here. \"Mardi Gras\" isn't a great movie, but it's not a completely brainless sex comedy either.","user":"Sandcooler","rank":[2,2]}]