[{"title":"Not as bad as the usual junk AND with some historical background.","rating":6,"date":"18 February 2020","review":"There is nothing particularly special or surprising about THE JACK IN THE BOX recently released from the UK. You can pretty much tell what you're going to get within the first few minutes.<br><br>In short, there is a supernatural Jack-in-the-Box toy, together with a collection of supernatural rules that govern it, that if you pop it open you give the demon associated with it access to our world and it goes on a killing spree. In a 2 for 1, there is a rather disturbing-looking toy clown within the box that pops up when you turn the crank together with a full-size demonic-looking clown that sort of appears near the box that does the actual damage to the collection of victims. As a viewer, you're supposed to understand that the demon is coming out of the box based on the fact that you see a demonic hand coming OUT of the opening occasionally and a victim's hand disappearing INTO the opening, also occasionally.<br><br>The person that releases the demon can't be killed by the demon (keep track of these rules; will be a test at the end of the week), although the demon does bash him around pretty good just for fun, but everyone else is fair game for recreational killing. And there is a ritual the box opener can perform to trap the demon inside the box, and if you can prevent the box from being opened (after successfully performing the ritual) for the number of years that equates to the demon's number of victims times 3, (and there's a very handy and convenient counter on top of the box to help you keep track...) then the demon is fully kaput.<br><br>Outside of the ritual, the box is indestructible and can move itself around and blah blah blah. And of course nobody believes anybody who tries to warn anyone of the dangers of the demon Jack-in-the-Box problem.<br><br>No real origin information is given during the movie, and rather unusually we are told that it's one of \"natures creations\" and is therefore mortal, so there that is for what it's worth. A local \"expert in demonology\" seems to talk about them as if they're a fairly common, pesky annoyance, like having moles; the demonologist speaks of them almost exclusively in the plural.<br><br>To wrap things up at the end, there's the obligatory conclusion where we THINK we've got the demon trapped but SURPRISE! the trapping ritual was not properly performed and we wrap up the picture with the literary door left open for a sequel... you know, in case this one made money.<br><br>On the positive side, while THE JACK IN THE BOX is not exactly of inspirationally high quality, it's maybe 15% or 20% better overall than the complete junker you would EXPECT it to be. The acting is a touch better, the box and doll execution is up a bit, music is better, the overall sound and other production values are not completely appalling, and so on. You won't write any term papers on it but it won't kill you to watch it, either.<br><br>On an interesting note, out here in the real world, the whole Jack-in-the-Box \"thang\" has some history behind it. If you look up Jack-in-the-Box on Wikipedia you'll find it apparently has French origins and the French refer to them as \"diable en boîte\" which translates as \"devil in a box\" together with some other enlightening background information as to how the Jack-in-the-Box toy came to be and become popular, AND it's demon-related. It's worth reading. And it makes this movie a bit more interesting in terms of its background.<br><br>If you are into supernatural horror and are willing to keep your expectations appropriately low, I'd say it's worth seeing. Not the best moviegoing experience and it didn't strike me as particularly terrifying unless you've got your own personal hangups about clowns as some people do, but somebody did care enough to try to do a good job where they easily could have turned out a real piece of junk.<br><br>I gave the movie a 6/10 which probably requires a word of explanation: I rate movies based on 1) how close the movie subjectively came to being the movie its makers intended to be and 2) how well does it rate against other movies of its genre. THE JACK IN THE BOX I think came reasonably close to being the movie its makers intended to be, but it doesn't seem to be a real standout within its supernatural horror genre. For me, it subjectively averaged out to about a 6. The only real difficulty I had with the movie was the affected, poncy movements of the demon in his efforts to look \"otherworldly\"... or something.","user":"S_Soma","rank":[5,6]},{"title":"I genuinely enjoyed it","rating":10,"date":"23 February 2020","review":"Get over the leads \"American\" accent. Pretend he just sounds different and it's OK. The Jack was creepy, which is what you want and need. The story is good, simple, small and to the point. Although relatively predictable, it's still a great watch, and entertaining. All I would like is a bit more gore and suspence.","user":"glorificus_is","rank":[5,7]},{"title":"Not awful","rating":3,"date":"18 February 2020","review":"I'm always looking for something to watch because I'm not interested in the TV offerings like 'Love Island' and similar. This wasn't too bad, actually. A hundred times better than a couple of others I've had the misfortune to choose and pay for in the last couple of days. A new concept in horror (well, I've not seen a Jack in the Box horror before) and not badly done. The ending was completely foreseeable and actually foreshadowed in the dialogue, so that was predictable. But not dreadful.","user":"clairesmaybin","rank":[4,8]}]