[{"title":"Costner's Charisma and a Couple of Sharp Jabs at Dems and Republicans","rating":8,"date":"3 August 2008","review":"\"Swing Vote\" is a good movie. It could have been great, but it isn't, but it is still good. At its best, it invokes Frank Capra's classic films on politics, including \"Meet John Doe\" and \"Mr. Smith Goes to Washington.\" It never reaches their level, though, and that failure to hit the top is a bit frustrating.<br><br>An older, dumpier, and shabbier Kevin Costner is the best part of the film. Costner is a star and that shows here. Even the grunge that is his costume in almost every scene can't disguise his charisma. Costner's voice has not aged and he uses it to great effect, especially in a final speech.<br><br>The film draws laughs by parodying our two major political parties, with a Democratic presidential candidate starring in the funniest anti-abortion TV commercial ever made (no doubt its competition was slim, but it is very funny) and a Republican presidential candidate touting his party's tender concern for the environment.<br><br>These excellent scenes make you wish that the movie had gone deeper. It doesn't, though. It veers off into dead-end soap opera subplots about Costner's daughter's boyfriend from school and her attempt to live with her estranged mother (Mare Winningham, in a role that should have ended up on the editing room floor, as it contributes nothing to the film.) The casting wasn't great. The two presidential candidates and their aids end up being cardboard cut-out stereotypes of Machiavellian evil (Stanley Tucci) and compromise (Nathan Lane). Kelsey Grammar and Dennis Hopper, as the candidates, never transcend their \"Frasier\" and \"Easy Rider\" personas. Other actors, perhaps unknowns, should have been cast in these two key roles.<br><br>Paula Patton, the woman who played what would have been the Barbara Stanwyck role in the Frank Capra movie, was pretty as a little doll and a complete bore. This is part of a pattern in today's Hollywood; female leads must have the perfectly perky looks of a plastic doll; there's no need for them to be talented. Male leads, like Costner, can be beat-up, and slovenly, but must be talented. Patton's role, that of the desperate, sharp, female reporter who gains inside knowledge of a national story, is underwritten, and she does nothing with it. It's a dead-end, and that's a shame. It makes me want to rewatch \"Meet John Doe\" in which Stanwyck worked so well as the female reporter.<br><br>Overall, though, this movie is better than much else at the multiplex, and it at least ventures into the world of ideas.","user":"Danusha_Goska","rank":[41,50]},{"title":"Costner is charming","rating":7,"date":"2 August 2008","review":"Kevin Costner is adorable as the slacker father of a overachieving, 12-year-old daughter. The kid-as-parent/parent-as-kid premise wouldn't have worked nearly as well if Costner's character, Bud Johnson, weren't so darn lovable. If you're looking for perfectly coiffed, cleaned up Costner, you won't find him here. He mostly looks like your husband first thing in the morning -- you know, the scruffy hair, unshaven face, and glazed over, half-asleep look where you wonder what you ever saw in him? But inside is a heart of gold? He pulls this role off to perfection. He's the lovable underachiever always with a clueless grin.<br><br>When the attorney general shows up at his door to tell him basically that he has the deciding vote, Bud's only comment, in a half-whisper is, \"Does this mean I'm going to have to do jury duty?\" The movie is good -- in fact if you like Dave with Kevin Kline, you'll like Swing Vote.<br><br>However, it tried to combine two movies. One was the comedy with Bud being the ONLY voting demographic needing to be catered to -- hence, personal appearances by Richard Petty and Willie Nelson -- the other was a sometimes hard-to-watch story of a daughter, played by Madeline Carroll, caring for her alcoholic father.<br><br>Carroll is a wonderful actress, and would be stellar in a drama. Her wistful, knowing looks at her father's helplessness, and her astute understanding of her mother's inability to be a mother were heart-wrenching. That could have been an entire story in itself and often took away from the comic elements. Mare Winningham was fantastic as the mother who ran away. She, Costner and Carroll really clicked on screen in their one scene together as a family torn apart by the selfish indulgence of the parents to the detriment of the child who deserves more. I marveled at that scene until I remembered that Winningham and Costner were in the movie \"The War\" as parents torn apart by Vietnam to the detriment of their son, young Elijah Wood. Costner and Winningham should get together again in a more upbeat film. Their relationship is very natural.<br><br>But in spite of the sad, child-having-to-be-the-adult part of Swing Vote, it was 80% comedy, and Costner's antics made it laugh out loud funny at times. It didn't seem to be politically bent one way or the other. It was patriotic and commented on immigrants from Mexico taking away jobs from Americans. But it was also pro-environment and touched on lack of health care for the many. The end was pure feel-good. Everyone changed appropriately, realizing the true (Hollywood) meaning of voting in America.","user":"ohioblue-1","rank":[50,62]},{"title":"Great movie for those who like old-fashioned comedy","rating":9,"date":"8 August 2008","review":"My son tells me that I don't understand what young people think is funny. And he's right. I'm not into cringe comedies like Borat or teen sex comedies like Superbad. So when I give Swing Vote 9 out of 10, I guess I have to limit my recommendation to those over 50. If you're too young to remember Kevin Costner's last great movie, I'm not so sure you'll like this one. You see, no one gets humiliated and you don't hear any jokes about sex or bodily functions. It's an old-fashioned comedy that my wife, my cousin and I, all near 60, loved. If you are in that age range, ignore the critics and the IMDb rating. We laughed all the way through. The editing is fast paced so that you never get bored. Some critics have criticized Swing Vote for being lightweight, but it is really more dramedy than straight comedy. There are several serious themes including divorce and civic responsibility. This is Costner's best performance in many years. And Madeline Carroll, who plays his daughter, is amazing. Watch out, Dakota Fanning and Abigail Breslin. This girl can play comedy and drama with equal aplomb. The scene where she cries in front of her class brought many to tears in our audience.","user":"jmc4769","rank":[52,66]}]