[{"title":"As a HUGE Steven Universe fan, I enjoyed it but I'm kinda disappointed","rating":7,"date":"3 September 2019","review":"Now before you get out your pitchforks and torches let me explain... I don't think this movie really brought anything new to the table. We got a new fusion which was great don't get me wrong but a lot of the film was them trying to get there memories back and as a result it felt kind of like a \"Steven Universe Greatest Hits\". the music is wonderful as per SU standard and the animation is brilliant but Spinel's story is really the only new thing here and it comes around and is wrapped up very quickly with no sign of having any effect on the show going forward. Even the town is back to normal by the end. I think it's worth the watch but it's no Change Your Mind where they were paying off 5 seasons of buildup. It's just kind of it's own thing but not at the same time because 80% of it was as I said a sort of recap. I was personally just hoping for something new and we didn't really get it in my eyes.","user":"maxglen","rank":[54,69]},{"title":"A Musical Masterpiece","rating":10,"date":"3 September 2019","review":"It's everything you know about Steven Universe and it's plethora of creative characters and ingenious writing, but stretched to an hour and thirty minutes. Songs that go through various genres, animation that is as smooth as butter and very pleasing to the eyes, important and universal messages &amp; to top it all off the immersive and powerful voice acting. The top moments are the emotional songs and the relatable villain. If you're a fan of the series, story-driven cartoons or anime you will highly enjoy this movie!","user":"SweetSoundP0N3","rank":[36,48]},{"title":"BELIEVE IN STEVEN!","rating":10,"date":"2 September 2019","review":"This movie was just flat-out AMAZING! It followed along with the series finale very well and it brought us the most heartwarming story that Cartoon Network has made in a good while!!!<br><br>While i say that this really ends the Renaissance for Cartoon Network, Steven Universe: The Movie really was an Amazing story filled with Laughter, Drama, Heart and soul. It really made me feel like the show ended off with a great ending and it really is one of those movies that can be described as a fun time!<br><br>Hate to see this show go away. But the movie itself, AWESOME AND AMAZING!!! Cartoon Network needs more material like this instead of Teen Titans GO!<br><br>But take it from a guy who studies animation as an art form, Steven Universe's movie really has my sincere recommendation! I hope that we can all BELIEVE IN STEVEN.........","user":"Bulldog1721","rank":[41,56]}]