[{"title":"Decent Proposal","rating":6,"date":"29 June 2009","review":"Well, if I could split the movie into two, I would say that the first half is a superb Proposal and the second half is fairly traditional Hollywood pablum. In the first half, the wonderful comedic timing and chemistry between Bullock and Reynolds was terrific. The writing was first-rate intellectual, snappy sparring, even throwing in some literary references in the put-downs. Kudos to the Director, Anne Fletcher, and the Screenwriter, Pete Chiarelli.<br><br>The completely different tone in the second half, I surmise, could only be attributed to the studios/producers stepping in and stating that the film must appeal to a wider audience. We, then, get lots of family characters thrown in, with a great reduction of Bullock and Reynolds mutual screen time. And when they do share time in the second half, it's more about slapstick/physical humor (cue studios/producers needing appeal to wider, a.k.a, younger audience). Maudlin music comes in on the soundtrack, letting us know that this part of the movie is supposed to tug on our heartstrings.<br><br>I don't buy the inevitable resolution either. I don't believe that it is supported well or justified by what came before it.<br><br>The 1st 45 minutes is WELL worth seeing. I wish the filmmakers could have pushed and maintained the pace and feel for the entire movie. Reynolds and Bullock are so good, they could be this generation's Tracy and Hepburn. I'd like to see them in another project that follows through all the way.<br><br>BTW, this film was actually shot in Boston and (the Alaska scenes) in Manchester by the Sea and Rockport on the North Shore with digital effects adding snow capped mountains. You might even recognize Motif No.1, a famous small building on a wharf in Rockport which has been the subject of many famous painters' and photographers' work. It was also fun seeing some of my local Boston area acting colleagues doing background work in the film.","user":"jmbellin","rank":[114,140]},{"title":"I am still watching it in 2019!!!","rating":9,"date":"29 November 2019","review":"I love this movie! Predictible of course, as many rom-coms are, but I really love it!!!","user":"monalisa_raluca","rank":[9,9]},{"title":"A fun way to spend an afternoon","rating":7,"date":"24 June 2009","review":"The Proposal isn't going to win any Oscars, nor will it become your favourite movie of all time. However, it does exactly what it is supposed to do; that is to entertain you. The Proposal is the story of a tough editor Margaret Tate (Bullock) who forces her assistant Andrew Tate (Ryan Reynolds) to marry her so she can stay in the U.S. (Interestingly, in the movie Bullock plays a Canadian and Reynolds an American while in real life, the reverse is true). What happens next will not surprise viewers but they will get many laughs along the way. Reynolds and Bullocks are very funny and also very believable. Betty White (from the Golden Girls) almost steals the show as Andrew's 90 year old \"Gammy\". The beautiful Alaskan setting doesn't hurt things either. Overall this is not a unique movie or even a unique role for Bullock but it is a very funny (and fun) way to spend an afternoon.","user":"therunner42","rank":[113,156]}]