[{"title":"Well, I liked it","rating":7,"date":"22 October 2009","review":"Hidden camera is a very well produced action thriller. Actors are good. The idea is complete and you cannot move from your seat. Yeah, I know, all that thing about NorthKorea and the satellites that can show you all the world all the time it's not very well thought. But, at the end, this movie can entertain you for nearly two hours. I was not expecting a Gran Torino.<br><br>I do not understand why this film was not released at least, on DVD. It's a huge production: the first persecution...wow...very good...! With trains and all. There's death, blackmail, technology, nudity, everything. Maybe too much. But there's no more to explain. It's not so bad, believe me.","user":"santiencalidaddeque","rank":[20,20]},{"title":"Spanish DTV fare","rating":3,"date":"5 April 2018","review":"\"Hidden Camera\" stars Dean Cain, who played opposite Denzel Washington in \"Out of Time\" and held his own in a couple of terse verbal exchanges with the Oscar-winning actor. A check of IMDb reveals Cain has 153 acting credits, nearly three times as many as Washington, but most are television roles. Other than \"Rat Race,\" a film my sons enjoy and have watched a dozen times, I haven't seen anything else that Cain has been in, so was interested to see HC. <br><br>The movie is a Spanish DTV production, which seems to evince more negative aspects of both qualifiers than potential positive ones. The budgetary limitations are obvious in the lack of expensive scenes, such as car chases, explosions, martial arts and large crowd scenes. It does have quite a few aerial shots, but they seem to be stock footage. The gun fights seem typical of television productions, although I must admit that I haven't watched broadcast television in over twenty years, so my impressions may be outdated. Perhaps most disappointing is that the film seems to take what foreigners would regard as somewhat exotic locations for granted. James Bond films often feature local carnivals and car chases through picturesque tourist spots. Hong Kong and Bollywood films often feature scenes with hundreds of extras. HC was shot in Barcelona, but feels as if it could have been in any of dozens of cities. On the positive side, most of the shots seem fairly steady, possibly because they were shot with lighter equipment, and the lighting is fairly even, if not evocative. <br><br>The movie suffers from a weak script, which reminds me of a line from \"Kentucky Fried Movie\": \"Klahn has been connected with every sort of nefarious activity. You name it - opium, weapons traffic, assassination, motion picture distribution . . .\" HC has a lot of diverse criminal activities; human trafficking, assassination, robbery, forgery, counterfeiting, official corruption, video voyeurism . . . It seems to occur in some sort of alternate universe, where surveillance cameras are everywhere, scoundrels can retask satellites and novelty spy-cams have optics that rival lenses costing several thousand dollars. It suffers dramatically because Cain's character never needs to expend much effort to find the clues. A memory card is hidden in the first place he looks. People call him with vital clues at convenient moments. The performances weren't bad, but you can't win with a losing hand. <br><br>HC was neither good enough to involve me, nor bad enough to abandon, although I found myself multitasking during some of the scenes.","user":"ginocox-206-336968","rank":[2,4]},{"title":"You see the cast you know it's a tv-movie.","rating":5,"date":"10 March 2019","review":"The story is the best part of this movie, and that's the most important thing about a movie, so for that it was entertaining. But the problem with this tv-movie, and it's obvious in so many ways that's it's a tv-movie, is the acting. There is a reason why Dean Cain and the rest of the cast just appear in low budget movies, their acting skills are just passable. The high tech specifications in Hidden Camera look like they're done with no budget but the story makes up for it as there is a plausible and action filled plot. With a decent budget and a better cast the movie would have been better.","user":"deloudelouvain","rank":[0,1]}]