[{"title":"Even Money sleeps in this movie","rating":3,"date":"24 September 2010","review":"I had high hopes for this film ever since I saw the teaser trailer of Gekko getting released from prison. It has everything you need for success. Iconic characters, interesting subject, good acting and great cinematography. Unfortunately I was greatly disappointed by snooze fest with a meandering story with no focus and some strange \"green\" message.<br><br>The movie starts off trying to set up LeBeouf's characters motivation. But even that is never clear. Is he financially or morally invested in some fusion project or both? Does he want to get his girlfriend and her father back together for her or because he wants a new mentor? Is he a greedy Wall Street guy with great ideas or is he some Eco-warrior trying to change the world? And then there's some half assed revenge plot against some financial tycoon who ends up embodying the entire financial meltdown.<br><br>Through out the film the audience is drug along as these plots come and go. At one point the most important thing to the main character is getting revenge against Brolin's character and ends up working for him. But instead of getting revenge, he try's to get an investor in green technology. When his boss, who's he trying to take down, doesn't invest in the green technology LeBeouf's character breaks down and quits. So he forgets revenge and returns to getting his girlfriend back together with her father Gordon Gekko. At some point Gekko mentions he left his daughter $100 million which, strangely enough, is the exact amount that he wanted his last boss to invest in the green company. So he starts tricking his girlfriend into signing all the money over to her father who has promised to give it to the green company. LeBeouf's character is the only person on Earth who doesn't know that a guy who went to prison for insider trading might not be trust worthy. So surprise, surprise Gekko runs off with the money and we are treated to a ripoff of The Usual Suspects as LeBeouf thinks back to all the situations that showed Gekko is lying. So he goes back to revenge.<br><br>So all of that along with more uncomfortable close ups of a girl crying then I can count, a number of strange transitions and the worst cameo I've ever seen with Charlie Sheen showing up as Bud Fox. He appears out of nowhere for no reason with two girls on his arm acting more like Charlie from Two and a Half Men than Bud Fox.<br><br>All of this happens at a snails pace and makes you wonder if Stone has seen the first film in 20 years. I'm waiting for the sequel to Platoon where we skip the battle scenes and focus on a girl crying and some general who makes weird bird noises after every line.","user":"tdevereaux","rank":[176,208]},{"title":"Great premise spoiled by too many plot points","rating":3,"date":"6 October 2010","review":"The Wall Street Money Never Sleep had a great premise at the beginning - return of great characters from the original and very interesting subject matter (worst financial and economical crisis since the World War II). While the movie succeeds in taking us through the financial crisis as it gradually unfolded, it is constantly dragged down by way too many plot points, but mainly the hardly believable revenge and very slow paced love story subplots.<br><br>Let's get one thing clear at the beginning first. It is an immensely difficult task for the writers to portray the financial crisis into a movie for general masses, while explaining the workings of the crisis, not bogging down the viewers with too much financial jargon and at the same time keep the movie entertaining. This is the part that you can see the makers have made their homework and is something to be appreciated about the movie, such as the Bear Sterns inspired collapse of Keller Zabel.<br><br>My biggest problem with the movie is that the character with the most screen time, Jacob Moore, is not a believable character. It might be due to casting Shia LeBouf, who for one looks too young and too soft to be earning $1.5m bonuses and living in a $6m apartment. Second, he is a \"prop trader,\" which means that his job is to constantly trade stocks on his company's account. Yet, we see him trying to raise $100m for a renewable energy source, which isn't the job of prop traders. Even he is pitching the idea to Chinese investors, which is nonsense, since he would have had nothing to say about the company unless he was an equity analyst responsible for the energy sector. This brings the obvious question, why was he so interested in the little fusion plant project? His job is to make money not save the world.<br><br>And than there are the inconsistencies and plot holes: At the beginning of the movie Jacob invests $1m from his bonus on 50% margin into his firm Keller Zabel and keeps his position even as the stock is plummeting putting him into sizeable amount of debt (film hinted $0.5 mil). Now, first firms usually prohibit employees on speculating on their own stock due to the possibility of having insider information and second if Jacob was such an excellent prop trader he wouldn't have touched the stock if there were rumors of its impending collapse. This alone is hardly believable and our intelligence is assaulted again when the film somehow forgets his debt (before he even admits the debt when proposing to his girlfriend), when he writes his mom a check for $200,000 without a second thought.<br><br>Jacob spreads rumors about an African oil rig being nationalized in which Bretton's company has a big stake, which ended up costing the company millions. And Gekko ends up explaining to Jacob that it was illegal because he pushed other people to make traders based on false information, so Jacob realizes that the two are alike. How can a Wall Street rainmaker such as Jacob not realize that he manipulated the markets, which is illegal? <br><br>Other problems: Gekko's London hedge fund growing from $100 mil to $1.1 bil during Winney's pregnancy? At one point, we saw workers dismantling the fusion plant, would it have been too little too late to give the $100m to an empty factory site?<br><br>To conclude, this is a revenge and redemption movie with Wall Street and market crash as a backdrop. If they had cut down the crying-girl scenes, to improve pacing, maybe it could have turned out better. This way, it's just plain bad.","user":"peter-vidlicka","rank":[57,69]},{"title":"It diminishes it's excellent predecessor","rating":4,"date":"16 January 2011","review":"I have mentioned before that director Oliver Stone seriously thought about retiring after Natural Born Killers. That movie took so much out of him (and I think the previous JFK did also in the aftermath of that film), that he said: \"I don't think I have another one in me\". At that time I thought he was crazy. But looking back at what he has made since NBK. Maybe not Stone's new film has 3 maybe 4 good scenes and all of them were in the trailer. The scenes of the release of Gekko are well done and set up for a nice premise. But it all just falls apart. Or it really never gets going. Wall Street: Money Never Sleeps fits perfectly in the new Oliver Stone trend. Before 1994, his films were raw, edgy and a little rebellious. World Trade Center, W. and Wall Street 2 all have the appearance of politically engaging or hard-hitting films. But they are not. Tame would be an understatement. Pleasing would be better. Oliver Stone has lost his will to fight. He's got bills (probably a big house, swimming pool, alimony and stuff). He just wants a job and please the studio and the audience. It almost looks like he doesn't want much hassle with his films after they come out.<br><br>Wall Street 2 is such a disappointment I don't know where to start. Maybe the biggest let down was in the smallest amount of celluloid: the cameo of Charlie Sheen as Bud Fox. His character Fox was a character we could relate to. Especially in his scene with his father Martin Sheen. But his cameo was so wrong, so out of place, so not Bud Fox, it diminishes the entire first movie. Bud Fox is now Charlie from Two and a Half Man.<br><br>Let me go on with the characters: The successor of Bud Fox is now Jake Moore, a kid who doesn't blink when he gets a 1.5 million dollar bonus. Off course, in the banking industry this is normal. So, it is authentic that Jake doesn't flinch. His girlfriend has an Iphone, does something with a website but other then that they really don't have to work for a living seeing the house they live in. Live really has no challenges left for these two. So maybe that why Jake has such a hard on for his 'Green Project'. But I'm just guessing here. Bud Fox wanted to be filthy rich, he wanted to be a player. Jake Moore doesn't want anything. And we should watch for him for 2 somewhat hours Josh Brolin, the actor with the single most dangerous look in Hollywood, comes off as such a whiny boy. You do not believe he is the successor of Gordon Gekko. One or two times Shia LaBoeuf's character Jake Moore went head to head with Brolin and I couldn't help but think: \"This is so unbelievable. Brolin's character should clock this spoiled brat right on the nose\". If anyone can tell me what value or what message I should take from the motorcycle-scene: you can e-mail me.<br><br>Wall Street: Money Never Sleeps misses edge, a believable script and ditto characters. It is a missed opportunity at best, and a total failure if I am really honest. It demises it's classic predecessor, has a weak script where the cutthroat mentality in the banking industry is played out in such a cliché manner. Josh Brolin is grossly underused. Shia LaBoeuf is overplayed, because he's not that great an actor. Not as a serious adult anyway. But that's Stone's fault. Charlie Sheen isn't a great actor, but 20 years ago Stone could direct him in a way that made him believable. That Oliver Stone is no more, as you can see with the awful cameo of Sheen. The problem for this sequel is that it totally diminishes the first film. It takes all the good things from the first film and throws it out. What's left is chewed up, spit out and rehashed. Money never sleeps, but the audience does.","user":"supah79","rank":[45,55]}]