[{"title":"Bravo!","rating":10,"date":"11 April 2014","review":"Never ceases to amaze me how a movie can move an audience in polar opposite ways. It's probably the expectations - so if you go in to have some escapist fun, action and swordplay, you won't be disappointed.<br><br>So, why will I be happy to rewatch this grossly underrated movie that's avoided me for the first four years of its life tsk tsk: a simple story combining the Seven Samurai and Silas Marner (kinda), intoxicating mix of humor, gorgeous grotesqueness and visual splendour . . . and a love story that did not force itself on the surreal action thread.<br><br>One of the hallmarks of a good film has to be how much love a writer director puts into the details and in this, it is clear Lee Sngmoo has nurtured this baby for a while: superb production, lovely setups and payoffs.<br><br>Oh, make my decade and give us a sequel already!<br><br>Amazing for a first time director. Bravo! Bravo!","user":"Woonerism","rank":[32,35]},{"title":"One word to describe this movie is WOW","rating":10,"date":"24 March 2015","review":"I am so late in watching this movie - had never heard of it before - but I came across the trailer of it in you-tube last night and had to watch it. This movie has a great balance between cowboy/samurai - great character development, great story telling, very good actors (some were over the top but in a good way), and some of the best choreography that I have seen in a very long time. And the music score was very well played in the background bringing just the right tone to every scene.<br><br>A must see for people that want to see something different - I enjoyed it very much and look forward to watching it again. And the ending leaves us with the opportunity for a sequel...I truly hope that comes to life because I would be the first in line!","user":"djkoombaya","rank":[25,27]},{"title":"Grossly under-appreciated film.","rating":8,"date":"28 March 2013","review":"Unfairly maligned, grossly under-appreciated \"Wu Xia meets Gunslinger\" film.<br><br>The \"martial artist with a baby\" angle was probably inspired by the \"Samurai Assassin\" series of films.<br><br>The fish out of water \"Eastern martial artist in the Old West\" angle was probably inspired by Bruce Lee's \"Kung Fu.\"<br><br>Sad to see so many movie fans slam this film so harshly. It really wasn't the awful mess they made it out to be. It was quite good in many respects. The plot/theme was clear and well-defined. The cinematography was expert. The fight sequences were skillfully choreographed, as good as those in \"Crouching Tiger, Hidden Dragon\" or \"Hero.\" <br><br>Movie fans who have yet to see this film may want to ignore the naysayers and give it a chance. They may be pleasantly surprised. <br><br>Or not.","user":"bevinchu-1","rank":[12,13]}]