[{"title":"Poe is spinning in his grave....","rating":2,"date":"29 October 2010","review":"I would normally give \"The Tomb\" about five stars, if only because it was made in a competent manner (i.e., you can hear everything, the editing is reasonable, shots are framed, etc.). But I have to deduct one star for being so blatantly derivative and one star for being an insult to Mr. Poe. No, wait...I'm taking another star away because everybody is just so BAD in this film.<br><br>The story is only minimally based on Poe's short story. I can hear the producer's now...\"What? No children in danger? Add one! No sex? Add some! How does she come back from the dead? Through strength of will alone? No good! Add some satanic rituals and symbols. While you're at it, go find out how much Michael Madsen and Eric Roberts want for small, crappy parts. Nobody else is hiring them, so we ought to be able to get them for a song.\" (Madsen and Roberts have two totally irrelevant and shoddy roles in this production, but I guess that Madsen has to buy black hair dye somehow.) <br><br>What is more fatal to this film than anything else is that we just don't care about any of the characters. We don't hate any of them, we don't like or sympathize with any of them. They just sort of exist to deliver their lines.<br><br>As far as excitement, forget it. There isn't any. No nudity (worth mentioning,) no gore, no mystery, no chases, no fights (of any length or quality,) no shocking or surprising moments. It's just drab.<br><br>Overall, a very stinky film. Don't bother.","user":"innocuous","rank":[21,24]},{"title":"Please don't make the same mistake that I did. Avoid this movie.","rating":2,"date":"5 September 2010","review":"\"We will never have to pay that price. We can live forever.\"<br><br>I don't know why I watch movies like these. They're clearly going to be awful. All the reviews I read further reinforced the fact that it was going to be awful. But, I still felt compelled to see it, anyway. And yep, it was awful.<br><br>The problems were myriad. The scares and horror aspect of The Tomb were surpassed by most of The Goosebumps books I read as a kid. The story was silly and bland. The attempt to appeal to the audience with sex fell flat with scenes that would hardly earn a PG-13 rating and had no chemistry between the participants.<br><br>The absolute worst things about The Tomb, though were the acting and the script. The entire cast was uniformly wretched, especially Wes Bentley and Sofya Skya. Sofya is certainly a very beautiful woman, but she would be wise to reconsider this whole \"actress\" thing. And Bentley came close to achieving the feat of making me never want to see another movie that he's in, ever. As for the script, describing it as \"amateur\" would be an insult to everyone who has ever been an amateur at anything in the history of the world. The dialogue is abysmal, and I can't imagine that anyone spent more than a few hours writing this.<br><br>I don't know what kind of dire financial situations are responsible for Eric Roberts and Michael Madsen being in this dreck, but I'm willing to offer money out of my own pockets to help them never have to be in anything this terrible, again. The only possible entertainment to be gained from The Tomb is from making fun of it. It's hilariously bad, but still too boring for me to recommend even for a laugh with your friends.","user":"lewiskendell","rank":[15,19]},{"title":"The Bore of Ligeia","rating":3,"date":"7 August 2010","review":"To put it mildly, most of the Horror genre owes a huge debt to the works of Edgar Allan Poe. So many of the genre's finest works of literature and cinema wouldn't even exist without writings like \"The Conqueror Worm\", \"Masque of the Red Death\" and \"The Black Cat\" just to name a few. Hell, there have been some stellar films based on his works, especially Roger Corman's absolutely essential 60's adaptations. Sadly, the adaptation of \"Ligeia\" from 2009 named \"The Tomb\" is not one of the great adaptations.<br><br>Jonathan (Wes Bentley) has a lot to look forward to. He's a respected professor, has a gorgeous girlfriend in Rowena (Kaitlin Doubleday) and so much more. Then Ligeia (Sofya Skya) enters his life. She's beautiful, tempting, and she has him under her spell, and they move to her castle by the Black Sea. That is, until he finds out that she's been stealing souls to defeat a disease she has and gain immortality. And if she can't have Jonathan, nobody can.<br><br>There are a few things \"The Tomb\" gets right. Some (not all mind you) of the performances are good, especially Skya as Ligeia, who plays the character as an Gothic beauty with the right balance between erotic desire and deadly siren. Eric Roberts aka \"Mr. Straight to Video\" is also fine in his role, though one wishes you had gotten to learn more about his character. Also worthy of note is the fact that for a low budget horror film, the CGI isn't too bad. Finally, the score by Patrick Cassidy is a lot of fun, and reminded me of the best work from Richard Band.<br><br>And that's where all the goodwill vanishes. While first time director Michael Staininger certainly has an eye for visuals, none of the movie captures the kind of dread and madness that makes the writings of Poe so great. Instead, many of the scenes that are supposed to be creepy instead come of as goofy. Some of the other performances in the movie are rather weak as well, particularly Bentley and Michael Madsen. Bentley is more wooden than a 2X4 here (the less said about his rendition of \"The Conqueror Worm\" in the end credits the better-though I guess it's more dignified than being in \"Jonah Hex\") and Madsen can't deliver any of his lines properly to save his life, not to mention that it feels too much like he showed up on the set a few days and then left.<br><br>The biggest problem with the movie is the script. There are too many lapses in logic (okay, so your boyfriend leaves you for a hot Russian girl, and he comes back, and you just let him back?) and plot holes to count, and it feels more like a rough draft. The really disappointing thing about this though, is that it was written by John Shirley. While he's mostly known for writing the original script for \"The Crow\", he's also written some fine Science Fiction (\"City Come a Walkin'\") and horror novels (\"Wetbones\", \"Cellars\" and \"Demons\" to name a few.) For an author I enjoy so much to write such a bad script really sucks.<br><br>\"The Tomb\" really has no reason to be watched. Sure, it occasionally resembles the kind of enjoyable Gothic yarns Full Moon Studios used to make, but more often than not it feels like a Lifetime Channel horror movie than an Edgar Allan Poe Adaptation. The movie should have just been called \"The Bore of Ligeia.\"","user":"lovecraft231","rank":[16,23]}]