[{"title":"A tough watch but a brilliant job by all concerned","rating":8,"date":"3 October 2015","review":"Child 44 isn't the movie you watch for light entertainment. It is gritty and tough, and I found myself feeling a sense of absolute disgust for anyone and anything connected with the old school communist state in the USSR. It really makes you look at just how bad that system was and how monstrous the people were who enforced it on the general populace. Nonetheless, the story is compelling, although sometimes the thread jumps around a bit. Tom Hardy's performance was his best ever. I think he warrants an Academy for it. Noomi Rapace was excellent - very authentic in her role. Child 44 is a dark thriller - and without giving anything away, the build up and hatred toward the serial killer really sticks you to this movie - you simply want the killer to get the most gruesome death conceivable for what he does. Apart from the Hollywood aspect, this film depicts reality. This is how life existed under Communism and I think that message is just as compelling and important as the rest of the story - because it really depicted the terror and the suppression that millions of people lived under in the name of some douche bag's idea of \"ideology\". May Stalin forever lay dead and remembered for only one thing - he was a murdering asshole. Watch the film folks - I notice that the ratings were low, and I think that is an unfair assessment about the quality of this production.","user":"reallaplaine","rank":[106,147]},{"title":"Lose Yourself","rating":10,"date":"12 May 2015","review":"Excellent opportunity to lose yourself in a brilliantly multifaceted, deftly crafted story about love, war, politics, serial-killers, violence, loyalty, betrayal, tenderness, and back again. And again. New every time. Fresh, like running water, the story keeps you guessing throughout, and yet at the same time it feels oddly familiar, a bit like seeing your own reflection in the mirror for the very first time. Acting? Seamless. The entire cast, not just the ever so captivating leads. Not one false note amongst the lot. I vote Child 44 should receive the much coveted Collective Oscar Award 2016. Direction? What direction? Surely, the story just went and told its spellbinding self. By itself. Daniel who? And as for the cinematography, the look and feel of this film was authentic and distinctive enough for me to actually look up the DP's name: Oliver Wood. Who's probably just another genius on board of Child 44. Could go on, but think this more than covers the IMDb's suspiciously lofty demand for a mini-essay. Hope you enjoy watching Child 44 as much as I did.","user":"luceruc","rank":[156,242]},{"title":"Do a great film justice & pay to watch it!","rating":10,"date":"22 April 2015","review":"Excellent, excellent film. How \"Furious 7\" received such great reviews and this film did not is beyond me. Definitely pay to watch it. Do a great film justice and don't let it die with Furious pissing on its grave.<br><br>44 Child makes you actually feel as if you were transported back to soviet Russia and gives you the feeling of helpless in an unjust government. It was banned from Russia for a reason. Tom Hardy gives an excellent performance and you find yourself feeling sympathy yet cheering for the success of this man who appears emotionless towards acts of monstrous brutalities and a moral compass.","user":"matttrose","rank":[221,354]}]