[{"title":"When did IMDb become so cynical? This is a kid's movie for goodness sake!","rating":6,"date":"10 October 2008","review":"Honestly, I can't help but notice all the people who once again are rating this movie without seeing it and just because they suspect the movie is going to be bad, they rate it anyways as a one. Well, I'm going to once again give you an honest review, I saw this movie last Saturday and honestly enjoyed it. I know I'm going to receive a lot of bashing, but I always look at movies as what they are supposed to be, this was meant to be a children's movie, it's meant for fun. Remember how we all had those cheesy animal movies when we were kids as well? Well Beverly Hills Chihuahua is no different, it's just updated with today's world. I thought it was a good idea, we see all these rich people now-a-days with the way they just lavish their dogs with jewels that cost more than people's houses, it takes a little joke at it. The story is recycled, but it's still a lot fun to watch and has some really fun scenes.<br><br>Chloe is a Beverly Hills Chihuahua who is just so pampered, with clothes, jewelery, and a life style anyone would die to have. Her owner, Vivian, has to go away on a business trip and leaves her party girl niece, Rachel, to watch Chloe. When they go to Mexico, Chloe is kidnapped and put into a dog fight... she is then saved by another dog, Delgado, who is going to help her get back to Beverly Hills. But when the man who runs the dog fights finds out that Chloe is worth something, he sends his Doberman dog, Diablo, after her. Rachel, the land scaper, Sam, and his dog, Pepi who is also in love with Chloe, are on the hunt to find her and get her home safe and sound.<br><br>Beverly Hills Chihuahua is a fun movie if you give it a decent chance, I thought it was a nice chance from the constant CGI we always have with these animal stories. I was also impressed that the talking didn't look so fake with the dogs. I tell you though I'm convinced that the dog that played Delgado is the same dog from I Am Legend, that dog just deserves an Oscar, lol, come on, you gotta agree. Well, Beverly Hills Chihuahua is a great family film, as for seeing it on your own or with a friend, I would say that it's worth the rental more so. It's a silly movie I admit, but I had a fun time watching it and I wish IMDb users would give this movie the fair chance it deserves.<br><br>6/10","user":"Smells_Like_Cheese","rank":[272,340]},{"title":"not the calamity people are making out to be, but no blockbuster either","rating":5,"date":"25 October 2008","review":"I have been using IMDb to obtain feedback on movies for several years now, and what I find is that people here tend to be a little too bias toward A-list, blockbuster movies. Chihuahua does not fall into that category by any means, but that does not warrant dismissing it outright. It is true that the film's cast could have been put to better use, but given the parameters set by the Disney-style writing, they did what they could and it was enough to let me enjoy their performances. I read a review on here that commented on the inaccuracy of geographical information. I agree that if Disney is going to make a film like this, it is unfortunate that they do not take the time to educate their young audiences a little. We wouldn't be talking doctorate level research here, just basic fact-checking.<br><br>The plot of this movie was not deep, but not many Disney movies NEED to be in order to cater to their young audience and family demographic. I am a twenty-something and I am able to tolerate Disney's material, because I accept it for what it is: shallow, vapid entertainment designed to convey squeaky-clean ideals to impressionable youth. Sometimes, they take that squeaky-cleanliness too far, like making light of the dog fights, but overall, it is all rooted in the same objective: to maintain their target demographic and intake revenue.<br><br>To the people who reference the different caliber of Disney's entertainment ten or more years ago, I concur with you. It would be good for Disney to trace its roots a bit and return to basics, but it would take a lot of cutting through green to accomplish that.<br><br>I enjoyed this movie. There was a comment on the discussion board mentioning that the trailer distorted people's initial impression. I am one of those people. Once I got into the movie though, I applied my usual preconditions for judging Disney films and had a good time. It was cute and in Disney's typical fashion, it contained half-baked attempts to teach the kids a thing or two (inaccurate or vague as they were).<br><br>Go into it knowing it's Disney and will thus inherit the characteristics of all their work, and you'll be fine.","user":"bobertdos-1","rank":[62,76]},{"title":"Should be MANDATORY to actually see the movie before voting!","rating":7,"date":"8 November 2008","review":"I agree with some of the previous reviewers - how can you rate a movie without even seeing it?!? Well, guess that gives us the right to rate THEM without even knowing them! I give those people a 1.5.<br><br>This is a KID'S movie and to rate it a 2 is ridiculous. It's not the best movie but it sure is much better than A LOT of recent kid's/animated films. My kids, 4 &amp; 5, loved this movie and that's really my biggest requirement. There are many others where they were bored and wanted to leave in less than 30 minutes.<br><br>To the people voting it so low (especially ones who vote without viewing) - GET A LIFE!","user":"bc1440","rank":[122,159]}]