[{"title":"As a South African, I can tell you the entertaining, inspiring and enjoyable \"Invictus\" exceeded all my expectations.","rating":8,"date":"13 December 2009","review":"As a South African who saw this film on Friday morning, I can tell you you the entertaining, inspiring and enjoyable \"Invictus\" exceeded all my expectations. <br><br>It really is a true story of epic proportions yet it's told with an intimate feel, and it is at least 98% accurate to the events of the time. Clint gets all the big details and so many of the little details right, but he never goes over the top. He directs with minimum fuss and achieves maximum effect, just letting the powerful story unfold without getting in its way.<br><br>I watched the 1995 Rugby World Cup and saw Madiba come out in the Springbok jersey. It was a wondrous sight. And when Joel Stransky slotted that drop kick over in the dying minutes and the Boks won, I wept and cheered along with everyone else. After the match millions of South African - of all races - celebrated. It was an amazing time. It was the birth of the \"Rainbow Nation\". Nelson Mandela is the greatest and most beloved of all South Africans. The man is a living legend, but so human and real. When he was President he brought hope to all South Africans, white and black. We, in my country, will never stop loving this incredible man. Clint Eastwood and Morgan Freeman did South Africa and our beloved Madiba proud. Francois Pienaar is also an amazing South African, an intelligent, big-hearted rugby played who always led by example, and Matt Damon's performance as him was superb. I was glued to the screen for every second of the film's running time (I didn't even move from my seat until the final credit rolled and the house lights came on), and I was moved to tears on several occasions. The final scene was especially touching.<br><br>Freeman's performance was magical and I can see him getting as Oscar nomination. If you think his Mandela is too cool to be true, think again. Mandela really is this cool. A brave and intelligent man whose courage and strength of character should serve as an example to people all over the world. After being unjustly imprisoned for nearly 30 years by a cruel and repressive regime, he emerged to run a country and teach its people the meaning of forgiveness and reconciliation.<br><br>I thoroughly recommend the authentically detailed, historically accurate \"Invictus\" to film lovers, Eastwood fans, Nelson Mandela fans and sports fans everywhere in the world. South Africans would be crazy to miss this excellent film, but it deserves to be a hit all over the globe. Let's hope it is.<br><br>Viva Clint Eastwood, viva Morgan Freeman, viva Madiba.<br><br>PS. I'm a huge fan of Clint Eastwood as both an actor and a director.<br><br>Of the films Eastwood has directed, my favorites, in no particular order, are \"Unforgiven\", \"Million Dollar Baby\", \"Gran Torino\", \"The Outlaw Josey Wales\", \"Letters From Iwo Jima\", \"The Bridges of Madison County\",\"Bird\" and \"Invictus\". Yes, it's really that good. \"Invictus\" is another winner from Clint. He just seems to get better with age. What a creative roll he is currently on.<br><br>PPS. \"Invictus\" is one of the best sporting movies I have ever seen. But it's also about more than sport.","user":"JeffersonCody","rank":[229,254]},{"title":"One of Clint's Best...","rating":9,"date":"4 December 2009","review":"In surely one of his lightest and straight-forward works of his career, Clint Eastwood has achieved one of the most inspirational films of the year with his new film, Invictus.<br><br>Starring Academy Award Winners Morgan Freeman as South African President Nelson Mandela and Matt Damon as Rugby Captain Francois Pienaar, Invictus is a picture full of emotion, magnetism, and revelation. What critics and audiences may be deceived by is belief that this is THE Nelson Mandela biopic which it is not. It is the story of Nelson Mandela's first years as President of the culturally separated country South Africa in 90's. In a way to unify his people, Mandela used the country's love for Rugby to connect the whites and the blacks. As their record has been less than impressive, no one expects anything notable from the Springboks. Mandela taps the captain of the team to rally his troops and surge into battle for the greater good of his country.<br><br>Everything about Invictus works on so many degrees of the medium based on the book \"Playing the Enemy.\" The film never comes off as too pretentious or egotistical; it requires nothing more from the viewer than an open mind and heart. Eastwood directs the film perfectly, laying back when he needs to, never pushing the subject matter or shoving it down our throats. He utilizes all the skills we've come to love about his earlier works in Million Dollar Baby, Mystic River, and Letters from Iwo Jima. The use of light shows a character' s vulnerability inhabiting their souls or a score by Kyle Eastwood that offers both zeal and subtlety during a rugby match. <br><br>Cinematographer Tom Stern hits another one out of the park, catching all the fury and apprehension of all the different elements of this strenuous time. Joel Cox and Gary Roach edit the film with the perfect amount of precision and friction. <br><br>Morgan Freeman as Mandela is a wonderful charmer, showing the man's most hostile yet tranquil behaviors. Not necessarily the most engulfed characterization seen on film this year as Freeman's accent comes in and out of remission, but it's a tremendous performance worthy of an Oscar nomination. <br><br>Matt Damon, showing himself as one of the best working actors today, doesn't have enough of the character depth and arc to carry the picture. Damon's performance doesn't allow him to really go anywhere. It's a superb turn, with a great accent inhabitance, that warrants credit where the credit is due. However, Damon requires nothing more than a little motivational speaking and responsive humility.<br><br>Invictus, is one of the best pictures of the year, standing in the ranks of one of the best sports films of the decade. This is the type of film that Oscar will likely be all over and fall in love with. I concur. <br><br>****/****","user":"ClaytonDavis","rank":[196,251]},{"title":"Morgan Freeman shines in Clint Eastwood's solid drama","rating":8,"date":"12 December 2009","review":"Set in the early to mid 90's, Clint Eastwood's \"Invictus\" covers the first year of Nelson Mandela's presidency and how he pushed the nation's rugby team, led by captain Francois Pienaar, to achieve World Cup glory. However, Mandela's backing of the rugby team splits many hairs, as the \"Sprinboks\" have come to be a symbol of apartheid for millions of South Africans, making Mandela risk the very base that pushed him into office. He must also deal with personal security, his exhaustive schedule, and the strains on his personal life.<br><br>As much as I respect Morgan Freeman, I was concerned that his presence would be distracting, that I would be seeing him instead of Nelson Mandela. I shouldn't have worried. Freeman completely immerses himself into the role and gives one of the best performances of the year. Not only are his accent and tone of voice quite good, but he brings a true 3-dimensionality to the role. Compare, for example, him having tea with Francois, to talking with his family, and to making a political speech. Freeman nailed every facet of Mandela's life.<br><br>Damon also excels as Pienaar, the solid enough rugby player who must do more than just lead by example for his team. The screenplay, adapted by Anthony Peckham, doesn't offer many narrative surprises, but it does do a good job examining not only the strife South Africa was in when Mandela was elected, but also the value of the team to the entire nation. Eastwood wisely plays the material straight. Though the material may seem familiar, the performances by Damon and especially Freeman are what elevate this tale into a solid and even uplifting drama.","user":"wolverinesforever","rank":[71,87]}]