[{"title":"Effective thrills, but with some logic issues","rating":7,"date":"28 February 2020","review":"I really enjoyed the first 2/3 of this film. They are filled with palpable tension and a general unease at not being able to see the \"monster.\" This is another example of how what you cannot see is often scarier than what you can see. The direction is great and perfectly places the viewer in Elizabeth Moss' shoes, which is what generates most of the tension as you the viewer are also unsure where this invisible person is at all times. The spin of domestic violence also lends a new, modern twist on the classic premise.<br><br>Where the film falters is in its third act with some significant plot holes regarding cameras and visibility of certain actions. There were also several times where the film felt like it was at its conclusion, but kept going. The ending will likely be divisive, however I didn't hate it. The Invisible Man is technically a very well-made thriller, but loses a few marks due to some issues with the plot.","user":"cardsrock","rank":[232,378]},{"title":"The Invisible Plot","rating":4,"date":"2 March 2020","review":"When you first watch the movie you're thinking okay this is pretty good. Interesting. Starts slow but it builds up and the ending is nice. She gets away with killing the abusive ex boyfriend and lives happily ever after.<br><br>But after thinking about things for a minute you realize... other than her saying it you don't see any real indication that he did much to her. You are pretty much taking her word for everything. And then when it comes to the boyfriend... what is it about him? You see yeah he can be manipulative but you barely see that. But then you see the main thing the movie is about... the invisible suit and what are they really made for? Who were they made for and how many of those suits did he really have?<br><br>Then on top of that when you're learning about the boyfriend you learn that he is supposed to be on top of everything. Very observant . And knows what is going on in his place. And especially when it comes to those suits he would know how many he has and what's going on with them. YET when she hides one of those suits that doesn't register in his mind. Like she took the suit off of the dummy, didn't replace it on the dummy in the place... and in fact was attacked moments later. So it should've been known that the suit was missing AND that it would be in the closet or somewhere leading towards the closet since that where she went and yet... nothing.<br><br>Then there is the scene where her sister gets her throat cut in the middle of a fancy restaurant. And the thing about any eating establishment... there are cameras everywhere. The fancier it is the more cameras there would be. So how is it that they were so sure she killed her sister and didn't spend a single second looking at any of the video footage? Because if they would have spent any time they would have seen a floating knife to notice... something isn't right. But nope somehow all of that was ignored and she was just immediately guilty.<br><br>And there was the when the daughter got hit while the main girl was down on the ground. Like she's starting to get back up to her feet and is a little distance away. The daughter gets hit and doesn't register that there is no way she could have hit me. Something had to have hit me. Nope. Like if you're on your hands and knees there is no way you're generating enough force to knock someone to the ground and that didn't register with the girl.<br><br>But yeah its like if you watch the movie and remove your mind from it then its pretty good. But if you start thinking about it you notice things that should've been thought through differently and at least fleshed out a lot more. So that's why the rating went from a near 8 down to a 4. Its just not as good as initially and originally thought.","user":"SuperSlim451","rank":[228,389]},{"title":"So Many Holes In This Plot, It Was An Invisible Movie","rating":1,"date":"4 March 2020","review":"Don't believe the hype, this movie is NOT good.\nFirstly, I found the acting wooden and hammy, as was the dialogue. Elizabeth Moss' ptsd act gets tiresome after a while.\nNow for the plot holes galore.<br><br>This technology being worked on, why isn't the government or military hovering over it? When the supposedly abusive husband (we never see a lot of evidence of that) dies, why is all of his advanced tech just sitting untouched in the house?\nWhy is there a dog living in the house and nobody seems to care? The dog's owner had been dead for weeks. Surely there were people going to visit the house to see what was going on. The brother certainly didn't say he moved into the house. Everything was covered with sheets, leading one to believe there wasn't anyone living there, so where does the dog come from?<br><br>Why does the dog bark at the 'invisible man'? If he belongs to the pretending-to-be-dead husband, wouldn't he recognize him regardless of the suit?<br><br>Fast forward to when Elizabeth Moss' character is in some psychiatric hospital. Her 'invisible man' is supposedly there watching her, but everyone thinks she's crazy. Well, why is he also going into her room and getting locked in there with her every night? Then that fight scene with all the guards was ridiculous. Do mental hospitals really have an army of heavily armed guards? And they kept coming in 2's, but could never seem to see this 'invisible man' even though his suit was malfunctioning. Moss certainly didn't try to help by grabbing the nearest gun and shooting at him until all the guards were dead.<br><br>Then how does said 'invisible man' get away? Did he drive? Did he call an uber? Somehow these invisible suit men get around without needing a car. They also exhibit super human strength, no explanation.<br><br>And what was up with all that rain. It seemed like it was supposed to be an important plot point, by the way the camera focuses on the TV with the news story about the weather. I thought it would have a purpose, but apparently, it was only to have a really wet confrontation in the parking lot that went nowhere. And of course, the rain, which sounded like the storm of the century, magically disappears once you see the cop friend's house lol. That must have been a long trip!<br><br>And why would the brother be 'set up' by going to the cop's house? What was the set up? He's just okay with killing random people? And if he was really the killer from the hospital, why wasn't his suit malfunctioning. And speaking of the suit working properly, how was it even powered? The suit looked like it was perfectly fit to the person's body, so where was the battery? Crammed up the butt-crack? lol<br><br>Leading to the ending - were there actually three suits? The brother was killed in one suit, Moss hid another suit when she visited the house earlier, so the malfunctioning suit makes three. Assuming that the abusive husband was the one doing all of the killing/stalking. And I guess it's one size fits all suit, because apparently this suit fits everyone perfectly, including the shorter Moss.<br><br>Now, this movie is way too complicated for it's own good, kind of like my write-up lol. Half way into the film, I was thinking the good plot twist was that the brother was responsible all along, and that making Moss look crazy would mean her money could go to him. Or something to that effect.\nAnyway, don't believe the hype. This movie really is clumsy. Wait for it to come on Netflix.","user":"peeedeee-94281","rank":[194,330]}]