[{"title":"Comedy - for laughs - not irony or sarcasm - and all the better for it.","rating":8,"date":"28 December 2008","review":"This was the biggest surprise of the year - bar none.<br><br>A great comedy - as in laughs, feel good, and just plain enjoyable.<br><br>The plot of the loser who makes good at rock'n'roll second time around is very Jack Black and Rainn Wilson does a GREAT job - there is no recourse to gross or sarcastic humor here - rather it plays on its rock roots, chucks in some stupidity, and some kick-ass tunes, and lots of excellent one liners and like I say totally surprised us as to how genuinely funny and warm-hearted this is.<br><br>Great cast and a great script - sure it's not perfect, but after all the pseudo-comedy and angst of 2008 it was refreshing just to sit back and enjoy an entertaining movie.<br><br>we loved it and are normally really cynical about comedies - but this rocks and would recommend to anyone as a real effort by all involved to stop being smarter than the audience and just enjoy life - in two and a half words? - it rocks!","user":"intelearts","rank":[44,56]},{"title":"Pretty Surprised","rating":8,"date":"9 June 2008","review":"So I just went to a pre screening of this film in downtown Chicago and Mr rainn Wilson himself was there to do a Q &amp; A afterwards.<br><br>This movie was actually laugh out loud funny, it shows a lot of character sub plots and builds a good and funny funny time telling about each character. This is a go for the win movie and even gave me tingles once and awhile. There is a lot of sub plots and it all works together for the ending. It is about Rainn's character who was in a in a rock band that was on their way to being huge and they kick him out of the band. He starts a band with his nephew and his friends and show them how to be true rockstar giving himself the chance and the dream that was cut from him. I give it a 8 out of 10 and Rainn was a true comic.","user":"morten-summers","rank":[71,104]},{"title":"Hugely enjoyable.","rating":8,"date":"19 October 2008","review":"1986 - Robert 'Fish' Fishman is the drummer of an up and coming rock band called Vesuvius. However, on the night they are offered a massive record deal, they are told there is a catch.... they have to sack the drummer. Twenty years later, Fish is still angry about that, but when offered the chance to play drums for his nephew's rock band at the Prom, he see this as a chance get to live the rock lifestyle he always wanted....<br><br>In many ways, The Rocker is a sequel to School Of Rock, in that you have the older band member, with much younger band members. The difference here though, is that they are all in their late teens. But even these similarities don't hide the fact that for it's running time, The Rocker is hugely enjoyable.<br><br>The cast, lead by Rainn Wilson are all good. Wilson as Fish gets to over the top as he lives out his dream, and while some of his antics are a bit childish at times, they are probably no worse that what actual bands get up to at times. The fact that the rest of the band, are normal teens makes Fish's antics even funnier.<br><br>As for the rest of the band members, yes you do have some clichéd characters. There is the sensitive lead singer/song-writer, the Indie- spirited girl, and the genius but shy keyboard player. Despite this however, each person develops as the movie progresses, even Fish and while some plot developments in the movie are very predictable, this doesn't detract from the enjoyment.<br><br>Peter Cattaneo, who also directed The Full Monty, keeps things moving along nicely. The script, while not a laugh out loud riot (for me anyway), did keep a smile on my face all the way through. The music in the movie is also well done. Not only in the choice of background music, but also the songs that the band have written themselves.<br><br>The Rocker will never be remembered as an all-time comedy classic. But for it's running time, it is very enjoyable, keeps you smiling and is very entertaining.","user":"kevin_crighton","rank":[43,61]}]