[{"title":"A good idea, but a less than acceptable result.","rating":3,"date":"23 October 2010","review":"I was interested in watching this movie after seeing the trailer. It seemed like a good, fast-paced action thriller, dealing with meth. Considering I am addicted to Breaking Bad, I thought it would be, at least, entertaining.<br><br>The movie has some good elements, and they must have invested quite a bit of money in all of the flying scenes--and there are a lot of them. Unfortunately, this is the only part of the movie that is actually interesting, and well executed. The script seems to be written for a juvenile book, rather than as screenplay. Some jokes are just not the kind of things you would hear someone say, although they may look somewhat funny on paper. There were a couple of moments where I couldn't believe how bad some of the lines were. One of the things I will remember this movie for, is the particularly bad jokes the actors had to say. Since they invested so much into the flying scenes, why not spend some more time and effort into a good script? There were also some obvious technical mistakes with the lighting in some of the scenes, which showed a rather careless attitude towards delivering a polished product. While most of the flying scenes looked good; a lot of the police headquarters scenes looked very cheap. The police chief was good looking enough for an acting role, but; did not match at all, the persona or character required for such a role, nor did the snitch-girlfriend. One memorable moment is when he puts his foot up on the chair while cutting a deal with the main character. It was such an odd and seemingly uncomfortable position, filmed from such a bad angle, that it ruined any little credibility that scene could have produced. Very few of the cops looked like real cops, as they tried too hard to be tough; obviously not succeeding.<br><br>Overall, it is a movie for teenagers that are not too critical on either the acting, script, special effects, or corniness of a situation (there were quite a few of those). From that perspective, it can actually be an enjoyable experience. But for a mature audience, this film simply will not work.<br><br>However, it was a good idea, and I hope the Director takes advantage of the opportunity and learns from the mistakes made in this production, in order to not repeat them in the future.","user":"gordoalc","rank":[34,48]},{"title":"113 minutes... for what?","rating":3,"date":"7 December 2010","review":"Your usual brainless action flick that still entertains you enough when all the good films are already rented out is usually about 90 minutes. Why they made this horrible ride 23 minutes longer is beyond my comprehension because the movie just doesn't have enough substance for that. The basic story of some \"cool\" guys drug trafficking with airplanes, getting mixed up in some bad stuff and in the end pulling off a \"glorious\" rescue mission that makes them the good guys COULD be entertaining enough as a basis. Unfortunately we get confronted with dialogue that is barely more interesting then the white pages, acting that makes Arnold Schwarzenegger look like a Oscar winner and action scenes that, except for the showdown, are so boring that not even an \"exciting\" soundtrack and fast cuts can make it really interesting. And even the showdown isn't that cool.<br><br>Save your money for something else, you'll only end up very angry if you don't.","user":"tatsu2050","rank":[21,32]},{"title":"three young daredevil pilots get caught running meth for a Mexican cartel and are offered a deal to rescue a DIA agent captured by the cartel, in exchange for their freedom","rating":7,"date":"23 October 2010","review":"It is not that bad, but if you expect a film about meth, this will not be for you. The film is more about the pilots and what they have to do to stay out of jail after they've been smoked out by the DIA. The acting is not supreme but overall definitely acceptable. This is more an all round entertainment film for those who like some action some silly jokes (they're actually quite funny if you like this kind of humor) and a lot of nice flying scenes. You can do a lot worse than watch this film and personally, I liked it. On a dreary Sunday afternoon, you cannot go wrong with this one. And for those who might be interested, somewhere in the middle of the film there's a lovely version of tears for fears' 'head over heels'","user":"onnophrys","rank":[13,19]}]