[{"title":"Uniquely strange","rating":7,"date":"6 March 2020","review":"I can't really call this a movie, in the common sense. Sure you'll see some semi-recognizable faces who have held smaller parts across many comedy shows and movies, most notably a few cast members from Reno 911, but there is not a straight forward narrative here. Instead we have more of an anthology of faux-public access and infomercial skits (think Tim &amp; Eric Awesome Show) specifically created and filmed deliberately in amateur style under the pretense that a young boy recorded these bits of cheesy TV over a VHS tape that was originally once reserved for his parents' 1987 wedding footage. You'll see classic clips of horribly acted 80's porn (the story scenes), exaggerated jazzercize infomercials, the blue vertically scrolling preview channel, absurd advertisements, boring public access programs about rock bands and conspiracies, knock-off Antiques Roadshow and HSN bits, and peppered in between all of this you have quick shots of the kid's parents' wedding video and times where him and his friend were messing with the camcorder during sleepovers. Everything is pretty convincing here and as an 80s/90s kid myself, I appreciate the authenticity. This is a love letter to a certain kind of person, of a certain age, with a certain sense of humor. If you get it, you really get it. If you don't, then you just weren't the target audience. This film is like one endless inside-joke, and it's absolutely brilliant for what it is.","user":"umimelectric","rank":[6,7]},{"title":"VHNo","rating":13,"date":"13 March 2020","review":"Weird is the only word i can think of.\nnot really a movie... just weird clips.\nthe painter lady scares me a little<br><br>2.7","user":"natcalgary","rank":[0,2]},{"title":"VHYes","rating":3,"date":"9 March 2020","review":"Directed by Jack Henry Robbins. He is the son of Tim Robbins and Susan Sarandon.<br><br>VHYes is some ways wants to be a nostalgic smorgasboard of late night 1980s television as well showing how camcorders became the precursor of found footage movies.<br><br>It is Christmas Day 1987. 12 year old Ralph gets a camcorder as a present and mistakenly uses his parents wedding video tape to record life as he sees it as well as various things on the television.<br><br>So you see snippets of shopping channels, learn how to paint shows and even some risque stuff.<br><br>It is meant to be an affectionate parody and comes across as zapping through the tv channels at great speed.<br><br>However this kind of spoofing was done better in something like Kentucky Fried Movie. Here as I am not American some of it just went over my head. Even If I was American, I doubt I would still find it funny.","user":"Prismark10","rank":[0,2]}]