[{"title":"Miracles can be bad too","rating":5,"date":"25 September 2008","review":"2nd Staff Sergeant Aubrey Stamps: I know, I'm the only one left who knows.<br><br>I know this is too easy even for me but the true miracle at the center of Spike Lee's latest joint, MIRACLE AT ST. ANNA, is that I was able to sit through it without screaming out of sheer frustration over how hollow the whole affair was. I don't feel so bad about taking that oversimplified stance, seeing as how Lee himself didn't seem to have any concerns about dumbing down this important history lesson. Lee is an accomplished filmmaker and MIRACLE AT ST. ANNA is an ambitious project, even for him. He prides himself, as well he should, on telling stories from an African-American perspective that is rarely taken in mainstream film. In this case, he chose to shed some much needed light on the soldiers known as the Buffalo Soldiers, all black regiments in the U.S. army. He wanted to give the world a fresh take on the World War II epic by using an unfamiliar voice but all he accomplished was minimizing their plight by weighing down his film in tired convention and never committing to any one point of view.<br><br>I don't mind long movies when the story warrants the time spent. MIRACLE AT ST. ANNA opens in 1983. A postal worker (Derek Luke) has just shot and murdered a man who bought a stamp off of him for no apparent reason. A statue head, one with incredible value both financially and historically, has been found tucked away at the bottom of his closet. News of the statue's recovery spreads across the globe and an investigative journalist (Joseph Gordon-Levitt) is determined to understand why a seemingly law-abiding citizen would commit such a random act of brutality. This goes on for about thirty or forty minutes until the postal worker finally agrees to tell his story. It all started in Italy during the second world war. My question is, if it all started then, why did Lee waste so much time with a pointless excuse to get to the actual story when the story in question needed no excuse to be told? This all too tired Hollywood convention needs to cease. People need to start getting to the point.<br><br>The story, adapted from James McBride's novel of the same name by McBride himself, follows a foursome of Buffalo soldiers who survive a German attack, find a young Italian boy in need of medical attention and eventually set up camp in a small village while they wait for reinforcement. During their stay, the soldiers make friends and enemies with the townspeople, which challenges the inherent racism of all involved. It isn't a bad story; it is just written in such a false and incredible fashion that undermines the film's credibility. There is no time for one liners when you are being attacked on all sides by the German army but yet somehow McBride felt that quips between gunfire would alleviate the intensity, as if that were necessary. There is also apparently no time for real character development. Bringing an untold story to light means putting faces to characters that had none before. Without development, these soldiers are nothing but black soldiers instead of real people. Somehow, by forcing us to face the colour of their skin, Lee made it so that is all we end up seeing.<br><br>Spike Lee makes important movies but sometimes, he makes them with the knowledge of just how important they truly are. MIRACLE AT ST. ANNA is at times horrifying and at others, beautiful. Mostly though, it is tedious and disappointing. It is not so much disappointing that Lee wasn't able to pull off such a huge endeavor but more so that if anyone could have done it the justice it deserved, it would have been him. Now, the story has been told but the point was never made.","user":"moutonbear25","rank":[95,130]},{"title":"Bogus history at St. Anna","rating":5,"date":"9 October 2008","review":"See, I hate that. I hate movies which can't resist the temptation to spice real events up with invented love stories (Pearl Harbor, Captain Corelli's Mandolin) or bogus mysteries (Miracle at St. Anna), all while pompously claiming to be \"based on true events\". I hate tedious narrative frames which serve no purpose whatsoever apart for giving viewers a modern setting to which, supposedly, they can relate more easily before flashbacks kick in.<br><br>12 august 1944, town of Sant'Anna, Italy: German soldiers killed 560 people, including women and children. You'd think such an awful event would deserve to be treated in a straightforward manner, without adding clichés (which here reach an almost toxic level) or making stuff up. But race-obsessed filmmaker Spike Lee isn't really interested in that terrifying war crime, but rather in the (fictional) story of four Afro-American soldiers. <br><br>See, there was an interesting movie to be made about the Buffalo Soldiers; the problem is, using a real-life massacre merely as a backdrop for an invented story is callous and tone-deaf. The Sant'Anna tragedy deserved its own movie.<br><br>Besides, the movie falsifies history, changing crucial circumstances which lead to the massacre and blaming it on the (fictional) betrayal of a partisan.<br><br>5/10","user":"petra_ste","rank":[62,88]},{"title":"Bad In So Many Ways","rating":3,"date":"1 October 2008","review":"Spike Lee dropped the ball in so many ways. Casting that brought in mostly weak actors. Jerky scenes that have no bearing on the story line. What was really annoying was the \"hook\" in this film. The head that is continually carried throughout the entire film that was uneventful to the storyline. The over dramatic scenes of racial confrontations were preposterous. I really wanted to find this movie worth the 7 bucks that I dished out but alas! It was not the case. If Spike Lee would go back and watch Eastwood's film \"Letters From Iwo Jima\" again he would learn the elements of war were much better presented. If Spike Lee thought he was going to set the record straight about blacks serving in WWII he missed the target terribly. Many scenes fell apart. One example that stood out was the scene where a Nazi officer spares the life of one of the black soldiers and then hands him a loaded Lugar hand gun. Really now...Anyone going to buy that ridiculous scenario?","user":"james1844","rank":[58,82]}]