[{"title":"Bird flu is certainly getting out of control!...","rating":5,"date":"17 June 2009","review":"Vince (Stephen Graham) is going through the final stages of his divorce and to help him through this period his friends Mikey (Noel Clarke) and Neil (Danny Dyer) decide to take him and a few of the other boys to a remote village outside the humdrum of their London lives to get, in Dyer's own words; 's**tfaced'. However, when they turn up to the incredibly eerie village of Moodley to find flesh-eating, man-hating, cannibalistic women who want to do nothing more than rip out their internal organs and eat them for breakfast, the boys realise they have bitten more than they can chew and must fight their way through a barrage of blood-thirsty women in the most misogynistic way imaginable.<br><br>The premise of the film completely reflects the manner in which Jake West approaches this project, with a gleeful nod towards plenty of harmless sexist humour and cheap gory death sequences that are all nice, light-hearted and fun. Neil, Vince and Mikey are all your typical working-class likely lads out to simply flirt with the opposite sex and drink as much as their body-weight, with Danny Dyer in particular needing to place little effort in recreating his Cockney 'laddish' persona (yet again) on the big-screen. While Dave Schaffer's script contains many easy-going humorous gags to keep your attention ticking over while the next axe, gnome or sword heads to try and end the boy's misogynistic ways and eliminate the male chromosome all in one.<br><br>'Doghouse' is nowhere near the heights of Pegg/Frost's rom-zom-com-supremo 'Shaun of the Dead', but it isn't the worst film you will see this year. At a short running time of 85 minutes, you'll be cheaply entertained with boys being boys and women being...err, evil, vicious, un-relentless and, well women (just kidding!). This a film you'd probably enjoy seeing more after you've been kicked out the local Pub at closing time and are heading home with your Chicken Jalfrezi in one hand and the DVD in the other.","user":"the_rattlesnake25","rank":[46,68]},{"title":"The female of the species is more deadly than the male.","rating":8,"date":"22 October 2009","review":"Vince is crestfallen, his relationship with his lady is over. Enter his blokey bloke mates who decide to take him out to a country village for a fun lads weekend. Trouble is is that the village of Moodley has seen the female population turned into an army of man-eating \"zombirds\" out for male flesh.<br><br>No doubt about it, Doghouse will not so much divide in two the horror/comedy faithful, it will dissect them into little pieces and continue to do so for quite some time. Already it has been chastised for being misogynistic, a poor imitation of British genre benchmark Shaun Of The Dead, and more baffling to me, a waste of British talent. All of which are wrong. Of which the last statement from me has probably already seen a number of internet users vote negative on this review before reading further. Cest la vie, but if you are still with me? Then thank you for your time.<br><br>Doghouse is one of the most in tune self mocking British comedies concerning lad culture of recent times, arguably ever? Fifteen minutes into the film our group of \"lads,\" after having been introduced to us through a series of attitudes involving their partners {there's a gay guy too folks}, stand together and a phone rings. The ring tone is that bastion of British machismo, the \"Match Of The Day\" theme, our group collectively dig into their pockets for their mobiles thinking it may be their phone ringing. From here on in, the marker for what type of film Doghouse is has been set.<br><br>From there we lurch into a battle of the sexes with wry observations as our \"heroes\" do battle with zombiefied female stereotypes. Hairdresser, dentist, schoolgirl, goth girl, a bride, horsey type and even a god damn lollipop lady. All scripted with astute knowing and self-critique from Dan Schaffer as the \"lads\" veer from scared cat wimps to once again being sexually brave Ramboesque types. Honestly, and I speak as a seasoned British male, some of the dialogue here is as sharp as the sexy zombie hairdresser girl's scissors are. Oh yeah, forgot to say that the blood flows for those of the gore persuasion, very much so. Some scenes are horror delights, they may come with a quip or a tongue in cheek reference, but there is some fine blood letting stuff here.<br><br>In the cast you have Stephen Graham, Noel Clarke and Danny Dyer. I wonder how many folk have noticed the irony that all three guys are not long out of being in \"blokey\" hooligan type films? Dyer does his usual Cockney wide boy act that will annoy those who don't buy into it, but really there is a reason he plays to type, it's because like it or not? He's effing good at it governor. Graham and Clarke are both British treasures, not based on this film you understand, but they have much ability and it's great to see them having such a great time. While the support from the likes of Lee Ingleby as a horror comic/Evil Dead fan is truly \"nudge nudge-wink wink\" enjoyable. Director Jake West has moved considerably a few notches forward with this picture, so add his name to the list of British genre directors to watch alongside Paul Andrew Williams and Christopher Smith.<br><br>Comparisons with Shaun Of The Dead are folly, that film is an awesome parody of the genre, a film that remains a sub-genre highlight. This is a different film, though, one that parodies the genre with a totally focused observational narrative on a culture that warrants humorous inspection. So be it, I will happily watch this (and have done) with any of my film loving lady friends because I know they will see the pointedness of it all. And besides, any film that slots in Space's magnificent \"The Female Of The Species\" has to be worth a look at least. 8/10","user":"hitchcockthelegend","rank":[37,57]},{"title":"Sort of like a Brit version of From Dusk Till Dawn but with zombies instead of vampires.","rating":7,"date":"11 October 2009","review":"This is a reasonably funny and campy horror movie that starts off as a bunch of blokes on a road trip to cheer up their recently divorced mate. Since the gathering was sudden and unplanned they catch a lot of crap from their women for leaving on the trip- hence being in the doghouse. They are on their way to a lovely town where the women outnumber the men 4 to 1.. there's women EVERYWHERE! Too bad that winds up not being such a good thing for them. LOL!! If you like a couple of jokes in between killing lots of female zombies, this is your movie, there is some decent creativity with the zombies, just remember the whole thing is tongue in zombie cheek.","user":"dilbertsuperman","rank":[27,44]}]