[{"title":"Good, but not GREAT!","rating":7,"date":"13 October 2010","review":"My grandmother was a parent during the '50's and liked everything neat and clean and in its place. Heaven forbid if things get too out of hand; too \"real\". I have waited my entire life for Hollywood to tell Secretariat's story and after watching Disney's Secretariat my heart remains unsatisfied. It was a good, \"feel good\" movie, but \"good\" is the keyword. I felt like Grandma edited this movie. Again, it is a good movie with some interjections of great cinematography, yet Secretariat was a GREAT horse and deserved a GREAT movie. This was an Oscar winning story, with an Oscar winning cast, but the script was emotionally impotent. There were no risks and risk is what horse racing is all about. The movie is so safe and there wasn't anything safe about the facts that surround this horse and his rise to be the greatest race horse that ever lived.<br><br>Still today, when I watch Secretariat run on YouTube, I cry!!! I'm not sure why, but the tears flow from the depths of my being. Rationally, I try to tell myself that he is just a horse, but something overcomes me every time, no matter how many times I watch him run. That overwhelming surge of emotion is what this story deserved. If you've ever been in the presence of a great horse, you will know what I am talking about. They are strong and confident. You can feel their aura. There is a low rolling thunder of excitement when you are near them. Talk to the people who were there. Read the first hand accounts of their emotional state when they saw this horse run. He was mesmerizing, captivating, unexplainably breathtaking. The audience deserved to feel the thunder roll through them in every scene.<br><br>I expected so much more from director Randall Wallace. The power and emotion of Braveheart, We Were Soldiers, Pearl Harbor, The Man in the Iron Mask, is what Secretariat deserves. Where was that? I'm not sure what research he did for this movie and how much his hands were tied by the real life characters or the studio, but the main character became the background and what was in the forefront was a \"sugar coated\" conflict of a woman with a driving passion and the place society and her family was trying to lock her into; however, even her passion didn't spill out onto the audience as it should have. I felt like the accomplishments of Penny Chenery and Secretariat have been shrunk down and placed into a nice, neat little box fit for a good little housewife and her sweet little horse. I felt as if I was the one being squelched, because I wanted so badly for everyone to share the emotion I feel at the sheer audaciousness when this horse ran. To accomplish what they accomplished, he and his owner had to be completely audacious to rise above the negativity and overwhelming odds surrounding them.<br><br>Diane Lane is one of my favorite actresses; however, her role left me doubting the character. For example, when a woman talks to her horse, she does more than look into his eye for a few seconds and say, \"Well OK then\". When a woman truly needs to know something from her horse she breathes him in, they breathe each other in, as their souls entwine and one knows the other. You will see it on his face and you will see it on her face, without human words being spoken. This is a rare and special event, but it happens, and it could have carried this movie. If you have seen Diane Lane in \"Unfaithful\" you will realize this is an actress that could translate this kind of communication and emotion to the screen.<br><br>The audience should have been allowed to feel the emotional range that surrounds all involved in preparing a horse for the greatest races any thoroughbred will ever run. Just watch horse racing on television and you will see real raw emotion that these people explode with at the end of the race. So much was on the line for everyone involved and yet throughout the movie everyone handled the stress with subdued emotion, never getting too far off the scale. Just when you thought someone was going to show some real feelings, they apologized for it. Real life is just as ugly as it is beautiful. Without the dark of night, the brightest stars would never beam their intense beauty upon us. Every masterpiece must have its extreme contrasts to fulfill the emotional needs of its audience.<br><br>I'm not blaming anyone. I am sure everyone involved did their best. I am simply sharing with the reader my disappointment in what I thought would be a thrilling tribute to a horse so deserving.<br><br>Ron Turcotte said the film captured the story \"pretty well\". I ask you, is \"pretty well\" good enough for the greatest race horse who ever ran on the track? Secretariat's heart was two and a half times the size of a normal horse's heart; I feel the portrayal of his story should have been two and a half times the size of any regular movie. He gave us everything he had when he ran the Belmont; thirty-one lengths ahead of Sham who was an amazing, record breaking horse in his own right. Don't we owe it to him, to give him everything we've got, to see that generations to come understand the events that transpired to make him who he is? Have we as a culture become so jaded that there can be no magic in the truth? Can the epic only be found in fiction? I don't believe it. I believe that purity of a moment of perfection forever locked in time is where magic can be found and that magic is why it brings inspiration and tears to the eyes of the soul who seeks it.<br><br>Suzette Howard","user":"howardhorsehold","rank":[105,144]},{"title":"Wonderful movie","rating":10,"date":"2 December 2010","review":"Secretariat is not only the first film in many years where both old and young can share the same theater; it contains the elements that make you both laugh and cry as most good movies should. From peaceful mornings at sunrise we experience exhilarating horse racing that brings pensive waiting for results of a race already in the history books.<br><br>I agree with the Movieguide comments: \"SECRETARIAT is a very uplifting, inspiring, exciting movie about a true story, the story of a determined woman who raises one of the most successful, dynamic racehorses of all time. SECRETARIAT is stirring and joyful, with many references to God, Jesus Christ and the Bible and a pro-capitalist message celebrating American values\" Now, what's wrong with this picture? It is refreshingly entertaining.","user":"victorysongster","rank":[38,53]},{"title":"Big Red with Wings","rating":6,"date":"16 September 2010","review":"Greetings again from the darkness. The story of Secretariat is legendary in the world of thoroughbred racing. Being a sports fan, it is always fascinating to witness domination by a singular athlete - Michael Jordan, Tiger Woods, Roger Federer. Secretariat was the Michael Jordan of racing. In 1973, Big Red dominated racing like no other.<br><br>What makes this even more amazing is that Secretariat is actually the second most interesting story ... his owner, Penny Chenery Tweedy (played here by Diane Lane), was his match in competitive spirit. This Disney movie actually spends as much time on Ms. Tweedy as it does the fabulous horse.<br><br>Disney does what Disney does best. This is an all out feel-good, rah-rah movie in the vein of \"Seabiscuit\", \"The Rookie\", \"Rudy\" and even \"Hoosiers\". Don't expect in-depth analysis of the racing world or horse training or even horse farm operations. This movie is made to deliver a warm fuzzy via the perseverance of a strong-willed lady and an incredibly majestic animal.<br><br>Expect some over-the-top touches such as John Malkovich's portrayal of trainer Lucen Laurin, horse-whispering by Ms. Lane, and plenty of heart-string tugging as is customary from the fine folks at Disney. Expect historical facts to be treated a bit lax in some scenes (no mention of 1972 Derby winner Riva Ridge, also from the Chenery stables). Expect none of that to matter as this is a crowd-pleaser, not a documentary.<br><br>In addition to Mr. Malkovich and Ms. Lane, there is some fine support work from Fred Thompson, James Cromwell and Nelsan Ellis (so great as Lafayette in True Blood). Directed by Randall Wallace, whose most recent directorial effort was 2002's \"We Were Soldiers\", this is entertainment for all ages and an easy introduction to the champion that was Secretariat.","user":"ferguson-6","rank":[62,92]}]