[{"title":"an energised piece of work that has to be seen to be believed","rating":8,"date":"13 August 2019","review":"A chance encounter between a young boxer and a prostitute causes an all out gang war and they are both caught right in the middle of it. Takashi Miike anyone?<br><br>When one goes to see a Takashi Miike film one expects certain things. It has to be grotesquely violent, slightly tongue in the cheek and an over the top story that that would never work with anyone else at the helm. FIRST LOVE delivers everything and more. In fact it is a surprisingly coherent, thought through and even touching film that works on many levels. It is drama, it is a comedy, it's an action film and it's a thriller, where all elements are a perfect fit.<br><br>This is classic Miike with Japanese yakuza and Chinese triad going at each other over nothing. It may be a bizarre and violent affair, but the cut off limbs and heads seem a bit Monty Pythonish, which makes the gore slightly less disturbing.<br><br>There's a lot of fun to be had here, this is a sort of film Tarantino would like (he did praise Miike as one of his favourites) and this film is Miike at his best.<br><br>With its jazzy upbeat soundtrack and out there action, this is an energised piece of work that has to be seen to be believed.","user":"mjfhhh","rank":[25,32]},{"title":"Expected a Little More","rating":6,"date":"1 October 2019","review":"Takashi Miike's filmography is one of the most impressive out there; he's directed over 100 films, with many of them being cult classics like 'Audition' and 'Ichi the Killer.' He's a filmmaker that's constantly pushing boundaries, exploring new horizons and delivering memorable spectacles that you want to see again and again.<br><br>So why does 'First Love,' a film about a boxer and a call girl in the crosshairs of a violent war between Yakuza members and various killers searching for a bag of drugs, feel so average?<br><br>Masa Nakamura, a previous Miike collaborator, wrote the admittedly very detailed screenplay for the film and manages to introduce multiple characters and subplots that believably converge into one climactic showdown, yet there are certain characters that are built up to be forces not to reckon with and end up not contributing much to the film, or living up to their \"legend.\" The central relationship between the main characters, Leo and Monica (which turns out to be a moniker), feels underdeveloped and turns out to be not as important as one would expect. Even a reoccurring character she hallucinates from the film doesn't provide much development for her character and ends up being a red herring of sorts. I previously read rave reviews for the film and many critics called the film \"hilarious,\" but there's really only one character who provides some chuckle-worthy lines; everything else feels serious and dark, especially the outlandish shootout in the climax, which could have gone absolutely balls-to-the-wall in its execution, but plays it rather safe.<br><br>Visually, the movie looks great. The actors all perform extremely well and I was definitely invested enough to wonder what would happen to each character as the film went along. It's not a bad movie by any means, but from a director who's made some insane movies, I had expected around the same level for this one. It is still worth a watch, but go in expecting \"chilled out\" Miike.","user":"arlosanchezofficial","rank":[16,21]},{"title":"Good but not great","rating":7,"date":"27 February 2020","review":"Good casting, great cinematography, fitting score and decent directing, but there were obvious plot and technical issues. The 108 run time felt much longer and some scenes were too long and/or unnecessary. The choreography and camera shots were terrible in the action scenes. A good film but could've easily been great.","user":"TheTopDawgCritic","rank":[8,14]}]