[{"title":"Too cheesy for grownups so hope kids like","rating":4,"date":"26 May 2010","review":"It was beginning to look like a good story. Then the cheesiness came into play. A bit over acted and silly. Again, maybe the very young kids will like this adaptation. I soon lost interest and wished Gilbert Gottfried (the goose) would just shut up already.<br><br>The creation of Jack and the Beanstalk, I believe, was hurried and not too much focus on creation. I mean, the giant was not even a giant, more like a big puppet, etc.<br><br>Most likely you will take the kids along to a theater to see and hope they will enjoy just the silliness of it all and not my luck of seeing a screener as an adult and no kids along while expecting a totally different style of movie. A More serious adaptation maybe? I think Disney would have done a better job.<br><br>My forecast for reviews of Jack and the Beanstalk will be, in grade level, user's (C) and critics (C). Or a 5 rating in IMDb.","user":"bananaspider","rank":[21,24]},{"title":"They don't make 'em like this any more, thank God","rating":2,"date":"18 July 2011","review":"You know how your granny complains that they never make nice films any more, that the whole family can sit down and watch? This was clearly designed by your granny, as something nice and old fashioned; the trouble is, I think the old bird's getting a bit senile.<br><br>It goes like this: Jack lives in fairyland, where everything is a fairy story, and he wants to be a hero. But in order to do so, he has to go on a quest and learn about things like Sacrifice and Perseverance and I'm sorry I just can't go on. I just can't.<br><br>It's not the clichéd plot that kills this movie. It's not even the hideous, explosion-in-a-cuteness-factory design of the sets. It's the acting, and the characters. They're just AWFUL. Jack himself is the kind of precocious brat who needs a good whack upside the head, but he's nothing compared to poor Christopher Lloyd, who is forced to explain every joke very slowly, over and over, as though he's speaking to an audience that's suffering from major brain damage. Lloyd is better than the frantically mugging Wallace Shawn, who plays multiple roles, all of them dreadful. Even that shameful performance is far, far better than Gilbert Gottfried, who is just insufferable as a human chicken. Did no one look at that character? Did no one think that maybe, just maybe, a movie with that horrible, screeching nincompoop at the centre of it might be a bad idea? The only cast member who comes out of this mess with any dignity intact is Chloe Moretz, who filmed this just before she went on to fame in Kick-Ass. I think it's safe to say she won't be putting this movie in her show reel, though.<br><br>This is an old-fashioned family film, in all the wrong ways. It's far too twee and cloying for adults, and much too cutesy for kids who have been brought up on the harder edges of Pixar or Disney movies. There's never any sense of even slight danger, so that it's impossible for adults or kids to get involved in the film. I wouldn't recommend letting your kids see Kick-Ass, but there are a thousand better movies for them than this.","user":"mattbaxter72","rank":[19,22]},{"title":"Just Horrible","rating":3,"date":"25 June 2017","review":"Once you realise that the director works there n the make-up department for most of his life (and still today) you can see why this over acted, badly written, terribly cast sh*t flick is so bad. What you can't believe or understand is how he was allowed to direct it. There must be a much more interesting story there. The writers have only written animated scrips before, so no live film experience which explains why every character in the famous tale is so 1 dimensional. Cameos don't add anything and I sWear you can see the girls eyes moving in some scenes as she reads off dummy cards. Just crap.","user":"stevesky","rank":[3,3]}]