[{"title":"Much better than advertised","rating":7,"date":"14 March 2008","review":"The advertisements for this movie do it serious injustice. I was standing in the lobby of a movie theater at a free showing, and almost didn't walk in, because the trailers and ads had me convinced it was a complete waste of time. The advertisements portray the film as being merely a vehicle for shirtless boys to beat on each other and hot girls to wear bikinis. While there is no shortage of either, the movie has a strong underlying theme and a decent plot.<br><br>At the thematic level, the movie is about accepting responsibility for your actions, controlling your emotions, and making good choices. It's as much about motivations as macho.<br><br>Yes, it is a teen-targeted movie. You've got rich kids running around in massive mansions driving expensive cars, but that's just the setting. You've got people beating the crap out of each other, but that's just a plot device. The heart of the movie is about personal growth and making choices. It's not an empty action flick or a taped brawl.<br><br>It's not the best film of the year, and it may well wind up as a late night cable movie in a few months, but it's nowhere near as bad as people expect. It's definitely worth the price of a rental, and worth the $10 to see it in theaters, if you've got no other plans. I blame the negativity largely on the advertising, which tries to sell it as \"just another fight movie\".","user":"zachary-pruckowski","rank":[164,221]},{"title":"Although this has been done 1,000 times","rating":8,"date":"5 August 2008","review":". . . Never Back Down was still a really great movie that I had a lot of fun watching, and I was surprised with how much I actually ended up liking it. Of course this film is really very predictable and was basically just a rip-off version of Fight Club, The Karate Kid, and movies like that in general that was basically aimed at 16, 17, and 18 year old boys, but it was really enjoyable if you just judge it based on an actual movie and not what audience it's trying to pull in.<br><br>It did get pretty annoying and downright unbelievable at times, but I have to give this movie it's props, because the acting was done very professionally for a bunch of model-body teenage actors, and it also managed to keep me so interested and entertained through the entire film with semi adroit and crafty, motivating scenes and material matter. It gets a bit mediocre, as I have said, and some stuff just falls flat, but they handle everything they lack so well with other interesting and appealing scenes and substance, excluding the featherweight dialogue, haha. <br><br>Overall, I was so happy with the outcome of this movie, because while being cliché, and certainly not worthy of winning an Oscar or anything like that, it was really enjoyable, and I had a great time watching it. If you lower your expectations and free your mind, I bet you will too. I suggest you see it if you can appreciate it for what it is. If anything else, there is Cam Gigandet and Sean Faris shirtless.","user":"Dragoneyed363","rank":[87,121]},{"title":"Entertaining, as long as you don't think too hard.","rating":6,"date":"8 August 2008","review":"Yes, it's just a revamped Karate Kid.<br><br>But with MMA, not just Karate, although I did have the occasional urge to shout \"Cobra Kai!\" when the bad guy came on screen.<br><br>Some cool action, basically just MMA (like in the UFC) that's been \"hollywoodized\" to be showy, \"underground\", and performed by supposed teenagers.<br><br>Djimon Hounsou is wasted on this film, but does fairly well at being the token real actor, giving it some tenuous legitimacy. On the upside, probably a more believable martial arts instructor than Pat Morita... physically, at least.<br><br>It's a great movie to just turn off your brain to, and watch lots of girls in bikinis and guys beating each other up. Pleasant, mindless T&amp;A/Action.","user":"FourNineFoxtrot","rank":[54,75]}]