[{"title":"Sex and the City film adaptation insults HBO series of same name","rating":4,"date":"19 December 2013","review":"'Sex and the City,' based on the hilarious, poignant HBO comedy series of the same name, is grossly insulting. In a strong divorce from the series, the movie picks up five years after the series finale - where we find out that each one of the characters have become vapid, soulless versions of their former selves. Now, writer Carrie Bradshaw (Sarah Jessica Parker), and her friends Miranda Hobbes (Cynthia Nixon), Samantha Jones (Kim Cattrall), and Charlotte Goldenblatt (Kristen Davis) walk around New York obsessing over shoes, handbags, and love. <br><br>Carrie Bradshaw was, at the end of the show, an independent woman - not the needy girl she started out as. The movie turns it's back on Carrie's development as a character, shaping her into the stock romcom lead. Think Katherine Heigl with no charm. She is now painfully unfunny, shallow, and quite possibly retarded. She spends the first half the film setting herself up to have the man whom supposedly loves her jilt her - which he does. The second half of the film, Carrie spends complaining about literally everything, dying her hair brown, and discussing bags and love with a painfully useless, annoying Jennifer Hudson, as Carrie's new assistant Louise from Saint Louis.<br><br>CARRIE: \"Louise from Saint Louis. Oh you brought me back to life.\" LOUISE: \"And you gave me, Louise Vuitton.\" <br><br>Yes the writer of \"The Real Me\" and \"A Woman's Right To Shoes\" actually wrote this garbage.<br><br>Lawyer Miranda is now a frigid shrew who swats her deadbeat husband away like a fly every time he tries to get near her - and spends the entire 2.5 hours complaining about how marriage changed her, it made her move to Brooklyn. She is no longer likable, funny, or smart.<br><br>Meanwhile, housewife Charlotte spends the 2.5 hours prancing around like a little girl, screaming at the top of her lungs, and carrying her confused, Asian daughter around like a dog in a handbag. The problem with continuing Charlotte's storyline on the show is her storyline came to the only logical conclusion it could have had at the end of the show. Now, it' just a retread through old territory. Davis is ultimately given a thankless role in this film. <br><br>However, it is Samantha who is given the most honest adaptation. While certainly a cartoon version of her former self, Samantha's story revolves around her inability to maintain a monogamous relationship - despite being very much in love. However the payoff is ultimately ruined as Samantha is no longer human. <br><br>This incarnation of 'Sex' is so incredibly shallow - it basically acts a prop to advertise luxury goods. The most obvious scenes to illustrate this are when Carrie tries on designer wedding dresses for a Vogue shoot, which goes on for an excruciating 10 minutes, followed closely by Carrie and co. going through her closet trying to decide what to take to her new apartment with husband-to-be Big (Chris Noth). The scene is ultimately pointless as she is moving to a closet that is 10 times to the size - which, if you can imagine it - is actually a plot point in a film that will make you feel compelled to throw out every designer label you own. The show was about the importance of following your own trajectory, and self actualization. The film abandons this concept.","user":"ithinkimdeck","rank":[21,24]},{"title":"Ugh. What a shipwreck.","rating":1,"date":"2 June 2008","review":"Like many of the others, I am a huge fan of the series (I own all the DVDs and have watched each episode multiple times).<br><br>The translation to big screen just.doesn't.work.<br><br>There was so much melodrama and fake crises! The male characters were like shadows of themselves. Big was like an avuncular sugar-daddy at the beginning and devolved into a limp-wristed dweeb by the time he thwarted Carrie.<br><br>And Carrie was a shrill, melodramatic idiot who ultimately gets what she deserves. What intelligent, independent woman in her right mind would go back to the jackass who screwed you over multiple times? Why can't she just be independent? That always bothered me about the series finale.<br><br>Miranda seems melodramatic and overreacts to Steve's indiscretion -- which comes out of nowhere and feels like a poorly timed plot device.<br><br>Smith, who is starting to weather like Clint Eastwood, came off as way-too-casual when Samantha gave him her decision. He acted like such an airhead surfer-dude, which was never apparent in the series.<br><br>Stanford and Anthony were like caricatures of themselves. Oh, we have a wedding, let's work in the flaming wedding planner! And didn't he and Stanford dislike each other? Why were they palling around like best girlfriends?<br><br>I thought it was curious that Carrie's friends all showed up to help her pack her apartment, but they were nowhere to be found when the unpacking was being done. What kind of friends are those?<br><br>The only redeeming acting came from Kim Catrall and Kristen Davis. They are totally comic pros and I enjoyed their schtick, even if it was silly. They at least pulled it off. As for Parker and Nixon, they acted like a couple of shrill witches when scorned. Ugh.","user":"donnapaz","rank":[112,152]},{"title":"One","rating":1,"date":"2 June 2008","review":"This movie was such a disappointment: so disrespectful to the series, the characters' original complexity, and women's complexity!<br><br>I was particularly let down by the script. First of all, the jokes were not funny. From the 'Saint Louise from St Louis' to Charlotte's Mexican incident, everything was so unlike Michael P King's style. Then the plot: predictable (Samantha's ring/ Smith being the guy getting it to her; the password of Carrie's email folder being 'love' like on the key chain...) but most of all characters were out of their 'tv series' parts. Especially Carrie: hitting Big with the wedding bouquet and screaming at him in the middle of 5th ave, really?!? Planning a honeymoon in Mexico, really (btw, the guy greets them with 'welcome to Mexico', that's 'broad' and silly)?!? Telling Miranda 'you ruined my wedding', really? That dinner scene seemed like out of an episode of The Hills.<br><br>I personally also found Jennifer Hudson terrible: she already won the 2008 Razzie to me (altough I should check if Sharon Stone is coming out with a new movie...).<br><br>In general, if you think of what you saw in this movie without the affection you have for these characters, you must admit this is a terribly corny romantic comedy.<br><br>Think of how wonderfully touching and poignant some episodes were. Like the one when Miranda finally took the courage to tell her feelings to Steve... It was titled 'One', and it was indeed a fully satisfying, beautiful episode.<br><br>This movie is just a 1/10...","user":"matt75-1","rank":[83,113]}]