[{"title":"Removed the good stuff","rating":1,"date":"22 September 2013","review":"What was the point? The director just went through and removed all the good stuff from the first movie. The original is based on events which took place in Elmore City, OK and yes, they banned dancing. It's hard for today's teens to fathom how religious the 80s were, which might be why they can't grasp a movie like this. You can't make a modern remake of this movie because today's kids aren't suffocating under this type of extreme religiosity. In the original, the ban is on dancing, including a teen prom. The kids are only being reasonable to protest this. In this remake, the ban is on \"lewd and lascivious dancing\" which the teens think they have a right to perform in the streets.<br><br>In the original, Ren is an old soul. After his father dies, Ren and his mother must shack with his uncle, moving Ren from Chicago to a tiny town where dancing is banned. Instead of making things more difficult for his mother, Ren tries to fit in and treats everyone politely and respectfully, which results in him being bullied by the small towners. He even tolerates this and tries to play by their rules, never once pointing out the obvious insults a typical obnoxious city teen would have for the rural folks.<br><br>In this remake, Ren is instead that typical bratty teen, thinking an accident of birth makes him better than everyone, and greeting practically the entire town with the insult that they are hicks. Despite this, the town isn't even that small and is actually multicultural, and the kids dance to hip hop! The only issue the kids face is that their parents don't want them bumping and grinding too suggestively to it! Yeah, that's Ren's issue. His parents are dead, but that's his issue. Even the judge in this town had long hair as a teen, and Ren's uncle reminds him of this, to justify Ren blasting the town with noise pollution.<br><br>In the original, Ren must struggle to please an unreasonable uncle who blames him for things he didn't do, while this uncle has Ren's back before even asking him if he's guilty. Ren basically has no real struggles to speak of, yet he does a lot of whining anyway. We are supposed to sympathize enough over the loss of his parents to support him humping his girlfriend openly in the streets. The uncle thinks his little girls (and all little girls) should be exposed to this. Ren even declares to the adults that \"as kids, its our job to do stupid things\", yet he doesn't expand on what the jobs of adults might be.<br><br>Ariel's father protests not so much because he's a pastor, but because he maintains some shred of hope that his daughter is still a virgin, but when she informs her father that she's not, and Ren informs her father that his daughter is a slut, the pastor gives up and accepts that he will be a grandfather soon. Ren's revelation that Ariel is already hot for his bod means she should be allowed to dance lewd and become a teen mother.<br><br>In the original, the pastor and Ren finally bond because the pastor lost his son and Ren lost his father. Ren cleverly uses Bible verses to make his point at the town meeting, because it is the only way to convince a highly religious town that bases all of their rules on the Bible. He does this because he is a wise, respectful young man who isn't paranoid of a little studying. In the remake \"sir, your daughter is already a slut\" is the extent of Ren's argument to the pastor, yet it is (apparently) oddly persuasive.<br><br>This movie is just laughably bad, so much so that even people who can't quite explain why it's laughably bad still know that it is.","user":"rdnyscott","rank":[24,27]},{"title":"They cut too loose.","rating":2,"date":"2 July 2012","review":"Yes, the original film was like a lot of 80s movies--campy, silly and sometimes just about the music—but this remake should have been forgotten. While the writers kept quite a few original lines and the director kept some iconic scenes, something was lost in translation. That loss cannot be blamed on any one part of the film but rather the disgraceful whole.<br><br>There some changes that I enjoyed. The opening scene, though storyline changed a bit, had more of an impact behind the impetus of the town's laws. The dancing was top notch by today's standards though a little raunchy a time or two. Kenny Wormald did justice to Kevin Bacon's dance in the warehouse, changing it just enough to make it his own. Julianna Hough kept up with him every step of the way during the dance scenes. Even the at the end, it was refreshing in this day of girl-power to see the football team told by a teammate to \"man-up\" and ask the girls to dance.<br><br>That said, the rest of the film is an empty cardboard parody, lacking any sense of poignancy that endeared the original to a generation. The soundtrack fell below the standard set in 1984, though they sort of kept Whitney Houston's original \"Let's Hear it for the Boy\" when Willard learns to dance (a highlight in both films). Also, they changed Beamis Mill (which I believe dealt with concrete) to a cotton gin mill, very poor taste.<br><br>The characters are hollow and thanks to the deletion of several key scenes, the actors are not given a chance to redeem themselves and give us characters we can empathize with.<br><br>Kenny Wormald was a great choice for the dancing scenes. It's impeccable and when when he dances you can feel his passion come through the screen. His acting, however, was limited to cockiness and poker face. Kenny seemed to struggle to find the balance in that sweet spot between underacting and overacting. Two scenes that clearly show this is when his aunt asked him why the dance was important and when he stands before the town counsel. Both times lack passion, conviction and inflection. He could very well have been reading the nutrition panel on the side of a bag of bread. The closest I came to identifying with him was when his Uncle talked about him taking care of his mom. Kenny could not seem to remember he was supposed to be a rebel with a cause and not just another rebellious teenager.<br><br>Julianna Hough is gorgeous and confident. Confidence like hers can hinder a performance when you are supposed to be playing a wild child who is acting out because of insecurity. I am trying to give her the benefit of the doubt as key scenes were not in the film that would have brought depth to her character. You miss out on the deep reasons behind the hurt and vulnerability that Lori Singer pulled off wonderfully. For example, the scene about types of music in the original between Ariel and Shaw went a long way to deepen the dynamics of father-daughter relationship, and helped build each character's journey in the minds and hearts of the audience. Or the scene with the music box, showed the vulnerability of Ariel as she shared who she really is with Ren, brave and yet fearful of rejection for her real self. Those scenes might have saved Hough's performance. Instead, her version of Ariel came across as an angry brat who looked good dancing.<br><br>Dennis Quaid looked ill-at-ease throughout the entire movie, and even when he's angry he looks like he might lose his breakfast. Again, I am trying to give his performance the benefit of the doubt as they cut several key character-development scenes which would have shown how he grew throughout the course of the film. For example, the book-burning scene in the original is a major turning point for this character. John Lithgow's heart (original) could be seen in that scene when he sees what he's done. It's a point of no return when he had to really think about what he'd done and why and how he will proceed. Had they kept that scene, he would have reason, he would have believability. Now, instead, Shaw comes across as another fumbling close-minded dad/leader who had no clue about real life until his wife and daughter school him, along with a very brief talk with Ren.<br><br>Andie MacDowell didn't have much chance with the majority of Vi's scenes cut. That said, had been included them it would not have mattered. Only once during this film did she remind me of the quiet strength and dignity that Dianne Wiest brought to the role (town meeting). Her few scenes with Dennis Quaid are almost belittling and instead of the gentle correction of Vi quietly convicting Shaw Andie's Vi seemed to constantly condemn him.<br><br>Miles Teller as Willard is probably the most enjoyable of the entire cast. I know some out there have decried his performance, but I think he took the role and made it his own while retaining the child-like naiveté that was Willard. He was a little on the over-sexed teen side of things in this film (which got old), but otherwise, he was fun to watch.<br><br>The flaws are many in this film. I would give this film 2 out of 5 stars simply for the dancing, The tag line is \"Cut Loose\" and they stripped away any of the sentimentality that would have made this a fun film to watch over and over again.<br><br>They removed what made Footloose so foot loose. They simply cut too loose.","user":"zimmersgirl-412-382593","rank":[21,24]},{"title":"If you've seen the original no need to watch this one.","rating":3,"date":"29 September 2013","review":"I love the original and was really excited to see this remake. I was very disappointed. They copied the original, just added cell phones and CD's and a few modern dance moves. Same soundtrack, just a hint modernized, I'm pretty sure even some of the lines were exactly the same. There was nothing creative or original about this movie.<br><br>You know that feeling where you see an actor/actress in a certain role and then you see them in another movie and it's like they were told to keep the same character but the film's setting is so completely different and all you can think is 'no, this is wrong, this just doesn't work'. It's exactly what I thought while watching this film but instead of the character(s) being wrong it felt like the whole movie was wrong.<br><br>I would have even accepted it if the only thing they kept was the basic concept and redesigned the rest from scratch. But they played it too safe and ended up with a copy instead of a fresh film.<br><br>That said if you've never seen the original Footloose it's alright.","user":"Myrii","rank":[20,23]}]