[{"title":"Not bad even if you have seen it before","rating":7,"date":"14 July 2007","review":"I will agree that Kevin Sorbo has come into his own in the acting arena. He is quite the leading man in the made for television romance field. He does well with the material. In fact everyone one in the film did well with what they had. Cynthia Watros is lovely as usual as the ever present whore with the heart of gold. Nick Chinlund is always good whether he plays good guy or bad guy and what can you say about Wings Hauser. He is always wonderfully psychotic even if he is playing it low key. I got a little annoyed at the dialog between the male and female leads, they just did not have enough together time for me to believe that they were made for each other in that redeemed way these films have. All in all an OK way to spend 2 hours.","user":"skooshie","rank":[21,24]},{"title":"Seen it all before, but...","rating":9,"date":"27 August 2007","review":"Wronged, silent hero thirsting for justice (and vengeance), finding a new purpose in life, a new family and saving the underdogs - and subsequently - a whole town from the evil, greedy, rich and powerful landowner aided by a corrupt sheriff and his hired guns...<br><br>Yeah, it's been done before, at times even better. But: There were some shots and scenes to be seen at times worthy of Sergio Leone.<br><br>Sorbo's, Watross' and Chinlund's acting is out of this world - and it captures the atmosphere of the old, bad, wild west marvelously. I do hope to see all of them in even more demanding projects. As well as the little girl playing Emilia, who did a really good job as well. <br><br>Highly enjoyable experience.","user":"roman8","rank":[8,8]},{"title":"Kevin Sorbo's First Western","rating":7,"date":"22 July 2007","review":"Having been a fan of \"Hercules; the Legendary Journeys\" and \"Andromeda,\" I just had to see Kevin Sorbo in his first western.<br><br>The story follows a pattern set by popular westerns before, and I found a few parallels to Clint Eastwood westerns of the 1960's.<br><br>Just as \"the man with no name,\" the character played by Sorbo is never mentioned by name anywhere in the movie. He is referred to as \"the preacher\" or \"the bounty hunter.\" The sheriff (Nick Chinland) cannot remember when he had seen the bounty hunter before, until a climactic moment in the story. This reminds me of a favorite scene in \"Hang 'em High.\" <br><br>The villain in the story is a character the audience is sure to find most hateful. Rich and greedy, even proud to admit it, he blows up the town's only church, kills innocent people, including women and children, all of them unarmed, after stealing from them the last of the money they had, even though he has more than enough for himself. Yes, \"the Colonel\" (Wings Hauser) is indeed an evil dude. He practically owns the whole town, and obviously owns the sheriff.<br><br>Kevin Sorbo gets the chance to prove he can play a western gunslinger just as well as a hero of Greek mythology or a starship captain. Then we get to see \"Libby\" from \"Lost\" again. Cythia Watros appears as Maggie, who comes to his aid, and adds the element of romance to the story.<br><br>Although stand-offish at first, the two work well together. It isn't until after she tells him about her past as a saloon girl who got pregnant without knowing who the father is, that the lead character confesses that he too has a dark secret. He used to be a preacher. It is never debated which is the lesser of the two evils.<br><br>Together we have all the elements of a western classic. Each character goes through a wide range of emotions, especially Sorbo, who is in constant conflict with his conscience. His Christian side wants to forgive, but his other side wants revenge. This is not just a shoot-em-up action adventure, but a sensitive tale of morality and personal values.<br><br>Ultimately, the hero saves the town and all the good people still alive, by ridding them of the evil of the colonel and his men. Then, just as the audience may expect, there is the promise of a new life for the preacher, Maggie, and Maggie's daughter, Amelia, an angel faced darling played by Joey King, in what I suppose is her introductory role.","user":"wildbill017","rank":[8,8]}]