[{"title":"A moving tale that captures the beauty and inspiration of a man forced to make extraordinary decisions","rating":9,"date":"4 October 2009","review":"Mao's last Dancer tells the true story of Chinese ballet dancer Li Cunxin who grew up in rural poverty in Mao's communist before being given the opportunity to dance in the West in the early 80s. Li is forced to examine his conscience as he must choose between his career, family, culture, politics and love whilst having to make heart-wrenching decisions of what he must choose to sacrifice and what he must choose to save.<br><br>Li Cunxin is played magnificently by Chi Cao (as an adult) as well as Chengwu Guo (as a teenager). Chi Cao, a highly recognised ballerino in his own right, must receive the bulk of the accolades for what is truly a seamless breakthrough performance by a first time actor. The rest of the cast are also fantastic including Bruce Greenwood who plays the difficult and complex part of a slightly camp Ballet Director who must confront his own values.<br><br>Kyle MacLachlan (\"Sex and the City\") takes a relatively brief but delightfully forceful turn as a Houston lawyer and Australians will delight in the cameo by the ever wonderful Jack Thompson.<br><br>As an Australian production I was extraordinarily proud. Bruce Beresford has produced arguably his finest picture to date (and yes, I've seen \"Driving Miss Daisy\") as the pacing, musical score, use of ballet on camera and story structure were all pitch perfect. The film jumps around between 80s USA and Li's Chinese upbringing at the beginning before settling into a groove during the middle and end. And just when the film could be in danger of straining it's audience Beresford delivers moments of levity and humour that remind us of the characters' humanity.<br><br>The backdrop of politics against which the film plays is neither ignored nor focused on. Had it gone one way or the other, the film wouldn't have worked nearly so well but Beresford dealt with this delicate theme with such craftsmanship that it never becomes an issue for the audience.<br><br>Jan Sardi (who also wrote Shine and the Notebook) has also produced a highly commendable script for what must have been a daunting project - given the success of the book the movie is based on.<br><br>At 132 minutes, the film is long and this can be felt slightly in the middle. However, the fault is only minor and I defy any viewer to watch this without being moved by Li's story.<br><br>Many who have read Li's memoirs (as I have) will be anxious to know whether the movie does the book justice. I'm overjoyed to say that it does. I openly wept several times in the film as did most of the audience members around me. There were a few subplots and parts of the novel left out but I found that, unusually, this didn't bother me as much as it normally does with movies based on true stories.<br><br>This is because the film told the essence of Li's story extraordinarily well in this irresistibly moving telling of one man's struggle as he's caught between two cultures at a time of when they were pushing against each other.<br><br>This year's Slumdog Millionaire upstart is Mao's Last Dancer.","user":"ChrisThurston","rank":[55,59]},{"title":"Mao's dancer becomes capitalist roader","rating":8,"date":"27 October 2009","review":"Bruce Beresford is one veteran Australian director who can produce popular films, and this one is definitely a crowd-pleaser, at least for the crowd that likes to watch dance. The story itself (naïve young dancer from totalitarian regime defects to the freedom of the West) is pretty hackneyed but is framed by some exquisite dancing scenes. My former Red Guard colleague \"Robin\" thought that the protagonist Li Cunxin was a bit of a goose, for, given his extraordinary talent, if he had gone back to China he would have reached the top of the dance establishment. Instead, seduced by the shopping malls and high rise of Houston as well as by a young American dancer, and outraged when he discovers the Party has lied to him about America, he defects, causing a minor diplomatic incident and cutting himself off for the time being at least from his family. Still, he was only 18 at the time.<br><br>The two actors portraying Li, Chengwu Gao as a boy and Chi Cao as an 18 year old, do excellent work, given that neither is a professional. In fact all the Chinese actors were terrific. The American / Australian support cast was OK (Jack Thomson reprising his good ole legal boy act, Kyle Maclachlan playing a straight role), though I found Bruce Greenwood as the Houston Dance Company director Ben Stevenson mildly irritating. One does see his point, however, about most of the Chinese dancers being athletes rather than artists. There were some sloppy aspects. Some of the Houston scenes were filmed in Balmain, Sydney, green street signs and all, which by no stretch of the imagination looks anything like anywhere in Houston. Yet Beresford filmed in Houston, and went to considerable trouble to film in China. The Qintao village scenes are beautifully composed and the very last scene shows how Beresford must have convinced suspicious local party officials that he was making a movie they could approve of. I guess he didn't show them the scenes with the Madam Mao–like character chucking her weight about.<br><br>It's not mentioned in the film, but it's well known that when Li's dance career came to an end he re-trained as a stockbroker, an unlikely \"happy ever after\" scenario. He now lives in Melbourne. Beresford and Jan Sardi based the script on Li's own best-selling memoir and there's no doubt they have added something, if only some great ballet scenes – the extract from Stravinsky's \"Firebird was fabulous.","user":"Philby-3","rank":[25,28]},{"title":"A beautifully told movie","rating":10,"date":"5 October 2009","review":"My husband and I went to see this movie yesterday and thought the acting was great from relatively unknown, at least to us, actors. I had some idea of what the movie was about prior to going to see it but it was even better than my expectations, and the lead actor was a truly magnificent dancer, as were the others.<br><br>The story was moving with a few humorous moments, and showed how disciplined a person must be in order to become a great dancer. I have to say it has been my experience that people generally leave before the credits but, like myself, they stayed, which says something for the acting and the movie itself.<br><br>I would recommend this movie to everyone, even those who are not fans of ballet.","user":"jharmon-19","rank":[39,49]}]