[{"title":"Funny and different","rating":8,"date":"3 March 2012","review":"I saw the film yesterday in Oslo and I must say I thought it was exhilarating, fresh and different. It's also one of those films that you either love or hate, I do not think it is one that you can be indifferent to. <br><br>The German language adds a nice touch, and the way it is used helps a lot with creating a believable atmosphere to some scenes. The actors are doing a good job of portraying the stereotypes that they need in order for the humor to work. The humor is pleasantly free from political correctness. And there are many nice references throughout the film, so if you have been living in a cave (or on the moon) for the last seventy years, I doubt you will find it as funny as I personally did. <br><br>The CGI is stunning when at it's best. It is not perfect everywhere, but all in all it is quite convincing. The style can best be described as toned down and with natural colors that work very well for this film. <br><br>The story is funny if you let it stand on it's own and accept it for what it is. Let yourself be entertained. I am sure that if you have a very critical mindset when going to see this film you will probably find something to pick on. Things could probably be a bit better and more consistent in a + $100M film, but I do not think we would see this expressive freedom in a + $100M film...<br><br>The soundtrack was also well thought of and added the needed atmosphere trough the whole film. Not one tune seemed misplaced and I thought it was very impressive.<br><br>I liked Iron Sky a lot, and I would recommend it in a heartbeat. I believe this film has the potential to be the cult film of the year. And I think it will do well for itself on cinemas around the world.","user":"rune-307-115177","rank":[377,506]},{"title":"Excellent effort, worthy of viewing","rating":8,"date":"14 February 2012","review":"Saw this movie the 62nd Berlinale (Berlin Film Festival). Recommend its worth your time given a few caveats.<br><br>Lots of things to like about Timo's sophomore effort here. The movie is intentionally campy and plays to a number of eccentric stereotypes. Albeit, it feels very much a European view of some of the US eccentricities. The script was, by and large, well developed, the humor a little cheesy at times but generally spot on and large kudos should be paid to the FX, CGI teams for some outstanding segments in a sub $10M budgeted movie. The best parts include some great inside jokes specific to Americans and Germans, wonderful stereotyping of international ethnicities/prejudices, great attention to detail in costumes, sets, current culture trends and some above average acting by Julia Dietze, Goetze Otto and, of course, the wonderful Udo Kier. Oh, and the Laibach score for the movie was simply superb.<br><br>My caveats are that the cut I saw could have used slightly more surgical editing. Also, while I think Christopher Kirby has played well in other movies, I felt disappointed by this casting choice, as his role was central to the story line and the least \"even\" in terms of performance. Finally, it is intentional camp so expectations should be adjusted prior to entering the theater. I'm not sure the Mystery Science Theater guys could have come up with better lines than some that were already in the script of this movie.<br><br>In the end this felt much more thought out and a real \"labor of love\" than the traditional camp of Scary Movie, et al. This movie certainly has all the right elements of an instant cult classic. Putting it more simply, its about Nazis, living in a swastika shaped Moon base, trying to re-invade Earth! <br><br>My sincere thanks to the Iron Sky community for pulling the resources together to get this film made. For $7.5M I'd say, job very well done! This is probably, or usually, a ~7 IMDb score for this kind of a movie. I'm giving it 8 to balance out the previous reviewer.","user":"jf-47","rank":[291,441]},{"title":"Classic B-Movie","rating":9,"date":"21 February 2012","review":"Out of all the films being released in 2012, Iron Sky is, without a doubt, one of the most fun films to be a part of the list. When Nazis build a giant space station on the Moon after the final days of World War II, they await for the day when the Fourth Reich can return to Earth and try to conquer it again.<br><br>Yes, it does seem a bit pro-Nazi, but when you watch the film it really isn't; if anything, it does the greatest job at making fun of Nazis. I've never had a more hysterical and enjoyable ride with a movie since Super 8. The script is absolutely cheesy, the visual effects are astonishing, and the action is non-stop. There isn't much to say about the film besides the fact that it's a strange yet entertaining time at the movies and you're sure to not forget it because, even though some people will hate it and others will like it, the story is just so random you can't not remember it. Definitely one to check out for yourself, but just a heads-up for everyone; there's NOTHING realistic about the film. That's another reason why it's really fun. <br><br>8.5/10 Stars***","user":"slayerjmk95","rank":[255,393]}]