[{"title":"Hop onto this drop tower ride n be ready for ur giggle to turn into a guffaw, tensing ur diaphragm n thereby gaining a solid ab workout.","rating":8,"date":"26 December 2019","review":"First saw this in 2010 on a dvd which i own.\nRevisited it recently. As a fan of Woody Harrelson, I enjoyed this even more.\nThe film follows four fellas making their way through the zombie apocalypse on a road trip.\nWhile one fella has a set of rules to survive, another has a craving for Twinkies and stops to acquire some even with the threat of zombies roaming the countryside.\nThe list of rules, especially cardio, for surviving in the zombie-infested world, a clown-zombie n the drop tower ride, r all uniquely the highlight.","user":"Fella_shibby","rank":[26,28]},{"title":"Very Pleasant Surprise...","rating":8,"date":"28 September 2009","review":"Just came from a sneak preview held in Baltimore and left the theater feeling very satisfied. You don't normally find a late September movie as good as \"Zombieland\" was. After dropping you in the action right from the start, the movie keeps coming with constant laughs and good action. There were not a lot of scares in the movie, other than the few obvious scenes where you could see one coming, but horror is not what the director was going for in this film. Laughs, however, come often and from many different directions. Jessie Eisenberg's nerdy, insecure 'Columbus' character and Woody Harrelson's redneck zombie-killing 'Tallahassee' play very well off each other and provide plenty of memorable moments. Emma Stone and Abigail Breslin are also solid throughout. There is also one unforgettable cameo that had most of the audience rolling in the aisles. The film has a simple, easy to follow storyline that does not provoke a lot of questions. Indeed, if you go to this movie expecting a lot of plot twists and surprises, you're going to be severely disappointed. There is however, good action, good laughs, and plenty of zombie related gore. At about 90 minutes long, it does not drag on and gets to the predictable but satisfying ending, going out in style. There will no doubt be a lot of comparisons to \"Shaun of the Dead\", which is nothing to be ashamed of, but this is truly a one of a kind movie experience that holds its own with any not only any zombie movie in recent memory, but with any comedy so far this year. As long as you don't go into this movie expecting too much, you'll get your money's worth. Well done.","user":"drono2","rank":[253,323]},{"title":"Hilarious Dialogue, Fun Visuals and Some Breakout Performances, It's One Of My Favourite Movies","rating":10,"date":"5 April 2016","review":"After Batman v Superman I wanted to go back and watch a movie where I was impressed with Jesse Eisenberg. Zombieland is one of my favourites, so it was an easy choice. They continue to talk about a Zombieland sequel today even though it's been years since the original has been released. I'd like to think that's how big of an impact it made (it was a box office success but it didn't go over like gangbusters). It's probably too late for a sequel with the entire cast moving on and becoming industry headliners, but it's okay though because we'll always have this one.<br><br>*Minor Spoilers Ahead* Our main character is Columbus (Jesse Eisenberg), since no one uses their real names in Zombieland. We get a brief window into the world as it is now, completely invaded by zombies. Columbus takes us through some of his rules on how he survived like #1 cardio, #2 double tap, #3 beware of bathrooms and #4 seat belts. We then join him in present day in Garland, Texas and he makes his escape utilizing those same rules (he's far from a zombie killing bad-ass though, he mostly succeeds through discipline and some luck). He reveals that he's trying to get back to Ohio to see his family. The odds aren't in his favour though, most of the world has been wiped out. He reveals that he's always been a loner but he actually misses seeing people around. Someone then rolls up in a Cadillac Escalade with a large number 3 painted on the side. The draw their guns on each other but Columbus holds out his thumb and Tallahassee (Woody Harrelson) offers him a ride. They clearly don't gel personality wise with Tallahassee being more of an unhinged zombie killing machine and Columbus is a nervous and cautious kind of guy. But they decide to stick together at least for the time being.<br><br>Most zombie related programming is horror related. Zombieland is less a horror film and more of a dark action comedy. One of the things that makes it so memorable is that it's so funny. It was written by the co-writers of Deadpool (another excellent dark action comedy) and although the actors/actresses bring so much to the movie, one of the biggest stars is the actual script itself. We see the movie through Columbus' eyes as he travels around with 3 bad-ass zombie killers and his interpretation of the events in the movie is so ridiculous by contrast, it's hilarious. Between the action and the comedy, the movie rarely slows down if at all and with a short run time, it doesn't overstay it's welcome either. There's nothing wrong with a movie being long if it has enough material but there's something to be said for accomplishing what you want to get done and leaving before people get tired of it.<br><br>Looking at the 4 main characters of the cast, you'll easily recognize them as almost all of them populate the A list. At this time Jesse and Emma were both up and coming talents and this movie helped cement them. Jesse really stepped out of Michael Cera's shadow with a great comedic performance and Emma showed that how multi-talented she can be. She was really funny in Zombieland and she hit the more serious notes as well. This was a good movie for Abigail Breslin to do. It helped her transition out of being a child star and while she was still a kid in this film, she more than held her own. Lastly, Woody was already famous so while I can't credit his success to this movie, this is easily the funniest I've ever seen him be in a movie. In an era of the Walking Dead where you have completely serious zombie killers, his character was more laid back and enjoyed channelling his internal pain into brutally killing the undead. Woody makes his character somebody you want to follow and it's always fun to see how he's going to deal with the zombies in the next scene (whether he's swinging a banjo or using hedge clippers).<br><br>One of the really unique things this movie brings is that it was made relatively cheap but it's got some really cool visual tricks. Things like the actually lettering for Columbus' rules popping up and interacting with the environment like the letters moving when limber up appears. It's not completely new but they use it so well. The action is hard and brutal, they also find ways to get some interesting shots (there's lots of slow motion and they work the comedy into the action pretty organically). The zombies look disgusting (in a good way) and they found a way to put a different spin on them. It's not on the level of a movie that had 100s of millions in its budget but it's still well done and it could easily pass for having twice the budget it did.<br><br>I've watched this movie many times over and it is still super entertaining every time I put it on. It wouldn't be in my top 10 all time but it wouldn't be far outside it. It delivers on all fronts and it's like I said in the opening, if we ultimately don't get the sequel that's okay, I'll enjoy the perfectly wrapped gift this movie is.","user":"CANpatbuck3664","rank":[38,46]}]