[{"title":"Pokémon: Giratina and the Sky Warrior – 11th Pokemon Movie","rating":16,"date":"16 February 2009","review":"\"Pokémon: Giratina and the Sky Warrior\" is the English title for the eleventh theatrical movie spin-off from the popular \"Pokémon\" TV series. The movie was a big hit in Japan last summer and the English-dubbed version premiered recently on the Cartoon Network, where I watched it. As a fan of the series and an advocate in print for nearly all the previous Pokémon movies, I have to confess I have mixed feelings about this one. On the plus side, it's arguably the most visually impressive of all the movies, and I'll go into greater detail on this, but on the negative side, I never really got a handle on the chief antagonist, a power-hungry student named Zero, and what motivated him. You need a formidable villain for these movies to work and this entry just doesn't have one.<br><br>The movie's basic premise centers around the existence of a \"Reverse World,\" a kind of alternate universe designed to correct imbalances in the \"Real World.\" Five years before the events of this movie, a research scientist named Newton Graceland apparently discovered the Reverse World and its sole resident Pokémon, Giratina, a winged, six-legged, metallic dinosaur-like creature. He then tried to tap Giratina's power with the help of a young assistant, Zero. When Newton had a change of heart, Zero broke with him and struck out on his own to try to trap Giratina by using a machine that Newton designed to absorb Giratina's power so that he, Zero, could gain control of the Reverse World and enter and leave it at will. None of this made much sense to me since there doesn't seem to be much in the virtually empty Reverse World to want to control and Zero doesn't seem to have much trouble getting in and out of the real world when he wants to anyway. <br><br>Series regulars Ash, Dawn, and Brock, along with their regular Pokémon companions, get roped into all this through the intervention of a cute, grassy little Pokémon called a Shaymin, who's on its way to the \"flower garden\" for the \"flower-bearing\" ritual with other Shaymin. Shaymin can communicate telepathically so we can hear its articulated thoughts, making it one of the very few Pokémon (outside of Meowth and Mew) who can actually \"talk.\" It may be cuddly and vulnerable and all, but it gets pretty arrogant towards Ash and his crew as it loudly demands an immediate escort to the flower garden. However, once Shaymin transforms into its \"sky form,\" enabling it to fly above the breathtaking landscapes they travel through, even Ash starts to warm up to it. Shaymin's connection to Giratina and the Reverse World has something to do with its ability to render toxic material harmless via some internal process. Giratina seems to need Shaymin's help and constantly pursues it, provoking fear in Shaymin and its companions until Newton, who enlists Ash and his friends to help him, finally figures out what Giratina wants.<br><br>The background designs of the \"real world\" are all based on locations in Norway (according to Wikipedia) and are easily the most spectacular I've yet seen in a Pokémon movie (which is saying a lot when you consider the artwork in some of the others, including JIRACHI WISH MAKER and LUCARIO AND THE MYSTERY OF MEW). Especially awe-inspiring is the glacier valley they pass through on a cruise ship, including some high waterfalls and a delightful scene that results when Ash's pokémon fly up with the transformed Shaymin, while Dawn's Piplup dives into the water to meet lots of water pokémon who've clustered around the boat out of curiosity. Later on, the big battle with Zero in his massive, not-so-streamlined retro-style flying craft takes place against the backdrop of the glacier valley and culminates in the arrival of scores of native pokémon trying to avert catastrophe from a sliding glacier. <br><br>The Reverse World sometimes looks like a mirror image of the real world seemingly above it, but with distorted streetscapes of the village that Ash &amp; co. are visiting and strange pillars of rock supporting upside-down pieces of land with grass on them. Gravity plays tricks on the characters as they pass though it. It's an interesting-looking place, but I never quite grasped its symbiotic relationship with the surface world. The only time we see a concrete example of this is when Zero starts using his flying craft to crash through ice pillars in the Reverse World, which then causes the aforementioned glacier to start sliding up above. It's never adequately explained what appeal the Reverse World holds for Zero other than that he gets to be alone in it, not exactly a compelling motivation for a movie villain.<br><br>I imagine that other Pokémon fans may have less difficulty with this one than I did, although I have to admit I was starting to have trouble on this score with the last Pokémon movie, THE RISE OF DARKRAI, when I couldn't quite understand the nature of the conflict involving Darkrai, Palkia, and Dialga (who makes an appearance here in the first sequence). It's all starting to get a little too abstract for me. Also, I'm still not comfortable with the new English-language voice cast used for the main Pokémon characters, even though I've had about three years to get used to them. A subtitled Japanese-language edition would be preferable. In any event, this latest Pokémon movie is filled with the kind of visual spectacle we've come to expect from these movies, so it's still worth seeing if you've enjoyed any of the other recent ones.","user":"BrianDanaCamp","rank":[6,6]},{"title":"A Pokémon Retrospective, Part 11","rating":2,"date":"7 July 2019","review":"In my ongoing quest to destroy my childhood I have set out to (re)watch all Pokémon films, and see how they hold up now that I am an adult. Admittedly, I only remember having seen parts of \"Giratina and the Sky Warrior\" (which I hated) and none of the later films because I grew up and cultivated good taste, so I should really come up with a replacement for my opening sentence. 'In my ongoing quest to ruin my summer holiday...' perhaps?<br><br>Those who have seen the previous film, \"The Rise of Darkrai\", will remember it had one of the series' more intimate storylines, revolving around a tender Darkrai who tries to shield his precious garden from a galactic dispute between Dialga and Palkia.<br><br>That film was bogged down by the writers' notion that 40 minutes of big Pokémon punching each other was the more interesting storyline. In the same idiom, \"Giratina and the Sky Warrior\" begins with Giratina and Dialga fighting for no apparent reason (Palkia presumably scarpered.) It is a dull and unimaginative fight, as well as an annoying one, because the action is constantly interrupted by the Pokémon Shaymin. The pink-white-green hedgehog was probably meant to be cute, but keeps demanding attention and produces a sound that makes you want to pierce your own eardrums.<br><br>The pretence of being a sequel to \"The Rise of Darkrai\" is dropped after this introduction. The real story begins when Shaymin stumbles upon Ash and Co., completely ruins their lunch and has to be taken care of. At this moment I was struck with terror. That insufferable runt is the films' focus?<br><br>I wasn't half prepared for the horrors that were to come. Shaymin turns out to have a voice that matches its squeezing in terms of aggravation, and to be of the vilest character. Jirachi and Manaphi fell into the same 'small and cute' mould, but those Pokémon were well-meaning and affable. Who thought that Shaymin's spoiled, arrogant, lazy, weak and whiny character would endear any audience?<br><br>That pest on legs has to be taken back to its flower garden -- or rather: demands to be taken there: 'Look here, I have to go to the flower garden, and that's that!' 'I thought you said you could fly,' Ash remarks, sensibly. 'I can, but not now.' Isn't that witty? Shaymin is the Pokémon equivalent to a spoiled little nephew who hasn't been sufficiently spanked by his absent parents. He may well be the most singularly unlikable creation in all of Pokémon, and we are stuck with him for the whole plodding film.<br><br>The journey that follows is an exercise in tedium: About 45 minutes of carrying, escorting and saving Shaymin, only to be yapped at in return. Mercifully, after reaching the garden, the film becomes boring instead of insufferable. A villain appears that catches Giratina (remember him?), and now has to be defeated, because he is going to destroy the world from an alternate dimension, or something like that.<br><br>At least there is more action now, which is good, because it means there's less talking. The 'mirror dimension' even allows for some visual creativity to distract from that paroxysmal hedgehog. The pleasant mediocrity of these scenes softens the awfulness of the first half somewhat, although the shatteringly underserved sad goodbye at the end drains any remaining goodwill.<br><br>Even though considerably less effort was put into most of the later films, \"Giratina and the Sky Warrior\" stands amongst the worst entries in the series. It is bland, boring and poorly paced, but we are used to that. No, it is Shaymin, that indefatigable aggravator, that damns this film to its private place in Hell (circle 7, ring 3, section 2: violence against art). \"Giratina\"'s only pre is that it made me appreciate the mediocrity of the other films, because at least they did not make me want to mutilate my sensory organs.","user":"Shostakovich343","rank":[2,2]},{"title":"Filled with both new and recurring likable characters, endearing Pokémon and a well thought out world concept which can be easily enjoyed by all.","rating":8,"date":"20 January 2015","review":"Due to my personal Pokémon Movie Marathon, it's easy to tell how much Pokémon films have improved over the years due to the creators' efforts and that means Giratina and the Sky Warrior (2008) is different from the rest of the older Pokémon films! It has unique concepts and the creators of this animated feature evidently paid more attention to details such as the Pokémon movements, feelings and personality. The CGI is much better too. Most of all, the creators have played with interesting point of views and angles as well, which allows us to see through the characters' eyes and have a fun experience!<br><br>Honestly, I will never hide this one fact; Pokémon films can be disappointing no matter how promising they can be sometimes but they are just going all out for their specific target audiences and guess what... I am immensely delighted with this Diamond &amp; Pearl trilogy! <br><br>The Diamond &amp; Pearl trilogy films have impressed me before and rewatching them again to write about them on my film blog is certainly my pleasure as they have shown improvements in various aspects especially the plot compared to all the older films and are quite entertaining to watch. So for Giratina and the Sky Warrior (2008), I would say it easily is one of the best Pokémon films and like the rest of the trilogy, it is pleasantly interesting!<br><br>This is just a short version of my review but I must say this: Giratina and the Sky Warrior (2008) is filled with both new and recurring likable characters, endearing Pokémon and a well thought out world concept which can be easily enjoyed by all. It is a great family film and animated feature based on video game; you should watch this especially if you love Pokémon!","user":"hayashimegumi","rank":[1,1]}]