[{"title":"Riot of a movie....we can all thank BinLaden","rating":10,"date":"4 July 2019","review":"Top 10 comedies of all time. Enough jokes and hilarious situations to keep laughing long after the viewing.<br><br>Sit back and enjoy the ride.","user":"jjlawler-98324","rank":[14,17]},{"title":"Genuinely funnier than any comedy in recent memory","rating":8,"date":"7 June 2009","review":"Most great comedies are based on fundamental truths -- we find a deal of humour in the illumination of our own human tragedy. Office Space is funny, for example, because we've all worked that type of job, put up with that type of boss, and suffered that type of monotonous everyday boredom.<br><br>Todd Phillips' new movie, The Hangover, is as aptly titled as anything else released this year: it's about a Vegas bachelor party gone horribly awry, in which the groom inexplicably disappears, no one can remember a damned thing, and Mike Tyson wants his tiger back.<br><br>Yes, we've all had those nights, though perhaps not to such extremes (that's where the exaggeration of comedy serves us). The Hangover is funny because it takes this cultural ritual -- an American tradition; something almost all of us can relate to -- and finds genuine humour in the pain of its aftermath.<br><br>I concede that bachelor party movies are not in short supply; the genre (if it is, indeed, a genre) should have probably both begun and ended with the Tom Hanks flick almost three decades ago. But The Hangover wisely studies the day after rather than the day itself; this is funnier because the plot works backwards, without tacky flashbacks, and much of the evening in question is left to our imagination.<br><br>While it would be misleading to claim this is a brilliant film (in either regard – as comedy or character study), it's an assured picture that finds its footing immediately and achieves a surprising level of sustenance throughout its running time. And frankly, let's be honest, this is a breath of fresh air: it's one of the best R-rated comedies of the decade, and certainly the most uproarious since Superbad was released two years ago. Most R-rated comedies produced today are defiant; the R-rating has become a hindrance to film studios' sensibilities – everything is PG-13, saving the shameless Unrated schpeel for the DVD cut. The occasional theatrically-released R-rated comedy, as such, is infrequently modest; the ads stress the rating to remind us what we've been missing. For every legitimate offer, such as Forgetting Sarah Marshall, we're treated to movies like College that attempt to lure us into theaters based on the promise of raunchy decadence. The problem is that it's all so coldly calculated; these films are not funny because a majority of the time they are simply lazy and dishonest.<br><br>The simplest reason for The Hangover's success in being genuinely funny is the fact that it achieves a rare balance of character and vulgarity. We laugh at the characters' misfortunes because we like them, we empathize with them, and they are distinctly actualized. Are they stereotypical? To a certain degree, sure: we have the repressed pussy-whipped guy who obeys his girlfriend's every command (Ed Helms); the weird John Belushi-esquire figure who speaks in non sequiturs and naïve absurdities (Zach Galifianakis); and the womanizer whose confidence renders him automatic leader of the group (Bradley Cooper). It's a testament to the strengths of these actors that they make their characters endearing and believable, even in the face of total lunacy.<br><br>Helms has been an underrated highlight of the American Office for the past several years, never quite earning the praise he deserves. His character on the show is played with pitch-perfect perversity: he's not overtly creepy (like the program's other weirdo, Creed), but rather subtly unnerving. Helms invests a great deal of nuance into what is ostensibly a throwaway, supporting goofball; this movie, if nothing else, will justly reveal his talents.<br><br>Cooper uses his looks to his advantage: it's funny to watch handsome people exploit their securities. Cooper essentially turns your typical Leading Man figure into a bumbling idiot, self-absorbed and clueless. It's effective, he's got great chemistry with the other guys, and it's fun to watch such an immoral and ruthless character take center stage in a mainstream comedy.<br><br>Galifianakis, a cult comedian who I've admired for years, has been struggling quite a while. Not many people other than myself and Sean Penn saw his 2001 comedy Out Cold, probably because it wasn't all that great; but he was easily the most amusing aspect of the picture. He once described himself as being gifted by the opposite of the Midas touch, with more than a few canceled TV shows to his credit (including Comedy Central's unheralded Dog Bites Man), but it seems his persistence has finally paid off: he has discovered, at last, a movie of strong enough quality to reflect his talents. Galifianakis has a fair share of the film's funniest dialogue; as far as fat funny guys go, many of them (such as Chris Farley) made the ill-fated mistake of playing dumb in a sharp fashion: hurtful quips and silly one-liners, all self-aware. Galifianakis plays his character straight and the laughs are subsequently heartier; when he embraces his brother-in-law while nude, the act seems innocently awkward rather than deliberately awkward, and that's what makes it so funny. He's described in The Hangover, by another character, as a child with a beard. Imagine how funny it is when he names a Caucasian baby Carlos, without any shred of condescension or knowing humour.<br><br>The Hangover is surely destined to become the sleeper comedy hit of 2009, and, more likely, a cult flick in the years to come. It's more deserving of such acknowledgment than many recent successes, and while we may live in an era saturated with unnecessary sequels, I actually left The Hangover hoping to see these guys again. And that's a rare feeling these days.","user":"MovieAddict2016","rank":[402,646]},{"title":"A very funny movie","rating":8,"date":"26 May 2009","review":"With the exception of one character (more later in this review), I found this movie filled with male, sophomoric humor. Having said that most of the females in the audience also enjoyed it; kind of an equal opportunity movie to offend all sexes equally.<br><br>Unlike most trailers that show all the humor in a 60 second clip, this movie will throw so many funny situations at you so quickly that you will be giggling non-stop for the first hour.<br><br>Then, the introduction of the Mr. Chow part - essential for the plot, but played WAY over the top by Ken Jeong - became distracting. Up to that point, Bradley Cooper, Ed Helms, Justin Bartha, and Zach Galifianakis carried the movie briskly and with real chemistry. Zach Galifianakis, in particular, was brilliant. Who is this guy???! The last 30 minutes were not as good as the first hour and I found the ending somewhat forced.<br><br>HOWEVER, everyone I talked with after the movie will be seeing it again. This is one movie that is as funny as advertised.<br><br>Of course, I will get flamed by those who find this kind of humor too low brow for their tastes. Hey, just know what you're getting into when you see this.","user":"dalagler","rank":[401,692]}]