[{"title":"Dark Mysterious","rating":9,"date":"16 November 2013","review":"Dark Mysterious tale well cast well acted just odd enough to be diffident from the mainstream. Perfect locations were sort and used to full effect giving a realist feel to this movie. Breathing life into a film that stands head and shoulders above many a middle of the road attempt of this sort of strange super natural oddball movie. Elements of genesis are running through it with clever one liners from a unhinged gangster played to great effect.To sum up this film reminded me why i watch so many movies in a hope to fine one like this as good as this nowadays seems about one great movie in 25 or so movies watched.","user":"SCcontrol","rank":[104,131]},{"title":"Ignore the critics","rating":8,"date":"16 November 2013","review":"It seems like people have recently become quite callous because otherwise I couldn't understand why this excellent romantic semi-comedy/semi-drama/semi-crime story with excellent likable characters and a lot of love couldn't be highly appreciated.<br><br>It's not like this movies is without its flaws, for instance sometimes it dragged on and some parts of it could have been easily cut out without affecting the story in any way.<br><br>What you are about to see is a crazy love story involuntarily intertwined with the criminal world. It's not about being a hero and conquering the love of your life when you are lost, it's just about following the emotions which bring you to life.<br><br>I'd recommend this movie to anyone who thinks of himself as a romantic person, and I'd definitely recommend it to all ladies.","user":"arriva","rank":[149,192]},{"title":"Live action graphic novel","rating":10,"date":"2 January 2014","review":"At the end of this movie my reaction was - 'WTF ! !' - I had no idea what to make of this story. It was just stupid ... I was as lost at what to make of it as Charlie was in seeking love and purpose. But the movie had one thing very important going for it, it kept my attention and I wanted to know just what was the fate of Charlie Countryman.<br><br>Then it occurred to me that this movie is just like a graphic novel ! The scenes, the pace of the story, the action, the dialog, the exaggerated faces of the central characters, Gabi's overly done makeup, Charlie's perpetual innocent expression and unending energy, the spooky ugliness of Nigel, the demon like Darko and the anger displayed by Victor. All these characterizations can be found in action packed romantic graphic novels. Once I considered the movie in this context, suddenly everything made sense and I'm now crazy for this flick.<br><br>I have no idea if this was Fredrik Bond's intention - but it works for me! It's beautifully photographed, loaded with wonderful characters, dialog is fantastic, and every scene is its' own art. It's a must see for cinema fans!","user":"cekadah","rank":[75,102]}]