[{"title":"An Instant Southern Classic","rating":10,"date":"20 April 2009","review":"I had the privilege of seeing That Evening Sun last night at the Atlanta Film Festival. Scott Teems, Terrence Berry, Laura Smith, Ray McKinnon, Walton Goggins, and Larsen Jay were all in attendance and conducted an excellent Q&amp;A afterwords. <br><br>There's so much to this film, so I'll start with the acting and go from there. The movie was so perfectly cast, from Hal Holbrook to Ray McKinnon all the way down to Barlow Jacobs the cab driver - they all were so authentic and believable. There was a lot of very good dialog, but I felt in the moments of quiet grief, contemplation, and observation there was so much more said about the characters. <br><br>The story itself was very simple - it had no effect on the world outside of the few characters involved - but again it made the whole situation believable and really struck home with a lot of audience members. The movie is very smart - it doesn't hit you over the head with actors stating \"I feel remorse, I feel sad, I feel angry.\" You get to watch their actions in the present reveal their character and past. <br><br>Location was perfectly southern, shot just outside of Knoxville on an old farm, complete with the tenant house seen (although the Q&amp;A explained the actual tenant house was disassembled and rebuilt closer to the main house). There is something about truly southern movies that have a feel like no other with a landscape and sound you can't find in Canada, New Zealand, or LA. <br><br>The music, done by Michael Penn and the Drive-By Truckers, completed the whole picture with a quiet southern flavor. Scott Teems explained in the Q&amp;A that he wanted a lot of quiet time for the audience to absorb the story and the location. The music was present, but didn't drive scenes. <br><br>All in all, this is one of the best independent films I've seen in recent years, and is instantly one of my favorite films of all time. Please go see this film, you will not regret the time spent!","user":"FatMan-QaTFM","rank":[40,44]},{"title":"Hal Holbrook is a treasure. So is this film.","rating":9,"date":"23 January 2010","review":"I've been looking forward to \"That Evening Sun\" for a while now, and not just because it was shot in the county and surrounding towns where I live here in Tennessee. <br><br>My anticipation was largely because of Hal Holbrook, an iconic performer I have seen in his one-man \"Mark Twain Tonight!\" stage show, and who appears in occasional guest shots on TV where things must move very fast, and less often in film, where things are allowed to proceed at a more measured pace.<br><br>I was not disappointed, the character study of Abner Meechum, the refugee from an old folks' home and renegade on his own property is rich, complex, and satisfying throughout. Admittedly it may not be a big stretch for Holbrook to play a cranky 80-year-old, but that doesn't lessen the impact of the performance at all.<br><br>Surrounding him is a cast of surprisingly strong players: the antagonist Lonzo Choat (Ray McKinnon) is an especially worthy and believable opponent, and supporting cast Pamela and Ludie Choat (Mia Wasikowska and Carrie Preston) likewise hit just the right notes, tugging this farm county family drama at precisely the right pace. I especially enjoyed Barry Corkin, perfect in the Wilfred Brimley-esquire good neighbor role, and a special mention for the cameo by Dixie Carter, Hal Holbrook's wife in the movie as well as in real life.<br><br>Where I saw the film, at a packed 1pm matinée, the audience laughed at several of the moments, self-reflective as they were of Tennessee rural life. I don't know that they would garner that kind of introspective appreciation in other parts of the country, but here, people know their country folk and can laugh with, rather than at them.<br><br>\"That Evening Sun\" is a simple yarn: Abner tires of life in a retirement home and returns to the farm he and his deceased wife occupied for most of their lives, only to find it occupied by a neer-do-well, but one with a property lease Abner's \"guardian son\" has approved. The story is more than the tug-of-war between owner and lessor, it is between hard-working- older and layabout younger, and between lives at noon and the sundown that inevitably follows. Taken from William Gay's short stories of Southern life, \"I Hate To See That Evening Sun Go Down,\" it's the unraveling of a proud man in the twilight, as his own sun is setting, and his fight with the oncoming night.<br><br>Hal Holbrook is a treasure. So is this film. It's Indie with a capital \"I\", an armful of festival awards, and, one hopes, a long run ahead.","user":"RickStarr11","rank":[23,26]},{"title":"Tales Of The New/Old South","rating":9,"date":"7 February 2010","review":"Abner Meecham,who has been living in a nursing home,is unhappy &amp; wants to live out his final days on the farm land where he had made his living for over 50 years. One day,he packs his things &amp; just walks away from it all. Despite a first failure (where he is picked up by the police &amp; returned back to the home),Abner,undaunted tries again,this time getting further,with the help of a taxi cab driver,to his old farm land. Problem is,the land &amp; the house are now leased by Lonzo Choat,who Abner doesn't like,one bit. Abner takes up in the workers quarters,just off the main house,much to the chagrin of Lonzo, who wants Abner off of his property,a.s.a.p. The following makes for a tense tale,that you know is going to end up badly. Scott Teem ('A Death In The Woods','Roots') directs &amp; writes the screenplay,adapted from the novel, 'I Hate To See The Evening Sun Go Down',by William Gay (the title of which is taken from a line in an old country blues song by Jimmy Rogers). This is a quiet little independent film that in the wrong hands would have turned out to be just another Southern exploitation film (like the kind of films produced by Harry Novak that used to play drive in's back in the 1970's that stereotyped all of the citizens of the South as back woods,slack jawed,inbred,boozing,village idiots that would have sex with farm animals,or family members,or all of the above),but rises above that. The great Hal Holbrook (forever known for his portrayal of Mark Twain on stage &amp; screen)plays Abner,a man who just wants what is rightly his. Ray McKinnon is Lonzo,a man who is just dripping with contempt for Abner. The rest of the cast (unknown by yours truly)turn in shining roles on screen. This is a quiet,little \"indie\" that drew acclaim at the festivals,but probably won't get much in the way of main steam distribution (I got to see it at one of our cinemas that specializes in foreign &amp; art films),but deserves better. Rated PG-13 by the MPAA,it contains some raunchy language,an unpleasant scene of domestic abuse &amp; some minor adult content.","user":"druid333-2","rank":[26,31]}]