[{"title":"It wasn't that bad, why the hate?","rating":6,"date":"6 October 2011","review":"I saw Green Lantern with my son because it looked safe enough and I used to collect the comic books when I was a kid. I felt like I was the only guy over 20 at the theater, which I guess isn't surprising anymore. Did think there would be more adults, however, because the Green Lantern was something we read in my generation. Not sure if it's even around anymore. Being a fan of the comic book I had to go see it, and I was intrigued with the movie. After I got home I jumped on the computer and read the reviews. I was very disappointed with the professional reviews that cast stones at it, while at the same time, regular folk like myself thought it was a pretty good stab at the DC comic book version. I guess I look for something different when I go to the movies. I go to unwind and enjoy myself for a couple of hours, and Green Lantern worked for me.","user":"BigMaxAttacks","rank":[152,167]},{"title":"Green Lantern","rating":6,"date":"24 February 2020","review":"Nothing too exciting. Almost boring at times. Some cool effects. It was okay.","user":"MR_Heraclius","rank":[39,43]},{"title":"A World Of Overreaction","rating":7,"date":"5 October 2011","review":"While I admit this movie had it's flaws, I do strongly believe this movie has been vastly underrated by the public. Unfortunately Green Lantern came at a time when comic inspired novels have been done almost to death. While most done quite brilliantly (most being the operative word here) Green Lantern I believe did not live up to the expectations we now have of comic adaptations.<br><br>Ryan Reynolds as Hal Jordan was a great choice for the role of The Green Lantern, the character arc while helping you to understand the character of Hal Jordan was sufficient I do believe they could of well exceeded what they did.<br><br>For a story as immense as the Green Lantern I believe that the close to two hours was to short to completely describe and help understand the Green Lantern universe. The length I believe to be the biggest drawback in this movie. In my opinion the movie should of been closer to the length of The Watchmen to completely illustrate the complexity and brilliance that the Green Lantern universe really is.<br><br>For me, I believed the hype going into this movie, I had a completely closed mind and fully expected this movie to be as one critic described it \"Green Lantern, The worst comic book movie ever made\". Honestly I have to say that I'm glad that I read that review before viewing this movie as it made it all that sweeter when the movie went beyond all I thought it would be and greatly impressed me.<br><br>I'm sorry that this movie was received so badly because the chances of seeing a sequel have dropped and in a universe where anything is possible I think we will miss out on all that the Green Lantern franchise could be.","user":"Jimmyboyjr4","rank":[31,35]}]