[{"title":"The Wisdom of Friends","rating":5,"date":"17 June 2009","review":"The Land Before Time XIII: The Wisdom of Friends, ah, the 13th installment in the Land Before Time series, I can't believe I've seen all the movies. I love how everyone makes fun and says that there are five million of these movies, it's not exactly like they went into the movie theater or anything. Personally, I think this is all good, why not introduce our beloved characters to a new generation. Not to mention that these stories are a small way of teaching kids how to act. I'd rather have my child watching this vs. Hannah Montana, which I'm still convinced is hypnotizing children to become Miley Cyrus's trained soldiers. But it's good to see the gang together once again in this fun little story about sharing.<br><br>Littlefoot, Cera, Spike, Petrie and Ducky are excited to meet two goofy and lovable yellow-bellied dinosaurs named Loofah and Doofah, who have lost their way while traveling to the distant Berry Valley. Loofah and Doofah seem to be too clumsy to find the way back, so Littlefoot and the others decide to help their new friends while sharing important life lessons called Wisdoms along the way. By the time they reach Berry Valley, Littlefoot realizes that even though the Yellow Bellies don't follow his Wisdoms very well, their silly techniques work just fine.<br><br>The Land Before Time XIII: The Wisdom of Friends was a nice addition to the story. It wasn't by any means my favorite of the series, it does get a little cheesy after a while, but it's all good. Like I said before, these movies are bashed by everyone without being given a fair chance. These movies are just a new way of showing younger kids how to act in life, even though these are the morals that our beloved Barney has provided, I have a feeling that these movies don't insult the kid's intelligence as much. They have fun songs, good animation and our great gang of friends that are always a joy to see on screen. I do recommend this movie for the family, give it a fair chance, these movies were not bad at all.<br><br>5/10","user":"Smells_Like_Cheese","rank":[10,12]},{"title":"The Worst Animated Movie Ever Made","rating":1,"date":"16 April 2016","review":"I am going to be incredibly blunt here. This is the absolute worst animated movie I have ever seen in my entire life beating out Charlotte's Web 2, Mars Needs Moms and The Secret of Nimh 2! The yellow bellies are extremely obnoxious! They never shut up, they're movements are almost as over exaggerated and hyper as Flint Lockwood, they're dumb and delirious as heck! Seriously, there's one scene in the canyon where the yellow bellies are sitting there eating berries while there are Sharpteeth running towards them! What do they notice? Not a dang thing! By the way, this movie could've ended if Littlefoot took his friends' requests and just left the yellow bellies to go on the rest of their journey alone! Seriously, every character is an idiot, not just the yellow bellies. The group are all having to relearn lessons that they already mastered movies ago! Also, this is kind of a nitpick compared to everything else but the overabundance of CGI was too much to bear. Okay back to the yellow bellies for one final time, what is with the comedy surrounding them?! This movie seems to have an obsession with dinosaur butts! Seriously, those were every joke surrounding the yellow bellies! Another horrible thing in this movie is the songs! God these songs are so pretentious and obnoxious! The first song in unnecessary and annoying, the second song is unnecessary and annoying and the third song is unnecessary and annoying! Actually, that pretty much sums up the entire movie, unnecessary and annoying!","user":"allyball-63124","rank":[4,4]},{"title":"Lightweight and Silly","rating":2,"date":"7 March 2008","review":"As a devoted fan of the franchise, I found this latest entry to be a lightweight. It has more silliness than actual plot. Littlefoot and his friends meet a lost herd of goofy dinosaurs. They decide that the herd are never going to get home without help. On the way they learn various lessons from each other. Choices can depend as much upon feelings as upon wisdom. It's far better to dance than to worry. Some nice character moments, but not very much action. For once it is Grandmother advising Littlefoot, rather than Grandfather. The other adults are largely absent. The narration has been culled since there is very little to say after 12 other films. There is no continuity with the TV series. Songs are forgettable. 4/10","user":"Growlyted","rank":[10,14]}]