[{"title":"Great Start, Sagging Middle, Bad Ending","rating":6,"date":"22 November 2009","review":"The movie was not unlike other movies where you see the good guy go rogue after rough handling by \"the system\". But I really liked the development of the characters in the beginning, and I am sure I am not the only one out there hoping that the \"Law Abiding Citizen\" would be able to pull it off.<br><br>Then came the middle where plot points become strained, where we have to take a few leaps of faith and leave the world of genius for one of Hollywood. OK, I'm still there, taking the ride with you.<br><br>But then we get to the ending which destroys the film and makes it into brain pablum; mental oatmeal that anyone can digest but no one can get any flavor from. Mr. Genius buys several industrial areas -- but why? Only 2 seemed to be necessary for the plot. And why would Panama know the purchase prices? And down to the cent! Corporations don't need to share that information with foreign governments. Nix that link and this movie would have been more interesting. We're expected to believe a genius would leave the cleaning cart in obvious view in the hallway and right next to the area where he put the bomb? We're expected to believe the genius wouldn't have trapped his escape route. And we're expected to believe they transferred this bomb from Point A to Point B without setting it off and in record time, all while Foxx waits in the cell, and Scotty Junior brings up the rear, unseen and unheard.<br><br>I wanted Foxx's arrogant character to lose his daughter, to feel what this man went through, and then I wanted him to get away with it.<br><br>Anyone agree?","user":"paq5528","rank":[407,447]},{"title":"Great Idea, Poor Ending","rating":7,"date":"16 October 2009","review":"This is a great idea. A technical genius who is somehow able to commit revenge murders from his jail cell. He doesn't hide the fact he's a killer; in fact he announces each murder just before it happens.<br><br>Technically everything was possible and the method very cleverly hidden so I was kept in suspense until the last 20 minutes when the cat was let out of the bag too early. The ending is a let down. It's true Hollywood: Technically improbable, illogical, and in my opinion it spoils all the character development made until that point and wastes the opportunity for a much darker ending with a more satisfying outcome.<br><br>All that said I really enjoyed it. I would recommend it to anyone not disturbed by moderate violence. Go see it!","user":"mike-3842","rank":[717,799]},{"title":"Typical Hollywood BASTARDIZED ENDING!!!","rating":4,"date":"18 February 2010","review":"Come on Hollywood, this guy was so clever, tactful &amp; brilliant &amp; yet you expect the audience to believer that he wouldn't even have a bloody security system installed on the very building, which was the only means of exit &amp; entry to his prison cell... never mind that the building housed nerve &amp; command center, from which he executed his flavour of justice!<br><br>Here's another plot hole of gargantuan proportion(s); how in the heck did Fox get the briefcase/bomb back to the jail cell BEFORE Butler returned? Oh yeah &amp; WHY would Fox willfully allow Butler to detonate the bomb, even though he had discovered the means, by which he was perpetrating his reign of terror?!? That would be the epitome of anti-justice- especially considering he was the acting D.A.! Why didn't they show him being charged &amp; prosecuted for murder?!?<br><br>This is a case whereby you actually wanted the bad guy to get the last word in on the matter!!! But no... Jamie Fox had to come out on top! Actually, I think Fox would/should have been the FIRST person on Butler's list! WHY couldn't Hollywood just grant this movie the ending it righteously deserved?!? It was going sooo well! Whoever is in charge of the ending to this film ought to have been on Butler's list!","user":"jlamarca","rank":[154,173]}]