[{"title":"Encouraging movie. Inspirational story.","rating":6,"date":"28 December 2009","review":"Based on true events amid the wreckage and chaos dealt by Hurricane Katrina; one basketball coach in Marrero, Louisiana just will not give up. Coach Al Collins(Forest Whitaker), gathers other players from hard-hit schools and builds a team actually worthy enough to go to the state playoffs. A very honest look at what can be done with the right people having the desire and fortitude to pick up and start over again. Just getting the players, that under normal circumstances would be rivals, to mesh together into a solid playing unit was no easy task. Along with stars like Isaiah Washington, Courtney B. Vance, Bonnie Hunt, Michael Gaston and Taraji P Henson is rapper Lil' Wayne and singer Bow Wow. Many heroes have surfaced from the bowels of Katrina's wrath...some just happened to belong on a basketball court. HURRICANE SEASON is well worth your time.","user":"michaelRokeefe","rank":[13,17]},{"title":"Good \"Movie\" bad 'facts\"","rating":6,"date":"12 January 2011","review":"This was a great movie, but being born and raised in Marrero,La. (still living here), and also attending John Ehret High School, the \"Facts\" in this movie is very misleading. It is true with the players from 5 different schools coming together to win it all. But, the reason why they all got together at John Ehret is because it was one of the few schools opened at the time. For instance, in the scene where the coach goes to the gym after Katrina, and it is destroyed and full of water, that is no where near the truth. John Ehret had ZERO damage from the storm, in fact the entire west bank had some wind damage to houses, but NONE of the area flooded at all. Also, this movie was filmed at a vacant school in Chalmette, La. and though the makers made an attempt to make it look like Ehret, it is no where close. All in All, I enjoyed the movie, but that is all it is, movie.","user":"ebabin41","rank":[7,10]},{"title":"Like a exciting thrill ride","rating":9,"date":"16 April 2010","review":"Hurricane Season was like a exciting thrill ride just waiting to get on. I feel this way because it showed me how all the struggles that New Orleans citizens went through but still made the best of it. This movie had also showed me how your team is your family,and how teamwork is important no matter what. I also noticed some characters like Lil' Wanye,Bow Wow,and China Anne McClain. I think they played their parts well. I couldn't picture anyone better for the parts.<br><br>This movie also fits for kids my age and up, and parents as well. That's why I think this movie was interesting.<br><br>But my favorite character was Brian Randof played by Robbie Jones. I liked him because he reminds me of me because before no one wanted me on their team or gave me the ball. The reason why was I never passed the ball until I opened my eyes and saw that when I needed help I had four other players just like what happened to Brian.<br><br>Another actor I liked was Shad Moss, but you also know him as Bow Wow. I liked him because he showed people that size doesn't matter. Like you could be big and be the worst or you can be small and be the best on the court.<br><br>That's what the movie showed me.","user":"raulito-j","rank":[11,19]}]