[{"title":"\"Sometimes I think the whole world is strung together with lies.\"","rating":8,"date":"3 October 2019","review":"I fully expected a low IMDb rating and a fair share of negative reviews for \"Never Grow Old\", but I really don't see why. Or maybe I do. It's a slow building Western and very dark in places, virtually most places. That's probably unavoidable in defining the principal characters and frontier life as it existed in the mid-1800's. As far as the grit and grime goes, this one is as muddy as the HBO series \"Deadwood\", and just as sin infested with Dutch Albert's reintroduction of alcohol, gambling and prostitution to the town of Garlow on the California Trail of 1849. If I didn't know he was in the picture, I never would have recognized John Cusack as the villain Albert; the only time his appearance approached the Cusack I'm familiar with was when he showed his profile in a scene while speaking to Mrs. Crabtree (Anne Coesens). That's also the same scene in which he fully revealed his foul character, demanding that the widow seeking employment in his saloon recruit her own teenage daughter for his vile intent.<br><br>Emile Hirsch is the conflicted carpenter and undertaker in this sordid tale of greed and corruption, eking out a living with his wife (Déborah François) and family while the opposing forces of good and evil run rampant in the town. Not insignificantly, the town preacher Pike (Danny Webb) demands that his congregation toe the line as the moneyed interests have withered away under his heavy thumb. The story reaches a fever pitch when young Emily Crabtree (Manon Capelle) defends herself against a forcible customer, and is sentenced to be hung for the indiscretion. It becomes a turning point for Patrick Tate (Hirsch), who's nominal friendship and business relationship with Dutch Albert goes off the rails.<br><br>I have a preference for these slow burn Westerns, for me they don't have to be all 'shoot 'em up' or final showdown in the street. Stories are sometimes more interesting when the line between right and wrong is somewhat blurred, and the characters have a way of walking both sides of a muddy street. This one was an unusual find, with a title that fits if one considers that the wild West often provided a quick departure from this mortal coil.","user":"classicsoncall","rank":[12,13]},{"title":"Nice to see a fresh Western","rating":9,"date":"5 September 2019","review":"Why is it that when someone doesn't like one of the rare attempts at a Western in a time overrun by superhero films they use that overused term \"cliche\". Tell me what is so uncliche about the glut of superhero films that permeate our current movie landscape. It took a director from another country to make this top-notch Western because American studios can't be bothered so thank you Ivan Kavanagh for giving us Western fans something new to fill the enormous hole that this once beloved genre has become.","user":"robie46-1","rank":[15,17]},{"title":"Sympathy for the Devil","rating":7,"date":"8 August 2019","review":"In a tiny town on the road to California, the villagers live peacefully under the reverend's influence: « no alcohol, no gambling, no wh*re », as god wants us to be, theoretically speaking. The main inhabitants are this narrow-minded preacher (<a href=\"/name/nm0916073/\">Danny Webb</a>), a disillusioned sheriff (<a href=\"/name/nm0013927/\">Tim Ahern</a>) and an Irish undertaker (<a href=\"/name/nm0386472/\">Emile Hirsch</a>) married to a French woman (<a href=\"/name/nm1918862/\">Déborah François</a>). This village painfully survives until the arrival of Dutch Albert (<a href=\"/name/nm0000131/\">John Cusack</a>), a sinister man who deliberately seeks to bring chaos in this fragile universe. Why? Well, because he can and this chaos seems also to bring him some indescribable satisfaction. This fellow will even brashly open a decadent establishment with an irreverent signboard « whiskey, billiards, cards &amp; fine ladies » right in front of the reverend's house. Needless to say, this reverend will be quickly overwhelmed by the imminent events.<br><br><a href=\"/name/nm2830839/\">Ivan Kavanagh</a> managed to recreate a realistic and deeply dark atmosphere thanks to an excellent stage setting and an out-of-the-ordinary sense of detail: the sets, the costumes, a depressing almost-permanent mud, a very neat photography, picturesque landscapes, smoke screens, a discrete but ominous musical environment, ... Moreover, <a href=\"/name/nm0386472/\">Emile Hirsch</a>, <a href=\"/name/nm0000131/\">John Cusack</a> and <a href=\"/name/nm0916073/\">Danny Webb</a> are awesome.<br><br>August the 8th, this movie is rated 5,8 of 10. Quite clearly underrated! 7/8 of 10 in my humble opinion.","user":"FrenchEddieFelson","rank":[17,20]}]