[{"title":"best fighting movie","rating":9,"date":"23 February 2020","review":"Unlike any other martial arts movie, this one pushs the style to the edge, from bad to good, from weak to strong, Boyka's character leaves no clues on Scott Adkins. As much as it is a simple idea as much as the adreline never stops in this movie. This movie left a mark in the history of martial arts movies, and yet it never gets old. \"this is the most complete mma movie in the world\".","user":"MR_Heraclius","rank":[37,38]},{"title":"WOW action and decent acting","rating":9,"date":"22 May 2010","review":"So, let me start off by saying Scott Adkins is a pretty good actor and a damn good entertainer. He goes from being the partial pure fighting villain in the second to the star of the third. He copes with his hyper-extended knee very well might I say. Anyways, this movie was the best yet. The fight scenes were incredible and there was actually a decent plot. I hope there is a fourth and if there is Scott Adkins damn sure better be in it.<br><br>Way better than Tony Jaa and Ong Bak!<br><br>(I can't say better than Jackie or Lee because they're pure legacy and great BUT I can say Scott needs more roles. The guys amazing.)","user":"sdicker2","rank":[56,62]},{"title":"Strong fighting movie with predictable plot but still good.","rating":23,"date":"23 May 2010","review":"Scott Adkins is bad ass here. This role gets him well, better then fancy good boy from Ninja. He is turned from the villain of the Undisputed II to the flawed and angry main character of this one. You will enjoy him and supporting actors; Mykel Shannon Jenkins aka Turbo and Mark Ivanir as Gaga.<br><br>For once, not the average crap of usual action movie \"alone against the world\". This time, you are spared of usual \"my brother died\", or \"I am in prison for wrong reason\". All characters are flawed like in real life. I didn't yawn during dialogue or didn't for one moment seem the action come to stale. This is a packed with action movie about an international prison mma tournament.<br><br>Fighting scenes are superb done for a low budged movie made in post communist industrial bankruptcy of Eastern Europe.<br><br>All in all a good movie, good script , decent acting and again superb fights. Unexpected well done : 7/10.","user":"teo_adi_re","rank":[37,40]}]