[{"title":"Neither a disaster nor a classic, but decent, fun and action-packed in its own right.","rating":6,"date":"2 January 2015","review":"It isn't easy to make a good fantasy film – as borne out by Seventh Son, which has suffered a particularly arduous journey to the silver screen. Originally slated for release in February 2013, its visual effects house went bankrupt and its studio, Legendary Pictures, parted ways with distributor Warner Bros. The film that's finally stumbling into cinemas almost two full years later (courtesy of Universal Pictures) should be an unmitigated disaster. Surprisingly, it's not. The film isn't exactly great, but it's a largely entertaining romp that's more inspired by than strictly faithful to Joseph Delaney's series of bestselling books.<br><br>Tom Ward (Ben Barnes) is the seventh son of a seventh son: a rare genetic lineage that sets him on the path to becoming a Spook a.k.a., a slayer of the myriad evil creatures that haunt the land. He becomes the apprentice of grizzled, alcohol-addled John Gregory (Jeff Bridges), shortly after Mother Malkin (Julianne Moore), an evil witch, escapes her earthly prison to claim the world as her own. With only a week to go before the blood moon rises, Tom trains with Gregory but finds himself distracted by the charms of Alice (Alicia Vikander) – a mysterious young lady with a few secrets of her own.<br><br>While hardly groundbreaking in any way, the story unfolds with unexpected punch. Tom's story – one in which he comes of age and comes into his own – is accompanied by plenty of action sequences, courtesy of bone-crunching battles between men and other men (and women) who turn into soaring, swooping, fire-breathing dragons. Tom tumbles over a cliff to avoid a pursuing monster, Gregory battles a gigantic bear, and wraiths of smoke and despair trail after the Spook and his apprentice as they make their way through a dark, brooding forest.<br><br>It helps, too, that the film is leavened by a welcome bite of humour. Seventh Son doesn't take itself as deadly seriously as some of its brethren in the fantasy genre do. That's why Gregory plunges into a bar brawl armed with nothing more than his flagon of beer, and Tom is allowed to make quite a few cutting remarks about his purported mentor that are heartily returned with interest.<br><br>Ardent fans of Delaney's books should be warned: Seventh Son riffs on elements of the novels rather than staying strictly true to them. For one thing, Tom is considerably older in the film. Most noticeably, Malkin is a very different character than she is on the page. She's given more depth and complexity here, her vile behaviour explained, if not strictly justified by, her past entanglements with Gregory. It's actually quite nice to see a fantasy world that doesn't simply perpetuate the trope of the wicked witch, but instead dreams up characters that fall along a broad spectrum of morality.<br><br>Barnes is well-cast as Tom, holding his own as both a hero and quasi-romantic lead. He shares a sweet, though not particularly electric, chemistry with Vikander who is, thankfully, called upon to do more than simper and flirt. But there are considerably more thrills to be had with Bridges, who manages to fold charm, menace and darkness into Gregory; and Moore, who's clearly having plenty of fun cutting her way through scenes as a whirlwind of madness and malevolence.<br><br>By all accounts, Seventh Son should really have been an outright flop. It may still play as such to any fantasy aficionados who are demanding greatness on the level of The Lord Of The Rings. But, for pretty much everyone else, Seventh Son is an entertaining, undemanding film with some good ideas and a lot of fun moments. It's not a particularly great example of its genre but, given its troubled production history, that it's not completely execrable is probably nothing short of a miracle.","user":"shawneofthedead","rank":[157,196]},{"title":"Solid fantasy-adventure","rating":7,"date":"31 January 2015","review":"I'm afraid after many delays and with a February release date in the US, this would flop. I would understand it in a way. It looks like a cheap B-movie. And a B-movie it is: offers nothing new, nothing special, it exists only to entertain. And you know what? I LOVE that. I'm THAT kind of person.<br><br>Despite it is based on a book, the story is so average it hurts. And while the characters are also clichéd, at least they have some flesh, thanks to the actors and the director.<br><br>It has some nice monster action set pieces and the pace moves in a good fashion. While its production cost is nowhere to the likes of a Hobbit movie, the effects are great and I was very surprised that the 3D actually worked. <br><br>My advise: If you want an experience like the Hobbit or the Harry Potter movies, don't watch this. But if you like fantasy movies like Willow or Dragonheart (and maybe Stardust), give it a chance.","user":"korcsmarosandras","rank":[132,186]},{"title":"For Fantasy Fans Who Enjoy The Genre, It's An OK Watch.","rating":5,"date":"21 February 2015","review":"I can see why critics and people in general are dissing the film. I think the problem with the film, is that it's director, Sergey Bodrov has never done a film of this scope. At least, never a film with a budget of 95 million dollars. <br><br>The film is 102 minutes long. Had it been longer, I think many more \"things\" could have been better explained. It just seemed some of the scenes were out of sequence, or, didn't have enough detail. Had this film had Peter Jackson, or Guillermo del Toro at the helm, it would have been an entirely different film. Considering the LOTR series each had about the same budget, this film could have been so much more.<br><br>The film seemed fragmented. It reminded me of the failed film Eragon, where you suddenly go from farm boy, to instantly learning Elvish, knowing how to fight, and just \"knowing\" everything. We need to see the characters develop.<br><br>Now, I'm a hard core fan of this genre. I'll be the first to admit, that pairing Jeff Bridges with Julianne Moore was a great idea. While we get more background on Bridge's character than we do with other characters in the film, their performances, while quite acceptable could have been much better. Personally, I thought Bridges portrayal of Master Gregory was well executed. Again, I think the director was perhaps the main problem, reigning in their performances.<br><br>I keep seeing articles and reviews from people who've read the book, then bash the film because the film itself is so far separated from the text. I don't like to compare books to film, simply because you can go into so much more detail in a book. <br><br>I have to say it. I still enjoyed the film even though it left a lot of unanswered questions for me. If you like the fantasy series, as I do, then go into the film without preconceptions, and, enjoy it for what it is, entertainment. While it's not the best film to ever hit the big screen, it's still fun.","user":"Vaduen","rank":[52,70]}]