[{"title":"Film is watchable but should have been much better","rating":6,"date":"16 March 2014","review":"The filmmakers decided to combine a post-apocalyptic adventure with a zombie picture, and it was a pretty good idea. Here, Earth has entered a second ice age, killing most of the human race, but scattered outposts of survivors remain in underground locations. One such place is Colony 7, where about 50 people hunker down in an abandoned factory and try to survive off of some saved seeds used for farming in a greenhouse along with melted water. It's not easy, with the common cold being fatal and infected people forced to either leave or be shot. There are several stories going on, the efforts to survive, the well-meaning but not entirely successful leadership of Briggs (Laurence Fishbourne) the love story between Sam (Kevin Zegers) a young resident loyal to Briggs and pretty botanist Kai (Charlotte Sullivan) who is in charge of the seed inventory, and militant army veteran Mason (Bill Paxon) who wants to install himself as the colony's dictator. This comes to a head when a distress signal is picked up from Colony 5,a similar outpost a couple of days away. When Briggs, Sam, and another resident (Atticus Dean Mitchell) hike there to provide aid, disaster strikes. The film boasts convincing sets and snow, good photography, decent acting, and a some intelligent ideas. So why isn't it all that exciting? For some reason, the writers never do anything new or novel with their material and everything dissolves into routine zombie mayhem, except that these zombies are just too clever to be believable. Not only are the various stories not resolved successfully, it's becomes increasingly unbelievable. Clear footprints in the snow when it's snowed non-stop for 48 hours is one of the more ridiculous events. There are others, as well. The ending is also so rushed and abrupt, I felt cheated and so did many other viewers, judging from the reviews.","user":"highwaytourist","rank":[39,46]},{"title":"Probably realistic, because people are naturally stupid","rating":7,"date":"30 July 2013","review":"The Colony started a lot better than other post apocalyptic movies. It presented a cataclysm (one pretty hard to believe, but let's just assume we can go past it), a survivor colony, with characters and ideas and rules and an event that changes the status quo. I was beginning to feel good. Not only a decent film, but a sci-fi horror as well.<br><br>Then audience profiling cast its ugly head. The characters have to be cardboard clichés that we've seen in so other bad films. The old people have to be surpassed and replaced by the young. The villains just want to destroy and snarl. In the end, it just turned into a joke: a highly organised team of survivors run away aimlessly firing guns in every direction but the enemy, while a pack of wild humans attack with machetes and other similar devices, like a bad remake of the Anglo-Zulu war.<br><br>Bottom line: started good, continued bad, ended stupid. So an average Hollywood sci-fi.<br><br>Good actors like Bill Paxton and Laurence Fishburne are stuck in films like this. They do their best, but really, that is limited by the single dimension of the script. In the end they have to be either good or bad and anyway they have to die for the main, young, beautiful, incredibly stupid main characters to rise to the opportunity. Things like these make me not trust the hope of humanity surviving a disaster.","user":"siderite","rank":[117,158]},{"title":"Just a film that could have been much better","rating":3,"date":"23 July 2013","review":"Interesting atmosphere, solid set of actors, good opening of movie which draws you somewhat in, waiting what will happen next.<br><br>Solid graphics...<br><br>Film moves on and somewhere in the end of first third of it, CUT!.<br><br>Its like somebody came in to the set and said: \"Wrap it up guys, we are closing!\".<br><br>End is terrible, and over all everything that happens in first part of the movie is blown in the rest of the movie.<br><br>Nothing special, already seen, and definitely not gonna see it again. Not even recommended.<br><br>Its like short B-movie based on a short survival comic book story. Like I said i don't see what they where thinking, or what went wrong and who is a guilty party.<br><br>Graphics, actors, set, atmosphere, story, it all holds separately as parts of good movie but all together just fails terribly.","user":"duckrogers007","rank":[125,175]}]