[{"title":"A Nutshell Review: An Empress and The Warriors","rating":6,"date":"22 March 2008","review":"I guess a new Hong Kong trend is emerging. I recall that as a kid, there was the Mr Vampire movie, which spawned a slew of Chinese vampire movies in its wake. Then there was John Woo's A Better Tomorrow, which gave birth to a whole lot of brotherhood-amongst-thieves themed films. And then there was Once Upon A Time in China, which brought about a renaissance in martial arts movies based on historical or beloved fictional folk heroes. These days, we're living in the Warring period era, where we have a fixation with armour, and more armour, thanks to movies like The Myth, Battle of Wits, The Warlords, Curse of the Golden Flower, and more to come with Battle of Red cliff, and Three Kingdoms: Resurrection of the Dragon.<br><br>An Empress and The Warriors continue this trend, based on the state of Yan which is under constant warring with the state of Zhao. The titular characters here are Yen Feier (Kelly Chen) who becomes empress after the assassination of her Emperor father, and because of the unhappiness of rival generals over the appointment of Donnie Yen's General Muyong Xuehu as heir to the throne. So he refuses to partake in any more political schemes, and throws his support behind his childhood friend and unrequited love of his life, whose relationship with her is made even more complex as he has to train her to become a warrior, ala Mulan, in montage style.<br><br>And no thanks to her scheming cousin Wu Ba (Guo Xiao-Dong) who tries his very best in sowing discord amongst the court / generals, in order to see his ambition of sitting on the throne through. Another assassination attempt on the life of Feier, and we're introduced to the other Warrior from the title, Duan Lan-Quan (Leon Lai), who in actual fact looks like and lives like an Eastern Robin Hood, on a set that looks a complete rip off from Robin Hood: Prince of Thieves. The inevitable romantic tangle between single beautiful princess and good looking doctor begins, and begs the question whether she still remembers her pledge to put country first. <br><br>In truth, there are many elements here from the Robin Hood folklore, besides the set, with the bows and arrows, ambush cum assault which was thankfully well done in keeping up the tempo, and a fight sequence atop floating logs that drew inspiration from Robin vs Little John. The romantic angle though was quite unnatural and unfortunately felt very forced, and bogged down the entire movie, with Feier in a dilemma choosing between two potential beaus, and each of them having reason to hold a candle for her. I was half expecting Bryan Adams to come belting out his hit single, but we're treated to a duet by the two leads (who are singers by the way), in what I believe could have a chance to top the mando-pop charts.<br><br>Action wise, you've got to leave it to Donnie Yen to deliver the goods. Alas, there's nothing too different here with the war battle sequences, as it again borrows heavily from its peers, in particular, Stanley Tong's The Myth (in fact, too much and too direct a reference), and cut down one too many horses (none were harmed of course). Yen did seem rather stiff under all that heavy metal, and there isn't any single fight sequence that stood out during battles, except perhaps for that token same-screen sharing scene with Leon Lai, or that flight into the forest (yet another nod in the direction of A Touch of Zen).<br><br>All that's left of this movie that's worth mentioning, are the beautiful, intricately designed suits of armour, so much so that even Leon Lai has a full suit just to aesthetically please the movie's poster, and the cinematography, credit due to Zhao Xiao-Ding, who also lensed House of Flying Daggers and Curse of the Golden Flower.<br><br>An Empress and the Warriors turned out to be a movie that's neither here nor there - a weak romance and a weak war action movie, and its storyline, which at times confounds because of its implausibilities in character motivation and loopholes, all add up to making this an average movie at best.","user":"DICK STEEL","rank":[41,52]},{"title":"overall a good film!","rating":8,"date":"7 April 2008","review":"WELL WORTH THE WATCH! <br><br>Some may point out its flaws with reality, but that is not what the movie is about. It is an intense, well choreographed fantasy about feuding nations, betrayal, and the love story caught in the middle that almost all war movies have. The action scenes along with the amazing design details in the armor and weapons are what really makes the film. You will definitely not go wrong in watching this movie. <br><br>The major critique that I have is that the love story seemed a bit weak and disconnected from the rest of the plot. They did attempt to incorporate it within the background of the characters, but it just moved too quick to really convince me.","user":"ajpudlo-1","rank":[27,38]},{"title":"What a beautiful and romantic movie!","rating":10,"date":"16 March 2008","review":"Someone will point out the plot has some flaws, yet it doesn't matter for me to enjoy one of the most exciting two hours in my life! The movie is full of bold imagination, amazing depiction of ancient wars and the great actions of superhero. Donnie Yen in the last scene is just the Mars and there have never been a character in the cinematic history as heroic as him! You will be touched to cry when Leon Lai and Kelly Chen ride the fire balloon to watch such a splendid landscape of beautiful China! The scene that Leon Lai is going to fly with his fire balloon and Kelly Chen hurried to catch up with him, with the accompany of the Orphean strains of the theme song, will become one of the most romantic scenes in Chinese cinematic history! Believe me, take your beloved to watch this movie at weekend and you will love each other more!","user":"chenyiaero","rank":[29,51]}]