[{"title":"Just about everything in this has been done before, but still damn entertaining","rating":7,"date":"12 April 2010","review":"This movie is basically about two guys going around blowing stuff up in Paris. And the plot of them trying to take down a terrorist organization is just there to move the movie along because, even for films like this there has to be some sort of plot. And everything in this is nothing you haven't seen before with the explosions and gun fights and all, but something about the film just makes it pretty damn entertaining. I mean the plot with the by the book dude teaming up with a loose cannon crazy guy has been done before, but the elements of bad ass and witty and fast paced dialogue and maybe some other stuff makes it really entertaining to watch, even if the twist near the end was pretty predictable as the rest of the movie. Jonathan Rhys Meyers who plays a character that plays by the book was pretty boring and he takes up the first few couple of minutes of the movie, but when John Travolta comes in, well lets just say it's one hell of a ride. He basically plays Charlie Wax, a reckless guy that is a bit crazy but always gets things done. Just turn your brain off and enjoy this movie for what it is, not every film has to be smart to be enjoyable.<br><br>7.5/10","user":"KineticSeoul","rank":[101,151]},{"title":"Silly and over the top","rating":27,"date":"27 February 2010","review":"A personal aide to the U.S. Ambassador in France, James Reese (Jonathan Rhys Meyers) has an enviable life in Paris and a beautiful French girlfriend, but his real passion is his side job as a low-level operative for the CIA. All James wants is to become a bona fide agent and see some real action. So when he's offered his first senior-level assignment, he can't believe his good luck - until he meets his new partner, special agent Charlie Wax (John Travolta)...<br><br>From Paris With Love is an unrealistic, over-the-top action flick. The plot is extremely silly, the story quite implausible, and the action scenes are absolutely ridiculous not to mention that you can see the twist coming from the beginning.Both Travolta and Jonathan Rhys Meyers deliver good performances and they had good chemistry but at the same time their characters are paper-thin and were poorly written. Something that appalled me was the editing of the film and the transition between some scenes. I thought it was rather choppy and not something I would expect from experienced directors like Luc Besson and Pierre Morel. The film does have its moments and can be quite entertaining at times but if you're expecting something along the lines of Morel's last film, Taken, which was a well thought and realistic action-thriller then you're gonna be extremely disappointed. Recommended for action junkies only.<br><br>6/10","user":"imdbbl","rank":[122,198]},{"title":"A Fun Way To Spend 90 Minutes.","rating":7,"date":"27 May 2010","review":"A young spy who wants to get bigger and better jobs is partnered with an American hot head with a foul mouth and a love for violence. The mission is to stop some terrorists. <br><br>To say I was expecting crap would be an understatement. Travolta's goofy look, a tired clichéd pairing of straight man and crazy partner, senseless action that would try to cram a plot and story in at some point. Yet, after the credits rolled, I sat there with a smile on my face. As far as spy films go, this one takes a more action heavy side. There are some cool and interesting gadgets, but I didn't get any James Bond moment. <br><br>Travolta surprised me here too. His character was funny, bad ass at times and knew how to kick some ass. The only downside would be that I just couldn't imagine Travolta doing half of these things. He's a great character and fits perfectly with this film, but it seems a tad miscast for the action sequences. Travolta nails every other part of the role. Jonathan Rhys Meyers is the straight man to Travolta's crazy hero. This is nothing new and the film doesn't try to step around this issue. Instead it is upfront about it. It tells you exactly what you are in for when you are introduced to these characters. All it asks is for you, as a viewer, to enjoy the action and thrills this film wants to give you.<br><br>The action is non-stop. Of course we are privy to those scenes in between where we need to move the plot along, but the film has shootouts, car chases, foot chases, rocket launchers, etc. It's handled well and I was actually able to see the action on the screen. I was never lost in the film, I knew where I was the whole time and what was being depicted. Again, that one shortfall is that we know Travolta isn't doing these action sequences, it's clearly a stuntman. <br><br>With every spy film you know there will be some twist that someone is not who they seem to be. I was able to pick this one out right from the beginning. Again, the plot devices used in From Paris With Love are far from original, we have all seen this film before. So why bother watching it? For the chemistry between the two leads and the action sequences in a beautiful city. The city, we unfortunately, did not see enough of. <br><br>I went in with low expectations and came out happy with the end result. I would suggest you do the same.","user":"Matt_Layden","rank":[56,86]}]