[{"title":"Small dose of Jack London, but good 3D","rating":7,"date":"22 March 2010","review":"If you want to watch the best adaption of the classic novel, Call of the Wild, then this shouldn't be your choice. On the other hand, if you like outdoor adventures featuring animals, this is a good pick. And for 3D fans this is worth watching as well. The Jack London story is interwoven throughout with images while the story is read out loud by Grandpa each night. This is only a small percentage of the whole story. The rest is about a 10 year old girl visiting her grandfather, they find a physically ill dog-wolf, bring it back to good health &amp; with tough opposition, try to keep it. The acting is good and the 3D works pretty well on your TV screen with the red &amp; blue glasses. Both 2D &amp; 3D versions are on one single disc. The outdoor location filming was a very big plus. Pretty good cast including famous siblings. Timothy Bottoms(The Last Picture Show, The Paper Chase)brother of Joseph, and Veronica Cartwright(Alien, Invasion of the Bodysnatchers) sister of Angela. Then there's Christopher Lloyd(Star Trek III, Back to the Future, Taxi TV series) and in a small but good part, Wes Studi(Geronimo, Last of the Mohicans, Dances with Wolves, Avatar). And yes, there is a dog sled race.","user":"Gblakelii","rank":[14,15]},{"title":"A nifty, modern day parallel story of Jack Londons' incredible novel.","rating":8,"date":"15 June 2010","review":"Grampa reads \"Call of the wild\" to his granddaughter as their own version unfolds after a wolf/dog comes to the house in the woods of Montana wounded and needing help. The dog slowly heals and soon is involved in a sled race that will determine if he gets to stay with those who love and treat him kindly, or those who will use and mistreat him. It is a gentle depiction of the bad that is in our world. One I think even very young children could deal with.<br><br>The snow covered scenery is breathtaking and the thrill of watching the dogs run is exciting. <br><br>Grampa's cabin is absolutely gorgeous. If you love log buildings pause at the places that offer a good view. It's fantastic. It gave me goosebumps to see it.<br><br>The kids do a credible job and not once did I get the feeling they were \"acting\".<br><br>This was a great movie, it's rated PG for a few \"scary\" moments but I think kids should be able to watch with mom and dad.<br><br>Wes Studi does a great job of being the mysterious man on the mountain, at first intimidating then later helpful. Chris Lloyd plays a gentle and loving grampa.<br><br>It was heartwarming and I was sad when it was over. But I'm an old sentimental grampa myself.<br><br>I rated it 8 for the lessons it taught and the interaction between the characters.","user":"headhunter46","rank":[3,4]},{"title":"Hits My soft spot for low budget films","rating":7,"date":"16 February 2016","review":"Call of the Wild 3D is a modern day story about a city girl (Ariel Gade) from Boston going to visit her grandpa (Christopher Lloyd) in the wilds of Montana. While this isn't going to win any Oscars, for a small budget direct to DVD feature, it's really pretty good fun. The 3D shows off the beautiful scenery and the story, while somewhat predictable, has fun tie ins to Jack London's book, The Call of the Wild through Grandpa reading his granddaughter the story at night. It has a good message, and the acting is really quite good. There are some cheesy parts and some eye roller lines, but the kids thought it was wonderful, and my wife and I found ourselves pleasantly entertained. Christopher Lloyd plays it pretty straight laced in this one, but gives a good performance, and we were impressed with Ariel Gade's performance. It really gave the story credibility.<br><br>Overall an enjoyable family movie for the kids with just enough weight to keep mom and dad entertained as well.","user":"blazer044","rank":[1,1]}]