[{"title":"enjoyable yet confounding","rating":6,"date":"20 March 2009","review":"As with any spy film, a certain amount of complexity in the script is to be expected. However this spy film adds on plot twists, flash backs, back stabbing and double agents with so much frequency that it left me scratching my head by its end. As an on screen team Julia Roberts and Clive Owen work well together but even their performances were drowned out by the sheer complexity of the script. There are also welcome surprises from the supporting cast, each of whom seemed to have their fair share of witty dialogue. Ultimately the movie is less about a romance between rival spies, and is more about keeping its audience wondering just how the plot can twist next. As the final credits role one looming question remains: \"What happened here?\" even complex spy thrillers such as \"Mission Impossible\" had some kind of wrap up at its end that cleared up any lingering doubt or questions and we were happier for it. 'Duplicity' is a fun little spy film, with some fine performances by Roberts and Owen and plenty of well written dialogue, but it is brought down by the overly complex plot and I fear will leave even fans of the genre feeling slightly numb when the credits role.","user":"techcrw421","rank":[107,154]},{"title":"Even Owen and Roberts couldn't save this confusing and mind boggling mess","rating":4,"date":"11 April 2009","review":"Two corporate spies (Owen &amp; Roberts) hook up (after knowing each other a while back) to pull off a scheme to get 40 Million dollars. The mission is to infiltrate a company that each other work in, and expose a secret product the company is releasing. Soon things get out of plan, and the two spies realize they have more feelings for each other than they recently thought. I've been a fan of Clive Owen ever since Children of Men, and I was so gratified to see Julia Roberts back on the screen. A few years ago both Clive and Julia did a movie together called \"Closer\", and it was satisfying to see them back together again. Their performances together are the only uplifting value of this film. Although we could have used more of Paul Giamatti and definitely more Tom Wilkinson, the entire cast was perfect for this film. This movie had too much potential in the first half, but after that it becomes a confusing and mind boggling mess of a movie. There were so many twists, and confused story telling even I heard some of the audience members yell out \"Huh? What was that about?\" The script was good, but the story was horribly told that it came to a very disappointing outcome. That's a shame because I was expecting to enjoy a good suspense movie that wasn't confusing. Duplicity is a often funny and well acted movie, but you'll have to find either the film's director or the screenwriter to translate the story for you, or else you won't get it. It surprisingly turns romantic in the end which makes it a fairly good date movie, but you'll be more confused than dazzled. I have to say skip this movie, and if you want to see Julia Roberts at her best rent Erin Brockovich. If you want to see Clive Owen at his best rent Inside Man. Need I say more?","user":"mexicospidergreen","rank":[123,196]},{"title":"Conned","rating":2,"date":"24 March 2009","review":"I was lured to see this on the promise of a smart, witty slice of old fashioned fun and intrigue - I was conned. A knowing, pretentious, tedious, overlong story which suffocates under its own artifice. Starring Julia Roberts ( Claire Stenwick) ,and Clive Owen (Ray Koval), as \"Duplicitous\" spies, the film tries to recreate the glitter, froth and intrigue of roles made famous by the likes of Cary Grant in the 1950's, yet fails under leaden direction and total lack of chemistry between the leads.<br><br>Director \"Michael Clayton\" Tony Gilroy also has writing credits for The Bourne series, so his credentials are excellent. But Clive Owen seems ill at ease as a romantic, witty lead apparently yearning for the opportunity to play the more robust part he played in the under rated \"International\". Julia Roberts shines in one of her better performances, offering more than her obvious glamour but without the quality of script to enable her to truly excel. She seems barely bothered about enticing Owen into bed, and the word play between them consistently falls flat.<br><br>An extensive travelogue incorporating London, Rome, New York, Dubai and Geneva provides some scenic interest, as these erstwhile CIA and MI6 spies swap political espionage for industrial espionage turning into criminal espionage. At 126 minutes it is at least 35 minutes too long. Sharper editing, greater pace, and less \"flab\" might have made this a better picture. But we are left with it as it is, an instantly disposable, and forgettable addition to the respective parties film credits.","user":"gary-444","rank":[124,198]}]