[{"title":"Overall quality and Cusack's performance are good, BUT... Blu-ray: Very Good A:9 V:9","rating":6,"date":"12 December 2012","review":"This film has quite polarized reviews from suspicious 10 star glowing reviews to 1 star reviews of 'Most Horrible Movie Ever' and other similar variations.<br><br>Okay... I really had to think about how I would rate this one because MANY times I read horrible reviews of films that are made very well, but the 'reviewer' just didn't like it so obviously it's just crap. I honestly thought that technically and quality and acting wise that the film was made very well; the pacing and editing, etc. were indeed quite gripping and intense. The overall premise was mildly intriguing because as you went along you were genuinely curious as to WHY this guy was doing this. And of course as ALWAYS Cusack's performance was good (although, quite honestly he DID look like he was kinda sleepwalking through most of it) <br><br>Now, as far as the 'Ending'... Well... Firstly it DID catch me totally by surprise; I was actually sitting here saying 'NO WAY!' out loud. But, that is a double edged sword because it was so incredible that many here found it almost ridiculous. I wouldn't put it that strongly but I personally think it could have been worked a little better than just kind of attached onto the end of an otherwise competent film; and then the continuing scenes after that also not really quite matching the quality of the rest of the movie.<br><br>So, again, is it well made? Yes. Thus my somewhat generous rating of 6. If a film is put together well (except for perhaps the last 10 minutes) I think that that should be acknowledged so that others reading reviews and trying to decide whether they should bother to see it will know that. It is really great? Well, no... But, if you can take the ending with a teaspoon or two of salt and just enjoy the intensity, pacing, and entertainment value of the majority of the movie, then you might like it.","user":"lathe-of-heaven","rank":[55,62]},{"title":"The factory delivers damaged goods","rating":5,"date":"8 October 2012","review":"After watching this movie, I had to wonder if this genre isn't simply exhausted: basically, psychopath kidnaps daughter of someone he shouldn't have. We all buy into this for one reason. We know that we'll eventually get a pay off in the form of revenge. Make the psychopath as evil as possible so that later we will relish his destruction. We will even overlook inconsistencies and absurdities in the plot as long as we get paid off for it. Well, I'll leave it up to each viewer to determine whether this film paid off, for me, it didn't.<br><br>This movie can only work if you accept the amazing coincidence that forms the basis of the story, but then you find that you have to accept a lot more coincidences. What I think happened was that the initial screenplay had logical inconsistencies which the writer(s) attempted to plug which led to more inconsistencies and so on. So you get a lot of contrived scenes and 'wow, look what I found, what a coincidence\" scenes. I have a feeling that the whole ending was grafted on as an afterthought and then the screenplay was readjusted to it.<br><br>I watched this movie primarily because John Cusack was in it and that gave it a certain credibility. He does okay. There's nothing much in the way of interacting with other characters. They could have been played by mannequins and the movie would have been about the same.<br><br>Much of the movie seems like a series of scenes grafted on from other movies like \"Taken\", \"Taxi Driver\" and a few others. My advice for potential viewers is to watch those movies instead. The Factory needs too many renovations.","user":"SteveMierzejewski","rank":[47,64]},{"title":"Biggest weakness is the twist","rating":5,"date":"20 January 2013","review":"Okay, so one of the greatest strengths of a thriller is normally a totally unexpected twist - but in this case the exact opposite is true.<br><br>The film starts out as a dark, claustrophobic thriller - the kind we used to get in the days of SE7EN and Silence of the Lambs, etc. However, the twist the movie delivers, and it's final conclusion, ultimately end up completely derailing this film and turning it into a train wreck of absurdity.<br><br>At the end you feel like you've watched two different movies, and in this case that's not a good thing.<br><br>There's also some really annoying plot/character issues which start to appear prior to the moment of the movie-derailing twist (looking back now these were warning signs of what was about to unfold).<br><br>For example, the daughter goes from being a frightened and confused teenage captive to being the solid rock/savior for the other victims within a matter of scenes, before finally ending the film in the role of avenging angel.<br><br>Then there's the confusing motivation of the antagonist - why does he need so many babies? Did he always plan to make babies with his victims? Why was he making babies with his victims anyway? Why would he let one infertile victim live and become so central to his plans when one of the key plot points involves driving home the fact that infertile women are surplus to his requirements, and are killed because of this? <br><br>At the end of the day this movie just didn't know what it wanted to be - a dark serial killer mystery with a touch of gritty realism, or an escapist thriller with a mega twist.<br><br>If it had just chosen one or other of these two paths it would have probably worked a lot better, but because it tried to do too much, the plot twist and final ending, which would have been great in an escapist thriller, actually end up completely sabotaging the film.","user":"brendan-268","rank":[20,26]}]