[{"title":"in defense of An Education","rating":7,"date":"20 February 2010","review":"*** Major Spoilers ***<br><br>\"An Education\" is an entertaining little film, well done in all respects and superbly acted.<br><br>Some commentators here have complained about how implausible it was how the heroine, and her father, act in this film. I however think that this exactly is the point the film tries to make:<br><br>-It shows that while being \"smart\" in school when getting good marks, you can still be \"stupid\" when it comes to relationships (Thinking that it is OK to be deflowered by a much older man you hardly know, as long as you are seventeen years old - so bizarre!). In school they may train you to get an \"A\" but the things that are really important in life, they don't teach you there. That has been true back then and it is still true today.<br><br>-It shows that even people with a higher education can have completely absurd views. If a headmistress displays such revolting and primitive anti-Semitism as is shown in the film, it may be sad but not at all implausible. Look around you today: Being a scholar at an university sure doesn't prevent you from being an idiot.<br><br>-It shows that while being concerned about his daughter's future, a loving father can still act stupid and make terrible mistakes. I thought Alfred Molina did a wonderful job in portraying this father, who seemed weak and - indeed - very stupid, but not at all implausible.<br><br>For me the most important scene was when Jenny discovers that David is a thief and, outraged, starts to walk away, but is then convinced by David to stay. I'm sure she knows that it's wrong to stay and that there will be no happy ending if she stays, and still she can't help it because the alternative - leading a decent, but boring life - is unacceptable to her. The representation of the world she is living in as seen in the film made me absolutely believe in her dilemma: doing what is expected of her by teacher, headmistress and parents, and be unhappy, or being happy in the company of criminals. A horrible choice indeed, when you can see no third way beyond these two.<br><br>And this is the reason why I found the ending of \"An Education\" the only weak point of the film and very disappointing: Miraculously, Jenny is finally admitted to Oxford, and suddenly the dull and boring life she detested earlier in the film, as seen in the arguments with her teacher and headmistress, is OK? WHY? The ending seemed far too moralizing, as if to say to the young viewers of the film: \"Just stay in school, always conform to what society expects of you, even if it seems boring and useless (like wasting years of your wonderful youth in school), in the end it will all be fine!\" The cheap feel-good-turn at the end, THAT was implausible. It would have been so much better if the film ended with Jenny NOT being admitted to Oxford, leaving the rest to the viewer's imagination.","user":"kleiner_fuchs","rank":[29,30]},{"title":"Well deserved positive criticism...","rating":8,"date":"15 May 2011","review":"I remember this film getting quite a lot of critical praise when it came out and so I was intrigued to see what all the fuss was about. Of course it got nowhere near being shown in my local cinema and so I waited patiently for it to show on TV. A screenplay by Nick Hornby based on a memoir by Lynn Barber and set in London in the early 1960's it has all the hallmarks of a decent production. You'll be glad to know that I agree with the critics, yes, it's pretty good. There were a couple of points where it could have gone off the rails, but fortunately it stayed on the tracks and we have a fine piece of work.<br><br>Jenny Mellor is a bright sixteen year old student whose parents have ambitions for her to study at Oxford University. She is slightly disenchanted with her lot though, and yearns to go out and experience the world while she is still young. By chance she meets David, a man more than twice her age, who recognises something in her and takes her to see the sights. Two friends of his, Danny and Helen come along and Jenny goes to concerts, sees art, dines in fine restaurants and even visits Paris. David does all this with Jenny's parent's permission, he is very persuasive. Of course all is not what it seems and her world is about to take a massive jolt and the many arguments she has made against conformity are about to be tested.<br><br>This is a very well made film which features a stand-out performance from Carey Mulligan as Jenny; she was really outstanding in the part. Peter Sarsgaard was suitably suave as David, as was Dominic Cooper as Danny. Both Alfred Molina and Cara Seymour did a good job as Jenny's parents, Jack and Marjorie. Rosamund Pike played the part of the, rather dim, Helen very well and Olivia Williams did a very good job as Jenny's teacher Miss Stubbs. Finally, a mention for Emma Thompson who had a nice cameo as the headmistress.<br><br>This film asks a lot of questions about how some parents try to control the lives of their children, although it's not the main point of the story. I really liked the way it was written but I still felt one or two bits could have done with tidying up (I'm sorry, I can't be specific – spoilers). Having said that, I did enjoy it very much and I really liked the ending. I would definitely watch it again sometime Recommended.<br><br>My Score: 7.6/10","user":"ajs-10","rank":[15,15]},{"title":"An educated mind is not necessarily an open one","rating":9,"date":"20 November 2009","review":"In the cinema certain historical periods have become associated with a particular set of ideas. The 1960s represent change, progress and excitement whereas the 1950s are frequently regarded as a period of stifling social conformity. Of course, the \"swinging sixties\" did not necessarily start to swing on 1st January 1960, and in retrospect the first few years of the decade seem to have more in common with the conformist fifties than with the \"swinging London\" era of the later sixties. Certainly, many young people during this period regarded London as a dull, conservative place, and looked eagerly to foreign cities, especially Paris, as being more exciting and radical. There was an enthusiasm for everything French- French philosophy, French literature, French cinema, French fashions, even French jazz and French cigarettes. This Francophilia doubtless included elements of wishful thinking- De Gaulle's Fifth Republic was a more conservative place than many Britons realised- but it was nevertheless an influential phenomenon. It is a phenomenon explored in Julian Barnes' novel \"Metroland\" (later filmed), and also in this film.<br><br>The main character is Jenny, a teenage schoolgirl living in the London suburb of Twickenham in 1961. Jenny is highly intelligent, and is studying hard with a view to taking the entrance exams to Oxford University. She is not, however, really sure why she wants to go to Oxford, except that she is being pushed to do so by her parents who feel that university is the best place for her to meet a wealthy husband.<br><br>Jenny's life changes when she meets a handsome and charming older man named David. They quickly become close friends and begin dating. David is clearly wealthy, and claims to be an art dealer and property developer. More important to Jenny, however, is his knowledge of culture. He is well up with all the latest intellectual and artistic fashions from France and takes her to concerts and jazz clubs. What really impresses her is that he takes her to Paris. Eventually, David proposes to Jenny and she accepts and drops out of school without taking her A-levels, her Oxford ambitions abandoned.<br><br>Many parents would be worried about the idea of their sixteen-year-old daughter being romanced by a thirty-something man, especially if his influence leads her to neglect her education, but Jenny's parents, especially her complacent, Philistine father, seem strangely unconcerned. His argument is that as Jenny has now found a wealthy suitor there will be no need for her to use Oxford as a dating agency. His one objection to David as a son-in-law seems to be that he is Jewish. (Anti-Semitism was unfortunately widespread in British society at this period). Yet it is obvious to the audience that there is a darker side to David's character. His business methods are, to say the least, not beyond reproach (the character may have been based upon the notorious slum landlord Peter Rachman) and he never takes Jenny to his home, always meeting her in a luxurious flat belonging to his friend and business partner Danny. Eventually, even Jenny herself begins to suspect that David is not all he seems.<br><br>The title \"An Education\" can be understood on two levels. As a coming-of-age drama it narrates Jenny's metaphorical \"education\" in the wider sense of learning lessons about life. Yet it obviously also deals with her education in the narrower, literal sense of the word. It raises similar issues to another great British film, \"Educating Rita\", namely whether it is formal academic education or informal education to be gained in the outside world which is the more valuable. Jenny drops out of school because she believes that she can better acquire knowledge, both of high culture and of the ways of the world, through her life with David than through academic study. (Jenny's vision of her future life envisages her living with David in Paris on the Rive Gauche, reading Sartre, smoking Gauloises and going to the cinema to see the latest productions of the Nouvelle Vague). It seems hard to blame her for this conclusion, given that in the film the main advocate of the life academic is her headmistress, an intellectual snob and virulent anti-Semite (\"The Jews killed Our Lord!\") who serves as a reminder that an educated mind is not necessarily an open one. It is only when she becomes disillusioned with David that Jenny starts to reassess her priorities.<br><br>Her performance in the lead role has led to Carey Mulligan being hailed as the \"new Audrey Hepburn\", although the main point of resemblance seems to be that at one point in the film Jenny sports (as many young women doubtless did in the early sixties) a Hepburn-style hairdo. Nevertheless, on the basis of this performance Mulligan would appear to be a highly promising star in the making, perhaps the new Keira Knightley. Although she is actually 24, she always seems entirely believable as a naive young teenager. Other good contributions come from Peter Sarsgaard as the smooth, reptilian David, Alfred Molina as Jenny's comical, blustering father, Rosamund Pike as Danny's airheaded mistress Helen and Emma Thompson in an excellent cameo as the obnoxious headmistress.<br><br>Period drama is something the British cinema often does well, and \"An Education\" falls within this tradition, even though it has a Danish director, Lone Scherfig. 2009 has already seen two good British costume dramas, \"The Young Victoria\" and \"Dorian Gray\", but \"An Education\" is an even better one. It is not only a study of a girl on the verge of womanhood, but also an exploration of issues such as social class, racism and the value of education. One of the best British films of recent years. I hope that the Academy will remember it when next year's Oscars are being handed out. 9/10","user":"JamesHitchcock","rank":[199,244]}]