[{"title":"Amazingly even worse than the original.","rating":2,"date":"21 January 2008","review":"666: The Beast starts a number of years after the original 666: The Child (2006) &amp; is set in Los Angeles where Donald Lawson (Chad Mathews) is a balding middle aged executive at a company called GlobalTech. His boss promotes Donald to junior vice president of the company &amp; also reveals that Donald is in fact the Antichrist destined to take over the world which all things considered Donald takes pretty well. However Donald's boss also says that a baby will be born who will have the power to destroy him unless he kills it first, as by a strange (budget saving) coincidence it's Donald's wife Kate (Makinna Ridgway) who is pregnant with the baby. So in a roundabout ironic sort of way the only person who can stop Donald destroying the Earth is his wife, the one person who loves him the most...<br><br>Writeen &amp; directed by Nick Everhart 666: The Beast is The Asylum's straight-to-DVD sequel to their straight-to-DVD The Omen (2006) rip-off 666: The Child &amp; against all the odds the makers of this have actually turned in a worse film than the original. I saw 666: The Child a couple of days ago so basically I have seen both in the space of a weekend &amp; quite frankly I almost lost the will to live they are that bad. At least 666: The Child had a plot which you could follow, sure it didn't make much sense &amp; it was pretty poor but there were at least signs of a story there while in the case of 666: The Beast you will struggle to find anything approaching a coherent story. 666: The Beast was a straight The Omen rip-off with a creepy demonic kid this time around Donald is grown up &amp; the first hour or so is nothing more than him getting a promotion &amp; then being told his true destiny which he takes surprisingly well. Who was his boss anyway? How did he know who Donald was? Why was he Donald's boss? Wouldn't it have more sense if Donald was the company president? I doubt Donald will be able to mastermind the destruction of the entire world as a junior vice president! There's precious little incident, there's no horror, there's no gore, the story is awful, the supernatural elements are absolute rubbish &amp; what happened to the sexy secretary Sydonai? It moves along at a snail's pace &amp; is really boring, hardly anything happens &amp; the whole thing is just a mess.<br><br>Director Everhart has the shaky camera syndrome, it's not as bad as The Blair Witch Project (1999) but the camera sways gently from side to side on most shots. Basically it looks awful as well as being horrible to watch. There are a couple of scenes set in a church which are quite moody since they are lit by huge shafts of sunlight coming in through the window &amp; they are at odds with how bland the rest of 666: The Beast looks to the extent they almost feel like they belong in a different film. The gore is none existent, all the murders from the first film 666: The Child are replayed in flashbacks but as far as original gore goes there are a few off screen stabbings &amp; a bit of fake blood otherwise absolutely nothing. There's certainly nothing in 666: The Beast I would describe as a special effect.<br><br>With a supposed budget of about $500,000 the makers didn't have a lot of money to play with but that's really no excuse for turning in such an awful film, there are plenty of low budget horror films out there which are much, much better than this. The acting sucks as well.<br><br>666: The Beast is a terrible film, it's one of those films which make you want to reach for the 'stop' button on your remote control &amp; how I managed to prevent myself from pressing it I will never know. 666: The Beast is awful &amp; it's as simple &amp; straight forward as that.","user":"poolandrews","rank":[8,9]},{"title":"What a frightful waste of time...","rating":1,"date":"28 October 2007","review":"This is probably one of the worst movies I have seen so far this year. Dull, boring, not-making-a-lot-of-sense... lots of holes in the plot and acting which I have seen better in school plays.. Actually I think I would prefer watching 'Bloodrayne' and 'Bloodrayne 2' again as opposed to this lame excuse of a movie. If you have never seen any movies in this genre (The Omen, Stigmata, Bless The Child and so on) - please - do not watch this one. It will make you run away from the genre... But OK - to be fair to this movie - I haven't seen the first one (666 The Child.. I think), but I do not feel any urge to see the first one. It probably could have been OK for a Sunday with a hangover if they had changed the script, the director and the actors...","user":"chaosholm","rank":[17,23]},{"title":"Not among The Asylum's worst, but still dire","rating":2,"date":"17 September 2012","review":"The music occasionally has some broodiness, but that is nowhere near enough to save this film. Is it The Asylum's worst? No, that's a tie between 2012: Doomsday, Alien Origin and Titanic II. Is it also as bad as 2010: Moby Dick, Transmorphers, AVH: Alien vs Hunter, War of the Worlds 2 and Death Racers? Not quite, but that is saying very little. I found 666: The Beast cheap to look at, it is dully lit and has slipshod effects, but it was the camera work that really made it so. The shaky camera technique not only gave me a headache but it is also used far too much, and there are also too many shots of Alma Sarachi's bottom. The acting is bland with nobody that stands out, they don't connect with their characters and consequently we don't connect with them either. And no wonder as the characters are so clichéd and underdeveloped. 666: The Beast is a very poorly written as well, the dialogue is stilted and cheesily delivered while the story is sluggishly paced, incoherent and full of overlong exposition scenes and any suspenseful or \"scary\" scenes missing two vital ingredients to make them work, suspense and a genuine sense of horror. The direction is lazy also as well. Overall, The Asylum have done worse, but in all honesty that is saying little in 666: The Beast's favour. 2/10 Bethany Cox","user":"TheLittleSongbird","rank":[3,3]}]