[{"title":"Small in scope, Grandiose in concept","rating":10,"date":"5 July 2009","review":"While book racks are brimming with thought provoking, high concept science fiction, the movie genre tends to be populated by invading aliens, intergalactic wars, and adventure, which makes Director and co-writer Duncan Jones' Moon that much more of an oddity.<br><br>Not since Steven Soderbergh's much overlooked 2002 rendition of Stanislaw Lem's Solaris has a movie firmly rooted in the sci-fi realm delivered reflections on the human condition, which Moon does deftly.<br><br>It tells the story of Sam Bell (Sam Rockwell), the only inhabitant of an automated lunar mining base extracting Helium-3 from lunar rocks to be shipped back to Earth to fuel the energy starved planet.<br><br>Sam's isolated three year posting is about to come to an end and he longs to return to Earth to see his wife. His only company throughout this sojourn has been that of Gerty, the base's HAL-like robot voiced by Kevin Spacey. Unfortunately, the final weeks and days are proving to be the most difficult, and Sam finds himself going a bit squirrelly, leaving both he and the audience to wonder if what's unfolding is actually happening, or merely a drama taking place in his addled mind.<br><br>That's about as much plot detail as I'm going to deliver, for to delve any deeper into the story would give too much away. Be prepared, however, for a thought provoking narrative that touches on issues such as scientific ethics, corporate greed, human identity, and compassion.<br><br>There are no aliens, lasers/phasers, wormholes, warp engines or jump drives here, just a lonely space age concierge, an unflappable monotone robot, and a whole lot of fodder for your brain to chow down on.<br><br>This is what science fiction was meant to be.","user":"Craig_McPherson","rank":[802,890]},{"title":"Fantastic...","rating":10,"date":"20 June 2009","review":"In short, this is one of the best sci-fi movies I have seen in a LONG time. Sam Rockwell plays it perfect, making the viewer feel his isolation and lonelieness. For a low budget film, the few effect shots work seamlessly. I'm trying to remain spoiler free, so I won't bother to explain the plot. If you like older and more story/character driven sci-fi, such as 2001: A Space Odyssey, than chances are you will love this movie. If you aren't a huge fan of sci-fi, take a chance with this one. You may find it a very rewarding experience. I loved this movie, and I can't stop thinking about it. In Moon, you may begin to think that everything is a big cliché, but than with all of the seemingly cliché plot points, Moon changes them into something entirely original and unexpected. It is an excellent piece of art and I have a strong feeling not enough people will see and appreciate it like I did.","user":"Tasslehoff6","rank":[519,606]},{"title":"Utterly Fantastic and Inspired","rating":10,"date":"9 April 2009","review":"Go see this movie! I've been lucky enough to have an opportunity to see this movie down here at SXSW and I am the better for it.<br><br>You don't really stumble upon many riveting, independent, sci-fi films that look beautiful(let alone don't contain aliens and space magic) and capture major emotional themes successfully. Moon accomplishes this, and with very little CGI at that.<br><br>Sam Bell is an astronaut working for a corporation on the far side of the moon. His job? Maintaining a lunar facility and the automated machines which are harvesting the moon's surface for Helium 3. The harvested material is then sent back to Earth to use as energy.<br><br>Sam is on the very last leg of a three year contract and is quite anxious to return to his wife and daughter. Barring any incidents, Sam will be able to leave his solitude. But something does go wrong.<br><br>That said, tremendous acting by Sam Rockwell carries this film - mainly because he is basically the only person in the movie. I'm not talking about Cast Away meets the moon This film explores loneliness much deeper than that, and with much more emotion as well. Luckily for us there are no pieces of sports equipment on which the lead dotes, but instead we're blessed with a monotonous talking robot(voiced by Kevin Spacey) reminiscent of Hal from 2001 notoriety.<br><br>I advise that people go see this film, not only to support Duncan, the director, and Sam, but also to explore to possibilities of space and the humanity of loneliness.<br><br>Don't go in expecting to find what I have discussed, but go in expecting to find something inside yourself.","user":"ryanboulding","rank":[569,679]}]