[{"title":"Femme Fetale no longer","rating":7,"date":"3 April 2010","review":"This movie was a surprising little film for its intelligence and a nice change of pace for a repetitive genre. In films that open the same way this film does- two people of different social classes meet at a bar, one seems like a simple man of good repute and the conformist ideals of a hero, the other a dark, sexy foreign woman of the upper class who appears to be the femme fatal (the one who will drag this upright citizen through the depths of hell in a web of dangerous passion)- you think you've seen it all before. But the story turns in on itself- it is the hero of this film who carries a dark past, a not so clean cut belief system, and a desire to rebel against society- he is the violent one in turmoil going through his own form of hell. It is the female foreigner and seducer (played fantastically by Paz Vega) who raises him out of the depths to which he has sunk by instilling in him the need to connect with others and the ability to confront his past. Their affair is dangerous but necessary for character growth. He brings her down, but she saves him from himself. The ending scene is brilliant- the man paints his (metaphorical and literal) blue room to \"White\". He needs Michael (Paz Vega's character) to help him reach a state of solace to paint his life and create an empty canvas upon which the audience can draw their own conclusions. Is their affair healthy? No...maybe? Is it necessary, their coming into each others lives, and destroying what they have each built for themselves? YES","user":"hikacute","rank":[15,15]},{"title":"OMG!!! Seriously","rating":1,"date":"19 July 2009","review":"I know no one will probably read this comment, but I had to take the time to write a comment. I truly admire Jada for wanting to do her thing, but this movie was not it. My husband and I watched this movie and are still left with trying to figure out what the heck she was trying to go with this movie. Yes it was dark, but dark with too much contrast and not enough to balance it out. All we got was dark very very little explanation of why the characters TRULY were the way they were. We all have secrets and locked closets, but to tell a story and not delve more into the psyche of the characters is irresponsible. The best books are written with the intent for us to relate to the character(s). Every movie starts as a book and this was not a good one. I feel as if the characters were developed more it could have and would have been a much better story. I still don't get Jada's part in the movie. An undeveloped story gives you unnecessary characters. I expected more from Jada because she has a lot of talent. This movie just didn't show it.","user":"camsanda1900","rank":[45,65]},{"title":"Surprise high quality European style dark drama.","rating":8,"date":"31 May 2010","review":"Not knowing anything about cast or director helped me truly enjoy this film, I had no pre conceived ideas or expectations. Except for a few not fully explained issues, the main plot and non conventional story take you to an original situation where freedom, anguish, pain, and a chance for liberation clash incessantly. This movie is not for the standard American public, I can predict it will be very well received in other parts of the world with more sophisticated film tastes. The chemistry between both lead actors is electrifying, the continuous tension keeps your attention fixed. Not knowing how the story will end keeps you guessing multiple outcomes. The sexual encounters are realistic and totally appropriate.","user":"mdom","rank":[13,17]}]