[{"title":"Jumby wants to be in a better movie","rating":3,"date":"22 March 2009","review":"Well at least the trailer was scary, from the moment I saw the trailer for The Unborn I knew I wanted to see this movie, it looked so freaky and like the ultimate scare. So before it left theaters, I finally saw it and I should've realized, it's PG-13, how rare is it that we get a PG-13 horror movie that is actually scary? Sadly all the \"intense\" moments were shown in the trailer and I was extremely disappointed with this lousy movie. I couldn't believe how bad it was, it once again has every cliché in a horror film that you can imagine: the black best friend, the loving boyfriend, the hot skinny girl who is constantly in her underwear, the jumps, the mirrors, the nightmares, the over acting. I do have one question: did Gary Oldman owe someone a favor when he took this film? It's just mind-boggling, he's this terrific actor and he was in this really predictable stupid story? Well, hopefully he'll recover soon from this sad excuse for a horror film.<br><br>Casey Beldon is plagued by merciless dreams, visions of strange looking dogs, and an evil child with bright blue eyes. Casey is baby-sitting Matty, her neighbor's son. He is upstairs, supposedly taking a nap. Casey is downstairs talking on the phone to her best friend Romey. Suddenly, there is a voice that says \"Jumby wants to be born now,\" on the baby monitor used for Matty's baby sister. After yelling, \"Matty, are you awake?\" Casey goes upstairs to check on them. Matty was standing over the baby's crib, holding a mirror to the baby's face. After being hit with the mirror, Casey's eyes begin to change color and she learns she had a twin brother who died in the womb. Casey begins to suspect that the spirit haunting her is the soul of her dead twin, being possessed by a dybbuk, wanting to be born so it can transfer to the world of the living. Casey meets a woman named Sofi, who is revealed to be her grandmother. Sofi explains that she had a twin brother who was killed in Nazi experiments in Auschwitz when they were both just children. The boy was brought back to life by a dybbuk who intended to use his body as a portal into the world of the living. Sofi killed her twin to stop the dybbuk, and now it haunts her family for revenge. Sofi refers Casey to Rabbi Sendak, who can perform a Jewish exorcism to remove the dybbuk.<br><br>This was a huge disappointment, I wouldn't really recommend it. The acting and writing were over done, what could have made this more realistic or scary is just a touch up on the writing. The lead actress Odette Yustman really needs experience, she was just alright in the film. Of course I love the cliché of the crazy black best friend who calls her crazy at first but then all of a sudden is attacked at last second. If you do watch this, if you want a good scare, turn on the lights, I admit there are still some freaky moments, better than most of the PG-13 horror movies, but the story was just bad. It just could have been a lot better.<br><br>3/10","user":"Smells_Like_Cheese","rank":[107,130]},{"title":"Woeful","rating":3,"date":"13 March 2009","review":"Having seen the trailers for 'Unborn' and admiring David S. Goyer's writing talents on films such as 'The Dark Knight' I was kind of looking forward to it. I knew it wouldn't be much more than a typical Hollywood attempt at horror but I thought I'd get at least 90 minutes of entertainment out of it. I was wrong.<br><br>The story is terribly contrived and goes through the typical horror story motions from start to finish: childhood trauma - check! Nightmares - check! It also takes so much content from other films its unbelievable. More unbelievable is the fact that it botches these 'homages' every time. The film plods on and on attempting to at least get a jump out of you (which it fails at) until finally you get to the finale. Needless to say, the finale is also terrible. More so because at least the one thing the film does manage to do is contain the odd decent special effect. However, the finale for some reason doesn't contain any of these effects and resorts to actors merely wearing contact lenses.<br><br>I'm perhaps being a bit harsh giving the film a 3/10 but given the actors involved and David S. Goyer's obvious writing talent, this film really should have delivered far more.","user":"el_mariachi101","rank":[87,117]},{"title":"Typical American Horror Flick","rating":6,"date":"10 January 2009","review":"OK, let me get this out in the open immediately: this movie is pretty predictable if you have been watching any 'new' American Horror flick within the past five years, complete with gratuitous shots of Fox's, excuse me, Yutsman's backside. To its credit, the movie does have a great amount of potential from the source material, but fails to give birth to it. The effects are well done, the acting is decent (for the genre at least), and I left the movie feeling that I was at least entertained for the last 87 min (although I did wish that they would have cut out 10min. or so in the middle and made the final confrontation longer and better).<br><br>If you already like watching these kinds of movies, the Unborn certainly doesn't try to do anything different then what has already been done, and is worth watching; But you are expecting a radical departure from the typical Horror flick, this ain't it.","user":"kamiblakrow","rank":[81,115]}]