[{"title":"Great movie western...","rating":10,"date":"23 February 2020","review":"One of the best animated movies ever made, the trailer shows so little and I'd recommend watching it as it is absolutely outstanding. The animation work to the character development to the soundtrack are perfect in every way. Everything a animated movie should be.","user":"MR_Heraclius","rank":[40,41]},{"title":"Awesome","rating":9,"date":"27 February 2011","review":"I mean... wow.<br><br>*insert slow clap for ILM folks*<br><br>Last night my wife and I had the pleasure of checking out an early screening of Rango here in the twin cities. It was a blast! This movie was a great deal of fun. The jokes all hit the right marks, the story was solid, sweet and not too formulaic, and the visuals were outstanding. <br><br>There were times that this movie looked 100 percent photo real. outstanding job modeling and texturing and lighting on this. the little tiny attention to detail in the world you guys built had my wife and I in awe throughout most the movie. The animation was fun and eccentric. Over the top but at times subtle and felt meaningful. The only little nit pick was the mouths on some of the characters. in the attempt to make the animals look more like the animals they were representing the mouths were quite small and at times the sync was a bit odd. Though it provided for some goofy looking characters that were fun.<br><br>at just over an hour and a half, at times it felt it was a little too slow paced. well, that was my wife's critique. I looked at it more so that they were going for the slower feel of some classic westerns. I thought the long stretches of little dialog, epic music and visuals, and great cinematography worked in the films favor.<br><br>The crowd dug it too. I think the youngest person in the theater was about 6 (which i found odd for a late night screening, but whatever) and the oldest was probably in their 70's and everyone was engaged.<br><br>I was kind of surprised what they could get away with in a PG rated movie. Im no prude or anything, but there were enough adult jokes snuck in there to give me the giggle fits. Couple of lite swear words, references to more... ehem, adult type themes, but overall pretty tame and enjoyable.<br><br>Hats off. If this doesn't win awards I don't know what I believe in anymore. This is one of the more entertaining movies I have seen in a long time.","user":"RobW720","rank":[214,280]},{"title":"Rango... Every archetype, convention and finest detail is here! The west lives on...","rating":10,"date":"4 March 2011","review":"Rango... yes it is a play on the classic Western Django. Thats why its so interesting!<br><br>I had eagerly awaited the arrival of Rango, not only as a western fan but also as an admirer of Gore Verbinski; and the inclusion of Johnny Depp has yet to be a bad thing. The trailers had almost completely left out any kind of plot hint, which i now realise was a very good decision.<br><br>So, the story is that a chameleon, with acting ambitions, longs for social interaction outside of his lonely environment. His wishes are granted when he stumbles into the western town of 'Dirt' and takes over the vacant role of Sheriff. When he discovers the towns water supply is almost run dry he searches for answers along side the townsfolk, all of whom believe Rango to be their Saviour.<br><br>If you have seen the trailer you will have noticed the singing mariachi owls, who tunefully break down the forth wall to open the film. Not too dissimilar to the rooster in Disney's classic Robin Hood they help guide the story along and in doing so also keep you guessing. Which was a real bonus for me in terms of animated films as they do tend to get predictable, despite how well they are told. <br><br>Rango himself upon first meet is absolutely NOT a hero. Even more interesting though is that his name is not Rango. In fact we have no clue as to what his name is... no doubt an obvious reference to the classic Spaghetti Westerns to which its inspired by and its Eastwood lead 'Man with No Name' character. But Rango, despite his lack of name, knows what he wants and Verbinski very clearly makes sure the audience knows too... He wants the chance to be a hero and to one have a story to tell. Let the narrative unfold...<br><br>The real winner here is the scenery, its animated alright but i was struggling to believe that at various points in the film. The scene in the saloon towards the beginning is fantastically lit and the final showdown is shot better than a lot of the classics. I'm not kidding! In fact I would happily pay to see it again just to look at those shots again because they capture the tension so well.<br><br>Although the real audience is those who love the classic west, Verbinski is able to make it accessible to a vast number. The younger audiences will definitely appreciate Depp's eccentric character as well as the very well timed humour, both visually and verbally. The more mature audiences will appreciate the latter a lot more so. The story is excellent! It unravels perfectly and its runtime passes by almost without effort. <br><br>Rango is western... make no mistake. But i assure you one thing should you decide to give it a chance, its what it needs to be! Its entertaining, action-packed, funny and sincere. Above all else, it has what makes a great film, alongside the great protagonist is a great antagonist! Rattlesnake Jake is scary... he's great with his words and deadly with his gun and he helps build to a great and tense final showdown!<br><br>Rango gets 10/10 from me!","user":"pzazz_hij","rank":[178,235]}]