[{"title":"Mediocre Thriller","rating":5,"date":"7 August 2017","review":"\"Pet\" is nowhere close to the worst made horror film I have seen, as a fan of horror (even the bad ones sometimes) I have watched my fair share of god-awfulness, but it is not a very good one either.<br><br>The 1st half of the movie is generally well-done and unsettling, but not very original: Lonely creep stalks pretty girl. There scenes that are well-crafted, one in a diner is almost unwatchable it is so awkward (intentionally so), and give us a good feel for Seth's loneliness, frustration, and (a tad too quick) devolution into complete obsession. His target, Holly, is less developed at this time. She largely just gets increasingly unnerved by Seth.<br><br>Then comes the 2nd half, and the film goes off the rails a bit, even as it tries to add more originality to it. After Seth has locked Holly in the cage, the movie's big twist, about Holly, is revealed. Sure the twist is pretty ridiculous, but being a horror movie, it's nothing too unreasonable. The twist just didn't have the intended impact with me however, largely because the movie up to this point has gotten us to know Seth, not Holly. So the big twist about her is rendered kind of \"meh\". <br><br>The psychological battle that follows Holly's imprisonment is fairly predictable, as is its final result. The wildly inconsistent characterization of Seth also hinders the film's 2nd half, especially its 3rd act. During the 1st half Seth goes from lonely loser to a cackling madman, then in the 2nd from that to controlling kidnapper to groveling wimp who maims himself, with not a lot of segue in between. Almost seems more like Seth turned into whatever was convenient to move the story along, rather than a character of his own. <br><br>The acting by the leads was pretty good. Despite having to put up the poor writing of his character, Dominic Monaghan is convincing as Seth, especially during the 1st half. I am a big fan of Ksenia Solo and think she is one of the best young actresses working today, and she doesn't disappoint as Holly, even if it isn't an extraordinary performance (just a tad over-the-top in a couple scenes). Their lines could have had some work though, more than a few of them are remixed clichés (\"So, you think you know me?\" and the like).<br><br>More than a couple scenes in the movie also require some suspension of belief, the ending pretty prominent among them.<br><br>As a whole \"Pet\" just doesn't offer much anything special, even if it isn't terrible. It is suspenseful at times, but not to the point of discomfort like a good horror movie can ratchet it up too. The movie's twists don't land with a lot of weight either, though they aren't awfully done. I'm not a fan of a lot of gore in movies, but the film does have one really violent scene and it works pretty well. But there are also a couple of gross-out scenes that I thought were just cheap. At times \"Pet\" also veers toward wanting to be psycho-sexual, but never achieves much there either. There just isn't anything it does, or tries to do, that other movies haven't done better. If you like horror like me, than it could be worth checking out for some mediocre thrills and suspense, but if you're looking for an actually good movie to scare and/or unnerve you, than this isn't it. 5/10.","user":"Thomas_SC","rank":[11,12]},{"title":"Interesting Premise But Fairly Boring Movie Overall","rating":4,"date":"2 December 2016","review":"Seth (Dominic Monaghan) is a lonely mild mannered guy who doesn't have a lot going for him, he has no girlfriend, no friends, and a job at a pet shelter that barely bring in enough cash to pay the bills. One day on the bus he spots Holly (Ksenia Solo), a pretty girl that he recognizes from high school. Seth is desperate to ask Holly out but he simply doesn't have the looks or skills to impress her and ends up getting shut down, after a few more failed attempts at asking Holly out Seth starts to becomes obsessed. Eventually Seth's obsession drives him to kidnap Holly, but things don't go exactly the way he planned. I'll refrain from saying more about the plot since one of the few things that this film has going for is that it puts an interesting spin on the whole \"Captive\" premise. <br><br>The film starts off pretty dry, the set up is bland and none of the characters really caught my interest at all. I started becoming a little eager for Seth to just Kidnap Holly already because I just wasn't interested in watching him sulk around obsessing over her and stalking her. Once Seth Kidnaps Holly things do get slightly better, but not much. As I said before the film throws a little curve ball here that mixes things up a bit, it was definitely interesting but they just don't do a whole lot with it, the majority of the film is still just a run of the mill captive flick. There is a little bit of gore, but aside from that and the little twist there just wasn't that much content here. It was basically just enough to keep me from turning it off. <br><br>Another thing that becomes clear right away with this film is that even though the cast features a lot of familiar faces, the acting is actually pretty sub par. Lots of mono toned deliveries and many lines that you can tell were supposed to be delivered with a lot of emotion but just come off forced. The majority of the actors featured in the film have given much better performances in previous works that they have been in, so it was weird to see them all just fall flat. It's definitely not the worst acting ever, but it does take away from the tone of the film and makes it a lot less captivating, since this is a pretty dialogue heavy film that was a pretty big blow.<br><br>Despite the OK premise, this just wasn't a good film. It had some potential but overall it just fails to do anything worthwhile.<br><br>4/10","user":"HorrorOverEverything","rank":[59,80]},{"title":"Pet: Should have been so much better","rating":6,"date":"16 July 2017","review":"Interesting thriller starring Lost &amp; Lord Of The Rings star Dominic Monaghan and Lost Girls Ksenia Solo (In a very well deserved leading role) telling the story of an animal shelter worker who becomes dangerously obsessed with former classmate.<br><br>Dark, gritty and with some well played out psychological horror Pet is one of those movies that should have been something special but just fell short of the finishing line. And by fell short of the finishing line I mean slipped on a banana peel span 360 backflipped and landed on its head 3 inches from the line in the exact spot Mrs Smiths prized poodle decided to curl one out! I'm not saying Pet is bad I'm just saying it should have been a lot better, a bit longer and with a more satisfying finale.<br><br>Once again I have to say it was great seeing Ksenia Solo in such a role but feel that had the movie had more competent writers this would have been something worthy of her resume.<br><br>Also worth noting that the movies characters are simply unlikeable and that damages it somewhat. The movie near opens with a scene which made me hate a character so much I wanted to leap through the TV screen grab the characters mop turn it sideways and shove it where evolution for some reason put the male g-spot.<br><br>I digress, perfectly watchable effort but should have been so much more than it turned out to be.","user":"Platypuschow","rank":[20,26]}]