[{"title":"The scale doesn't go low enough.","rating":1,"date":"18 February 2009","review":"I wouldn't pick a copy of this off the street, I'd kick it into a gutter. Absolute rubbish. If possible I'd give it a negative out of ten. If you do watch this, steal it off the internet, it's not worth even renting. Cuba has never been so dull and boring. The plot line was slow, and never peaked. Flashbacks never fully described the situations. Many questions were left unanswered. Dialogue could have been better composed by a 10th grade theater class for downs children. The was absolutely no positive attribute that I can think of, except when the credits came up and I was able to confirm that the film really did just suck. If I weren't sick and stuck at home. I'd have walked out.","user":"drixsboy","rank":[38,42]},{"title":"CUBA, what were you THINKING!?!?!","rating":1,"date":"13 February 2009","review":"Boring, slow, stupid plot.... WORST MOVIE I have seen in a long long time! Cuba must have been drunk while reading the script to have accepted that role, or perhaps he has a horrible agent. First Look Studios? That's the last time I will ever watch a movie that they distribute or promote! I was confused for most of the movie, and there is no way in hell I am going to watch that movie again to try to figure it out. I understood where the movie was going but I refused to believe it could be that lame, I was waiting and waiting for the movie to start.. then the credits began to roll and I got excited because that meant the movie was over!","user":"hotmale1834","rank":[36,40]},{"title":"An hour and a half I'll never get back........","rating":2,"date":"8 November 2008","review":"This is one of the worst movies I've seen in a long time. Besides the fact that it didn't make much sense, it seemed to move along terribly slow (makes standing in line at the DMV seem fun), barely made any connections between characters at all, and the directing and production were really, really bad, to the point that one scene actually jumped to another without any transition; just a quick cut while a character was in mid sentence.<br><br>Having seen most of Cuba Gooding Jr's movies, I was surprised that after the last few movies he did, which were watchable, he stooped to a new low with another low budget movie.<br><br>There are better things to do than waste an hour and a half of your life on this pointless waste of film. Don't believe me? Go ahead, watch it. I'm sure within the first thirty minutes you'll want your money and your time back..... I know I do.","user":"jusdafide","rank":[53,61]}]