[{"title":"Wonderfully entertaining.","rating":10,"date":"2 June 2011","review":"It's hard for me to review this film, as I have not seen a huge number of Indian films--probably no more than a couple dozen. Most of the ones I've seen were wonderfully entertaining but I am far from an expert on Bollywood. Because of this, I have a hard time knowing how good this film is relative to other films from this country. So, consider this when you read this review. This may be among the very best India has to offer or it just seems that way to me.<br><br>Like so many Indian films, this is a very, very long film--with a run-time of almost three hours. When a movie is bad or just okay, this can seem like forever, but since \"3 Idiots\" is a very, very good film I loved its length. And, like most films of the genre, it has its share of the usual singing and dancing so foreign to films from other countries. One thing you should know, however, is that defining the type of film it is isn't really easy. Much of it is a comedy, but it also has many poignant moments (keep the Kleenex nearby), some existential moments where they explore the meaning of life and work and it's also a tender film about friendship. And, as my daughter pointed out when she saw the film, she loved that the men in the movie are not afraid to cry--something you rarely see in western films.<br><br>As for the plot, it's very long and involved and I could recount what occurs. But I don't want to spoil a single wonderful moment, so my advice is just sit back and watch--and if you give it a chance, I can almost guarantee you'll have a great time with this poignant and funny film. Wonderful and well worth your time--with a delightful script, wonderful characters and lots of moments that made me smile...and a few that brought me to tears. See this film.","user":"MartinHafer","rank":[262,311]},{"title":"Wow this American loves this movie","rating":9,"date":"20 November 2011","review":"I asked my co-workers to recommend a Bollywood movie. I expected \"Dumb and Dumber\" by the title. It wasn't that at all. It is more of an inspirational comedy with some serious but good messages. A more accurate title would have been \"The Legend of Rancho\".<br><br>Odd to me is that they speak in part English, part Hindi through the movie, kinda like some speak \"Spanglish\" here I suppose. I know none of the actors but the acting was good, and there was plenty of humor. The characters were believable. Most movie dancing I find a little silly but I even liked the dancing routines in the bathroom.<br><br>I will be asking my co-workers for more recommendations after this one!","user":"reedcom","rank":[343,414]},{"title":"^_^The best film reflecting Asia's education ever!","rating":10,"date":"19 February 2011","review":"As many ordinary Chinese high school students,who have to study fourteen(14) hours every day for the college entrance examination in the final year,I was entirely shaken and moved by \"3 idiots\",sharing the same feeling with all the students from high schools and universities in China(or Asia). O(∩_∩)O Compared with mainland China,India is lucky,having less corruption in education system.<br><br>This film is incredible inspiring,especially for those who are struggling or \"survived\" in high schools and colleges.<br><br>I read some reviewer,some doubt whether suicide in the film is logical,which is really DISAPPOINTING! (—__—!)<br><br>If you experience the life in poverty areas in Asia,you will understand what a significant role the higher educations play in their lives. Burdening great pressure from family and society,they attach great expectation and significance to the enrollment of colleges,and they intend to abandon poverty by getting higher education.Diploma means everything for them. Thus,the plot where the man committed suicide after lost the chance to graduate is reasonable.","user":"vvv832","rank":[137,166]}]