[{"title":"great for thinkers","rating":6,"date":"10 May 2010","review":"I think a lot of the reviews I have read are comparing this film to others. In a sense i guess that is what reviewing is, but i think with a film like this the director obviously wasn't trying to make the next blockbuster. I enjoyed the subliminal message. In the club, when john goes to the bathroom he reads some writing on the wall, \"911 was an inside job.\" I didn't get the message the director was trying to convey with this at first. But after finishing the film i came to the conclusion that the message was one of Thinking for yourself. How ever many times this type of movie is made, that message to me is very important. I believe that as a society we have grown far to dependant on the politicians and mass media to tell us everything will be OK. So we stop thinking. I think the message of this film is to open your eyes and see the world from your own perspective...not CNN's perspective.","user":"niceneasy_86","rank":[22,33]},{"title":"Don't waste your time","rating":2,"date":"18 January 2011","review":"This movie was in the top ten of the worst I have seen. It was bad enough I felt the need to write a review to keep other people from wasting their time. The first warning I had from the film was the flickering effect. I spent the first twenty minutes of the film trying to figure out what was wrong with my home theater setup as the screen kept blinking out like a loose video cable. Once I decided that was intentional, I still had a hard time ignoring it. I did find it pretty easy to ignore the plot however. I found myself wanting to wander off during the film. I went to the kitchen for a glass of water but didn't feel the need to pause the DVR. I found myself debating whether or not I should just change the channel. I decided to stick it out to see if there was a really great ending, but no such luck. So, if you do decide to watch and find yourself thinking about changing the channel I say, \"GO FOR IT!\"","user":"belizean","rank":[8,10]},{"title":"Just another B-movie","rating":2,"date":"2 April 2010","review":"In all fairness, it adds up to an almost mediocre B-movie. Predictable plot and storyline. Underdog meets new friend with ulterior motives and so on. The completely out of place soundtrack, over kill of random flashes, slow motion and effects kill what ever is left which wasn't much to begin with. The producer makes his 1st movie adding his own bands music which thoroughly runs this feature in the ground. In an effort to hide the empty storyline it just use all the effects available. A predictable uninteresting film without depth leaning on soap opera acting performances. A far too long pompous music video with the sole purpose of promoting the directors own band. Why did Mimi risk being seen in something this atrocious anyway? Why Mimi? Why?!","user":"MdlndeHond","rank":[18,27]}]