[{"title":"Heavy, but real.","rating":8,"date":"29 March 2016","review":"Don't go into this expecting a comedy, even though that is one of the tags on the IMDb page. Though it does have elements of dark comedy.<br><br>This is not a lighthearted movie, to say the least; yet I would describe it as powerful and very \"real.\" It is the complete opposite of a fairy tale and the complete opposite of romantic comedies - and that is very refreshing. It will cause you to think long and hard about your own relationships. You will continue to think about the movie long after you have left the theater.<br><br>If you like thought provoking movies that have very authentic characters and story lines, then I recommend this movie for you. The movie isn't all dark, it does have it's lighthearted moments and I felt it did a great job building the emotion as the movie went on.","user":"allstarrunner","rank":[157,181]},{"title":"Most original movie in 2016","rating":10,"date":"2 July 2016","review":"FYI: I don't review a lot of movies, except when I feel like I need to tell the world about how they would be missing out if they decided not to watch it. That's how I feel about Demolition. Plus, I've never voted for a 10/10.<br><br>Jake Gyllenhaal steals the show, once more. His performance astounds me in every single movie, and just when I thought, oh this may be the first movie I'll watch where he'll disappoint; he does the opposite. I also think that the trailer is way less exciting than the movie. <br><br>This story is so honest, refreshing, naked, thrilling, and yet dreamy at the same time. Most of the movie I was sort jealous of them, of the way they are dealing with life. It's disturbing and quite wacky to be honest, but still. The way Naomi Watts and Jake Gyllenhaal portray the characters is phenomenal. Great casting. Also the kid does an amazing job. <br><br>This movie portrays how people are far from perfect, and not in a way we've all seen before. It's original, moving, and a pleasure to watch.","user":"brigitte_delfzijl","rank":[129,157]},{"title":"Demolition: The Blissful Beauty of Destruction","rating":10,"date":"13 April 2016","review":"\"Together, they would watch everything that was so carefully planned collapse, and they would smile at the beauty of destruction.\" Markus Zusak, The Book Thief<br><br>Sometimes all you need is one piece to fall off the seemingly perfect construct you've built around yourself. Only then, you'll realize what's been long buried beneath and almost forgotten. That one piece was the tragic death of Davis' wife in a car accident in the revelatory opening sequence of Demolition.<br><br>Davis (Jake Gyllenhaal) is a young banker who is married to Julia, his boss's daughter, and, from an outsider's point of view, seems to have his life all figured out. Davis' subsequent emotional numbness and irrational behavior become a source of persistent annoyance to everyone around him, leading him to realize his own metaphorical death which is brought about by Julia's tragic, yet necessary, death – it is the one piece that had to come apart so that Davis would notice the malfunction of his ostensibly ideal life, just like the leaking fridge in his kitchen. And this is when he decides to take everything in his life apart to get to the bottom of who he really is and how he really feels. On his journey of self- exploration, Davis crosses paths with Karen (Naomi Watts), a customer service representative of a small vending machines company, and her rebellious 15-year-old son, Chris (Judah Lewis).<br><br>I don't think I ever wanted this movie to end. I've watched it twice so far and I'm still overwhelmed by the emotional genius of both screen writer Bryan Sipe and director Jean-Marc Vallée (Dallas Buyers Club, Wild). Following Davis' course of thinking, I've been trying to take things apart in this movie to understand why I loved it so much and why I end up crying like babies every time, but I just can't put my hand on one thing – it's simply everything. Not a single scene nor a single line in Demolition felt redundant or slightly detaching; they are all beautifully connected like notes in a musical piece, all leading up in an emotional crescendo to an inevitable coda that lingers way after the film ends. And despite the excessive use of montage, it all felt natural and poetic in a way. This is one film made with passion.<br><br>Peering into the nature of human relationships is extremely difficult, not to mention trying to dismantle them. That's why Davis' fumbling through his existential ordeal changes from irrational to funny to understandable to incredibly relatable. We don't only take pleasure in watching Davis taking his life apart but we envy him for this melancholic yet euphoric realization of the truth that usually comes after destruction, and which we all yearn for in one way or another. Destroying entails thinking in retrospect, necessarily resulting in painful regret but one that is usually accompanied by blissful realization. Few are the movies that manage to go that deep into human relationships and come back with a bittersweet sense of salvation. Also, the unlikely relationship between Davis, Karen and her son Chris becomes a psychological shelter for the three emotionally misled characters where they get to nurture their empathy and readjust their inner compasses.<br><br>The chemistry between Jake Gyllenhaal and Judah Lewis is undeniable, and is highlighted by Sipe's witty script and both actors' topnotch performance. Gyllenhaal's growing acting skills are literally getting out of control (and I mean it in a good way). I don't think anyone could have portrayed Davis as harmoniously as he did, putting you in tears while bringing a smile to your face. After Enemy, Nightcrawler, and Southpaw, Gyllenhaal is slowly and steadily becoming one of the smartest and most talented actors today.<br><br>One more thing that makes this experience unforgettable is the music. I've mentioned before that this is a film made with passion, and nothing can give voice to passion as much as music does. I will not talk about the brilliant choices of songs and the perfect song-scene synchronization because that will only make sense when you watch the film.<br><br>Demolition will leave you miserably heavy-hearted but spiritually elevated beyond words.<br><br>I give it 10 out of 10","user":"Manal1987","rank":[141,177]}]