[{"title":"Grossly mismarketed","rating":8,"date":"20 July 2013","review":"The writer, Diablo Cody, has stated that she never meant for this to be categorized as a \"horror\" film, which is precisely what happened. This movie is a fine example of a dark comedy. The dialogue is very quotable, and, if you have a twisted sense of humor and enjoy sarcasm (as I do), you will enjoy this movie. The \"scary\" scenes aren't scary; there is a lot of over the top gore. Essentially, this movie mocks teen horror flicks. It plays off of the emo trend to create ironic humor, and the laughs come when you least expect them. It also has a respectable soundtrack. If you've yet to see this, I recommend it as a rental for a night in. You will be entertained. Please realize that this is a comic gem full of snark and wit, and don't expect to be frightened. Sit back and enjoy it for what it is; entertainment.","user":"ambrakay","rank":[120,131]},{"title":"There isn't anything wrong with a movie being fun","rating":8,"date":"25 February 2010","review":"Clearly this is a movie that polarizes opinion, but I'd urge anyone with a taste for black comedy to give Jennifer's Body a chance. Having finally seen it, I enjoyed myself so much that I was left a little mystified that so many people seem to hate it.<br><br>Let's be straight about this, Jennifer's Body isn't awards material, but neither is it trying to be. It's a deliberately cheesy and darkly comic movie that definitely harks back similar movies from the 80s. Some of the darkest parts of the movie had me stifling guilty giggles; that's good black comedy in my book.<br><br>I thought the performance from the two leads was solid and enjoyable. Megan Fox played up Jennifer's sexiness, but gave her a subtle undercurrent of insecurity which gave tension to the character. Amanda Seyfried's Needy might not have been the cheerleader but was really the more settled and self-assured of the two characters.<br><br>Friendships held since childhood can become somewhat ambiguous as people age. This movie captured that well. To me the kiss between Jennifer and Needy really showed the low-key battle that was constantly raging between them, one they weren't consciously aware of most of the time.<br><br>Funniest scene for me involved some extremely shallow hipsters involved in some very dark dealings. Deliciously silly.<br><br>So, in conclusion, give this movie a try. There's a strong chance that you'll have a very good time.","user":"KieranCoughlan","rank":[165,216]},{"title":"The Incompletion of Great Premise...","rating":7,"date":"2 October 2009","review":"When Jennifer's Body was first announced to me, I met the idea with cautious curiosity. The idea of Megan Fox playing an evil high school beauty queen who eats the boys she seduces sounded... interesting, to say the least. When the trailer finally emerged, I got excited. Seriously. The combination of thrilling and funny hadn't been explored well at the theater in a long time.<br><br>Unfortunately, it still hasn't been explored well; at least not very well. The movie understands what it's going for: a comic horror film with just enough gore and jumps to be jarring and plenty of witty dialogue to stay fresh. The problem is, the two don't seem to meld together very well at any point. It's hard to say whether this has more to do with Diablo Cody's script or Karyn Kusama's direction; neither is at it's full potential here. Although, on recollection of the film, the too-random use of humor sometimes seems to have been the biggest problem.<br><br>But let's talk about what works. The leads are both very good. It was Megan Fox who got lots of good buzz about proving she could actually act, but Amanda Seyfried really impressed me more with her edgy role. The performances of both are worthy of accolades. They bring honesty and realism to what could have become total caricatures, and their performances help paint the deeper themes of the movie quite well.<br><br>Yes, there are deeper themes. It's not too hard to spot what Ms. Cody is trying to talk about here: The relationships girls have with each other. The whole 'Frenemies' idea that so defines high school girls. It's an interesting concept to examine, and it could have made for a truly entertaining AND thoughtful film.<br><br>But it simply isn't. While it wants to get there, it gets too lost in trying to be hip and current and 'alternative' to really become a film. And while the tension builds decently toward the finale, it all leads up to a climax that... doesn't really climax.<br><br>However, this is not to say Jennifer's Body isn't worth watching. Hell, I was entertained, and there are some sexy little scenes in there. The disappointment lies in thinking about what the premise promised, a promise that sadly wasn't quite fulfilled... 6/10 stars <br><br>Jay Addison","user":"jaddison383","rank":[134,188]}]