[{"title":"A Mixed Bag","rating":5,"date":"31 December 2009","review":"There are so many questions raised by this film that it is difficult to review it. The original screenplay by Douglas Morrow (1956) has been 'updated' by writer/director Peter Hyams, and while the concept of the plot is a strong one, it requires rather savvy actors to make it work. Aside from Michael Douglas as the DA of questionable ethics and court proceedings, the rest of the cast is a rather ill-prepared group of nascent actors in need of more experience than in the fluff films from which they came.<br><br>C.J. Nicholas (Jesse Metcalfe) enters the Shreveport scene complete with a prize for reporting, eager to make it big and earn a Pulitzer: he seems to have an equal obsession with chasing young pretty women and finds one in the person of Ella Crystal (Amber Tamblyn) who happens to be the assistant to the DA. Nicholas, and his entertaining co-worker Corey (Joel David Moore), are on to something - they believe that the DA tampers with forensic evidence to win cases, focusing on phony DNA samples rather than thorough investigation. Out to debunk the DA, Nicholas plans to plant evidence at a crime scene, a stunt he will later use to expose the wannabe Governor DA, and in order to make this work, he places himself as the 'evidential perpetrator' of a crime. He manages to draw Ella into his circle of lust as well as his overall plan to unseat the DA. Things change and the ending could have been surprising in the hands of better actors.<br><br>The film is heavily padded with the requisite car chases and explosions and derring-do of the good cop/bad cop type, but the real problem with the movie is the weak presence of Metcalfe and Tamblyn. If the viewer can tolerate the confusing aspects of mixing high humor in the first part with the supposed suspense in the second, then the film is worth the entertainment. It could have been a stronger film with a cast of professionals.<br><br>Grady Harp","user":"gradyharp","rank":[27,30]},{"title":"Fascinating failure--great idea, poor execution, it's that simple.","rating":26,"date":"26 July 2011","review":"Beyond a Reasonable Doubt (2009)<br><br>Michael Douglas is impeccable whenever he has a role with brutal power, with cunning, with speechmaking the cuts through the listener, with selfish focus. And he is all these things here.<br><br>But he is properly the third name on the credits, and the two leads, both little known to me, are young and capable and unexceptional actors. With the three of them, there might have been a decent movie possible.<br><br>The hook here is an amazing, simple, audacious idea. A young reporter (Jesse Metcalf) is suspicious of a District Attorney (Douglas) who is faking evidence, so he sets himself up as the perp in a crime he didn't commit to trap the DA at his game. So it looks like a hero at work, an undercover reporter who is going to prove justice, Al Pacino style. And he has both a buddy (the not so handsome sidekick) and a girlfriend (Amber Tamblyn). The girlfriend, strategically, is on the staff of the DA.<br><br>But things go wrong. Very wrong. The DA is more ruthless than they realized. The girlfriend ends up taking over the investigation of her own boss, and ends up uncovering, with some improbability, some flaws in the reporter's character, too. The movie ends with a terrific (not) two word send off, probably meant to appeal to young people who have wanted to say those two words to lots of their boyfriends and girlfriends themselves. Or have.<br><br>Lots of crime thrillers have plots like this, good ones with twists that are calculated but great entertainment. This one is repeatedly hamstrung by bad writing, however. And this bad dialog is sometimes acted poorly, so that you almost groan out loud. It's especially painful because the plot is pretty intense if you give it a chance. In fact, sometimes it almost seems intentional the way a character acts a little flippant or silly, and yet it struck me as out of place. This might make it impossible to really get the depth of what was intended. Which is too bad. A remake done well would have the potential to really work.","user":"secondtake","rank":[15,17]},{"title":"Plot full of holes, plus acting full of nothing equals bad movie","rating":3,"date":"22 January 2010","review":"Gee, let's see... 1. Why didn't C.J.'s defense attorney subpoena C.J.'s boss at the TV station, who would have told the jury that C.J. had been pushing a story about the DA planting evidence? That would have at least put reasonable doubt in the jurors' minds. 2. Michael Douglas warns C.J. that prison phone calls are monitored (duh...). But apparently his flunky co-conspirator detective wasn't aware that parking garages serving the DA's office would probably be videotaped. Besides, the donut-creating \"terror\" scene was stupid. 3. C.J. was smart enough to develop a brilliant plot involving a fake interview that earned him a journalism award, but so dumb he gives his girlfriend a copy so that she could later make the connection between his fake story and the murder. Take these mistakes, throw in some poor acting and a totally unnecessary car chase and you have \"Beyond a Reasonable Doubt.\" Better yet, don't watch the movie in the first place, and save yourself an hour and a half.","user":"natw","rank":[7,7]}]