[{"title":"Don't waste any minutes of your life","rating":3,"date":"29 April 2008","review":"I wasn't anticipating much (although you never know when you'll stumble upon the next \"Run Lola Run\"), but this failed to meet even greatly lowered expectations.<br><br>I only got 40 minutes in, to be honest -- and even that far was because I was generously hoping that the poor dialogue, punchy acting, stilted directing and uneven plot pacing would somehow start to turn the corner and redeem itself. It didn't, so I turned it off.<br><br>The story is simple: Dumb dude owes a mean guy money, so the mean guy injects dumb dude with a poison that will kill him in 80 minutes if he doesn't cough up the $15,000 he owes. Action-y hijinks ensue. Sadly, it wasn't well-conceived or written.<br><br>The camera work was nice, images sharp, lighting appealing, etc. The rest of it was 40 minutes that no amount of money can give me back.","user":"sioenroux","rank":[73,110]},{"title":"Combine Crank and The Game and subtract everything thats good,,,","rating":1,"date":"2 May 2008","review":"Incredible... how could one manage to get people to work in such a project when everything is so obviously far beyond ultra bad!? i mean I've watched a lot of bad movies, but we only finished watching this one because we couldn't believe that it was that predictable and unsatisfying pathetic. i'm really angry right now that i wasted so much of my time. by the way can somebody tell me how the hell they manage to meet each other over and over again after all the high speed chasing, especially the subjects on foot seem to catch up very easy... must have been stolen from the Red Flash. The dialogs are lame non convincing and boring. even the potheads seem like crappy actors and even i know at least 10 people who would have made a much better job here.the stripper nurse is a f celebrity from Germany most of the spoken English sounds awfully German. all you want to do is step into the movie , slap the actors and tell them to please continue and move on with the plot, if there were one. and why do Germans make movies in English anyhow ? this comment honors the move far to much because you should not even take the time to think about seeing it.","user":"alphakrapfen","rank":[10,14]},{"title":"Well, I wasn't bored... but there were a LOT of problems","rating":28,"date":"28 July 2010","review":"Don't worry, \"80 Minutes\" is neither a prequel or a sequel to the awful Al Pacino movie \"88 Minutes\". This low-budget effort does manage to be better than that big budget movie... but not by much. I'll start by listing the little merit this movie had. It jumps into the action right away, using an intriguing (but not totally original) setup. And at no time could I ever admit that I was bored by all of what was going on. That's what's good about this movie - now to list some of the many problems I found. To begin with, the central figure is not very sympathetic - he's stupid, irresponsible, and seems to deserve what he's getting. He and the other actors in the movie also have a wide range of accents, making us wonder just where this movie is supposed to be taking place. The movie has a constant claustrophobic feeling, with the camera constantly jammed up right next to the action or characters so that it's often hard to tell what's going on. The movie is also photographed badly, murky and dark-looking, and out of focus. Also, the DVD manufacturer gave this movie the wrong aspect ration, which results in information at the sides of the screen being cut off. The movie has an unexpected twist ending, one that seems to have been inspired by a certain Michael Douglas movie, but as soon as it happens, many unexplained questions come to mind regarding how the whole charade was pulled off. While I wouldn't call this movie as bad as what previous IMDb user commenters have claimed up to this point, I still would not recommend that you watch \"80 Minutes\".","user":"Wizard-8","rank":[2,2]}]