[{"title":"Having been there myself, I liked it.","rating":8,"date":"2 August 2011","review":"Having been in these shoes, I appreciated this movie even more.<br><br>This is a solidly entertaining and believable film about professional men (and women) who lose their identities as they lose their jobs in corporate America economic decline.<br><br>Some folks rebound, others can't. I grew attached to the characters. Every performance was believable and tight.<br><br>I found myself rooting for success, even though it wasn't always in the cards.<br><br>The ending wrapped everything up in a tidy ball, which I like.<br><br>Bottom line: Solid entertainment with very few explosions.","user":"Glock_Boy","rank":[43,47]},{"title":"Examining Painful Contemporary Topics","rating":10,"date":"9 June 2011","review":"THE COMPANY MEN is very difficult to watch if you are among the millions of people who have been laid off by the current economic recession/meltdown in this country. Writer/Director John Wells understands the grave aspects of losing a job as corporations and businesses downsize in response to the current economic disaster - depression, humiliation, loss of self-worth and pride, fear of failure in finding new employment, the effects of job loss on marriages and families, loss of hope - it is all here in this very well made film. If the first part of the film causes a reactive tachycardia and an urge to simply stop watching the story, then the closing moments of the film bring at least a little redemption in the faith that man can actually survive and reassess and stop being a victim of a situation over which few of us have any control. <br><br>GTX is a shipbuilding empire in Boston, the brainchild of Gene McClary (Tommy Lee Jones) who brought a simple ship building business to a wealthy corporation now run by CEO James Salinger (Craig T. Nelson): McClary is a billionaire with a wife concerned with shopping sprees using the corporate jet and a lover Sally Wilcox (Maria Bello), the HR director of the corporation. The year is 2008 and the stock market and the economy in general have dipped to a new low and terrifying point. The result: downsizing and one of the first to go is sales manager Bobby Walker (Ben Affleck) who is shocked and then hurt and then overcome with a feeling of failure and humiliation. Bobby's wife Maggie (Rosemarie DeWitt) at first responds with desperation but adjusts by taking on work as an ER nurse, coaxing their son to not lose hope in Bobby. Bobby tries to find work but is the victim of the joblessness of the country: he finally accepts Maggie's brother Jack's (Kevin Costner) offer to to work as a simple carpenter. Meanwhile the downsizing includes Gene and longterm employee Phil (Chris Cooper) who is overcome with anger and humiliation at being unemployable because of his advanced age. The manner in which each of these three men cope with the loss of job and income weaves a story that is complete with tragedy as well as a demonstration of the indomitability of the human spirit. <br><br>THE COMPANY MEN contains many messages about coping with change, preparing for a realistic financial future, and the delicate line that separates each day's stance on the tightrope of existence. While the story is difficult to watch, the performances by this exceptional cast are excellent, not only among the Oscar winning stars but by the finely wrought cameos by Anthony O'Leary as Bobby's son Drew, Cady Huffman, and Eamonn Walker (so well remember from the TV series OZ), among many others. <br><br>This is tough medicine but necessary views on contemporary society. <br><br>Grady Harp","user":"gradyharp","rank":[46,57]},{"title":"My 357th Review: Finally a good honest film about the downturn","rating":8,"date":"17 January 2011","review":"Whether we like it or not the last couple of years have been incredibly tough, and TCM though not perfect at least tries to make an honest film about downsizing in corporate America.<br><br>We really really got this - we all know someone whose lost their home, their job, or just found that the money isn't there the way it was - and those who reviewed this and said the films doesn't work as the characters have still got it good just don't get the college payments, the mortgage, the fear of losing it all, and the horrendous amount of money it takes to maintain a life in the US now is astronomical - and TCM at least looks at this as no other film has in the past three years.<br><br>Solid performances from everyone and Affleck in particular echoing his roles in Man about Town or Jersey Girl does a solid job here as the man who has it all and then has nothing. <br><br>It it does try to record something which otherwise seems to be in danger of being swept under the carpet - this is a well-made film that rings true and for our money was actually one of the more memorable and yes, even moving, films of the year - it is accessible and a likable film.","user":"intelearts","rank":[82,106]}]