[{"title":"Very Good Adult TV Movie.. Ashton Kutcher Excellent","rating":8,"date":"22 November 2009","review":"I usually don't watch Lifetime movies but it was a rare Saturday Night that i was home.. nothing else was on...the tube... Turned to Lifetime and saw an original TV film with Michelle Pfeifer was about to begin..\"Personal Effects\" The minute it stated I was hoooked... Love Michelle Pfeifer and she was excellent in the role of a somewhat older woman who falls for (through various circumstances) a younger man, played by Aston Kutcher ..now I've heard of him but had never (i thought seen him act ) Not only is he good looking and a\"hunk\" but he can really act he played the part of a confused somewhat depressed young man so well..I felt so sympathetic towards him ..Excellent performance know now, thanks to IMDb.that he's married to Demi Moore, and I did see him in \"Bobby\" and possibly the \"70's Show\". He was wonderful as was Michelle and the entire cast including Kathy Bates in another unbelievably good performance as \"Kutcher's mom . Very adult quite graphic ,a bit violent but very well done and well acted.. The plot has a few implausabilities and was a bit confusing but stick with it... One of the best made for TV films I've seen in awhile Shown on the Lifetime Network","user":"bsmtpa","rank":[15,17]},{"title":"Things Left Behind - 'Good Stuff'","rating":8,"date":"5 March 2009","review":"PERSONAL EFFECTS is a solid little film written by director David Hollander and the fine novelist Rick Moody. The premise is a study of how the traumatic deaths of people affect those left behind. The story is well told, allows the audience to explore the group therapy approach offered to families of violently killed people - the various means of responding to loss, the differing reactions from those who cannot let go of the hate they have for losing a loved one, and introduces an interesting concept of having one of the characters who narrates the film be a deaf mute young man! <br><br>Gloria (Kathy Bates) is the mother of twins - the girl was been brutalized and murdered and the boy Andrew (Ashton Kuchter) has left his career as a wrestler to return to the scene of the crime to mourn his sister and to demand the perpetrator be convicted and imprisoned: his career has been put on hold and he ekes out a living dressed as a chicken for a fast food chicken restaurant. During the ongoing twin's trial, Andrew meets Linda (Michelle Pfeiffer) whose alcoholic husband has been killed and she is left to support her teenage deaf mute son Clay (Spencer Hudson). Through series of grieving meetings and periods of isolation on the part of each of the characters, each finds ways to support the other and a love affair develops between the older Linda and the younger Andrew as he agrees to accompany her to her various weddings for which she serves a planner. How these characters comes to grips with resolution of their losses is well tied together by film's end. <br><br>This is not a great movie, but the performances by the leads are quite fine. This is a movie with a message, one that delves into territory with which many are not familiar, and for that reason alone it is well worth watching. Grady Harp","user":"gradyharp","rank":[45,63]},{"title":"Personal Effects of Losing A Loved One","rating":4,"date":"4 August 2010","review":"Hollander's 'Personal Effects' reminded me of 'In The Bedroom' and 'Monster's Ball'. It deals with similar themes of coping with the loss of a loved one. The story is treated with equal restraint. The character development is gradual and in accordance with how the layers unfold. The visuals are very detailed and photogenic. It has a certain poetic feel which is further substantiated by the amazing score. I'm actually in search of the soundtrack.<br><br>Ashton Kutcher may be an odd choice for the role but I appreciate his attempt to break away from the typecast goofball roles he's known for. Where his acting is concerned, it appears very formulaic. It lacks spontaneity but one can see the actor's effort. It may not be among the best examples of acting but he gets better in the latter scenes and overall turns in an adequate performance. Michelle Pfeiffer easily delivers a natural performance that just seems like a piece of cake for her. The actress knows her craft too well. Ditto for Kathy Bates who stands out in a supporting role. Spencer Hudson is a sincere actor.<br><br>The only thing that bothered me about this movie is its lethargic pace which is very slow in the first half. The director focuses too much on the closeups when much of it could have easily been trimmed. Moreover, I didn't understand the need to 'maintain the element of suspense' in the end when the viewer easily knew the outcome (hence no surprise)? There are a few plot holes like why Walter didn't empty the gun before returning it to Linda. These flaws are but a few and thankfully they don't dilute the film (as long as one has some patience to get through the first half)","user":"Chrysanthepop","rank":[10,12]}]