[{"title":"Possibly the worst movie sequel I have ever seen...","rating":1,"date":"4 March 2009","review":"Although I have never been a \"fan\" of the Anaconda series of movies, when I heard this would air on Sci-Fi Channel I decided to watch it since I've seen the previous two installments. Big mistake... This movie comes fully equipped with bad acting from all the supporting cast (except for Mr. Davies and the Austrailian guy), horrible snake and gore effects, gaping plot holes, absolutely retarded story (Giant snakes are the key to immortality?!), and half-@ssed directing. *SPOILER ALERT* Also, the sudden change of Hasselhoff's character at the end of the movie from good guy to bad guy was unnecessary in the highest degree. It's almost as if the writers of this abomination decided to add a *startling plot twist* after the completion of the movie and revised the script, as his turn makes no sense at all. *END SPOILERS* I seriously advise against renting or buying this movie, but if you have a totally overwhelming urge to watch this, don't say I didn't warn you...","user":"BewaretheBlade","rank":[13,13]},{"title":"Anaconda Offspring: This is where the franchise nose dived I suppose","rating":2,"date":"5 December 2018","review":"The first Anaconda was passable, the second was pretty poor but nothing could have prepared me for this! Though the ultra low IMDB rating should have really come to mention it.<br><br>I guess was doomed from the start, it has a tiny budget by comparison, it's the third film in an already cheesy scyfy level franchise and the biggest star they could get to carry the movie was the \"Hoff\".<br><br>So yeah, it all looks so very terrible. I could do better sfx than this (And have), the snakes look pitiful and the cast look positively bored throughout.<br><br>Though Hasselhoff is better than usual he still can't carry a film and the incredible John Rhys-Davies has a heartbreakingly small role here.<br><br>To make matters even worse the plot is generic, the pace is snooze worthy and the whole thing is just seven shades of embarassing.<br><br>One more movie to go at time of writing, it can't get worse than this........right?<br><br>The Good:<br><br>The \"Hoff\" is better than usual<br><br>John Rhys-Davies<br><br>The Bad:<br><br>Poor cgi<br><br>Actually manages to be incredibly boring<br><br>The advertised \"Stars\" are barely in the film<br><br>Things I Learnt From This Movie:<br><br>Always know the animal before the hunt<br><br>Cool girls don't look at explosions either","user":"Platypuschow","rank":[10,10]},{"title":"Absolutely dreadful","rating":1,"date":"14 March 2011","review":"This gets my vote as the worst of the Anaconda movies. As a sequel and on its own terms, Anaconda III is wretched. The scenery/sets are quite nice and Crystal Allen is decent, but that's it. The photography is flat and rushed and the film looks as though it has been edited on a bacon slicer. The continuity is inconsistent as well complete with poor gore effects, the writing is vacuous and eye-rollingly cheesy in alternative to funny and the story is hopelessly predictable. The direction is sloppy, the music is generic and forgettable, the film is unevenly paced and unsatisfyingly resolved and the characters I didn't feel anything for. The acting is just dire, David Hasselhoff and Crystal Allen are the only ones who try and while the enthusiasm is admirable Hasselhoff is embarrassing in his acting and delivery, Allen however is far more believable and manages to be the film's sole redeeming quality. The other actors look bored and uninterested, and any scenes that tries to be suspenseful, atmospheric or frightening fails, instead it is laughable. Overall, dreadful sequel and film. 1/10 Bethany Cox","user":"TheLittleSongbird","rank":[9,9]}]