[{"title":"Not even close, the first one was way better","rating":5,"date":"28 January 2009","review":"The first movie in this series was pretty funny. A nice lady spoils a funny bear. Bear is befriended by a funnier deer. Bear gets run out of town, but open season is upon them.<br><br>The really funny stuff is when all the forest animals get back at the hunters.<br><br>The sequel does not occur during open season, so why they called it Open Season 2 is beyond me. Other than having the same characters it has nothing to do with open season.<br><br>The story is kind of lame (Mr Weenie is taken back by his owners and the forest animals go off to find him).<br><br>To top it all off, Ashton Kutcher is not playing Elliot, and the guy who replaces him (Joel McHale) is nowhere near as good at it.<br><br>I had not read much about this movie before picking it up, and had an idea it might have something to do with the hunters coming back for revenge (thus Open Season 2). Once I saw the cover though, I knew it would be more cute than funny.<br><br>The rest of the animal characters are pretty cool. The poodle Fifi was down right scary, reminded me of Hannibal. Of course Georgette Franklin Baxter as Mr Weenie's owner is always a treat.<br><br>Sure, go ahead and buy it for the kids, but this time the adults might want to find something else to do while the kids watch.","user":"mergatroid-1","rank":[11,11]},{"title":"Rent don't buy","rating":4,"date":"6 January 2009","review":"I'm an animator myself... so thereby an animation geek. I really liked the first open season movie. Didn't love it.... but liked it. When I saw it again a couple of weeks ago I thought it didn't feel as good as it did the first time. The story isn't just good enough to watch more then once... maybe twice. But I absolutely loved the look and design of the film. So when Open Season 2 was lying in the shelfs at the local DVD store I bought it right away. Hoping it would be as good or hopefully better then the first one. Just a nice animated film with some humor. I expected nothing more nothing less. But Open season 2 is a real let down. All I can say is that it feels like the just didn't rewrite the script. Stuck with all there first ideas and just rushed it out the door. Even the animation doesn't feel as solid as the first movie. It had some funny moments and some really nice characters. But it wasn't worth the money I paid for it. Maybe kids will love this... but as an adult... just don't expect to see a movie that will have the extra layer so you to can enjoy it as much as your kid would. Still... Boog the bear... for me is one of the best designs of a bear ever.","user":"bram-57","rank":[13,16]},{"title":"Very disappointing","rating":2,"date":"17 May 2009","review":"I loved the first open season, for me its not just for kids, there was a sense of intelligence about the whole storyline, I found it funny and very easy to follow, Ashton kutcher being Elliot made it even better! There is just something about his voice that's funny. But after watching this, its like a totally different sort of film, the whole thing is all over the place with scenes cutting in quickly, different sorts of music accompanying the script, its just makes it so hard to follow, a complete mess in my opinion. There was nothing intelligent about this film at all and yes maybe a kid may enjoy the colour and the silliness but its a complete let down from my prospective. The actual script itself is just so silly and makes no sense, the one other major huge let down is that Ashton Kutcher is no where to be heard, the character Elliot is no longer funny, the voice is just a bit flaccid and has no edge or likability factor. One other thing I must mention is also the animation quality seems to have suffered as well, there is just something off about the scenes where it doesn't seem no where near enjoyable visually then the first one.<br><br>My advice would be if you enjoyed for the first one like I did then don't bother watching this and just keep the memory of the original.","user":"rjr_uk","rank":[12,15]}]