[{"title":"Duvall at the Height of his power in GET LOW","rating":7,"date":"18 September 2010","review":"Robert Duvall is one of the best American actors of the past half century. Witness his roles in To Kill a Mockingbird, The Godfather I and II, The Great Santini, Apocalypse Now, Open Range, and a full TV resume including Lonesome Dove. In Get Low, he gives a measured, understated performance as a mysterious, old hermit who makes an unusual, life changing decision. This independent film is deceptively simple and honest. Yet it is done extremely well and leaves a deep feeling about life's regrets.<br><br>After the brief image of a house burning down, we flash forward to a rural setting in the 1930's to see an old home inhabited by a reclusive, elderly man, Felix Bush (Duvall), whose disheveled appearance and reputation are the stuff of rumor and legend. Are the stories about him true? Is he a killer? Haunted by visions of a woman, he decides to arrange his own funeral before his actual demise. The funeral home is run by Frank Quinn (Bill Murray) and his loyal assistant, Buddy Robinson (Lucas Black). Felix wants to invite everyone who has a story about him to tell. He sweetens the pot by offering to raffle off his vast acreage of property. He also runs into an old acquaintance, Mattie (Sissy Spacek), who has strong ties to him from way back. He later pays a visit to a preacher in another town in hopes of having him conduct the eulogy. As the plot thickens, we find that Felix is hiding a painful secret that will have the town reexamining its prejudices and assumptions about a tortured soul who is struggling for his own redemption before it's too late.<br><br>Novice director Aaron Schneider, whose previous credits were as a cinematographer of various TV shows and movies, does a solid job with a modest budget and a lean story and script by Chris Provenzano and C. Gaby Mitchell.<br><br>It's nice to see veteran actors like Duvall, Spacek, and Murray play older characters, wrinkles and all with enthusiasm and conviction. Duvall does a splendid job of presenting a cipher of a man whose words are sparse and direct and slowly, as the story develops, begins to open up to reveal a complex person replete with feelings of guilt. There are reasons perhaps for why he is the way he is. Duvall is destined for an Oscar nomination, and Spacek arguably deserves a nod for strong support. Bill Murray as the funeral director does a convincing job as a businessman who isn't quite a villain or hero. He is carving a nice career niche as a dramatic character actor (aside from being a comedic superstar).<br><br>The film successfully evokes the period of depression era, small town USA. There are few items to quibble about; however, a violent break in at the funeral home doesn't really forward the plot and is never fully explained.<br><br>There are similarities in Felix and the noble character in The Ballad of Cable Hogue. In both films, the protagonist is an aged, stubborn loner, and in the end, as his life is in its twilight, the truth sets him free. Perhaps the lesson here is that each person has a story, and some of the stories are not always evident. With Get Low, we get to see the bittersweet tale of a broken heart. Your heart will be moved too.","user":"seaview1","rank":[39,42]},{"title":"Hermit money","rating":7,"date":"22 August 2010","review":"Greetings again from the darkness. I am not familiar with director Aaron Schneider, who apparently has done mostly cinematography work on TV for the past 10 years. He must feel like a lottery winner getting to direct his first feature film and having a cast with Robert Duvall and Sissy Spacek.<br><br>This is a very odd film centered on the story of 1930's Tennessee backwoods recluse Felix Bush, played exceedingly (no surprise) well by Robert Duvall. We learn - slowly - that Felix has been in a self-imposed exile carrying enormous guilt over an incident from 40 years prior. The wonderful thing is that it takes us just about the entire film to discover what caused this guilt and how Felix has dealt with it.<br><br>Over that 40 years, the legend of old man Bush has grown with the town people. It is approaching Tall Tale status when he whips up on a local wise-ass on one of his rare visits to town. When Felix realizes that stories have been concocted about him over the years, he heads to local funeral home to arrange a \"funeral party\" where everyone can come and tell their stories. The local mortician is played by Bill Murray and I can best describe his personality as eager opportunist.<br><br>While this appears to be a slow moving story, it really isn't. The real motivation for the party, a reconnection with the past and a cleansing confession all play a part in this fine story. Sissy Spacek plays a painful link to Felix' past, as well as a key to this latest/last event.<br><br>Three excellent performances by Duvall, Spacek and Bill Cobbs really make this one work. Bill Murray and Lucas Black hold up their end by supplying a bit of humor and purity, respectively, though the story really belongs to Duvall. His ability to convey emotion with a grunt or facial expression is just amazing to watch.<br><br>My only real complaint with the film is that it lasted about 2 minutes too long. The perfect ending had occurred and then we are dealt one final, seemingly forced scene. A minor quibble with a film that kept me fully engaged.","user":"ferguson-6","rank":[58,66]},{"title":"Go see it!","rating":9,"date":"11 August 2010","review":"This is what movies are about: <br><br>It's a compelling story, flawless acting with spot-on casting choices, deftly directed, and with camera work supports the story with warm tones. I don't know of one person who has seen this and doesn't rave. The Oscar race begins here. It's wonderful to be rapt in a film that doesn't need explosions, chases or CGI to make the film work.<br><br>Every person involved in the making of this film is an artisan. If your a budding filmmaker, class is in session - a must see.<br><br>Duval and Spacek are in their prime - there's also a lesson here that youth and beauty are only skin deep... and talent grows with age.","user":"Oroloro","rank":[70,82]}]