[{"title":"Rocky Horror, Look Out","rating":10,"date":"22 November 2009","review":"I had the great good pleasure of experiencing the full force of Black Dynamite at a midnight showing (at the Castro...one of The Last Great Movie Palaces). I had high expectations going in (based on the YouTube trailer). They were met, exceeded, and blown the F away. I don't remember betting a gut busted so hard in ages.<br><br>BD is an absolutely perfect movie. It somehow manages to be a parody and the thing that it is parodying at the same time. You are watching this alternate universe (a fantasy of the 70s, filtered through the lens of Blaxploitation) and the characters are REAL and they believe in the fantasy. But you are also constantly reminded that you are watching a FILM, an intentionally bad one at that. All the things professional filmmakers try to avoid, they do on purpose: Boom mike hitting actor's head, obvious continuity errors, reusing the same shot to save money (exploding car flying off cliff), replacing a stunt actor in mid-sequence... The effect is delightful and hilarious. <br><br>Kudos to the crew and actors for really \"getting it\" and going for it. (I think the only movie I've seen recently where the actors were having so much fun was Tropic Thunder.)<br><br>Oh, and the soundtrack; Man, I need to get me some of dat.","user":"tritisan","rank":[82,93]},{"title":"Black Gold!","rating":10,"date":"9 November 2009","review":"It's not often that I enjoy a movie to the point of laughing out loud – but Black Dynamite had me belly-laughing more than once. For those of us who are old enough to remember the joys of 1970's cinema this movie brings back all that was best (and worst) of those slightly grainy, scratched, funk and wow-wow pedal laden classics. The deliberate continuity errors and goofs are hilarious. The dialogue and stock characters could be drawn from any of those wonderful blacksploitation movies that were so exciting for a young lad living in rainy (and then almost 100% white) Ireland. So dig out your wide-collar shirt, pendant and platform boots and enjoy this gem.","user":"camillusdsl","rank":[89,105]},{"title":"Best spoof since airplane!","rating":10,"date":"20 June 2009","review":"This film reduced me to tears of laughter. I've just returned home from seeing it at the Edinburgh film festival and can honestly say this is one of the best movies i've seen this year. I could just list all of the best bits of the movie in this review, but i'd rather you all just went to see it for yourselves.<br><br>As a parody/homage of the blaxploitation movies of the 70's, this is perfect. If I didn't know better, i'd think this was actually made in the 70's. Its full of cool little details, the decor, the fashion, the hair styles, the Isaac Hayes/Curtis mayfield style music that details the plot in the lyrics (sometimes scene specific), the grainy picture and the intentionally dodgy camera-work, crash zooms, boom mics in shot etc. During the fight scenes, Michael jai white's kung fu yell is a spot on impersonation of Jim Kelly's (he of Enter the Dragon fame).<br><br>Like all the best spoofs, all the actors play it completely straight. White is perfectly cast as Black Dynamite, and if there is any justice in the world, this movie will make him a star. I can almost imagine Samuel L playing this part, but I doubt he could have played it as well as white did. The scene that crystallised his performance for me, was when, during a long speech, a boom mic pops in to shot right next to his face. During the scene, the cameraman is continually trying to adjust the shot to hide the mic. Dynamite continues with his speech as if nothing is going on, but just before he is finished talking, he quickly glances at it, then finishes his speech. The way he plays it is perfect and had everyone in the cinema in fits of laughter.<br><br>I said earlier that this is the best spoof since airplane, but I actually think this may be better. In airplane, the jokes were quickfire, but hit and miss, but in black dynamite, every joke hits its mark, and its just as quickfire as airplane. The tone is set pretty quick ( when an undercover agent is caught out cos he cant talk jive properly) and doesn't let up until the credits have rolled. I was still laughing hours after I left the cinema just thinking about it. <br><br>Watching this made me wonder how the Austin powers films were such big hits. They were a similar kind of parody but nowhere near as funny, and at the end of the day, aside from a couple of amusing cameos, a one man show (and not a very good one at that). If this doesn't at least do Austin powers numbers, I will be very disappointed, as it deserves the success. Very rarely does a film make me laugh so hard I cry, and this movie did it several times, and its not just me, I think everyone in the cinema had the same experience. Go and see this first chance you get, I cant recommend it enough.","user":"leeroy321","rank":[161,200]}]