[{"title":"More Fast Paced Fun From Noriyuke Abe","rating":10,"date":"26 December 2009","review":"When the Japanese Royal family orders that a scared object,known as the Oween,an amplifier of unlimited spiritual power,is to be moved to another area, Squad 10 of the Soul Society is commanded to keep the area secure. Unfortunately,the Oween is stolen by a rogue member of the Soul Society,who was rumoured to be assassinated by Squad 10 Captain,Toshiro Hitsugaya,but backed out at the last minute. When Capt. Hitsugaya abandons his post to find out what's going on,he is suspected to be in cahoots with Sojiro Kusaka,who had stolen the Oween. It is up to Ichigo,Rukia,and the rest of the Soul Reapers to intervene (much to the chagrin of the elders of the Soul Society). Subplots involving Hitsugaya's past,as well as Ichigo's past are interpolated into this fast paced tale of good versus evil. Noriyuke Abe is once again on tap to direct this beautifully illustrated &amp; animated feature,from a script by Michiko Yokote &amp; Masahiro Okubo,from the original Manga (graphic novel)by Tite Kubo,adapted from the Japanese television series 'Bleach'. As usual,the characters are voiced by the same cast as the series (with Wendee Lee,best known for her voice over work on Anime series such as 'Cowboy Bebop', as voice director for the American version,who also adds her voice talents). Spoken in either Japanese (no English subtitles on the Japanese DVD),or English dubbed. Not rated by the MPAA,but contains some fairly bloody violence &amp; fierce battle scenes &amp; a rude word or two.","user":"druid333-2","rank":[5,7]},{"title":"Better than the first movie? You betcha!","rating":9,"date":"13 July 2010","review":"First, everyone should watch this movie with the mindset that this is a filler episode but one of the best filler episodes you'll ever watch.<br><br>The storyline is very good. I like how they referred to the past (you have to watch bleach seasons 1-3), especially how the soul society acted toward another potential traitor after Captain Aizen and Captain Gin Ichimaru. <br><br>Second, the first five minutes already intrigue you as you are trying to figure out the value of the Ouin. I love stories that have a mystery aspect to it. <br><br>Third the character depth is great. It's good to get more of a background story on certain characters, especially on Soul Society captains like Tōshirō Hitsugaya and even more about Ichigo. <br><br>The animation is crisp clean and very good. In fact it's even better than the first bleach movie.<br><br>The music is good and on par with the series. It's good to see the musical score is creating new music yet keeping the same feel. <br><br>The action was amazing, especially the final fight. It felt epic and was executed perfectly. <br><br>Overall it's a great movie and the best filler episode in that sense. All of the reasons why anyone wouldn't like the first movie are corrected in the second one. Would i skip Bleach's first movie? Maybe. I would definitely just watch this one after seasons 1-3. Then again it is after season 6 (so why they released the second movie before the actual release of season 6 box set is beyond me)so for a fan keeping up with the time line, you might be wondering how did X get this or when did X happen. But it's not as bad as you think. You can still watch it and enjoy it, as long as you are up to speed with seasons 1-3. <br><br>If you are done with seasons 1-3, as well as the second movie, and really have no other Bleach to watch, i suggest watching the first movie afterwards and the bount arc. Otherwise watch this one first and continue on to season 6 or vice versa.","user":"axopnk","rank":[2,2]},{"title":"Much better than its predecessor and a must-see for Bleach fans.","rating":7,"date":"19 January 2010","review":"I'm a huge fan of the Bleach manga and a moderate fan of the TV series (except the filler sagas). This review assumes that people are familiar with the Bleach manga and/ or TV series.<br><br>Today I watched the English dubbed versions of both \"The Diamond Dust Rebellion\" (TDDR) and \"Memories of Nobody\" (MoN). I have already posted a review of MoN and the reason for that is a lot of reviewers seemed to be letting their Bleach fandom prevent them from actually thinking for themselves and accurately reviewing the movie. People were blindly giving 9/10 or even 10/10 to a film that would be unlikely to score 5/10 from any critic. When I came to watch TDDR I was desperately hoping they had recognised their previous errors and put a bit more effort in this time around.<br><br>As luck would have it, they did.<br><br>The biggest improvement over the first film is the screen writing. The plot has far more depth and is actually interesting. Where the first hour of MoN nearly put me to sleep, TDDR is actually entertaining outside of the fight scenes. The plot isn't perfect by any means, but it's definitely good enough to stop me complaining about it. Sure the dialogue is still pretty cheesy, but anyone who watches shows like Bleach will tell you that you have to take it with a pinch of salt. <br><br>Also TDDR is a lot more polished than MoN in terms of attention to detail. All the little bits and pieces that make a movie seem more realistic were really lacking in MoN. This is difficult to explain without using an example from the movie, so for once I'm going to use one (but avoid plot information). <br><br>When Renji needs to speak to Rangiku the chance passing of Shunsui means he and his lieutenant Nanao are then present during their conversation. While the important conversation goes on between Renji and Rangiku (the focal point for the viewer), Shunsui sits silently on the step beside them with his hat in his lap (he rarely removes his hat, even when fighting). He has done this out of respect because one of the characters is in a sort of mourning period. When important information is divulged during the conversation Shunsui begins absent mindedly twirling his hat around in his lap, his expression unchanging. This shows that he is thinking about what he just heard and formulating a plan, however he still looks like Captain Cool - Shunsui in a nut shell. My point here is that although Shunsui is not the focal point of the scene details have been added to make him seem more natural, even though most people won't notice (although this particular example is more obvious than most, hence why I can remember it lol). This is important because the more natural a scene is the easier it is for you to place yourself in that scene and become absorbed by the story.<br><br>Another thing that sets TDDR apart from its predecessor is the way they have integrated the popular \"minor\" characters into the story. In MoN it was obvious that it was very high priority to make sure all the most popular characters were featured in the movie to make sure the fans were happy, however because the script was so half-baked they ended up throwing them on screen with almost no explanation and it all seemed a bit silly. In TDDR they've still managed to feature all of the popular characters, they've made their appearances seem like a natural progression of the story, and yet they have done this without actually having to weave them into the main plot in any great detail (look at Kenpachi's entrance in MoN, then look at his entrance in TDDR, for example).<br><br>The voice acting in the English dub of TDDR is top notch.<br><br>Right. Now to the bad points.<br><br>There are two major problems with this movie as far as I'm concerned, the first and most important of which being the animation. Maybe I'm just imagining things, but slightly more care seems to have been taken with the animation and drawing just for the fight scenes, but even so they are still well below par for animated films. This shows that the people behind TDDR were still not prepared to expand their market beyond existing Bleach fans, which is a pity because this movie was good enough to do it.<br><br>The second problem is the music. At times the music in Bleach is so cheesy it makes me cringe. I can't believe no one has walked into the board room and said \"Hey guys, has anyone realised how stupid it is to use a song with penetrating, high pitched vocals as a background track for fight scenes? Not only does it detract from the action and fail in its role as background music, but the song we're using sounds like a bad '80s electro-pop track that never made it out of the garage. Maybe we should hire a sound guy or something?\"<br><br>Regardless The Diamond Dust Rebellion is worth watching even if you're not an existing fan of the series, although I would recommend watching the first one or two episodes as the movies take a lot for granted. <br><br>I've given it 7/10 but you can add an extra 2 points to that if you're a fan of the series.","user":"droctagon-638-646664","rank":[4,7]}]