[{"title":"A good film, if it was put together by a 5th grade drama class","rating":3,"date":"11 March 2020","review":"This isn't director, writer, producer, cinematographer, editor Aaron Mirtes' first time dabble in filmmaking, but you would think it was.<br><br>I get this was obviously put together on a micro budget, but the majority of the flaws could've easily been avoided - even by a 5th grade drama class.<br><br>For starters the writing and dialogue was just infantile in some scenes. Many plot and technical issues. The story itself had some opportunity, but that was clearly messed up in the screenplay.<br><br>The cinematography was adequate, but Mirtes failed miserably in directing his cast, and had some wacked out camera angles. The score was actually not bad nor overbearing, but the overall sound was shallow and distant. You can rent a couple of boom mics for chump change ya know.<br><br>I will however say, that although rudimentary, Alpha's android head was creepy af, and worked really well, especially with the voice and color changing light on the back.<br><br>I am disappointed at Mirtes' final cut, especially since I've seen some stellar films from amateur/newb filmmakers lately such as Guns Akimbo, Villain, Blood on Her Name and Foxtrot Six - all new and amateur filmmakers. This film is a generous 3/10 from me.","user":"TheTopDawgCritic","rank":[25,35]},{"title":"Nowhere near as bad as people are making out..","rating":7,"date":"12 March 2020","review":"Yes it's cheap, yes some of the acting is awful, but you need to enjoy it for what it is which is a cool little sci-fi flick.. I actually enjoyed it.. the robot was creepy and the film in general was entertaining.. those who can't look past bad acting and low budget should avoid.. myself found it good for a low budget sci-fi film..<br><br>And NO I don't work on the production team before anyone starts! 🙄","user":"jamiedee-45573","rank":[13,26]},{"title":"So bad it's....nah it's just bad.","rating":1,"date":"14 March 2020","review":"If you ever wondered what an episode of Black Mirror directed by Tommy Wiseau would look like, watch this film for a laugh.","user":"jacobwolpert","rank":[6,11]}]