[{"title":"pitiful","rating":1,"date":"23 September 2010","review":"There is nothing good to say about this movie. It's another pointless, pitiful and deeply unpleasant movie by Darren Ward. He has been making this type of thing for years and he hasn't improved since the truly awful Sudden Fury many years ago.<br><br>Its very very cheap. Production values are poor. The lighting is at times to dark to see what is going on and the sound makes it impossible to hear what is being said. However given the terrible level of acting and writing and directing involved this is probably not much of a loss.<br><br>There are some positive reviews here and on other sites which can only be by people connected to the movie as no-one could possibly find this to be a 10/10 movie.<br><br>Avoid.","user":"simonpcpearson","rank":[37,39]},{"title":"i've seen some rubbish in my time","rating":1,"date":"11 November 2010","review":"This is one of the worst films ever made. There are a lot of films on the IMDb that have suffered that accusation but in this case it could actually could be true.<br><br>The first sign that this is a cut and paste oater made with no care is the casting. Various rent-a-thug types play various rent-a-thugs ...badly.<br><br>These people always appear doing the same thing in zero budget British trash. They're not actors and they should stop pretending they are.<br><br>There is no plot, no character and the dialogue is embarrassing. Real actors couldn't say it convincingly let alone the talentless no-hopers here.<br><br>Despite opening with a sex scene and a couple of very violent and graphic torture scenes this is a very boring film.There are no good points.","user":"marcuspeerman","rank":[25,26]},{"title":"Disappointing film that doesn't deliver","rating":3,"date":"1 May 2010","review":"Mitchell (Nick Rendell) is a hard man debt collector who thinks he's hit it big time when he stumbles across £100,000 while collecting a debt from addled drug dealer Hopper (Italian horror veteran Giovanni Lombardo Radice)<br><br>However, it turns out that the money belongs to his new boss, gangster Curtis Boswell (victor D Thorn) who promptly sends Mitchell to find his loot. So begins a nightmare for Mitchell, who must stay one step ahead of his crime colleagues if he wants to stay alive...<br><br>A Day Of Violence is nothing special trash, and I've no problem with trash per se- as long as it's entertaining, but unfortunately, it isn't. Shot on video, it has unconvincing performances from Victor Thorn as the rather well spoken crime boss, as well as clichéd hard men in black suits spouting pretty woeful dialogue. It has one or two nice gore scenes and director Darren Ward's heart is in the right place, as the film is nicely exploitative. It just isn't very good, and you won't really care what happens to the characters anyway.<br><br>A Highly disappointing and mediocre film, it's probably best watched drunk, or else not watched at all, because nobody's missing anything here at all.","user":"Corpus_Vile","rank":[40,44]}]