[{"title":"The Flight Of Joaquin Phoenix","rating":8,"date":"15 February 2009","review":"Perhaps, the most startling aspect of \"Two Lovers\" is Joaquin Phoenix's performance. Superb. I haven't really liked any of the James Gray's films, until now that is. There is something profoundly moving and profoundly truthful here and I'm sure it has to do with Phoenix's portrayal. Gwynneth Paltrow is wonderful as the girl walking an emotional tightrope. And Vinessa Shaw is a real find. I was also moved by Isabella Rossellini as Joaquin's mother! Beautiful and intense but unlike many of her contemporaries not \"cosmetic\" A real extraordinary face. In fact she looks more like her mother Ingrid Bergman now than she ever did. So, a smart, romantic \"dramedy\" with wonderful performances. When was the last time I was able to say that? Go see it and tell me if you think I'm exaggerating at all.","user":"agmancuso","rank":[132,149]},{"title":"A small, but very affective watch.","rating":8,"date":"3 March 2009","review":"James Gray's latest film tells the tale of Leonard Kraditor (Joaquin Phoenix), a man who had a problematic break-up with his fiancée two years ago, and has since been heading down a suicidal road. 4-months into living back home with his anxious parents (played by Moni Moshonov and Isabella Rossellini) and helping out at his father's dry-cleaning business, Leonard is introduced to Sandra (Vinessa Shaw), a sweet daughter of his father's business friend. Wearing her heart on her sleeve, Leonard has moments of true spark with her, and you can see his eyes changing away from the torment inside. A woman is surely the right thing for Leonard, as he carves through the days with a worn-out heart and a mind in loneliness. Soon after meeting Sandra, he befriends Michelle (Gwyneth Paltrow), a beautiful but messed-up girl that's dating her married boss (played by Elias Koteas). With her, Leonard sees an escape, and a burning romance. Leonard's mind is now set on two women, and he finds himself torn between them.<br><br>James Gray hadn't really impressed me with his earlier films, for me they all lacked out on the intensity and became standard crime-thrillers. With his latest melodramatic romance, he really surprised me; he does a caring job directing the three performers, and he tells a strange and tender story. The music of the film is Jewish guitar-instrumentals that are carefully intertwined, but most of the film has got a blanket of quiet bleakness, and it's covering every little corner.<br><br>The performances of Gwyneth Paltrow and Vinessa Shaw are great, and although the two never share screen-space, director Gray naturally and carefully shifts between the two lives Leonard is living, and so the two of them add lovely pieces to the story. But it's in-between the double relationship the film and its protagonist is living, the film has to connect, and it couldn't have been done better than by Joaquin Phoenix. Leonard is a suicidal depressive that enters human-bounding and the give &amp; receive of it, and this is a very difficult character to portray - but just look at Phoenix, he is phenomenal; the incredible naturalism of it shows Phoenix in the performance of his career.<br><br>The melancholy of the film doesn't make it for the dominant audience, but I've never even cared a bit for that, and it's a delight that romance on screen can be thrown upon like this. 'Two Lovers' is a small film with a heart that's full of rare atmosphere, the form of it is tearing and in center, a superb Joaquin Phoenix.","user":"EijnarAmadeus","rank":[46,53]},{"title":"Solid, intense character study from James Gray","rating":9,"date":"11 February 2009","review":"Gray's fourth film, his first without a crime element, is amazing, and surprises even with its title. It's a triumph for Joaquin Phoenix, who provides a remarkably giving and open performance even though the character he plays, Leonard Kraditor, is opaque. He's a damaged, emotionally unstable man with attempted suicides in his past: the film, cheerlessly--yet ironically--begins with yet another one. He does know his own sad history, dominated by a broken engagement. On medication for bi-polar disorder, he's been reduced to living with his parents in the Russian and Jewish community of Brighton Beach, Gray's home territory, site of 'Little Odessa,' his distinctive little first film and equally of his subsequent, more grandiloquent ones. (The last, 'We Own the Night', also starred Phoenix.) Leonard doesn't know who he is or what he wants. He may not dare to want anything. He's working, fumblingly, in the dry cleaning establishment on the ground floor that's owned by his Pop, Reuben (Moni Moshikov). He's lost clothes making deliveries; and he's lost himself.<br><br>A friend of Leonard's father, Michael Cohen (Bob Ari) has a small chain of dry cleaners Pop's going to merge with. Cohen has a daughter, Sandra (Vinessa Shaw), whom the parents have set up with Leonard. He's only a little interested. But he does take her into his little boy's bedroom to show her his black and white photographs of destroyed shopfronts. He's so needy, he welcomes any attention. Sandra is very interested in him. She finds him not odd, but special. And she has a sweetness about her than lingers in the mind.<br><br>But then another woman unexpectedly appears: a new neighbor, the blond and dangerous Michelle (Gwyneth Paltrow). Even at their first meeting in the hallway she's in trouble, being verbally abused by her visiting father, and in need of comfort and protection. And from then on whenever Michelle calls on Leonard, however bad the time or awkward the occasion, he can never say no. She's pretty, even glamorous, but also unhealthy. She's been on drugs. Leonard can see her window upstairs from his room, and she becomes a glittering object of desire, so near and yet so far. Because he wants her, but she thinks of him from the first as like a brother.<br><br>So there are the \"two lovers\"--Leonard's two women, Sandra, who knows his problems and wants to take care of him, and Michelle, who knows them and takes advantage to make him a comforting pillow in her troubles with Ronald (Elias Koteas), her married lawyer boyfriend. Michelle has Leonard come to a fancy restaurant to meet Ronald and size him up, tell her if he thinks Ronald will ever leave his wife. Instead, while Michelle's in the ladies' room, Ron asks Leonard to watch out for her and see that she's not using again. Then Michelle and Ron go off to his firm's box at the Met and leave Leonard in the company limo. It's a sobering moment that defines Leonard's lostness and the film's originality.<br><br>Leonard seems a misfit and a loser, but when Michelle takes him clubbing, he does some rapping in the car and break-dances wildly; he's got some game, somewhere. He also has those strong Jewish Russian family ties that run through Gray's films but don't save his protagonists from disaster. His mother Ruth (Isabella Rossellini, with a severe haircut) watches kindly over him and both his Pop and Cohen are ready to look out for him too. Shooting photos at Cohen's son's bar mitzvah, Leonard is part of a community, however awkwardly. He meets Michelle up on the roof. She doesn't fit in. But he wants her desperately. Meanwhile Sandra declares her love to him at a beach-side restaurant with complicated blue napkins.<br><br>'Two Lovers' is aswarm with an elaborate sound design that can be obtrusive. Background music overwhelms conversation at a family gathering, and an echoing passage from 'Cavalleria rusticana' is a bit overdone. It's more firmly glued together by images of long subway rides and dark expensive cars. Though the latter may seem leftovers from Gray's 'The Yards' and 'We Own the Night,' Gray has done a good job of downsizing from those while holding onto their resonance.<br><br>Joaquin Phoenix's performance is awkward in a way that would be very painful if it didn't feel so authentic and real. His Leonard is pathetic and lost, but has an inner core of goodness and generosity that makes it seem there may be hope for him. He's a real sucker, but he's a real decent fellow. Leonard has nothing, and so he is ready to throw away his life and throw it away again. Gray goes back to the smallness of his first film, but with a far greater intensity. Leonard's crises feel momentous. Their resolution is a quiet, mute shock. As in other Gray films, the hero blends into a party, and a family network. This time the sense of family and ritual is more offhand and organic than in the preceding two films.<br><br>'Two Lovers' has powerful moments. It's like a good short story and it has a surprise O. Henry ending. The performances are uniformly fine. The texture is thick enough with a sense of people and places to override some implausibility in the events. Phoenix's performance will have detractors who find Phoenix too awkward and say it's just as well he plans to quit acting after this for music. But on the contrary this movie made me see how disarming and unique the actor, once overshadowed by his dazzling brother River, has come to be at 35. It would be sad if he left the screen.","user":"Chris Knipp","rank":[113,139]}]