[{"title":"The worst in the series","rating":3,"date":"30 August 2009","review":"This was the worst entry in the series for the following reasons:<br><br>1. At approximately 80 minutes the film is too short and there isn't any sort of time given to building up tension.<br><br>2. Pretty much all of the deaths are given away in the previews, so when someone dies its no surprise whatsoever. By taking away the surprise aspect the movie was ruined.<br><br>3. There is even less of a plot here then the other 3. Granted the basic premise is the same but they didn't even try here.<br><br>4. The deaths themselves were very \"meh\" and fake looking. Way too much CGI was used. Not only that but they cut away from what probably would have been the most visually interesting death. 5. No Tony Todd. He was seen in the first 2 and heard in the 3rd one. At this point the fans expect to see him. They should have tried to get him in here somehow.<br><br>I could go on and on. I hope that if they make a 5th one that James Wong (who directed the first and third films) returns to give the series a proper send off as the David Ellis entries to the franchise (the second and fourth films) are definitely the weakest links in the series. To his credit though, part 2 did probably have some of the best deaths in the series (opening premonition, fire escape ladder, and plate glass).","user":"jinkazama10","rank":[176,233]},{"title":"Gimmicky Horror","rating":5,"date":"1 September 2009","review":"For me, a rating of 5 out of 10 means I didn't like the movie, but I didn't hate it either.<br><br>\"The Final Destination\" is a 3D horror thriller gimmick. Even though I saw this in 2D, there were many elements that were very obviously designed to be in 3D to take full advantage of the medium.<br><br>However, the film itself just isn't good. <br><br>The acting is terrible. The story is formulaic. There's nothing really interesting as far as the plot. No discussion of death. No new interesting concepts. Lots of fluff in the form of false kills. And the entire film from the opening credits to the closing credits is about the methods in which these people die.<br><br>What this movie is really about is killing young, attractive individuals in a manner which will compliment the 3D. Nothing else. It's just killing people using a Rube Goldberg device or a flying object in 3D.<br><br>Some of the special effects are good, and a few of the deaths are interesting, however, the film doesn't really do anything for me. It's just kind of there. I don't really hate it, but I don't really like it either. I also don't really care for 3D in general. I think it's a stupid way of getting you to pay a little extra, like IMAX (which is a bigger screen and some extra speakers. Yaay).<br><br>Overall, if you like the 3D gimmick; you're just looking for a movie to take a few friends to and have a little fun; and you don't really care about plot, characters, or story, you might have some fun. To anyone else, I wouldn't really recommend it. It's just a studio gimmick and can be easily ignored.<br><br>5/10 - Nothing special.","user":"FoxWolf87","rank":[97,131]},{"title":"Sucked!","rating":3,"date":"29 August 2009","review":"I never, ever expected to give this film 3 out of 10, i'm a fan of the series and thought FD3 was pretty damn awesome - by far the best of the trilogy. So when i saw this movie was \"THE\" final destination (a pretty cocky title, but hey it may have lived up to it) and it was gonna be in 3D i had pretty high expectations.<br><br>My expectations were wrong. This movie SUCKED. If it wasn't part of the franchise it would have been a straight-to-DVD suckfest. Seriously i was WAITING for it to end. The accident at the car racing ring was just so - blah. I mean i know the whole series is far fetched and you have to have an imagination to believe it but this one was just so uninvolved. I mean getting on a plane, getting in a car and getting on a roller-coaster are things where you are putting your life at risk without thinking. Sitting in an audience? I mean come on, what's next \"Final Destination 5 - i walked down a street and a building fell on me\". By making the accident so un-scary what ensued just didn't really leave you involved. Nothing scared me here, i wasn't unnerved like i was with 1 through 3. Every time i get on a roller-coaster i get FD3 flashback, the only thing that will flashback to me from \"THE\" final destination will be the HORENDOUS performances.<br><br>Ah the performances. FD1 had Seann William Scott &amp; Kerr Smith, FD2 has Ali Later &amp; FD3 had the immensely talented Mary Elizabeth Winstead. This film had 1 guy who could act trying to carry the whole sorry mess and a whole lot of bitches who need to be slapped for even thinking they should move to Hollywood. I know it's a lot to compete with but rather than just ignoring this you'd think the producers / casting directors would really try and pull something out of the bag here. Apparently not. To give him his due Bobby Campo was charismatic and tried his best with the shoddy dialogue he had. If the rest of the cast had been as good as him then we would have no problems. Nick Zano was OK as the cocky guy but there are people who could have done that way, way better. The real problem? The support actresses here were AWFUL. I just wanted to scream THIS IS NOT A COLD READING. I'm pretty sure that there were a friggin ton of young talents who auditioned for this piece and THIS is what they cast? Even the \"MILF\" (yes, she was actually credited as that) sucked. How hard is it to be a MILF?. Shantel Von-whatever her name is (AKA, A poor mans Ashlee Simpson) and Haley Webb (god i wanna slap her SO hard) apparently call themselves actresses. Before they continue to do this may i suggest something to them, ACTING LESSONS. GET THEM. YOU SUCK! For the love of god EMOTE. They sounded like they were reading straight from the script and looked blank in every scene. Awful.<br><br>The deaths in FD4 were just too unrealistic. The special effects sucked - not even 3D could begin to save them. They looked like somebody got a little too excited with a computer and didn't really put any thought into making it look real. Making it look just a little bit real will scare people, making it look FUNNY is gonna annoy people.<br><br>This film was just so, disappointing. Unrealistic, uninvolving, uninspired JUNK.<br><br>The only thing i wanna say is, if there is gonna be an FD5, and i really hope there is considering 3/4 were awesome - then please, for the love of god bring back Glen Morgan &amp; James Wong. Those guys know how to really scare people and the whole feel of the 1st &amp; 3rd films is just so much better.<br><br>Oh, and find people who have mastered the art of acting. Its pretty vital.","user":"thewhites2kn2","rank":[50,65]}]