[{"title":"To predictable, to corny and just too bad.","rating":2,"date":"10 October 2013","review":"I love a good romantic comedy but Baggage Claim in nowhere even near that type of movie. It seemed more like an corny SNL skit that lasts over an hour. I had the movie already figured out in the first 15 minutes and had to endure the rest of the flick. This plot is just one notch above that goofy Soul Plane from a few years back and a few below Tyler Perry's Madea Goes to Jail. A better script, more realistic characters and a more serious touch the movie might be average. Paula Patton is beautiful as always that you can't deny and Ty Diggs is an accomplished actor but they need to move on into some more serious roles. My advise is don't waste your time on this one. I still can't believe I didn't walk out.","user":"demetriocoffman","rank":[23,29]},{"title":"Absurd Premise Too Ridiculous To Get Past","rating":4,"date":"22 February 2014","review":"Paula Patton is so sweet and beautiful that it's difficult to not like any movie she's in. However, I found the premise in this rom-com fantasy to be so absurd that I couldn't get past it.<br><br>Patton portrays Montana Moore, a flight attendant for Trans Alliance Airlines. She's been a bridesmaid 9 times but never a bride, while her domineering and annoying mother Catherine (Jenifer Lewis) has already been married 5 times. She's constantly pressuring Montana to find a man to marry, and now that Montana's younger sister is engaged the pressure is ratcheted up even further.<br><br>So what's the game plan, so Montana can \"get a man\" in thirty days, by the time of her sister's engagement party? Why, of course it's to flag all of her ex-boyfriends who are flying for the holidays and match Montana up with their flights. For this she will get the help of her two friends and fellow flight attendants Gail and Sam, ably portrayed by Jill Scott and Adam Brody. At least, they provide some much need comic relief here.<br><br>Of all the \"hunks\" she will meet on these flights, I liked Taye Diggs the best as Langston, who's a smarmy and egotistical politician, and who still has a caveman mentality. While Montana is trying to meet all these potential suitors, she maintains a strong friendship with William (Derek Luke), whom she's known since elementary school and just happens to live next door to her in their apartment building.<br><br>As noted by a number of reviewers you can guess which way this film is going and it doesn't disappoint in that regard. Overall, this movie, written and directed by David E. Talbert, based on his book, despite some funny moments and a feel-good ending was way too contrived and predictable for my liking.","user":"larrys3","rank":[8,9]},{"title":"A waste of a movie for such good talent!","rating":1,"date":"14 November 2013","review":"I have no idea whether or not Paula Patton actually read the script before signing up for the role, but this movie certainly does little to nothing but justify her talents. If you've watched her in Deja Vu, then this movie will strike you as the lowest she's ever sunken in her movie roles. The storyline is very weak to say the least. You can literally guess what will happen from one scene to the very last, including the credits. I felt sorry for actors like Trey Songz. If he is serious about acting, this may not have been a good movie to make his first impression in. The movie's attempt at humor was also poor. There was only one joke the audience laughed at in the whole movie. I am not surprised the movie was pulled out from the theaters in my neighborhood after only a few days. It is one that belongs to the DVDs.","user":"kayceeroy","rank":[13,18]}]