[{"title":"Do Not Miss This One!","rating":9,"date":"30 December 2008","review":"After a long and tedious wait Ghajini arrived. There was a lot of skepticism about it being a direct rip of its Tamil counterpart as well as Memento. However when one enters the movie theatre, those factors are hardly on one's mind. And any thought of all those things indeed vanished from my head the moment the movie started.<br><br>Ghajini is one of the best thrillers to have come out of the Bollywood stable in recent years. And to top it all, it has a nice dose of humour as well. Aamir Khan once again proves that he's not just the best in business, but he's the one leading the way for Bollywood to make better movies. Indeed as many users have mentioned the villain Ghajini does not look menacing enough. But lets face it, gone are the days when villains used to be called Mogambo. And gone are the days when villains used to have a scar faced appearance. The new age villain is what Ghajini is.<br><br>The acting is superb to say the least. (Although Jiah Khan really spoils the party. She's better at romancing a senior citizen than playing such characters.) Asin is absolutely brilliant and leaves a lasting impression. She makes you feel the depth and the pain of the \"Kalpana was killed\" tattoo. And finally, Aamir Khan. Well, what more can one say about this man who has changed the landscape of Bollywood movies. Once again he delivers a power packed performance, I could almost feel his emotions within me!<br><br>Watch this movie for its complexity and its simplicity. The complex character of Sanjay and the beautiful and cute Kalpana makes this movie one of the best movies of 2008. What an amazing way of making the year so special!","user":"arnab_das","rank":[69,116]},{"title":"A Nutshell Review: Ghajini","rating":8,"date":"27 December 2008","review":"The tattoos on the body, the Polaroid snaps, the notes scattered around the house, and the smoking gun evidence? Short term memory loss, happening every 15 minutes. If this doesn't seem like Christopher Nolan's masterpiece Memento, then I don't know what does. Written and directed by A.R. Murugadoss, I don't see much of a nod of acknowledgement to Nolan's work, and in almost all literature, it only falls back on the fact that this is a Hindi remake of Murugadoss' own Tamil movie of the same name Ghajini, produced in 2005 (Nolan's was in 2000), which joins the ranks of films having their titles named after the chief villain.<br><br>In any case this isn't the first time that we see very obvious similarities in premise and characters being adopted for Bollywood's own productions, and the shot-in-Singapore Krrish comes to mind as well, as they had the entire setting of John Woo's Paycheck incorporated into that film. But of course in any version some merits could be found, but I believe some form of acknowledgement would be in order, other than, in this case, a quick flash of a very wordy disclaimer about Ghajini being gleaned from various short stories and material (and another paragraph which I missed given the fine print, and short duration on screen, but I'm pretty sure no mention of Memento).<br><br>Well, there are some reasons why I chose to watch this. First up, the music's by A.R. Rahman, and for all the good publicity he's getting for his work on Danny Boyle's Slumdog Millionaire, I just had to experience yet another piece of his musical magic on a film, besides one that I've watched much earlier this year in Jodhaa Akbar. One just cannot imagine how his musical talent will be put to good use in a film which looks and feels like Memento, and this being the next best thing. \"Guzarish\" is a track used in the trailer, and it is currently my new ear worm.<br><br>Another reason is of course, Aamir Khan. Yet another prolific actor with a penchant for perfection, it was interesting to see how his take on the protagonist's short term memory loss, would rival that of Guy Pearce's. I'm embarrassed to say I've only seen him in action in Lagaan, so this would be yet another opportunity to witness his ability which can be measured against a benchmark. But don't expect the same though, because Pearce's version was more of a thinking man who questions and second guesses himself, while Khan's version was in two parts to serve the story, one as a raging hulk monster who tears through his opponents with savage violence fueled by anger and hatred, coupled with the hurt he experienced and recalled (Hulk producers take note, in case Edward Norton decides against any more sequels, look in the direction of Aamir Khan), while the other as mild-mannered Sanjay Singhania, CEO of a telecommunications company in Mumbai.<br><br>Yes, Bollywood's version naturally comes with built-in song and dance, which for once I would have thought looked quite out of place in the movie, if not for A.R. Rahman's score and music. While half of the movie might be seen as a copy of Memento's premise and character, the other half served more to allow the audience to share the pain with Sanjay. Nolan's version had you experience the frustrating condition of the syndrome through its narrative presentation, but this one junks the reverse chronology, and plays it out flat and builds a rich back story for Sanjay, so much so that you'll root for him as he goes on his rampage of revenge. You'll find yourself entrenched in the romance between Sanjay and his lady love Kalpana (the stunning Asin, who reprises her role from the 2005 version as well), who's a model awaiting her big break, and a girl with a genuinely good heart. The plot never fails to give her numerous moments to showcase her good nature, and it's no surprise why anyone would not fall in love with her instantly. Factor in plenty of lovey-dovey moments of comedy and pursuit (under the guise of a different identity, like Shah Rukh Khan's Rab Ne Bana Di Jodi) which makes it perfect for a date movie, but with hindsight that you know this love is doomed from the moment it began, which actually makes it quite sad to watch the events unfold since you know what will eventually happen to her.<br><br>Ghajini doesn't adopt or try to adopt those very cerebral mind-f* moments from Memento, but as I mentioned plays it out more like a straight forward action thriller, with a handful of inevitable moments of watching our protagonist get taken advantaged of because of his condition. No other structural styles are used besides flashbacks, where the purpose of two characters in the movie are to read the diary of events so that it could be translated visually onto the screen. However you'll still be kept in the dark for some time as to why the designated thugs of Ghajini (Pradeep Rawat) would want to exact their mettle onto Sanjay and Kalpana, and you'll be held in suspense for almost 2 hours before the reasons get shown.<br><br>I can only imagine the flak that this film might receive because of having to adapt, and not properly acknowledge perhaps that it's not original material, save for the romantic spin on it. But if you would look past those ramifications and treat this like a re-imagining of Memento in more straight-forward terms, that this would still serve as an entertaining thriller done Bollywood style.","user":"DICK STEEL","rank":[61,107]},{"title":"Entertaining","rating":7,"date":"13 April 2011","review":"Ghajini is an entertainer.<br><br>It has loads of action,comedy,drama and romance which makes it a family packed entertainer.<br><br>The story is good.<br><br>Screenplay is penned very well.<br><br>But the problem is that the movie is long,it could have been trimmed 15-20 minutes and the movie even gets violent at times,which could have been shortened.<br><br>Direction by A.R Murugadass is excellent.<br><br>The music is very good.<br><br>Performance wise-Aamir Khan is menacing.He is superb.Newcomer Asin is very good.Jiah Khan is perfect.Pradeep Rawat is first rate.<br><br>Overall Ghajini is an entertainer.","user":"ganeshkss97","rank":[12,17]}]