[{"title":"How could he get it so wrong?","rating":3,"date":"21 April 2010","review":"25 years ago, I sat open-mouthed in awe of the intense visceral horror experience that was George Romero's Day of the Dead; today, I sat jaw agape once more at the director's latest zombie flick, Survival of the Dead, although for a very different reason: utter disbelief!<br><br>How could George Romero, the creator of the modern movie zombie, get everything so totally wrong?<br><br>With Survival, it looks like the director has finally taken on board the criticism aimed at his last two films and ditched the heavy-handed social commentary (the messages are still there, but are far less 'in-your-face'); unfortunately, somewhere during the creative process, he's also unwisely opted to up the level of comedy, meaning that much of this film plays the global zombie threat for laughs.<br><br>Remember how Romero used the slapstick custard pie scene in Dawn of the Dead to momentarily relieve the tension? Well in this one, it's all 'custard pie' and absolutely no tension. During the course of the film, we get to witness several cringe-worthy comedy zombie slayings, a hilarious bitter feud between two stereotypical Irish clans, a zombie woman on horseback, a car ferry strangely moored in six feet of water, zombie fishing, plus loads of other nonsense that beggars belief. Not once, however, do we get a sense of dread. The closest Romero ever comes to delivering the goods is with a couple of cheap jump scares that are accompanied by loud noises and some admittedly splattery gore (that relies a little too heavily on CGI for my liking).<br><br>Had Survival of the Dead been made by anyone other than Romero, then I may have rated it as high as 5/10: it's never boring, I suppose. But coming from the guy who practically invented the genre, the film can only be seen as a massive disappointment—easily the worst of his 'Dead' films to date—and therefore fully deserves my lower score of 3/10.","user":"BA_Harrison","rank":[113,161]},{"title":"My, how far we've fallen.","rating":3,"date":"10 May 2010","review":"With this latest Dead entry from George, I realize we're never going to approach the original trilogy's greatness ever again. It took 20 years after Day of the Dead (still my favorite) to get to Land of the Dead (entertaining, but nothing new). In the last 5 years, George has cranked out 3 Dead movies. Is he inspired or trying to stay commercially viable? Diary annoyed me with its Scream/Blair Witch hybrid and now, if it's possible to get worse, we have.<br><br>Survival of the Dead plays like a TV movie with profanity. I couldn't get over how lifeless this movie was. I appreciate the Irish Western flavor, but that's all that's new here. While watching this, I felt like it was a rehash of Day of the Dead, substituting two feuding Irish families for the feuding military vs scientists. The so-called twist at the end is embarrassingly desperate. I know some fans will want George to make one more great Dead movie and retire the series. After witnessing this second trilogy, I feel the more he makes, the more creatively bankrupt he appears.","user":"johnmcdev","rank":[68,95]},{"title":"By George, I Think He's Lost It","rating":2,"date":"31 May 2010","review":"George Romero has totally lost it. In fact, his latest zombie opera, \"Survival of the Dead,\" is so bad that I'm beginning to doubt he ever really had it. Romero, like everybody's other least-favorite George, has been tainted by his early success, and is now every bit the cluelessly misguided, ineffectual storyteller Lucas is.<br><br>It's actually astounding that \"Survival of the Dead\" comes from someone who's been in the business for forty years, because it positively reeks of amateurism. The writing is dense and talky, with stilted, masturbatory dialogue, and some of the laziest attempts at horror I've ever seen. Not only is \"Survival\" not scary, it's not entertaining, and for all its attempts at social commentary, it's not even insightful.<br><br>It's like Romero spent the last few decades reading essays on \"Night\" and \"Dawn of the Dead,\" endlessly stroking his own ego as both a Master of Horror and a respected sociological voice. But where his early \"Dead\" films were dedicated zombie pieces with a muted social backdrop, \"Diary\" and \"Survival of the Dead\" are full-blown, pretentious soapbox films that just so happen to star the walking deceased. In fact, the big zombie sequences this time around are used more to artificially herd our protagonists than they are to exhilarate audiences. Romero's first film, \"Night of the Living Dead,\" is unsettling because the threat of attack is omnipresent, and growing exponentially direr. Now, zombies show up seemingly at random, and even by the admission of the characters, pose little threat. The action itself is also horribly cut, and panders to those for whom the zenith of entertainment is a creative zombie death.<br><br>But even the most over-the-top kill is rendered meaningless when it's executed at the hands of such uninspired characters. Romero's cast is comprised of uniformly cartoony, stereotypical surrogates for human beings that prove not only that Romero doesn't know his craft, but also that he doesn't particularly understand people. It might not be so embarrassing if he wasn't desperate to stay relevant, but he jams in a superfluous teenager who says things like, \"Low tech? This is no tech,\" and can't wait to show everyone his iPhone. You're 70, George. Get over it.<br><br>Ultimately, these complaints are just the limp appendages on Romero's rotting carcass of a career. The man simply cannot write and relate a coherent story anymore. It's tough to even summarize \"Survival of the Dead.\" I mean, cell phone kid and a ragtag team of ex-military something-or-others clash with two feuding Irish families on an island off the coast of Delaware (???), a place apparently so far removed from modern society that they settle their disputes with 19th century rifles. What? It's all just tacky garnishment around Romero's big question, which is whether or not euthanizing the living dead is a humane practice. It's an intriguing premise, but one that doesn't have any real world application. Plus, he posits that a zombie can learn, but also that it's no less hungry for flesh. Hypothetically, if they're real, they're dead, and they want to eat us, I'm not sure it really matters that they have some miniscule capacity for intelligence.<br><br>When you get right down to it, there's nothing in this film that works. \"Survival of the Dead\" goes beyond a forgivable exercise in over-thinking—It's so sloppily conceived and ineptly executed that it casts doubt on any talent I once thought Romero had. Like with Lucas and his later \"Star Wars\" films, the director has, at best, faded into a distant echo of the artist he once was. At worst, his audience is forced to consider that maybe he was never the genius we hailed him as. Now there's a scary thought.","user":"colinrgeorge","rank":[31,44]}]