[{"title":"It's Time Spent Together That Counts","rating":18,"date":"18 February 2011","review":"Rodrigo Garcia's 'Mother and Child' is one of the most moving poetic films I have seen of recent times. Garcia's previous films comprised of short vignettes and, on the surface, 'Mother and Child' appears that way. Though the connection between Elizabeth's story and Karen's story is apparent, the other subplots initially appear as though they have no link to Karen and Elizabeth.<br><br>While there have been numerous movies of intertwined lives and stories, only few films have managed to have strong links and 'Mother and Child' is one of them and in addition the link between the stories is very significant and it's beautifully done. Moreover the twists and turns are superb. Rodrigo Garcia truly has created a treasure here. His eloquent writing breathes poetry as the story of his characters' lives unfold. Every single character, even the minor ones, are excellently fleshed out.<br><br>The execution is just as wonderful. The art direction, cinematography, editing and lighting is first rate. The soundtrack is simply amazing.<br><br>Each and every one of the actors does nothing short of fantastic and they deliver some of their finest performances. Annette Bening and Naomi Watts are spellbinding as the mother and daughter, two lost souls leading fractured lives until they gradually find purpose. Kerry Washington is superb as the wannabe mother desperate to have a child while being unaware of the challenges of motherhood. Jimmy Smits is terrific. Garcia's regulars, Elizabeth Peña, Elpidia Carillo and Amy Brenneman are very effective in brief roles and Cherry Jones is brilliant.<br><br>'Mother and Child' offers the viewer what they don't know they were looking for in a film. While it is no surprise how many gems are overlooked by people because of lack of recognition, it's a shame that this precious little film falls under this category. I couldn't recommend it more and it's become among my favourites.","user":"Chrysanthepop","rank":[24,25]},{"title":"Hollywood doesn't necessarily have to be formulaic and predictable","rating":7,"date":"7 May 2010","review":"Looking initially like your typical women audience's movie, \"Mother and child\" can almost be described as innovative, albeit in a subtle and minimalism fashion.<br><br>With a prologue of a teenage (barely, at 14) pregnancy that seems a rather favourite plot line these days, this movie follows three separate stories, of which the ultimate convergence of two can be detected almost immediately, while the third continues to remain at a distance until almost close to the end. But then right from the beginning, there is a shared theme: unwanted pregnancy and one of its common solutions – offer for adoption.<br><br>In the first one, middle-aged Annette Bening is spinster Karen who is struggling with a strained relationship with her invalid mother Nora. This is compounded by the fact that the hired Latin domestic help Sofia (Elpidia Carrillo) seems to have taken over her place as the recipient of her mother's affection and trust. An added aggravation is that Sofia needs to bring to work her otherwise unattended little daughter, another rival for Nora's attention. At the work front (Karen is a physiotherapist), the arrival of a gentle, caring co-worker Paco (Jimmy Smits) stirs up in her emotional life ripples that at times turn stormy. As events unfold, the fact that Karen turns out to be the pregnant teenager in the prologue is of course not a surprise. I won't go into some of the key events in this plot line. Suffices to say that after some soul-searching and self-discovery, Karen goes to Sister Joanne (Cherry Jones, Molly Star in \"Ocean's Twelve\") who arranged the adoption over 30 years ago, seeking help to establish contact with a daughter that she has never seen.<br><br>Naomi Watts is a mid-thirtyish, successful lawyer Elizabeth, stunningly beautiful, ruthlessly aggressive, moving from job to job (and town to town) every few years, unattached, valuing her independence above all else. She prefers to report to a man as women bosses \"find her threatening\". The latest such male boss is Paul (Samuel L. Jackson), recently bereaved, with grown children but still dashingly attractive. As a plot line, development of sexual relationship between the two is almost mandatory. Although with this man, Elizabeth seems to find the closest thing to love she has ever experienced, she is not going to give up her independence and customary sexual freedom with men. Right from her very first scene, the interview with Paul, it is made clear to the audience that Elizabeth is the daughter that Karen gave up for adoption over thirty years ago. The key development here is Elizabeth getting pregnant, which she thinks is impossible as she had this attended to in a cross-border medical visit (she was then 17, a minor). The miracle of carry another life in her sets Elizabeth's mind on looking for her biological mother. Yes, again. Sister Joanne comes into the picture.<br><br>The third plot line develops around Lucy (Kerry Washington, best remember by many as Della Bea Robinson in \"Ray\") who is unable to give her husband Joseph (David Ramsey) a child. The couple decides on adoption and with the help of Sister Joanne (obviously) goes through a search that turns out to be tempestuously traumatic. As mentioned, the convergence of this third plot line with the others is not obvious and does not come about until close to the end, with a plot twist.<br><br>While the above might appear to be a reasonably comprehensive synopsis, there is a lot of details that I have omitted, details of importance both to plot development and to the understanding of the protagonists. Similarly omitted are relatively minor characters such as the doctor that initially diagnosed Elizabeth's pregnancy (Amy Brenneman whom you should remember if you have seen \"The Jane Austen Book Club\") or the Karen's teenager lover now met in a chance re-encounter (David Morse). There are just too many for me to mention all here. One very remarkable thing is that each one of this large ensemble of characters perform the roles with such attention and dedication as if it were a lead role. The wonderful result is plain to be seen. The three leads are simply superb, all Oscar-worthy.","user":"harry_tk_yung","rank":[27,29]},{"title":"Garcia's Mothers","rating":9,"date":"30 April 2010","review":"Rodrigo Garcia, the writer, director of \"Mother And Child\" is the son of Gabriel Garcia Marquez no less but his universe is solidly set on a reality that doesn't shy away from poetry. A poetry emerging from an open female heart. Wanting and longing for things we lost, for thing we let out of our lives. Annette Bening is superb. Superb! \"She's 38 today\" Annette tells her failing mother, talking about the daughter she gave up for adoption when she was merely 14. Naomi Watts is the long lost daughter and she is an updated version of the mother she never knew. Naomi Watts confirms, once more, her extraordinary range. The film works on every level and we live the changes the characters suffer with a palpitating heart of recognition. The entire cast is outstanding with Samuel L Jacksong giving a performance that is a revelation in itself. Gentle, strong, moving, powerful and funny. A film I highly recommend.","user":"roastmary-1","rank":[54,66]}]