[{"title":"Totally bittersweet but also stunning and meaningful","rating":9,"date":"16 April 2010","review":"\"Summer Days with Coo\" is full of realism and one of the finest animated works which won the animation of the year.You will see in this beautiful movie how human beings who live in concrete jungle forgot sincerity to others. Coo may look like an alien to you but he and his summer days with one kind human family will remind you of your lost memories and bittersweet nostalgia. \"Summer Days with Coo\" even includes several social problems such as overreaction of mass media, bullying and invisible violence in our society.<br><br>Overall, \"Summer Days with Coo\" is very good movie , not a kind of only critically acclaimed movie.I recommend this to all the people who want serious and sincere movie works but this could be excellent for education.","user":"masayukiyamada5","rank":[31,34]},{"title":"Miyazaki like highly watchable","rating":9,"date":"2 April 2011","review":"I signed up to do reviews just to let you know ignore other review saying too long rubbish i could have watched for much longer dearly would love to have been told more of the future of the players in this movie i highly recommend this the art is superb the dialog smart the characters (except for the kappa) are believable and leave you wishing you could meet them and talk about their experiences yes it is almost 2 1/2 hours but if you found this movie you know your anime and if this is your genre this is a home run yes violence and mild gore and bloodletting but important part of the plot and not over done remember though Tokyo has been thru its share of monsters one that is a foot high could be not that threatening i give this a nine","user":"onlyyoucanhear","rank":[4,6]},{"title":"Okay film about a boy who awakens a river spirit is at times in need of some editing as sequences go on much too long","rating":5,"date":"31 August 2008","review":"A young boy finds a strange rock near a river. After he takes it home and washes it off he finds the water has awakened a small Gappa, or river spirit,named Coo, who moves in with the family. After a couple of adventures they realize that Coo can't stay with the family, and after trip to find a place for him to stay, the media finds out and a circus ensues.<br><br>Five year labor of love for the director is an uneven and much too long story of friendship, family, media and a few other things (the film runs almost two and a half hours). Often lovingly animated this film the film has a couple of beautiful sequences, (the dragon, coo and the dog and Coo and his friend swimming), but at other times its in love with itself with sequences that go on and on and on, usually anything involving the running or driving or chasing. It all becomes just too much, even when it's working. By the half way point I was ready to call it a night with the result the second part shift between the boy and his friend to the media made me feel as if I was watching the sequel to the first.<br><br>To be honest its not bad but the film really should have been better. If only I didn't end the film mostly a desire to trim it down.<br><br>A word of warning for parents, there is a rather violent and bloody sequence at the start (with severed limbs). Its an intense sequence that sets events in motion.","user":"dbborroughs","rank":[10,33]}]