[{"title":"Definitely not the worst movie ever!","rating":6,"date":"23 May 2009","review":"Enough said. People say that this is a rip-off of Eagle Eye. And people say that Eagle Eye is a rip-off of other movies. Echelon Conspiracy, renamed in Singapore as The Conspiracy, may be a rip-off but it does not mean that it cannot entertain. I was entertained by it. The Conspiracy has its own plot but the main idea is from Eagle Eye. It is suspenseful at times as it nears the mild twist.<br><br>The story: The pace is okay. I feel that it could be cut short on some points but anyway, the middle part caught up with the pace. The acting is a bit awkward with some of their priceless expressions. The music is quite good. This is more into a thriller than an action movie so hard-core action fans might be disappointed as it is under the action category. It had misled me into thinking that there should be a reasonable amount of action. It may look like it is a direct-to-DVD movie but it is a lot better than some direct-to-DVD movies.<br><br>Overall: It is not as bad as what a lot of people said. Definitely not the worst movie for me. At least, this tries to be fun. Some movies like recent spoof movies, you can clearly see that there is no effort taken to make the movies. People who like Eagle Eye and cannot get enough of the story, should catch this.","user":"helmutty","rank":[40,51]},{"title":"Eagle Eye on the cheap","rating":6,"date":"6 April 2009","review":"And that's not necessarily a bad thing. After all, let's not pretend Eagle eye was particularly original. It was essentially a warmed over version of Enemy Of The State which was probably based on some other movie I've never seen. Basically what you've got is you're super paranoid information state super computer run amok strategy here. And for the budget it actually works pretty well. The budget is far from shoe-string, but you're not going to see a national deficit's worth of special effects like you did in the two aforementioned films. Let's just all be happy this film proves that there is something that Michael Bay CAN'T get his hands on (and more than like ruin...Friday the 13th,anyone?), shall we? <br><br>The performances are all fine if not somewhat forgettable. Ving Rames succeeded once again in annoying the crap out of me, but that's nothing new. Martin Sheen is an amazingly easy replacement for Jon Voigt (who played essentially the same character in Enemy Of The State). You know, the somewhat power mad head of any given 3 letter intelligence organization (CIA, FBI, FSB, KGB, CBS, etc.) who realizes the error of his ways after everything heads south. Well...maybe not so much for Sheen, but what do you expect? The guy takes the weirdest projects. In any event, Tamara Feldman does fine as the amazingly hot but somewhat pointless love interest/double agent/tougher-than-she-looks chick. If I had one major complaint about the whole thing, it's got to be the simply massive suspension of disbelief required for all but the most hardcore of the tin foil hat crowd. While I too am concerned about the amount of surveillance used by the US government, I am not worried about being tracked by literally everything with a lens. I am well aware that not every single CCTV, traffic, bank, and security camera is accessible by anyone with an internet connection. That's why it's called CCTV...because it's CLOSED CIRCUIT. And since when do Russian hackers have technology that can get the job done better than a multi-billion dollar agency like the NSA? Whatever. It's still not a bad way to kill 100 minutes of your life. Could've used a bigger budget, but it does fine with what it has. Now if I could just figure out who's dumb enough to do anything a text message tells them I'll be set.","user":"Heislegend","rank":[64,88]},{"title":"Doesn't deserve the bad reviews.","rating":6,"date":"30 March 2009","review":"Firstly, let me say that the reviewers giving this film one star can't possibly have seen a truly bad movie. This is by no means mind-blowing, but is a OK attempt at the spy-thriller genre. It brings in some new aspects with regards to storyline, but ultimately coming of cliché'd and slightly cheesy.<br><br>The acting as OK, but i never base a film on it's acting unless it is visibly terrible, which this isn't. However, the scripting could have been massively improved just by taking out the attempted humour, which ultimately fails and leaves the film looking childish. The storyline starts off fairly strongly, and is fairly enjoyable to watch. However, it is clearly a copy of Eagle Eye/other similar films, but with a lower budget.<br><br>It's only let down is when the conspiracy is uncovered, leading to an ending that is resolved in a very cliché manor, which is a shame, as it could have made the movie more enjoyable if new aspects were brought in, giving it a better twist. Also, some of the characters play seemingly, very confused roles, switching sides from 'good' to 'bad' with no real explanation as such.<br><br>However, if you enjoyed films like Eagle Eye, Minority Report, The Island etc etc, then definitely give this a try. It isn't quite as good, but well worth the look if you fancy an easy to watch tech-based film. 6/10","user":"r-chrystal","rank":[67,99]}]