[{"title":"Was not bad","rating":5,"date":"9 November 2008","review":"It wasn't really all that bad. I have watched much worse horror movies than this one. Some bad things about this movie:<br><br>1. Very predictable storyline. 2. Not scary at all, but kind of funny like \"The Hatchet\". 3. Acting is okay.<br><br>But overall its still okay, not as bad as what the other reviewers say. Just a timepass movie. It depends on what you really enjoy watching. If you like to have a laugh while watching a horror movie then I'd suggest you watch these type of films. I usually don't like to scare myself to death while watching a horror flick. <br><br>Hope this helps!","user":"sumana-m21","rank":[16,22]},{"title":"Pass","rating":3,"date":"1 October 2008","review":"I don't usually watch direct to video films, as I guess I have certain prejudice about their quality. However, I made an exception for this one, as \"Joy Ride\" was quite good.<br><br>Well, let's put it this way: I won't be watching any more DTV films (especially sequels) after this one. Here are the reasons why this is bad: imbecilic plot, cheesy film making, zero suspense (compensates, as one could expect, through gore). Theoretically, I shouldn't bother going into details, but I'd really like to protect the fans of the first film from the evilness of this one. - imbecilic plotting (selection): 4 kids in the desert break into Rusty Nail's house and steal his Chevy Chevelle (yep, the man has taste!) as their car broke down in the middle of the desert. For one reason or another, they feel it's just OK to risk messing with a guy who they don't know and might very well be a psycho (weird, old house in the middle of the desert, nobody at home). Oh, and keep an eye on those Peterbilts ! They can go faster than a 60s sports car.<br><br><ul><li>cheesy film making: you can easily notice some scenes with the Peterbilt played fast-forward in order to make it look like it goes faster. Embarrassing. I understand this is low budget, but come on !</li></ul><br><br><ul><li>no suspense: do not expect to find any trace of the high tension in the first film, which was so slickly directed by John Dahl. In \"Joy Ride\", it was about refined photography (ex the red light in the hotel chambers), realistic acting, chilling music, menacing suggestions (anyone remember the one with the camera lingering on the picture on the wall?), enjoyable homages (Hitchcock via the corn chase, Spielberg via premise etc). As I said, \"Joy Ride 2\" is much gorier instead. It brainlessly rehashes some of Rusty Nail's bad habits in the first movie, for ex ripping off the jaw of the people unfortunate enough to stand in his way. Unfortunately, lacking dark suggestion and moody atmosphere, it just doesn't have any effect.</li></ul><br><br>However, there is one scene that will definitely please seekers of intense feelings: ***SPOILER*** the one where the two male protagonists are taken to RN's garage and tortured, forced to throw some dices and each number had it's own 'surprise' for the other one, craved on the wall of the garage. ***END SPOILERS***<br><br>I don't mean to sound overly excited for the first film, it definitely had its flaws: the script had some faulty logics of its own and it was sometimes cliché and predictable (btw, did anyone actually believe the ice truck driver at the gas station was Rusty Nail ???). But trust me, this one will make it look like \"The Godfather\".<br><br>It's just wrong, guys...","user":"Andrei_cinefilul","rank":[23,35]},{"title":"Absolute garbage","rating":1,"date":"13 January 2010","review":"I don't understand why producers, directors, writers, actors etc. get involved in such absolute garbage as films like this.<br><br>I can only think they do it because they know there must be some people who think that this film will be worth watching and they can make some money. What I mean is, the photography is good, the sound is good, even the camera work is pretty good, but the story line is such total rubbish. The characters are totally unbelievable especially the irritating guy with the metal rings in his lip.<br><br>Who would go into a truckers restaurant and start talking in a loud voice and disrespecting truckers? It's just so totally unbelievable.<br><br>This is one of those films that I have to watch just to see how bad it gets.<br><br>Half an hour later: It's so bad I've decided to watch David Letterman instead. I worry about the mental stability of people who write such sadistic garbage as this film. I hope they have nightmares.","user":"mboyd1986","rank":[10,14]}]