[{"title":"Amazing watch even after 9 years","rating":10,"date":"5 March 2019","review":"Yes. I had watched this movie back in 2010 when I was in school. Didn't understand much, but I was blown away by the visuals.. But now watching in 2019, it all makes sense and the visuals are yet world class. This movie was ahead of its time.<br><br>Worth watching!","user":"tron-legacy01","rank":[71,74]},{"title":"Art.","rating":10,"date":"17 July 2019","review":"TRON: Legacy is a literal misunderstood masterpiece &amp; is one of the most intellectual, deepest science-fiction movies I've seen Disney produce - EVER! Let me explain:\nImmediately, CLU has strong, deliberate similarities with Hitler - they both wanted to create \"the perfect system\" &amp; viewed those in their society who were similar to themselves as superior, where individuals are only deemed valuable if they can be used to further implement &amp; reassert the oppressive structures in place.<br><br>In TRON, any program deemed useless or unfit for work is sent into \"the games\", where they're to be slaughtered for the amusement of less \"disposable\" citizens - disabled / programs unable to be \"rectified\" are lesser &amp; have no place in this system CLU has created. It's as if those who cannot contribute, may rebel or show resistance cannot be allowed to exist &amp; so only the obedient, functioning rectified ones remain.<br><br>This is a symbolic representation of a fascist regime where those ruled under it are controlled by fear &amp; intimidation - \"rectified\" programs are representative depictions of people who are brainwashed by a system &amp; further explains why those who can't be are sent to their deaths. Any imperfection is prohibited &amp; made an example of - uniformity is essential &amp; total, unquestioning loyalty to the cause is expected. Again, noticeable connotations are made in order to reflect Nazi Germany; CLU commits genocide by wiping out the ISOs who represent / relate to the Jewish population within 'Legacy' &amp; there's a resonant message of defiance throughout the film.<br><br>It's also a metaphor for mental health - with CLU depicting the worst of humanity &amp; what it's capable of when a mind is corrupted by power &amp; greed, embodying the darkest side of ourselves. Additionally, on the opposite side, Kevin Flynn is in a state of depression when we first meet him again in the movie - he's been battling his demons &amp; has given up, justifying his lack of action by saying \"the only way to win the game is by not playing\" but Sam Flynn challenges his problematic ideological attitude &amp; his son visually journeys into the mind of his father (who hasn't been there for him throughout his childhood because he's lost himself inside his own head) in order to regain a relationship he missed out on as he was growing up in order to save him, battling his demons alongside him so he can bring him back out into the real world, teaching him that by resigning himself to what he deemed as inevitable, he only allowed the darkness inside the Grid (a metaphor for his mind) to grow &amp; spread like cancer. These two themes intertwine when Sam goes against his father's wishes by fighting - sparking what would grow to become genuine character progression of Kevin.<br><br>Sam meets other members of the resistance &amp; begins to fight back &amp; only when his life is in danger does Kevin realise that not only do his inner demons pose a risk to himself, but those he loves &amp; others around him, so his supposedly harmless inaction is shown to have consequences, forcing his hand &amp; beginning his journey of recovery. Hence - linking back to politics - it also signifies that the only way for a fascist state to thrive is when good people do nothing - they are complicit in the actions of CLU by allowing him to continue without resistance. Fascist states are vulnerable &amp; fragile &amp; when people rise up against them, they crumble. Hence, it reaffirms this point when CLU's plan is immediately jeopardized once people act.<br><br>As Kevin &amp; Sam battle corrupted programs &amp; CLU, they head towards their escape - a light that shines brightly through the darkness at the end of a tunnel (another metaphor for depression). It's at this point when Kevin realises that the only way to save his son is by confronting his fears, face to face, coming to terms with who he is &amp; what he's capable of, what kind of person he has the potential to be &amp; makes a choice to embrace the light again instead of resigning himself to the darkness. He sees the danger he poses to those he loves if his darker self isn't stopped &amp; so sacrifices himself, visually embracing his darker side (coming to terms with it) &amp; overwhelming it with light in the ultimate show of love towards the child he never got to see grow up. By doing this, we're led to assume that he dies but he neutralises the threat &amp; redeems himself in the eyes of his son. It's a total act of redemption; a father battling his depression &amp; being trapped inside a prison of his own making for years - how those suffering are able to win if they accept help &amp; don't fight the battles they have to face alone when there are those willing to support surrounding them.<br><br>Kevin Flynn starts the story as powerless &amp; concludes as powerful. It's about family &amp; incorporates socio-political themes brilliantly. Even more genius, CLU didn't understand humanity &amp; that's poetically what saves it - he was unable to understand that there is no such thing as \"perfection\"; it's subjective &amp; thus his system is ironic due to the basic flaw in what is supposed to be perfect. It shows how easy it is to topple such a regime once that flaw is exposed; it's a weakness - not a strength - &amp; individuality is what makes a society strong; CLU's misguided idea about this ultimately leads to his demise. He doesn't understand because he's made himself into less of a reflection of humanity than intended, so can't foresee what his opponent Kevin will do for love as love isn't a concept he considers or acknowledges due to his lack of humanity. He's absolved himself of any trace of it in order to become \"perfect\" but it's a pathetic fallacy.<br><br>The darkest side of humanity acts upon irrational thoughts, sometimes selfish or cowardly &amp; sometimes from an unintentional misinterpretation of unclear information. Once we look at things from an objective point of view, we see the cracks in the logic &amp; only upon self reflection can we change ourselves for the better. We're reminded of that here.<br><br>Not to mention, it's worth noting the beautiful direction from Joseph Kosinski (unbelievably, his first ever feature film!?) - who does an astounding job of crafting such a subtextually rich tale - &amp; appreciating the faultless, sleek, stylised visuals - honestly, jaw-droppingly GORGEOUS &amp; effective cinematography from Claudio Miranda - who leaves you in awe of the aesthetic &amp; his meticulous use of light while watching &amp; visually, it's undeniably one of the most iconic, inventive &amp; distinctive movies I've ever seen with groundbreaking visual effects, world building that's phenomenally immersive from the moment you step foot within it - with masterful, artistic hair &amp; make-up, sound &amp; costume design &amp; additionally, production design - as well as the electrifying score by musical legends Daft Punk who craft one of the best soundtracks for any movie in history... TRON: Legacy was a gift to all who've been longing for an original sci-fi franchise &amp; most of y'all slept on it. It's an utter travesty.","user":"ollywill-08723","rank":[50,54]},{"title":"Touching Spectacle","rating":8,"date":"20 December 2010","review":"It's not highly likely to win many new converts, but for those who already like the original and want to see more of that world, it more than satisfies. The visuals are a wonderful evolution from Tron and the story of a father and son who have to make up for lost time is very touching. The CGI face they developed for Jeff Bridges is not perfect, but it works very well with just a few exceptions and I feel, for my own tastes, that they have actually bridged the uncanny valley with this one. Still a bit of work to get it perfect, but this one works as it is. Oh, and the score by Daft Punk is beautiful. The first thing my brother and I did after leaving the theater was buy the sound track on the way home. It's very suggestive of the original but with plenty of today's newer sensibilities mixed in.","user":"garlonuss","rank":[70,81]}]