[{"title":"A murder-mystery that offers an intriguing insight into the complexities and brutalities of Cold War relations between the US and Taiwan.","rating":8,"date":"5 September 2009","review":"I didn't know what to expect with this film. Murder-mysteries are not generally my thing, but this one pulled it off with a truly insightful look into Taiwan in the early 1980s. Objective viewers of this movie will appreciate its fresh perspective on a sometimes tired Cold War theme.<br><br>Rather than presenting a documentary explaining the compromising complexities of relations between the US and its less-than-democratic allies in Taiwan in their fight against the \"Reds\", Formosa Betrayed hooks the viewer with dramatic events that keep us waiting to peel away the layers of characters we see to figure out what's going on. In the process, we learn of their individual hardships, heartaches, and disillusionment; as well as their hope, courage, and betrayal. While the limited depth of some characters may leave viewers wanting more, the basic story keeps us captivated.<br><br>Formosa Betrayed does a good job of piecing together scenes in a modified chronology of events to provide an enticing but very smooth flow. Attention to details like uniforms, posters, architecture, and nature provides scenery that keeps us transported in the appropriate space in time. Combined with these elements is an excellent soundtrack that completes a well-done film.<br><br>While the story's plot - like its characters or the actors that played them - could have been sharpened to provide more astute answers to the many questions that are raised, it makes me think there is room to explore similar themes in the future.","user":"eiggsmith","rank":[49,58]},{"title":"Not a documentary. For non-Taiwanese","rating":10,"date":"16 August 2010","review":"Its not hard to understand why some people took the movie as offensive. Although not a documentary, the movie has events that actually occurred in Taiwan's recent history. Those brought up under KMT's propaganda can't believe such capable government can do such nasty things behind people's back. :D<br><br>There are so basic facts about the movie.<br><br>1. Not a documentary: Inspired by actual events, but not actual events. 2. For non-Taiwanese audiences: Or those not-familiar with Taiwan and her background. This \"Free China\" was backed by the US to fight communists but at the expense of severely restricting human rights in Taiwan. 3. Not actual scenes: Unfortunately, due to funding and the political situation in Taiwan, the set needs to be filmed elsewhere than Taiwan.<br><br>This movie is a must-see for those who wants to know more about Taiwan and even for those who knows nothing about Taiwan and wants to know the island that makes everything in the 70s and 80s. People who calls it a propaganda is probably afraid of viewers will become interested and search for more info on the background of Taiwan, especially those times under the rule of KMT. Human rights and justice are universal common values, however, the Taiwanese people was not able to enjoy such.","user":"borcheng-816-65201","rank":[16,17]},{"title":"One of the best political thrillers I've seen in a long time","rating":10,"date":"11 September 2009","review":"Saw this film at the Montreal Film Festival. I think it's one of the best political thrillers I've seen in many years. Did not know much about the history of Taiwan, but the film brought me back to the early 80s with it's Cold War references. The cinematography was excellent and you felt the film was epic in scope. <br><br>Was particularly impressed by the performances. James Van Der Beek makes a starring turn as FBI Agent Jake Kelly. He does a great job carrying the film. Wendy Crewson and John Heard remind me of many bureaucrats I've met over the years. Will Tiao gives a heartbreaking performance as Ming, the waiter/dissident. What happens to his character is so devastating it made me cry. Reminds me of Haing Ngor's performance in \"The Killing Fields.\" The rest of the supporting cast is outstanding. <br><br>In fact, this movie reminded me a lot of \"The Killing Fields\" which I think this movie is for Taiwan as that movie was for Cambodia. Definitely a must see film if you love political thrillers.","user":"tywang80","rank":[68,84]}]