[{"title":"Finally Portrayed as the Warrior she is","rating":10,"date":"7 March 2009","review":"Would just like to disagree with previous comments because i really enjoyed this movie.This time around Wonder Woman was not portrayed as pageant queen with a rope but as a powerhouse warrior.She is not a bouncy beauty queen in a swim suit,she is an amazon.They are born for battle and raised to fight for the greater good.This movie stayed so true to the origin and even gave the characters more personality.She is one kick ass broad and her character in the film could have just as easily been male.Wonder Woman is an icon and a very strong woman who while being kind hearted also knows how to be tough when needed.i recommend this movie to anyone who loves comics and the character and I'm a really picky person when it comes to my DC characters.","user":"brandon_maze","rank":[49,57]},{"title":"Wonder Woman: Considerably better than I expected","rating":8,"date":"8 January 2018","review":"I've never been a Wonder Woman fan, the ridiculous outfit always put me off much alike Superman and at time of writing haven't even watched the live action Gal Gadot film<br><br>For this reason I went into this expecting very little so found myself blown away by just how good it is.<br><br>Essentially an origin story it follows Diana from birth through to adulthood and her double pronged first mission to return a pilot to the world of man and to defeat Ares God Of War who has escaped confinement.<br><br>It never fails to amaze me how good the voice talent is in these things. Here we have Keri Russell, Nathan Fillion, Alfred Molina, Rosario Dawson, Marg Helgenberger, Virginia Madsen, David McCallum and one of my favorite actors Oliver Platt.<br><br>They do a fantastic job here as do the animators and the writers, I really enjoyed this. Is it ground breaking? Hardly, but considering it was a movie about a character I don't much care for they really knocked it out of the park.<br><br>The Good:<br><br>I love greek mythology<br><br>Very well written<br><br>Great voice cast<br><br>The Bad:<br><br>I still can't take the invisible jet seriously<br><br>Things I Learnt From This Movie:<br><br>Don't believe the lies about the stork or the sex thing, my eyes have been opened! Babies are molded from sand.<br><br>Fighter jets float<br><br>The man who created Wonder Woman was born in the 1800's, let that sink in<br><br>Heroes have no appreciation for property damage<br><br>Being attacked by a god causes instant sobriety<br><br>The question who ate all the pies has been answered, it was hades","user":"Platypuschow","rank":[15,16]},{"title":"I did not expect to like this movie so much","rating":9,"date":"3 April 2009","review":"Since over two decades ago,it has been contemplated the idea of making an adaptation of the comic Wonder Woman (a creation from the psychologist William Mourton Marston).The most recent attempt was made by director and screenwriter Joss Whedon,until the classic \"creative differences\" between the filmmaker and the Warner Bros. studio finished the project when it was on pre-production (I suppose the writers' strike during late-2007 and early-2008,plus the recent economical crisis,have also influenced on that).However,on the straight-to-DVD universe,an excellent animated version of Wonder Woman was made.Like some other animated movies made straight-to-DVD (like Justice League : The New Frontier and Superman Vs. Doomsday),Wonder Woman has been made with little resources but a high level of creativity and fidelity to the original comic.I have found this humble animated film to be way superior to some \"real\" movies about superheroes,whose elevated budget for some reason avoids them of making something innovative or unexpected.These straight-to-DVD films may not be too accessible to the casual spectators,because they are all designed to the comics reader who does not look for a \"movie for kids\",but a solid adaptation whose porpoise is not selling toys,but respecting the legacy from the character.And I admired to see that Wonder Woman took that attitude.In other words,we will not find on this movie the cheesiness and simple villains from the sympathetic TV series starred by Lynda Carter because the movie is completely respectful to the comic,which had offered subjects about mythology,honor,violence and the eternal battle between sex.I have to say I did not expect to like this movie so much.The most important elements from this great movie are a solid screenplay and a brilliant cast of voices.The screenplay was crafted on a mature and intelligent way.Plus,it is not afraid of including some decapitations and a more audacious language than the one we could expect on an animated movie.But the best element from the screenplay is that the personality,tone and style of the characters are so well defined that the movie achieved a dramatic level I did not expect to receive.As I previously said,the cast of voices is also brilliant.Keri Russell brings the necessary level of intensity and humor to the voice of the main character.Nathan Fillion also made a very competent work and finally,Alfred Molina made a brilliant work with the voice of his character (I would have never recognized it was his voice the one from the character !).The only fail from this movie is that the animation could have been a little bit more polished on some occasions.But,in spite of that,I liked this movie very much.As I said,I do not know if this is a movie for the casual spectators,but I recommend it with confidence to the people who decide to see a different animation movie.I found it enormously entertaining and very satisfactory.","user":"Argemaluco","rank":[32,39]}]