[{"title":"Bold but boring and so bleak","rating":20,"date":"20 November 2011","review":"Only months after I read the 1847 Emily Brontë novel and saw the 1993 film adaptation, along comes yet another version of this enigmatic work. Director Andrea Arnold has taken a bold approach to her interpretation that, like all movie representations of books, has its strengths and weaknesses.<br><br>The boldest feature of the film is its casting of Heathcliff as black (Solomon Glave as the youngster and James Howson as the self-made man). Brontë describes Heathcliff as notably dark and Arnold - who co-wrote the script - has taken the character a significant step further in a manner which underlines Heathcliff's difference from the country folk. The accents are well done with young Cathy (Shannon Beer) perhaps better than older Catherine (Kaya Scodelario). The photography is wonderful with stunning views of the Yorkshire Dales (such a contrast to the more frequent very tight shots) and the sound is brilliant with a real sense of the wild natural setting.<br><br>Set against these undoubted virtues, it has to be said that the dialogue is so sparse (and sometimes muted) that, unless one has read the novel, it's often unclear what's going on and, even if you've read the novel, you sometimes yearn for the film to get a move on and, while some of the exchanges are taken straight from the novel, others are so crude that one cannot imagine Brontë ever penning such vulgarities. The leisurely pace means that, like all except the 1992 version, this one can only deal with the first half of Brontë's uncomfortable, indeed bleak, tale, so that one does not see the full, sustained vindictiveness of the anti-hero.","user":"rogerdarlington","rank":[43,49]},{"title":"Dark, Unlikeable, Violent and .... er .... Smug?","rating":6,"date":"1 December 2011","review":"Like other reviewers I have read Emily Bronte's novel, but I am not sure we were reading the same book. My strongest impression from first reading was wonder that the book could be so engaging without a single character with whom to identify.<br><br>The characters in Wuthering Heights are unlikeable; Heathcliff and Hindley are downright nasty. Hatred, contempt and jealousy are the overriding emotions of the story. Certainly there is love – strong passionate love too – but it lives in dark corners and is ultimately destructive.<br><br>This film captures much of the emotion of the book. The first half, with Heathcliff, Catherine and Hindley as children is played very well indeed.<br><br>Heathcliff's character is determined in these early years at Wuthering Heights, and so it is in the film. When Heathcliff returns as an adult, inexplicably played by another actor, his heart has hardened and revenge, hatred and violence dominate his character. But James Howson who plays the adult Heathcliff is not up to the task, and nor it appears is the direction. Heathcliff is certainly violent, but this is mostly directed against animals seemingly as means of relieving his frustrations, rather than the depiction of a genuinely violent man. His appalling treatment of Isabelle is largely glossed over and the film ends before he starts abusing Hareton. Hatred, contempt and jealousy are expressed mainly by close-ups of facial expressions, and here Howson in the finery of his wealth only seems able to portray smugness.<br><br>The film lacks a point of view. The camera-work suggests the film is intended to show things from Heathcliff's perspective, but much seems to be deliberately obfuscated where Heathcliff would have known exactly what was going on. The audience is continually kept in the dark, emphasised by the rain, mist and long nights on the moors and, just in case we haven't got the idea, by repeated scenes shot out of focus. This is all very well, adding to atmosphere, but the book manages to bring the reader into the story; this film seeks to distance the audience, as voyeurs only. The people we see are the same people we read about and with much the same character. The children, it is true, were interesting to watch; but when Heathcliff went away, returning without comment played by a different actor (and Catherine too for that matter, but Kaya Scodelario played her role better; she had less to do), I found I no longer cared about any of them.<br><br>Heathcliff played as a black man works well. He is clearly of foreign extraction in the book – Who knows but your father was Emperor of China, and your mother an Indian queen – although equally clearly not 'a regular black' (also a quote). A black Heathcliff is far more convincing than an obviously white English one.<br><br>The language is also rather more 'colourful' than in the book. But this too seems to be justified. It sounds true enough to me and I did not detect any neologisms. It must be pretty impenetrable to non-native English speakers, but there is precious little of it. I know Heathcliff is taciturn, but the silences are unbearable. Even the book has Nelly Dean to carry the dialogue.<br><br>Finally there is the ending. The book more or less describes the story backwards, starting long after the film has ended and showing Heathcliff in his ultimate form. The film, quite rightly in my opinion, is in chronological order (barring some unnecessary and distracting flashbacks) and covers only Heathcliff's relationships with Catherine and Hindley. The ending is well chosen in terms of plot, but totally undermines whatever integrity the film had, for the entire film is shot without a background soundtrack. What we hear are the sounds of nature, songs being sung, out of tune and out of time but utterly in character. A poor band playing a mournful Christmas hymn (the Coventry Carol, is it?), branches tapping on a window, even though this last does not sound quite right, all add to the film's bleakness. But then, with only about a minute to go till the end, there intrudes a modern song played on modern instruments in a studio. I quite like Mumford and Sons, but what on earth is that song doing there? At least it could have started after the credits began to roll; the mood destroyed, this is one film I did not stay to read them.","user":"UncleJack","rank":[72,90]},{"title":"ridiculous","rating":3,"date":"30 January 2013","review":"This adaptation is a valiant effort to depict the 'dark' side of WH. The dark side that anybody who has read it knows about. For this reason, the film was void of purpose. Shrouded in real animal slaughter (true), over sexualisation of the innocence of C&amp;H's youths, and necrophilia, this film quickly became nothing more than that shocking viral video your friend enjoyed too much ages ago. <br><br>If the book had never been written, this could be acceptable. Sadly, the book is a tad bit of a classic. If you have not read WH, please do not watch this film. While trying to display a deeper WH, an already difficult task, the film has become a shallow and ultimately senseless waste of a couple of hours. The plot is bastardised, the characters make no sense, and the 'artistic' approach to film always winds me up anyway. <br><br>Watch the black and white Hollywood version. They new how to follow a plot.","user":"jack-twiy","rank":[14,15]}]