[{"title":"A very accomplished movie","rating":8,"date":"16 July 2008","review":"It's really nice to stumble upon good movies when you don't expect it. Nowadays, we are becoming more and more guided by the marketing that goes behind the movies, to realize when we actually go see them that we are often left unsatisfied.<br><br>Felon is a movie about a man who is working hard to create a life for himself and his family, he has worked hard to establish his own business and feels as though he is finally ready to start reaping the fruits of his labour. Then, life brings a unexpected twist and he finds himself in prison. From this point on, we see transformations of a man who is forced into a new world where he has no control.<br><br>This movie is a great glimpse of the extreme conditions that the American correctional system can create. It also displays very well how people can get corrupted by power. All the actors in this movie shine and portray perfectly their characters. The story is very well told and by the end of the movie, you are left reflecting on how the correctional system has so many flaws and how it drives people to become their worst, both as inmates and as guards. However, the film also shows that even in these circumstances, there are great acts of humanity and compassion.<br><br>A very good movie, definitely worth the watch. 8/10.","user":"a_aleksan","rank":[232,254]},{"title":"Excellent","rating":8,"date":"19 July 2008","review":"Most prison movies are essentially the same story told with different characters. Usually the protagonist is convicted of a crime (which he did or did not do), is sent to prison and finds that they have to either adapt to their brutal new surroundings or die. Allies are won, enemies are made, death lurks around the corner. \"Felon\" is no different but three things raise it above most others.<br><br>First is the setting. Filmed at the New Mexico State Penitentiary, the movie carries an air of authenticity and gritty realism that movie sets simply can't provide. <br><br>Next is the casting. Stephen Dorff has always been a very underrated actor and here he provides a wonderful portrayal of a man let down by the legal system and cast adrift in a living nightmare. His descent from upstanding family man to an enraged prison inmate with fire in his eyes and blood on his knuckles is perhaps predictable but Dorff sells the portrayal to the audience completely. However, Harold Perrineau and Val Kilmer are the real stars here. The first (whom avid fans of the television shows \"Lost\" and \"Oz\" will already be familiar with) offers a great performance as Lieutenant Jackson, a happy family orientated man outside of prison but a monster within its walls. Kilmer, meanwhile, is John Smith, the philosophical but potentially dangerous convict who comes to befriend Dorff's Wade during their time together. <br><br>The third and final ingredient that ensures \"Felon\" impresses, is the passionate directing by Ric Roman Waugh who also wrote the screenplay (based, apparently, on events at the notorious Californian State Prison). With the help of some incredible editing, the movie powers along at a frantic rate and rarely gives the audience time to breathe. If the ending is somewhat contrived, you can forgive it because the journey to reach the conclusion was so intense.<br><br>Highly recommended, especially for fans of \"The Shawshank Redemption\", \"The Big House\", \"An Innocent Man\" and \"Lock Up\".","user":"Mr_Saxon","rank":[160,187]},{"title":"Excellent!","rating":8,"date":"17 July 2008","review":"I was lucky to see a screener for this film. At first I wasn't expecting much as the last film I saw with Val Kilmer-Conspiracy-I shut off 15 minutes into it in disgust.<br><br>Felon, is an excellent film with great acting, a great plot and good dialog. This is by far the best movie I've seen Stephen Dorf in and Val Kilmer gives a solid performance. While the storyline flirts with typical prison antagonists and a pseudo-familiar plot the story is very realistic and highly believable.<br><br>Lots of suspense, good solid action, excellent cinematography and great acting make this film a must see for drama/suspense fans. Its great to see Val Kilmer resuming his place as one of the best actors of his generation.","user":"ryan-1237","rank":[168,200]}]