[{"title":"Did a 5th grader write this?","rating":4,"date":"8 December 2019","review":"The answer is no... they would've done a better job. Two writers - amateur Johnny Martin Walters in his first ever writing credit, I can cut some slack, but there is no excuse for seasoned writer Chad Law to allow such an atrociously dialogued screenplay make it to the cameras. Then there was the plot-hole riddled convoluted and infantile story. There was more smoking cigarettes and cigars than action, you'd think this film was financed by Marlboro.<br><br>Casting Seagal is what you'd expect in his performance, only less and less action from him the more films he's in. I really wish he'd stop that annoying whispered dialogue thinking it makes him more \"hey boss\" mobster-ish. And enough with the hair color and hair plugs already, it's getting hard to take him serious anymore. All other casting and performances were decent, with Johnny Messner being the stand-out.<br><br>Directing by James Cullen Bressack was adequate, some decent camera work, but also bad choppy action {of what little there was} scenes. Cinematography was decent, and the score bearable - it was annoying, out of place and overbearing in some parts of the film.<br><br>Even if you're a fan of Seagals, don't expect to see him much in this film, let alone any more than 1 min total of him in action. The rest of the film he's drinking, smoking stogies, and whispering. It's a generous 4/10 from me.","user":"TheTopDawgCritic","rank":[25,32]},{"title":"Snoozefest","rating":1,"date":"9 December 2019","review":"Absolutely awful, Steven segal needs to stop making movies so idiots like me cant watch them.","user":"lesuperchef","rank":[21,29]},{"title":"All Around Poor","rating":4,"date":"8 December 2019","review":"Poor filming, poor directing, poor acting, poor fight choreography, poor script, poor continuity, poor character development, poor concept. I used to be a Seagal fan, but I am finally realizing he has nothing left in the tank. Was hoping for at least a watchable and somewhat entertaining film. Unfortunately, my expectations were not met in either case.","user":"lordofcb","rank":[9,14]}]