[{"title":"Nothing Noteworthy","rating":5,"date":"30 March 2010","review":"This is basically another story of a group of young people who head off to have a good time but find themselves stalked by a maniacal killer. The story is told by flashback, as the sole survivor relates what happened on the secluded island the group had sailed to. So the overall story isn't especially original. It is, however, a pretty good mystery, and there's no obvious solution to the mystery until rather late in the movie - and, even then, what seems to be the solution has an unexpected twist thrown in. The performances in the movie are decent - perhaps a bit better than what you normally find in these movies. Because it is so unoriginal, the whole thing seems to drag a bit at times as you wait for the mystery to be revealed. So, there's nothing especially noteworthy about this. It's OK, but the story has been basically told before - and many times before.","user":"sddavis63","rank":[29,40]},{"title":"Fear Island","rating":2,"date":"7 January 2012","review":"The other Duff sister gets her own slasher vehicle, a real dud with a twist you can see coming a mile away. A group of hot-looking college kids decide to yacht to a nice island retreat for some partying which turns sour really quickly when a killer, with a reason for his/her vengeance, ruins the festivities, murdering them one by one, leaving \"clues\" as to why each member is a victim, words in white paint, like INNOCENT and GUILTY. It all could be the result of a cruel sex prank played on an attractive but unpopular nobody in their school who went missing shortly afterward. The movie goes back and forth between a detective and psychologist questioning amnesia-stricken Hayley Duff and her reports (as they return to her supposedly in fragments told in jarring flashbacks) and the events that supposedly transpired during the death weekend on Fear Island. The movie pretty much casts doubt on Duff immediately because Haley isn't much of an actress who can play a tragic victim that convincingly or maybe it was the poor direction which never allows us to believe she is telling us the whole truth. I rarely believed much of anything the flashbacks were telling me and the psychologist, who seems to be on her side at first, while the detective is hard-nose-to-the-grindstone with her at the onset soon thinks she might be a victim instead of killer (which tells you how stupid his character is as I'm no detective and Duff practically has guilty stamped on her forehead due to her fishy, suspicious performance), denounces large pieces of her fractured testimony as not wholly matching the evidence recovered at the crime scene. Yet, this slasher film expects us to swallow the conclusion where the psychologist, who has reservations about Duff's innocence, actually accepts a drink from her before the parents are about to arrive, just proving that someone who is skilled at reading behavior doesn't seem so smart when it matters most. The scenes on the island are of the tiresome PG-13 variety, with characters right out of a I Know What You Did Last Summer sequel. None of the kill-scenes will leave you very overwhelmed..a rattlesnake bite to the chest is really as gory as it gets as most of the deaths are of the off-screen variety. Boring, with zero thrills, \"Fear Island\" will induce heavy snoring.","user":"Scarecrow-88","rank":[7,8]},{"title":"The most unusual suspect","rating":5,"date":"27 May 2012","review":"**SPOILERS*** Brain twisting slasher flick that runs out of gas halfway through its story when you start to realize that the only survivor of a massacre on Fear Island is on the verge of being committed.The survivor Jenna, Hayfie Duff,was found wondering aimlessly around the deserted island with a bloody knife on her. Having no memory of what happened and even whom she is Jenna is interrogated by both local detective Amory, Martin Cummins, and police psychiatrist Dr. Jamie Chalice, Anne Marie DeLuise. Suspcted in the brutal murder of six collage students on the island as well as their pet dog Perrier Jenna's memory slowly starts to come back in a series of episodes or flashbacks where we as well as Det. Amory and Dr. Chalice start to make some sense of this tragedy. The only problem is that they have to take Jenna's word on what happened to the students since no one else is alive collaborate it!<br><br>As the movie goes on or plods along that suddenly almost out of the blue a new element or character is added to it in the young girl Regina, Brenna O'Brien. It's Regina who turns out to be the key to what happened in the movie but as we soon find out she's been killed off before the film even started! It was Regina's death that set into motion the series of brutal murders on the island. But who committed them only Jenna in her subconscious mind knows. And as her memory starts to return she'll be able to identify who the killer is that's if the killer doesn't get to her first!<br><br>***SPOILERS**** The big surprise is saved for the very end when Jenna's parents who were on a trip to Cambodia came to the hospital to visit their very disturbed and heavily medicated daughter. It's then that the whole truth came out to what Jenna knew about the string of killings as well as who she really is. But by then most of us watching had figured that all out making the big and unexpected \"surprise ending\" anti-climatic.","user":"sol1218","rank":[4,4]}]