[{"title":"Profoundly sensitive and instructive movie for those with AS and without","rating":9,"date":"14 February 2010","review":"I've needed to see this movie ever since I heard about it's existence, unfortunately it was not given a proper release in the UK, so I had to wait for the US DVD to come out. It's a film about a relationship between a man with Asperger's Syndrome (Adam) and a young woman (Beth). As I have Asperger's Syndrome and I heard that this movie was well made I was understandably interested. I have tended in the past to find movies and TV shows portraying autism absurd. Fortunately this was not the case here.<br><br>The level of observation here was really very good, small things like how Adam doesn't look at people in the face, how he becomes agitated at work over comments that his boss makes that are meant to be humorous or confidence building (I am used to blank stares from my performance planner when I take things the wrong way).<br><br>At one point Adam trembles behind his bedroom door when he is being asked to come out to a social event from the other side, pretending he is not there. I've done that myself. He reminds me of me when I was at university. Food fads is another, Adam has Macaroni Cheese every night of the week. Currently I have a chicken Kiev with raw mushrooms and yellow peppers pretty much every night of the week.<br><br>Although he's very talented, he only managed to get the electrical engineering job he holds via his father convincing the boss to hire him. I was never able to convince anyone that I was worth hiring, even though I have a degree from Oxford. After several terrible years following university, I managed to get a job in an office where the head of the office was my brother-in-law. I can do the job well, and am even being promoted, getting in the door is the hard part. In the UK at least, employment rates for people with Asperger's Syndrome are upsettingly low. The idea of selling oneself in an interview doesn't work, and when you're up against people who will bend the truth to get ahead, it's really difficult. That's another good thing the film picked up on, honesty. If you're tired of guys lying to you ladies, pick up an Aspie.<br><br>I was personally moved a lot by the beginning of the movie and the end of the movie. There's an excellent introduction using the story of Le Petit Prince (The Little Prince) by Saint-Exupéry as a metaphor. I knew at this point that it was going to be a good movie, it is perhaps the most tactful and tender approach to the subject that there could be. I won't spoil the ending of the movie, but from reading what other people have said, it's very easy to mistake what is happening, obliquely, I will recommend that you concentrate on an incident concerning boxes.<br><br>I'm a few years older than Adam, and readier than he is, but love has never come my way, as there are not many Beths out there, and being 6ft 7 tall and also stocky I am not exactly of the \"non-threatening male\" physique typified by Hugh Dancy in this movie. My way of boring people to death with over detail is film, and even though I know that people don't want to know I will still start telling them about the history of film starting in 1888 (or if I'm feeling more loquacious, starting with Muybridge). The stupidest cosmological one I do (like Adam), is explain how novae happen in binary systems with a red giant and white dwarf. More recently I have started telling people why Sirius flickers ;) People think I am trying to make them feel stupid or inferior, which is absolutely not the case, but I still do it even though I know this, I just can't stop myself.<br><br>As an autistic, I felt that this movie was extremely tender, but also very educational and instructive, I felt almost like I was a chick being feathered off a tree limb for the first flight. \"Adam\" does not aim at staggering mise-en-scene, it is not an Antonioni movie, but it is possibly the worthiest film you can see. The worst thing about Asperger's is that there are many people who will tell you, even straight to your face, that it doesn't exist, even a doctor I knew was pretty much of that opinion. People associate mental disability with physical impairment, and because there is none with Asperger's (except sometimes clumsiness, or \"gangliness\"), for a lot of people it just doesn't register, even though there are defined and recognisable developmental symptoms. This film, in a way, is an acknowledgement that it does exist, and is proof if ever I was cynical enough to believe otherwise, that films can change the world.","user":"oOgiandujaOo_and_Eddy_Merckx","rank":[131,136]},{"title":"Realistic, well-written portrayal of a frequently misunderstood subject","rating":7,"date":"20 August 2009","review":"As someone who actually does suffer from Asperger's Syndrome, it is easier for me than it might be for some people to understand and relate to many of the things that Adam says and does. I have been apprehensive in the past about viewing films that deal with this sort of subject, as I have learned that many of them paint stereotypical, unrealistic, and occasionally belittling portraits of people in my place or other similar situations. I was pleasantly surprised upon viewing this, as it really hit home in many ways. I often found myself saying \"this reminds me of me\" when watching Adam live his life from day to day (though we are very dissimilar in that I would never have a tantrum in front of a girl). Finally, this is quite possibly the most down to earth movie of its kind, as there is nothing that happens in it that cannot or is overly unlikely to happen in real life. Unfortunately, I cannot give it a perfect rating, because as impressive as its portrayal of Asperger's syndrome is, the story itself is weak and uninspiring and not as compelling and heart-wrenching as it ought to be.","user":"g-zimmerman1","rank":[112,123]},{"title":"The Prince and The Pilot","rating":8,"date":"8 September 2009","review":"Greetings again from the darkness. The first feature film from writer/director Max Mayer is terrific! It is what makes indie films such a treasure ... a small, little personal story that packs a wallop.<br><br>Many will remember Hugh Dancy from King Arthur and Jane Austen Book Club. In both, he was eye candy for the girls. Here he stretches his acting chops as Adam, who lives with Asperger's Syndrome. At first, he just strikes us as a guy with no real social skills. It's not until he meets his new neighbor (Rose Byrne) that we begin to understand why he's just not quite right.<br><br>Watching their relationship grown in a believable way is a tribute to both actors and a very solid script. A few sub-plots are juggled: death of a parent, living alone, loss of a job, etc, but the key to the film is the relationship and how it keys in our need to connect.<br><br>This is the type of film I wish more people would get a chance to see. It has so much more to offer than the over-hyped Hollywood junk that gets forced down our throats at the local megaplex. Adam won't crack the $200 million gross, but Adam will have an impact on you and create some interesting after-film discussion. Isn't that the real fun of movies anyway?","user":"ferguson-6","rank":[73,82]}]