[{"title":"More historical reconstruction than drama as such","rating":7,"date":"11 January 2011","review":"The parts that were historical reconstruction were good, where they invented characters and drama it was weaker. It's good that this story has been told in a surprisingly historically-accurate way.<br><br>On questions of historical accuracy, and correcting inaccuracies that other reviewers have said about the film:<br><br><ul><li>\"Anti-Christian bias\". In fact Amenábar has gone out of his way to be negative to the other religions, to create balance. For example, pagan persecution of Christians, as shown in the early scenes, had ceased a hundred years before Hypatia's time. Even then, being Christian never appears to have been actually illegal in the pagan empire, although Christians were universally despised. The stories of Christian martyrs are too frequently overblown propaganda stories invented during Hypatia's time when the empire was starting serious persecution of pagans. The martyrdom of St. Katherine of Alexandria is often considered a Christian re-working of the Hypatia story with the religious affiliations reversed.</li></ul><br><br>-Some people have falsely said there were no positive Christian characters in the film. There are very many. Of the main characters, there are more positive Christians than negative. Certain people seem to think that any negative statement about any Christian must be historically false and biased. Some reviewers actually said that Orestes in this film was a pagan: he was a Christian, just one who did not persecute others: does that disqualify him from Jesus's grace? The historical Orestes was a tolerant Christian, just as in the film.<br><br>-Yes, the story is remarkably true to the historical record: read Socrates Scholasticus (a liberal Orestes-type Christian). Yes, Cyril and the Parabolani did exist, just as described: yes, the fanatics were opposed to philosophy and \"pagan\" science. If anything, they were considerably more extreme than shown in this film. Sozomen, a cheerful \"Cyril\"-type Christian historian, talks about the killing of philosophers with great relish. Read Augustine on astronomy and science, and on toleration of dissent. Or Lactantius or Tertullian: \"What has Athens to do with Jerusalem?\", \"This is our primary faith: there is nothing we ought to believe besides.\" Not all Christian leaders and writers were wise and humane. For conservative Christian cosmology, look up Cosmas Indicopleustes (admittedly a hundred years later). The views of Ammonius in the film follow Cosmas. For general background, try Synesius, Ammianus Marcellinus, or Zosimus. <br><br>-The Library of Alexandria. Wise people judge others on their actions themselves, and not on the affiliations they profess. The library was mentioned up to Hypatia's time, and not mentioned after. Some people try to blame it on Julius Caesar (although Antony later rebuilt it), and then desperately on anyone other than on someone who carries a label they identify with. After the Arabs conquered Egypt, a story was then circulated in Medieval Europe that the Muslims had destroyed it. That one still gets airplay. As far as anyone can tell, Christian mobs destroyed it along with the rest of pagan institutes. Theodosius gave orders in 391-2 to destroy not just the Serapeum, but all pagan temples and worship.<br><br>-The scene of the Christians distributing bread was good, convincing and historically accurate. Some reviewers have used it to imply that pagans would not do this. It was true at the time. But remember that during the pagan empire there was dole of bread in cities: normally nobody was short of bread. Constantine nullified the urban bread ration with a stiff poll tax. <br><br>There are many places where the film is bravely historically accurate: even at the cost of risking mass appeal. -Hypatia's chastity. It was brave to have purely intellectual romance without any sex or even kissing. -The religious aspect of her astronomy. -The lack of any modern political correctness for the main characters.<br><br>Also good was the direct historical reconstruction of key scenes: Cyril's biblical challenge to Orestes over advice from a pagan and a woman, the subsequent physical attack on Orestes, the persecution of the Jews, etc.<br><br>As for things which actually were historical inaccuracies:<br><br><ul><li>Kepler. This was a kind of sweet artistic liberty. I took this as a sort of inside joke. Hypatia was an astronomer, among other things, and her most original work was on the mathematics of conic sections. So to have her tentatively propose the possibility that the the earth might move in a different conic section - an ellipse rather than a circle - is entertaining but not entirely implausible.</li></ul><br><br><ul><li>It would have been much better to have explained in more detail Hypatia's views on spirituality and the flesh, so that her \"cure\" for her admirer's physical passion was a bit more clear. Perhaps this is in the scenes that had to be cut. In reality, this is explained in detail in Synesius's letters.</li></ul><br><br><ul><li>Synesius of Cyrene. He was in fact a much more sympathetic character than made out in the film: both more humane and braver and more admiring of Hypatia. He is the only character whose writings we still have: personal letters that are well worth reading even today. Perhaps Amenábar needed a more critical character to balance Orestes's total admiration. But that kind of utter devotion was common between teacher and pupil in philosophical schools, even across religious boundaries. Again it is interesting that certain reviewers seem to think that admiration for a pagan equals paganism: even today. Just like Cyril. The message of the whole film was that this is not true. It was too subtle for some, obviously.</li></ul><br><br><ul><li>The initial attacks of pagans on Christians are anachronistic. Also pagans could not own Christian slaves at this time. But I suppose they had to explain the fanatics hatred for the pagans somehow, other than an inflated memory of events that had occurred a century before.</li></ul>","user":"pagzog","rank":[35,41]},{"title":"The Savagery of Religion","rating":6,"date":"6 August 2010","review":"I remember hearing of Hypatia's tragic tale from Carl Sagan in his \"Cosmos\" TV series way back in 1980. I was appalled by the tale, and shook my head as any good reasoned young man would. It was a story that stuck with me for much of my life. And I often wondered if such an important biography would ever be published about this mysterious and remarkable historic figure. I truly did not think so, and believed that Hypatia's memory would have to live on with what little history there was written about her, and the blurb mentioned once or twice by Carl Sagan as he recounted the once magnificent library of Alexandria.<br><br>People are stupid. I agree with Ridley Scott on this. They really and truly are. Whether it's the zealots portrayed in this film, or the Christian who sat behind me commenting on the film (he ACTUALLY APPLAUDED the Christians in the film), or just people in general, they really are stupid. It's how we get things like religion, and place not just some whimsical desire in them, but a devout belief, a serious conviction of some entity that is displeased by earthly decadence. Hence the crux of the story in \"Agora\".<br><br>We have the absolute mind numbed moronic thinking of the masses verse the practicality of those who know they do not know everything, but have a thirst for knowledge, and to share that knowing with others so that they can live a life free of fear.<br><br>But, we see that it is fear that wins out. Not reason. Not logic applied to a simple problem with a simple solution. But pure, unmitigated fear. Everyone from the heads of state, the heads of religions, the heads of mobs, the heads of any social entity in Roman Imperial Egypt is gripped by fear. Knowledge. Reason. Logic. Understanding. Education. Those are the true weapons that can assail the most ardent of foes.<br><br>But fear is primal, and infects everyone and everything like a plague spread by rats. The notion of imaginary beings who, in spite of being all powerful and all knowing, are vested in a patch of desert and how its human female population dresses should be a warning sign. Does this not sound familiar? We have the same concerns today, and although codified and addressed by legislation for local morays, and investigated and codified by alleged behavioral experts, people are still pretty touchy about anything remotely informative that doesn't gybe with their ideals: as a for instance; sex in this case.<br><br>Hypatia thinks like a man, despite her sexual makeup. She is the one who calls reason, as any good leader or scientist would. The rest merely cower to the polity dominating the social terrain. But she is optimistic. Even so, the times tragically overwhelm her.<br><br>The story of Hypatia has been somewhat elongated, no doubt for dramatic effect. Regardless, it's a good watch. Buy yourself a ticket, or grab the DVD when it comes out. You won't be disappointed.<br><br>Enjoy! :-)","user":"Blueghost","rank":[104,132]},{"title":"Beautiful film","rating":10,"date":"17 October 2010","review":"a really engaging film looking at the clash of Christians &amp; Pagans in 4th Century Roman AD. The loss of ancient knowledge and destruction by ignorant violent mobs Hypatia, a female mathematician, philosopher and astronomer in 4th century AD Roman Egypt - a most interesting historical character. &amp; the important of tolerance and asking questions, the pursuit of knowledge. beautifully shot film as well, a window of a lost society. I love Ancient History &amp; was nice to see it brought to the screen. just tragic the destruction of ancient knowledge by stupid mobs whipped up by crazy zealots just makes you wonder with the collapse of the Roman empire how much ancient knowledge was destroyed","user":"moonbootica","rank":[39,47]}]