[{"title":"Pretty Hilarious","rating":7,"date":"30 September 2008","review":"I saw Sex Drive at a sneak preview presented by my university. It's a seemingly typical teen sex comedy in the vein of Superbad meets Road Trip. Zuckerman plays Ian, a young virgin with no luck with the ladies, a crush on his childhood friend Felicia (Crew), a jerk of an older brother (Marsden), and is best friends with an Austin Powers-esquire Casanova by the name of Lance (Duke). On the internet, he poses as a football player while courting a mysterious girl online. When the girl invites him to go \"all the way\", he steals his brother's GTO and heads to Knoxville with Felicia and Lance. Ian's character has the usual nerdy teen virgin-in-a-movie problems: falls for the wrong girls, takes few risks, gets caught in embarrassing sexual situations. On the road trip, they run into a series of hilarious, awkward, and weird situations. And on the way, they discover that sex isn't the most important thing, and that true love can be found in both odd and familiar places.<br><br>It's not exactly stunningly original, but it's still a hilarious film. The three leads do a pretty good job, Lance being a particularly funny character. Marsden and Green steal the show in all the scenes they're in, and all of the characters in the film are interesting, even if most of them are stock characters. The script is also well-connected, with most of the characters being connected to the larger plot, and combines wit, ribaldry, and straight adult humor well. Every gag sequence gets big laughs, and the comedy never slows down or dies out. The internet cut-aways are especially hilarious supplements.<br><br>It's refreshing to see a genuinely adult comedy not coming from the Apatow crew or McKay and Ferrell. Although it lacks star leads and filmmakers and will probably drop under the radar, I definitely recommend Sex Drive to anyone looking for a big laughs.","user":"Spacetree","rank":[146,175]},{"title":"Don't' Listen To Critics- Sex Drive Is Top 5 Comedies I've Ever Seen","rating":10,"date":"23 February 2009","review":"There are several people who say that critics don't know anything... I find it funny in Hollywood how the best movies get rated terribly, and have a 28% rating on rottentomatoes 'tomatometer'...<br><br>I saw the preview for Sex Drive on myspace. The preview started off as a typical drive-across-the-country crazy-things-happen teen sex party movie. About halfway into the trailer I found myself laughing... and thinking \"wow... something about this movie feels different. I think it's going to be really good. I don't want to wait til October, I want to watch it right now\".<br><br>THREE WEEKS later three of my friends and I decided to see a last minute movie- I looked up Sex Drive only to find that it was only playing in one theater in our entire city (Denver) with only one showtime! 10:30 was the only showtime, if this was any indication of how the movie was I figured that it was going to be terrible- but I remembered how much I enjoyed the preview and coerced my friends to go see it. When we arrived the theater had only two other people in it, both middle-aged males sitting separately by themselves. Again- not a good sign...<br><br>The movie started out, and was instantly funny. We laughed, so did the others. I thought, \"ok, any movie can make people laugh... it's not that hard a thing to do... let's see where this goes\". The movie continued on, and I found myself loving the plot. Loving the script. Loving the (no-name) actors. Loving the directing. Loving the editing. Loving everything about it. But that's just me... everyone has different opinions. My three friends (who- might I mind you, have very different senses of humor) all felt the exact same way. We were crying at certain parts because we were laughing so hard. The other (two) people in the theater were laughing hysterically as well. Just when I thought it couldn't get any better- the movie turns to a love story, and everything throughout the whole movie comes together.<br><br>It finally ended, and I, and my three friends, sat there, in awe, about what we just saw. We left the theater and could not have been any happier about our movie choice.<br><br>I returned home to instantly look up reviews online about what others thought of this movie- and it blew my mind. The most terrible, awful things were said, and the movie's gross domestic total? $8,402,485. A BOMB.<br><br>I don't understand what it is people are looking for in a comedy. I will agree with others and say- yes, this has been done before. Yes, this movie is exactly what I thought it would be and what I wrote above (a typical drive-across-the-country crazy-things-happen teen sex party movie). Yes, this movie is predictable and familiar- but back to the question- what is it people are looking for in a comedy? This movie had every element of the $100,000,000+/movie American Pie series. Sex Drive should of made AT LEAST half that much.<br><br>I saw College recently- NOW THIS is a movie that deserved it's abysmal earnings of 4.5 million dollars. College's jokes were cheap, and seemingly desperate, as if almost begging for a laugh. And once again- yes, College made me (slightly) laugh- as I said before any comedy can- but what it did not do was leave me with a feeling of sheer joy and happiness that I took the time out of my night (and life) to watch it. Sex Drive left me with this feeling.<br><br>I believed Sex Drive to be perfect. In every aspect. I will address that, again, everyone's taste is different; everyone's brains interpret things differently and because of this not everyone will find Sex Drive to be perfect, in fact some may not find it funny it all- but I believe THE MAJORITY of people (9 out of 10) will realize, upon DVD release and word-of-mouth, that Sex Drive was the sleeper hit of 2008.<br><br>See this movie. It deserves much more money than it made and is well, well worth your time.","user":"goalyguy333","rank":[130,184]},{"title":"This decade's \"Road Trip\"","rating":7,"date":"12 October 2008","review":"So there was a screening of Sex Drive at the theatre, so I thought \"what the hell?\"<br><br>From the preview, I thought it could have gone one of three ways: 1. A horrible attempt at an R-rated comedy in the same fashion of a pretty good comedy a decade ago. (Like College tried for American Pie, and failed) 2. A mediocre R-rated comedy with bits here and there. 3. A movie that knows what it's going for and hits its mark. <br><br>I would have to say, this movie is very close to #3. The movie isn't a great movie, but it has no delusions on what it is. With the plot of a guy driving cross state just to get some ass, there's not a lot of directions you can go with it. The makers know this, so they make the best of it. <br><br>No real need to stress much on the story. It's simple, basic, predictable. Bad? I wouldn't say that. The story is really more of a momentum pusher than anything. It's really only there to prevent this from being a series of jokes and gags just jumbled together. There's no real big twist, a few lessons to be taken form it, but they all have been done before. You can pretty much tell what's going to happen at the end within the first 15 minutes. But the story isn't really the important thing here, so no real points taken off for that.<br><br>All the actors are good. Clichéd, yes, but they are likable. The goofy, virgin lead guy who's trying to get some tail is played wonderfully by Josh Zuckerman. Pulls it off flawlessly with all the awkwardness and uncertainty that the character would have. Amanda Crew is also really good at the \"BFF\" of Josh's character. The two have pretty good chemistry, even with all their awkwardly close moments. It isn't perfect, but being in some of those awkward situations, they were (while pushed a bit) familiar.<br><br>A surprise is James Marsden. You may remember him as Cyclops from X-Men, and he pulls off a great punk-ass older brother with a sense of humor of his own. He is the typical ass hole older brother in these kind of movies, but he pulls it over very well. Seth Green just seems like he's cruising through the movie. I think he's got a lot of talent and I knew even if the movie was going to be bad, he would provide a good set of laughs. And as a sarcastic Amish engineer genius, he's just fits in this movie seamlessly. <br><br>But I have to give a lot of credit to Clark Duke. His first real movie. He was a party extra in Superbad, if I'm not mistaken, the one who called McLovin' a bad ass. Like Seth Green, he just seems to glide through. He also has great chemistry with Josh Zuckerman. You can tell the two of them just had a really good time together on this. He is the suave ladies man who's guiding his pathetic best friend on his verge of losing his virginity, while getting some action himself. He doesn't have the look of the typical character, but he pulls it off excellently. <br><br>I put a lot of emphasis on the characters and actors. They were the backbone of the movie. Not the story, but the characters. There's also a hand full of supporting characters that do a good job at their parts, and an unwelcome (well, for me it was unwelcome) appearance by Fall Out Boy. <br><br>There are few things worse than a comedy that's not funny. There have been a serious excess of those as well. Dane Cook just had a movie a few weeks ago, and that was a haggard piece of crap. I actually have to say though, I laughed quite a bit in this movie. With the plot, there are going to be quite a few of the sex jokes, involving spooge, penises and homosexuality. Most of them though actually delivered. I can't actually say there were too many flat moments with the jokes. Yes, there were some, but the jokes that worked out-weighed those that didn't. <br><br>The climax got really over-the-top, but it did continue on with the laughs, and was satisfying. The closure did take a bit longer than necessary, but didn't drag. The movie was actually well paced and I was never bored. <br><br>This is no Superbad. It's not anywhere in that league. I walked out of this movie saying \"This is 2000's Road Trip.\" No, Road Trip wasn't a masterpiece or one of those comedy powerhouses, but it was really good for what it was going for. An over-the-top, R-rated comedy. See it with a group of friends in the theatre. Definitely see it with a crowd, it will probably make it that much more enjoyable. 3.75/5<br><br>Also, if you saw the trailer and had no interest, then you probably would want to skip it. It has it's intended audience, and will probably please those people and few others.","user":"campkllyrsf-1","rank":[81,126]}]