[{"title":"Jumpscare on Lame Street","rating":1,"date":"1 May 2010","review":"I figured this would be an entertaining remake if nothing else, I was wrong. Dead wrong. There was a much richer mysterious element to the original film and to my surprise, much more creative. I thought the kills and nightmare sequences would be vastly improved upon, but alas, gigabytes, greenscreens and CGI cannot compete with hands-on creativity.<br><br>The biggest question is of course whether a new Freddy is/was a good idea and I tried to give Jackie a chance; ultimately you can interchange actors playing Jason, Leatherface and Michael, they are suits and masks but you can't replace a personality. Known personalities such as Pinhead and Freddy Krueger ARE Robert Englund and Doug Bradley with prosthetics. Robert Englund brought us a believably creepy and demented sadistic killer where Jackie looked and acted like a pedophile. There were a handful of lines I enjoyed such as the 'body dying but brain living on' speech, but the rest seemed like plagiarized, recycled and poorly delivered lines selectively stolen from all the Nightmare films. (ex. Robert's \"Your eyes say no, no, but your body says yes, yes.\" From Freddy vs. Jason)<br><br>I don't understand why everything needs to be explained in full now. I hate that. I didn't need to know what the force was, Michael Myers mom was a stripper? Oh, okay, his killing is justified. I don't care that Jason Voorhees played hockey and was prolific in archery and I don't care that Leatherface has no nose. Some things are more frightening if you don't know why or aren't given a chronological map of where everything went wrong. Where was the creepy nightmare goat in this film? Did they have to cut the sequence showing a young Fred Krueger as a goat-herder on his family farm? In the 1984 film, what Freddy did with kids was implied but never told in full. That gives the viewer the right to view him in any matter, even as an anti-hero. The new film stamps it on your forehead that he was doing unsavory things to children which more or less made me sick and made the character less likable. (I always did find it funny that Freddy had such a cult following and appeal with kids as a child killer, but it worked. Here it does not.) <br><br>The CGI becomes a distraction here; it's when things look too perfect that they lose believability such as Freddy bending the wall above Nancy. The original was creepier and it was produced in camera. The kills were boring. \"I fall asleep, Freddy shows up, Freddy says something, I'm stabbed, I'm dead.\" Remember Rod (1984) being slowly strangled by bed sheets? That was scary, creative and left people thinking that perhaps Nancy was imagining Krueger and that Rod had hung himself. The new 'Nancy in the bathtub' scene was a boring cop-out and seemed more or less to be suggesting that it could be frightening. Even Tina's death being dragged across the ceiling was more vicious and sadistic in the original. EVERY 'scare' in this film is the cliché loud music and somebody jumping into frame.<br><br>I couldn't care less about the kids in this film, they are bratty and almost apathetic/nihilistic to the idea that they were being stalked in their sleep. Forget about brewing coffee in your closet, these kids are popping pills and using needles to stay awake this go around. I didn't buy that they were sleep deprived as the actors had shaggy or ratty hair and clothes, baggy eyes and looked strung out on heroin since the beginning of the film. The unnecessary 30 second video blog cameo by the likable Asian stoner from the Friday the 13th remake was the only time anyone seemed like they wanted to live.<br><br>The simplified story, CG, and casting aren't the only problems, the screenplay seems to be jumbled as certain characters have been blended and displaced. The 'Tina' character or 'Kris' in this film seems to take on most of Nancy's research early on in the film imposing the belief that she was the lead actress. I'm not sure if that was the goal of the screenwriter, but it wasn't a very clever or effective trick if that was the intent. The altogether renaming of the characters and traits begs the question of why even do it in the first place? Why not just make a new sequel with a great script and high production value?<br><br>This film, to me, was more like a terrible modern high school cliff-notes adaptation than a remake. It brought nothing new to the table and improved on nothing. As a film it was outperformed on every level by it's 26 year old predecessor. I truly hope this dies terribly at the box-office and that talk of a sequel gets slashed from the mouths of New Line and producers of this sacrilege. Shame on everyone involved in this crap. Even the worst sequel to the original series has more entertainment value.<br><br>I am not a purest, I was looking forward to this and I have enjoyed most of the remakes to a certain degree.<br><br>Avoid.","user":"TheFewSick","rank":[492,654]},{"title":"We all knew it was never going to beat the classic, but we were all expecting a good movie!","rating":5,"date":"21 May 2010","review":"Let me start off by saying i thought this movie was decent. But I expected a lot more.<br><br>We all know the story of Freddy Krueger. How he got burnt etc. In this one it's the same, but it's the change of Freddy's character that really lost my interest. Jackie Earle Haley is about as best as you can get at playing Freddy Krueger. No one will ever beat Robert Englund. He's just Freddy Krueger! I don't really need to explain the plot, you all know the plot, BUT, let me explain the changes. In the old Nightmare On Elm Street, Freddy Krueger would always mess with people before he killed them. In this one he just kills them and doesn't mess around. Nothing humorous to say, nothing, just kills them. In the original he was a psychopathic killer who hurts children. In this one he's just a pedophile. Loves to screw all the women and girls. To me, that put me off. All this put me off. So Freddy's character changed a lot, but did it work? Not for me. Didn't work for me.<br><br>All the acting was decent and there's some gory scenes, all in all, not the remake I was expecting and had hoped for. Everything about it is decent, but nothing great. 5/10","user":"octagon88","rank":[92,122]},{"title":"Incredibly disappointing, a slap in the face to true horror fans","rating":2,"date":"30 April 2010","review":"Picture the 1984 horror classic A Nightmare on Elm Street. Now picture that film if it was produced by bombastic Michael Bay, director of Pearl Harbor and the Transformers films. Now picture all of the worst possible outcomes of that marriage.<br><br>You don't have to. You could just plunk down your hard-earned cash – better yet, don't – for this lame remake.<br><br>Not that I can stop you from seeing it. No number of bad reviews (and this will be just one of many) would have kept me away. Curiosity alone demanded I see the new Elm Street, so when a critic buddy asked if I'd like to tag along to a screening, I did.<br><br>I mean, it couldn't be awful, right? It's a darker take on a character that had fallen into parody. Its screenplay was co-written by Wesley Strick, who has worked with Martin Scorsese (1991's Cape Fear). And supernatural killer Freddy Krueger is played by Jackie Earle Haley, an Oscar-nominated actor who was so creepy as Rorschach in Watchmen. How bad could it be?<br><br>Really bad, it turns out. Astonishingly, amazingly, how-could-you- possibly-screw-this-up-any-worse bad.<br><br>Samuel Bayer, a longtime music video director making his feature-film debut, accomplished his stated goal of draining away all the cheeky fun of the Freddy films. Unfortunately, he also drained away all the scares. What's left is a dreary, poorly-lit slog with uninteresting characters, wooden acting and a complete lack of tension, suspense or energy.<br><br>We could spend all day talking about the problems, but two big ones sink this new Nightmare all on their own.<br><br>The first is the new Freddy – he's not scary at all. (Robert Englund's original Freddy at least was creepy for a couple of films before falling into camp.) Haley's tiny frame makes Freddy look puny and his voice sounds like an even-more-ridiculous take on the raspy Christian Bale \"Batman\" voice.<br><br>Haley's not helped by the terrible new Freddy makeup, which presumably is supposed to look like a more \"realistic\" burn victim, but it robs him of any expression. Freddy's not scary; worse, he's not even interesting.<br><br>You'd expect the new Nightmare to provide some creative new \"kills,\" but that's the second huge problem. There are only a handful of kills throughout, and the better ones are taken directly from the 1984 original. In fact, fans of the original will note several virtually- identical scenes, all of them done on a higher budget but without a whit of artistry.<br><br>Special note has to be made of the acting, which (with a couple of exceptions) is dreadful. I'll blame Bayer, because a few of these folks have been decent in other things, but they're laughable here. (I'm pretty sure Thomas Dekker was attempting to portray Casey Affleck if Casey Affleck had suddenly completely forgotten how to act. And he's one of the better ones.)<br><br>Of all the leads, only Kyle Gallner manages to bring some desperately- needed personality and humor to the proceedings. Gallner single-handedly makes the final act interesting, since you'll have wanted every other character dead from the opening minutes.<br><br>But he can't overcome Bayer's clueless direction, which telegraphs every shock and dream sequence from a mile away. One of the most effective elements of an Elm Street film is the subtle slide back and forth from the real world to the dream world. Bayer doesn't get this at all. Every dream sequence is clearly defined, completely destroying any suspense.<br><br>The film spends two-thirds of its running time having its leads uncover Freddy's \"story,\" which is ridiculous because it's a story everyone already knows. It momentarily plays with a slight twist on the original plot – a second of creativity, emerging like a flower through a crack in the sidewalk – then immediately chucks it.<br><br>Don't get me wrong: I love horror films. I don't even ask too much of them. I only ask that they be either A) scary or B) fun. If they can be both, that's awesome.<br><br>But with none of A and far too little of B, the new Elm Street barely rises above an F.","user":"Rick_Gershman","rank":[445,630]}]