[{"title":"Relating in my 40's","rating":7,"date":"1 February 2016","review":"Although the characters portrayed are probably older than me, I could relate to aspects of combining nature, friendship, and fresh air that goes along with hiking anywhere. I am an outdoors-man and I knew I would like this movie like I did, simply because of the hiking, camping, and philosophical air. Of course, the actors made the movie even more enjoyable for me as I thought about past entertainments from this crown and began to remember how they made me laugh in the past and take life in strides and enjoy. I recommend watching this movie simply to inspire people to step out of their normal routines once in while, get a level set, and remember to enjoy life versus stress over it all of the time.","user":"netsomnia","rank":[22,22]},{"title":"Poor Screen Adapation of Bill Bryson's Book","rating":5,"date":"27 September 2015","review":"I really wanted to see A Walk in the Woods.I should have known better. Bill Bryson is my favorite author and A Walk in the Woods is one of my favorite Bryson books.I know how movie makers take the printed word and turn into something totally different on the screen. So it is with this film. I really couldn't recognize anything about this movie.This really should have been call Grumpy Old Hikers. I suppose that if I had not associated the movie with the book,I should have enjoyed it a great deal more.My wife thought is was a wonderful movie but she has never read the book.<br><br>For me the biggest problem was that I thought Redford was totally miscast as Bill Bryson. He makes Bryson a kind of judgmental, holier then thou, snob. Nolte as Katz is very amusing as a crusty old Iowa coot with an overactive libido and he takes the comedy honors. Mary Steenburgen has a nice little turn as a MILF motel owner named Jeannie who gives Bryson the eye. Emma Thompson is totally wasted as Mrs Bryson. Sandra Ellis Lafferty has a short but hilarious bit as Jeannie's widowed mom who develops an immediate sexual fixation on Katz.The rest of the cast is unmemorable.<br><br>I can't recommend this movie. I was just too disappointed in it.","user":"snicewanger","rank":[23,25]},{"title":"Read the book, watch the film then hike the trail.","rating":9,"date":"6 August 2015","review":"Caught a screening of this movie in Salt Lake City. The Appalachian Trail Conservancy put it on. What a fun movie, Nolte is great in it!! I was quite surprised on how funny he was. Redford and Nolte make a good team. About time a Bryson book got up on the big screen. I wonder how much of an increase in foot traffic there will be on the AT after this movie gets released. I'm sure next summer will be quite a bit busier. If a movie makes me want to go to the location/s it takes place I count that as a great movie. If you are a fan of the book, actors, hiking, nature or have hiked the AT you should enjoy this one. Well worth the visit to the cinema.","user":"JPLeverich-1","rank":[78,95]}]