[{"title":"Delightful","rating":10,"date":"21 March 2010","review":"I haven't seen a film like this in ages, I can't even compare it to another. Fun for the kids and adults too. A kid starts middle school, making the transition from grade school and this film nicely deals with that chapter in a kid's life. The \"cool\" older brother who lives to antagonize you, the \"yukky\" baby brother who embarrasses you, the nerdy friend who makes you look bad, they're all there. Who can NOT relate? The direction is perfect, the film is paced properly and exactly. <br><br>Some really fantastic performances from these child actors and a storyline everyone can relate to. No foul language or sexual situations... wow! We went with two 8 year olds and a ten year old and they all loved it. For once, a film for everyone!","user":"dentrex","rank":[92,129]},{"title":"More enjoyable than I expected","rating":30,"date":"30 March 2011","review":"Unlike most movies dealing with adolescence (especially in school), this one doesn't preach or condescend. And it doesn't try too hard to be a good movie, or take itself seriously (at least not too seriously). What's more: the movie is (mostly) unpredictable. Especially fun is the moldy cheese sequence! It would have been nice to get to know the parents a little more. One quibble though: What exactly is the purpose of Chloe Moretz's character? She seems to only be around to give these two boys advice (or something like that). It's never explained what kind of person she is. Anyway, if you found your middle school years to be anything but satisfying, you will not only enjoy the picture, but relate to it as well.<br><br>*** out of ****","user":"raisleygordon","rank":[10,11]},{"title":"A Nutshell Review: Diary of a Wimpy Kid","rating":9,"date":"3 April 2010","review":"I haven't read the book by Jeff Kinney which this film is based upon, but one thought struck my mind, and that is Ferris Bueller just got younger! For all his wisecracks, smart alecky ideas and attitude, Greg Heffley (Zachary Gordon) just reminds me of the time when Matthew Broderick took on the Bueller role, though this time round it's got less to do with cars and girls, but everything to do about surviving middle school, just about the time before puberty kicks in for him.<br><br>No thanks to the 101 tactical lessons on middle school survival by his brother Rodrick (Devon Bostick), Greg decides that his goal and calling during his time will be to be Mr Popular, though he increasingly finds that task being close to impossible given the number of his schemes backfiring most of the time, and when his best friend Rowley (Robert Capron) continues to be the source of embarrassment to his perceived supercool demeanour. He tries to rewrite the school's playground rules, only to find that he isn't quite the trend setter or the visionary he thinks he is, while his plus sized friend somehow manages to climb up the popularity rankings.<br><br>It's about that time in our lives where we think we're able to change the world from a very young age, where we think we're infallible, and that whatever we do, we can reset the established norm. It's about how negative emotions such as jealousy and envy get the better of us sometimes, and we react in the nastiest of ways due to pride. Then there's the message of being true to oneself rather than the actor being someone else. Relatively heavy themes for what's essentially a kids' film, but that's how director Thor Freudenthal managed to include in the tale of the wimpy kid's first year in middle school without you feeling overwhelmed but them.<br><br>What works here wonderfully is the casting, which is probably just about the highlight of the film itself. Zachary Gordon owns the role as Greg and has this schmuck look on him that doesn't irritate, but will buy you into his exploits, and most times laugh along or at him depending on whether his antics will rub you the right way or not. And nearly stealing the limelight away from Greg, is his best friend Rowley, played to wingman perfection by Robert Capron, who like his character is always on the verge of upstaging Zachary Gordon and stealing his thunder. The two are believable as best friends forever in Harry Potter-Ron Weasley proportions, and it is their play against each other, one using the other to further his cause, the other just happy to have someone whom he can try to emulate, being the strong points in the narrative. Their acting's natural, and have incredible chemistry so much so that you wonder if everything will go downhill when they split.<br><br>The humour in the film is manifold, from pure wit right down to the occasional toilet humour with farts, pee and all, from the home to outside of home, and the usual challenges faced when in battlezones such as the canteen, the gym, and festivals like Halloween and even Mother-Child Night?! The basic animation featured in the film also boosted its narrative through its simple, iconic drawings, and provides very much on how Greg sees himself, and that of his friends and family, which no doubt had tinges of familiarity and being stereotypes, such as the nasty big sized girl whose influential family means she can act like a bitch, or that nerd outcast that everyone tries to avoid. Plot elements such as the rotting piece of cheese stuck on the school grounds also provide for plenty of inane moments, and Cheese Touch is something that I'll never forget.<br><br>Diary of a Wimpy Kid is loads of fun, being reminiscent of the time when growing up was quite the pain and more often than not a time of being misunderstood. Highly recommended!","user":"DICK STEEL","rank":[24,31]}]