[{"title":"Can an Anaconda jump the shark? Yes!","rating":4,"date":"28 February 2009","review":"Anacondas: Trail of Blood takes place in the Carpathian Mountains in Eastern Europe, though it looks suspiciously similar to my parents' backyard. I never noticed a film crew back there, but I wasn't over every day, so I can neither confirm nor deny that Anacondas: Trail of Blood was filmed in residential Matthews, NC, but let's start that rumor anyway, okay? The plot involves a crackpot doctor who is cultivating the mythical blood orchid in a isolated shack where he experiments with snakes. The doc's magic blood orchid serum is capable of making snakes grow exponentially and cure cancer, which is why eccentric billionaire John Rhys-Davies, mere days from dying from bone cancer, finances him. The doc is sadly the first victim of his pet anaconda when it breaks loose, and the rampage begins.<br><br>Shortly thereafter, a myriad of disparate stories descend on the poor Carpathian Mountains, which never did anything to anyone.<br><br>First there's the team of mercenaries sent to retrieve the serum at all costs. Second there's a team of paleontologists going to the area to check on another team that went missing. Third, there's a hiker kid who looks like a younger version of Owen Wilson, without all the muscle mass and machismo that Mr. Wilson brings to the screen, who is in the area visiting his grandmother. Mini-Wilson runs into the fourth set of characters, a team led by the heroine from the previous Anacondas, Amanda (Crystal Allen) who is allegedly trying to destroy the magic blood orchid juice to redeem herself from her sins in the last movie. I honestly don't remember the movie well enough to be sure of what those sins were, but I do recall she killed David Hasselhoff's character, which is inarguably a sin deserving proper penance. Amanda must say three hail marys and appear in five more Sci-Fi Channel original movies.<br><br>For the duration of the film, characters manage to successfully outrun the hundred foot snakes. Yet, for some reason, two characters make noble sacrifices to delay a rampaging anaconda for their comrades. Though it is possible the snake was just being sporting, because in the thrilling conclusion an anaconda is able to outpace a CAR.<br><br>One locale that plays an important rule in the skulduggery is an abandoned mine shaft lined with fully functioning and operational lightbulbs, though the characters sneaking inside it feel compelled to wave flashlights around anyway. I remind you this is in the middle of the remote reaches of the mountains in Easter Europe where there is no town or discernible source of electricity. This is impressive to me because in my townhouse right now there are two lightbulbs that are out, which I simply haven't gotten around to. Perhaps if General Electric made lightbulbs half as efficient as Acme's Carpathian Mountains Lightbulb Co. -- that run eternally without electricity -- they wouldn't be in the dire straights they're in.<br><br>Bottom line: This is one of those so-bad-it's good movies.<br><br>Daniel J. Roos film.ispwn.com","user":"FilmIsPwn","rank":[13,14]},{"title":"Anacondas 4 Trail of Blood: Hopefully the last","rating":3,"date":"6 December 2018","review":"Anaconda went from Hollywood blockbuster to Hollywood B-movie to Scyfy channel garbage and this 4th outing is most definetly the latter.<br><br>To its credit it follows on from part 3 pretty well, though considering the two movies were filmed back to back this isn't all too shocking a fact.<br><br>Once again our Dr.Amanda Hayes is involved the anaconda/blood orchid lacklustre adventure though now we've lost the \"Hoff\" and gained the underrated though a tad hammy Linden Ashby.<br><br>The sfx are even worse than the previous movie but thankfully everything else is better, marginally better anyway.<br><br>The excellent John Rhys Davies also returns but yet again has a tiny role. Why have the best actor in the smallest role? Heartbreaking, truly.<br><br>Though the Anaconda franchise seems to have merged with Lake Placid I'm hoping this is the end of the solo movies, they're simply not entertaining at this stage and the franchise has been milked far enough.<br><br>One for big fans of the franchise who don't care about just how far the quality has dipped.<br><br>The Good:<br><br>Carries on from the previous movie well<br><br>The Bad:<br><br>Really poor cgi<br><br>Plot is really generic<br><br>Things I Learnt From This Movie:<br><br>Someone really needs to have a word with the creators about the anacondas teeth<br><br>An oddly large number of people seem to want to be eaten by giant snakes, who knew?","user":"Platypuschow","rank":[8,8]},{"title":"A bad film","rating":1,"date":"1 June 2009","review":"Forget that it's a franchise that extensively detours away from its original source material in theme, action and quality. Forget that. It's how amazingly stupid this screenplay is. It's really, really bad. A jumble of useless dialogue and cardboard characters dragged through a paper think plot idea.<br><br>I did not see Anaconda 3 so perhaps I am missing large chucks of the story. Though I can't see how.<br><br>Plot: (I kid you not!) Snake lady easily casually befriends young man, a stranger to her, while walking through the wood with two (we are told later) cops, who are easily killed at the next stop on the trail by a very poorly rendered large snake. Enter two couples in an SUV. Who are looking for base camp. We don't who they are. <br><br>The snake exists only to kill people (not for food) just to kill them and the snake seems to literally go from one human being to the next. <br><br>Lead pretty girl with new friend get chased by a group of assassins hired by John Rhys-Davies (What the F...?) in the first five minutes to kill a scientist who gyped him and his Gal Friday. The 'before mentioned' pretty lady. <br><br>A log in the road stops the two couples in the black SUV, they decide to walk to Base Camp. The snake kills more. They showed it way too much. <br><br>Pretty girl seems like she knows more than she's letting on. Down in some caves the young man/stranger (who behaves as though giant snakes, assassins and 'blood' flowers' are the norm) the pretty faced women encounter all kinds of trouble and should have been killed at least a half a dozen times. <br><br>The SUV people find a corpse at bade camp and one of them gets a bad mosequeto bite. Pretty lady and stranger boy outrun a 90 foot snake meeting up with the SUV people and the assassins at an archeology dig. The snake kills some more people. Pretty Lady gets knocked out. Stranger boy leaves but drops his keys behind for some tension later. Evidently she got knocked out dropping two feet from the ground though she didn't her head. He doesn't hear his keys drop. People do really dumb things. Now there's a serum in all of this conveniently hiding when an SUV guy and pretty lady when the assassins have them prisoners. The snake kills some more people. <br><br>Okay the SUV people have no purpose in the story -- they're fodder too. The assassins are seven strong and are only for the CGI snake. Some more people die. And Pretty lady planted those flowers to make up for all the bad she's done. (We assume from the last movie) Stranger boy meets up with SUV people and they know him. Surprise, he was looking for base camp all along too. Evidently the are archeologists on what appears to be a secret dig. They are so self important that you think they have something to do with the story but by this time there is no story left. <br><br>Okay and now there's something about a serum and a diary with instructions on to make more serum, which they conveniently discover whenever they need to advance the story (what story?), one vial, a coffee can fill of vials and the diary and then more people get killed by the plastic snake. <br><br>An SUV person sacrifice his life for pretty Lady even though he has only known her all of two hours. John Rhys-Davis appears again before getting his head bit off. And Pretty looks sad when she puts time bombs on a small flower bed in caves. There is an explosion and she escapes in an SUV with stranger boy but one last assassin tries to stop them and the movie ends.<br><br>I kid you not! We were clueless. We stared at each other the other night while watching it on TV sci-fi channel -- shaking our heads because the narrative was nearly non-existent. <br><br>Poorly written, badly directed.<br><br>Crap on a stick.","user":"ApolloBoy109","rank":[8,8]}]