[{"title":"Major Flaws, But Some Bright Spots, Too","rating":12,"date":"12 September 2011","review":"While trying to get their lives back on track after the loss of their four year old son, Bryn and Paul Shaw move to the charming old Beacon Apartments...<br><br>So, you have this film known as \"The Beacon\" that comes out in 2009. The DVD does not get released until 2011, and then they retitle it \"Haunting at the Beacon\" (which I actually think is a weaker name). And before the DVD even gets out, they are playing it on Netflix, more or less undermining any reason to be excited about the DVD (if you were).<br><br>What would draw someone to this film? I was a bit happy to see Michael Ironside, a horror staple for thirty years, play a small role here. And you might care that this film was made in an allegedly haunted hotel in Texas. That personally meant nothing to me, but fans of \"Ghost Hunters\" might think otherwise... or maybe you are a fan of Teri Polo from \"Meet the Parents\"? <br><br>The film is a bit of a snoozer, at least for the first half. We have a mom who sees a ghost child and those around her think she is crazy, just having symptoms of guilt from when she let her own child die. The plot is nothing special, it does not come off as very original, and some of the character motivations seem odd (such as the pill-popping cop who follows up on a case for no reason -- and what are her pills?) <br><br>The second half is both redeeming and destructive. The pace increases, there is a cool scene with scissors as a set piece (also the best gore of the film). And after a twist or two (which I cannot reveal) the story finally becomes interesting. The problem? We find out after the twist about many, many plot holes. I would love to go through about five of them here, but cannot without revealing the film's secret. Let me just say this movie works best if you do not think about it.<br><br>If you like the movie enough to own it, I will tell you that it features an audio commentary, but not much else. That might clear up certainly plot problems, though I doubt it (I must confess I own the disc but have not given it a second viewing yet). My advice is to avoid it or to simply watch on Netflix...","user":"gavin6942","rank":[6,6]},{"title":"Pretty Impressive little horror film worthy of a little bit more attention.","rating":17,"date":"17 November 2010","review":"My friend arrives at my house holding THE BEACON and THE COLLECTOR in his hands and just tells me I should check them out, I knew THE COLLECTOR from the trailer I saw a while back but as for THE BEACON, I was completely blank, I had never heard of this film and yet my friend insist I should check it out.<br><br>So I started watching this film and the first thing I noticed was this wasn't a big Hollywood film, it reveals itself as a low budget movie with no attempts to hide it, it had a slow but progressive pace, the acting wasn't bad and has a few rather creepy moments but the real surprise is the ending.<br><br>The film turned out to be good after all, I'll admit I was surprised when I discovered this was a DTV film that my friend brought me but I can say it was worth the 90 minutes, although one thing to take into account is this film won't please everyone, as I found with many low budget films like this if the production value isn't up to a certain standard then certain people won't like, to me the production value is decent, I recommend people not necessarily set there standards low but I think keep'em in neutral and discover the film for yourself like I did.<br><br>Overall, it was pretty impressive and I think it could use a bit more attention.","user":"jhpstrydom","rank":[9,10]},{"title":"Gateway to Hell","rating":8,"date":"30 December 2009","review":"The photographer Bryn (Teri Polo) and the astronomer Paul Shaw (David Rees Snell) moves to a small, but cozy one bedroom apartment in the Beacon Apartments in Texas to rebuild their lives. Three years ago, in Halloween, Bryn neglected attention to their son Danny that disappeared, apparently drown in a lake nearby a carnival. Bryn tried to commit suicide and Paul sacrificed his career to support her. In the relocation, the couple is helped by Bryn's sister Christina Wade (Marnette Patterson) that befriends the next door neighbor Will \"Ty\" Tyler (Nick Sowell). Paul finds a job in the local university and shares his office with the eccentric anthropologist Simon Valencia (Jonny Cruz). Along the days, Bryn has visions and nightmares with a ghostly boy and she decides to investigate how he died and seeks out his father James Nash (Kevin Scott Keating). Meanwhile Paul helps the decadent actress Vanessa Carver (Elaine Hendrix) but does not tell details to his wife. When Bryn discovers that James is also dead, she realizes that she had contacted ghosts in the building and tells Professor Simon, trying to find how to communicate with her diseased son. However, after his research, Simon finds the truth about the Beacon Apartments.<br><br>\"The Beacon\" is a well-constructed horror movie with a great story that recalled me the scary \"The Sentinel\" (1977). The excellent Teri Polo shines in the dramatic role of a grieving suicidal mother with guilty complex. This is the type of feature based on good direction, screenplay and performances, and the make-up and special effects are effective and used only when necessary. The plot point is totally unexpected, the story is very well resolved and the melancholic music score is wonderful. In the end, the refreshing \"The Beacon\" was a great surprise that startles and one of the best horror movies that I have seen this year. My vote is eight.<br><br>Title (Brazil): \"Visões\" (\"Visions\")","user":"claudio_carvalho","rank":[27,38]}]