[{"title":"Ending Utterly Spoiled it for Me","rating":2,"date":"6 November 2016","review":"I was actually genuinely enjoying this film. It was challenging notions of true love in a way that was actually challenging - if you met someone and fell in love, would you give up true love for them? <br><br>Steph isn't going to meet anyone any time soon and has decided to take a chance with Dan. Oona is delaying living her life because of the possibility that at any moment, her time could suddenly change. They both decide together to get their timers removed, inspired by someone who is absolutely certain the person she is with isn't her \"one\" and simply no longer cares. <br><br>I think the movie should have ended there. Mikey even says it: our lives should have a little bit of mystery. Everything suggested that the movie was going to end there. <br><br>And then Prince Charming comes waltzing in and devastates three people's romances. But it's okay, because they're \"destined to be together.\"<br><br>This movie fails on a comedy level because of the serious twist ending, it fails on a romance level because there is nothing romantic about the meeting of any person with a timer we see. I as an audience member was rooting for Mikey and Oona, I was rooting for Steph and Dan. And then to have those relationships shunted to the side just because that wasn't the true path means I just wasted my time watching these people waste their time.<br><br>I have a lot of questions that this movie throws in the air and then doesn't answer. How many people's timers have suddenly stopped working because the other person got the timer removed? Is there just a craigslist out there of people looking for people who got their timer's removed? What happens if someone's \"the one\" has died before they met? Do they qualify to be a \"the one\" then? What about the fact that Oona is a child of a \"doomed\" relationship? If Oona had never been born because her dad had never been with her mom, would Dan have wound up with Steph instead? Or would he just have never had a \"the one?\" <br><br>All the couples we see are roughly the same age, but if this is based just on chemistry, isn't it possible there could be some really uncomfortable pair-ups? People with language barriers? People with age differences? What's gonna happen when her dad meets \"the one?\"<br><br>This movie could have said something really progressive about the problematic nature of serial monogamy. Instead, as far as this movie is concerned, you really are wasting your life on every romantic encounter you have until you meet \"the one\" and no matter who they are or whether your sister is also in love with them, you have an obligation to yourself to chase after them. <br><br>I feel hollow and frustrated and disappointed now.","user":"thompson-ru","rank":[15,15]},{"title":"What were they thinking....","rating":1,"date":"26 March 2013","review":"The ending to this movie was such a let down. The message is conformity and mindlessness, not to mention disloyalty and self-centered behavior. Wow, what a way to spread the message. I think I'll go read \"1984\" again. If you want to see an example of a movie that took a startling negative view on independence without seeming to be aware of it this is the one for you. It's actually kind of frightening what the writer and director seemed to think was an acceptable ending. The main character's little show of bravado at the end was useless since she had already capitulated and willingly followed what an electronic pulse dictated over mind/heart. Very disturbing.<br><br>By the way if your wondering why I watched it in the first place my 20 year old daughter asked me to because she liked it. After she heard my review of it...not so much anymore.","user":"keshby","rank":[20,24]},{"title":"Charming, with a Different but Silly Concept, but also Flawed with an Awful Conclusion","rating":4,"date":"19 August 2014","review":"In a near future, many people wear a timer implanted in their wrists by matchmakers to find their soul mates and true love. The twenty-nine year-old orthodontist Oona O'Leary (Emma Caulfield) is worried about her future since she cannot find her true love. When she meets the twenty- two year old supermarket cashier and musician Mikey Evers (John Patrick Amedori), his timer shows that they will be together in four months and she falls for him.<br><br>Oona lives with her stepsister and best friend Steph Depaul (Michelle Borth) that works as receptionist in a nursing home. When Steph meets the widow Dan (Desmond Harrington) that does not wear a timer, they start seeing each other. Meanwhile Oona finds that Mikey's timer is fake and she is affected by her discovery. The birthday of Oona and Steph is on the same day and their mother Marion Depaul (JoBeth Williams) invites Mikey and Dan to the party. On the eve, Oona and Steph decide to remove the timer, but when Oona is ready to take it of, the timer is activated by someone who has just implanted it. Who could be her soul mate?<br><br>\"TiMER\" is a charming romantic comedy with a different but silly concept, but also flawed with an awful conclusion. The idea would be acceptable in a future or a near future, but even Oona's father had implanted a timer when she was born meaning thirty years ago. The perfect message would be with Oona daring to love Mikey free of her mother's oppression for using the timer and Steph and Dan together. Further, there are several questions raised along the story without answer. For example, has Oone reconciled with her father? Did he like Mikey's CD? What has happened to Steph and how would be her relationship with Oona if she stays with Dan? My vote is four.<br><br>Title (Brazil): \"Timer – Contagem Regressiva para o Amor\" (\"Timer- Countdown to Love)","user":"claudio_carvalho","rank":[18,22]}]