[{"title":"A beautifully shot film for the amateur photographer or historian","rating":8,"date":"7 September 2011","review":"This film was a nice surprise; I'd not heard of it before I saw it. The set up is a group of intrepid South African photographers who want to go out and document the troubles surrounding the end of apartheid - a story of incomparable significance at that time. These fours guys each have their own unique personality and reactions to the events but share a desire to get the facts on film (and not just report on the contrived political goings on). They risk life and limb in riots and battles that were fought, very graphically here, within the townships - traditionally no go areas for white people. <br><br>The fact that the director (Steven Silver) managed to fit into the running time enough detail on each photographer for sufficient back story, plus was able to project the historical concept but tread lightly enough to not offend those that were caught up in it, was impressive. You could imagine, with a sufficient budget, the book morphing into a mini-series. The performances of the actors (in particular the one playing the black South African who'd recently lost his family) were believable, engaging and consistent. <br><br>There is included a romantic story - one which is based on real facts and thus one which must be included in any film which has hopes of scoring successfully at the box office. The story was true and therefor wasn't unnecessary, and added to the sympathy for some South Africans who were obviously against the mistreatment of their countrymen. <br><br>The overall feel of the film was one which was not overly 'Hollywood', yet still will be accessible to those who prefer western-style production. As a film about photography the images - still and moving - were beautiful and emotionally very captivating. <br><br>Anyone who has an interest in photography and/or social history should not miss this.","user":"Gobobo","rank":[24,27]},{"title":"Internal conflict between observation and action","rating":7,"date":"23 May 2011","review":"The war rages on in the final days of apartheid in South Africa. \"The Bang Bang Club\" is a group of four, young, fearless photographers who drove in head first into the racial fighting. Why they did such a thing is certainly in question. At first, I would chalk it up to the male-driven need for action. Other reasons will be there, but even they question it after awhile.<br><br>Writer and director Steven Silver is an established documentarian and this marks his transition into something a little more accessible. This certainly is. It's the type of recent historical story that I want to know more about. We only see the conflicts that are going on in South Africa through the lenses of these young men. The conflicts that take center stage are the internal ones between the good of documenting the violence versus doing something about it. Interestingly, it's when two of them win the Pulitzer Prize that their moral fibre is called into question.<br><br>As fearless as the protagonists are, the filmmakers seemed to be a bit more timid. Although the violence is there in full view, it lacked most of the emotional impact it should have had. Unfortunately, this is the reason for the low critics' rating. By the end you will be moved by the story, but you could have been moved all along.<br><br>I found that it was a great point of view to an interesting time. It was shot on location and achieved a great look for an independent film with the fraction of a Hollywood budget. \"The Bang Bang Club\" is a good movie, a great story, and it's worth experiencing.","user":"napierslogs","rank":[30,35]},{"title":"The Book is Brilliant, The Film is even Superior","rating":10,"date":"23 April 2011","review":"THE BANG BANG CLUB, A MOVIE TIE-IN is as fine an introduction to the quality of the film just released, a film based on this book. The political history surrounding South Africa into which the four photographer journalists involve themselves is confusing at best and should be required reading before the audience steps into the grim realities of the cinematic format. Another aspect that makes both the book and the film of utmost importance is this past week's report of the deaths of two brilliant photographer journalists Tim Hetherington and Chris Hondros in a very similar situation in Libya. <br><br>South African writer/director Steven Silver adapted this book by Greg Marinovich and João Silva for the screen and using some of the images from the original book and enhanced by reenactment of the horrors by cinematographer Miroslaw Baszak has successfully preserved all of the brutality and gore of the situation in South Africa in 1994 - before the country was joined into a nation by Nelson Mandela. Greg Marinovich (Ryan Phillippe) is a free lance photographer in and around Soweto and follows his instincts for a good story by wandering into dangerous territory. He meets the three photographers who produce footage for Star picture editor Robin Comley (Malin Akerman) whose crew consists of pothead Kevin Carter (Taylor Kitsch, in a fine, sensitive performance), Ken Oosterbroek (Frank Rautenbach, a very promising young actor), and João Silva (Neels Van Jaarsveld). After proving his worth with a Pulitzer prize photograph of a burning man the four young men bond closely as the Bang Bang Gang and proceed to capture all of the fighting and incomparably cruel hostilities as the three fighting forces in the struggle for power in South Africa create the chaos of 1994. In a particularly touching scene Kevin photographs a starving child being stalked by a hungry vulture and his photograph wins a second Pulitzer Prize for the group. But war is war and takes is mental and physical tolls on the Bang Bang Gang and only two survive to write the book whose journal like content provides the story for the film. <br><br>This is a difficult book to read and the resulting cinematic version is equally as difficult to watch. The cast of characters is excellent down to the smallest cameo appearances by the South African people describing the atrocities that till their existence. An excellent book has been transformed in to an excellent film, albeit a film that is harrowing to watch unfold. <br><br>Grady Harp","user":"gradyharp","rank":[46,60]}]