[{"title":"A comedy for both sexes","rating":10,"date":"21 July 2009","review":"I saw this movie at a preview event last Friday night and it was hilarious. The sold out cinema was laughing hysterically throughout the movie. The movie is fast paced and does not drag. The comedy is \"r\" rated with a little raunchy adult humor that can be shocking at times but that is in line with the movies theme of male/female relationships.<br><br>Katherine Heigl and Gerard Butler were both great in the film. Not a role that you would expect to see the King of Sparta, but Butler has great comedic timing complimenting his tough guy persona. And Katherine Heigl is once again perfect doing comedy.<br><br>If you are expecting to see a typical romantic comedy you will be surprised, because this R rated film is geared toward the men in the audience as well as the ladies. Grab your significant other and be prepared to laugh and enjoy the movie together.","user":"michele17","rank":[158,255]},{"title":"Another GREAT Romcom for 2009","rating":9,"date":"6 August 2009","review":"I now believe that 2009 should be dubbed the year of the Romcom.<br><br>I was dragged to see the proposal by my girlfriend and thought it was hilarious. When she wanted to go and see The Ugly Truth I found myself putting up less of a fight this time. And I'm glad.<br><br>This film is HILARIOUS. I have to say I enjoyed almost every second from start to finish. It truly is designed for both men and women with fantastic views on romance, sex, attraction etc from both sides.<br><br>Acting is great, story is great and the chemistry between Katherine Heigl and Gerard Butler works very well on screen.<br><br>To sum this film up I have to say watch it. Make your own mind up. But I bet you won't be disappointed and I bet you can't stop yourself from one agreeing with some of the points made and two laughing out loud.","user":"Filmaholic78","rank":[97,159]},{"title":"One of the few all-around great love movies, both for women and men!","rating":25,"date":"25 July 2009","review":"So as I was forced to watch this movie with my sister and her friend, the original stereotypical thoughts towards all love movies seem to be bursting throughout my head- corny: guy meets girl, girl hates guy at first, girl meets another guy then realizes that the first guy was the love of his life, girl goes back to guy and the movie ends with a touching make-out scene. Well, of course this was the case. HOWEVER, I wouldn't exactly call this movie a chick-flick. It seem to be the \"battle of the sexes type,\" and it did not disappoint. I can easily say that I had some great laughs in this movie; surprisingly, and I am not even a comedy/chick flick guy. The whole moral of the movie is something both guys and women can you relate to, and some scenes are just hilarious for all types of audiences. The whole plot of the story was actually pretty solid for this style movie. In fact, the approach of this movie is so unique that I believe it belongs in its own category. Gerard Butler gives an excellent performance, both funny and charming. The humor had tremendous variety that kept audience laughing hysterically at some points. Overall, I really do recommend this movie for the male audience (Especially couples) and guarantee that they will not be disappointed after seeing this flick.","user":"ekbatani14","rank":[118,198]}]