[{"title":"Definitely worth a Go","rating":8,"date":"21 June 2009","review":"Director Sam Mendes last movie showed a couple deteriorating right in front of our eyes in \"Revolutionary Road\", and in a way he makes up for that depressing slog with \"Away We Go\". The couple here are upstarts, two people with a baby on the way who for the first time find themselves wondering about where they fit in the world and what they'll be like as parents. They're hopeful, but you can see the fear plastered on their face. First time screenwriters (and husband and wife) Dave Eggers and Vendela Vida waste no time in making them two identifiable people, and in the way they survey life's odd, complicated, and wonderful little moments, \"Go\" never fails at being a funny, thoughtful and heartwarming little gem that you'll fall in love with.<br><br>John Krasinski (The Office) and Maya Rudolph (Saturday Night Live) play Burt and Verona, a mid-thirties boyfriend-girlfriend (Verona has a marriage issue) who get the shock of their lives when Verona gets pregnant. Not only that but any roots they have in their little Connecticut town are about to be uprooted because Burt's parents (a funny Jeff Daniels and Catherine O'Hara) are moving to Belgium a month before the baby is born. Having no reason to stay where they are, they pack up and take a road trip, stopping anywhere they know they might find a familiar face. Phoenix, Tucson, Madison, Montreal, and Miami are all marked for a trial period as the two try to figure out who and what they would like to raise their family around.<br><br>It's an odd blend of dealing with life's what-ifs and meeting a variety of broad characters. Allison Janney is the funniest of the broad, playing Verona's former boss Lily, an abrasive alcoholic who enjoys point-blank degrading her children and her crazy, paranoid husband, nicely played by Jim Gaffigan. Maggie Gyllenhaal also shows up later on as Burt's zen-like cousin who takes family closeness to a whole new level, i.e creepy. Mendes balances scenes like these perfectly with the richly written script. A scene between Verona and her sister (Carmen Ejogo) where the ushering in of new life forces them to confront the death of their parents, and another where Burt's brother (Paul Schneider), whose wife has just abandoned him and their young daughter, encourages Burt to think about the strength of his own bond with Verona have a rare power that speaks to the importance of family. There is a point where the interspersing of comedy and drama starts to get old but luckily a third act of genuine lessons and happy mediums lead to some of the movies best scenes.<br><br>And these are star-making turns from Krasinski and Rudolph. He has a doofy charm that gets a couple good laughs but he also makes Burt a loveably doting and comforting boyfriend there for Verona no matter what. And Rudolph is a big surprise here as she turns in a performance of maturity, vulnerability, and depth. This type of performance is a long way from SNL. They are, for the most part, the straight-men to the quirky characters and are called upon to spend most of the movie's run-time just talking and they gel so well with each other that you really don't even mind. Ellen Kuras' cinematography (rolling hills, sunrises, planes moving across glass window panes) and Alexi Murdoch's songs only increase the pleasure in this funny and effective indie rom-com.<br><br>For more reviews, check out Leesmovieinfo.com","user":"C-Younkin","rank":[55,68]},{"title":"Meet the Family...","rating":7,"date":"27 May 2009","review":"i just got back from a pre-screening of this in Dallas, and i must say i really enjoyed it. it seems like the whole audience enjoyed it as well, the theatre was often filled with laughter throughout this wonderful film.<br><br>i'm a fan of Sam Mendes' work, and his work excelled here in the realm of comedy. John Krasinski and Maya Rudolph shared great chemistry as a couple expecting their first child and trying to decide where to settle down and raise their family. it's a bit of a coming-of- age story about people who should have already come-of-age, as we travel across the country along with them meeting quirky parents, friends, and old schoolmates.<br><br>it's not all laughs, though. there are plenty of serious and introspective moments and my hat is off to Ms. Rudolph, generally known for her skills in comedy, for adding fine dramatic moments to her character. in the end, this movie doesn't offer any solutions to life's quirks, but it looks at them and even celebrates them.<br><br>it's not Mendes' best film, but it's a very enjoyable film with a great cast and lots of laughs, and should appeal to a pretty wide audience. it's a breath of fresh air from all of the Hollywood flash and crap that will be slopped across theater screens this summer. go see it!","user":"jordathan","rank":[82,105]},{"title":"If you are thinking of having a child, this movie might be for you.","rating":5,"date":"8 October 2009","review":"If you are thinking of having a child, this movie might be for you. Maya Rudolph and John Krasinski play an unmarried couple in their thirties who discover they are going to be parents soon. Both actors do a good job, giving their characters a quirky touch while at the same time keeping them realistic and likable. Especially Burt stands out with his spontaneous efforts to lift Verena's spirit. This is a strength of the movie - there's warm humor in a lively dialog that makes us smile and sometimes laugh out loud. But \"Away We Go\" also has a more serious note to it - rather than a comedy it is a reflection about the responsibilities we take when we decide to become parents, the lifelong commitments we make, and the fear of making mistakes.<br><br>Sounds good, you say, then why only five stars out of ten? Well, for one thing, if you are *not* currently thinking of having a child, the movie might not be able to keep you interested the whole way. Instead of a story told straight, it's more like a journey through situations and feelings parents are likely to experience. Or maybe like a sneak preview of traps you might fall into being a parent, if you don't watch out. Which might just be your cup of tea, but then it might not be. <br><br>Now the dialog - I mentioned it being a strength of this movie, but at other times, it is also a weakness. Imagine, you are sitting somewhere with a friend and this married couple next to you starts sweet-talking each other. Personally, I feel this is a good time to turn to your mate and say, hey, how about another beer. Not only is it nice to give those guys some privacy and avoid the feeling of being an intruder. The truth is, I simply do not *care* to hear all the love-names they invented for each other, nor the gentle promises they are whispering into each other's ears. Sadly, turning away to your mate doesn't really work in theaters, and beer is expensive. So here we are, forced to sit through those awkward moments, shuffling in our seats and waiting for the comic relief. Luckily, the writers were smart enough to provide quite a lot of that. But, more often than not, it arrives painfully late.<br><br>Towards the end, there is a scene where all the do's and don'ts of being a good parent are reiterated as if to drive the point home with a sledge hammer. I can understand why other reviewers have scolded the main characters for being patronizing, though to be fair I don't feel it actually permeates the movie. All in all, I don't believe Sam Mendes' latest work will appeal to everyone, simply because of its subject matter. It can be awkward to watch at times, but it also has likable, carefully drawn characters and a number of genuinely entertaining moments.","user":"Sebastian_Berlin","rank":[7,7]}]