[{"title":"George Clooney shows something he has never shown before. vulnerability.","rating":10,"date":"4 December 2009","review":"Halfway through this movie I considered it an 8 out of 10 and decently spent money. The second half came as a big surprise. George Clooney let go of all his suave and let his eyes show fear and isolation that real people feel.<br><br>There were two things going on in this movie. On one end, we were looking at the people getting fired. On the other end, we were seeing the problems with Ryan's way of life. The interviews at the end with the people who lost their jobs explaining that it was family and support that brought them through bad times hit a perfect note for bringing both parts of the story together.<br><br>The title of this film literally explains what it is like to not know what aspects of your life are solid, such as a home or a significant other. Everything going on is simply up in the air. One day, what you thought was one way will turn out to be something else entirely.<br><br>Best of Reitman's three. Very much recommend it.","user":"ctg0724","rank":[317,423]},{"title":"I'm like my mother, I stereotype—it's faster  Up in the Air","rating":9,"date":"19 September 2009","review":"Based on the novel by Walter Kirn, George Clooney stars as corporate downsizing expert Ryan Bingham, who is hired to help ease the transition of long-term employees to the unemployment line across the country. Taking his job very seriously and loving the 290 days away from home—the only problem with that is the 70 days at home in his empty apartment—his world gets turned upside-down when a young upstart in the company threatens to ground the company to fire people via the internet. Not standing for a change in his life, nor the chance for his life goal of total airline miles to end, (\"Let's just say I have a number and I haven't hit it yet\"), he goes on a mission to prove how personal his job is and how key a face to face meeting can be to talk down an emotionally unstable person and really do the victim a service in an otherwise horrible moment in his life. Along the way, he and the recent college grad, of which the boss loves due to her budget slashing game-changing idea, Natalie, played by Anna Kendrick, both find out what has been lacking in their lives and how to become better people, opening up to love, heartbreak, and the need to grow up.<br><br>Clooney's Bingham is the loner businessman whose only relationships exist from random meetings with attractive females at the multiple airports he frequents. His wallet of plastic has become his lifeblood—credit cards from airlines that accumulate his mileage, hotel status perk cards that let him cut the disgruntled travelers and go straight to the front, and numerous room keys that never seem to be thrown out, causing him to always use more than one before finally opening his hotel suite's door. Detached from his family for years as the brother that exists but cannot be counted on for anything, he contemplates whether he should, or really wants to, attend his sister's wedding—the little girl of the family and someone he should have been involved with after the passing of their father. A series of style cramping incidents for him begins with a phone call from his other sister and the request to take a cardboard cutout of the happy couple, (Melanie Lynskey and Danny McBride, in a role that might actually show some nuance for a guy that usually flies by the cuff), and photograph it in front of famous places he travels to for work \"like that French gnome movie,\"—I love the Amélie reference. Then comes the threat of being taken out of the air, his home for decades, in order to impersonally let go more people more efficiently; the challenge of taking Natalie on his next schedule of jobs to prove to her why the new system won't work; and the addition of a love interest in Vera Farmiga's Alex, a woman who describes herself to him with \"just think of me as you with a vagina\"—one of many great lines.<br><br>There is a lot of subtlety and intricate weaving of plot lines throughout the story, details and sequences that need to be seen fresh to get the full benefit of the film. What you might initially think is a witty comedy about a jerk of a guy who not only thinks he's better than everyone else, but actually is, that either finds the error of his ways or gets dropped down a peg or two, eventually becomes a tale chock full of heart and emotion. The real success story of the film is a revelatory performance from Clooney who really knocks this on out of the park. He always showed the charisma and chops to play confident and successful, but here is allowed to also branch out and express the pent-up frustration that comes with isolated loneliness, the passion one can have for a job that seems horrible, yet, when treated carefully, is a job to take seriously, and the compassion for humanity on the whole, softening enough to realize that there are people around him that need help besides his laid off strangers, help that only he can provide. The evolution he undertakes is really pretty amazing and I credit Kirn, Reitman, and Clooney for pulling it off with grace and laughter.<br><br>Every single actor is unforgettable—even the bit parts like Zach Galifianakis and especially J.K. Simmons as two corporate employees who's jobs have been eliminated. Jason Bateman is hilarious as Clooney's smug boss, fully embodying the take no crap nonchalance he made famous in \"Arrested Development\"; Farmiga is gorgeous and competent to be able to go toe-to-toe with Clooney in the detachment and power-hungry attitude of flying in style for half a year or more; and, if George's reinvention of character is revelatory, then Kendrick's naïve Natalie is masterful. This girl was top in her class, able to get a job in her field wherever her heart desired, yet settled for this firm specializing in firing people so as to not dirty the workers' real superior's hands. Young and confused about life in the big world of adulthood—set on a plan for marriage and children to occur as though set times on a clock—her eyes are opened to the intimacy and fragility with which a person's mental state can be affected by mere words. When you put them all together, Up in the Air resonates on so many levels; deserving of any praise and accolades to be bestowed upon it. Hilariously funny every second of the way, it is still unafraid to dig into the dark moments of life and treat them with respect and relevancy, going places you wouldn't think it would have the guts to go. You really can't say too much about the film, a top ten of the year entry for sure. Reitman proving to be a force to reckon with and Clooney that he just keeps getting better with age.","user":"jaredmobarak","rank":[269,384]},{"title":"Another hit from the Director of Juno, Jason Reitman","rating":10,"date":"9 December 2009","review":"Anyone who has ever been fired must see \"Up In The Air.\" Jason Reitman has done again. The director of \"Thank You For Smoking\" and \"Juno\" puts real life out there in an incredible way, where we all laugh and then walk out of the theatre thinking about what is really important. A film with a message that's entertaining: what a concept.<br><br>George Clooney plays Ryan Bingham, a man that flies all over the country firing people for companies that don't have the spine to do it themselves. He is so proficient at it, when he meets his \"expert traveler\" equivalent, Alex Goran (Vera Farmiga); he is emotionally drawn to another person, beyond a passing interest, for the first time.<br><br>Bingham's travels are a quest to be a traveling legend. When his company takes the advice of young newbie, Natalie Keener (Kendrick), he is grounded, endangering his quest to achieve frequent flier miles that number in the, uh, stratosphere. When his boss (Jason Bateman) assigns him to \"show her the ropes,\" so she can revolutionize the company's firing technology, the resulting road trip is not only riotously funny, it is a self-exploring journey into the three people's strengths and weaknesses. The life decisions they make are the emotionally important message of the film.<br><br>The rest of the story must go untold, so you can savor every morsel from your own perspective. For that is what this film does best. Almost all of us have been canned. Sitting across the table, being told we'll be glad it happened, one day. Our participation in the film is subtle, as we sit across the table from Bingham as he cans us.<br><br>The film's cast is like the story: they suck you in. Clooney is Clooney, like Cary Grant was Cary Grant. You think he's not acting, that's just who he is in real life. Maybe it is. Vera Farmiga's performance is seductively natural. You've met people like her. You admire her. Then you find out you don't know her at all. She is the mystery you wish you were. Anna Kendrick as Natalie is a perfect, perky, know-it-all that becomes all too human. Kendrick makes her character's transformation special parts of the film, when she could have easily have been regulated to a supporting character. This has become Reitman's trademark as a director. He empowers actors to make the movie their own.<br><br>Up In The Air is a movie that is over before you want it to be. You want to get to know the characters better, to follow them around a little longer and make sure everything goes well for them. Another credit to Reitman for his extraordinary skill at taking the common things in life and make them extraordinary. Which makes us all feel better about the common-ness of our own lives.<br><br>Written by: Vincent for Overcranked.net If you liked this come read more reviews http://www.overcranked.net/movies.php","user":"overcranked","rank":[148,218]}]