[{"title":"Best movie ever","rating":10,"date":"13 September 2010","review":"Having grown up reading the Mandie mysteries,I was delighted when I heard they were going to be making a movie of the first book,only problem was it wasn't being shown in mainstream theatres and it went straight to DVD only to be carried by Christain bookstores,lucky for me I was able to buy a copy only yesterday,I was not disappointed,they stuck to the story and added more to Mandie background of how her grandfather saved and hid Cherokee Indians from the Trail of Tears. The scenic shots of North Carolina filmed at a national park are superb and the music is both haunting and beautiful. The story of Mandies background is told as if it were a fairy tale and unless you have read the books,there are times where you think it is just that,until it is revealed that it all true. Mandie is a spunky girl who does not let anything stop her from finding her Uncle John's will,I am looking forward to the second movie out this fall. This is a good family movie everyone will enjoy","user":"lpnarnialover09","rank":[14,19]},{"title":"Decent film worth watching","rating":3,"date":"3 January 2020","review":"This is a movie based on the popular Christian book series Mandie. This film is about Mandy trying to discover whether or not she has an inheritance and along the way what her family heritage really is. Yes she finds out she is part Native American. But, it's not too difficult for me to see her as the quarter Native American she is even with the blonde hair since her father was half white and half Native American and her mother was full 100% German. I am half Dutch myself and the rest is a mix. I look full blown Dutch though. Overall, the acting is moderately good. Dean Jones, of course, is amazing and his performance is top notch. Every scene with Dean steps up a bit from the rest. The scriptwriting and/or editing did leave some key details out which made it somewhat difficult to follow at times but the stories predictability helps with that lol. I do wish that\nthe casting of the Native American actors had been better. Overall, it is a fun story with beautiful scenery and some intrigue that young tween girls will especially love.","user":"wingodsaysso","rank":[1,1]},{"title":"Blond Cherokee?","rating":5,"date":"24 November 2019","review":"This was a very nice story and good family entertainment. But try as hard as I\nmay I could not wrap my mind around the concept of a blond blue eyed part\nCherokee. In fact according to the script young Lexi Johnson is one quarter\nCherokee and her looks, beautiful as she is don't compute.<br><br>Now that she's a teen and her father has recently passed away, the Cherokees who\nstill live in Tennessee have sent her to live with her uncle who's got himself some\nreally nice digs in a mansion. But he's away and his lawyer Dean Jones is\nrunning the place. Then the uncle is reported missing after a ship goes down\nat sea.<br><br>After that relations start pouring out of the woodwork but even Jones doesn't\nknow where the will is. That starts a hunt with Johnson and some friends she's made looking for the will. The relatives want the whole pile and are looking to cut each other out as well as our young heroine.<br><br>The action takes place in the year of 1899 and the sets and cinematography\ncertainly do reflect the era nicely. The ending is an interesting one and the\nvery end does provide some explanation for our heroine's blond looks.<br><br>Still can't quite buy it though.","user":"bkoganbing","rank":[1,1]}]