[{"title":"Not worthy for even 5 years old child.","rating":2,"date":"24 April 2014","review":"This is story of sheep called Blacky and she is obsessed to travel to moon .. well i will not go in the story much as its not worth a watch ........... Even 5 years old child too will dislike this movie....... animation is so boring, slow paced ,,,,, dog astronauts and pinkie the pink sheep man that was the limit ......... All of the characters are sloppy .,... this is badly directed badly written and worst thing is badly animated ... in this era where we see so many good animated movies , how can someone come up with such a sloppy work .... <br><br>Don't take your kids to this movie as it is waste of time and money.....","user":"xander9199","rank":[11,14]},{"title":"The sexualisation of animals used to indoctrinate toddlers into pop culture","rating":1,"date":"3 July 2014","review":"This is quite frankly the most disturbing movie I've ever seen.. Between the full sexualisation of baby animals, prominent buttocks being waved in the camera half the time, such characters wearing lipstick and having their hair done, acting like you're average two-bit Beyonce impersonating slag whore that probably watches nothing but reality TV, and pretty much half the conversations being flirting, while the methodology of the dialogue and pace is clearly aimed at 4 year olds and under.. I couldn't say what scares me the most.<br><br>The entire movie is just about advocating that agenda, to brainwash your kids into thinking that stupidity, vanity, and selfishness are the key virtues you should uphold, that life is only about having sex and looking good, and that you need to be 'cool' to have any value as a human being.<br><br>This was honestly even more creepy than Alpha &amp; Omega, and the idea that toddlers are watching this really makes me worried for the future of the human race.","user":"t-o-n-y","rank":[9,11]},{"title":"Beware: not good for kids","rating":1,"date":"27 September 2014","review":"As if the terrible voice acting, animation, and weak storyline weren't enough, this failure of a movie has subtle, but dangerous messages. Little girls will especially be influenced by the strutting and leading on and all around vain attitudes. Plus plenty of \"shut up\", \"idiot\", your so dumb, etc. The movie also portrays the man-woman relationship in a bad light - man is shy and timid and cautious, while woman feels \"controlled\" and is annoyed by pretty much everything he does. Not what small boys and girls need to see especially when there's enough of those bad examples in real life.<br><br>Go find a classic; there's nothing good here.","user":"jordanbrennan-118-699873","rank":[8,11]}]