[{"title":"No I will not","rating":4,"date":"9 September 2017","review":"\"Evet, ich will!\" or \"Seltsam, aber so steht's geschrieben\" (what a horrible title) is a German mix of comedy, drama and romance from 2008, so this one will have its 10th anniversary next year. It runs for 1.5 hours and was written and directed by Sinan Akkus, his first of so far 2 full feature films and he is also a prolific actor. And just like his second film, the focus here is all on Turks in Germany and in here it's all about them getting married. It is basically several short stories in one movie and they are all connected with the protagonists being related to each other. Which is also one of the biggest problems when it comes to realism as it's just too much to feel authentic if the people know each other. The stories include two gays who want to marry, a German man and Turkish woman, a Turkish-Kurdish relationship and that's far from all. But honestly, even if the focus here is on comedy and culture clash etc like so many other times in German films now and a decade ago, I was genuinely shocked by some parts: German men being coerced into circumcision and converting to Islam if they want to marry a Turkish woman? Arranged and forced marriages? Turkish men saying homosexuality is an illness of organs and can be cured by doctors? Bravo, great education there and very progressive thinking and still they somehow wanted us to at least not hate, not even particularly dislike the characters as there are no real clear antagonists in here. Bravo! I just can't. And another issue with the negative aspects is character development and transformation as some people in here (preferrably the old conservative men in here) change their rusty opinions and approaches very quickly for the sake of forced and unrealistic happy endings all along. But with so many German films on German and Turkish culture clashes, not everything can be on Faith Akin level. This one here definitely is not. Watch something else instead.","user":"Horst_In_Translation","rank":[0,0]}]