[{"title":"A Nutshell Review: 22 Bullets","rating":7,"date":"13 June 2010","review":"Based loosely on a true story premise where a French gangster got pumped with lead and left for dead but miraculously survived the hit, 22 Bullets is a revenge flick worthy of its Europa Corp pedigree so you'll know just what to expect - a stylish thriller filled with anti-heroes, and plenty of gratuitous violence with the charismatic Jean Reno in the role of an avenging angel out to settle scores when the perpetrators just wouldn't leave him alone in his retired life.<br><br>As the adage goes, one can never quite leave the gangland, and Reno's Charly Mattei, a once feared mobster in Marseille who signalled his retirement through the selling of his businesses to childhood friend Tony Zacchia (Kad Merad in a serious role), it's all about having a reputation that's still influential, and in order for friends to want to move along with their plans against his moral tones of zero involvement in drugs, the only way is to launch a pre- emptive strike to take Mattei out of the equation, only for the group of gunmen to fail in their quest and Mattei's reputation grows to become L'Immortel for obvious reasons.<br><br>Like the Godfather series, one may want to get out from one's violent past, but circumstances pull one right back into the thick of the action. For Mattei, it's almost giving the other cheek up for another slap when the mob goes after him in the hospital, but the last straw that broke the camel's back came from the targeting of his remaining loyal soldiers, and thus the avenging angel is born, nevermind if one of his arm is now paralyzed.<br><br>It's a story of honour amongst thieves, how some hoodlums fail to pay heed to the established rules of engagement of never crossing the line to hurt women and children, and essentially family members in their violent public spat. As for the cops led by Marie Goldman (Marina Fois), she's eager to look for an opening to avenge her husband's killing, yet bounded by duty to know that she has to keep personal and business separate. What more, it's to the police's advantage that the mob is killing one another, and thus warned to keep an arm's length at the explosive gangland war. In a strange parallel between those finding on opposite sides of the fence, it's all about doing a job, and then going home to family at the end of the day.<br><br>Directed by Richard Berry who also had a small role in the film, 22 Bullets is unflinching in its violence, and the mowing down of Charly Mattei early in the film somehow is reminiscent of other massacres such as that of Sonny Corleone in Francis Ford Coppola's The Godfather, or Murphy in Paul Verhoeven's Robocop. Don't expect Mattei to be dishing out revenge with creativity though, as his is a simple dispatch involving a signature one shot to the head, and one to the heart, two critical areas to ensure the grim reaper comes calling. There are the occasional lapses into monologues, although it does play up the fear factor here when he carries out the threat of striking when his enemies least expect him to.<br><br>Jean Reno as usual excels in this role, and you'll find yourself rooting for his character despite his flaws and what his character actually was in the past. As Zacchia puts it succinctly, a wrong is a wrong no matter what layer of morality gets draped over it. Kad Merad's Zacchia too puts in a moment of brilliance when he delivered a hypocritical speech about the value of close friendships, while his demeanour behind closed doors is anything but, lying to the masses without a flinch.<br><br>22 Bullets is a straightforward thriller that worked without too much surprises, but its slick delivery more than makes up for any of its shortcomings.","user":"DICK STEEL","rank":[75,88]},{"title":"Great ride","rating":7,"date":"16 May 2010","review":"The Immortal tells the story of an older man, Charly Matteï, who claims to have quit the mafia in Marseille, France. He has a family and lives in peace, but is suddenly shot in a serious hit. Charly is shot 22 times but, amazingly, survives. After the hit and recovery, the scarred ex-mafioso is thirsty for a bloody revenge. What follows is an intense, action-packed and bloody thriller.<br><br>The story is quite simple and The Immortal definitely has it's flaws, but overall it is an awesome ride. Jean Reno is back on track in this great French production. The Immortal may not be as good as Un Prophet but could definitely become a cult classic like the first Boondock Saints. 7/10","user":"samvanraalte","rank":[51,67]},{"title":"Interesting thriller","rating":7,"date":"24 October 2010","review":"I discovered this movie in a DVD store in South of France and after I watched the trailer and read the critics I gave it a try.<br><br>Well it is very interesting to see Kad Merad and Jean Reno in this underground thriller of the Marseillais mafia. I saw for the first time Kad Merad in a bad guy role and he played this one very convincing. Then Jean Reno was as usual great. <br><br>Director Richard Berry created here a fast paced thriller that was never boring. The pictures around Marseille and the sea were wonderful. The only thing I missed was that the story is told rather superficially. The act of revenges could have been executed variously than all the time in the same way. <br><br>My vote with my wife is a 7/10 because all in all it's another example how with a low budget a solid popcorn movie can be done. French movies are the best in Europe so far and sometimes even better than the other average Hollywood productions.","user":"Luigi Di Pilla","rank":[30,39]}]