[{"title":"A sagging mattress held up by the support cast","rating":5,"date":"9 December 2010","review":"The main protagonist of 'Gigantic' is twenty-eight year old Brian - a morose, monosyllabic mattress salesman. Some jaded film-goers might feel they've watched Brian's charisma-free loner cousins overplaying their quirkiness in far too many Indie projects. In 'Gigantic' Brian possesses the stubborn ambition to adopt a Chinese baby - a plot contrivance designed to distract from his stupefying dullness. Despite being single, earning little money and suffering from violent hallucinations, an irresponsible adoption agency is helping him achieve his goal.<br><br>The story begins when Al Lolly, an overweight businessman with chronic back problems, visits the warehouse where Brian is employed. Big Al purchases a mattress and later sends his beautiful daughter to settle the bill. When Happy Lolly arrives, she asks Brian to help transport her father to a chiropractic appointment, and while they await its conclusion, Happy invites Brian to have sex with her. He doggedly obliges in an underground car park - but their romance doesn't amount to much. Happy immediately expresses her own quirkiness with feeble attempts to escape the relationship, while Brian continues to obsess about Chinese babies. Like it or leave it - that's how love is in Indie-World.<br><br>The film's script is a strange beast - the main story is the lovers' moth-eaten love affair, but the sub-plots contain some offbeat black humor, providing John Goodman, Ed Asner, Jane Alexander, Clarke Peters and Zooey Deschanel with opportunities to create some original characters. Somehow, mysteriously, their combined talents manage to keep 'Gigantic' afloat while Paul Dano impersonates a sack of potatoes in the central role.","user":"tigerfish50","rank":[21,24]},{"title":"When \"indie\" turns irritating","rating":2,"date":"31 October 2009","review":"Incredible cast wasted in this tiresome indie comedy that wears its quirks like lead balloons. Pseudo clever dialog and over the top characters combine with heavy handed symbolism making this one a tough slog for even the most undiscriminating fan of independent film. Precious and pompous, it's one of the worst examples in recent memory of the kind of trite self important spew that exists in the fevered imaginations of hundreds of interchangeable film school grads and Wes Anderson wannabes. After too many of these you'll find yourself screaming back to the multiplex and begging for a Hollywood blockbuster to erase the memory.","user":"TestChimp49","rank":[37,53]},{"title":"A big, big love","rating":7,"date":"21 October 2009","review":"After reading the comments and reviews on this page for the film Gigantic, I felt compelled to register an account on IMDb and add my own voice to the apparently confused chorus. My reaction to the film itself was strong, but not nearly as strong as my reaction to the comments people have been adding to this page. If I had gone to check IMDb site for the film before seeing it, as I usually do, I probably would have been turned off by the low rating and negative comments, and wouldn't have ended up seeing this little gem of a film. And that would have been too bad, because it really is a nice little film; One that has qualities that apparently inspire vitriol in some viewers, but their anger and 'disappointment' just bewilders me.<br><br>What is not to like in this film? The cast is amazing. The performances are top-notch and completely appropriate for the tone that director Aselton is trying to create. I've read comments that have mentioned 'believability' of certain scenes and plot points, but I think these types of viewers were doomed to misunderstand the film from the very beginning (and isn't it always these viewers who do choose to comment? bashing on what they don't understand). And that's not even to say this is some kind of elitist 'quirky indie' film as most people suggest. It's to the point now where 'quirky' is just another derogatory and pejorative term for something outside the realm of someone's expectations, experience, and capability of understanding. It's a term the narrow-minded use.<br><br>Gigantic is well worth your time and money. It's shot beautifully. It has some great performances that create genuine laughs, not from absurdity for its own sake or from cheesy one-liners, but from the performance choices themselves and from the character development. Did I mention Matt Walsh was great as well? The whole cast is wonderful, and I personally look forward to whatever Aselton does next.","user":"ellis-rs","rank":[46,71]}]