[{"title":"Better than you think!","rating":7,"date":"28 January 2010","review":"First off, this is not any kind of interpretation of Poe's story; Modern or otherwise. The only thing similar is that the main character can hear a heart beat, sometimes. Suspense is held throughout the movie! It held my full attention and I couldn't wait to see what happened next. That's all I will say about the actual plot to not spoil anything. There is graphic violence, and overall the film has a depressing mood to it. Why then did I give a 7? The acting by everyone is great..except for the English doctor's! it was horrendous! Her lines sucked and she made me feel awkward. So bad that it takes away from the rest of the movie. Overall, a good flick to check out.","user":"rossp23","rank":[31,41]},{"title":"Don't compare this TV writer's screenplay to Poe.","rating":7,"date":"8 February 2010","review":"******* DEFINITE MAJOR SPOILERS IN THIS REVIEW ****** <br><br>Single dad Terry (Josh Lucas) lives with his young daughter Angela (Beatrice Miller) who has a rare terminal disease. Terry has had a recent heart transplant, to which he seems to have adapted healthily, but he slowly becomes consumed by the tortured persona of the heart's donor through the extraordinary heart that follows no law of nature, science or physics.<br><br>The donor was a terminally ill man who'd put his name on an organ donor list and was then prematurely murdered by organ harvesters. He died watching them murder his wife too, which gives the film its impetus.<br><br>Terry trudges through the film, coping with his psychoses, blackouts, and flashbacks of the donor's murder scene. He finds out the identities of his donor and those involved in the transplant. Discovering in a news article that the donor was murdered, he then seeks the bad guys.<br><br>The film has its \"Death Wish\" moments as Terry is quietly egged on to avenge the still-unsolved murder by the annoying detective (Brian Cox) assigned to the original homicide. As the bad guys start to die, the detective has enough evidence to bring Terry in, but actually aids Terry because he has his own reason for seeing vengeance meted out. The film tends to the morose, as Terry inexplicably morphs into a schizoid, psychological mess, struggling through his new quest. Yet there are uplifting scenes of the star's relationships with his daughter and girlfriend.<br><br>The dialog tends to drag. The plot and characters can become fairly unbelievable. Despite decent action several times I viewed the actors as if I were on a distant treetop, wondering at the lack of a sense of thrill or horror, and at how remarkably unscary and un-engrossing this film got.<br><br>Terry carries the burden of the driven, tormented heart recipient -- barely -- yet his character's dialog is handled in a heavy-handed, insensitive manner. The acting of Lena Headey as his girlfriend Elizabeth, a caring, no-nonsense physician and lover, is enjoyable. But when Headey is forced to watch horrific surgical procedures performed on her beloved Terry she is dead-pan. She may have picked up this stoic behavior from repeatedly watching Summer Glau get blown to bits in last TV season's \"Terminator - Sarah Connors Chronicles,\" canceled after one season. The attractive Headey started acting as an adult 20 years ago, has worked mostly in television, and as far as I can tell has had a less-than-earth-shattering career, despite the proclivity of directors to cast her in tight jeans.<br><br>For the vengeance to have been more credible and make more sense there should have been a stronger, more interesting, contemporaneous tie-in to the harvester ringleaders, including the surgeon. Perhaps this part could have been turned out to be Terry's cold-blooded cardiologist. Or even Elizabeth.<br><br>Ironically in the end it's revealed that the heart was ordered up by Elizabeth, who was treating Terry's daughter and became attached to her -- Elizabeth didn't want Terry to exit this planet quite so soon. She'd asked dodgy co-workers at the hospital to get her a heart, \"no-questions-asked,\" which Terry is not too happy to hear.<br><br>This ending and the final surgery was a stretch but I enjoyed it. I also enjoyed the film's rudimentary ethics question of whether murder can be condoned if it benefits the perpetuity of family. Terry seems by then to have completely adopted the victim's loss and sense of right and wrong, and it trumps his love for Elizabeth and his desire to have his daughter taken care of. Another view might be that his HEART was letting its love for its donor's wife trump everything.<br><br>The rental didn't have captioning, which made Headey hard to understand, since she spoke quickly and with an English accent. This is true of some of the other dialog.<br><br>Filmed in gorgeous Providence, Rhode Island.<br><br>I wouldn't compare this to Poe though I admit that -- for a sadistic heart thief -- death by defibrillator is a poetic one.","user":"newby_rox3","rank":[13,16]},{"title":"A riff on the Edgar Allan Poe story","rating":6,"date":"2 June 2014","review":"I liked Josh Lucas in The Client, so I chose this film as a rental. Don't ask me why because horror/thriller/blood is just not my thing.<br><br>A husband and wife die in a botched robbery, and the man's heart goes to Terry Bernard, a single father of a daughter with a degenerative disorder. Terry keeps remembering bits and pieces from what must have been the donor's last moments. He starts being able to hear his heart beat. Then he sees one of the donor's killers and does away with him.<br><br>Terry is tortured by the sound of his heart, the fact that he's killed, and the flashes of memory he has. But he continues finding the killers and getting rid of them. Meanwhile he is starting a romance with an attractive doctor at the hospital who wants to help him, but he won't tell her what's wrong. The only person who knows his secret is the officer who was in charge of the case but couldn't close it. He wants Terry to do what he can't - get justice.<br><br>You may like this if you're into horror-type films. I have to say I liked the ending very much, and it really brought the level of the film up. And the story is intriguing.<br><br>This could have been a bigger, better film, but given its budget, it does well enough.","user":"blanche-2","rank":[5,5]}]