[{"title":"Terrible - Tries WAY too hard to be American Pie","rating":1,"date":"18 September 2008","review":"I want my 80 minutes of life back, this movie tried so hard to be American Pie and pretty much every teen/sex/stoner comedy and ends up failing hard with a lot of unfunny, recycled/stolen jokes. Yes a guy shaves his pubes and suffers the consequences, just like in American Pie. Yes that's how awful it gets with blatantly trying to be other movies.<br><br>The characters were even worse, so blatantly ripped off and supposed to be teenagers but played by a bunch of 20-something year old nobodies who are still trying to get their careers started. There's the womanizing wild jock (gee sound familiar?) The innocent virgin guy waiting for the right one, the weird dad offering awkward sex advice to his son, the wild guy who wants to change for the right girl, the hot sex-crazed foreign exchange student, the stoner guy, etc etc. I think you already know where this is going.<br><br>I liked American Pie, 40 year old virgin, etc, I wasn't expecting a huge epic plot or anything, just to have a couple laughs, but I can't laugh at ripped off jokes and characters when it wasn't even a parody movie, and I can't even criticize it anymore because I've addressed pretty much everything and don't even think it deserves another paragraph. Don't even bother renting it.","user":"mrwhopee","rank":[16,19]},{"title":"Ugh.","rating":3,"date":"8 September 2008","review":"I like sex-comedies. I do. If right, they can be really funny. American Pie is the example most people will give, and it is one of the best of it's kind. Even early sex comedies from Lloyd Kaufman, like the First Turn On! or Waitress. But this time, it's just getting annoying. Annoying characters, unoriginal storyline, unfunny jokes (although one your mom joke was hilarious), and so many more flaws. The story follows a geek who isn't getting any, and he is in love with a more popular girl, who he is friends with. Sound familiar? So, the geek's friends tell him he needs to have sex and blah blah...what do good friends do? They pressure their friend into having sex, and movies like this is probably why teens feel they need to have sex. Movies like this portray that this kid is a geek, until he has sex. And you may say, hey, in American Pie, they pressure the geek to have sex too! But that had a much better story, and actual funny jokes, and we can get on that subject another time. So in this movie, everyone gets foreign exchange students. The geek's student tries to screw up his life. In the end, you don't even like ANY of the characters, they are all really, just annoying. Just, I recommend avoiding this film. It is another teen sex comedy wanna be that steals it's ideas from every comedy ever.","user":"whammy666","rank":[19,28]},{"title":"An actual teen movie...","rating":6,"date":"7 September 2008","review":"This is the first teen movie where all the actors actually are and/or look like teens. If you are looking for a movie with \"American Pie\" humor, then continue searching, because this movie can not compete with \"American Pie\" humor. Don't get me wrong, I am not an \"American Pie\" fan but those movies are WAY more funny then this one.<br><br>This movie does not have any exaggerated scenes, everything you see could have happened for real. So don't expect any \"Scary Movie\" scenarios.<br><br>There are a few funny lines that I will never forget, like this one \"Searching for a good girlfriend is like searching for a good used car, if the oil smells funny, there is something wrong with the vehicle.\" I gave this movie a 6 because I didn't laugh once. I smiled a couple of times but that's it. This is not the movie you want to buy, rent it, and only if you like high-school-movies.","user":"jellemees","rank":[15,24]}]