[{"title":"For the Residen Evil Fans","rating":7,"date":"8 December 2008","review":"It is important to remember It is important to remember that this is a fan movie. For someone like me it was great fun to be reunited with characters one played in the games. Much to it's defense this production stayed more true to the atmosphere in the games that recent flicks, something every Resident Evil fan will recognize. As for those of you not familiar with the games I won't vouch for the movie, but you may have a enjoyable time watching it anyway.<br><br>For the tec stuff. Graphics are all there although some of the animation could have been done better. This is not Pixar quality people say, but do have in mind the type of budget Pixar and the like have to work with.<br><br>All around a decent go at bringing a game legend to the animated screen.","user":"Rastelin","rank":[49,66]},{"title":"Captivating CG movie full of zombies, do watch this one, even if not a fan of the franchise","rating":9,"date":"4 December 2008","review":"Alright, THIS IS NOT A FAN REVIEW (for the people complaining that the score is caused by fan reviews) saw the movie and i have to say, i agree with the fan guys, its really good. Keeps you glued to the screen from start to finish with is action sequences and calm moments alike. The plot is beautifully twisted and the CG is top-notch (although the walking animation is a bit awkward at places). You'll see some old friends and some new faces as well (Angela looks marvelous in the SRT outfit :P). Compared to the films with Mila Jovovich i'd say this (though shorter) is definitely better - a bigger punch in a smaller package.<br><br>see this one if you already haven't, its definitely worth it. ill be buying this when its out on DVD for sure.","user":"aghentik","rank":[84,120]},{"title":"From someone familiar with Resident Evil....","rating":9,"date":"4 December 2008","review":"It is my opinion that this movie is quite excellent for what it is...and it is a \"survival horror film\" - and, at that, it is inspired with by a lot of information in the RE games.<br><br>From the standpoint of a Resident evil fan, I was so incredibly frustrated with the Paul Anderson films. I mean, it's like the dude never even heard of Resident Evil. Somehow, though, he's made three films about it. He doesn't follow the storyline of the games. I really wish that they would pull the plug on \"Anderson\" and make another animated film. It would be especially cool if they based the next animated film on events involving background (or continuation of) the upcoming game RE5. The games Resident Evil 1-4 + Code:Veronica - all of them had interesting story lines. The books written by SD Perry had interesting story lines and were well written. Anderson is not a good movie maker.<br><br>But I digress...<br><br>From the standpoint of an avid film watcher...the animation was excellent, the storyline was interesting, and the voice acting was good. I can see how this movie might seem a little campy or bland if you don't like survival horror movies or concepts, but I liked it...a lot.<br><br>If they had added an hour to this film and filled that hour with \"flashback sequences\" or something similar that explained more about the background of the story I think it would have been a superb, top notch survival horror film. I really hope they make another...<br><br>-neo P.S. Nice job Shotaro Suga!","user":"neomage23","rank":[72,113]}]