[{"title":"Nothing Original, But Undeniably Entertaining","rating":8,"date":"19 April 2009","review":"In recent years, there really hasn't been many truly great action flicks to warrant fans of the genre to go to the theaters. Sure, there has been a few entries in classic action series like Rambo and Indiana Jones hat met with varied success, but not much in the line of fresh new flicks has been produced (Except the awesome Crank). Thus we come to a film that really garnered next to no hype and slipped quietly into theaters, 12 Rounds. Is it the movie action fans have been yearning for? Danny Fisher, played by WWE superstar John Cena, is a New Orleans detective faced with a problem: an old terrorist named Miles he arrested a year back has broken out of jail and has taken Fisher's girl. Now the only way to get her back is to complete 12 rounds of a \"game\" that Miles created to finally get revenge on the cop that ruined his life. It's an unlikely scenario to be sure, but hey, this is an action flick, so it's just preposterous enough to make for an interesting plot. The thing I don't understand though is the fact that in the trailer for 12 Rounds, it is said to be directed by the same director who did Die Hard 2, and produced by the Speed producer. Why is this odd? Well, it is obvious right from the start that 12 Rounds is a blatant rip-off of Speed right down to some scenes being near carbon-copies. Well, at least they ripped off the cream of the action genre crop I guess.<br><br>One of the major compliments I feel I have to give to the filmmakers comes in that no noticeable CGI was used anywhere in the movie. CGI has been overused way too much as of late, so to see an action movie with good ol' fashioned stunts and explosions is great. What's better than no CGI is how all the action is done incredibly well. Between great car chases, huge explosions, and nicely choreographed fights, it's a feast for the eyes. Of course, all this awesomeness couldn't just stay awesome thanks heavily to the awful camera-work. Similar to Quantum of Solace's quick cuts and shaky camera during action sequences, 12 Rounds makes it difficult at times to tell what the hell is going on. I don't see what is wrong with traditional camera-work where viewers can actually enjoy the high-quality special effects since they can be seen in all their glory, but I digress.<br><br>Honestly, there really isn't much to say about this one. If you are an action fan that has already seen every Stallone and Schwarzenegger movie under the sun, then 12 Rounds is sure to entertain on a rainy afternoon. Granted, it doesn't bring much to the table in terms of new concepts or anything like that, but it's entertaining, and that all that really matters, right? Again, it's a complete and utter rip-off of Speed, but it's a damn fine rip-off, and I would be willing to call this Speed 2 more than that pathetic piece of crap film with the cruise ship. After jumping to conclusions when I saw John Cena as the star and it being a WWE Production, I was genuinely surprised by the entertainment value found within, and I think that if viewers go in with the right mindset, they too will have a great time.","user":"MoronUnited","rank":[40,58]},{"title":"You'll be surprised","rating":7,"date":"20 March 2009","review":"As you may or may not know John Cena's film '12 Rounds' was released in Australia on the 19th of March.<br><br>Just got home from seeing it and i have to say it was great. Good, solid movie all the way through. Having Renny Harlin as director obviously helped make this a much better effort than previous WWE films. Don't want to give away too much cause i really think people will actually like this movie and that they should go see it. Good cast - Brain J White was by far the stand out. But I have to say John's performance was so much better this time around and you really can notice a difference between his acting ability in '12 Rounds' and 'The Marine'. He's not as tense and you can actually believe what he's saying. There are little tiny things (maybe like 2 moments in the film) that your like 'as if that could really happen' but the story keeps you too focused to really care.<br><br>If you like car chases, you'll like this. If you like John Cena, you'll like this. If you like a little Drama/Romance (Ladies?), you'll like this.<br><br>Go see it, I swear you'll be surprised.","user":"Fruityloops_2002","rank":[78,121]},{"title":"Really exciting","rating":7,"date":"30 March 2009","review":"The movie has a good idea and some really seat-gripping excitement. It reminds me of Die Hard with a Vengeance but even more exciting. The plot is good with enough twists to keep everyone's interests.<br><br>I have only one negative thing to say...and this is that I hate the type of camera work in this movie. It seems to be the latest rage in movies...to have jerky-action shots. Personally I think it looks amateurish and makes the watcher slightly nauseous. What a shame to do that to such an exciting film.<br><br>Even with that type of photography, I would still recommend this film and have done so. I had never seen any advertising for this film and would not have gone to see it had I not looked up a synopsis of it.","user":"oahumom","rank":[38,56]}]