[{"title":"Huge Stone Fan, but this is Stone at his lowest.","rating":3,"date":"23 January 2009","review":"Preface: I'm a huge Oliver Stone fan. HUGE. I even wrote a 20 page paper on the relationship between Platoon and the American psyche regarding the Vietnam War. However, .... In his latest film, Oliver Stone forfeits the insightful, truth-driven film-making that has made him famous for normal, good ol' American profit-driven propaganda (if not tabloid fodder for the masses). <br><br>The representation of Bush and his actions border's on the absurd. I am no Bush fan, but this film seems to be nothing more than a means of gratifying all those who yearn for a simple movie that reinforces, rather than questions, all their ignorant beliefs about very complex issues. Example: Bush recklessly invades Iraq without any reservations. None. His rational, according to Stone, has more to do with his ego and his quest to prove himself to his father. Fact: Even Clinton voted for war in Iraq. The majority of leaders in the US thought that Iraq posed a legitimate threat.<br><br>The film's motto: \"Hate Bush, and America is not to be blamed.\" That is exactly what the Germans did after WWII. As stated, I'm no Bush fan, but this film equates to political propaganda, and I reject propaganda, whether it is from Bush or from Stone.","user":"leitner43","rank":[16,18]},{"title":"A Fair And Balanced Portrait of a... Fairly Simple Man","rating":7,"date":"12 October 2008","review":"This is a very good movie, but not the classic it wants to be. It's funny and tragic, although not too informative if you've read a newspaper with any regularity over the last eight years. In short, there are no surprises.<br><br>Josh Brolin gives an excellent performance as W., and the supporting cast is generally superb, although Jeffrey Wright, Richard Dreyfuss, and James Cromwell particularly stand out. Thandie Newton is hysterically funny as Condie Rice, but it's an SNL-type parody, not an emotionally honest performance.<br><br>The film is obviously meticulously researched and carefully considered, which is why the sequences that are clearly either utter conjecture or merely political finger-pointing stand out by a mile.<br><br>Bush -- whom I personally despise for his offensive combination of idiocy and self-righteousness -- is treated with fairness and sensitivity. The effort here is obviously to fashion him as a tragic hero; a man who genuinely wants to do good but simply doesn't grasp how hard that is, especially when surrounded by the likes of Karl Rove and Dick Cheney (who is, very specifically, the villain of the piece, as he is in life). And it generally works. I found myself feeling bad for the poor guy.<br><br>However, while trying to make W. a sympathetic character, Stone pushes his theme -- \"It Was All To Prove Himself To Daddy\" way too far. He overplays his hand, including a mood-breaking dream sequence near the end. There simply has to be more to George W. Bush than that..... doesn't there? The film ultimately plays much, much better when Stone relies on actual transcripts and information gathered by experienced reporters, and those sequences, whether they are cabinet meetings, press conferences, or more personal moments, snap and zing.","user":"doubleosix","rank":[265,443]},{"title":"Uncomfortable","rating":8,"date":"27 October 2008","review":"One word sums up how I felt while watching W: uncomfortable.<br><br>I went into this film expecting more of an absurdist comedy than a tragedy. The level of realism was far beyond what I expected. For the most part, the cast, makeup, and casting crew did such a good job with the characters that it was very easy to imagine that these were not actors on the screen but the actual people. Josh Brolin's characterization of W was certainly Oscar-worthy.<br><br>Even better than Brolin's part was Phedon Papamichael's photographic direction. The job of the Director of Photography is to bring the story to life through the creation of images to draw the attention of the viewer where the Director wants. Few films are as good of an example of this as W. Papamichael used the camera to force moral and emotional perspective in a way that I have rarely seen outside of the films of Stanley Kubrick. I've only seen the film once, viewing it as a complete work. I intend to watch it again to study the photography.<br><br>Overall, I thought the film was fair in its treatment of the actual people involved. The most ardent Bush supporters will not like it, but to still be that supportive of him in the final months of his second term, you either have to not be paying attention or be uncritical in all of your thought. While artistic license was taken throughout the film, the portrayal of all events and people, with the possible exception of Dick Cheney, were far more grounded in reality and recorded history than I expected.<br><br>The film made me uncomfortable on multiple levels, which is why it succeeds and deserves such a high rating. The portrayal of Bush's relationship with his parents, especially his father, forces the viewer to feel sorry for him. The overt religiosity that pervades the public service portion of his life must anger anyone who believes strongly in the separation of church and state. There are many moments when, with any other characters, the film should have generated much laughter. Only one moment in the film actually caused more than one person in the theater to laugh. I guess 4000+ dead soldiers drains the humor out of even the most hilarious gaffes.<br><br>I would recommend this film to anyone who wants to see a realistic portrayal of historical events. I wish Stone had waited until Bush was out of office to make it, though. While it captures the major events that were involved in building the Bush legacy, it ends far too early.","user":"robertgrimm-1","rank":[124,200]}]