[{"title":"two solid leads but the results are underwhelming","rating":13,"date":"13 June 2009","review":"It started like any ordinary day; that's likely what N.Y.C. subway dispatcher Walter Garber, an employee of questionable character, was thinking when he got up and went to work in the morning. Little did he know that he'd become the confidant and \"stand-in\" hostage negotiator for a prickly criminal mastermind who takes over the Pelham subway train and demands money in exchange for the lives of its passengers. Hearing the names Washington, Travolta, and Scott creates a lot of anticipation, but unfortunately what wants to be a slick combination of suspense thriller and character study instead results in a ponderous film with a weak setup, predictable plot twists, shallow characters, and little tension. It's easy to watch with actors of Washington and Travolta's caliber at work, but Scott's direction is pretentious and throws out some obligatory action scenes that seem to exist for the sole purpose of padding the time on the way to an expected climax. The leads do what they can with the strained material but really deserve better. **","user":"Special-K88","rank":[116,150]},{"title":"Decent entertainment, but doesn't hold a candle to the original","rating":6,"date":"13 June 2009","review":"I went to the this most recent remake of Pelham 1-2-3 (most don't even recall the made-for-TV version filmed in Toronto - with good reason) with an open mind. I was weened on Godey's book when 8, and saw the original film when it was released a few years later. I've committed practically every line and scene to memory. I'll admit.... I'm biased. I felt the original could not be successfully remade... the gritty feel, the outstanding David Shire soundtrack, the believable performances of the ensemble cast..... and I was right. I did not go into the theater hoping to hate the remake, but instead to like it. I REALLY wanted to like it. I have always enjoyed both Denzel Washington and John Travolta in their various endeavors and thought the chemistry might work fine here. While entertaining, it became almost tiresome after a while. I felt no tension, no \"edge of the seat\" sensation that the original brought, I found myself disliking most of the characters and really not caring what happened to them. It passed the time, had some thrills, but that was about it for me.<br><br>The '09 version is entertaining, with some excellent action scenes and more than a few decent dialog exchanges between characters, but it is nothing more than a Tony Scott action movie dressed up as \"The Taking of Pelham 1-2-3\". While starting off liking Washington's character (now disgraced MTA administrator-turned dispatcher Walter Garber, as opposed to Detective Zachary Garber in the book and original screen incarnation), I found, as the movie progressed, that he went from believable to just another two-dimensional action movie hero who, if he was what as he really started out as being, would not have ended up doing what he did in the film. Sorry, no spoilers here gang. You'll have to go judge for yourselves.<br><br>Travolta was dynamic, putting in a great performance, but I found his manic characterization not befitting as the supposed master-mind of the criminal plot involved. Remarkably, there were three other hijackers in the movie. I don't know why Scott even bothered including them. They were not only ineffectual characters with lackluster performances, but totally lacked the dynamic presence and interplay between the hijackers of the original film so much so that you barely even noticed them - or cared. Oh well, I guess it would not have been practical with only one hijacker....<br><br>The dizzy camera-work and stylized production were tedious at times and distracting. The soundtrack was, IMHO pure garbage.<br><br>Like I said, I found it entertaining, but despite some opinions that the \"updated\" and \"freshened\" plot was exhilarating and an improvement on the '74 incarnation, I honestly don't think the Matthau/Shaw/Balsam version need worry about being eclipsed by this remake. Go see it though, as it is fun summer fare and if you have no ties to the original, you'll probably find it relevant. Afterward, do yourself a favor and rent the original. You'll see the way the story was meant to be done.","user":"pacdm","rank":[107,143]},{"title":"Forced action scenes and nonsense script ruin what could have been a good thriller","rating":4,"date":"27 October 2009","review":"WARNING! MAJOR SPOILERS! This film started out good, but it soon became clear that the director (Tony Scott) and the source material had a bit of a falling out somewhere along the way.<br><br>The story was obviously meant to be a sort of a low-key thriller, where most of the action takes place on a psychological level, in the interaction between the hostage taker (Travolta) and a hapless train operator (Washington) who happened to be on the shift when the takeover took place. And at times, it is exactly that. The scenes where Travolta forces a confession out of Washington and offers hostages in exchange for the mayor (the Soprano guy) were great. This is where the movie shines, where it's the way it was meant to be.<br><br>However, Scott apparently thought this tension-filled psychological mind-game would be too high-brow for the average consumer. So he decided he must do everything in his power to make the sucker more EXTREME, you know, the way modern kids like it. And how in the would would a prolific Hollywood director like Tony Scott make a bunch of tension-filled conversations more exciting?<br><br>You've guessed it. This is yet another modern movie suffering from the infamous shaky camera syndrome. If you enjoy your POV flying loopdeloops around the room, shaky closeups of character faces and stop-motion intermezzos (and all that during an average dialog scene), you're in for a treat. A direction style normally reserved for action scenes was used to effectively detract the viewers' attention (and source of their tension) from the events inside the plot to the director outside it.<br><br>Scott obviously knew this, which is why he made sure the little action this movie has (and NEEDS) is as EXTREME as humanly possible. Thus, a simple matter of transporting two bags from point A to point B is turned into an idiotic and completely needles car chase, that destroys more property than there's money inside the bags. Then, there are Travolta's nameless henchmen, who are apparently there solely to die gruesome bloody (and EXTREME) deaths. And finally, there's the main bad guy himself, who isn't content to simply head-shot his helpless victims but must empty his entire clip into their jerking bodies, while droplets of blood and guts spray over the screaming hostages. EXTREME!<br><br>Really, if Tony Scott wanted to make an action movie, why he didn't just order an action script? It's not like he's some rookie who must film whatever is given to him.<br><br>Speaking of the script, forced action is hardly the only thing wrong with it. Throughout the movie, police snipers have hostage-takers in their sights and can end the crises in the moment they are ordered to shoot. But for some reason, no one gives the order, nor is anyone apparently in charge of giving it (where is the police captain coordinating the hostage negotiations and SWAT shooters)? What government would rather pay millions than try a rescue operation if there's even the slightest chance of success? And where's the FBI and SEALs taking over and icing Travolta in a minute?<br><br>On the other hand, why bother at all? Very soon, the police finds out identities and faces of everyone involved in the heist. With traffic cameras on every street corner and other assets of the 21st century law enforcement, the criminals are screwed, whether they escape the train or not. Doesn't Travolta know that? After becoming a YouTube legend, how long would it take someone to recognize his face and twitter him over to the police (LOL ITS THE SBWAY DUDE !1!!)?<br><br>Considering all this, you'd think the bad guys must have a really good reason for engaging in such a risky enterprise. And really, throughout the movie, Travolta makes it a point to portray his character as a desperate man living on the edge, staking his life in an all-or-nothing game against the might of the city that had let him down. Only later, we learn his entire scheme-within-the-scheme depended on him investing $2 million from an earlier robbery, so he could make hundred times as much on the market, when... wait, what!? He'd rather risk his life, kill a bunch of innocent people and spend the rest of his life in hiding, than retire with *just* two million!? That burning urge that drove him through his crazy scheme wasn't idealism or revenge or even the simple desire to get rich, but the desire to get even RICHER!? He must be the craziest, greediest, most idiotic millionaire on Earth. And a douche bag to boot.<br><br>These baffling inconsistencies in the plot make much more sense when we take in account this is a remake of a movie originally published in the early 70-ies. Back then, they didn't have the Internet, cameras and Nazis in charge of airports. The bad guy actually had a chance of getting away with his ingenious plan. The least script rewriters could have done was give Travolta and his men masks, or some other way of concealing their identities.<br><br>On the other hand, watching a pair of eyes talking into a radio for 90 minutes would have hardly made for an exciting film, so I guess I can see why they decided to sacrifice believability for the sake of character interaction. Now if only Scott would slow down the camera enough so we could actually see that interaction...<br><br>So, was there anything good about this movie? Surprisingly Travolta's acting. All the Scientology stuff aside, you can see why he was once considered an A-class star. Great job. Washington was very good too, you can really tell the panic taking a hold of his character when Travolta forces him to confess. As I mentioned earlier, radio dialogs between the two of them were truly the highlight of this movie.<br><br>Too bad the rest of it was sacrificed on the altar of blockbuster popcorn fun.","user":"funero","rank":[21,25]}]