[{"title":"Not trashy enough.","rating":3,"date":"19 July 2010","review":"OK, I understand that this is supposed to be a throwback to the Golden Age of Grindhouse Sleaze, but it follows the recipe a little too well for my tastes. Lots of needless exposition between the few action scenes means that you lose attention (and sympathy) pretty quickly.<br><br>And like the grindhouse flicks, there's quite a bit of 'cheating' in the film. The camera always cuts away from the money shots, so you get plenty of shots of someone sticking a gun in someone else's face and then getting blood spattered on them in a reverse shot. It reminds me of something you'd see in \"Sorority House Massacre.\" <br><br>And as far as nudity or sex, there's not really that much.<br><br>Overall, the discomfort this film might generate is pretty weak. Go see a true exploitation film, like \"Hanger,\" if you want to see this sort of thing done to the extreme.","user":"innocuous","rank":[19,23]},{"title":"A not bad throwback grind house revenge flick with heart","rating":6,"date":"19 December 2009","review":"Some Spoilers may follow<br><br>Catherine and Rebecca are two Catholic schoolgirls, whose day takes a severe turn for the worst when they knock into the wrong home while selling bibles door to door. Running afoul of depraved pimp Lobo and his equally vicious gang, Catherine and Rebecca are defiled and Catherine is left to die. Catherine vows revenge, and resolves to make the scumbags pay for their deeds....<br><br>Run Bitch Run from the trailer looks almost like a Black Dynamite style parody of exploitation flicks, yet the film itself is actually a heartfelt homage to the genre. It's not nearly as tongue in cheek as one would think from viewing the trailer, and has some dead straight nasty scenes, including one iconic scene that will do for guys in the 00's what I Spit On Your Grave did for guys back in the '70s.<br><br>Although it suffers from a rather meandering middle and randomness,(Possibly due to budgetary constraints) it's overall a solid and entertaining enough homage to grind house trash cinema, and director Joseph Guzman is obviously an exploitation fan as he has a great eye and the film has a pretty kick ass feel for the era.<br><br>Overall, it's flawed in parts, and its biggest flaw is that it's actually rather restrained violence-wise, but it's still an enjoyable contemporary exploitation flick, and worth checking out overall for fans of the genre.<br><br>It's got a cool score and all so overall, grindhouse fans could do worse.","user":"Corpus_Vile","rank":[40,58]},{"title":"One of the best exploitation horror films i have seen!!","rating":7,"date":"11 February 2010","review":"I watched Run! Bitch Run! last night and i found it to be one of the best exploitation horror film i have ever seen. It is about two innocent teenage catholic schoolgirls, who are trying to sell religious books from door to door to try and pay for there education. But things start to go very wrong when they arrive in a certain neighbourhood and happen to knock on the wrong door. The two schoolgirls are confronted by en evil woman called Marth and a psychotic man called Clint. One of the girls Rebecca is raped and is left for dead. But the other girl Catherine happens to awake, and she wants revenge. I found this to be a disturbing film at times, because of the sexual violence in it. and some of the sex sences were also disturbing. It reminded me of some of the horror films from the 1970's such as I Spit On Your Grave, and The Last House On The Left i would recommend this film to people who enjoy exploitation films. 7/10","user":"MovieGuy01","rank":[13,18]}]