[{"title":"At least it is talking about the next big thing","rating":10,"date":"28 January 2009","review":"I love the critic who gave this two stars: they only have one review, and they lump Flow, Sicko, No Logo together under the title of \"Anti-capitalist\" - they are more than entitled to their opinion, but rather like those who dismiss environmental damage as a necessary collateral of feeding the masses, so water is just water, huh, not THE commodity of the 21st century?<br><br>Should it be privatized? Should it be run for a profit? Why do I pay taxes? <br><br>Given that water is the ultimate human need shouldn't it be the most carefully guarded human right? At least Flow starts to ask and raise these questions.<br><br>If you thought An Inconvenient Truth was an eye opener Flow will change forever your awareness of water issues.If the purpose of this type of documentary is to raise awareness then it succeeds. Massively.","user":"intelearts","rank":[16,17]},{"title":"Required Viewing","rating":10,"date":"2 April 2008","review":"I saw a screening of FLOW at AFI Dallas, and it's one of the best documentaries (perhaps even THE best) I've ever seen.<br><br>The film covers a lot of ground. In fact, Salina probably could have made a series of films from her research. But instead she's managed to condense it down to a very watchable hour and a half. As she said in a Q&amp;A after the screening, she realized during her research that although there is a wide range of water problems spread all across the globe, they are all connected, and it's important to look at the big picture. And from the viewer's perspective it's also interesting to see the connections between water problems in communities in India or Bolivia where privatization is putting poor communities in serious danger and communities in Michigan where Nestle is stealing water from the aquifers without paying a penny.<br><br>And, like any good documentary, this one doesn't stop just after presenting a problem; it also talks about how communities are fighting back, providing inspiration for viewers to take a stand as well. This film should be required viewing.","user":"dedalus626","rank":[14,16]},{"title":"A must see","rating":8,"date":"11 November 2008","review":"This film is as important, or maybe even more so, than any film you will see this year. While, most of us go to the theater to watch make-belief and whimsical movies, it's also nice once in a while to see films which touch us all as a human race. I see someone mentioned that this film is blatantly \"one-sided\" - well, it should be. Water is what we all need to LIVE, simple as that. When major corporations around the world start to get control of this natural resource: there is a problem. If a company can create a movie that can justify the other side of this issue, being the killing of young children through bad water in other places of the world then I'd love to see it. The movie was not \"anti-capitalist\" - it was \"PRO-Human\" and believe me, I'm no tree-hugger, in fact, I'm all business, all the time. But when business hurts innocent people...then there is a problem. This movie is about the growing issue of lack of water, an issue that will be growing in the next few years. A must see, in my humble opinion.","user":"samodelsearch","rank":[9,10]}]