[{"title":"Mediocre horror with beautiful cinematography.","rating":6,"date":"13 October 2008","review":"Female directors are too rare, particularly those willing to approach the horror genre. Walsh uses the beautiful Western Irish coast to create a bleak atmosphere of isolation and vulnerability. The plot is somewhat obvious, a young couple move away from the bright lights of London to raise a family, the wife is pregnant, and the husband has inherited his childhood home in Ireland, but the neighbour's child Daisy is suspected of being a fairy changeling, born in a fairy ring on Halloween. The Neighbour's son is killed under mysterious circumstances and the parents are soon to follow, the child is then adopted by the London couple, the motivation for this aspect of the plot is addressed but remains unconvincing. The superstitious locals become increasingly scared of young Daisy. The film lacks originality but has some redeeming qualities, the child actress Mhairi Anderson who plays Daisy is remarkable, providing a genuinely disturbing performance, the cinematography and score combine to give the film a unique character that is tense and compelling. The theme of fairies and the supernatural remains unaddressed which is frustrating, it is never made clear whether the girl suffers from autism, is very disturbed or is really a fairy changeling, a question left unanswered deliberately by the director, but in a clumsy way, that doesn't encourage the audience to feel sympathy for the girl, who is properly identified neither as victim nor as aggressor. Despite the flaws The Daisy Chain, a combination of Straw Dogs and the Wicker Man, is a beautiful and at times moving addition to the horror genre.","user":"Survive_Kino","rank":[32,36]},{"title":"Intelligent horror that reminds us of what it is to be different","rating":9,"date":"18 October 2008","review":"What a strange and beautiful film this is. An intelligent horror with the underlying themes of motherhood and loss. A movie that reminds us all of what it is to be an outsider in a tight knit community and what it is to be different. Morton plays outsider and expectant mother Martha who has lost her first baby through cot death. Pregnant at the time of filming this is a brave choice for Morton who looks amazing!!! Steven Mackintosh plays the steady school teacher husband Thomas. A departure for Mackintosh and one that shows just how wide a range he's capable of playing. Into their lives comes a young girl called Daisy. This role is played by Marie Anderson who's first film this is and although mostly silent throughout she is riveting. She sets Morton and Mackintosh against one another as she inhabits their every waking hour and we slowly start to fear for their unborn child. The wildness of the landscape adds an eerie dimension against which the story is played out. Is Daisy the uncared for child that the community have abandoned or is she the fairy changeling that some say she is????","user":"gretago","rank":[24,32]},{"title":"A haunting and beautiful film that will stay with you for a long time","rating":9,"date":"12 October 2008","review":"I saw this film at a sold out screening at the recent Raindance Film Festival. It is a beautiful piece of work both haunting and affecting. Samantha Morton gives an amazing performance as does Steven Mackintosh but it is newcomer Mhairi Anderson's perfectly judged performance as the waif Daisy that stays with you and keeps you guessing right up until the end. Shot in the magical but often bleak landscape of the West of Ireland this is a haunting and beautiful film that will stay with you for a long time. Another very very fine film from one of Europe's finest female directors whose individual voice and point of view is always interesting. Congratulations.","user":"johnnyd2","rank":[27,37]}]