[{"title":"Paranormal Activity or Paranormal CRAPTivity is an illogical, dumb movie.","rating":1,"date":"1 November 2009","review":"Paranormal CRAPTivity is a great idea. I was so psyched to see it, but it doesn't play out. The marketing got me and a lot of other butts in the seats and I say good for the filmmaker, he made this piece of crap, sat on it for years, was told by everyone it was crap and they couldn't sell it, then along came Spielberg and finds the marketing angle, Let's pull a Jackass but show the audience terrified instead of laughing. I just wish they had a better movie to begin with.<br><br>Anyone who has had to canvas a house knows you turn on every light in every room you pass as you explore the room.<br><br>When a noise is heard he has the presence of mind to grab the camera turn on it's light but not bother to flip on the stair lights on his way down?<br><br>When you exit the couples bedroom there is a room on the left that was NEVER entered. The door is open, but they just walk past it.<br><br>At another point he exits the bedroom and b-lines for the far left room without turning on any lights?<br><br>When he looks in the attic his only light was the camera light, he then gives her the camera so he can explore the dark attic, HE HAS NO LIGHT???<br><br>Why wouldn't he want to call the Demon dude? Why would she be against the camera? Their motives are questionable.<br><br>If I have a camera on us and I find the misses outside in the cold (AND she doesn't remember it), I'm checking the footage the following day to see what time she got up. That's when I see her standing there. I'm thinking this chick is gonna kill me, and I'm calling her mother or her sister.<br><br>Another thing, they don't have a 9-5 job, why not stay up all night?<br><br>Top 10 things to do when things go bump in the night.<br><br>10. Grab the camera turn its light on but don't bother to flick a light switch when you pass it.<br><br>09. Give only light source back to girl and find photo in pitch black attic.<br><br>08. Don't examine tape when girl sleep walks. If you do don't worry that she's standing over you for 3 hours.<br><br>07. When you get phenomenal footage of your girl getting drug to another room, do nothing with the footage and spend another night in the room.<br><br>06. When your girl has a mysterious bruise/bite don't bother taking her to the ER. You probably don't have insurance anyway, this isn't Canada after all.<br><br>05. Don't bother to get a dog for protection. Despite the cat statue on the fireplace, you hate animals anyway.<br><br>04. Take a big interest in girl's demon, but refuse to call demon guy, you're too rich to afford that.<br><br>03. Find footsteps on floor and get great footage of it, but don't call media or police.<br><br>02. Make sure the 'chosen one' sleeps next to the open door. NEVER offer to trade spots with her or lock the door.<br><br>01. Don't Google anything until act three, research is a waste of time.<br><br>00. Keep the hardwood floors clean, because the most interesting thing about the movie was when I turned to the wife and said, \"Those are nice floors,\" and she said, \"I was thinking the same thing.\"","user":"VinceRocca","rank":[253,370]},{"title":"Wonderful Under Certain Conditions","rating":8,"date":"30 October 2009","review":"PARANORMAL ACTIVITY is THE most popular movie of the year and will ultimately be regarded as one of the best horror movies of all time. Therefore, PA has warranted a HUGE debate on whether it sucks or not.<br><br>Under this pretense, I have divided this review into 3 sections: 1 for the things in the movie that work, 1 for the things that don't, and 1 for the summation.<br><br>******THE GOOD******************************<br><br>1. Originality - not a cheap knockoff or a member of Hollywood's non-stop horror remake/reboot wave. That is a game winner right there! Comparable to the Blair Witch Project, PA has received a lot of flack as being a rip off of BWP. Taken into consideration, the film's only real similarity to BWP is the use of home camera/1st person footage, and non-professionals inducing reactions from the supernatural world. That said, you have to answer yourself a question: Would you rather see another Texas Chainsaw Massacre remake, or a completely original off-BWP type film?<br><br>2. Suspense and Tension - the film does not rely on cheap scares and loud noises deafening you to induce the desire reaction of fear. Nor does it have the smallest fraction of gore/sex/exploitation compared to most of today's horror movies. If you prefer horror movies that usually don't stick with you and follow you out of the theater, then skip it by all means. The film gives you a few inches, and leaves your imagination to finish the mile.<br><br>A suggestion on viewing the film: If you want to get the most out of Paranormal Activity, then DO NOT see it in the local theater on a Friday night. We all know what happens when you are in a theater with middle and high school kids during a horror movie. To fully immerse yourself in the movie, see it with your significant other, by yourself, or with just a couple of friends at a time when the theater is the least crowded. Try to see it at night, or at home in the dark. This film invades the sanctity of one's bedroom, and the old tactic of pulling the covers over your head doesn't work.<br><br>3. Special Effects - even on a small budget, the film provides some very impacting scenery. Some effects are blatantly obvious, and some of the best effects are actually the most subtle. <br><br>4. Acting - the movie is well acted considering it is full of unknowns. The characters are not obnoxious like most horror movie protagonists. They appear genuine and very convincing in most of the film. But in some scenes, not so much. More below.<br><br>5. Plot - there is a pleasant (oxymoron) surprise with the direction the film went regarding the source of the phenomena. It's not your typical ghost or haunted house story. I will not embellish on this as it will spoil the movie for those who haven't or are deciding to see the movie.<br><br>******THE NOT SO GOOD***********************<br><br>1. Writing - this is actually a 50/50 split. The 'supernatural' scenes are very convincing considering the subject matter, whether scripted or improvised. However, the dialog and character motivation/action during the 'down time' is unrealistic at times. This is a large complaint by those who didn't like the movie. Although the film is a large departure from teen filled slasher movies, the characters at times seem to be just as brainless as the teens getting whacked by Jason. There is a lot of \"WHY DIDN'T THEY JUST....?\" scenes in the movie.<br><br>2. Acting - like the writing, the acting seems to suffer in the 'down time'. Fortunately, during the important (scary) scenes, the acting is spot-on, and very convincing. However, you might be taken out of the movie when the protagonists are interacting with each other during the in-between scenes, and the authenticity of their relationship is questionable in some parts.<br><br>3. Scenery - granted that the whole movie is filmed in or on the characters' house, the static viewpoint of the camera gets a little boring. With all the phenomena going on, it would have been refreshing to see things from a different angle, especially in the bedroom. Fortunately, this doesn't hinder the movie, just a minor complaint.<br><br>******AS A HORROR FAN***********************<br><br>Follow the suggestions above regarding with who, where and how to watch the movie. Seen under the right circumstances, and with the right state of mind, the film can be very effective, and having you looking over your shoulder when you turn out all the lights in the house, and crawl into bed. For this reason, I fully endorse this movie as a new member of the horror family. Fresh and original, the movie deserves all of the attention it is getting.<br><br>Let this be a glaring message to Hollywood that originality is still the craved for in the movie industry. Horror fans have grown tired of having their favorite classics butchered and pointlessly remade. Directors and producers do not deserve revenue for just upping the violence and sexual gratification of old horror movies.<br><br>The film's success is also a great indication that as a population, movie goers respond better to thought provocative subjects than mindless in-your-face cannon fodder. It relieves me to some degree to see that tension-fear based horror movies still have the chance to take the cake. Especially on such a small budget. <br><br>Well Done, producers, directors, and actors. 8/10","user":"Zombafyed","rank":[446,677]},{"title":"You're kidding, right?","rating":1,"date":"4 November 2009","review":"OK. It's not at all scary and there is no gore except for a bloody t-shirt at the end. It would be a \"G\" rated movie if they didn't use the f-word for half the dialog.<br><br>Here's a transcript of the whole movie. (pretty much verbatim, stretched out over 2 hours) <br><br>Guy: Haha, you're being stalked by a ghost.<br><br>Girl: F@#$ you.<br><br>Guy: I bought a camera so we can see your ghost.<br><br>Girl: F@#$ you.<br><br>Psychic: I'm a psychic! ooooo.... I feel something....evil. So, I'm going home now. Goodbye. (30 seconds of screen time) <br><br>Guy: Haha, you're talking to a psychic.<br><br>Girl: F@#$ you.<br><br>Guy: Wow. That door closed on it's own. We should get a Ouija board.<br><br>Girl: F@#$ you.<br><br>Guy: I got a Ouija board! <br><br>Girl: F@#$ you.<br><br>Guy: Look it caught on fire (special effect #1) and now there's a demonic symbol on it. Help me decipher it.<br><br>Girl: F@#$ you.<br><br>Guy: I put baby powder all over the hall, and now there's big frog footprints to your side of the bed. (special effect #2 - bad stop motion) <br><br>Girl: F@#$ you.<br><br>Psychic: I just dropped in to say I'm still a psychic. (15 seconds of screen time) <br><br>Guy: Wow, something pulled you out of bed and we got it on film. (special effect #3) <br><br>Girl: F@#$ you.<br><br>Guy: Honey, where are you going with that knife? <br><br>Girl: F@#$ you.<br><br>Police : Police! Put down the knife! (bang!)<br><br>THE END","user":"smackadope","rank":[108,156]}]