[{"title":"Sinner & Saint?","rating":9,"date":"17 June 2011","review":"I have seen my share of action movies and believe it or not, after checking out the movie's score here, I went out of my way to write my very first review on IMDb.<br><br>I've just finished watching \"Sinners &amp; Saints\" and after doing a quick search for the song playing when the credits were rolling (great song by the way, if anyone is interested look for \"Johnny Strong - Let You Go\"), I came to IMDb where I usually check and read about movies, and I must say I'm a bit disappointed with the rating this movie had.<br><br>To start off, this is no original movie, so don't expect to have your mind blown out of the way and don't expect to see any breath taking plot twists. Though this movie doesn't add anything especially new to the recipe it does a very good job in setting itself apart from other action movies.<br><br>I have rarely found myself so captivated by a shoot-out movie. It made me lose track of reality and I found myself cheering for the main character and hating the \"villains\", which although it might seem like a simple enough premise, it is something that very few of the movies I've seen lately managed to accomplish.<br><br>I don't want to spoil anything, nor do I want to set any special expectations, so I will refrain myself from saying anything about the action scenes or character development.<br><br>I have really enjoyed watching \"Sinners &amp; Saints\". It said something meaningful to me, and I think That is the best thing a movie can accomplish.","user":"Mihai689","rank":[37,47]},{"title":"Excellent, well executed action movie","rating":8,"date":"10 June 2011","review":"Well first off I got to say, that movie is seriously underrated. I didn't hear or read anything about it, was just by coincidence I found it.<br><br>I didn't have any high hopes etc. before I saw it, but I was surprised by the high review scores it has gotten here. But let me say as much, u wont be disappointed if u like good old, dull action movies. I do.<br><br>Especially the shootouts belong to the best ones I've seen since Heat. They are very well choreographed, people are moving like real combatants, holding their weapons correctly, maneuvering realistically with covering each other instead of just running into the enemy fire like retards. Well at least the main actors do. You can see that some thought and training went into these scenes. It is very entertaining to watch. CG is a little bit poor sometimes, but nothing that spoils anything.<br><br>I wont go into detail any further, but if u like action and good shootouts u wont be disappointed by that movie. If u prefer solid acting, dialog and depth u might wanna look somewhere else.","user":"philsen1982","rank":[33,48]},{"title":"Sinners and Saints ROCKS Dallas","rating":9,"date":"24 August 2010","review":"Digging through some independent films awhile back and found a gem of a flick in \"The Prodigy\". After that I started following Will Kaufman to see what he would crank out next. \"Sinners and Saints\" does NOT disappoint.<br><br>The gun battles are fantastic. Some of the best stuff I've seen on camera in a long time. In the action field, Kaufman and company hold their own and then some with major studio productions.<br><br>Johnny Strong comes out of nowhere as a Charles Bronson for the new generation. Clint Eastwood would be proud of some of Strong's \"Dirty Harry\" moments in the flick. Fun performances as well from Method Man, Kim Coates, Louis Mandylor and Costas Mandylor. Wish Kim would have been in the film more.<br><br>Fans of the Prodigy will appreciate seeing Holt Boggs, Matt Beckham and Mark Hanson as well as others from the film along side names like Tom Berenger, Bas Rutten and Sean Patrick Flannery.<br><br>So many independent films these days are going the horror route or, if they do tackle something like action, they just can't hit the mark. These guys are able to do some amazing stuff with blood, sweat and tears. Can't wait to see what's next.","user":"mksentinel","rank":[59,91]}]