[{"title":"Story of a Southern Unionist rebellion and Reconstruction","rating":10,"date":"25 June 2016","review":"I had read Prof. Bynum's excellent books about the Jones County rebellion and so had been looking forward to the movie. Though it, inevitably, changes the story (you'd need a dozen hours to tell it completely), it remains faithful to the spirit of the rebellion and the characters of Newton and Rachel Knight.<br><br>There were a number of Unionist uprisings in the South during the Civil War (a fact that was carefully expunged from my history textbooks, growing up in the South, maybe to justify all the monuments celebrating the glorious Olde South that lurk around public parks and buildings to intimidate black Southerners - I guess). What other purpose could they possibly serve? To celebrate a defeat?<br><br>This movie finally points out the obvious: the Confederacy lost the war, but the planter class which owned the Confederacy did their damnedest to win the peace. Instead of being lynched like Mussolini, Confederate leaders returned to their lives, their plantations, just like the war had never happened. Even the slaves they lost were returned to them in the form of unpaid sharecroppers. The misery of the lives of freedmen is one of the strongest images to take away from this film, their alleged freedom snatched from them. No 40 acres and a mule to serve as some form reparation, they went on to endure a century of domestic terrorism at the hand of the KKK.<br><br>The movie itself is beautifully and sensitively acted and filmed. There are scenes of great brutality but which are never gratuitous. There are also scenes of great beauty. There are scenes which have enormous relevance to politics in America today where racism is the hallmark of one Presidential candidate and income inequality the hallmark of another.<br><br>Claims by the radical left that this movie is about a \"white savior\" are just silly. If anything, Gary Ross has eliminated most of the real-life incidents which dealt with Newton Knight's own actions on behalf of freedmen, probably to make the film more palatable to the radical left who, like the extreme right-wing can never be satisfied anyway. I do wish the radical left, rather than criticizing well-intentioned liberals like Gary Ross, would attack the real enemy. The State of Mississippi still incorporates the Confederate flag in its state flag... and social justice warriors are quibbling about degrees of \"white saviordom\"? <br><br>Matthew McConaughey hasn't put a foot wrong since Lincoln Lawyer and his performance here is among his best work. American actors are rarely convincing playing period roles but he totally inhabits the role - scraggly beard, greasy hair, terrible teeth and attitude. He looks like the daguerrotype of a tired and desperate Civil War soldier. Gugu Mbatha-Raw has flown too long under the radar: stunningly touching as an early 19th century biracial heiress in Belle and totally believable as a pop star headed for a nervous breakdown in Beyond the Lights, she brings a luminous quality to Rachel a resourceful woman who defined her own path despite the oppression of racist Southern culture.<br><br>Mahershala Ali's character won't be found in Prof. Bynum's books. The names of the maroons who fought with the Knight Company have been lost to history, so he is a composite character invented by Gary Ross. His character travels from runaway slave to armed insurgent to voting rights activist in Reconstruction. Ali imbues his character with wit, charm, warmth and extraordinary courage.<br><br>Keri Russell is fine in a small role. She gives her heartbroken character dignity and resilience.<br><br>Highly recommended.","user":"workbumpf","rank":[191,223]},{"title":"Great story, good acting, worth seeing","rating":7,"date":"28 June 2016","review":"I enjoyed the movie and would have rated it an 8 but for some pacing issues, including how they awkwardly managed the flash forward scenes to the sub-plot with Newton Knight's descendant.<br><br>I'm not a history buff, but also not opposed to learn about compelling stories, and this was one. Who knew that there was this sub-war going on in the middle of the Civil War, or about this Lincoln-esque southern guy willing to fight the good fight? Knight was an inspiring guy who somehow saw forest through the trees and had courage to do right in a world with wrong going on all around him.<br><br>The acting was quite good. I particularly enjoyed fresh faces like Mahershala Ali (Moses) and Gugu-Mbatha Raw (Rachel). The script was not full of period clichés or overly polish, things I appreciated in a movie like Tombstone, but could have been a distraction in Free State which fortunately kept it real.<br><br>Matthew McConaughey was excellent in the lead as the gritty Newton Knight. Not as gritty as his brother Rooster, but the grit suits him. Very believable. But this is not a movie that shines due to his good looks, rather from his good acting.<br><br>Some of the more critical reviews made comment about FSoJ as \"hopelessly adrift\", \"trips over its own themes as it stumbles aimlessly,\" \"is confusing\", and \"It's not that the story itself is hard to follow, but Gary Ross' script and direction fail to make clear key personal relationships in the film, and throughout its 2 ¼ hours, it makes the audience wonder where the story is going and whether this movie has much of a point at all.\" <br><br>Wow! All I can tell you is that I did not know the story, and there were some moments where it fumbles, but I kept up with it just fine. For me the movie's strengths far outweighed its weaknesses. Definitely not an average or sub-par movie — the subject matter alone puts it ahead of so many other films.<br><br>At times I questioned the casting on some of the supporting roles, but that may be Hollywood conditioning thing, and on reflection this cast probably showed what people were like back in that day.<br><br>After the movie I read up on the Davis Knight story. He was the great grandson who was embattled in a miscegenation trial in 1940s Mississippi. He was 1/8 African American, looked white (in the movie) and married a white woman; a crime back in the day in Mississippi. Have to wonder why they didn't prosecute the white wife. Hmm.<br><br>It goes to show you how much times have changed: now days in Mississippi Batman can marry Superman, dogs can marry cats, and democrats can marry republicans. You won't see any of that in Raqqa. It's a crazy mixed up world folks.<br><br>To sum things up, it's not a perfect movie, and there were some issues making it hard to track at times, but a fascinating sub-plot to the real Civil War, it kept my interest, and the acting was good. Any movie that has me reading up on its story after the film has got to be worth seeing.","user":"keitharan","rank":[79,92]},{"title":"Much better than the critics would have you believe","rating":8,"date":"25 June 2016","review":"I have always enjoyed movies based on actual events or real people, so I was anticipating going to see this movie. I did a little research on the history it depicts and it was a part of the Civil War that I knew nothing about. I was quite disappointed when the reviews came out and most of the critics rated it very low. If you are looking for a war drama that is non stop action with lots of battles, massive explosions and bloody scenes from start to finish, you will be disappointed. If you like a movie that has good writing, an actual story and good acting, you will like it.<br><br>The movie starts pretty much like any Civil War movie with battles, death and bloody bodies, but it progresses past that to the point where some people rebel against the Confederacy for the atrocities they commit against the southern farmers. The story is well told with some actual dates and facts flashed on the screen from time to time which sort of gives it the feel of a documentary. It helps keep things in perspective without being intrusive.<br><br>If I had anything to complain about, it would be then length and scope of the film. The movie ran about 2-1/2 hours. At about 2 hours, I thought it was over but then it moved into the Klan, voting intimidation and general mistreatment of the freed slaves as well as having a 100 year tie in to future generation. It was as if they tried to jam these events in to make it more politically acceptable to Hollywood. I just felt that they went beyond what the movie was actually to be about.","user":"jsaus63304","rank":[152,183]}]