[{"title":"Fantastic directoral debut","rating":8,"date":"4 October 2009","review":"Drew Barrymore is well known for her quirky acting and distinct personality. But now movie goers across the country will begin seeing her in a new light- director.<br><br>\"Whip It,\" which stars Ellen Page (Juno), Marcia Harden, and several other notable actors/actresses is a fun filled, action packed, emotional film that forces you to give an old fashioned thumbs up as you leave.<br><br>Page is fantastic in her role, perfectly capturing the rebellious, curious character of Bliss Cavendar. Her innocent face leaves you rooting for her while at the same time wondering if her decisions are ultimately right. Harden again plays her role flawlessly, down to her own hidden dreams disguised under her thick shell.<br><br>Unlike most \"rise to the top\" movies, Whip It is believable. It seems real at all times. It feels as though all of us at one point in our lives were like Bliss, longing to live a different life.<br><br>If you want a great night at the movies, if you want a solid movie with enjoyable memories, and if you want to answer that question of \"I wonder how Drew Barrymore would be as a director,\" go see Whip It. You'll be pleasantly surprised.","user":"Mortalias","rank":[65,83]},{"title":"Drew Barrymore + Ellen Page = a winning team","rating":8,"date":"24 September 2009","review":"I attended the World Premiere of \"Whip It\" at the 2009 Toronto International Film Festival. This is quite an impressive directorial debut for Drew Barrymore (who also stars).<br><br>Barrymore works with a Shauna Cross script (based on her own novel Derby Girl) and an all-star cast featuring Ellen Page, Marcia Gay Harden, Daniel Stern, Kristen Wiig, Landon Pigg, Jimmy Fallon, Eve, and Juliette Lewis.<br><br>Page is Bliss Cavendar, whose mother (Harden) sees her daughter in gowns and crowns as she continues the family tradition of winning beauty pageant trophies. But Bliss' chance encounter with a group of roller skating girls plants other ideas in her head. Austin, Texas happens to host a roller derby league, it's not too far away, and Bliss finally sees a way out of her town (and gown). This sets up a family confrontation that is the stuff of classic coming-of-age stories.<br><br>The film starts out slow then whips into action, its brilliant ensemble cast hitting its stride and functioning like a winning roller derby team (without the bruises). Then just when you think \"Whip It\" is headed into sports rom-com cliché territory, surprising twists keep it original and refreshing. But despite the multitude of talented actors, Page clearly carries the film on her diminutive shoulders and is easily in control of the material.<br><br>Production values are naturally first rate, with a vivid color palette and in-your-face costumes that are occasionally (and appropriately) over the top. Cinematographer Robert D. Yeoman and editor Dylan Tichenor work perfectly in sync by reflecting both the snail's pace of Bliss' home life vs. the secret one that flies on wheels around the Austin track. Camera-work places the viewer directly into the action. Despite having been filmed primarily in Michigan (due to favorable tax credits) the Austin scenes are prominent, placing its landmarks in a warm, affectionate light. One benefit of a big budget is the ability to purchase music rights, and the result is a killer soundtrack that will have the audience singing along. Be sure to stay for the second of the two closing credits songs, the best ever cover of one of the greatest rock 'n roll love songs of all time, The Association's \"Never My Love.\" Fox Searchlight scores again with Ellen Page, just like they did in 2007 with \"Juno.\" Unlike that (at the time) dark horse, this is no little indie. This is classic Hollywood comedy. \"Whip It\" is another crowd pleaser to add to this year's must-see list.","user":"larry-411","rank":[62,86]},{"title":"Congratulations Drew, you've done yourself proud!","rating":9,"date":"13 September 2009","review":"If you like to be entertained and you enjoy seeing some of the best actresses working today, you should see this film. Ellen Page is a delight. I thought she did more with this role than she did with Juno. Kristen Wiig was her usual funny self, The rest of the cast, including Zoe Bell (excellent in Tarantino's Deathproof), Juliette Lewis, Marcia Gay Harding, Daniel Stern, Drew, Jimmy Fallon, all performed well. That says something about Drew's directing. She elicited excellent performances out of her cast, the film was well shot, the sound and editing were nicely done and I look forward to seeing what Drew can do on her next effort.<br><br>The premiere of Whip It, which took place on September 13th, 2009 at TIFF was enthusiastically well received by the audience.<br><br>And by the way Drew, you looked smashing at the premiere! Congratulations!","user":"tomthumb1","rank":[95,137]}]