[{"title":"Nothing really special about this movie and the end is very fake","rating":4,"date":"5 October 2010","review":"Ryden Malby is a young woman who planned most of her academic life: since school to her dream job. She always had good grades in school and in College, and now that she is graduated, she is certain that she will get a job as assistant editor in the publishing house Happerman &amp; Browning, in L.A. But sadly for her,Jessica Bard, her arrogant classmate and biggest rival, gets the position she dreamed of. And Ryden is forced to return home to live with her parents again, where she will need to deal with lots of frustrations and many refuses of the jobs she is applying to.<br><br>I decided to watch this movie because at first, I liked the plot (the- graduating- girl -who- stays -unemployed- for- a -long -time is much more realistic then that thing in the movies that shows that everybody who graduates has an incredible job who pays you a lot of money!). But as I started watching it, I saw that the movie doesn't have anything special: it doesn't work as a comedy, since it's not funny, and doesn't work as a drama or real life story. We see Ryden struggle a lot to finally get a good job, and when she finally gets it, she gave up in order to run away after her best friend? Seriously, I found that so stupid and unreal. I know this is a movie and we shouldn't worry too much about it, but I don't think the final message of it matches with the character's dreams or realizations. Sorry, doesn't work for me.<br><br>The only thing I really liked in this movie was to see Rodrigo Santoro, my hot compatriot, in a movie with more lines and more acting then the previous ones he participated.","user":"Lady_Targaryen","rank":[15,16]},{"title":"Ghost of Rory Gilmore, Be Gone","rating":6,"date":"7 December 2010","review":"So does Alexis Bledel plan to build a movie career out of tracing the hypothetical life trajectory of the character she created on \"Gilmore Girls?\" <br><br>This is the second movie I've seen this year in which Bledel basically plays Rory Gilmore at the stage of her life she would generally be in if \"Gilmore Girls\" was still on the air. In this movie, she's a perky go-getter who's aghast when she finds out that the world will not necessarily adapt itself to her designs and whims, until...guess what....it does and she gets everything she wanted anyway.<br><br>This movie is harmless enough, but the only thing that makes it more worth your time than something from the straight-to-DVD bargain bin in the supermarket (or maybe this WAS one of those films) is a crazy and admittedly pretty funny performance from Michael Keaton as Bledel's doofus father.<br><br>Grade: B-","user":"evanston_dad","rank":[9,9]},{"title":"A fun little comedy","rating":8,"date":"21 August 2009","review":"Post Grad is obviously not the greatest movie out there. It's not going to win any awards, or be loved by the critics. However, it is still a cute movie that allows you to escape for an hour and forty minutes. It has some really funny scenes, and has moral lessons to teach. It's not being received very well and I understand why. It's just a light, fluffy, little movie more suitable for the younger ages. I admit, it could have been better but I wasn't expecting much from the beginning. It was simply a fun little comedy, and one that I'm sure many people can relate to. I didn't find Alexis Bledel annoying. She gave the role all it needed. Her love interest Zach Gilford, was cute and did a decent job. Michael Keaton was the funniest character hands down, and the rest of Bledel's family offered much of the comedy in the film. In all, it's an enjoyable film. I would recommend renting it though, it's not really a theatre-worthy film.","user":"adri_wholivesathome","rank":[50,65]}]