[{"title":"Not bad","rating":6,"date":"23 February 2020","review":"This entry in the film series is not as good as the first 2 films. There are some fun scenes but the villain is not very exciting. Some of the action scenes are not as good as the ones in the previous 2 films.","user":"MR_Heraclius","rank":[34,35]},{"title":"Not a shade on the first two Transporter movies and here's why","rating":5,"date":"6 December 2008","review":"Read through all the reviews of this movie. Big fan of the first two myself and just got back from watching this. Pretty surprised that nobody has articulated the real reasons why this movie doesn't work.<br><br>Firstly, if you didn't enjoy the first or second movie all of this probably won't be very relevant. I would have thought that most people watching the third would have likely seen and enjoyed the other films in the series.<br><br>So, why is this the weakest film in the series? Anybody's review who criticises it based on a unrealistic plot or implausible action is missing the point. This might be obvious but there are numerous reviews citing these as the reasons for the film being average/bad. It's also an important part of the formula that worked well in the first and second films.<br><br>The reason this third effort doesn't work as well and is not as enjoyable is due to a variety of factors - TONE and PACING probably being the key reasons and also areas where it departs from the previous instalments.<br><br>By tone i mean a few things. Is there ridiculous over the top action in this film? Yes, most definitely, but the problem is in how it is being presented. The other movies made you laugh in their almost comic book presentation and stunts. This film is genuinely trying to sell itself as a serious action movie. They completely took the humour out of all the potentially very humorous moments through the more 'arty' editing, over the top score dramatic score (soundtrack definitely plays a big part of the different tone in the 3rd movie) and generally lousy script.<br><br>This leads on to the pacing, which is far too slow at times. Way too much dialogue between Statham and the girl. Yes we know the character fairly well but the movies were always about the action and less the dialogue. Jason Statham is capable but the script can't really be saved here.<br><br>So, a dramatically more realistic Transporter movie but sucked dry of all the humorous and fun tone that made the previous instalments so much fun. As I said there are plenty of silly and deliberately humorous moments but the way it was constructed and presented meant I wasn't laughing anywhere near as much as I was in the other films. This in conclusion is the main failure of Transporter 3 - 5/10 just for being a new movie in an otherwise cool franchise.","user":"mattys49","rank":[135,194]},{"title":"An exercise in Brechtian hyper-realism.","rating":2,"date":"5 December 2008","review":"This hasn't been verified (yet), but I think Transporter 3 is an attempt to make the stupidest film of all time on every single level, from the characters to the editing to Jason Statham chasing an Audi S8 on a BMX. Even the tag-line makes no sense. \"This time, the rules are the same. Except one.\" What do you mean, the rules are the same, except for one of them? They're not the same at all then are they? They're different. \"This time the rules are the same except they're different.\" More honest.<br><br>The plot for Transporter 3 is utterly illogical. Dome-headed Frank Martin (Statham) is forced against his will by evil contractor Johnson (Robert Knepper) to transport Valentina, a kidnapped girl from Marseilles to Odessa in order to make the girl's father, a Ukranian official, sign a document allowing a faceless US corporation to dump hazardous waste in his country. Why does it make any difference whether the girl is in Marseilles or Odessa? It doesn't. So why is she being moved? Because otherwise the story wouldn't exist. There, the film has no meaning. Considering the threats to the Ukranian official are made by phone anyway, the girl could be kept in a room next door or across the other side of the world and it would not affect her father's decision. Now, hypothesise that there was actually some reason for her to be in Odessa. Would it not make sense for the corporation to merely hire a private plane to fly her there instead of strong-arming a professional killer (Frank's transporting skills are constantly secondary to his punch-a-guy-through-a-wall abilities, despite what the titles of the trilogy would have you believe) into taking her there by car with a promise of certain death for Frank when he reaches his destination, thereby giving him the ultimate impetus to change these plans in a way that would ensure his survival and the deaths of those who made his involvement in this nonsensical exercise in Discordianism compulsory? The answer is yes.<br><br>Jason Statham does well in his role as \"any character from any film he's ever been in.\" Except one (I can do it too, tag-line). He actually achieves his career nadir here, when he does a striptease for Valentina, the most annoying character ever committed to film. Played by Natalya Rudakova (her first and, if God/Buddha/contract killers exist, her last), the character embodies everything wrong with the movie. She is incredibly shallow, talks perpetually, finds Frank stabbing a metal pole into somebody's throat a turn on, and tries desperately to look sexy by pouting or arching her eyebrow in every scene. The attempt to provide her with any sort of dimension beyond 'cardboard cut-out' by interspersing every Frank/Valentina conversation with an elaborate description of what she would like to eat at that given moment is not cute, it makes me wish Frank had left her seat-belt undone and driven into a bollard at 80mph. In fact, the only instance where her screen presence is appreciated is when she gets punched in the stomach by the villain and falls to the floor crying. It was almost worth enduring the prolix runtime for.<br><br>Miscellaneous instances of brilliance include Frank smashing head first through the window of his Audi to oust the guy driving it and then a second later we realise Frank has one of those new 'self-repairing' cars where windows fix themselves and nobody mentions it again. The magic car also manages, in true X-Wing style, to lift itself out of a lake using only the force (or a handy bag of air), before summoning an old man on a tractor to somehow lasso it and pull it to shore whereupon the flooded engine starts first time. Other than the car, the highlight of the film is Frank's inexplicable decision to attach an explosive device to the antagonist, trigger its timer, and then stand next to him looking confused before jumping behind a chair a second prior to the explosion. For an anguished moment I thought Transporter 4 was a no-go, but then Frank emerged totally unscathed and I punched the air in unbridled delight.<br><br>To conclude, Transporter 3 is the worst action film of 2008, an ineffable feat considering this is the same year that spawned Wanted. Natalya Rudakova takes it upon herself to make the film unwatchable, and not even the ridiculous stunts that would never happen, even in a monkey-Shakespeare infinity, can provide anyone with an excuse to see it.","user":"Grant_Price","rank":[78,111]}]