[{"title":"Soderbergh at his art-house best","rating":9,"date":"19 June 2010","review":"You know that question, \"What would you like people to say about you after you're gone?\" We answer with either, \"I don't care,\" or maybe a short litany of qualities and our small contributions to the world, trusting our mumbled tone and contrite expression suitably convey an appropriate degree of humility. Then the follow-up kicks in, \"So what sort of things do you do now to be that person?\"<br><br>Director Steven Soderbergh admits he is probably more character-driven than plot-driven. The 'who' not the 'why.' The person, and the inner strength they display. And in this uncommented documentary, we share his fascination for one man. A man who in turn examines his own life or that of others in such a absorbing way that, seen through Soderbergh's crystal lens, it may probably cause you to ask your own ghosts, \"But aren't you part of my life too?\" <br><br>The 'story' is of one Spalding Gray. Probably the foremost of autobiographical monologue raconteurs. He slips with passionate and articulate ease, from living the moment, to observing himself living the moment. Gray's method, as he describes it, is to recount real stories from his (both happy and tortured) life until they become embellished with innuendo and hyperbole. He jokes that it is almost like 'reverse Method Acting'. Instead of throwing the emotional reality of a past intense experience forward into a present dramatisation, he takes the vagaries with which we view memories, and uses them to make his life narrative at once compelling, honest and instructive. \"I like telling the story of life better than I do living it,\" he says. Gray acknowledges he is a 'born actor,' in the sense that he lives his life as a stage. And yet it displays a sincerity and wholeness that makes one think, \"Am I as self-aware in my own life?\" And if, after all, you were trying to encapsulate your life while living it, how exactly do you go about it?<br><br>Gray is no new-age super-guru or remote larger-than-life character. By occupation, a successful experimental actor and solo performer. But still as a man that struggles his whole life, not only with the sort of challenges each of us face, but with the added burdens of hereditary depression and bipolar tendencies. He is foremost a human being. His 'dark underbelly' is as important as his achievements. Normally hidden ordeals – a difficult upbringing, sexuality and relationships, thoughts about death and suicide – are used positively as foundation blocks. Where many of us would ignore, Gray embraces, analyses, and ultimately transcends.<br><br>Soderbergh's low key technique is instrumental. Without it, we would have an entertaining and dramatised monologue (such as the 1987 film of Gray's play and book, Swimming to Cambodia). With it, we get closer to the core of the man's psyche. It's almost a handbook on getting there. Probably the most minimalist of Soderbergh's movies, And Everything is Going Fine has no talking heads, no voiceovers, no perceptible agenda. Points from Gray's stories are illustrated with relevant segments from interview footage. Soderbergh almost goes back to the early roots of Sex, Lies and Videotape, making us acutely aware of the filmic process – and then letting us get caught up in it. Everything is Going Fine opens with a sustained fixed shot of an empty chair and desk, using grainy film. It is an image that may well long be associated with Gray, his chosen podium of storytelling. The disparity between what is acknowledged as 'performance' yet capturing truth is a dilemma of the cinematic process itself. Yet here it swiftly becomes a memorial to the fine art of documentary film-making: to become a lens for the truth instead of focussing our attention on the story filmmakers want us to see. In terms of techniques, Shirley Clarke's equally penetrating Portrait of Jason at first comes to mind, or Herzog's Grizzly Man; but whereas Clarke and Herzog expose a truth, Soderbergh's subject is both complicit, self-reflective and ennobling. Every frame is pre-existing footage rather than shot anew for cinema.<br><br>To counter inevitable loneliness produced by a work ethic that makes an art form of self-examination, Gray starts to interview others on stage. He demonstrates a rug-pulling capacity to get at a person's innermost demon, probably because he has lived with and conquered his own. He asks a woman if she has ever contemplated suicide. When she says no, his surprise is as if she had said she has never eaten chocolate. Further probing, although never intrusive, reveals that she has indeed contemplated suicide. The interview becomes an enthralling conversation between two people who find they are quite comfortable discussing the most harrowing of personal events. <br><br>Gray's self-honesty produces the words that Soderbergh uses in this epitaph to a life lived. Gray captures his own past, prophesises his own future and his life becomes a poem.<br><br>Steven Soderbergh's films have frequently obsessed over identity, the way we perceive it, project it, define it. How we make ourselves into the character which we play in our own life story. Defining someone in terms of their sexual experiences (Sex, Lies and Videotape). The plastic medium of an amorphous personality (in his much underrated, The Girlfriend Experience). And observing emotional drive without dramatising the emotion (as in Che). Is it always entertainment? Probably not. And in this case, even the humour, replete as it is with literary references, is aimed more at the educated audience and one that will think well beyond the screening. <br><br>For anyone who ever doubted Soderbergh's artistic integrity, this unassuming film is a minor monument to excellence of execution and the enduring validity of his work. And an eloquent eulogy not even just to one man, but to the struggle for excellence and self-actualisation in all of us.","user":"Chris_Docker","rank":[26,27]},{"title":"Spalding Gray's Final Monologue!","rating":10,"date":"28 December 2010","review":"Just watched this and must say it is totally brilliant.<br><br>Soderbergh has brought us SPALDING GRAY'S FINAL MONOLOGUE with the film, \"And Everything Is Going Fine\".<br><br>He compiles what is essentially a final autobiographical testament of Gray's life using rare footage of his TV interviews, recordings of his theatrical monologues, and even some footage taken personally by Gray with his family members.<br><br>A simple mash-up of such footage gives Gray the oppourtunity to bring us one final monologue- from the grave- speaking about himself, just as he loved to do...for our pleasure, and his sanity!!! He truly was the best monologist, one-man-show and storyteller to ever grace the stage.<br><br>And Soderbergh- whom directed Gray's Anatomy (Gray's 1996 monologue,which is beautifully shot) and King of the Hill (in which Gray played the role of Mr. Mungo)- must get props for not succumbing to the urge of telling Gray's story, but instead appropriately allowing Gray to tell it himself. Collaborating through selectivity and editing, Soderbergh plays a role much like the one he did when filming his earlier monologue.<br><br>Gray begins this story by discussing the overwhelming influence his mother had on him...an influence that would consume and eventually take his life. He continues by talking about his journey to Hollywood, becoming an actor, his various escapades, his travels to India, the art of writing and performing monologues, the art of acting, the value of conversing with the audience and people off the street, his marriage, keeping secrets, and ending with a recollection of his experience of being in a major accident, one he would never fully recover from.<br><br>Throughout this monologue he reflects upon life, living, death, growing up, sex, love, relationships, experience, creative narcissism, psychology and the limitations of being human, hardship, depression, and, most importantly, introspection.<br><br>On January 10, 2004, after watching the film \"Big Fish\" Spalding Gray got on the Staten Island Ferry from which he would jump, committing suicide, as his mother did before him. Gray killed himself as a result of the major depression that plagued him after the accident he discusses near the end of the film. I have included this information here, but Soderbergh decided to omit it from the film. He does this so we can remember him for what he did in life, as opposed to how he exited in death. (and because Gray can't tell us the story of his death from the beyond...if only...) <br><br>This can be contrasted with the film \"Lenny Bruce - Without Tears\" in which Fred Baker decided to not only discuss Bruce's tragic death, but show the photos and video footage of Bruce lying dead naked on his bathroom floor with a needle in his arm. I do not hold this against Soderbergh, because I feel that this final testament is true to how \"Spud\" would want to be remembered. He was always one to create his own myth (as opposed to Bruce who \"kept it real\"), and it was only appropriate for Soderbergh to let Gray tell his own story.<br><br>Shortly after the middle of the film there are a couple interviews in which Gray foreshadows his own tragic death. It is clear from the footage at the end of the film- after the accident- that he never was able to fully recover from the crash- emotionally or physically- and that is what drove him to join his Mother, in death.<br><br>May you RIP Spalding, you will never be forgotten! I'm sure you are ecstatic that Soderbergh gave you the chance to bring us one last monologue- your final testament to the world - at least i hope you are. Thank you for everything you've done to entertain us, I hope you gained as much from it as we did.<br><br>A definite 10 out of 10, if you loved Spalding Gray as much as I do, you will not want to miss this!!!","user":"meddlecore","rank":[14,18]},{"title":"Worthy, but sad final monologue by a master story teller","rating":9,"date":"9 January 2011","review":"The life of Spaulding Gray in the words of Spaulding Gray. Assembled by Steven Soderbergh from hours of film and video tape the film covers Gray's life from birth until just before his death. Its a final monologue from a man who is best known for monologues.<br><br>The film is a funny, but almost overwhelmingly sad look at the man and his life. Its a version of his life as he might have told right before he went into the great beyond. Its incomplete, details are missing (If you know his monologues you know how much is missing), but its still his life.<br><br>For me the biggest shock was seeing the change in the man after the accident in Ireland. He was clearly altered by the experience. He was no longer the same man who only months before had done the glorious and life affirming Morning Noon And Night. When I saw that Show at Lincoln Center I witnessed one of the most life affirming moments of my life. Little did anyone know that within mere months the man on stage celebrating life and family would be broken and set irrevocably (and seeing the footage unsurprisingly) toward self destruction.<br><br>I like the film. It seems to be a fitting, if overly dark, send off for a man who was always talking about himself. Being a fan I was deeply saddened by the film, at the loss. The Chumbawumba moment from Morning Noon and Night reduced me to tears. I freely admit it was because of what the moment means having seen the original show, its life. Unfortunately it comes right before Gray went into free fall. I kind of went into free fall too.<br><br>This was the wrong movie to see during the happy time of Christmas...<br><br>That said, this is a really good film and worth seeing.","user":"dbborroughs","rank":[6,7]}]