[{"title":"A good Sci-fi Scary movie","rating":9,"date":"28 September 2009","review":"I have to say this movie was better than I expected. If you liked Aliens and Resident Evil...this is like both of those movies got together and had a sequel. Well not quite, but the story was good and had no gaping holes in it. The acting was good without going over the top.<br><br>I loved the way this movie started; guy wakes up from hyper-sleephis memory is not fully functional, he knows things are not right and has to save the day.<br><br>I thought the story was great in that they did not over-explain everything like they have in so many sci-fi movies. The mid plot line was very good never found myself asking \"what the hell are you doing\", and the ending was very good without being so trivially expected.<br><br>Of course Dennis Quaid is a great actor but I really liked watching Ben Foster. He was one of the best actors in 3:10 to Yuma.<br><br>Special effects were good but did not need to be over the top because the story was solid. Worth the price of admission.","user":"ciscokid1970","rank":[255,310]},{"title":"Pandorum: A terrifying and atmospheric, if flawed, sci-fi odyssey.","rating":8,"date":"26 September 2009","review":"Anybody wanting an intelligent, insightful, or mesmerizing motion picture should readjust they're expectations before walking into Pandorum. There are a few themes here that are interesting and the characters aren't dumb (some are engineers and scientists, after all), but chances are you've already seen these archetypes in countless movies already. As for whom to recommend this film to, if you enjoyed Event Horizon and/or Alien³, there's no reason why you wouldn't find anything to like in this film. However, contrary to what many people have said, Pandorum seems to resemble another film, Eden Log (a French sci-fi/horror picture), much more than either of the previously mentioned. As in Eden Log, our central characters wake up with no memory of how they came to be in their isolated environments. Likewise, they also have to explore an isolated world around them were horrible things have occurred and monsters seem to be looming. Even more interesting is that both films feature protagonists caught up in the mix of highly mysterious projects entitled \"Eden.\" Our two main characters are Corporal Bower and Lt. Payton, played by Ben Foster and Dennis Quaid respectively. The two wake up disoriented and contained (i.e. trapped) in a small hypersleep chamber designated for the Elysium (the name of the large vessel of characters are aboard) crew of Flight Team 5. Unaware of what has happened to the other crew members the two begin to analyze their situation and Bower, being a technical/mechanical engineer, notices electrical surges throughout the ship signal that the nuclear reactor core in the Elysium is about to overload and shutdown. The two begin a makeshift mission to try to save the ship, with Bower climbing through ducts and exploring the wasteland left of the craft and Payton guiding him over a comlink and a crank-generator powered computer terminal. If you've seen any of the Alien films or played the videogames Doom or Dead Space, this should sound quite familiar.<br><br>Oh, yeah, and there's monsters aboard, though I won't reveal what these \"monsters\" are for potential viewers that don't know yet.<br><br>To Pandorum's credit, however, there are a few unforeseen plot twists before the credits roll. Some audience members may roll they're eyes at the ending, but I find it's a rather nice addition to the experience. Instead of a big, epic final battle with an Alien Queen, you get a heavy plot-reveal in the finale that causes some reflection upon the film. While it may be no masterpiece, Pandorum is not a bad film. 2009 has been a surprisingly good year for sci-fi thus far (Star Trek, Moon, District 9) and this certainly doesn't detract from that. In terms of horror, Pandorum should be a breath or fresh air for those who've endured films like Halloween II and The Final Destination for the past few weeks. In fact, I'd say Pandorum is the second best horror film of the year thus far, not quite matching the entertainment value or overall quality of Raimi's epic return to the genre (Drag Me To Hell).<br><br>In terms of film-making, this is a rather well put together film. The cinematography looks great with the exception of a few action sequences that go overboard with the \"quick-cutting,\" but over-all audiences won't have to worry aboard an abundance of shaky-cam or other cons. Also, everything here is properly lit. Those who had trouble with their eyes focusing on images during Eden Log won't have that issue here. This film also doesn't meander around in complete darkness for as long.<br><br>Director Christian Alvart obviously has a lot of talent and I'm glad he directed this film as opposed to someone like, say, producer Paul W.S. Anderson. He really knows how to handle suspense and build up intense scenes. Like Neil Marshall, he can place his actors in tight, unattractive situations with monsters crawling right beside them (or vice versa) and have the audience holding their breath. Hopefully he'll garner more work in the future.<br><br>As we now know, Pandorum has tanked at the Box Office. While on one hand that's disappointing, it's not all together terrible news as the film might garner some sort of cult status in the future. In interviews only a week ago, Quaid discussed the possibilities of not only a sequel, but a trilogy following Pandorum. Not only is that seemingly impossible now, given the films performance, it additionally doesn't seem necessary. The film ends with a complete sense of closure. There's no need to see what happens after we leave this world, and such a story wouldn't resemble the experience in Pandorum in the slightest anyway.<br><br>All-in-all, the latest spacey sci-fi/horror epic has everything you could want in a \"genre\" picture. It's not original (admittedly, this is simply a collage of other, better films), but so little is in the 21st century. The film does feature a solid cast that deliver solid performances, thick atmosphere, several scares, a few unexpected twists, astonishing special effects and set pieces, and quite a bit of gore. If you are a fan of the sub-genre and these type of movies, you'll definitely want to check it out.<br><br>Runtime: 106 minutes (1 hr. 46 min.) Related Recommendations: It! The Terror from Beyond Space, Eden Log, Ghosts of Mars, The Descent, Event Horizon, Alien, Dante 01, Solaris, Solyaris, Aliens, Alien³, 28 Days Later","user":"TheDeadMayTasteBad","rank":[239,296]},{"title":"Better than most critics say","rating":7,"date":"30 September 2009","review":"I saw Pandorum last night and was somewhat impressed with the movie. After reading critics reviews, and how they trashed it, I was going in expecting less and was pleasantly surprised.<br><br>Pandorum borrows heavily from other sci-fi movies, but what movie doesn't nowadays. Taking a lot of ideas from Alien, a 1979 classic sci-fi movie, and borrowing the creatures from The Descent, another near classic movie from a few years ago, Pandorum was still impressive. The storyline wasn't completely original because it reminded me a lot of Event Horizon, but whereas Pandorum went more for a science level, Event Horizon was more supernatural. Most people trashed Event Horizon as well, but it was another movie I liked also, even though the ending of that movie was flawed. Of course I'm reviewing Pandorum, so I won't mention the former film anymore.<br><br>THe cast for the most part was rather good for a movie of this type. Ben Foster, and Dennis Quaid are the two most marketable names, but the other characters, outside of maybe the Cam Gigandet character, worked pretty good. My only real problem with Gigandet was that he overacted a bit, but otherwise everything was good.<br><br>The movie does claustrophobia well, and the entire movie had me jumping a lot. THere was tension, and for the most part the film was fast paced. I didn't find myself looking at my watch one time. THe visuals were decent, but the creatures should've been kept in the shadows more. Horror works best when the viewer uses his/her own imagination to visualize them.<br><br>Did I say horror. Well yeah because this is really a sci-fi horror film more along the lines of Alien as mentioned above. It doesn't match the classic status of that movie, but Pandorum is worth seeing for its psychological feel and how some people might act after being in space for so long. By the way, the movie does have a twist, which I will not spoil for anyone who wants to see it.<br><br>Note: THis is a film that may make most of its money on DVD, and will likely acquire somewhat of a cult status.","user":"freaky_dave","rank":[184,227]}]