[{"title":"Kevin Spacey delivers a superb performance!","rating":6,"date":"11 April 2011","review":"Kevin Spacey is truly an actor to adore. The Two-Time Academy-Award Winner has proved his talent time and again. In 'Casino Jack', he gets even better and delivers a superb performance. <br><br>'Casino Jack' is based on Jack Abramoff. Abramoff, is one of the most notorious lobbyist's ever. 'Casino Jack', however focuses, on the time when Abramoff &amp; his protégé went down hard...as their schemes to peddle influence lead to corruption and a brutal murder. <br><br>Director George Hickenlooper does a good job, while Norman Snider's writing is flawed. The writing in the first hour is spot-on, but in the second hour, it falters. Even the culmination for that matter, doesn't leave the desired impact. Acting wise, as told, Spacey owns the film. He plays Abramoff superbly. He truly is an Icon! Barry Pepper is Excellent. <br><br>On the whole, 'Casino Jack' can be viewed once, for it's lead star's performance. Must for Spacey Fans!","user":"namashi_1","rank":[20,23]},{"title":"Superlative and darkly humorous saga of disillusionment","rating":23,"date":"23 November 2010","review":"I confess to having followed Jack Abramoff's actual denouement years ago only as much as I could tolerate without gagging. My feelings toward lobbyists are mostly of disgust anyway. But to separate this work of art from the morality of its subject matter, I must say that this is a fine, fine film. Mr. Hickenlooper's death is a profound loss to all of us. I find Kevin Spacey and Barry Pepper at the top of their form here. The character and the situation give Spacey a broad stage to display his talents and range. Abramoff is no easy character to portray with any sympathy at all, and I had virtually none, but my outrage over the facts didn't spoil my enjoyment of the entertainment one bit. A tribute to all involved.<br><br>As far as the abuses portrayed, all I can say is, I really hope the American citizenry somehow wakes up and unites to end the stranglehold that cash has put on our democracy. The utter hypocrisy and self-serving, greedy behavior of our politicians is harming us for generations to come. If they truly love their country, they must reject and expose lobbyists sacrificing our national welfare to Mammon.","user":"pmalt","rank":[52,68]},{"title":"Lessons in Self Justification.","rating":6,"date":"11 July 2012","review":"I had a difficult time dealing with this movie, partly because the entire system of lobbying is so despicable in itself, and partly because the writer has done his best to show Jack Abramoff as a fundamentally nice guy who just overreached a little and got caught.<br><br>I mean, right at the beginning, after we see Kevin Spacey (superb) talking to himself in a mirror, we hear his explanation of why lobbyists exist. Because they're useful. They give legislators information about subjects the legislators need to know something about in order to do their jobs.<br><br>That explanation comes straight out of a now unfashionable school of sociological thought called functionalism. If something exists in a society, it's there for a good reason. Otherwise it wouldn't be there, right? Whores make the streets safe for our wives and children. The Mafia fills in the gaps that the police force can't, and it meets a market demand among consumers of illegal goods. Mass murderers and psychopaths provide us with bad examples that we can point out to our kids so they'll know what not to become.<br><br>According to the film, Abramoff just did was everyone else was doing. He only had the misfortune of being caught. Nobody argues that perhaps congressional aides or interns ought to be doing the research instead of paid lobbyists. No explanation is offered for why spending on lobbyists more than doubled between 2000 and 2009.<br><br>There are no such reality intrusions. Abramoff is a colorful, funny, very active guy. He works out. He loves his family. He knows everyone. He's religious. He opens a kosher restaurant on K Street and plans to open a Hebrew school.<br><br>A second reason I found it hard to assess the movie is that I didn't understand it because I'm too dumb. I couldn't follow all the shenanigans. Okay. In one of his minor deals, towards the beginning, the Chippewa tribe, among whom I once lived as a cultural anthropologist, gave him millions of dollars and the money apparently disappeared. Where? I don't know. I told you I was dumb. I don't know what an expression like \"he wants ten percent under the table\" means. I don't know why a Greek was killed. I don't know why Jon Lovitz got stabbed with a ball point pen. Tom DeLay has a prominent role and I don't know what he did that was supposed to be bad. Abramoff makes some venomous remark about George W. Bush at the end and I don't know why. And I can hardly credit the notion that Mike Scanlon's (Barry Pepper, with a great twisted face) girl friend dropped the dime on all these enterprises because she found a pair of red alien panties in her boy friend's laundry. It's the kind of movie that someone as stupid as I am needs a little preparation for -- a few hours of studying with a book called \"Lobbying for Dummies\" or something.<br><br>Because except for the murder I couldn't identify a single illegal act in the entire movie. Lobbyists give money to politicians and the politicians do favors in return. It sounds a lot like bribery to me, and I know THAT'S illegal, or at least I think it is, but I don't know why, when it takes one form, it's called \"lobbying\" and is as kosher as Abramoff's restaurant that serves the best roast beef in the city, and why, when it takes another form, it's called \"bribery\" and you go to jail.<br><br>I do, however, recognize a decent performance when I see one, and three performances are stand outs in this production. Kevin Spacey, a little older and chubbier, gets to do some of his impersonations -- Clinton, Al Pacino, and a few others, and he's good. Barry Pepper as Scanlon is terrific as well, as the emotionally unstable squeal cat. And Jon Lovitz is funny, no matter whether the part calls for a comic presentation or not. He's hilarious in some scenes, which I won't spell out.<br><br>Not a masterpiece by any means -- \"Barbarians At The Gates\" is about leveraged buy outs and it's better -- but worth seeing once. I hope you have better luck in decoding the events than I did.","user":"rmax304823","rank":[10,11]}]