[{"title":"The Best Laid Plans of Crazy Frenchmen...","rating":9,"date":"10 August 2008","review":"...sometimes work as director James Marsh and subject Philippe Petit prove in the sublime and inspiring documentary, \"Man on Wire.\" Here we see Petit and his cohorts recklessly plan and execute the most daring stunt in the history of the world. In August of 1974, Petit walked a tightrope between the Twin Towers of the World Trade Center in NYC.<br><br>As part of Hollywood's increased awareness of the possibilities of counter-programming, summertime has become a haven for documentaries. Thanks to Michael Moore and Al Gore, most of the blockbuster documentaries over the past few years have been in the form of political propaganda. By simply wanting to tell the story of one man's amazing act, \"Man on Wire\" breezes into this summer like a breath of fresh air. The act depicted is singularly focused, but the logistics behind perpetrating the act are fascinatingly complex, and the aftermath of the successful completion of the act is breathtaking.<br><br>Director Marsh wisely avoids the typical trappings of documentaries by filming the story like a fictional narrative, jumping back and forth in time, shifting points of view, and creating palpable tension leading up to the death defying act of Petit walking across the wire. The film relies heavily on reenactments, and Marsh stages them like mini expressionistic student films full of stunning cinematography and wonderfully antiquated in-camera effects. The careful juxtaposition and blending of archival footage, still photography, reenactments, and interviews is a master-class in the school of film editing. Also adding to the film is the quietly tense music score composed of pieces from Michael Nyman and Erik Satie among others.<br><br>For those who never saw the Twin Towers of the WTC in person, the film shows beautiful archival footage of their construction. For those still haunted by their fall, the film offers a bit of catharsis as we get to watch them reconstructed piece by piece on film and lifted again on high through Petit's potently mad dream. The film is as much a love letter to New York City as it is a testament to the power of one person's vision. The film allows us to see how Petit did it, but it also gives a glimpse of the greater \"why?\" For beauty, for the thrill...for the sad knowledge that no one in the history of the world will ever be able to do it again.","user":"WriterDave","rank":[55,59]},{"title":"A unique, stunning, exhilarating and beautiful experience","rating":20,"date":"20 September 2008","review":"Constructed, believe it or not, as a heist film, composed of interviews, actual filmed footage from the seventies, re-enactments (done incredibly tastefully and intelligently) and a large number of photographs, \"Man on Wire\" from director James Marsh is a brilliant, audacious, stunning, and utterly enthralling film, and having seen it not more than an hour ago I can already say with confidence that it is one of the best documentaries ever made, not because it achieves the sort of brilliantly real observations on human behavior and emotions that a Maysles Bros. film does, but because it is a surprisingly hilarious, unbelievably well-crafted movie about so many absurdities, so much ridiculousness, such insane, insane acts (and yet so beautiful as well), and one which looks in on some of the most interesting people I think I've ever come across. I normally don't take to non-'cinema-verite' documentaries, but this is just about the biggest exception possible, as I will say with confidence that this is an a terrific film.<br><br>Philippe Petit, the wire-walker who walked between the World Trade Center towers in 1974, is one of the most absurd and audacious people I've ever seen in real life or recorded on film. His spirit fills every frame of the film, and his commitment to this dangerous, illegal, and almost unbelievably courageous act is astounding to witness. The film thankfully affords us the chance to get to know Philippe, and it would have been so easy for Marsh to focus only on the incredibly entertaining planning process for the audacious climactic act, but he doesn't, as through the interviews we get to know Philippe, Annie, and Jean-Louis quite well, and the interviews don't feel as put-on as they do in many other films.<br><br>I said that \"Man on Wire\" was one of the best documentaries ever made. I'm going to disagree with myself. As a documentary there have been many which are more effective. As a film, however, the skill that went into \"Man on Wire\" is absolutely outstanding. The editing, the quality of the re-enactments, the wealth of footage and still photographs, the excellent interviews, the film's wildly funny sense of humor (the audience at my screening laughed louder than a sold-out screening for most comedies), and the absolutely inspired idea to construct the film as a heist film make this one of the most memorable, exhilarating, and enthralling films I've ever come across. The idea to make it a heist film makes complete sense as well, as the careful planning that went into their entrance into the WTC towers and reaching the roof, and all the steps that led to it, definitely have the air of a typical heist film, complete with surveillance, inside men, disguises, false ID's, and all sort of wacky ruses. It's terrifically entertaining.<br><br>\"Man on Wire\" doesn't ignore 9/11, but it thankfully doesn't become a film which isn't about what its actual subject. There are fleeting moments (including the shot, which unfortunately is in the trailer, of Phillipe on the wire between the two towers and an airplane in the top left corner of the screen) which are immensely powerful and resonant, even chilling, but the film switches back to its effortlessly entertaining original format seconds later<br><br>Those with a fear of heights might find themselves hyperventilating at certain points in the film, as even I, someone who has never had an issue with looking down the side of a cliff, felt vertigo coming on at the still, looking down off the edge of the tower, of Phillipe sticking his foot out just before he began the walk across. I guess those are the only people I wouldn't highly, highly recommend this film to. It's a terrific, massively entertaining film, and even I, the grouchy fan of pretty much only ultra-realistic documentaries, have to admit that it is an immense artistic achievement. <br><br>9/10","user":"ametaphysicalshark","rank":[107,119]},{"title":"Art in the sky","rating":9,"date":"5 August 2008","review":"What does Philippe Petit do now? Is he Professor of Advanced Balance at the Sorbonne? Is ha a therapist dealing exclusively in acrophobia? He seems to be a man so specialized that he was meant in life to do only one thing, at one time, and this film is about that moment and shows why a moment--a half hour, actually, in the early morning of August 7, 1974--can define a life and reshape one's perceptions. After the long slow methodical buildup, when the moment comes, calmly accompanied by a famous piece for solo piano by Eric Satie, it is so awesome, so still, so transcendent it makes you cry. No question why this film needed to be made.<br><br>Why is it that walking across a wire up in the air can be an aesthetic experience so exalted it brings you to tears? I don't know, but that's what 'Man on Wire' is about.<br><br>Philippe Petit is a clown, a sprite, a magician, an athlete, and a dancer. When he was seventeen, before the World Trade Center was even built, he knew it had to be his. It was as if it was invented just for him. . This was his greatest exploit. His triumph. It was to make him world famous.<br><br>A 'funambule,' the French call them. A tightrope walker: the epitome of risk-taking Only this time he increased the risk. Like his earlier walks between towers of the Cathedral of Notre Dame in Paris and pylons of the Sydney Harbor Bridge, only more so, Petit's walk on a wire between the Twin Towers of the World Trade Center, the tallest buildings in New York City, was illegal, a 'rififi,' a break-in, a caper. Some call it \"the art heist of the century.\" But it's not an ordinary heist. They stole nothing, except the air, our breath. Petit and crew didn't take anything out. They took in a ton of equipment, most importantly enough heavy wire and support wire to secure his pathway across the towers.<br><br>If you could make a documentary about a successful robbery, it might be something like James Marsh's film about this event. There is the conception, the reconnaissance, the gathering of accomplices, some of whom out of wisdom or fear opt out, even up to the last minute. The false start and bailout. The months of rehearsal. The miniature mock-ups of the top of the towers (handsome, and in wood). The trial runs and on-scene observations, the skillfully made false documents and identities, the changes of costume (for Petit himself, businessman, construction worker, and the ballet shoes and black velvet costume of the tightrope walker And of course Petit and company were documenting all of this. Marsh has admirably gathered all the images, plus simulations, plus the present-day talking heads, several in French, the others in English. This time simulations seem quite justifiable. There are things we need to see--particularly the crew dodging and hiding from guards on the towers.<br><br>It's all like a game; a lark. And at the same time, lethal, dangerous, and a defiance of the laws of man and God. The simulations are appropriate because this is all so unreal anyway. Why not add a little fakery?<br><br>Philippe Petit is more than a little bit strange. And in some indefinable way he is also quintessentially French.. Not only has he an incredible insensitivity to danger (and drive to overcome it), but this diminutive, almost weightless fellow has his unmistakably Napoleonic side, his grandiosity. But also playfulness. One of the best moments is when he is being arrested and photographed (charge: trespassing; event description: \"man on wire\"), he takes a policeman's uniform cap and balances it on his forehead by the bill, then flips it onto his head. His exploit had made him a celebrity and a mascot. He enhanced life, made a partly clunky new landmark beautiful and remarkable.<br><br>After the event, he knew he was famous. How can you ask me if I'm thirsty, he says to a psychiatrist, when 300 journalists are waiting to interview me? And his first act after release was, as somebody put it \"to bang a groupie,\" which he himself describes as \"disgusting.\" Maybe he was steadier out on the wire, where he remained for half an hour, high over New York, without a net, crossing and re-crossing eight times by his friend's count. And then afterwards, somehow things were so bent out of shape that he ended two key relationships--with his girlfriend and his collaborator (both of whom help narrate this film).<br><br>This is troubling, but Petit is also wise, a saintly kind of man, immune to ordinary temptations (except groupies?). When asked why he'd done it, he said: \"If I see three oranges, I have to juggle. And if I see two towers, I have to walk.\" The psychiatrist judged him \"same and ebullient.\" His was a pure act, an existential declaration of joy, an example of how to live life daily to the fullest. \"Every day for him was a work of art,\" says his girlfriend. \"L'art pour l'art,\" art for art's sake, is his motto. All of which is pretty thought-provoking, and may be inspiring. At a time of many excellent documentaries, this one seems indispensable. It provides a very pure kind of thrill. Needless to say after 9/11, the buildings gone, the recreation of this moment evokes nostalgia and loss.<br><br>Actually Petit has done much since the event. Right afterward the charges of trespassing and criminal conduct were dropped with the promise that he would perform juggling acts for children in Central Park, and he was given a permanent pass to the towers. A policeman interviewed at the time says when he watched, he knew he was seeing something unlike anything he'd ever see again. Sometimes you do know. When he was interviewed for this film, he was artist in residence at the Cathedral of St. John the Divine.","user":"Chris Knipp","rank":[89,103]}]