[{"title":"Skip it","rating":4,"date":"13 August 2012","review":"A very loose and disappointing sequel to The Cell, Cell 2 stars a Sandra Bullock lookalike as a clairvoyant on the trail of a serial killer named The Cusp. Fifteen minutes into the movie and we know who the killer is. Shot on no budget, this Utah-lensed video makes little effort in the special effects department, in stark contrast to The Cell with its operatic sets and imaginative use of CGI. So it's pretty much a standard criminal pursuit film, and the truth is one can get more kick out of an episode of TV's Criminal Intent. Toward the end, for a few seconds, we get to see our clairvoyant heroine all gussied up. And I must admit I wouldn't mind spending a little time with her. But she is no Jennifer Lopez (or Sandra Bullock) in the acting department, at least not here. Frank Whaley costars.","user":"ctomvelu1","rank":[11,11]},{"title":"Terrible Screenplay","rating":4,"date":"11 February 2010","review":"The FBI Agent Maya (Tessie Santiago) has developed the ability of psychically connect with other people after being murdered six times and brought back to live by the sadistic serial-killer Cusp. Now she is tracking down the infamous criminal through his mind using a device to protect herself but after an unsuccessful manhunt, she quits the FBI. One year later, when the niece of Sheriff Harris (Chris Bruno) is abducted by Cusp, Maya's former chief Kassel (Michael Flynn) summons her back to the investigation. Maya teams up with Harris trying to save his niece Penelope (Amee Walden), but her time is short and she must risk her own safety to help the young woman.<br><br>\"The Cell 2\" uses the idea of the average \"The Cell\" combined to these sadistic movies of torture like \"Saw\" franchise, but the result is weaker than the foregoing films. First, the screenplay is terrible, with many clichés and holes and awful characters. The restricted budget associated to the reasonable acting make this direct to DVD movie forgettable and a waste of time. My vote is four.<br><br>Title (Brazil): \"A Cela 2\" (\"The Cell 2\")","user":"claudio_carvalho","rank":[14,15]},{"title":"Just as entertaining as the first movie, but only because it's hilariously bad.","rating":1,"date":"30 March 2010","review":"The Cusp is a killer who repeatedly kills his victims, then brings them back to life, until they beg to die. Some psychic chick has to go into the killer's mind to find his latest victim before she is killed.<br><br>I'm a fanatic for the first film. On a scale of 1 to 10, my excitement was about a 15 when I heard this sequel was being made. When I found out it was going direct-to-video, that excitement plummeted to a 2. Looking back, I realize that even after that drop to a 2, I was way over-excited for this movie. Yes – it's THAT bad.<br><br>The plot doesn't sound too terrible. I like the idea of a killer making his victims beg for death, and doing that by actually killing them is interesting. But the delivery of this concept was painfully lame. The victims don't put very much effort into their performances at all. The first girl, who's getting her heart cut out, responds as if it's only a minor inconvenience. Seriously, I picture the director behind the camera saying, \"Okay, now act like you're in mild discomfort.\" I also thought the killer would be using some ritual or something interesting, but instead, he's using legit medical practices. One example is suffocating his victim with a plastic bag, then performing CPR to revive her. It's just not very interesting. I'm not sure if a ritual would be much better, but what we're given is just underwhelming.<br><br>There are so many little details about this movie that are just flat-out tacky. First of all, the intro to the movie is a short clip from the first film, during which a narrator says something about how a psychic entered the mind of a killer, and \"now ... there is another\". This is the only time we hear the narrator's voice. It feels rushed and stupid. (It had me and my friend laughing mere seconds into the movie.) Then, during the end credits, we see aerial shots from a helicopter. Half of the shots have the chopper's shadow in view. (It seems like they spent half of their budget on renting this helicopter so they were milking it for all they could.) Then the credits stop twice to showcase brief behind-the-scenes shots. Both of these shots are boring and offer absolutely nothing interesting. There's no point in their presence what-so-ever. Any class that the picture could have had is flushed down the toilet by dumb little moments like these.<br><br>An especially tacky aspect of the script is the use of FBI vs. local cop clichés. Not only is the local cop the hero, while the FBI guy is almost a villain for doing his job, but this movie teaches me that it's okay for a cop to tightly grip an FBI agent's testicles and threaten him in order to get a point across. Apparently he won't get fired, arrested, or sued for sexual harassment. Wow. You learn something new every day.<br><br>The only connection this story has with the first movie is A.) the brief intro that simply mentions J-Lo's character, B.) the general concept of entering a killer's mind to save one of his victims, and C). the ethnicity of the main characters. It really seemed that they cast the leading lady in this sequel for her ethnic appearance, rather than acting ability. There was no reason for this. We don't care what ethnicity she is, we just want someone who can act.<br><br>The way they depict the mind in this sequel is nowhere near as stylish or visually interesting as it is in the first movie. I feel like I shouldn't rag on this aspect too much, since they were obviously on a very small budget. There is one very small visual that's slightly interesting when you see it in context, but it's delivered with horrible CGI.<br><br>There is one area in which this movie genuinely impressed me. I was blown away by this movie's ability to make the most simple moments hilarious through awful editing, camera-work, and performances. There's a part where two FBI agents are chasing after the two main characters. It doesn't sound funny, but the horrendous editing, effortless camera work, and HALF-ASSED JOGGING of the actors makes the scene side- splittingly hilarious. There's also a car-chase scene that is made incredibly funny by the awful camera-work and editing. This is honestly one of those movies that I'd show to film students as an example of what NOT to do.<br><br>Overall, the movie has one or two interesting ideas wrapped into the script, but the weak acting, lazy film-making, crappy writing, and tacky moments make this movie funny as hell, and there are no interesting visuals to save it. I find this movie just as entertaining as the first film, but only because it's so hilariously terrible.","user":"Necrotard","rank":[9,9]}]