[{"title":"Average, more style than substance","rating":6,"date":"30 June 2017","review":"Overall I enjoyed this movie but I think it was more style than substance. The direction and visuals were excellent - it's possibly worth watching the movie solely for them, especially if that's your kind of thing. The aerial ballet and art exhibit scenes in particular (which you get a hint of in the trailer) were stunning. It's a well-made movie with a sufficient budget.<br><br>I don't want to spoil anything, so I'll just say it reminded me of Knowing and Twelve Monkeys - however, compared to those two movies, the stakes felt rather low and the mystery was never particularly compelling, on top of being a little too predictable. I always felt I knew the general direction it was heading, even if I didn't have all the details yet.","user":"fandomfatale","rank":[79,97]},{"title":"Read spoilers before watching the movie!","rating":5,"date":"11 July 2017","review":"This is one of the few movies where reading the spoilers beforehand will actually improve your viewing experience. So if you haven't seen the movie yet, keep reading and then watch the movie! <br><br>###Spoilers###<br><br>This movie is all style, and no substance. It is about \"feeling feelings\" of something important going on, its about eternal love in a way, about cosmic fate, maybe a little bit of afterlife mythology and/or simulation theory sprinkled in. But don't keep your hopes up! There will be no resolution whatsoever. If you are looking for some kind of revelation at the end, you will be as disappointed as I was.<br><br>But now you know, so you can watch the movie, enjoy the scenes, the beautiful actors and the sparkling atmosphere for what they are (style over substance), and don't feel betrayed when you find out that all those threads were never meant to lead you anywhere.<br><br>Best of luck!","user":"imperator-ming","rank":[62,83]},{"title":"Entertaining, surreal movie","rating":8,"date":"30 September 2017","review":"I have to admit I don't understand the extreme negativity in some of the reviews.....especially considering the amount of uninspired garbage in movie theaters these days.<br><br>Now, 2:22 is not a masterpiece, and like most movies it has weaknesses, but its strength is that it builds a sense of suspense without the usual car chases and urban shoot outs that seem to please the ADD crowds so much. The acting is solid (not Oscar material but better than hinted at in many reviews), the direction and special effects are very polished, and, more importantly, the slow accretion of mysterious details and surreal circumstances make it far more interesting, IMO, than most movies currently on offering. I think this movie also does a good job, overall, of hinting at parts of the ending but at the same time maintaining a sense of suspense about how exactly the mysterious events and patterns noticed by the main character will come together.<br><br>This is not a realistic thriller, with a clear cut plot and an ending that explains every minor thread or detail in its story, or a relentless action movies with plenty of explosions and other events that ultimately mean nothing, or a bloated love story with SF elements. Hence, I think, the disappointment of some viewers.<br><br>The way I see it this is a movie that, despite its imperfections, evolves into a subtle, psychological thriller that hints at man's endless fascination with patterns (in our Universe, in our life, in history etc) and at our sense of wonder of how we fit in it. A movie that while providing us with an interesting story also asks us to add to the plot our own interpretation of the events, and our own sense of wonder about the mystery of our existence.<br><br>Now, there is no doubt that other movies on similar topics are superior (12 monkeys and Groundhog day come to mind, among others), but I still think this is one of the few movies worth watching I've seen this year, despite its limitations. At least it asks the watcher to actually engage his brain instead of just switching off and let the explosions roll on until the cardboard cutout bad guy/guys are vanquished.","user":"peterfaure","rank":[30,38]}]