[{"title":"Writing Can Be Hazardous To Your Health, Part 3","rating":7,"date":"23 November 2011","review":"This film pleasantly surprised me. Recent Clive Barker adaptations haven't really been masterpieces (though thankfully there always has been enough talent involved to make them interesting, at least). \"The Plague\" (2006) just wasn't much to write home about. \"The Midnight Meat Train\" (2008) was better, but it basically just tried to blow your socks off with extreme violence &amp; bloodshed. And now, \"Book of Blood\" might just be the finest recent adaptation so far. It relies more on mood &amp; atmosphere and all this is handled well. A duo of paranormal investigators - Mary Florescu (Sophie Ward), the professor &amp; Reg Fuller (Paul Blair), the technician - moves into a reputed haunted house. Mary invites student Simon McNeal (Jonas Armstrong) to come along, for she believes him to have psychic abilities that might tap into the house's paranormal activities. But distrust soon rises between the threesome as they try to determine what's real and what's not in this house of hauntings.<br><br>Granted, the story remains pretty thin throughout the film, but director John Harrison takes this as an opportunity to not only create an eerie mood and build tension, but also to work on the main characters. There's a disturbing sexual tension growing between mentor Mary &amp; student Simon which escalates in some keen exposure of betrayal. Actress Sophie Ward is an awesome woman and left a great impression on me with her toned-down performance. Both the pro- &amp; epilogue make the movie a bit oddly structured, but it helped to flesh out the story a bit (pardon the pun). The film oozes with that sort of old school British Gothic vibe, but it's much darker portrayed than usual, adding a great deal of atmosphere to the picture. It's a rather little film, don't expect to be blown away, but it's a well-made effort and a clean adaptation carrying on the spirit of Clive Barker's work splendidly. I have yet to see his other recent outing, \"Dread\" (2009), but I've heard decent things about it already.","user":"Vomitron_G","rank":[10,11]},{"title":"Horror Clive Barker Style that almost gets ruined by the lack of a real story","rating":5,"date":"20 May 2009","review":"\"Book of Blood\" contains several trademarks of Clive Barker's earlier work. So be prepared to expect some gruesome special effects. Only this time it is dumbed down considerably especially when you compare it to \"Hellraiser\" or \"Candyman\". The buildup of tension can be compared to the style he used in the (very excellent) video game \"Undying\". In which the atmosphere is key for providing the scary moments. The biggest problem however with this movie is the story. That is to say that there isn't much of a story. The little story that does get presented to the viewer doesn't go anywhere and only gets confusing in the end. (Small Spoiler!!!) There was a perfect opportunity to use Doug Bradley since his character seems to be the cause of the events that played out. But he only is in it for 1 minute or so which is clearly not enough to make the same impact as he did with the Pinhead character. In the ending all the viewer is left with the feeling that he/she could have skipped this movie. This is a big shame since \"Book of Blood\" had a lot of potential into creating a new horror icon.If you can overlook the slow pace and the lack of story then you can enjoy this movie since it is full of suspense,scary moments and even some pretty erotic scenes.","user":"chrichtonsworld","rank":[11,13]},{"title":"Tricky","rating":4,"date":"16 July 2009","review":"Actually I do like the theme of story. And it has a pretty good ending. The problem is, what lies before that and how the story is treated. While I haven't read the source material (book by Clive Barker), I'm sure it is a far better and more complex story to be found there, which didn't translate to the screen.<br><br>Apart from the pacing and a story twist that will leave with a bad feeling (again, I don't know if it's the same in the novel), what really gets to you, is the fact, that the actors are pretty dull. I'm not saying bad, just dull. It's exactly about sympathizing with them, but they leave you more than cold (no pun intended). Which might work for other movies, but not here. Still there are a few scares, it's quite nicely shot and the aforementioned ending ... other than that? Not much!","user":"kosmasp","rank":[30,42]}]