[{"title":"Engaging and well made drama/thriller","rating":21,"date":"21 February 2010","review":"Shifty is a young drug dealer living with his older brother and earning a couple of grand a week. When an old friend comes to stay with him and asks him to come back up to Manchester to a safer, cleaner life, it marks the start of a rough day for Shifty, as his normal drop-offs are complicated by one customer who goes off the rails, and a rumour that has made it back to Shifty's supplier that he is cutting the product and selling for himself on the side.<br><br>Made for as little as £100k (which would not even buy you a one-second Megan Fox pout) this film is to be admired for how good it looks considering the constraints of the budget. However if praise was given out to independent films made for no money then there would not be enough to go around as there are plenty of similar attempts – just many of them really do show the lack of resource in all areas. It is not the case with Shifty because the film is an effective and well made affair that engages by virtue of how it is put together. The story is reasonably straightforward but it is written with a wider story behind it – one that we perhaps don't get all of but one that impacts onto the characters and their relationships and makes for a stronger character set and a more interesting film. I was interested in both Shifty and Chris as people as well as the grubby little world they inhabit.<br><br>On top of this the day in question also has some violent risks for Shifty and these add a semi-thriller touch to the story. Again, this isn't totally fleshed out all for the viewer to see but it works as it goes. It isn't perfect as a story but it does well to juggle a couple of different characters to add to the flow of the narrative while also avoiding being judgemental about any of them – your conclusion may be \"drugs are bad m'kay\" but the film does not seem to have that as an agenda but is just focused on telling the story.<br><br>The cast deserve credit for working on such a low budget film; OK they are not Hollywood stars used to commanding millions but there are several faces that will be recognisable from big films. The star of the film is Riz Ahmed, who does well for once not playing someone associated with 9/11 films. He is a likable character but he also conveys that edge of toughness and threat that he needs. He does good work with his face and eyes to ensure the viewer can sort of appreciate his thoughts without them being rammed down your throat. Mays has less of a showy role but he does the same – hits the character well and makes him convincing from the start and throughout, only weakening a little bit towards the end when I expected him to convey the impact of events a little better. Flemyng is a solid presence and a good face to help the film, while Simpson's Trevor is a tragic figure and he plays it well, making him a real person rather than a simple plot device to be either pitied or hated.<br><br>Shifty is not a brilliant film to be sure, it is far to slight for that but it is a particularly good one. It isn't social realism but it has an authenticity to it that helps make it work, with the well written and performed characters providing a strong base for the narrative to be built on. If it had cost ten times as much to make I still would have liked it but that it was made for so little is an impressive thing of note.","user":"bob the moo","rank":[16,17]},{"title":"Darkness On The Edge Of Town","rating":8,"date":"11 October 2009","review":"While a subject that is quite familiar to low budget UK films, 'Shifty' is better than most.<br><br>The tiny budget may have made too much flashiness impossible, the film is all the better for it. Since it gives a more realistic touch and lets the characters develop.<br><br>The film does was it sets out to do well, 24 hours in the life of a drug dealer (who unlike the usual stereotype had choices due to his good education and once supportive family). His limited world is upturned by an old friend returning to town after 4 years, after an event, not revealed until late in the film, though he has plenty of other problems looming.<br><br>Well shot, good characters, good script and it kept me interested from start to finish with some very good moments within a tight narrative.<br><br>Plenty of similar films in this genre deliver less than they promise, 'Shifty' on the other hand, to quote a well known advert in the UK 'Does What It Says On The Tin'. And does it very well. Recommended.","user":"GrahamEngland","rank":[12,13]},{"title":"Take a shufty at Shifty","rating":8,"date":"20 April 2009","review":"Shifty is being hailed in some quarters as an early contender for best British film of 2009 - a double-edged blessing for any debut, which can rarely hope to live up to the hype, however well intentioned. Shifty isn't the second coming, the one true saviour of UK independent cinema. But it's a very decent little crime thriller, with a lot of heart, that deserves more than a couple of weeks at the repertory before being marooned on DVD.<br><br>Chris (Daniel Mays) returns from Manchester to the (fictional) outer London suburb of Dudlowe after four years in white-collared exile. To his surprise, he discovers his old school mate Shifty (Riz Ahmed), the \"smart kid in class, four A-levels\", has since transformed from a part-time weed merchant into a full blown crack dealer.<br><br>Over the next 24 hours, the country mouse accompanies the town mouse on his rounds, supplying everyone from middle-class hippies to dead eyed kids, while being stalked by an increasingly agitated Trevor (Jay Simpson), a broken family man prepared to take his next fix by any means necessary. (Shifty must be selling some uncommonly good gear.) Meanwhile his brother Rez (Nitin Ganatra) is about to kick him out of his house, and double-crossing supplier Glen (Jason Flemyng) is setting him up for a fall. Can Chris convince Shifty to abandon his life at the crack face before he comes a cropper? <br><br>'Shifty' sounds like an ITV comedy drama from the late 1960s or early 1970s, no doubt starring Hywel Bennett or Adam Faith as its eponymous lovable rogue; up to no good, but more victim than predator - and that's pretty much the case here. An ocean away from The Wire's corner boys, Baltimore's tooled-up foot soldiers marinated in murder, Shifty's scrappy pushers embody a familiar kind of hapless Englishness; the sort who might shut up shop for a day, owing to the wrong kind of snow on the road. Yet for all its lively banter (\"I can't believe you just sold crack to Miss Marple and struck a deal with Blazin' Squad\") the film is no quirky apologia for crime. This is the pedestrian reality of drug abuse: people hurting themselves in small rooms.<br><br>All the cast are terrific, playing real three-dimensional characters, but actor-musician Riz Ahmed is standout as the titular live wire, utterly nailing the dealer's temporal mindset. He might look as if he's physically occupying a scene, but he's not really there at all - his eyes tell us he's already on the next page, a parasitic tick, eternally leaping from host to host.<br><br>Writer-director Eran Creevy drew his inspiration from a former school friend, an A-grade pupil who discovered he could make more money in the real world by dealing drugs. Not for Shifty being \"stuck in a warehouse, knocking out dodgy Fruit Of The Loom\". Had things worked out differently, we can easily imagine him popping up on 'The Apprentice', back-chatting Sir Alan.<br><br>Creevy eschews the woozy, art-house ambiance of Duane Hopkins' Better Things - another portrait of a drug-decimated community - for naturalistic dialogue and performances within carefully framed and composed shots; properly cinematic, grown-up direction. Though we never get the impression we're watching a wildly original cinematic voice, it's refreshing to encounter a film featuring gritty, 'urban' subject matter that hasn't been shot with a hyperventilating DV camera.<br><br>This relative stillness and subtlety gives rise to moments of exceptional power. During one scene, Shifty delivers to posh, pensionable hippie Valerie (Francesca Annis), in a grimy council flat littered with Moroccan tat and dead, stiff cats. It is safe to assume this is a long way from where she imagined she was going to end up. After everybody has had a nice cup of tea, Chris and Shifty hunch embarrassedly on the opposite sofa in silence, while Valerie gratefully sucks on the pipe, gently collapsing back into her chair, as muffled, moronic techno from the flat upstairs leaks through the ceiling into the room.<br><br>Such damn fine film-making reflects well on Shifty's sponsor, the Microwave project, which gives aspiring UK indie filmmakers a chance, a mentor, and some money to help realise their dreams. The catch: they have to turn their movie around in just 18 days on a budget of £100,000. While everyone, from caterers to star actors are paid the same, inducing a more democratic vibe on set. Heathrow horror Mum &amp; Dad, released on Boxing Day 2008, was the first film to be made under the scheme. Shifty is the second. There are eight more to come.","user":"Ali_John_Catterall","rank":[36,46]}]