[{"title":"Stunning...in many ways","rating":9,"date":"15 September 2009","review":"If the following things disturb you, then you should probably avoid this film: strobe lights, drug use, shaky hand-held cameras, graphic sexuality, sperm, spinning cameras, psychedelic imagery, blood, gay sex, abortion, breastfeeding or a graphic auto wreck.<br><br>But if you're still intrigued then sit down and get ready for nearly three hours of mind-blowing imagery that you'll never forget! Although IMDb lists the Toronto Film Festival version as \"only\" 135 minutes, according to my watch we got the 163 minute version that was shown at Cannes. The presenter also warned us 3 times before the screening that anyone with epilepsy should leave the theatre due to the flashing lights in the film. She was quite serious about that.<br><br>I was a bit apprehensive prior to the start of this movie. I didn't \"get\" 2001 at all the first time I watched it and I positively hated David Lynch's ERASERHEAD. Would I enjoy ENTER THE VOID? Understand it? Walk out before the end? Yes, yes and no.<br><br>The film opens with Oscar and Linda, siblings from the United States living in Japan, looking out at Tokyo from an apartment balcony. It quickly becomes obvious that Oscar is both a drug dealer &amp; addict while his sister works as a stripper. Their tragic family history is revealed in segments throughout the first hour. The entire film is seen from Oscar's perspective, either as: (1) First-person, shaky camera, blurry shots as Oscar walks around Tokyo, very high on drugs (2) An out-of-body experience where Oscar floats around the city observing Linda's life and the people that interact with her (3) Flashbacks to Oscar and Linda's youth, similar to (1) except that here we always see the back of Oscar's head in the shot rather than \"through his eyes\" (4) A surprise at the climax of the film.<br><br>Number (1) above may sound nausea-inducing to some, but there's usually interesting dialogue to distract you from the disorienting visuals and these scenes only comprise a small percentage of the total screen time. Technique number (2) could have been Oscar-worthy if it was filmed for a less controversial movie. Floating and spinning above the city of Tokyo and watching various dramas unfold from up above is absolutely incredible. You'll spend so much time watching from this perspective that it's easy to get lost in the images and forget what an incredible technical achievement you're observing.<br><br>Virtually all of the key plot elements occur within the first 90 minutes of the film. After that the film transforms into more of a psychedelic, visual experience while the story fades away. This phase of the film really tested my patience and I started to check my watch frequently but there were enough eye-popping scenes that I'm sure I'll view this a second time someday. The momentum returns during the final 10 or 15 minutes, and although this final phase is simply a logical conclusion of what had been blatantly foreshadowed earlier, it's nonetheless amusing and incredible to watch the taboo-breaking finale.<br><br>This film is very unique, disorienting and absolutely incredible &amp; unforgettable. I can definitely understand why it's been compared to 2001: A SPACE ODYSSEY, but I found ENTER THE VOID to be more accessible and more comprehensible during my first viewing. It's too controversial and too bizarre to appeal to most people, but it will undoubtedly find its niche as one of the greatest cult classics of all-time.","user":"grmagne","rank":[203,264]},{"title":"Relentlessly Nauseating Modern Art","rating":9,"date":"4 October 2010","review":"Enter the Void is exactly the kind of polarizing film that cinema needs right now. Too many films these days play it safe, being concerned with keeping the audience comfortable, safe and happy. Enter Gaspar Noe, who clearly has no regard either for the well-being of either the audience or his actors. We have antagonistically long (but brilliant) takes, beginning in an apartment and ending in a bar, several blocks over. We are given characters and are exposed to their darkest moments, but are never given a real reason to care for them, or to perceive them as anything but wretched. We are also shown some sexually discomforting things that we never really wanted to see on the silver screen (if you've seen it you probably know what I'm talking about). Also, the film is almost completely in first-person viewpoint, so you're constantly feeling confined to what Oscar is looking at, which are mostly psychedelic images. In effect, the feel and tone of the story are immediately off-putting for the viewer, but since you've already bought a ticket, what can you do but follow it through? <br><br>This is definitely the kind of film that can be approached in the wrong way, both with the medium that you view it through, and with your state of mind. Enter the Void is meant to be a transportive film (i.e. you living directly in the viewpoint of another, and feeling how that person feels, and perhaps even thinking how that person thinks). To technically maximize the experience, the film should really be experienced on the big screen. I'd imagine an IMAX screen to be ideal.<br><br>I also think a film like Enter the Void really needs to be approached with a separate set of goals than that of a normal film. First of all, chuck any notions of entertainment, or even enjoyment, out the window. While you're at it, remove any notions of positivity that you can think of. The only reactions that Enter the Void will draw from you are negative ones. Personally, the only emotion I consistently felt was a slight nausea, tinted with the occasional horror, or perhaps a shameful arousal, as there is excessive sexual content that is all wretched in one way or another.<br><br>The film is shot with a certain frame of mind, and sticks to it with remarkable faith. It's in the point of view of a small group of friends who are confined to the drug and clubbing scenes in Tokyo. He then films them in the most abrasive ways possible, showering the viewer in infinite neon lights, and fish-eyed close-ups, and then Noe lets his frames linger on these unsightly images for uncomfortably long. Even with his tracking shots moving from one location to another, when the viewer is normally given a moments rest, he rapidly cuts across hallways, stairs, and streets, and never gives the viewer a free moment to settle down.<br><br>Despite the film's antagonistic feel, and despite the physical and psychological discomforts that the film drew from me, I still found Enter the Void to be a worthwhile and even inspirational experience. More to the point, Enter the Void may not be a friendly experience, but this exact kind of experimentation and determined expression are just what cinema needs in order to be taken seriously as an artistic medium, when so many other directors air on the side of caution and safety. It might be a difficult ride, but just watch it once and you'll carry it with you forever.","user":"radioheadrcm","rank":[151,199]},{"title":"A good film in desperate need of editing","rating":7,"date":"5 August 2010","review":"Saw this at the Melbourne International Film Festival. Whilst I didn't enjoy Noe's first film I Stand Alone, I loved Irreversible.<br><br>There is lots to like about ETV and much to dislike as well. An hour into the film and I would have given it perhaps an eight or nine but by the end of the film I was frustrated. Why? Noe just can't help himself and you get the feeling he either didn't know how to end the film or simply just wanted to be shocking for the sake of it.<br><br>Visually, I couldn't help but be impressed. Some amazing shots, lighting (strobe) and editing techniques. Noe also mixes up the story well as he did in Irreversible. You are not spoon fed the story and I love the way he told the back story of the two leads.<br><br>Plenty of people walked out at the screening after the hour and forty minute mark and I couldn't blame them. Probably not because they were shocked but just bored and frustrated. Noe pads this out and it is such a shame as overall it ruined the film as a whole.<br><br>The acting is quite wooden and doesn't ring true but that is only a minor quibble when compared to the film's bloated running time.<br><br>Hard to fault Noe for his creativity, energy and style and refusal to follow norms in terms of narrative structure etc. Still, I wish a friend or colleague had tapped him on the shoulder or given him some constructive criticism about the last half of the film.<br><br>I can only imagine how much footage Noe might add into a Directors Cut - Lord help us. Perhaps he could learn some lessons from this and streamline his storytelling and not feel the need to bludgeon the audience just for the sake of it.","user":"sharkies69","rank":[213,291]}]