[{"title":"Since Exorcist, there's maybe one or two movies of this subject that have been good...half decent...and this is one of them.","rating":7,"date":"31 January 2011","review":"Sometimes you read reviews, but want to see the film so bad, you go, and because your expectations are so low. You enjoy the movie. Reviews seems to be on the good side, with earlier reviews being very bad.<br><br>This is a good movie. The acting is good. The directing is good. Unfortunately some people are bothered by the lead in the movie. But that's his job. And he did his job well. He was picked for a good reason. I would only be guessing why. But those/the director/writer who created this movie did a good job. The feel of this film, the length. I had a good time.<br><br>I would give this film a decent 7 out of 10. It does not rely on gore to scare you, or major special effects, or 3D. No doubt Anthony Hopkins is great in this film.<br><br>I enjoyed it. You get what you paid for. Your not going to get The Exorcist. But in the HORROR film library, if you ask me, 80 - 85% of them all are garbage, or slasher, gore, which I do not consider a \"Horror Movie.\"<br><br>Well done everyone involved. It will not win awards. But so far it's a decent film that I will remember as one of the good ones from 2011. <br><br>Lastly....anyone talking during the movie...were silenced.","user":"poicop","rank":[140,188]},{"title":"A more believable horror = SCARY!","rating":10,"date":"26 October 2017","review":"This film represents what I have read about exorcisms, and although I am a thorough atheist, it definitely is terrifying if you can empathise with the characters in the books and then too in this film.<br><br>The acting from Hopkins is going to be solid; that is what made me watch the film in the first place. However, the cinematography could have done with some tweaking. <br><br>Firstly, there were things that could be understood by extrapolating from clues, that if left to the viewer would have enabled an even more empathetic experience, therefore all the more terrifying. Instead, certain instances where it was very easy to understand what was going on, there was overemphasis from the film, and certain things that were important to the plot were underdeveloped and in a few instances were skipped over. <br><br>Aside from that, I think it was a solid movie.<br><br>I'd say to give it a whirl if you are open to this type of supernatural horror.","user":"vr-08900","rank":[8,8]},{"title":"The Rite saves the dying exorcism sub-genres","rating":9,"date":"21 May 2011","review":"After losing faith in the exorcism sub-genres and my sister telling me how average this movie was, i didn't expect much from The Rite. Honestly, the only reason i watched it was because of Anthony Hopkins, and i am glad i did. This movie has everything that fans want in an exorcism movie. Some people may find it a bit slow paced but the movie does not steer off course, every minute is relevant to the storyline. <br><br>Even in his 70's, Mr Hopkins did just what was expected from him. He gave a powerful performance which scared the living hell out of me and played his most convincing role since Hannibal Lector but surprisingly so did someone else, someone who i had never heard of. Yes, i am talking about Colin O'Donoghue, who managed to stay in the light and make a great connection with his co-stars. Every character in the movie was fully utilized specially that of Alice Braga.<br><br>I find that many people fail to see the spark in this film, and the only reason i can think of is that people these days are too fond of gore which this movie lacks. Surely, The Rite is not for the \"Doubters\" but for the people who believe and have interest in this subject.<br><br>After decades of miserable exorcism movies, finally we got us a winner. Can i dare say that this movie is better than The Exorcist?, No i cant but this is definitely the \"Second Best\" .. <br><br>Now i can confidently say that \"you were wrong big sister\".<br><br>With solid performances, amazing cinematography and mind blowing sound effects, i give it a 9/10.","user":"yawar_hameed_jan","rank":[61,86]}]