[{"title":"The new porn - Violence, Gore and Blood","rating":1,"date":"2 October 2011","review":"This movie is basically a Hollywood version of a snuff film. There is no real plot other than something that's been used as a sub-plot in television and in other B class movies.<br><br>Simple formula.<br><br>Kidnap people who have some talent to fight.<br><br>Convince them to fight to the death.<br><br>Put on shows for the masses and make big money.<br><br>Okay, first tiny little problem is this: Where is the money? OBVIOUSLY this is a SUBSCRIPTION based online revenue but it is CHEAP enough for some College kids to afford? RIGHT...<br><br>Then we have the second fight for our main hero, David Lord. He is supposed to kill his opponent in less than 3 minutes or the wife of his friend dies. Guess who his opponent is?....Yep, you guessed it, his friend.<br><br>Now if you do the math, the ONLY way his friend would be inclined to fight is if HE were told that if he won, his wife and he would be set free.<br><br>SO, you have a man that has trained ALL HIS LIFE with weaponry in Martial Arts and he manages to get beaten? Okay, David Lord IS a Marine but seriously, able to beat an opponent who has trained all his life with the Katana? I think not.<br><br>I'm only halfway through viewing this but I already know how it's going to end. Unless you're really into watching some senseless killing, give it a pass. If the second half of this movie changes my mind, I'll be back to alert you that my original take on it was wrong. I'm big enough to admit that.<br><br>Well, I'm back and surprise, surprise, I was NOT wrong. To say it's a contrived ending leaving us open for a sequel is an understatement. I go with my first warning to you. Give it a pass and a wide berth.","user":"davidfurlotte","rank":[72,101]},{"title":"You've already seen it","rating":2,"date":"2 October 2011","review":"Men are forced to fight to the death for an eager internet audience, but the game's most recent recruit may pose a threat to the system with his unyielding spirit.<br><br>It's a cliché to even say this sounds familiar, so I won't do that ;)<br><br>This might've had a chance at being good if it had been made prior to Gladiator, Running Man, Gamer, Rollerball, etc. etc. etc. (as then, at least, the idea behind the whole thing would've been something new). This doesn't seem to make much of an attempt at serving up anything significantly fresh though, except perhaps the effects technology to up the bar slightly on gore.<br><br>The topic is the public's tendency to get hooked on sadistic voyeurism, and the people who use that tendency to make money/power. Samuel L. Jackson plays the man taking advantage, and although Samuel is usually great, and I would SO like to say \"even Samuel's awesomeness couldn't save this film,\" I actually can't even say that. I found his performance here to be somewhat sub-Samuel. His heart just didn't seem in it, and for that I can not blame him too much, as the material just isn't worthy of his efforts.<br><br>I'm not sure what exactly got Mr. Jackson stuck with this job, but I have a feeling it was a reluctant favor to first-time director Jonah Loop, who handled visual effects on a couple of Sam's other films.<br><br>The film progresses somewhat as one would expect, albeit with a little window dressing. I found myself wanting to fast-forward often, which I took as a bad sign. Cinematography, effects, sound, etc. were on Hollywood par though, and everyone else's acting was actually pretty good (perhaps the rookie director was too intimidated by Jackson to offer him much direction, in comparison). Hopefully, with some better ideas that everyone can actually care about, this director can pull off some good films in the future.","user":"equazcion","rank":[59,86]},{"title":"Stylistic, gratuitous exploitation","rating":5,"date":"9 October 2011","review":"While I agree with the highly negative reviews already posted, I didn't find it *quite* as offensively bad as they did. Sure, the fight choreography was poor, at times, but it wasn't nearly as bad as Amsterdam Heavy. The acting wasn't much better, but it was still about par for the genre. I guess this is place where I'm supposed to express incredulity over Sam Jackson appearing in this movie, but, really, everyone who watches lots of low budget, direct-to-video movies knows that he'll appear in anything. He's done some really mediocre (and even bad) movies, in the past.<br><br>Anyways, the main plot consists of a James Bond villain (Sam Jackson) kidnapping people and forcing them into fighting to the death. That's it. Nothing else. No pretenses to art here. Now, if the fight choreography and stunts were good, I might able to suggest this to fans of direct-to-video B movies inspired by Enter the Dragon and Bloodsport. Unfortunately, they're really not very well done, with some of them looking downright crappy and unimpressive. Some others, however, end up looking pretty decent, though nowhere near Enter The Dragon or Bloodsport. The direction focuses on stylized, bloody violence, with fast cuts, slow motion, and lots of posing. If Michael Bay drives you nuts, I doubt you'll like this much, either.<br><br>There's a rather surprising amount of gratuitous exploitation in this movie. If you're prudish at all, I'd warn you to avoid it. There's constant, gory violence and occasional full frontal nudity (female only), making this one of the most overt, unapologetic, and cynical attempts at making a mainstream action movie that I've seen recently. I guess they're saying that if the nudity doesn't get you off, the violence will, like we're all a bunch over-stimulated sociopaths. There's a satirical element to all this gratuitous exploitation, but I think it was inserted merely to deflect criticism.<br><br>If you're looking for exploitation, there's plenty of that. Otherwise, I'd say you're best off skipping it. The action scenes aren't good enough. Some people have criticized this as being pornographic, and I have to agree; the violence seems to be almost fetishized. However, amoral as I am, I find the lack of plot and poor fight choreography to be the true problems with this movie.","user":"krachtm","rank":[28,40]}]