[{"title":"The Slammin' Salmon (2009)","rating":7,"date":"6 January 2012","review":"I love Broken Lizard, and I always end up watching their films multiple times. It will be no different for Slammin' Salmon. The plot is obvious, but it's simply there to set-up some jokes. Heffernan takes a shot at directing and he's talented enough to serve the script. Unlike other Broken Lizard films, the characters have an absolutely equal share of screen-time, there's no obvious protagonist. Cobie Smulders and Michael Clarke Duncan add some extra comedic chops, and it's nice to see some of the supporting regulars around. If you're looking for a strong plot or painful belly laughs, I doubt you'll be satisfied. But, if you like gentler laughs and well strung together sketches. I have a feeling this will be a grower.","user":"SnakesOnAnAfricanPlain","rank":[10,11]},{"title":"If you get their style, this is hilarious","rating":10,"date":"18 April 2010","review":"As indicated, this movie won't be for everyone; that said, few movies are, particularly in the realm of comedy.<br><br>In any case, for those of us who enjoy Broken Lizard's other films, this movie is sure to impress. Indeed, it has all their hallmarks: amusing, witty, even absurd dialogue; hilarious ensemble scenes; wonderful character/cameo performances; and an incredibly funny blooper reel during the end credits.<br><br>And, as others have indicated, Michael Clark Duncan's performance is classic -- just awesome. And to be sure, the two female leads are both great, as well (and quite easy on the eye, it must be said ;).<br><br>At any rate, as the title of this review indicates, I have no doubt that some people will criticize this film; but for me, it's classic Broken Lizard, and I think that's a great thing! Peace.","user":"billshattner","rank":[24,31]},{"title":"Consistently Funny","rating":8,"date":"27 July 2009","review":"I'll admit that I'm a huge Broken Lizard fan, I have seen all of their films and even have an appreciation for the relatively unfunny Club Dread. For me, this is just a fun-loving group of comedians that love to make their audience laugh, or at least try their damnedest. I had the pleasure of attending the Canadian premiere of the \"Slammin' Salmon\" in Montreal recently and the Broken Lizard troupe was there to meet and greet the fans and answer questions after the movie. They are true class acts and friendly guys. While I won't give away any specific jokes I will say that from a fan's perspective, this is their second funniest film, with Supertroopers of course being the cult favourite. So yes, it is an improvement on Beerfest; the Slammin' Salmon is just straight up funnier. As for regular movie-goers and comedy fans, I highly recommend this film. It was produced with a low budget during the writers' strike, so without a big studio production, it has the fast pacing of a stage show. The focus in this movie is on the JOKES... which is something refreshing to see in a comedy; less emphasis on character development and a complex plot, but more emphasis on keeping the audience consistently laughing. The humour is low brow at times, but is also clever and well-timed, there are many quick one-liners so pay sharp attention to this fast paced comedy, enjoy!","user":"D-Roo","rank":[55,82]}]