[{"title":"Review: Lincoln Lawyer","rating":8,"date":"18 March 2011","review":"I know what you're thinking and I can agree with you that the name, Matthew McConaughey, does not instill great confidence that you're going to get a great movie experience. Now that is not to say that McConaughey hasn't done some great movies. For every Ghosts of Girlfriend's Past, Sahara, and Failure to Launch there are We Are Marshall and How to Lose a Guy in 10 Days. Lincoln Lawyer is luckily part of the later group and reminds us that McConaughey can carry movie without having to take off his shirt in every scene.<br><br>Lincoln Lawyer is a thrilling drama about a cocky and smooth defense attorney Mick Haller, played by McConaughey, who represents a high-profile client on charges of attempted murder. But as new evidence continues to pile on, Mick starts to grow suspicious that perhaps his client isn't telling him everything. With twists and turns at every corner, Lincoln Lawyer keeps you guessing till the very end.<br><br>With the help of that distinct country voice and southern charm, McConaughey takes the movie to another level with this portrayal of the fast-talking lawyer. With the role of Mick, McConaughey is actually given a chance to show off a range of emotions that will truly surprise viewers. Mcconaughey doesn't carry this alone, Lincoln Lawyer gets some great acting from the likes of William H. Macy, Michael Pena, John Leguizamo, Josh Lucas, and Marisa Tomei. The only black sheep of his movie comes from the alleged murderer Louis Roulet, played by the ever wooden Ryan Phillippe. The only thing I find amazing from Phillippe's attempt at acting is his unique talent to deliver every line of dialogue without moving a single muscle on his face.<br><br>The tension and intensity that begins to engulf Mike as the case continues is stellar. Lincoln Lawyer really pushes Mike to edge as his whole world becomes begins to collapse due to his Attorney-Client relationship. This is where Lincoln Lawyer really comes alive and delivers a must see movie experience. The court room scenes are some of my favorite scenes in the movie and there are plenty. The approach they took to portraying the lawyer aspect of the film feels accurate and realistic. The plot is solid and keeps you invested right from the beginning and keeps the grip tight throughout the movie. The movie keeps a good pacing and the dialogue is smart and witty. The film's color and camera work gives a very raw feel although at times it can be a little too unstable. The story and characterization is done well but there are a few things that should have been given more focus, like Mike and Maggie's relationship and more insight as to why they got divorced. The movie touches on the idea with a scene or two but never really reveals too much. We also never really get too much on Mike's relationship with his daughter. My biggest problem with the film was the underwhelming ending that really had everything necessary to end the movie with, but still felt lackluster when it came. However, don't let these few problems sway you. I strongly recommend this film and promise you that you will leave satisfied.<br><br>-www.MovieFloss.com","user":"staff-577-378882","rank":[173,210]},{"title":"Great Movie!!!","rating":9,"date":"18 March 2011","review":"I found this movie very enjoyable. Matthew McConaughey played a very believable and spot on performance as Mick...I think the casting decisions were great Marisa Tomei, Ryan Phillippe, William H. Macy, Josh Lucas, etc. Did a fabulous job. The plot line was fantastic and left you on the edge of your seat, the script was enjoyable, with both serious dramatic scenes to funny lines that left the whole theatre laughing. Over all a great movie thats targeted toward an older audience 30's-60's. But I'm 13 and my mother took me and I loved it. Although I'm a teenager and most of us just like a bunch of romantic-comedies, I have a wider genre of love in movies. Hope you enjoyed this one as much as I did.","user":"princessbuttercup8","rank":[188,241]},{"title":"Solid courtroom thriller with excellent performance by Matthew McConaughey and a five-twist ending...","rating":8,"date":"25 March 2011","review":"Agatha Christie would be proud of the five-twist ending to THE LINCOLN LAWYER. The film is clearly top-notch and street smart. It's the most efficient, solidly crafted courtroom thriller since PRIMAL FEAR and WITNESS FOR THE PROSECUTION. It has so many twists and turns that it's likely that Agatha Christie would be proud of it.<br><br>It also reignites the career of Matthew McConaughey as an actor, not just a charismatic star. He manages to be smoothly appealing despite playing a corrupt lawyer who has no scruples in defending guilty clients as long as they provide the cash flow he demands. It's only after defending RYAN PHILLIPPE from a charge of murder and rape that he realizes he does have a few scruples left. And the plot twists provided by the screenwriter John Romano from the novel by Michael Connelly, are deftly handled for maximum shock effect. Brad Furman keeps the direction tight, forceful and swift-moving.<br><br>The cast surrounding McConaughey has been selected with care and all of them offer realistic performances. Marisa Tomei is appealing as his ex-wife who knows his shortcomings but is still attracted to him, and William H. Macy delivers a solid performance as his investigator friend. Ryan Phillippe is excellent as the client whose surface appearance belies the fact that he's as street smart as his sleazy lawyer, and FRANCES FISHER is outstanding in a small but pivotal role as the young man's protective mother.<br><br>Not since the days of PRIMAL FEAR and WITNESS FOR THE PROSECUTION has there been a more intelligent script than this one, designed to baffle and blindside the viewer in the course of unraveling some startling surprises.<br><br>By all means, highly recommended for fans of this genre.","user":"Doylenf","rank":[110,140]}]