[{"title":"Solid, realistic political melodrama - not a thriller","rating":8,"date":"8 October 2011","review":"The Ides of March isn't a story just about the back-alley dealings of those seeking to gain power; it's a morality tale of how much one must wrestle between doing things because he feels they are the right thing to do and doing things that will serve themselves better in the long run. It is a political melodrama, but it just as easily have been written about business and high finance. It's highly cynical, with its points driven home by a terrific cast, and yet it manages not to be heavy handed or preachy. Indeed, there aren't really any strictly good or bad guys in this movie.<br><br>Ryan Gosling stars as Steven Myers, a top aide to Governor Mike Morris (George Clooney), who is running for president; currently at stake is the battleground state of Ohio. If Morris can gain Ohio's delegates, he's pretty much assured to get the Democratic nomination, and in the film it's noted that the Republicans have a weak field themselves (at best). All of this means, of course, that as Ohio goes, so goes the presidency, so there's plenty riding on this one primary.<br><br>Morris' campaign manager is Paul Zara, played by Philip Seymour Hoffman, a veteran of many cutthroat campaigns. And although Zara has the experience, Morris often turns to his young(ish) aide Steven to gain a less-jaded, more-truthful perspective. (Of course, by doing so, Morris is simply trying to hear from someone who may not be thinking four years or fewer down the road at his next job.) Like most staffers, Steven believes in Morris; he thinks that if the man is elected president, good things will happen. He is the prototypical idealistic aide; doing the right thing will win out over all, he believes. He's not completely naive to backdoor politics, but his organization, his analysis, his acumen, and his spirit are what endear Morris to him.<br><br>Even though Steven is not a Mr. Perfect, a self-righteous do-gooder, he's savvy; he knows which buttons to push. He learns, though, that his chief obstacle to success is in recognizing whom is trustworthy, and just because one is friends with another doesn't mean that either owes the other much when it comes to the game of politics. For example, simply feeding the press (in the person of Marisa Tomei) the occasional tidbit doesn't mean that the media will be an extended PR arm for Morris.<br><br>Somewhere along the line, Steven reaches a breaking point, a place at which loyalty isn't the most important thing on his plate. This point comes as a result of two pretty bad decisions, one that he knows is a bad idea right away and another that seems a little more innocent – but then Steven has underestimated how petty, parochial, and vindictive those in the business can be. It's all about one's level of paranoia. You have to have some in order to foresee problems, but too much of it will hollow out your soul in a jiffy.<br><br>Clooney, who also directed, looks and sounds presidential, but he's not the focus of the movie; as with his brilliant Good Night, and Good Luck, he's a powerful supporting character. Things don't revolve around Mike Morris as they do around Steven Myers, and that's one reason the movie works – our focus is on the morality battle, and it's presumed that as a sitting governor, that battle's long been over for Morris.<br><br>The hand-picked cast is superb. Not only do we get Clooney, Hoffman, Tomei, and Gosling, we also get Paul Giamatti as the governor's opponent's campaign manager. Each one seems to steal scenes, even ones they share. Even Evan Rachel Wood, as a new intern in Morris' camp, turns in a splendid performance.<br><br>It's clear that The Ides of March won't be for everyone. It is, as I said, cynical – highly so. It won't leave you hopeful about, well, anything. It gives you no one for whom to really cheer and yet no one for whom to really despise. It offers realism in lieu of hope, and its goal of trying to explain the motivations of those who get involved in these campaigns is reached. It's an effective, gripping melodrama.","user":"dfranzen70","rank":[192,225]},{"title":"The games people play to get ahead, not necessarily in politics, but within themselves","rating":8,"date":"7 October 2011","review":"George Clooney is running for President. Well, I mean, in \"The Ides of March,\" as Governor Mike Morris, he's running for the Democratic Presidential nomination. He's the good guy and his opponent is the bad guy. Because that's how it is supposed to be, right? The opponent's campaign manager is played by the ever-shady Paul Giamatti, while Morris' campaign is championed by the young, handsome idealistic Stephen (Ryan Gosling).<br><br>This is about politics, the games people play to get ahead, and the types of people who get played—that's the interesting part. The refreshing part, is that this isn't about election night and who is going to win and who is going to lose. A few poll numbers are rattled off, but it's mostly about what is going to happen to our heroes (or anti-heroes) and what are they going to do in response. When you look like Clooney and Gosling, it's hard not to be the hero, but remember, this is politics and nobody is really a hero in that mess.<br><br>People make mistakes. I enjoyed following Stephen as he struggled internally with his path forward. He believes in the good of the Governor. He's smart and passionate and makes a good campaign manager. His mistakes seem minor and understandable. The problem is, he's 30. He's at the in-between age, where he's half young-college-student-ready-to-take-over-the-world and half experienced-cynic. Those are two very combative halves and when they come at odds within him, the character takes some shocking and drastic turns.<br><br>The few references to actual political gaffes are obvious and just done for comic relief. All the clever lines are stolen by Giamatti, who, I am predicting, will come away with the only acting nomination for the film. Although, the brilliant character work – that's done by everybody, and is what makes \"The Ides of March\" so intriguing.","user":"napierslogs","rank":[111,141]},{"title":"politics with shocks and twists","rating":7,"date":"23 December 2011","review":"Ryan Gosling's at his best in dramatic roles and there's no exception here. As things unravel - that happens quickly thanks to the intense plot - Gosling decides that his ambitions are so important that he'll be willing willing to lose his soul. George Clooney has a very strong appeal, he's very convincing, his acting being almost perfect. \"Ides of March\" has very few flaws, the twists in the plot are not predictable and overall doesn't have any problems connecting with the viewers. Eventually, though there's no character to empathize with, the audience has the impression of a notable film noir, challenging us to come to terms with what politics is nowadays. I've seen intelligent filmmaking and a provocative moral fable.","user":"antoniotierno","rank":[55,68]}]