[{"title":"About as good as a movie called Paul Blart: Mall Cop could be","rating":6,"date":"16 January 2009","review":"If Paul Blart: Mall Cop had been made 20 years ago, it would have starred John Candy. That's a complement, by the way. Candy had a knack for playing bungling, yet good-hearted people who mainly wanted to please. He certainly specialized in playing people who tried too hard to be nice to cover up past pain. There's a lot of this in Kevin James' performance as the title character here. He's more than just a comic goofball. James turns him into a likable and surprisingly sympathetic hero that we find ourselves cheering for by the end.<br><br>Kevin James rose to fame on television starring on the sitcom, The King of Queens, and has been trying to break into movies for a while now. He's acted along side stars like Will Smith and Adam Sandler, but this is his first shot at a stand-alone starring role. Sandler is still there behind the scenes (His Happy Madison production company produced the film.), but this is James' film all the way, and he doesn't waste the opportunity. His Paul Blart is admirable in a way. He's overweight and he suffers from hypoglycemia, but he always tries to do the right thing. He's passionate about his job as a mall cop, but he'd really like to be a police officer on the street. He's taken the physical entrance exam many times, but his health problems have prevented him from finishing. He makes up for his shortcomings by being the best mall cop he can be, and by also being a good single father to his teen daughter (Raini Rodriguez), who respects him and wishes he could fall in love again. Paul has his eyes on a young woman named Amy (Jayma Mays), who also works at the mall. The first half hour or so of the film is devoted to Paul's life, and it certainly helps us get into his corner when the actual plot kicks in.<br><br>It's Black Friday, the busiest shopping day of the year, and some high tech criminals stage a lock down and a hostage situation at the mall as they pull off their theft plan. They place motion sensors and small bombs at the entrances, so no one can get in or out. They think they've removed everyone from the building, but didn't notice Paul was in the back of the arcade playing Guitar Hero. When he emerges from the arcade, he quickly learns about the hostage situation, and discovers that both Amy and his daughter are amongst them. This kicks off the main action, where Paul must use his resources around him to out think and outrun the criminals while keeping everyone alive. I liked this aspect of the story, and how Paul Blart actually has to be clever in order to outsmart the captors. The movie is rated PG, so it's never too violent or scary for kids, which is the perfect target audience for the film. They'll like the film's gentle and goofy humor, and accompanying adults may find themselves charmed by Blart himself.<br><br>I never laughed out loud while watching this movie, but I did smile a lot, and I found myself caring more about the main character than I imagined. Let me tell you, that's more than I expected walking into a movie called Paul Blart: Mall Cop. There's plenty of sweetness during the early moments, establishing Paul's shy relationship with Amy, and the caring one he shares with his daughter. When the time comes for him to be a hero, we can cheer for him, because the movie makes him into a true underdog. He's constantly battling with his own shortcomings and health issues, and it's clever the way he keeps on finding ways to keep himself going, driven by saving the ones he loves. If I'm making the movie sound too serious, it's not. There's plenty of slapstick gags, surprisingly no bodily fluid or toilet humor to be found, and some pretty good physical comedy on display. If there's any major shortcoming to be found, it's that the movie is pretty inconsequential, and will probably be forgotten by me a few months from now.<br><br>Still, considering the kind of junk that usually clogs theaters in early January, Paul Blart certainly is not bad. I imagine the movie will make a good rental, since its somewhat small scale will make it perfect for watching on TV rather than the big screen. If anything, it's one step closer to making James the cross-over star he obviously wants to be. I wouldn't mind seeing the same kind of likability he gives here in a less juvenile script. He's on to something here, he's just gotta find the project where he really knocks one out of the park.","user":"keiichi73","rank":[150,195]},{"title":"Isn't there room in this world anymore for a big,,affable lug?","rating":6,"date":"19 January 2009","review":"This movie is getting a surprising amount of hate and I don't know why. There is very little in the way of violence, even less in the way of sex and even the gross-out jokes are kept way below what is usually the minimum level for comedies lately. The bad guys get around the mall with mountain bikes, skate boards and by utilizing some impressive parkour moves. Clearly this movie was meant for the PG crowd and in that it succeeds. It's a nice clean family comedy that everyone can attend and enjoy. There were lots of families in the theater when I saw this movie and they all seemed to have a pretty good time. They laughed and giggled and there was very little of the bored chatter you hear sometimes at kids/family movies.<br><br>I was thinking a little about the John Candy movie Summer Rental after I saw this. Candy played a few different roles in films before he did Summer Rental but that movie is where you see the classic John Candy affable lug character that kind of served as a template for most of his following roles. His characters were usually some variation of that, he did it well and people loved it. Kevin James has a similar likable quality and I'm hoping that maybe he picks up the Easy Going mantle where John Candy left it.<br><br>To paraphrase Paul Blart himself, \"Don't write this movie off.\" Like I said, there were plenty of scenes that had both kids and adults laughing together. Isn't it worth at least the price of a matinée ticket to laugh for a while with your kids?","user":"Mike_Noga","rank":[109,152]},{"title":"Not A Kevin James fan, this is a positive review","rating":6,"date":"17 January 2009","review":"Never watched King of Queens, never have been a Kevin James fan but always liked him better than his pal Ray Romano. I was coerced into seeing this Mall Cop movie. I give it a 6 out of 10. Now some may say that is a low rating, some may say better than mediocre.....for me who normally does not like this guys type of humor, this is a great rating!!! It was mildly entertaining...for me it gets the extra star to put it at 6 because it's refreshing to see some humor that's not overly sarcastic, deeply degrading to someone else (except the title character), or just downright cruel. This relied on what I call \"Bill Cosby\" sense of humor. Funny but overall clean. A bit cheesy, but I think that's what Kevin and the screenwriters were going for. Normally I don't get why people think he's funny but in this case, I did get it....and you can't help but like the guy. Without giving any detail, the bar scene for me was one of the most Laugh Out Loud moments in the movie. The way KJ zips around on the Segway is pretty hilarious although because of it's consistency throughout the movie it wears off a bit. I agree with previous reviews of how the villains kind of downgraded the movie a bit. If that was smarter, or those parts were rewritten, it could have been a lot funnier. Another surprising aspect is Kevin's agility, and athleticism. In this particular movie he is very physical (or at least stunt doubles allow him to appear that way) Overall my 6 out of 10 rating should be perceived as a great rating for this movie. I previously never liked this actor, I thought the title was dumb as dirt, and although I always keep an open mind I would be lying if I didn't say that my expectations were very, very low for this. Certainly not as bad as I thought it would be, and not as great as I thought it could have been. Kevin and cast made this a little better than average...and it changed my mind about my hesitation with this guy....I hope someone puts him in a good movie with a great script in the future (better than Chuck and Larry, Hitch). I believe it will do well on cable. One last thing that I must mention was great, at 82 mins...it was just long enough to not overdue what should be viewed as a kinda silly concept.","user":"poolhus","rank":[71,109]}]