[{"title":"Great cast, great songs, great costumes, why do people hate this movie?","rating":29,"date":"29 September 2011","review":"i have just watched this movie for the first time today, and I must say that I don't understand why I listened to the other reviews. All I heard was that the acting was horrible and the story was bland and so on. I will say that the opening scene is a bit too empty, but then Christina starts singing and you forget all about it. The cast is amazing: for the guys we have Christina Aguilera, Kristen Bell, Julianne Hough, Chelsea Traille and the rest of the girls, even Dianna Agron; for the ladies we have Eric Dane and of course the sculptured Cam Gigandet; of course we can't forget about the acting powerhouse that is Stanley Tucci playing the gay best friend that every woman wishes she had (especially if he is that good looking); and we can't forget about Peter Gallagher and Alan Cumming. There is a lot more eye candy from all the boys that work at Burlesque. The story is somewhat predictable but I find that the way it is told, between music and extra little drama in the background, makes it perfect. Just hearing Christina Aguilera singing is enough to carry the story along. Cher has a solo about halfway through the movie that brings you back to one of the main issues in the background which makes for a very powerful solo thanks to that story and the power of Cher's voice makes it even more dramatic. The writing is exquisite due to a main reason, it is perfectly real. It is not full of extra fluff and puff just to create some kind of big moment. It has lots of funny in it, but very subtle . Bottom line is, the script is simple, to the point and every line sounds like something you would hear somebody say in real life. Many films have all that dialogue that you know nobody would ever say but it makes for those big moment, but the simplicity in this movie is what makes me like it so much. It is a simple film, with an amazing cast, that I believe has been completely overlooked. I have a theory as to why it has been overlooked...the marketing for it wasn't very good, it only focused on Cher and Christina and it made very little reference to any of the other amazing people in it or even to the story. The trailer makes it sound like it is all about the dancing and sining, but there is an actual story behind it all. The love story is only partially shown on the trailer, there isn't even one image of Eric Dane or Peter Gallagher, there is too much information about the dancing part as well, I personally think they should have left a little mystery on the dancing and singing and added some more of the story into it. <br><br>That's just what I think. Enjoy.","user":"jess211-172-281805","rank":[44,49]},{"title":"\"Show me your Burlesque\".","rating":8,"date":"3 December 2011","review":"First of all; I didn't know what to expect from this feature. I hoped it would be fun to watch at least. Normally I would discard the idea of watching a movie featuring singers in the leads.<br><br>But I was pleasantly surprised to say the least.<br><br>As a whole, the film was beautifully shot, the costumes, set decors were all wonderful. Christina Aguilera was never prettier than in this picture.<br><br>Concerning Aguilera, I was blown away by her acting (not implying it was Oscar worthy), for the simple, fresh and down-to-earth character, she put out there. She was believable as this nice country girl destined for bigger things - if you know Aguilera's life story, you know what I mean. And she pulled it off to a 't'.<br><br>Also a nice refreshing thing this movie did, in my opinion: were the core values it expressed. Although show business, and especially burlesque dancing, have a way of being over-the-top sexy and sometimes promiscuous. A typical story in that setting could have had more sleazy behavior, sleeping around, back-stabbing and such. But no. Even the antagonists had a way of being somewhat nice and apologetic in their own ways.<br><br>The clichéd rivalry has a place in this, but although being a cliché in itself it never becomes cliché as itself. You would expect dangerous backstabbing. It never happens like that.<br><br>At the end there even is a little plot twist, concerning the fate of the club. It's a semi twist. But it works.<br><br>Although I am enthusiastic and glad to have seen this, there is a huge plot hole, I was concerned with. Halfway through the movie Ali saves the show by beginning to sing. It's pretty clear that the mics aren't working, it being a playback show. But still there are mics on stage. So if we forget this one hole, there is an immediate second hole. As if she has a hidden portable mic she is singing, passing the mics to the front of the stage, being completely audible for everyone present. Which isn't plausible.<br><br>That said, I had a truly great time watching this. It certainly the best in it's genre (a musical romantic drama).<br><br>Certainly worth your time, if you like this sort of thing.","user":"Bingedrinker","rank":[12,12]},{"title":"Entertaining","rating":7,"date":"11 April 2011","review":"At times I can be a bit snobby about movies. I am more attracted to slow artsy fartsy movies that try make grand points about society or existence. However, not all movies are to meant to challenge social structures or deliver underlying meanings and here there certainly is none of that.... and I liked it! <br><br>Burlesque is a little cheesy, yup, filled with clichés, uh huh, predictable, you betcha! That is all part of it's charm though. It set out to be a fun romp with some sexy outfits and entertaining song numbers and it delivered. There is no great villain, there is no great backstabbing - which in someways is more realistic. It doesn't try to have an overly deep plot. It knows it's superficial and embraces it. Did anyone ever doubt Christina could sing? Her voice is amazing and her acting ain't bad either. Cher is well, Cher and how can anyone not love her? Stanley Tucci certainly steals the show while Cam Gigandet provides some delicious eye candy. If you want to be visually and audibly entertained for about an hour and a half, shut your brain off, sit back and enjoy Burlesque. Disclaimer: this recommendation does not pertain to men, unless you are a man of the Cher-loving variety. Despite a burlesque club technically being a 'strip club' this movie is certainly geared for the ladies.","user":"angie_l","rank":[43,50]}]