[{"title":"The first science fiction masterpiece in years","rating":10,"date":"13 August 2009","review":"I do not give out ratings of 10 lightly, but here it is - the first film in years that has been deserving of the rating.<br><br>Neill Blomkamp brings to screens a fantastic, gritty, realistic piece of science fiction with District 9. Not since Ridley Scott's \"Blade Runner\", John Carpenter's \"The Thing\", or James Cameron's \"Aliens\" have we seen a science fiction film with a vision of this caliber. After viewing District 9, it will be clear to one and all why Peter Jackson put so much faith in Blomkamp and took him under his wing as protégé.<br><br>Abandoning the usual settings of Hollywood sci-fi and placing us in the harsh slums of South Africa, we are given an original piece of work which takes risks in the way it tells its story. Not only does it go against the expectations of audiences who have been trained to expect mediocrity from their sci-fi, it goes above and beyond the call of duty to provide us with spectacle as well as something to ponder after we've downed our popcorn.<br><br>There is, thankfully, not an overused, overexposed celebrity in sight, and every unknown face in the film gives a solid performance. The aliens themselves, brilliantly realized with top notch CGI even manage to make us feel something, only rivaled by Gollum from \"Lord of the Rings\".<br><br>District 9 has so much to like. It's spectacular, darkly funny, entertaining and thoughtful all at the same time, and it's all done on a meager $30m budget. There is true talent on show here. If only there were more films like this, the world of cinema would be a more interesting place.","user":"NonSequiturL","rank":[1,2]},{"title":"Expect the unexpected","rating":9,"date":"13 August 2009","review":"Everyone's seen the trailer that kick-started one very fishy-looking viral campaign, interviewing several humans and an alien in quick succession. That marks many people's first exposure to Neill Blomkamp's District 9, and the trailer - which had a decently executed \"mockumentary\" feel to it, which only served to make its sci-fi content seem even more surprising. This same element of surprise is still present throughout the film proper, and it is quite a cinematic treat.<br><br>District 9 takes place in an alternate timeline where, twenty years ago, an alien spaceship came to a halt above the city of Johannesburg. The inhabitants of the ship are unable to operate the ship anymore, so they end up being segregrated to their own slum within the city below. Eventually, the government calls for the eviction of the aliens (nicknamed \"prawns\" due to their appearance) from the slum. The film's ostensible protagonist is Wikus (Sharlto Copley), who through a series of events too complicated to recount in a synopsis, ends up undergoing some rather dramatic changes and before long he's thrust into the middle of something far too big for him to handle...<br><br>The best thing about District 9 is that it always manages to stay fresh and surprising throughout. As the trailers indicate, it starts off as a mockumentary in order to expose the gist of the story. The film gradually crosses over to being a more conventional film, although still filmed with a very documentarian look and interspersed with occasional news footage or interviews. Despite the unexpected change in presentation, you don't really notice because you're so wrapped up in the ingenious premise. Then you're presented with the plight of Wikus, whose story is one I don't really want to expose too much because watching it all unfold was just amazing to watch. He's a perfect example of the Everyman, trying to survive as best he can in the face of everything that the world throws at him over the course of the film. His development, along with that Chris, the prawn he befriends (who is surprisingly well-rounded for a CGI character) raises this above your average science-fiction film. Even when the film's final third act becomes incredibly action-packed, it still doesn't jar with the mood of the film and doesn't forsake its characters and intelligence for the sake of cheap action sequences.<br><br>On that subject, the action sequences are far from \"cheap\". Given that Blomkamp and collaborator Peter Jackson were originally aiming to make a film adaptation of Halo before changing to this, there's still plenty of moments that feel quite reminiscent of Bungie's game, from the alien technology to the frantic battles. The effects work looks great in even the simplest of situations, to say nothing of the bombastic finale. There's just something about the way it all comes together, especially when it is combined with one very uncompromising storyline and subject.<br><br>District 9 is a rare find nowadays. It doesn't sacrifice the intelligence or raw power that its story affords it for the sake of appeasing your \"typical\" blockbuster crowd with a lighter rating and less focus on the story. It's a damned fine thriller that is not without its flaws, but is still several cuts above your average summer film and is well worth watching - but only if you can handle the heat. And it does get quite hot.","user":"Robert_90","rank":[701,912]},{"title":"District 9 - Not your typical Sci-Fi Action Thriller","rating":16,"date":"16 August 2009","review":"District 9 is a story about aliens who make contact with Earth and the relationships with humans and society. The creatures were set up in a makeshift home in South Africa's District 9. Control over the aliens has been contracted out to Multi-National United (MNU), a private company uninterested in the aliens' welfare. Their sole interest, alien technology and weapons. Weapon research would mean huge profits for the company. Wikus van der Merwe (Sharlto Copley) is placed in charge of the filed operation to evict, remove, and place the aliens in a new holding facility. Conflict and tension threaten the operation as agents move in. <br><br>Don't be fooled. This isn't your typical alien sci-fi action movie. What got me was the believability. If there were aliens out there that were able to make contact with Earth, it seems it could have gone something like this. The way the perspective switches from mock documentary style to standard third person certainly contributes to it. \"Real\" news footage and interviewers tell the story in retrospect, as the events of the movie have already occurred when they are being interviewed. I think it all added to the realism of the experience. <br><br>Usually in these type of films, it's mostly mindless action and the story is lost. Not the case here. There's so much more to it. It's also about betrayal, loyalty, trust, relationships, and sacrifice. It can actually be pretty deep and thought provoking with many themes floating around. The film's really about the story which is really a fresh, gritty, original concept, which is good to see nowadays. <br><br>While the creatures can be most readily described as monsters, though they are like us. Family and friendship are still important ideals in their world. The film explores a fine line between human emotions and monsters. With all the selfishness, hatred, and greed within us, maybe we are the real monsters or at least that's how it can be perceived. <br><br>Neill Blomkamp does a tremendous job with the direction and realism of the film. Sharlto Copley blew me away. I was shocked to see this was his first acting role. The action sequences were well done as well. District 9 is a very unique sci-fi film, one that shouldn't be missed. Mind you, this isn't a film for everyone. It's violent, and many parts can be cringe worthy. Be warned but be ready for one of the best films of the year thus far.","user":"Billy_Costigan","rank":[430,561]}]