[{"title":"If you were ever bullied as a kid...this movie is for you","rating":8,"date":"5 July 2014","review":"Other reviews for this movie (from \"professional\" reviewers) all point out how shallow this movie is when it comes to showing the feelings Paul is having at the various things that happen to him throughout his life. This may very well be the case. But this movie was not made to be a Doctoral Thesis on the effects of bullying. Rather, it was made to show how, once a young man becomes a coward in his youth, it is almost impossible to overcome later in life. The scene in the alley (when the chick comes to his rescue with the guitar) shows how, as an adult, Paul could only get the barest semblance of rage at his life-long tormentor, even though he had all the reason in the world to go ballistic. After losing his voice, he was unwilling to take a chance at being ridiculed by an audience, so he almost didn't even fill-in the form for Britain's Got Talent. He almost didn't go on stage (several times). <br><br>There must be a lot of kids getting bullied in England for their love of opera. Just this year, there was another case -- Lucy Kay -- who went through the same torture. She finished second, and has been signed by Simon Cowell personally for one of his labels.<br><br>Yes, this movie will not win an Oscar -- or even play in any American theaters -- but you need to see it. If you bullied fellow school mates when you were young, you might want to go find those now-grown-up kids and apologize. If you were bullied, this movie will inspire you.","user":"mjorgensen62-40-114257","rank":[28,29]},{"title":"Heartwarming film for all","rating":10,"date":"6 October 2013","review":"I saw the film One Chance prior to it's official USA opening, at the Aspen Film Festival, where it received enthusiastic applause and cheering from the audience. Although I am a long-time fan of its subject, British operatic tenor Paul Potts, it is not just \"good if you like Paul Potts\" but really, really good for anyone. Tony-award winner James Corden is excellent as Paul Potts, as is the rest of the cast, and the film is a first-class production all round. It is heartwarming and inspirational--and humorous--as it tells the story of a man who was born with an immense talent but bullied all his life for being \"different.\" It is full of gorgeous music and full of romance as it follows the story of Paul and his wife, through difficulties--almost unbelievable, except it's true--that almost forced him to give up his dream, until it all came down to just One Chance to make his dreams come true. I would give it more than \"two thumbs up\" if I had more thumbs!","user":"landersbkwrm","rank":[55,64]},{"title":"Heartwarming Story that Leaves No Showbiz Cliché Unturned","rating":7,"date":"28 October 2013","review":"Structurally speaking, ONE CHANCE follows the trajectory of just about every showbiz rags-to-riches movie you could think of. There's the skeptical father (Colm Meaney) offset by the devoted mother (Julie Walters); the best friend (Mackenzie Crook) who supports Paul (James Corden) despite evidence the contrary; the dramatic reversal scene where Paul is told by Luciano Pavarotti that he will never make the grade; the touching scene where Paul's wife Julie-Ann (Alexandra Roach) vows to support him through thick and thin; and the climactic sequence on the talent show BRITAIN'S GOT TALENT where Paul proves himself in front of the judges including Simon Cowell (the film's Executive Producer). And yet the film has a certain integrity to it: James Corden gives a winning performance as Paul, conveying the uncertainty and gawkiness of the character. Roach makes a convincing lifetime partner - someone who willingly puts up with Paul's basic self-centeredness as she truly believes in him. Meaney turns in a competent turn as a gruff rugby- playing patriarch with a heart of gold. Oh -- and there's the music as well, which is always worth listening to.","user":"l_rawjalaurence","rank":[38,45]}]