[{"title":"Quintessentially British, Irresistibly Warm","rating":10,"date":"10 December 2014","review":"I have to state this before continuing with this review, prior to seeing this I was very reluctant and hesitant as to what I was due to view. After growing up hearing the stories and watching the animated tales of Paddington Bear, I was unsure as to whether a CGI-heavy live- action tale could really establish a story that portrays the bear in all his charm, well my predictions were woefully inaccurate. 'Paddington' is a very well-executed adaptation of the titular bear for a 21st century audience. From the producers of Harry Potter, 'Paddington' delivers a family-friendly and charming atmosphere whilst conveying an endearing and gloriously comedic tale about a bear and his adventures in London. One of the late and great films of the year, Paul King's irresistibly warm story creates a sense of nostalgia whilst boasting a quintessentially British feel and pitch-perfect humour that can be enjoyed by people of all ages.","user":"CalRhys","rank":[170,197]},{"title":"Magical","rating":9,"date":"29 April 2017","review":"One of the things I resent the most in modern children's film and stories and in modern animation is that they can be visually enthralling but have not magic, no soul or no charm. I also dislike the fact that too many fables and old-books stories are brought to the screen with no soul and respect for the original characters and stories. <br><br>To my delight, this is not Paddington's case.<br><br>Paddington is a brilliant exception to the dullness, soulless bunch of animated movies for kids out there. This is so mostly so because the original story is there, Paddington and the the Brown's family's souls and personalities are there, they feel modern and contemporary, but not too far removed from the original. Pablo Grillo's animation is fantastic per se, but there are many amazing animators out there; what sets this film animation apart is the magic infused into it, so we come to see Paddington as Paddington, not as a puppet, not as a CGI character, not as a fictional. Paddington feels real in this movie, as real as any of the actors.<br><br>The ambiance of the film is whimsical, it mixes elements that are very modern but also capturing a bit of the old London where the original story is set. The film has a great tempo, is full of fancy and fun, innocence and naughtiness, havoc and tenderness, action and stillness, happiness and sadness, adventure, laughter and family love. <br><br>The cast in this film is great, per se, but that not always guarantees a good movie in the end. However, all the actors are great and believable in this film. I especially liked Nicole Kidman in her evil sassy ruthless manipulative and sweet villain role. <br><br>The music is also fantastic with plenty of Latin rhythms throughout the film. Paddington is Peruvian, after all.<br><br>Paddington is not only a very sweet, fun an enjoyable film. It also has a great message about accepting those who are different and welcoming those who need of our care because have nowhere to go; two things that we should be reminded of in these troubled times when refugees are sometimes treated as an \"it\" not as Paddington. There should be more Brown families in the world. <br><br>I was expecting another dumb movie for kids. To my delight, Paddington is a a tender fun-filled magical film that made me feel a kid again.","user":"Imdbidia","rank":[18,19]},{"title":"An Instant Classic","rating":8,"date":"28 November 2014","review":"I loved it. It didn't matter to me that myself and my husband were watching it without the cover of escorting children, family movies are probably one of the most satisfying things out there to watch when done as well as this one was.<br><br>Cute is an understatement to describe Paddington Bear: he is simply warm and cuddly and I fell for him wholeheartedly. I may even add PB to my Christmas list of wants, even at my great old age. <br><br>Adult comedies can engender one or two laughs, if you're lucky, but this family fun trip had me and the audience laughing throughout (apart from the odd serious moments where it wouldn't have been right to do so). <br><br>Everything was right: the colours, the cast (except I'm not a fan of Nicole Kidman: her pert nose, pert bum or whispered speech), and again...I was entranced by the great warmth of the entire piece.<br><br>Folks, go see this one, whatever your age, with kids or without. You'll all love it, I'm sure. <br><br>My hubby hadn't wanted to see it, but he thoroughly enjoyed it. Highly recommended. I'm sure it will grace many TV screens at many Christmases for many years to come.","user":"talentgirl","rank":[94,119]}]