[{"title":"Great little dark comedy","rating":22,"date":"22 August 2011","review":"This movie is a pleasant surprise, with a great cast and a \"Twin Peaks\" sense of weirdness underneath the veneer of suburbia. Hope Davis is a bored, bitchy housewife who pours her energy into fund raisers for ridiculous causes and a kinky affair with her neighbor. Her daughter is the school slut, her son is a mixed up Jesus freak misfit with an unexpected gift for target shooting and her husband, Dermot Mulroney, is in a dead end job trying to please a boss he hates. It all turns into a crazy do-over when wifey hits her head during one of her sexual escapades and wakes up with amnesia. Gang bangers, a football star literally caught with his pants down and a dope smoking priest (played to the hilt by Keith Carradine)all figure in to a madcap climax. \"Family Tree\" is a gem, don't miss it.","user":"featherfig","rank":[17,25]},{"title":"Slapdash and unfocused but pleasant nonetheless","rating":4,"date":"4 January 2012","review":"First off, Christina Hendricks fans: don't waste your time. She's in the film for all of three minutes (long enough for the camera to linger longingly on her chest, of course) and otherwise doesn't have much to do with the plot.<br><br>While pleasant enough, this movie comes off as slap-dash and unfocused. It just doesn't know where it wants to go, which story/character it really wants to follow. This is partly the fault of being based on the \"dysfunctional family\" trope, which works best when we still manage to care/sympathize/identify with at least one of the family members. The problem here is that we can't: the mother's a bitch, the father's an impotent robot, the son's a gun-obsessed Jesus freak (the gun obsession serving only to telegraph the ending), and the awful mother-in-law doesn't actually appear until the very end of the film. Only the fake-slut daughter comes off as somewhat sympathetic, but the film refuses to focus on her character, and she remains somewhat of a stick-figure (figuratively and literally).<br><br>The lack of focus comes through from the very beginning: the film starts with a voice-over, of the gun-freak son, but abruptly drops the voice-over, only to revive it again at the very end -- in order to give a film-standard wearily wise \"look at how much we've learned\" speech that doesn't really work. The voice-over might have worked better if the son had been the central character and the film had been meant to examine his growth -- but he isn't and the film doesn't.<br><br>All in all, it appears the director/writer didn't have a clear idea about what movie they were making. The result is a slapdash, unfocused effort.<br><br>Still, for all that, the movie was pleasant enough to sit through, with a few funny bits and good performances from the actors. Not something I'd recommend paying for -- wait for it to hit cable.","user":"natrc2003","rank":[12,17]},{"title":"A very funny dark comedy about a very dysfunctional family that will make yours seem normal. Very much worth watching. I say B","rating":21,"date":"21 November 2011","review":"\"I bet we're the first family ever to be fired by their therapist\" After the mother (Davis) of a severely dysfunctional family has an accident and hits her head she wakes up with memory loss. She learns what she was like and what her family life was like and the entire family gets a chance to change. This is very very funny dark comedy. By very dark I mean it opens with someone accidentally hanging himself spying on the mother in bed. From there it gets darker and more and more strange. For those that like edgy humor seen in \"Death To Smoochy\" or newer movies like \"Peep World\" and \"Super\" then this one is for you. If you are easily offended I would stay away from this one. I however thought it was very funny. The only problem was that it got a little repetitive toward the end. Overall, a very funny movie that is not for everyone. I give it a B.<br><br>*Also try - Peep World","user":"cosmo_tiger","rank":[8,11]}]