[{"title":"Not as bad as it's made out to be","rating":7,"date":"12 June 2011","review":"This one's not half as bad as most of the reviews here make it out to be. The film makers aren't pretending to make a classic or even competing for the Oscars. It's a fun film that you will either like or not like. It doesn't take itself seriously. How can a movie that has Ashton Kutcher playing a trained killer working for \"some\" government agency. Ashton plays it a little campy, almost like a comic book character and that works, Katherine Heigl is her usual self. It's always good to see a beautiful Hollywood actress not looking like skin and bones. Tom Selleck plays Heigl's dad, a slightly predictable character. While the movie might be very predictable, it has its funny moments and while the pace isn't break neck, it does keep you entertained. Well, it entertained me.","user":"XM1973","rank":[32,38]},{"title":"Post Modernist Tedium","rating":2,"date":"2 June 2010","review":"There are two kinds of bad movies: The so-bad-it's-good, and so bad-it-hurts. But then, there is Killers; an amorphous blob that exists in a vacuum where no films has ever been made before. It's not a comedy in the sense it's assembled out of jokes and humorous conflicts -- Killers constructs its own parallel universe reality and giddily makes fun of it. And it's not an action in the sense that good guys and bad guys chase one another -- Killers' has a snake-eating-its-tail moral stance. Killers is Meta in the truest sense of the word, and it's not even aware of it.<br><br>Critically analyzing Killers is like reasoning with an alligator before it eats you alive; it's a waste of precious time better used for self reconcile. The only shinning piece of the film is Heigl's teeth. The script seems to have begun its existence as a Mr. &amp; Mrs. Smith book report, rewritten by a conspiracy theorist, and finally polished by an ESL student. It tells the story of sweet Jen (Heigl) who while vacationing with her parents (Selleck and O'Hara) in France, meets the ripped Spencer (Kutcher), and instantly falls in love. Spencer is a professional assassin, but after a few minutes with Jen he decides to leave all that behind him.<br><br>The film is not in a hurry to tell is story, mostly due to the fact there is none. The couple gets married, move together and three years later (and half way through the film) his old boss calls him again, 'you're ain't going out that easy' he promises, and he's right on the money. All hell breaks lose, and almost everyone who gets introduced during the first half turns out to be a gunman hired to kill Spencer.<br><br>Kutcher is detail-oriented twitterer, and as an actor, his goofiness is unmatched. Up until the end, Kutcher monotone performance came across as lack of talent. But after the surreal note the film ended on, it made perfect sense. Him and Heigl have the best anti-chemistry, and casting them together was an unintentional stroke of genius; He's the Laurel to her Hardy.<br><br>Enjoying the Killers depends entirely on your expectations and gullibility. Despite the film's colossal shortcomings, it still manages to make you laugh with its idiosyncrasies. You'll laughing mostly out of confusion, but it's laughter never the less; Kutcher's latest installment in the Dude Where is My Car tradition.","user":"gdr2","rank":[149,220]},{"title":"Lower Your Expectations -- It's Not That Bad!","rating":6,"date":"23 June 2010","review":"The story of \"Killers\" is familiar, with a twist. Jen (Katherine Heigl) is vacationing in the very scenic town of Nice with her straight-laced dad (Tom Selleck) and alcoholic mom (Catherine O'Hara). There she meets the suave Spencer (Ashton Kutcher). They fall in love and eventually get married. Little did Jen know though, that three years later, the ghosts of Spencer's old job will come and wreak havoc on their seemingly perfect suburban life.<br><br>This is the first movie of Katherine Heigl that I have seen. I know she is in TV's \"Gray's Anatomy\", but I do not watch that as well. I liked her very much as the geeky beauty Jen in \"Killers\". She is sexy, funny and bubbly. Ashton Kutcher could never really escape the dumb persona he has built in \"That 80s Show\" or in \"Punk'd.\" He does try his best here to play an action hero, and I think he passes muster. I think the two of them do have some sort of goof-ball chemistry because of their likable personalities.<br><br>The execution of the script is OK. I sort of liked the outlandish plot points and the over-the top comedic violence. I am surprised to see a lot of harsh reviews here. Hey, I am sure you do not watch a film like \"Killers\" expecting a serious screenplay and award-winning acting. This film is lightweight, silly and adrenaline-driven for the most part, and I think it delivered well on its shallow objectives.","user":"3xHCCH","rank":[82,120]}]