[{"title":"Big disappointment","rating":3,"date":"7 March 2011","review":"I was so looking forward to this movie and was so sad that I was disappointed it wasn't quite up to expectations. I did not read the book but I saw the trailer for this a few months back and Beauty and the Beast had always been my favourite Disney movie. A modern retelling, good-looking leads, gorgeous cinematography and Neil Patrick Harris? Perfect ingredient for a good old romance movie, I'd say.<br><br>But I was wrong. The movie even started on the wrong foot, with Alex Pettyfer's dismal acting. Maybe he's been doing so many action movies that putting on the skin of a romantic lead was a little hard. His portrayal of the vain, selfish and mean lead was unconvincing at best. Now, the best part of Beast's transformation was the coming-of-age of the spoiled 'prince' into a rage-filled beast and finally into a selfless man transformed by love. None of that were evident in Kyle Kingson. He was a brat, then a whiny stalker, and finally an emo dude.<br><br>Vanessa Hudgens also gave a cringe-worthy performance. She was so flat and void of personality that it was painful to watch. Beside the bad acting, the plot was also a little draggy, lacking in climax and real emotion. You don't feel drawn to the characters, you don't feel convinced by the emotions and you will cringe at the incredibly cheesy lines. In fact, my sister and I kept mumbling 'Don't say it! Don't say it!\" throughout the movie because a clichéd one-liner is always around the corner.<br><br>The one saving grace was Neil Patrick Harris, but that's only because he brought his 'Barney Stinson' persona into the movie. Though I absolutely adore Barney, it would be nice to see NPH bring something different to the plate. <br><br>All in all, I'd say watch this movie if you're looking for style, but don't go looking for substance. There's not much to be had.","user":"zarajasmin1586","rank":[90,114]},{"title":"Mediocre, at best.","rating":4,"date":"5 March 2011","review":"I wasn't planning on seeing this movie, but after a group of girlfriends convinced me it would be a good chick flick, I caved.<br><br>Going into this movie, I haven't read the book, just seen the Disney movie quite a few times. I was expecting this tragic love story, just like the original movie, with plenty of tear-jerking moments, but it just wasn't there, in terms of script and acting.<br><br>The plot was rushed, and therefore the audience didn't have enough time to appreciate the story line, even though we all know it like the back of our hands.<br><br>Our Beast, Kyle, was more of a brat than a beast, and even after transforming, I was expecting this monster of rage, and he just whined and moaned and was more comedic than anything else.<br><br>Lindy, who was our Beauty, really only stood as a placeholder for a gorgeous woman. Vanessa Hudgens is a gorgeous girl, but that's really all she is. Her acting is very flat, with one moment standing out in particular. She's just been told some devastating news over the phone in a conversation that lasts all of 10 seconds. Acting 101: Acting is the reality of doing, she just pretended, and there's no two ways about it. I didn't see a role model to young girls in her, I just saw a pretty face.<br><br>However, there were some exceptions, Neil Patrick Harris was impeccable with his comedic timing, and really saved this movie from otherwise getting a 1 star. Mary Kate Olsen also pleasantly surprised me, as she was good at convincing me she was this evil enchantress. However, for her entire time in the movie, she looks like a haute couture model rather than this disgusting ugly creature.<br><br>Overall, it's not terrible, just not that good. Neil Patrick Harris is reason enough alone to see this movie, and to get a look into what some consider \"21st Century Beauty and the Beast.\"","user":"OtakuMegan","rank":[81,104]},{"title":"It takes a teenager to admire this movie, perhaps","rating":1,"date":"4 April 2011","review":"Didn't knew it's based on a novel before I saw the movie, and didn't know it's such a teen movie - pretty faces, college scenes - it makes me relate to Twilight, the storyline starts with how perfect the leading boy looks and leading girl seems to be mediocre only.<br><br>I didn't expect anything before the movie, I just saw the poster and found it interesting, thought it'd be some kind of a romance to have a girl falling in love with such a scar-faced man. <br><br>But the story didn't convince me how the beast and the beauty fall in love. To me, it just seems to be \"written\" in such way, Kyle and Lindy are just performing their roles as written in the screenplay, with not much emotions involved in acting. I don't see Kyle getting much upset turning from such flawless face (as he thought) to a seriously scar-faced; and Lindy not being surprised when she saw Kyle's face - as Hunter, a total stranger - this just doesn't quite make sense. I think the acting plays an important role in terms of touching audience's emotions and connection to the movie, but the casts in Beastly fail in such area. The leading casts maybe good with simple teen love story, but the storyline in Beastly seems to be a heavy topic for them to handle, so now it just appears to be a shallow love movie with no sentiments triggered.","user":"anngeewoo","rank":[64,92]}]