[{"title":"an honest and affirmative coming of age film","rating":7,"date":"28 July 2010","review":"a poignant and fresh take on this iconic, typically American experience. This low budget independent coming of age comedy from writer/director David Robert Mitchell explores the usual themes of teen angst, friendship, sex, and the search for love. Set in Detroit on the last weekend of the summer holidays before the kids return to school, the film draws upon Mitchell's own memories of his adolescence. There are a number of sleepovers, slumber parties and pool parties happening. The film follows four teens – Rob, Scott, Maggie and Claudia - as they hang out, talk about their fears and insecurities, crushes, and look for that elusive first kiss. However, unlike most comedies aimed at an adolescent audience this low-key film eschews the usual cheap scatological and puerile humour, opting for a more in depth exploration of their concerns. Mitchell demonstrates a strong understanding of adolescent emotions and desires that brings credibility to the material, and it reeks with a strong sense of nostalgia. Mitchell maintains a deceptively meandering pace as he juggles the multiple narrative strands and moves seamlessly between the various characters. The dialogue rings true, and Mitchell teases natural performances from his unknown ensemble cast. The Myth Of The American Sleepover is an honest and affirmative coming of age film that resonates.","user":"gregking4","rank":[36,47]},{"title":"Pleasantly surprised","rating":7,"date":"28 February 2012","review":"Various teenagers go to various parties, each longing to make the last night before school starts up again memorable in the slice of life drama. Those who are expecting American Pie type shenanigans to follow are best to look elsewhere as this film has more realistic, and dare I say, more noble goals in mind.<br><br>Almost every Tuesday Instant Netflix has at least one film streaming on same day as released on DVD, this week it's three films (this one, Wolf Town, and Beneath the Darkness) and while I can't vouch for the other 2 as I still have yet to watch them, I can give my enthusiastic thumbs up for this one. I found the film to ring true of the teenage experience of the average American teenager. The pathos, the awkwardness, the long &amp; uncertainties are all on display. And frequently well-acted to boot. Writer/director David Mitchell is one to be on the lookout for if he continues to put out films of this caliber.<br><br>My Grade: B+","user":"movieman_kev","rank":[21,28]},{"title":"Surprising and honest","rating":16,"date":"16 April 2015","review":"Yeah, I sought this out because of It Follows, and trying to seek out what else the director had done. This is definitely not your ideal coming-of-age story. it seems like these days there are set rules on what those types of films are, and as good as they can be (The Perks of Being a Wallflower) they are also pretty predictable and follow a specific formula. This really strayed from that. Not all of the story lines work perfectly, but it very much feels like a film trying to show actual people interacting and trying to make the whole thing as honest as it could be. The characters are well-painted for the most part, and the film doesn't have the restraints of having to hit certain spots of points that a Hollywood film would try to do. Much of the human touch here would be further explored in It Follows, and so in that sense it's not entirely different. Very surprising, very good film","user":"Red_Identity","rank":[8,9]}]