[{"title":"Is romantic love the ultimate form of masochism?","rating":9,"date":"1 February 2011","review":"Director Derek Cianfrance may wish to stop wasting his talent on TV and make films his full time occupation. Cinema could use him. His 'Blue Valentine' studies the breakdown of a marriage through beautiful and heartbreaking juxtaposed scenes of past joy and optimism with present scenes of misery and depression. Flitting back and forth in the marriage, it asks: Is romantic love the ultimate form of masochism?<br><br>Fine young actors Ryan Gosling and Michelle Williams play Dean and Cindy, who unite through a dogged courtship. Dean is easy-going, happy-go-lucky and content in his removal and packing company. He is chary of formal education, but has a philosopher's outlook. Cindy is sexually over-active and, although occasionally frolicsome, is more mature than Dean. About five years on, romance becomes repulsion, and their marriage becomes one of inconvenience. <br><br>Make no mistake, this is uncomfortable viewing – not the sex, which serves the story quite well – but the paranoia, pettiness and pugnacity in the couple's interaction. They reach their nadir when he practically begs for affection, and she pleads with him to be more ambitious.<br><br>No two actors have complemented each other this well for some time. In an age where vapid acting is vogue, Gosling is a novelty. He is very charming, yet he has a mournful countenance, and possesses a James Dean-like vulnerability. He'd be my poster-on-the-wall if I were 13. <br><br>I can't get that entrancing scene where Dean serenades Cindy out of my head. Dean's philosophical outpourings may be interpreted by some as drivel, but more sensitive viewers will detect the shattering honesty. A memorable maxim: 'Girls spend their whole life looking for Prince Charming and then marry the guy who's got a good job and is gunna stick around.'<br><br>We go to the movies – many of us – to escape real life. Comfortable as voyeurs, we let our favourite stars distract us and we forget our worries. But 'Blue Valentine' shows a truth no cinema can shield us from. It mustn't be missed.<br><br>www.scottishreview.net","user":"dharmendrasingh","rank":[259,287]},{"title":"Heartbreaking and Powerful","rating":10,"date":"29 October 2010","review":"I am going to soap box it here for a second. The MPAA (those fine folk who decide what rating a film will receive) ticks me off to no end. Their system feels arbitrary, outdated, and stupid. You can only use the \"F\" word once in the non literal sense and maintain a PG-13 rating. Because that's the problem, kids hearing the \"f\" word too many times. For want of any other description, it is terribly stupid.<br><br>Why do I bring this up? Well, because the film I watched tonight, a powerful and incredibly touching film has been assigned an NC-17 rating for a sex scene that is not erotic, not violent, not disturbing. It is graphic, but more that that it is sad. Really sad. I'll talk more about this later, but the idea that we have a system that gives \"The Human Centipede,\" \"Hostel 1&amp;2″ and all of the \"Saw\" movies an R rating without a second thought gives this film an NC-17 stuns me. I honestly cannot make sense of it. This is a beautiful, touching, and wonderfully authentic film that deserves a shot at release. There is no logical way a reasonable human being could say that this is less appropriate for a teenager than any of those listed above. For some reason we think graphic torture is fine, but sex and nudity will be the downfall of us all.<br><br>My favorite poem is T.S. Eliot's \"The Love Song of J. Alfred Prufrock.\" I've always identified with it and I think it is one of the finest pieces of writing ever produced. Specifically I am enamored with the line, \"Shall I, after tea and cake and ices have the strength to force the situation to its crisis.\" This describes a situation most of us have been in. You're in a relationship that is failing, you know it's failing, the other person knows, your friends know, but it just hasn't reached that crisis point that forces it to end. That is what this film is about.<br><br>Most films center on the beginnings of a relationship (the honeymoon), the middle (where things have reached a comfort point), or the divorce proceedings, but you rarely get the moment when the relationship dies. It's hard to present well and it's difficult to watch. This is what happens when the things that were once funny and cute aren't funny or cute anymore. We've all been there and it is painful.<br><br>If you think of a relationship as having a life then Blue Valentine is that life at the moment of death where the life that is dying flashes in front of your eyes. There is a combination of present time and flashback showing how these two people came together and how the inevitably fell apart.<br><br>Gossling and Williams are both superb in this film. He plays all the clumsy sweetness and frustration of Dean perfectly, and she plays the damage and need to be loved with a quiet power that is absent from most performances today.<br><br>These are two people with a very idealized and romanticized view of love. They view it as something that is there or it isn't. From their backgrounds it is obvious why. Neither of them has any exposure to a couple working at it, tending to the relationship. Things are good, then they aren't. Williams character says early on, \"How can you trust your feelings when they can just disappear like that?\" That is a question that has plagued people as long as there have been relationships. At some point your feelings will change and if you are unequipped to change and grow with them, then any relationship is destined to fail. <br><br>The two stories (falling in love and falling apart) are told in intersecting circles. You see the beginning of the end, then you see how they meet, you see the relationship deteriorate further, then you see their amazing first date. This style allows you to see how they fell in love with each other, but also showed the lack of foundation the ultimately doomed them. Through most of the film it is obvious that the only reason they stayed together as long as they did is because of their daughter, and their absolute love for her.<br><br>Gosling as the devoted, hard working father is touching, Williams as the overworked mother who seems to be raising her husband along with her daughter is touching. The dynamic of goofy, doting father, and concerned, loving mother is brilliantly played, and creates some genuinely sweet and heartbreaking moments.<br><br>This is not an easy movie to watch. It's quite brutal, emotionally, at times. The scene that earned the NC-17 is quite graphic. The two go away to a romantic hotel for a night to try and rediscover something, and end up in a graphic sex scene that is just hard to watch. It's not as graphic as say \"Monsters Ball,\" but there is a resistance by Williams, followed by a resignation, she doesn't want to, but she'll do it. It isn't violent, it isn't a glamorized rape scene, it's hard to watch because it's just so sad. There is no way to deny that this is the death of the relationship embodied in a single moment. He is still infatuated with her, but she has moved on and there isn't any of the old spark left.<br><br>While I did enjoy this film it is most definitely not something I would watch often. It is good enough to deserve another view or two, but it is just to heartbreaking. This script went through 66 drafts over 12 years and it shows in the attention to detail, the brilliant pacing, and the way it allows a look and silence to speak volumes. This is a well acted, solidly written and directed film that is well worth at least one viewing, just be aware that it won't be an entirely pleasant experience.","user":"DirkesDiggler","rank":[533,610]},{"title":"A heart-wrenching and cautionary tale of love","rating":8,"date":"17 January 2011","review":"I came away from this film more wary of love and relationships than any film I've ever seen. You look at Dean's character (Gosling's best role to-date) and wonder what it is that he did wrong. He fell for a beautiful, young woman (Williams), stepped-up to care for her and her yet-unborn daughter, and shifted his life to focus entirely on being a good husband and father. He was so charming in his interactions with his daughter, and was also loving towards his wife enduring more rejection from her than most could, trying to breathe love back into the relationship. Even his outbursts seemed attempts to give her what she wanted.<br><br>So many reviews talk about this being a story of falling in and out of love. My response is surely subjective, but I don't feel Cindy ever loved Dean. She was desperate, pregnant and facing life as a young parent, and Dean was there to hold her. As a mother and wife, I found her to be unlikeable and selfish, cold and unloving. Cindy was probably not intentionally manipulative, but from her initial reluctance to tell Dean about her pregnancy, to her secrecy around her job offer or the encounter in the grocery store, these are all subtle manipulations and lies, hiding the truth (and her true self) from Dean.<br><br>I heard the director say he was sympathetic to both characters. Any sympathy I had for Cindy as a young woman caught in a relationship and family she did not hope for was overshadowed by the fact that she made the choices that led her there, and dragged others in with her. I did not sense any growth in her character to indicate she'd move on to create a brighter future for herself and Frankie.<br><br>Dean, on the other hand, was a good person, eager to love, and all-too-willing to devote his life to Cindy and daughter Frankie (a sparse, but strong, performance by Faith Wladyka), and in the end, he's left with a broken heart and a broken home. I'd love to feel he's better-off without Cindy, if only it weren't so heartbreakingly clear that he loves her and her daughter immensely. <br><br>To me, the film served as a warning in love to be careful where you put your energy.","user":"deproduction","rank":[291,341]}]