[{"title":"A Sleeper Worth Waking Up For by Andrew Malekoff","rating":8,"date":"11 January 2009","review":"To say that this film is spare is to be generous; and, to whatever extent actors become their characters, Michelle Williams becomes Wendy, a young woman that is hanging by a thread. Wendy is doing her best, with little support and money, to survive day to day and to maintain her dignity. Along the way she loses her dog Lucy, the only stable and loving relationship in her life. Ultimately, she is faced with making a heartbreaking decision that their mutual welfare will depend upon. As her car (and bed) breaks down and resources dwindle, she collects cans and bottles and shoplifts dog food. She encounters a group of homeless people making a fire, a self-righteous store clerk, a smug auto mechanic, a sympathetic security guard, and a psychotic drifter, among others. We see each of them from the perspective of a young woman on the verge of economic collapse and who is gradually being transformed into someone facing the possibility of homeless destitution. Wendy offers a lens through which we can see such a transformation evolve. All homeless people, unless born into this condition, were something and somewhere else first. Wendy is such a person. As the economy declines and more and more people retreat into survival mode, it will be harder for them, for us, to empathize with the Wendys of the world, young people with once bright futures now facing desperate and maybe devastating times. I have heard it said that empathy is the first hostage of survival. Wendy and Lucy is an important little film, a slice of life, that not enough people will see and that offers us a window on what more and more young people will be facing for some time to come. This film pleads with us not to close our eyes or turn our backs on them.","user":"anjru","rank":[90,101]},{"title":"Sometimes the simplest stories are the most effecting and the simplest characters are the most endearing","rating":9,"date":"18 May 2009","review":"Sometimes the simplest stories are the most effecting and the simplest characters are the most endearing. Wendy and Lucy is a perfect example of this. When discussing this film however one must praise Michelle Williams. Before she even utters a word with her body movement and her facial features we get a sense of who Wendy is. We have seen this character before and we know her. Wendy is a simple girl with a simple purpose but Michelle Williams gives her the grace and kindness that makes her seem real and is all the more gut wrenching when things start crashing down around her. Most actresses her age with her resume would scoff at the idea of playing such a simple and expressionless character who hasn't showered for days and wears cut off brown pants and an unflattering blue sweatshirt but she breathes life into Wendy and adds an extra dimension to her. Of course a great performance would be wasted without a narrative for Wendy.<br><br>As the film unfolds the narrative is quite simplistic. Wendy is stuck in a small town in Oregon on her way to Alaska and wants to get on her way as fast as possible before her money runs out. There however are events that will unfold that prevent this from happening. There is little surprise and in fact the narrative is quite predictable with most events foreshadowed. As these events unfold however they are still impactful and meaningful because Wendy does not see them coming. As simplistic as this narrative may be there is complexity to it in the form of political commentary on small town America and how the people that live there are struggling. Wendy herself is fleeing Indiana living in her car and managing a small sum of money to go to the promise land of Alaska since they are hiring. The town is suffering from the closing of a mill with few jobs and is inhabited by many disenfranchised individuals. While this film could be fixated on these points Kelly Reichardt has crafted them very subtlety into the character and the setting. Characters don't stand around saying small own America is dying, but we can easily pick this up from the plot and the visuals of a broken down town with many closed business and downtrodden individuals. Usually films of this type heap on background but instead there are only a few scenes to decipher Wendy's story and motivation.<br><br>The soundtrack for this film is Wendy humming quietly to herself which when employed help foster a sense of intimacy. Kelly Reichardt shoots the film with a naturalistic feel with a steady and fluid motion of the camera. There are many long takes with tracking shots as the camera follows Wendy as she walks around this town but this is contrasted with close ups where the camera gets in tight to see the expressions on Wendy's face. There is only natural light used and most of the scenes take place out doors with wind blowing through Wendy's hair and building being nothing more than a backdrop. All of these aspects together create a sense of intimacy with Wendy. Wendy and Lucy shows us that a great film really only needs a honest and meaningful connection to a character through narrative, acting and mise-en-scène.","user":"StarsDown","rank":[38,41]},{"title":"Wendy and Lucy (2008)","rating":9,"date":"23 January 2009","review":"WOW, that is easily the most depressing film I saw this year, hands down. Michelle Williams and Lucy the Dog star as Wendy and Lucy, respectively, in this remarkably affecting drama about a poor, independent woman escaping from her undisclosed troubles and making her way to Alaska with her dog. All the two have in life is each other, money is tight, food is hard to come by, and sleeping in the car is the only option for Wendy. A devastating turn of events happens to Wendy, and Lucy subsequently goes missing, leading Wendy on a mission to recover the only companion she has in her life. Along the way, Wendy encounters indifferent individuals whose actions are driven by self-righteous attitudes, but Wendy also finds help in an unlikely place, a compassionate security guard. In many ways, Wendy and Lucy succeeds in areas where Bolt (2008) came up short, but they both approach their themes in very different ways. Wendy and Lucy is absolutely heartbreaking, forcing me to cry out \"NO!\" twice in its duration. The ending was an absolute shocker to me, and actually squeezed a few tears out of my eyes.<br><br>In this film, Lucy becomes a character in her own right, a brilliantly effective choice. Lucy becomes not just a symbol of everything Wendy loves in this world, but her only hope for survival. It is never specified, but the audience member is allowed to create an entire backstory behind these main characters. I like to believe that Lucy is a childhood pet of Wendy's, who helped Wendy through a difficult childhood, perhaps with abusive parents, in a foster home, whatever you would like to believe. It makes Wendy's situation that much more affecting. If you've ever felt like you have but one object in this world to turn to in times of trouble, and you've felt like escaping from chains that are holding you down, and beginning a new life for yourself someplace new. If you've ever felt so cut off from other individuals in this world, like screaming at the top of your lungs. If you've ever been placed in such a desperate situation, where your livelihood is threatened, and all that you love seems as though it is vanishing before you, you will undoubtedly shed a tear at this incredibly powerful drama about the connections humans make, the friendships we forge, and the sacrifices we must sometimes make.<br><br>9/10","user":"bkimbrell0","rank":[57,68]}]