[{"title":"Expectations seem too high","rating":8,"date":"29 August 2012","review":"I have never written a review here, but I felt compelled to actually step up and defend this movie.<br><br>The Bourne Legacy was everything I expected it to be. It couldn't be too close to the previous Bourne films, but had to be close enough to let us know a storm is coming.<br><br>Bourne's presence throughout the film is what spins this story into action and I felt it was balanced perfectly. We all want Bourne, but this is Aaron Cross's story. Renner and Weisz were great, but I think the scripting has been derided by many as terrible. I had no issues with anything and even felt compelled by Renner's character motivation. This was someone yearning to be more, not someone who was already better than everyone else, but just couldn't remember.<br><br>Let's cross our fingers and hope we all get what we want and pair Bourne and Cross in the next film.<br><br>There is so much more going on than just Jason Bourne and if we don't get to explore that then the franchise will be poorer for it!","user":"rbrt_gilchrist","rank":[174,208]},{"title":"Much better than it had any right to be thanks in part to its two lead actors (Jeremy Renner and Rachel Weisz), who work acting miracles with a poor script.","rating":6,"date":"6 August 2012","review":"Questionable follow up to the Bourne trilogy that has the right pieces in place but lacks the conviction to justify its existence. Taking place almost at the same time of the climax of the third Bourne film (Ultimatum), this film deals with the fall out of the exposure of \"Operation Blackbriar\" and how an another agency with in the government is trying to cover up their program in order not to be caught up with the coming scandal create by Jason Bourne. \"Outcome\", the program in question is an offshoot of both \"Treadstone\" and \"Blackbriar\" but with a huge difference, they are tabbing into science to create super agents that are faster and stronger than any other agent before them. <br><br>In order for me to tell you what is good about this movie, I have to explain what is wrong with it and that is the fact that you get the feeling fifteen minutes into the film that there is no reason for it to exist. The last film (Bourne Ultimatum) pretty much closed the book on the series, with little to no wiggle room for an encore. This movie feels like a studio trying to milk dried what was good from the original trilogy in order to make more sequels. The bad part is that they did it in the most unbelievable way, so much so that you really need to forget what you saw in the last three films in order to believe what was going on in this movie. Tony Gilroy (Who wrote the first three movies) directs and writes this one but falls flat on his face with halfhearted explanations that try to justify this movie's existence. Not to mention the fact that the villain of the movie is a lightweight compared to what came before him plus the glaring fact that Edward Norton's performance as the heavy is pretty much phoned in. He does not have the confidant arrogant swagger that Chris Cooper's character had in the first film nor the desperate menace of that Brain Cox's character brought to the second. Norton's character is more in line with the villain of the third, who was played by David Strathaim (who has a cameo in this film). However, Strathaim's character had a sense of justifiable menace that drove him, while Norton's character just seems like a man trying to justify his actions for the greater good, making him more of a government shill than a villain. The science fiction angle that comes up is insulting to what the last three films were, not to mention the fact that the direction here lacks the kinetic energy that Paul Greengrass brought to the last two movies of the series. Say what you may about the shaky camera work but he knew how to stage a thrilling action piece of pop art. Gilroy's motorcycle chase towards the climax is decent but lacks kinetic spark. He is however very good in staging small intimate moments within this movie but that is more a compliment to the A + cast (Mainly his two lead actors) than the terrible script that they are forced to working with.<br><br>Jeremy Renner is a talented actor with serious range and complexity. However, the character he plays is not much of a character and the script that he has to work with is riddled with cliché after cliché. He can do anything a secret agent can do but better but the character is not very compelling or interesting to say the least. Jason Bourne was a compelling character that needed to find himself and through that journey in the original trilogy, we saw complexities that were compelling and thoughtful. He was a conflicted man whose drive was dictated by an inner sense of redemption. The character of Aaron Cross is a cartoon character compared to Jason and that is the main problem of the script for this movie. It is though Renner's efforts as an actor that we care about the character of Aaron Cross and that is one of the few bright spots this film has. Renner injects likability and vulnerability to this character and because of it, we want him to succeed in beating the bad guy and save the girl but Renner is working with a script that goes against itself and we are left with a half fast story that deals with supermen than a human story about survival. It is through Renner's efforts as an actor that we see humanity and conflict in this character while the script itself does not give that sort of detail and Renner is working overtime to accomplish that. Renner would have done wonders with a compelling character like Jason Bourne, unfortunately that is not found with the character of Aaron Cross.<br><br>Rachel Weisz is one of the most versatile, gifted and complex actors working today. An actor's actor in every sense of word but like Renner, she does not have much of a character thanks to the cliché script they both have to work with. Her character is on the run with Cross through out the film and acts as his doctor and object of protection. It is through Weisz's amazing strength and range as an actor that we are able to witness levels of complexity and humanity in the character of Dr Marta Shearing that we really do not get from the script. Because of that, we are not only able to care and identify with her but Weisz actually makes her character more complex and interesting than Aaron Cross himself. You can tell that Weisz was working overtime in achieving that and her efforts pay off ten fold, which is a blessing considering that most of the characters outside of her and Renner come across as cardboard cutouts.<br><br>It is a shame because Renner and Weisz try their best and for the most part succeed despite all odds but they like the fans deserved better.","user":"midnighttheater","rank":[363,471]},{"title":"'Jason Bourne was just the tip of the iceberg.'","rating":10,"date":"12 December 2012","review":"It is understandable that there is a difference of opinion about THE BOURNE LEGACY, but comparing it to the original three Jason Bourne movies is unfair. This is a 'legacy' left by the environment in which Jas Bourne was hatched an as such, for this reviewer, it works very well. The film is beautifully shot in superb cinematography, has a series of tight incidents that demand explanation but which get little due to the fact that this is a spy film about the various intelligence agency and occult secret scientific projects that are always in progress in every country. It is an expansion of the universe from Robert Ludlum's novels, centered on a new hero whose stakes have been triggered by the events of the previous three films.<br><br>As someone distilled the plot, 'this film deals with the fall out of the exposure of \"Operation Blackbriar\" and how an another agency with in the government is trying to cover up their program in order not to be caught up with the coming scandal create by Jason Bourne. \"Outcome\", the program in question is an offshoot of both \"Treadstone\" and \"Blackbriar\" but with a huge difference, they are tabbing into science to create super agents that are faster and stronger than any other agent before them.' <br><br>Suffice it to say that the new cast handles this very obtuse plot with a high degree of fine acting. Jeremy Renner is excellent, always reminding us of his humanity while he flies around in incredibly impossible flight situations. The extraordinary Rachel Weisz brings a complex role into the realm of credibility. The solid support cast includes the always excellent Edward Norton, Scott Glenn, Stacy Keach, Albert Finney, Oscar Isaac, David Strathairn, and Joan Allen just to keep the balance form the previous Bourne films in place.<br><br>The speed of the action, the poundingly purposeful musical score and the non-stop fascinating twists and turns make this a top-notch film. It does carry on the 'legacy' of Ludlum's ideas, but manages to hold its own without too much replay of the originals. <br><br>Grady Harp","user":"gradyharp","rank":[73,91]}]