[{"title":"14 years for this??? MY THEATER WAS LAUGHING THE ENTIRE TIME!","rating":1,"date":"27 September 2017","review":"What were they doing in those 14 years between 2 and 3, staring at their shoelaces? I love the first two films because they are both scary and well made, but WOW, this film is GARBAGE. TRUST ME, this is coming from a HUGE JC fan! The film takes place between the 1st and 2nd movie, which is dumb because nobody wanted to see what happened between the 1st and 2nd movie. I wanted to see what happened after the 2nd movie, but even then, it's really confusing because the plot keeps jumping back and forth between all of these dumb characters. I couldn't tell if the film was set in the present day, in 2001, or in the 70's because of the craptastic pacing. There's even a scene where you can see a 2016 Chevy truck in a film that supposedly takes place in 2001. Speaking of pacing, there is none! Nothing happens in this movie and the film ends right when it should've started! There are so many characters that the film gets lost in itself. The first film had Darry and Trish, simple and easy. The 2nd film had the athletes and a side-plot revolving around an angry father, but it was still easy to follow and well balanced. Here, we have an old lady getting visions from her dead son, then we have Sargeant Tubbs from the first movie, then we have the anti-Creeper gang, then we have some teenagers, then we have a country boy who has a crush on a girl, and said girl also gets her own storyline. All the characters are pointless and are not flushed out because the film is trying so hard to give equal focus to everyone. The CGI is SO BAD and is EVERYWHERE in the film. It's so bad that my theater was laughing louder than the actual movie! The Creeper doesn't do ANYTHING, no smelling fear, eating body parts, he just sorta walks around and grunts. There's one good scene where a group of teenage bikers finds The Creepers truck in the woods, and it's the only good scene in the entire film. That's it! Worst of all, WE STILL DON'T KNOW THE CREEPERS'S ORIGINS!!! I've been waiting nearly 2 decades and we STILL DON'T KNOW WHERE HE COMES FROM??? The film ends on a cliffhanger but I do not want a 4th movie. This feels like it should've been made for the SyFy channel and seeing this on the big screen is like seeing Lake Placid 6 on the big screen. Just don't do it!","user":"darthMisaskernew","rank":[211,257]},{"title":"Broke Too Many Rules","rating":5,"date":"13 December 2017","review":"I love the Jeepers Creepers franchise. But Victor Salva made too many mistakes in this one that you don't do in horror movies. Victor are you reading this? <br><br>1) Brilliant to show the Creeper in broad daylight, but you show not more than 5 seconds at a shot. Otherwise it just looks like a fat guy in a mask. If you are going to have longer shots, you need to make the Creeper itself move in a non-human way. <br><br>2) You make the Creeper WAY too powerful. Based on the earlier movies, the Creeper's success is based on how smart it is (been around a thousand years), that it can hide in plain sight (like a scarecrow on a pole), super strong, able to regenerate. and people don't believe the stories. This would be enough for any monster, BUT NO, you need to put it in front of some kind of hundred caliber truck mounted machine gun and... not a scratch. Now that is just fucking silly. We had to have SOME hope the Creeper could be stopped, like they almost got him in Jeepers Creepers 2. You could have had him ripped in half by the machine gun, then the upper half crawls over to a dead body and swallows it whole - too much for the effects budget? You can't make the monster unbeatable, because then it DOESN'T FUCKING MATTER what the protagonists do, its not going to work, it had no chance of working. You just get to see them die like it was on a conveyor belt. You killed the suspense. <br><br>Finally the guy that plays the Creeper is a great actor, but he needs to lose some weight for the next outing. The Creeper should resemble a scarecrow - lean, desiccated flesh, fast, lithe - something that looks like it could fly. Not a fat guy in a shapeless red shirt with his belly sticking out. <br><br>Also, one of the things that is great about the previous movies is the FRUSTRATION we sometimes see in the Creeper. Probably in the past, the Creeper went unchallenged in its feeding spree, it is arrogant. But times are changing. There is technology the Creeper is not familiar with. This could provide some awesome frustrations and hurdles for the Creeper. Its harder for him to hide in the shadows now. <br><br>But overall the worst for me was putting him in front of the machine gun with no effect, and the mask for the creeper looks like it cost about $20. You need to pay for some special effects for the face and the movement of the creeper, not just the wings. <br><br>Oh, one more - the truck shoots out that spear, we see the spear travel something like the length of a football field to get to the guy on the motorcycle. Then when it starts dragging the guy back, we see he is not more than 50 feet away from the truck - silliness. <br><br>Victor Salva, do better, I am counting on you!!! I will pay to watch the next one, please don't disappoint me! Or send me the screenplay, I will give you feedback for free!","user":"bobjohnson994","rank":[29,33]},{"title":"Slow and lacking in scares but adequately capable","rating":5,"date":"9 November 2017","review":"It is not easy to make a horror three-quel. Harder if it's a cult film arriving 17 years into the lifespan of a franchise. Adding to that the director's controversy, it was really difficult to make this film all that it could have been.<br><br>Jeepers Creepers 3 is not lacking in good cinematography especially given the film's budget. The natural greens pop next to Southern style estates and farmhouses. One scene taking place at dawn with pink skies and a dark looming tree are ominous... A grief-afflicted mother is preparing for the coming of a monster. The mood is rich and dense as any scene from one of the better two films.<br><br>CGI is a disappointment. The film struggles in making the Creeper's flight and dart actions look realistic. Not a complete failure like talk around the film's effects make it seem, but passable by any measure.<br><br>The most egregious failure throughout the limited scope of production is the film's low fear factor. Far too little is threatening or deliriously creepy in the way the first two films achieved. I can't pinpoint the worst culprit for it. I am near certain that it has something to do with the film's budget.","user":"gm286-89-768211","rank":[15,16]}]