[{"title":"this movie is awful","rating":1,"date":"20 August 2008","review":"I will be honest I enjoyed like 10 min of this movie only because if you change the main characters name to Hercules, well then its exactly that. And its a horrible version. If you are any type of buff who enjoys Movies that are from way back when then you will hate this because the lingo used is from 2008 - all speech is written as though this whole story took place now. Not hundreds of years ago. \"Not my cup of tea\" - is one line used that was absolutely ridiculous. All the swearing is - as*hole - jerk - jack a*s honestly who writes these things ?? Don't waste your money on this movie at all<br><br>Ya","user":"garrett_metzler","rank":[82,105]},{"title":"Hey, kiddies! Did you enjoy the first Scorpion King? *sucker punch*","rating":1,"date":"23 August 2008","review":"I remember seeing the first Scorpion King in the theater and I LOVED it. It had pretty much everything I could expect in a spin-off from The Mummy- Great action, lots of witty humor and very beautiful Egyptian location, and THE ROCK! What a fantastic and underrated . Now I saw the trailer for this one and thought \"Another one?\". Sadly, it looks like I was right. *Another* one. A movie I could laugh, cry, and gawk at how bad it is. So I decided to rent it anyways, because, well, hey, it's a Scorpion King movie. And oh, I couldn't even make it all the way through. It's that bad... well, actually it's WORSE!!!!! The location is AWFUL and nothing like the other movie which had BEAUTIFUL scenery in Egypt, the actors seem to have gotten their acting talents from 4 year olds, the battle scenes are awful too- shaky camera, constant jump edits, it's like you're having a seizure the whole time. Oh and the dialog is mind-numbingly awful too. Overall, if you like mindless idiocy that's so-called \"Cinema\", be sure not to miss this stinker.","user":"Meven_Stoffat","rank":[56,71]},{"title":"Dumb dee dumb dumb","rating":1,"date":"22 August 2008","review":"Even if you thought \"Beastmaster\" was great drama, you'll STILL think Scorpion King 2 is dreadful. The acting is surpassed in dreadfulness only by the dialog, although the muddy, on-the-cheap special effects also cannot be excluded from the race for the bottom.<br><br>We expect a sequel to be worse than the original film, and SK2 does nothing to dash our expectations -- even if it's a prequel. One finds it hard to imagine how the immensely boring and slightly soft hero played by Michael Copan ever could grow up to become \"The Rock,\" whose Brooklynesque charm made the original \"Scorpion King\" worth watching.<br><br>Everything, yes, absolutely EVERYTHING in SK2 is derivative -- and NOTHING is done nearly as well as it's been done in previous sword and sorcery epics. In brief, skip it -- even if the only other choice at 3 A.M. is an infomercial for ceramic steak knives. SK2 is as bad as they come.","user":"vic-232","rank":[63,81]}]