[{"title":"EXCELLENT HISTORICAL MOVIE!!","rating":9,"date":"23 February 2020","review":"This movie is one of Johnny Depp's best. Regarding content, this movie definitely flows at a high pace, but it lacks the violence that is characteristic of so many other American criminal movies. However, this fact does not bother me at all, and I actually really loved this movie, but I think that the lack of violence may be why so many other people rated this movie with a low score. In addition, I noticed something funky going on with Depp's hairstyle: it's reminiscent of 21 Jump Street! The way his hair is combed in this movie very much reminds me of his bad-boy hairstyle midway through the television sitcom. As a result, Depp appears to be much younger in this movie than in many of his other movies from this time era.","user":"MR_Heraclius","rank":[43,44]},{"title":"Hit and miss, mostly miss","rating":6,"date":"2 July 2009","review":"This movie tells the later stages of the crime career of John Dillinger, famous bank robber. What's good: Johnny Depp and Christian bale are good, the pacing is good, the sets and period detail are perfect. The score is quite good too.<br><br>What's bad: a shootout sequence is obviously shot on a video camera looks cheap and has a major discontinuity in it. Other scenes the camera is shaky.<br><br>Also for a movie that prides itself on historical detail, it plays fast and loose with the facts about the Dillinger gang. For instance the death of \"Baby Face\" Nelson is complete fiction. You are duped into thinking the director cares about historical details with all the period sets, cars, news stories on the radio etc, but actually major parts of the plot are just made up. Of course the reason that historical movies rarely follow history exactly is that real events don't naturally follow standard narrative.<br><br>So it is not a documentary, which is fine, so it must be a character movie right? This brings me to its biggest flaw. An important goal of a movie like this is to build an emotional connection with the central character. This ought to be easy with a character like Dillinger, because he actually built a huge public fan base as a latter day \"Robin Hood\", despite being a murderous bank robbing crook. It tries hard and it does get close, particularly with the scenes involving Billie, one of Dillinger's many girlfriends. In the end, though, I just did not care all that much about him..<br><br>It is competent, but ultimately it fails to match up in comparison with other movies of this genre. Right now the IMDb rating for this movie is higher than \"The Untouchables\", \"Once Upon a Time in America\" or \"Goodfellas\", which is a testament to the cinematic ignorance of the majority of IMDb voters. No doubt the same people will rate this comment down, probably without even reading it, simply because I did not give the movie a 9 or 10.","user":"poc-1","rank":[324,405]},{"title":"Well-Made Cinematically, But Shallow","rating":5,"date":"3 July 2009","review":"Who was John Dillinger? We all know he was a flamboyant criminal who robbed banks, but who WAS he? The question of who Dillinger WAS is far more interesting than the question of what Dillinger DID, but this film, sadly, chose only to concentrate seriously on the latter and gave up almost immediately on the former.<br><br>This film goes out of its way--with a poor grasp of history's time-line, by the way--to show us what Dillinger did and who he hung around with, but it does next to nothing to explore who Dillinger was as a person or even as a criminal. It hints that Dillinger might be a passionate lover and loyal friend, but shows us little evidence aside from a few thrown-together seduction scenes (which make his girlfriend/heroine look like a dim-witted pushover) and an awkward love scene.<br><br>Even Dillinger's foil, Melvin Purvis, is a mystery in Mann's hands. Did he care about justice at all, or was he just a fascist on a personal crusade? Was he competent in the least or was he just a bumbling idiot? Squinty-eyed stares can only convey so much, after all.<br><br>Michael Mann seems to be in a terrible hurry to tell this story, as he is stuck between the rock of having to relate a relatively complete \"crime-ography\" of a notorious American gangster and the hard place of keeping the movie shorter than 2 1/2 hours.<br><br>As a result, a beautifully shot and edited movie that had a lot of promise ends up little more than a dumb, shoot-'em-up action movie wearing the fedora of \"historical romance.\" Good for a date, but not a serious film.<br><br>Grade: C+. Things to look for: Mann's ham-handed and laughably obvious political commentary on the use of torture about 2/3 of the way through the movie; psychotically trigger-happy Baby Face Nelson well-played by Stephen Graham; cool old products (Zenth radio); great fashion sense.","user":"Eschete","rank":[463,701]}]