[{"title":"I didn't expect much from this movie but came away quite happy","rating":15,"date":"15 November 2010","review":"Rachel McAdams is what makes this movie so likable and cute. Her spunky optimism and always-on attitude is what drives the movie forward and gives it heart.<br><br>This is one of Harrison Ford's funniest roles - he plays the grumpy, I'm too good for this, I will do what I want and you'll just have to deal with it, asshole extremely well.<br><br>The witty banter back and forth between Diane Keaton and Harrison Ford is at times laugh out loud hilarious. I loved their chemistry and the weatherman's antics were the beginning of when my ratings for the movie started to go up. Once it all got going I thought to myself, \"I'd watch that morning show!\"","user":"hyprsleepy","rank":[92,102]},{"title":"A pleasant surprise","rating":6,"date":"6 March 2011","review":"This film is about a young executive producer's struggle to revive an unpopular morning show.<br><br>I thought \"Morning Glory\" is just another romantic comedy that happens to be set in a television setting, but it pleasantly surprised me. The plot in fact focuses a lot more on the stress and frustration of being an executive producer, with romance being sidelined as an almost dispensable subplot. The intensity of Becky's job is well portrayed, the two anchors' verbal wars and Mike's indifferent and selfish attitude all makes \"Morning Glory\" entertaining to watch. \"Morning Glory\" is a pleasant surprise!","user":"Gordon-11","rank":[24,25]},{"title":"Morning Glory - refreshingly sweet","rating":7,"date":"8 November 2010","review":"Rachel McAdams leads the way in this surprisingly refreshing flick as the workaholic television show producer, Becky, who lands the job of organizing \"the worst morning show ever\". She only has a short time to save the show's plummeting ratings, and in doing so must battle with low worker morale, conceited anchors, poor working conditions, as well as her own inadequacy in dealing with guy-problems. Desperate for a change, she recruits the legendary newscaster Mike Pomeroy, played by Harrison Ford, who is less than willing to cover any story he does not consider \"worthy of his reputation\".<br><br>The film brings not just a comic story of working with grumpy people, but the beautiful emotional tale of a girl who realizes her dream of being a television producer and, by pulling everyone together against the odds, creates a family in the process. But where the story is rather run-of-the-mill, the chemistry between the impressive cast is the movie's redeeming quality. Across the board, acting was fantastic, and in all honesty the movie owes its success to McAdams and Ford. Rachel McAdams should be commended for her frustrated role as Becky, and has proved that she has much more to offer than a just pretty face. Harrison Ford, perhaps the true star of the show, fully embraced the character of Pomeroy did a wonderfully fantastic job being grumpy, conceited, and an all-around \"asshole\" in one of his best roles as of late.<br><br>Morning Glory is a nice tale that will leave you with a sweet taste in your mouth. Combined with some real solid acting, this is not a movie you'll regret checking out!","user":"neji107","rank":[111,131]}]