[{"title":"A good short story but not quite a movie","rating":1,"date":"1 August 2011","review":"'Unrelated' has an intriguing premise: a forty-something woman, on the run from an unhappy relationship, takes refuge in a Tuscan villa with an old (but not, it seems, particularly close) friend; and in fact, prefers to spend her time with the younger generation, perhaps trying to re-imagine the youth that got away. There's lots of potential here, and some acute observation, but also some flatness: director Joanna Hogg skilfully captures the mood of a particularly awful house-party, but it's not the sort of place that feels particularly enticing, and the combination of Anna's stupidity and the spoiled obnoxiousness of the beautiful youths who entrance her make for an unappealing and painful combination. If the story falls short of neat conclusions, it also falls short of what normally defines a good story - and the excessive use of static camera shots, leaving the viewer like a guest who'd rather be somewhere else, isn't especially subtle. Overall, this might have been better at half the length: there are some worthwhile ideas, but scene after scene of Anna sitting, painfully on the edge of a social gathering, feels unnecessary.","user":"paul2001sw-1","rank":[19,20]},{"title":"The ghastliness of the Upper Middle classes...","rating":8,"date":"3 November 2008","review":"This is a hugely impressive debut by writer/director Joanna Hogg. It is an uncomfortably realistic film in that you feel at times that you are being a voyeur and eavesdropper at real events. That the characters are so realistic is a tribute to Hogg's skills and to the quality of the actors. In that respect I was reminded of Mike Leigh who also makes movies that really do seem to intrude upon and depict the real world. In a sense, of course, not all of us go to see movies to see life at its most real and (in this case) in the raw. There is nothing escapist or improbable about the unfolding of events in Unrelated nor are any of the characters unlikely depictions either. More's the pity for a more ghastly bunch of arrogant, insular, selfish sons and daughters of privilege it would be hard to find. Not too hard actually in honesty for this type of English man and woman is all too commonly seen in the leafy suburbs and the Tory Blue counties. Here they are summering in Tuscany with a holiday lifestyle as empty as it is privileged. So empty that they resort to infantile games to pass the time between meals and indulge in banter that suggests that they have libraries in inverse proportion to their wealth  which is considerable.<br><br>There are two main themes. First the battle between the \"olds\" the forty-something adults and the younger set in their late teens. Key conflict is that between George, a prosperous prat with a high regard for himself and a low regard for his son Oakley with whom he has an alpha-male contest. The second theme is that of the lonely, confused and menopausal visitor Anna and how she relates as something of an outsider to the rest of the party. She is going through a crisis with her husband who was supposed to accompany her to Italy but who in the end stays at home. Does she want to leave him, he her or do they both want a new start or to \"try again\"? The unfolding of this happens as we listen in to one side, Anna's, of a series of stressed mobile phone conversations. Anna is clearly something of a \"poor relation\" to the main characters who are wealthier and for self-assured than she is  albeit in a repulsively conceited way. This applies especially to Oakley who is attractive in a pre-Raphaelite sort of way and for whom Anna quite soon has urges  not withstanding the full generation gap in age between them. There is a trip to Sienna during which Anna certainly flirts self-consciously with Oakley and maybe he with her  we cannot be sure of his motives, until later.<br><br>Joanna Hogg films the whole story in a cleverly under-stated way. Even the lovely Tuscany countryside and the beauties of Sienna are toned down by the use of a gentle filter  at no time are we in a travelogue in \"Unrelated\". The climax of the film is an event which could have been serious, but actually wasn't. When George works out what happened in this event he blows his top in an overemotional way with Oakley who he blames for what occurred. It is a pretty nasty scene which we hear but do not see - a very clever device that further enhances the verisimilitude.<br><br>Is \"Unrelated\" a film with a \"cause\" to promote? Probably not unless it is to confirm that at its most supercilious and uncaring man's nature is pretty malicious. We know that before we see the film of course, but what the film succeeds in doing is to show that a group of people who would probably regard themselves as being educated and enlightened are in fact hypocritical, selfish and irredeemably self-centred  especially in their treatment of their visitor who is subjected to the minimum of courtesy and the maximum of patronising contempt. Anna is the only character we care about and we do feel sorry for her  and there is some satisfaction that at the end of the film it is she, after the revelation about what has caused her current melancholy, looks to have some resolution in her life. And the rest of the party move on, no doubt unaware of Anna's turmoil, and back to a world at home in leafy England where they can parade and pomp about how \"heavenly\" Tuscany was again.","user":"Paddy-49","rank":[38,45]},{"title":"Great British Film","rating":7,"date":"22 February 2008","review":"Saw this last night at the Glasgow Film Festival with the director and producer present. Joanna Hogg is really an exciting new talent in British cinema. Her influences would appear to be Bergman, Antonioni, Ozu and other classic art-house masters rather than the wan rom-coms and thrillers that tend to clutter up British cinema. The story of a middle-aged woman who joins her friends on holiday in Italy is intriguingly enigmatic but retains an air of mystery and unease as we are allowed to eavesdrop on conversations, hint at relationships and speculate on what seems to be a deeply unhappy existence. The whole film was scripted but the dialogue retains the feel of spontaneity and moments snatched from real life. A challenging film but well worth checking out. Hope it finds a British distributor.","user":"alhunter-1","rank":[28,38]}]