[{"title":"I guess we just aren't allowed to have fun at the movies anymore...","rating":8,"date":"16 March 2009","review":"Obviously, this movie is not for everyone. It makes last years Sex Drive look like a family movie. Because of this, many people will be turned off by the movie. About a third of the people walked out of the theater when I saw it, and most likely the majority of them went home and rated this a One. Being a fan of the Whitest Kids U'know, I was very excited to hear about this back in December. and then very annoyed when they kept pushing back the release date. But finally, It arrived and it was great, in my opinion. Not quite to my expectations but by no means bad. It is true that some of the jokes become incredibly repetitive, and they dragged the lesbians scene out to the point that it was no longer funny. But more often than not, the jokes are hits rather than misses. Many people have given the film poor reviews because of how unbelievably vulgar the jokes are. Which makes me wonder: Why would you see a raunchy teen sex comedy that takes place at the playboy mansion, and was written, directed by, and starring two of the Whitest Kids U'know if you are offended by vulgar humor? Trevor Moore was hilarious as always but I do feel that Zach Creggor's talent was in many ways wasted. He got very few of the best lines, though, one could expect that since he plays the cliché \"serious\" buddy that is found in all teen sex comedies. Craig Robinson was great, though I thought that his character got a bit annoying after a while. But despite the films dirty charm and frequent laugh out loud moments, there were also a fair number of flaws. Miss MArch suffered from the same issue that the latest Harold And Kumar installment did: Every once in a while they would go just a bit too far. In a film like this you have to walk the line. In many cases, they would take a flying leap over it. Which is fine, to a certain extent. The problem was that the just didn't seem to realize when to quit. Dirty does not always mean funny. If you are trying to decide whether or not to see it, just know that it can either be a laugh out loud hilarious raunch filled comedy roller-coaster or it can be a dull, lifeless, trashy, tasteless, bomb of a movie, depending on your taste, or lack thereof. I personally found it to be the former rather than the latter. But it is most certainly not the type of movie that you should see with your family. 8/10","user":"danomychowski","rank":[35,50]},{"title":"Stupid, Moronic, Brilliant.","rating":7,"date":"15 September 2010","review":"I think that this movie is a perfect example of the weaknesses of IMDb. You get too many people of the wrong mindset reviewing this movie. Being a huge fan of Youtube's \"The Whitest Kids U' Know\", I found the humour in this movie spot on. It is MEANT to be completely over the top (with some real cringy bits). Its just what they do, and to be honest, not many could do it better.<br><br>Yes, this film may not deserve a reputation for anything other than just another Teen movie, but in my books its darn good, and more than anything else, it made me feel a lot happier inside. Is that a bad thing?<br><br>Basically, if you are someone who is going to watch this movie without being able to handle sick, crude jokes, then why review it? it isn't for you. That's quite simple.<br><br>So in the words of Tucker himself, I would rate this film \"A perfect seven\".","user":"meatloaf6","rank":[28,40]},{"title":"not for all tastes but you might like it","rating":8,"date":"18 March 2009","review":"Critics tended to pan this movie. While I'll admit that the movie tended to lean towards gross and raunchy humor at times (especially the sex scenes, the \"flasher\" scenes, and the lesbian car driver characters) and that it didn't seem to be fit for all tastes or aiming for being a classic, I still enjoyed the movie and thought it was truly hilarious. What else can you expect from a movie that centers around Playboy magazine? My favorite scenes were with Molly Stanton chasing after the best friend after, during a pole dance scene, he instigated her into having a seizure with strobe lights and tried to pry her off of him by stabbing her in the face with a fork. Her chasing after him and getting the fire department to do the same were, in my opinion, the funniest scenes. I also liked the road trip scenes and Tucker's meeting with Hugh Heffner. You might like this movie. It really depends on your taste and \"material threshold.\" Give it a try if you're in the right mood.<br><br>** 1/2 out of ****","user":"mattkratz","rank":[43,65]}]