[{"title":"Brutal, Honest, Touching film","rating":20,"date":"20 January 2009","review":"The Wrestler is a drama centered around an aging professional wrestler past his prime. It's so much more than that. You don't have to be a fan of wrestling to enjoy this film. The wrestling part of it can be put aside as a back story. Randy \"The Ram\" could be in any other profession, doing any other thing and could be in the same situation. That's what's so great about it. He's just a lonely guy, whose life seems to have passed him by. A middle aged man who doesn't have much going for him. Sure, he's a wrestler, but he needs wrestling more than wrestling needs him. He needs it to feel important, to feel like a somebody. He really has nothing to show for himself, no wife, just a daughter he hasn't been there for his whole life. Missed opportunities. He's sad and alone and we really do feel for him.<br><br>A closer bond seems to be forming between him and his stripper friend, played by Marisa Tomei, who seems to be in a similar situation as he is. The middle aged stripper who seems to have a real connection with \"The Ram\" is shown in another misunderstood profession. We all may not be as different as we may think. Health problems compromise his wrestling career as he tries to deal with the real world and rebuild his relationship with his abandoned daughter. The scenes with Evan Rachel Wood (his daughter) are touching. Beautifully done. Rourke's character portrayal of the Ram is one of the best in a long time. He's not just acting, he transforms into the character on screen. It's amazing to watch. All the credit he's getting is truly deserved.<br><br>The film is Directed by Darren Aronofsky, who also directed Requiem for a Dream. He does a beautiful job showing the sport with realism. The film respects the wrestlers and their world, and expects the same from the audience. This film is done in a style that's so real, so honest, so amazing, in easily one of the best films of the year. All around great performances and great direction. Definitely worth checking out sometime.","user":"Billy_Costigan","rank":[336,370]},{"title":"A Broken Down Piece of Meat That Doesn't Deserve To Be All Alone","rating":10,"date":"10 December 2008","review":"It's no coincidence that Mickey Rourke is responsible for the comeback performance of the year if not the decade. Rourke's life and tumultuous past parallel Randy \"The Ram\" Robinson's own life so eerily close it becomes clear that no one else could have ever played this role. Darren Aronofsky's fourth feature is not only his most intimate but also his most accomplished to date. Aronofsky offers his most simplistic film both visually and narratively and ends up creating a film that has more depth and layers to it than any of his previous films.<br><br>Everything about Randy's life is in a state of decay. He retains a body that is on the verge of collapse, he hasn't seen his only daughter in years, financially he is exhausted, and the only thing that brings him solace in life is the same thing that threatens to end it. The most effective aspect of Randy's character is that no matter what mistakes he might have made in the past his sense of regret is so strong and genuine that it is impossible not to forgive him. As beaten down and alone as Randy might be he never looses his fighting spirit or sense of hope, no matter how little it may be. Regardless what hardship Randy is confronted with he never retreats and is admirably courageous even if being courageous might not be the smartest settlement.<br><br>For the general public who tend to find professional wrestling laughable and are quick to judge as a form of entertainment rather than a sport will find a deadly adversary in Aronofsky. The Wrestler shows that while outcomes of matches may be fixed the physical tolls these men take on their body are often more extreme and long lasting than most other \"respectable\" sports. The fact that Randy gives so much of himself and is ridiculed from everywhere to the trailer park he lives in to the job he keeps while not in the ring, makes us even more empathetic to the struggle Randy goes through to try and make it back on top. Overall The Wrestler is a constantly engaging and compelling character study with some of the finest acting, writing, directing I have seen in recent years. Oh and I forgot, the last shot will leave you speechless.","user":"BandofInsiders","rank":[207,251]},{"title":"A Haunting Portrait Of Loneliness","rating":9,"date":"25 March 2009","review":"Wow, what a sordid but fascinating film. I can why Mickey Rourke won so many awards for his performance, too. The same goes for the film.<br><br>The film was shocking to me: For instance, it was a shock seeing Rourke -\"Randy The Ram\" - with the long, flowing blond hair and rippling muscles. Hey, it's not that former boxer was ever in bad shape, but he never had muscles like this either. The man must have pumped a lot of iron to get ready for this role as an aging wrestler.<br><br>Another shock was seeing Maria Tomei, of \"My Cousin Vinny\" fame, naked - and in that state in more than one scene. She didn't leave much to the imagination as \"Cassidy.\" A third shock was seeing some of the early wrestling scenes. Yeah, pro wrestling is rough stuff and it's bloody and it's fake, etc., but the scenes in here are pretty brutal, more than I've ever seen on TV. The one extended match with the \"staples\" was pretty gruesome.<br><br>Evan Rachel Wood is convincing as Randy's daughter \"Stephanie.\" This 21-year-old is no stranger to acting, having been doing it since she was four! The scenes with her and her dad are memorable.<br><br>When the shock of the above scenes of sex and violence (and language) fade away, underneath it all is a very tender, sad tale of a lonely man who invested too much in his career and, after coming close to mortality, realizes the important of family and simply being loved by anyone. That's what sticks with you long after the film ends. Loneliness can be a killer.<br><br>\"Randy\" tries to mend fences and post a few himself - in his final quest not to wind up as an island in this world of humanity - with both successful and unsuccessful results. Sometimes you can never change what you are, and sometimes you can. Both of those are demonstrated here in this oddly-edgy-but sentimental film.","user":"ccthemovieman-1","rank":[85,101]}]