[{"title":"Switched It Off","rating":1,"date":"3 November 2008","review":"This could possibly be the worst Seagal flick ever. Where do I begin? The fight scenes are laughably phony and are a throwback to the \"Dolemite\" movies of the 70's. Yes, that bad and then some. Seagal's face is shown close up while a stuntman does all the work. It's comical to see the ill-fitting wig on the back of the stuntman. The fight sequences constantly use instant replay and this adds to the hilarity.<br><br>Seagal himself looks like he is literally dying from some undisclosed illness. His skin is red as raw meat and just as slimy. His face is full of weird pockmarks and it shines from the sweat. The man looks like he should be on some sort of life support. It's funny to see the actresses in the film have to pretend they want to jump his bones every time they look at him. Seagal once again uses his fake southern drawl as he's done in the last three films.<br><br>The gunfight was awful - he kept punching in clip after clip and must have shot off 40 rounds without hitting anything. Ditto the three bad guys. After that, my brain disengaged and I fell asleep.","user":"qormi","rank":[45,52]},{"title":"A step back","rating":5,"date":"19 August 2008","review":"Where do i start, pointing out the many problems, this movie has?<br><br>First off.....the plot. I've come to expect over-complex plot points in recent Seagal movies, but in KILL SWITCH it's not overly complex....it just doesn't make any sense. The flashback to Seagal as a child (witnessing his brothers murder) serve little purpose to the storyline, but i guess they help pad out a few minutes of screen time. And believe me, this movie felt padded. It doesn't even have the (so-bad-it's good) camp value of ATTACK FORCE.<br><br>Secondly....The editing. This was some throwback to the days of film-making in the 80's. Occasionly, Jackie Chan (or Tony Jaa) may employ this 'repeated' camera angle stuff, but it's usually to highlight an extremely choreographed fight move or stunt. In KILL SWITCH however, it once again feels like padding (and given that it runs throughout the movie, it feels like it's makers have only got 45 minutes of actual footage, and therefore NEED to show everything twice, thrice and even ten times) Seagal is chasing a suspect at one point, and he comes to a doorway. The viewer is treated to about 20 different shots/alternative angles of this 'monumental' moment.<br><br>Thirdly.....The fights. To me it seems that Seagal was not trying to make a martial arts movie at all. Apparently, the makers of KILL SWITCH attempted to beef up (what would usually be a four second fight scene) with extra stuff involving stunt doubles. This is all the more annoying, because Seagal's actual fighting is better than his stunt doubles. The final fight (against the serial killer) is all Seagal (and it shows) it's quick, brutal and efficient. Yet all fights before it, are heavily padded out with lazy punches, reversed shot of Seagal (sometimes wearing a different jacket, because it came from another scene) URBAN JUSTICE and PISTOL WHIPPED have proved that Sensei Seagal can still mix it up as a fighter. But these shoddy film-makers are tarnishing his rep, with these underhanded tactics. It(in turn) makes Seagal look weak, as he'd usually demolish his opponents in 5 seconds (such is why we like the guy) but here, the 'padding'implies that Seagal can punch a guy 30 times (in the face) and STILL not put him down. And i also want to see Seagal break an opponents arms and legs with HIS hands....not a hammer. Don't even get me started on the shoddy (couldn't hit a guy two feet in front of him) gunfights.<br><br>Finally...Steven Seagal. He actually puts in a good performance (once you get over the 'southern' drawl) and looks in good (allbeit heavy) shape. He rarely mumbles, and seems genuinely interested with the project (unlike say...FLIGHT OF FURY?)<br><br>KILL SWITCH is a step back for Seagal (just as he was regaining some well needed credibility) after URBAN JUSTICE and PISTOL WHIPPED. Although the movie is U.S lensed, is well lit, and crisp cinematography, the god-awful (quick cut, repeated shot) editing, and unnecessary doubling, betray whatever potential this movie may have had. The supporting cast is OK (Rest in peace Issac Hayes) and the music is quite good also. Now that (it seems) Seagal is regaining his passion for acting again, he needs to associate with better film-makers in the future. His next movie RUSLAN is also directed by Jeff King (director of this) so i won't be (honestly) expecting anything special of that one. But as long as they don't start interfering and chopping up their filmed product, it won't need to be great to be better than this movie. My theory on KILL SWITCH is that they've only had limited screen time with Seagal, and (hopefuly?) HAD to cut and paste this movie, to pad it out. If they think that repeatedly showing a guy fall out of a window 12 times, or making pointless scenes last four times longer than needed to be....is cutting edge film-making then (to quote Seagal) \"Lord have mercy\")<br><br>Big Lee gives this movie a 5 (only for Seagal's screen presence, and a OK final fight scene)","user":"dolemite72","rank":[42,53]},{"title":"Another Segal movie","rating":2,"date":"30 July 2008","review":"When I started to watch this movie and saw that Seagal wrote it I got the feeling that this wasn't going to be a good movie. First of all Seagal is his usual self showing of his awesome acting skills. To support him in this movie Isaac Hayes has the role of the forensic doctor and he is awful. <br><br>The way this movie i cut in its action scenes is very annoying, every punch is seen 2-4 times and every so often you get a close-up at Seagal looking grim. The choreography in the fight is also bad, since there basically isn't any to be found. The fights are mostly Seagal holding a guy and punching him in the face repeatedly. The gun fights are just as bad and you start to wonder how Seagals character ever made it into the police force, because he can't hit anything at all. <br><br>All in all, this movie sucks","user":"calgar666","rank":[48,63]}]