[{"title":"Basically one big ad for league","rating":7,"date":"19 October 2019","review":"I generally really like video game documentaries. However the documentary part of this is really lacking. Theres like a 5-10 minute blip about the creation of the game, but after that it just ends up talking about the esports/community aspects. Which, I still find interesting, but I would have much preferred a more in-depth look into how league was made. They never really talked about balancing, or the challenges of making certain champions or even the gameplay itself. Instead they focus on the rise of the league esport, the celebration of its fans, and how it can bring people together. Much more time on how the game actually was made and challenges of the game itself would make this documentary way better. Great credits music though.","user":"nickskanavis","rank":[17,20]},{"title":"Insightful Documentary on the Rise of the eSports Internationally.","rating":10,"date":"25 October 2019","review":"As a gamer in the who lives in this day and age, its nice to be able to witness the rise of esports and relate to the experiences of other gamers across the globe.\nI've honestly not played League before. Thought it was crappy when I first heard about it. But was glued to a load of other games.\nMeanwhile, to witness other game developer giants being able to rise and surpass the likes of EA/Blizzard/etc. is really quite something.<br><br>Touches on the origins of the company, but also more on the rise of esports and cultures surrounding gaming, which helped make League what it is today.\nA must-watch for fellow gamers, even if you've not played LoL - I'd still recommend it.","user":"SyfierX","rank":[3,3]},{"title":"Fives short review","rating":8,"date":"15 December 2019","review":"I know that I overrated this documentary a little bit, but the point is that they show what video games mean to us nowadays. They can be esport games (League of Legends, CS:GO) that people enjoy to watch, like football, or they also can tell a good story where we like to learn more about it and to discover things by our own (A Plague Tale: Innocence, Skyrim), like in a good movie. And yes there are things that you can complain about it, for example that they only show good things about Riot Games and themselves. But all in all this is a step in a right way, so that people can see how fascinating videogames can be.<br><br>Have a nice day!","user":"SagentFives","rank":[2,2]}]