[{"title":"Hasidic drug smugglers.","rating":6,"date":"24 October 2010","review":"\"You are a liar and a criminal. You are not my son.\"<br><br>I'm not sure how close Holy Rollers comes to the actual events that it's based on, but it's an interesting flick. It really doesn't do much more than the many movies that chronicle the rise and fall of a drug dealer that came before, if I'm being honest. You have your innocent young man who's seduced and corrupted by the (seemingly) easy money of drugs (ecstacy, in this instance), that he's introduced to by a shady friend, and most of the consequences play out in exactly the way you would expect them to and have seen before. But the setting among the Hasidic Jew community of New York gives the movie a unique spin that (at least for me) made it something other than the cookie-cutter story it could have been.<br><br>Jesse Eisenberg was totally believable as the initially pure-hearted main character whose desire to make more money leads him away from his family and the life he values. It was a good role for him, but it didn't really require him to stretch beyond his characters in Adventureland or Zombieland. Which isn't to say that he's not good here, he just gives a very familiar performance. I hear he plays a very different character than his usual in The Social Network, though, so hopefully my fears of him being forever bound by one particular character type are unfounded. &nbsp;<br><br>Ari Graynor was the reason why I initially wanted to see the movie (big-time fan, the girl great), but I have to admit that her character was pretty one-dimensional and didn't really give her much to work with. The same goes for Justin Bartha's character and most of the others in the movie: they're not really written as whole people. They're given one or two qualities and everything they do stems exactly from their total greed, purity, etc. It would have been nice to see some more \"complete\" characters, but that's my only real complaint about the film.<br><br>I liked the documentary-like quality of the camera work; if almost made it seem like I was watching the movie unfold in real-time. And as I said before, the setting and context the story plays out in was Holy Rollers' biggest strength, in my opinion. How much you enjoy it will depend largely on how much interest you still have in these kinds of stories, as it admittedly doesn't rise out the familiar trappings and scenarios of similar movies. I still found it to be pretty entertaining, though.","user":"lewiskendell","rank":[22,24]},{"title":"Dark and light","rating":7,"date":"24 June 2010","review":"In this compellingly acted but underwritten true-life saga, Sammy Gold (Jesse Eisenberg) is a good Hasidic Jewish boy who works with his father in the garment district. At twenty, Sammy is naive and polite. He's supposed to get married, though the girl switches to somebody else. He may become a rabbi, but he's not sure yet. He looks sweet and adorable in his 'payis'side curls, black suit, and big hat. He has a good head for business and is dissatisfied that his unambitious father would put customer relations so far above profits. Along comes Yosef (Justin Bartha), a neighborhood acquaintance, who's making inexplicable amounts of money and wears a flashy Rolex. \"Women like shiny things,\" he says. He claims he's getting paid a lot just for carrying medicine over from Europe for rich people.<br><br>At Yosef's urging, Sammy joins in on a trip and drags along his neighbor Leon (Jason Fuchs). All they have to do is carry suitcases, not look in them or open them for anybody, not look nervous, and act Jewish. Acting Jewish isn't too hard when you're decked out as an orthodox Jew. They go to Amsterdam and return to New York via Brussels and Montreal. The two young men in their black suits and big hats are forced to wait in a brothel hotel in the red light district: their first trip to Amsterdam isn't very glamorous. (Later Sammy comments that he knows Anne Frank's house is here and he's sorry he doesn't get time to visit it.) Leon freaks out at the obvious illegality of the operation on the first trip and quits; he's getting married. But Sammy, whose life hadn't taken shape, continues the lucrative runs and even becomes a semi-partner, looking after the business side and instructing new recruits. What Sammy and the others with him are doing is acting as drug mules and they're bringing the illegal recreational drug \"ecstasy\" (MDMA) from Amsterdam to New York. Orthodox Jewish garb is perfect cover. Who would suspect such a person? The ringleader is Jackie Soloman (Danny A. Abeckaser), an Israeli. Sammy is charmed by, and partly charms, Jackie's girlfriend Rachel (Ari Graynor). Though he pretends to be still working for his father, Sammy allows Jackie and his world to dominate his life.<br><br>As played by Eisenberg with a nice mixture of lightness and intensity, Sammy, or Shmu'el as his father and the rabbi call him, is a mass of contradictions that come together perfectly to get him into this mess. He's smart but naive, aggressive but shy, aloof but a people-pleaser, a good boy who becomes a willing criminal. The film informs us that between 1998 and 1999, this group of Hasid mules transported over a million ecstasy tablets from Europe to America. The orthodox Jewish community of Brooklyn, like that of Jerusalem in 'Eyes Wide Open' -- Haim Tabakman's Israeli tale of an married orthodox butcher who gets involved in a secret homosexual love affair -- is tight and small, and word eventually gets around that Sammy is doing something very, very wrong. His father disowns him and he becomes isolated from family and community. Meanwhile the operation grows too careless and ambitious. New mules are forced to carry heroin, which drug-sniffing dogs can detect, along with the ecstasy. Sammy Gold's world collapses from within and without, and he winds up crying on the steps in Brooklyn next to Leon, begging for help as the police sirens approach.<br><br>'Holy Rollers' shows us the Hasidic Jews' world and the dark, flashy, world of the constantly partying drug smugglers, who seem to like sampling their own wares. Eventually Rachel persuades Sammy to try them and swig liquor and dance and kiss her and wear a soft brown cashmere Italian suit. (The young Hasids on the take go around in silly looking white Nikes that Jackie gives them. )<br><br>The tricky part is showing how boys from the one world can get lured into the other one. The best moments, because they're when the crossover becomes plausible, are when Sammy talks about the value of making a little more \"gelt,\" or steps in to challenge a black European ecstasy manufacturer who thinks he can both increase production and raise his price. Jesse Eisenberg, who first attracted notice in the 2002 movie 'Roger Dodger' and then in 'The Squid and the Whale,' 'Adventureland' and 'Zombieland,' has a disarmingly pure quality, and it's fun to watch him take on the central role in a sort of action film. Sammy Gold is all jittery, spunky surface. Eisenberg gives him a nervous intensity that's both oddball and appealing. When he kisses Rachel he thanks her after each kiss while trying to pull away. He can act skittish and bold at the same time. He adds a depth that the screenplay hardly allows. 'Holy Rollers' is his vehicle. It will be remembered for his fresh, vivid performance.<br><br>The trouble with the movie is that it gets so deep in the back-and-forth spiraling drug-transporting action the moral complexity of the situation goes out the window. Eisenberg's changes of expression and scenes that shift from dark Amsterdam nightclubs and New York raves to Brooklyn row houses bleached out by the cold winter light suggest a world of contradictions the film unfortunately doesn't fully explore.","user":"Chris Knipp","rank":[21,29]},{"title":"A Really Compelling Drama","rating":7,"date":"18 March 2011","review":"I never heard of this movie and recorded it only because it stars Jesse Eisenberg, an interesting actor. It turned out to be a solid drama, very engaging, about a young man torn between two drastically different worlds, the Brooklyn Hasidic world in which he was raised and the criminal world of drug smuggling and easy money. The ending demonstrates the power of family and community as the young man, Sam, played by Eisenberg, desperately returns home.<br><br>The movie portrays the Hasidic community from the inside, with no overt attempt to explain its ways and customs to outsiders. While a passing familiarity with Jewish traditions might be useful to viewers, any reasonably intelligent person should have no problem figuring out why people say and do the things they do in this film. My guess is that someone from a very different way of life, such as an evangelical Christian, might find it easy to empathize with the characters. On the other hand, I personally am resolutely non-religious yet found the movie compelling.<br><br>Hard to explain why Jesse Eisenberg is so interesting to watch. His facial expression is really quite limited. Most of the time he wears a frown of intense concentration--the same look that characterized him through much of The Social Network. On the rare occasion when he smiles or (at the end of the movie) cries, it is a memorable moment.<br><br>Thanks to the note on the Holy Rollers IMDb start page, I see that there was a subtext or rationale for the title of this movie, but I still think it is an inappropriately snarky title for the serious drama that this turns out to be.<br><br>Holy Rollers is well worth seeing.","user":"bob-790-196018","rank":[7,8]}]