[{"title":"Insightful, but dangerous","rating":7,"date":"24 December 2008","review":"The crux of this doc is squarely on the perceived notions of what steroids do to an individual. I dare anybody to refute the fact that there are too many unknowns concerning steroids. This doc states that the side effects of steroids are reversible once steroids are stopped. True, but what isn't mentioned is the wasting of muscle tissue that breaks down into ketones. Unless a vigorous exercise ritual is maintained, then muscle mass dissipates into fatty bulk. This is what leads to heart problems.<br><br>Getting back to the film, it masterfully illustrates the hypnotic influence wrestling had on so many young boys; myself included. When I went to the Army, I worked my rear off to look like Brutus the Barber Beefcake. It never happened, but my ego was never bruised because of it. The \"side effects of being American\" don't come from the steroid culture. They come from a childhood of being told that we can do or become anything we want to be. Think about how different childhood would be if we were told exactly what our function would be at an early age. So much time otherwise spent dreaming of irrational careers could be spent preparing for an inevitable livelihood. That is not to say that people are their jobs. So much time could be spent enjoying the personal aspects of our lives rather than spending 20 plus years exploring how we make a living.","user":"antiprice","rank":[29,33]},{"title":"Well Made, Honest Look at Steroids","rating":16,"date":"16 July 2011","review":"Like many men his age, growing up Chris Bell idolized the muscle stars of the 80s like Arnold Schwarzenegger, Sylvester Stallone, and Hulk Hogan. He dreamed of becoming a professional bodybuilder and working out at Gold's Gym with his heroes. He was devastated, therefore, when he realized these men were juiced up and that their message was fraudulent. Chris reluctantly accepted that to truly compete in the sport he loved he would have to turn to steroids and ultimately rejected the drugs. His brothers, Mike and Mark, couldn't make the same choice. \"Bigger, Stronger, Faster\" explores the controversy that is the steroid industry and the American obsession with being just what the film's title describes.<br><br>\"BSF\" is what you would call a balanced documentary, or to purists, a \"true\" documentary. Chris explores both sides of the argument over steroids and does his best to leave the final decision of whether or not steroids have been overly vilified up to the audience. There is a certain amount of reluctance to the narrative that Chris provides and you can sense the conflict within himself as he takes us through this journey. On the one hand, he believes the drugs to be morally wrong. On the other, he knows he can't compete without them and proponents of steroids (featured prominently throughout \"BSF\") make a compelling case for their usage. Chris is a human face for the battle against steroids, a sympathetic figure who really sums up the issues that so many athletes face these days.<br><br>Unlike some of the reviews I've read, \"BSF\" is NOT a pro-steroid documentary. Those who would push for the legalization of the juice are given an opportunity to express their beliefs and discuss the scientific tests that would support their assertions. But I found this to be more in the interest of the aforementioned balance rather than portions of a propaganda piece for 'roids. The classic side effects of steroids (acne, uncontrollable anger, loss of fertility, etc.) are not only discussed but clearly displayed by the drug's defenders even as they argue against these afflictions. When Chris quietly challenges some of the assertions of anti-steroid campaigners, notably Congressman Henry Waxman, it is done with respect and genuine interest in the factual basis for some of the widely-held beliefs about steroids. Through these questions, Chris shows that the issue of just how destructive these drugs are is not as clear-cut as we tend to think. Whether right or wrong, you can find studies that will support your claims either way.<br><br>Chris brings the point home, however, when he turns the camera on his own family as he peers into the lives of his brothers, both of who use steroids regularly and both of whom have been negatively impacted by their habits. It is a truly compelling moment when Chris' dad tells him point-blank that he expects Mike to turn up dead sooner rather than later. It's even more hard-hitting when you know that just a few months after the filming of \"Bigger, Stronger, Faster\", Mike did die at the age of 37. A longtime steroid user who would have done anything to break into the world of big time wrestling, Mike's early demise serves as this documentary's lasting impact and perhaps the final point to swing the balance of the film's debate.<br><br>Check out my site: www.thesoapboxoffice.blogspot.com","user":"bdgill12","rank":[11,12]},{"title":"Best Show on the Subject","rating":10,"date":"15 July 2010","review":"I took 15 different anabolic steroids, oral and injectable, the original human growth hormone, and HCG during my four years of anabolic use in the early 80s as a competitive powerlifter, bodybuilder, and college baseball and hockey player...but now I'm a school teacher with a master's in math, so I'm not a total blockhead. I learned about 'roids from the best (Dr. James Wright, who did steroid research for the US Army), was involved in the drug trade with the best (England's Tony Fitton), and have been the subject of numerous studies, print stories, books, and shows (Time, Harvard University, Boston Museum of Science, Nightline to name a very few). That being noted, this was easily the most honest, straightforward and truthful program I've ever witnessed about anabolics - and that includes all the stuff I've been involved in. Those who don't agree simply don't have the experience to realize that, so it's not really their fault, they are just consumed with personal opinion and bias based on little to no first-hand knowledge and the misdirected media. Throw everything else in the trash, this show is the best.","user":"kfratt","rank":[27,34]}]