[{"title":"Want to see an interesting movie?","rating":17,"date":"17 July 2008","review":"I went to preview screening at 20th century Fox and I would say this is a solid thriller along the lines of \"8 mm\" As an audience member, I was intrigued right up until the very last line (which totally creeped me out, by the way). There's a MAJOR twist that I really didn't see coming; at that point, I realized this was no ordinary thriller. Paz Vega's performance is awesome--- maybe one of her best ever (I'm biased though; I think she's fantastic). Very subtleshe really draws you in. And Simon Baker is a great match for her. <br><br>In short: if you like smart, suspenseful, creative, original movies, see this movie.","user":"zackmurray","rank":[34,54]},{"title":"If you'll like dark & twisty, you'll like it...","rating":15,"date":"15 July 2008","review":"I love dark, twisted movies, and this is definitely right up there... an awesome thriller! <br><br>All of the religious rituals are pretty disturbing (but incredibly fascinating). The idea these people really exist and actually practice these rituals freaked me out! <br><br>All in all, I thought it was thought provoking, the performances were great, and the ending was entirely unexpected. I got the feeling there might be a sequel; if that's the case, I would definitely see it too.<br><br>Long story short: If you're into thrillers with some brains, then you'll really like Not Forgotten.","user":"patricia0804","rank":[35,56]},{"title":"4.8...??? Seriously...? I don't know what these people are smok'n. An extremely well done, powerful Thriller. Simon Baker really ROX this one...","rating":9,"date":"27 July 2013","review":"I've LONG given up trying to understand the people who rate films here; truly, it is just WAAAAAAAAY beyond me...<br><br>I can honestly find no flaw in this film what so ever. The mood, atmosphere, acting, look, soundtrack, and especially the direction are DEAD on.<br><br>I love this kind of film where you really do NOT know everything at the beginning and things are indeed not what they seem. Truly an excellent story and beautifully told. If my life depended on it, I would be at a total loss to find ANYTHING that would make ANYONE not like this movie.<br><br>The suspense (really helped by superb direction and editing) was slowly but relentlessly built as the story goes on. And this is certainly just about the best performance I've ever seen from Simon Baker. I really like the twists too; I promise you, you will NOT see them coming. The ONLY thing that you might say is a bit of a stretch is the 'conversion' at the end (that shouldn't give too much away : ) I could see people perhaps having a little trouble buying into the change of attitude. Like I say, I DON'T want to give too much away, but that is really about THE only part that might not set perfectly with some people. But even with that said, it still in NO way diminishes the excellent quality of the film that precedes it.<br><br>If you like movies that are very well made and your Thrillers Dark with just a touch of the otherworldly 'tastefully' thrown in, and you like powerful twists that pack a solid punch, then you should very much enjoy this film.","user":"lathe-of-heaven","rank":[6,7]}]