[{"title":"Dog vomit","rating":1,"date":"4 March 2012","review":"While the overall story line holds great promise, the movie falls short by wielding a clumsy script and incongruous story line. One is constantly bashed over the head with the movie's many \"points\" in an unbelievable and unnatural line of dialogue in each scene as characters seem to line up in some shots, hovering in the background, waiting for their turn to speak to the main character as if they cannot see or hear the character before them. On top of that, the dialogue from some characters seems to come out of left field motivated by some unseen force having nothing to do with the environment, circumstances, or previous scene. Combined with the complete, utter lack of congruity between scenes and the overuse of narration, the movie constantly breaks the fourth wall and one has to force oneself back into the story over and over again. I'm not saying it's the worst movie ever made, but it's pretty darn close.","user":"sremundasbury","rank":[8,13]},{"title":"A hidden gem!","rating":10,"date":"13 May 2010","review":"This film appeared to be your typical small budget flop until the company soldiers appeared. The company soldiers were so believable that it seemed like they had just marched forth from 1860 into my living room. The dialog offered an interesting glimpse into the daily struggles of a Union soldier. Aside from the outstanding performance of the company soldiers (particularly this young Kevin Steck fellow who reminded me of a young Keanu Reeves!), the movie had the most magnificent special effects. As the barn burnt, I thought I could smell the blatant odor of an 1860's era timber-based shack lingering into my nostrils; such realism! The clinching factor was the performance by the dog Jack. Seriously, who trained that mutt? He was Airbud on steroids and so much more! I highly recommend this movie to not only civil war buffs and dog fanatics but to any fan of character development, extraordinary CGI, and professional dog stunts. A must see for any true American!","user":"b939931","rank":[6,9]},{"title":"Good screenplay, bad acting","rating":5,"date":"26 April 2012","review":"Having recently watched Ken Burns' Civil War series, I decided to watch a movie based upon the Civil War. Seeing the name \"Louis Gossett, Jr\" drew me in to Dog Jack. However, he did not actually appear in the movie, but only narrated. The actors for the most part, appeared to have been recruited from a church choir, (although admittedly, this is pure speculation on my part), as many of them could sing very nicely, but were ineffective as actors. I did not recognize a single familiar face, not even a grade C or D actor. It was difficult to emotionally connect with the characters due to the contrived feel of the actors reciting their lines. The choreographed fight scenes were weak as well. On the plus side, the storyline was actually quite interesting. The cinematography was excellent, having been filmed in Iowa, Wisconsin, Illinois, and Pennsylvania. If you approach this movie as a documentary re-enactment, then you won't be disappointed. Civil War buffs should be able to enjoy this despite its flaws. But it must be said, this could have been *so much better*, had they hired a couple of professional actors, even B-grade actors, for a couple of the lead roles. <br><br>The movie also had a \"faith/spirituality\" message and feel to it, which is fine by me, but is one of the reasons why I suspect that the actors had been recruited from a church group, probably from somewhere in Illinois. (In the closing credits, special thanks were given to a church in the Chicago area.) <br><br>This is a decent family movie, with no graphic violence, sex, or cursing, and the children watching will most likely not notice the glaring weaknesses in regards to the acting.<br><br>Once I resigned myself to viewing this as a dramatized Civil War \"re-enactment\", I was able to appreciate the film on a somewhat modest level.","user":"Johnny_Hing","rank":[2,2]}]