[{"title":"Sexy, subversive and very surprising...","rating":8,"date":"28 June 2009","review":"Spread is an unusual little film. I say 'little', as it's essentially a low budget character-driven drama that is some how being commercially packaged as a rom-com. A quick glance at the credits reveals that this isn't your average Kutcher vehicle: it's directed by Scotland's David Mackenzie of \"Young Adam\" and \"Hallam Foe\" fame. <br><br>Make no mistake, the Kutcher we see at the start of the film is very familiar: arrogant, uptight and utterly beautiful. But as the run-time flies past, we somehow warm to his character even though he's getting more sex than most of us will get in a lifetime. And here's the good news: Kutcher's performance is fairly astounding. He manages to reveal the humanity in his deeply flawed character with notable subtlety and a distinct lack of cliché. Kutcher's (many) sexual relationships portrayed in the film are brutally realistic: the modern and perhaps unromantic realities of casual sex are not dressed-up in any cheap Hollywood moralising. This is also evident in the overall tone of the film: there are many moments that could have descended into schmaltz, but a sharp edge it maintained on just about every line of dialogue. <br><br>Kutcher fans: beware. This is a real departure for the actor, but thank goodness: it's a movie with all the superficial gloss of Hollywood and all the invention of an indie flick.","user":"appleknight","rank":[194,268]},{"title":"a heavy handed and patently nasty ode to 21st century values of greed and excess","rating":3,"date":"27 August 2009","review":"An American Gigolo for the 21st century, although without the '80's morality and sense of excess. Spread is a heavy handed and patently nasty ode to 21st century values of greed and excess. Demi Moore's toy boy Ashton Kutcher is perfectly cast here as Nikki, a handsome, vacuous, arrogant but impoverished stud who seduces wealthy, lonely older women and sponges off them while giving them an enjoyable sexual experience. He is currently sharing the lavish Hollywood Hills mansion of 40ish lawyer Samantha (Anne Heche). But while she is away on business he beds a number of younger more insatiable girls. But he remains emotionally detached, and never lets anyone get too close to him. That changes when he meets Heather (Margarita Levieva), a waitress who works in a coffee shop. But Heather is the female equivalent, coasting through life and living off the largesse of wealthy older men. But Heather is even more complicated than that. When Nikki falls hard for her it is a relationship that will change his life. Spread is an undeniably handsome-looking production, but it is rather vapid and empty. We've been through that younger man/older woman vibe too many times in the past (Shampoo, Sunset Boulevard, etc) to be seduced by the rather lacklustre version of the story served up here. Working with director David MacKenzie (Young Adam, etc), first time screenwriter Jason Hill serves up a morality tale in which the narcissistic young stud eventually gets his comeuppance. Kutcher may get by on his pretty boy looks but his performance is flat and he brings little depth to a character who is pretty shallow to begin with. There are oodles of flesh on display here, but the coldly staged sex scenes fail to generate much heat.","user":"gregking4","rank":[53,75]},{"title":"Not a comedy?","rating":5,"date":"15 January 2011","review":"I was surprised to find so many descriptions for this movie describing it or tagging it as a comedy... by my reckoning it's more of a light drama expressing the costs of inconsiderate over-indulgence. The players and performers all did their job as one would hope in any movie, but emptiness in the script and storyline left me wishing I'd spent my time more productively. I can't speak to any sense of realism in it, but perhaps there are worldly examples I'm simply unaware of. I did enjoy a few aspects of it, but there's little in the way of empathy that one can generate for the characters within as they're all between 'hollow &amp; insensitive' and 'dishonest &amp; abusive'.<br><br>My suspicion is that it will have greater appeal for younger audiences, mainly because some of the scenes portray rampant levels of decadence that they'll be more likely to appreciate than those of us in our 40s.","user":"Hardryv","rank":[26,35]}]