[{"title":"Better Than Justice League...","rating":7,"date":"11 December 2019","review":"And there is barely any Justice League in it. Honestly if they had left the resurrection of Superman for its own movie it would have worked a lot better. Here the opposite is true, combining both the death and return into one long movie works a lot better.<br><br>I honestly can't imagine the Death part working on its own, barely anything happens before the end besides drama that we have already seen the conclusion to a hundred times, and the second part on its own would surely be far too convoluted. So we'll done to DC for making this narrative into one part. It just makes sense.<br><br>Overall this arc is a complete film, although they probably could have shaved down some of the conversations, especially with Lois Lane, who seems to be there to pad out both separate movies, but most of her stuff doesn't need to be here when combined. Good story, drags a bit.","user":"scythertitus","rank":[5,5]},{"title":"Still steel","rating":7,"date":"26 November 2019","review":"I don't know how to comment or handle this film after DC combo that Movie to becomes one movie . This is so  Awesome DC . Who can expeted about this Movie . next time please do something like this. its easy to watch .","user":"mikahlurimaah","rank":[3,8]},{"title":"My boyfriend is from another planet","rating":4,"date":"12 October 2019","review":"Superman dies and returns and Batman doesn't kill him. Doomsday killer from outer space raises havoc and destroys the Justice League. New Cyborg superman takes over. Lex Luther is a combination of good guy and bad guy.<br><br>Apparently, anyone in the world can make DC comic cartoon and they don't have to be connected. I recall from before that Batman had a biological son and the new Green Lantern was a female. In this cartoon, Lois Lane is voiced by Raven and she doesn't know Kent is Superman as yet as they eat at a bar and grill owned by a former seaman who serves ribs. Batman is still a tool. And what was with the Super Boy? Will we ever see that character again?<br><br>The feature was too long and cluttered. Characters didn't seem to be the ones we know. With all the wonderful 3D effects available, this cartoon is barely ahead of \"Clutch Cargo\" animation.","user":"nogodnomasters","rank":[5,21]}]