[{"title":"I sure as shite seen everything now.","rating":6,"date":"6 November 2009","review":"If you are looking for some kind of a coherent storyline, look elsewhere. This horror film is pure black comedy.<br><br>It is a continual \"feast\" of blood and mayhem. The monsters are back and they are hungry as someone says. At least the action takes place in daylight this time so we can see the ugly things - if you look fast because things move at lightning speed here.<br><br>Clu Gulager survives the first film only to be taken prison by a girl biker gang set on revenge for the death of their queen. In the process, he really does a number on Honey Pie (Jenny Wade) for leaving him in the first film. He goes all Mike Tyson on her! We have midget wrestlers, Thunder (Martin Klebba) and Lightning (Juan Longoria García), lots of biker chicks, and lots of monsters that may be interested in more than killing.<br><br>The autopsy performed by Greg (Tom Gulager) produced the most copious explosion of bodily fluids that I have ever seen. You might say the chance of you hurling while watching is better than even.<br><br>This was just one big gore-fest.","user":"lastliberal","rank":[15,17]},{"title":"Bodily fluids","rating":9,"date":"6 October 2008","review":"There is a whole lot a things going on in the \"Town\" and there is going to be bucket-loads of bodily fluids flying trough the air. Feast II is obviously made with love and with one thing only in mind - to offend anyone who is not accustomed to Braindead-type of horror. Because nothing is sacred in this movie. I mean, I can think only like two or three things \"worse\" than what is shown in F2 but it would have been illegal and thus they couldn't include those acts in the movie.<br><br>What comes to real cinematic values, like directing and so on... well don't expect intense horror and realistic reactions. Expect mediocre facial expressions and out-of-this-world situations. But hey, the cast and the crew really didn't even bother to try because you can't make this kind of movie with serious face. It's tons-of-fun and it's goooood. I say goood! If you like mad and incoherent movies with lots of corpses and you don't need solid plot because all you want is madness, then this movie is for YOU.<br><br>I give it 9 stars because of the fact that this movie is so politically incorrect and the fact that it is below 5 now. Without the mad scenes this would have been a 5 out of 10.<br><br>Have fun watching. And for the record, if you watch this with your girlfriend or boyfriend, tell them that you just picked it up without knowing what to expect :D","user":"mrguugelballer","rank":[37,63]},{"title":"I'm Hungry","rating":5,"date":"17 December 2010","review":"Shortly after the massacre at the inn one of the survivors Honey Pie travels to the nearest town. Closely following her is Biker Queen and her gang, who after picking up a severely wounded Bartender (previously believed dead), head to the same town in order to avenge the death of her sister (Harley Mom). For no apparent good reason she blames her death on Bozo (one of the survivors of the first part, but not appearing in the second). However it turns out that the monster manifestation was much larger in scale than just the roadside bar and that the whole town is infested with the man-munching buggers. The few survivors include a car dealer Slasher, his wife and her lover as well as two midget wrestlers named Thunder and Linhtning. Add to that Short Bus Gus, a meth addict, who manages to hole up in the local jail-house (the safest place in town). Naturally everyone wants into the jail-house, but Bus Gus isn't willing to comply...<br><br>The aptly titled sequel Sloppy Seconds is an extravaganza in bad taste and rule-breaking with a despicable act of killing an infant the highlight of the sheer audacity of the director and his crew. Naturally a part of you cries 'no!', but surprisingly this sequence is handled very well and probably is one of the two standout scenes in the sequel. The second involves an extremely stupid plan, which for some reason everyone else thinks is quite brill. If this was The A-Team the plan would have worked... since this is Feast II it failed spectacularly, because lets face it - whoever came up with the plan needs his head examined.<br><br>That would more or less resolve the issue of what's good about the movie. The script is forced and the characters feel much more farcical than in the original, which really takes away the capacity to become emotionally involved in the action. Additionally their motivations and actions are nonsensical (but in a bad way). A couple of odd twists and turns work out well, but none of the new characters really click in this part (except for Thunder and Lightning), while the old characters are much more bland and uninspiring. To add to insult all the likable characters are killed off by the end of this part leaving only irritable heroes for the third outing.<br><br>All in all a decent followup, but lacks the consistent and edgy script of the first part. It would also seem that the Feast is not going in any specific direction as far as building the back-story of the monsters.","user":"mr_pivac1985","rank":[3,3]}]