[{"title":"Unknown gem in a sea of poor to mediocre","rating":7,"date":"18 August 2009","review":"I've just recently seen Strigoi at the Toronto After Dark Film Festival and was absolutely surprised at how good the film was. The trailer I had seen for the film made it seem like a very low budget, campy, been there done that vampire film. What I was shown was a well produced, professional, good looking film with an interesting vampire story. As an added bonus, there are some funny moments and good jokes mixed in throughout the film so that it doesn't come off stale.<br><br>The only real problem I had with the film was the slow pacing and longer than necessary runtime. Had the film been cut down by 10-20 minutes, I think it would become 100 times more enjoyable.<br><br>I was surprised to find out that the film has technically been done since early in the year but had only now, played in front of an audience. I am lucky to say I was able to catch this little gem at it's world premiere.<br><br>I hope to see more from this talented writer/director in the future and wish Strigoi all the best. With no big name actors, it may be a hard sell which is a damn shame. Genre fans need to see this film. In a genre where the market is flooded with the taste du jour and the films often leave a bad taste in your mouth, Strigoi serves up a platter of delicious offerings genre fans are sure to eat up.","user":"acantho77","rank":[44,53]},{"title":"Dark-creepy Romanian take on the vampire myth","rating":7,"date":"11 April 2010","review":"Unfortunately this is a hard to find movie, but trust me if u ever get a chance you'll certainly enjoy it!<br><br>The plot starts where our hero young doctor returns from his internship in Italy to his in-the-middle-of-nowhere village. He finds that a kind of weird old man has been dead. In Romanian tradition when someone dies his friends must stay up with the dead body for three full days, just to make sure that nothing goes out of the way...! He sees five villagers staying up and drinking next to its coffin. But, they hardly liked the dead man. And this is where all creepiness starts taking place...<br><br>Through out the film everyone seems emotionless, they all talk slowly, amazing things happen and they act like it's everyday routine. This bizarre non linear beat of the movie is what makes it creepy and kind of disturbing. To add to all this bizarre world comes moments of dancing to Bregovic music...!! <br><br>If you ever been to Eastern Europe you do get that weird feeling as if everything is heavier than it should be and that people do have this distinct- chilly- unemotional tone in their voice. It always creep me out, and that's exactly what I got from this film. <br><br>Certainly a gem, certainly out of the ordinary and a great idea to watch an \"original\" Romanian take on vampires. If u get a chance, do watch it!","user":"Filippos01","rank":[40,52]},{"title":"A Funny, Surreal, Creepy Mystery","rating":8,"date":"20 April 2012","review":"It is well written, well directed, and well acted.<br><br>This isn't a knee slapper. It isn't an in your face \"Boo!\" fest. It doesn't make your skin crawl like a Hannibal Lector. It isn't a Sherlock Holmes mystery.<br><br>But its wry and amusing. There are scenes so odd in light of the circumstances that they stand out as surreal and yet right for some reason. The whole movie revolves around getting to the bottom of why or what this Strigoi vampire nonsense is all about.<br><br>While set in Romania the language is English and well spoken. As a native English speaker it is easy to follow along while still getting the sense of being in a foreign world -- a place where the undead still have their wrongful place in the world.","user":"bradleedjohnson","rank":[18,22]}]