[{"title":"Better than Expected","rating":7,"date":"12 November 2010","review":"After reading the reviews posted here, I had little hope of seeing a good movie, although the fact that the movie was playing at a \"budget\" theater was incentive enough for me to see it. I'm glad I went. Over the last couple of years, I've found that reviews on movies have become extremely undependable. It seems as though a lot of folks, who fancy themselves as reliable movie critics, have become quite snobbish in their reviews. It's so easy to be critical. Some critics like to feel that they are a step above the rest of us, and therefore more likely to understand how the movie should have been written, versus the flawed production that was actually released upon the public. I'd have missed many a good movie had I listened to the \"professionals\". This is an entertaining movie. It's not \"The Godfather\" or \"Shawshank Redemption\", but it's a good old fashioned action movie that keeps your attention. Get some popcorn and soda, sit back, and enjoy the show.","user":"tommydtcb","rank":[187,233]},{"title":"Highly flawed, but ultimately successful","rating":6,"date":"28 August 2010","review":"The plot for this film does not need to be explained. It's basically a pastiche of The Italian Job, True Romance and melodramatic clichés. <br><br>The third element in the blender, mentioned above, along with a script short on genuine character development (You'll sometimes forget that Hayden Christensen and Zoe Saldana are in it) are distracting for a film which develops a serious tone, but there are positives, depending on your genre preferences. <br><br>The film moves along briskly, even as we deal with a cringe-worthy first half, and when the actual robbery gets going, the fun starts. Though the cinematography is modeled too much off of the Bourne-style shaky cam, the set pieces are still very well pulled off. <br><br>The extended car chases and shootouts contain a level of energy and suspense that really makes them standout, comparable to similar scenes in the above mentioned films, along with an on-foot chase clearly modeling itself off of the Madagascar chase in Casino Royale. Every car whizzing by, bone crunch or gunshot affects the audience due to mostly- proper use of slow motion, and great editing, both sound and film wise.<br><br>The melodrama may make some engaged viewers start laughing due to how it's put on screen, but as the stakes get higher, gels with the storyline. <br><br>The main cast, considering the material they are given, do the best they can, and their charisma is enough for us to care about them when the stakes get REALLY high, particularly in the case of Matt Dillon and Idris Elba.<br><br>It's highly unoriginal and contains several other elements worthy of nitpicking, but after evaluating how I had spent the past 107 minutes of my life, I think it got the job done.<br><br>B-","user":"fullautofury","rank":[83,119]},{"title":"What did You Expect?","rating":7,"date":"24 September 2010","review":"You don't go into a movie like this expecting it to be \"Apocalypse Now\". You walk in expecting to sit back and be entertained. Now I did the latter of the two and honestly I wasn't disappointed, it was far fetched, it had a good amount of dumb action, and mediocre acting. Now this all might sound bad but really it's not I enjoyed this movie for all it's faults.<br><br>Any description of the plot would be meaningless since it's pretty much given away in the preview, which happens a lot nowadays, but despite the formula plot line there was actually some descent characters to watch and almost care about.<br><br>I'm really happy I took a chance on this movie, I love great movies and even though this is definitely not one of them it entertained me and for a while I was just enjoying the movie. Which isn't really why we go to the movies anyway?","user":"JoeC345","rank":[61,86]}]