[{"title":"Fun with serious intent","rating":8,"date":"14 October 2010","review":"Mr Nice is a rare beast of a film, it swaggers, it spits, it dreams, it punches, it laughs, it cries and of course and likely above all it gets stoned.<br><br>Howard Marks is the central character played effortlessly by Rhys Ifans, a welsh school boy turned big city student and pothead. We see Marks transformation through a series of off beat scenes in which director Bernard Rose reflects on Marks' humble, banal yet honest origins. Then our protagonist through a combination youthful substance experimentation and a fateful convergence of circumstances is established as an international Drug smuggler, <br><br>We are gradually introduced to a plethora of interesting characters that vary from casual love interests to drug dealing allies, who materialise as Ifans travels deeper into Marks' world of dope, dealing and debauchery. Amongst the group are fine supporting efforts notably from David Thewlis who delivers the hilariously cranky IRA terrorist turned middle man Jim. Chloë Sevigny convinces as the overly supportive wife and mother Judy and Omid Djalili sparkles intermittently as the Pakistani pusher Saleem Malik.<br><br>The film takes us through the tumultuous times of sex, drugs, betrayal, greed, prison and pot which Marks and his merry men navigate their way through against a lush backdrop of 70's pastiche. By the time we get to the stories conclusion we have great connections with the characters motives as a result of the superb cast and due to an impressive directorial mesh of humour and grit from Rose what's left is the best British film of the year to date.<br><br>8/10","user":"bartireid","rank":[25,28]},{"title":"Deserving more","rating":4,"date":"13 October 2010","review":"A film that in theory couldn't go wrong with some of the stories Howard has got in his arsenal. But the film was slightly off aim; mainly by concentrating more on his family life than action packed drug deals or comedy situations. Lets face it, the reason everyone wants to read and now watch about Marks is not his loyalty as a husband or devotion as a father.<br><br>Director Bernard Rose just seemed to go the wrong way about telling the story of Mr Nice. With very dry arresting scenes which are better left played out in your head with Howard's narration or read in the book.The film does have its up points however with David Thewlis putting in a master class performance as crazy Irish IRA Jim McCann which left me half wanting the film to be all about him. Rhys Ifans played the part of Mr Nice with that particular Marks swagger which his fans know and love him for and pulls it off well.<br><br>The film has pockets of comedy which helps numb the slow two hours of product, but at times it doesn't seem to know what it is a good witty British film to an ITV drama.","user":"tyo24","rank":[17,19]},{"title":"To laugh. To cry. To care . . .","rating":8,"date":"24 June 2010","review":"I hadn't read much about the film before seeing it. Afterwards, I'd say it is one part sexy, stoned, witty fun. One part light-hearted crime caper (almost, but not quite, getting too repetitive). And one part 'serious issues.' The film is very loosely inspired by the life of Howard Marks.<br><br>Part One. Howard (Rhys Ifans) goes from a tiny school in Wales to become a successful Oxford graduate, consuming large amounts of marijuana on the way (plus a tiny bit of LSD, probably a lot of sex, and a small amount of alcohol). After Oxford, he gives up drugs to become a teacher. But when a pal is stranded trying to bring a car full of resin home, he kindly steps in and finds it rather lucrative. The difference between someone who smokes and someone he deals is, as he puts it, the first smokes all they have; whereas the second has more than they can humanly smoke. He's drawn into the Secret Service in passing, who like his ability to move between borders and attract ladies.<br><br>I found Part One very funny. I have a slight problem with Rhys Ifans looking the same age at the beginning of the film as he does many years later, and after a fairly long stretch in prison. But it didn't distract me from enjoying it. His Welsh humour finds its mark, the comedic editing and timing is flawless, and for anyone over a certain age it has elements of a trip down memory lane. When David Thewlis chimes in (convincingly) as an IRA leader, Jim McCann, offering to supply planes to ferry the stuff over, heavyweight Irish hilarity meets Welsh wit. The head-on result is riotous, and yet never predictable or stilted. Add to that, my favourite fall-in-love-with-the-bad-guy actress, Ms Chloë Sevigny, and I am in for the ride.<br><br>Part Two consists of several cat-and-mouse chases as they evade capture. I did wonder if they were going to keep it up till the end of the movie, but it gives me a chance to look out for a tiny cameo by king-of-the bad-boy directors himself, Mr Ken Russell. (Look carefully or you will miss him – in the background at one of the passport check sequences.)<br><br>Part Three is when we start to see what the movie's serious undercurrent is, and it accordingly leaps in my estimation. Remember Steven Soderbergh's film, Traffic? If you came out of that thinking every sensible, well-supported argument on legalising marijuana had been made – and still there was no change in government policy – it's time to realise that rational argument is not going to change articles of faith. Can humour help? Mr Nice doesn't make moral judgements. But the natural facts speak for themselves. The main character and his associates never use hard drugs (stated emphatically). There are no perceptible harmful effects (other than Howard and friends enjoying what they do). There are considerable beneficial effects. Especially notable is the scene where a man discovers his partner being unfaithful. We expect violence. If they had been drinking alcohol – a drug with far more proved harmful effects – violence would almost inevitably followed. Instead, they get momentarily outraged: then share a joint. From my limited student experience of the dope-smoking 'scene' many years ago, this is an entirely plausible reaction. The association with 'organised crime' (here, the IRA in the form Jim McCann) is clearly a result of anti-drugs legislation, not the other way around. The misery inflicted is the emphatically the result of anti-drugs legislation, not the use of the drug (Sevigny especially comes into her element with some emotionally moving end-scenes. Yes, I did shed a tear. And Sevigny managed a very nice English accent to boot).<br><br>The filmmakers must have wondered if smoking marijuana would be decriminalised before Mr Nice was released – but the UK government, in one of the many pre-election scandals, ignored the advice of its own experts and continued to include hash in the 'war on drugs.' As Soderbergh said years ago, \"We can't have a frank discussion with our policymakers - if you're in the government or in law enforcement you cannot acknowledge that drugs are anything but inherently evil and morally wrong.\" Bottom line: there is too much money and jobs tied up in 'drugs enforcement' to legalise them. But I should stress that this is my 'reading' of the film. Someone opposed to decriminalisation might reach an entirely different conclusion, and from watching the very same film.<br><br>On the downside, two hours of largely hash-based comedy could be very wearisome for anyone that hasn't had at least passing familiarity with the stuff. Other complaints might include Rhys Ifans not seeing him get his shirt off often enough (though I lost count of the number of times he did). Or whether Ms Sevigny used a stand-in for the brief times her shirt was off. On the plus side, it made me proud that Britain could turn out solid, constructive comedy. Rather than kitchen-sink drama based (as Ken Russell might say) on 'football in the Midlands.' Sometimes laughter, well done, can maybe reach places that common sense alone cannot reach.","user":"Chris_Docker","rank":[36,51]}]