[{"title":"Don't be side tracked by the obvious twist.......there is more than one","rating":8,"date":"27 February 2010","review":"I know there is already a spoiler warning up top but I am going to warn you again. Don't read this because I am going to give everything away.<br><br>I had this movie all wrong I will admit at the start I didn't get it and I was angry but after having a chat with my friend who went with me we both gasped when we realised what happened. The twist wasn't that he was the inpatient (seriously I think everyone saw that coming from a mile away!) the twist was the intervention actually worked. He was cured, he deliberately made it look like he relapsed because he did not want to live with the memory of what happened to his family. He blamed himself for ignoring that his wife was clearly unstable. The line \"would you rather die as a good man or live as a monster\" Depicted he wanted to die as a good man (lobotomized) then live with the memory of what happened. Also the symbolism of fire and water tells you when he is hallucinating (fire) and when he is lucid (water trickling through.) The delusion he concocts to save himself from accepting the truth is that his wife died in a fire. All the people he talks to surrounded by fire is a hallucination – the woman in the cave, the patient in the cell, the scarred faced man who he thinks killed his wife, the car blowing up – all a delusion. The water symbolizes reality trying to break through. He is afraid of water – ( and rightly so!His kids were drowned, they all died in front of the lake.) Also at the start he says he gets 'sea sick' – he is mortally afraid of water. He has to swim to get to the lighthouse.<br><br>To truly get the best affect of this movie you have to see it more than once. (I have only seen this once but I promise you I will see it again)<br><br>I think John Anderson from the Wall Street Journal got it right when he says the film - <br><br>\"requires multiple viewings to be fully realized as a work of art. Its process is more important than its story, its structure more important than the almost perfunctory plot twists it perpetrates. It's a thriller, a crime story and a tortured psychological parable about collective guilt.\"","user":"Tania_Chesala_R","rank":[402,426]},{"title":"The movie is perfect psycho drama","rating":10,"date":"24 September 2017","review":"Shutter Island is the story of Teddy Daniels, A U.S. federal marshal sent to the island with his partner Chuck Aule to search for the disappearance of a patient. Each scene provides a turn against their leads and compels them to look for more whilst searching in places we couldn't comprehend, including their minds. Leonardo DiCaprio and Mark Ruffalo feed off each other and supply great performances for their characters as expected, but some of the other characters whose names are riveted on the posters or marquees are sensational as well. The two that stuck out to me most were Ben Kingsley (Dr. Cawley) and Michelle Williams (Dolores, Teddy's wife), each of whom brought so much dramatics and new questions to the movie, developing plot twists and controversy. I don't think this film would be the same without them.<br><br>This is also a film I would recommend seeing a second time. In fact, it is even better the second time. All those pieces of that puzzle you didn't catch the first time, you will the second. You see, we as the audience are first put in the shoes of Teddy. The second? Well, without giving too much away, lets just say you are put in someones else's shoes entirely during the second viewing. <br><br>Shutter Island. A film that will make you question your own sanity. A film that will leave you breathless. A film that has re-ignited the thriller genre. A film that will leave you, and the main character, searching for answers.","user":"ruhsa","rank":[127,132]},{"title":"love this movie highly recommend.","rating":10,"date":"23 February 2020","review":"Visually beautiful, wonderfully acted, and relentlessly gripping, Shutter Island is a brilliantly unrestrained psychological thriller that keeps its audience riveted throughout its entire duration.","user":"MR_Heraclius","rank":[50,51]}]