[{"title":"I liked it","rating":7,"date":"5 May 2010","review":"It's well-written, competently acted, good story, funny, what's not to like? Incredible scenery too, I don't recall any other movie shot in a place like that.<br><br>I thought I might be in for some low budget amateurish flick as I didn't recognize any of the cast, but the story kicked off, kept my interest, made me laugh, and the cast were good. Great production values. The lead girl looks vaguely familiar and I recognized her sister who is, according to the credits, Missi Pyle, although she's not listed on IMDb as of my post.<br><br>So if you like a comedy that's a little on the black side, you can do a lot worse than this.","user":"steventf","rank":[25,30]},{"title":"Surprise, surprise","rating":8,"date":"8 March 2012","review":"If you see it at NetFlix, it is worth watching. The production values are excellent. No big special effects eating away at the budget. No big names. No giant spiders. This is just a \"what if?\" film that stays interesting and delivers a laugh every couple of minutes.<br><br>It is not over the top comedy like Airplane! or Naked Gun. It is more of a bumbling, mistaken identity, he's dead, no he's not, type of humor that is never juvenile. Likable characters, even the ones we like to hate.<br><br>Some toilet humor, but not really the kind of toilet humor some films stoop to. This is high class toilet humor. It has no boring character introduction scenes at the beginning. Five minutes into the movie you have action and adventure and a giggle or two.<br><br>In the age of internet movie night, this is a very good choice. I want to watch these actors again.<br><br>This would be a good double bill choice with Bonnie and Clyde.","user":"yonhope","rank":[7,7]},{"title":"Great, classic comedy","rating":9,"date":"16 September 2010","review":"I'm not entirely sure why this movie has a less than stellar rating. I watched it on Netflix and honestly was not expecting much, but wound up being very pleasantly surprised. <br><br>The opening of the movie has such great physical comedy, I was laughing out loud. It was a really refreshing change from all the sex and fart jokes most movies have (which can totally be funny, but let's face it, are way over done and over-relied upon at this point). I grew up watching (re-runs of) I Love Lucy, so I'm a big fan of physical comedy, which just isn't used as often anymore, particularly with female characters for some reason.<br><br>What I really loved about this film was that while it was completely laugh out loud funny, it actually made me care about the characters. Most straight-up comedies (non rom-coms) don't do that. But at the same time, it wasn't so over the top that it felt like it was changing genres or anything. I just actually cared what happened to them, while of course laughing at their ridiculous predicaments.<br><br>I've seen a good number of Jaime King's films and, in my humble opinion, this is one of her best performances, both for the comedy and the softly stated drama of her character. Usually when I've seen a lot of one actor's films, it takes me out of the world and I just think of the character as the actor. That didn't happen here. <br><br>While I generally like Josh Cooke, I will say that I'm not entirely sure he was the best choice for his role. He did a good job, but something just felt off in believing he was this criminal that could go off at any moment. And, IMHO, it is necessary to believe that in this film. The plot started to get a little stale towards the end, and I think some of it could have been left out, but it moved along quickly enough that I wasn't bored, and ultimately it didn't detract enough from the film to make an impact on my overall opinion of it.<br><br>A Fork in the Road is a great movie to watch if you just want something funny, that isn't plain stupid or a stoner/slacker movie. Worth checking out!","user":"whiskeyjumper","rank":[17,20]}]