[{"title":"No, not Star Wars. No, not Battlestar Galactica either.","rating":1,"date":"15 February 2020","review":"This is Battle Star Wars, a mockbuster of Star Wars: The Rise of Skywalker. What's a mockbuster? Well, sometimes when a big-budget, highly-anticipated movie is coming out, small studios will quickly and cheaply pump out their own ripoffs for a quick buck, hoping to trick people into buying them because of the similar titles and cover art. They are NOT parodies. They're just ripoffs. The most infamous studio that does this is The Asylum, who have made such masterpieces as Transmorphers, Atlantic Rim, Avengers Grimm and many, MANY more. I highly recommend looking up their filmography. It's pretty funny. They also make their own original giant monster movies, sleazy sex comedies, B-horror movies and Christian movies. Hmm. One of these things is not like the others. Anyway, normally I wouldn't bother with these damn mockbusters. I tried to watch Transmorphers once and was bored to tears. However, I'm a big Star Wars fan so I thought it might be fun to check this movie out. There are no new Star Wars movies coming out until 2022. Gotta fill the void somehow. I don't really know what I was expecting, but it's really bad. The effects are really bad, the cinematography has all the personality of a soap opera, the score is generic, the story is derivative and it's just boring. Everything is basically Star Wars but changed slightly. Instead of Jedi, you have Paladins. Instead of the Galactic Empire, you got the Coalition of Planets. Instead of the rebels, you get....still the rebels. They didn't even change the name! The movie even has expository text at the beginning! They even straight-up used some Aurebesh letters from Star Wars in the movie! It's very shameless. You know how Star Wars is fun and action-packed and is always taking you to new locations and moving the story along with great characters? Well, 99% of the scenes in this movie take place in the interior of ships. The other 1% is shot in some desert. And I swear, they used the same sets for every ship but only changed the colour of the lighting! That kind of thing might be acceptable for a stage play, but not a movie! And the characters are dull! And the action is boring! And the story is hard to follow because it hardly shows you ANYTHING! They just tell you everything, but even then they don't explain things. One of the bad guys, who's supposed to be Darth Vader or something, has Force powers out of nowhere, which was NOT established at all unless I missed something! And the costumes are bad! Half of the characters are just wearing regular clothes, and the ones who are wearing something Star Wars-y look like they're wearing Halloween costumes! My favourite was this one character that's supposed to be a Wookiee or something but it's just a tall guy with a beard! My second favourite were all the robots who all just looked like regular humans. Even the worst sci-fi B-movies from the 50s and 60s usually remembered to make their aliens look like aliens and their robots look like robots! There's only one actually properly costumed alien in this movie that shows up near the end out of nowhere! There are also technical issues everywhere. Some sound effects are just missing, there's some bad editing and half the actors can't even pronounce the name of the main character, who's supposed to be Poe Dameron or something, correctly! Speaking of the actors, they're clearly trying their best but the direction and the script are so bad they just don't have anything to work with. Overall, this movie could've worked if it were a fraction of the runtime and a Star Wars fan film on YouTube or something, but even some of those are better than this. Maybe the script could've been turned into one of those crappy self-published sci-fi novels on Amazon. It still wouldn't be good, but at least we might get a Jenny Nicholson video out of it! It would be better this! Anything is better than this! Don't watch it! It's not so bad it's good! It's not enjoyable at all! It's just bad! Even The Phantom Menace is better than this! No, you know what, even The Star Wars Holiday Special is better than this! No, you know what, even Turkish Star Wars is better than this! Avoid it like the plague! Oh, one last thing, there's a setup for a sequel. Ughhhhhhhhhh.....","user":"ajzeg","rank":[20,21]},{"title":"End me","rating":2,"date":"28 January 2020","review":"In just the TITLE, this movie rips off two other, far superior franchises, Battlestar Galactica, and Star Wars. The opening exposition dump uses the Dragon Language from Skyrim with an odd transition into English. The ships at the beginning look surprisingly okay, but the explosions that quickly follow are reminiscent of the flower clouds from Spongebob. There are also Hyperspace(?) jumps that appear to use the same effect but blue. I have trouble describing events past this as it causes me actual pain to think about this movie.","user":"aubreyc-40617","rank":[32,38]},{"title":"Asylum back at it again.","rating":31,"date":"31 January 2020","review":"Typical Asylum turd, skirting copyright infringement hoping for people to accidentally buy this, as they mistake it for a movie of \"some\" quality.<br><br>Lets see if i can give this  fest the 0 starts it deserves.","user":"errornl","rank":[10,11]}]