[{"title":"It's good movie to watch","rating":6,"date":"23 February 2020","review":"A pretty violent film with not much of a storyline, apart from a heart. The whole film was basically clips of action sequences which didn't add anything to the film apart from some of the 'better' scenes. It was all over the top and exaggerated to the max, with preposterous action scenes where he was not harmed at all, to loony jumping off buildings. It wasn't one of Jason's best films.","user":"MR_Heraclius","rank":[36,37]},{"title":"In short, I liked it.","rating":8,"date":"18 April 2009","review":"Let me start off by defending my rating of this title. Really it's hard for me to rate a movie like this, it is directed right at me and my type of people. I can't help it that I like a movie like this, it's just the way it is.<br><br>Really this movie is a grind house movie in an era where grind house movies don't exist. It has everything that is unacceptable as entertainment in other movies...and yet you can't stop watching. It's for the most part, balls to the walls, insanity. It doesn't make sense. The reason I don't' mind...is that it's not trying to. It knows it's stupid and crazy. And it loves it. It's not trying to impress you. This is a movie that really took control of itself. Typically you'll have a movie with an a-b formula...this is a a-z formula with complete insanity and randomness filling in the interval. You know where the movie is going as soon as you start watching it, it's the ride that excites and keeps you watching.<br><br>In short, this movie has violence, action, nudity, homosexuality, disabilities, public indecency and racism. And I have to admit, I liked it.<br><br>The one problem I had with this movie is it started so crazy and hilarious that it kind of peaked in the middle. It was just so much that the rest didn't surprise you anymore. I still found it very enjoyable though, and would definitely add it to my collection.<br><br>Also I know this review sucks, but this movie is hard to give a serious review to. If you like movies that play out like a GTA video game mixed with a violent Japanese film...then watch it. Just have fun with it.","user":"terrencepatrix","rank":[288,383]},{"title":"Absolutely Extreme","rating":8,"date":"16 April 2009","review":"This movie is not for the faint of heart.<br><br>If you've watched the first Crank and enjoyed it, you will absolutely love this one. It pushes the boundaries the first one set to the absolute maximum. There are no lines this film does not cross, from outrageous public sex scenes to gore that almost rivals the Saw franchise. It will keep your heart pounding for the entire film's duration. It's one of the most hilarious, stylish and down-right insane films I have ever watched.<br><br>If you haven't watched the first Crank, I recommend watching it before you even think of watching this film. It'll give you some good background story and also prepare you for what you are about to see.<br><br>If you saw the first Crank and didn't like it... do not watch this movie. Multiply Crank by 1000 volts and you get this incredible sequel.<br><br>The Crank franchise is an acquired taste, and this stretches it even for fans.","user":"phue_fighter","rank":[216,304]}]