[{"title":"...oh dear Abrams. Again.","rating":5,"date":"10 May 2016","review":"I'll leave this review fairly concise. <br><br>This film was originally called \"the cellar\" the premise being what we see for the first 90% of \"10 cloverfield lane\": an excellent, brilliantly-scripted thriller set in an underground bunker, the tension lying in the \"goodie-or-baddie\" mystery that is the owner of the bunker, Howard. He is telling our hero, Michelle, that she cannot leave because the air outside is not breathable due to an attack, probably nuclear. She wants to leave because she suspects that Howard is insane.<br><br>That premise right there is perfect. Is Howard telling the truth? Is he a deranged kidnapper? Will Michelle eventually decide to leave? Is the air really breathable outside? The magnitude of that intrigue would have made for a brilliant film. <br><br>Would have.<br><br>This is when JJ Abrams and bad robot came in and basically did what they do with the end of every single project they ever take on. Ruin it. Ruin it absolutely horrifically. They have clearly seen monetary value in the name \"cloverfield\" and are insisting on making it a franchise. Do we expect monsters going into this film? Yes. Do we get them? Yes. Was it necessary? Absolutely one million percent no. <br><br>10 minutes from the end of what had been a gripping film, we finally see Michelle leave, and escape the bunker. She realises that the air is still breathable. Now, \"pre-abrams\" as I'll refer to it, this would've been an excellent ending. A bittersweet tale of abuse, of loneliness from Howard's point of view, of revenge, of victory. But with a huge psychological trauma to go home with. Honestly this film would be perfect had it ended here. But it wasn't to be.<br><br>This is when the aliens come. We seem to in the blink of an eye turn from \"the cellar\", a brilliantly told thriller, into an Abrams, overly-Hollywood, big budget cringefest. For me, it wasn't the moment the spaceship came on the screen, it was the moment our timid hero, portrayed brilliantly up until now, who'd just been crying uncontrollably with relief at the air still being breathable, suddenly turns stern action hero. She looks up and says \"you have GOT to be kidding me\", in the same emphatic way we've seen in 600 \"five out of ten\" films down the years. <br><br>I'm sorry, but you've just seen alien life. And that's your reaction? In what until now was a very realistic, well told suspense thriller? Not having it for a second. It was like we could see the moment Abrams took over. And it ruined what could have been a classic.<br><br>The remaining 9 minutes are nothing more than a glorified creature feature, culminating in our hero, who's suddenly lost all her emotions, driving off to help the \"human resistance\" fight against the aliens.<br><br>End of movie. What amazes me most is the number of critic reviews I've seen saying \"the aliens are a metaphor for what is outside a person's lonely bubble of abuse\" or some nonsense along those lines. Sorry guys but you're thinking WAY too much into it. This is a story of a money-grabbing company, who bought a perfectly good script, and ruined the ending with aliens. <br><br>I'm not entirely sure what I expected in all honesty. It's Abrams. I saw the ending to LOST and vowed never to make the mistake of investing my time in any of his projects again. Sure enough, I made the aforementioned mistake again and it's almost as bad as LOST was (minus the 5 years of my life id invested for the lovey-dovey, semi-religious, out-of- ideas cop out snoozefest that was the ending to LOST). <br><br>Abrams strikes me as one of those who inexplicably takes pride in disappointing his audiences, as if he feels he's somehow above them and that the negative reviews are just people who don't \"get\" him. I think in all honesty it's more a sign that he's just not very good at what he does. <br><br>My advice? Turn off when you see Michelle remove her oxygen mask. Pretend that's the end and you have your film of the year. Watch on for yet another example of \"how to ruin a perfectly decent project: by JJ Abrams\"<br><br>5/10. 10 for the first hour and a half, minus 5 for the last 10 minutes.","user":"sonofocelot-1","rank":[368,477]},{"title":"Unfortunately the ending ruined an otherwise great film.","rating":7,"date":"30 January 2019","review":"This movie is full of suspense. It makes you guess about what is real and what is not. It happens more than once that you have to wonder about what is the truth and who is lying.<br><br>Because you are just as clueless as the main character, Michelle, you really get to experience the same type of emotions and confusion as she is. This not only makes you feel closer to Michelle as a character, but also to the overall story.<br><br>They did, however, ruin this connection that they build over the course of the story by making this sloppy, rushed and just strange ending. If they had made a different ending, my rating could have been an 8 or maybe even a 9. Depends on how good of an ending it would have been.","user":"Imme-van-Gorp","rank":[84,103]},{"title":"Fantastic, gripping, thoroughly enjoyable, until the final part ruins it...","rating":5,"date":"4 August 2017","review":"I give the 5/10 out of the credit I owe to the original writers of the fascinating psychological horror that takes place inside the bunker. The mystery is compelling: Is Howard telling the truth? Is there any real threat outside? Is Howard a crazy child-abusing maniac? Did he plan all this to own Michelle? etc. I could all go on pretty well had the film ended with the heroine's escape, but then, all of a sudden, what the? REAL ALIENS? Are you kidding me? Just how \"lost\" are you Mr. Abrams?! You turned the fantastic, gripping thriller about a deranged paranoid old man into a totally irrelevant tale of worm aliens taking over the earth? The ending ruins everything. The character of Michelle was well portrayed as a woman running away from problems instead of facing them, finally managing to \"grow up\" and learn to fight her problems. The ending, however, turns her into a completely different person. From a timid girlfriend, Michelle turns into an alien- smacking badass chick straight out of a classic sci-fi alien flick who blows up a giant alien invader with a bottle of liquor and a matchbox and, not frightened in the least, decides to take the fight to the aliens herself. The movie begins and proceeds as a psychological thriller/drama about paranoia, claustrophobia, and insanity and in a split second turns into the worst moments of the Resident Evil franchise. I literally thought I was watching a remake of the ending of The Thing, with the same actress and all. Great job uncle J.J., you did it again. Had I know he was involved in the plot, I would've thought twice before watching this film. You CAN enjoy this film, just turn if off as soon as the hero goes free. keep watching and it'll turn all the fun you had into utter disappointment, frustration, and resentment.","user":"mhodaee","rank":[99,130]}]