[{"title":"24 City","rating":12,"date":"12 May 2009","review":"This review is primarily in response to Barry Freed's, whose take on the film is so wildly different from mine it makes me wonder if we saw the same movie.<br><br>I LOVED this movie. I think the quasi-documentary style is wholly winning and adds a lot to the story. As far as defending Jia's decision not to do a \"traditional\" documentary, I guess I just have to give him the benefit of the doubt. If he had wanted to do a \"traditional\" documentary, then he would have done so. I feel that Jia is an accomplished enough artist that I can assume he has an instinctive sense of what will best serve a particular story. Clearly, in this instance, he decided on a fact/fiction \"blend\", and to my mind, he made the right call.<br><br>While watching this, I couldn't help but think of Werner Herzog and his theory of \"ecstatic truth\" (\"I know that by making a clear distinction between \"fact\" and \"truth\" in my films, I'm able to penetrate into a deeper stratum of truth that most films never attain. This deep inner truth inherent in cinema can be discovered only by not being bureaucratically, politically, and mathematically correct.\" - W. Herzog). While I'm not (necessarily) making a comparison between Zhang-ke and Herzog, I feel that they are very much after the same thing. Whether an essential truth can be best conveyed using actors or non-actors, using a documentary or drama approach, etc. are questions that both directors obviously struggle with, and I feel that they have come to similar conclusions. They (to my mind) have opted to fuse the two approaches, in an attempt to remove intellectual and emotional barriers between the people on-screen and the people in the audience. And more often than not, that approach works, and works in a very powerful way.<br><br>Finally, I thought the performances, without exception, were utterly devastating and mind-blowing. I don't know what Jia does to his actors to get performances of that caliber, but whatever it is, he needs to keep it up. I think this is an excellent companion-piece to \"Still Life\", and a beautiful addition to his body of work. Masterful.","user":"jasoneckelman","rank":[25,28]},{"title":"Living For The City","rating":6,"date":"9 May 2010","review":"Zhang Ke Jai has(at least to me) grown substantially since \"The World\", able to leave some of the melodrama behind and let his characters and the landscapes speak for themselves. \"24 City\" is a beautiful film, both relevant and moving in the ways \"Up In The Air\" wishes it were.<br><br>A factory in Chengdu, China that has been in operation for generations is being closed down to make room for a upscale high rise apartment building called \"24 City\" ironically named after a poem about harmony. We follow a series of interviews with former factory workers about their lives in and around the factory.Some of the interviews could have been shortened or illustrated visually instead of having us just watching talking heads speaking over silence, but that is my personal preference.<br><br>It could be argued, by not re-creating their lives Jai gives his subjects a sense of dignity, and creates an intimacy between them and the viewer that would be otherwise lost. For the most part I would agree, though in honesty, I did get anxious more than a few times during some of these discussions. Jai's subjects at first seemed to be almost rambling inconsequentially, but as the film goes on, their statements become enmeshed in each other and the film as a whole, and intricately articulate how the factory for generations was their entire world, romantically, socially, philosophically, and culturally.<br><br>Some of the workers had their first fights there, their first loves, some moved their whole families on the promise of work, while others left their families behind, and suddenly this community which has sustained them all this time has disappeared, moved by forces beyond their control. Part of the film is documentary, but some of the interviews are \"fictional\" and feature actors.<br><br>I had trouble telling the difference between those who were actors and who were actual workers, but the mixture between the authentic and the dramatic only serves to highlight the contrast between the promise of worker's solidarity and justice and the realities of changing economic priorities. Jai's \"The World\" offered us the best metaphor for the globalized melancholic that I've yet to see, that of an amusement park masquerading as the greatest architectural achievements of humanity, while those who toil in it are increasingly alienated from any sense of \"authentic\" culture, themselves, and each other. That film itself, however was not as compelling as it's ideas.<br><br>In many ways \"24 City\" and so I am told Jai's similar, \"Still Life\" continue this series on the changing face of China, and the \"real\" people caught up in this global gentrification. What made me look at \"24 City\" as something other than just a clever polemic was a baffling scene of a girl skating to a soft, bubbly, trance like electronic song. The girl skates in circles, and the music plays and we just observe her, and the song continues, as the camera floats off looking across the city and the mammoth building rising up into the skyline. I don't know what if any purpose this scene had to the rest of the film, but it was lovely. Equally startling were the huge crowds of workers, by the hundreds in the film's first scenes, that are as overwhelming as the CG throngs of countless soldiers and orcs from \"The Lord Of The Rings\" epic battle-scapes. In those moments Zhang makes his cinematic eye, rival and better his(at least for me)binding interest in social realism.<br><br>Realism especially of the socially progressive variety is not my cup of tea (to put a borderline pathological aversion mildly), but \"24 City\" made, if not a believer, than a fascinated viewer out of me. If globalization has to be \"hot button\" of contemporary art, if there must be sad-sack post-modernist which stylistically bite the hands that feed them, if the classical Marxist themes of alienation, class, and gentrification must persist on into the next decade, we could all do worse than to see them filtered through Zhang's warm humanism (another term I would usually avoid).<br><br>It's not a thrill a minute, and there is no George Clooney smirking to enjoy, but \"24 City\" is rewarding, intimate, and oddly sensual, which few politicized movies, and even fewer documentaries, seem capable of doing these days. This is the first Jai I enjoyed, and makes me interested to visit the rest of the oeuvre.","user":"loganx-2","rank":[7,7]},{"title":"Jia Zhang-ke looks at factory life in China","rating":8,"date":"25 September 2008","review":"Jia's latest feature doesn't reach out and grab you; rather it builds up a steady accumulation of detail in an artful and partly fictionalized documentary whose central concern is the transition from a planned economy to a market economy in China, with the Cultural Revolution along the way. Jia decided to use actors to play \"real\" \"documentary\" talking heads--people who worked at a certain factory now dismantled to become a five-star hotel--or their children, one of them, Su Na (Zhao Tao) working as a \"shopper,\" making good money traveling to other countries and buying expensive goods for rich clients who want to spend but are too lazy to do so. This woman, who wept when she visited her mother in the factory for the first time and saw her numbing job, is the opposite extreme from the aging, now dim-witted \"master\" of the factory in its early days who worked seven days a week, and used the same tool till it wore down to nothing so as not to waste. The shift in China from the self-effacing collectivist mentality to the current entrepreneurial capitalism is so great that you can imagine why Jia takes refuge in still tableaux of people, composites, and a gallery of talking heads. But this is not as stimulating a film as earlier works like Platform, Unknown Pleasures, The World, or Still Life and will appeal only to the patient.<br><br>Actors are used for some of the people because Jia interviewed 130 people and had to create composites. Jia sees no problem in making use of fiction this way in telling fact: life as he sees it is a mixture of historical fact and imagination. He uses poems by classical poets including the Dream of the Red Chamber and William Butler Yeats as well as songs, including \"The Internationale\" sung by a group of oldsters, pop music, a Japanese classical composer, and contemporary music by a Taiwanese composer. Sometimes the camera is still as a person speaks. Sometimes one person or a group look silently into the camera for a minute or so.<br><br>The film, understandably, tells a tale of repression. It also witnesses people who were laid off in the 90's and suffered the lowering of an already frugal lifestyle.<br><br>There are strange stories. One woman describes being on a company trip when she and her husband lost their little boy. It was wartime and they felt obligated to go back on the boat to return to work, and they never saw their child again. An attractive woman known as \"Little Flower\" was the prettiest girl at the factory and when the photo of an unidentified handsome and athletic young man appeared on a bulletin board everyone told her he should become her husband. Silly as this was she began to dream of it--but then they were called together and told he was a pilot whose plane had crashed so he had died due to the malfunction of parts they had made at the factory. They were meant to feel guilty. A woman for years helped her sister in the country by sending clothes and other things to be recycled for her children. More recently she was laid off and became so strapped she had to rely on her \"poor\" country sister to help her out.<br><br>The focus is on the 420 Factory, which was founded in Chengdu, the capital of Sechuan, in the late 50's to produce airplane engines. In early days its function was secret and workers, shipped there from all over the country, lived in virtual isolation; kids got into fights if they tangled with the locals, one man recounts. Later 420 was retooled to produce peacetime products such as washing machines.<br><br>Known actors such as Joan Chen or Jia regulars such as Zhao Tao and Chen Jianbin work together with unknown crew members to simulate the \"interviews.\" Though Jia's logic in using this method to present composites makes sense, the effect is to undercut the sense of realism. Probably the best thing about the film is the beautifully composed shots of the factory in operation and being dismantled, taken by cinematographers Yu Lik-wai and Wang Yu. While Jia's Still Life was haunting and quietly powerful, Useless seemed inexplicable and lazy. This is somewhere in between the two. Emotionally it has some import, but the mixed genre doesn't entirely work, and the sense of a Brave New World conveyed in Jia's diffuse but interesting The World seems to have given way to adverts for capitalism. Is this so that Jia can work and travel freely and get his films shown at home? The leading Sixth Generation Chinese filmmaker may be slowly morphing into somebody else.","user":"Chris Knipp","rank":[16,22]}]