[{"title":"Underrated. Brilliant, Simple, Real.","rating":9,"date":"2 December 2009","review":"If you are an IMDb addict like myself who has set himself or herself strict guidelines as to the minimum score and/or number of votes, then this movie is one of those films that are underrated. Personally, I broke my rule of a minimum of 7.0 rating due to the fact that Kevin Spacey was in the picture. Very glad I did so. In fact, I am going to cancel all rulings based on this movie alone. <br><br>Before I go on, I must say that it is understandable why the movie is underrated. The movie develops at a slower pace than what the average movie fan is used to and it definitely lacks the suspense moments, action, thrills and so on. However it has so much more to compensate for it. Intricate character development, superb acting, deep and very well though through screenplay and dialogues, makes this movie a brilliant and yet simple unique creation. <br><br>It makes you think about your own lives, the lives of those around you. Everybody has got problems, everyone has got issues, its not just on the big screen. Often, the stories of those around you are far more profound than what you see on the screen. The screenplays and movies have tried nearly every possible scenario, every possible plot. Directors and screenwriters, alike, try to deliver ever more complicated and twisted plots that the movie watchers would be surprised by. This movie strikes all that, it forgets Hollywood and delivers something unique and true to humanity. It brings you down to earth and sheds light into the lives of those around you, on something that happens to a lot of us, everyday. <br><br>As always, Kevin Spacey delivers a top notch performance. This is the movie that you would want to see more than once, maybe it is one of those movies that you would be willing to watch twice… in a row. I believe that there is something to be found in this movie upon each new time that you watch it. It is definitely one of the best movies in the past year or so. Simply brilliant.","user":"NewSkol","rank":[87,116]},{"title":"Shrink is not for the Phatom Menace crowd.","rating":8,"date":"12 December 2009","review":"This movie will not satisfy your endless hunger for  car chases, explosions and over-the-top joke-every-nine-seconds sitcom  dialog.  Shrink is a subtly funny drama of depth with real characters in real  pain, each coping in their own way. The directing is perfect. This  picture called for downplayed artistry...and that's exactly what Jonas  Pate delivered. He knew well enough to keep this film grounded and let  the characters breathe.  And speaking of the characters; they were all beautifully written and  performed. I really wasn't familiar with most of the cast...but I felt  they all did their character's justice. Spacey wasn't the only one that  brought his A-game to the set.  Shrink is not a bundle of excitement. It's a beautiful, touching movie  that will be enjoyed by any adult with a taste for quality drama.","user":"RonniBrant","rank":[40,60]},{"title":"Great movie, bad directing?","rating":7,"date":"19 November 2012","review":"I just caught this quirky movie on Netflix. Yet another exploration of the ennui that surrounds celebrity status, this is a great little gem that showcases Spacey's talents well. It came very close to being great, but stopped short, I suspect because of bad decisions in direction and editing. Characters were brought in (Robin Williams being one) for side stories which never quite connected to the main plot. Pot addiction is shown as a series of untimely naps, which is not realistic. The audience never gets a glimpse into the main character's despair, or the circumstances surrounding his wife's death. A love interest is developed and then never followed through. Characters walk in and out of the story without strong reasons. The ending is trite, as if they just needed to wrap it up. Too many loose ends, and a waste of some good talent. Nonetheless, because of Spacey (and a nod to the well-developed friendship with his drug dealer, that was fun to watch) I hung in there happily right to the end.","user":"lorriebeauchamp","rank":[13,17]}]