[{"title":"Acting which goes through the canvas","rating":8,"date":"12 July 2010","review":"James Nesbitt and Liam Neeson are making this film a great and heartfelt story of reconciliation, as well as telling about reasons for both hatred and acts of terrorism.<br><br>All this in one film is difficult enough, and this is all made in 80 minutes. Liam Neeson is of course the one getting the prizes, but actually this is Oscar-material by James Nesbitt. So strong, it actually seems impossible that he can have a life beside it all. He's done well, but is still nagged by what he saw as eleven.<br><br>The story is about an 11 year old Joe (Nesbitt) watching his brother being assassinated by a 17 year old Protestant youngster (Neeson) wanting to be a terrorist during the civil war in Norther Ireland. 35 years later it's time to settle what has ruined the lives of both of them. They are not living, but merely existing, and not a day goes without being haunted by this killing.<br><br>The film is intense, and several times you wonder where it'll end. For some the end might not be what they ask for, but I think it makes the story strong. However - it's not the end that makes this movie, it's the ideas and the acting. Also some of the filming is superb, and is recognizable also for director Oliver Hirschbiegel and his work on Der Untergang (Downfall) describing the last days of Hitler. Very impressive from the whole team!","user":"OJT","rank":[16,16]},{"title":"My five minutes of heaven, how can that not be good for me?","rating":8,"date":"27 June 2009","review":"An estimated 3720 people were killed as a result of the conflict in Northern Ireland.<br><br>This film is a fiction inspired by two men who bear the legacy of one of those killings.......<br><br>That is the opening salvo from the makers of Five Minutes of Heaven, I would personally like to add, since no other reviewer here has said it thus far, that the two protagonists never met in real life.<br><br>Five Minutes of Heaven was first screened at the Sundance festival in 2009 and won awards for Directing {Oliver Hirschbiegel} and for screen writing {Guy Hibbert}. It stars Liam Neeson as Alistair Little and James Nesbitt as Joe Griffen. The story is about how a young wannabe hero of the Ulster Volunteer Force {Little} gunned down the brother of Joe Griffen {Nesbitt}, purely because he was of Catholic religion, all witnessed by young soccer ball kicking Joe out on the pavement in front of the Griffen house. After the build up and execution of the crime, we forward to the future after Little has served 12 years prison for the murder, and here we now have a television company led meeting between the two after the Good Friday Peace Agreement.<br><br>It's only now that the film really kicks in as a powerful piece that has something to say. Too many third rate productions caricature their characters in films involving the British/Irish troubles, but the makers here are keen to avoid that-hence the appearance of Neeson, who wouldn't have come cheap one feels. Both Nesbitt {ranking along side George Best as most talented thing to come out of Northern Ireland} and Neeson then shift gears to ram home the point of the story. This is about forgiveness, pertinent questions about if that is possible under the most trying of circumstances. Would you be able to move on? And at what cost? Both sides of the coin are deftly rubbed by Hirschbiegel and his terrific cast.<br><br>It would be stupid of me to not say the piece has problems since it clearly isn't perfect. Both sides of the families involved are not formed at all, and that is without a doubt a very big misstep. Probably a victim of course of the TV movie production value and the sadly inept running time afforded it. But that annoyance aside, and in the context of the final product.....well it works out rather well I feel. There's some smart points of reference in there, note the young Little handling his gun amongst a sea of childhood toys, while there's a dolly out shot involving a church that nails that particular scene with maximum poignancy. But really, as is normally the way in this type of production, it lives or dies by its ending, and the question is answered as to if the actors involved have involved us enough to actually carry it off?<br><br>We are OK here, because we got Nesbitt and Neeson, point made, acted accordingly, yep, see this if you can. 8/10","user":"hitchcockthelegend","rank":[56,63]},{"title":"It Lives Long After","rating":9,"date":"13 October 2010","review":"I really had a hard time knowing what to make of this film. The opening is striking as a group of young Irish men plot the killing of another because you have to do something in the hornet's nest they are living in. Not only do they accomplish the killing, they destroy the life of a boy, the victim's brother, who witnessed everything. The most unfortunate thing is that this boy is blamed by his mother for not doing something to stop things. It then moves many years in the future. The two men are to meet on a kind of talk show. Incredible tension builds as the killer (played by Liam Neeson) gives some testimony and awaits the man whose life he pretty much destroyed. The outstanding thing about this film that there are no sides. As Neeson's character said, at the time he was proud. He went to bars and was hailed as a hero. He also knows that there is no forgiveness, no sorrow that can change anything. We await their confrontation. I will not comment on the events that follow. Suffice it to say that they are extremely intense and, I thought, satisfying.","user":"Hitchcoc","rank":[14,14]}]