[{"title":"An absolute turd.","rating":8,"date":"16 March 2019","review":"Why did I give it an 8. I watched it stoned. You gotta love John and will.","user":"rodgerheise","rank":[375,503]},{"title":"Incredibly lazy, as a comedy and a film in general","rating":1,"date":"15 July 2019","review":"I honestly don't hate Reilly or Ferrell. I've seen both of them do fantastic jobs with decent scripts. This film...does not have one of those.<br><br>Holmes and Watson could have been great - after all, the Sherlock Holmes character, being such a cultural icon, is ripe for parody. But this movie does NOTHING with its premise. In fact, most of the script could just have been copy-pasted from your standard brainless buddy comedy set in modern America, with barely any changes.<br><br>For one thing, the film has barely any plot - instead, the titular characters simply stumble from one scene to the next, encountering various people of no real consequence (even Moriarty - played by the fantastic Ralph Finnes, a casting choice that would have been so much better in a serious adaptation - is barely in the movie and feels like an afterthought). And sure, not every comedy needs a strong plot; but when you're making a film about Sherlock Holmes, whose very character is built on strong murder mystery plots, you need to at least ATTEMPT to give your parody something of a story.<br><br>And for another, the jokes are just painful. As mentioned, most of them barely relate to the Sherlock Holmes character at all - they're just standard slapstick jokes transplanted into a Victorian setting, with barely any changes; or else painful attempts at being \"topical\" that'll feel horrendously outdated in a few months. The film makes no real effort to satirise the Holmes character - in fact, it never makes us feel like we're watching Sherlock Holmes or John Watson on the screen at all. Instead, we just feel like we're watching Will Ferrell and John C Reilly faffing around in costumes and putting on dumb accents, and the film never tries to convince us otherwise.<br><br>It's just low-effort tripe beginning to end. Modern comedy feels like a cesspit sometimes.","user":"PhelixRoth","rank":[79,101]},{"title":"Devastatingly horrific","rating":1,"date":"27 December 2018","review":"I admit, the reviews here at the IMDB inspired me to see this movie without exactly going to the theater, and check it out. I love \"so bad it's good\" movies, and when I come across a \"so bad it's just bad\" film, I like to see for myself just how bad.<br><br>Well, this is bad.<br><br>Did I say bad? I meant, unfathomably bad, as in you simply will not believe how incomprehensibly dreadful this utter garbage is. So void of any humor, wit, charm, heart, or talent whatsoever, if you actually pay money to see this craparama, you will most likely be enraged....at yourself, for taking a chance on this anyway, despite these reviews, and wasting good cash.<br><br>This is a film of immeasurable ineptitude. And I won't even discuss Will Ferrell too much - never have I seen any human being in my entire life as incredibly unfunny as he is in this movie. I'll leave that at that.<br><br>Whether for yourself, or as a couple, or as a family, there are infinitely more choices to spend that money on than seeing this. If you still want to see this, I suggest you either burn the money in the oven or toss in down the toilet and then go to sleep, because that's easier than going to see this film, with the same result. (Incidentally, I actually made it just halfway through.)<br><br>Maybe the most amazing thing is how this train wreck unbelievably passed through every step to actually have a theatrical release, and in almost three thousand theaters no less. You must, and I mean must, take heed with these reviews and save yourself the torture. This movie is an absolute colossal waste of time and money.","user":"stevenfallonnyc","rank":[795,1]}]