[{"title":"Hawk the Stoner.","rating":8,"date":"28 August 2011","review":"I watched this on DVD last night, shamefully because of what i had heard around the time of its cinema release. Well that taught me a lesson.<br><br>The only accountable reason i can arrive at for all the negative feedback i heard from critics and the public is that i feel they were expecting something a little more Holy Grail, because of the setting and the English accents and instead i felt this is more Blazing Saddles, very un-pc, whilst gently goosing (oo-er) its chosen genre.<br><br>It is immature and crude, but the laughs were consistent enough, its a comedy notion which would usually have a B grade budget, but has somehow been made with an A grade budget and for me that was part of its charm. Its like the slackers broke into the set of Lord of the Rings and mucked about all weekend and managed to film it.<br><br>Maybe i did the right thing in retrospect, sometimes its better to watch something after the dust has settled, just watch this cold and i'll bet you'd enjoy it. In years to come i think this film will have quite a loyal following, across a certain demographic, including me.","user":"janus-20","rank":[152,201]},{"title":"Well, it's an original spin...","rating":14,"date":"14 November 2012","review":"They say that there is no such thing as a bad idea for a movie, just bad executions of ideas. I was open to the idea behind \"Your Highness\" - after all the spin on this sword and sorcery world - mixing stoner and frat boy humor into this pot is an original one. All I was asking that the movie be funny doing this. Sadly, the movie isn't that funny at all. Stoner and frat boy humor can be funny, but all this dumb humor has to be executed with some intelligence to work. But the filmmakers of this movie seem to be thinking at the level of a brain-dead adolescent. The movie thinks that simply spouting off curse words is hilarious, but it simply isn't. The actors do their best, but the low-level mentality of the entire enterprise ultimately sinks the movie. The best I can say for this failure is that it is seldom boring. Stupid and intelligence-insulting, yes. But not boring.","user":"Wizard-8","rank":[18,21]},{"title":"Funny and uncommon","rating":8,"date":"30 July 2011","review":"Your Highness is so underrated but it's totally comprehensible. The movie is a satire about medieval action and dungeons tales movies, but it's not cheesy as ordinary satires like Scary Movie series (among others), it has its own story, with its own characters and originality and plays with clichés all the time, making the characters look pathetic when acting like heroes that needs to complete quests as in a RPG game, a satire that seems much more like Mel Brooks classic titles.<br><br>People are claiming it offensive and aggressive for the extensive use of sexual language and also for some explicit nude scenes. For sure it is, and this negative response from these people is just a reflexion of the puritan hypocrite society we live in, because if you laugh about Eddie Murphy's Nutty Professor farting with his family for about 10 minutes, you aren't able to say that You Highness is offensive or aggressive for its verbal content, first of all because I'm talking about a movie that seems silly and a waste of time, but in reality it is a very intelligent and interesting one, and for sure, one of the funniest movies and the best in its satire genre that I've seen since... once upon a time.<br><br>It's pure entertainment, the dialogs are sometimes taken from a porn movie. The acting is great. James Franco, as Fabious, the charming prince, is fantastic, always happy, empowering and in love, making his character seems that was taken from a fairytale, even his movements and expressions are totally inspired by everything a charming prince means and does. Danny McBride, as Thadeous, is completely the opposite, the real anti-hero image, full of envy, anger, hate and jealousy, searching and making everything just to satisfy his very own ego. And every character is ridiculous as it should be.<br><br>Also the movie is full of action and special effects. Screenwriters Danny McBride and Ben Best did an excellent job together creating an uncommon tale based on mythologies and sex into a medieval and puritan world, that's why is so funny, because you never expect so serious characters talking about sex and genitals like something simple and ordinary. Like another one said, it's not a movie for those who are easily offended, but for the ones who might get its tone, will love it.","user":"mirwais-orbit","rank":[151,219]}]