[{"title":"Real Love and Fate","rating":5,"date":"17 April 2010","review":"In a small town in the countryside, the teenager Amy (Ginny Weirick) is overprotected by her widower father John (Chris Mulkey). When she meets the newcomer mechanic Dan (Chris Divecchio), they immediately fall in love for each other. Dan discloses to her that he was cursed when he was a child and turns into a werewolf in the full moon. Meanwhile the local sheriff Sam (Maria Conchita Alonso) is investigating the slaughter of people in bloodshed and the murder of several animals in the farm of Crazy Louis (Sid Haig) apparently by a wolf. Out of the blue, the outsider sheriff Charles Thibodeaux (Billy Drago) arrives in her office and tells that the responsible for the deaths is the mean Bender (Max Ryan), who killed Dan's mother and his wife among other victims many years ago. Bender calls Thibodeaux in the sheriff's office telling that he had abducted Amy and scheduling an encounter in the city ruins with his old enemy; Dan, John, Sam, Louis and Thibodeaux head to the spot for a final confrontation to end the curse. <br><br>The low budget \"Dark Moon Rising\" is a reasonable movie about werewolf and with improvements could be better and better. The special effects are decent and the plot avoids the usual clichés. However, there are some flaws and mistakes, like for example: (1) Maria Conchita Alonso is totally miscast in the role of a sheriff, with clumsy movements with the guns. The story would work much better swapping Chris Mulkey in the role of the sheriff and Maria Conchita Alonso in the role of Amy's overprotective mother. (2) There are stupid lines, like for example when John asks Amy about the bruises in her face; she should have answered that Dan had protected her instead of the silly argument with her father. (3) The last showdown is ridiculous, since Thibodeaux should have advised the group that only silver bullet could stop Bender. (4) Also in the final confrontation, Dan was the first to convert in werewolf, but he does not attack his father that easily kills Thibodeaux and Louis. (5) Last but not the least; the conclusion is ridiculous with Dan drifting in the desert leaving his car with Amy, and the girl putting roses on the road. In accordance with the fortune teller, the curse would end with the death of Bender provided Dan has not tasted human flesh and blood. My vote is five.<br><br>Title (Brazil): \"Lua Negra\" (\"Black Moon\")","user":"claudio_carvalho","rank":[14,18]},{"title":"Well, at least it's better than Twilight...","rating":8,"date":"3 July 2010","review":"Dark Moon Rising / Wolf Moon is a love story... no, it's a story of a reluctant werewolf... no, it's a story of two families coming together... Well, it's a lot of things and not all of them pleasant. First and foremost it's the story of a girl with a single father who happens to fall for the bad boy werewolf drifter and could've ended happily at just that if not for the father's dislike/distrust for the new boyfriend and the fact that the boy's psychopath werewolf father is trying to track him down for a family reunion.<br><br>For what it is, the film is decently acted and the story is moderately compelling. The big bad daddy wolf is a genuine monster and regales us with moderate gore, besides being a somewhat likable villain. The boy and girl are passable actors allowing their scenes to outshine their limited talent. The girl's father and the sheriff feel like something ripped out of a low budget Syfy Original (is there any other kind?) but they're not bad beyond possibly being somewhat derivative. The real flaw, through and through, are the horrendous special effects. The transformations are hokey, corny, and completely devoid of any real passion; the costumes are, well, just so obviously costumes that it ruins any thrill. Compared even to the presumably smaller budgeted Werewolf: The Devil's Hound, the special effects in DMR are flat out lousy and inexcusable especially considering the rest of the movie which is pleasant if not good. It's a shame that they decided to completely shunt the werewolf angle in a werewolf movie but, after all, this film is probably more of a teeny romance than anything else.","user":"Tanuccoon","rank":[11,14]},{"title":"so boring and just stupid","rating":2,"date":"30 April 2015","review":"The movie very boringly details the love between Dan and Amy and the fact that Dan is a werewolf with a demented father. Dan is a werewolf in a really bad, wolfman inspired costume. Dan's dad is evil. He kills women constantly just for fun. Dan's dad is coming after him and killing people along the way. Dan has to protect his girlfriend, blah blah blah. Meanwhile, livestock is being killed, by Dan, and the sheriff, aka Maria Conchita Alonzo, who can barely speak any of her lines clearly, bumbles around like an idiot. Even after discovering the existence of werewolves and having Bender sexually assault her in a parking lot, she just lays there with her gun in her hand looking shocked. Bender walks away very slowly, stands and poses, taunts her and, instead of ending the whole thing by putting a well deserved bullet through his head, she just stares, wide eyed, after making sure the safety is on so the gun won't misfire. Amy's dad is angry at the world, constantly trying to fight with everyone, knocking his daughter around, threatening Dan multiple times with his fists and a gun, just out of control aggressive, except towards Bender. In the 'final showdown', which was slow and boring as heck, everyone has a clear shot at Bender, who stands and poses yet again in front of a group of people with guns, and they all just stand there until he finally jumps down behind cover, after five minutes of standing there making idle threats. Then, instead of remaining in a group, everyone splits up, going in a different direction than the one the bad guy went. The folks take some shots at him, firing a ridiculous amount of ammo without reloading a single time. Amy keeps running in circles, literally, in circles, always coming right back to where a protector just told her to run away from. She is constantly popping up in front of Bender, like she's drunk and can't figure out how to run in a straight line. The ending was dumb. Dan walks away, after dropping his shirt because, hey, who needs a shirt when you're walking off into the desert for whatever odd reason. He leaves Amy his car, which she gets out of looking like a female Dan, in a black wifebeater, jeans and a thick black belt with a big buckle. She puts flowers on the road and smiles when she hears a wolf howl. I thought maybe the movie would pick up and show some action sometime in the two hour running time, however, it just kept dragging from one boring, yawn inducing scene to the next, paying way too much attention to the amy's dad's paranoid ramblings and rantings and starlit dates with the sheriff. Then there's be ten seconds of action. Dan's dad kills someone after there's a gratuitous showing of breasts. Then another long twenty minutes of Dan and Amy vowing their love for one another. More ramblings from Amy's dad. More incoherent lines from the sheriff while she drinks tequila on the job and then drives around. Dan's dad kills some hooks after another gratuitous breasts shot. More rambling. A new character pops in and rambles on for ten minutes about his history with Bender, who he discovered was a serial killer. More rambling. Dan turns into a werewolf. Rambling, love, paranoid dad, Bender kills someone, a fortune teller gives Dan some info, love love, rambling, don't shoot the werewolf that's right in front of you, aren't the stars pretty, oh look, a werewolf, let's not shoot him and discuss being paranoid instead. oh, and don't shoot the werewolf, we're going to milk this run time!! The movies was longer and more rambling than this review, which is saying something.","user":"sabrina_makela","rank":[3,3]}]