[{"title":"The Most Sensational, Inspirational, Celebrational, Muppetational","rating":10,"date":"23 November 2011","review":"The Muppets is essentially flawless. I know this is a weird way to start a review, but I feel I should just forego formalities and cut to the chase. This year has been a fairly disappointing year for movies, but The Muppets just about makes up for it all by itself. It's an absolutely life-affirming tribute to beloved characters and memories that should have never been allowed to fade into obscurity, and if you care at all about movies you need to see this, as soon as possible. <br><br>Jason Segel, along with co-writer Nicholas Stoller and director James Bobin have made a film that is just absolutely bursting at the seams with affection towards the Muppets, and that love and passion has instantly rocketed this movie to the very top of the list when it comes to long history of Muppet shows, movies, and even viral videos. The film is one of the funniest movies I've seen in a long time and accomplishes this without being crass or cynical; it's smart, witty, and most importantly, completely heartfelt. Jason Segel with his obvious and undying love for the Muppets is, by all accounts, the most deserving person to be given creative control of the Muppets since Jim Henson himself. <br><br>The original Muppet Movie will always be a timeless classic, and it's charm and legacy will likely never be topped by another Muppet movie. However, The Muppets is the closest it has ever come, and, due to the timeliness and poignancy of the story, I would argue that right at this moment it is more relevant and moving than even the 1979 classic. I was unable to stop smiling during the entire running time of the movie, even while tears were coming to my eyes. <br><br>I know I'm not really reviewing the movie right now, and I'm more just beaming about how much I loved it, but really, I feel it would be a disservice to go into details about this movie. Simply put, you need to see it, and if you don't you're robbing yourself of a truly extraordinary film experience. This is the most sensational, inspirational, celebrational, Muppetational movie of the year. Go see it. Right now. I mean it, go buy tickets for this weekend, and you can thank me later. <br><br>A+","user":"IllusionOfLife","rank":[122,182]},{"title":"A loving take on the Muppets","rating":26,"date":"26 November 2011","review":"There are very few of us twenty-somethings who grew up without the Muppets. Between Sesame Street, Muppet Show reruns, and videocassettes of the various Muppet movies, we saw these guys all the time. We even had one or two theatrical releases of our own during the '90s. (My personal favorite of those is The Muppet Christmas Carol, which is still annual holiday viewing.) In recent years, since the very underwhelming Muppets from Space, we've seen them pop up now and again, mostly in similarly underwhelming TV projects and in short (yet hilarious!) YouTube videos. I am quite happy to say that, in this newest movie, the Muppets are back in a big way! <br><br>The movie starts by introducing us to a new Muppet, Walter, and his strangely human brother Gary. Gary has planned a trip with his girlfriend, Mary, to Los Angeles, and he is taking Walter along to visit the home of his heroes, Muppet Studios. They find the studio to be in disrepair, and hear of an evil plot to destroy it. Can the Muppets, and everything we hold dear about them, be saved? To get my one complaint out of the way, I do feel that this movie was a bit rushed in places. I wanted more time with these awesome characters, and it did feel as if they were trying to get from one place to the next a bit too quickly.<br><br>That said, I spent nearly the entire movie with a smile on my face. These are the Muppets that I grew up with, doing what they are best at doing, with that gently edgy humor at which they have always excelled. While there are some moments that are very touching, it is mostly very funny, with lots of nods to The Muppet Show and The Muppet Movie. While new little Muppet fans should enjoy this, it will be much more meaningful to those who have a history with Kermit and Co.<br><br>Clearly made with love for Jim Henson and his creations of fur and felt, The Muppets is the most delightful movie I've seen in theaters this year.","user":"sngbrd39","rank":[57,82]},{"title":"Muppet of a man","rating":7,"date":"27 February 2012","review":"I must admit, I usually write reviews when i am angry, however in this case, I am writing this review because of pure love for the movie.<br><br>I went to this movie expecting few laughs and an enjoyable night. My expectations were met and more. the songs were great, the plot was classic Hollywood plot but they made fun of it so it didn't bother me at all. I laughed at all the jokes without exception. I didn't know the whole cast so the surprise appearances affected me emotionally. <br><br>most importantly, I felt that the people who are doing that movie didn't acted on that movie for the money, for the box office or for the fame, they did it for pure love for the Muppet's(most of them anyways) and I felt that. I was asking my self why I loved this movie? and this is was the answer I got. As long as these kinds of movies being made, there is still hope for Hollywood.","user":"uwa","rank":[5,5]}]