[{"title":"Awesome","rating":10,"date":"3 November 2009","review":"I don't really like to post comments but I am felt really moved by this movie. My 3 year old girl has recently been asking \"can we watch a movie that doesn't have a bad guy in it?\". This can be done, but not without some effort. And not with the wit and pace of this movie. She loves this movie for the adventure. I love it for the message. This DVD offers a lot of discussion points for she and I to talk about how to treat your friends. I'm happy she doesn't have to feel intimidated by any \"bad guy\". I'm also happy I don't have to feel beat over the head by another message movie like Wall-e. I look forward to the next installment of the series. I'll buy it the day it comes out.","user":"derelict87","rank":[14,19]},{"title":"Nice and entertaining","rating":8,"date":"30 October 2009","review":"I don't understand the low rating (4.9) up to date. I really liked it, not to mention my 3yo daughter. I was really curious to see the sequel after TB1 was highly satisfactory for the whole family. I watched it about a couple of dozen times with the little one. Now this new DVD would experience the hard times the first one did until now... but I grabbed it to our NMT and put the media to safety. I can nothing but recommend it. Really nice animation, eye candy from the beginning to the end, nice story, nice message. Most of the characters from the first TB got just marginal appearances, on the other way others were promoted. This one was more about Tink, less about interaction between the fairies like in the first one, but imo the movie did not suffer because of that. All in all - 8/10","user":"judecas","rank":[12,16]},{"title":"Unexpected Gem of a Real Movie","rating":9,"date":"21 May 2010","review":"I second what most of these reviews seem to say.<br><br>Surprisingly great movie. Watched it with my 4 year old daughter expecting another god-awful kids movie that unquestionably scars their subconscious in some way I haven't even thought of. Instead, found myself enjoying the hero quest - as much as if I were watching Visionquest with Fiorentino.<br><br>A real movie, stunningly unexpected given the lameness of its progenitor.<br><br>I am amazed this has not received more attention. It's definitely and outlier in the genre.","user":"gyorgy_ligeti","rank":[8,10]}]