[{"title":"Despite being about the electric guitar, this film end up talking about the love for music and the desire to share this passion with the world.","rating":7,"date":"6 October 2009","review":"I suppose I'm a little biased when it comes to talking about documentaries about music, more so when it comes to documentaries about rock. I am just a complete sucker for them. I love rock + I love cinema = I love \"rockumentaries\" – even when is not a masterpiece. So it was pretty obvious that I was going to love It Might Get Loud (Davis Guggenheim, 2008). And I did. I did even though the way the film is put together –divided in chapters – doesn't really work for me and despite the fact that I think it doesn't go deep in the subjects that matter the most nor shows the relationship built between the three characters right until the end and very briefly.<br><br>Anyway, I did love it and here is why: The official synopsis is \"A documentary on the electric guitar from the point of view of three significant rock musicians: the Edge, Jimmy Page and Jack White\". I know, I KNOW. The choice of the characters is controversial. Besides Jimmy Page, who is unanimity, The Edge and Jack White are not the guitarist that come to mind when most people think about the greatest of their kind - which you sort of expect and want when you think about a documentary about the electric guitar. But I liked the choices, they are bold and you have to bear in mind that Jimmy Page is the executive producer, so they were pretty much his choices. Then, like the synopsis points out, this is more about different perspectives and it is not about great guitarist, but about the guitar. So, the Edge and Jack White end up being perfect. Their approach to the guitar couldn't be more different.<br><br>Jack White is more of a purist. He likes the basic sounds of the guitars, he doesn't mess with it that much. He doesn't even really care if the guitar is broken or out of tune. Right at the other corner, creating an opposition, there is The Edge. He loooves the special effects, distortions, pedals and everything else that technology can do to the sound of a guitar. Finally, in the middle, balancing things out, you find one of the Gods: Jimmy Page (who I don't think needs any sort of introduction even to people who don't like rock). And it all works. It works not only because the script is neatly put together, weighing and balancing the differences, but because somewhere around the beginning of the film something becomes very clear: despite being about the guitar and despite being very different men from different times of the rock history, they share their love for music and their desire to change the world through it. So, the film becomes much more about music and passion and there is no way you can be immune and dislike it.","user":"elisachristophe","rank":[31,31]},{"title":"Total commitment  It Might Get Loud","rating":8,"date":"29 September 2009","review":"It Might Get Loud, a documentary about the beginnings of three prolific guitarists and how they use their instrument—Jimmy Page, The Edge, and Jack White—won me over and finally showed me that attraction people have to rock 'n roll. These dudes are badass. Directed by Davis Guggenheim, he of The Inconvenient Truth as well as a slew of great television show credits, the story not only uses historical footage and interviews with the trio separately, but also puts them in the same room, with a plethora of their own axes, to converse, both verbally and rhythmically. Watching them play a song together is a real treat, seeing the pure joy they have of making music, catching a glimpse at the boyish wonder they have for each other, constantly looking to see what the others are doing, and comparing their styles. Page has not lost a step as he grooves and moves the entire time he is playing, lips pursing and expanding, the music taking control of his body; The Edge is the consummate professional, stoic concentration, standing straight and playing with determination; and White sits or stands casually and at ease, the guitar high and close, showing a bluegrass feel just like his voice and chords.<br><br>You may be wondering—as I did before going in too—what White is doing in this mix. Page produced the film, he got the group together to play, and so he must have seen something in the youngster. Maybe he needed juxtaposition with The Edge, a stripped down raw sound against the U2 man's heavy use of effects and computers, (when you hear the actual chords he plays without the digital enhancements, you won't believe it). Either way, it does not take long to see that the driving force of The White Stripes, The Raconteurs, and The Dead Weather belongs. The film does open up to him making a guitar out of a Coke bottle, plank of wood, and a single string after all. Who needs to buy a guitar? And his knowledge of the craft is extensive, with a childhood story that goes against odds to have gotten to the point he is at today. The youngest of ten children, never wanting to play the guitar, apprenticing at an upholstery shop, and having to force his sister to go on stage with him for their first gig, it all began with the exposure to a song by Son House, his favorite piece of music still to this day.<br><br>We know about Page and his days in the Yardbirds before Led Zeppelin. Heck, some may even know he was a session guitarist before that, playing on anything that came his way before finally needing to get out and create his own sound, to use a loud crescendo without recourse. However, did you know that The Edge would never have met Bono and company, U2 may never have been, if not for a flyer on his school's cork board looking to start a band? The foursome from Ireland were, admittedly, not that good at the start, but they continued on, finding their voice and politics as the years went. Only when Bono told him to take some time off and experiment by himself did he discover he could write. One may think these superpowers of rock music just got together and the rest was history, but no, they all had their \"breastfeeding\" moments, as captioned in the movie, instances where they had to work and keep going. It's a world based on hard work, no matter what your occupation, to resonate and reach the masses means earning it.<br><br>No matter how enthralling the background stories and early footage of the three—through video, stills, whatever they had available to share—it is the electricity seeing the trio together that caught my attention. I'd love to see the unedited reels of just that meeting in January of 2008. What is shown is wonderful, but too brief. Sure, the moments of jamming are wonderful, but the conversations are always cut short. I wanted to see them pick each other's brains. You get a little of that with Page asking The Edge if he was sure the one note was supposed to be a C, or when The Edge relays to the others during the credits that he had been playing the wrong note the whole time they covered a song, but that's just correcting each other and having fun. There had to have been questions like, \"how did you do that?\" or \"how was it doing that?\" or even \"how high were you when you wrote that?\" Maybe the DVD culls some of those moments; it would be well worth the purchase I'm sure.<br><br>It's a rare thing to see artists interviewing artists, or just being in close proximity and watching what occurs. The more straightforward documentary parts are even narrated by them alone; only a few instances bring in an outside source, presumably Guggenheim, to pass on a query. One of the most memorable scenes is just Page in his home library full of vinyl, wall to wall. He takes a 7\" out of its sleeve and puts in on the player so he can show us the power of \"Rumble,\" a rock instrumental by Link Wray. The legend just stands in front of the camera giggling like a little boy, face full of unadulterated joy. He starts to mimic the hand movements, playing air guitar to the song, as he explains the distortion progression as the song continues on. We are experiencing a piece of history filmed live, watching one of the greatest guitarists on the planet show his cards and lift the curtain to what inspired him. And that is what these three men are: inspirations. They touch people young and old, hit them emotionally and create change, either large or small. They are living the dream and looking cool doing it.","user":"jaredmobarak","rank":[36,39]},{"title":"Rock Documentary Classic","rating":9,"date":"27 May 2009","review":"In this film, three of the most prolific guitarists of their times, Jack White, The Edge, and Jimmy Page, are brought together to talk about rock. Although this is the premise of the documentary very little footage of the actual meeting are shown. Instead, the movie is driven by the juxtaposition of interviews and footage of each of the individual artist. The director, Davis Guggeheim (who also directed An Inconvenient Truth) chose the perfect three artists for the movie because they are so distinct from each other not only in their music but in their philosophies.<br><br>Jack White is the most open of all the artists in the movie because he was able to genuinely express his approach. To Jack, music is a struggle, \"You have to pick a fight with the guitar,\" he says. His view was artistically expressed in a scene where Jack is talking about the history of the blues and on the screen footage of Jack playing \"Blue Viens\" in concert so hard his hands are bleeding all over the guitar is contrasted with pictures of historical blues musicians. This modern day blues artist addresses everything from his past to his influences throughout the movie.<br><br>The Edge, in stark contradiction to Jack White's minimalistic style and plastic Airline guitar, is shown through out the movie playing with effects modules and techonologic pedals to produce his U2 stadium rock style. He explains in the movie how it is possible to completely change the sound of the guitar just by utilizing these innovations. He also talked about U2's past and how they started off by playing after school in their elementary school and their early struggles.<br><br>To Jimmy Page, rock is sex. \"The curves of the guitar are like a woman's,\" he says at one point and later on when talking about Stairway to Heaven, \"it just builds and builds like an orgasm.\" It was obvious throughout the movie that Jimmy Page was not accostumed to interviews because it seemed that he struggled with being open. But, this prolific Led Zeppelin guitarist was a key dynamic in the movie because he was able to address his development as an artist in the dawn of rock.<br><br>These three artists were able to capture the history and the essence of rock and ultimately the film is not just about music, but ultimately it is a statement about culture and how music is statement the times and the experiences of each artist.","user":"mannyrsox24","rank":[44,49]}]