[{"title":"Entertaining movie with a great story line!","rating":10,"date":"25 October 2012","review":"To tell you the truth, the whole reason I watched this movie was because Lana Parrilla stars in it. However, as soon as I started watching it, I was hooked! It had an excellent plot, great acting (esp. Lana, of course), and always had you wondering what would happen next. The second half of the movie was especially exciting and had me on the edge of my seat until the very end. And I was very happy with the ending as well! I'm not generally a fan of TV movies, but I definitely recommend this one! The ONLY bad thing about this movie is that it's not more readily available for people to buy. If you're a fan of Lana Parrilla, or enjoy a good drama/mystery/romance, you've got to check this one out.","user":"midnightwolf518","rank":[14,14]},{"title":"Very good, mainly toward end","rating":10,"date":"10 August 2010","review":"The movie starts with Nellie traveling through Montreal in a cab. This I don't really understand because nothing happens that would indicate why things were done this way. Then we see what happened one year earlier. <br><br>Nellie and Dave are splitting up. They still seem to be friends. Dave supports her emotionally when she needs it. But as Nellie gets started on her new life, she discovers she has bad credit. Someone else is using her maiden name Eleanor Kendall. She can't leave her apartment, which she wants to sell, because she has to have good credit to get a new one. For now, she has a business she can sell, but Nellie wants to find out what happened and get her life back.<br><br>The police won't help, but Nellie is quite resourceful and she tracks down enough information to tell her Eleanor is in Montreal.<br><br>Nellie goes to Montreal and checks into a bed and breakfast run by the perfectly lovely Doreen. What a nice personality and pleasant English accent she has.<br><br>Soon, Nellie finds herself sharing the upstairs bath with Christopher, who is in Montreal for a conference of some sort. Christopher is willing to listen and becomes a good friend. Maybe more than a friend.<br><br>Nellie starts her search and happens to discover a coffee place where the waiter has a crush on this beautiful single woman who comes in every day it the same time. For some reason, Nellie suspects this is Eleanor. After investigating, she finds out the woman tutors people in French. So Nellie goes to her and pretends she wants to learn French for travel. And yes, the woman's name is Eleanor Kendall.<br><br>Soon, Nellie and Eleanor are friends. Eleanor has a young daughter Sarah who likes Nellie a lot. Eleanor says Sarah's father died when the girl was very young. Madelaine is the suspicious and psychic Hungarian nanny. The Catholic school (with nuns) where Sarah goes is right next door. And Sarah needs a friend she can speak English with. She seems to speak only French with her mother for some reason.<br><br>The mystery takes some interesting twists, including some that would not be expected in a movie like this. Once the truth comes out (or is it the truth?) things get really exciting. And somewhat violent. The ending is pretty amazing. Well, for me, anyway. The person who claims he or she saw it coming a mile away might not be so impressed.<br><br>I think the leading actors all did a good job. Kathleen McAuliffe, as I said, was a delight as Doreen. Maéva Nadon was adorable as Sarah. <br><br>This movie had a TV-14 rating, though I'm not sure it was justified. The only content indicator was a V, but the violence here wasn't that graphic. I would have said TV-PG with violence and sex. There was more sexual content than actual violence. Still, this movie is probably kind of intense for someone Sarah's age, and maybe that was the concern.<br><br>It was a worthwhile experience.","user":"vchimpanzee","rank":[11,14]},{"title":"The Red Scarf","rating":6,"date":"6 March 2020","review":"\"The Double Life of Eleanor Kendall\" (a.k.a., \"Mistaken\") is a slow burner that focuses on a woman seeking the culprit who has stolen her identity. Nellie Givens (née Kendall) travels to Montreal to confront the perpetrator. But the ninety-minute filmed seemed interminable in finally revealing what motivated the other woman to steal Nellie's identity and her life.<br><br>When Nellie meets her double, she is charmed by a dynamic woman and her young daughter Sarah. Nellie had lost a child in a miscarriage and feels a special bonding with the little girl. She becomes reluctant to report the woman to the police out of genuine human concerns.<br><br>In a subplot that bogs the film down even more, Nellie meets a dashing Englishman staying at her bed and breakfast in Montreal. There was not much chemistry between the two characters. Yet, the film strings out their affair with trips to the lake, a brief swim, and a not-so-torrid bedroom romp.<br><br>Things finally come to a head in the final twenty minutes of the film. Poor \"Julie\" once met Nellie mother at an airport, learned a lot about her, and, Nellie was only one of Julie's victims. She stole other people's identities because she was desperate to safeguard her daughter from a deranged husband. As Nellie was a sucker for a sob story, she bonded with Julie and eventually confronted the psycho husband.<br><br>Despite the good cast, including a stunning performer playing Nellie Givens, the artistic choices never really worked. There was a superstitious old woman from Hungary named Madeleine, who lived with Julie and Sarah and dreamed that the red scarf worn by Nellie portended death to Julie. But the old woman was wrong. The scarf, like so many other gimmicks used in this film, never really captured the viewer's attention.","user":"lavatch","rank":[0,0]}]