[{"title":"Fun Saturday Afternoon Watch","rating":5,"date":"11 January 2010","review":"Despite what another critic wrote, this is not just another wrestler movie filled with wrestler fighting. As a matter of fact, there was very, very little wrestling apparent in this movie, especially compared to other WWE movies. I would NOT hesitate to say that Ted DiBiase Jr. was actually the one redeeming factor in this film, to my own personal surprise. Every other actor and actress in this movie acted, or overacted, as would be predicted in a typical thrown-together WWE action film. Yet, Ted DiBiase spoke and acted in a much more real way that would allow us to believe that we could relate to him and his actions and decisions. Though this film is predictable 99.9% of the time, I actually enjoyed watching it for nothing other than the factor of simple fun and amusement. Don't look for meaning or deep moral values, just pop some popcorn, sit back and enjoy an easygoing, relaxing afternoon with this cool, fun action flick.","user":"programmer04","rank":[20,24]},{"title":"Not bad","rating":5,"date":"19 December 2009","review":"It wasn't too bad even though didn't go into it expecting too much. Dibiase's acting was OK. He didn't have many lines. No worse than the acting in most other action flicks. He wasn't as stiff an actor as John Cena. Enjoyable action flick. Worth a shot. Storyline was what you would expect. Camera work was good. Dibiase did kick some butt. Never saw the original Marine. Even though is part 2 do not believe has anything to do with the original. Should have given it a different title. Dibiase could have a future in this kind of genre after wrestling. The bad guys were pretty bad even though the reason for there actions were a little weak.","user":"orangebellyman","rank":[31,43]},{"title":"Not as bad as it should be","rating":6,"date":"15 January 2010","review":"As much as I like Die-Hard-style action movies, I never go into them expecting a masterpiece. They're usually cheesy, endlessly similar and useful only as an entertaining escapist diversion. This one doesn't break the mold.<br><br>That said, it's not bad. There's some really quite accomplished cinematography on display, and obviously some highly skilled people working on the production. Some of the gun battles are shot in an exciting and dynamic way. The acting varies a little, but nobody lets the side down.<br><br>The fights are good and Ted DiBiase Jr acquits himself well. His role is not colourfully written, he's a run-of-the-mill, vanilla flavoured action hero. In fact, this entire movie is about as unimaginative as they get, presumably having been plotted by a computer that generates the storyline by choosing generic plot points, locations and characters at random.<br><br>So despite the linear nature of the plotting, and the fact that it went a bit wonky in the last 30 minutes, it's worth a bash. Especially if you like to see terrorists get shot, stabbed, punched, impaled, blown up and otherwise molested.<br><br>You'll need to overlook the usual (comparatively) low-budget action movie silliness, and some slightly jarring video effects during one section, but on the whole this is a fairly well made example of the genre. All it needed was a bit of a creative spark at the scripting level to elevate it to seven stars or better.","user":"paul-3555","rank":[14,18]}]