[{"title":"True to the novel","rating":8,"date":"11 February 2017","review":"The Great Gilly Hopkins is a beautiful, touching film that should have gotten more attention. Although a wonderful family film, I would guess it will get seen most in middle school classrooms doing a study on the book, which it follows very closely. It's not without some rough edges- -there is some language and behavior that may not be to every parent's liking, but I appreciated that it made an effort to show how a real person might react in her situation. I will say the book told this story more effectively--several scenes had more impact as written, and I felt a much greater sense of urgency in the final scene of the book than I did watching the film. Even so, I think that it's a story that will hook viewers in and keep them invested right to the end. Without being manipulative or delving into false sentiment, The Great Gilly Hopkins made me care about its characters and had me choked up more than once before it was through.","user":"jfgibson73","rank":[18,23]},{"title":"Good Family Movie","rating":6,"date":"13 October 2016","review":"If you're looking for a movie to watch with your family, then this is the one. The Great Gilly Hopkins is an entertaining family movie for both adults &amp; kids. With its dramatic &amp; funny moments, it teaches the audience the importance of relationships, and what it takes to form a real family. The movie focuses on the life of Gilly Hopkins, a foster kid who's in a journey to find her real family, moving from a foster home to another, in search for her biological mother. That's until she meets her new foster mother, Maime Trotter, then her relationship with people in that community, from family members to teachers &amp; friends, evolves with time into friendship, respect, and compassion. She ends up finding what she was always looking for, after learning that it takes love, esteem, and care to form a real family.<br><br>My only complaint about this movie is that the story lacked depth, and the events were too straightforward. Overall, it was above average. So if you're looking for something entertaining &amp; simple, then this is it.","user":"Salim08","rank":[21,28]},{"title":"Oh well, a teen movie. But I kind of enjoyed it. Weird.","rating":6,"date":"30 November 2016","review":"\"Both of us are smart and we know it. But the thing that brings us closer than intelligence is anger.\"<br><br>Ready for another corny teen drama that'll move you to tears? One that has all the familiar clichés and where you'll know in advance how it will end? It's not a love story with a couple of lovebirds who first can't stand each other and in the end, in a moment of supreme bliss, they fall into each other's arms. It's also not a well-known story about a young criminal who's experiencing a drastic change of identity due to a certain trustworthy person and when he's converted he goes on a mission as a devout priest in poor Africa. No. This time it's a stubborn 12 year old girl (Sophie Nélisse) who changes foster homes one after the other because of her impossible behavior. Gilly Hopkins only has one wish. And that's to be reunited with her natural mother who left her behind while moving to San Francisco.<br><br>Then one day she's assigned to the religious Maime Trotter (Kathy Bates), who's a model of kindness and masquerades as the supreme mother-hen. Gilly does everything to come across as hateful and impossible to handle. She closes herself off, disclaims each friendly treatment, she treats W.E. (Zachary Hernandez) in a denigrating way, imitates in a ridiculing manner Maime's use of affectionate words, makes no effort to integrate and even steals from the nice neighbor Mr. Randolph (Bill Cobbs). In school she tries to keep up this rebellious attitude. The first school day ends already in a fight with six fellow students, she snubs at a young girl (Clare Foley as Agnes) who approached her in a friendly way and she acts aloof during lessons. It seems as if Gilly is trying to provoke with her behavior so everybody gets angry at her.<br><br>You could call her an obnoxious, disrespectful and rebellious teenage girl, to say the least. It amazes me that Kathy Bates hasn't tied her to a bed, pushed some logs under her legs and just like in \"Misery\" amputated her feet with a heavy ax. Despite Gilly's intense efforts to make Maime's (and others) life miserable, you can easily guess how she'll react when her wealthy grandmother Nonie Hopkins (Glenn Close) shows up and suggests to take care of her. That's the decisive moment when the rebellious girl breaks down emotionally and proves that deep down she truly has a human, sensitive heart. For most female viewers this is the right time to search for that handkerchief.<br><br>Although it's clearly a film meant for a youthful audience, I wasn't annoyed by it constantly. The way Gilly tackled the bullies at school was highly amusing. And the used subject about a teenager who wants to be united again with her natural mother (the mother's motivation to leave her, shows that she didn't have real maternal feelings) felt kind of mature. Maybe it was sort of Dickension, but I could live with that. Also, the performances were very worthwhile. Kathy Bates played a brilliant part as the caring foster mother who sees the good in every person. Her love for the outcasts in our society is endless. Therefore the goodness to invite the lonely neighbor to dinner every day. Also a splendid rendition of Bill Cobbs. Finally, Sophie Nélisse who nevertheless delivers a superb performance. Although she doesn't look 12 and isn't really sympathetic due to her behavior. The only thing that struck me was her rather rapid change of personality. The transformation from a rebel to a loving teenager was rather abrupt. \"The Great Gilly Hopkins\" is a perfect family film to watch together with your (older) kids.<br><br>More reviews here : http://bit.ly/1KIdQMT","user":"peterp-450-298716","rank":[11,16]}]