[{"title":"My eyes hurt.","rating":1,"date":"24 March 2009","review":"Lets take a look at the summary..<br><br>Orphaned as a baby when his parents were killed in a vicious orc attack, Kendrick of Elwood was raised by his elder brother, Darius. Though only nine at the time, Darius devoted his life to Kendrick's care and to purging orcs from their land. As Darius grew into a great warrior, he sheltered Kendrick from all possible harm. Now, after years of absence, a new danger emerges, more lethal than the threat of orcs or men. Reports of dragon attacks spread like wildfire through the panicked land. In memory of his mother's prophesies of a mighty Dragon Hunter in their bloodline, Darius leads Kendrick on a perilous journey to the castle of Ocard - the Dragon Hunter training grounds. As they battle through evil men and orc-infested lands, they align with a band of rogue warriors who swear their allegiance in this hazardous quest. The Brothers of Elwood, joined by Raya, an elven princess, Olick, a mute Berserker, and five human mercenaries must escape orc ambushes and dragon attacks to reach the fortress at Ocard. Will dragons completely decimate the countryside? Only the Dragon Hunter will decide! The summary itself is wrong, at no point in the movie is the word \"princess\" even mentioned. The \"mute\" berserker speaks thus hardly making him \"mute\".<br><br>I had no hopes for this movie because I actually enjoy low budget fantasy movies. This movie however can only be summed up by one word \"terribad\". It isn't the plot, it isn't the acting, it isn't the fact the characters have no depth, its the horrible camera work that makes this unwatchable. You can not see any fighting as the camera starts being shaken every time there is a battle, not slightly but to the point where you can not see anything. The ended was...well...wow...that bad. I have nothing else to say.","user":"darkandor","rank":[33,49]},{"title":"What A Ride It Was","rating":1,"date":"27 March 2009","review":"You know when you make it over an hour through a movie and you only have like twenty minutes left, and even though it's awful, you've come this far and just have to finish it? Well, this is not that movie. I was literally five minutes away from the end and couldn't care less. <br><br>The acting was downright pitiful with characters lacking any depth to pull any emotion from anyway. Blame the writing, it was some of the worst you'll see. <br><br>The plot sounded interesting enough in the ultra-nerdy sort of fashion, but rest assured, it falls short here, too. Awful plot. Awful writing. Pitiful direction. <br><br>The continuity was thrown out the window. There are scenes in which a character's beard appears to have gotten a magical trim over the course of a few seconds, until...BAM! It's back!<br><br>The effects are just goofy. The dragon, well, I won't give it away, but it's laughable to say the least. <br><br>Although I gave this only one star, and would probably consider it one of the worst movies I've seen in a long time, it isn't without it's charms. It's charms being that it is so terrible, you'll find yourself chuckling every few moments. The chuckles eventually wear off and you stop caring, at which point you should just turn the movie off.<br><br>All in all, the director/writer/producer in Shimek should be shunned from the fantasy community, hanged for his abomination, and mocked for eternity in his pathetic attempt at a film. This guy is pathetic. Literally something that you would not believe until you see. Yes, it's THAT bad. <br><br>See it for a laugh with buddies over some beers, but I'm sure you won't want to watch more than forty five minutes or so. <br><br>If you plan on watching it for any other reason than mockery, just don't.","user":"hinesgtrservice","rank":[21,33]},{"title":"How does this movie pass to even get on DVD???!!!","rating":29,"date":"29 November 2009","review":"Madness overwhelmed when I saw this movie. Literally! I've seen high school Film Class projects better then this craap!<br><br>No lie here ladies and gents! this is a nothing movie. the plot seems to start then is forgotten. the entire movie was filmed in someones backyard or forest. the castle was someones front porch. the dragon was CGI and was only shown twice. the outside of the castle shots, was just a poster. cheap? no! worst then cheap. this is poverty film. even adult films put more money in their budgets, honestly! this movie was literally in someones backyard!<br><br>Is there anything good to say about this? NO!...I seriously cannot see, understand how anyone can even say anything good about this movie. this is worse then homemade videos. if you enjoyed this movie, im assuming you were drunk or you could have been on some kind of substance.<br><br>Message to the friends of the people who made this film: why did you lie to the makers of this film? you should have been honest with the makers, that this movie freakin suuucked! it is full blown awful.<br><br>notice i gave it zero stars...which zero is too much already because this movie doesn't deserve to be a movie.","user":"kham_phet","rank":[10,16]}]