[{"title":"Muddled Mess Fudges the Horror","rating":3,"date":"23 September 2015","review":"Wind Walkers (2015)  A group of friends venture out into the remote Florida Everglades for  their annual hunting trip. In doing so they have inadvertently upset  the spirit realm and consequently become hunted by an ancient and  rather grumpy curse in the form of 'wind walkers'. Our protagonists are  soldiers, two of which have recently returned from combat abroad.  Whatever it is that the duo have witnessed abroad has had a rather  detrimental effect on one of them Sean Kotz (Zane Holtz). We know this  because Sean is unable to give his girlfriend the quickie she is  gagging for at the back of the store she works at. He is also taking  medication for schizophrenia. Writer/director Russell Friedenberg also  offers up the possibility that Sean may be possessed by the wind  walkers. One thing is certain, Sean is pretty nifty at running and he  does an awful lot of it throughout the film.  Upon reaching the hut, that they intend to use as their base for the  trip, we see a mighty mean storm kicking off however one flashback  later and I was kind of wondering whether the storm had blown over and  wondering what the point of including it momentarily was. Yes I 'get'  the storm represents the spirits expressing their anger with the  hunters so why didn't the wind walkers just keep the storm going so the  hunt would get rained off and never happen?  The group starts distrusting Sean. They question whether Sean 'brought'  something back from his time away serving in the Middle East. It would  appear so from the physical manifestation of the well-miffed entity.  It's also rather difficult to keep with the plotting given that it kind  of jumps all over the place with little in the way of logic almost as  if someone else took over the writing without fully reading what had  come before.  Other critics have been rather generous with their reviewing of Wind  Walkers. They readily admitting that the film's structure is muddled  and weak but give it a good review without justification in their  critique for actually doing so. I've come across situations like this  before where reviews are amended to appease the film-makers or their  marketing company. I can only think that a similar thing has happened  here. It's great for getting punters to rent/buy/view the flick but  it's under false pretences too.  Heavy on mood but rather lacking in a coherent narrative Wind Walkers  is one-note and confused. There's a little bit of Wolfen in the mix and  its sense of paranoia mirrors John Carpenter's The Thing, even with a  nod to the outburst about being tied up. Ultimately Wind Walkers offers  little new and in offering up staid ideas it really needed something  special elsewhere to make this worth sitting through. It doesn't.","user":"bournemouthbear","rank":[10,14]},{"title":"Solid acting with the blend of Native American folklore and current horror movie themes","rating":7,"date":"3 August 2018","review":"While I see this movie getting trashed, unreservedly so, I have watched so many horrendous horror movies I don't even bother to review. However , this movie, part of the After Dark Horrorfest franchise, is a cut above your typical horror movies. Sure there were some flaws but overall a good horror flick / creature feature. It blended Native American folklore and current horror movie themes along with a psychological element . Good gore effects without going over the top to the gratuitous silly category.","user":"gemandeye1","rank":[0,0]},{"title":"Borefest.","rating":3,"date":"3 December 2017","review":"Many of the After Dark Horrorfest movies are not quite what we would expect. Some are really indie, others have horrible and cliché plots and of course some are complete snoozers. <br><br>Sadly, Wind Walkers is a rather boring experience, one that is hard to watch on one single try, and I for one failed it. It took me 3 days to manage to complete it, it was just the perfect movie to fall asleep in front of, only took around 20 minutes and I could barely keep my eyes open. I managed to finish it on my 3rd try by watching it during daytime and even then I had to shake my head a few times. <br><br>It is a slow, very slow burning horror, tries to emphasis too much on a state of confusion without delivering anything in the end. Close to no action, a typical movie once you realize what it's all about and has a great gift in offering sleep! I would never recommend it. Sorry.<br><br>Cheers!","user":"gothic-fiction","rank":[1,2]}]