[{"title":"Don't listen to the critics","rating":7,"date":"19 March 2018","review":"I swear, in this day and age, it seems like the critics look right past the quality films, and ignorantly try to simplify a film into a 1 sentence review. At the time of writing this, Rotten Tomatoes gave this a critic score of 10%. Don't listen to them. This movie isn't excellent, but it is enough to incite a spectrum of emotions in the viewer, and can very easily be considered a decent movie. It is mostly the SJW critics who view this film in a misogynistic light, and attribute the character development of Sidney Hall as the plights of a white (privileged) man. Most of the critics who reviewed this are just mindless snobs who are afraid to say they liked it out of fear that they will be alienated by their fellow critic colleagues. The movie was good. It had some confusing moments with the timeline, slighted development, and predictability, but overall it was a good movie. I personally trust the reviews on IMDB far more than I would trust Rotten Tomatoes. I will never fully understand the mindset of the critics over there. They sometimes will praise a mediocre movie, and bash good or great movie in a bandwagon type fashion. They are 1 of 3 things: a) they are being paid to leave biased reviews, b.) they have horrible taste in movies, or c.) each review is based on a centipede mentality where their opinion categorical agrees with the author prior. Whatever the case, Rotten Tomatoes is a fraud. Trust your peers with reviews, don't listen to the snobs.","user":"phate008","rank":[118,146]},{"title":"Excellent film!!!","rating":8,"date":"20 March 2018","review":"After reading some poor reviews about this film I felt compelled to come to imdb and write a review. I watched this film last night and thought one thing throughout: brilliant. I will not go into too much detail but the way the story unravels is rather unique and the acting is very strong all around. I thoroughly enjoyed the screenplay and cannot remember when a film caught me this off guard. I laughed and even got choked up at parts of this film. It just pulls you in from the get go. It was a great change of pace from the rest of the garbage being released these days.","user":"gregoryrjordan","rank":[66,82]},{"title":"The critics aren't you","rating":10,"date":"25 March 2018","review":"I was blessed with the beautiful opportunity of watching this movie at a festival. I was dazzled by the flow of the story, the subjects, the intertwined destiny of the characters. From my point of opinion I advice you: don't belive that bunch of smug critics. They don't know what they are saying. They are stuck in a era of superheroes, superstars, supershine movies. Make your own destiny. Watch this movie. Watch a movie no matter what the critics say. Do not trust them. Anymore.","user":"hayashida-19343","rank":[101,132]}]