[{"title":"An extremely entertaining dark comedy, Underrated Film!","rating":7,"date":"6 December 2011","review":"I've always been a fan of Luke Wilson, and have preferred his work over Owen's. Middle Men is not your typical Luke Wilson comedy, It's much rather a cross between a Guy Ritchie and Martin Scorsese movie. That's not a bad thing by any means. What Middle Men will do is keep you entertained and engaged from beginning to end. Whether it's Wayne &amp; Buck arguing back and forth, or Jack's ability or lack thereof,of balancing his family life and business.<br><br>The cast is pretty impressive with James Caan and Kevin Pollack also lending their talents. Everyone played their part well especially Giovanni Ribisi's performance as the coke'd up \"Wayne Beering\". His mannerism's and habit's were entertaining. <br><br>Overall I loved this film for what it was, a dark comedy centred around the internet porn industry. The soundtrack is great, which i might add is very \"Scorsese esque\". Loved the use of 2 Pac's California Love =) It's an intelligent film full of dark humour about pornography. My only gripes with Middle Men would be the pacing of the story, i feel if they had a longer runtime it would have flowed through effortlessly. They are minor issues though, they balanced the comedy well with the crime elements of the plot. It should be said that \"Middle Men\" is very underrated, and I would recommend it to fan's of dark humour and pornography, which after watching this movie, is every male living on the planet. Check it out, you won't regret it.","user":"lil_mexx31","rank":[21,22]},{"title":"Seriously how did this movie not get any attention?","rating":27,"date":"27 February 2011","review":"I was skeptical about this film. I know it says it got a theatrical release, but it must've been on only a couple screens.<br><br>If you are thinking about watching this movie, do it. It's wonderful. I gave it 8 out of 10. There was a little too much Voice Over narration, but this was a great story, well acted and well directed. Luke Wilson's never been a great thespian, but here, he's very good. Giovanni Ribisi overacts, but here it works. Gabriel Macht, who I have never liked was great. And Laura Ramsey was gorgeous and great. I could have done without Jacinda Barrett, but hey, that might just be me.<br><br>In a day and age where crap gets 3000 screens (I'm talking to you Season of the witch, drive angry, hall pass, the roommate), it's a shame this was not released wide and could not find an audience.<br><br>To the filmmakers... very well done. To the distributer: you could have done better.","user":"Sweet_and_Lowdown77","rank":[62,72]},{"title":"Beautifully narrated Intelligent film!!","rating":9,"date":"25 July 2011","review":"Aah! It had been a long time since i watched a movie like this one. I heard the name of the film somewhere and i checked it out on IMDb. I felt the plot damn interesting. Its about the guys who started the first pornography web site and the consequences they faced after it. I loved the plot and i downloaded the movie right away.<br><br>This movie is something like \"The Social Network\". I am not comparing it with TSN, i was just telling that this film belongs to that type. It was totally interesting. This movie started off great and it never lost its pace from the beginning to the end. The narration was brilliant. The dialogues were just awesome. All the actors did a great job. I say this is one of the finest films i watched recently.<br><br>This is a great film. I had a great time watching it. This film is not for everyone but still, it is worth giving it a try.","user":"raj504","rank":[28,31]}]