[{"title":"I feel duped and almost as stupid as the movie.","rating":1,"date":"12 May 2015","review":"I cannot believe that I fell for the few good reviews that some gave this movie. Maybe they're drunk, maybe they were stoned, but they sure as well weren't sober if they watched this and think they were good.<br><br>Where do I start. A \"rebel punk\" chick, Chapin (that looks like she came out of a nickelodeon cartoon) attended a \"best friend\"'s birthday sleepover with a few others and ended up insulting the hell out of the event, called it boring, and threatened to leave if she doesn't get what she wants. And if that's not bad enough, she peer pressured everybody (whose lives might not be as bad as she made hers but she basically forced them anyway) into playing a silly dare game that involves public indecency, public urination, public disturbance, robbery, vandalism, illegal drinking, underage driving, and borderline prostitution. <br><br>Then as the movie goes, turns out a few years before Chapin stupidly dared someone to jump off a bridge, who then died, and that she felt bad about it (which was apparently the reason she \"rebelled\") And yet HERE she is, a few years later, forcing everybody to do the exact same thing. Not dumb enough?<br><br>Let's continue. She then later got angry at everybody because 2 people from her old school mentioned that it was her fault (for some reason her friends think it isn't) and that she caused the accident. Then, after 1 girl told her it was stupid to dare someone to do that, Chapin took that into great offense (apparently she has no common sense at all) and asked the girl if it was a dare. The other said \"No, I'm not that dumb\" and again, SOMEHOW, she took it as a dare. Then she jumped off a bridge in front of everybody (cause an attention wh*re needs an audience) and then somehow at the end we're supposed to feel bad for her?<br><br>This woman is the meanest, dumbest, most selfish ATTENTION WH*RE of a character I have ever seen. Who thinks because she feels bad about something dumb that SHE did, she earned to right to lash out and be a b*tch to everybody and expects us to feel sorry for her (she actually blamed her friends for not understanding for a moment). The world doesn't work that way, this movie honestly wasted my time and trust me, if I could, I would save you the pain and misery that I endured during the movie.<br><br>Watching a selfish careless little barbie doll who talks like an idiot for 1.5 hours is not fun.","user":"paperhearts_xo","rank":[17,23]},{"title":"Hidden gem!","rating":8,"date":"23 December 2010","review":"4.6 out of 10? This movie was so fresh and unique. The acting was strangely very good, and the depth to the plot was, for me, totally unexpected. When I rented this, I suspected I would be able to handle maybe half an hour before turning it off, but I was so wrong.<br><br>The director had very minute attention to detail and it really showed. I liked the way that the shots were framed and found the camera work to be near perfect. So yeah, maybe the ending wasn't a complete surprise but the way everything came together was what made this movie a hidden gem. I found the final 10 minutes to be genuinely authentic and emotional.<br><br>It's a shame this was marketed as a teen thriller with a silly title and DVD cover-work because it was much more like a psychological drama.","user":"weezebumble","rank":[27,40]},{"title":"Watching this might make you dumber.","rating":1,"date":"1 April 2012","review":"(not sure if these count as spoilers) I watched this movie on Netflix after it described it as a \"thriller\" about dark secrets coming out. The only thrill was when it was over and I didn't have to endure this awful movie anymore. The writing was absolutely horrible. The dialogue seemed like a 40-something man trying to write for teenage girls. It all came off as very awkward, and not at all realistic. The plot was boring and predictable. But despite these glaring flaws, what really bothered me was the character of Chapin. This girl is shown throughout the movie to be a callous, mean-spirited little troll of a person, and the movie expects us to feel bad for her. Time and time again, this character goes out of her way to make life miserable for those around her, simply to have something \"exciting\" to do, and it makes the viewer feel nothing but loathing and resentment for her. And her so-called \"redemption\", really just makes you hate her even more for being so stupid. If you like insipid, trite teeny-bopper movies like Twilight, this should be right up your alley. Otherwise, steer clear.","user":"BenderJFry","rank":[14,20]}]