[{"title":"An OK movie","rating":5,"date":"1 October 2010","review":"I saw this on Disney Channel on September 17th and was looking forward to seeing it. A sequel to the 1st one its about Camp Rock who are up against another camp called Camp Star of course the two clash together and they dance and sing to see who is the best. Demi Lovato was great in this as well as the jonas brothers who one in particular drives me nuts as he is so annoying.<br><br>The music was great,the cast was alright,the duration was OK and the dialouge was OK.<br><br>I like one song in particular Its on which is a great song as well as the duet between Demi &amp; Joe.<br><br>For the acting i'll give it a 5/10 For the story a 7/10 For the whole thing a 5/10 Not Oscar worthy but its alright.","user":"lisafordeay","rank":[7,10]},{"title":"Really, REALLY bad..","rating":1,"date":"3 September 2010","review":"My best friend and I liked the original camp rock- but this one was just bad. However- it's as good as any Disney channel movie sequel as it oozes with cheesiness. Let me put it this way- I was staring at the television and I couldn't pay attention. It just was boring, and just overall- odd. There really was no climax- and if there was- it was only two minutes long. So in the end, you'll like it if you're under 13. You probably won't like it if you're any older.<br><br>Even though the original Camp Rock was weak with it's story, it still maintained the entertainment factor. This one, just didn't provide that. I felt like I was watching a mixture of High School Musical 2 mixed with that new Jonas show and Camp Rock. That combination just didn't work.","user":"AngieeeBabayy","rank":[15,29]},{"title":"Enough Already","rating":3,"date":"7 September 2010","review":"It seems that the only thing Disney can do is keep repeating itself over and over...with very little original anything being created. They are trying to promote another teen queen with using Demi Lovato in the starring role. While she can sing fairly well, her acting skills leave much to be desired. There is no depth to any of it. We are suppose to believe she is THAT upset about everything happening around her. The camp on the other side of the lake apparently has everything amazing going for them...and want to WIN the competition. The heck with having a fun and memorable summer...those kids are there because they ALL plan to be HUGE stars...soon...that is if their egos don't get in the way and they can prove they can actually sing, dance and perform. The well known Jonas Brothers show up..not as themselves...but as camp counselers...who are suppose to teach the younger kids how to be ROCK stars. Of course...two of the three seem to do OK..but one always seems to have issues...that we suppose to find funny..(Kevin..the now-married one...who never gets ANY love interest in any of their shows..)..While they do sing and play music...it isn't anything memorable at all. We know who we are suppose to cheer for...the good kids...the ones who have heart and are responsible...with or without adult supervision...which there is very little of most of the time. Lets' see...teenagers..left alone....in the woods...in cabins...HMMM..it adds up to more than just roasting marshmallows over the campfire. At least in the real world anyway. These are clean-cut Disney Kids though...and none have thoughts of anything even remotely out of line. What got me was they way these kids dressed...in the highest of fashion...very un-camping like attire. Who wears dresses and jewelery at camp? Both the girls and the guys were over-dressed big time. And yes...I know...it is a movie for pre-teens and teens that haven't outgrown family oriented programing. Trust me...in a few years...these same kids will think this stuff is lame. On to bigger and more adult themes...and then the next generation of Disney fans will come along. The way Disney crams their programing at everyone is ridiculous. It is like riding the rides in the Disney Parks...they are all fun the first few times you ride them...then after a while...you get tired of it all and wish for something else that is different and more memorable. The Disney of old is NOT the same as what they are cranking out today. Pity.","user":"DiamondGirlfl","rank":[10,19]}]