[{"title":"All about the story and the acting","rating":9,"date":"20 October 2017","review":"This movie is a throwback to Hollywood's earlier days in the sense that it's all about the story and the acting. There's not a special effect to be seen.<br><br>The story is powerful. And the acting amazing. I had read the book and listened to an audio version, so I knew what was going to happen, and I was still moved. Djimon Honsou is terrific. <br><br>If you are looking for a light, fun night at the cinema, Same Kind of Different as Me is not your film. If you are looking for a memorable movie with powerful acting, it is.","user":"jkwjr","rank":[89,107]},{"title":"A very touching film","rating":13,"date":"13 February 2018","review":"This film tells the story of a wealthy couple who drifted apart. They become closer together by helping in a homeless shelter, and in the process they deeply touch other people's hearts.<br><br>I haven't imagined how touching this film can be. I thought it was a forgettable romantic comedy, but it turns out to be a very emotional and touching drama about how to love one another. All we have to do is to reach out to people in need, listen to the person and he genuinely there to love and care. I find this film very touching.","user":"Gordon-11","rank":[37,45]},{"title":"Great Story. Superbly Moving Film That's Very Well Crafted.","rating":20,"date":"20 October 2017","review":"\"We are all homeless, working our way home.\" Truly powerful insight delivered remarkably well from an emotional and powerful film. I had no idea going in that this was a true life story. I enjoyed the trailer and took a flier on the cast. I'm extremely pleased that I did. <br><br>All these Oscar nominees and winners brought their A-game and have delivered one of the better movies of the entire year. I wouldn't even classify this as a faith based film. In fact, Greg Kinnear's character never seems to embrace any particular religious sentiment. It's a true story of a woman's kindness and generous soul that is still reverberating through many people's lives. Her simple philosophy of feeding the homeless and SEEING them bares fruit in many ways. Her life and by extension those who are carrying her torch are one's to admire and even strive to emulate. <br><br>Her (Renee Zellweger) story is told through the eyes of her art dealer's husband (Greg Kinnear) and heavily involves a homeless person (Djimon Hounsou) who we get to know as the film unfolds. Great racial strife and emotional scenes of his life are seen through flashbacks. Overall, all three character arcs are moving and fleshed out amazingly well. It is a slow burn as the first act sets up very slowly. The pacing improves and the journey experienced is worth the exposition. While not a perfect movie (pacing issues, Hounsou's Denver character shifts fast from crazy violent homeless man to wise sage, severe marital problems glossed over quickly) it is a movie that will make you think and even move you to tears.","user":"MovieMystro","rank":[42,55]}]