[{"title":"Touche...","rating":9,"date":"16 March 2012","review":"Precursor: I just moved back into town two days ago and had made plans to see one of my old friends tonight. I did not want to see this movie, and wouldn't have under any other circumstances but my friend really wanted to and the tickets were free so I went. <br><br>Review itself: This is of no disrespect to Jonah Hill, his fashion of humor or his fans at all, but I, personally have grown tired of what seems to now be a plethora of wanna be Hangover and Superbad's. (The success of Project X seriously worries me...). Anyways, having that mind set approaching tonight and considering the fact I didn't laugh once during the 21 JS trailer, green or red band... I really wasn't expecting all that much out of the experience aside from leaving the house and catching up with a buddy. <br><br>But damn. <br><br>I honestly thought this movie was great. Yes, there were parts I wasn't fond of... a bit of the dialogue seemed to me to be vulgar strictly for the sake of being vulgar... there was the usual expected Jonah Hill trademarked myriad of penis jokes and one extremely unnecessary shock gag but the majority of the movie was, to me, surprisingly satirical/smart/relevant in today's society, self-aware, and situationally hilarious. Even the dumbest and most profane of this movie's jokes and clichés seemed to know that they were such and were given the proper comedic build up/context to at least warrant a chuckle. This movie had some surprisingly clever dialogue throughout and some of the best supporting characters I've seen in recent comedies (Ice Cube, The Principal, etc..) What really stood out to me though was the editing. 21 Jump Street features some of the most awkwardly humorous camera shot transitions, scene changes and music integration. Despite it's faults, I found this to be a damn hard movie to hate, and would recommend it to anyone looking for a fun weekend movie.<br><br>All in all... genuine, clever, vulgar yet respectable comedy with some heart. <br><br>IMO a very good career move for both Hill and Tatum. <br><br>Stoked for the sequel.","user":"CraigLindholmMedia","rank":[207,306]},{"title":"I have to be honest, I never expected to like this movie, but boy was it good.","rating":7,"date":"25 March 2012","review":"Buddy cop movies have been losing their waves. The thing is that all the buddy cop movies after Rush Hour 1 have been either too dull to comprehend or just mildly interesting and could just pass as a movie you've seen just to mark the register that you've seen it.<br><br>Based on a TV series of the same name which aired on Fox Network between 1987 and 1991, the series focuses on a squad of youthful-looking undercover police officers investigating crimes in high schools, colleges, and other teenage venues. The 2012 movie adaptation also had the former cast of the series; Johnny Depp and Peter DeLuise play a minor role.<br><br>Written by Jonah Hill who also starred in it, 21 is a movie that suits a cinema viewing with a box of popcorn at your side. Hill's performance was on a mild okay side, but the main cheese in the movie was Channing Tatum, who transcended from a jock to a nerd and still maintained his persona. I guess the most fun I had was when I saw Ice – Cube talking to the duo.<br><br>The movie was directed by Phil Lord and Chris Miller (Cloudy with a Chance of Meatballs). The directors and writers made sure you didn't have to go see the original to get the full taste of 21, as the film made do of the current pop culture in our time and how ironic and dumb it looks to make a fun movie and enough juice left to make another.<br><br>21 makes fun of everything in its path, even down to drugs, and how we kept expecting things to blow up and they just don't. The jokes keeps coming in from every corner making you laugh although.<br><br>The high moments in the movie was whenever the duo were together, the low moment was when they were apart.<br><br>The plot had the duo Hill and Tatum as Morton Schmidt and Greg Jenko (respectively), get deployed as undercover cops to a high school to bust a drug ring, and everything you'd expect to happen, doesn't. That's the fun of the movie.<br><br>All in all, why are you wasting time reading this go watch it.","user":"lagudafuad","rank":[122,179]},{"title":"Best Comedy so far of 2012","rating":9,"date":"18 March 2012","review":"So if you like Jonah Hill and comedies with really great cameo appearances, I think you would definitely like this film.<br><br>I must admit I expected this to be at the same standard as maybe The Change-Up or The Hangover Part II which weren't terrible movies, but they weren't the funniest movies I have seen either. This movie is more on par with The Hangover (the first installment), Superbad and Anchorman.<br><br>The chemistry between Jonah Hill and Channing Tatum is brilliant, and it's nice to see Tatum in something other than his standard rom-com or \"rom\" setting. I was already laughing from the first scene, which is generally hard to do and the humour was the correct balance of wit and slapstick. There were actually a lot more clever jokes than I expected and there were some scenes were I couldn't even control my laughter in a full cinema.<br><br>All in all, I'm not saying this movie is for everyone but the way I would tell you to see it is if you like Jonah Hill's ridiculous dialogue with sometimes unnecessary swears and you have no expectations of it being anything like the original TV show, I would definitely recommend this one! Best comedy film I've seen at the cinema in 2012.","user":"JeanRalphio","rank":[137,211]}]