[{"title":"Its all in the title really","rating":10,"date":"27 December 2011","review":"I'm surprised this has scored so low, now its not Oscar material, but really what sort of movie do you expect? Its a slick, tongue in cheek, entertaining romp which surprised me and left me with a \"better than I expected\" kinda feeling. Looks like the crew took some risks and in my opinion I reckon paid off. Been a couple of years since I saw it and I may need to escape for nearly 2 hours I'm going to give it a whirl again.<br><br>The problem is its not the deer hunter, harry potter, mission impossible, kill bill, schindlers list or hamlet. Hmm! is a movie called bitch slap going to appeal to my guardian reading, yoghurt weaving, bleeding hart liberal mind??? The promo poster clearly represented exactly what kind of movie is was going to be and with those expectations I'm voting a 10.","user":"scored","rank":[11,12]},{"title":"Bitch Slap (2009)","rating":8,"date":"13 September 2012","review":"Bitch Slap sees a gang of scantily clad ladies journey into the desert in an attempt to steal 200 million dollars worth of diamonds. If you're a fan of trashy exploitation flicks and love guns, cleavage, and women getting out of cars in slow-motion, then Bitch Slap was made with you in mind. It's fun, it's hyperactive, and it's a film that does not disappoint. Never promising to be more than it is, it succeeds in being more fun and funnier than one would expect. It's the kind of film where they take a break from the plot in order for the women to just pour water over each other. Many memorable scenes take place as a ridiculous but engaging plot unravels. I hope we can see more films like Bitch Slap over the next decade.","user":"SnakesOnAnAfricanPlain","rank":[19,24]},{"title":"If you like boobs and blood, this one is a good one.","rating":7,"date":"18 December 2009","review":"Starts off like a cheap porn movie, but turns out as quite a good action movie, Tarantino style. Lots of blood and violence. A lot of nice (mean but also in a good way) and nude girls. A story that rather falls in the background by what you get to see. Funny special effects that are not all that bad and fit the movie quite well. Lots of nice girls. Cat fights among hot girls. More girls, and yeah well, naked girls. This movie lives up to its title \"bitch slap\" rules this movie. And it has got Hercules, Kevin Sorbo in it. All in all if you are bored and got 1 1/2 hours to kill, give this movie a go but don't expect an A movie, more of a good B movie.","user":"king_of_queens1987","rank":[63,100]}]