[{"title":"Pretty entertaining sequel","rating":6,"date":"4 August 2010","review":"I am not going to lie and say this sequel is a masterpiece because it isn't for me. But I don't consider it a bad film, in fact I thought it was pretty entertaining. Comparing it to the first film, which I also liked even with its faults, I haven't completely made up my mind which I prefer, as both had their good and bad points that were either improved upon or diminished.<br><br>In terms, I'd say the sequel had the more eventful plot, that said there were occasions where there was too much going on, and both films admittedly had episodic story structures with some entertaining parts. While I liked the acting on the whole, two performances weren't quite there. One was Gemma Arterton, now I am not dismissing her as a bad actress because she isn't-see her in Tess of the D'Urbevilles she is brilliant there- it's just that she doesn't have much to do this time around. The other is I agree Sarah Harding, she looked pretty but her acting and facial expressions I felt were all wrong and to me her presence felt pointless.<br><br>In terms of scripting, there are some fun lines(this is interminable), as well as some very silly ones(Seriously, she'd snog a melon if you drew a mouth on it). There were also some good scenes(and plenty of anarchy between the schoolgirls), such as the one at the boy's school(my brother was an extra in this scene), the ruination of Romeo and Juliet, the sword fight between Geoffrey and Romeo and the search for the ring in the dark. The two scenes that didn't quite work so well were the ending, which felt rather abrupt, and the part where Annabelle is in the school infirmary in exorcist fashion, which came across as a little too silly for my taste.<br><br>St Trinians 2 is nice to look at, it isn't high art, but the buildings are imposing and it was nice to see London again. The music is delightful, and the direction is decent. Apart from Harding and Arterton to a lesser degree, the other performances are fine. Rupert Everett is a lot of fun to watch, while Colin Firth has more to do this time around and is wonderful. Tululah Riley gives a nice account of herself as well, as does Toby Jones, while David Tennant makes for an excellent if somewhat hammy villain of the piece.<br><br>Overall, no masterpiece but it was at least watchable. It keeps reasonably to the somewhat chaotic tone of the first film, and while the plot was a little busy in places and there were moments of stale laughs or acting, I enjoyed it. 6/10 Bethany Cox","user":"TheLittleSongbird","rank":[14,15]},{"title":"Not bad; a good laugh","rating":6,"date":"23 December 2009","review":"It's really hard to rate St Trinian's 2. On the one hand, it is lively, sharp, and amusing, but on the other hand, the plot is a little disappointing. The film itself borders on the 'absolutely surreal' (mind you, it's a bit ironic to claim this against St Trinian's school, eh??), which somehow, I thought, made it a bit awkward to watch.<br><br>As ever, the stereotypes of teenage schoolgirls is strong, which adds to the overall enjoyment of the film, and as you can expect with your typical British comedy film, there are the odd pieces of play-on-words humour which you have to be quick to catch up on. Also watch out for references to famous films or other popular-culture references (you'll understand what I mean when you watch it).<br><br>(And before you ask: It's generally clean humour. No toilet humour/fart jokes.)<br><br>Thus, I give this a rating of 6/10, mainly because of its overall cleverness and entertainment value. Would I recommend it? Yes I would; it's about time a comedy film had real humour in it, even if it is masked in a very bizarre plot.","user":"A-Clockwork-Bobbin","rank":[19,23]},{"title":"silly franchise gets sillier","rating":4,"date":"27 July 2015","review":"Annabelle Fritton (Talulah Riley) is the new Head Girl of St Trinian's. Roxy (Sarah Harding) is the Rock Star new girl that every click wants. Sir Piers Pomfrey (David Tennant) hires Celia (Juno Temple) to steal a ring from the school library for £20,000. The girls find out and Annabelle counter offers £100,000. Pomfrey do not take it well. Her aunt headmistress Camilla Fritton (Rupert Everett) tells the girls that in 1598, her pirate ancestor stole a treasure from Pomfrey's ancestor. The ring is one of two which leads to the treasure. Pomfrey raids the school and steals the ring. Camilla seeks the help of disgraced politician ex-lover Geoffrey Thwaites (Colin Firth). The girls dress as boys to find the other ring. They call former Head Girl Kelly Jones (Gemma Arterton) to steal back their ring from Pomfrey's male chauvinistic secret society AD1.<br><br>It's a silly franchise that got even sillier. The problem is that it's more boring and less fun. The new girl is a dud. It turns into a rather boring caper movie. It tries to play up the girl power aspect by creating a cartoonish chauvinist secret society. It only serves to make a powerful message seemingly stupid. This franchise is never going to be Shakespeare but this is much worst. By the time they do a flash mob, all hopes are lost.","user":"SnoopyStyle","rank":[6,6]}]