[{"title":"Great White Buffalo","rating":7,"date":"30 October 2013","review":"While the world was still recovering from the over-hyped Todd Phillips movie a smaller, quieter, but funnier movie slipped into cinemas and made a little splash. Both feature groups of troubled men looking for a good time, but Hot Tub Time Machine is just madder and more inventive.<br><br>Three losers and a tagging-along nephew book into a ski lodge hoping to relive their youthful experiences. But when the lodge turns out to be a dilapidated wreck they resort to just getting wasted in the hot tub. Said device sends them back in time when the circuits are fried by one of those awful energy drinks.<br><br>Arriving in 1986 (a year that presents us with several plot holes an anachronisms) they seize the opportunity to fix things for a better future (despite being warned not to) while Chevy Chase pops in and out as the hotel handyman who may or may not know the secret to time travel.<br><br>It's very silly, very irreverent stuff, but it works. There's almost a sort of magical, otherworldly feel to the hotel and Chevy Chase's character, I wish it was taken a little bit further (maybe in the sequel), and lampooning of 80s culture is spot-on, even if it's hardly the first movie to do so.<br><br>You won't stop smiling for the entire duration. Brainless or not, isn't that exactly what you want from a comedy?","user":"CuriosityKilledShawn","rank":[23,27]},{"title":"Vastly better than I expected","rating":7,"date":"28 March 2010","review":"Maybe I liked this movie because I had such subterranean expectations for it. From the previews, and, indeed, just the title, I was certain it was going to be stupid rather than funny.<br><br>But I went out to dinner with my friends Saturday night, and after dinner, to my chagrin, everybody had a reason to bail on the evening, and I found myself alone, at 9pm, with nothing to do, and not wanting to go home. So I went to the theater to play movie roulette. Hot Tub Time Machine was playing almost immediately, and the next movie after that wouldn't be for another 45 minutes. I *almost* turned around and went home, so sure was I that this film was going to be stupid rather than funny. But I figured, what the heck, I'm here...<br><br>Well, the movie *is* stupid. But it's funny too. And what's more, it knows it's stupid and makes no bones about it. At no time does it ever take itself seriously. Now, I could have done without some of the extremely gross bits. Happily there aren't *too* many of them. And I'm sure I didn't get all the 80's references; although I did live through the period, I largely avoided popular culture at that time, and still couldn't tell you most of the bands or big hit songs of the time (or of today, for that matter).<br><br>But I have to confess, the movie did make me laugh. Not all throughout, but I did have a number of genuine, laugh-out-loud moments. And plenty of chuckles and smiles. And I found myself genuinely liking the characters, and finding them to have a bit more depth than I expected from a film entitled \"Hot Tub Time Machine\". And the basic theme of the loss of the zany, free-form fun of youth, and regret of the relative staid blandness of \"adult\" life, is a theme which resonated with me.<br><br>Now, let's get real. This is no \"Citizen Cane\", \"Vertigo\", or \"The Godfather\". Nor is a timeless comedy masterpiece like \"Airplane\", \"Blazing Saddles\", or \"Monty Python and the Holy Grail\". Someone here displayed gross unfairness in trying to compare it to a classic '30's comedy, but obviously this is not \"It Happened One Night\", \"Bringing Up Baby\", or \"Duck Soup\", and if you go to the theater expecting it to be, the fault lies with you. What it is is a silly, fun, enjoyable way to pass a couple hours. Not deep, not profound, not brilliant. Not timeless, not enduring.<br><br>But not bad. And not nearly as stupid as it looked like it was going to be. And these days, that's not too bad.","user":"Qanqor","rank":[164,241]},{"title":"Hot Tub Time Machine (2010)","rating":7,"date":"29 December 2011","review":"Hell, it certainly kept me damn entertained. In this day and age it takes real comedy chops to pull off poo and vomit gags with such expert timing. The film embraces the absurdity of time travel and doesn't focus too much on the whys. All four of the male leads are brilliant, especially Corddry, who pulls off one of the great movie arseholes, without completely detaching himself from the audience. There are some classic lines, mostly coming from insults, and the film doesn't rely too much on date humour (just a few references to e-mail etc.) It cleverly spits in the face of the butterfly effect and relishes its characters manipulation of time, whilst showing that some things can't be avoided. A very entertaining comedy.","user":"SnakesOnAnAfricanPlain","rank":[30,39]}]