[{"title":"Absolutely delightful","rating":23,"date":"23 August 2016","review":"This rainy day emergency activity last weekend turned out to be the best decision of the holidays. Based on the Arthur Ransome classic with a slightly altered plot, it was a bit slow to get started, but once the main family arrive in the lakes the kids' adventure begins and my two were on the edge of their seats.<br><br>The scenery is breathtaking (without any special effects) and for the kids the sense of a REAL adventure must be inspiring. The Walker family children (Swallows) are allowed to go and camp on an island in the middle of a lake and basically fend for themselves. Once on the island it becomes clear that they're not alone and soon war is declared with two local pirate girls (Amazons). The kids catch fish, play with fire, shoot bows and arrows. There is no need to add superheroes or special effects, real life is adventurous enough.<br><br>There are some great funny moments, a couple of which had the whole audience in stitches.<br><br>Thoroughly recommended, even if it's not raining!!","user":"Rollins72","rank":[35,43]},{"title":"Enid Blytonized","rating":18,"date":"18 September 2016","review":"Swallows and Amazons - I must admit that I went to see this with a certain amount of dread. I have loved the books since I read them as a child some 40+ years ago and they have been shared with Daughter Number Two at bedtimes over the past few years.<br><br>My fears were justified.<br><br>I KNOW you can't just take a book and film it. I KNOW that what works well on the page doesn't necessarily work well on the screen. But what I don't understand is why someone would take a great book that has worked its spell on generations, take the very thing that make it special and successful (the world of childhood imagination, free from the constraints of adult supervision), dump it, and graft on a whole new layer of story ideas about spies and secret documents that, quite frankly, looks like it was lifted straight out of an Enid Blyton Famous Five book.<br><br>I can also understand that characters have to be altered for the screen: the name 'Titty' would raise unwanted snigger and was understandably changed to 'Tatty', Mrs Walker was played by a Scottish actress and so was sensibly changed from having an Australian childhood to one in the Highlands, but what is less understandable is the changing of Susan's character from a sensible, organised 'ship's mate' into a bumbling, whining klutz who can't fry a fish... I'm baffled. (If this was some attempt to avoid 'sexism' it failed miserably as all the other female characters in the film were shown being thoroughly domestic) It just robbed Susan of any strength of character at all. She just becomes a blonde piece of the scenery who doesn't really do anything except feed John the odd line.<br><br>One of the things that make the book special - especially for landlubbers like myself - is the way that the technicalities of sailing are bought so vividly to life. Reefing, jibbing, coming about, raising the keel, raising the sail, stepping the mast... all that technical stuff that the children in the books understand, and are so proficient at, is reduced here to a few lines like \"Go faster, John!\", \"We're losing them!\" - usually delivered off-camera or in long shot as the crew of the Swallow just sit there in the boat like cargo. For all the shots of boats in the water there's very little sailing going on in this film. And sailing is at the heart of the books. The night sailing up the lake to seize the Amazon is the whole heart of the book. In the film the night sail up the lake is disposed of in a few quick shots - in daylight.<br><br>I was incredibly disappointed and Number Two Daughter (aged 13) was too. She thought someone who hadn't read the book might like it as a film in its own right but as an adaptation of Swallows and Amazons? Sorry. No.","user":"junk-monkey","rank":[28,34]},{"title":"A monstrous trashing of a brilliant story","rating":1,"date":"20 December 2016","review":"What a mess. What a travesty. Point by point, scene by scene, the film makers went through destroying the characters one by one.<br><br>I will start by saying I am biased. I am a sailor. I kept my boat in Secret Water for twenty years. I live in Ransome country, the plots of several of his books takes place a matter of a few miles away. His boats Nancy Blackett and Peter Duck are familiar sights on the Deben. I've read most of the books aloud to the children.<br><br>\"Better drowned than duffers, if not duffer won't drown\" says the famous telegram. Drown the lot of them then, I say.<br><br>The capable and responsible Walker children in the book are converted into a bunch of moronic twits who are so lacking in skill they cannot get to the island without losing their stores over the side of the boat. The mate Susan, whose skillful catering and management underpins all of the Swallows adventures in the books, freely admits that she can't bake, and destroys their caught fish in the frying pan after butchering it with an apparently blunt knife and mashing it to pulp. She spends the rest of the film moaning that her brother John won't tell her anything.<br><br>Possibly one might have been forewarned by the politically correct renaming of the wonderful Titty of the books, ships cartographer and log keeper, into 'Tatty'. Tatty is the word.<br><br>The book-based Swallows pride themselves in the ability to start a campfire with a single match. Not so the wallies in this film, who lose their box of matches into the lake.<br><br>Captain John, in the books full of a sense of responsibility for his crew and ship, continually shouts at his brother and sisters, blaming them for every misfortune. He abandons members of his crew without any indication what he is doing. He also succeeds in letting Roger, who cannot swim, fall overboard in the middle of the lake.<br><br>There is little to say about Nancy, the pinnacle of most of the stories; as she was wholly lacklustre and appeared in every scene to be acting.<br><br>The parents are just as bad. Mrs Walker is clearly lacking the slightest sense of judgement to let her continually fighting unfriendly children anywhere near a sailing boat, let alone in the absence of life jackets. Mrs Jackson, the kindly Native at Holly Howe, turns out to be a pessimistic grouch.<br><br>Jim Blackett, Titty's 'retired pirate', amazingly, turns out to be a spy being pursued by Russians. The film practically revolves around this extraordinarily bad idea.<br><br>And it culminates, would you believe it, with the two crews of the Swallow and Amazon lassoing a Sea Plane - in the control of the Russian spies and carrying the bound captive uncle Jim - in the attempt to restrain it from taking off. Which they are surprised to find does not work.<br><br>Every moment had me cringing a bit deeper into my seat, as the unbearably unlikely plot unfolded, and the Swallows demonstrated more and more that they should be far far away from water.<br><br>We watched the old film version as an antidote. What a relief to see these young and capable actors taking on the roles in the books with such a high degree of success, and following pretty faithfully the entertaining and amusing story line that has delighted millions of readers. Just a beautiful tale of children doing cool things.","user":"saggitarius-88","rank":[22,28]}]