[{"title":"Their flashbacks have flashbacks","rating":6,"date":"10 June 2011","review":"\"Sutures\" is setup with layered flashbacks to tell its constantly revolving tale along the lines of a thriller, though this takes a gruesome turn and gives its salutes to recent horror such as \"Saw,\" \"Turistas\" and \"Hostel\" if still not being exactly alike.<br><br>After being found wounded, a traumatized woman is admitted to a hospital where she proceeds to tell a detective her story about her friends of late twenties--three guys and three gals--who went on a retreat to a remote lodge. Does some hillbilly attack them? Do their cell phones inconveniently die? Not quite, the dwelling is a small castle--you read right--and the only backwoods fellow turns out to be much friendlier than \"Texas Chainsaw\" and \"Hills Have Eyes\" guys. Instead, the out-of-reach area is used to the advantage of a mysterious, dressed-in-black man who's simultaneously comely but dangerous; think \"Dust Devil\" meets \"Vampire Hunter D.\" They're rounded up and then the tortuous fun begins at a clandestine location that harvests organs on the black market.<br><br>There's little quips and humor used to break the ice, and then, of course, there's explicit blood and gore inflicted after getting an introduction to the characters. It's cringe worthy and there are logical explanations for it--e.g.: anesthesia leads to traces in the body--though it's hard to say if the filmmakers effectively set up fellow feeling or even believable scares, as it moves so fast that there isn't enough time to scratch the surface of their personalities or even show that a scenario or place of operation could exist like this. Kidnapped while in your own backyard or getting caught in a tourist trap in an unfamiliar third world country seems more threatening. The remote location is more tongue-in-cheek to backwoods flicks and the scenario is more chance than premeditated. Not the stuff nightmares are made of as it doesn't put the audience in their shoes.<br><br>There are not only flashbacks of the woman in the hospital telling her story, but also flashbacks within flashbacks to show even more backstory. It gets confusing as to the what's what and who's who, as it jumps back and forth and injects ambiguous dialogue to throw the viewer off in the meantime. Not to mention a key character appearing drastically different than when they were younger/older, and not explaining how certain siblings were conceived stunted surprises. For what it's worth, the film was steadily paced and did manage to cut away any hanging fat. Conflicting: yes. Boring: certainly not.<br><br>I've served my sentence with a lot of low-budget and shoe string cinema in horror, so I got a chance to see the worst of the worst in passing to hopefully see the best. This, however, falls somewhere in between as it was filmed professionally with some hand-held and even crane techniques. The cinematography was well thought through and even helped set a little bit of mood. There's no poor overdubs that were recorded in a non-reverbed room, or can't-see-you lighting lapses. The acting was pretty consistent and believable, especially with a really charismatic, over-the-top villain played by Andrew Prine who acts like a stage performer with an audience. This started out more promising, though the mechanics of the story caused it to jump ahead of itself and brought down the significance and impact of the rest of the picture. (Also submitted on http://fromblacktoredfilmreviews.blogspot.com/)","user":"TheHrunting","rank":[14,16]},{"title":"Ugly and mean-spirited","rating":2,"date":"21 February 2016","review":"STITCHES is another boring rip-off of the whole HOSTEL/SAW shebang and another unwelcome addition to the 'torture porn' category of film-making. This one sees a typically clichéd group of attractive young things end up in the hands of some decidedly nefarious business people working in the illegal organ donation industry.<br><br>The entire film is merely an excuse for extended and gratuitous scenes of unpleasant torture and bloodshed. Subsequently, the whole of the soundtrack is either full of ominous music or people screaming at the tops of their lungs. It's quickly wearying, and I can imagine that few people would get a kick out of such a spectacle. I found the attempts at cod psychology to be rather laughable, while the interesting cast members are limited to just two: old-timer Andrew Prine (AMITYVILLE II: THE POSSESSION) as the villain, and B-movie stalwart Jason London as a cop.","user":"Leofwine_draca","rank":[3,3]},{"title":"sadly have seen the cut version but even then it's full of troubles","rating":5,"date":"5 December 2013","review":"Although that the idea of this flick was rather good I had a few problems watching it. First of all it clocks in at 83 minutes but mine, being bought at a horror convention clocked in at 76 minutes. Or something is wrong here on the database or my copy did cut out the gore? <br><br>But not alone that enigma is a problem it's the way the story is being told that makes it almost not watchable. It starts off rather good and we do follow the escaping girl but once the flashbacks come in this flick turns into a mess. It's hard to follow what's happening because we have flashbacks in flashbacks and by doing so you are losing the interest in the characters. <br><br>For what I have seen, heavily cut it looked like it contained a bit of gore here and there but it do has another problem. While watching it my children in the room asked me if I had to turn up the volume that loud and I must say I had too because the audio track is a horror itself. You need to raise the volume to understand what the conversation was all about. In fact, the acting was not convincing too. <br><br>So for me, some parts must have been interesting to watch but still it's a mediocre flick. <br><br>Gore 0/5 Nudity 0/5 Effects 2/5 Story 2/5 Comedy 0/5","user":"trashgang","rank":[3,3]}]