[{"title":"The landscape of the soul","rating":8,"date":"28 August 2010","review":"It is 1974. Our protagonist, young and hip, has shaggy hair, sideburns, and a slick leather jacket. Asked about his suit at his father's funeral: \"Carnaby's,\" he admits. \"Oh, ay,\" says one mourner, with a hint of added dismay.<br><br>He's been in the South, you see. American viewers with a limited perception of the UK may, at the beginning of Channel Four's remarkable Red Riding trilogy, have little understanding of what difference that makes. They will soon learn. \"This is the North,\" says one of the terrifying policemen who populate this film's haunted Yorkshire. \"Where we do what we want.\"<br><br>Red Riding: In the Year of Our Lord 1974 begins under lowering skies. A girl of ten has vanished. A young and callow crime reporter Eddie Dunford (Andrew Garfield) gets clued in by a conspiracy-minded colleague that the vanishing resembles two previous cases within a close range. Eager to make his mark, he senses opportunity, and in excitement at the idea that a serial murderer might be at work he blurts, \"Let's keep our fingers crossed.\"<br><br>As the story deepens, however, so does the character. The grief of the victims' families needles him; he begins a relationship with one girl's heartsick mother (Rebecca Hall). Picking apart the story that emerges, he is drawn into the orbit of a wealthy developer (Sean Bean) with an unwholesome degree of influence in Yorkshire and its power structure. The perpetrator of the crimes is unquestionably psychopathic -- he stitches \"angels' wings\" into his victims' backs. Yet, in the film's most disturbing element, the police department itself functions as a psychopath, achieving its desires through brutalization, torture, and even possibly murder.<br><br>Caught in a conscienceless land, Dunford's own conscience, in reaction, grows, and what began as mere ambition transforms into a perhaps doomed lust for the truth. If this sounds like a conventional trope of the genre, it is -- plotwise much of what happens here is conventional. But Red Riding makes the narrative fresh by treating it not just as a story of crime and justice but as one of the soul, and its environs. When Dunford begs the mother to escape with him from the prevailing madness, he tells her, \"In the South the sun shines.\" What he's telling her is that the sickness is inseparable from the place. Yorkshire is filmed (with gorgeous gloom) as a cloud-shrouded ruin, an economic disaster site in which financial power trumps morality. Starting out fresh-faced, vain, and cocky, Dunford will, by the end of his journey, be considerably the worse for wear. Looking at the landscape around him, we think, how could he not be?<br><br>Red Riding 1974 is not flawless -- some scenes feel repetitive and the bleakness can be overwhelming. But it compels you forward, it stays with you, and it genuinely rattles the spirit. This is not easy viewing, but in approaching the continuing saga, it promises hard- earned reward.","user":"miloc","rank":[43,49]},{"title":"Absolutely stunning...","rating":8,"date":"5 March 2009","review":"I'll start by saying that I was expecting to like this before I watched it. Whether that had a bearing on my judgement, I can't really say.<br><br>'Nineteen Seventy-Four' has shades of 'Taxi Driver', the narrative framed not by the steam that rises from the streets of New York City but instead by the skies of Yorkshire. The comparison between the two movies really occurred to me most strongly at the end of the film and I think you'll see why.<br><br>The acting is spot on from everybody. I can't think of one performance that stands out for the wrong reasons. Andrew Garfield is excellent in the lead role and Sean Bean is on form.<br><br>The exploration of police corruption and the struggle for both revenge and justice resonate well beyond the ending of the film.<br><br>The cinematography is excellent and it is disappointing that films of this quality have to be shown on television because they won't find enough of an audience in the majority of British cinemas.","user":"Batesy89","rank":[71,90]},{"title":"Phase One:The Dye Is Cast","rating":10,"date":"30 March 2010","review":"The year is 1974. Great Britain has pretty much (all but) cast off the whole mellow,groovy hippie glow of the late 1960's (and is pretty much unaware of the punk movement that is to envelope \"merrie old England\" within the next couple of years),unemployment is rampant &amp; most folk are listening to the likes of Mott The Hoople,T-Rex,David Bowie,etc. A pedophile murderer,that is being called the Yorkshire Slasher has been terrorizing the citizens of Yorkshire for the past five years,and it's up to newby journalist,Eddie Dunford to get the facts on the who,what,when,where &amp; especially the why on why young schoolgirls are being murdered. What he gets in the interim of uncovering information is far more than what he expected:police corruption,political graft (with deep ties to organized crime),and other nastiness. 'Red Riding 1974' (or as it is better known in the United Kingdom as 'Red Riding:In The Year Of Our Lord 1974')is the first part of a three part series,which itself is a powder keg of a \"who dunnit\" that will keep you on the edge of your seat guessing what happens next (suggestion:hit the mens or ladies room before the film starts &amp; avoid that jumbo soft drink,so that you won't have to miss out on anything,because you had to make a dash for the 'loo'). Julian Jarrold,who directed the superb 'Brideshead Revisited' &amp; 'Becomming Jane',directs a very well paced thriller from a screenplay by Tony Grisoni,adapted from the celebrated novel by David Peace. Rob Hardy's,oh so fine cinematography goes for both gloss &amp; grit, while Andrew Hulme's razor tight editing keeps the pace (and pulse)going. Andrew Gardfield plays journalist Eddie Dunford (who looks like he just stepped down from his other gig singing for Roxy Music),a young man who descends down a dark labyrinth where there is no escape. The rest of the cast is rounded out by the likes of David Morrissey, Warren Clarke,Jennifer Hennessy,Rachael Jane Allen,and others. I await the other two chapters with anticipation. Not rated by the MPAA,this film contains pervasive strong language,strong sexual content,nudity,violence,some of which is quite brutal &amp; bloody,some rather lurid photographs that depict the Yorkshire ripper's dirty work on display,and much smoking &amp; drinking of alcohol. Leave the little ones home for this one.","user":"druid333-2","rank":[39,51]}]