[{"title":"Gary - you're free","rating":10,"date":"1 January 2016","review":"The Smashing Pumpkins may have mused that 'The End is the Beginning is the End,' but Edgar Wright knew better. He knew that for his beloved 'Cornetto Trilogy,' he would need an ending that could somehow tie up all of its strains of manic, voracious genre pastiche, savage wit and silliness, and, most importantly, its symphony to the reluctant aging of the schlubby, post- Shaun adult male. He knew he needed to do something special.<br><br>So, in the words of Shaun, \"what do you mean, DO something?\" Well, getting the old gang together for a nostalgia-fuelled 'one last job' pub crawl, charged with more emotional weight and subtext than meets the eye should about do it. In this regard, Cornetto #3 is by far the most personal, mature, reflective, bittersweet and cognizant film in Wright's oeuvre. It knowingly winks at his past works (don't forget to say hi to Brian, Marsha, and Tires, listen for the fruit machine, and enjoy an appropriately sly Cornetto cameo), while introducing some of his most hysterically snappy wordplay yet (\"maybe it's a windoor...!\"). And, as no Wright film could ever be that straightforward, it's also, naturally, about the end of the world. Duh.<br><br>To some, The World's End will be a cracking sci-fi pastiche - Invasion of the Body Snatchers handled with the chilly British terseness of The Day of the Triffids. To others, it's a riotous, boozy action-comedy with a kickass set of tunes, and prime viewing before hitting the pub (or several) with your mates. All of these things are true. But for me, it will always be a film about growing up. A film about finding closure, and purpose. A film about coming home and moving on at once. A film encouraging the Gary King in all of us to make peace with friends, the past, the future, and ourselves. It's the perfect filmic encapsulation of playing James Bond video games in my adolescent basement. And it's a film about pursuing your dreams, even - nay, especially - if your dreams are pointless, idiotic, and involve a sh*t-ton of drinking.<br><br>Things get going at an almost ponderously slow and repetitive pace, forcing the viewer to be bludgeoned by Gary King, alongside his estranged high school buddies, into going on his quest with him. The tone is fun, but with a bit of an edge, Pegg bravely playing obnoxious at full tilt, keeping it unclear as to whether you can or should like him. But, upon arriving in the impossibly quaint Newton Haven (and here Wright coins the most on-the-nose term for cultural assimilation and the dearth of family-run local business: \"Starbucking\". Remember that theme; it'll come in handy later), things pick up, and then some. Here, King's raucous enthusiasm becomes almost worrisome, especially in contrast with his bemused buddies, all more content to act their ages. Thankfully, the sci-fi framework comes to the rescue right when King is on the cusp of having to be serious. The solution, like fellow extraterrestrial alcoholicomedy Grabbers? Keep drinking - to \"blend in\", of course. And, as the Doors kick in, that's where the fun really begins.<br><br>Wright's characteristic swish-pans and dynamic sound effects, paired with some of the most intricately crunchy fight choreography seen in ages make The World's End thrilling in the most visceral sense. There's no purer cinematic joy than a long-take tracking shot of Pegg weaving in and out of a chaotic robot throwdown, stepping on bar stools and counter tops, sipping his pint and throwing the occasional like a tipsy Buster Keaton, and it's impossible not to share in Wright's glee. The robot designs are eerily simple, the pace and physical slapstick are howlingly perfect, while the grim, sepia lighting is perfectly atmospheric for the intensifying sci-fi peril and slurring melodrama unfolding. And the climactic, belligerent belch of a speech demanding agency on behalf of the human race? I dare you to find more galvanizing words.<br><br>Gary King is a courageously different Simon Pegg than has been unleashed before, and his manic energy, boundless but strained charisma and desperate arrogance make for his most achingly human (but still hilarious) creation yet. Nick Frost also digs into unforeseen dramatic meat, pairing his juggernaut physical comedy with real pain and hard-won regret, all the funnier for being so truthful. There's also a gag involving him (literally) punching a clock which may be the funniest in Wright's oeuvre. Paddy Considine and Martin Freeman collectively ace the two sides of the middle-aged-hipster coin (post-meathead athletic emotional sensitivity and antiquated, bluetoothed tech-speak respectively), while Eddie Marsan finds both huge laughs and the most raw hangdog pathos in the sweetness of Peter Page. Sadly, in the film's only real fault, Edgar's boys club has no proper room for Rosamund Pike, and it's a real shame, as she's on typically superb form, and amiably hilarious to boot. As this instalment's former-007-turned- villain-with-uncomfortable-facial-hair, Pierce Brosnan tweaks his debonair charm and silky Irish accent to their most calmly sinister, while the inevitable Bill Nighy is deliciously bemused as a big lamp who just won't f*ck off back to Legoland.<br><br>The World's End (or, as everyone should henceforth refer to it, 'Smashy-Smashy-Egg-Men'), is not only a stupendously satisfying Cornetto resolution. It's perfectly paced, technically flawless, thrilling, hugely fun, and bravely emotional romp. It's arguably the funniest and most real mediation on friends, homecomings, and befuddled male aging to date. It's a belligerently, obstinately, chaotically, damn good film. It's something truly special. So hop into the Beast, blare those Soup Dragons, and ride Wright's beautiful disaster all the way to the bitter end. Or lager end. Because, be honest: what could be a more heartfelt answer to Primal Scream's recurring query - \"Just what is it that you want to do?\"<br><br>-10/10","user":"pyrocitor","rank":[58,69]},{"title":"The End Of The Trilogy Is Nigh","rating":19,"date":"19 July 2013","review":"So last night from 7.30pm through 2am. I sat through the Cornetto trilogy at the Vue cinema in my hometown, Worcester. Watching 'Shaun Of The Dead' and 'Hot Fuzz' again really boosted the hype for what was to follow, come midnight... 'The World's End' began! <br><br>So the film started like every other Cornetto film, allowing us to get attached to our lead characters, learning a bit about their backgrounds through comical contexts! The film follows our five leads, portrayed by Simon Pegg, Nick Frost, Martin Freeman, Paddy Considine and Eddie Marsan, whom 20 years after a failed pub crawl, reunite to repeat the crawl and return to their hometown, Newton Haven, to do so. However, all is not what it seems. Over the due course of the night, the gang began to discover that the town has been taken over by robots attempting to \"reform humankind\", completing the crawl becomes the least of their worries.<br><br>The film is extremely clever, like Shaun of The Dead and Hot Fuzz they have mixed two genres, this time Sci-Fi and Comedy, to create a film on par with the rest. From the first pint all the way through to the \"bitter end.. or lager end\" the crew have to use their wits to avoid being detected and caught by the pursuing robots, all of which ends with devastating consequences. It is a must-see if you enjoyed the other two. Edgar Wright's trilogy has come to a fantastic end!","user":"CalRhys","rank":[223,310]},{"title":"Another funny, clever, and wild one from Simon Pegg and Edgar Wright","rating":8,"date":"25 August 2013","review":"If you seen the other two movies in the so-called Cornetto Trilogy (\"Shaun of the Dead\" &amp; \"Hot Fuzz\") then you already know what to expect from \"The World's End\". Like the others it is funny and full of unexpected and crazy twists and turns. The story follows five friends who decide to reunite and finish the pub crawl they were not able to complete 20 years ago. Everything is going fine and then all hell breaks loose. You know you're probably in for a wild and fun ride and that is exactly what you get. Simon Pegg and Nick Frost kind of switch roles from their previous movies, Frost is the one that has it together and Pegg doesn't. It works well and they still maintain their great humor and wit. The supporting cast is equally funny with Eddie Marsan being a highlight. The movie if full of great one liners and some absolutely hilarious moment. If you liked \"Shaun of the Dead\" and \"Hot Fuzz\" or if you just like wild and fun movies then you'll like \"The World's End\". It is funny, clever, and a hell of a ride.","user":"ikiru71-220-566499","rank":[22,27]}]