[{"title":"Fake Identity, a.k.a. Double Identity","rating":5,"date":"12 January 2010","review":"Val Kilmer, looking nice and swank, heavier... but I still miss the old days when he played roles like the Saint. Then, we saw a much sharper, expressive, and exciting Kilmer. In this movie, Kilmer plays a doctor who becomes mistaken for a secret agent/diamond dealer, with the usual nefarious consequences. The story does try to keep you interested till the very end, but I felt Kilmer was a bit of a letdown.<br><br>The movie takes place in Bulgaria, not Chechenya, and from there, moves to Prague. Most of the supporting actors seem to be slavic, but they all acted well. I could find no fault there. The girl, Katrine (Izabella Miko) is beautiful and acted well too.<br><br>The main plot is not about saving anyone mysterious, nor protecting her from assailants. The girl is a secret double agent, working both for a British group seeking to control a diamond cartel, and the Bulgarian/Czech people who also want control of the same. The girl bumps into Kilmer, while running from being captured taking pictures for the Brits, kiss to make believe it was intentional to shake them off, and that begins a love affair, so strong, both were willing to risk their lives for the other. Whether or not you believe this is highly improbable depends on your definition of the word, but that is the plot, in a nutshell.<br><br>This is not to say that the movie is just a frivolous jamboree of hastily made-up story lines. No, it was OK, considering the story is nothing new, and similar plots have been used many times before. It would be a mistake to compare this movie with older ones of similar ideas, such as 007 Diamonds Are Forever. Such movies were a tour de force. It would be an injustice to make such comparisons, so the best thing to do, I guess, is just to take this one as a standalone, and judge it by its own merit. Doing so, it is not a shining accomplishment, but neither does it fail miserably.<br><br>So, bottom line: \"will I like it?\" If you like this kind of plot, it will keep you interested, but you'll have to follow the story carefully to avoid becoming confused. I know I did until I started doing some facial recognition. Despite the blasé storyline, it's not a bad waste of time.","user":"torrentstorm","rank":[58,75]},{"title":"Adequate thriller, no more or less","rating":22,"date":"22 March 2010","review":"It doesn't seem that long ago that Val Kilmer was a big star appearing in major Hollywood movies - it's kind of sad to see that just about all of his recent work has been for the straight-to-DVD market. And in these films (and this one), he appears to have put on some weight, looking somewhat puffy and tired. Actually, aside from that, he doesn't have much to be ashamed about for this particular straight-to-DVD movie. It has its faults - the story is set in 1992 for no apparent reason, Kilmer's character is not properly introduced, and for a thriller, the movie is surprisingly calm - it could have used with a bit more juice in its narrative and a few exciting action scenes. Still, the movie is professionally filmed, a trademark of Millennium Films/Nu Image, and it's nice to see one of their shot-in-Bulgaria movies actually set in Bulgaria! And while the movie could have been more engaging, it does manage to set up a mystery that keeps you watching - there's never a time I could consider anywhere near boring. No, don't seek it out, but if it comes on TV during a slow day, you could do worse.","user":"Wizard-8","rank":[17,20]},{"title":"Val Kilmer is not like a good old wine","rating":1,"date":"19 February 2010","review":"The older Val Kilmer gets the worst he is.<br><br>Fatty, heavy, clumsy and without any ability to show any emotion. He looks like a stoned junkie.<br><br>The story itself is below average.<br><br>Double, triple, quadruple agents are messing with each other without any sign of consistency. <br><br>Boring characters, boring storyline, no acting, predictable outcome.<br><br>Everything is there to make you feel cheated.<br><br>The main disappointment is Kilmer. I think he is drinking too much. His face is puffy, he moves like a tired elephant.<br><br>Don't waste your time...","user":"szf61-666-876812","rank":[58,82]}]