[{"title":"Powerhouse performance by Donnie Yen","rating":8,"date":"14 December 2008","review":"Donnie Yen is a long time favorite of mine, although this is mainly due to his martial arts skills and screen presence rather than his acting skills. In Ip Man (or Ye Wen, as they were shouting in the seats next to mine) he delivers a truly solid performance on the acting side, carrying the burden of a nation on his shoulders with gravitas, at least that's what he conveyed to the audience at the cinema. They were actually applauding at times. Then again, moviegoers might be more absorbed over here on a regular basis. I digress.<br><br>I'm not going to delve deeper into plot details. The basic stuff is already outlined above, and I also feel the historical accuracy of certain events depicted can be debated. That's a bit of a moot point, though, since most people will watch this for the action scenes. Nobody will be disappointed. Donnie kicks twelve kinds of ass in this movie, and it is all accompanied by some of the meanest sound design I've ever heard. Every one of his rapid punches can be felt as he pummels the poor bastards in his way with the Ip Man-style of martial arts (imdb won't let me spell out the name for some reason). The final bout is epic,but for me it was one scene about halfway through that got my heart beating faster. It involves Donnie, ten Japanese karate practitioners and some of the most furious fighting I've ever seen on screen. You can really sense the anger of his character in this scene. Great stuff.<br><br>The film moves forward at a brisk pace and contains a surprisingly large amount of fight scenes. It totally lacks the vintage over-the-top-aesthetics of Donnie Yen's films of the 80's and 90's, but for some people that's a good thing. I personally think this is his finest performance to date. <br><br>Highly recommended for fans of martial arts cinema!","user":"DouglasQuaid","rank":[181,199]},{"title":"One of the best martial art films of this decade","rating":9,"date":"10 January 2009","review":"Excellent direction, photography and set design enliven this account of Wing Chun instructor Yip Man's life before he moved to Hong Kong. Every Wing Chun instructor today tries to make a lineage connection to Yip Man to legitimize their teaching so he is a very important figure in Kung Fu. Donnie Yen portrays the master with intense reserve and is possibly the best acting in his career. It surprised me for sure.<br><br>The story line of this film is invented as historical accounts show Yip Man to have been a police officer in the time frame this film covers, not staying at home and only practicing kung fu as depicted here. Also the film claims that he refused to teach anybody but that is also not true. He left for Hong Kong a few years after WW2 not in the middle of it as this film presents. The plot with the Japanese army seems invented although they did ask him to teach the troops which he refused. <br><br>However the film muddies up the historical record, that is not to say it isn't a great film. Sammo Hung's choreography is exceptional and a throwback to his great kung fu films of the early 1980's. The martial arts are done with great respect to traditional styles although some wire work is used to assist the actors with the difficult acrobatic moves. No flying across the room in this film. <br><br>Although the ending is a little abrupt, this is one kung fu film that can be recommended to people who don't like these films. Highly recommended.","user":"ChungMo","rank":[117,129]},{"title":"Energetic & brilliant HK action drama","rating":9,"date":"18 December 2008","review":"This is Donnie Yen's best acting piece for awhile now, and he still delivers the action sequences brilliantly. At 44 years of age, he looks so energetic, confident and charismatic. I believe the combination of Yen, Sammo Hung and Wilson Yip is the right choice for this particular film and fighting style. Wing Chun is best depicted without the flamboyant ballet of acrobatics often seen in other wushu films.<br><br>The movie doesn't dwell on historical accuracy, but rather use that settings to set the mood, deliver the message and simply tells you the life journey of a Grandmaster in an fun and entertaining way.<br><br>I remember that Richard Attenborough said (regarding Gandhi) that there was no way a director/movie maker could encompass and depict a person's life journey in only a 2 or 3-hour movie. But rather one should aim to emulate the spirit of that person, and the message/lesson of his story. I think this movie does that, with a quality production that raised the bar for period drama.<br><br>My rating is missing 1 point because I feel that there were plot devices that had been done-to-death before in other movies like: Fists of Fury, Fearless, Kill Bill, etc. However, Yip Man simply turns the notch to a higher sound-beating level.<br><br>Don't miss this on the big screen!","user":"Akira-36","rank":[115,129]}]