[{"title":"Awesome suits","rating":7,"date":"24 February 2020","review":"This movie contains some throughly enjoyable moments that are on par with some of Downey Jnr's highlights as Tony Stark. The relationship between Pepper and Tony is taken further and built upon brilliantly in this movie. It contains some really cool and innovative action scenes which are taken for granted now. However the poor villain, a pattern in Iron Man Solo Outings, and the lack of direction meant this is easily the poorest Iron Man Performance. It's still an entertaining watch but you wouldn't be wrong if you skipped this movie when rewatching MCU Classics.","user":"MR_Heraclius","rank":[39,42]},{"title":"Very mediocre and didn't live up to the hype","rating":6,"date":"26 December 2018","review":"Iron Man 2 isn't as bad of a movie that people say it is, although it isn't great either.\nIt is one of the weakest movies in the MCU, which was a surprise especially when Iron Man 1 was one of the best MCU movies.<br><br>Tony stark doesn't have the same motivations and doesn't care if people get hurt, which is completely out of character for him, since he started being a Superhero because he realized how many people his weapons were harming.<br><br>Not a good movie, watch it only if you really like Robert Downey Jr. Otherwise skip this movie.","user":"andreasilmjarv","rank":[9,11]},{"title":"Iron Man 2 is Totally Worth it.","rating":8,"date":"10 May 2010","review":"For some reason this movie had not been getting the greatest critic reviews. I do not understand that at all. I thought the movie was very enjoyable and a successful sequel in the series.<br><br>For anyone who has seen the first Iron Man you can expect much of the same in this movie. Robert Downey Jr. plays Tony Stark like he is meant for the part. He has the same sarcastic wit and self-confidence that is evident in his other movie roles. Gwyeneth Paltrow, as Pepper Potts, has a comes more to the forefront in the sequel. I also personally love that Jon Favreau is the driver for Stark/Potts, and that he gets into the action a little bit. You have to respect the director for that, even though Jon has done plenty of acting himself.<br><br>Normally in when they replace someone in a sequel with a different actor/actress I am very upset. However, Don Cheadle replacing Terrence Howard in Iron Man 2 as War Machine/Lt. Rhodes made me happy. This is similar to what happened with Maggie Gylenhal in the Dark Night.<br><br>Samuel L. Jackson playing Nick Fury has a bigger role, and it leads all the viewers into wanting The Avengers movie to come out immediately. Scarlett Johansson also showed up with some impressive stunt work, along with her always gorgeous looks.<br><br>All in all it was a well done sequel. The plot is not too convoluted to follow. The new villain, played by Mickey Rourke, is very impressive and fun to watch. The action scenes are all entertaining but they do not completely drive the movie. The only thing that I wished for leaving the theater was a longer final fight scene.<br><br>Also, make sure to watch after the credits!! It is short, but worth it.","user":"BwSwim","rank":[156,279]}]