[{"title":"Paradise it is not!","rating":2,"date":"19 September 2013","review":"After an interesting start, Paradise plunges to the depths of pure boredom and a waste of time. When the lead character meets Russell Brand after about 15 minutes, the movie's whole direction changes and becomes close to unwatchable. Not that it's Russell Brand's fault, the film becomes stagnant and never regains any momentum. Interest wanes and the story lacks any coherent reason to continue watching. The film is not well constructed and I found myself asking why it was ever given a green light. The writing lacks any bite save for the opening and it is a waste of time. It almost plays like a Lifetime movie and I avoid those films like the plague. I saw this film on my cable provider's Video On Demand, it has not been released in theaters yet. I think this is done to generate revenue when they have a questionable title that they feel will not do well when it is released. When they do this, little is known about a film so caution should be used. I should have taken my own advice!!","user":"iraz","rank":[46,71]},{"title":"This should have been a lifetime movie, not something you pay to watch","rating":3,"date":"27 October 2013","review":"This could have a great movie based on the cast alone - Holly Hunter, Nick Offerman, Octavia Spencer &amp; Russell Brand. It could have capitalized on Juliana Hough's singing talent in one or two scenes. The opening scene of a girl with a serious crisis of faith, gave a hint of a comedy to come. No such luck. When sheltered country girl Juliana Hough decides to leave her small religious community after surviving a horrible accident and go to Sin City to experience life's naughty pleasures, there's a premise (Don't let those previous fool you!) that this could be funny. It's NOT. The first sign of this is when she makes offensive comments about Muslims...and shortly later, about Jews. Not funny, just racist. During her travels, she meets a charming bartender played by Russell Brand &amp; a disillusioned lounge singer played Octavia Spencer, and I hope things will pick up. In fact, I hoped I'd hear Octavia &amp; Julia sing together by the end of the movie. Nope. Russell Brand's witty commentary is not enough to save this dreary movie. Octavia is relegated to dispensing dime store wisdom. There isn't much of a plot. It's not funny. It's not moving. In fact, it's rather contrived. At one point, I thought I was watching one of those Christian movies, and I'm still not sure I wasn't. But one thing is for sure: I was terribly disappointed in such a waste of a great cast and a potential for a great movie plot.","user":"caroltaylorrecruits","rank":[20,33]},{"title":"Even if you're stuck inside recovering from burns, watch something else","rating":4,"date":"5 January 2014","review":"3.9 of 10. No excuses for Diablo Cody with this film. She wrote and directed. Despite doing both, she once again shows she has only a grasp of satire the way a virgin has a grasp of sex. It's an improvement upon the Juno mess, but not much.<br><br>Cody seems to have a strength in ideas and setting up gags, but really needs help from a more expert story teller/director so her stories are something more than artificially prolonged Saturday Night Live gags. <br><br>As others have pointed out, it starts strong, much like Juno, then Diablo's lack of depth, knowledge, and creativity becomes exposed and turns the film into melodramatic tedium that only someone stuck in a hospital burn unit could enjoy.","user":"in1984","rank":[15,26]}]