[{"title":"Great Concept with Sloppy Execution & a Contrived Ending","rating":24,"date":"24 March 2011","review":"The concept of Limitless is fantastic - what would happen if you could take a pill (NZT) that would allow you to use 100% of your brain (instead of the standard 20%) and function on a level higher than you have ever functioned before? The possibilities for such a movie idea are well, limitless - pun intended - but unfortunately, despite some great acting, especially by Bradley Cooper, who plays Eddie Morra - the lead whose life the movie follows throughout it's duration, the film just could not overcome some major plot holes, sloppy writing and nonsensical moments.<br><br>LOTS OF SPOILERS...<br><br>Many times throughout the film, the script uses PLOT driven storyline instead of CHARACTER driven storyline in order to go from Point A to Point B which the script called for &amp; in the process, didn't make much sense given who the characters were in the picture. Some examples:<br><br>1) The movie needed for Eddie to find the NZT stash &amp; money in his Brother in Law's apartment, steal it, get away with it and then take the pill, feel the effects, and use the money to regain his life. Problem? It's absolutely ridiculous to imply that the cops wouldn't have searched him or at the very least patted him down after calling in a murder &amp; going down to the station for questioning. Of course, the huge wad of cash/pills he shoved down the back of his pants would have been found had they searched him so it didn't happen. It's illogical and absolutely ridiculous that he would be able to steal what he did from the apartment, an apartment that he locked himself in when the police initially arrived - and have no issues.<br><br>2) The movie needed for the Russian thug to come after Eddie in order to find the NZT, take it and then make trouble for him the entire movie. Problem? It's not believable that super smart Eddie wouldn't remember to pay back the 100k that he borrowed especially when the money was constantly on his mind and he had just made 2 million off of what he borrowed. This is clear cut plot driven over character driven storyline because it's ridiculous for Eddie, the character, to not remember such a basic task, especially when there was direct danger to his life if he forgot.<br><br>3) The movie needed for Atwood's lawyer to steal Eddie's stash of pills causing Eddie to spiral out. Problem? Isn't it far fetched to imply that Atwood's henchman killed the woman in the hotel to frame her murder on Eddie at the oft chance that Eddie would retain the same lawyer that worked for Atwood just so he could get close to him to steal his pills for Atwood to save Atwood's life? Huh? How did the henchman/lawyer even know that the pills would be on Eddie to take? They never used to be - the custom suit w/ hidden pocket was something new. He certainly didn't carry them on him back when the woman was initially killed. This whole setup was contrived and made no sense and was based on a lot of coincidences, ones that no one could have predicted.<br><br>That is just a few examples of sloppy storytelling. There are also a bunch of basic nit picks that I have like: 1) Why didn't Eddie, who was fearing for his life, buy a gun &amp; train how to use it under the help of NZT? He hires bodyguards and buys a fortress to live in but doesn't purchase a handgun? 2) Why didn't the scientists who made NZT take it themselves in order to use their super smarts to perfect the drug and make it what Eddie's scientists were able to create in the end without the aid of being under the drug's influence? 3) After drinking the Russian's NZT laced blood, why did Eddie lie there on the ground waiting for the henchmen to return so he could poke one in the eye w/ a needle? Why not get out of there? Did we really need that stupid fight scene? 4)Breaking into the safe with a chainsaw in minutes? Impressive 5) Is it really believable that NZT wouldn't have hit the black market and been all over the place?<br><br>Lastly - a huge problem I had with Limitless was the happy, Hollywood, contrived Ending. Withdrawal from NZT? Side effects? Once the drug wears off so does the heightened brain activity? No problem - the movie flashes forward 12 months to give Eddie Morra a rainbows, puppies &amp; sunshine like ending where his labs have now created a pill that works like NZT only there are no side effects and the super smart effects are permanent. How nice! He's all happy now &amp; brilliant forever &amp; running for Senate - he's with his girlfriend &amp; their ordering food and look, he's fluent in a foreign language because he's so smart and YUCK. The ending was so over the top in an 'everything worked out in the end' way. I hated it. I didn't need for Eddie to die or crash and burn or anything like that but Limitless took the concept of a happy ending to another level.<br><br>Also, with the ending comes a rushed attempt to villanize De Niro's character of Carl Van Loon who out of no where makes a pathetic power play by trying to blackmail Eddie &amp; is quickly shot down. The whole scene between them fell flat for me and felt incredibly sloppy and quickly put together.<br><br>Overall, in spite of all the shortcomings, Limitless is still a really good movie. It's thrilling, fast paced and the basic concept is interesting and makes for an entertaining film - you just can't really think about things like logic or else you will be disappointed. 7/10","user":"PhantomAgony","rank":[315,351]},{"title":"Where is the limit to our subconscious mind?","rating":7,"date":"21 March 2011","review":"The movie starts as a 'what if' story, turns into a mystery, and then transforms itself into a thriller.<br><br>The most interesting aspect of the film to me was its theme, namely the limitless potential of our conscious mind. Is our brain a treasure island full of hidden mental powers? At times we surprise ourselves by being able to recall a seemingly obscure fact deep in our memory vault.<br><br>Not a few things in the movie kept me on the edge of my seat: the known/unknown side effects of the drug, the shady haunting man, the powerful secret hanging by a thread, and the unpredictable story line.<br><br>The film slightly suffers from some loose ends, though. For example, it could do without the thug, and the murder at the hotel could have contributed better to the story line, if more elaborated.<br><br>I wish that the ingredients of the drug were rare and the drug itself was impossible to be recreated.<br><br>Overall, the acting was convincing and the special effects weren't distracting, but rather cleverly woven into the scenes.<br><br>Its ending was rather lame, IMHO. Why not leave us with some unanswered questions to lose sleep over? Well, I love dark endings, like the one in 'Somewhere carnal over 40 winks'.<br><br>Spoiler: The Matrix is mentioned in the movie.","user":"lcofeer4","rank":[142,170]},{"title":"Definitely a fun movie!","rating":8,"date":"11 March 2011","review":"If you've ever found yourself staring into nothingness, wondering why you couldn't muster even a hair of energy to get up and do something, then you're going to find this movie highly satisfying. Limitless takes you on a ride... and that's not an exaggeration. The computer graphics create a glimpse into what it would actually feel like to be a \"super-you.\" The writers also did a great job of creating a character that from the start... pretty much charms your pants off. Bradley Cooper actually surprised me. I never thought he was a bad actor, but he was able to honestly portray a guy that had absolutely nothing going for him and became a \"somebody.\" The movie graphics, plot, and main actors (well, DeNiro, Cooper, and Johnny Whitworth) were all intriguing. It's not just a movie about what crazy things some drug can make you do... it creates a discussion within each of us, \"What if you could unlock all the potential of YOUR mind, who would you be?\" Now the downsides... some of the supporting actors were very weak. Also, there were some scenarios that went off the deep end but actually had the audience laughing hysterically so it wasn't exactly a bad thing. If you thought you'd get a deep or scientific explanation for the drug... don't hold your breath. Thankfully the plot was engaging enough that you didn't really care. The movie had some interesting ideas but some that I especially loved were the ones about identity, and about taking something to make yourself better and whether that meant you were actually you or an altered you. Does it matter even? One last thing I gotta say though, the one guy, Johnny Whitworth, did a really great job. I hope he gets some major roles in the future because I think he's very talented. <br><br>I'd definitely recommend watching this movie. If only just for the ridiculous scene with the skates. Hilarious.","user":"deborapr87","rank":[179,227]}]