[{"title":"The Numbing. Destructive Silences of War Experience","rating":8,"date":"1 July 2010","review":"TRIAGE is a well chosen title for this film about who survives an who dies in war: at times those triage decisions are made by serendipity (read 'bad luck'), at times they are made by physicians or medics tending the wounded on the battlefield, and at times they are submerged in the apparent 'survivors' only to later crush the life from those who make it home. Writer/Director Danis Tanovic has adapted Scott Anderson's novel is a manner that carries the seemingly simple act of 'triage' throughout the film, showing how that action can affect the lives of friends, family, and psychological wholeness of the victim. <br><br>Mark Walsh (Colin Farrell, in yet another powerful role) and his buddy David (Jamie Sives) are war photographers for a newspaper edited by Amy (Juliet Stevenson). Their current assignment is Kurdistan and the terrifying realities they not only experience but also commit to film are of such a horrid nature that they both are in shock: they not only witness killings and landmine explosion deaths, but they also watch one Dr. Talani (Branko Djuric) triage the wounded, deciding who can survive care and who is so near death that they are put aside to be later 'executed' by Dr. Talani in a compassionate gesture to end their futile suffering. The tension is so great that David decides to return home, leaving Mark to carry on the assignment. An explosion occurs and Mark is seriously injured but survives and after being tended by Dr. Talani he is encouraged to return home. There is no news as to where David is. <br><br>Mark returns home to his adoring Elena (Paz Vega), presents his photographs to Amy, and begins to heal: David's wife Diane (Kelly Reilly) is due to deliver their first child in two weeks and has had no word from David. We watch as Mark, eroded by his experiences in Kurdistan, retreat into a state of decline. Elena grows fearful as Mark, despite hospitalizations and medical care, continues to deteriorate and out of desperation she calls her grandfather Joaquin, a psychiatrist who treated the victims of the Spanish Civil War (Elena is still angry that her own grandfather treated the perpetrators of the destruction that war caused). Joaquin slowly brings Mark into the acceptance of how his mind has triaged the events in Kurdistan and leads Mark to discover the truths about incidents in what war for which he has blamed himself. We finally understand David's disappearance at the moment when his and Diane's child is born. <br><br>This is a tough story to watch: subtitles would help the audience understand the many dialects used in the film. But the message is clear and the acting is superb by every member of the cast, even very small but cogent cameos by Reece Ritchie as a boy in Beirut and Dada Ashi as a Ugandan woman - two of the early incidents Mark must remember and face in his work with Joaquin. The cinematography is dazzling, especially the use of flashbacks of a raging river so important in Mark's memory recall, and the constant focus on the blue and yellow tags that mark the triage decisions. This is another powerful anti-war film, this time as seen through the eyes of a non-combatant observer. It is important to see. <br><br>Grady Harp","user":"gradyharp","rank":[55,59]},{"title":"Taut War Drama","rating":9,"date":"1 September 2010","review":"This film deserved better than a straight-to-DVD release.<br><br>The story begins in Iraqi Kurdistan, shortly before Saddam Hussein gassed thousands of Kurds to quell a rebellion. Colin Farrell and Jamie Sives portray two photojournalists who ride along with the rebels. Because the Kurds have no real army or government, medical care given to the wounded is...frugal. Farrell's character, Mark, converses with a doctor who believes in relieving people's suffering. Mark initially finds it hard to understand the doctor's point of view. Sives' character, David, decides to quit rather than take one more chance and starts a long walk back from the front lines. The next thing we see is a wounded Mark (Colin Farrell) and we don't know what happened to David.<br><br>The rest of the film takes place in Ireland, sort of. It moves back and forth from scenes of Mark's life as the traumatized husband of a beautiful woman who feels locked out by his shell-shocked remoteness, and Mark's various wartime memories, as he describes them to his wife's grandfather, a therapist who once treated war criminals. The therapist starts to figure out from the threads of Mark's different stories what might have happened to David. What is fascinating is Mark's unconscious selection of images from his mind that inadvertently reveal the truth to the therapist. As a therapist myself, this was the most interesting part of the movie for me.<br><br>Farrell convincingly portrays a man wracked by grief and guilt. Christopher Lee is excellent as a somewhat egomaniacal healer whose political views differ from those of his daughter. The rest of the cast is also good and Paz and Farrell seem to have sexual chemistry.","user":"nyshrink","rank":[20,25]},{"title":"If you think there are too many anti-war films out there, think again!","rating":10,"date":"25 March 2010","review":"Being a fan of Danis Tanovic's films, I couldn't wait to see his third movie Triage\". I finally watched it last night, of course, a pirated copy of the film, which still did not spoil the film for me, not even one bit. The reason why I mention these technicalities is basically just to say that not even poor sound quality compounded by a frustrating inability to appreciate fully the whole atmospheric environment that Danovic creates for the viewers with much finesse and eye for detail, takes away from the fact that this is simply a film worth watching. I tend to think that movie aficionado from the third world, being forced to choose between watching pirated copies of films that never make it to the local cinemas and not watching them at all, are actually watching these films stripped of all their non-essential elements. If the movie passes this test, I think it can be safely said that everyone's time, the film crew's time and the audience's time has been used to a good effect.<br><br>Before seeing it, I knew that the movie was about a photographer going to the war zone. That alone would have been enough for me to decide against spending 99 minutes of my otherwise super exciting life on it had someone else directed it. I say this because I myself watched them take photos of people running for their lives in the streets of Sarajevo. I vividly remember one of them taking a photo of a woman running over the stretch of the road that was exposed to sniper fire with canisters in her hands unsuspecting that having reached safety she would start hitting him full force with those canisters out of sheer frustration. On the one hand, it's not like he could have asked for her consent to be photographed in not too dignified a pose. On the other hand, one may say that being too preoccupied with survival she is not even remotely thinking at that moment about how this and no other photo may turn out to be the most symbolic of her plight. Not to digress too far, Colin Farrel's character in the movie and his best friend are off to Kurdistan to capture with their cameras yet another offensive in the two centuries long history of warfare in that country. This is the land where the situation spinned out of control long time ago. These are the people who live out their existence stripped of any real choices. It is this lack of choice and the bravery with which ordinary men like Dr Talzani and Cristopher Lee's character face it that form important aspects of this anti-war film that is so much more than that. As for Mark Walsh (Colin Farrel), his drama is taken to the extreme, probably the extremest I've seen on film recently. I will stop here in order not to spoil the film for those of you who may read this and haven't seen it yet.<br><br>Finally, let me briefly respond to some of the criticism leveled against Triage\". In some comments it is said that it should have been shot in Kurdistan with more Kurds in it to add to its authenticity. Well, production-dictated requirements aside, No Man's Land\" was shot in Slovenia and it does not take away from the movie's authenticity. Besides, he wants his movies to be universal, hence the references to different places across the globe in this movie. As for the comment about the relationship between characters being strained and used solely for the purpose of delivering big lines, I must say that I did not detect that strain while watching the movie and though it may be because of the poor sound quality of the pirated copy, I'm more inclined to attribute it to Tanovic's habit of using dialogue as if he was staging a play and not directing a film. To those who call him an amateur, Tanovic so far worked with Katrin Cartlidge, Miki Manojlovic, Emannuele Beart, Branko Djuric, Colin Farrel, is friends with great film-makers such as Mike Leigh, made his three feature films in three different languages and won positive acclaim at big international film festivals. I rest my case.","user":"kodpropalogfudbalera","rank":[31,46]}]