[{"title":"Astounding Downfall","rating":4,"date":"6 March 2015","review":"Whatever resulted Serena can be enigmatic. Visually, the movie has a lot of beautiful shots. There's also great talents among the cast. The story seems like it is meant for a powerful tragedy, but these assets however lead to a rather dreary, unfocused drama, that doesn't quite live up to its ambition. Even with the looks of a grand and dazzling piece of cinema, the film doesn't come close with that worth. And it's a truly frustrating thing to look at a movie with such strong potential become a strange mess.<br><br>The story is basically an old fashioned American drama about a man, who manages a timber industry, oppresses his ambition that leads to numerous unfortunate events. The core here is a love story in which its romance is often nonexistent, we hardly get to see how they fully develop their relationship. But there is still an interesting growth within these rich details. But the movie is too scattered with various subplots that each takes over the entirety. There is too many conflicts, like they are mostly separated into a whole new different story, unable to say a single or definite point. The third act becomes a weird flood of consequences that doesn't necessarily gain any deserving depth.<br><br>There is so much going on with the story, the film also manages to shift it into several tones. It goes to art-house calmness, a showy drama, and then even has a preposterous climax. The worst of it indeed never fits in to its stunning production values. The film seems to be too reliant on what it has. It has captivating cinematography, impressive production, and even the actors are just doing what they believe they can do to make this movie work. Jennifer Lawrence and Bradley Cooper are the main attraction here, while they try to bring something to the table, the movie remains to be dreary for not letting the two have an actual engaging moment together. The pacing is reasonably slow, but sometimes it becomes an obligation than another moment to thoughtfully breathe.<br><br>Serena is a pretty strange film to encounter, one that has its best potentials fall apart into a surprisingly dull cinema. It's still fascinating to see what it has: great cast, striking images, richly defined context, and gripping drama (if only it has more time to actually develop them), but it really doesn't have an exact intention. And the story keeps on going, still failing to be actually engaging. This is an obvious lesson about creating cinematic drama, when things needed real definition on what's going on and who the characters are, than just throwing them away with stuff that could gloss over its half- baked narrative. Even the presence of the ever appealing Jennifer Lawrence and Bradley Cooper couldn't overlook the entire film's unimaginable flaws.","user":"billygoat1071","rank":[59,70]},{"title":"You took 18 months to do about 2 months work producers!","rating":3,"date":"3 December 2014","review":"\"I've think you've taken nine months to do about six months work.\"<br><br>It's funny that Jennifer Lawrence was given this line in a film that took over 18 months to make during post-production because for what it is, this could have been edited much better in two or three months. The narrative feels choppy and instead of focusing on the characters in this period piece they move the narrative from one act to the next without ever giving the audience anything to chew on. This is simply a flat period romance with very little chemistry that misfires on all cylinders (editing, casting, and screenplay). You can't help but feel that there is another film in here somewhere that got lost in the editing room. Serena seemed to be a film aiming for Oscar gold because it had everything going for beginning from the romantic pairing of Jennifer Lawrence and Bradley Cooper after their incredible success in Silver Linings Playbook. Add the solid Danish director, Susanne Bier (In a Better World), and a script based on Ron Rash's 2008 novel to the mix and Serena seemed to be a sure bet. I had high expectations for it and many were already including it as a contender for next year's Academy Award even before it finished being produced. How could a film like this end up being so forgettable and predictable at the same time? I'd guess the blame relies on the producers who tried to cash in on Lawrence and Cooper's success by centering the film on the romance instead of focusing on the other interesting cast members. The romance never works here because the characters are never fully developed so there is no way we can invest in their relationship. The amazing chemistry these two actors had in their previous film is completely wasted here. Everything about this film seemed disconnected and I am sure it won't live up to the aspirations the producers and critics had for Serena. <br><br>I have genuinely enjoyed all of Jennifer Lawrence's performances up to this film. The setting in the woods reminded me of the first time I saw J-Law in Winter's Bone, a film so richly invested in character development that I was expecting her to deliver another outstanding performance. That comparison to Winter's Bone only ended up disappointing me. She is extremely over the top in this film and the emotional scenes she gets are never believable. The scenes where she breaks down and cries were painful to watch. Bradley Cooper loses his charm as well, but I guess the blame relies on the script. If you are trying to deliver a strong romantic period piece you have the right actors to do so, but the script doesn't help build the romance. Bradley Cooper's character catches up to J-Law on a horse and asks her to marry him and then they are married. The entire film felt sort of chopped up and fast forwarded to the key parts of the story without taking time to give the characters any depth. About 15 minutes into the movie I knew where everything was heading and it was a huge disappointment for me because I expected a lot more from this film. The secondary cast is interesting, but unfortunately very little time is given to these characters. Rhys Ifans, Toby Jones, and David Dencik are extremely talented actors and I wish the script would've given them more time. Unfortunately Christopher Kyle's script misses the mark at every turn. The only positive thing about Serena was Morten Søborg's beautiful cinematography.","user":"estebangonzalez10","rank":[66,87]},{"title":"3/10","rating":3,"date":"30 October 2014","review":"One of the most angry experiences I've ever had in a cinema. For a movie that is literally about nothing, that makes no point and had no dramatic core I was surprised that I could take at least a couple of things from it.<br><br>It does have a number of intense scenes that unfortunately stop making their way into the movie after half of the movie's duration. There is a very good reason for why these scenes have an impact and why the whole movie actually din't feel excruciating. That would be the cinematography. It is totally, absolutely gorgeous. The lighting is impeccable, the composition perfectly balanced and color is used to paint beautiful images. Thanks to this high-standard photography and the talent of its leads, \"Serena\" has the merit of bringing about 11-12 minutes to the screen of good material.<br><br>The remaining 95 minutes unfortunately are rubbish. When I'm saying that the movie has nothing to say I am 100% honest. It does not make any f**king statement. Moreover, there isn't a story, there simply isn't. I couldn't make heads or tails of what were they going for. It is so bluntly and arrogantly thinking its dealing with deep thematics and profound drama that it made me even angrier, I actually kicked the seat in front of me time and time again in desperation. The scirpt and the editing of the film are garbage. The first is melodramatic to the point of comedic, problem is it doesn't reach quite that level of exaggeration so instead of being so bad its good it ended up being plain out bad. The second is all over the place. Scenes are stringed together randomly and they don't take us to any place 90% of time. You'll be asking yourself \"Why am I f***king watching this?!\" infinite times. About one third of the movie is Cooper and Lawrence making out, having sex, looking emptily at one another or telling each other \" I love you\". I really had an overdose of the worst sentimentalism on the planet. The emotional and dramatic core of the movie are forgotten. Sometimes I thought that the director must have been joking with me in asking me to take seriously and emotionally this characters after the montage at the start. The score is as bad as everything above, it is manically manipulative and added a whole other significance to the word \"cringe\". Characters are in the movie for no particular reason and they are so badly defined that they made Cooper, Lawrence and Jones look bad actors. There's some talent there man! You're making single handedly look bad three of the best actors in the business. Hats off for that!<br><br>I hate this movie. The more I think about it angrier I get. Thank God, there were some very good scenes in there because with those missing and with no amazing cinematography I would have probably walked out of the theater for the first time in my life.","user":"James_De_Bello","rank":[75,100]}]