[{"title":"Hercules","rating":6,"date":"24 February 2020","review":"Someone had the incredibly stupid idea of showing Hercules' infamous tasks within the first five minutes and then tell a somewhat conventional story of antique battles and rebellion. The Rock is a charismatic hero and his team works, too. Without this cast this movie would have fallen to pieces. As it is, the action is decent, the result entertaining enough and thankfully it doesn't take itself too seriously. But still, whoever came up with this simplistic plot should be smacked over the head.","user":"MR_Heraclius","rank":[37,38]},{"title":"Surprisingly good","rating":7,"date":"31 October 2014","review":"A lot of people went into this movie with expectations that this would follow the mythology, and I think that's what let them down. However, as an artistic representation of not only the myths, but a possible truth behind the myths, this was an entertaining watch.<br><br>I'm only vaguely familiarly with the mythology, but I know enough to know the way it was represented. This film represents that mythology in a different way - more genuinely believable, and less fantastic - but blends the original mythos in in a way I found very interesting. A lot can be forgiven for an intelligent, new look at an old story, and I don't think this film needs to be forgiven very much at all.<br><br>The story was fairly well rounded with a some light/moderate complexity to it which was nice, and it was much less far-fetched than I thought it would be. The acting was - in general - excellent, with only one or two instances where I thought it was a bit too cheesy or overdone.<br><br>Dwayne Johnson was fantastic; having seen him in several films I was expecting a less solemn, more caricatured, performance. But he was excellent, and I have gained a little more respect for him as a serious actor (though I wouldn't cast him outside head-bashing quite yet).<br><br>Overall an underrated movie in my opinion, and definitely worth a watch if you like a good story.","user":"zaphodalive","rank":[103,135]},{"title":"Another case of false advertising","rating":7,"date":"8 August 2014","review":"Hercules and chums are mercenaries, pressed into service for Lord Cotys to put down a rebel uprising which looks likely to overthrow the throne.<br><br>The trailer teases this movie as being a myths and monsters movie: it isn't. It's a fairly routine swords and sandals actioner, and the mythical critters teased in the trailer all come before the opening title, and are either tall tales depicted, or things seen unclearly from a distance. What is left is a rather dark film with a lot of battle action, pitched uneasily at a level which is too graphic for family viewing and not graphic enough for those who like blood and dismemberment.<br><br>There is a single F word - unnecessary and out of place.<br><br>Dwayne Johnson does this stuff well - he looks good, has great physical presence and, even when the part is somewhat darker than usual, he remains very likable. The supporting cast are all quite good - it was interesting to see Rufus Sewell playing a goodie for once (kind of like a young Ian McShane even though McShane was also in the film, with all the best moments of humour), and John Hurt gets to play both ends of the spectrum, meek and scenery-chewing.<br><br>I quite liked this - it is certainly a lot better than this year's previous Hercules offering - but felt that it was a missed opportunity: they promised me monsters and then didn't deliver them!","user":"neil-476","rank":[150,201]}]