[{"title":"Good horror is hard to find....","rating":7,"date":"19 February 2011","review":"There are other reviews, this is just a comment. Movie is decent, ignore the haters.<br><br>Does have some issues (didn't know Nazi Germany was still fighting in fall of '45), plot meanderings, weak points and not exactly a master thespian cast but has some good horror moments, decent banter and semi-plausible character interactions.<br><br>The interesting thing about this movie is its orientation toward not showing the ultraviolence in all its dripping glory. The most visually graphic scene is when one character has his finger broken.<br><br>Personally, I am utterly sick of watching 80 minutes of CGI anatomy trying to take the place of a story. This movie has the sense to use the cutaway (ha ha) approach to violence and I respect it.<br><br>I would watch this movie 100 times over any of that Saw (post Saw 1, which I thought was pretty good) / Hostel torture voyeurism or Rob Zombie crap remake any day.","user":"L_Miller","rank":[19,25]},{"title":"Nothing Special Here..","rating":4,"date":"9 September 2009","review":"What can I say? It's a B-slasher flick with a pretty good cast and a weak plot. Really, the movie starts out very very weak. I was afraid it was going Disney horror on me. The script is really cheesy in the parts and the scares are so ridiculously stupid, it's not even worth laughing about. But as the film progresses the mood starts to change and the characters become more and more developed and the suspense starts to build. I really loved the character development here. I especially loved Mark (Dave Franco) who is really a funny, cowardly guy. He has some really funny back and forths with Lisa (Shannon Woodward) who is also very well developed and fun to watch. So overall, I liked the acting and characters. The plot was super weak. I didn't understand why in the world some random teenagers would care that much about going to that man's house. There reasoning was they wanted to know if that man was killing dogs. Well if he was, why wouldn't they just call higher authority to go check it out? Nope, they had to be on the case themselves. Which I suppose I can't fault since our little bleeders need a creepy place to get slashed away anyways. The deaths are all pretty well done, even though none of them are creative or gory in any way. It's very bland so I wouldn't recommend this to gore hounds.<br><br>The finale, which comes a bit too soon, is very predictable but it's still a nice little twist for this low-budget slasher. Even if it is a bit outlandish and confusing.<br><br>Overall, The Shortcut has it's moments, but overall it's an average B-slasher. Nothing more.","user":"TheyKallMeDood","rank":[22,33]},{"title":"Average film with excellent twists! Worth a shot.","rating":7,"date":"18 January 2013","review":"The Shortcut is another shining example of how one can almost never trust IMDb's rating system, or the users responsible for it. Either that, or I seriously don't understand the way it's supposed to be. However, if you do watch The Shortcut expecting a 5.0 rated film - you'll be very pleasantly surprised.<br><br>The way I see it, this film is divided into three parts. The first one is the longest and slowest, giving us the exposition and buildup which are quite good - family moves into a new place, the kids in school and their friends, the local urban legend of a place you shouldn't go to, the works! The second part starts about an hour after the beginning, involves a pretty nice twist and is much more fast-paced, with some cat and mouse chases just like in Slasher films. The final part is the ending, which completely blew my head off as I did not see it coming! I thought the film was above average but not by far, and then the ending really got it some more points.<br><br>The acting is good, especially by Shannon Woodward as Lisa. The flashes from earlier years were also well used, and the cinematography wasn't anything special but wasn't bad.<br><br>All in all, I really enjoyed this film, as I'm a sucker for good plot twists, especially towards the ending. The Shortcut, while not a masterpiece, is definitely recommended!","user":"nitzanhavoc","rank":[8,10]}]