[{"title":"Finally an Entertaining Doc!","rating":10,"date":"25 September 2012","review":"There's only one way to say it.... with a title like \"How To Make Money Selling Drugs\" it takes balls to put this film out on the big screen. Kudos to you!<br><br>This is an issue that effects us all... your either directly related in some way or indirectly related by paying your taxes...etc. Its relevant, always has been but especially now in 2012 the election year!!<br><br>I'm not going to spoil the film, but what I will say is that if you watch docs or you don't this is going to grab your attention and hold it. Yes there have been many other drug films, many! But not done like this, its high value and beautifully shot! Filled with great interviews and several celebrities that are directly influenced or effected. This is a film is worth buying. I know documentaries are becoming more and more popular but in my own opinion most of them are just plain boring, or just not visually interesting at all. This is not the case here! Right from the start, great characters, great story and very informative! A great angle on the drug war and one that felt balanced on both sides. There are some deep moments but the theme keeps this one from getting too dark, which I personally liked. I hate the empty hopeless feeling from some docs....uh.<br><br>However definitely stay till the end as the initial hook is much deeper set and the film continues past the opening eye candy of reeling in large dollar bills. There is a message for you.<br><br>Certainly a deeper appreciation was felt for people on both sides, how quickly we have been to judge in our society or get behind polices that just sounded good, but no one cared enough to see who is affected.<br><br>Hope this review is helpful to those in doubt. Obviously I liked the film and I know its hard to tell from a good review whether to watch but if your in doubt on this one...don't be! How To Make Money Selling Drugs is fun, driven and very entertaining. Go for it!","user":"fightobservant","rank":[45,52]},{"title":"Creative portrayal of a popular topic","rating":10,"date":"28 October 2012","review":"I think that we can all agree that a documentary about drug dealing or drugs wars is not a particularly new subject matter. I have seen many documentaries and television shows that discuss such topics. But I am happy to report that this documentary is not like the rest. It is a totally novel discussion and portrayal of what it takes to rise in the ranks, paired with engaging and entertaining narration, followed by a powerful message that left me thinking about the subject matter for hours, if not days thereafter.<br><br>I was captivated by not only the pace and dialogue, but the talent of the film. <br><br>I am interested to see what the future holds for this movie, and I am certain it will gain a huge following and critical acclaim. It's definitely one to watch.","user":"manerkan","rank":[38,45]},{"title":"A Definite Yes","rating":10,"date":"14 November 2012","review":"I had the pleasure of attending a screening for How to Make Money Selling Drugs and I have to start out by saying that it is a definite yes. <br><br>This is not your typical documentary. This is a really captivating story that paints an overall picture by allowing the viewer inside of each step of the drug wars and drug dealing businesses both in our country and internationally. The viewer is brought into so many different people's lives and so many facets of the drug wars that you are left whole when the film ends. <br><br>The film is funny in a genuine way, yet powerful at the same time. I will reiterate that it's something to put on your radar.","user":"brandon-peril","rank":[31,38]}]