[{"title":"Enjoyable, philosophical, unspectacular, but full of seasoned talent.","rating":1,"date":"1 November 2013","review":"\"The love of our private friends is the only preparatory exercise for the love of all men.\" John Henry Cardinal Newman<br><br>Last Vegas is promoted by some as a geriatric Hangover; it's not quite. It's rather a sometimes poignant if lighthearted comedy about friendship and love with a dash of philosophizing about growing old. Three sixty- something buddies have a bachelor party in Las Vegas for their equally aging buddy who is marrying a babe over half his age.<br><br>The usual bachelor party tropes are there: swimming pools, buxom girls, extravagant digs, gambling, drunken partying, and pappy love, among others. But lacing through this usually freewheeling, adolescent humored romp of a cliché are some thoughts about their 60 years of friendship and what it brings and demands.<br><br>Most importantly is the rivalry between Billy (Michael Douglas) and Paddy (Robert De Niro) over the girl who got away from Billy and married Paddy. How her death affects their friendship is touching if not overly sentimental but real as it continues to color their lives to this day. How it shapes the weekend and Billy's marriage takes the film beyond Hangover and Bridesmaids.<br><br>Absent are scatological humor or retching; those staples of current buddy comedies are not in the least missed. Each other friend has his issue as well: Sam (Kevin Kline) his true love for his wife, who gives him Viagra and a condom for the trip; and Archie (Morgan Freeman) his over solicitous son. Director John Turteltaub and writer Dan Fogelman treat the hang-ups with gentleness, never extending to slapstick the important challenge of each life brought into relief by the trip.<br><br>Last Vegas is a diverting enjoyment, most of which is watching highly successful actors as if they've worked together forever, when in fact they never did. Movie magic and friendship themes make this a comfort film among too much glitz on other screens.","user":"jdesando","rank":[91,108]},{"title":"Surprisingly funny and awesome movie with surprising little twists that kept it fresh!","rating":17,"date":"17 October 2013","review":"I got the chance to pre-screen Last Vegas. I had to practically drag my boyfriend to the movie theater because he said he was not interested in seeing the movie but the tickets were free so he eventually caved. <br><br>The movie is what a movie should be, entertaining. Morgan, Kevin, Robert and Michael were so refreshing and funny together, they really played off of each other well and because of that the film moved along at a great pace. I hate when movies drag on and fall flat in the middle and that's when I start checking my watch to see how much longer the film is going to trudge along. Sometimes movies seem to stall in the middle and the drag on but this movie is almost two hours long and it moved along so seamlessly that the time just flew by.<br><br>This isn't a movie that's going to win any Academy Awards, it's not Shakespeare nor will it solve some huge social problem, it's just good fun that everyone in the audience enjoyed. If you are looking to just go to a movie for pure enjoyment and forget about the outside world for a moment, go see this movie, you won't be disappointed.","user":"tabithazietlow004","rank":[134,178]},{"title":"Very realistic and true! If only Douglas repeated what he did in reality!","rating":7,"date":"1 December 2015","review":"I thoroughly enjoyed this movie. I wish there were more scenes of the characters as children. I am not in the age bracket of the actors, but could compare my own friendships with theirs. I love when movies show and even promote realistic relationships.<br><br>I hate how Paddy didn't get the girl and was even told that his wife only stuck with him because his first choice said no. It left a bad taste in the mouth. There should have been at least 2 older ladies in the film. one for each of them! I loved Morgan in this film also. Very funny. You will find there are some great one liners in this film.<br><br>Age is just a number... for everything EXCEPT true love. You can start something new everyday. A new business venture, going back to study, travelling, you name it! But there is something very endearing about couples who choose to grow old together or with someone of their own generation. I think Billy and men like Billy (was), ARE fearful of growing old. And then some are just straight up jerks! All in all, a great film to watch with friends.","user":"Yasmin_07","rank":[12,13]}]