[{"title":"Who You're Gonna Call?","rating":3,"date":"30 October 2019","review":"A taxi to get you outta here of course.<br><br>This film was funny. I yet have to see a good gender switch, and have stopped watching them in any case, but for Pete's sake, what is with the compulsion to make more of these remakes and reboots?\nGhostbusters had Sigourney Weaver being all thin and flaunting. 2016 has arrived and Hollywood makes women ashamed of their bodies and puts them in fat suits or body suits or whatever and like the 'jokes' that is not funny","user":"tamiloreariz","rank":[109,125]},{"title":"Holloywood needs to quit remaking classics and start something fresh","rating":4,"date":"24 April 2017","review":"When I heard that they were remaking the movie Ghostbusters with female cast members, I admit that I was actually looking forward to it, specially considering the four particular actresses they had chosen for the part. I understood that movie remakes are typically the greatest, but considering the fact that 3 out of the four cast members are currently or were once members of SNL, I had some hope. Unfortunately, Wigg's comedic talent wasn't able to shine with her boring character with a lack of personality, McKinnon's character was just upright stupid and unrealistic, Jones's character was just a black stereotype, and McCarthy's role lacked character as well. Many of the jokes just fell flat (Steve Higgins small role and joke with the middle finger, the won tons, Kevin's (aka. Chris Hemsworth's) logo scene, the thing with the hair dye at the end, and so on). Also, the had many references to the original ghost busters throughout the film, and yet I suppose the setting takes place in a universe where the original squad had never existed, it's like a slap to the face to the original cast. Sure they had Bill Murry and few other actors for the older version show up in a few small parts, but they play such tiny roles, and as different characters..<br><br>And what's the deal with remaking older movies with female actresses or poc as the main characters. Don't get me wrong, there's nothing wrong with Hollywood wanting a bit of diversity in their work, but they're doing it all wrong. While this movie has good intentions when trying to cast female members, I guess either to have more representation for younger girls to look up to or show that women are equal to men or whatever, but when they try to do with a remake of a movie that was already amazing, it only makes matters worse. This movie will be forgotten within a few years from now, unlike the 1988 version, which most people had at least heard of reguardless of age before this one. On second thought, this movie isn't trying to create diversity, they're doing this for profit. They know that with the adults and their nostalgia these days, and with the younger now being obsessed with the classics due to them being conditioned to think that everything from their own generation sucks (which is clearly saying a lot about the older generation ironically, they're the ones whom produce our movies, not us), they can get some quick and lazy bucks by bringing back a film that should've been left alone in the first place instead of thinking up of a new script and story (that of which could also have female and/or poc leading characters), because they know people are more drawn to things that they are familiar with (as was I obviously). Whatever, I'm so done with remakes. There are many movies out there in today's time (yeah they exist) with original plot lines that are currently or were recently successful in the last year or so, so why watch a crappier version of a movie you've already seen before?","user":"elizy-33092","rank":[530,639]},{"title":"Just Like All The Commercials On TV","rating":1,"date":"31 January 2019","review":"The women are bright and sparkly and smart and oh so tolerant of the stupid ditzy husband/man/boyfriend.<br><br>What a cliche.<br><br>Shame on all concerned (especially the so-called man in this film).","user":"o-99047","rank":[333,398]}]