[{"title":"A worthy new version of \"Jane Eyre\" with marvelous visuals and excellent performances","rating":9,"date":"8 March 2011","review":"Charlotte Brontë's \"Jane Eyre\" has been my favorite book since I was 11 years old. The tale of a feisty orphan-girl-turned-governess who finds true love in a spooky mansion and ultimately redeems a tormented hero has made it to the top of every \"Best Love Stories\" list since it was first published in 1847, and with good reason. It's the perfect Gothic novel, melding mystery, horror, and the classic medieval castle setting with heart-stopping romance. <br><br>There have been at least 18 film versions of \"Jane Eyre\" and 9 made-for-television movies--27 in all! I have seen most of them, some multiple times–-both out of my deep love for the tale, and as part of the research for my novel \"The Secret Diaries of Charlotte Brontë,\" the true story of Charlotte's remarkable life, her inspiration behind \"Jane Eyre,\" and her turbulent, real-life romance.<br><br>Every screen version of JANE EYRE has its merits. I especially loved Timothy Dalton's portrayal of Mr. Rochester in the 1983 mini-series, and the 2006 Masterpiece Theatre mini-series starring Ruth Wilson and Toby Stephens. I was very curious to see how the new JANE EYRE adaptation from Focus Films would measure up. I am happy to report that the film, which I saw last night at an advance screening, is very good indeed, with marvelous visuals, terrific performances, and enough unique elements to make it a worthy new addition.<br><br>The most notable distinction that sets this film apart from the rest is its structure. Rather than telling the tale in a linear fashion, it begins at a crisis moment later in the story, and tells the majority of the tale in flashback–-which works wonderfully well, enabling screenwriter Moira Buffini to effectively compress a long novel into a two-hour time span.<br><br>The movie opens as Jane is fleeing Thornfield after having discovered Mr. Rochester's dark and heartbreaking secret. We fear for her as she becomes lost on the stormy moor. The mystery continues as St. John Rivers (well-played by a sympathetic yet appropriately stern Jamie Bell) and his sisters take her in. As Jane ruminates about the past events that led to her escape, we are treated to the story in flashback.<br><br>The casting of Mia Wasikowska as Jane Eyre also sets this production apart, since she is closer in age than most actresses who've played the role to the character in the novel, who was about 18 years old in the Thornfield section. Although I wish Mia's Jane was a bit more \"swoony\" over Mr. Rochester earlier on (yes, she is supposed to be stoic, but I missed that phase where we get to see her blossom as she falls in love with him, and then is utterly crushed when she believes him to be in love with Miss Ingram), Mia truly inhabits the role, beautifully portraying Jane's sense of self-respect, integrity, and restraint, as well as her passion and vulnerability.<br><br>Michael Fassbender embodies Mr. Rochester with the ideal blend of charisma and sinister brooding, while at the same time allowing glimpses of his underlying desperation and the wounded depths of his soul. Sally Hawkins as Mrs. Reed effectively portrays the icy ogre who menaces the young Jane (a spirited and appealing Amelia Clarkson.) And Judi Dench, as always, gives a superb performance as housekeeper Mrs. Fairfax.<br><br>The film's locations do justice to the novel's often gloomy, atmospheric tone. Director Cary Fukunaga makes excellent use of Haddon Hall in Derbyshire, one of the oldest houses in England, as Thornfield Hall, emphasizing its dark, Gothic, masculine feel. The exterior locations--gardens, cliffs, craggy rocks, stone walls, and seemingly endless fields--make an arresting, dramatic backdrop for the story. You truly feel as though you are in the middle of nowhere.<br><br>My only minor gripes are that when Mr. Rochester's secret is revealed, it feels a little too prettified, and the ending was too abrupt for me. But that aside, the filmmakers have done a masterful job translating the novel to the screen. I highly recommend it! --Syrie James","user":"authorsyriejames","rank":[174,200]},{"title":"A worthy adaptation... but left me wanting more","rating":7,"date":"28 March 2011","review":"The oft-filmed Charlotte Brontë's Gothic novel has been adapted into TV and film more than two dozen times. Here's a summary of what works and what doesn't in this 2011 version:<br><br>THE GOOD: <br><br> Cary Fukunaga's direction. He preferred natural light for much of the film, forgoing camera lighting and instead opted for candles which created the proper dark, moody and gloomy atmosphere that matches Rochester's temperament perfectly. He used some hand-held camera work to great effect, but not too much so that it became distracting. Thornfield Hall, Rochester's expansive mansion looked like something Count Dracula could comfortably settle in. It practically becomes its own character here and adds the necessary spookiness we come to expect from this Gothic tale.<br><br> Judi Dench as Mrs. Fairfax – When does Dame Judi ever disappoint? Apparently never. Even in small roles, the scenes she's in are one of the best ones in the movie. There was an important scene involving Jane and Rochester where Mrs. Fairfax didn't utter a single word, but she made quite an impact just with her expression.<br><br> Mia Wasikowska as Jane. A lot of the issues I have with literary adaptation is that the supposedly plain heroine usually ends up being played actresses who are too glamorous for the role. Fortunately in this one, Wasikowska was believable as a plain young girl, though she obviously is a pretty girl. At 18, she's also the perfect age for the role. If I were to nitpick though, she's not exactly 'little' as she's described in the novel as Rochester doesn't quite tower over her. In any case, I thought she did a wonderful job carrying the film. She captures the essence of the strong-willed character who holds her own against her much older subject of her affection, and one who despite 'not being well-acquainted with men' doesn't seem intimidated by them.<br><br> Michael Fassbender as Rochester. In many ways, we evaluate a Jane Eyre adaptation by its Rochester, and as long as we use that 'calculation,' I think he measures up quite well. He has a strong screen presence and is the kind of actor who's usually the best thing even in a so-so film, and he makes the most of what's given to him. Even with the relatively short screen time, which is less than what I had hoped, he's able to make us care for Rochester. <br><br>THE NOT-SO-GOOD: <br><br> This cliff-notes version feels way too fast. With a complex story like this, no doubt it'd be a challenge for any filmmaker, no matter how talented, to pare it down into a two-hour movie. So it's inevitable that this film just moves along too quick for me. Of course that is not Fukunaga's fault and he really made the best of it, but still this version just leaves me wanting more. I guess this is perhaps a more 'accessible' version for the crowd that otherwise would not watch JE. But to me, the story is compelling enough that an extra half-hour would only enhance the viewing experience and allow enough time for the characters to develop an authentic connection.<br><br> Dialog omission. This is perhaps a result of being 'spoiled' by the comprehensive 1983 version (which at 5.5 hours is perhaps the longest screen adaptation). Of course it's impossible to include every single dialog from the book, but I was hoping at least some of the important ones are kept. The famous quotes such as \"I am no bird; and no net ensnares me\", \"Do as I do: trust in God and yourself\", \"Reader, I married him\" are not spoken in this adaptation. I also find some of the delivery lacks bite, y'know that certain oomph that an actor does to bring those timeless words to life.<br><br> Jamie Bell seems miscast. Now, keep in mind I really like Jamie as an actor and have said so many times on my blog (http://tinyurl.com/mozzs5) However, I don't feel he's right for the role of St. John Rivers. Firstly, when you've already got someone as striking as Fassbender as Rochester, I'd think the casting agent would have to find someone much fairer than he. No offense to Jamie, but that's not the case here and he certainly doesn't fit the book description of 'tall, fair with blue eyes, and with a Grecian profile.' Now, physical appearance aside, he also lack the solemn and pious sensibility of a Christian missionary.<br><br> Unconventional storyline – Moira Buffini's script tells the story in flashback mode instead of following the novel's linear storyline. The movie starts off right as Jane is leaving Thornfield, which is right smack dab where the main crisis of the story begins. Now, I can understand that it's done to make it less tedious, yet it gets confusing at times to figure out which part happens in the past or present. I think for someone not familiar with the book, the shuffled time line might be a bit tough to follow.<br><br>IN CONCLUSION, despite leaving the theater wanting more, I do think this is a worthy adaptation. The production quality is top notch, with gorgeous cinematography, affecting light work and music that serve the story well. There is even one scene of Jane and Rochester that Fukunaga took liberty with that's quite tantalizing. It caught me off guard but I must say that scene left me breathless and is an effective way to convey how much Jane longed for her true love.<br><br>But in the end, even though I adore Fassbender, he still hasn't replaced Timothy Dalton as my favorite Rochester. Sure, the production quality of this one is superior, but what makes a Jane Eyre story so fascinating and memorable are the heart-wrenching connection between the two main protagonists and the dialog spoken between them, so in that regard, the 1983 version is still the one to beat.","user":"FlixChatter","rank":[139,168]},{"title":"Best version yet! Wonderful, supreme film.","rating":10,"date":"18 March 2011","review":"As an avid fan of the novel, I was very excited to see this preview and I have waited anxiously for the film. I finally saw it today at the threatre and it was wonderful! Excellent. This is the best film version of \"Jane Eyre\" yet (and I've seen most of them.) This is hands-down the best CASTING for \"Jane Eyre\" yet. I have never seen a more perfect Jane Eyre, Edward Rochester, or Mrs. Fairfax. Period. Jane brought tears to my eyes so many, many times in this film. She was simply perfect. Small, soft-spoken, young, composed, graceful, dignified, and lovely in her uniquely plain way. And Edward Rochester? Wow --what a ruggedly handsome man! He was certainly not \"pretty-boy handsome\"; but rugged, masculine, with sharp features, a deep voice, and a sometimes abrupt and harsh manner. He was exactly as described in \"Jane Eyre!\" BRAVO to you both, Michael Fassbender and Mia Wasikowska!<br><br>In my opinion, Fassbender and Wasikowska have finally given us perfect embodiments of all we adored in them.... Jane Eyre and Edward Rochester--two of the most beloved fictional characters of all time. Brilliant performances, really. I am truly delighted.<br><br>The sets, costumes, lighting, art, mood, cinematography, and score were all excellent. I hope the Academy Award is awake and paying attention!<br><br>Loving the novel as I do, I found a few flaws I must mention: I didn't think Blanche was nearly pretty enough; Bertha was not frightening enough; Rochester's kindnesses to Jane were not displayed here (an audience member might wonder why she loved him as she did); St. John Rivers was a much harsher character here --not gentle and lovable as he was in the book; and lastly, the film was less than two hours long and therefore too much was left out of the story. I fervently wish it could have been 20 or 30 minutes longer. Another 20 or 30 minutes might have helped the audience understand even better Jane's desolate past, her fierce love for Rochester, and her bright future.<br><br>That may sound like a lot of criticism, but you must consider what a masterpiece the novel \"Jane Eyre\" is. The novel is often considered ahead of its time due to its masterful portrayal of the development of a thinking and passionate young woman who is individualistic, desiring for a full life, while also highly moral.<br><br>Overall, I highly recommend the film. It was artfully told. I cried; I gasped; I laughed; I flinched; and I cried some more. I know I'll enjoy watching it again and again.<br><br>THANK YOU to the actors, director, and everyone involved in bringing this film to its fruition. Hopefully, it will prompt new generations of fans to read the novel and fall in love with Jane Eyre, as so many of us have since it was published in 1847.<br><br>This film is beautiful, romantic, frightening, sometimes funny, and ultimately very moving. See it on the big screen at the theatre. I think you'll love it!","user":"dapplegrey13","rank":[107,143]}]