[{"title":"Dose of reality","rating":9,"date":"16 June 2014","review":"Fortunately, thriller is not dead. Hollywood thriller is a desiccated corpse. It somehow keeps plodding stealing good ideas from around a world. This movie is awaiting a remake in Hollywood. Can't wait to see that disaster. What makes this Swedish thriller fresh and original is the hefty dose of reality and interest in it's characters. They are not just a bunch of crooks and psychopaths, they are human too. Young Swede with expensive tastes and little money, Chilean criminal with dreams and the Serbian enforcer with an 8-year daughter to care for. We see the glimpse of what they are made of. Nothing overly heavy and preachy, but just enough to fell real and plausible. And that is what Hollywood doesn't do. The audience they aim for, pimply, computer game addicted, 14 year olds just don't have the patience for anything else apart from explosions and non-stop action. So, thankfully comes this brilliant flick with 2 sequels to follow.","user":"sergepesic","rank":[29,34]},{"title":"Great flick","rating":8,"date":"25 July 2010","review":"A really good action thriller with interesting characters. I do NOT think that they are plain stereotypes without Drott. On the contrary. You feel for them and it's easy to get engaged in their lives and all they experience. <br><br>The movie manages to bring forth some very sensitive moments as well as very brutal scenes with realistic violence. I especially likes the lighting when it comes to the technical part of Snabba Cash. I also liked the shots of some of the dialogue which i found innovative without being over the top. They made it very interesting to watch.<br><br>I usually look the other when it comes to Swedish movies but I really enjoyed this one. <br><br>I say watch it.","user":"daniel-836","rank":[51,75]},{"title":"Making money isn't easy","rating":9,"date":"21 December 2015","review":"What I really liked about this movie is that no matter where the characters were from, they had actors from that country playing them. This is how it should be done for all films. Many times in Hollywood movies, we see an English-speaking actor playing a foreign character and you can hear an accent. Hollywood thinks they can get away with it because the Americans won't notice. This may be true but this alone is worth 1 point out of 10. If I am watching some Serbians talking among themselves, I want it to be as real as possible. Only a Serb knows how to talk like a Serb and only a German knows how to talk like a German. And the same goes vice- versa, only an American should play an American. And that's what this movie has. It has actors that play characters from their homeland. <br><br>This film teaches you how quickly life can turn the other cheek, especially in the crime world. The innocence portrayed by our lead character JW, played by Joel Kinnaman takes you right into this. He gets himself involved in a world where he naturally doesn't belong by making an important decision at the beginning of the film. The movie takes you through all of his emotions as he learns more and more about this new world.","user":"LnBK","rank":[8,9]}]