[{"title":"Real film, real stunts, real actors and real fun","rating":8,"date":"4 July 2013","review":"You know the plot; you also know who is in this movie so lets get to it. Gore Verbinski has delivered a film that moves leisurely along peppered with rousing action sequences, comedy, villainy and pathos. It is solid entertainment. I would place this movie alongside Waterworld, The Last Action Hero, and John Carter as unfairly panned films which deserves to succeed in the cinema halls.<br><br>It is too bad that there appears to be a hate on for this movie simply because it seems that a lot of money was spent in its making. But look at it this way, when you hire real stunt persons, construct and destroy real trains and stage many stunts for real, it is not going to be cheap. I would rather support this type of movie-making any day instead of the tired CGI based effects laden yawners. Every penny of the budget is on screen in a beautiful shot and staged movie. I found it to be an enjoyable 159 minutes of entertainment.","user":"centralbeerangi-307-394889","rank":[538,707]},{"title":"6.4 rating? You can do better!","rating":9,"date":"24 June 2019","review":"I agree with what the other guy said. \"ignore the critics\" that's certainly all. This movie is much better than it's rating makes you believe, what a shame!","user":"officialnoonon","rank":[10,10]},{"title":"Wrong Brother.","rating":9,"date":"6 May 2014","review":"The early signs were not good, tales of production problems galore and early critical notices wading in to kick the film before it had even had a run at the theatres. The Lone Ranger seemed destined to be a blockbuster stinker. Yet in spite of it noticeably alienating original Lone Ranger purists, and some Western lovers as well, for a rollicking action fun packed time then Gore Verbinski's movie delivers in spades. <br><br>It's awash with the serial silliness of adventure films and TV shows of yore, pitching good guys against bad guys with buddy buddy shenanigans pulsing away at the core. The stunts are outrageously enjoyable, the landscape photography as beautiful as it is respectful in homage to past masters of the Western genre, while in Depp's Tonto there's a bona fide hero to root for just as much as he makes you laugh out loud. <br><br>This is an origin story, a tale of how John Reid (Armie Hammer) became The Lone Ranger, and of course how the noble steed Silver and Indian side-kick Tonto became integral to his villain fighting ways. Tom Wilkinson and William Fitchner file in for polar opposite villain duties, the former is the weasel business man trying to mould the West in is own image, the latter a repugnant psychopath with a penchant for eating human hearts! Then Helena Bonham Carter wanders in from some Grindhouse movie for a couple of cameos that are resplendent with sexual energy. <br><br>It's all very wacky and wild, and rightly so, but this is not at the expense of very good story telling. Some parts of the narrative could have been trimmed, but as the bromance builds between our two heroes, and Silver gets up to all sorts of comedy horse escapades, there's nary a dull moment here. Producer Jerry Bruckheimer and director Verbinski throw all the action staples into the pot. Chases, fights, swinging from ropes, shoot-outs, people dangling from speeding train (pic is bookended by awesome train sequences), grisly deaths and on it goes from start to end. <br><br>There's caustic asides to the machinations of organisations of the time, from railroad magnates to the cavalry, while the catchphrases and legends of The Lone Ranger TV series are deftly inserted into the tale. It was interesting to see Depp come out and defend the movie against those damning early critic reviews, it's not something he does, being as he is very much a guy who sees acting as just a job. Bruckheimer, Hammer and Verbinski backed Depp up, stating that some reviews were written before the film had even been released, the big budget and production problems clearly making this a big stinker <br><br>Not so, it's certainly not flawless, and those seriously into anachronisms are likely to have kittens. But if you haven't seen it yet, if you was put off by the venomous early reviews, then give it a chance, you may just be surprised at just how entertaining it is. It also looks and sounds brilliant on Blu-ray, where repeat viewings even show Hammer to be better than first thought as that masked man. 8.5/10","user":"hitchcockthelegend","rank":[88,112]}]