[{"title":"Afterlife","rating":6,"date":"6 March 2020","review":"Resident Evil: Afterlife attempts to take the series back to basics and delivers a campy action film that has fun with the material. In this chapter Alice searches for Claire and her group of survivors of the zombie apocalypse, which were headed for Alaska looking for the infection free zone Arcadia. Wentworth Miller joins the series and gives a strong performance. Additionally, the over-the-top action scenes are quite impressive, and bring a lot of energy to the film. However, things start to fall apart in the last act as the story goes off in some bizarre directions. Yet for a cheesy horror film, Resident Evil: Afterlife is pretty entertaining.","user":"MR_Heraclius","rank":[38,47]},{"title":"What once was buried, should have stayed dead","rating":1,"date":"7 October 2010","review":"While I usually refrain from writing reviews, RE: Afterlife was such an excruciating experience to endure, I had to somehow vent my righteous anger. Thus: the review.<br><br>While I quite enjoyed the very first Resident Evil movie (except for the CGI showdown), starting with Number two (Apocalypse) the movies went from thrilling, spooky zombie movies to something like a low-budget Zombie-Movie-in-the-Matrix. I say low-budget, because the special effects and action sequences screamed of cheap and shoddy work, the stories were laughable at best, and yet, here comes another entry in a series that should have stayed dead.<br><br>To see all of Afterlife's Non-Glory in 3-D, probably made it even worse for me. As much as I like 3-D movies, RE: Afterlife cannot be salvaged by anything at all, short of standing up after the first three minutes and walking out the door. Or maybe urinating on the screen, then walking out the door. Or maybe adding another dimension, time, which would allow me to go back to the beginning of the film and shoot myself repeatedly in the head. <br><br>Starting with the first (of many) utterly ridiculous action sequences, dominated by so-bad-it's-funny-in-a-sad-way wire-fighting and wire-wall-jumping, the movie actually manages to go downhill from there, which is somewhat commendable, since I thought it not quite possible to even get any worse.<br><br>What follows is an assembly of disjointed, poorly conceived action sequences, way too many slow-motion captures, incoherent story telling, continuity errors that made my teeth hurt, and then you realize that the movie has only been running for thirty minutes, and you ask yourself what you could have done in a previous life to deserve this. <br><br>The \"story\", if you want to call it that, is driven by ludicrous plot elements that only exist for the sake of driving a non-existent story ahead, while half of what happens seems to only happen in order to create the need for even more embarrassing zombie-killing action. Or poor attempts at creating some of that Wow-Feeling we all shared when we first entered \"The Matrix\".<br><br>As some critic once wrote about the new Star Wars Episodes (I-III), the Resident Evil movies offer great actors the chance for the worst performances of their lives. I am still astounded by the fact that Milla Jovovich has not filed a law suit against the producers for prolonged career murder or violent destruction of reputation.<br><br>I honestly cannot find more than two good things about this film, and I actually am an avid fan of the video game series, so seeing some familiar faces, as well as monsters, should have at least appeased my inner nerd-ness, but alas, it wasn't so.<br><br>As my final verdict, I will now present the two and only good things in this movie: 1. Ali Larter in wet clothes. 2. Kacey Barnfield in tight clothes.<br><br>The rest deserves to be laughed at, tarred, feathered, quartered, strangled, drowned, poisoned, stabbed, clubbed, and then buried in a toxic landfill next to the remains of Uwe Boll.","user":"urizen-7","rank":[106,154]},{"title":"Did we see the same movie?","rating":3,"date":"11 September 2010","review":"I'll be honest, I went to see this knowing it wouldn't be great. The 3D looked awesome, and I was excited to see Wesker. What I wasn't expecting was a dull, pointless, plot less, horribly-acted cornball \"action\" movie.<br><br>Milla has worn out her welcome as a poor-man's Angelina Jolie. I love her, I really do, she's one of my favorite actresses, but this has gone too far. That said...<br><br>Without trying to spoil anything, it seems that Paul Anderson had no idea where to go with this sequel, thus throwing everything out from the last film, (I wont go into detail), while shoving small things from the video game in, just to fill time and justify the 'Resident Evil' title. It falls flat, and leaves many of the scenes feeling unneeded and forced.<br><br>My MAIN grudge against RE:A is the lack of plot. I do like to see a good mindless action/horror film (Machete and Piranha are on my top 10 list already!), but this film took itself way too seriously, and forgot where the hell it was going at times. Taking a look back at the movie, it seemed like nothing happened throughout the whole 96 minutes! The action scenes, in my opinion, were lame, tame, dull, overdone, and the slow-motion wasn't impressing anyone. It came off, once again, as forced and corny.<br><br>I'm a fan of the RE videogames and do nitpick, but at the same time, I've taken the movies for what they are. The first film was great, second meh, third bad, but this one was downright horrible. I'm really not sure I saw the same movie as most of the reviewers here, because what I saw was a flashy, dull, pointless entry in an already dead series. Time to give it a rest Paul.<br><br>Resident Evil: Afterlife gets a 3/10 *'s","user":"CrimsonKingLives","rank":[135,205]}]