[{"title":"Fede, you've done us proud","rating":8,"date":"4 February 2014","review":"In all fairness, director Fede Alvarez has come through successfully on remaking this 81 cult horror, that sees a group of young campers, possessed by evil spirits from that notorious book that should never been opened. With another attractive cast, who deliver realistic performances, especially the heroin addict sister, the film too is beautifully shot in the cold misty woods of New Zealand, and this works wonderfully, cinematically, I might add. This was the biggest thing, I must say, that really impressed me. I must admit I was disappointed at one aspect, as I thought it would be full on throughout, much like Evil Dead 2, (my oldie favourite) where everything just goes crazy and you can't think straight, but there's enough blood shed in this to satisfy you gore lovers. The highlight is the girlfriend cutting off her own arm with a chainsaw scene, with the boyfriend (Fernandez) asking \"Are you okay?\" There are some nice touches of humour here I liked that worked better here, than the original, and the slipping on the tongue scene was inventive. What was good was the catalyst of the story, the reason for them all being there in the woods, as to comfort the young heroin addict girl, one, her brother who's managed to show up here, hot girlfriend and all. Shiloh Fernandez's character irked me some, while not even managing to make his mother's funeral, months prior. How he become the hero near the end, and braved up, I liked. Though of course with not the greatest script that I've actually read part of, here's a well shot remaking of a notorious horror, that of course, can't surpass the original, but comes pretty close. But in this present, it's a guilty pleasure on another chain, it's chilling opening, brilliant, not letting us forget how frightening and evil the original is. And like this remake, among others, these are what mostly opt for. Great end credit sequence, with an afterword from Bruce Campbell.","user":"videorama-759-859391","rank":[43,47]},{"title":"I wasn't expecting much, rather surprised.","rating":7,"date":"2 August 2018","review":"We seem to be in a time where the remakes of remakes will be remade, even films like Cabin Fever aren't remaining sacred, the obligatory remake follows.<br><br>Evil Dead now is a remake with a bit of bite, of course it has every possible cliche under the sun ticked off. We have the obligatory character coming out of the ground with long stringy hair, we have the trapdoor, the book of death, and of course the vomiting. Despite all the blatant lack of any sort of imagination Evil Dead somehow manages to capture the imagination, and provide ninety minutes of quite thrilling entertainment.<br><br>The scares are plentiful, and the acting is such that you believe in the pain, physical and mental, it really is quite well made. Effective use of special effects and music.<br><br>Not a film I'd look to watch on a regular basis, but it's somehow rather refreshing. 7/10<br><br>Please enough with the remakes though.","user":"Sleepin_Dragon","rank":[44,53]},{"title":"If you like bloody movies, this one is made for you!","rating":8,"date":"13 June 2015","review":"Evil Dead is a remake of the 1981 original \"the Evil Dead\". I didn't have the chance to watch the original yet, so I'm going to review this without comparing it with the original.<br><br>The movie actually starts out pretty slow, for the first 40 minutes there isn't any creepy parts and it actually bores me. Usually, movies start off slow to develop they're characters or stories, however, I find the first 30 minutes unnecessary. However, Evil Dead deserves its wait. Evil Dead has some of the goriest and most disturbing scenes I've seen in movies. There's blood EVERYWHERE and the movie make them look real good! The movie mostly uses makeups and proves that a bloody movie can stand by its own without CGI. <br><br>Another thing I like about Evil Dead is the directing. There are many beautifully-shot scenes which makes the movie very enjoyable. For example, the director sets the cameras in different angles, such as the floor or close to the wall, which makes it extraordinary from other films.<br><br>On the other hand, Evil Dead lacks character developments, but for its own sake, bloody horror doesn't really need character developments. Characters make stupid decisions and eventually will die out one by one, so it's not really a big deal. <br><br>There isn't really a plot or twists in Evil Dead. Everything is presented directly. If you haven't watch this without watching the trailers, the movie is what you thought it will be. <br><br>Evil Dead is enjoyable for a movie night if you do not care too much on the details. Just sit back and enjoy the gore, it's real fun.","user":"andrewshieh0712","rank":[26,33]}]