[{"title":"Fantastic film","rating":10,"date":"24 January 2011","review":"I saw this film twice at Sundance in sold out theaters, and the audiences loved it. It has something for everyone who loves movies. It is funny and sad and fascinating with great film clips and interviews. These Amazing Shadows uses the National Film Registry as a platform to show how important films are as a reflection of the our culture and heritage. Twenty-five films are selected each year to the registry for preservation, and we see clips of everything from the music video \"Thriller\" to \"The Rocky Horror Show\" to the Zapruder film. I was especially moved by the section on Topaz, the \"home movie\" about the Japanese internment camps. A movie everyone should see.","user":"suzannechapot","rank":[16,19]},{"title":"A movie made by people who love movies for people who love movies","rating":16,"date":"16 September 2011","review":"Despite not having enough of Christopher Nolan and Tim Roth interview to show and the movie feeling longer than it was this is a pure gem for movie lovers like myself. This docu tells the interesting story of the national film registry and how films are picked as well as showing a variety of clips from those movies that have been picked and have made an impact on other people in the business. We get plenty of great interviews from people in the business such as famous director John Singleton and John Lasseter, as well as studio executives, and people who are part of the committee that votes on the films to be put into the registry. We get insight into the job of someone who works hours on end to help preserve films that are extremely old and were not designed to stand the test of time. Knowing that certain films dating back before the 1950s were neglected due to the studios having no use for them once they did their job in making money is quite disturbing and makes me appreciate those films from a long time ago that are available for our viewing pleasures. If you are someone who is addicted to watching movies and remembers when watching movies didn't mean picking out the good from the bad and just being awed by whatever lay on screen or are interesting in going into the business, this is worth watching and is a sure contender for best documentary if the Academy allows it.","user":"kevin-miller447","rank":[3,3]},{"title":"Very inspiring but WAY too short.","rating":7,"date":"27 November 2011","review":"\"These Amazing Shadows\" is a very inspiring film. You cannot watch it without feeling a strong sense of the importance of film preservation and film as an important part of our history. However, the film suffers from trying to do WAY too much in much to short a time. I could easily see several films or even a series come out of this material and felt the film just went way too fast.<br><br>The beginning of the film talks about the fragile nature of nitrate film stock (the standard for movies until the mid-1950s). You see how the film tends to stick together or turn to powder--though this is a bit rushed, as they never really talked about how combustible these old films are as well. And then you get to hear some film preservationists from the Library of Congress talk about their love of their work. I LOVED this part of the film and really wished they had just focused on this or perhaps done so a bit longer.<br><br>The next portion of the film is the biggest problem. A sampling of SOME of the films on the National Film Registry is given and folks say a few blurbs about them and what stands out about these films. Well, considering how important and great these films are, they certainly deserved MUCH more about why they were chosen and why they are so unique. It felt like someone trying to encapsulate the entire Bible or American History in 90 minutes or less! Overall, this is a nice introduction into film preservation and the National Registry, but better films on similar subjects have been made--ones that are more thorough and less episodic--such as \"Henri Langlois: The Phantom of the Cinémathèque\". Well worth seeing nevertheless.","user":"MartinHafer","rank":[6,8]}]