[{"title":"beautiful film about a very interesting person","rating":8,"date":"28 December 2015","review":"Watching the score of this film here on IMDb I was not very eager to watch this film. I did anyway and did not regret any minute. Of course a lot of aspects a persons life disappear in a movie of 2 hours. But a film should be watched as a separate piece of art. And this piece is simply beautiful and enjoyable! I had never heard of Kristina of Sweden before, and I really like being introduced to her. Very interesting person in history. And certainly not only because she loved women, because that is of all times. Her ideas and curiosity made a change in history. That is what triggered me to find out more about her. And the low score here triggered me to write a review. This film deserves much better!","user":"d-vanderleer","rank":[52,63]},{"title":"A beautiful film about a lesser known historical period","rating":9,"date":"12 December 2015","review":"I caught this film entirely by accident, with zero expectations or knowledge of the subject matter. I am unqualified to speak to the historicity of the events. But if it is close to historical events, what a beautiful film was made of it. Dealing with politics and religion and feminism, it is a rare little gem. <br><br>Christina, the Queen (actually \"King\") of Sweden from 1632 (age 6) until 1654, was tutored by a unique man, and grew up to be a young woman with curiosity about the world and a taste for life, she shook the institutions of the day, with an unkind mixture of success and failures. The film is mostly in English with a little French (accompanied by subtitles), the actors do a fine job, and I really appreciated the makeup team's subtle approach. I might have appreciated a script less focused on romance and more on personality and accomplishments, but then again, in our 20s, hormones can dominate all.","user":"tallard","rank":[56,70]},{"title":"The actual history doesn't matter right?","rating":5,"date":"21 August 2018","review":"I mean it's not terrible, as long as you don't mind being lied to about history, and possibly missing out on THE MOST interesting parts of her life. If you do watch it... do yourself the favor of doing a little research after it's over to learn what actually happened to her... that's the fascinating part.","user":"sweetstreetswing","rank":[11,12]}]