[{"title":"Required viewing for pensioners!!","rating":8,"date":"11 November 2009","review":"The pre main-credit sequence, shot to resemble mobile-phone footage, had the desired effect: the sense of shock from the capacity audience was palpable. The film then slows down to show the reality of Harry Brown's life as a pensioner on a South London high-rise estate . Showing his routine of walking to the hospital to visit his very ill wife, having to walk a long way round to avoid confrontation with an unseen group of youths who use an underpass as their base and his meetings with his old friend and chess partner Lenny in the estate pub. There aren't many other people walking about the estate, even in daylight, out of fear of the gun-carrying teenage gangs.<br><br>Michael Caine's performance as Harry Brown is wonderful. His timing is spot-on. Credit to director Daniel Barber for allowing him space to breathe and not be hurried. In fact the overall pacing is excellent. There is good use of the soundtrack with the lack of intrusive music adding to the reality feel of the film. The night scenes are beautifully lit as well with a good balance between just enough to see what's going on and making the lighting realistic: the night scene in the pub with the lights out, for instance.<br><br>This film has been compared to 'Death Wish' and 'Gran Torino', but those films haven't got this film's bleak, realistic look at how life is in these areas. There always remains a sense of watching a film, of entertainment, of it being 'Hollywood'. This is a lot more down to earth. This film has more in common with Mike Leigh's TV drama 'Meantime' and with 'Gomorra'. <br><br>This isn't an easy 'first-date' film but it is a superior Brit film, one of the best for many years. I'm glad to see that it has got some marketing push behind it and has generated column inches talking about the subject of these 'no-go' areas and society in general.<br><br>Shocking and brilliant.","user":"petej90","rank":[158,190]},{"title":"Modern Britain","rating":10,"date":"10 November 2009","review":"This film accurately depicts life in modern Britain today.<br><br>Not the image of a flowing rolling countryside of middle class England which is often depicted in typical international films but one of an inner city \"sink\" estate - Elephant &amp; Castle in London - with all of its associated problems.<br><br>I saw the film last night and it brought back all the memories I have of having lived in similar circumstances.<br><br>Michael Caine is excellent, this is probably one of his best films and I expect film nominations for his role.<br><br>The film gives a gritty but realistic view of the life most people live on the sink estates of Britain, all are there through no choice of their own, but some are aware of the conditions they are forced to live in.<br><br>I don't think we'll see the British government promoting this film as it portraits the country in a very bad light, though, if you are not from Britain and would like a taste of what some of us have to put up with I recommend you see this film.<br><br>Overall, a very well put together film which will make the hairs on the back of your neck stand up at times.<br><br>Well done Michael and all of the team.","user":"srlawton-578-345144","rank":[317,397]},{"title":"Gritty and Riveting.","rating":10,"date":"30 November 2009","review":"There are no Hollywood moments in this movie, and that's probably why I love it! Possibly the best movie Michael Caine has ever been a part of.<br><br>The director does a truly awesome job of portraying his world with convincing and seedy squalour, almost leaving the viewer feeling soiled by the experience. His characters aren't just overtly filthy scum - they're real and believable scum.<br><br>Michael's character shines.<br><br>The are no violent rape/murder scenes where his family die at the hands of an outlaw biker gang, no terrorists holding his wife to ransom... just an old boy who has seen too many recent horrors to suffer the indignity of it any more.<br><br>From a drunken moment where his old military reflexes kick in with shocking consequence, to the understated twist of a finale, you can't help but feel for this man and see good cause for his actions. He's every bit the tired old serviceman whose plight tugs on every decent fibre until you find yourself snapping along with him.<br><br>He's no Rambo, no bullet-dodging arse-kicker on a rampage of revenge, and the action manages to paint well within the lines of plausibility. He ambles into the role with dignity - even if he's moving far too well for someone in his condition (emphazema doesn't just kick in after a ten foot jog - it's not asthma), and the impact of his losses is portrayed with a hopeless sadness that rather makes you want to hug the poor soul than scream \"revenge\".<br><br>I enjoyed this movie rather more than I expected to, and I would highly recommend it. It's neatly understated, with the right blend of pace and action. There's never any risk of failing to 'get it' - the director easily renders the various elements of the story in the light he chooses, making a few select points without hammering them home with a cricket bat; his Police are ineffectual bureaucrats, his protagonist is just an old man, and his scum... well, I feel like I've lived with them all my life.<br><br>Oh yeah, I have.<br><br>A truly entertaining and captivating film that's quintessentially British. You just *have* to watch it.","user":"g-harrington","rank":[177,219]}]