[{"title":"Low brow version of what was done better by Steve Martin and John Candy.","rating":3,"date":"7 November 2010","review":"This is a movie I was prepared to like because Robert Downey is an excellent actor and Zack G has proved to be a weird character who can be very funny in the right film.<br><br>But, it just doesn't work very well. This story has been done before, and with much better effect, in Planes, Trains, and Automobiles. The two movies have a very similar story arc, but in the one case you have two very funny men playing actual mature adults who have differing personalities, and in the other you have two men who are immature imbeciles with differing personalities. The former are likable, while the latter are just annoying.<br><br>Zack G's character is just too bizarre to be credible, but at least you know where they are going with him. Downey, on the other hand, is an excellent actor badly miscast here. His demeanor is just too \"dark\" and his personality too brooding and cranky to play the part of a good family man trying at all costs to get home in time for his child's birth. To be honest, his character simply isn't very likable, and is sometimes just downright mean, even spitting in an innocent dog's face. This is in stark contrast to the frustrated everyman played by Steve Martin in P,T,&amp;A - a person every traveler (stuck next to an obnoxious slob) understands implicitly. Another example of such a role being done to perfection is Jack Lemmon in The Out of Towners.<br><br>I suppose it didn't help that the theater was packed with very young children who had no business going to this movie. The very crude language, extensive drug imagery, and graphic masturbation scenes, while funny for adults, were grossly inappropriate for 5-12 year olds in the crowd. Some people clearly are not cut out to be parents.<br><br>Perhaps the most memorable line in the movie was Downey proclaiming that he had never done drugs in his life. Given Downey's well documented real-life problems, his statement in the movie couldn't help but make the audience compare the character to reality, thus serving to knock down the \"4th wall\" in the process. No doubt the contrast was created by intent, but I'm not sure it was a great idea.<br><br>As Steve Martin, John Candy, and Jack Lemmon proved, superior comedy and deeper laughs come from brilliant acting and comic timing. If you have to resort to endless gutter language, potty humor, and masturbating canines, you have already lost the game before it starts.","user":"nosp-4","rank":[119,184]},{"title":"If you are looking for believability, please try to remember this is a comedy.","rating":8,"date":"9 November 2010","review":"The critics are being pretty harsh on this film, and yet they give high praise to such films like Role Models and Get Him to the Greek, so go figure. But I had a lot fun with Due Date, It was a fun slapstick misadventure, almost what we loved about The Hangover, so it is clear to say I don't agree with the critics on this one.<br><br>Peter(Robert Downey Jr) an architect looking to get home to his pregnant wife(Michelle Monaghan) who is expecting in a week. And when he gets on a plane, he quickly gets kicked off, when he gets into an unfortunate incident with Ethan(Zach Galifianakis) a pot smoking moron, and wanna be actor, who is obsessed with the show Two and a Half Men. When Peter is looking for new ways to get home. Ethan has a car and offers to drive him. Although it is against Peters better judgment, but feeling there is no other way, he goes with him. Will Peter make it on time for his child's birth, or will Ethan drive him nuts during this?<br><br>A lot of people said this is a Plane,Trains and Automobiles ripoff, but you know what who cares. This was a funny laugh out loud film. Downey and Galifianakis have funny chemistry, they just play off each other perfectly. Like The Hangover it is one entertaining misadventure, I say don't listen to the critics, see this movie and form your own opinion.","user":"DarkVulcan29","rank":[153,249]},{"title":"Hilarious","rating":10,"date":"7 January 2012","review":"Zach Galifianakis is so funny in this movie. The complaints about the stale plot, the ridiculousness of the characters' behavior, or the failure of the characters to garner a connection with the other reviewers- or to inspire love or empathy- may all be valid points. I didn't find this to be true, but one could see how others would make the case that the film was nothing special. Nevertheless, I just laughed hard and frequently at Zach Galifianakis throughout. 10 stars. That's all, I am adding lines because they have a minimum of 10 lines. I am not Gene Siskel. Just recommending a comedy; people take insignificant things too seriously","user":"fischermoto","rank":[40,60]}]