[{"title":"Certainly worth watching","rating":27,"date":"27 July 2011","review":"Firstly I am quite realistic about my expectations when a historical movie is made. Real history does not generally run smoothly nor is it engaging enough to fit conveniently into a 2 hour movie, so I refuse to nick-pick a screen writer for adding a little poetic license into a script or for the costume designer who doesn't have the time or resources to get the actors \"just right\".<br><br>With this in mind, I found the story enjoyable and it ran more or less historically and at a good pace, I was certainly never given enough pause to consider boredom. The fight scenes were very good and I agree with other criticisms on the reviews about the shaking camera making it extremely hard to concentrate on what was happening.<br><br>There was plenty of blood, limbs and sliced heads to appeal to the gore fest/action fans but it seemed to accurately reflect the face of medieval warfare with its close and gruesome nature.<br><br>The cast were a list of well known and respected actors, all of whom put in a good display with what they were given with Paul Giamatti's rant about the divinity of Kings being especially engaging.<br><br>Overall its not a classic nor will it win awards, but for a couple of hours action based escapism it is certainly worth the effort of watching and is far superior to a number of bigger budget Hollywood contemporaries.","user":"macca197338","rank":[111,131]},{"title":"Mud, blood and lots of ambition","rating":4,"date":"4 March 2011","review":"There are plenty of lower-budget independent films that have gone on to be more critically acclaimed and more financially profitable than big-budget Hollywood pictures. What is rare, however, is an indie film that masquerades as one of these pictures. A self-labelled \"all- star&nbsp;indie action blockbuster\" and \"inspired by history\",'Ironclad' is such a film, trying to redefine the boundaries of British cinema.<br><br>Whether by intention or by coincidence, 'Ironclad' picks up a few&nbsp;years after the end of Ridley Scott's 'Robin Hood'. It is England,&nbsp;1215. King John (Paul Giamatti) has been forced to sign the Magna Carta, which limits his power and ensures the freedom of men.<br><br>With the&nbsp;help of a Danish army, the King rampages across the country to regain&nbsp;absolute power. Baron Albany (Brian Cox) and a band of rebels take&nbsp;Rochester Castle in an attempt to stop the tyrant king. A siege takes place, and the rebels must hold the castle until reinforcements arrive.<br><br>The film certainly ticks many of the boxes of an action blockbuster. There's a clear \"big bad guy vs. underdog good guy\" vibe, plenty of action, and some veterans among the B-list cast. The $25 million budget, although pocket change in Hollywood, shows how badly this indie film wants to be big. A big film, however, is not necessarily a good film.<br><br>'Ironclad' is at its strongest when it comes to the physical side of things. It does not shy away from gory violence. Heads, hands and feet&nbsp;go flying, blood splatters all over the the camera's lens, and there's a particularly nasty bit involving a man and a catapult. The weapons feel like instruments of destruction rather than Medieval-chic accessories, and often succeed in making viewers wince.<br><br>The fight choreography is particularly impressive - characters look like soldiers trying to tear each others' hearts out, as opposed to actors trying to high-five each other's swords. The action sacrifices style and appearance for physicality and brutality, which results in a refreshing level of authenticity.<br><br>The 13th century England recreated looks good enough to fool anyone&nbsp;but a history buff. Giamatti and Cox play their roles with conviction and succeed in getting the story moving. Giamatti is particularly watchable, playing King John as an unhinged sadist.<br><br>The narrative is where 'Ironclad' falters. Fully aware that the film is essentially about a group of soldiers in a building, the writers&nbsp;have tried to spice things up. One of the rebels (James Purefoy) happens to be a Templar Knight. He regrets killing people for God, so he goes on a diet of silence and chastity, the latter of which is tested (of course) by the lady of the castle (Kate Mara). These are ill-advised attempts at emotional content and only serve to distract&nbsp;from what should have been a simpler, more polished affair.<br><br>Regrettably, the filmmakers decided to emulate that most repulsive&nbsp;staple of modern action blockbusters - the shaky-cam. Specifically namechecking 'Transformers 2' and the 'Bourne' sequels as influences (not a good sign), they decided to shake the picture to create \"a very real sense of action\". <br><br>What is achieved instead is a very real sense&nbsp;of frustration every time the action is made unnecessarily incoherent. Once again, the \"Michael Bay Effect\" has ruined a film that would have otherwise looked excellent, and wasted the work of an obviously talented action choreographer.<br><br>Despite its flaws, fans of mud'n'blood, hack'n'slash mini-epics will find plenty to like in 'Ironclad'. It is comparable to 'Robin Hood' despite costing $130 million less to make. Director Jonathan English wanted to create an action blockbuster. In terms of scale and ambition, he has succeeded. But blockbusters aren't perfect, and neither is this.","user":"ced_yuen","rank":[184,222]},{"title":"Rascal King John and the Medieval Magnificent Seven.","rating":8,"date":"11 July 2012","review":"Ironclad is directed by Jonathan English who also wrote the story and co-adapts the screenplay with Erick Kastel and Stephen McDool. It stars James Purefoy, Brian Cox, Derek Jacobi, Kate Mara, Paul Giamatti, Jason Flemyng, Mackenzie Crook, Jamie Foreman and Vladimir Kulich. Music is scored by Lorne Balfe and cinematography by David Eggby.<br><br>1215 and having been forced to sign the Magna Carta, King John (Giamatti) enlists an army of Danish mercenaries and plots revenge against all involved. As John lays bloody waste to the South of England, a small band of rebels led by William d'Aubigny (Cox), plot to defend the Southern stronghold of Rochester Castle in the hope they can delay John long enough for the French army to arrive from the sea to depose him.<br><br>The history, as is often the case in movies of this ilk, is sketchy and exaggerated, we are in true cinematic granted licence here as Rochester Castle is defended by less then 20 men and a couple of gals (in truth there was a considerable army defending Rochester). Yet Ironclad's sheer willingness to blend historical and period notices with blood and mud is very appealing to the swords and shields genre fan. The recreation of 13th century England is most impressive, as is the adherence to the brutality of the times. Armour and swords do clank with aural sharpness, quickly followed by blood and dismemberment; the body horror is certainly not in short supply throughout the running time. The colour is deliberately muted to capture a realistic feel, and although the shaky-cam technique used for the fight scenes (is this now written in the historical epic director's 101 handbook?) will irritate many, it does aid the grit and grue atmosphere that director English goes for. In fact he has achieved much with only a modest budget.<br><br>A splendid cast has assembled for the production, all thankfully attired with thought from the costume department. Purefoy cuts a fine rugged figure of machismo, brooding for all he's worth as he battles not only the enemy, but also his own duel with his Templar faith. Cox is, no surprise, full of gusto and leadership qualities, and the likes of Flemyng (whore chaser as brave as a lion), Crook (ace archer) and Foreman (no fear thief) add considerable grungy brawn to proceedings. Charles Dance and Jacobi lend thespian support and Kulich is a towering presence as axe wielding leader of the Danes, Tiberius. Highlight, though, is Giamatti. True enough to say that as written it's a portrait of a vicious King we have seen plenty of times before, but Giamatti elevates this one to better heights with a glint in his eye and thunderous moments of anger. For his delivery of \"I am God's right hand\" speech this begs respect. His accent holds as well, always a bonus is that.<br><br>Where the picture falls down is with a script that contains duff passages of dialogue and the obligatory romance thread. Poor Kate Mara (stepping in when Megan Fox scampered from the production), it's a thankless role that basically asks her to turn the head of Purefoy's Templar Knight, hitch up her skirt and look wistful from time to time, while having Cox bellow out that John \"is no more a King than the boil on my arse\" hinders rather than aids the mood. But English and the makers get away with the missteps because it's such good rousing fun, a nifty blend of religion, politics and bloody war. The siege itself is very well orchestrated, as catapult engines bombard the castle, arrows penetrate the sky, men leap around on fire or scolded by hot oil, and there's interesting facts and tricks etched into the narrative too (burning of pigs a weapon of war?!). It may never quite reach the ambitions it sets itself, but in an era when swords and shields movies are in short supply, it's an entertaining and bloody romp for sure. 7.5/10","user":"hitchcockthelegend","rank":[36,43]}]