[{"title":"Well-plotted thrill ride, but with a predictable twist.","rating":7,"date":"23 March 2009","review":"I went into Butterfly Effect: Revelation with very low expectations, especially after the mediocre sequel. But it is a surprisingly well-plotted and thrilling puzzle of a movie that has it share of great moments, but the twist can be guessed by most and it changes up the rules of the first two.<br><br>We follow Sam who lives whose girlfriend Rebecca was murdered 5 years ago. Like the previous movies, he has the ability to travel back in time to key moments to gain some new information and sometimes even alter the past. He uses this to help the FBI catch killers beforehand. Only this time, the movie adds a few new elements: 1)Sam can travel back to ANY moment in the past, whether he was present there when it originally happened or not. 2) He doesn't need to use journals/pictures to travel back and can do so at his will anytime. 3) A few more but they are spoiler territory.<br><br>But once he gets the information that the killer who is behind bars for Rebecca's murder is wrongly convicted, he decides to break his own rule of not altering his own past to travel back to the night of the murder, but through a mistake creates a serial killer for the world.<br><br>Unlike the second movie which had a large amount of plot holes and ridiculous decisions by the protagonist, this one is for the most part well-plotted, presented as a puzzle piece instead of a traditional thriller, and creates suspense by adding the element of guessing the killer's identity. It has a lot of thrilling moments, particularly in the last half hour. Unfortunately, the twist the movie tries to pull is predictable in the movie if you are paying attention. Although that doesn't mar the experience, it ruins the element of surprise. Also, some fans of the original may not like the changes to the rules of the first. The actor's did a surprisingly good part in the movie. The dialogue was good, although the little attempts at humor failed more than worked.<br><br>Overall, this is a recommended thriller, especially if you are a fan of the original. It tries to do something different by adding the element of a serial killer into the mix and gives the protagonist much more stake in the movie rather than just saving the life of a loved one. If only it wasn't for the predictable twist, my rating would be higher.","user":"Faisal-Hashmi","rank":[68,85]},{"title":"Some efforts but a bit short of a great flick","rating":6,"date":"8 December 2012","review":"Have to say, loved the first Butterfly Effect movie and decided to watch the second which everyone would agree is a total disaster. This third one worried me but I gave it a try. It ended not to be the best flick ever but has at least has some storyline. In fact, the movie even has a tiny bit of a surprise as the plot deepens and end to be a fine movie. The acting is not bad at all (Sam Reide character is well enacted and Jenna tend to appear as a believable sister character). <br><br>So in truth, I may even go to say that if you are looking for a easy to understand SciFi movie genre (making some sense), you will probably be entertained by watching this sequel. Do not expect a follow-up of the first however (theme theme but no real relation).","user":"jerry07","rank":[10,11]},{"title":"really enjoyed this surprising sequel","rating":8,"date":"30 March 2009","review":"I was a huge fan of the original Butterfly Effect, although I liked the concept more than the execution. When Ashton screamed, \"You don't know me! I don't even know me!\", it made me remember why certain actors should stick to lightweight material. I had very low expectations for this one, mostly because the second movie was unwatchable. Aside from a couple of problems, I was pleasantly surprised. <br><br>First, the problems: This movie has nothing to do with the original or the sequel except that the Butterfly Effect power is SIMILAR -- not exactly the same, because in this one the main character Sam travels by just focusing on the past, and his sister Jenna monitors him, but then he seems to forget the intervening years when he returns to the present. The other problem is that sometimes characters and relationships are unclear and a couple times I had to ask my wife who this person was or why this person thinks that now, but she understood it pretty well and felt that the confusion was intentional so that the audience would feel like the main character, who's really confused by all the time travel.<br><br>The two leads in this one -- which probably couldn't get big stars because of its low budget -- were both outstanding. Chris Carmack shows major dramatic chops. I can see him being the next Viggo Mortensen. Rachel Miner is also really great, and so are the minor characters, especially the well-endowed bartender. (Was that a visual reference to Catholic Schoolgirls in Trouble, from the Kentucky Fried Movie, or am I reaching?) There were a couple of strong dramatic scenes that wouldn't have felt out of place in a studio Oscar-bait type of movie. I guess that's a credit to the writing/directing too, since it didn't feel overdone or hammy.<br><br>The cinematography was also solid, and I liked the score. Usually movies like this skimp on those elements and just use a cheesy synth score, but this one was solid.<br><br>My only complaint about the cinematography is that sometimes it felt claustrophobic -- we're always inside someone's apartment, or in some dark, cramped place. I guess that fits with the theme, but I would've liked to be able to breath every now and then with a nice landscape shot or something. Maybe that was also a budget issue.<br><br>Overall, although I didn't see this movie in the theater -- it was out for a week, apparently - - watching it at home felt like I'd caught a really cool late-night TV show. It's a fun ride. I could see this turning into a TV series or something, like Quantum Leap.","user":"marvingardens24","rank":[51,71]}]