[{"title":"Good show they did a great job making it","rating":10,"date":"20 February 2020","review":"I really liked Chimpanzee. Not a movie, but a true story, and a damned good one. If you're an animal lover or a nature enthusiast, if you enjoy perfect cinematography, if you've got a heart at all, you will probably enjoy it.","user":"MR_Heraclius","rank":[37,38]},{"title":"Flawed but Enjoyable Documentary","rating":6,"date":"20 April 2012","review":"From the people that brought you the fantastic documentary—Earth—comes a documentary cut from an entirely different cloth. Unlike Earth, Chimpanzee is able to weave a storyline by following a specific clan of chimps, giving each one a name, and following a youngster as he learns the rough life of the forest. The personal touch is brilliant and allows for a heartfelt documentary. In the end, the only problems are in the way the movie is edited and narrated.<br><br>One of the best things about Chimpanzee is the way in which it elicits empathy from the viewer. The movie focuses on features of chimpanzees that remind of us ourselves—using tools to get food, breastfeeding, and youth playing games while adults try to sleep. By the time the documentary develops a plot, you will honestly care about the characters involved. You will laugh time and time again.<br><br>You will not cry. Despite the disturbing and depressing nature of the film, everything is glazed over. This points us directly at the core problem of Chimpanzee—the narration. First off, Tim Allen wasn't the right choice. He doesn't do the inflections correctly and often speaks far too excitedly. The other major problem with the narration is the script. When Tim Allen started speaking for the Chimps, I was amused. When it continued, it became rather annoying. The narration should have been used to support the documentary—not overshadow it.<br><br>Chimpanzee was marketed as a children's film. We received the children's preshow and nothing but adolescent trailers. That is what stopped the documentary from being great. By skipping over the scenes that are too hard to watch and not diving into the real reason an Alpha Male would take in a young chimp, the documentary shortchanges itself. Earth was great because it wasn't directed at an adolescent audience. That freed the team up to build the best movie. The same was not the case for Chimpanzee.<br><br>If you enjoy documentaries, you will enjoy Chimpanzee. Although the movie does not deliver critical thoughts, it is filled with incredible visuals and an intriguing storyline. If you are not a fan of documentaries, there is no reason to see Chimpanzee. I hope this movie does not show a trend for wide release documentaries. Documentaries are beautiful when they are not dumbed down for our children.<br><br>reillyreviews.wordpress.com","user":"FFman-847-460126","rank":[24,30]},{"title":"A familiar story interpreted by some close relatives of us.","rating":9,"date":"23 September 2012","review":"The most striking feature I noticed while watching this film was the resemblance of these creatures to my neighbors. It's incredible how similar to us they are!<br><br>Granted, Doña Carmen and Don José don't go as far as to deflea each other while carrying on a casual conversation on a sidewalk, but the similarities in body gestures and specially when persistently looking at the camera lens (it happened several times, whether intentionally or not) and we could see overwhelmingly human eyes looking at us, can be quite disturbing.<br><br>Impeccable photography with so many close ups that one wonders constantly at how they had managed to take those shots without disturbing the animals. I'm sure Disney has the most sophisticated equipment in the World in order to present such splendipherous depth of lenses and superb sharpness all the time, even from long distances, but even so, chimpanzees have a very sensitive sense of smell and I'm sure they could detect human presence from afar, but apparently it left them unconcerned and they proceeded naturally with their daily chores.<br><br>The forest, breathtaking, specially from the air, and the lushness of all that green carpet we see below seems to go forever on behind those far away mountains; when the camera goes down to ground level it's disconcerting to notice how very little sunlight reaches these animals.<br><br>Since it was a Disney film, obviously thought out for children, the notorious lack of restrain among monkeys and chimps when it comes to bodily functions, including everything related to sex, which is so habitual to see in zoos in broad daylight, here there is no trace whatsoever of it, like in those old Doris Day films, where everything was squeaky clean. <br><br>A good film for Eco-friendly fans. <br><br>P.S.: I gave it a 9 because of the titanic efforts of the whole crew and the tenacity they put into the project, working under such harsh and probably dangerous conditions.","user":"davidtraversa-1","rank":[9,10]}]