[{"title":"Great suspense and some genuine surprises.","rating":5,"date":"5 September 2011","review":"The Debt is a Nazi hunt/spy thriller all rolled into one and it's nice to see a classic thriller that takes the subject matter seriously and relies on suspense to keep us in its grip. I was at the edge of my seat for most of the time and there's plenty of surprising turns in the story to keep even the most jaded enthralled. <br><br>Most of todays inept filmmakers rely on blowing stuff up hoping that this will count as suspense. It also is such a breath of fresh air in an appalling year of C -grade superhero movies and obscure comic book adaptations. Hopefully this does well so Hollywood can go back to making well written thrillers and dramas like they used to.<br><br>Best suspense thriller of 2011 so far.","user":"Adam Frisch","rank":[105,133]},{"title":"Enjoyable diverting - but not much more.","rating":6,"date":"1 December 2011","review":"A remake of the 2007 Israeli film of the same name, John Madden's Westernised take on the gritty espionage thriller is enjoyably diverting, if not much more. Tracking three Mossad agents across two timeframes – as young adults they embark on a perilous mission to capture a serial killing Nazi surgeon, 30 years later they revisit their haunted memories – there's plenty going on story-wise. However it lacks that required edge to elevate it into spellbinding territory, largely due to the uninspiring way it's shot and presented. The impressive line-up of actors don't disappoint; Martin Csokas, Sam Worthington and Jessica Chastain gel naturally as the inexperienced spies, whilst Tom Wilkinson, Ciaran Hinds and Helen Mirren add enormous clout as their elderly counterparts. Could've been better, could've been worse; a mixed affair really.","user":"Troy_Campbell","rank":[14,15]},{"title":"The Burden of Truth","rating":6,"date":"2 September 2011","review":"Greetings again from the darkness. Espionage thrillers can be so much fun in both book and movie form. Movies actually have a little advantage for the action scenes. Books clearly have the advantage in details, backstory and character development. What is frustrating as a viewer is when a movie starts strong and then crumbles under the weight of expectation ... sometimes trying to make a bigger splash than necessary. Such is the case with director John Madden's remake of the rarely-seen 2007 Israeli film \"HA-HOV\".<br><br>The story is centered around a 1965 mission of a trio of Mossad agents. Mossad is Israel's CIA. These three agents, Rachel (Jessica Chastain), Stephan (Marton Csokas) and David (Sam Worthington) are to capture the notorious Nazi war criminal, the Surgeon of Birkenau (Jesper Christensen), and bring him back for a proper trial of war time atrocities.<br><br>Flash forward to 1997 and Rachel's daughter has written a book about the daring mission and the three heroes. The older version of the characters are played by Helen Mirren (Rachel), Tom Wilkinson (Stephan) and Ciran Hinds (David). We are treated to flashbacks of the mission and how things took a wrong turn, but ended just fine. Or did they? There seems to be some inconsistencies with the story told and the actual events that have created much strain between Rachel and Stephan, and life-altering changes for the more sensitive David.<br><br>This is an odd film because the best story parts occur when the younger cast members are carrying out the 1965 mission. It is full of suspense and intrigue. The intensity and believability drops off significantly in the 1997 version, but oddly, the older actors are much more fun to watch on screen ... especially the great Helen Mirren. I am not sure what all of that really means, but for me, it meant the third act of the film was a bit hokey and hard to buy.<br><br>Director John Madden is known for his fabulous \"Shakespeare in Love\", but not much else. His films since then have all come up just a bit short of that very high bar he set 13 years ago. Jessica Chastain continues her fantastic 2011 season adding this performance to her more spectacular turns in \"Tree of Life\" and \"The Help\". Sam Worthington is known for his role in \"Avatar\", but his character here is so thinly written, I doubt any actor could have pulled it off. Jesper Christensen seems to usually play the bad guy and he is in full glory here as a Nazi war criminal with no regrets.<br><br>The first half will keep you on the edge of your seat, but by the end you will have a somewhat empty feeling. What a shame as this one teased us with much hope.","user":"ferguson-6","rank":[77,112]}]