[{"title":"Yet another Eastwood gem","rating":15,"date":"15 December 2008","review":"I feel like I should let everyone reading this know of my inherent bias in favor of this film. I have seen twenty eight films from Clint Eastwood as director and have liked the vast majority of them, and loved a good number of them (my average rating for the 28 films is 7.9). Still, something felt off about \"Gran Torino\" based on the trailer. I read it as Eastwood trying to be 'badass' again, trying to be Dirty Harry again. \"Gran Torino\" is not that. Walt Kowalski may have similarities with Dirty Harry, and could possibly be read as a significantly older version of Harry (it's a stretch), but he is a distinctive, memorable character on his own, and I'd go as far as saying that it's one of Eastwood's finest performances, and one which gives him a chance to show off his dramatic and comedic chops.<br><br>I'm not going to argue that \"Gran Torino\" has perfect acting from the younger supporting cast. It doesn't. In fact, some of them are downright bad at times, but the film works in spite of its flaws. This screenplay was probably written with Eastwood in mind (I am not sure of the behind-the-scenes details on this) and it shows. He captures Kowalski perfectly. The film is surprisingly humorous, something that isn't being captured well enough in advertising. It's absolutely hilarious at times (watch as Kowalski attempts to make a man out of Thao by teaching him how to talk like men do), and Eastwood handles the shifts in tone brilliantly. When the film takes a dark turn towards the end I sat on the edge of my seat in suspense, fully aware of where it was heading but still mesmerized by Eastwood's tour-de-force direction. This is an artist at his prime as an actor and as a director.<br><br>Whether or not \"Gran Torino\" will hold up as one of Eastwood's great films remains to be seen, and the film feels like it would be good for multiple viewings. The characterization is strong and not simplistic at all, you could argue that Kowalski is just another grouchy war vet, but Eastwood's beautiful, nuanced performance as well as some neat little touches in the screenplay (particularly towards the end) which I won't discuss in detail to avoid spoiling anything (and it's really fun to watch this movie unfold, Eastwood keeps the film moving at a wonderfully involving pace) would prove you wrong. The film works on yet another level as a deconstruction of Eastwood's image. I don't mean that as a negative, it just adds to the film's strength as a character study.<br><br>It's a more intimate film than Eastwood's other film this year, \"Changeling\", and also on a smaller scale than many of his other films, but it's just as ambitious in many ways. This is not a politically correct film about a grouchy old racist suddenly turning into the most tolerant person around, it is a film about a man who, near the end of his life, is forced to confront his demons, and on the sunnier side about a man who finds true friendship where he least expected it. By the end of \"Gran Torino\" I had forgiven any flaws it might have, and was completely satisfied with the film, which far exceeded my expectations. I have a feeling that \"Gran Torino\", which has already been met with strongly positive reviews (but is still being described as a 'minor' Eastwood film by some), will eventually become an especially important part of Eastwood's filmography.","user":"ametaphysicalshark","rank":[684,826]},{"title":"Clint Eastwood shows you why he still should be in FRONT of the camera","rating":10,"date":"16 December 2008","review":"With his performance Eastwood shows you why people like himself, Jack Nicholson, or Paul Newman only come around once in a lifetime. Though Eastwood would rather focus on directing, he can still carry a movie with his on screen presence, and he's pure dynamite in \"Gran Torino\". Perhaps the poor box office results of \"hollywoody\" movies like Absolute Power, True Crime, Space Cowboys, and Blood Work, caused Eastwood to shy away from acting, but given cutting edge material to work with as \"Million Dollar Baby\" and \"Gran Torino\", he's as good as ever. His character as the racist and salty war vet makes you think of that old guy we've all had on our blocks with the garbage door open, the million tools hanging everywhere, and always fixing or building something. I found myself not wanting the movie to end because the scenes between himself and the various Hmong characters where priceless. There may be complaints over the racist remarks and scenes, but Eastwood pulls it off in a way a real person like that would talk or act to a point where it ends up being lighthearted. I'm not going to give the plot away, but if you like your Clint Eastwood as a hard-nosed tough guy with foul language alla Dirty Harry or Heartbreak Ridge, you'll love this movie!!","user":"woljm45","rank":[393,493]},{"title":"Amazing Film...Eastwood deserves an Oscar!!!","rating":10,"date":"10 December 2008","review":"I saw the film and it was unbelievable. Clint Eastwood will have you laughing so hard you almost pee yourself while at the same time breaking your heart and making you want to cry. The movie takes you on a roller-coaster ride and the entire theater stood up in applause afterward. I highly recommend this film and if Eastwood doesn't get nominated for an Oscar something is truly wrong!!! The screening I saw was held at the Writer's Guild, so the room was filled with SAG, WGA, DGA, and other industry related people who I would wage know their movies. At points the entire room was laughing so loud I couldn't hear, and then minutes later all you could hear were the sniffles from people crying. The film has drama, comedy, and action and Clint Eastwood really creates a character that you care about and cheer for...again!","user":"bill2594","rank":[669,868]}]