[{"title":"Contraband the Original","rating":6,"date":"14 September 2012","review":"When I watched the American Contraband movie, I had no idea it was based on this movie, because I hadn't watched it back then. Of course the minute Contraband came out on DVD some clever marketing guy thought of releasing this movie too and label it with the tag \"movie Contraband was based on\". Since I liked the the other Contraband, I thought I'd give it a try.<br><br>And it is more than apparent that Contraband uses most of this movie as a blueprint. This one though, is leaner and faster. A frenetic pace that might leave some people behind. I like it when people can tell you the same thing, but quicker.. In this case though the remake did improve on some points. One of them is the ending. It doesn't make any sense, even if it is meant to be a joke, they should know better than that. The relationships get explored more in the remake, which on the downside make them a bit cheesy of course.<br><br>Tough to say what you might like more. I always think it's good to see the original first and then the remake. But that is up to you.","user":"kosmasp","rank":[9,10]},{"title":"Icelandic action as you've never seen it before","rating":8,"date":"10 October 2008","review":"I'm not going to spoil anything. So I won't go into any details about the story. I hate when people do that.<br><br>Here we have an Icelandic thriller that kept you excited right from the beginning to the very end. I absolutely loved the story, it was fresh and original and distinctively better than most Icelandic films that have tried to depict the dark side of Reykjavík (Iceland's capital). Looking back at films made over 10 years ago, such as \"Nei er ekkert svar\", it's simply astounding to see how far Icelandic film making has come. This really is an A-level action thriller which I found to be more entertaining than most movies in the similar genre I've seen during the past months. I think the director did an excellent job and Baltasar Kormákur should seriously consider acting more alongside directing because he shows and proves it beyond any doubt that he is one of Iceland's greatest actors. Iceland could of course use more actors because you kind of see the same faces over and over again, every time a film is made. However, when a film is as well casted as this one, one forgets that very quickly. All characters had found their way to just the right people. I must give kudos to Baltasar, Lilja, Ingvar, Þröstur, Ólafur, Jörundur, Victor... Jeez, just all of you. Thank you for a superb film.<br><br>Highly recommended, see it as soon as possible.","user":"oskarinn-1","rank":[17,25]},{"title":"This one is not only for Icelanders!","rating":8,"date":"9 September 2009","review":"I was very impressed with the film Reykjavik-Rotterdam. Just from the moment that I saw the trailer, I knew that I had to see this movie, and I was absolutely right! This movie offers you everything you need; Excitement, laughter, drama, you name it! The actors do a fantastic job, especially Baltasar Kormákur who is better known as a director but proves it in this movie that he is a fantastic actor as well. Ingvar E. Sigurðsson, one of Iceland's most beloved actors, is extremely convincing in his role as Baltasar's \"friend\" and I must say that I feel like all the actors just do a fantastic job. Most Icelandic movies, such as Baltasar's \"Brúðguminn\", I feel that are only fun for people from Iceland. However, this movie, Reykjavik-Rotterdam, can amuse everybody, and I can definitely say that it's just as good as many Hollywood thrillers I've seen. Try to find this movie and check it out, you won't be disappointed!","user":"alexanderf","rank":[11,15]}]