[{"title":"Jeff Bridges steals the show!!!","rating":8,"date":"21 December 2009","review":"Snapshot: Brilliant acting by Jeff Bridges and some solid performances by others hold up a movie that has an incoherent, low intensity albeit realistic story. The score of the movie (which is mostly country music) is also pretty good.<br><br>Highlights from the plot: \"Crazy Heart\" is not your average motivational movie with strong dialogue and high intensity drama. It follows a sober and a rather unusual romantic story. The story is loosely knit by a few incidents that follow the life of a very talented country musician who is also a raging alcoholic and a chain smoker. On one hand the lack of grandiose drama makes the story more plausible and real but at the same time some may feel that its devoid of depth or intensity. <br><br>What's Good: Witty humor (its pretty funny), The acting is top notch especially Jeff Bridges, The score is good (especially if you like country music), The treatment given to the story is fresh in some ways<br><br>What's Bad: The story does not SEEM to go in any particular direction. The pace is also a tad slow. The chemistry between Jeff &amp; Maggie is kinda offbeat<br><br>Who should watch it: People who really appreciate character development and who expect multi- dimensional characters etc. (Jeff Bridges character might be a treat for such folks), folks who expect a good score <br><br>Who should avoid it: Anyone who seeks out some high tension drama, powerful dialogue and a fast paced story should stay away from this one.","user":"jaykchan","rank":[173,200]},{"title":"Bridges' Best","rating":9,"date":"10 December 2009","review":"Saw an early screening of \"Crazy Heart\". \"Crazy Heart\" is a very good film for one reason. Many critics have praised it and will continue to do so. Many critics will write it off as \"just another washed-up musician struggling to overcome their addictions and weaknesses and make sense of things\", etc. In a way, they are right. In a way, this is another one of those movies. But, because of Jeff Bridges' absolutely amazing performance, this film is more than that. If you want to see an actor breathe real-life into their character, endow truthful subtlety in their part, and absolutely nail a role that they were born to play, then you need to see Jeff Bridges rendition of Bad Blake. I believed that Bridge's portrayal of \"The Dude\" in \"The Big Lebowski\" was the essential role of his career, but after seeing this performance, I've changed my tune. It's true that we will not be witnessing cinematic history with the incredible plot or awe-inspiring film-making. However, if you are a fan of acting and want to see one of those performances that comes along every once in a rare while, please check out this film.","user":"astonfilms","rank":[136,163]},{"title":"Jeff Bridges is absolutely amazing","rating":7,"date":"24 October 2010","review":"Here is the film that the ridiculously talented Jeff Bridges finally won an Oscar for, and deservedly so. His performance is the gleaming highlight of this film in the best way possible. He is playing washed up country singer Bad Blake, trying to overcome alcoholism and a dying career. The story is very touching, and how could you expect anything less than incredible from a character study piloted by Jeff Bridges. The film has a very organized focus on Bridges' character but he is also backed by a fantastic supporting cast. Maggie Gyllenhaal plays an aspiring reporter who interviews Blake, only to fall in love with him shortly after. Her performance is equally touching and feels so real alongside Bridges. Colin Farrell plays Tommy Sweet, an old friendship of Bad Blake's that went sour somewhere along the line. And then of course there is the small yet significant role of Bad Blake's long time old fishing buddy Wayne, played by the masterful Robert Duvall. The limited number of scenes between Bridges and Duvall are some of the best and most sincere of the movie. Crazy Heart is a great film to watch in order to see fantastic actors do what they do best... act.<br><br>The character development in Crazy Heart embodies the film's strong suit, which is the wonderful acting ability of the cast. There is not a moment when you don't believe in these characters and you truly feel that they are sincere and real. It is also just so incredibly satisfying to watch legends like Bridges and Duvall act side by side in beautiful and perfectly fitting roles such as these. The story of Bad Blake itself is very interesting, but the characters are where the heart and soul of the film lay. The plot leaves something to be desired, but it doesn't fault the movie as much as it could when you have such great actors filling the roles of such articulated characters. Admittedly, the film drags a bit towards the middle and the climax of the film doesn't hit as hard as I would have liked, but it leads into a cathartic and slightly cheesy ending, which leaves you wanting more, but emotionally satisfying nonetheless.<br><br>Now, I am not a fan of country music at all, but in the context of this film I absolutely loved it. It is so beautiful and touching that it would almost be a crime to say you didn't like the music while watching its fitting place in this film. And as if I haven't praised the actors in this film enough, I have to give even more kudos to Bridges and Farrell who took voice lessons to sing their own songs in the film, and holy crap do they sound amazing. You would think Jeff Bridges had been a country singer all his life. If you're not a fan of country music I wouldn't recommend listening to the music before you see the movie. But after you see just how perfect the soundtrack fits the film you will love the music. The music makes this film all the more sincere and is one of the only contexts I will ever enjoy country music.<br><br>Crazy Heart isn't perfect, but I'm willing to go as far to say that Jeff Bridges is. I can get past the imperfections of the storyline and the slight melodramatic feel the last third of the film emanates when the film boasts a cast as good as this. This is a solid film that is a pure delight to watch. And best of all, it nabbed Jeff Bridges a long overdue Oscar win.","user":"KnightsofNi11","rank":[24,26]}]