[{"title":"A very enjoyable Dark comedy","rating":9,"date":"19 July 2011","review":"After going through a disappointing summer movie line up this year \" 2011 \" so far, i was more than happy when i found this film playing in a theater near by.<br><br>And after watching this very enjoyable movie, i was left surprised in why it had a very limited release ? unlike most big budget summer movies, this movie focused on substance rather than style. it had a very engaging story that unfolds in a very intriguing way.<br><br>the story is that of a well known Pastor played by Pierce Brosnan who gets involved in a debate with a disbeliever and writer played by Ed Harris, soon after, the pastor gets involved in a sinful accident and tries to use his religious influences to get himself out. stuck in the middle of all this, is an ex-deadhead played by Greg Kinnear.<br><br>the Characters and acting were the best thing in the movie, a wonderful cast lead by Pierce Brosnan, Greg Kinnear, Ed Harris, Jennifer Connely and Marisa TOmey. they all deliver very memorable performances, and they added a lot to their characters. the characters were fun and seemed very familiar, easy to identify with.<br><br>the film was more of a dark comedy, very funny and laugh out loud moments involving religion, relationships and even murder.<br><br>I am just so surprised with the limited release, this film deserves a wider release and should reach more audience. I highly recommend this.","user":"med77_99","rank":[43,56]},{"title":"Be Open Minded ... Religion is FUNNY!","rating":9,"date":"2 July 2011","review":"I grew up Southern Baptist and I thought this movie was laugh out loud funny. Of course, there was some predictable religious jokes. Lots of confusion &amp; communication-based chaos with a karma-tic ending (though a bit trite). Actually saw this movie September 2010 at a early release film screening where we were able to review the film afterward. I hope they re-shot the ending, as the conclusion was a bit abrupt. Overall, it was a great laugh. Pierce Brosnan is EXCELLENT as Rev. Dan Day. Stand out performances by Greg Kinnear and Marisa Tomei as well. Not sure if this film will be a small release, but it's worth finding to see.","user":"cindiluhoo","rank":[38,52]},{"title":"Some viewers will find Salvation Boulevard's over the top characterizations of delusional religious fanatics to be in poor taste, over viewers will be in for some laughs.","rating":15,"date":"15 August 2011","review":"Salvation Boulevard is a star packed ensemble \"dramedy\" based loosely on Larry Beinhart's novel of the same title. Greg Kinnear plays Carl, a former \"deadhead\" (followers of the band Grateful Dead) who has settled into a nice quite life with his uptight and super religious wife Gwen, played by Jennifer Connelly. Gwen religiously attends the Church of the Third Millennium which is led by the charismatic Pastor Dan Day, played by Pierce Brosnan. Having enraptured the town with his holy message, Day sustains a small empire for himself made out of an adoring congregation that worships him like a prophet. With an ego of the size of Jesus' cross, Day aspires to build a \"city upon a hill\", a planned and private community, complete with a school and hospital. Not only will this provide a safe and convenient sanctuary for God's worshipers but as the chief developer of this colossal undertaking Day stands to make a healthy sum of money.<br><br>However, the meeting of renown atheist extraordinaire Dr. Paul Blaylock, played by Ed Harris, puts it all at risk. After a public philosophical debate, Blaylock and Pastor Day retire to Blaylock's office for a friendly nightcap. Carl tags along to the meeting as Day's newly evangelized prize. Here a genial discussion about a joint book venture turns awry when Day accidentally shoots Blaylock in the head with an antique pistol.<br><br>In a moment of panic, the Pastor disguises the incident as a suicide attempt with Carl in the room as seemingly the only witness to Day's deceit. Carl's life then spirals into disaster as not only do his wife and closest friends not believe his truthful story but there are others trying to kidnap and frame him. <br><br>Salvation Boulevard's story line has a similar feel to that of the Coen Brother's film The Big Lebowski [1998]. Like \"the Dude\" in The Big Lebowski, Carl plays a very passive protagonist who gets caught up in mortal danger through no fault of his own. He is seemingly moved from precarious situation to the next by all forces other than himself. Carl passivity is contrasted by the outrageous antics of the characters that surround him. Pierce Brosnan with his good looks, deep voice and smooth command of language personifies an excellent slimy and manipulative pastor. As Day's ego and paranoia grow throughout the film so does Brosnan's comedic affect as he literally starts to believe the devil is after him.<br><br>With such a wealth of idiosyncratic characters Salvation Boulevard was able to attract a large award winning cast, including Marisa Tomei who plays a free spirited security guard. Jennifer Connelly and Jim Gaffigan play Day's fanatical and easily persuaded followers. Some would say these characters are a cruel misrepresentation of the Evangelical community. They may have a point, but taking this comedic movie too personally deprives the viewer from finding all the comical religious Easter eggs in the film. One of which is a building with devilish horns on the roof where Carl is taken to by Day's zealots. The laughs in Salvation Boulevard are not gut busters but are subtlety sprinkled throughout the film. <br><br>On the down, this film has a less than satisfying ending and seems to end abruptly. The side characters don't get endings that are worthy over their performances. Instead they are given in the form of text. An extra ten minutes might have wrapped the film in a more imprinting manner. Salvation Boulevard is layered with jokes that lie not only in th dialogue and action but also in the art direction and cinematography, giving the film the rare quality of finding something new every time you watch it. Unfortunately, this film will probably go under appreciated as critics have slammed it for its obvious slant against Evangelical Christians. However, I have faith that in time Salvation Boulevard will find its audience, but they probably won't be as devoted as your average \"deadhead\". <br><br>7 out of 10 <br><br>This Film is not for: <br><br>-People who don't find mocking religion funny<br><br>-People who have no interest in religion","user":"DemiRonin","rank":[28,38]}]