[{"title":"Fantastic Film!","rating":10,"date":"20 January 2009","review":"Just watched this at the Sundance Film Festival. Absolutely great film. Dark, smart comedy in the spirit of Rushmore. The Bobcat is BACK! Very good cast; great soundtrack. He uses very real issues to simply tell a story about the relationship between an ungrateful punk kid and a painfully weak father. In the Q&amp;A after the film, Bobcat pointed out that most of the comedies being made these days are basically R-rated films made for 13-year-olds (mindless, raunchy, etc.). World's Greatest Dad is a comedy for adults: insightful, original, uncomfortable at times...hilarious. Robin Williams manages to be miserable, mean, touching, and funny without any conflict at all, an inspired break from his traditional roles.","user":"jimtabery","rank":[128,171]},{"title":"Way to go Bobcat","rating":10,"date":"21 August 2009","review":"This is one of the best films I have seen in awhile. I have heard complaints that the acting is terrible, the acting wasn't bad at all. The characters were supposed to be very shallow and that shallowness was heavily exaggerated. But when the acting needed to be there it came across at magnum force. I would say that much of the movie has a cartoony feel, maybe that is because the only other work I would compare this film to is South Park. They amplify each characters ego and traits to the point it is cartoonish but it works very well in this film, as well as South Park. It switches back and forth between comedy and drama to the point you don't know what you are watching. Maybe many people didn't appreciate it for this reason. But then there are some weirdos that don't like South Park either. Go figure. <br><br>You could look at this film in a few ways, it makes you question things. At first it appears that the Dad is doing the right thing for his Son, then for his students and then for himself. You keep wondering where or if he will draw the line. It also makes you wonder what people will do for attention even if they must be a muse. It makes me wonder how many times something like this has occurred in the real world and how many times we have read or heard about it. <br><br>Robin Williams should be proud of this one, Oscar worthy performance. Daryl Sabara is incredible. He has covered quite a bit in his short career but this one should put him in the special class of young actors. I really liked Lorraine Nicholson's character Heather, she pulled off the Goth chick flawlessly. I also enjoyed the little shout out to Simon Pegg when Lance is talking to his neighbor about zombie movies. <br><br>Bottom line, many people will not connect with this film because it is very \"artsy\" and somewhat taboo. But it is a great film. Way to go Bobcat!","user":"JerryLambert","rank":[90,120]},{"title":"Blackly Brilliant","rating":9,"date":"12 October 2010","review":"I loved the characterisation of this movie: Robin Williams is one of those actors you have to like. So when, as in this movie, he plays someone who is sweet and kind and weak and crawling through moral quicksand, the resulting conflict you feel has you laughing out loud and wringing your hands with anxiety all at the same time.<br><br>The plot is original and comes with a couple of unforgettable twists. The dialogue is sharp, the humour dark. The moral compass is spinning wildly, but it straightens up for us in the end. <br><br>There is a quote at the end of the movie that really struck a chord with me.<br><br>\"I used to think the worst thing in life was to end up all alone, but it's not. The worst thing is ending up with people who make you feel all alone.\"<br><br>Brilliant.","user":"flashorton","rank":[28,35]}]