[{"title":"This Film Makes My Physically Angry","rating":8,"date":"8 May 2019","review":"First off, there is a big budget movie starring Helen Hunt that I was looking for when I came across this mistake of a film instead.<br><br>I watched the whole thing unfortunately, maybe to punish myself for some horrific sin I am unaware of because that is what watching this film feels like. Punishment.<br><br>The problem is not the fact that the film is low budget and unoriginal. The issue is the writing, acting, and directing. No character is likable, you're not sure who you're rooting for, the story-line skips around over and over again so you're never really sure what is happening and what came first. It is a absolute mess.<br><br>I am under the impression that the idea behind the making of this film was a hot, dirty pleasure, murder mystery, love-triangle, thing. But it doesn't come across that way. The actor's performances are terrible, gross even. The audience isn't really given a likable character at all, everyone just generally sucks. It would make sense if the main character was the creepy weirdo and so the audience followed him and he then developed characteristics that made him somewhat likable or redeemable, or maybe we just aren't supposed to be rooting for him and instead rooting for his end. But there is none of that. The writing just does not make sense and it isn't smart.<br><br>The worst part is, is that you really get a sense of horrific pride from the actors and creators. I am assuming it was created by a narcissist because, wow, it's insane.<br><br>It's just, aggravating to watch the whole thing, it makes no sense. It's like if you had a fever dream in the early 2000s while you were sick and couldn't wake up. It's bad. Just Bad.","user":"hopeh-23661","rank":[15,17]},{"title":"Some advice to the directors or producers involved","rating":1,"date":"15 March 2019","review":"Since earlier this film days had been spammed with 10/10 fake reviews, (you can even find a clear cut date before which its filled with all 9/10 -10/10 robotic reviews and after which all 1/10 to 3/10 rants), as a long time IMDB user adding my contribution to balance out the fake score.","user":"konporer","rank":[11,13]},{"title":"Can't believe the 10 wow great movie reviews","rating":1,"date":"17 April 2019","review":"Really really!!!!! This is a 10 to these reviewers. Calling it awesome, wow and thriller ride. Well, most of those reviewers only have reviewed this one movie so they are either totally fake bots or they worked on this movie. It's getting to be a joke to check out reviews on this site because they are so fake. I need to find another place to check out films. Oh and this movie don't even bother.","user":"shaneandamy-19629","rank":[8,9]}]