[{"title":"Amazingly directed, Greatly Scripted, and Impeccably acted. What more can you ask for in a movie?","rating":9,"date":"18 January 2011","review":"I am a big of David Fincher's work, when I realized he was going to make a film about the creation of Facebook, I was really excited. I came in the movie with huge expectations, and hopeful that it would turn out great. I have to say, I was impressed, my expectations were not only met, but they were blown away. The Social Network easily rivals Fincher's previous works like \"Fight Club\" or \"Se7en\".<br><br>Aesthetically the film is very beautiful, its very \"Fincher\". It has a very perversely attractive appeal, a glimmering awfulness, as it was lit from within. David Fincher deserves an Oscar for Best Director, he is extremely underrated by the Academy. Hopefully this film will finally bring Fincher in a new light.<br><br>The actors did an amazing job, they should all be recognized for their work in this movie. Jesse Eisenberg did an amazing job playing Mark Zuckerberg. Hopefully he will not be known as the next Michael Cera anymore. With this film, he established himself as a serious actor and he will have a bright future ahead of him. Andrew Garfield also did an amazing job as the co-founder of Facebook and the best friend of Zuckerberg. He deserves an Oscar nom and I hope we'll be seeing more of him in the future. The rest of the cast did a fine job and also hoping seeing them in the future.<br><br>I recommend this movie to everyone, it deals with betrayal and greed. The movie definitely deserves an Academy award for Best Picture. It is extremely revalent for our times and many years to come. I consider this movie is a fine piece of modern filmmaking and probably will be considered as a classic in the future. So if you're not doing anything tonight, you should spent an evening in theaters to watch The Social Network.","user":"Loving_Silence","rank":[210,281]},{"title":"The Power Of Great Direction","rating":9,"date":"20 January 2014","review":"So there I was, sitting in the cinema waiting to see 'Inception' greeting every belated trailer with a groan, each one prolonging the time till I could finally see one of the most anticipated movies of the year and there it was, I turned to one of my friends \"my god..a film about facebook?!..\" To say I was skeptical for those few moments would be an understatement, I was almost angry, like a footballer who releases an autobiography 5 years after he starts his career I just didn't understand the timing of it, who cares anyway?<br><br>\"I think this is Finchers new movie actually\"<br><br>\"DAVID Fincher? He's made a film about facebook?!\"<br><br>Almost immediately 'Social Network' became a movie that I needed to see. David Fincher is one of the true masters of delivering some of the greatest films of the past few decades. The gritty 'Se7en' and the intelligent 'Fight Club' had been two of my favourite movies growing up, the latter of which I had the privilege of studying in college quite in depth and although I missed 'Benjamin Button' (only god knows why it took me until 2013 to watch!) I had thoroughly enjoyed the enigmatic 'Zodiac' as well.<br><br>'Social Network' became my favourite Fincher title almost immediately. It is one of those rare works that feels so effortless in its brilliance which is due to the incredible work from both Fincher and Sorkin in creating this modern masterpiece, the way I see it the film relies heavily upon three aspects which are executed with perfection.<br><br>First of all, the score for this film is sensational. I've always been a huge fan of Trent Reznor &amp; Nine Inch Nails but with his partnership with Atticus Ross and his ongoing collaborations with Fincher (also see 'Girl With The Dragon Tattoo') I can only see them becoming the most formidable artists in the industry, every minor note resonates perfectly throughout the film and creates a beautiful texture on top of an already excellent piece of work.<br><br>Secondly, Sorkin's razor sharp screenplay is something a director can only dream of receiving, the dialogue never falters and it is always witty, sincere and hilarious all in one (which can also be attributed to the performances of the actors involved)<br><br>But most of all, the atmosphere that Fincher is able to create visually is stunning, huge credit must also go to long time collaborator Jeff Cronenweth, together their formidable partnership and undoubted perfect understanding of each other's work is clearly the factor behind this film being one of the best movies of the past decade<br><br>Great performances from Eisenberg, Garfield and Timberlake also help this movie stand head and shoulders above most and as one of the most promising young actresses in the business, Rooney Mara is given her first chance to truly show her quality in a small role.<br><br>It's difficult to say where 'Social Network' will stand when we look back on Finchers body of work but one things for sure, if it isn't seen as one of his truly great masterpieces then he is sure to become one of, if not the most powerful director in the industry for years to come.","user":"mwatt89","rank":[50,66]},{"title":"A timeless story of friendship, loyalty, greed and betrayal","rating":10,"date":"28 September 2010","review":"I just want to get this out there right away and put the cards on the table so to speak: When I first heard about it, I had very little faith in this project. I was stupefied, confused by the thought of what attracted all this talent to this seemingly trivial story to begin with? Why would David Fincher and Aaron Sorkin possibly be interested in the story of the founding of Facebook? Surely they could have found something more important, more meaningful to apply their efforts to. After seeing the film, though, I realized that, of course, Fincher and Sorkin knew what they were doing all along. And furthermore that labeling this as \"The Facebook movie\" is really an insult to what Sorkin and Fincher were trying to and have succeeded in achieving with this film.<br><br>First and foremost, I have to take a step back and admire this film as a technical achievement. Despite seeming to be a departure for Fincher in terms of content and subject matter – which it is and then again isn't – the film is very clearly and undeniably a Fincher film. Re-teaming with his Fight Club director of photography Jeff Cronenweth, Fincher manages to create and capture that really unique look all of his films have. The cinematography is absolutely gorgeous – once again, Fincher proves that he is probably getting the best results in digital photography out of any other director working in that medium, and this film, shot on the RED One camera, looks absolutely beautiful, from the framing to the camera movement to the lighting and on to the look and the feel of the depth of field the RED captures.<br><br>Sorkin's script is also an impeccable achievement and showcases, once again just what a genius this man really is. From a structural standpoint it employs a very effective use of a framing device – the Zuckerberg lawsuit depositions, which introduce the various characters and lead into \"flashbacks\" of the events being discussed. It really lends the film a Rashomon air and intensifies the mystery behind the Zuckerberg character and what exactly transpired in the creation of this phenomenon, Facebook. Sorkin also demonstrates an acute awareness of character construction, and manages to create a loathsome protagonist we hate and are frustrated by but yet we still end up sympathizing with. Most of all, though, it's a showcase of Sorkin's impeccable writing style and knack for writing dialogue with a very unique sound and rhythm. I saw Fincher refer to it as \"Sorkinese\" in an interview, and this is a really good description – it is certainly very unique to Sorkin and the scripts he has written, and it is also certainly a completely unique language – one which normal people in our real world do not speak, but that just sounds great on screen. The rapid-fire, overlapping dialogue remains one of the highlights of the film for me, and the script is certainly a shoo-in for Oscar consideration.<br><br>The film is also a rare showcase of pure acting prowess, and features a very interesting and eclectic cast of young actors stepping out of their comfort zones and delivering some truly phenomenal work. The casting of the film is quite a departure for Fincher, who has enough clout to gather the biggest names working in the business. Instead, he opted to go for a cast of relative unknowns or up-and-comers, and really make stars out of them. First and foremost to be mentioned is Jesse Eisenberg, an actor I have personally been a fan of since The Squid and the Whale in 2005 and one whose work I have continued to enjoy since then. However, no matter how good he was in those previous films, none of his previous performances compare to his amazing achievement on this film. Stripping away his signature goofiness and neurosis, Eisenberg plays Zuckerberg as a cold, calculated and determined genius who knows what he wants, is very confident and forward-looking and will stop at nothing to get it. His counter in the film is Saverin, played brilliantly by Andrew Garfield, a name we will be hearing a lot more of of in the next few years: Saverin is a far more sympathetic character, more warm and inviting – these traits only increase the impact of the tragedy of Zuckerberg's betrayal of their friendship.<br><br>Many pundits and commentators have designated this to be the \"film that defines our generation\", and truly a \"product of its time\" in the most literal sense of the word. However, I'm not sure I like this designation, especially since once you watch the film, you very quickly realize that this isn't a story about the founding of Facebook; it's really a story of friendship, ambition and betrayal, a character study of this fascinating individual whose actions in the film happen to depict the invention of an online social networking site that gets out of hand and puts all of his relationships, especially that with his best friend and business partner, in jeopardy. All of the themes mentioned above are universal and can be applied to a number of fantastic films and works of fiction over the centuries, and that, I think, is the greatest achievement of the film.","user":"Monotreme02","rank":[410,675]}]