[{"title":"Good movie for kids","rating":10,"date":"5 October 2012","review":"We took our 3.5 year old daughter and a friend of hers to see the movie and they enjoyed it very much. It's good to see a movie with no villain and evil antagonists, and much like the previous Tinkerbell movies we saw before (on TV) this movie is a great joy for little kids. I see its currently low ratings in IMDb and it bugs me that people are rating children movies as if they were meant for adults... Yeah, for me and my wife the movie was pretty simplistic (don't go to see it without the kids :)) but for children it was excellent. Good graphics and great visuals, Good story, No scary things for young children, Not too long for children to sit through, Includes famous beloved character and characters from previous movies. a clear 10/10","user":"alon-tal","rank":[51,54]},{"title":"A good story and great animation","rating":10,"date":"13 September 2012","review":"I normally go to adult movies. But once in a while, with my little daughter, we decide to go to the theaters to discover the magic of animation. I do frequently criticize movies that do not have strong stories. And animated movies are part of those. But the four movies of Tinker Bell are outstanding. Not only because of the animation or the creativity involved in every situation, but specially because the story is normally so strong, and the characters are so well defined, that a sense of emotion comes from me and my family at the end of the movie, and when any movie touches you in some way, it has achieved its goal. Totally recommended for families and people who wants to discover something new in a classic story.","user":"enrpat-1","rank":[41,44]},{"title":"Charming with beautiful visuals","rating":8,"date":"18 January 2013","review":"I did enjoy the previous Tinkerbell films, so I watched Tinkerbell and the Secret of the Wings knowing what to expect and hoping it would be as good as the others. And it was. From an adult standpoint, maybe the story is a touch too simplistic and some of the dialogue cheesy(and I have to admit I did find them so at times). This said, the story is also cute and charming with a well-intentioned message, and the main target audience I doubt are going to care too much about what the dialogue is like. Moving on to the many positives about Secret of the Wings, I'll start with the animation, which is really beautiful, full of colour and sparkle. I'd go as far to say that of the Tinkerbell movies, and all of them are well-animated in my opinion, Secret of the Wings is the loveliest from a visual standpoint. The soundtrack is sweet, breezy and unobtrusive, which suits the tone of the story very well. The characters are still likable and engaging, also ones that anybody in the right mindset will relate to. And that is instead of going around saying that it's for \"little girls\", an irritating stereotype that helps to give the Tinkerbell movies and others movies an undeservedly, I feel, bad rap. They are also very well voiced, Timothy Dalton and Anjelica Huston(the latter being one of my favourite actresses) both do great jobs and gives older audiences to the main target audience at least one reason to watch without prejudice. Overall, a charming and beautifully animated. 8/10 Bethany Cox","user":"TheLittleSongbird","rank":[14,14]}]