[{"title":"300","rating":6,"date":"22 February 2020","review":"Is it a 300 prequel, sequel, or set concurrently with the events of 300? Yes. It somehow manages to be all of the above, and manages to come up with a story that leads up to the events of the original and sorta what happens afterwards as well as creating a storyline of what was happening at the same time somewhere else. It's also always fun when original actors return in cameos to reprise their roles to give further character backstory especially the \"this is madness!\" guy who manages to get a quick story arc.","user":"MR_Heraclius","rank":[37,38]},{"title":"Ruined absolutely ruined (spoiler alert!)","rating":1,"date":"7 March 2014","review":"This movie was absolutely a waste of my time and my money. I went to my local theater on March 7th which is also my birthday and I wanted to see the movie based on the performance of the first 300.<br><br>The first 300 had catharsis, it had actual character development and made you want to keep going. This new 300, \"rise of an empire\" was absolutely horrendous. Rise of an empire, what empire? <br><br>This Great War that united the Greeks was barely touched on. It was all about the blood and the guts and breasts. I don't mind nudity. I don't mind blood. But the way the director went about it only cheapened the experience. This movie has a line in it \"you fight harder than you f***\" (Artemisia). It could have been beautiful and filled with the promise of something both hilarious and invigorating if the scene it referred to had not been so vulgar. 300 Rise of an Empire was not worth the money I spent on it. There are books out there on this point in history, historical fiction books that have stronger character development than this script. The actors did the best they could with what they had, but writers and director, you owe the public an apology for this poor display of cinematic \"genius\". It was cheap, crude and not well thought out. I had higher hopes. Next time actually make something worth watching.","user":"Annaparsons859","rank":[297,432]},{"title":"Terribly stupid and pointless","rating":2,"date":"17 March 2014","review":"How could you mess up a sequel to 300? The story of the first movie was simple and straight forward, yet jam packed with wit and beautiful details...and came along with a look that was fresh and sexy, very self assured and uncompromising. <br><br>Rise of an Empire is a joke compared to the original and a huge let down for anybody who appreciates good (or even visually appealing) movies. The story is unnecessary complicated but doesn't make much sense. While the visuals in the first movie seemed stylized and fresh, ROAE seems cheap, the 3D never really impresses (enough to justify it's use) and I had a hard time finishing the movie, partly because I couldn't believe how they could do this to the franchise...and how Zack Snyder is still part of this...I don't think he sleeps well these days.<br><br>Typical Hollywood sell out of a creative original idea. Really surprising to me are all those good reviews all over the place, but I guess quality standards are just ridiculously low these days.<br><br>Avoid if you can!!!!!","user":"jo-185-56717","rank":[284,445]}]