[{"title":"This disaster could have been avoided if the director had a Sassy Gay Friend, or at least a copy of the damn book","rating":2,"date":"1 April 2012","review":"Problems with this movie:<br><br>1. Ben Barnes as Dorian. I guess he's kind of good-looking in a gawky sort of way, but he's not blindingly gorgeous and charming enough to seduce every man, woman, a child in the British Isles. In fact, he's kind of awkward.<br><br>2. The whole plot line with Sybil is just....FUBAR. I don't even know what to say about it, other than to wonder whether the director actually read the book or not.<br><br>3. The boobs-to-intelligent-discussion ratio is alarmingly high.<br><br>4. Remember in the book how Basil had a lot of great lines? Well, that's all been replaced by bitchy glares and an awkward blow job.<br><br>5. When Dorian smells the bloody scarf after he kills Basil. I don't know, I guess it's a petty thing to complain about, but it just made me laugh hysterically at an inappropriate time.<br><br>6. The ending. Where did that even come from, seriously. I really want to know whose idea it was to completely change the whole second half of the plot, because really, if you think you can write Dorian Gray better than Oscar Wilde did, you should be lobotomized.<br><br>Good things about this movie:<br><br>1. Lord Henry. Spot on.<br><br>2. They have some really nice costumes.<br><br>3. Um...no, that's about it.","user":"uberfurbs","rank":[52,63]},{"title":"Laughably Bad Movie","rating":2,"date":"21 July 2011","review":"I hardly know where to start describing just how bad this movie is. First I will say that the movie, especially the first half, feels terribly choppy and rushed. The relationship between Dorian and Sybil, for example, from initial meeting to marriage proposal, to break-up and suicide is covered in the space of TWELVE MINUTES. This is including the scenes in between in which she is not involved. The director probably could've put a montage of them running through tall grass and painting each other with paint rollers while giggling merrily and it would've done a better job of establishing this relationship in believable fashion.<br><br>I feel like the director just wanted to get it out of the way so that he could spend as much time on the lurid details of Dorian's life as possible. <br><br>Director: What? I have to provide an explanation? OK here goes...<br><br>Dorian: hi I'm Dorian want to get married? <br><br>Sybil: yeah sure <br><br>**2 days later**<br><br>Sybil: you slept with a whore! I'm going to kill myself!<br><br>Director: OK now that that boring storyline garbage is out of the way I can get to the S&amp;M sex montages, murders, and a painting that actually GROWLS AND HISSES.<br><br>Which brings me to my next problem with the movie; the cheesiness and unbelievably heavy-handed symbolism. The first time that we actually see a heavily altered version of the painting hidden up in the attic, the camera zooms in on the painting and yes, it actually hisses at the audience. I feel that this is a massive cop-out on an attempt to create a frightening and tense atmosphere. It is as if the director was unable to use lighting, shot framing, scenery, etc. effectively to create the atmosphere which he desired, and decided instead to have a ghost pop up on screen and yell \"BOO!\" at the audience to startle them into a state of fright.<br><br>The symbolism is something I would expect to see from a first year film student. The montage of S&amp;M sex scenes inter-spliced with scenes of Dorian spreading jam on a biscuit made me burst out laughing. Possibly the most obtuse symbolism I've ever seen in a movie takes place when Dorian seduces Hallward at his party while some kind of sexually charged African drum dance involving a large snake takes place downstairs. That's right, snakes look kind of like a penis, and they're representative of sin! BAM! Double the symbolism! I was so convinced in the final scene where Lord Henry speaks to the painting that it was going to blink or start crying, I'm sure someone talked the director out of that one. I wouldn't even have been surprised to see a caption saying \"Dorian is in the painting\" with an arrow pointing to it.<br><br>A great deal of Oscar Wilde's sharp wit is cut from the story, and what does remain I would call the most redeeming factor of the whole movie. There are still a small handful of wonderful Wilde quotes that will have you laughing and thinking, but you can save yourself the trouble of viewing this travesty.","user":"dawejon-113-632078","rank":[33,41]},{"title":"What a disappointment!","rating":4,"date":"6 January 2010","review":"When I first heard about the Picture of Dorian Gray becoming a movie I was excited and overjoyed. I thought with this new technology the 21st century has, The Picture of Dorian Gray will receive the justice it deserves. However, I was very wrong. I just finished watching the movie and I felt compelled to write a review about it.The movie was horrible. A grand disappointment which had such potential to be great. Firstly, the movie should have claimed to be inspired by the novel not based on it. I say this because the movie was very different from the novel. All of Oscar Wilde's wit and beauty which truly made the novel classic was ruined and overshadowed by the changes the movie made. I understand that there can be biased when reading a novel before seeing the movie adaption, but this movie adaption was appalling. I wont give anything away but the movie seriously ruined Oscar Wilde's vision and above all his memorable characters. Once the movie changed aspects in the novel the whole thing became horrible. Trust me, you'll agree if you've read the novel first. <br><br>Ben Barnes is simply gorgeous but he hardly brought any character development. I never felt pity for him throughout the movie compared to the novel. The novel brought the characters to life and described the reality of London life. The movie made the classic novel very shallow. I must add that as much as I love Colin Firth he was not convincing as Lord Henry. The character was someone who was vindictive and unchanging. He drained Dorian and was never affected by the consequences of his own evil; Colin Firth failed at reincarnating the abhorred character. Whats worse is that the whole ending is changed, which ruins the whole message of the novel. In the end, Oscar Wilde's masterpiece remains legendary in its pages as opposed to its film adaption. Seriously, I think my rate of 4 is being to generous.","user":"fivebyfive_6","rank":[116,159]}]