[{"title":"Den of Thieves","rating":9,"date":"7 February 2020","review":"Very good very action filled and keeps the suspense up and is perfectly poised at the end to descend into another thriller like this one","user":"MR_Heraclius","rank":[43,49]},{"title":"A fun, well paced movie that isn't pretending to be something it's not","rating":8,"date":"20 January 2018","review":"You can't enter a movie like this expecting some cinematic masterpiece. If you do so, you'll be obviously disappointed. Otherwise, it's a completely entertaining and fun ride through some surprisingly complex characters and an unexpectedly intricate game of cat and mouse.<br><br>There have been some comparisons of this movie to the movie Heat, and I think they may be somewhat warranted. OBVIOUSLY, this does not hold the gravitas of a mid-90's DeNiro/Pacino face-off, but plot structure, pacing, character development and the Los Angeles backdrop were all very familiar. <br><br>At the core, you have Pablo Schreiber, who is 1 or 2 decent movies away from being given a real shot at a career defining role. He led this film effortlessly and truly gives you a very raw sense of character. Gerard Butler plays Gerard Butler and convincingly so. The two square off for 140 minutes and it's surely fun to watch.<br><br>The 140 minute runtime seems to have garnered some attention from reviewers. Yeah, it's long, but it really doesn't feel that way. The pace of the film is stellar, and you never really feel any \"look down at your phone\" moments. The heist movie is often times full of overdone clichés and unconvincing \"suspense\" but for some reason this film was able to put a fresh twist on everything you see. <br><br>If you've seen a trailer for the film, you'll be very happy with it. I think this is a case of extremely good marketing and a trailer can make or break your audience's expectations for a film. From the trailer, you see a crew of goons led by some wannabe badass and a crew of cops trying to intimidate them and take them down. The trailer doesn't give you much of a glimpse at anything more than elementary storyline, which is why if you see this film, you'll be pleasantly surprised. <br><br>Had more fun in a theater than I can remember in recent years. <br><br>8/10","user":"naregian","rank":[197,255]},{"title":"The most macho thing I have ever seen","rating":7,"date":"6 January 2019","review":"A bunch of professional thieves knock over a big city bank and butt heads with a not so professional bunch of police.<br><br>Now on paper there is a lot to not like about this.\nAll the main characters look like human versions of He-man figures but with neck tattoos. Everything about them just screams ass-hole.<br><br>This is actually one of the films strong points.\nThere are no good or bad guys in this film just seriously flawed people acting on some quite ambiguous motivations.\nI found this made the film more exciting because there is no chance of the \"good guy\" winning in the last moment.<br><br>There are lots of scenes that build on characters but ultimately feel like dead ends in retrospect but does get you invested.<br><br>The action is kept to the end and when things ignite it is very exhilarating and feels quite real.<br><br>Well shot, acted and produced.\nThe actual heist when it pans out is not particularly clever.<br><br>If you are not a big fan of action movies then all the muscle bound guys fist-bumping each other and slapping butts might be a bit of a turn off.","user":"thekarmicnomad","rank":[9,9]}]