[{"title":"Far worse than you can imagine","rating":1,"date":"10 May 2019","review":"An obvious ploy to have the viewers pay for Hathaway and Wilson's vacation in Spain. This movie made me question if I had ever liked any of their films. I thought the trailer made it look harmless enough, but now I'm blind in one eye, I've broke out in hives, and my dog won't fetch.","user":"ambudde","rank":[442,614]},{"title":"Dirty Rotten Movie","rating":3,"date":"10 May 2019","review":"The Hustle is a remake of Dirty Rotten Scoundrels. Nothing about it seemed to have been marketed very well.<br><br>And now we know why. It's only 90 minutes long, but it feels like just a fast paced brush through of scenes that worked better before.<br><br>it robs it of wit, of funny, and also of any real purpose or sensible plotting, and i'm confused as to who this is meant for other than the Rebel Wilson fan.<br><br>And speaking of Wilson, is her 15 minutes almost up yet? It's gotta be. She's fine in small doses in those Pitch Perfect movies but insufferable in any kind of leading role.<br><br>She plays the Steve Martin role here and where Martin was charming, Wilson is deeply, deeply unpleasant. She's gratingly loud, infantile, idiotic, and falls back on slapstick fat jokes way too often.<br><br>My one defense of her is that she seems to be taking the crap even Melissa McCarthy doesn't want but even still, there are solid comic performers who have shown something even with weak material but she's been terrible so far.<br><br>Anne Hathaway on the other hand should just know better not to go anywhere near this. Like in Oceans 8, she's a highlight, but she wrongly has to play second fiddle to Wilson.<br><br>And this is yet another female remake that sets itself up as \"the femaing this to actresses?les are going to get back at the men.\" Did these people even know the ending of Dirty Rotten Scoundrels?<br><br>Even so, these characters here make all the wrong moves. Like the Wilson character even tells the Hathaway character that she's a con artist. Why would you do that?<br><br>Well the reason she does it here is because she mostly just cons men and she tells the Hathaway character this because of course another woman would sympathize with conning men.<br><br>This is a movie that also seems to think con artists also need to be knife throwing ninjas. What it never really does prove that either one of these two women are competent enough to string anyone along on a con.<br><br>And if you thought they wouldn't do a Ruprecht scene, well, they did. And it's not just a pale imitation, it's an embarassing failure in nearly every way.<br><br>They also do a Dr. Schaffhausen scene and I will say it's probably the one time here where the movie shows some of it's own ingenuity.<br><br>Overalll the few times where it does try to do it's own thing, it goes bust, and it's plot copies not just yield diminishing returns but make you think why does Hollywood keep do<br><br>They sell this is some sort of female empowerment but the movie is not just unfunny, it also doesn't even seem to understand the concepts that made the other movie great.<br><br>There are people who can write new, interesting, funny stuff for women. Proving you can do what a man can do is not the same as doing an exact retread of what men have done.<br><br>If you liked this, check out Craig James Review on Youtube for more","user":"C-Younkin","rank":[233,327]},{"title":"CRINGE","rating":1,"date":"9 May 2019","review":"Really bad, acting is terrible and it feels like everyone working on this film thought it was funnier than it really is. I left 3/4 or so into it to get a stiff drink with my friend.","user":"bencrea","rank":[209,314]}]