[{"title":"Low-budget gem","rating":8,"date":"8 June 2010","review":"Eight talented candidates have reached the final stage of selection to join the ranks of a mysterious and powerful corporation. Entering a windowless room, an Invigilator gives them eighty minutes to answer one simple question. He outlines three rules they must obey or be disqualified: don't talk to him or the armed guard by the door, don't spoil their papers and don't leave the room. He starts the clock and leaves. The candidates turn over their question papers, only to find they're completely blank. Soon enough, the candidates begin to uncover each other's background, prejudices and hidden agendas. Tensions rise as the clock steadily descends towards zero, and each candidate must decide how far they are willing to go to secure the ultimate job.<br><br>Exam is a gem of a film. This low budget psychological thriller is very clever, incredibly entertaining and the production values are all far better then you would expect from such an unknown film. It's tense, mysterious and has a great atmosphere, and more importantly it stimulates your brain. It's impossible to not get caught up in the story and try to figure out just what the hell is actually going on. It couldn't be more engaging. <br><br>There's not one well-known actor in this cast and yet, for the most part, the acting was great. One actor, Luke Mably, really stood out though. But what really made the film work was undeniably, the impeccable direction. In conclusion, Exam is a great low-budget thriller that puts many Hollywood blockbusters to shame. Definitely worth seeing and I'll be sure to check Stuart Hazeldine's next project after such a promising debut.<br><br>7.5/10","user":"imdbbl","rank":[170,203]},{"title":"A film with an interesting concept but fails on so many levels.","rating":3,"date":"10 April 2015","review":"The film opened up giving me high hopes with an enjoyable slice of cinematography that is reminiscent of other films, however as I continued, bit by bit it chipped away my hopes for the film.<br><br>During the film rules are quickly set up, making it clear what the characters are able to do with a set of rules and not other outside rules apply. The characters act understandably at first but quickly just seem to ignore what any normal person would do, the characters are all established to be highly intelligent and also deductive but fail to take notice of blatantly obvious things. Characters also quickly establish themselves as arch types. The male characters are quickly shown to have clear personalities however many of the female characters seem to have had little written for them other then one being an information dispenser who for the majority of the film is just a robot. In general it is well acted however the actors seem to have been given both a poor script and directions.<br><br>Even with plot holes ignored and the ending, the film is largely just several strong archetypes having very simple mind games with each other. Several times during the film I was able to call out certain outcomes before they happened as the characters are highly predictable. Without my opinion of the awful story I would describe the film as a 4 out of 10 instead, however with it included I would say a 3.<br><br>Below is spoilers for the film and where most of the plot holes or just stupidity of the story is mentioned.<br><br>What was the answer to the question? Well there was only one question asked during which was \"Any question\" and so the answer \"No\" was correct. My eyes practically rolled out the sides of my head in grimace. The statement of there only being one question which can only be seen through two layers of glass with only two people wearing glasses in the room. Many of these plot holes are just a list of question but I feel ultimately show how the film only works because the characters are written to have it work rather then having any sort of understandable logic to it.<br><br>What was the purpose of hiding \"Question 1.\" on the paper when they already said there was one question? Why make it so difficult to see? What would have happened if White stabbed Black in the eye with a pencil to kill him rather then man handling the guard to shoot him? Why would they destroy not only the lights but also the emergency lighting before checking the clock, one of the only clear objects in the room with two distinctive buttons? Were they meant to discover who Deaf was so they could tell him no? They were given no way to reply unless they knew as they were not allowed to communicate with the invigilator. Would Deaf be revealed at the end if they had all just waited and then expected to answer? How did everyone ignore deaf fiddling with the clock, if it did not at least draw attention should they at least be concerned about him messing up the test for them? What would have happened if anyone answered no to the question before the test started? Would it not count as the test had not started yet? Would they be removed for communication with the invigilator even while giving the correct answer?","user":"Weker","rank":[41,49]},{"title":"Exciting!","rating":8,"date":"13 March 2011","review":"What an exciting movie! I had absolutely no expectations of this film. I had never even heard of it when I came across it. Since I've seen a lot of movies lately that have most often disappointed me, I thought this would be another one. But I'm glad to say it wasn't. I have a hard time concentrating when watching movies, I often turn my attention to something else and because of that I get lost in the plot. Some movies though, manages to keep me focused on the movie the entire time and this was one of those movies. I love a good mystery, where the movie makes you really think. When you try to solve the mystery (this time, the question) yourself. So I stayed focused every minute and it never got boring. It's basically a riddle and if you think you're smart enough, watch it and see if you can come up with the right answer before the characters do! ;)<br><br>I would definitely recommend this film to other people. I'd give it a 7 or an 8.","user":"sofiepeterson","rank":[101,134]}]