[{"title":"Extremely well-made for a little bitty indie","rating":9,"date":"23 May 2011","review":"I have to agree with the other, few, reviewers here....why this film has barely a \"4\" rating is beyond me. It's about twice that good. Not only is it an interesting story, the characters are well-drawn and complex, the action is very well staged and performed, and even the special effects are creepy and effective.<br><br>Julian and John (Shane Dean and Slade Hall) are well-worn survivalists. Their idea of a kick-ass weekend is to walk for a few days into Arizona desert with nothing but a couple bottles of water. Julian seems to have taken these treks a bit more seriously over the years, and balks when John invites his younger loud-mouthed bud Paul (Cavin Gray Schneider) along for their latest adventure into the Arizona Coconino (?) forest (a new one on me, but a very cool location).<br><br>There's good tension between them as Julian and Paul constantly tear-down and one-up each other with John desperately trying to referee. Much like \"Deliverance,\" however, the trio encounter an unexpected turn of events that has them fighting for their lives for two-thirds of the film.<br><br>I'd never seen any of these actors before, and I was extremely impressed with all of them, particularly Shane Dean's Julian, who takes a role that could have easily been written off into crazy-ville and instead makes it compelling and oddly tragic.<br><br>What really blew me away were the dream and drug-infused (via peyote, of course) sequences. For a low-budget movie, these were extremely creepy and vividly rendered.<br><br>The ending is chilling, and not easy to shake. The only minor quibble I have with the film is many of the insider survivalist techniques. They're not really \"explained\" very well, and there's ample opportunity to do so, given that Paul's character is a newbie.<br><br>But this is a minor flaw in an otherwise trippy, tense experience.","user":"bob_meg","rank":[13,17]},{"title":"Worthwhile survivalist tale","rating":8,"date":"2 January 2012","review":"The tough, no-nonsense Julian (a terrific performance by Shane Dean) and his more laid-back friend John (a solid and likable portrayal by Slade Hall) are veteran campers who decide to embark on a no-frills expedition into the deep Arizona wilderness. Obnoxious troublemaker and blundering tenderfoot Paul (well played to the annoying hilt by Cavin Gray Schneider) tags along. However, things go horribly awry after John gets seriously wounded and the subsequent pressure causes Julian to degenerate into a ferocious primal state. Director Roze, who also co-wrote the taut and absorbing script with Candace Rose and Josh Staman, relates the involving story at a steady pace, presents a trio of complex and well-drawn main characters, and neatly covers all the essential roughing it in the woods bases (i.e., eating bugs, starting a fire with sticks and twigs, digging for water under the ground, and so on). Moreover, the considerable tension between Julian and Paul is ably handled; their highly charged confrontations pack a potent dramatic punch and the gripping and suspenseful cat and mouse chase between them towards the end likewise totally smokes. The sturdy and credible acting by the three excellent leads keeps the picture humming, with Dean a particular stand-out throughout. Tari Segal's sharp widescreen cinematography gives the movie a striking picturesque look. Jason Camiolo's lively and harmonic country-rock score hits the rousing spot. A cool little film.","user":"Woodyanders","rank":[9,11]},{"title":"One of the better indie films I've seen.","rating":8,"date":"25 March 2010","review":"I had the opportunity of catching an advanced screening of this and was pleasantly surprised. We've all been duped before by fancy trailers and poster art so I went into this one with some hesitation. It lived up to the hype.<br><br>From the first frame you know this isn't the same indie film that we've seen for the past ten years. The cinematography (it was shot on the same camera as Greenzone) is undeniably the best I've seen for under $100,000. It's not just the look either, it's the feel. The film is more of a throwback to when indie film was a mentality more than a genre.<br><br>I can't say I would recommend this to everyone. It was a slow burner, pacing comparable to Moon or Transsiberian, with well placed punches of action throughout. That said, I wasn't bored for a moment. The characters and story kept me invested without unnecessary blood or nudity.<br><br>Deadfall Trail will be a film you either love or hate. I can imagine the divide occurring within the last act when the film takes a surprising turn.<br><br>I give it 8/10 and will definitely be seeing this again at the Phoenix Film Festival in April.<br><br><ul><li>Chris Heck</li></ul>","user":"heck-chris","rank":[29,48]}]