[{"title":"Night Of The NOT Very Good","rating":4,"date":"10 July 2018","review":"Paying respect to a film by trying to remake it DOES NOT always pan out. This is the case with the 2009 version of Night of the Demons. Being a smaller than normal budget film and having to mediocre stars in Furlong and Elizabeth as leads did nothing for this movie. In my honest opinion NOT a very good film choice for Shannon Elizabeth. The first film in 1988 scores an almost 7 out of 10 with originality and this barely hits 5.<br><br>\nThe plot is generic as college age kids party at an abandoned house that has a haunting secret. Typical scenario as police raid and bust party and half dozen young adults get locked inside. They roam the house, find strange markings, skeletons in a secret room and demonic hell results. The dialogue is bland, full of \"f***s\" and \"s***s\", the acting is tragically phoned in and there is no scare tact at all.<br><br>\nIt is a simple supposed to be gore fest that fails at most levels. I would NOT recommend but if in need for a filler for the afternoon you can watch this flat remake of a 1988 cult classic. 4/10","user":"torstensonjohn","rank":[6,6]},{"title":"Lost the fun of the original.","rating":2,"date":"20 December 2010","review":"The only reason this is getting a 2 is because the creature effects were actually pretty good. The movie took too long to get to the gore. I was looking forward to the new plot points, change of location, reason for demons. But none of the saved this terrible movie. Edward Furlong looks like a bloated Jodie Foster and Shannon Elizabeth was sadly under used in the sexy department. It makes no sense that the survivors could figure out all of the details of the demons' plans in like 5 min and sit in a room until dawn to be protected. Barely a chase and the demons took over too quickly. The original and even the sequel are just good B horror movie fun, and this was just garbage.","user":"p0pnfresh2002","rank":[12,15]},{"title":"A Halloween night to forget.","rating":2,"date":"1 December 2010","review":"\"Uh okay. So, they're demons.\"<br><br>Lots of pretty, B-level actresses in slutty Halloween costumes being killed. Lots of dumb guys. A decent amount of gore. A paper-thin plot about some demons haunting a house in New Orleans on Halloween. Not very scary. Ample amounts of chessiness and campiness. Some okay monster designs. An amateurish script. Late-night TV quality production values. Some really terrible Halloween-themed rock music. A powerful urge on my part to fast-forward a lot. &nbsp; &nbsp;<br><br>That's basically my experience with Night of the Demons, in a nutshell. I can't compare this to the original movie, as I haven't seen it. But on its own merits, it's not funny or scary enough to really be worthwhile. But hey, boobs. Check the cast list and see if that makes this pretty mediocre flick worth watching for you.","user":"lewiskendell","rank":[28,40]}]