[{"title":"Welcome to the disappointment","rating":5,"date":"29 November 2010","review":"In a lot of ways, this is a puzzling movie. Every single element of it is so right, so how does it end up being so completely uninvolving that I ended up nearly falling asleep halfway through? The problem isn't the casting; Colin Farrell makes a hell of a gangster, all smouldering machismo stomping through the streets of London. And with a supporting cast that includes Eddie Marsan (sleazy), David Thewlis (sleazier) and Ben Chaplin (sleaziest, and very, very good), Farrell has some excellent support. Ray Winstone has never been scarier, but of all people it's Anna Friel who takes the acting honours as Farrell's sister, a woman who out-sleazes Marsan, Thewlis and Chaplin combined.<br><br>The problem isn't the locations, or how true to life they are. I lived in London for a long time, and I've rarely seen the city depicted better, all back streets and alleyways with nasty bastards lurking around every grubby corner. Considering the film's writer and director William Monahan is from Boston, I was worried that this might be the tourist's eye view of London, but that really isn't the case. The film positively drips with atmosphere, and the expletive-heavy dialogue rings true.<br><br>And yet it all sits there, lifeless on the screen, a collection of images and characters that seem only vaguely related to one another. It doesn't help that the main plot - will Farrell become a proper gangster, or will he end up with Keira Knightley's way-too-good-for-him actress - is hardly new. But that doesn't have to be a deal breaker, and there are plenty of interesting minor characters to pass the time.<br><br>The problem is really that the film feels rushed. Those minor characters aren't given nearly enough time - Marsan gets three scenes, none of them remotely important to the plot, and even Anna Friel doesn't get a lot to do. She's still better off than Stephen Graham and Sanjeev Bhaskar, great actors who are cast in completely pointless roles that could have been played by anyone. And so much of this movie feels tacked on, from the dozen or so subplots, to Winstone's pointless murder of the wrong man halfway through, to the stalker, obviously based on Mark David Chapman, who makes several ominous appearances and is then dismissed in a single line of dialogue.<br><br>If some subplots and characters are pointless, though, the ending made me feel that way about the whole damn film. Without giving too much away, it's a horrible, limp lettuce of an ending, with none of the resonance that the film-makers clearly thought it had achieved. That's the film in a nutshell - it wanted to be profound, but ended up as a giant 'so what?'","user":"mattbaxter72","rank":[200,261]},{"title":"Entertaining if you can look past some of the poor writing & clichés","rating":5,"date":"24 March 2011","review":"This film was brimming with potential, an adept cast, some stylish directing &amp; gritty yet beautiful set locations. However some of the story &amp; the actions taken by its characters were implausible, &amp; most of its ideas didn't develop effectively on screen. <br><br>Recently released gangster Colin Farrell meets a young female friend of reclusive celebrity actor Kiera Knightly &amp; offers him a job protecting her from intrusive paparazzi. He shows up for work &amp; What feels like a scene or two later they have (unconvincingly) fallen in love. parallel to this Farrels character is finding it hard to escape his past &amp; is soon roped into a feud with gangster boss Ray Winstone. He is now faced with the dilemma of either returning to his previous nature or beginning a life of new found love in LA.<br><br>All this is played out with some very stylish moments, such as the dialogue between Winstone &amp; Farrel in the restaurant or the artistic but realistic way in which the environment is captured. All the acting is well done &amp; Its accompanied by a great soundtrack, but a huge amount of the script feels rushed &amp; underdeveloped. As a whole it is entertaining if not taken to seriously but may not appeal to any serious film enthusiast.<br><br>I also felt that the ending of this film was brave but what I had seen prior to it lacked enough substance or attachment to make it stick &amp; I think I would have been more satisfied with a conventional ending.","user":"Jaime-b","rank":[52,69]},{"title":"I will hurt someone before they hurt me.","rating":6,"date":"26 March 2018","review":"London Boulevard is written and directed by William Monahan. It stars Colin Farrell, David Thewlis, Ray Winstone, Ben Chaplin, Keira Knightley and Anna Friel. Music is by Sergio Pizzorno and cinematography by Chris Menges.<br><br>After serving his stretch for GBH, Harry Mitchel (Farrell) returns to his manor and finds gangland boss Rob Gant (Winstone) wants him as one of his charges.<br><br>Written and directed by the man who co-wrote The Departed, it's not hard to guess what sort of tone London Boulevard is set at. Which for anyone who follows neo-noir will find plenty to like here, not least the stylish and tonally compliant photography of Menges.<br><br>However, falling under the neo-noir banner becomes a curse in a way because there are far greater films of this ilk to liken it too. Pic at least does have the courage to not cop out in resolutions, but again there is no surprise factor for the genre faithfuls.<br><br>The narrative often meanders, shoehorning in Knightley's (underused) harassed actress as a love interest in the process, and London accents are choppy. It also is criminal to have Stephen Graham and Eddie Marsan in your movie and barely give them screen time!<br><br>On the plus side of things, the violence and dialogue is often taut and tart respectively, backed by a scorching rocky hipster soundtrack. Farrell is good value as a tough guy, Winstone does what he does best, menacing of course, while Thewlis steals the film as a wired cool cat with menace surprisingly lurking in is heart.<br><br>As a whole it fails to hit all the right spots, but enough in here for neo-noir fans to feed on as an appetiser to a more fulfilling noir meal. 6/10","user":"hitchcockthelegend","rank":[6,6]}]