[{"title":"A Convoluted Mess, Not Sure What It Was Going For","rating":4,"date":"18 January 2011","review":"A man's brother apparently dies in combat in the Middle East. And yet, this same brother is somehow connected to Cain, a vampire clan leader. And there is a legend of a slayer... and some muscle cars...<br><br>A film so simple as this should not be so hard to describe, but it is. Someone wanted to write \"Blade\", but it was already written. They also wanted to write \"Fast and the Furious\", but that idea was taken. So, what did they do? They meshed them together in one film, threw in some other nonsense, and made a film. It took almost two years to get released, and I am not surprised.<br><br>First of all, I cannot stress how much the main character (Michael Matthias) wants to be Vin Diesel. He looks like the Wal-Mart brand of Vin Diesel, Wal-Diesel or something. And how DMX is thrown in as a guy who knows way too much about vampires and somehow knows a slayer when he sees one... not sure why.<br><br>Vinnie Jones plays Cain, and it is nice to see him with (presumably fake) hair. But this is not a great role for him and makes his acting look terrible. Michael Madsen is Father Roy, and while I always enjoy seeing Madsen, he does too many genre films with people who cannot bring out his best. Aside from Tarantino's films, what is the last great thing he did? Katherine von Drachenberg (aka Kat Von D) also appears.<br><br>The plot holes, time line, and more just do not add up on this to a decent movie. The acting is weak, the directing is decent, though it is clear the emphasis was on the action and not the acting. The director's background is as a stunt man, and I can easily say the stunts here are just fine... the film is, however, a mess... and I do not know who to blame first.","user":"gavin6942","rank":[21,21]},{"title":"Symbolic of everything wrong with action/horror hybrids today","rating":1,"date":"6 March 2011","review":"When you look at the cast for \"The Bleeding\", aside from star Michael Matthias, this looks like a dream cast for people that watch direct to DVD garbage. Vinnie Jones! Rapper DMX! Michael Madsen! Armand Assante! Tony Schiena (here billed as \"Johnny the Perv\")! UFC host Rachael Leah! Reality star Kat Von D! It looks too good to be true, like the ultimate DVD movie cast. Well, it was actually released exclusively in New York as far as theatrical releases are concerned, so it's almost a straight to DVD movie. It's also bad-and I mean painfully so.<br><br>Shawn Black (Matthias, who also serves as a producer-this is essentially a vanity piece for the him) has returned from Afghanistan, with his parents murdered, and his brother dead in battle. Well, it turns out his brother is now a vampire named Cain (Jones), and that he is \"the slayer\", or a man who must vanquish such evil from the world. Aided by a rather gun happy, unorthodox priest (Madsen), Black must go to an abandoned factory turned nightclub, where Cain and his vampire brethren are hiding.<br><br>A pastiche picture mixing \"Blade\", \"From Dusk 'till Dawn\", \"The Fast and the Furious\", \"Boondock Saints\" as well as other obnoxious Tarantino knock-offs and at one point, a pinch of \"Hostel\", \"The Bleeding\" is symbolic of everything wrong with action/horror hybrids today. The editing is all over the place, the action scenes aren't all that exciting, the score is a strictly pro-tools affair, the direction is lacking, and you really don't care about anything that happens. In a lot of ways, this is also reminiscent of a lot of bad direct to DVD action movies, but this one takes it to different levels. The whole thing is lazy, and clearly made to be a breakout vehicle for poor man's Vin Diesel star Matthias. I mean sure, the gore and make-up effects are good, and there's boobs, but it isn't anything you haven't seen already.<br><br>To make things worse, nobody here really seems to give a damn. Several of the stars-Assante, DMX and Kat Von D-are merely given tiny roles and cameo appearances, with DMX only being there to provide crucial plot information and get killed off, Von D to get some blood on her after biting a girl's neck, and Assante being a poor man's version of an old western movie standard (he even calls the movie \"a futuristic western\" in an interview that serves as a special feature.) <br><br>The rest of the cast doesn't even seem to be trying for the most part. DMX is clearly just there for the paycheck, while even Matthias and the narration he provides seems to be screaming \"get me out of here.\" Only Madsen and Jones seem to be trying, and even they can't do anything worth a damn due to the script-Jones in particular is given a goofy looking wig and bad American accent. The movie can't even work on an unintentional comedy level. One liners meant to be cleaver are just awkward, and even the site of Vinnie Jones in a bad 70's exploitation hair style can't register.<br><br>\"The Bleeding\" is just bad, and even not on a camp level. It's just painfully bad, and the kind of thing that usually get's dumped to DVD and forgotten and is not given a weekend long theatrical run. Avoid like a vampire shown a crucifix.","user":"lovecraft231","rank":[19,21]},{"title":"It's best to avoid this turkey....","rating":1,"date":"13 September 2010","review":"Another one of these vampire wretchedly unwatchable effort. Poor acting, cheap effects, script prob written on a hankie. The dialog in this movie is just plain dumb and too juvenile. The story was such a mess that I hardly cared about what was going on. This was one of the worst movies I ever attempted to watch. Until now , i knew that there are Movies , low budget movies and B movies. Now i suppose we have to welcome \" C movies \". Believe me, you have a lot more fun looking out your window, if you do not have a window, staring at your wall will give you the same excitement. When the history of film making is written, there will have to be a whole book written about the time idiots got their hands on video cameras and decided they could make a movie. If you have not seen this movie yet, then don't. it's best to avoid this turkey you are now warned.","user":"OpinionGuy","rank":[37,45]}]