[{"title":"Horrible audio problems","rating":4,"date":"25 November 2009","review":"Blood Moon Rising's a fun enough flick, if not packed with a few too many elements. Zombies are only part of the horror-creatures here: we also have werewolves, vampires, Satan, Satan's minions.. even skeleton-alien-zombies. It gets a bit confusing.<br><br>As does the plot. From what I can gather, Satan's great-great-great-great granddaughter has to save Earth from Satan's daughter, Lucy. Lucy wants to destroy Earth (for some reason), and.. might need a book bound in human skin to do so? I'm not sure, but only a virgin - comic-book nerd Darrell - can save the day. Oddly enough, only a virgin can help Lucy obtain the book as well. Along the way, there's zombies and biker gangs and vampires and werewolves (though it's difficult to distinguish the last two), all in a glorious cluster**** of a movie.<br><br>It doesn't help that the audio is extremely out of whack. I was continually turning the volume waaay up to hear some of the dialogue, then, seconds later, waaay back down when the loud music track kicked back in. Very annoying. Also, it's shot in a grindhouse-style, with artificial dirt and lines on the film. That's all right, I guess, since the movie takes place (mostly) in 1969, but they could've gone farther to really get a grindhouse feel. There's a few - blessedly few - shots of pisspoor CGI, which of course, runs counter to making it feel like a grindhouse flick.<br><br>The movie is definitely a character-driven piece and there's nothing if not.. rememberable characters. The geek inside me could relate to the on screen-geek saying, in reference to a zombie apocalypse, \"I've been waiting my whole life for this,\" as he all-too-seriously mows down zombies. Oh, and speaking of characters, Ron Jeremy has a very small role, maybe 30 seconds of screen time. Not that his name gave the movie added cred or something though.<br><br>Even with all its faults, it's simply a good time. It's almost a spoof of zombie-Satan-vampire-werewolf movies.","user":"paultagonist","rank":[12,20]},{"title":"Fun if you know what you're getting into","rating":7,"date":"8 December 2009","review":"A lot of people who watched this will undoubtedly not get the joke. And when I say \"joke\", I'm referring to the entire movie. But I don't mean that in a bad way. The whole movie is a put-on...a send up of the old days of grindhouse cinema. It just takes more of a mockery angle than a \"homage\" (which I'm now convinced is French for \"intellectual property theft\") angle that Tarantino and Rodriguez took in their big budget flicks. Yes, the audio is awful at some points. It's supposed to be. The movie is supposed to sound like the entire thing was dubbed in post production (hell, it probably was). And everything is meant to look cheesy and low budget. As for the plot, well, that's best left out. In typical grindhouse fashion there's about 10 different things going on at once with very few being related. There's zombies, demons, Satan, vampires (I think), werewolves (I think), aliens, and Ron Jeremy.<br><br>If you think about it, it's kind of a genius move. Don't have enough money to make that epic film you always wanted to make? No problem. Just make a movie that's supposed to look bad. Problem solved. All said I done I kind of enjoyed it in a hilariously-bad-but-on-purpose kind of way. That being said, I would definitely recommend a six pack of your favorite adult beverage.","user":"Heislegend","rank":[15,28]},{"title":"Grindhouse reborn!","rating":10,"date":"7 January 2010","review":"Blood Moon Rising is an amazing independent film set somewhere in California. The year is 1969. An ancient curse has spilled over into the world of the ordinary living, with werewolves, vampires, and zombies shedding bucketloads of blood. In short, Tristan (our vampire) is not a bad guy despite his undead status, and he was in love with a girl named Lucy. Tristan's former wife, the daughter of the Devil, doesn't take the news of Tristan's love affair with Lucy very well, and she curses Lucy to become a ravenous werewolf roaming the Earth for all eternity...that is, unless a silver bullet pierces her heart and kills her. Lucy's death brings the daughter of the Devil back from Hell. She returns not just for revenge, but to find a talisman, which, together with a book bound in human flesh and inked in blood (yes, a bit like Evil Dead in that regard, I know) that, if finished by the hand of an unwilling virgin, will unleash Hell on Earth. So, it is up to a hippie chick, Sadie Hawkins, and a comic book-reading soda Jerk, Darrel Lee, to save the world, but not without a little help from a group of indie film rejects shooting a zombie flick in a town called Desolation. To see who wins, and how, you will simply have to get your hands on a copy. Besides, I don't want to ruin it for those of you who are stoked about this film.<br><br>Blood Moon Rising is shot in the old Grindhouse horror style. It's not just horror, though. All in all, it is a horror comedy and action adventure, with a feel not too dissimilar to Rodriguez's Planet Terror. The actors do a phenomenal job. The effects, though not top notch, are far from cheesy. And the ones that are cheesy are meant to be that way. In this movie everything is deliberate, even when the dialog stops and the actors mouths are still moving, or when you can't hear what is being said (which only happens in two or three brief parts), or when the screen flares out into that burning reel effect and catapults the watcher to another scene entirely.<br><br>If I had to rate Blood Moon Rising on any sort of horror scale, I would give it ten out of ten skulls. And I don't do that with too many films. In fact, I almost never do that. But this one definitely deserves its due credit as a modern Grindhouse masterpiece.","user":"theurbanartistgroup","rank":[14,31]}]