[{"title":"A very enjoyable Thriller","rating":9,"date":"25 January 2016","review":"I don't agree with the bad reviews here, I liked this movie very much. The story keeps your attention focused up to the very end. I loved the filming, the editing and the music. If you like a good old fashioned thriller with surprising twists and an end that makes you think about matters of life and death, this is a film to watch. It has just enough body count, car chase and action to be all throughout interesting, without overdoing violence.<br><br>Anthony Hopkins' performance it stunning. I always enjoy watching him and here he delivers as well as ever. He can tell the story of his character only with the expression of his eyes and the director uses them well. Colin Farrell does a good job, the other characters are OK but not outstanding.","user":"kaprijoias","rank":[124,154]},{"title":"I usually trust on IMDb reviews","rating":9,"date":"19 January 2016","review":"Loved the movie, don't go for the 1 star main review...<br><br>I found strange that a movie with this 2 actors would get a so low or medium even score, and decided to watch it (usualy I don't see anything below 6.5) <br><br>The movie is very good and has a strong message behind it, its not that well hidden, you can identify yourself or someone with the pain that goes through the movie. Who thinks this is a horror movie, or a cliché is going for the wrong film.<br><br>Its a story of the \"devil's advocate\", you will end up having conflicted feelings, hard ones, with some extremes.<br><br>Anyways, without spoiling it, unless your expecting a horror or action blockbuster you should watch this movie. <br><br>Hopkins delivers and Farrel as well, now the woman main actress doesn't reach this 2 great actors, its the only flaw (Sometimes big one) I find in this film.<br><br>Great movie","user":"silvaeduardo","rank":[146,193]},{"title":"Loved it - ignore the naysayers who think too much","rating":10,"date":"24 January 2016","review":"I didn't expect much from this film, owing to the reviews on here, but I really enjoyed it. Mind you, what's not to love when Anthony Hopkins is involved? Ostensibly just another serial killer film, but this is a serial killer with a difference and it actually raises a modern dilemma. The action is good, Anthony Hopkins is brilliant, as always, and there is a twist at the end. One reviewer said that the guy who directed/produced this film was churning out stuff like this in the 80s and gave it a low rating, but I am just an ordinary mortal who doesn't have a clue who directed/produced it and just enjoys a good story, and I thought it was a cracking film.","user":"carolhollett64","rank":[100,135]}]