[{"title":"We're reminded of \"Office Space\" and can truly never go on from there","rating":5,"date":"22 June 2012","review":"The direct to video effort Demoted brings one fantastic corporate office satire to mind and immediately suffers by comparison. That satire, of course, is Mike Judge's cult hit Office Space, a funny, poignant, and brutally honest look at inside the cubicle, observing three men fed up with their boss, their job, and every sickening event that happens day in and day out.<br><br>There are times when clearly Demoted wants to be that film. It wants to pack in relatable qualities found in the workplace, it wants to create characters that lie around your office, and it wants to make people you've seen before. The problem is that it is so textbook and underachieving in almost every field that it becomes less a relatable film and more of an envious portrayal of the life you wish was as convenient as your own.<br><br>Mike and Rodney (Sean Astin and Michael Vartan) are the office pranksters at their company, where they spend some time selling tires over the phone, but more time harassing fellow employees, mainly Ken Castro (David Cross). They have a notable relationship with the current boss, but after he dies in a night of boozing, strippers, and camaraderie, the head position is given foolishly to Castro (a name that will prove wholly fitting). He is dictative, boisterous, and sickeningly belligerent, and demotes Mike and Rodney to the secretary position - a position they sneered and mocked prior to this demotion.<br><br>Rodney is getting married and, after being put on the spotlight by her snotty father, tells her that he is getting a promotion and is a big shot at the office. It is truly inevitable this excuse will backfire, causing his marriage to subsequently go under, yet be miraculously saved in a foolish and contrived scene. It is too inevitable that Mike and Rodney will not have very much fun walking in someone else's shoes. I believe it was Atticus Finch from Harper Lee's To Kill a Mockingbird that you can never totally understand someone until you climb in their shoes and walk around for a while. Their case doesn't seem so much like that as it seems an urgent alliance. They, then, witness all the disheartening budget cuts Castro is making and plot to stop him.<br><br>I enjoyed the first act of Demoted, stared blankly, chuckling occasionally during the second, and finally, snickered and yawned during the third. There are times when the film genuinely wants to incorporate intelligent satire and wit to its material, but it is stuck in a rut of clichés waste-deep. Astin is a fine choice for Mike, playing a simple and likable man, if a caricature, and Vartan does his best with the role of the everyman, desperately careening towards the idea of making his marriage work. But who is brought to a solid light here is David Cross's Castro, but even he feels cheated on the levels of destruction he could so helpfully bring to a comedy of errors.<br><br>And that's where Demoted flounders. Too many clichés, too many ridiculous setups, too many cheap-shots taken at decent people, too many instances that beg us to laugh, and too much suspension of disbelief that we haven't seen Office Space. Likable cast, efficiently determined script, but an execution that has direct-to-DVD rehash written all over it.<br><br>Starring: Sean Astin, Michael Vartan, and David Cross. Directed by: J.B. Rogers.","user":"StevePulaski","rank":[7,8]},{"title":"A funny over-the-top \"Office Space\" type movie that is worth watching. Predictable and not original but still funny. I say B.","rating":6,"date":"3 May 2012","review":"\"From now until the end of time today and everyday shall be know as secretaries day!\" Mike (Astin) and Rodney (Vartan) are the best salesmen and Treadstone tire, and they know it. Being rude to everyone has become standard fare until their boss dies. When Ken Castro (Cross), who has been the brunt of their jokes, takes over he immediately demotes them to secretaries. The two realize how they have been and begin to change their ways. I will start by saying that I liked this movie and laughed quite a bit but this is also nothing amazing at all. Very predictable and pretty much a no substance movie but it is worth watching and I liked it. Think \"Office Space\" but a step above on the absurd scale. There really is nothing to say about this as there is really nothing to it but I again liked it and I think it is worth checking out. Overall, if you liked \"Office Space\" you will like this. This are worse ways to spend an hour and a half. I give it a B.","user":"cosmo_tiger","rank":[14,22]},{"title":"Some tires just doesn't spring a leak...","rating":5,"date":"16 June 2012","review":"Well, \"Demoted\" wasn't bad, but it wasn't a whole lot of laughs either. That being said, then it must be said that the movie was actually good, nonetheless, as it had a very nice and warming story to tell.<br><br>\"Demoted\" is about top sales guys Mike (played by Sean Astin) and Rodney (played by Michael Vartan) working at Treadline Tires, and they are living the sweet, easy life, that is up until their boss drops dead from a heart attack, and the office 'joke' Ken Castro (played by David Cross) takes over the company. The two head ponchos find themselves demoted to secretaries, and have to deal with being lower on the corporate ranking of Treadline Tires.<br><br>Initially, I had expected more laughs from this movie, but still, I was thoroughly entertained, as the storyline was great and well executed. And the movie had some really nicely drawn out characters with lots of personality and variety. It was sort of a movie that goes to prove that the 'underdog' can achieve great things as well, and you don't have to be at the very top of the corporate line in order to be successful or in order to make a difference.<br><br>\"Demoted\" had some nice performances by the various actors and actresses. I personally enjoyed seeing David Cross in the role of Ken Castro, he was just great and really brought some great comedy to the movie.<br><br>As for a comedy of this caliber, then \"Demoted\" really doesn't bring anything new to the genre, nor does it play out anything that haven't been seen before. So it is basically straight out of the drawer material here. But it does work out well enough, especially if you enjoy these types of comedies.","user":"paul_haakonsen","rank":[8,12]}]