[{"title":"Cinema Of The Absurd","rating":7,"date":"22 January 2018","review":"Smart and funny, absurd and a bit self-conscious but as soon as I had time to think, I thought. The cast is fun but reeks of pre-sales needs. The names in the cast propels you to expectation that are going to let you down no matter how you put it. George Clooney is great fun but try, just try to imagine a great actor you never heard of in that part. I couldn't separate the character from the actor not for a second. So I saw Clooney being funny and that does something to the film that keeps its real intentions at arms length because the star-actor gets in the way. I have a feeling however that time will be kind to this film. Audiences will be able to see it again in years to come with more objectivity and appreciate it much more.","user":"ggallegosgroupuk","rank":[28,31]},{"title":"The Men Who Stare at Goats (so as to become Jedi Warriors and create world peace while possibly under the influence of LSD) Any questions?","rating":8,"date":"5 January 2010","review":"Even from the title, a person can guess that this movie will be different. Men staring at goats doesn't seem like the most interesting plot line; maybe then does the movie aim to be original rather than just having commercial appeal? The answer is a resounding yes. Men Who Stare at Goats is absurd, odd, hilarious, amusing, definitely original, possibly good and not at all what you would expect.<br><br>The plot, well the plot is complicated and involves a present-time storyline that is broken up between flashbacks. In short, George Clooney and Ewan McGregor are on one hell of a road trip in Iraq while Clooney tells McGregor about his time in a secret army training program, bent on creating Jedi warriors. So it's your typical movie. What it really is is one of those smart-and-dumb-at-the-same-time -comedies-that-involves- George-Clooney; films such as Burn After Reading and The Informant (which he produced) also fall into this category. Whether you like this movie or not, will depend on how accepting you are of the ridiculous. The movie deals with developing Jedi warriors in a comedically serious way that will be just too much for some people. The sixties counter culture is popular target for jokes in films, but an army program run by a long-haired hippy, working on world peace by dancing, that's pushing it. My personal feeling for the movie was overall positive; it was original and some segments were genuinely funny. Also on the plus side was the acting. The two leads were good, though McGregor had some accent slips, but the supporting cast was also impressive. Kevin Spacey, Jeff Bridges and Stephen Lang all embraced the absurdity of their roles and played them with relish. <br><br>As for the comedy, the movie is funny. Some parts drag on a little long with no laughs but patience is always rewarded. Jokes in this movie are both smart and dumb, mixing slapstick with intellectual comedy. Clooney running over someone he's trying to rescue falls in the slapstick category; a guy explaining why the US has to finance the Jedi training because the USSR thinks there already financing it is smart funny. Kevin Spacey's \"psychic voice\" is just plain funny. <br><br>To finish off, I can only think to repeat that the movie is absurd and just plain odd, but then again so is real life. If the US can torture people with Barney why can't they train people with Star Wars?","user":"sabretoothmovies","rank":[57,71]},{"title":"An Instant Classic","rating":10,"date":"13 March 2010","review":"After reading some of the reviews here, I came to this film expecting to be disappointed. How wrong I was! It turned out to be one of the funniest, most powerful films that I have seen in years. It reminded me of some of the great movies of the sixties and seventies. Times have changed and it seems that people no longer get the kind of satire that grabbed us back then. I was constantly reminded of films like \"Catch 22,\"\" M.A.S.H.\" \"One Flew Over The Cuckoo's Nest,\" and \"Steelyard Blues.\" In those days, we got it. Now, people see that \"Hippy Philosophy\" thing as a cliché. They cannot see the relevance to today's world, which is a pity. \"The Men Who Stare At Goats' is a genre film, in the tradition of those great comic satires that challenged the status quo so effectively, 40 years back. I truly believe its reputation will grow, over the years.","user":"bilko-1","rank":[111,147]}]