[{"title":"Harmless Fun!!","rating":7,"date":"4 February 2010","review":"If you're looking for a decent, fun little movie you can watch with your family in a relatively painless fashion then you've come to the right place.<br><br>For some reason many action stars have supplemented their income by appearing in movies with kids. Maybe they are trying to widen their appeal from the hardcore action audience to the family friendly scene. Maybe they're getting too old to keep up with the pace of a full-on action movie. Maybe they have to pay alimony to 4 or 5 ex-wives. I don't know why they do it, but it's almost becoming mandatory for these guys to take on a kid or three as a side-kick and attempt to blend action and family fare.<br><br>And these attempts almost always suck.<br><br>Does anyone honestly want to see Vin Diesel try to relate to kids? Or Chuck Norris, the Rock or God help us, Burt Reynolds relate to kids? No way. Don't even start with me about Hulk Hogan. During Santa with Muscles I was terrified that he might not see a few of the kids and accidentally step on them. Suffice to say, these movies might help a star's sagging income, but they're usually a mediocre compromise between two often disparate genres at best.<br><br>This one is a little better. It's still \"action-light\" but I think it works because of the star, Jackie Chan. His character seems like a genuinely nice guy who wants to get along with the mandatory bratty kids. Vin, Hulk, Chuck, Burt and the rest, these guys play characters that you know would much rather be killing, crushing or sleeping with the enemy. Chan doesn't have that problem because of the types of characters he often plays. His lighter presence matches up with the tone of the movie and makes it seem ....hmm...not as weird and patently unbelievable and maybe even patronizing as other movies of this kind.<br><br>Basically Jackie plays Bob Ho, a Chinese secret agent on loan to the CIA. He retires so he can marry Gillian, a divorced single mom who is looking for someone reliable. Her kids don't really cotton to Bob though, so she decides to put her relationship with Bob on hold until they're OK with her marrying Bob. Bob is saddened but resolves to win the kids and his girl friend over.<br><br>Then, luckily, hi jinx ensue. One of Gillian's kids downloads some top secret stuff off Bob's computer and before you can say Boris and Natasha some evil Russians are in hot pursuit. After a variety of PG style mishaps Bob captures the bad guys and wins the day, the girl friend and the family. And like I said, it works because Jackie Chan doesn't seem shoe-horned into the role.<br><br>The action is lighter than most Chan movies but it is inventive and fun. The kids act a little more like real kids than Hollywood Central Casting pods. The youngest kid in particular seems like real 4 year old, goofy and light hearted. When she delivered the line\" I don't wanna be a princess, I wanna be a cyboooorg!\" I cracked up. I actually laughed more than a few times, which surprised me. As long as you realize going in that this is just very light family entertainment I think you'll be pleased.","user":"Mike_Noga","rank":[63,73]},{"title":"Not a Jackie Chan fan but enjoyed it","rating":17,"date":"17 January 2010","review":"Before taking the kids to see this, I read through some quick reviews online (such as RogerEbert.com, etc.), and groaned thinking about the 90 minutes or so I'd have to sit watching this...not to mention the annoying ads stuffed down your throat before the trailers even start.<br><br>You know, I'm not going to spend time trying to justify why I liked it, laughed at the corny scenes and dialog, slapstick, etc. - but the bottom line is I/we enjoyed it - despite it being a Chan film which usually I'll pass on. How refreshing not to get any propaganda thrown in your face, political innuendos/viewpoints - whatever, which unfortunately you have to bear in even many kids &amp; 'family' films being pumped out these days ... just a basic family comedy which accomplishes its purpose - to simply entertain and nothing else. What's wrong with that, Mr. Ebert? I think you need to stay away from kids' films. Anyone? <br><br>So if you decide to see it, make your own judgment. The negative reviews I read before seeing it prepared me to expect the worst....which in turn actually helped it to be a quite a pleasant surprise. Go figure. So far I find it amusing how some of the reviewers on here spent so much time writing in detail how awful the film is, spending the time, space, and effort into dissecting &amp; critiquing it as though it were the latest Coppola or Scorsese project. Who are they writing to? Those expecting a modern cinematic classic (via Jackie Chan) bringing them to standing applause ... or to parents like myself taking their kids out to have a little fun? Right! LOL.","user":"ZR RIFLE","rank":[68,92]},{"title":"Chan Plays a Cool Funny Spy in a Done-to-Death Story","rating":18,"date":"18 May 2010","review":"OK, where story is concerned, there's nothing new here. Chan plays a spy on the verge of retirement because he wants to settle down with his girlfriend Gillian (Amber Valetta) and her annoying kids. Now the kids hate Chan and Gillian has to leave for a couple of days in order to spend some time with her ailing father. So who offers to look after the kids? It's not hard to see how clichéd the story is but it is Jackie Chan with his creative stunts who makes this a fun watch. The actor's flair for comedy has become common knowledge and he is as energetic as ever. Moreover, his pairing with the beautiful Valetta is refreshing. Valetta doesn't get much to do other than play the usual girlfriend/divorcée/mom of three but she holds her own. The rest of the cast is forgettable. The child actors are initially very annoying. They sort of grow on you as the film proceeds. Overall, the film is nothing out of the ordinary. It doesn't even compare to a majority Chan's superior works but at best it's an amusing one-time watch.","user":"Chrysanthepop","rank":[14,16]}]