[{"title":"Excellent Adaptation - Beautiful to Look At","rating":9,"date":"19 September 2011","review":"Wow this is one of those movies that I am completely baffled about the low ranking on here. I agree with some of the critiques that the sound mixing could have been better but overall the film was gorgeous, overall well acted and very understandable for such a difficult play.<br><br>Someone mentioned poor special effects...I thought they were wonderful. Clearly the big money goes to plenty of trite blockbusters leaving little for pieces of art and beauty such as this. But what they lacked in money they made up for in creativity....I absolutely loved the rendition of the spirit Ariel. There was plenty of gorgeous scenery both real and mixed with CGI.<br><br>Julie Taymor never disappoints me and this is no exception!","user":"shiva777-9-153849","rank":[56,69]},{"title":"The Essence of The Tempest","rating":19,"date":"19 September 2011","review":"William Shakespeare's THE TEMPEST is probably his last play, written in 1610-11, and as such it has some of the more eloquent passages of soliloquies of any of his works. In the original version the story is set on a remote island, 'where Prospero, the exiled Duke of Milan, plots to restore his daughter Miranda to her rightful place, using illusion and skillful manipulation. The eponymous tempest brings to the island Prospero's usurping brother Antonio and the complicit Alonso, King of Naples. There, his machinations bring about the revelation of Antonio's low nature, the redemption of Alonso, and the marriage of Miranda to Alonso's son, Ferdinand.' Enter Julie Taymor and the imaginative play becomes even more so with her deft re-writing and direction and use of visual effects. In Taymor's versions 'the main character is now a woman named Prospera. Going back to the 16th or 17th century, women practicing the magical arts of alchemy were often convicted of witchcraft. In Taymor's version, Prospera is usurped by her brother and sent off with her four-year daughter on a ship. She ends up on an island; it's a tabula rasa: no society, so the mother figure becomes a father figure to Miranda. This leads to the power struggle and balance between Caliban and Prospera; a struggle not about brawn, but about intellect.' <br><br>Taymor and Shakespeare together make the important character of Ariel, Prospera's obedient sprite, a thing of magic: Ben Wishaw darts and floats and flies about apparently in the buff in a most ingenious fashion, delivering his lines in perfect Shakespearean cadence (his 'Full fathom five thy father lies... ' is exquisite). The transformation of Prospero to Prospera is magical with Helen Mirren once again proving that she is an incomparably fine actress (one great moment is her delivery of the lines 'Our revels now are ended. These our actors, As I foretold you, were all spirits and are melted into air, into thin air: And, like the baseless fabric of this vision, The cloud-capp'd towers, the gorgeous palaces, The solemn temples, the great globe itself, Ye all which it inherit, shall dissolve And, like this insubstantial pageant faded, Leave not a rack behind. We are such stuff As dreams are made on, and our little life Is rounded with a sleep.') <br><br>THE TEMPEST is an odd assortment of magic, treachery, young love, silly comedy, and odd goings on, but filled with a cast such as Taymor has selected it jumps alive with passion and glee. Caliban is Djimon Hounsou, Miranda is Felicity Jones, The King of Naples is David Strathairn and his son Ferdinand is young Reeve Carney, Prospera's brother Antonio is Chris Cooper and his sidekick Sebastian is Alan Cumming, and the two actors assigned to the buffoon roles are Albert Molina and Russell brand. Gonzalo is Tim Conti. This tightened Tempest works well though one wonders how much of the opening scenes' shipwreck (due to Prospera's calling upon the tempest) adds to the overall story. Yet in Taymor's vision it all comes together beautifully. The sung portions of the play and the musical sore in general are from the intelligent pen of Elliot Goldenthal. Recommended! <br><br>Grady Harp","user":"gradyharp","rank":[51,65]},{"title":"Dame Helen reigns supreme","rating":8,"date":"6 March 2011","review":"In casting Helen Mirren as Prospera, director Julie Taymor adds an interesting spin to this Shakespeare adaptation.<br><br>Also CGI effects help make more sense of the story.<br><br>On the downside, film versions of the bard's plays rarely work perfectly (with the honourable exception of Baz Luhrmann's Romeo + Juliet) and unless you know the play already, the action here is pretty hard to follow. Also, it's a bit strange seeing comic genius Alan Cumming in a straight role.<br><br>Ultimately though, the main joy of the movie is Dame Helen. She does bitterness superbly. I loved the scene when Miranda first meets Ferdinand - Mirren's ironic commentary added a whole new dimension to the play for me.<br><br>I also loved Tony Conti as the aged senator Gonzalo. His performance is so masterful it puts his character at the forefront of the story for once - no bad thing.<br><br>Overall I think Shakespeare fans will really enjoy this film. Other people may be left a little bored and bewildered.","user":"tcbently","rank":[39,51]}]