[{"title":"Miserably bad.","rating":1,"date":"27 October 2010","review":"\"The body of Ransom Pride belongs to me.\"<br><br>It didn't take me very long to realize that I wasn't going to enjoy The Last Rites of Ransom Pride. Ten minutes, at most. The whole vibe of the movie just turns me off. I like Lizzy Caplan, but putting one appealing actress in the middle of a disaster doesn't do much good. I disliked the way it was filmed, the dialogue, and the absurd, meandering, nonsensical narrative that served as the story.<br><br>Basically, Ransom Pride (the man) is a recently dead acquaintance of Juliette Flower (Caplan), and she made a promise to retrieve his body and bury it near his mother. In order to get his body, she has to deliver Ransom's still living younger brother to some seedy folks. Lots of people hate her, lots of people want her dead, and lots of people try to stop her. That's the story. There are lots of unlikeable characters that were utterly ridiculous in their seriousness, the frequent action scenes are terrible, and the entire movie makes little sense. Sounds like a real winner, right?<br><br>It's rare for me to truly hate a movie, but The Last Rites of Ransom Pride reached that dubious achievement. This is probably in the bottom two or three movies that I've seen this entire year. The only good news is that I (hopefully) don't have to ever watch it again.","user":"lewiskendell","rank":[30,39]},{"title":"Last Rites of director's film career hopefully.","rating":1,"date":"10 October 2010","review":"It cost me a dollar to rent this and I have to say it's the worst use I've ever put a dollar to. To think I could have put that as a down payment on a pack of gum or just turned Washington's head into a mushroom. But no, I had to rent the interminable Last Rites of Ransom Pride.<br><br>It begins with a voice-over telling us of Juliette's(Lizzy Kaplan)sad childhood and how she had to kill an evil general in his sleep. It's not a terribly long opening narration, and then we're hit with the oddly fonted subtitles telling us it's 11 years later, 11 years after she told us the voice-over or the actual events, we can only guess. By the way, the subtitles are very hard to read, which is unfortunate because they're used quite often.<br><br>Other than the little bit of back story we get, the characters aren't particularly deep. Lizzy Kaplan pretty much keeps one expression on her face for the entire flick and Dwight Yokam calls her whore a lot, but that might not have been in the script. Peter Dinklage does as well as he can with the material, but despite this contribution, his character is simply named \"Dwarf\" in the credits. Don't seem right.<br><br>A lot of what follows is intermittently plastered with instant replays of previous scenes and \"artsy\" shaky cam shots of animal skulls and birds that jerk like they're in a Tool video. These don't really add anything to the film and only serve to prolong the misery of watching it. It's not a terribly complicated story either, but Tiller sure takes the scenic route getting us there. It's like he's slowly winding a broken jack in the box. You want the weasel to pop, but you know it never will.<br><br>If you like westerns I wouldn't suggest seeing this, and if you don't like westerns, I still wouldn't.","user":"DevastationBob-3","rank":[19,28]},{"title":"A true Gem","rating":8,"date":"28 October 2010","review":"The people who gave this a bad review clearly do not understand the B rate movie genre. I stumbled upon this little gem by accident and really liked from the start. By 10 minutes in I was on the edge of my seat wondering what the director was going to do next. I'm not going to spoil this by providing plot clues and tidbits about exciting scenes. I'm just going to give my impression and let you decide for yourselves. This movie is well casted. The script isn't awful. The cinematography is gripping. The story line is fitting of the genre. The acting is OK. Suspend disbelief for a few moments, just remember that it's B Rate, and enjoy it for what it is.","user":"xultunwaye-883-921733","rank":[23,41]}]