[{"title":"A dark and brooding affair, Dying of the Light plays out exactly as the title suggests.","rating":4,"date":"3 May 2015","review":"This is a dark movie. Not only for its content; it's literally dim for most of the movie. I guess it's meant to provide an atmosphere that parallels what is happening in Evan Lake's (Nicolas Cage) mind, and the murky atmosphere is one of the few things Dying of the Light has going for it. The plot is this: Lake works for the C.I.A. and is experiencing some mental twitches in his old age like hallucinations, lapses in memory, and the works, which obviously isn't ideal for a C.I.A. operative, so he has to go rogue. He has flashbacks to a mission he was part of that scarred his psyche - he was tortured for information, and flashbacks to this scene happen over the course of the movie, and Evan won't stop until he finds and kills his former captor. Nicolas Cage carries this movie on his shoulders because his character is really the only semi-developed part about it. Granted, one interesting character is not nearly enough to save this gloomy mess of a film.<br><br>I can't blame writer/director Paul Schrader because he and the producers had some sort of fallout and the producers ended up changing a bunch of stuff in post-production, so I blame the producers. The editing is horrendous, the action sequences are intermittent and awkward, no character other than Cage's is interesting in the least, some scenes are too melodramatic, others are just dull. I mean you can tell this movie has more layers than it lets on, but it never goes deep beneath the surface like you want it to. It plays it relatively safe and straightforward despite having an interesting premise and an empathetic protagonist.<br><br>Now, Nicolas Cage can definitely pull off the salt-and-pepper look. Especially when he goes full on Arab (or whatever it was) with a badass goatee and tinted glasses. He really encapsulates the part of Evan, and it's by far the deepest and most flawed character Cage has portrayed in a while. The problem is that we don't see enough of him. We don't have a chance to get attached to this character on more than a surface level because the pacing of this movie is so terrible. On a scene-by-scene basis, it's extremely hard to keep track of what's going on, of what's important and what isn't. It just becomes a headache after a while and you just want to see Cage kick some ass, and he kind of does, for like a minute anyway. <br><br>The climax is incredibly underwhelming. It's just like, here, this is the end. There's no impact. No reason to care. The antagonist is garbage. Cage's sidekick is boring. None of it is memorable. The movie has so many cool ideas that it alludes to (Evan's dementia and how it impacts his work) that are never delved into deeper. I wanted to hear more monologues from Cage - more scenes of just him battling his psyche. Anything to pull this movie from boredom. Unfortunately, it never happens.<br><br>This movie isn't worth it. Even for die hard Cage fans such as myself, Dying of the Light is hard to sit through despite an engaging performance by Cage. Any time Cage is off-screen, the movie loses all intrigue. That's not a good sign. If only a director's cut was able to see the light of day, then maybe the Dying of the Light wouldn't be such a tedious mess. As it stands, it's just a very forgettable misfire of a film.","user":"lnvicta","rank":[60,67]},{"title":"I don't understand the negative reviews..","rating":7,"date":"26 June 2015","review":"I've used this site for nearly 2 decades. Yet, this is the first time I have felt compelled to sign up or comment. <br><br>Nicholas Cage's performances was.. Nicholas Cage. As expected. He did well.<br><br>The movie? Thought provoking, and I thought the contrast of them both having diseases was intriguing. <br><br>I thought the conclusion was interesting. Would have liked to see the bad guy killed by Cage, but I think it's due to the fact that he realized they were both gone anyway.<br><br>What I find truly disgusting, is that this movie had poor reviews. I'm wondering if people's expectations of movies has gone to total crap. <br><br>While I didn't find this the most awesome movie I've ever seen, I also surely didn't think it was a bad movie. I have often found that critic reviews are so harsh they can hardly be trusted at all. But, when viewers find a movie that has not at all shown that it is a lemon, call it a lemon, I'm really wondering what has happened to us.","user":"tomco-19864","rank":[31,41]},{"title":"Another Nicholas Cage in Romania crapfest","rating":5,"date":"5 December 2014","review":"The story idea is interesting and Nicholas Cage played reasonably, so this could have been good. Anton Yelchin can be a good actor, too, with the right direction. Unfortunately the script was absolutely terrible. It was slightly funny to see Romanian actors being dubbed in post production by someone who obviously did not know the language or to see that the SRI headquarters is a small office building in the center of Bucharest or that Ferentari is also nearby, but that was the full extent of my entertainment. Ironically, Irene Jacob's Romanian was almost perfect.<br><br>The basic plot is that a veteran CIA agent, obsessed by the man who tortured him 22 years before and the only one who thinks that man is still alive, gets some evidence on where to find his tormentor. Plagued by dementia he goes through Romania and Kenya to find this dying bed riddled old man that for decades has been the subject of his nightmares. <br><br>If handled correctly, this could have been a wonderful piece on how pointless it is to hold grudges and how the world changes around us and discards us when we fail to function. But no, it was a complete disaster, with every opportunity missed completely.<br><br>Bottom line: a movie bad enough to not be worth watching, but not bad enough to be even remotely funny.","user":"siderite","rank":[59,84]}]