[{"title":"Even the Kiddies Weren't Buying It","rating":1,"date":"2 January 2010","review":"Today I had to sit through this movie several times. :-(<br><br>As an adult, it wasn't funny or entertaining. But what amused me was the reaction from the kids in the audiences. Almost none of the kids laughed out loud during the matinée viewing (the showing with the most kids in attendance). <br><br>Some take away comments from the mouth of babes: \"Is it over YET?\" \"I'm bored\" and my personal favorite \"That wasn't so funny at all.\" (poor kid said it over and over again with the \"big\" jokes.) Plus, I had never seen so many kids ready to leave after the first 15 minutes. <br><br>It didn't get better over the course of the evening.","user":"noirprncess","rank":[71,109]},{"title":"good family fun!","rating":7,"date":"3 January 2010","review":"After all the negative reviews I read, I went in with pretty low expectations. Perhaps that's why I ended up giving up a 7.<br><br>Look, this is not Hamlet, Citizen Kane or Duck Soup. This is a PG film that as close to being family friendly than I have seen. I can only imagine the PG rating was due to the fact that the chipettes were darn right sexy - I didn't hear any vulgarity, see any nudity, violence or adult situations.<br><br>It is really getting hard to find a film where I can take my 9 year old daughter to. With battling giant robots, vampires, and giant smurfs lurking in 3D, this movie was a relief to see.<br><br>The plot is paper thin - though in its defense it did have an ethical base of family, friendship, and responsibility.<br><br>The effects were top notch, and there were a few times I even laughed (which was a few more times than I expected).<br><br>In one word it was - 'Cute' - which is exactly what I think it sought out to be. Nothing more.. Nothing less. Harmless fluff.<br><br>My 9 year old enjoyed it. And at the end of the day, that's all that mattered to me.<br><br>This is a film for children. Taken on it's level, I give it a 7. if you want to rate it as art or entertainment for adults? Yeah, mebbe a 2 or 3. But you know what? Some kids were clapping at parts in the theater. To me, that was pretty cool knowing that a film can get kids in a theater clapping for the characters on the screen.<br><br>So relax. chill.. bring your little ones... and enjoy...","user":"fritzlang","rank":[60,93]},{"title":"Decent. movie, could have been better...","rating":7,"date":"7 January 2010","review":"I can honestly say the movie itself was only decent, I did expect better and this is coming from a huge fan of the chipmunks, dating back to the early 80's when the cartoon series reined. I enjoyed the first 3D chipmunk movie, I watched it a few times and there wasn't too much with it that I did not like. But this movie... it had me smile a few times, other times it kinda let me down because it did not live up to my expectations.<br><br>One of the BIGGEST disappointments to me was the limited interaction the chipmunks and chipettes had with each other throughout the movie. It certainly wasn't like the old cartoons where they were all together getting into mischief, competing with each other, or just plain having fun doing whatever it was they did. It was always enjoyable watching Alvin and Britney going at it, while the other 4 tried to keep them out of trouble. In this movie their interaction with each other is very limited, and when they do interact, it's mostly in depressing or angry situations. In the old cartoons, sure they squabbled, especially Alvin and Britney... but it was in a fashion that left you smile cause you know deep down they all cared. In this movie they seemed.. cold to each other, especially Alvin vs. Simon.<br><br>Examples are when Alvin tries to warn Britney about Ian Hawk, Britney turns a cold shoulder to Alvin's advice and ends up on the floor covered in food, angry at Alvin. Another example is a scene showing a depressed Theodore because of his brothers fought for a good portion of the movie, Eleanore comes over to talk to him. Just when you think she's gonna cheer him up, the scene ends abruptly in my opinion. Last example is when Alvin misses the music competition and shows up late, Britney just looks at him all sad and says \"BTW, I didn't want to win this way\" then walks away.. what the heck is that? There's also the constant arguing and fighting going on with Alvin and Simon, and Theodore spends a good amount of his time being sad. I was not expecting some chipmunk love story where they all fall for each other and live happily ever after, but I did expect to see them all get along for more of the movie. The majority of the movie was about them fighting and distrusting each other, it's not the image I remember from my youth.<br><br>I understand that the storyline was that Ian wanted revenge on the chipmunks, and didn't want the chipettes to trust the chipmunks so they couldn't warn them about who he really was. Simon and Alvin we're fighting because Alvin was being his egotistical self, and Theodore didn't like it. The storyline in theory was good; it's the way it was executed that kinda killed it. It felt like they tried to do too much, and accomplished so little. It's like the movie was just a bunch of short random scenes that eventually came together in some fashion, but never felt entirely complete. Again, I think I feel this way because you never really see ALL of the chipmunks together in this one, and it seems to focus on Alvin and Simon a lot more than the other four. Because this Squeakuel introduces the chipettes, by the end of the movie you feel like the chipmunks and chipettes never really got to know each other, then they all end up living together in the end?<br><br>Besides the limited interaction with the chipmunks and chipettes as a whole, where was Dave? In a hospital bed almost the entire movie. Don't get me wrong I'm not a huge fan of Jason Lee, but jeez why cut Dave out of almost the entire movie? He's part of the Chipmunks franchise, and he made very limited appearances. Instead they put in some nerd cousin of David's who wants to take no responsibility and play video games. Who is this guy? I don't ever remember seeing him before, why take out Dave? I did start to kind of like him by the end, but still.. he was no replacement for Dave.<br><br>So there's that, those are my biggest disappointments about the movie. Besides the flawed execution of the story, the limited interaction of the munks, and the lack of Dave.. it was enjoyable to watch. I can honestly say unless you are a chipmunk fan from the past, you probably will not like this movie. I am personally hoping for a 3rd movie just to correct the mistakes of this one, and carry on this wonderful legacy. I want to see all 6 munks running around, laughing and playing, and getting into trouble like the good old days.","user":"bighead-0","rank":[16,22]}]