[{"title":"A friendly warning","rating":16,"date":"16 August 2012","review":"Consider this not exactly as a review, but as a warning from a friend, in case you haven't seen this film yet and are curious about it. There are already many good reviews here dealing with the cinematographic, technical, cultural etc aspects of this film, so I won't add anything new there. This is not about the film, but about you, the potential viewer.<br><br>As many other reviewers, I've seen a significant amount of \"extreme\" or strong horror movies. Fear and shock are powerful emotions, and films are a safe and entertaining way of experiencing them. Some of them left a deep impression in me, sometimes for a few days, but that eventually vanishes.<br><br>With this film, it's a different story. It may leave permanent scars in your mind that will ruin some of the best experiences of your life, such as witnessing the birth of your child or lying in bed caressing a son's hair. Violent and obscene thoughts will keep intruding, and it's scary for me to think how much this can affect some people. If you think that you may belong to this group, don't risk it. There are many good films out there, and you may go on living without watching this one. Otherwise, go and watch it, but just remember that images can not be erased from your brain aftewards.<br><br>This is why this is so different. The fear does not come during the movie. It comes after. And it is too real.","user":"figueira-g","rank":[787,826]},{"title":"Every exploitation trick in the book . .","rating":2,"date":"25 July 2010","review":"This review contains spoilers - and descriptions of scenes depicted in  Srpski Film.  A baby is graphically birthed on screen by a large bald man. The mother  lies prone, and pushes the baby out into his hands. He then takes down  his underwear, and rapes the screaming newborn baby - on screen.  A man is shown violently anally raping (onscreen) a young child - his  own son, after he is injected with massive doses of a powerful sexual  stimulant. The boy - presumably also drugged - lies face-down, bleeding  profusely from his anus as the man continues a sustained sexual attack.  Evidently, this is art.  The thing that bothered me the most about Srpski Film isn't necessarily  its use of deliberate shock, and taboo busting scenes designed to  offend. It is the way in which Srdjan Spasojevic tries to cover his  dubious tracks by passing it off as some kind of artistic political  allegory about life in Serbia.  I was aware of the fact that I was increasingly annoyed as I watched  this film - mainly because the filmmakers use every trick in the book,  and obviously some new ones to batter the viewer over the head with  aggressive imagery, in order to make enough social fuss to draw in  viewers. It doesn't necessarily make it a good film, although it is  admittedly well shot, and well acted.  It almost reminded me of seeing footage of beheadings on the internet.  It's supposed to be profound in some way, but ultimately it is just  irredeemable pain and destruction, and contains no social commentary at  all.  Realistic torture and extremely graphic rape scenes usually make a  negative impact on the viewer, because they are horrific and unpleasant  subjects. Using babies and children does not make it artistic,  independent of your cultural origins - although some people claim that  it is art. I saw another review of this film that evidently recognised  genuine \"art\" in every single frame  I, like some of the other reviewers - have happily watched horror and  exploitation movies for years - but so what? It doesn't make any  difference whatsoever. Sub-genres come and go, and the recent tide of  shocking torture films are more akin to a test of the viewer's resolve,  than the slices of entertainment they used to be. Fair enough - if you  don't like them then don't watch.  I am a film fan. I definitely love film. I just don't love this kind of  film, or the thinly veiled attempts to disguise absolute exploitation  as something profound.","user":"meccanici","rank":[406,541]},{"title":"0/10. Repulsive, revolting, disgusting, unsightly, gross, etc.","rating":1,"date":"21 February 2020","review":"Made by Nazi lovers.\nIn short, this ain't a movie or an art but sheer deviancy cherished by the offsprings of Nazi lovers.\nThis is for the first time I have rated a movie 0/10.","user":"Fella_shibby","rank":[26,30]}]