[{"title":"Engaging, and unexpected - A Strong and Intense film that you should watch","rating":7,"date":"29 October 2015","review":"Reminiscent of the exploitation films of the 1970's, Bound to Vengeance is a brutal revenge film that is both gritty and gut- wrenching.<br><br>A young girl, barely in her 20's, is chained and held captive in a derelict basement in the middle of nowhere. Making a harrowing escape, she ransacks the home she's been held prisoner in and discovers that other girls like her are experiencing a similar fate. Bound and determined for justice and retribution, she sets her sights on vindication by forcing her captor to reveal the locations of these women so they too can be saved, at any cost.<br><br>Independent horror films are a dime a dozen, or so the expression goes. You can get cheap creature flicks, poorly acted and ridiculous slasher films, and on the rare occasion you can get a brutal and original film that merits your attention.<br><br>Bound to Vengeance is an intense film unlike most, it is gruesome and refuses to look away at the horrifying reality of sex trafficking and sexual assault. The director Jose Manuel Cravioto does a commendable job at highlighting the trauma these women have suffered without ever actually showing the action of abuse. Through subtle hints, flash backs, and held close up shots on scenery, he conveys to the audience the startling reality these women have endured for an unspoken but long stretch of time. It is amazing what Cravioto does in creating terror and menace just through a held close-up shot of a closed door.<br><br>The dynamic between the two leads, Eve and her captor, Phil, is complex and mystifying. Tina Ivlev shines as the strong and determined woman who is willing to die in order to seek her vengeance. Richard Tyson plays a manipulative scumbag who, though bound, uses his words to try to wriggle out of his predicament. They are believable, primal, and scary. Realistically, they bring to life the actions of a predator and victim within the realms of human behavior. At no point does the film feel far reaching and taking too many liberties, and perhaps that is the scariest part.<br><br>There is a component of the film that weakens its effectiveness and presence, and that is the use of the camera footage of Eve with her boyfriend Ronnie. Yes, there is a purpose to it however there surely was an alternative way to convey this vital information without coping out through such a weak introduction. The use of this footage lessens the power and strength of the film overall, and comes across as a cheap answer to a film conundrum, like the exhausted technique of voiceovers.<br><br>Being thrown into the survival environment created by Bound to Vengeance as an audience member is heart racing and engaging. The film does not waste your time nor deliver cheap formulaic horror we have become accustomed to. It is not perfect, but it is eye opening, gritty, dark and 100% worth the watch.<br><br>7.5/10<br><br>Please check out our website for full reviews of ALL the recent HORROR releases.","user":"ArchonCinemaReviews","rank":[30,38]},{"title":"She Almost Had Me","rating":5,"date":"26 June 2015","review":"So this is and is not a teen slasher movie. The subject matter deals with human trafficking and the main character plays a victim who apparently never wanted to call the police which leads to some consequences. Richard Tyson, who has been MIA for a while now, plays the despicable kidnapper who lays on the guilt trip thick with the female lead. She stupidly listens to him and doesn't seem to rationalize it out that he is the kidnapper and what happens to the other victim is because of him. As the film plays out, it seems as if our female lead is experiencing PTSD with every step she makes. It was refreshing to see the victim turn the tables on the predator but at the same time, she makes some stupid moves that frustrates the hell out of you. What should have been a better conclusion is left impotent and unsatisfactory. You wanted more out off this film and the ending just sucked. Still, as far as girl in peril films go, this was better.","user":"twotrybe","rank":[29,46]},{"title":"Better Than Expected","rating":8,"date":"9 October 2015","review":"Bound to Vengeance (2015)<br><br>Director José Manuel Cravioto's feature début is a grubby affair, the sort of film that you feel like needing a good scrub after. It delves into the all too prevalent and real horrors that are sexual abuse and human trafficking. Eve (Tina Ivlev), one such victim, turns on her keeper Phil (Richard Tyson) when he brings food to her. Displaying terrific survival instincts, and some savvy when it comes to turning the tables on Phil, she hoists the battered Phil out of the cellar she has kept her prisoner in for six months. Finding Polaroid photos of other girls, being stashed away for the same purpose, Eve demands that Phil tell her where each is being held. So begins a night of twists and turns for our spunky lead.<br><br>Bound to Vengeance, originally entitled Reversal, is one short film, weighing in at seventy-five minutes of screen-time, excluding the end credits however you will not feel short changed. That lean running time is all that is needed to deliver a fast paced, edge-of-the-seat premise that would otherwise feel stretched. Every event that unfolds on-screen leads somewhere. There's no needless padding. If there is a grumble with the plotting it's that there's a couple of 'surprises' that aren't surprises really. You can see them coming a mile off but otherwise it's still an involving watch.<br><br>Tina Ivlev, a near dead ringer for Jennifer Lawrence, is exceptional. Ivlev captures the mixture of vulnerability and aggressor, that the role calls for, and I for one couldn't take my eyes off her. A very strong female lead! Naming the lead character Eve is rather unsubtle but unlike most woman-revenge flicks she is well-rounded, rather than one note, and we are drawn into her plight, even if she is a little slow in guessing what the viewer has already sussed from the start. Richard Tyson, as Phil, can do no wrong in my eyes. He has always been a favourite actor of mine, I really enjoyed his turn in Big Bad Wolf (2006) and he's equally as nasty here.<br><br>Human trafficking and sexual abuse are not subjects conducive to an evening of light entertainment. Fortunately Bound for Vengeance is focused more on the aftermath that occurs when one particular victim gets free and becomes the aggressor, rather than dwelling on the more sensationalistic aspects. Edge-of-the-seat, fast-paced and to-the-point this is an excellent calling card for director Cravioto and his lead Tina Ivlev. Recommended.<br><br>Check out more of my reviews at www.mybloodyreviews.com","user":"bournemouthbear","rank":[22,34]}]