[{"title":"An interesting and entertaining comedy.","rating":9,"date":"20 June 2010","review":"I thoroughly enjoyed this film and found the story to be original and funny throughout. Emily Blunt plays an extremely sexy con-artist who crosses paths with an up-tight Bill Nighy playing a professional assassin hired to kill her.<br><br>The characters are likable and well-cast. Bill Nighy and Emily Blunt strike up a modern day love-story that is unconventional and yet somehow totally believable. The family bond that is established with Rupert Grint as the adopted son worked very well and was charming. <br><br>If you want to see something different, interesting and funny then I really recommend giving this film a chance.","user":"danielkratky","rank":[102,122]},{"title":"An understated British comedy","rating":8,"date":"29 June 2010","review":"I thoroughly enjoyed this film and thought it was very entertaining. True, there were only a few laugh-out-loud moments, but it kept me chuckling away for most of the 90-odd minutes. I thought Bill Nighy's performance was spot-on and Eileen Atkins' role gave her plenty of scope for comedy moments. Rupert Everett and Gregor Fisher worked well together, and Martin Freeman was very good as Dixon. Although the plot was simple, the film was reminiscent of a lot of British comedies from the Sixties and Seventies, which was probably why I enjoyed it so much. It was also good to see something that wasn't shot in America and didn't follow the stereotypical plot lines that most American films seem to have as a matter of course.","user":"Harry_Keane","rank":[76,92]},{"title":"Brilliantly Funny","rating":10,"date":"20 June 2010","review":"Well, in contrast to the first review, i felt that this was a hilariously funny attribute to the British film industry. With continuous amusing modern slap stick humour throughout.<br><br>I had been looking forward to the release of this film for a while, and it was far better than i had ever expected. The cinema was packed and everyone was laughing throughout the entire film, which in my experience is very rare.<br><br>There is an incredible cast containing many well known British actors/ actresses, overall a must see film. <br><br>Looking forward to the DVD release. Thank you. x","user":"soffe12345","rank":[103,128]}]