[{"title":"Jane Seymour is great! The plot is...less great.","rating":6,"date":"24 August 2008","review":"My wife and I looked forward with anticipation to this movie as we are big Jane Seymour fans and knew she'd be entertaining. However, we also knew that the plot would most likely be pedestrian (after all this is the Hallmark Channel). All expectations were met.<br><br>Jane Seymour is very good as a household tips hostess who gets herself involved in a murder in Wyoming while on vacation. Her Prudence character is nosy, interfering, smart, confident and just a bit wacky. It's little wonder that Jamey Sheridan's police chief finds her both irritating and beguiling. He provides a nice gruff contrast to Prudence. (Though I felt the development of their relationship was a bit rushed.) The young actor playing Prudence's brainy and nervous assistant, Nigel, was also good. They make a delightfully goofy crime-fighting team.<br><br>The plot is not as strong. The dialog was sharp at times but Jane Seymour really deserves a better script. My wife and I had figured out the whole thing within fifteen minutes.<br><br>Ultimately, though, it was all about watching Prudence break into motel rooms, sneak through the woods and investigate crime with her knowledge of the multiple uses of peanut butter, liquid soap, and shaving cream (when she's not inadvertently cleaning up evidence). Fun show!","user":"gee-15","rank":[15,16]},{"title":"Entertaining","rating":6,"date":"28 September 2008","review":"Hallmark Channel is big on recognizable stars and mediocre scripts that move like molasses. \"Dear Prudence\" had the stars and the mediocre script, but it actually moved a little faster than, say, \"Mystery Woman.\" Jane Seymour plays a household hints TV lady who goes on vacation at her boss' mountain place in Montana. Once there, she becomes involved in a murder.<br><br>Seymour is playing in essence a character role here, one you might see a younger version of Angela Lansbury doing. It's inspired against type casting - Seymour is beautiful and energetic, investing the role with a sense of enthusiasm that's refreshing on Hallmark.<br><br>The downside is the plot; the mystery was solved by this viewer in the first 10 minutes or so. However, the script had the household hints going for it, which are great, and the young man playing opposite Seymour was very good. Plus, Jamey Sheridan made a good romantic interest for Seymour.<br><br>Hallmark is pushing the heck out of this; Prudence has a special page on the Hallmark site, so I'm wondering if this is intended as a pilot. It would be a lovely series for the \"Murder, She Wrote\" crowd -I wasn't a member of that demographic when \"Murder, She Wrote\" started in 1984; I am now.","user":"blanche-2","rank":[7,7]},{"title":"Charmingly Entertaining!","rating":13,"date":"13 September 2011","review":"If you want to enjoy all the fine nuances and details of intricate plots, characterizations, clues, and red herrings, then read a book. Movies are limited by a number of constraints.<br><br>At best, major movies have 120 minutes available, whereas made-for-TV movies have only 90-100 minutes. Additionally, TV movies have many more code restrictions imposed on them. In books, authors can get away with almost anything. On top of everything else, Lifetime and Hallmark impose additional restrictions to insure films on their channels are compatible with their wholesome corporate images. To say that scripts on the Hallmark channel are mediocre is to do them an injustice.<br><br>By necessity, story lines for TV movies must be simplified, lest they become too confusing by trying to cram too much into too little available time. The same is true with the development of characters and their back stories. I think the scripts on these channels are just fine, given the restrictions they are under.<br><br>The story for \"Dear Prudence\" was not predictable. If anyone figured everything out in the first 15 minutes, then they simply made a lucky guess. But I wouldn't bet my new IPad based on that guess.<br><br>Jane Seymour and her fellow actors all did a fine and believable job. The production values were lovely, and the script was lively and entertaining. I think this would make a terrific TV series.<br><br>If you like your mystery stories on the somewhat lighter side, then I would recommend this movie most highly.","user":"jimmullinaux","rank":[4,4]}]