[{"title":"the Righter and Wronger ways of genre film-making","rating":7,"date":"16 March 2010","review":"Antoine Fuqua aims high within the limitations he has for Brooklyn's Finest. By that I mean the film is fairly low-budget, or at least middle of the road (my guess is twenty million), and it was shot on location in Brooklyn and places around. He also has a script that has its share of clichés and potential pitfalls for cinematic treatment. It's surprising how well the film comes off with the elements, and they are ALL familiar: the cop just nearing retirement (Gere), on his way out, who has to shepherd a rookie through his first days on the; a corrupted cop (redundant mayhap) that is scrounging for any money he can on raids (Hawke) needs it for a slightly noble cause, a new house for his growing family; a cop undercover (Cheadle) has to choose promotion or loyalty with a criminal takedown on the horizon.<br><br>Three very recognizable types, and the tropes are there, at least on paper. But where Fuqua sets himself apart, as he did to a good if not great extent on Training Day, is to imbue importance (not pretentious but just enough for serious effect) in the direction of scenes, and in casting. The actors take material that could be trite and unconvincing and even stale post-Lumet-cop-movie stuff and make it their own, compelling and heartfelt, and true to the extent that the genre allows. There's real tragedy felt with Hawke's character, albeit he may overact just a bit in some scenes, since this corrupt cop wouldn't be so bad if he could get what he needs (\"I don't want God's forgiveness, I want his help,\" he says in confession), and likewise real conflict with Cheadle's undercover, who has been embedded too long in the trenches, and wants to help the criminal who once saved his life (Wesley Snipes fantastic in an older, slightly wiser version of his character in New Jack City).<br><br>And then there's Gere. One almost forgets Gere's successes when he's starring in romantic-comedy junk like... well, what's he been in recently for starters. But then one looks at Unfaithful, Days of Heaven, The Hoax, I'm Not There, among some others, and one sees Gere is an underrated presence, a guy who when given material to shine in does very well as an everyman, more than just a typical pretty star. With his role as the on-his-way-out cop, he gives one of his best performances, worn and weary, but strong and good as a cop whenever he can see fit, who at one point makes a mistake that he won't cop to (watch Gere when he's interrogated about his rookie's mishap on a convenience store scuffle and it's something of genius work). It's intense and believable, and even tender and sorrowful work, like when Gere's character is around a prostitute he's fallen for.<br><br>Back to Fuqua though - this is a filmmaker who knows what he's working in, and wants to transcend it. Perhaps his idol for this kind of production was Sidney Lumet with his cop films: make something dramatic and tragic, and never lose the grit, but add panache with the directing. He knows the conventions and has to stick to them, sometimes for weaker or just expected effect. But watching his style in that last reel, when all three stories that have been going back and forth (ocassionally intertwined) come together at one project building. There's a scene where Hawke is personally raiding a place. Watch the camera in this scene, where it stays put in one spot for seemingly a minute. It could almost be a Tarantino move, something self-conscious but purposeful for the action, the psychology of the emotion of the scene. His work with better material would be astonishing. As it is, it's just good, inventive film-making.","user":"Quinoa1984","rank":[70,82]},{"title":"Could have been a classic","rating":7,"date":"15 March 2010","review":"Brooklyn's Finest is clichéd cop film only in setup, not in execution. The scripting and a plethora of strong performance elevate the familiar veins that make up the films structure. In fact, three of the most standard-order plot lines are utilized; and undercover cop who blurs the line between righteous and corrupt, a drug cop who exhibits no blurring in his corruption and an aging veteran slugging it through his last week on the job. These cops are played by Don Cheadle, Ethan Hawk and Richard Gere respectively and each gets equal screen time in a triple thread story that eventually converge on one fateful night.<br><br>Director Antoine Fuqua's latest treads a thin line between tragic and gritty and outright depressing. This is a gloomy film to be sure, everyone is either a cop, murderer, drug dealer or prostitute (sometimes many of the above) and there is no glimpse of sunshine, so to speak, in Fuqua's Brooklyn. I am a big fan of Fuqua, from his John Woo-esquire debut with The Replacement Killers to the classic cop drama Training Day, to the very underrated Bruce Willis war actionier Tears of the Sun, he is more than a competent auteur and always brings out solid performances from his leads.<br><br>Hawk (who plays the increasingly corrupt Sal) is perhaps the strongest of three leads, but Gere and Cheadle are very convincing in their roles as well. Unfortunately, despite the admirable development of these characters, the aforementioned ordinary narrative leaves little question about where their respective paths are headed. We also get a blazing comeback from the one and only Wesley Snipes as a criminal and friend of Cheadle's Tango. Rounding off the talented main players are Brian F. O'Byrne as Sal's fellow cop and friend and Will Patton as Tango's lone remaining contact to the just world he feels is fading away. As I have iterated many times, it is the stellar work from the key players that makes Brooklyn's Finest worth your time.<br><br>The drive behind these three cops is equally compelling. Sal has 5 kids (with 6 and 7 on the way) and is swimming in debt. Through a real-estate contact he sets up a deal to move his growing family to a larger house, only if he can get the big score of drug money he needs. As the date approaches for him to come up with the money he grows increasingly desperate. Gere's Eddie is a burnt-out cop who has all but lost respect for the job, and his fellow cops have all but lost respect for him. His only remaining duty is to escort a rookie around for his final 7 days but things go far less smoothly then he could have hoped. Finally there is Tango, a UC who has lost all his ties to the real world. His wife is filing for divorce and he wants to be made detective first grade a.s.a.p. and spend the remainder of his days behind a comfortable desk and away from a life of crime. In one of the best sequences, Tango is asked why the sudden urge to get out. He tells of a night where he was pulled over by the cops for speeding and legitimately considered killing them. He wants out.<br><br>If only the despair had been laid on a little less thick and the stereotypes that make up the three main characters polished with a bit more inventiveness, Brooklyn's Finest could have been a classic in the making. Instead we get only what we would expect; a gritty, bloody and well acted police actionier.<br><br>Read all my reviews at simonsaysmovies.blogspot.com","user":"Simon_Says_Movies","rank":[105,135]},{"title":"Very well-rounded cop thriller","rating":8,"date":"14 March 2010","review":"Brooklyn's Finest rests on the strong character portrayals of the lives of three ordinary men struggling at different points in their careers. What they each share is the New York Police Department as a workplace.<br><br>Life isn't perfect - it never is. We always have to give something up in order to do something else - it's called choice. Therein lies man's fatal freedom.<br><br>Sal (Ethan Hawke) gave up the possibility for flash when he became a cop. He has a growing family with numerous kids but lives in a decrepit, run-down house where the wood mold is causing his pregnant wife lung problems. His NYPD salary isn't sufficient for him to move to a different abode.<br><br>Can we judge him? It is a context that bears for some humanity from our part. He will do things in the film, but it is difficult for us to point our fingers from a high horse, for we aren't in his situation. Does the end justify the means? <br><br>While doing undercover work in prison, Tango (Don Cheadle) is saved from death by an inmate, Casanova Philips (Wesley Snipes). The event forms a bond between them. Now Casanova is back out and the force want Tango to send him back in. <br><br>By taking this shortcut to Detective first grade (read: becoming an undercover agent), Tango is forced to deal with harsh consequences, namely the fact that his wife is in the process of leaving him, and that other than Casanova he has no friends.<br><br>Eddie (Richard Gere) is retiring and is a morally decadent seemingly useless member of the force. He gets teased by his younger co-worker cops, and seems fed up with his life. We see him put a revolver to his mouth in the morning.<br><br>Even though he is 7 days away from retirement he must take care of young rookies, fresh faces new to the NYPD. Eddie doesn't get along well with them.<br><br>It is unclear what happened to his wife, but Eddie now seeks solace in the womanly comforts of a lowly Chinatown hooker.<br><br>These grotesquely authentic lives are laid out with the aid of a soundtrack that simultaneously sets the pace and follows the psychological states of the main protagonists. The tone of the music will change, for instance, when a particular character is in a tight situation, a situation where he is again confronted with choice.<br><br>All the actors in this film pull off magnificently intense portrayals. Especially worthy of mention are Cheadle, Snipes, Gere and Hawke -- who once again shows that he can enter the mind of a struggling cop like no other.<br><br>A steady-paced, involving thriller definitely worth a gander. 8/10.","user":"tha_mongoose","rank":[81,104]}]