[{"title":"GREAT Love Story...","rating":10,"date":"22 April 2010","review":"I have to say that it came as a shock that Waiting For Forever was an ACTUAL, REAL LIFE, love story. The movie itself kept me hanging on to the tail end of every scene, waiting to see what would happen next. All in one sitting, I smiled with heartfelt happiness, I became filled with anger, and I cried uncontrollably with feeling of deep sorrow. This is what TRUE LOVE does to us as people, and I must say that this movie captured the very essence of it...<br><br>If I could, I would take a group of my closest friends to see this movie. It's definitely a great conversation piece. The vivid imagination of the director is clearly represented throughout, capturing not only your attention, but focus on detail as well. I would see this movie ten times again...<br><br>MUST SEE - GREAT LOVE STORY!","user":"missj-black07","rank":[75,95]},{"title":"Really enjoyed it!","rating":8,"date":"21 April 2010","review":"Now let me start off by saying that I am not into romantic movies whatsoever. They are always the same clichéd sappy crap with an overly dramatic lead that becomes more annoying than anything by the end of them. THIS WAS NOT THE CASE WITH \"WAITING FOR FOREVER\"<br><br>I was lucky enough to attend Gen Art film festival this year in New York and was able to see this movie. I honestly had no idea what I was getting into or what it was about and it really surprised me! I honestly can say that at no point in the movie was I ever bored; from the get going of the flashback train sequences until the ending scenes I was enthralled with the movie. I was right there with Will and his struggles to show his enduring love to Emma. <br><br>The acting was fresh and superb. Tom Sturridge had so much on screen charisma and a believable carefree attitude that I found myself rooting for him the entire time. It is nice when you ACTUALLY like to watch the protagonist of a film! He is surrounded by an incredible supporting cast where I really think that Blythe Danner gives the performance of a lifetime (I smell Oscar nod). The always lovable Richard Jenkins has the best moments in the movie and a surprisingly strong performance by Scott Mechlowicz. At first glance I was like \"why is the kid from EuroTrip in this\" and after the movie I felt like a putz for ever thinking that statement. He is the voice of everyone in the audience in the movie.<br><br>This is also a movie that doesn't have cheap entertainment of constant swearing, blood and guts, gratuitous nudity, etc. It solely focuses on telling the story and making us like the characters for themselves. I think that is a rare statement made by films today and this one should be applauded for it.","user":"CPF101","rank":[54,67]},{"title":"Great little film this, was really surprised!","rating":7,"date":"28 April 2011","review":"Great little film this, was really surprised. judging by the quality and negativity of some reviews I think you need to have reached a certain maturity level to really appreciate the film.<br><br>The branding of Tom Sturridge's character(will Donner) being a creepy stalker really is misleading, I urge people to watch the film instead of jumping on the bandwagon! The pace of the film started a little too slow, potentially causing some later scenes to be rushed that had potential to really add to the film.<br><br>Despite this, the supporting cast had enough character building(all be it light) to support the lead of the film that ultimately, has enough to deliver the story and bring a tear anyone's eye! Providing your not going into the film having predetermined the lead as a creepy stalker, you will enjoy this film! :)","user":"coecoe","rank":[21,27]}]