[{"title":"Not that funny and a bit amateurish but still, quite entertaining.","rating":28,"date":"28 July 2010","review":"Somewhere beneath Washington, D.C., an intense rivalry is heating up between two opposing teams of government assassins. The hired killers in the organizations take their names from Tarot cards. The Fool (Joe Anderson) is the latest recruit. Reporting for his first day on the job, The Fool is shocked to find that his boss is dead, and the office is on lockdown. To make matters worse, the building has been rigged with explosives, and it's going to blow soon. Now, in order to get out alive, The Fool will have to root out the killer in his midst, and make a quick escape before his co-workers catch him in their crosshairs.<br><br>Operation Endgame, a satirical workplace comedy with a slick action twist is not without it's flaws. The plot is convoluted, most of the dialog is incredibly silly and the whole thing isn't that funny. Having said that, the film is damn entertaining. The cast is composed, among others, by Zach Galifianakis, Emilie de Ravin, Maggie Q, Rob Corddry, Ellen Barkin,Bob Odenkirk, Ving Rhames. There's plenty of star power here but, while some of the actors were delightful, others were completely underused. Being a battle royale of sorts, the deaths kept piling up and therefor some brilliant actors like Bob Odenkirk (who has been phenomenal in the TV show Breaking Bad) had very little screen time.<br><br>In the end, it's all about what you're expecting. Operation Endgame is no Oscar contender. This is mindless fun with a bit of action and gore in the middle and the film clearly doesn't take itself too serious and in my opinion it succeeded in what it intended to do which is, to entertain.<br><br>6/10","user":"imdbbl","rank":[30,44]},{"title":"Another example of a great idea resulting in a not so great movie.","rating":5,"date":"25 August 2010","review":"\"You think it's easy to look like a bearded tampon?\"<br><br>What a weird, odd, and ultimately underwhelming mixture Operation: Endgame ended up being.&nbsp;<br><br>I was expecting a bloody action comedy with several really hot women and a couple of funny/interesting actors playing rival assassins who are out for blood, but instead I got a predictable, poorly scripted, ham-fisted critique on Bush-era intelligence operations. The great cast was really the only thing that made this movie somewhat worth my time. We've got Odette Yustman, Zach Galifiankis, Maggie Q, Rob Corddry, Adam Scott, Brandon T. Jackson, Emilie de Ravin, Ving Rhames, Jeffrey Tambor...it's like someone asked me personally about all the actors I'd like to see in a movie. Yet, they're utterly wasted on characters that are terribly written. It shouldn't be possible to make a mediocre movie with a cast this great, but whoever wrote the script certainly pulled it off.<br><br>The majority of the jokes are unfunny (Corddry does get a few gems, though), the fight choreography is unimpressive, and the movie as a whole would have been better without the looping real-life footage of President Obama's inauguration and the lame attempts to ground the story in some kind of political statement. I'm all for messages in movies, but Operation: Endgame goes about it without any subtlety or wit, and seemed a muddled mess as a result. &nbsp;<br><br>I'm giving this a high score than it deserves because I got some enjoyment just from the opportunity to see a few of the actors I'm quite fond of (good Lord, Odette Yustman looks fantastic in a tank top), but I feel pretty comfortable advising others to just skip it, entirely. It's a shame that a movie with such potential ended up stumbling in the execution.","user":"lewiskendell","rank":[25,36]},{"title":"Fun movie","rating":6,"date":"24 July 2010","review":"Reading the plot summary I went in thinking this would be all mindless action. The action is pretty mindless, but the movie is really more comedy than anything else. The dialog is the real treat here (especially that delivered by Rob Corddry).<br><br>We're taken into an unexpected world, where American covert operatives are shown to be unglamorous, ultra-jaded, and a little crazy, like your average caricature of a stereotypical office environment, complete with cubicles, water coolers and fluorescent lights. It's far from the suave and sophisticated spy life normally depicted. <br><br>It seems like a typical day at the office, until something goes terribly wrong and suddenly everyone starts killing each other. Though still cracking jokes and making sarcastic banter.<br><br>I found the movie entertaining almost throughout. It's written and performed well for the most part. Aside from a couple of exceptions, the impressive cast list only play bit parts. Don't expect to see much of Ving Rhames or Zack Galifianakis, for example. Nevertheless I thought everyone was nicely utilized, for the amount of time they chose to donate. <br><br>My only serious problem with the movie came towards the end, when the movie seemed to try and offer some sort of serious message tied into real-life events as its conclusion; which just didn't work, probably because it didn't jive with the humorous meat of the film you just watched. The movie works best at face value, without the backstory that's eventually revealed. Basically it tries to be too much, when it should've settled for just being fun.","user":"equazcion","rank":[61,97]}]