[{"title":"Predictable but totally laughable!","rating":8,"date":"17 August 2011","review":"I don't get it why people so undermine this movie. It was indeed predictable most of the time but come on, there were many moment of laughter.<br><br>I saw this movie with an ex girlfriend and we were seeing many moments we had on our first dates and we enjoyed to see it was inspired from real facts. Many of the comical situations do happen in real life and it really gets to you when you see it from outside.<br><br>The main plot may be a little exaggerated, how everything comes together but it's a classic date movie and you cannot have such high expectations from it.<br><br>The cast is OK, even though Jennifer Lopez is a little overpowered by her role, but she manages in the end to pull it of. Alex O'Loughlin is the perfect \"I don't know if I want to be a father but I love this woman\" guy and makes every moment a real delight.<br><br>Everyone gives it a 4 or 5, I give it an 8 because you can have a blast if you watch it with your girlfriend or ex.","user":"mihaitutu7","rank":[18,20]},{"title":"Awful in so many ways","rating":3,"date":"23 April 2010","review":"The plot is fresh and original, at least I've never seen anything like it before. This film actually has two options. #1 To be a serious drama about a \"middle aged\" woman and the choices she makes. #2 To be hilarious and make the audience laugh all the way home. Somehow this movie is attempting both which unfortunately results in a chick flick so weak that not even the girliest of girls (that would be me), would bother watching.. again. It has a few good scenes here and there, but not enough to make it worth watching a second time. Being quite the J.Lo fan, this movie really was a major disappointment, as I had looked forward to her comeback. I def smell a Razzie...!","user":"TheWhiteCallaLily","rank":[60,83]},{"title":"Mediocre, Lopez can do this stuff in her sleep.","rating":4,"date":"1 June 2011","review":"Zoe's a woman who has a hard time letting anyone into her life. She has a habit of pushing people away when they get close. She also wants to have a baby but because she has no man in her life decides to be artificially inseminated. Shortly after having the procedure she meets a guy named Stan whom she connects with. But she's still afraid to let him in and when she tells him about her pregnancy thinking he would bail but he sticks with her.<br><br>Most of this was pleasant, just nothing new, and recycled formula. Lopez is a charmer, but let's face it, she can do this sort of stuff in her sleep. I don't remember laughing out loud. The chemistry between O'Loughlin and Lopez is professional and solid, If nothing memorable.<br><br>Bottom line. Watchable, but just barely above the Mendoza line. Really mediocre stuff, and nothing I haven't seen before. Take it or leave it, your not really missing anything.<br><br>4 ½ 10","user":"callanvass","rank":[14,17]}]