[{"title":"One of the worst films I've seen recently","rating":3,"date":"2 November 2012","review":"RZA's film has some amount of imagination,but, simply put, he has no idea how to build, pace, or tell a story. He has made the unfortunate mistake of imitating a genre he loves without understanding what makes it work. The dialogue is half nonsensical exposition, half nauseating one-liners. Lots of clumsy penis and vagina jokes. <br><br>The plot is so diffuse...there is not enough time given to any character for them to be read as an actual character. The film fails in tying together any of these frayed threads and also fails to make what happens in any of them significant or sensible. For example there is a \"betrayal\" plot which happens in the first two minutes of the film, when there is no context to make that betrayal meaningful, make the traitor seem particularly villainous, etc. The acting is very broad and simplistic, which I guess is to be expected given the things RZA expects them to say. He doesn't seem to understand that all of these things, the characters, dialogue, plot points, etc. are pointless without a proper context.<br><br>Some people might be inclined to tell me it's the \"point\" of the movie to not have a story, to be a loose framework on which a series of fight scenes are hung. I'd first suggest that that is not a meaningful effort to make. But even as a visual spectacle or stylistic effort, it doesn't do very well. All of the fights are basically the same knife/sword play... none of the characters really have a specific fighting style, and the CGI gore lopped onto the fights is excessive and silly. The music cues are embarrassingly overdone...any time the film wants you to feel an emotion, the sappiest orchestral music instantly kicks in, to the beat of a hip hop song.<br><br>I think it's possible that RZA could make a good film someday, but this certainly isn't it.","user":"universalparadox","rank":[272,379]},{"title":"Juvenile Kung-Fu","rating":4,"date":"3 November 2012","review":"The film had potential with a decent storyline and all-star cast, but fails to pull in the viewer to care about the characters or outcome of the story.The movie far too often goes for cheap,juvenile sexual exploitation.The target audience for the movie seems geared towards males 16-24 and no one else.I've also noticed that the more people see the film the ratings here on IMDb decline.RZA also has very little acting skills and it was a major reason why the movie falls flat. Russell Crowe and Lucy Lui did a fair performance,but even they couldn't salvage the movie.I'm being very critical with my review b/c it's unfortunate to see a movie that had the potential,but didn't live up to it.","user":"chnfilm","rank":[77,108]},{"title":"Confucius says, stick to rapping.","rating":2,"date":"9 December 2012","review":"Produced (not directed or written) by Quentin Tarantino (so you know it's going to be bad) \"The Man with the Iron Fists\", Wu Tang Clan member RZA's first try behind the camera, doesn't disappoint as far as \"bad\" movies go. This is truly an exercise in visual and structural ineptitude, which could only be the work of an amateur filmmaker. RZA, starring alongside an obese Russell Crowe and Cung Le (which should tell you all you need to know) in this rather poor grindhouse homage to old Kung Fu movies, narrates the simplistic story of a black blacksmith (RZA) who must protect his village from a deadly band of assassins. But even this story takes a hit, as it becomes overcomplicated by RZA's dreadful storytelling abilities. This mess of a film also stars Lucy Liu, who is by far the most tolerable character, playing the Madam of the town brothel. But not even Liu playing a watered down version of her character in \"Kill Bill: Vol: 1\" or a halfway decent final battle sequence can conceal the amount of problems that essentially cut \"The Man with the Iron Fists\" off at the wrists. Truthfully, I haven't wanted to like a movie this much and been so very disappointed by the result since \"Battle LA\".<br><br>Why is this movie so bad? Well, the fact that the entire movie distractingly switches back and forth from English to Mandarin (I am only speculating) for reasons unexplained to the viewer, is the first of many head shakingly dreadful decisions made by RZA. But for a more in-depth breakdown, the following is a very brief (that is, if you enjoy long rants) analysis of RZA's first film: <br><br>RZA is no writer: While the classic Martial Arts film concept itself is interesting, the script co-written by RZA himself, as well as Eli Roth (Tarantino's protégé) is rather weak. Surprisingly RZA (only one of the best DJ's/lyricist alive) can't write dialogue to save his life. And while Roth has never been a master of the spoken word himself, it becomes all too obvious between which lines of dialogue RZA has written and which are insertions from Roth, when a character goes on a stiff 5 minute rant that ends with a rather Tarantino-esque one-liner. As for the story itself, the problem lies in that it becomes overly cramped with stupid subplots. Every time the story begins to head in a finite direction, RZA does his damnedest to add another idiotic twist, or have the character cease all action in order to spout out one more bit of needless exposition, complicating matters for an audience that was barely on board to begin with.<br><br>RZA is no director: Sometimes a filmmaker can get away with gratuitous violence because it is intricate to the story (or sometimes simply on pedigree alone). But when your story hangs on by a thread and your directing is suspect, the sporadic occurrence of intense brutality doesn't so much come off as shocking, as much as it adds to the clunkiness of the film. Now, RZA does use some stylized camera techniques that obtain a semblance of that cool-factor he is looking for, but yet again, problems arise when he uses them in excess.<br><br>RZA is no actor: Maybe the least important aspect of a grindhouse film like this is the acting, although there is something to be said for a self controlled actor who knows how to overact. In saying that, every scene with RZA, is almost comically stunted by his inability to hold his own around A and B-list actors and actresses. His own character must run the gambit of emotions here, from anger, to sorrow, to a man who is in severe anguish. So, if anything, his own script asks too much of him.<br><br>Something good: If you try hard enough, you can probably find something good to say about any moviewell, maybe except for \"Grown Ups\". In the case of \"The Man with the Iron Fists\"umwellthe soundtrack is good (although, at times ridiculously misused) but this is to be expected since music is what RZA does (NOT DIRECTING). Final Thought: I do realize the intention of a film like \"The Man with the Iron Fists\" is to champion a hardy slathering of over-the-topness, but that doesn't change the fact that this is quietly one of the worst directed films of the year. At times it's so bad that one would wonder how Quentin Tarantino thought it was a good idea to financially back this project at all. But on the other hand, it wouldn't shock me if it were to come to light that Tarantino had given RZA the money, called up a few of his actor buddies, and told Eli Roth to make his script readable, as a repayment for RZA's work on the Kill Bill soundtracks. <br><br>Written by Markus Robinson, Edited by Nicole I. Ashland<br><br>Follow me on Twitter @moviesmarkus","user":"ghost_dog86","rank":[144,215]}]