[{"title":"A man out of options, who refuses to notice","rating":8,"date":"25 May 2010","review":"This Hollywood movie might have worked better as a rough-hewn indie picture with more particularized locations and more unexpected faces, but it has two big things to recommend it: the writing, and a wonderful performance by Michael Douglas as the titular loner, a fallen used car magnate, a seducer of young women and a man near sixty who's run out of options. Douglas wears this charming sleazebag's skin with breathtaking ease. The settings don't really matter too much (they're pretty generic), and the excellent cast, which includes Susan Sarandon, Sarah Louise Parker, Danny De Vito, and Jesse Eisenberg, is a little too familiar. But none of that matters because Douglas is so good. The noirish aspects of the story creep up on you very gradually, and you go from not caring about the protagonist to caring just when you know you should have long given up on him. This is the writing and Douglas's performance working together to create a man who is reprehensible in interesting and perhaps universal ways.<br><br>Ben Kalmen is a wise guy who needs to learn a lesson. You would think he had already learned a big one. He was a car dealer in the Tri-State area so successful he was once on the cover of Forbes Magazine. Then he ran a scam against the car companies, taking profits from cars he hadn't sold. He was arrested, he squandered a fortune defending himself, he paid a huge fine and all but went to jail. He is disgraced. All of his powerful friends have abandoned him. He is also broke and divorced. Six years ago as we see in a preview sequence, his doctor found heart irregularities that might be dangerous and wanted to have tests run. Ben ran from that instead -- to bars where he began picking up and bedding young women in an effort to cheat time and mother nature. This is a game that has worn thin, but he isn't prepared to give it up.<br><br>When the action begins he's pushed by his very wealthy girlfriend Jordan (Parker) to take her daughter Allyson (Imogen Poots) up to his alma mater for an admissions interview. He has given a lot of money to the school in the past and still has influence with the dean. He doesn't want to go, but he goes. Allyson doesn't want him to come, but he comes. There's mention of her having had a drinking problem. She puts on a great pose of sophistication and independence. And then over the weekend he gets her drunk and seduces her. He also makes friends with a sophomore, Daniel Cheston, whom he calls Cheston (Eisenberg). With both young people Ben indulges a penchant for playing the worldly-wise sex adviser. He tells Allyson how to get her young men to satisfy her sexually (that's how he begins his seduction) and he tells Cheston how to get a girl. Later he betrays Cheston's trust.<br><br>Once Ben sleeps with Alllyson on that trip, bad things happen, very bad things. His attempt to overcome doubts in high places and start a new car dealership is gradually shot down. He can't even get a job as a car salesman. He is behind in his rent; he borrows money from his serious daughter Susan (Jenna Fischer). He runs out of money and goes to his old college friend Jimmy (De Vito) for help. The wrath of his girlfriend Jordan turns out to be very dangerous.<br><br>Douglas' role as Ben Kalman touches on aspects of his Gordon Gecko of Wall Street and Grady Tripp of Wonder Boys, which is to say he is well cast, not that this is a repetition of those roles or performances. Ben is as lacking in a sense of human values as Gecko, and his life is in as much disarray as Tripp's. Some find Ben much more shocking than either. So much the better. Douglas takes on this role fearlessly and it leads him along familiar trajectories into a new place. Ben is a human being. He is a man more adept at the material than the moral who's dealing with his fears the best way he can. He is short on wisdom but not on bravery. His grandson adores him. Like the dad in the indie surprise flick Daddy Longlegs, he is the dangerous, unreliable adult who is magical and fun. He is the man young adults may need along the way for inspiration and then must discard when they realize some essential parts of the picture, the consistent set of values, was lacking.<br><br>Douglas' thrusting intonations here become the embodiment of the (once) successful car salesman. Ben is selling a materialist and sensualist's program for defying time. Perhaps not enough time goes in the film to establishing Ben's former good side. It's a little hard to understand how his ex-wife Nancy (Sarandon) can remain so understanding, not to mention his daughter Susan's rallying when she has once given up on him. De Vito's still-loyal old friend is an idealized and simplistic figure. And yes, it would be better if Douglas, too, were not so familiar to us. But the movie still succeeds in concocting a man and a situation that have much that are fresh about them. Ben is a wonderfully complex creation, charismatic and charming and sexy and yet very clearly also a jerk. And in playing him, Michael Douglas shows himself once again to be a very good and very brave actor, for more so than people tend to realize. Koppelman and Leviean have written for Steven Soderbergh, who co-produced; Leviean was the writer here, and his collaborating on the directing seems to have worked well for the coherence of this well-made film.","user":"Chris Knipp","rank":[43,51]},{"title":"Solitary Man shows Michael Douglas at his very (aging) best","rating":9,"date":"8 July 2010","review":"At 65 years old, Michael Douglas can still command the movie screen. In recent years, his choice of parts has looked somewhat desperate to me. Solitary Man got little publicity and is playing largely art houses around the country. And it is quite a film. It is very much Douglas at his aging best. His character is true to the Neil Diamond song by the same name, a version of which is sung (badly) over the opening credits.<br><br>Featuring an all-star ensemble cast, Solitary Man centers on Ben Kalmen (Douglas), a formerly rich, highly-successful \"honest\" New York car dealer who pulled off a Bernie Madoff-level scam, got caught, prosecuted, and lost all of his money and most of his respect in the ensuing years-long legal battle. He did avoid jail, however. The movie opens before the scandal and 6 ½ years before the current day, with the always-cocky Ben (think Tom Sanders in Disclosure) going in for his annual physical. His long-time doctor \"doesn't like his EKG\" and orders major diagnostic tests for him. Flash forward to now.<br><br>Ben is divorced from his wife, Nancy (Susan Sarandon in a luscious cameo); living with a rich younger woman, Jordan (Mary-Louise Parker) and her daughter, Allyson, (the very talented Imogen Poots); trying to get a new car dealership approved by the local city council; and chasing women successfully all over the Boroughs. This 60+-year-old has all the moves, and they still work on younger women. He hops from bed to bed while milking his live-in and trying to re-capture the success he exudes from every pore but without the money or the friends he once had. Ben is living a nightmare. He is trying to bury the images with meaningless sex and a carefree, live-for-the-moment attitude that is vaguely reminiscent of his roles in films like Wall Street, A Perfect Murder and Wonder Boys.<br><br>When Jordan gets ill, she commands Ben to take Allyson to her college interview at Ben's alma mater, where he has been a major donor with his name on the library and everything. Here, the film hits its stride. Ben doesn't want to be there but the memories flood back, including those of his first meeting with Nancy. He leaves Allyson to do what she wants while he befriends a young college student (played by Adventureland's Jesse Eisenberg), becoming a mentor in the process. He also gets reacquainted with his college buddy, Jimmy Merino (Danny DeVito with whom Douglas has done countless films and with whom he roomed as a young thespian), an underachieving good guy who never left the college town and who owns a small café near campus. The very best moments involve Ben and Allyson; don't miss them.<br><br>Let's just say the story evolves from here with Ben's life spiraling downhill, all of his own doing. Nothing has been the same since the day his doctor told him he might have a serious heart problem. Everything came up smelling like roses until then and it's been all smelly fertilizer since. Even his only good relationship - with his married daughter, Susan, who loves her dad, listens to his problems and helps where she can – begins to decay. Played by The Office's Jenna Fischer in a performance that was a revelation, Susan doesn't hold any grudge about the divorce or dad's highly publicized fall. But he even does her wrong.<br><br>There are several questions the audience wants answered. Can Ben be redeemed? When he hits rock bottom, will anyone be there? Will his heart give way before that? Will he commit suicide, die of natural causes, or be saved? Co-writers Brian Koppelman and David Levien direct their first major movie after having penned films like Rounders, Runaway Jury, and Ocean's Thirteen (all favorites of mine), and they do so with aplomb. This is an exceptional, if depressing, independent film that shows that Douglas can still act, entice, entertain, and engage.","user":"cliffgold-1","rank":[51,62]},{"title":"Michael Douglas at his best - that is, his worst","rating":8,"date":"10 June 2010","review":"Michael Douglas' character is not a nice guy. Things are not going well for this guy at all. He's a pig. And he looks like hell, disheveled, unkempt, unshaven, and -- the worst thing -- OLD! And the best thing is that Douglas lets us see it all -- every year of wear and tear.<br><br>In short, it's one of the best performances of Michael Douglas' career.<br><br>The movie revolves entirely around Douglas' character. I often don't like movies where the main character is unlikable, but there was something about this guy, warts and all, that drew me in. His level of denial? His former success? His ability to love and behave badly simultaneously? True, the supporting cast is great. Susan Sarandon, Danny DeVito, the always wonderful Mary-Louise Parker. But it's also true that they don't have all that much to do. Douglas is in just about every scene. And he pulls it off.<br><br>The one iffy part? The ending. Not the very very end, which I liked, but the place Douglas' character was left. Just a bit of a surprise.<br><br>But see it for yourself. It's worth it.","user":"richard-1967","rank":[47,59]}]