[{"title":"Popular to hate Sandler these days.","rating":6,"date":"30 September 2012","review":"Seems every movie Sandler does these days gets hated on. People saying this is the worst movie ever made in history...really? You people must not have seen many movies. Regardless of what Sandler does the rest of his career its now popular to point out how it sucks and not as funny as his old movies. I enjoyed this movie, laughing out loud several times. Sandler does a great job playing the father. The bachelor party scenes are epic, really feel for the characters. Uncle Vanny? Hilarious. At no point in this movie did I think \"oh man this is the worst thing I've seen in my life.\" Had good feeling, good comedy, a solid entry to Sandlers recent works. Much much better than the one where he played his sister.","user":"GanjiekIMDB","rank":[106,165]},{"title":"It wasn't that bad, I thought it was hilarious!","rating":8,"date":"16 July 2012","review":"I do not see why there are so many people who hate on this movie, It is what it is, Its a comedy movie. In my opinion Sandler is going back to his comedic roots... I mean you cant tell me when he was on SNL and in some of his earlier movies he didn't act stupid, Maybe some of you reviewers are just getting old and don't know comedy anymore when you see it. See people need to stop critiquing a comedy like this based as though it was a movie in another genre. But thats just my opinion, If your looking for something funny I recommend seeing this. But you might need to be a specific age group, 12-36, I guess Sandler is tired of trying to make all you \"old fools\" laugh. Also Andy Samberg was great along with Will Forte and Nick Swardson, even though he only had like 4 lines.","user":"karljohnson7991","rank":[137,229]},{"title":"By far the funniest Adam Sandler movie","rating":10,"date":"14 July 2012","review":"I want to start off by saying I have never been so confused by movie reviews in my entire life. Did people watch the same movie I saw? That's My Boy is the funniest Adam Sandler movie and in my opinion the funniest movie I've ever seen. I did not go longer than 5 minutes without hysterically laughing at the scenes in this movie. As a fan of movies such as Wedding Crashers, Old School, Step Brothers, 21 Jump Street, Superbad, and Forgetting Sarah Marshall just to name a few, this has to be the funniest movie out of the bunch. If you're looking for more than just laughs, than maybe the movie might not be right for you. And do not go into an R rated comedy expecting no dirty jokes. This is Adam Sandler at his raunchiest and funniest.","user":"gs7103","rank":[199,353]}]