[{"title":"\"The first rule of remakes: don't f*** with the original\"","rating":8,"date":"13 April 2011","review":"I literally just came back from a midnight screening of this and I had an amazing time. Craven's managed to reclaim the franchise with a worthy instalment that's a fantastic sequel as well as a quality slasher film in its own right. Honestly speaking, there aren't too many surprises to be had in Scream 4. No matter how mordantly self-aware the movies are (and believe me, Scream 4 gets a little tediously indulgent in its postmodern cleverness), there's an inevitable predictability to some of the proceedings but anybody who's a genre-savvy horror fan will appreciate how brilliantly everything is executed. The opening sequences, for example, are one of the best parts of the movie and are a perfect reintroduction to the franchise and while the bulk of the story lags a little, it's redeemed by the ballsy ending.<br><br>The acting is great with the core trio (Campbell, Arquette and Cox) delivering their usual, strong performances and the rest of the cast, however limited their respective roles, are just as entertaining. All you TV buffs there will get a kick out of seeing actors from Heroes, Veronica Mars, True Blood, Mad Men and Community share the silver screen and camp it up. More importantly, the film is hilarious and just a whole lot of ridiculous fun. Craven isn't afraid to take the story to some beautifully insane places and the ending was, to me, perfect. <br><br>All in all, it's a great, irreverent slice of horror that's hilarious and true to the franchise. Highly recommended.","user":"polarcola","rank":[179,247]},{"title":"Best Scream Sequel","rating":8,"date":"10 May 2017","review":"This is much better then most horror sequels. This film has moments that \"Scream\" fans will get a huge kick out of. The story does go a little too crazy however at the end. It does perform as an excellent chapter in the \"Scream Series\". If you have never seen a \"Scream\" film that is okay. This film works on its own and you do not have too know anything of the previous films.<br><br>In this film On the fifteenth anniversary of the original Woodsboro murders, high school students Jenny Randall and Marnie Cooper are attacked and brutally murdered by a new Ghostface.<br><br>The following day, Sidney Prescott returns to Woodsboro to promote her new book, Out of Darkness, with her publicist Rebecca Walters. After evidence is found in Sidney's rental car, Sidney becomes a suspect in the murders and must stay in town until the murders are solved. Sidney's teenage cousin Jill, who is dealing with the betrayal of her ex-boyfriend, Trevor Sheldon, gets a threatening phone call from Ghostface. She and her friends Olivia Morris and Kirby Reed, are questioned about their calls by Dewey Riley, who is now the sheriff of the town, while one of his deputies, Judy Hicks, assists him in the case. Meanwhile, Dewey's wife, Gale Weathers- Riley, is struggling with writer's block. She gives up the writing and decides to investigate the murder instead. <br><br>This film was so good I ended up buying it. Now if your looking for something knew in this film then you will be so disappointed. If you want to see a film that will scare you then RENT THIS. <br><br>I hope one day we will get a \"Scream 5\"","user":"Sober-Friend","rank":[25,31]},{"title":"Very good, especially for die-hard fans","rating":7,"date":"27 March 2011","review":"THIS REVIEW IS SPOILER FREE: READ ON FOR MY REVIEW ON SCREAM 4 (2011) I was pleasantly surprised. This was a great movie, especially for fans of the original. It makes up for the awfulness of Scream 3, and includes many very talented new actors and actresses. I was very surprised to walk into the screening theater and see a fantastic horror film. As soon as the Dimension logo appeared on screen, my heart began to race. The opening scene was brutal and hilarious, and it was great to see all of the original characters back on the screen again. I found the Wes Craven cameo, and was laughing as I spotted it out. This movie was great to watch, even though there were some things that needed to be fixed. Very minor problems though. There were some parts in the dialogue that seemed unrealistic (Ehren Kruger re-writes), but it wasn't a huge deal. Also, the ending was kinda long, but it was also very suspenseful. I would most definitely recommend this to a friend in search of a good horror movie.","user":"MatthewKerr","rank":[223,338]}]