[{"title":"Great","rating":8,"date":"21 February 2020","review":"A true best of both worlds for classic Disney and classic Pixar fans. It had already been many years since the acquisition, but for me this was the first time Disney's buyout felt like a positive direction for the animation pioneers. Filled with possibly Pixar's most attractive environments, character designs (Side note: Merida has my favorite character design of any animated human character. I mean seriously her hair alone is a thing of beauty.), and easily its best score, the studio does a deft send up of classic princess movies while instilling the pure feeling of magic they are known for though Scotland's rich Celtic lore and cryptic mysticism. Brave is a criminally underrated installment in the Pixar cannon that I hope grows in stature over the years. If Wreck It Ralph is Disney doing Pixar, Brave is Pixar doing Disney.","user":"MR_Heraclius","rank":[38,39]},{"title":"Disappointed","rating":1,"date":"13 July 2012","review":"I love The Incredibles, Up, Shrek, Toy Story, Monsters Inc., Despicable Me and Megeaman. I thought I was going to see something that amazing, but with a female protagonist. But no. It was the same old Disney princess movie: a princess having problems about who she is or is not going to marry. We saw that in Snow White, Seeping Beauty, Cinderella, The Little Mermaid. Apparently, that all females ever do: fret about who they are going to marry.<br><br>Spoiler alert.<br><br>The movie starts out great: funny characters, great scenery, Scottish accents, and a promising protagonist. I'm sucked in and expecting something amazing and interesting, like the other Pixar movies. Then, of course, since it is the Dark Ages (and Disney, not \"really\" Pixar), the hand of the princess will be the prize in a contest. Been there, done that. Of course she doesn't want that, so she runs away and finds a witch and asks the witch to change her . . . her . . . fate? Like the trailers said? No. She wants to change her MOM. The princess does not want to grow and mature, she want's mom to quit bugging her. Mom has done everything she can to give the princess a wonderful life and educate and prepare her for a life of queen-ship. But that's not what the princess wants. The princess wants – what? She really has no viable alternative. It's not like she can go and get a career. The movie implies that if she gets married, she can't ride her horse or shoot her bow any more. Why not? So they parade out the three husband candidates and of course, even though they are the sons of great chieftains, they are all worthless. Predictable, boring plot. What if one of them was handsome, charming, and a good archer, then she might not have minded getting married and we could have seen the wedding in 3D.<br><br>Back to the witch. Well, the witch only knows ONE spell: change it into a bear. That's a big help. The last person who bucked conformity and wanted to do his own thing, he got changed into a wild, destructive bear too. Is that one of the lessons in this movie? Conform or you will become a wild, destructive, shunned animal? When her mother eats the magic cake and begins to feel sick, all the princess can think about is if she still has to get married. What if the magic cake killed her mom? The princess doesn't seem too worried. Is this one of the lessons of the movie? If your parents are trying to do the very best for you, and it's cramping your style, just drug them to get them off your back. After mom turns into a bear, there was no plot any more. It was just running around like Bugs, Daffy and Elmer in the forest and the castle until it was time for the movie to end. BORING.<br><br>Then there was the big speech the princess gave in the banquet room about \"Can't we all just get along?\" What was that about? Everyone was partying and getting along just fine. Lame.<br><br>So the princess cries and tells mom that she's sorry (of course she is now that everything's a mess), and mom turns back into a person. But who has the character arc? Not the princess. The princess still does not want to get married. MOM is the one who changes, and she had better! After all, she knows that if she leans too hard on her daughter to do what's best, the daughter will drug her. So is that the lesson in the movie? Don't pressure your kids to do what you know is best for them, or they could get punitive. So mom caves in and says the young people can chose by falling in love. There's a ground-breaking moral. News flash: western women have not been getting betrothed for centuries.<br><br>And why did they call the movie \"Brave\". The Princess didn't do anything brave in the whole movie. In fact, she had a hissy fit, ran from her responsibilities, and turned to drugs to solve the problems.<br><br>I don't care if it was 6 years in the making, or how amazing the 3D effects were: the story was a dud.","user":"cjorgensen-3","rank":[160,258]},{"title":"Brave has little Heart","rating":5,"date":"25 June 2012","review":"I knew Brave was in trouble from the first few words spoken in voice over as the film began. Merida (Kelly Macdonald) uses the words \"fate\" and \"destiny\" interchangeably. This muddle is at the heart of the film's problem.<br><br>What's the difference between fate and destiny? Philosophers through the ages have distinguished the two based on choice. Fate is something that happens TO you. Destiny is something that happens BECAUSE of you.<br><br>Fate is at the root of such words as \"fatal\" and \"fatalistic.\" It implies LACK of choice. Philosopher Rollo May says fate is what we are born into, something that cannot be changed and that we have no control over, such as race.<br><br>May says destiny is what we create based on what we were given. Destiny is all about CHOICE. It's what we choose to do with what we have.<br><br>Merida is born a princess. She can't change that. Her mother, Queen Elinor (Emma Thompson), is grooming Merida for a role as future queen. After a long series of wars King Fergus (Billy Connolly) has united the four clans. Merida's duty is to help keep the clans unified though a judicious marriage.<br><br>Merida is a wild rebellious child with special talent as a rider and archer. The demonstrations of her skills are absolutely breathtaking. She is unique and extraordinary and initially looks very much like a Power of Idealism character.<br><br>These kinds of characters are driven by their passion. They abhor what they consider to be a mundane, boring, or mediocre life. They want to seize some grand destiny that is uniquely theirs.<br><br>Well-drawn female protagonists in this vein are: Paikea (Keisha Castle-Hughes) in Whale Rider and Jess Kaur Bhamra (Parminder Nagra) in Bend it Like Beckham. Unlike Paikea or Jess, Merida doesn't fight for what she believes is HER destiny. Merida, instead, decides to change her mother! Perhaps this is because Merida has no clue about what she is really called to do.<br><br>Now the story gets even muddier. With the help of an old witch's spell Merida does indeed change her mother — into a bear.<br><br>Instead of figuring out who she is and what she uniquely is called to do, Merida must again deal with who her mother is. In the struggle over the middle part of Brave, Queen Elinor becomes the protagonist.<br><br>The definition of a protagonist, in my book, is the person who makes the biggest emotional sacrifice in the story. It is the person who undergoes the most profound transformation. This is clearly Elinor on every front.<br><br>Queen Elinor is a Power of Conscience character. She is a strict and demanding taskmaster, a perfectionist, and is driven by a strong sense of tradition and duty. Over the course of the story she recognizes her daughter's uniqueness and fully appreciates Merida for who she is.<br><br>The first important glimpse of Elinor's change of heart is the brawl in the great hall after Merida has disappeared. When Merida strides back into the hall it is Elinor who puts words in Merida's mouth. Elinor speaks through her surrogate about going against tradition and marrying for love. It is Elinor who makes an eloquent plea for choice and following one's heart. Merida is just her passive interpreter. At the end of the film Elinor is willing to sacrifice her own life in a battle with the ancient cursed bear, who one would assume, was the monster who took off her husband's leg. Or not? Who knows?<br><br>Even more confusingly this monster turns out to be the legendary brother, it would seem, who destroyed the ancient kingdom so long ago because of his pride and selfishness. How how did he turn into a bear? Was it mother love or something else that breaks his curse?<br><br>When a legend and curse is set up so carefully it should have a pay-off having to do with Merida or her destiny– if the film is really about Merida.<br><br>And what does Merida do that is so brave? She scurries around looking for the witch's house after her mother turns into a bear. She stitches up (with big clumsy childish stitches) the tapestry she slashed separating her from her mother. She does a lot of running away and running around. She is ineffective in battling the monstrous cursed bear. And she collapses in tears remembering her mother's loving kindness as the second sunrise threatens to make her mother's bear curse permanent. In other words, she acts like a child– or worse a girl.<br><br>At the end of the film, Elinor has changed but not Merida. Merida is the same galloping wild child as she was in the beginning. It is a sinking back into carefree childhood rather than striding toward an adulthood based both on duty and and an individualistic sense of self. If you are a young woman, what is the lesson here?<br><br>Brave offers no alternative vision of how Merida might help unify the clan in some way that is uniquely hers. It provides a very unsatisfying resolution. How has Merida changed or grown? What happens when King Fergus and Queen Elinor are too old to rule? What is Merida's role going forward? What exactly is her destiny?<br><br>For the full review go to my website ETBscreenwriting.","user":"lhh90403","rank":[169,274]}]