[{"title":"A lot better than expected","rating":8,"date":"9 March 2016","review":"I'll be honest, I was dragged to this movie by a girl friend. I was tired of the rom com genre. I had seen it all before. Ill say this, this movie strips away all those clichés and goes in the opposite direction. What a lovely and funny R rated comedy with a lot of heart. There are so many charming moments that I cannot even explain them all. Rebel Wilson does her usual thing but here she perfects it and brings a certain edge to her performance. Its my favorite performance of hers. Dakota Johnson gives the best performance of her young career and Leslie Mann owns her roll. Its her funniest, saddest, and truest performance to date. Yes Im still talking about a raunchy comedy here. There is more to this movie than you might think. The men in the film are actually better written that most clichéd men in romantic comedies. Finally, the ending is just perfect for those single people out there.I advise seeing this with a friend and not with a significant other. **** out of 5 stars.","user":"sammyboo21-999-252517","rank":[104,140]},{"title":"Better than average romantic comedy","rating":8,"date":"23 December 2016","review":"This is a better than average romantic comedy. I gave this one an extra star, because, although it largely followed the rom-com formula, meaning happy endings for most of the characters, it wasn't obvious who was going to end up with who, or otherwise. Rare is the film in this genre that does not telegraph its exact ending at least forty minutes away. Rebel Wilson played to type and was quite amusing. Alison Brie was lovely, and played her neurotic role very well. Dakota Johnson was absolutely adorable. I hope to see more of her in the future. Kudos to Leslie Mann, as well. The New York sets and photography were impressive, and there were no obtrusive directing techniques.","user":"smatysia","rank":[24,34]},{"title":"I expected worse and actually got a good time.","rating":7,"date":"18 April 2016","review":"A mixed cast out of established actors and \"Newcomers\" aka. \"Isn't that the guy from (insert show-name here)\" loosens up the mood and gives the general idea that the movie doesn't take itself too serious. Creative details like glowing numbers on bottles and texts in the air also contribute to this.<br><br>Furthermore, multiple laugh out loud-moments. Which is always a plus!Rebel Wilson is hilarious. Everybody has to agree at least on that.<br><br>Surprisingly not the most stereotypical cheesy wannabe perfect life- ending. A deeper meaning in said ending compliments the movie as a whole, without coming over as forced.<br><br>Of course movies like that always sort of have this fakeness about them. I mean, everybody knows that you could never be able to afford this huge apartment in NYC nor experience a love story like that. But you don't watch these films to get realistic life-reviews. You want to simply look at pretty people partying, doubting existence and having sex. In a not weird way of course. \"How to be single\" will provide you with all three, without making you gag over the silly tackiness.","user":"peachtellsyouwhattowatch","rank":[49,78]}]