[{"title":"There's an Elephant in this Room","rating":14,"date":"14 January 2009","review":"Three Monkeys (2008) **** <br><br>How much would you sacrifice for the people around you? What can you ignore to keep your family together? If you pretend something didn't happen, does it matter that it ever happened in the first place? These are some of the questions that permeate the great Turkish director Nuri Bilge Ceylan's latest film, Three Monkeys.<br><br>Three Monkey's is a grim affair. The film opens as a man drives his car, nodding off, and hits a pedestrian. He's a politician, and knowing what this would do to his career with an upcoming election, he phones his longtime driver in the middle of the night and offers him an proposition. Take his place, and the nine month jail sentence in return for a lump sum. He accepts for the sake of his boss. Never mind that his sacrifice is placed somewhat in vain, considering the politician loses the election anyway.<br><br>While in jail, the man's family deals on their own. His son, Ismail, wants to ask the politician for an advance so they can buy a car. He can do work with the car, but the work is for shady characters according to his mother. He takes the train to visit his father every so often in jail. The mother works in a kitchen and looks to get her son a job that he would never be interested in anyway. She does eventually go to the politician on her son's behalf, it appears, to get an advance. There's a strange tension between the two. He asks her if her husband knows about \"this.\" Does he refer to getting the advance, which the father would never approve of, or is it something else? One day Ismail gets set to take the train to visit his father, and mother is preparing to attend training for work. At the station, Ismail gets sick, and vomits on himself. He returns home to get changed. After a moment he realizes the house is not empty. There's noise coming from the bedroom. He notices cigarettes, and looks through the keyhole in the door. He turns and leaves. His mother is having an affair with the politician we now know, as does he. He waits until he leaves then returns to the house. He confronts his mother, but never admits that he saw them together, just that he knows he was in the house. This is the first in a series of events which are purposely left unspoken. He does return to visit his father, and suspicious, he asks if they have someone new. After a pause, the son replies no. To admit the truth would mean the destruction of the family.<br><br>When the father gets out of jail, he returns home to an emotionally absent wife. We can't really know if she was this way before he left, but it doesn't really matter now. She meets him in a nighty laying on the bed, in a brilliant scene which sees the husband go from loving, to suspicious, to anger, and near misogyny, to desperation. The wife, too, goes through a range of emotions, and at one point seems genuine but for a moment, then falls back into a distant place. Everyone knows what is happening, but no one dares speak it.<br><br>Things spiral more and more into an abyss, until everything has to be at least acknowledged. There are ominous tones throughout Three Monkeys, and they climax in a crucial scene, edited in a particular manner. It involves a meeting between two people in a long take, shot from a distance, that finally cuts to another shot from a distance, but this time from a slightly different angle, and slightly obscured by objects in the foreground. What comes next will require a crucial decision be made by the Father to keep his family together, or maybe there is another way.<br><br>The family had another son who died. We're lead to believe that he drowned from the oft sounds of dripping water, and his appearance in a few surreal scenes involving the son and the father - the boy's body is soaked as he observes his family members lying in bed. These moments have a creepiness, but a sad tenderness. Particularly in one scene as the Father lies in bed, his wife moving in the background. All of a sudden a tiny arm comes up from behind and embraces him. This family must have been a bomb waiting to explode for a long time. They're bleeding pain, but each other is all they have.<br><br>Three Monkey's is about as well a film can be directed. Indeed, Ceylan won the best director prize at the 2008 Cannes Film Festival. The aforementioned scene is just one of many well constructed moments. Ceylan channels Tarkovsky in a few scenes, and his colour palette in particular is reminiscent of Tarkovsky. It's only suitable that a film of such dark subject matter be matched in it's look. Ceylan makes great use of locations, and particularly sounds. After the crucial event in the film, the mother wears a shirt that was certainly chosen for it's pattern, as perhaps a not so subtle accusation. Shots are brilliantly composed to represent the distance felt. That there seems to be only one tender embrace in the film - by the dead son to his father - is profound in retrospect.<br><br>I can't be sure, but I have a feeling that Ceylan drew from somewhere deep inside for this film. It's a film that seems as if it were made by someone who knows all to well how something feels. These kinds of movies are almost never a treat to watch. Luckily Ceylan is a such a good director that things never become unbearable, even when they're at the darkest. It's a dark and painful film, but nevertheless doesn't refuse hold out hope for a better day. They were a whole once. Maybe they can be again.","user":"MacAindrais","rank":[22,24]},{"title":"Dark, stylish, noir thriller is definitely no turkey!","rating":8,"date":"1 March 2009","review":"I can't remember if I've ever seen a Turkish film before, which is a pity, because if Three Monkeys is anything to go by, I have missed some terrific movies.<br><br>This is a dark, stylish, noir thriller which sees a man agreeing to take the rap for his political master who is involved in a car accident. In return for doing time for a crime he did not commit, his boss will continue to pay his salary to his family, and also settle the 'debt' with a lump sum payment when the man is eventually released. While he is in prison, his wife is left to hold the family together and she and her son quickly get caught up in a web of passion and betrayal.<br><br>Director, Nuri Bilge Ceylan carried off the Best Director Award at Cannes for this, his fifth feature, and it's not hard to see why.<br><br>Three Monkeys is is a dark, brooding film, where every shot has been thought through and framed with meticulous detail. Long, intense close ups of the principal characters produces sustained psychological tension as unspoken words seem to fly through the air like knives.<br><br>The principal cast of Three Monkeys; Yavuz Bingöl, Hatice Aslan, Ahmat Rifal Sungar, and Ercan Kesal, are universally good, but top credits should go to Hatice Aslan, the femme fatale of the piece, who has the ability to convey many layers of meaning by saying little and feeling much.<br><br>Highly recommended.","user":"AussieJim","rank":[40,47]},{"title":"Mastery of contemporary, contemplative cinema","rating":8,"date":"27 December 2008","review":"Three Monkeys proved to me that Turkish cinema can rub shoulders with the very best in contemporary cinema.<br><br>It has a certain maturity and mastery of the medium even if it follows the patterns of Tarkovsky, Terrence Mallick and Zvyagintsev, with its ability to externalize the internal feelings of individuals and catapult those feelings in context with the well-chosen exteriorssometimes natural environments and sometimes man-made structures. It's a film that makes the capability of a director and art director stand out even to a village idiot viewing cinema.<br><br>The title of the film does refer to the proverbial three monkeys; one who refuses to hear, one who refuses to see, and one who refuses to speak. It is an interesting contemporary tale revolving around three adults that make up a Turkish urban nuclear family. The husband drives the car of a politician to make a living, the wife works in a kitchen of a large establishment, and their adult son is a student dreaming of owning a car. It is a tale that could take place in Turkey or any other part of the world suggesting that tales of individual angst fall within some external matrix that a viewer can either glimpse or reject as a cosmic play of dice.<br><br>The three \"monkeys\" are a husband, wife and son living a cohesive, stable life. A fourth character is a typical creepy politician whose actions disrupt the tranquil life of the cohesive trio by a chain of lies, deceit, lust and avariceall brought about by the ripple effect of an external request. Here is a tale of three essentially good people who become entwined in actions that threaten to break up their happy but mundane middle-class lives.<br><br>What is the external request that leads to the domino effect on the family? The politician falls asleep while driving a sedan and knocks down an unknown person on a remote road and the incident is noticed by a passing car. To preserve his political chances at the soon-to-be-held elections, he requests his regular driver to take the rap and go to prison for the crime he did not commit, while the politician promises to continue paying his salary and provide a large sum at the completion of his jail term. The first \"monkey\" gets hooked to the suggested plan that he hears.<br><br>The son dreams of a family car that could be acquired with an advance on the politician's final payment to his father and goads his mother to meet the politician with the request. And you soon have two other \"monkeys\" trapped by their own innocent actions that spiral into grievous crimes because they choose not to see, hear or speak. Interestingly, each of the three is essentially a well-meaning, ethical individual. However, the external request of a politician to the head of the family of the trio opens up vistas for three good persons to choose a deviant path they might not have chosen otherwise.<br><br>The filmmakers go on to suggest that the pattern could spillover to upset another sedate life of a good man at the end. Those affected do not seem to learn from history. The cosmic tale carries on like a Shakespearean or Tolstoyan tragedy, even as dark clouds gather over the magical landscape on the coasts of the Marmara Sea (Black Sea) captured with the digital magic of Gokhan Tiryaki (the cinematographer of Ceylan's Climates as well). Are we individuals truly in control of what happens to us in life? This is the implicit question the film asks of the viewer. Do events in our life force us take paths we never would have taken otherwise? Do we learn from our mistakes or prefer to make bigger mistakes like a \"monkey\"? Ironically, the film itself is a product of another familybut this one is incredibly talented. The husband and wife team of Nuri Bilge Ceylan (director, editor, and writer of Three Monkeys, and actor of his earlier films Distant and Climates) and Ebru Ceylan (writer and art director of Three Monkeys, actor of Distant and Climates and an award-winning short-filmmaker) team up with Ercan Kesal (actor in Three Monkeys, playing the politician in the movie) to write up this interesting film.<br><br>The story is only a small part of the film's broad enjoyment spectrum. Take the art direction-the building in which the trio live looks imposing at the start of the movie. Only towards the end of the movie as the lives of the individuals fall apart you see the building has an imposing front but is actually a poor tenement with a fabulous view. The railroad becomes a flight path to freedom from the drudgery of the house, but tenants of the house need to cross physical (symbolic) barriers to reach the station. Interestingly, the head (and face) of the son poking out of the train form the poster of the film a shot that is repeated with differing expressions as the film progresses.<br><br>In this film, the husband-wife team of the Ceylans stays behind the camera. They introduce a TV actor Hatice Aslan who plays Hacer, the mother/wife role in the film. The performance is nothing short of spectacular. The sudden action of kicking up of her shoes while sitting and breaking into smiles of freedom is unforgettable; the true implications of the scene revealed to the viewer only much later.<br><br>Turkish cinema has thrown up great filmmakers. Yilmaz Guney was my favorite Turkish filmmaker from that country. Now I have added Ceylan (and his talented wife) to that list. Guney took up subjects that mirrored politics and got into trouble for that. Ceylan appears to be apolitical except for his dark universal swipe at politicians as a tribe. Or is he?","user":"JuguAbraham","rank":[66,90]}]