[{"title":"A lot more than just a standard biopic","rating":8,"date":"6 October 2018","review":"This is my interepretation of a film I wasn't ready to love. Boy, was I wrong.<br><br>Based on the book \"First Man: The Life of Neil A. Armstrong\" by James R. Hansen, director Damien Chazelle and writer Josh Singer took the chronicle of an American triumph and emphasised on the personal story behind it. Through Armstrong's stance, the film makes a clear point: Determination, struggle, sacrifice and most of all failure are key ingredients to someone's eventual success. But in order to achieve success you've got to risk everything, albeit success is never guaranteed.<br><br>In one scene, Janet Armstrong (excellently played by Claire Foy) claims that she only wanted to lead an ordinary life with her husband. On the contrary, Neil has made a clear choice: He will try to accomplish his great mission, knowing that it is quite possible his kids will never see their father again.<br><br>Whenever signs of arrogance, conceit and complacency are shown, they are an omen of failure. On the other hand, Armstrong's attitude is the epitome of how success is to be achieved. He is quite commited to his mission and never behaves immaturely when it comes to it. He is focused on his goal. Family and social life, well that's another story (we often see that Armstrong is incapable of communicating or expressing his feelings to his dearest ones).<br><br>Portraying such an introvert character, Gosling has a sole major moment to shine, in a very important scene which proves to be pivotal in terms of what the movie tries to communicate: USA went to the moon to win the Cold War, while Armstrong, after being marked by tragedy, went to the moon in order to find peace (and by the time his daughter's old memento reappears, we assume he has found some). The film is about him; it doesn't care that much about the US agenda. In fact, I thought that it only showed subtle contempt towards the nationalistic celebrations and the passionate political speeches aimed at boosting the spirit of the American people.<br><br>Moreover, First Man is one of those biopics where you know what is about to happen, but can't help but get caught up in the rising suspense of its great scenes. At their most exciting, these scenes reach a very satisfying climax, rewarding the audience's patience. Directing and cinematography deserve every accolade they have gotten so far.","user":"dirty_chords","rank":[437,592]},{"title":"Thru the eyes of the first man","rating":9,"date":"20 October 2018","review":"I now laugh when I reread some of the negative reviews - to summarize: it made me have motion sickness so I left, didn't develop the orher characters enough, too somber and brooding, didn't cover all of the events of Niel Armstrongs career, etc. Well, most of these individuals missed the point of the movie or don't understand this genre of storytelling. It is a first person account basically told through the eyes of the first person to walk on the moon. I found this refreshing and not your typical Hollywood approach of trying to fit too much, too thinly for such an epic sweeping story that covers decades and dozen of key figures. It could have been 3-3.5 hours long. Yes, it could have been a TV mini-series or two (or more) movies. I love that it was told through the eyes of one central figure. Told through the eyes of the man that all of the accumulated effort of thousands of people and billions of dollars spent to accomplish one goal before the Soviets and for humankind - having a human step foot on the moon for the first time. I cannot remember a cinematic experience that got me as close to experiencing what it was truly like to be there first hand, in the drivers seat if you will, or better put, insabely strapped into a coffin fixed atop a massive liquid fuel explosion. How any person would be brave enough to face this, be able to perform well while in the thick of it and want to do it again and again is beyond words (or sanity). With death and fear all around no wonder there was a dark cloud hanging over everyone. I am sure all of us have marvelled at what has been accomplished by the NASA space missions especially Apollo. The movie Apollo 13 was a very good story that I thought put me as close to being an Astronaut as i could get. I was wrong. So, go and see First Man. Go and let yourself become THE astronaut. THE first human that was there at the very top of a giant pyramid of people because many before had made the ultimate sacrifice to make possible one giant leap for mankind. i will never look at another manned space vehicle, past or present, or astronaut again the same way,","user":"daniel-dippel","rank":[424,589]},{"title":"It felt genuine but left me bored","rating":6,"date":"14 October 2018","review":"The attempt to make it all feel dated and real worked well. There were no glossy space scenes. Add some interesting sounds and a lot of shakes can and the overal scene approach works. <br><br>But then there is the story. We all know what happens. So it was just about the angle they approached it at. Unfortunately they picked the boring angle. <br><br>The struggle with grieving was irritating. The lack of substance in the characters was disappointing. The frame was non existent. The length too long. The outcome underwhelming. The ending an anti climatic relief. <br><br>I will remember this film for the dirty toilets, great acting and my repeated checking of my watch. If you want to learn a tiny bit then watch it. But it is sadly no masterpiece. Let down but the story telling...<br><br>Recommend? Yes. On a Sunday...","user":"fallyhag","rank":[512,753]}]