[{"title":"Heartbreaking last film...","rating":7,"date":"8 September 2014","review":"The Angriest Man In Brooklyn isn't the most perfect film. A slight copycat on the amazing Stranger Than Fiction, but not as gripping or funny!<br><br>That said, considering what the late great Robin Williams goes through as his character, one can only watch in sadness and with tear-filled eyes in thinking that his passionately delivered dialogue really came from the heart as a cry for help.<br><br>It is only with this unfortunate event, that you watch TAMIB with a completely different view.<br><br>As a film, it passes the time and makes you think about life. It has entertaining moments, some laughs and some great performances. Its simple and worth a watch.<br><br>We miss you Robin Williams.","user":"Movie-Misfit","rank":[42,47]},{"title":"The right Demographic will love this move, as i did .","rating":7,"date":"25 June 2014","review":"So.... the demographic for this movie is adult , probably over forty, has had to deal with ungrateful kids. works a grinding job they do not love, to support a family that has taken them for granted. <br><br>If you fit any of that , this movie will entertain the crap out of you. <br><br>I read the reviews , was not expecting much , i picked it because i am kinda angry most of the time... from said above. <br><br>I laughed at the opening scene. and the next scene. i identified with both of the lead characters. <br><br>overall, really, this movie is a roller coaster of emotion. If you get into it , it will make you laugh , and cry , it will make you hug your other and the rotten kids <br><br>I found it amazingly entertaining, even the end .<br><br>It is hard to write a review without spoilers , so all i really want to say is -- don't listen to the reviews on IMDb re; this movie. I don't know how this site attracts so many sour lemons, but thats the best way to describe these reviews. sour lemons. <br><br>At first mila was annoying but that was the character, and she warms up. by the end you will be loving her. <br><br>I don't know how anyone who watched this could call robins character boring, not that he needed to , but robin really carried this movie. from start to finish he fills the screen with unadulterated robin. in character form for the movie. he was great , and his brother , it was great acting . <br><br>Very enjoyable . very moving . very funny.","user":"thepotatoHasEyes","rank":[90,108]},{"title":"Mixed emotions about this one","rating":6,"date":"7 April 2015","review":"I wish I would have seen this before Robin died. I think a lot of my feelings about this movie were colored by his untimely death. I tried very hard to watch it with an open mind, looking at it from the perspective that he was still alive. I failed miserably. <br><br>The concept of the movie was an interesting take on an old question: what would you do if you knew you only had so much time to live? This put a whole new spin on the question, but the outcome was relatively the same. <br><br>The cast was an unusual choice, in my opinion. Robin Williams was well known for being able to play a wide array of characters, from the brilliantly funny to the downright broken. This character was oddly complex. But again, maybe that's just me reading into it because of Robin's death. <br><br>Ironically, one of the funniest scenes in the movie is the last scene, in which Robin's character is absent. In all, it was a fairly good movie that made me laugh and cry, and not necessarily at the points where you're supposed to laugh or cry. And it really made me miss the genius actor even more.","user":"BlackRoseShelli","rank":[9,9]}]