[{"title":"Original, Interesting, Intelligent...in a word...Excellent","rating":9,"date":"9 November 2010","review":"This drama is about three lonely people each living in different countries whose lives become indelibly connected in an unforseeable, yet touching way. The story centers on Matt Damon, an American, who apparently has the psychic ability of contacting the recently departed, however, he believes that this \"gift\" is a \"curse\" because it renders him a social outcast. There is also a French woman who has a near death experience and a troubled British boy grieving over the loss of a loved one.<br><br>I am not a firm believer in a hereafter life or psychic abilities, and what is great about this movie is that it addresses these issues in an intelligent way without asking the audience to debate their existence. Instead, it focuses on the characters and how these issues affect their lives. There is nothing cheap or gimmicky about this movie. It simply tells a touching story without being overly sentimental. Clint Eastwood delivers a great picture and Matt Damon an excellent performance. The round-out cast deserves a big-hand as well. Keep in mind that this is a character drama and, like cooking a good sauce, takes its time to develop a richness. So if you're the type of person who only responds to immediate sensory gratification, this movie might not be for you.","user":"Shoshobe","rank":[152,201]},{"title":"If we are Here now, we need an After","rating":9,"date":"22 October 2010","review":"On the way home from seeing this terrific movie, I stopped at a light, a few cars in front waiting to turn right. Around us, the sun had just set, a full white moon was high and the reflections of brake lights bounced off gas stations and car dealerships.<br><br>What an amazing world we live in. There is so much in the five miles between my house and the theater where I saw the movie that I could never experience it all. Moments arrive and disappear and the the people shift, move, appear and disappear.<br><br>I think most of us need some kind of assurance that it all goes on forever, that our open windows aren't just blacked over and sealed at death.<br><br>Clint Eastwood has made a quiet, reflective, thoughtful film on this condition, this need for forever. It's not a flashy paranormal probe of ghosts and goblins, spirits and such.<br><br>Taking three central lives we see our need for a hereafter from a French woman who has experienced something before being revived, from a twin boy who has lost his brother and from a lonely man who seems able to capture something from beyond this life. Or perhaps he just captures something from those who come to him.<br><br>Cecile De France is stunning as a television reporter who touches her own death and returns. Frankie (or is it George) McLaren is good as the young boy. And Matt Damon's restrained performance is a revelation.<br><br>Eastwood has the assured hand that allows long segments in French with English subtitles and a juncture with two disasters and such a touchy-feely subject, and yet it works. Quietly. Thoughtfully.<br><br>He also has the good sense to let us draw our own conclusions.","user":"bobt145","rank":[273,377]},{"title":"Death and Clint Eastwood","rating":7,"date":"2 April 2011","review":"Hereafter is a slow, quiet study on the effect that death and the dearly departed have on the living.&nbsp;<br><br>It's not really a ghost story or even a very supernatural movie. The three main characters each have felt death's power in different ways in their life. George (Matt Damon), a man who can contact the deceased, has fled from his abilities because they keep him from having a normal life. Marie (Cecile de France) is a journalist who has a near-death experience during a tsunami, and becomes consumed with understanding what she saw. And in London, a young British boy is desperate to contact a lost family member one last time.&nbsp;<br><br>The three separate stories do eventually connect, but that's not really where the value of Hereafter lies. I can see this film being a source of frustration for some viewers eager for a traditional conflict and resolution or character arc, but those things aren't really Eastwood's priority.The movie doesn't have much of a \"point\", other than how death is such an important part of all of our lives, even as it's also probably the most mysterious.&nbsp;<br><br>I liked it, but I'm hesitant in recommending it. Slow-paced movies like these need the right audience. It's fairly different from Eastwood's other movies, and I wouldn't mind seeing him tackle something like this, again.","user":"lewiskendell","rank":[63,83]}]