[{"title":"Why laugh? Why not?","rating":8,"date":"14 November 2011","review":"I don't know why, but I seriously can't help but laugh at the Harold and Kumar movies. They're so over the top and silly that you can't help but laugh. The first adventure we went on with them, they just had the munchies and needed some White Castle. The second adventure was to get the loves of their lives back and end up going to Guantanamo Bay. Now, we get to celebrate the joyful holiday of Christmas with them. I admit that when I saw the trailer for this one, it didn't make me laugh too much. I wasn't sure if this was going to have the same kick as the previous films had, but A Very Harold and Kumar Christmas not only delivered in the laughs but was actually a very good movie that in it's own crude way was a touching story about how friends can grow apart but reunite by the weirdest situations.<br><br>Harold is now a successful businessman who works at a popular company while Kumar is still living the life of a stoner handling a bad break up with Vanessa. At Maria's Christmas party, Harold meets Maria's father. He explains to Harold that he never had a perfect Christmas and he is counting on Harold to make this one the best for his daughter, Harold's wife Maria. Maria's father also brings to Harold's house the perfect Christmas tree. When a package addressed to Harold arrives at Kumar's apartment, he decides to deliver it to Harold. The package turns out to be a large marijuana joint that Kumar cannot resist smoking. Since Harold has gotten married and does not get high anymore, he knocks the lit joint out of Kumar's hands and it lands in the tree and causing a fire. So now Harold and Kumar are on a new adventure to get the tree back before the family returns.<br><br>I know that the situations were out of control. We have some dark jokes with a child taking every extreme drug known to man, we have Neil Patrick Harris on the verge of raping a woman. I know I should have been disturbed technically, but why not just have a good time and remind yourself that this is just a movie? I thought Neil Patrick Harris was just too funny as usual when the boys ask him where he's been and that he got shot and branded a hooker, he replies with \"can you be more specific?\", I almost died laughing. I loved the creepy waffle making robot that Kumar had, how it actually loved Kumar and saved his life. But the moment that really got to me was seeing the kid who was on every crazy drug running around on the ceiling, it was so out there that I just had to laugh.<br><br>Like I said, there are some very extreme jokes that a lot of people will take offense too easily. There is a moment where Neil Patrick Harris is talking about Heaven and I know that if you have strong religious beliefs, you're not going to like that scene. Though I don' know why then you are seeing a Harold and Kumar movie since they're not listed in the tactful department. But what I really liked about this story is that it showed their softer side, Harold is growing up and Kumar wants to stay the same as a stoner who is just cruising through life, we all have friends like that and it's hard to keep in touch when you're on different paths. I loved seeing them remember what's important, that it's OK to let go a little bit or that it's OK to grow up. I would recommend this for the fans, it's a great follow up to our favorite stoners. If you're looking for a good laugh, I think you're in for a treat, Harold and Kumar do not disappoint.<br><br>8/10","user":"Smells_Like_Cheese","rank":[56,66]},{"title":"It's goes back to it's roots of being simple but fun","rating":7,"date":"6 January 2012","review":"What started as a simple stoner trip comedy, becomes something that pushes the limit with every installment. And that is the case with this 3rd one, most of the humor comes from that is so messed up that it's funny...Well for some viewers at least although it can offend the others. While some movies the 3D is not worth it, this is one of those movie that has to be seen in 3D if your going to watch it. And for the most part the 3D is worth it and it actually plays a crucial part in the movie since the plot brings out and gives 3D scenarios. If you don't see it in 3D it can be a bit confusing cause you might not get some of the jokes. Anyways if you liked stoner comedies and comedies that pushes the limits this movie might be worth checking out. The movie had one special ingredient that made this movie better than the second one and that is the simple but fun aspect. Although Harold and Kumar is not in college anymore and is now full adults, I wouldn't mind another sequel.<br><br>7.3/10","user":"KineticSeoul","rank":[25,32]},{"title":"A Very Funny Harold & Kumar 3D Movie","rating":4,"date":"4 November 2011","review":"A Very Harold &amp; Kumar 3D Christmas is not going to surprise anyone. It follows the same successful formula and chemistry between John Cho and Kal Penn as the first two. The film also is rude, inappropriate and has questionable taste just like the first two. So while the basic concept is the same, it has been plugged into a Christmas setting making fun of the holiday and managing to shoot Santa Claus in the face in the process. Damn it's funny! I'm not big on buddy comedies but behind closed doors I secretly love Harold &amp; Kumar. White Castle was funny, Guantanamo Bay was even funnier taking on the issue of race and national security, and 3D Christmas is poking fun at religion and holidays. Because many may be afraid of being ridiculed for touching sacred subjects and therefore don't, Harold &amp; Kumar movies repeatedly take on the challenge and find something original to laugh about. Sure making a baby high, John having his penis stuck to a metal frozen pole, and poking fun at the Catholic sex scandals may be inappropriate to some, but everything's fair in comedy and what the filmmakers have done will make you laugh over and over. So while much of the film may be ridiculously over the top, it all works. And while we don't see enough of Bobby Lee in the film who seems to be able to make you laugh without doing much, we do get Neil Patrick Harris playing himself as a closeted heterosexual. That scene is not just really funny throughout, but it steals the show. His scene is nothing short of a \"must see\" moment that is destined to be classic.","user":"AsianTalentHollywood","rank":[20,25]}]