[{"title":"In the tradition of The Haunting","rating":21,"date":"21 October 2011","review":"That feeling on the back of your neck when you're in the house utterly alone, and it's completely silent<br><br>except for <br><br>that !<br><br>That's how this movie builds on you. It doesn't use gobs of red Karo syrup, and no one flies backward on a wire in front of a green screen. It instead plays on your childhood fears when real things go bump. <br><br>The house in which the story unfolds is a character unto itself - beautiful and creepy and very well photographed throughout.<br><br>A fun and refreshing ghost story, give it a tumble.","user":"donaldbryan","rank":[12,13]},{"title":"Different and pretty good","rating":8,"date":"18 February 2012","review":"My wife and I just watched it, and I thought it was quite good. It is certainly somewhat of a \"chick flick\", which probably accounts for many of the negative reviews (I actually don't see why so many guys don't like romantic movies). Now, if you try to make too much sense of it from a rational point of view, then you'll be missing the whole point. On the surface, it's a ghost story, but really it's about a woman struggling to come to terms with the male demons from her past and cast them out. It's kind of like abstract art - it's an emotional piece that amplifies what's inside the viewer. It sort of reminded me of \"What Dreams May Come\", another favorite of mine. I suggest you give it a shot.","user":"gary-schiltz","rank":[14,17]},{"title":"Wonderfully original ghost story","rating":10,"date":"13 April 2011","review":"I recently caught this beautiful film at the Dallas Film Festival. The response of the crowd was certainly different from some of the reviews here. The audience loved the movie, which was evident not only by the response during the movie but during the Q&amp;A after the movie with the director. I went with three other people and while our reaction in some ways was split - two of us loved the opening, which is very quiet, very still and two were not as fond of the opening section as they were the rest of the movie - by the end all of us found the movie very creepy and thought-provoking. Some people in the audience, including one of our group, cried at the end. We all had different interpretations of what was going on. We found the ambiguity in the movie very refreshing. Finally a movie that asks the audience to participate and think! Subsequently I am befuddled by some of the reviews here. I guess some people were expecting a horror movie but the movie is not a horror movie. The director, while noting that the production team has had a hard time labeling the movie, given it is so different from the norm, did call it a Gothic romance. One of my friends thought it was a twisted fairy tale. It certainly is lushly photographed and the score we all thought was incredible. I don't want to give away too much but if you are in the mood for a creepy, tense yet someone romantic twist on a traditional ghost story, and you don't mind being asked to think, this is an excellent film. People always seen to complain about Hollywood making the same type of movies over and over. This definitely is not the same old thing!","user":"sallymom34","rank":[30,42]}]