[{"title":"End of an era... End of our childhoods... End of Harry Potter","rating":15,"date":"15 July 2011","review":"What can I say... This was by far the most amazing finale any fan could have asked for. I cried, I laughed, I was short of breath in many instances, I was disturbed, but overall I was thoroughly satisfied with the conclusion of this series. I felt something amazing after the movie ended, something I didn't feel after reading the book. Being able to watch the end of Harry Potter on the big screen really brought the impact of just how much this series has touched not only my life, but the lives of everyone around me. Deathly Hallows Part 2 is by far (in my opinion) the best movie of 2011 and quite possibly one of the best movies of all time. I don't want to give any spoilers I just want to express how happy I am with this film. It picks up where Part 1 left off, all of the characters get the closure they deserve, and the story just comes full circle!<br><br>BRAVO!!! That is all I have to say. Thank you to everyone involved in these movies for taking the world on such an amazing journey. J.K Rowling, thank you for writing such a masterpiece that will truly live on in my heart, and so many others hearts for years to come.<br><br>Go see this movie!","user":"vila-ddt","rank":[132,164]},{"title":"The series ends on a very strong note.","rating":8,"date":"30 April 2018","review":"The conclusion to the series hits some of the strongest emotional beats, mainly due to our long-standing connection with the characters, and provides some grand visual treats in the form of extended magical battles. While 'Harry Potter And The Deathly Hallows: Part 2 (2011)' may be the biggest in scale and it is entertaining, it does feel lacking in depth - since some things are left oddly unexplained - and instead comes across as an extended third act for its duration. It actually plays out like one long climax, with little of the build-up required to further invest the audience, but at least it's well paced and doesn't hang about. A strong note on which to end a phenomenal series. 8/10","user":"Pjtaylor-96-138044","rank":[23,26]},{"title":"My childhood..","rating":10,"date":"26 December 2015","review":"At the start of J.K. Rowling, thank you for this wonderful series of books forever. I can tell you this current state of my childhood and my future. Sign up everywhere it has always been a part of Harry Potter's name. I'd say the most important series of my life. I owe my childhood such wonderful pass to the books and movies of this series. In this series, even though I know better than the series it has always been a special place for me in this series and it will always continue. This movie is definitely the best in the series. And the players is the most mature film. You feel throughout the film until the end of the final air and this is an amazing thing for fans like me. Book series as well as certainly never did. However, in each film it was pretty cool. And with incredible finale made this film. Harry certainly kept the best for last. Put all the music from the beginning to the end of the movie you are very successful and internal chills. You feel deeply cool is really going on. When the film ended up being a very big gap within you. Of course, you are a part of this world...","user":"hjpog","rank":[57,73]}]