[{"title":"A great look at one of the wildest places on earth.","rating":10,"date":"20 February 2020","review":"Beautiful, stunning, mesmerizing, and plain awesome, African Cats is a wonderful film that will blow people away.","user":"MR_Heraclius","rank":[35,36]},{"title":"Enthralling","rating":10,"date":"23 April 2011","review":"I just returned from seeing this movie today. The struggle for survival of two lion prides a cheetah family are beautifully brought to the big screen with masterful narration by Samuel L. Jackson. The cinematography and soundtrack are spectacular.<br><br>Mara, a young lioness must struggle to survive after the death of her mother and be accepted into the pride. Sita, a mother cheetah, struggles to raise five cubs in a land populated by deadly hyenas. Kali, a powerful lion, and his three grown sons seek to take over Mara's pride.<br><br>The movie is realistic, but not so bloody that anyone but the most sensitive among us should be offended.<br><br>I will definitely be adding this one to my DVD collection.","user":"OmegaWolf747","rank":[26,35]},{"title":"Cats Conquer","rating":6,"date":"6 November 2011","review":"Alastair Fothergill and Keith Scholey bring a charming little documentary set in the Kenyan Savannah. The film has been edited tightly to tell a coherent story and add a more dramatic feel. What sets it apart from watching a documentary on Animal Planet or Discovery Channel is that the viewer does not get the feel that he/she is watching a documentary. It feels like watching a feature film where the lionesses and the cheetahs are the protagonists. It is beautifully shot with stunning cinematography and a brilliant soundtrack with the exception of the Jordinn Sparks track that takes place during the closing credits. But watch the closing credits as it's hilarious seeing how the animals have been credited. Samuel L. Jackson's husky voice excellently narrates the story. It centers around Sita the cheetah and her cubs and Laila the lioness and her daughter Mara. And the presentation of the 'characters' are very well done as the viewer can easily relate to them and root for them. The elements of adventure, suspense and even comedy are brilliantly balanced in this wildlife tale. Given that the title is 'African Cats', I missed seeing the leopard. But anyway, 'African Cats' is overall refreshing, entertaining and heartwarming and a nice reminder of why some of us love animals.","user":"Chrysanthepop","rank":[12,15]}]