[{"title":"Bellflower or The Most Annoying Film of the Year","rating":20,"date":"20 August 2011","review":"I have to be honest here, I am barely ever compelled to come on the web and write a review for a movie with a negative thrust. For one thing, I watch all types of films, even the so-called no budget or low budget films that other people will stay clear from. In fact, just this year, I have seen all the Sundance NEXT films, some at the Sundance premiere in January, and some, like BELLFLOWER, only recently. I feel the need to clear that first, so that I'm not accused of a negative bias for ultra small films. <br><br>I had heard the buzz of BELLFLOWER at Sundance, and I missed it, and my trip to SXSW was too brief to catch, so, I waited patiently for the theatrical. Up until then, I had read many things about the movie, plenty of positive reviews, and was pretty enthralled by the trailer. I should have been a little more cautious on the get go, seeing that even the trailer was a little fishy. You know, it was extremely light on substance, but full of those great pull quotes from the likes of Peter Travers, the king of whoring a few positive lines for maximum effect. And, of course, the reviews themselves were mostly copies of one another, with a great chunk of prose spent on context based stuff like, \"the film cost 17,000\", or \"they made there own camera's\", and even, \"he wrote about his own break-up\". This stuff is mostly about justification and the press angle, so, I'm not going fault the work on that.<br><br>But, lets get to the actual film itself, and how this particular film outright compelled me to come on the web and give my two cents. Basically, the film is in essence, a break up movie. The lead character Woodrow, played here by the director himself is a typical \"disaffected\" young man, who, along with his best friend spends his days drinking, smoking and with the country boy craftsmanship of building \"cool\" stuff. They are seen spending time blowing stuff up at the beginning. Soon, they go out to what I assume is a dive bar, and low and behold, a cricket eating contest (in LA mind you), when we meet our lead female, the narrative conflict of the movie. We see Woodrow and soon to be lady friend Milly engage in eating crickets in slow mo, while a \"cool\" music track plays in the background. This is the essence of the movie. These bits of music video montage scenes are in my mind, the only respectable albeit very thin moments of the film, especially the final moments. They come and go in-between some of the most banal, and base scenes I have seen in years.<br><br>After this, Woodrow picks up Milly for a first date, and she proposes they go and eat at the most disgusting restaurant around, and guess what, Woodrow has a suggestion, but its located in Texas. So, what happens next, shoot, they go to Texas. The film carries on in this vein. I can go on, but even writing about it gets tiresome.<br><br>Anyways, to shorten this up, the relationship heads south, but for no reason other then the fact that Milly tells Woodrow that she is going to hurt him. And then she hurts him. Yup, thats it, because things go bad in relationships, but the audience is left to just assume things happen. The problem is, we are not lead to care any bit about them. All this heartbreak stuff doesn't add up, when you don't buy any of it. The film then continues to jump ahead and behind after an accident. And then things get violent, but in a pretty safe way. The film basically alludes to everything, and always in an extremely swallow, hey look at me mom kind of way. But heck, they built a \"totally sweet ride brah\" . With the finale going straight into film school cope out mode. I won't say anymore, so that I don't spoil the twist.<br><br>As you can tell, I did not like this movie. It felt as cliché as could be. I did not like the characters, all of whom became increasingly annoying. I did not like the writing. I did not like the acting, which goes into B level and below many, many times. And the visual style gets pretty dang boring after awhile. Note to some reviewers; spend some time on Vimeo, or Tumblr, and yeah, you got the visual aesthetic this strives for. Basically, everybody is doing that anyway, and really, swallow depth of field and especially tilt shift is boring when used for no reason other then, \"to look cool\". Which apply describes the hipster culture itself. It yells to be looked at, but on closer inspection, you realize that all its desires are superficial. Thats all it knows.<br><br>And that sums up the film for me. Everything done for effect, and nothing done to strive for a deeper reading. And thats the issue, because its not even entertaining. In fact, its altogether boring, but in the American style of boring, and not in the European, sophisticated, by design way boring. <br><br>I guess maybe its utility is best served as a sort of Hollywood calling card for the troupe, and for that, maybe it succeeds. But for something that I have to pay money to watch, no. And truth be told, if this was for free, I would probably pass as well.","user":"dinoadino","rank":[95,153]},{"title":"A lot of promise that dwindles as it progresses.","rating":5,"date":"29 October 2011","review":"Bellflower is an interesting film because even in it's flaws it kind of speaks to the kind of film that it is. Unfortunately for me though, that doesn't mean crap when the flaws are so blatant and intrusive. The film starts off interestingly, a really in-your-face turn back the clock montage that takes us to the beginning of our characters, two wild twenty-something youths who spend their free time (which it seems is all they have for some untold reason) preparing for their Mad Max vision of the end of the world. In their mind it's perfectly normal to spend their time building flamethrowers and tricking out muscle cars, which is so dumb and idiotic and an absolute perfect depiction of men at this time in their life.<br><br>The first hour takes a relatively standard approach to following these guys, but despite some pretty awful amateur performances and awkwardly obvious pieces of dialogue, it had a certain charm for me. Writer/director/star Evan Glodell gives an aesthetic feeling that was off-putting at first -- the focus falls off every so often, flecks off dirt come up into the lens -- once I settled into it I really began to embrace the tone he was going for. However once the film started to really get a rhythm going it decided to awkwardly jump forward a period of time (you can tell because the main character has a beard now!) it really caves in on itself.<br><br>It was going along smoothly but then decided to move the plot forward into more serious territory and then none of it worked anymore. Those bad performances became worse as the scenes progressed further and further into laughably horrendous melodrama with some of the most obvious and artificial character progressions and dialogue stretches I've seen. The film spirals down and down until it gets to it's last two chunks where I was just hoping they would clip the wings off and stop tarnishing the promise it once showed. There's a disastrous fifteen-minute sequence that felt absolutely worthless even before we find out that it actually is worthless, followed by the final act which just nonsensically rambles on for what seems like an eternity.<br><br>Ultimately, it felt like this was a premise that would have worked great as a short feature, but in stretching it out to something full-length Glodell really destroyed everything he had going for him. Still, despite ultimately being a failure, I think Glodell shows some promise here as a filmmaker and I'll be curious to see what he does next.","user":"Rockwell_Cronenberg","rank":[46,71]},{"title":"Boring","rating":3,"date":"18 November 2011","review":"We saw a few movies at the Seattle film fest and this was the worst of what we saw. I like the premise a lot but the actual story does not live up to its potential. It was directed amateurishly and worse is the cinematography. I know others like this but I don't get it. I thought the acting was weak and over-the-top in some parts. I really wanted to like this film but after 30 minutes I was so bored I couldn't take it. My wife wanted to leave but I gave this movie every chance and stuck it out. For those who think there's some sort of nuclear blast; there is none. There is Apocalypse or anything of the sort - it's just a character study and a boring one at that.","user":"sloppyjoe911","rank":[25,39]}]