[{"title":"Inexplicable","rating":1,"date":"9 July 2013","review":"The nerve! I can't believe it look better on the page. Ben Stiller should know better by now. Or it's just a question of money. Not a moment of real comedy, not one. Vince Vaughn totally out of control in a non-character part. Oscar nominee Jonah Hill, lost. I felt hopeful when Billy Crudup makes his appearance, but the hope was very short lived. Random, inexplicable touches, that include explosions as a form of production value,I presume, but how embarrassing. The script is cheap and opportunistic but also misses its target, completely. Aliens in suburbia could have been a great idea. They needed writers and a director to execute it with some degree of oomph. Awful and depressing.","user":"littlemartinarocena","rank":[48,74]},{"title":"It was fun, a little breath of fresh-air.","rating":8,"date":"16 September 2012","review":"First off, don't read other reviews about this, it will ruin the unexpected plot and you will probably go in with a negative view. Somebody else said that this isn't a cinematic masterpiece and that's pretty much what i agree with, but it wasn't meant to be, it had some refreshing dialogue that wasn't so much punchlines, but funny conversations,the whole movie itself was just funny in general, the plot was ridiculous but at the same time it was really funny because it was just a big joke. The same people who rate this movie down are the same people who go rate down Schwarzenegger films because they have a silly plot, it's not about the plot, it's about hardcore action and silly punchlines, just like this movie is about funny conversations and a fun plot.","user":"finnlife1","rank":[112,191]},{"title":"If you don't like fun then don't see the watch.","rating":6,"date":"19 August 2012","review":"I see a lot of people bashing this film for some reason. Sure it's not some cinematic masterpiece; when I went to see it I wasn't expecting that. \"The Watch\" is a funny buddy comedy, filled with crude jokes and the silly shenanigans that you'd expect from Stiller, Vaughn, the rest of the cast, and writer Seth Rogen. Like a delicious onion the film does a good job peeling away at the story. Yes, it is not hard see the plot coming, but it's how the characters deal with the situations they encounter, that makes the film entertaining. Crybaby critics with their stuck up trendy smugness, \"See, told you the plot was predictable..\" Wow, way to over dramatize the obvious, you're so clever. I bet that \"Titanic\" ending took you by surprise? For all those critics who whine and cry about \"The Watch\" maybe they should just stay home and watch one of their Disney classics on VHS. This is a great film to see, escape the chaotic world and have a few laughs.","user":"pw1111","rank":[152,277]}]