[{"title":"A magical experience!","rating":10,"date":"29 September 2010","review":"Right from seeing the trailer in June, I had extremely high hopes for this movie. What drew me to this film was the animation quality and the animals they used; owls. Thankfully, the trailer did not reveal too many details about the story, I love going into a movie not knowing what to expect.<br><br>As for the film itself, I found it to be an extremely captivating and magical experience, a similar experience that I had not felt since seeing Avatar in December of '09. The animation was beyond top notch as each audience member bare witness to the immense detail of the owls and the environment. Each feather on the owls and each rain drop and spec of dust from the environment was clearly visible in the film.<br><br>The cast chosen for the film couldn't have turned out better than it did. The overall voice acting was fabulous and wouldn't have wanted any other way. The perfect octaves, expressions and moods were used in each line. Straying back to the previous paragraph slightly; most animated movies leave most people guessing the actor who plays the voice of a given actor. I, however, did not do this in this film. I was simply too immersed into the film to really notice.<br><br>The music used in the movie was beautiful and majestic. Truly epic scores of musical composure added so much to the film. You can tell the music in a movie is great when you never truly notice it, not to say it doesn't deserve its recognition. I merely mean that if you notice the music in a movie, it simply stands out too much and becomes a distraction. So having not noticed the music, I simply mean that the music became one with the movie and the experience.<br><br>In the end, I left the theatre with a very familiar feeling that I had not felt since I was a child. The feeling of classic Disney storytelling. The feeling of a masterpiece in the making. Legend of the Guardians is truly an epic film with a very rich plot and brilliant characters","user":"fleury24","rank":[77,95]},{"title":"Legend of the Guardians: A Surprising Diamond In The Rough!","rating":10,"date":"26 September 2010","review":"Within the Pixar Dominated, Slapstick Permeated, Cookie-Cutter animated generation we currently live in, Legend of the Guardians: The Owls of Ga'Hoole, Directed by Zack Snyder (\"300\" &amp; \"Watchmen\"), breaks this pedestrian mold through its Captivating Visuals, Engaging 3D, and its Lord of the Rings-like Odyssey.<br><br>Based on a series of books written by Kathryn Lasky, this mythological story centers on dreamer Soren (Jim Sturgess), a young owl enamored with stories of \"The Guardians\", a clan of warrior owls who hail from the Tree of Ga'Hoole, and protect the weak from an evil army called the Pure Ones. When Soren and his brother, Kludd (Ryan Kwanten), are kidnapped by these Pure Ones, the stories become reality. Soren escapes and hunts for the Guardians to save the owl kingdom from the Pure Ones, while Kludd slowly becomes one.<br><br>Legend of the Guardians is a milestone for animation and a 3D visual masterpiece. Under the direction of Snyder, Australian company Animal Logic (Creators of \"Happy Feet\" &amp; special FX for \"The Matrix\" and \"Lord of the Rings\") have achieved something incredibly remarkable. The interaction of air and digital feathers work in a harmony that makes Avatar look like an old computer game. The landscapes are absolutely breathtaking, Monsoons are shimmering and talons glistening, this brings out the best in Snyder's heavily artistic directing style, and has adorned this movie with graceful battle scenes, beautifully blended with his signature slow motion shots at the perfect moments.<br><br>With its comparisons to films like \"The Secret of NIMH\", \"Watership Down\", \"The Dark Crystal\", with clear shades of \"Star Wars\", Guardians is not your run-of-the-mill animated movie with a fart joke every 10 seconds. The movie takes on a much more serious disposition which fits perfectly with its thematic flow. It is important to note, the film deals with issues such as courage, unity, loyalty, faith, sacrifice and betrayal tackled by Snyder with understated maturity. Though the story moves at a fairly quick pace, you will be immersed in what develops, as the writers did well to implement essentials to the storyline with comprehensible dialogue.<br><br>With that being said, Guardians is an engaging and relatively intense movie from start to finish. Thus, successfully separating our mindset of \"Animated\" and \"Kid Friendly\" being synonymous with each other. It is inspirational, breathtaking, humorous and educational with all the essentials of an all in all great story and movie. The kids and adults will both learn, while at the same time be visually enraptured by the animation's beauty. Don't be remotely surprised if you see sequels as it certainly has the legs to do so...or should I say wings (Note to self: Refrain from the bird puns..)","user":"fieldsofgrass419","rank":[115,153]},{"title":"Terrific family entertainment; yet another CG-animated gem of 2010","rating":6,"date":"25 September 2010","review":"Is 2010 the Golden Year of CG-animated films? We already had TWO excellent films, all computer animated and all family-friendly. \"How To Train Your Dragon\" and especially \"Toy Story 3\" are stunning in terms of quality and technicalities. Even \"Despicable Me\" had a heart. I'd add another to that list: \"Legend of the Guardians: The Owls of Ga'Hoole\".<br><br>There will be complaints, like every other movie. Some will call the story unoriginal. Some'll say it's childish because it has talking animals. Some'll say it's stupid for the exact same reasons. I say, so what?! It's a family film, meaning there's something for both kids and those who are kids-at-heart! People go to the movies to be entertained, especially families, and with that this film delivers in spades.<br><br>First we have a superb, outstanding cast consisting of Australian/British actors of both the young and highest caliber. There's too many actors to say here, so I'll just say this: the voice acting is terrific. The owls speak in accents (for obvious reasons) making them sound as far and away from being \"Hollywood-ized\" as possible. There's depth, determination and heart to these characters. The villains of the film are really menacing, a feat considering that almost every character in the film are owls.<br><br>Story-wise, it's obviously unoriginal, but it is told very well. This is due to the animation, which is absolutely, spectacularly stunning. There is a great amount of detail in the film, especially on the owls, you can see every feather, every movement they make, every gust of wind that brushes that pass their feathers. Director Zack Snyder (finally using his talents for the kids) puts his signature style to terrific use here, using the \"ramping\" (frantic slowing down and speeding up repeatedly) technique from his \"300\" and \"Watchmen\" for the action sequences, that will make one forget he is watching an animated film, let alone a movie that has talking owls. It's absolutely breathtaking to see it in 2D alone, I watched it in 3D and had a hard time closing my stuck jaw afterwords!<br><br>The film looks and feels like it's a lost \"Lord of the Rings\" film. There's the armor, and the swords (talons), and then there's the big bad (Metal Beak) and the young hero (Soren) who is destined for greatness. It's set in a fantasy, far-away world where 3D is put to terrific use. Not since \"Avatar\" has 3D been used so efficiently and effectively that makes it an essential part of the story instead of being distracting and gimmicky. Likewise, the cinematography and the orchestral score is great and puts you into the film more. The owls look painstakingly well- rendered and they don't look too-clichéd-cartoony or too-frighteningly- realistic. It's just right. The only gripe I had with the film is the insertion of an Owl-City (because he's practically the most famous artist today with the word \"Owl\" in his name) song in the middle of the film which is distracting. But apart from that everything else was great.<br><br>In short, it's one of the best animated films of the year. It's the perfect movie to bring your family (and maybe friends as well) and enjoy. Have no worries, sit back, and enjoy the ride. And seeing it in 3D is a plus, no matter what anyone else says. The ending also hints at a sequel. Hope that's a possibility as Warner Bros. has a potential new family franchise at their hands. And I hope Snyder returns as well.<br><br>Overall value: 74/100","user":"dvc5159","rank":[68,90]}]