[{"title":"Why so much hate? It was okay","rating":8,"date":"19 July 2015","review":"I keep reading reviews for Cars 2 and I am kind of surprised. Some people went as far as comparing it to the Star Wars prequels. Sure, Cars 2 definitely is no \"Finding Nemo\" or \"Toy Story.\" But it sure was fun, at least for me. The plot was an obvious reference to James Bond and Mission Impossible. I enjoyed the spy gadgets and political overtones. It was action-packed and not only enjoyable for little kids, but for older kids and adults too. Why all the hate? Heck, even Roger Ebert and Rolling Stone liked it!<br><br>In my opinion, Cars 1 was a little slow. It dragged a little too long in certain parts. Cars 2 suffers from no such thing.<br><br>To sum it up; Cars 2 may not be Toy Story but it sure is FUN and ENTERTAINING.","user":"cleontico","rank":[21,24]},{"title":"Not what my kids and I expected...","rating":6,"date":"24 June 2011","review":"Espionage, assassinations, sabotage of renewable energy, propaganda, corporate cover-ups, media manipulation and The Mob...<br><br>James Bond? Nope. Jason Bourne? Nope. <br><br>Disney/Pixar's CARS 2. Wow. This movie wasn't at all what I was expecting. In the second serving of Lightning McQueen and his pals, they take their show to the international stage in a world championship race-off sponsored by oil-alternative manufacturer, Allinol. But turmoil behind the scenes pulls the gang into a world of spies, the Mob, Big Oil, evil German scientists and hit men. Now they have to save the world before it's too late. Oh, and they race too. The animation is amazing. Water, large balloons, backgrounds during races...pay attention because the quality of the graphics in this one are world-class. There are some goofy, funny moments and some nice one- liners for the older crowd. The themes of being true to yourself and bonds of friendship run strong throughout this film but it's the remainder of the message that worried me. There were non-stop put downs throughout and some other questionable topics. I was beginning to question the G rating when the villain ordered his henchmen to \"kill\" several other cars. Thinking back to the innocence and the good spirit of the first movie, I began to wonder how we got from there to here. Adventures in racing take a back-seat to the more mature plot of an espionage thriller. Looking around the theater, I could tell that kids younger than 4 or 5 were beginning to get lost. Even my ten-year-old had a hard time understanding the socio-political messages. On top of all that, I'd be willing to bet that Cars 2 is a contender for most guns, explosions and bullets fired in a G-Rated movie. This movie had much more violence than the first one.<br><br>Aside from the appropriateness of the movie, it wasn't bad. All the likable characters from the first movie were back with bigger roles like 'Mater &amp; Luigi and there were many new characters added that also brought their own personalities into the mix. To me, this was an espionage-thriller so the added bonus of some comedy made the movie move right along at a good pace. <br><br>It was engaging for me, I enjoyed it, but the entire time I couldn't help but wonder why Disney/Pixar chose to tell this story through a kids movie.","user":"atrpunk","rank":[105,156]},{"title":"A Great Summer Film, that the whole family can enjoy","rating":7,"date":"11 June 2011","review":"We all know that Pixar makes incredible movies, I personally have never disliked a Pixar film. The first \"Cars\" film, was a great movie, not a perfect film. It was one of the least better films, Pixar has made, but that's like saying, Insomnia was one of Christopher Nolan's worst films. I had high expectations when coming to see the film, like I always have before I see a Pixar film.<br><br>After my viewing of the film, I have to say Pixar never fails to produce a great, entertaining film. Although it doesn't reach the heights of Wall-E, Toy Story 3, etc. It still stands by itself pretty high up there. The animation is extremely well done, the look of the film is amazing. The voice actors are great, I miss Paul Newman though. Although the film is not perfect. The movie is not perfect though, the story is not great, but not bad, the movie does not have the emotional as other Pixar films, but it is definitely not a heartless film. But the film is definitely entertaining and a great beginning to 2011 Summer movie season. Take your whole family to see this movie, it will probably not disappoint. It will not only satisfy kids, but also the adults, this film is for everyone. Fun for kids, but the adults can also connect with it and will have a great time watching this movie in theaters. It is quite an adventure and I will be glad to give it a second viewing.","user":"Loving_Silence","rank":[246,384]}]