[{"title":"Surely Enjoyable","rating":7,"date":"28 September 2011","review":"Every movie has its specific set of audience, and this one too has a particular set. It is a sensitive but sexy movie about a woman in her forties and her post-divorce encounters with different feelings like hatred, low self-esteem, domestic problems and her personal life. Amidst all the things going wrong with a woman who is in a situation where she had been cheated by her husband, she finds something which perhaps is the most important thing in this world, \"Friendship\". Catherine Zeta Jones looks lovely throughout. I literally fell in love with her after watching the movie. Not just because she is beautiful but the emotions portrayed by her are extremely believable and life like. She portrays the role presented to her with perfection and looks plausible as a single mother raising two kids. Moreover, No matter what others say, I feel the chemistry between her and Justin Bartha (The Hangover Groom), if not tremendously magical, was just right for the movie. The movie is never uninteresting and did keep me glued to the screen. It makes you smile in places with some witty and amusing scenes and also imparts some wisdom about life and any relationship. I wouldn't say that it is something worth not missing but if you are a planning on watching it, I guarantee you that your ninety minutes would not be wasted.","user":"Einsicht2010","rank":[8,8]},{"title":"One of the best romantic comedies in years!","rating":10,"date":"12 March 2009","review":"This is one of the best romantic comedies I have seen in years. I went to see this with a friend of mine who's in his upper thirties and I'm in my mid twenties and we both laughed so hard. There's none of the commercial, fake feel some romantic comedies have, or the ones that try to be funny and are not, this is a daring romantic comedy, really in tune with our times that breaks with some stereotypes.<br><br>Great acting, both by the adults and the kids (you can't help falling in love with Justin Bartha and this is some of the best performances I've seen from Catherine Zeta Jones, like a million times better than Intolerable Cruelty), interesting storyline, nice imagery of New York City and a movie I want to see again! <br><br>I hope it gets a wide release soon.","user":"yoghurtgirl","rank":[177,252]},{"title":"Decent Dramedy","rating":8,"date":"23 July 2010","review":"Justin Bartha finally bags a lead role and what's better than teaming up with the ever green Catherine Zeta Jones Douglas. A decent drama comedy and romance with unexpected dialogs - reflection of reality is a bit scary. You don't get a lot of movies like this one these days. Every time you see something close to reality, you get grossed out or end up calling it \"weird\" and the romantic parts from this movie is nicely done as well. With a wide range of cast including ART GARFUNKEL have all done a great job. Highly recommended! I'm very happy for talented Justin Bartha as I've been waiting to see him in movies that offer him good roles and more screen time.","user":"sree-howlett","rank":[35,45]}]