[{"title":"better, or maybe just funnier, than expected thanks to the two leads and some supporting work","rating":7,"date":"11 April 2010","review":"The director Shawn Levy sadly doesn't inspire a lot of enthusiasm going into one of his movies. At best he's competent at what he does, and some years back made a halfway clever and original 'movie'-comedy (Big Fat Liar), but mostly has kept to Fox studio commercialism like Cheaper by the Dozen and the Night at the Museum movies. And yet, he (or just the studio) must have had the insight to put together two of the funniest people working right now- not to mention with shows back-to-back on Thursday nights on NBC- Steve Carrel and Tina Fey, because they help elevate anyone's work by a longshot. This isn't to say that Josh Klausner's script may not have some laughs, but where exactly I can't be sure, since most of his contributions would appear to come from the super-conventional story aspects (as my own mother put it, \"I don't know, looks like The Out of Towners, or that Blind Date movie from the 80's\").<br><br>So yeah, basic premise, married couple looking for a little change (their friends are splitting up), go out to 'The City' (NYC of course) and to a very nice restaurant. In a move that could come out of a Seinfeld episode, they can't get a reservation so Carrel overhears a waitress calling for someone else for a reservation and he decides they should take it since they're no-shows. The \"Tripplehorns\", as it turns out, have some shady dealings with some bad dues with guns, and so the Fosters, our confused heroes, go on the run in the city. Whenever the movie focuses on the core plot of all of this, it's by the numbers stuff, save for a climax that ratchets up the absurdity of everyone involved (including good actors playing decent-to-mediocre baddies like William Fichtner and Ray Liotta).<br><br>It's when Fey and Carrel are allowed to play loose with the script that it strikes the iron. Their timing is impeccable, and they have chemistry together, which is crucial. And when they come across some other supporting characters, like Mark Wahlberg's (VERY) shirtless ex-military guy with all of his high-tech equipment, or the \"real\" Tripplehorns played by James Franco and Mila Kunis, there's further hilarity that ensues from the interactions and precise timing. That's all you need sometimes in a comedy that's based in formula, is two character to at least semi care about (and, perhaps more wisely than a Hollywood rom-com can be given credit for, it has painfully normal characters here, nothing too complicated), and who are funny in semi-funny situations. Even a ridiculous car chase where the Fosters hit a cab and the two are connected bumper to bumper through the streets is funny just because of the acting. Given the right mood and timing they could read a census report and get a few chuckles from the pauses and inflections.<br><br>So, if you're looking for something masterfully done, look elsewhere. If you just want to see two stars who are funny be funny almost despite some of the limitations in the script, Date Night deserves a chance. At the least you get to see the two show off their \"skills\" in a strip-club scene, and, did I mention Mark Whalberg doesn't have on a shirt?","user":"Quinoa1984","rank":[68,96]},{"title":"Kill Shots and Potato Skins","rating":6,"date":"12 April 2010","review":"Greetings again from the darkness. Most married couples can probably relate to the grind of a life absorbed with work and parenting. Sometimes the fantasy turns into having a quiet moment of solitude. Heck, even \"date night\" can devolve into just another responsibility tacked on at the end of a long week. This is the premise for director Shawn Levy's film. The best part? It doesn't matter at all.<br><br>The reason this film works is not the plot or script, but rather the talents of the two funniest people in showbiz today: Steve Carell and Tina Fey. The two seem to have an exceptional comedic connection that brings out a timing that reminds of the best comedy teams of all time.<br><br>Sometimes what makes for the funniest comedy is putting \"normal\" people into exceptional situations and let them react. Here, Carell and Fey are just a typical suburban couple trying to re-ignite the luster of an all too comfortable marriage. The motivation comes when their friends (Mark Ruffalo and Kristen Wiig) announce they are splitting. This starts Carell and Fey off on a series of skits that would make Seinfeld proud.<br><br>The nightmare begins when the couple \"steals\" a reservation in a hot new restaurant and assume the identity of, what turns out to be a couple of low level thieves. The multitude of skits that follow include supporting work from dirty cops (Common and Jimmi Simpson), the real reservation holders (funny James Franco and Mila Kunis), a mob boss (Ray Liotta), a corrupt city official (William Fichtner) and a \"security expert\" in the eternally shirtless Mark Wahlberg.<br><br>The approach of the film reminds me of \"After Hours\", \"Adventures in Babysitting\" and \"The Out of Towners\". Some of the best comedy occurs when the main players aren't tossing out incessant one-liners. Think back to Cary Grant's screwball comedies. He was not a bumbling idiot or a stand-up comedian walking through life. His characters were reactionary to the odd-ball situations in which he was placed. That is the approach of Carell and Fey, and I hope they pursue future projects together.","user":"ferguson-6","rank":[58,84]},{"title":"A Nutshell Review: Date Night","rating":8,"date":"8 April 2010","review":"I wonder how many married couples out there can attest to their lifestyle being nothing but revolving around work, family and especially kids, with the latter just sapping whatever free time they have in their waking hours, only to find themselves stuck in a wash-rinse-repeat cycle. The film examines in a comical fashion of course, the lifestyle of the typical family with working parents and young children, and how there isn't anything known as personal time, and having routine becoming the rot in their lives.<br><br>For the Fosters Phil (Steve Carell) and Claire (Tina Fey), such is their married life, with spontaneity and energy being sucked so dry, even their regular date nights seem like a chore. You know, that precious night where you think you can paint the town red with a babysitter looking after the kids, and the sad thing being that even that can turn out to be lifeless, save for their favourite game played during dinner, where they adlib what they think about other diners around them.<br><br>Which is pretty cool, given that the two comedians, as the blooper reel played during the end credits showed, hammed it up a lot with awesome ad-libbing and improvisation, that never fail to bring on the laughter. In fact, opportunities where they are cut loose and allowed to go really crazy, are some of the best parts of the film, breathing comedic life into a very simple story of how their, well, little white lie in order to get a table at a swanky restaurant, would turn their date night upside down into a crazy urban adventure, filled with thugs, cops, and well, a beefy Mark Wahlberg.<br><br>If I had a physique similar to Wahlberg's security expert Holbrooke, heck I'll strut around topless as well all the time, which serves as a running joke about Man's insecurities about the pectorals and abs of another. One of the nicer themes here involves how couples, beside spending time together, have to emotionally connect and be honest and upfront about their desires, and especially fears as well. In between pursuits and comedy, director Shawn Levy pauses the pace appropriately to inject some dramatic elements to sneak in a moment or two to examine just that, before stepping on the pedal to floor the film to its finale.<br><br>Like I mentioned, it's otherwise a very straightforward film that doesn't try to be more than it can be, keeping things simple and to the point, with great cameo appearances with the likes of Will.I.Am, Mark Ruffalo, James Franco and Mila Kunis being those instantly recognizable. Carell and Fey share an excellent chemistry and play off each other's antics really well from wit to the timing of their physical comedy, and you'll find yourself rooting for this average, normal couple, to be going one up against their adversaries in a single nighttime adventure, since all they want is to get out of their predicament, and back to their home and children like all parents do.<br><br>Stay until the end of the credits if you didn't have enough of the restaurant scene where Carell and Fey pose as arrogant Euro-trash, for additional laughs.","user":"DICK STEEL","rank":[89,137]}]