[{"title":"Decent film","rating":6,"date":"8 October 2014","review":"The movie isn't as bad as I expected from a low budget film (and it shows it's low budget). The acting isn't half bad, but it's not the greatest either. Some of the dialogue is cheesy and feels out of place sometime. The plot and story are interesting though.<br><br>2 US tank destroyers are caught in an ambush by 3 Wehrmacht tanks in a no-man's land area. The German ambush had previously caught 2 trucks transferring liberated POWs and the only survivors are one of the drivers (who is an African-American) and a British captain. Now they must all fight together to take out the Germans, before an unsuspecting US General, on his way for an inspection, as well as any other Allied forces are caught by the Germans.<br><br>The story focuses a lot on racial disputes in the US army at that time. You have the African-American sergeant who is the most experienced of the lot, trying to take charge of the situation, while 2 men from the tank crews are bigoted against him. The British captain goes on to mostly fight by himself as he's trying to avenge the death of his fellow prisoners. All in all, some of the characters are interesting. The delivery of the message it wants to convey is kinda blunt towards the end, but it's still worth the watch. The movie is more focused on action than previous films in the Saints and Soldiers series.<br><br>6/10","user":"hypersonic8999","rank":[48,54]},{"title":"Saints and Soldiers - The Void: I liked it","rating":6,"date":"28 November 2014","review":"There is always some controversies, when it comes to low budget and Indie films, about the right way to rate them in comparison with regular productions. Somebody feels that since you must judge the overall result, if it is manifestly lower than a similar film made by some Major, you have to state it. Plain and simple.<br><br>Some others think that since it's obvious that they cannot meet bigger productions standards, you have to appreciate the good things they show (if any) and be happy with it. I don't know where to stand but I'm more inclined towards this second party, at least for the present movie.<br><br>I found this film entertaining and even if they had just four tanks, two trucks, one house and one tent, they had very good dialogues and did an overall good job. All the gear looked stunningly brand new and this may be the way things looked back in 1944, I don't know, surely it appeared to be a precise artistic choice which I won't judge.<br><br>If you would compare it to a major production its correct rate would be 4. If you ask yourself what would anybody be able to do with the same stuff, then I think it deserves an 8.","user":"niutta-enrico","rank":[21,27]},{"title":"A movie for M18 buffs","rating":7,"date":"8 January 2015","review":"This movie, while not horrible, is obviously low budget. That said, the Saints and Soldiers series do an admirable job of creating realism with excellent props, especially when considering the low budget. The acting, for the most part is campy, preachy, and over the top. A few of the guys do fine jobs, but most could be much better.<br><br>But let's be honest, where this movie shines is in getting to watch two beautifully preserved M18 Hellcats and a Pz.III in action. Which brings up one minor gripe; In WWII, armored vehicles were nearly unrecognizable due to the amount of crap they had on them. From backpacks, to wooden ammo and ration crates, to tarps, to sandbag and log armor, etc. These vehicles looked like they just rumbled off the showroom floor.<br><br>But all in all, I gave it a 7. For WWII armor buffs, you won't find a better movie out there that features Buick's beautiful tank destroyer, which was well loved by it's crews. For those who like fast, light US armor, also check out The Bridge at Remagen, for some incredibly fun M24 Chaffee action.","user":"blackhawk5150","rank":[10,13]}]