[{"title":"Why not?","rating":6,"date":"31 December 2011","review":"The River Why is based on a novel, written by David James Duncan. In a few words, it's about a young fisherman who leaves the city life to go and live in a house by the river and do/find/think about what he loves.<br><br>If one would like to find himself somewhere, that looks like a nice place to do it. Romance isn't missing, but it's more like an inspiration here (the way love should be, i guess).<br><br>The movie was filmed in some very beautiful locations in Portland, Oregon. It seemed like a documentary actually. A pleasant one. Had some good music and lots of nature sounds and thoughts about life. Zach Gillford was really good, so was Amber Heard. As far as William Hurt concerns, i think he's a brilliant actor and manages to bring up small parts in greater levels.<br><br>It was nice, quiet and inspiring. It flowed like a river.","user":"synevy","rank":[13,14]},{"title":"we always fish","rating":10,"date":"13 June 2012","review":"It is hard to point out certain aspects of life. You live a passion but you do not explain it, but how do you talk about it without demising it. Passion is the essence of life and we can only fulfill it when we feel it. You do not always know what you are passionate about. When life starts to expect something from you and it seems tied to you in particular then you understand the real need. We all expect love from our world but we cannot predict from where. When a gravitational pull comes into play you feel its attraction. Loving someone as they truly are is true love and when really expressed it is invisible. In the 'The river why' it is so pleasantly narrated and it makes you wish it was so easy. Unfortunately it is not always like that but the fulfillment in loving is worth the wait.","user":"patrickflorio","rank":[10,11]},{"title":"A young adult leaves the city to find himself through his love of fishing.","rating":7,"date":"7 August 2011","review":"I have lived in Portland, Oregon since 1981. Last night I viewed The River Why.<br><br>I have not read the book and, in fact, may do so having now seen the film. While I don't think this is a life changing experience, I did find the movie charming and loved the cinematography and the scenery of Oregon. The actors all do a good job and the film is thoughtful. The score is also well done. Watch the credits and you will hear a lovely version of \"Fishing Blues\".<br><br>I would definitely recommend a viewing of this heartwarming film. Again do not expect anything earthshaking here but an enjoyable time.","user":"ralphiea","rank":[20,25]}]