[{"title":"Fantastic Slab Of Horror From The Newly Invigorated Hammer Franchise","rating":9,"date":"1 October 2011","review":"On briefly reading the reviews here, I was a little disappointed at so many negative words for what for me is one of the best horror films I have seen in quite some time. Each to their own I suppose, that's what opinions are there for after all!<br><br>Made on a low budget and set in either the north or south of Ireland (hard to decipher which!), 'Wake Wood' is the tale of a recently bereaved couple who relocate to this remote outpost to overcome their grief. As luck would have it - the locals led by a sinister and menacing Timothy Spall just happen to have pagan powers to resurrect the dead for three days. Some people have all the luck!<br><br>This is a great wee story with all the trademarks of what made Hammer films so spellbinding in the first place. A remote location, strange locals, an abundance of gloomy weather and of course blood and guts aplenty. The tale twists and weaves, there's a number of interesting plot twists and fantastic performances all round especially from Spall who puts more proof in the pudding he is one of the most versatile British actors around. Debutant Ella Connolly playing the couple's tragic daughter is superb as well.<br><br>The script is original something difficult to muster in the horror genre nowadays. There is every chance 'Wake Wood' will end up becoming a cult classic in the same vein as 'The Wicker Man. Here's hoping it does because on first viewing it certainly deserves such an accolade.","user":"delfranklin1969","rank":[18,21]},{"title":"Highly original Irish Horror","rating":6,"date":"13 April 2011","review":"I found the story line original, or at least something I haven't seen in the past 10 years, because it's nearly all been done by now. The story moves at a good pace, showing you mysterious things along the way, teasing you a little before revealing what exactly is happening.<br><br>I would describe Wake Wood as a mix between the Exorcist and The Wicker Man. While it never reaches the brilliance of the previously mentioned films Wake Wood is a solid film, with good acting, particularly from the ever excellent Aidan Gillen. The cinematography is hardly groundbreaking but suits the mood of the film well.<br><br>Any fan of supernatural horror should be satisfied with what Wake Wood has to offer.","user":"cubasfinest","rank":[40,52]},{"title":"old school Hammer","rating":6,"date":"16 January 2012","review":"I was happy when I heard that Hammer studios was back in business. So far they delivered 2 flicks, The Resident (2011) and this one. Wake Wood leans more towards the Hammer style then The Resident although both do have their own thing. Wake Wood has more red stuff. But that doesn't make a flick. My only point of negativity is the use of CGI. There is one scene that I didn't like, when they make a close-up of the child's neck and we see her wounds disappear. It was done 100% CGI and I hated it. I guess one shot is also CGI, when blood sputters out of a neck. <br><br>But luckily the film has a good atmosphere. It takes place in Ireland and let that be the country of Paganism and Witchcraft. And that is what it's all about. Bringing back the death by old rituals. As I stated it do contain a lot of blood but it never becomes too gory. It was David Keating his first attempt to make a real horror. And he succeeded. Some shots were typical seventies style , even hammer style and the way it was edited was also a return to the seventies. The acting was okay. Only Eva Birthistle we knew from the horror The Children (2008). She even has a small nudity in Wake Wood.<br><br>If I must choose which one, Wake Wood or The Resident, leans most to the old Hammer I would say wake Wood. <br><br>Gore 2/5 Nudity 0,5/5 Effects 3/5 Story 3/5 Comedy 0/5","user":"trashgang","rank":[14,17]}]