[{"title":"Feel like I have just received a massive kick to the genitals.","rating":5,"date":"22 December 2013","review":"I still remember the feeling; that aura of anticipation that i felt when the announcement was made. Anchorman 2 was in production. Finally, big Ron was on his way back!!! The magical news team where going to be gracing the big screen and i couldn't have been any more excited. <br><br>The first film was very close to comedic perfection; it had everything that was needed and much like any film that you thoroughly enjoy you want to see more, but in the back of your mind you don't want the film to become tainted. <br><br>And although this film has its droves of fans, for me it was incredibly disappointing. They took it too far. The stupidity in the first film was perfectly balanced. It was funny. This however was over the top. There are certain scenes that are very uncomfortable to watch as they try so hard to make you laugh. And as the ridiculousness accelerated, my gut began to churn and any smile that wanted to force it's way out to stay loyal to the first film was obliterated and all that was left was me,- insert summary here -. <br><br>Disappointment is too feeble of an explanation to how gutted i was at the way this film played out. So much of the first film was regurgitated. First couple of carbon copy moments i tried to ignore and enjoy but it eventually became so obvious and so desperate. The continual \"by the beard of...\", like quotations from Ron was tedious. And the shark....well i'll let you see that farcical moment for yourselves.<br><br>I tried, i really tried to enjoy this film, and yes, it had it's fair share of moments that made me laugh, but it is nothing more than a moneymaker. And it will do its job. But that doesn't stop it from being a massive let down. Sequels tend to work when they are planned, not when they are demanded.","user":"The_moan_of_all_moans","rank":[204,318]},{"title":"People have revisionist history","rating":7,"date":"5 January 2014","review":"I remember way back in 2004 when I went to the theater in high anticipation of Will Ferrell's first starring vehicle(he was really a supporting actor in \"Old School\") in the original \"Anchorman\". I walked out of the theater feeling somewhat disappointed that the movie was just a so-so effort by a comedian I highly respected as one of the funniest people in the business. Over the next ten years,however, I became one of the legions of people who could quote the movie beginning to end while laughing myself into a stupor. Oh how I would continuously quote \"It means a whale's vagina\" or \"60% of the time, it works every time\". My point? I believe \"Anchorman 2\" will follow the same pattern with people. I have read many of the user reviews of this movie and they mostly provide the same complaint over and over again that the movie was sophomoric, vulgar and stupid and didn't live up to the original. Really? I challenge those same people to look at the user reviews for the first \"Anchorman\" in 2004. I'll give you a hint: They are the same reviews! Yet today, \"Anchorman\" is considered one of the greatest and most quotable comedies since \"Animal House\" and \"Airplane\". Why? I believe it is because Ferrell and Adam McKay try to pack in so many jokes into one movie (almost every other line!) that many jokes go over peoples heads, some inevitably just don't work or viewers miss them entirely because they are laughing from a previous joke. This is the same style of rapid fire comedy we are accustomed to seeing from Ferrell and McKay, as evidenced by the first \"Anchorman\", \"Talladega Nights\" and \"Step Brothers\". Over time and after re-watching these movies again and again, the jokes get rediscovered and the movie gets funnier.<br><br>That is not to say that this sequel is as good as the first. Many jokes did not land and, in my opinion, the side story with Steve Carrell and Kristin Wiig was just not that funny. HOWEVER...there were quite a lot of jokes that did land. Smoking crack on television (who knew you couldn't smoke crack on live television?), Champ Kind's chicken restaurant(\"I'm not eating that!\"), the dinner with his girlfriend's parents (\"say whaaaat?\"), his relationship with his son, etc. For the critics who feel this movie didn't live up to the original, I ask that you remember how you felt about it in 2004 instead of the years (and multiple viewings) following its release. To the critics who just felt it was stupid, I wonder if you even liked the first. To those who are fans of Ron Burgundy and his band of idiots and who have yet to see it, just remember that you will have to watch this again and again in order to really appreciate it...just like the first movie.","user":"Bradley-Grube","rank":[25,35]},{"title":"An abomination","rating":1,"date":"23 December 2013","review":"I am extremely disappointed with this movie. I was a huge fan of the original and can quote you every single line from that movie however, my expectations weren't too high for this movie because I knew it couldn't be as good as the original. But I was not expecting this movie to be this bad <br><br>The story line was awful. The parts of it didn't fit and it kept jumping from scene to scene. They tried to use Brick a little more which in my opinion failed miserably. There were many lulls within the movie. At one point, I actually thought about walking out.<br><br>I can't believe they actually released this movie. Did they not watch it again themselves?<br><br>Will Ferrell, you have destroyed your magnum opus.","user":"Ammad-Farooqui","rank":[240,424]}]