[{"title":"A highly anticipated sequel that (mostly) delivers.","rating":23,"date":"23 July 2011","review":"Not as cohesive or frightening, as the first REC (which is one of my favorite modern horror movies), but still a tense and thrilling horror ride, more often than not. This is a direct continuation of the original, and happens in and around the same apartment building on the same night.&nbsp;<br><br>REC 2 takes the supernatural elements of the first movie and further explores them, which sets it apart from some similar zombie-type films. No complaints from me there, I enjoyed the expansion of the overall mythos and the added backstory/explanation for some of the people and events of the first film. On the negative side, I did find the new characters introduced in this one to be almost universally unlikable and annoying. Did that ruin the movie? No, but I definitely cared about the well-being and survival of these people less than those that came before. There's also a slight feeling of repetition that comes with using the same location again, but that's understandable considering the direct plot continuance. &nbsp;<br><br>REC 2 is basically more of the same, so if you enjoyed the first, there's no real reason why you shouldn't see this. It's not quite up to the same quality, but it's worth checking out to see the interesting direction the story goes in.","user":"lewiskendell","rank":[28,32]},{"title":"They did it again!","rating":10,"date":"24 February 2010","review":"First of all someone wrote : \"Worst movie ever?\" I'm wondering if he really watched this movie. Anyway REC2 really did it for me,I was so looking forward to seeing this sequel and after reading some IMDb reviews I was thinking...boy I hope this wont be major let down.<br><br>And it wasn't! From the first minute to the last it was a thrill ride.I saw some excellent camera work, some really impressive effects and some top acting.<br><br>After i watched the first one,i was asking myself :\"How did it start? What really happened?\" Well in REC2 you get all the answers.<br><br>Once again BRAVO Jaume Balagueró&amp;Paco Plaza BRAVO Spain","user":"banbogdan","rank":[131,200]},{"title":"Rec ² (2009)","rating":7,"date":"17 January 2012","review":"Rec 2 picks up just moments after Rec. Now a SWAT Team and a medical officer are being sent in to clear up any mess. It's a simple, but still a powerful premise. It was kind of nice touring the same building again, seeing the remains of the previous film. The SWAT team POV also sets up some fantastic 1st person shooting scenes. This has to become a game at some point. The attacks do become a bit repetitive, but the story is given an extra kick by expanding on the demonic possession themes. This sets it apart from other zombie/virus movies. It had plenty of jumps and did unsettle me. Wouldn't mind watching the two films back to back for an ultimate experience.","user":"SnakesOnAnAfricanPlain","rank":[16,20]}]