[{"title":"Cupid's Arrow","rating":8,"date":"4 March 2012","review":"Greetings again from the darkness. The Brady Bunch, this isn't. It's also not the place to look for helpful parenting tips. In fact, the story revolves around Eva, a woman (Tilda Swinton) who apparently didn't want to have a child ... at least not at this time, and certainly not THIS child. If you have seen The Omen, you probably gave thanks that you didn't have a child like Damien. At least we knew Damien was the spawn of Satan. Eva's son Kevin, is instead a good old fashioned psychopath. One who has an inherent need to cause pain and misery for his mother.<br><br>What a pair Eva and Kevin make. From day one, Kevin seems to sense his mother's lack of joy in parenthood. And he seems to have a genetic disposition of making her pay. As with many psychopaths, his above average intelligence makes him even more dangerous. He is tricky enough to keep his dad (John C Riley) clueless as to his nature, while causing much doubt in the dad's mind as to the stability of his wife.<br><br>My favorite part is actually how director Lynne Ramsay structured the storytelling. It goes beyond non-linear and actually bounces throughout three key periods: Kevin as a baby/toddler, Kevin as a 6-8 year old (Jason Newell), and Kevin as a teenager (Ezra Miller). Each age is progressively more frightening and disenchanting, and the film begins with what is an undetermined catastrophe. This event is slowly revealed over the course of the movie, though we witness events leading up to it, as well as the resulting fallout.<br><br>There are a few scenes where Eva is scrubbing the exterior of her house in an attempt to remove the red paint that was purposefully splattered. As a viewer, we understand that she has blood on her hands and she seems resigned to the fact that she is now a social outcast, even a pariah. We spend much of the movie in Eva's jumbled thoughts as she tries to piece together what has happened and why. Of course, there is no answer. The title explains what was missing all along. There was no communication and no willingness to confront the problem ... a psychopathic son. To say they all paid the price is an understatement.<br><br>This film has a very limited audience, though my claim is that Ms. Swinton was quite deserving of an Oscar nomination. She wears defeat like a mask and lives in isolation better than most could. Even the music is offbeat and unusual in its use ... thanks to Radiohead's Jonny Greenwood. As filmmaking, this is high art. As storytelling, it's a bit muddled and quite a downer.","user":"ferguson-6","rank":[165,192]},{"title":"A fantastic film by a great director","rating":9,"date":"27 October 2011","review":"We need to talk about Kevin is easily one of the most harrowing films I've ever seen and left me completely empty. Lynne Ramsey succeeds where so many others dealing with a similar subject matter have failed, as she abstains from sensationalism and bloody detail. Instead she focuses in on character and relationship development and breakdown.<br><br>Tilda Swinton gives a truly great performance and even though the main thread of the story is clear almost from the start, she and the rest of the terrific cast manage to keep the viewer glued to the screen.<br><br>One of the most interesting facets of the film was that it showed how much power children can hold and execute over adults if they are given the opportunity.<br><br>We need to talk about Kevin is quality from start to finish and deserves to become a classic. I'm looking forward to seeing many more films by Lynne Ramsay.","user":"stamper","rank":[253,341]},{"title":"A devastating film","rating":9,"date":"5 April 2012","review":"Before watching We Need to Talk About Kevin, I had a vague idea about its story, but I didn't expect to find the fascinating narrative style employed by director Lynne Ramsay to tell this story about a family whose apparent normality hides deep and dangerous veins of dysfunction which conclude on a tragedy. In We Need to Talk About Kevin, even the most prosaic scenes take a big emotional weight once we finish to put together the pieces of the dramatic puzzle co-screenwriters Ramsay and Rory Kinnear had been giving to us little by little. In that aspect, I think We Need to Talk About Kevin is an excellent film, even though it's definitely not the kind of experience which brings us simple entertainment, but a sensation of pain and surprise which is very difficult to forget.<br><br>I generally distrust of those movies that offer us a whimsical structure which jumps forward and backward in time, but in the case of We Need to Talk About Kevin, the style powerfully contributes to the substance, building the story on a casual way until we are overwhelmed by the magnitude of what we are witnessing. Besides, the title of this film becomes cunningly ironic when we consider the fact that We Need to Talk About Kevin has few dialogs, and its most intense scenes are mute but full of meaning with just looks, expressions and body language. It's unfortunately not very common to see a film like this one, in which every scene brings a new angle to the story, and there isn't a single element which has been ignored as part of the global narrative. Something which definitely includes the soundtrack, composed by songs which deeply contrast with the images which accompany them, creating a visceral answer; while other ones work as ironic accents which perfectly establish the melancholic tone from the film.<br><br>And I now have to mention Tilda Swinton, who brings the best performance of her career so far in We Need to Talk About Kevin (something which is already a big compliment). This is the kind of performance which genuinely captures the spectator, because on some way, she transmits her character's emotional turbulence with her apparently impassive face and calm attitude. The other actors also bring excellent performances (Jasper Newell particularly), but Swinton is the one who definitely carries with the whole film. In conclusion, We Need to Talk About Kevin definitely deserves an enthusiastic recommendation, but I have to say once more that this isn't an easy or amusing film; in fact, it left me emotionally devastated for having portrayed a facet of the society whose existence we know even though we prefer to ignore it. In summary, a brilliant movie, even though I don't wanna watch it ever again.","user":"Argemaluco","rank":[19,22]}]