[{"title":"Sad and deeply emotional. But with a unique kind of beauty.","rating":7,"date":"31 January 2010","review":"Recap: The early teens is not an easy time, but Jenna is really struggling. Her mother is seriously sick with cancer and apparently in treatment, so her grandmother moves in with them. Jenna and her grandmother doesn't get along at all, since her grandmother doesn't accept that Jenna is growing up and wants to hang out with kids her age. The grandmother is driving Jenna and her mother apart, and it pains Jenna a lot because she loves her mother a lot. But Jenna finds an unlikely friend in Ullis, her neighbor and the schools most popular girl. But Ullis has her own problems with her mother, and together they seek desperately for an identity. Stability. But without any adults around they start to lose their grip. Unable to handle the dire situation Jenna rebels at any norm she can <br><br>Comments: A pretty strong movie about how unfair life can be. How hard it is to grow up and being forced to handle the fact that her mother, her only parent, is about to die. And when there is little, if any, support from the adult world, the result is pretty predictable.<br><br>As movies goes, it is pretty predictable too. It follows the standard structure of \"teenage growing up\"-movies, but with an extra edge with Jenna's illness. Still, it is strong and emotional movie, one that is sure to affect you. It is not a movie that depends on a story, it is a movie that plays on a deep emotional level. It is really hard not to feel for Jenna and Ullis, and more than once tears were close.<br><br>So a warning is appropriate, this is not in any way a happy movie, or a movie that is rough but ends well ( I guess that this is the way that the movie differs from most others). This a deeply dark movie, even though it is also very realistic. It is in no way more dark or unfair than real life can be, and that is perhaps what I felt most. Jenna's fate is in no way unique, her story is a story that many can tell. But so you know, this is not a movie that will lift your spirit.<br><br>Still, it is a movie that I can recommend, if you are in the mood for it. It got its own kind of beauty, despite the sadness. Or maybe it is because of it. Anyways, I hope that is what I will remember.<br><br>7/10","user":"Enchorde","rank":[10,12]},{"title":"Emotional and heart-wrenching movie","rating":9,"date":"3 July 2019","review":"Whilst the IMDB rating for this movie is somewhat low, it was truly deserving of its Guldbagge wins and nominations(which is basically the swedish Oscars).<br><br>The performances was fantastic from each of the actors and you truly feel for everyone of these characters, the main girl, the grandma and her newfound popular friend, who has sort of her own character arc during the course of this movie.<br><br>This is a movie I would recommend without a doubt, whether you speak swedish or not. It's a heart-wrenching movie about cancer and the bond between mother and daughter, and that is something it does really well.<br><br>I give it a 9 out of 10!","user":"martinpersson97","rank":[1,1]},{"title":"Good Swedish Drama","rating":8,"date":"21 October 2018","review":"I'm not sure if this film is available in English, but I watched it with subtitles and it was really good. Sad and beautiful are definitely good words to describe it. Plus, it stars Anki Lidén, the mother of Tim Bergling (Avicii).","user":"dbru89","rank":[0,0]}]