[{"title":"Poor script elevated by powerful performances.","rating":6,"date":"20 May 2012","review":"I would probably give this about a 5.5, but since that's not available, I'll be nice and say 6. Chloe Moretz is what primarily drove me to see this film at first, especially since I wasn't too familiar with or cared for any of the actors who were to be in it. I might be a bit biased because prior to my viewing, all I'd heard was how AWFUL this film was. But I said screw it, it's Chloe Moretz. I've been on a Chloe binge lately and thought I'd help satisfy it by catching this. A month before its May 11th release, I read the book and was legitimately impressed. The book truly captivates the reader, by giving you a sincere sense of what goes on in Luli's mind, given her experiences with a troubled family and redneck life. Having truly enjoyed the book, I was able to ignore the horrid reviews I'd read and decided I'd go for it anyway.<br><br>I'll say this: if it weren't for Chloe Moretz and Eddie Redmayne, this film would truly have been a flop. The script is a bit similar to the book, as pertaining to the volatility of the plot and random introduction of significant characters. But the script fails by giving most of these spontaneously interjected characters ridiculously short screen time (Blake Lively only had about MAYBE 15-20 min. tops?). Characters that had given reasonably substantial meaning to Luli's depicted life on the road, such as Clement, Beau, even Lloyd, had no more than 2-3 minutes screen time apiece, and many of them were given almost no depth whatsoever.<br><br>Chloe did a fantastic job of acting, as usual. Her portrayal of a charming, street-smart yet semi-innocent teenage girl is visually and emotionally gripping. Her camera action and dialogue alike are the culmination of what only the most talented, versatile young actress in Hollywood can produce. Blake Lively did a reasonably decent job, and actually showed a surprising amount of character depth. But it is Mr. Redmayne who steals the show.<br><br>Having never seen a film with Eddie Redmayne before, I can't say that I had really known what to expect from him. I had read from many sources that he had done a fabulous job in this film, with one such reviewer even claiming he deserved an Oscar nod. Having read the book and been well-acquainted with what to expect from the man playing Eddie Kreezer, the acquaintance-turned-murderer-turned-kidnapper, I was thoroughly and legitimately impressed with his depth. Eddie Redmayne brought a perfect combination of charm and emotional versatility, with the underlying degree of insanity which would turn extreme in the final act of the film. Redmayne's western accent was phenomenal, given his English citizenship, and his charming cowboy persona was spot-on. His mood in scenes would vary from condescending to charming to menacing and so on. I can honestly say that Eddie Redmayne literally made the show for me.<br><br>The film as a whole will probably not be up for any (significant) awards, especially given its indie status and almost obsolete promotion. I can't recommend that the average moviegoer check out this film, maybe not even the average Chloe Moretz fan. But if you're up for a road film centered on a young girl who learns to literally pull herself up by her bootstraps and survive countless things, from abandonment to rape to kidnapping and so on, it could be worth your time.","user":"Jtbone3141","rank":[47,53]},{"title":"Another mature performance from Chloe","rating":7,"date":"1 December 2012","review":"The excellent Chloe Grace Moretz plays Luli, a Nebraska teen who decides to head to the bright lights of Las Vegas leaving behind her drunk of a father and a mother who has run off with another man, sadly things don't go to plan when she hitches a ride with Glenda (Blake Lively)<br><br>The story and performances are all very good, but yet again the stand out is Chloe, her performances in this and other films such as Kick Ass and Let Me In are astonishing for such a young actress (she's barely 15 now!)The movie is gritty as Luli is exposed to the dark under belly of life, drugs, drunks, low life's out to use (and abuse) her.Chloe is well supported by a good cast, Juliette Lewis, Blake Lively and a cameo from Alec Baldwin and I was astonished at the films poor rating on Rotten Tomatoes of 5% fresh, critics eh!?<br><br>A mature adult drama well worth a look.","user":"rjwilliams5150","rank":[30,38]},{"title":"A tough growing up for a girl in a story to be","rating":9,"date":"14 May 2012","review":"I saw it as a movie that works with a young girl's expectations and anxiety, while she grows fast in a very complicated environment, passing through tough situations. She's in the middle of building a new identity, because of her age, after her family brakes up and abandons her in the middle of nowhere. She is in a completely fragile and vulnerable position, but her mind, heart and soul are trying to find a way for her life, for her personality and for her values. She brings memories and integrity from childhood that now have to face a grown up world, without any help. It's a movie about a story to be, that can't find a solution until it ends.<br><br>Characters and plot are searching, they are all in the road and this constant reference to the road makes the extreme beauty of this movie. Hick, or Luli, the girl is not just the main character but she is also the personification of this story to be, girl to be, to find her own answers and life while passing through all the changes of her age and without any base but two very problematic older friends she met. There is a total identity between the girl and the space she lives in an is trying to get out of. The light, the desert sceneries, they make Luli great, strong, and that's why she keeps going on. Because, after all, that's her world and her life, and we see all the action as if those were her own mind working, searching for answers and for a way out of the trouble.<br><br>She is completely alone and lost, but she wants to experience this new life, she desires this new world, so it's not only a drama, it's also an adventure. She loves the ones that cannot love her back the way she needs the most, neither the way she wants, but they love her two, while lost in their own worlds. They couldn't find anything better, while she just doesn't give up, and that is a conflict with bad consequences, as the sexual molest. Luli is growing up in a extreme situation and she is determined to patiently pass through everything she'll have to go through, to get over it.<br><br>The most simple things of life are not allowed here, there is no access to it. In a situation like that, what would anyone do? That's what this movie is about. Hick represents a distance from the possible world and from the real world. It's a situation her people are indeed struggling so desperately every day to keep their lives. But, somehow, in the edges of this forgotten world it's effectively reality who keeps them prisoners, so this story asks for reflection too.<br><br>It's not exactly an imaginary story, elements are very real and we can feel their impact in social differences or in the power relation between men and women, and in the uneven risks a young girl has to take to go on with her life. We can find all this elements in our daily lives. Luli feels deep love and friendship and learns its forms in this very disturbing world. She can't just say no and go back to anything before that. She has this chance repeatedly but she knows she has to move forward, no matter what, it's her only way out.<br><br>Chloë Grace Moretz, Eddie Redmayne and Blake Lively hold the story with an intense acting, strong rhythm and gradual tension, until the outcomes. I also liked very much the direction of Derick Martini and the approach of the story. It's not inappropriate at all, if we think that sexuality gains more and more importance every day in our times, in this culture where precocity and desire are so stimulated, and we have Internet. There's got to be a permanent discussion about it. Chloë is a very mature girl for her age, that can be seen in the movie, as an actress she entirely dominates her role and gives it strong traces and emotions. One more great job for her brilliant career. Eddie Redmayne and Blake Lively worked with her in perfect connection and that allowed this movie to be so expressive in a very single story.","user":"zaciogeribello","rank":[47,68]}]