[{"title":"An absolute delight","rating":10,"date":"9 January 2010","review":"I saw Leap Year today. Matthew Goode has been a favorite of mine since his performance in Chasing Liberty with Mandy Moore. Amy Adams was new to me. Both leads were outstanding in this film. I am 58 and single, an old softy who always looks for a good \"chick flick\" and this one is a beaut. I don't want to give away anything. Just see it. You will love the interplay between Amy and Matthew. Theirs is a very sweet romance that builds ever so slowly. For laughs, there are pratfalls and other silliness (that's a good thing). The supporting characters are also funny and charming. The Irish countryside is gorgeous. On the way out, I heard a man behind me tell his wife \"That was a good movie. I'd see it again.\" So would I. Definitely!","user":"barbicane3333","rank":[175,232]},{"title":"Delightfully innocent and sweet","rating":10,"date":"27 June 2010","review":"I absolutely adored this movie. So much so that I watched it 6 times within one week. Not because it's anything amazing or Oscar-worthy. Don't expect anything completely awe- inspiring, complex, or brilliant. It's just a simple love story. And what I really appreciate about this movie is how innocent and lighthearted it is. Kind of a breath of fresh, romantic air. Adams and Goode have amazing chemistry and perform their personalities to a T. It was really fun to watch the steady but stubborn transformation of their relationship throughout the movie. If you're a little bored by the acting in the very beginning, don't give up on it... It gets better! And it's even better the second time around.","user":"modland","rank":[65,82]},{"title":"Most fun I've had at a theater in quite a while","rating":9,"date":"8 January 2010","review":"I just got back from the theater under an hour ago, and am still in a good mood after having watched this. Some romantic comedies are more comedy than romance, or more romance than comedy, but this one blends the two into something especially delightful. I left the theater with more of a bounce in my step and a wide smile on my face, despite having had a not so great day.<br><br>It's not perfectly original--there were parts where I was able to say ahead of time precisely what was going to happen next--but it is not entirely formulaic, either. And there is something comfortable about the familiar, especially if it is done slightly different.<br><br>Matthew Goode surprised me in his role, and there the originality is quite refreshing. I hadn't realized exactly how limited of roles I am used to seeing the typical \"rom-com\" male fit into, until he kept breaking my expectations. And I like how real Amy Adams is: no harsh looking clavicle bones sticking out, minimal makeup, and her face hasn't been pinched and pulled into a tight canvas.<br><br>The Irish scenes are gorgeous, and the accents entertaining. And, I don't know if there was anyone else who was pleased, but I was ecstatic at this proof of a great romantic comedy kept within a PG rating. No embarrassing scenes to make mixed company awkward; no offensive profanity. It IS PG, of course, so don't expect \"Little Mermaid\" standards, but it was still incredibly clean for the genre. I have little brothers aged 7 and 9 (who I'm very protective of), and I would not have felt embarrassed to allow them to watch this.<br><br>Overall, a great show for the genre. The best I've seen in a long time. Not perfect, but if you're in it for entertainment and a feel-good story, rather than as a movie critic, I think you'll really enjoy it.","user":"StarDragyn","rank":[161,214]}]