[{"title":"'Vile bag of garbage', 'Misunderstood masterpiece' or neither?","rating":8,"date":"27 January 2011","review":"'I SPIT ON YOUR GRAVE' (2010): Four Stars (Out of Five) <br><br>Modern remake of one of the most controversial films of all time 'DAY OF THE WOMAN' (which was it's original limited release title in 1978, it was later retitled 'I SPIT ON YOUR GRAVE' to capitalize on it's notoriety when it was given a major release in 1980). The film and it's 1978 predecessor both deal with rape, savage torture and murder. Both films have been highly criticized because of this with critics like Roger Ebert giving both films a zero star rating and calling the original a \"vile bag of garbage\". Almost an equal number of supporters (of the original film), including high profile critics, have raised their voices in defense of the film as well, with many labeling it a misunderstood masterpiece. Opposers of the film claim that it's man hating (with reports of some men walking out of the theater in disgust at both films) and some also accuse the film of glorifying violence against women (for it's violent rape scenes). Defenders of the films claim the movies are 'pro women' feminism and cathartic. People have been debating these issues for thirty two years and they'll probably go on debating them for longer than that and that's a good thing. If a movie causes that much discussion you have to give it some respect just for that.<br><br>Both films tell the story of a writer named Jennifer Hills (played by Sarah Butler in the new film and Camille Keaton in the original, Keaton is the grand-niece of Buster Keaton and won a Best Actress award for the role at the 1978 Catalonian International Film Festival) who heads to a cabin in the woods to work on her next novel. Once there she attracts a lot of attention from some hooligan hippies which eventually escalates in them braking into the cabin, raping her repeatedly and leaving her for dead. She unknowingly survives the viscous attacks and seeks out brutally sadistic revenge on all of the men involved, including a mentally handicap young man who was coerced into involvement by his buddies.<br><br>The remake was directed by Steven R. Monroe and written by Stuart Morse. The writer and director of the original film, Meir Zarchi, served as an executive producer on the film. Zarchi has said that he was inspired to make the original film after coming across a young rape victim in New York and escorting her to the police (which he says was the wrong decision considering how incompetent they were in the matter) and later the hospital for assistance. He defends the violence of the film as being completely necessary and rejects any criticisms that it is exploitative.<br><br>As far as the remake compares to the original film it's technically far superior on every level; it's better filmed, acted, written and directed (the original film had to manage with a much smaller budget though). The new film also shortens the rape scenes, in comparison to the much more explicit original, and relies more on psychologically implied imagery (which I think was a smarter decision). It also elaborates and extends the violent revenge scenes with much more creative deaths (much like many popular horror films). Where as the first half is more realistic and believable the second half branches much more into 'grindhouse' style revenge fantasy. While the film is much better than the original in all those ways it'll never be as remembered and cherished as a cult classic by fans.<br><br>I personally don't agree with the film's critics or it's supporters. I don't think you're supposed to necessarily agree with the heroine's actions or condone them and I definitely don't think you're intended to agree with the assailants' actions (that's a ridiculous argument). I think the film raises a lot of thoughts (most of them unpleasant) and discussion which like I said is something the films deserve credit for. A movie should never be judged by the actions of the characters within it, so however disgusting and disturbing they are (and in these films they're atrocious) it doesn't mean that they're bad films. I think both films are well made to a certain extent and effective at what they attempt to do. They're definitely not for everyone and very hard to watch but they're also memorable and dialogue inducing.<br><br>Watch our review show 'MOVIE TALK' at: http://www.youtube.com/watch?v=AgaAYiwY0g0","user":"Hellmant","rank":[136,190]},{"title":"Genuinely repulsive film - but that's a good thing!","rating":8,"date":"23 January 2011","review":"If ever there was a candidate for banning a film it's this. It's not giving anything away to reveal that there's a rape scene in this film but be warned it puts anything you saw in \"Last House on the Left\" the remake to shame. Graphic doesn't even begin to describe what the audience are subjected to by the voyeuristic intentions of director Stephen Monroe as he puts the audience in the front row seat for almost two hours of pure abuse.<br><br>But this is a good thing. Surely rape is visceral, brutal and sadistic and this film embodies all these elements. And once the reported revenge begins it's even more brutal than anything done to her.<br><br>Superb and bold performance from Sarah Butler in a role that is probably considered by most to be career suicide. When her character takes revenge it truly is the stuff that nightmares are made of and some scenes made me cringe for at least an hour afterwards.<br><br>Watch this one at your peril.This is highly recommended only for those who sit through a showing of cannibal holocaust without vomiting. Strong stuff indeed.One of the few examples of a remake vastly improving on the original.","user":"rhaynes1974","rank":[135,208]},{"title":"While a better film than the original, I still PREFER the original...","rating":6,"date":"12 October 2012","review":"I remember watching the original 1978 \"I Spit on Your Grave\" earlier this year and thinking that it packed one hell of a visceral punch while also carrying quite an angry proto-feminist slant. Yeah, it was obviously a low-budget exploitation horror picture with a strong feminist subtext, but it was both shocking and challenging on a deep emotional level - challenging everything you thought you knew about humanity, justice, violence, and revenge &amp; retribution.<br><br>Anyone who watches the film with an open mind will indeed find a powerful and angry film, one that takes no prisoners, nor does it try to play it safe for the safety and comfort of the audience. It was meant to shock, horrify, and provoke strong reactions and discussions.<br><br>These are things that the original \"I Spit on Your Grave\" (originally titled \"Day of the Woman\") and its 2010 remake of the same name, directed by Steven R. Monroe, have in common.<br><br>While sharing the same set-up - about a beautiful young novelist from the city named Jennifer Hills (played by Sarah Butler here, Camille Keaton in the 1978 original) who retreats to the backwoods to write her latest novel and is assaulted by a gang of country lowlifes and later exacting brutal, bloody systematic revenge against them - the remake is still very much a very different film. (It's a much better-made film, with better acting, writing and directing, and has better special effects. It's less raw and rugged, but it's somehow slightly more enjoyable.)<br><br>For one, the original 1978 \"I Spit on Your Grave\" and its 2010 remake are very much products of their time; Meir Zarchi, who directed the original and was also involved in the production of this film, was reportedly inspired to make the film after his encounter with a young rape victim back in the '70s. As such, he made a film that while it had an extremely low budget and no-name performers (though Camille Keaton was the grand-daughter of Hollywood acting legend Buster Keaton), was nonetheless compelling, challenging, and shocking. (How shocking, you ask? Well, movie critic Roger Ebert gave the film no stars and has been behind efforts to have the film both banned and blacklisted.) The original film, made in the wake of women's liberation, was also slammed as feminist propaganda - allegedly because it features a lone female exacting vengeance on her all-male gang of attackers.<br><br>By comparison, Monroe's film doesn't carry the same visceral punch to the gut that Zarchi's original did. It was raw, brutal, and ugly; and it was also saying something about victims and their attackers. But because horror films have been getting increasingly gorier in the wake of the \"Saw\" and \"Hostel\" films and their like-minded imitators in the \"torture porn\" sub-genre of horror, the violence here is really not all that shocking. The original film got by on its raw intensity alone, an element of the original film that was helped immensely by its low budget, which gave it an almost-documentary-style feel to it. The one drawback, however, was the original Jennifer Hills's all-too-convenient transformation from victim to avenger in too short a time frame.<br><br>As such, the 2010 \"I Spit on Your Grave\" seems to more or less conform to these current torture-porn movie standards, with Sarah Butler's Jennifer Hills character torturing her attackers in elaborately gruesome ways before finally executing them altogether. The one benefit of this is that a much longer time frame passes before Jennifer gets her sweet revenge, which makes her actions and subsequent transformation from victim to victor a little bit more believable. On the other hand, though, she's given to making cheesy slasher movie-style one-liners as she tortures her former tormentors to death.<br><br>Overall, while \"I Spit on Your Grave\" is a better-made film and I enjoyed it more, I didn't get that same level of intensity from it that I got from the original \"I Spit on Your Grave.\" Because it abides more by contemporary horror standards, it lessens the overall impact. It is still, however, a valiant remake that was not a complete waste of time (like most horror movie remakes).<br><br>6/10","user":"dee.reid","rank":[43,61]}]