[{"title":"New Moon","rating":6,"date":"20 February 2020","review":"Different than the first. I'm not going to say that I fully enjoyed watching it though. I do think that the production levels have stepped up a notch, the werewolves provide a nice touch to the ever dreary lens of Forks and surprisingly, Kristen Stewart is quite convincing as the heart broken Bella. But this is too long, too dull, with only a couple of scenes that ignite any real sense of danger and an ending that is contrived in the way that it sets up to the next installment.","user":"MR_Heraclius","rank":[36,37]},{"title":"A never-ending stream of awkward moments","rating":3,"date":"20 November 2009","review":"I will preface this review by saying that I have not read any of the twilight books, but I did watch the first movie before going to see this film, and I am looking at the series purely from a cinematic stand-point.<br><br>That being said, I thought this movie was a massive failure. The entire movie was very slow, long, and awkward. As I was watching it, it really felt like I was just watching a very long book unfold on screen, rather than a movie that is BASED on a book. To die-hard fans of the book, this could be considered a good thing, because all the fans really wanted to see was a movie that depicted all of the events of the book and followed it closely. By what I heard from book fans it seemed to have succeeded in that regard, but that is not at all to the film's credit. The film just moved from one scene to the next as if it was counting off a large check-list of scenes that the fans wanted to see, most of which just consisted of very uncomfortable and boring one-on-one dialogues. The film had very little momentum, and was tedious to watch. This was mostly due to the structure and pacing of the film but also due to the characters.<br><br>To be fair, some of the characters were likable, but they had very little chemistry. I already didn't quite believe Bella and Edward were in love in the first twilight. In this one I would flat out argue with Stephenie Meyer herself that the two characters were not in love. Their relationship was stiff, there seemed to be no real emotions between them, it merely consisted of silence, staring, and Edward randomly throwing out gooey love phrases like \"you are my everything\" and \"i didn't wanna live in a world where you didn't exist\" that just come out sounding hollow. There was a little more chemistry between Bella and Jacob, but even they were a bit awkward together. It seemed like none of the characters could say two words to each other without a ton of awkward pauses. The conversations were incoherent and annoying. There was a little bit of humor in the dialogue that I admit got some chuckles out of me, but even that came out of the awkwardness between all of the characters.<br><br>There were, however, a few welcome releases from the snail-like dialogue. Cinematically it had a few semi-redeeming moments. The score was likable, and a couple of scenes were artistically shot, but even so it was nothing that would deserve a best cinematography or best director nomination. The other well-needed break from the awkwardness came in the action scenes. They were very few and far between, and rather incoherent with the rest of the film, but they were enjoyable. The wolves were obviously CG in a lot of shots, but then there were some shots where they actually looked pretty real, and they were presented pretty well. They could have done a bit better job of foreshadowing them but hey at this point in the movie i was willing to accept what I could get. There was also a more intense scene near the end that I won't spoil that I thought was fairly well-done.<br><br>All in all, I did enjoy a few scenes in this movie, but as a whole it was slow, incoherent, poorly acted, and a bit uncomfortable. If you're a die-hard fan of the book, there's a chance you'll love it but if you're looking for a truly cinematic experience, this isn't it.<br><br>3 stars out of 10","user":"deathscythe_42","rank":[626,903]},{"title":"So BAD I find it funny","rating":3,"date":"19 November 2009","review":"I've read all the books. I know what happens. This never ruins a film for me.<br><br>I didn't want to see this film because the previous one was lacking in... well... everything. But girlfriend wanted to see it. I went in and was instantly surprised to see the demographic had widened past 12-16 year old girls who instantly swoon at any even remotely hot guy so that was interesting. It's not relevant to how good the film was- it just reaffirmed to me (and should to all of you) that hating a series on principle or having preconceived notions of how bad something will be is unfair on it.<br><br>Not in this case. It was still bad. BUT worth the money I payed to see it because though it most definitely not intended to be entertaining in the way I found it. It was full of melodramatic dialogue and bad acting which, if you take ANY Drama classes at school- Which Robert DIDN'T- you'll notice certain things about how people deliver lines. You notice how they're SAYING lines they have memorised with unnatural and stylised emphasis on the key words in the sentences without giving the (cheesy) dialogue depth or realism. Quite simply, it was so terrible I found myself resisting the urge to burst out laughing in a room full of fans who were probably misinterpreting the melodrama as \"Good, emotional drama.\" No. This film is ridiculous.<br><br>As it goes further on it gets less tightly stitched together and I had to become reliant on my knowledge of the books to fill in and pick up the slight gaps in dialogue and plot. They would say things that are based on something that didn't happen on screen (probably deleted scene for time) or their dialogue would just be terrible unrealistic lines that are work as standalone ones for a trailer but in conversation it seems like they're jumping slightly just to get to say something that is dramatic without it actually making too much sense.<br><br>BUT! It does have SOME redeeming qualities! The melodrama wasn't nonstop hilarity so thankfully something else held my attention. There was actual effort put into this film. The fight scenes actually used REAL special effects (something the first film was a bit cheap on) which actually looked kinda impressive. Any action was short lived unfortunately but what little there was, they did a reasonable job with.<br><br>I was impressed at the presence of transition. The previous film jumped and skipped and the next plot point just WAS without having been caused. This film (until near the end, of course) actually had a pace and a coherency to it that allows you to understand it without reading the books. This is a bonus. Certain things you'd think would drag on as the director tries to give you time to let the \"emotion\" \"sink in\" thankfully didn't take forever and the entire movie fit almost snuggly into its 2 hour length. Too bad it fell apart more and more it went along.<br><br>The film also shares the semi-awkward character interactions that create the same humour as the first one. Not as deliberately funny as the first one (though, as I said, it was pretty hilarious when it wasn't meant to be) though.<br><br>Though it was many failings with only a few things to back it up as being a reasonable film it will definitely make all you little teenage girls out there desperate to see Jacob's hell tanked up body very happy. You can HEAR the audience's reaction the first time Jacob takes his shirt off. He's got all you need: Pecs, biceps, ABS OF STEEL and minimal clothing. Too bad he lacks depth and real character. (Girls love obsessively devoted Zombies, they don't think enough to complain) It is NO WAY even NEAR one of the best films of 2009. NO ONE should say this ridiculous claim.<br><br>Really tossing up between 3 and 4 stars. Mmm. I guess a movie's highlight shouldn't be how low it sinks. 3.","user":"crazybilby","rank":[1,1]}]