[{"title":"Entertaining inside view in the former Baghdad. Some discomforting parts, but without political intentions (quote from film maker)","rating":8,"date":"25 February 2011","review":"I saw \"The Devil's Double\" at the Berlinale 2011. An unusual large number (over 300) stayed for the full 30 minutes of Q&amp;A after the screening. The producer warned us that we should expect not too much of the political impact of this film. It is better (his words) to regard it as just a gangster movie. We also learned that the stand-in situation that seemed compressed here in a smaller time frame, in fact existed for a full 4 years. We saw that Latif succeeded in keeping his hands reasonably clean, but it cannot have been real for such a time span. We still may wonder how much of this life he was pulled-in, against his will and his nature, but nevertheless being part of it.<br><br>According to the film maker, what we saw was in more respects not completely accurate. Some freedom was exercised while portraying the situation in Baghdad at that time. The existence of stand-in's, however, was realistic and publicly known. That went as far as showing them openly, if only to confuse potential attackers. It certainly reduced the risk in public appearances, since one could never know whether you saw the real one, or a double dressed and acting like the real one.<br><br>There were also questions about using English as the prime language. The producer had some arguments in favor of the choices made. Firstly, raising a 50M budget for a movie with Arabic speaking actors, was considered a Mission Impossible. Also, English is generally accepted as the standard movie language, spoken by Roman emperors as well as aliens from other planets.<br><br>The Q&amp;A also revealed some facts about how Dominic Cooper handled his double role. We now know that he played both roles on the same day, given the entourage and colleague actors present that day. He always played the \"lunatic\" parts first, and (without much time in between) the \"Latif\" parts shortly after that. Of course, there was a challenge in keeping track of the places where the counterpart actor stood at particular moments during the scene. Anyway, if he missed a few and looked in a wrong direction at some instances, I did not notice it and I think the same of other people seeing this film for the first time.<br><br>At various moments throughout the screening the notion crossed my mind that this movie could be construed as a justification of overturning the Sadam regime, or (in other words) as propaganda in favor of George W for a completed project in Iraq. In retrospect, I don't think such a hidden meaning was intended. The film was not against Sadam as a dictator in particular, but rather against dictators in general. They existed and ruled since the time of the Roman emperors (and probably before that), and still are ruling nowadays in countries all over the world. We see the wrong side effects of unlimited power. We also see how uncooperative people were regarded \"that is the thanks we get for uplifting this country\" (or variations thereof).<br><br>Political issues and hidden meanings set aside, we saw a well constructed story line, believable casting, and an inside view in the palace and its inhabitants at that time. One can argue about the torture, punishment and other violent scenes, that these better could be left out, or otherwise included implicitly by telling about it (without showing actual pictures). On the other hand, leaving these out would change the film too much into a costume drama, thereby reducing the impact it now will have on the average viewer. Anyway, it is easy for us to criticize choices being made by the film makers. In my opinion they did their job very well, all things considered.","user":"JvH48","rank":[125,140]},{"title":"One Of The Best Films Of 2011","rating":7,"date":"7 August 2011","review":"There are many ways to describe Uday Hussein, Saddam Hussein's oldest son. None of them are positive. <br><br>The Devil's Double is a \"take no prisoners\" film that's as hard to watch as it is entertaining. It follows Latif Yahia (Dominic Cooper), an Iraqi soldier from an upper class family, who is plucked from the war to act as Uday's double. Uday (also played by Cooper), remembers the comparisons the two would get when they jointly attended grade school. He asks Yahia to be his double - for both political and personal reasons. Like his father, Uday is in a constant state of worry over an assassination attempt. Further, he wants to send Yahia on personal trips that he himself doesn't wish to attend. Yahia, kind and warm, refuses, but is forced to with the threat of harm to his family. Yahia is given cosmetic surgery and dentures to complete the look.<br><br>Yahia is thrust into Uday's world. This is a world filled with rape, torture, murder, drugs, sex and money. The lifestyle that the Hussein's live is more than Presidential - it is royal. Immediately, Uday claims Yahia as his own property. Uday has grown into a monster, getting whatever he wants and never having to deal with the consequences. Yahia is who he wants. The atrocities he witnesses because of Uday disgust him, but he is stuck in this nightmare. We watch as Uday preys upon young girls walking home from school. We watch as he guts his father's best friend at a party. We watch Yahia struggle with the lifestyle he is forced to live. Uday's fascination with Yahia grows stronger and it enters your mind that Uday may actually be in love with his double. This doesn't necessarily mean in a romantic way, but because his love of himself is so great, that he sees Yahia as apart of himself.<br><br>While the rest, as they say, is history, I certainly don't want to spoil the way the rest of the film plays out. This is a movie that you must see for yourself!<br><br>The acting in dual roles by Cooper, his first film as lead, is Oscar worthy. He gives both men their own voices, mannerisms and idiosyncrasies, that instantly allow the viewer to tell them apart. Subdued and stoic, Cooper plays Yahia as a guilt ridden man, grappling with the life he has been thrust into. He plays Uday as a manic, hyper madman with a broken smile and a creepy laugh. You literally believe they are two different actors.<br><br>Latif is an ordinary man who is thrust into an extraordinary situation. An object of admiration for the President's son, he has no choice but to comply with the excruciating horrors that are put forth before him. Never once, however, do we seem his morals waver.<br><br>We know how it ends, but as with life, it's the journey that's important. The Devil's Double is the real life, Middle Eastern Scarface. Powerful, unsettling, thrilling and always entertaining, The Devil's Double, is quite easily one of the best movies of 2011.<br><br>From PopCultureWhore.com","user":"PopCultureWhore","rank":[78,93]},{"title":"A must-watch for Cooper's performance alone, but expect to be troubled as well as thrilled throughout.","rating":18,"date":"18 August 2011","review":"The posters for director Lee Tamahori's The Devil's Double (18) declare it to be \"Scarface of Arabia\", referring both to Brian De Palma's 1983 gangster opus Scarface and the film's setting during Saddam Hussein's brutal rule in Iraq. The Devil's Double is based on the true story of Latif Yahia, an Iraqi soldier chosen by the regime to be the body-double of the dictator's infamous son Uday, with both roles played by Dominic Cooper.<br><br>The perks of the job are acceptable: enough designer clothing and willing women to make the average Premiership footballer looking like a trappist monk. However, the downsides are considerable too: torture, being shot at – and the fact that the penalty for seeking alternative employment is the death of Latif's entire family.<br><br>Dominic Cooper stars in Devil's Double with Ludivine Sagnier.<br><br>Dominic Cooper stars in Devil's Double with Ludivine Sagnier.<br><br>It is easy to see why The Devil's Double has been compared to a gangster film. All the whirring, terrifying madness of Uday's world is depicted with the brutal verve one finds in Scarface and other films of its ilk. Instigating nightclub orgies while American bombs are exploding and shooting at loyal companions in psychotic rages are all part of Uday's regular routine.<br><br>The direction, intermingling footage of Operation Desert Storm with debauchery, captures the craziness of Uday and Latif's world with a lurid style.<br><br>Again, like a great underworld film, Cooper's performance as the central villain is masterful, capturing Uday's menacing madness and chewing the scenery in between sucking breasts or shovelling cocaine up his nose. His performance as Latif is equally striking, but in a more nuanced way. We are never in doubt which one Cooper is portraying; his sickened desperate body language showing through even when Latif is Uday.<br><br>Yet this film is not Scarface, and Uday is not Tony Montana. Tony Montana, like most anti-heroes found in films depicting criminals, had a form of morality. It may have been a twisted, cocaine-fuelled morality but it was one none the less. Uday has no morality; worse than that, he's evil even by the standards of his father, a man who thought nothing of gassing entire ethnic groups. This gives the film a heart of darkness. Uday is possibly one of the most horrifying characters ever to grace a cinema screen, proving it at regular harrowing intervals with crimes of a scarcely believable depravity.<br><br>This leads me to the film's central flaw. Despite Cooper's performance, Latif's story never quite feels as compelling as it should be. The script at times makes a good man's forced descent into hell on Earth seem more like a mob underling's troubled conscience upon witnessing his boss go too far. One scene, which directly juxtaposes his actions in saving others from Uday's horrors, doesn't have anywhere near the emotional resonance it should. One gets a sense that in trying to show us a world in which a moral compass is more likely to be thrust into the genitals of an innocent than providing any sort of guidance, the film has lost some of its humanity along with its protagonists.<br><br>Despite these flaws, though, The Devil's Double is still an excellent film. It is a brave attempt to portray a difficult and scarcely believable story. Even its failure to completely emote is understandable given the skill with which it presents its harrowing world. Due to this, and possibly the performance of the year from Dominic Cooper, its flaws are eminently forgivable.<br><br>Verdict: ●●●● A must-watch for Cooper's performance alone, but expect to be troubled as well as thrilled throughout.<br><br>Read more reviews on www.theupcoming.co.uk","user":"info-130-288696","rank":[44,52]}]