[{"title":"Funniest (and most surprising) movie of the year","rating":10,"date":"22 September 2011","review":"Reading the reviews for this film, which range from very positive to strongly negative, I was intrigued to see what the disagreement was all about. After seeing it (and it wasn't easy, as it was a bit of a drive to the nearest theater showing it), I totally understand what it was that divided the critics. <br><br>For the haters, it seems they assumed a movie with the word 'orgy' in the title (for some reason they ignored the 'good old-fashioned' which made it clearly intentionally silly) would have to be a dumb, sex-filled romp. When it turned out to be a really smart and sweet exploration of friendship through the device of group sex, with minimal raunch, there seems to have been confusion and even anger. <br><br>For those who didn't find the movie funny, I have no idea what movie they saw. The screening I went to was packed with laughs, but the movie actually goes a lot further than just hitting the comedy (which it does brilliantly). It's a generational movie about adults who grew up in the shadow of AIDS, ergo a sex comedy about people who are afraid of sex. The more we get to know the group of friends, the more we care about them and their journeys, in addition to the comedy of a group of neurotic New Yorkers trying to pull together a night of reckless sexual abandon. It works on multiple levels and is far smarter than you might expect it to be (which is what a lot of the positive reviews have pointed out).<br><br>I'd compare this movie more to The Big Chill than one of the American Pies, and the cast is one of the strongest ensemble comedy casts to come along since Dazed and Confused. It's a movie people are going to be watching and talking about for years to come, so check it out now while it's still in theaters because seeing it with an audience really adds to the experience.","user":"bgreddly","rank":[80,114]},{"title":"Jason Sudekis and friends have \"A Good Old Fashioned Orgy\"","rating":26,"date":"26 August 2011","review":"A Good Old Fashioned Orgy stars Jason Sudekis as Eric, a 30-something loser who's never quite grown up. Him and his buddies, including Duquez (Martin Starr), Adam (Nick Kroll), McCudden (Tyler Labine), Willow (Angela Sarafyan) and Alison (Lake Bell) among others find out that Eric's dad is selling the beach house in which all of their ludicrous parties take place. When Eric figures this out, he wants to throw a final labor day bash, a party so ridiculous that it will make all their other parties look mellow. So Eric and McCudden decide to have an orgy with them and their closest friends. This plot is about as raunchy of a plot as you can get, and I am glad to be sitting here telling you that A Good Old Fashioned Orgy delivers on this premise. With so many comedies this year like Bad Teacher and Hall Pass really holding back the raunchiness and trying to play it safe, it's refreshing to see a film that just goes for it. This film isn't as raunchy as some might expect from its title, but it's pretty damn raunchy, as well as daring, funny, likable, and even a bit touching. Everyone in the cast, from Sudekis to Starr to Bell to Sarafyan to Labine is hilarious, and there's not a bad character in the film. Will Forte and Lucy Punch play newlyweds with a kid who the group decides not to invite to the orgy, and they're great as well. Now, while this film is probably the funniest film of the year so far, it's pretty predictable. That's my only VERY minor complaint with the film. Overall, if you like any of these cast members and you like your comedies raunchy and daring, then go check out A Good Old Fashioned Orgy.","user":"Jackpollins","rank":[49,72]},{"title":"Fun, if you keep your expectations low","rating":5,"date":"23 June 2012","review":"Everyone knows that folks in the '60's and '70's did some serious swinging, and from what you hear about young people today, you get the impression that they only stop slurping each other's privates when they take a break to send each other naked pictures on their cell phones. So what happened to people like me, who came of age in the '80's and '90's? AIDS, that's what. We grew up hearing that sex was a scary, dangerous thing that could kill you. It didn't completely stop us from having sex, but it probably did cut down on the debauchery. \"A Good, Old-Fashioned Orgy\" is the story of a group of 30-somethings who set out to remedy that.<br><br>Eric (Jason Sudeikis) and his group of high-school friends, which consists of several cute chicks and an assortment of dorky guys, have grown up partying at Eric's dad's beach house. When his dad puts the house up for sale, the friends see the end of not only their epic parties, but of the free, irresponsible chapter of their lives. (Which, given that they are about 30, they have stretched out pretty far, anyway.) Eric convinces the group to see the beach house off with one, last epic soire, a good, old-fashioned orgy between friends.<br><br>You see the title of this film, and you figure it will be a fun sex-romp, and eventually it is, but they do take their time getting there. This is a story about 30-year-olds belatedly coming of age, so first they have to set up the many characters and their first-world issues. This is less a story about an orgy, and more a story about people realizing that they can only stretch their adolescence out so far, and I wish the film had either done a better job exploring that theme or just focused on the sex. In any event, it's a moderate amount of fun. Sudeikis plays a funny, charming ladies' man, and Tyler Labine is pretty good as his fat, crude sidekick. There's one really funny scene that makes the whole film, where the guys do some research in an underground sex club. Basically, much of the movie is a less good- looking, less funny version of \"The Hangover.\" Also, in keeping with the modern trend, there are more naked, male buttocks on screen than naked, female breasts, and my wife points out that the male buttocks aren't all that great. \"A Good, Old-Fashioned Orgy\" is fairly fun and funny, but if you are looking for soft-porn you will do better with \"A Game of Thrones.\"<br><br>2.5 stars out of 5","user":"themoviecouch","rank":[12,15]}]