[{"title":"Definitely worth a watch","rating":8,"date":"24 February 2013","review":"Yes, it's is a quirky little flick. And yes, it may unnerve (or perhaps irritate) some viewers. But there is no doubt it carves it's own path, and a fairly unique one - which isn't easy to do nowadays.<br><br>I'll start by saying that it's a very funny movie at times - in an awkward sort of way. And I enjoyed it just on that level. But after it was over it I realized it had a much more impressive affect on me.<br><br>It probably won't be obvious until the end that there was a lot of care put into the direction and dialogue of this movie. Characters who on the surface seem broken and wayward end up being not much different from you and me. Their delivery is different but their longings are the same. And the director did an ace job of making that point. It's done subtly and he timed the peeks into each character's nature perfectly. It really is a very skillful little movie.<br><br>If you come across it, check it out, and don't abandon it after five minutes because it seems too odd. It's well worth the run and I'm pleased I saw it, almost thankful actually.","user":"tickin","rank":[55,60]},{"title":"Smart, Quirky, a recipe for all appetites!","rating":10,"date":"6 March 2013","review":"I read the novel this film was based upon, back when it was a gift from the author, a family friend. I found myself mentally casting actors to play the amazingly quirky but identifiable characters. A great amount of time passed before \"Small Apartments\" found its way into the hands of a director who \"got it\".<br><br>I have to say that it is difficult, for me, not to compare this work to that of Tarantino, if only for the raw emotional concept, quirky behaviors and \"street view\" filming process. However, the combination of Millis (who wrote both the novel and the screenplay) and Akerlund (the director) bring the dark side of everyday humanity into perfect view without glorifying the gore and violence so many filmmakers succumb to. The violence is acceptable, even necessary, as are the few sexual scenes that lend credence to the story and personalities that make up this labor of love. Tarantino's got absolutely nothing on these guys!<br><br>The cast is, well... correct! I can't imagine anyone other than the \"heavyweights\" who breathe life into characters like Franklin Franklin (Matt Lucas), Burt Walnut (Billy Crystal) and Tommy Balls (Johnny Knoxville) but it doesn't stop there. You've got the talent of James Caan, Amanda Plummer, Juno Temple, Dolph Lundgren and veritable unknown, Scott Sheldon, who makes his few moments as Officer Smith a lasting impression. The casting list is mighty and recognizable, but these folks were drawn to the characters created by Millis and the vision of Akerlund, rather than a paycheck. <br><br>There is a story, one that compels us to realize how little we understand one another in this all too short existence on the planet and lays bare our preconceptions and misconceptions of who we see and how we react and assign personal judgement. You don't need to be a \"deep thinker\" to get this film and that's the beauty of it.<br><br>The old saying that \"money can't buy happiness\" is true and untrue... both are addressed in Small Apartments, however, it brings home the very real point that true happiness lives in our mind, however small or large!<br><br>I was both eager and apprehensive about finally watching this film, especially knowing the author, screenplay writer and executive producer (Chris Millis) on a personal level... I'm so glad I gave in to eager! Bravo! This is a must see!","user":"ncbronte-120-891032","rank":[39,45]},{"title":"A diamond in the rough","rating":8,"date":"2 October 2014","review":"I went into watching this movie expecting another indie drama with a big ensemble cast and just enough quirk to be cool with the hipsters. Turns out, this is probably one of the best movies I've seen in years. The plot revolves around Franklin Franklin, a bizarre man living alone in well, a small apartment, and his interactions and excursion with his various neighbors. I completely understand the negative reviews from critics, because the movie isn't perfect, There is some bizarre writing and story choices that might not bode well with audiences, but I honestly think that this movie is, in a way, a masterpiece. The characters all start off weird and somewhat repulsive, but as the movie progresses you begin understanding them and you begin to feel for them. There is rarely a movie that made me feel as much for the characters as I did in this movie. The reason for that is that the acting was fantastic, everyone played their character greatly, and there were little to no weaker parts to the performances. To wrap up, I highly recommend it if you can deal with some weird and bizarre, It's all worth it in the end.","user":"myers-family","rank":[10,10]}]