[{"title":"A simple, dramatic story told well through emotional performances","rating":8,"date":"30 October 2010","review":"\"Conviction\" is a simple, dramatic story, told well. Betty Anne (Hilary Swank) puts herself through law school for the sole effort of freeing her innocent brother Kenny (Sam Rockwell) from a life-sentence in prison for murder. Swank and Rockwell both carry this emotional film on their very strong shoulders.<br><br>There are very few courtroom scenes, very few law school scenes, but it is filled with emotional connections between brother and sister as she visits him in prison, and as she tries living her own life. The characters dominate the beginning of the film, and the steps Swank has to take to free Rockwell keeps the film going towards the end.<br><br>It is shot well, as this is clearly Massachusetts and it set the right feelings for the film without overpowering it. The highlights are Swank and Rockwell as they both play characters with elements that we have seen before that have given Swank Oscar wins and have given Rockwell popularity. Here, he has toned down his comic antics just enough for his performance to remain popular but should also give him his first Oscar nomination.<br><br>The story may be missing a few elements that would have given it more substance to make it more interesting, but it seems to me, that's because the film-makers had a few restrictions in keeping to the true story. This may actually be a true story and not just based on one.<br><br>I recommend \"Conviction\" for its emotional performances and for telling its simple story well.","user":"napierslogs","rank":[55,62]},{"title":"Swank Is Back with a Sharp Cast in an Inspiring Fact-Based Story Bordering on Incredulity","rating":8,"date":"23 October 2010","review":"After making decidedly wrong turns into rom-com in 2007's \"P.S. I Love You\" and historical biopic in 2009's \"Amelia\", Hilary Swank is back in her element as Betty Ann Waters, a working-class single mother of two whose fierce loyalty to her troublemaking brother Kenny knows no bounds, in actor/director Tony Goldwyn's time-spanning, fact-based 2010 drama. Written by Pamela Gray (she and Goldwyn also collaborated on 1999's affecting \"A Walk on the Moon\"), the inspiring, potentially melodramatic plot line often borders on incredulity, but Swank's trademark iron-jawed tenacity is on full display here. At the same time, it's a primarily economic performance teetering on lunacy as her character is tightly bound to Kenny since they shared a painful childhood due to the neglect of a horrifying mother.<br><br>In 1983, Kenny is convicted of the bloody murder of an elderly neighbor largely on the basis of testimony from two former girlfriends, both of whom claimed he confessed his actions to them. Neither Kenny nor Betty Anne can afford a good attorney, so she decides to become a lawyer even though she's a high school dropout. Also serving as one of the film's executive producers, Swank come back securely to the against-all-odds territory of Clint Eastwood's \"Million Dollar Baby\" (2004) by following Betty Ann's sixteen-year journey from her GED through college, then law school, and finally passing the bar – all while she was raising two boys and working part-time at a local pub. The ending is predictable from a mile away, but the journey is not. The introduction of DNA evidence provides a linchpin that spins the story close to Lifetime-level dramatics, especially when Betty Ann solicits the assistance of the Innocence Project, a nonprofit organization devoted to overturning wrongful convictions. Gray's screenplay is solid enough, and Goldwyn's direction is assured within the back-and-forth treatment of the timeline.<br><br>However, it's really the acting that is aces here. Beyond Swank's sterling work, Sam Rockwell brings an unpredictable furor and a surprising vulnerability to the showier role of Kenny. His rapport with Swank never feels forced, and the devotion of their sibling relationship is what really grounds the threat of hysterics in the film. The periphery is populated by a powerful squad of actresses turning in sharply etched work - Minnie Driver as Betty Ann's law-school friend Abra, whose comic spark highlights how pivotal her character is in representing the audience viewpoint; Melissa Leo (\"Frozen River\") as the malevolent arresting cop, whose secretive hostility provides the impetus for Kenny's conviction; Juliette Lewis as Kenny's dentally-challenged ex-girlfriend with a drunken confession scene that reveals the actress's long-forgotten raw talent below her usual giddiness; Karen Young in a brief scene as the unforgivable Mrs. Waters; and Ari Graynor (\"Nick and Norah's Infinite Playlist\") as Kenny's embittered grown daughter. It's the cast's cumulative work that makes this movie intensely watchable.","user":"EUyeshima","rank":[60,70]},{"title":".Conviction - one of the best films of the year!","rating":10,"date":"31 October 2010","review":"Loyalty: It something we all expect from our loved ones, but we so rarely receive. How loyal would our families be if we were convicted of a crime we were innocent of and sent to prison for the rest of lives? Would they put all their worldly desires away to do everything in their power to see to our injustice? I dare say that I know that it takes a special few that have such perseverance or such conviction.<br><br>Hilary Swank stars in the film so aptly titled Conviction. Here again Swank portrays the real-life Betty Ann Waters. Betty Ann's brother, Kenny was convicted of a violent murder in their home town in Massachusetts and sent to prison in 1983. Betty Ann and Kenny grew up in a dysfunctional home and were tossed around to a plethora of foster homes during their childhood and adolescence. The only family they had was each other. Their relationship was so close and intimate that there was no doubt in her mind that her brother was incapable of murder. Kenny was a self-admitted bad boy. He had been arrested so many times in their small community that when Kenny's neighbor turned up murdered it seemed to be an easy assumption that Kenny was the perpetrator of the crime.<br><br>Betty Ann had no money for high-paid lawyers and when Kenny tries to kill himself in prison, she came up with a solution to their problem. She will go to college, then law school and then become a lawyer and find the evidence to set her brother free. This sound like a plot made-up in a studio office, but it is the true story of this amazing woman. And, there would be no movie, if Betty Ann's astounding story didn't have a happy ending.<br><br>Telling this story is difficult. But the even script by Pamela Gray provides a good point of departure for Tony Goldwyn's direction and the moving performances by the actors. Without hesitation, Hilary Swank is definitely back, her disappointing performance as Amelia Earhart last year could have ended her trip down the red carpet to win Oscar gold forever. Her performance playing Betty Ann is subtle and convincing. But it's not just Hilary Swank's performance that should be noted. Sam Rockwell's portrayal of Kenny Waters is amazing and heart-wrenching. His scenes in prison are remarkable as he so effortlessly depicts the wide range of emotions from complete hopelessness when years of imprisonment wear on him to utter joy when he learns that his sister has done the impossible. And lastly, Minnie Driver makes a great impression playing Betty Ann's law school friend. It's a role that could garner attention at award time, and hopefully will lead to more roles in the future.<br><br>Conviction is one of the best films of the year. Its story of never-ending loyalty and love of a sister. It is inspirational and uplifting. This film will make you believe again, that with desire, perseverance and the conviction to never stop trying, almost anything is possible.<br><br>For more reviews and news written by Kay Shackleton, see here: www.examiner.com/movie-awards-in-national","user":"TheMovieGal","rank":[75,93]}]