[{"title":"A different interpretation of the ending.","rating":10,"date":"24 April 2012","review":"Please don't read this if you don't want the ending given away.<br><br>I've noticed a lot of people complaining that the ending spoils the film and is clichéd because the underdog and not the better fighter wins.<br><br>I'm not suggesting that my interpretation is the right one but my view is somewhat different than the one some people hold. It is perfectly logical to point out that Brendan had hard fights to get to the final and that he would probably have been exhausted and that Tommy has had a much easier route.<br><br>However, the point is that he made that route easier because of his rage. Tommy is only the more destructive force because of that. His demons are driving him on because he is lost. He cannot or will not reach out to connect with his father or brother. The point is that the dam is broken when he sees his father in the hotel room raging against Ahab. This is deeply symbolic. I think you are meant to draw the connection with Ahab who was driven by his own rage with the rage of the father which destroyed his family to the rage which Tommy now feels. Even though he is drunk it is no coincidence that his father refers to Tommy as Ahab and bellows at him to stop the ship. At the point that Tommy takes him in his arms and holds him he begins the healing process but loses what makes him such a formidable fighter. Thus he is simply unable to blow his brother away in the way that he has done to every other opponent.<br><br>The other crucial point (and you would have to be a younger brother to fully get this one) is that Tommy doesn't really want to beat his brother at that point. He needs to know that his brother loves him and perhaps that he regrets not reaching out to him when they were younger. The fact that he taps out only at the point when Brendan says he loves him is significant as is the fact that he breaks down in the corner before the final round. Had he still been carrying his rage he would surely rather have been rendered unconscious than submit.<br><br>In other words, for me it was the perfect ending and the more you think about the film the more profound it seems.<br><br>All in my view of course. Which could be a load of old rubbish.","user":"Keith_545","rank":[304,327]},{"title":"A great film","rating":10,"date":"4 September 2011","review":"Just saw a sneak peek of Warrior. All I can saw is WOW! Great film. Great performances. The characters are deep and believable and the story will probably have you leaving the theater in tears.<br><br>The fight scenes were done really well. I've been cage side at hundreds of MMA fights as a photographer and believe me when I say this is some of the most realistically portrayed MMA action I've seen to date on film. <br><br>Tom Hardy, Joel Edgerton, Jennifer Morrison and Nick Nolte all give good performances and I think Nick Nolte had a couple of moments in the film that should be considered Oscar worthy.<br><br>I know a lot of people won't agree with me on this and I can understand, but Warrior has bumped Rocky out of my top 5 favorite movies of all time. IMHO (which some of you will consider worthless) I think it's that good.","user":"kell-bailey","rank":[508,623]},{"title":"Not just for fight fans...","rating":9,"date":"27 August 2011","review":"My girlfriend took me to an advance screening of Warrior because I'm an MMA enthusiast. She told me she did not expect much. She ended up leaving the theater in tears.<br><br>The fighting in the movie is almost an after thought. What the movie is really about is a broken family trying to get on with their lives. You have a recently sober father trying to earn the forgiveness of his sons for destroying his family years earlier, one son trying to provide for his wife and children, and the other son trying to earn money for the family of his friend and fellow Marine who died overseas. All of it comes together seamlessly and provides for a truly gripping movie.<br><br>It's emotional without being sappy. It's funny without being goofy. It's inspirational without going over the top. It's hard to say anything bad about it. Even if you have no interest in martial arts, you will get something out of this movie.<br><br>I highly recommend this movie for men AND women, fight fans and average Joes alike.","user":"FloppyMeatball","rank":[274,332]}]