[{"title":"Great","rating":9,"date":"24 February 2020","review":"I was not prepared for the visuals this movie offered. Nevertheless, I absorbed it in its full glory. It was easy to enjoy this movie not only because of its visuals but also because of the quirkiness and lovable characters. A must-watch!","user":"MR_Heraclius","rank":[41,43]},{"title":"One of Marvel's best","rating":10,"date":"14 February 2017","review":"This movie is fantastic. I truly enjoyed watching it! <br><br>Unlike most other movies of Marvel franchise, there is a heavy emphasis on character development. This keeps audience glued to the story on a deep cellular level.<br><br>The movie is littered with spiritual themes which adds further depth to this already amazing story.<br><br>Those who like movies and TV series of medical genre are in for a treat. As the title suggests the story involves a doctor.<br><br>I also like how the story blends in and moves forward, in prefect synchronization. Particularly given the complexity of the plot. Quite a tribute to the three screenwriters.<br><br>Great movie, can't wait for the next one!","user":"maxnexus-97144","rank":[71,91]},{"title":"Superb Visuals Accompanied by a Solid Script","rating":8,"date":"5 April 2017","review":"Doctor Strange follows a surgeon who, after suffering from a major injury, sets out to search for healing. Instead, he ends up learning about magic. <br><br>The movie opens with a scene that is both darker and funnier than most Marvel superhero movies I've seen. It sets the tone really well, and it actually manages to carry that all the way through. It is comedic, yet it maintains a level of urgency or threat to the entire situation that the characters constantly find themselves in, keeping the audience intrigued for most the entire duration. <br><br>The special effects were probably the biggest selling point for this movie. For me, anyway. I made a point of getting it on blu-ray, and it paid off. The effects are pretty trippy (for lack of a better word), and that's really all I'm going to say about them. I wasn't sure they always made sense in the context of the movie, but they were still pretty cool. <br><br>Unlike other Marvel superhero movies I've seen recently, this one is actually funny. The character of Stephen Strange is actually fleshed-out and realistic to an extent. He's an engaging character with plenty of faults and just as much charm. He's a fun character, and I get the feeling Eggs Benedict Cucumberpatch felt the same. In fact, basically the entire cast seems to be having a jolly ol' time making the movie. There's just this air of fun surrounding it. <br><br>The writing is actually pretty good, with dialogue that comes expected of a particular character, and a plot driven in a direction that makes sense and ceases to be boring. I never found myself questioning a character's decisions due to pure stupidity, nor did I find myself dozing like I have through the last few movies. It manages to build an intriguing world without revealing too much or boring the audience with lore and exposition, yet it gives us just enough to keep us interested. <br><br>Overall Doctor Strange is both fun and funny, clever and pretty, well acted and well-written, and is just an all-around great movie. It's a step in the right direction for Marvel, and I'm hoping to see them continue in this direction. In the end I would recommend this movie.","user":"SquigglyCrunch","rank":[53,71]}]