[{"title":"The Tourist","rating":7,"date":"19 February 2020","review":"The story moves too slowly, but it is interesting and Depp and Jolie are well suited to their roles. There is kind of a smoldering intensity to their characterizations that others have mistaken for lack of chemistry. I found them to be delightful together. The story has some twists, but none too surprising. An enjoyable if somewhat relaxed action movie.","user":"MR_Heraclius","rank":[37,38]},{"title":"Pure Old-Fashioned Hollywood Fantasy Like the Grant-Hepburn-Kelly films of the1950's and 1960's","rating":7,"date":"8 March 2014","review":"\"The Tourist\" is very similar to some of the Hollywood escapist fair of the 1950's and early 1960's with the likes of Cary Grant, Audrey Hepburn and Grace Kelly. In several films during this era, Grant played an American in European exotic locales dealing with espionage in relatively light-hearted plots. The classic films of this ilk which come to mind are \"To Catch a Thief\", \"Charade\", even \"Roman Holiday\", taking place in Monte Carlo, Monaco, Paris, and Rome. In \"The Tourist\", Depp plays a Cary Grant-like character and Angelina Jolie has the long dark hair of Audrey Hepburn with the demureness of Grace Kelly. The action begins in Paris then moves to Venice.<br><br>The best thing about the film is the opening. The viewer is plopped right into the middle of things without any background or knowledge. A demure mystery woman (Jolie) arrives at a café in Paris near the Champs-Elysees and orders her usual, which we learn is already being prepared. She's a regular. A mysterious note is given to her and provides detailed instructions concerning exact steps she's supposed to take right after leaving the café. While she is reading the note, we learn she is being staked out by government officials. Part of the instruction says \"...pick someone with my height and build and make them believe it is me...\" She burns the note and makes her way to the central train terminal in Paris. <br><br>Part of the fun of the story is that we don't know who wrote the note, and part of the mystery-fantasy is a gradual revelation regarding who the unknown letter-writer is. (The voice-over for the note is Jolie, which is somewhat confusing at first, because the writer is male.) On a train to Venice, she meets a clueless American tourist from Wisconsin, Frank, played by Johnny Depp. Depp (who doesn't exactly seem like a clueless tourist from Wisconsin) acts flattered that a woman who just walked out of Vogue Magazine would sit by him on the train. And so begins a rather fun, if somewhat improbable, misadventure. Depp appears to be someone \"with my height and build\". Two factions are on the trail on the unknown \"letter-writer\": Scotland Yard authorities who believe he has not paid back taxes on a transaction worth several billion British pounds, and an international mob run by an older baddie who would kill not only a man who cheats on his wife, but he'll kill his wife too, and all the members of both families. He would even kill the man's doctor, just for good measure. The mob boss lost billions to the mystery man who was once a trusted part of his organization. Part of the plot is the tried-and-true \"mistaken identity\" device in which the authorities and the mob appear to be confusing the clueless tourist with the unseen letter-writer. Everyone is sure the man they want is Depp.<br><br>A fun fantasy which combines elements of romantic-comedy and international espionage. There are a couple of obligatory chase scenes and even a romantic interlude or two, with the compulsory ballroom and casino scenes. What makes it work are the fine performances by Depp and Jolie. The ending is pretty interesting, but there are aspects during the film which don't quite mesh with the information presented previously. But if you're willing to suspend your disbelief and let your imagination run wild, \"The Tourist\" is a fun treat, sort of like a nice bowl of vanilla ice cream. French vanilla of course on Viennese China.","user":"classicalsteve","rank":[17,17]},{"title":"Frothy fun - goes down like an éclair","rating":7,"date":"11 December 2010","review":"Opening day (a Friday) enough of the critical reviews I read were negative enough, that I was asking 2 friends if they wanted to switch films - money is tight, yah know? But we agreed there was nothing wrong with checking The Tourist out, at worst there would be some eye candy.<br><br>Once again, I'm glad I blew the critics off - it's not that the negative reviews are wrong, exactly. There ARE too many scenes of entire rooms of people turning around to look at Jolie, like a perfume commercial (or someone with toilet paper stuck to their behind). Characters and relationships aren't fleshed out enough, and it's a predictable film - North by Northwest is far superior.<br><br>But. As one critic said, it's a frothy diversion, pleasant and fun. Thought the rumpled Depp was low-key and charming, and Jolie was gorgeous and a sympathetic character. There are some amusing twists, and our fairly full theater laughed a lot and was entertained by the film; at no point did any of us lose interest. There are far worse ways to spend a Friday night, and I'd recommend to anyone looking for some diversion and gorgeous views of Venice. Good for anyone looking to unwind after a long hard week.","user":"archravenstorm","rank":[250,348]}]