[{"title":"Unusual Review Notes for an Unusual Movie","rating":7,"date":"27 June 2017","review":"That the movie succeeds is a credit to Hunnam, who comes of age both literally and figuratively in this movie with a performance of great humility, charm, and grit. A far cry from his breakout role as a motorcycle gang leader, and an even further cry from his awkward performance in Guy Ritchie's unique (and hopefully never-to-be-repeated) view of young King Arthur as a slum thug.<br><br>Props to audiences worldwide who are connecting with a 2 hour and 20 minute opus that is as far from the new Transformers attempt as the earth is from the moon. Shows that quality film-making will always find an audience.<br><br>Would have been nice if the script were historically accurate but perhaps that is asking too much. <br><br>Ironically, because of the internet, the amount of solid new archaeological evidence being released each 24 hours in today's world would be the equivalent of ten years of time in Fawcett's era. In particular, I am referring to the material of late which suggests lost civilizations submerged in both the Atlantic and the Pacific over 12,000 years ago (see Graham Hancock's lectures for more, most free on Youtube) would explain how Brazil, centered between the two, could indeed have hosted a \"lost city\" which, thousands of years ago, entertained guests from both realms.<br><br>Finally -- for hard-core history buffs only -- the written diagrams preserved even today in the Archives of Rio de Janeiro (\"Folio #512\") which constitute the last known \"communication\" from the ACTUAL final, ill-fated, Fawcett expedition were discredited because \"experts\" of the day claimed they contained elements of different language roots, not one root, and hence \"must\" be fake. However, if indeed the area was a centerpoint between two now-lost civilizations originating in two different oceans, the multiple language roots would be expected and natural, and not an indication of fraud.","user":"A_Different_Drummer","rank":[238,304]},{"title":"Massive let down","rating":3,"date":"28 March 2017","review":"It's a really good example of how a terrible script can completely destroy a movie. There are too many things which make no sense to list, but the key issues are:<br><br>For a film that seems so keen to virtue-signal about white ignorance and racism, it does nothing to explain to us Fawcett's theories about the people of Z. Who were they? How did their civilisation operate? Why did they disappear? Surely these explorers would have built up far more of a picture from the surrounding tribes, artefacts, and previous finds. There is a tiny smattering of these things, but in 2h21ms nowhere near enough to build up a mythology. Therefore it's difficult to see why this obsesses Fawcett. You literally get more detail from the quests in the Indiana Jones movies.<br><br>Instead it focuses relentlessly on the most tedious and dangerous aspects of the trips, their suffering, or switches back to London with almost every old man of course a stiff- upper-lip racist and sexist cliché. Imagine a more insidious General Melchett from Blackadder Goes Forth and you won't be far off.<br><br>There is an extremely cringey attempt to insert a modern feminist perspective. At one stage, Nina wants to go on the expedition. Her reasoning? She found an important document relating to it. This apparently makes her equal to Fawcett's many years of soldiering and survival skills. It's clumsy and anachronistic. The trip could very well kill them both and so would leave their children orphaned. Surely a more logical argument would be whether he has to go at all. He is, after all, a father, and has responsibilities at home.<br><br>The First World War section adds absolutely nothing and captures none of the horror of the battlefield. It's all just tally-ho chaps, almost Hallmark channel-like. Just awful.<br><br>Sienna Miller, Robert Pattinson and especially Charlie Hunnam wring what they can from such a sparsely-written script and should be commended for that, which is why this isn't a 1.<br><br>Don't be fooled by the title - it's not about a lost city or even a lost man. It's a lazy and pretentious destruction of what could have been a thrilling find.","user":"peter-stead-740-486963","rank":[339,530]},{"title":"Someone managed to make the exploration of the Amazon incredibly dull.","rating":2,"date":"29 March 2017","review":"*****Spoiler Alert**** I was really looking forward to this film, as how can the exploration of the Amazon be anything other than amazing? Well I was wrong, this was utterly boring, excruciatingly dull and just plain awful. I can only give it a 1 out of 5 rating. After the first 30 minutes I was looking at my watch and wondering if I should bother, as I had more important things to do, like clean the oven. How can anyone make the exploration of the Amazon so tedious? This could have been like real life Indiana Jones! There was absolutely no sense of danger at any point, just flat as a very thin pancake. The film should really be re-named The Lost City of Zzzzzzz.<br><br>It was a truly odd film, this bloke gets asked to go Bolivia for the Royal Society to do some maps and stuff, doesn't want to go, But they offer him a shiny medal so he goes (leaving his wife and new born son), has a rubbish time, comes back to London, goes back to the Amazon (leaving wife, and second son), comes back to London, Goes to France for WW1, comes back to London and then goes to Amazonia again... For Heaven's sake man - just choose one! I shouted through gritted teeth.<br><br>It's terribly directed and the cinematography is really bad (and I say this as a trained cinematographer). It's so dark that I actually wondered if the bulb in the projector was bust, but then it would cut to a scene outside in a garden and it would (almost) be correctly exposed. Some interiors were so badly lit I actually couldn't see who was speaking, and a huge number of shots were so out of focus I again wondered if we were watching a dud print. <br><br>There was a really important (cough) scene with two blokes on a train having a chat about something. Now one bloke has a beard and one has a moustache, so that helps tell them apart in the dark, but for some reason we are looking at them over their shoulders and not 'at' them, and Mr Moustache-bloke turns away from camera (probably trying this 'acting' thing) and I can no longer see his face just his ear. Now it's so dark I can't tell if he has a nice ear, if it's too big or too small or if it sticks out, and By God this must be damn boring if I'm wondering about the relative angles of ear projection rather than what the hell is going on.<br><br>The framing is really odd, and the eye lines are all over the place, so I don't know who is speaking to who, and often the camera operator decided to be above or below eye-lines, making my head ache as it was so badly composed. <br><br>The first three scenes of the film could all be cut, or would serve better as flash backs, as they just don't go anywhere at all. OK a bit of back story, but we know the Major wants a medal with a single line of dialogue, not three flipping scenes as dull as a rainy Sunday.<br><br>The main character Major Blokey-pants was utterly dull and his motivation was all rather thrust down out throats, and I didn't care for him. Only after 90 minutes or so did his wife start talking about some bloke names Percy and I thought \"Who is Percy?\" and I realised it was the main character, who had been referred to as Major something or other (I forget) for the entire rest of the movie.<br><br>Couple of massive plot holes: they were in the middle of nowhere running low on food on a raft made of branches saying how no white man had ever been here before and clearly in the background is a bloke on a horse in a field. I kept thinking they would pan around and explain but they never did. I also wondered if they were travelling to seek the source of the river, how they were just floating along and not constantly rowing, as a river flows away from the source to the ocean. <br><br>They have been travelling down river for a year apparently and it all goes wrong and they decide to send this bloke back on a horse. Where did this horse come from?<br><br>And they are in the middle of the river all weak and dying and the other bloke (Beard-o) says to the main bloke \"and here's a letter from you wife.\" FTAF??? Where had he been keeping that then? <br><br>When we finally get to the WW1 scenes the dead bodies in the trenches are clearly shop window dummies and for a film that is this expensive that is just rubbish. These scenes add absolutely nothing to the film, we could just have had a Voice over which went \"After the first world war, where I saw active service in France and that bloke I knew who was on the trip to Bolivia with me, you know, thingie, was killed, I returned to London...\"<br><br>Eventually we get back to Amazonia for the third time and Major Blokey-pants has bought his son with him this time Blokey-Pants minor, and they bang on about finding this lost city of Zzzz but never does he put forward a reason why he thinks there might be a lost city or indeed, why he is so keen to find it, he just wants to find it. Who were these people? Why did their civilisation die out? what was their favourite past time? Did they like cheese? None of these questions were answered or indeed even asked.<br><br>Compare this film to the savage Aguirre: The Wrath of God (1972 Herzog) the bonkers Fitzcaraldo (1982 Herzog) or even the rather depressing The Mission (1986 Joffe) and you will be sorely disappointed.","user":"martin-807-452270","rank":[104,157]}]