[{"title":"Easy A is Easy to Love....","rating":9,"date":"26 August 2010","review":"Lately the genre of teen comedies skew to the ribald and the are more sex romps than tell stories and introduce characters that you can not only root for but like. \"Easy A\" is a welcomed throwback to earlier teen comedies: risqué, but heartfelt.<br><br>In Emma Stone you have a Molly Ringwald for a new generation: relate-able, sexy, funny, sarcastic and lovely shines as Olive, a girl who leads her best friend (Aly Michalka) to believe she wasn't a virgin. The rumor spreads about her fabled loose ways and spurs different reactions from the school population: Brandon (Dan Byrd) wants to use it to his advantage, Marianne (Amanda Bynes) the school's self-appointed religious leader wants to shame Olive and Olive decides to run with it for her own gains.<br><br>There are many pluses with this film: A cast of young actors who are true actors who can convey the humor and uphold the tone of the film; a truly funny, vibrant script by Bert V. Royal in which not only the teens get to be smart and fully fleshed out characters but the adults (Patricia Clarkson and Stanley Tucci as Olive's wry and whimsical parents are a joy; and Thomas Haden Church whose character is a new spin on the \"hip teacher\".) as well.<br><br>With Stone as the lead and the only face in the promotional poster people may think this is a \"chick flick\" but this film is for anyone who just likes a good film.","user":"wkup","rank":[196,245]},{"title":"Pleasantly Surprised","rating":9,"date":"29 August 2010","review":"I attended a free preview of this movie and without having done any research on the movie and just based on a short synopsis, had pretty low expectations walking into the cinema. It's always great coming out of a cinema being pleasantly surprised by an enjoyable movie and that's exactly what happened! I've always been a fan of fast witty dialogue and this movie definitely delivers! Virtually every character in the movie whether minor or major seems to have something funny to say, and while there wasn't a lot of ROFL moments, there were quite a few LOL's throughout the movie! To me, it's one of those movies perfect for a Friday night to unwind from work without having to use too many brain cells (but enough so that you don't walk out of there thinking you'd wasted your time and intellect!) - it's one of those movies that i'll definitely be purchasing on DVD when it comes out!!","user":"halliebenfer","rank":[155,201]},{"title":"A very funny comedy with slightly skewed morals","rating":7,"date":"26 November 2010","review":"It's always nice to see a comedy that doesn't meander around the same stupid gags insulting my intelligence time and time again. I was very happy to see a different kind of teen comedy that was much more sophisticated than the films it branches from and even parodies in many creative ways. Easy A is about a typical high school girl named Olive (Emma Stone). Olive has never been popular and has never really been noticed by anyone, and I don't see why considering Emma Stone is absolutely beautiful but that's beside the point. Anyway, Olive, without thinking things through, starts a little white lie about losing her virginity. This lie spreads to the rumor mill and spreads throughout the whole school ridiculously fast, which is one of the bigger themes of this movie that focuses on a lot of the necessary flaws of high school, one of the most incessantly emotional periods of our lives. Obviously, the rumor quickly gets out of hand and Olive's reputation as the school slut grows. Instead of backing down here, Olive exploits the rumor mill for her own social and financial gain, as guys pay her to pretend to have sex with her. The themes and criticisms of high school life in this film are valid, but thankfully they aren't overbearing and the entire movie becomes a laugh out loud blast.<br><br>First off, the dialouge of Easy A is surprisingly great for a film set around these kinds of teenage archetypes. It is much more intelligent sophisticated than the typical pandering you hear coming out of the mouths of teenagers. It adds a whole new level of respect to the film that keeps it very lively and fresh. But the dialouge isn't cocky, thankfully, and I never got the sense the writer was trying boast his wide vocabulary. He went a totally different route, and used it to the advantage of more characterization. Olive is much smarter than her peers and her language reflects that. There are plenty of other characters in the film that obviously don't come close to her sophisticated insight into the world and are the true bimbos and airheads. Their dialouge is much more typical of a teenager, and it reflects a very distinct level of characterization that had hilarious results. Needless to say I felt much smarter watching this film than some of the other crap I've subjected myself to in recent years.<br><br>Easy A also has a great variety of characters. Olive is already a very fun character who leads the story perfectly, keeping it interesting all the way through. But then there are other characters like Amanda Bynes as Marianne, the Christian nut job of the school. It's obvious to see where a person who boasts about premarital sex versus a religious zealot is leading, and these two characters are hilarious to watch interact with all their snappy and quick witted dialouge. The male roles are arguably the weakest of the film, but its not as big of a deal when the whole story primarily focuses on the social interactions between high school girls. Gossip is obviously a huge part of the story. But apart from the younger cast the older cast also fall into some hilarious roles. Patricia Clarkson and Stanley Tucci play Olive's parents and there isn't a moment with these two on screen that you aren't laughing your head off. This duo plays off each other so well and it makes for some of the most hysterical scenes of the whole film. Then there are other great adults in the film like Thomas Haden Church as the fast talking and sarcastic English teacher who you can't help but love. Malcolm McDowell even cameos as the school's principal and has a couple of short but funny scenes. Overall you couldn't ask for a more fitting and entertaining cast.<br><br>Overall, Easy A doesn't provide anything groundbreaking or revolutionary to the comedy genre, but it is certainly a breath of fresh air that keeps my hopes alive for the comedy genre in this age where there are so many god awful comedies being released. Easy A isn't perfect by any stretch of the imagination. The story sort of becomes a mess towards the end and it seems to be going off on a lot of random tangents. And then it is all resolved rather simplistically for how all over the place it was. I also have to say that the moral compass of all these characters, especially Olive, is pretty out of wack. Some of the decisions are a little strange and seem ridiculous at times, but I guess it only reflects the naivety of a teenager, and how much we still have to learn. But overall you can't complain too much when you are delivered an overall satisfying and hilarious experience.","user":"KnightsofNi11","rank":[65,82]}]