[{"title":"Very fun movie","rating":9,"date":"3 October 2018","review":"I don't know what's going on with all the negative reviews. People are really hard to please! \nI went to see that movie without any real expectations and I thoroughly enjoyed it. \n<ul><li>Tom Hardy does a fantastic job</li><li>Venom is an interesting and fun character</li><li>The plot is fairly classic for this type of movie; nothing good or bad about it</li><li>The special effects are great - I loved the transformation scenes.</li></ul>Overall, I recommend it if you like the genre, want to have a good time with a dose of laughters and aren't overly hard to please.","user":"GuanXing","rank":[1,2]},{"title":"Do yourself a favour...ignore the critics!","rating":8,"date":"3 October 2018","review":"We just came out of the theatre and I can honestly say. I liked it! It was funny and it paid great homage to the Todd McFarlane bombastic Venom era of the late 90's. It truly baffles me that Sony would not take enough risks to release the film with an R rating. I wonder how much of this film was left on the cutting floor!?! Tom Hardy's performance is also on point and...just go see it.","user":"ufarese","rank":[2,3]},{"title":"LOVED IT!","rating":10,"date":"3 October 2018","review":"First of all Iv just watched the movie a couple of hours ago and Iv just been reading a few reviews and I must have been watching a different movie to them cause I absolulty loved Venom!<br><br>I love the relationship between Eddie and Venom, they proper cracked me up with some of the things they said and the whole room was laughing at loads of moments throughout the movie. <br><br>Coming out of this movie makes me want to have a symbiote latch onto me if it's anything like the film. I loved the movie from end to finish, it was a hilarious, fun filled action ride!<br><br>My only critic is I would have liked the finale to go on for a little longer but other than that I thought it was brilliant, I deffo reccomend everyone go see it.<br><br>DONT Listen to other people's reviews, go watch it for yourself then decide if u liked it or not, I loved it!","user":"declan-98915","rank":[1,1]}]