[{"title":"Less like a remake, more like another slasher","rating":3,"date":"3 August 2010","review":"A group of sorority girls pull a cruel prank on the brother of one of their brethren. They wind up taking the prank too far, and it goes terribly awry when one of them is killed. Fearful for their futures, they decide to dump the body down an old shaft and keep what happened a secret. Time passes and it seems that they've gotten away with it, but a hooded killer shows up on the night of their graduation party to pick off those involved.<br><br>I am not the biggest remake fan. I outright skip many of them, though I'm not as vehement in my stance as I once was. In fact, a few have actually been catching my interest more and more as of late, the other most recent example being The Uninvited, a surprisingly well-done adaptation of a somewhat overrated Asian title. Then there is Sorority Row, which garnered my attention for two key reasons; A) I am an unapologetic slasher fan and B) Margo Harshman has a role in the film.<br><br>With that said, I really enjoyed Sorority Row. I did a double-bill with Whiteout, and thankfully I decided to watch this one second, as it washed away the foul taste of that nonsensical mess. For slasher fans like myself, Sorority Row had a feeling of \"old school\" to it. The storyline setup, the atmosphere, the wild sorority parties... it felt like old times. Old times that were witnessed via 80's slashers, of course. Some pretty inventive kills in here too, just like in the glory days of the slasher film. No repetitive Scream or IKWYDLS type kills. And really, if you're a slasher fan, the kills are half of the fun. I also have to say that I enjoyed the dialogue in this film. It was always spot-on with the wit, always funny in a dark humor sorta' way. I actually had the opposite reaction to the characters, as the girl playing Cassidy annoyed me. Her voice just grated on my nerves for some reason. The queen bitch was a joy to watch. I thought she was thoroughly amusing. As for Margo, she was stuck with the thankless role of the group slut, but she brought her own brand of deadpan humor to the part. Her lacking amount of screen time was my biggest disappointment with this movie.<br><br>All of that aside, the killer's reveal was also disappointing. The motivation just wasn't resonating with me, and some of the theatrics seemed too in line with the lame Scream brand of villains. Still, the rest of the film was so much fun, I can't help but recommend this to other slasher fans. If you like this kind of film, give it a chance. If you don't, well, I doubt you'd be reading this far anyway. It's a slasher film, plain and simple, and one I'd give the ol' slash of approval.","user":"Cujo108","rank":[31,42]},{"title":"Scream meets I know what you did last summer meets Urban Legends","rating":7,"date":"10 September 2009","review":"This film is nothing original.<br><br>But then what teenage slasher film is. And for that reason only I give this film 7 out of 10. I feel giving a movie of this style a poor review is cutting it short for the credit it should get. It is well shot, the death sequences are well put together and inventive, there are the comical moments, characters you hate and can't wait to meet there makers and the who is the murderer guessing game.<br><br>Don't get me wrong the film is not special, it's no Oscar nominee and has so many plot holes it is swiss cheese but what you do get is a fun slasher flick that won't let you down as long as you don't expect too much from it.","user":"Filmaholic78","rank":[69,111]},{"title":"In a row","rating":5,"date":"20 August 2013","review":"So another horror remake? Shocker ... though not exactly literally. What it is though is beautiful. Especially if you do like women. There is not much acting necessary (which doesn't imply the people involved are not able to do so), just having to look good and scared. All of them are good in that regard.<br><br>I haven't seen the original (or I don't remember it?), but the premise is pretty simple. As another reviewer wrote, you could say, just another slasher. The effects/murders are pretty good, so you get your moneys worth from that. Thrills are decent enough, though you do know where it is heading and characters still \"act\" dumb/irrational, as they always do in those movies","user":"kosmasp","rank":[7,9]}]