[{"title":"This was really stupid film.","rating":5,"date":"23 February 2020","review":"As a fan of the first two XXX movies, I was disappointed at how poorly written this third one was. Many cheesy lines and cringey scenes.","user":"MR_Heraclius","rank":[43,44]},{"title":"Can't Get Over the Physics","rating":4,"date":"27 May 2017","review":"Never mind the horrible acting and gratuitous gushing about how hot Vin Diesel is (at age 50 with sagging arms.. or whatever), how all the girls want to have sex with him and he's happy to oblige because he's Xander Cage who wears a fur coat in the summertime, the plot of this movie is about a device that can decode anything (seems to be a frequent theme these days, this has to be the 4th or 5th movie I've seen that has a device that decodes anything) and it's being used to crash satellites into the Earth with pinpoint accuracy. Now I don't work at NASA or Space-X and I don't have a degree in aerospace engineering, but I am pretty sure you cannot guide a satellite through re-entry to a pinpoint location on the Earth. Even if you could, it's not like it would be a hydrogen bomb like this movie portrays. It would disintegrate and land all over the map in pieces. But no, it gets sent to earth like it's being fired from a rail gun. The orbital decay would take forever even with assistance. <br><br>Then you have the stunt where Xander has jumped, sans parachute (because parachutes are for wimps) from a plane that he was able to get positive thrust to weight ratio on (basically a C5 sized plane full of cargo and electronics) to accurately intercept a falling satellite and yet was still able to run out of the plane somehow and freefall, and somehow catch up with a cargo container of which had a fouled chute. He freed the chute just seconds before it hit the ground, and it created an explosion, yet out he walks like a boss. <br><br>Then of course Ice Cube has pinpoint accuracy with a grenade launcher with grenades that have a very small blast radius.<br><br>Rewind back to the highway battle where Donnie and Xander are fighting and suddenly the guy who jumped 200 meters (distance between buildings IRL)through a glass ceiling, and took out a room full of spec ops guys with ease, has trouble fighting an old broken down Xander Cage. This is the same Donnie Yen who couldn't be shot by a dozen security specialists in a small room but could be shot by one old woman who he knew full well was pointing a gun at him. <br><br>The bad guy... wait, what? Who was he? Did it matter? <br><br>The beach/island where the super duper secret assassins go seems to be in South Beach Miami, all the bars and live music and such.. and so hard for them to find. <br><br>What was the crazy guy's role, to crash a car? Really?<br><br>I almost vomited in my mouth when Vin kissed the Indian girl. He's like old enough to be her grandpa. <br><br>So now you can drop a fully automatic weapon and it just discharges a full magazine and doesn't even spin around? <br><br>So you can rip out a high voltage electrical conduit and plug it into a device to power it up, like it's a USB phone charger?<br><br>So motorcycle tires have enough tread to act as propellers? Wouldn't it have been easier to just have wet bikes?<br><br>So a motorcycle with a combustion engine and normal intake can run underwater?<br><br>So a group of Delta Force soldiers can be hooked up to a cargo block without any of them knowing it, while Xander is walking around them?<br><br>So you can jump from 100+ feet to the ground and as long as you have skis you'll be OK?<br><br>So 3rd world countries have skateboards that use bearings that can survive 50mph rides down winding paved roads? <br><br>So they have an airplane that can circle the globe x number of times without needing to refuel but they land it every few minutes?<br><br>So somehow a mechanical device that attaches to your forearm increases the strength in your upper arm and chest to create stronger punches?<br><br>So a 90lb woman can scale a tree with a 20lb sniper rifle and hold it steady with her off hand for 30 minutes while using the scope to watch the crowd, as she's hanging by sheets from the tree?<br><br>What was up with DJ guy? Oh look, a talented night club DJ who people just like, he'll be an asset. <br><br>Movie sucked, really really really hard. I think they knew it, and laughed after they made it wonder who was stupid enough to watch it. This guy..","user":"dmc101","rank":[87,107]},{"title":"Puts the S in Stupid......","rating":1,"date":"7 February 2017","review":"I'm not quite sure why Xander Cage returned, I just wish he hadn't. <br><br>This movie is so low brow, you might mistake it for a caterpillar. It's devoid of anything that looks like a plot or decent character development. <br><br>Instead its cheesy show off time with lots of tat's, juvenile bravado, sparkly overstated jewelry and guns from \"da hood\". This is a film that feels, in my opinion, like it was made by a 15 year old nick-named \"flipper\" (as in hamburger flipper) and his gormless, pimply friends. We all know thats not true but you get the idea.<br><br>In short a genuinely excruciating experience that puts the S in Stupid.....one out of ten from me.","user":"s3276169","rank":[188,265]}]