[{"title":"Madagascar","rating":8,"date":"17 February 2020","review":"Actually the best of the three. Had more laughs and heart than the other two films combined.","user":"MR_Heraclius","rank":[38,39]},{"title":"Best one yet!","rating":7,"date":"9 June 2012","review":"Alex, Marty, Gloria, and Melman and the rest of their gang return in the third installment of the \"Madagascar\" series, and yes they are still trying to get back home to New York City. This film has them traveling with a group of circus animals all throughout Europe on the run from a French animal hunter who has killed every animal and has mounted their head on her wall, except for a lion.<br><br>This movie stars the voice talents of Ben Stiller (Tower Heist, Tropic Thunder), Chris Rock (Grown ups, The Longest Yard), David Schwimmer (Friends, John Carter), Jada Pinkett Smith (Ali, Collateral), Sasha Baron Cohen (Borat, Bruno), Cedric the Entertainer (Larry Crowne, Ice Age), and Bryan Cranston (Drive, Breaking Bad). Everyone did a great job with their characters and it was a blast to hear all these familiar voices in a film together again.<br><br>I have been a fan of the previous \"Madagascar\" films, and that still is the case, but I really didn't have any hype for this movie because from the trailers, it didn't really look that good. I am glad to say that it is the complete opposite of that. Surprisingly, I really enjoyed film from start to finish and thought that for certain audiences, the film is perfect. If you are a younger person (12 and under) the movie will entertain and make you laugh the entire time. Now for the other demographic (13 and up), the film is still a really fun experience having jokes that adults would get, as well as some really funny situations.<br><br>The \"Madagascar\" series has been known to be over the top, but \"Madagascar 3″ takes the cake for being the most over the top one yet. You can not simply go into this movie expecting a toned down film featuring animals that can talk and doing anything that humans can. You have to go into this film with an open mind and just enjoy the ride. I found myself laughing constantly throughout the film and I couldn't help but have a smile on my face the entire time. This movie made me feel like I was a kid again and that is one of the best feelings there is.<br><br>This is easily the best movie in the series in my opinion. What really blew me away though was something that wasn't crucial to the movie, and that was the 3D. This is probably some of the best 3D I have seen in a film. I was sitting on the edge of my seat waiting to see what was going to pop out next. If you see this film, please do yourself a favor and see the 3D version of it, you will not be disappointed. I highly recommend this film to all ages. Whether you are a kid or an adult, you will find enjoyment in this film.<br><br>Rating 7.5/10","user":"jordangross","rank":[57,76]},{"title":"A Nutshell Review: Madagascar 3: Europe's Most Wanted","rating":8,"date":"7 June 2012","review":"There are eager animated film franchises that rehashed the same old themes and gags in all its installments, and deservedly crashed under its own repetitiveness. Think Shrek, which started brightly, but with each sequel the grumpy ogre and his friends started to become cheap parodies of themselves. There are other film franchises that grow from strength to strength though, such as Ice Age where we get to go on an incredibly long journey with its characters trying to survive the inevitable change and extinction, and then there's Madagascar, with Europe's Most Wanted surprisingly having a lot more to offer than what it had suggested.<br><br>We go back to where we last left off, rejoining Alex the Lion (Ben Stiller), Marty the Zebra (Chris Rock), Melman the Giraffe (David Schwimmer) and Gloria the Hippo (Jada Pinkett Smith) who are still in Africa, but getting homesick and yearn for their lives back in New York. So they hatch a plan to regroup with the Penguins, who had left with the Monkeys in their flying machine to Monte Carlo and its glitzy casinos, and compel them to take everyone back to New York. Granted it's a slow start, but when it picked up with Frances McDormand voicing the French policewoman Captain Chantel DuBois, more of an animal hunter in disguise and hell bent on adding a lion to her trophy wall, it really went over the top with a multitude of action sequences that get set to show off dedicated and meticulously crafted moments for 3D. It's clearly one of the better 3D efforts in an animated feature film that took pains to ensure the medium got milked for the premium ticket you paid for.<br><br>Then the narrative goes up a notch with the introduction of some circus animals with whom our protagonists get to mix with in order to momentarily escape the fanatical clutches of DuBois, and in comes the opportunity to expand on its cast, with the likes of Jessica Chastain, Bryan Cranston and Martin Short entering the fray as a cheetah, tiger and sea lion respectively, each with its own distinct quirk, objective and baggage. It's a zoo animal meets circus animal rivalry formed, and Alex and gang wanting to stick around, with thanks to the Penguins, because the circus is en route to Rome and London, where an American circus event promoter would be in town to evaluate if the troupe can make money if brought across the Atlantic, and naturally, New York.<br><br>I'm rather surprised by the depth of the narrative here, as Eric Damell and Noah Baumbach's screenplay managed to squeeze a lot in under 90 minutes sans end credits roll. Characters don't get thrown in for fun, but have enough screen time to perform without getting the feeling of being redundant to the whole scheme of things, and how they all blend well together for the major set action pieces, complete with comedy ranging from witty repartee to physical slapstick gags. The major new entrants to this installment will also become crowd favourites, such as the girly cheetah Gia, the curt Russian tiger Vitaly who has to reclaim his theatrical mojo, and Stefano the sea lion trying his very best to hold the entire troupe together, while not being very bright himself.<br><br>Every scene got designed to have the characters endear themselves to the audience, even if they come silent, such as the bicycle riding bear, and a couple of English dogs voiced by the likes of Vinnie Jones, Steve Jones and Nick Fletcher. Paz Vega also lent her voice to a collective group of show-horses, while perennial favourites such as Sacha Baron Cohen's Julien and Cedric the Entertainer's Maurice almost always threaten to run away with the show, given their rather spaced out moments that run outside of the main narrative thread. There are colours galore with gags running wild, and I'd suspect where your sense of humour might have been misplaced if there's absolutely nothing here in the film that can tickle your funny bone.<br><br>With an assortment of pop songs ranging from 90s hits to those by Katy Perry, the signature theme song only got an airplay during the end credits, and is an amalgamation of the Afro Circus song written by Chris Rock, that somehow had a strange yet infectious blend that epitomizes everything that had transpired in this film, and set itself up for more. Themes of friendship and sticking together through thick and thin, of never giving up and the likes, are good themes to have for a film that's going to appeal to the young for sure.<br><br>I'd like to think there's a stop at three policy and to leave the franchise as it is now, going off at a high, rather than to continue with a formula that would ultimately show its age. Madagascar 3 worked and delivered everything you'd expect of a crowd pleaser that can appeal to all age groups, and I'm very much compelled to earmark this for a 3D blu-ray title for keeps. Definitely highly recommended in my books, given its rarity of it improving upon the strengths of its predecessors, and finding room to add more characters, not caricatures, to its mythos.","user":"DICK STEEL","rank":[57,80]}]