[{"title":"I don't care if it is fake, it's still entertainment","rating":7,"date":"29 November 2009","review":"A few weeks ago I went to see an independent horror film that was honestly one of the scariest viewing experiences I have ever been apart of. That film is the monster hit Paranormal Activity. Now we have yet another unique viewing experience, this one is The Fourth Kind.<br><br>I have never been a huge believer about visitors from other worlds, UFOs, and conspiracy theories, but I must say that if there was ever a film that made me question if only for a second that their might be life out there somewhere, it would be this movie. It starts off with actress Mila Jovovich introducing herself and giving a preface to the film. She says that the film is based entirely on first person encounters and is backed up with evidence both in audio, visual, and in testimonial form.<br><br>We are then introduced to Dr. Tyler, the woman who Jovovich is portraying. She is being interviewed by the director Olatunde Osunsanmi. This interview is broken up and played at different points of the film. The look on Dr. Tyler's face alone gives you the impression that the story we are going to be told has obviously wreaked havoc on her life.<br><br>We begin after the death of her husband whose mysterious death has yet to be fully resolved. She is working on a sleep study in the town of Nome, Alaska where some of the residents have been telling her about a certain disturbances in the night. One in particular involving an owl outside their windows.<br><br>Without ruining too much of the plot and some of the \"good\" parts, I was pretty impressed with this film. I liked how much emphasis they put on the evidence. Osunsanmi obviously wants there to be no doubt that this movie is perceived not just as a movie but as a document. It's hard to believe that this is based on actual events seeing that some of the \"archival evidence\" is so startling and shocking. We have all seen videos and pictures of UFOs but these videos and audio clips are by far the most unsettling.<br><br>How could this story with all of it's evidence go unnoticed? Wouldn't it have helped Dr. Tyler's case? This so called evidence is so powerful and so unsettling, were it real I would be led to believe a lot of people around the world would reconsider that existence of intelligent life on other worlds.<br><br>I've read plenty of reviews calling this film a fraud, a let down, and a disappointment. I on the other hand thought that this was unique, compelling, and disturbing. It's not the scariest movie ever made, but there are certain images that will stay with you for a while. I have given up caring about whether or not this is a real case or if it is partially or entirely fabricated. It's fun, scary, and different. In the end it's a movie, a movie is supposed to entertain and make you think.","user":"moviemanMA","rank":[154,213]},{"title":"If you're already on this page before seeing the movie, it's too late.","rating":7,"date":"23 October 2009","review":"I just saw a screening of this movie last night. I didn't know a thing about it when I sat down. By the end of the movie I was sitting in my seat and staring at the screen with hollow eyes.<br><br>I looked at my girlfriend and our faces said: \"No way... but... no, couldn't be... good god!\" <br><br>The use of real vs. recreated footage gets you. The sounds in the real footage and recordings will REALLY get you.<br><br>Do yourself a favor and don't research the film before you go in. This is a movie that needs to be taken in with a blank and open mind to be appreciated.","user":"sgtiger","rank":[484,702]},{"title":"Don't hate on this movie...","rating":7,"date":"4 March 2010","review":"I really delayed seeing this movie because of all the crappy reviews I read on here and in other places. How it was all a hoax and that the filmmakers must think we're idiots and it ruined the whole premise and blah blah blah.<br><br>But I just watched it and I honestly can't understand what they're all so pissy about.<br><br>Yeah, the 'real' footage is fake, and the viral campaign to make 'Abigail Tyler' internet-real failed. It really, really doesn't matter though. This movie fully accomplished its goal of being super creepy and very unique and entertaining. If the critics would get off their high horse for a minute and actually watch the film then maybe they'd appreciate what they're seeing just a little bit more.<br><br>The interweaving of the 'real' footage with the 'movie' footage was a fantastically creative way to drive home the emotional edge that the filmmakers were going for, and it worked superbly. And fake or not, the story is realistic enough to be at least somewhere within the bounds of plausibility for our imagination to make us cringe just a little bit more than we usually do with sci-fi/horror films about zombies or other things that are clearly impossible. <br><br>Its obviously not the greatest movie ever made, and Mila Jovovitch isn't the greatest actress ever, but she played her part well, as did everyone else. <br><br>Overall this film is very much worth watching, despite what the critics have said. Very entertaining and will definitely leave you thinking about it for a while afterward. Fake or not, what more can you ask for?","user":"tpaladino","rank":[96,132]}]