[{"title":"Smarter than You Think, Not as Clever as You Hope","rating":7,"date":"18 January 2013","review":"Billy Taggart (Mark Wahlberg) is a New York city cop who got off on a technicality following his execution of a supposed rapist/murder. Discharged from the force by his Captain (Jeffrey Wright), Taggart is viewed highly by Mayor Hostetler (Russell Crowe) for taking out the trash with a common thug. Seven years later, Hostetler, amidst a re- election battle against golden boy city councilman Jack Valliant (Barry Pepper), hires Taggart to find out who is sleeping with his gorgeous wife (Catherine Zeta-Jones). As Taggart follows, he uncovers a much larger conspiracy. <br><br>In his first solo outing, Allen Hughes (one half of the Hughes brothers that brought us \"The Book of Eli\") now offers a stylish, dark vision of corruption in New York. The ladies are beautiful and all have something to hide, the men are violent and vicious and the story is ripped out of countless true-to-life headlines. \"Broken City\" lives up to its name and fires a slug packed with intrigue and intelligence. That doesn't necessarily translate to mean \"clever\". <br><br>The story sold in the trailer is a bit misleading, but perhaps that's the point. Mayor Hostetler's hiring of the true-blue cop Taggart is only a minor segment of a much larger puzzle. It involves cops, businessmen, and politicians in bribery and exploitation with a prize that all but Billy seem to seek: power. Overall that is the film's theme and it more than adequately conveys it. If you understand that and aren't looking for much else, \"Broken City\" is your ticket. <br><br>As I was watching the film I kept thinking that there must have been some significant cutting and re-editing. Perhaps the original cut was too dry so they added in some scenes and cut some to make the film seem more edgy. But it doesn't seem as edgy as it could have been. A number of subplots (for instance Billy's actress girlfriend, or the undeveloped father-son relationship between two of the villains) go nowhere and remain unresolved when the screen goes black. I felt much the same way.<br><br>Mark Wahlberg does an excellent job playing Mark Wahlberg, a role he was born to play. Catherine Zeta-Jones is as beautiful and commanding as ever in a role that is too short for the movie. But it is Russell Crowe who devours his scenes with the political intensity I would suppose is necessary for any real Mayor of New York. Even as the script built around Billy lags, Crowe tears apart his role. He shows why he is truly one of the best actors in the business. <br><br>The supporting cast of this film are as much a draw as the leads. Jeffrey Wright, the usual supporting character with more power than he lets on, plays the secretive Police Commissioner. His character is introduced as a stock role but ends up being much more. Kyle Chandler has a small role that deserved to be expanded. Barry Pepper, who wasn't even featured in the trailer, is the only actor in the film with the same bravado as Crowe. His scenes, particularly one with Wright and Wahlberg, are indicative of why he should be the one on the poster, now buried in the bottom credits. <br><br>Overall \"Broken City\" kept my attention but left me hungry for more. I suppose that is all you can ask for at the movies. I would take this ride again.","user":"Bob_the_Hobo","rank":[117,138]},{"title":"Unfortunately only in Fiction Mayors Are Investigated and Arrested","rating":7,"date":"2 June 2013","review":"In New York City, detective Billy Taggart (Mark Wahlberg) goes to court for the murder of the rapist Mikey Tavarez (Luis Tolentino), but the Mayor Nicholas Hostetler (Russell Crowe) and the Chief of Police Carl Fairbanks (Jeffrey Wright) vanish with an important evidence and Billy is declared non-guilty by the judge but he leaves the police department. <br><br>Seven years later, Billy is a private detective that lives his girlfriend Natalie Barrow (Natalie Martinez), who is an aspirant actress and the sister of Mikey's victim. His secretary Katy Bradshaw (Alona Tal) is trying to collect part of the debts to save their business. <br><br>In the week of the elections, Hostetler summons Billy and offers US$ 50,000 to investigate his wife Cathleen Hostetler (Catherine Zeta-Jones) that he believes is having a love affair. Billy discovers that Cathleen is meeting Paul Andrews (Kyle Chandler), who is the coordinator of the campaign of Jack Valliant (Barry Pepper), the opponent of Hostetler and favorite in the election. When Paul is found dead on the street, Billy finds that he had been double-crossed by Hostetler and he decides to investigate the truth behind Paul's murder. <br><br>\"Broken City\" is a great political thriller about a situation that certainly happens in big cities. Mayor Hostetler is evicting people from a residence building and selling the real estate for an underrated value. In Rio, there are mysterious interests from the Powers That Be that change the construction code allowing tall buildings at the seaside streets; or destroy a velodrome and a car racing track in a valuable real estate and intending to construct another in a mined area that belongs to the Brazilian army; or valorize the harbor area with questionable constructions. Unfortunately only in fiction majors are investigated and arrested. My vote is seven.<br><br>Title (Brazil): \"Linha de Ação\" (\"Action Line\")","user":"claudio_carvalho","rank":[30,34]},{"title":"Great Cast Keeps Weak Story Going","rating":21,"date":"21 January 2013","review":"Broken City (2013)<br><br>*** (out of 4)<br><br>Entertaining but very flawed political thriller about a private eye (Mark Wahlberg) who was thrown off the NYC police force but gets a major job when the Mayor (Russell Crowe) asks him to find out who his wife (Catherine Zeta-Jones) is messing around with. This case is rather easy for the man but soon he realizes that this is just the start of dirty business. BROKEN CITY, as a thriller, really doesn't work because the plot is rather silly. It's especially silly if you start to think about it too long and that's why it's best to just walk into the theater, turn your brain off and enjoy the excellent cast that's offered up here. It's always amazing to see how many great actors they can get for less-than-stellar material but the three leads are excellent as are Jeffrey Wright, Barry Pepper and Alona Tal. The performances are certainly the reason to check this film out as they help keep the film moving along no matter how many twists and turns get thrown at us. Wahlberg is once again a lot of fun playing the tough guy and has no problem with this. Crowe appears to be having fun with the less than serious role and Zeta-Jones gets a couple nice scenes along the way. I thought Pepper is the one who really stood out playing the man going up against Crowe's character in the upcoming election. Tal was also a breathe of fresh air when she's on screen. An almost unrecognizable Griffin Dunne also plays a supporting part. Director Allen Hughes does a nice job at keeping the film moving at a nice pace but there's still no question that the material just isn't all that strong. I'm not sure if there were countless re-writes or not but the screenplay pretty much hits on every cliché that this lower-quality political thrillers do. The twists and turns aren't all that shocking and neither is the ending. Still, BROKEN CITY remains enjoyable thanks to the cast.","user":"Michael_Elliott","rank":[31,39]}]