[{"title":"Character study may not be for everyone, but there's much to see","rating":6,"date":"19 April 2010","review":"Greenberg, about a discontented 40 year old who's not at all sure what he's doing with his life, is a provocative slice of life - but it's not for all tastes. It moves slowly and demands extra attention, but even if you're really into the story you might wonder where those 107 minutes went.<br><br>Ben Stiller, in a terrific performance, is the titular ne'er do well, an itinerant carpenter housesitting for his brother in Los Angeles for six weeks. During that time, be meets and falls in and out of like for his brother's executive assistant Florence (Greta Gerwig, who's also magnificent), who's just as awkward as Roger Greenberg.<br><br>The bulk of the film covers their relationship on one track and the events of Greenberg's past that have led to his existential where-am-I ponderances. Some 15 years earlier, Roger was in a band out of college with a few good friends. They were apparently quite good, but when a record company offered them a deal, Roger turned it down, afraid of the success it might bring. This led to a serious rift in the band, causing each member to go his separate way; none of the members has played much music in the intervening years.<br><br>Liking Roger isn't easy for anyone, not even the audience. He's sort of a jerk. (It's mentioned that he's just been released from a mental institution, although the cause for his hospitalization is not explained.) The film indicates that Roger has problems maintaining relationships, sometimes acting out - and lashing out - in order to keep himself safe and serene. His arrival in LA allows him to reconnect with several of his old friends, many of whom he hasn't seen in those 15 years.<br><br>It's these fractured relationships that hold the key to Greenberg's life. At times, he tries to patch things up and move on with his life, but he's just as likely to snap at the friend or lapse into the same behavioral issues that had plagued him as a young man.<br><br>Stiller is really, really good in this. He's surprisingly very good at showing myriad emotions convincingly. At once, you believe Greenberg is a polarizing, hurting, hurtful man on the cusp of the rest of his life. Stiller's brand of comedy can take time to grow on someone, but he really shows his range here. I certainly didn't know he could plumb the depths of a character like he did to Roger Greenberg.<br><br>Gerwig is his equal and is a real presence here. Florence is - like her namesake Nightingale - a huge help to Greenberg's brother as his assistant, and he's much more savvy about taking care of the house than Greenberg is about taking care of himself (in a funny early scene, she asks him to make a list of things for her to get at the store, and he writes \"whiskey\" and \"sandwiches\"). But as good as she is at her professional life, her personal life is an absolute mess. She goes on one-night stands because they feel good - okay, no problem there - but she has few true connections in life. She has one good friend, and you get the impression that her family isn't really close to her (she says her niece doesn't relate too well to her). Florence is physically and emotionally awkward, unsure of herself in all ways save for her job, in which she's commanding. This, of course, also makes her terribly vulnerable to the advances of the older Greenberg.<br><br>So the acting is really top notch, but the movie just isn't for everyone. Here's why. There's a lot of plot, a lot of things happening, but very little is resolved or accomplished; the film almost feels like a stream of consciousness to which we're privy. What WILL Greenberg do after the six weeks are up? Will he stay with Florence? Will he jilt her? In the end, does it really matter? Probably not; the ending is abrupt, although not out of place for the rest of the film. But one really needs to be atuned to Greenberg's plight in order to enjoy the film. If one isn't, the movie's mostly dull with bits of funny moments interspersed throughout. I didn't find it terribly heartwarming, just a character study of an unlikable character. Which is not a bad thing at all, but this one just didn't completely work for me.","user":"dfranzen70","rank":[60,75]},{"title":"Brilliant, Heartwarming Character Study That's Not For Everybody","rating":10,"date":"1 April 2010","review":"... (which, if you've read the other reviews here, you know is a massive understatement).<br><br>Let's start with the two obvious stumbling blocks to loving this rather astonishingly good and (for some) altogether life-affirming and lovable movie.<br><br>-- The main character is pretty much a jerk.<br><br>-- There's no plot.<br><br>Now, realize: the main character is *supposed* to be unlikeable. And the movie does not try to have a plot. And you might wonder, how can a movie that starts with these two conditions possibly be any good, let alone some be some kind of masterpiece? So let me explain.<br><br>Roger Greenberg (Ben Stiller in the performance of his life) is by no means completely unlikeable. He's quite funny, an adept verbal wit (there is no situational comedy in this movie at all; it's funny in places because Greenberg is often funny). He has very firm and uncompromising moral ideals. He cares deeply and responsibly for animals. What makes him unlikeable is that he sometimes, unexpectedly, treats people, especially people he cares for, like crap -- he uses that verbal wit like a blunt knife and goes on unwarranted tirades. And he has almost no insight into himself (occasionally the movie is very funny at his expense.) You know that guy in your family who is fundamentally, deep down, a very good person, but is all too often an incredible pain and aggravation to be with? That's Greenberg. He is, in short, the sort of person who is much easier to love than to like. <br><br>We are told from the outset that he has, in fact, just been released from a mental institution, and this is one of the least clichéd and most fully-rounded portraits of a seriously mentally ill person in recent cinema. We watch as he works really, really hard to sabotage any hope he has for a happy life.<br><br>He meets and is immediately smitten with a woman (played terrifically by Greta Gerwig; it's nearly as much her story as his) who has her own set of neuroses, but ones that are much more ordinary than his. We watch their relationship play out over a few months exactly as it might in real life, without any set of causally related events to provide an engine of plot.<br><br>So what narrative tension is there? Why keep watching? Very simply, if you like Roger Greenberg enough to have empathy and sympathy for his plight, if you can see past the sarcastic surface to the deep pain underneath, if you can recognize a little bit of yourself in him, then you are going to root for him to get his act together, to cut all that nonsense out, to start to understand himself --in short, to start to recover some sanity, to find the first cobblestones of the path to some kind of happiness.<br><br>Well, that's what happens, and it's wonderful to watch. (That it's possible to watch the movie and not notice it happening is obvious from some of the reviews here, including one that criticized the ending as incomplete; in fact, this may have the best and most perfect last line of any movie I can think of.)<br><br>If you didn't much like _Sideways_ or _Up in the Air_, I can guarantee that you will hate _Greenberg_ (I mean, imagine those movies, but with no plot, too!). If you loved those movies -- if you have no problem watching emotionally stunted people slowly grow up -- then you'll probably love this, too, and you may even love the way that the lack of conventional plot makes the movie completely realistic and hence especially powerful emotionally. When I first wrote this review, I ended by saying \"I can't wait to see it again and I suspect I'll watch it many times.\" I've now seen it twice more and, indeed, it only gets better.","user":"emvan","rank":[126,177]},{"title":"The Ultimate Anti-Romantic Comedy","rating":9,"date":"22 August 2010","review":"You know those fleeting, inelegant moments and transitory, almost Seinfeldian scenarios in our lives that, unlike on Seinfeld, we never really talk about, because they betray how clueless and insecure we all are? You know how we'll go to parties basically to see one person and find we're inept at opening up and socializing with anyone else? You know those pointless, roundabout stories we'll tell about something that happened that we thought was interesting or funny but we don't realize how boring or monotonous they are till we're halfway through them? What about the receiving end of that situation? Why are we so worried about hurting these painful storytellers' feelings when they're making us so uncomfortable having to feign interest or amusement for indefinite durations? You know those sexual experiences we never talk about even to our best friends because they were so painfully awkward and nakedly ungraceful? You know how when we're on drugs we only indulge occasionally and we find ourselves wording things in creative ways, feeling overconfident and impulsive while everyone else is viewing us as rather reckless? Roger and Florence know, all too painfully, awkwardly, uncomfortably, recklessly well.<br><br>Some of us handle these situations much better than others. Some of us save face, some of us don't care that much, some of us read other people well enough to know it's all just part of life. Forty-year-old carpenter Roger Greenberg and his brother's college-age assistant Florence are stranded by an utter deficiency of any of these possible salvages. Inevitably finding themselves sharing these horrible moments whenever they're together, they are in turn repulsed by one another. They can't stop reeling over what happened last night, the other night, a week ago. And while Florence is too timidly self-effacing and in need of being with someone to bring herself to write off Roger, Roger's whole perspective on everything is disfigured by his narcissistic compulsion toward suffering, his hermit-like disdain for any and every inconvenience, and righteous indignation that he can't allow to exist alongside ever being at fault. It's Seinfeld in the bathroom with a razor blade in the tendon.<br><br>When you watch the trailer, you're watching a nervously smoking exec hoping to at least break even by streamlining all the overtly laugh-inducing moments. With the possible exception of less than a handful, they indeed are all in the preview. The dry carping lines by Stiller, the Starbucks letter, at the party telling off the Gen-Y stoners, hitting the SUV and bailing when it actually stops. Greenberg is a comedy, but in such an internal and carefully cringe-worthy way that most scenes are seemingly shapeless renderings of a combination of characters situated in a combination of day-to-day situations and the readily apparent punchline moments are indeed that few and that far between. But that is its intent, and it succeeds with witty effect: An impossible jerk and a bashful, marginally popular girl idiosyncratically push each other's most debilitatingly precarious buttons but aren't able to go their separate ways because they're too thin-skinned to be alone. It is the ultimate anti-romantic comedy. No Golden Globe moments here.<br><br>Ben Stiller gives the performance I believe all truly good comic actors capable of, one of fierce angst and biting personal honesty. We've seen Sandler unravel an entirely different dimension of himself in Punch Drunk Love and Reign Over Me, Robin Williams in World's Greatest Dad and Insomnia, Pryor in Blue Collar, and so on. Roger Greenberg is his tour de force as a well-rounded, perceptive and talented actor who's not afraid of his audience going as far as to dislike his character, which would be entirely understandable for many viewers to feel, because he deeply understands Greenberg and doesn't judge him. The gratifying discovery we make here is that of Greta Gerwig. Yes, she is very sexy, but exactly the way Greenberg describes, \"She's, I don't know, bigger. I find it sexy.\" She's pure salt of the earth, a real person unfettered by make-up or fashion. I know many girls who talk, dress and act just like her Florence, who she makes come alive on just the right naturalistic levels.<br><br>Writer-director Noah Baumbach made two previous films very strongly akin to this. They were the concise and beautiful The Squid and the Whale and the soul-crushingly relatable and mercilessly matter-of-fact Margot at the Wedding. All three of these films have difficult and self-unaware individuals at their centers, they each share a bone-dry and woefully cynical sense of humor and they each reveal Baumbach's inimitable talent at showing us characters and situations so universal and everyday as to level-headedly gaze at the most abstract innards of acknowledgeable moments of personal and social frustration. His actors always feel extemporaneous, in the moment, unscripted. Their characters belong to an ever-pervading yet little-characterized contemporary facet of liberalized information-age American society. At arm's length he shares the quirky, idiosyncratic likes of Wes Anderson, except there is not one shred of hopeful sweetness or heart-warming serendipity. Those are things we love, and we embrace them whenever we experience them, but at the expense of never taking the time to face the realities of the banal, the bilious stuff of everyday life. That's where Baumbach comes in.","user":"jzappa","rank":[35,47]}]