[{"title":"The ending makes sense...","rating":6,"date":"3 March 2009","review":"This TV movie is about a retired scientist who invented a car that doesn't have an engine but runs on solar paint. Unfortunately as pro-green as it sounds, this invention threatens the petrol &amp; gasoline industry and they didn't want this patent to exist in this world at all. 2 hit men are hired to kill him off but before they can do that, a popular TV crew arrived &amp; had an interview with him. They then have to start getting rid of all things that are related to this invention and this is where the plot begins.<br><br>After a strange car accident, Eve seems to have lost her memory from the concussion. While trying to revive her memory, she looked for Harry, who's a motivational speaker at a seminar &amp; she started to slowly regain bits &amp; pieces of her memory. But while this is happening the hit men are already hot on her heels without her understanding why. Eve then roped in Harry and her cameraman to solve the mystery of what this conspiracy is all about.<br><br>A very Pro-Environment story which makes sense, make sure you watch till the very end where the scientist speaks...","user":"evetan00000","rank":[15,18]},{"title":"Good clean movie","rating":7,"date":"10 July 2018","review":"I'm not sure about the low scores for this movie. I found it refreshing on a hot summer night. Something light and different.","user":"m005e","rank":[3,3]},{"title":"Poorly thought out movie","rating":1,"date":"30 July 2009","review":"Just poorly thought out. Lets start with the usual conspiracy against the status quo. The movie was made this year (2009), oil companies everywhere are diversifying into alternate energy programs. They own the distribution channels so why would they not simply buy in? <br><br>Having a patent does not mean the inventor gets rich, ask Tesla (the inventor, not the car company) and too many others to cite. The inventor typically sells the rights due to costs of refining the product, procuring business credit to buy more than a few parts, selling the product, distributing the product.<br><br>The guy at the patent office who logs in and removes the patent application. Database systems with that much at stake log every event. And that deletion would have been noticed. Also the servers get backed up nightly so the application is ** still ** in the system.<br><br>The hit men, if you are from small town America everybody notices the strangers in town who are riding around in a black (helicopter) SUV. They were wearing suits and ties. And they are careless. You just can't shot and kill everybody and no one notices.<br><br>The reporter whose truck was run off the road. Why did the hit men just assume the two reports were dead, they should have searched around the vehicle.<br><br>Just stupid stupid movie.","user":"mnwcsult","rank":[9,23]}]