[{"title":"A Delicate portrait of loneliness and lost love.","rating":10,"date":"8 May 2012","review":"Womb is an excellent drama that is unfortunately marketed the wrong way.<br><br>If your first impression of the film is that its an Erotic drama on incest, you couldn't be further from the truth.<br><br>The premise itself should be a guideline for whether or not you should watch this film.<br><br>\"After a tragic accident, a woman decides to clone her lover, and raise him from infancy to adult.\" The less you know about Womb, the better the experience will be. Suffice to say, its an extremely well made, and honest drama about not being able to let go, and the consequences that follow.<br><br>The story centers around Tommy and Rebecca. After the accident, Rebecca makes the controversial decision to clone Tommy to raise him as a child.<br><br>Why? To get back her lover? To raise the child she never had? The film never spoon feeds us, and we're left with Eva Greens brilliant performance to see Rebecca unravel.<br><br>We see her care about the Tommy's clone, and genuinely wants to be a good mother, but there's an underlying foreboding with the possibility of incest. Rebecca struggles to keep her feelings to being a mother, but there's obvious jealously when women come into Tommy's life, and thats the main conflict of the film.<br><br>Certainly, this taboo possibility is the main drive of the second half of the film, but its much more than that.<br><br>Womb is brilliant because of how well its crafted.<br><br>There is an isolation to the film, landscapes and vistas are limited to long stretches of seas and beaches.<br><br>Music is sparse too, there's a haunting recurring theme that plays during decades, and emphasizes the long time span of the story.<br><br>Dialogue is minimum , and the film never lingers on a certain time period.<br><br>Yet we miss nothing. Womb focuses not on the conversations and events, but rather the emotions the characters go through. What we are left with is a deep morality love story that transcends decades.<br><br>Regardless of how you feel about the inevitable outcome, the struggles presented on screen is one of the more complex modern love stories. Its not about Lust, but of how blind we can get in our desires to get our loved ones back.<br><br>Its not for everyone though, due to the slow paced nature of the film, the more you give yourself to the film, the more you will get.<br><br>Its also not exactly the happiest film made. The depressive tone of the film may be too much for some, but it stays true to itself, and benefits greatly from it.<br><br>This paired with the taboo subject material, led with questionable marketing, will probably scare off people, which is a shame, because this is far from the pretentious love story people seem to think it is.<br><br>See it if you can, its definitely a hauntingly beautiful film that makes you think long after the credits roll.<br><br>P.S, this is my first real review, let me know what you guys think! THANKS!","user":"leonthesleepy","rank":[190,206]},{"title":"Quiet, Cold, Stunning!","rating":8,"date":"17 August 2011","review":"Films with lingering shots of a beach or a face or a road to me can sometimes come off as pretentious dribble, not the case with Womb, I found this movie to be absolutely stunning. There's no other word for it, some people would easily find this movie to be boring due to the extremely slow pace and lack of dialogue, but in my opinion that all just adds to the atmosphere that the director was trying to create.<br><br>There is no way at all to tell what year this film is set but I'm guessing it would be in the not too distant future, let's face it, the advances in science these days it's not too long before human cloning will be a part of our society. A lot of things I've heard about Womb quite often compare it to Birth, which is a pretty good comparison I think, both films have a lot of similarities. I couldn't help but pick up vibes from another film Never Let Me Go, the controversial subject matter is similar, the underlying sci-fi element, the moral question the viewer faces and the stillness of both films are very much the same.<br><br>Eva Green is wonderful to watch, she gives such a wonderfully restrained performance that's it's surprising she didn't get noticed more for her role. Ever since I saw the terrific Cracks a few years ago I look forward to seeing what edgy role she decides to take on next, Matt Smith, who I'm not so familiar with also does a good job. The children at the beginning of the film deserve a mention too, it seems as though child actors are just getting better and better as time goes on.<br><br>Certainly not a film for everyone, but for people who like a bit of a discussion after a film it's perfect.<br><br>LOVED IT!!!","user":"JimmyCollins","rank":[79,94]},{"title":"A Nutshell Review: Womb","rating":6,"date":"6 August 2011","review":"At one point in the film there's a lingering shot of a snail, as if an obvious metaphor that Womb gestates ever so slowly in its story, covering decades of its characters' lives, and does so in such a bleak and loving fashion that it provides you breathing space that sets you thinking in each scene, akin to observing the quietest kid in class who turns out to be the most explosive. If you've read the synopsis by now you'd know this film deals with the issues associated with cloning, and finds kindred spirits with films such as Jonathan Glazer's Birth and especially Mark Romanek's Never Let Me Go.<br><br>Hungarian writer-director Benedek Fliegauf tackles his first English language film with Womb, exploring an intense underlying love story that's treated and shot with Zen minimalist principles against the hauntingly beautiful backdrop of Sylt and other equally amazing landscapes in and around Hamburg. Technical strengths in presenting this film cannot be ignored, such as how patiently quiet the narrative is with little dialogue, allow emotions to overwhelm on screen, with sound intricately designed around emotions of frustration, anger and fear. Simply put, this is one journey spanning lifetimes that you'd have to open your heart out to, checking that nagging thought process about the plausibleness of the story at the door, otherwise you'll find yourself deeply muddled given that this in essence is like a science fiction fantasy.<br><br>It's a story about attraction, and how inexplicable it can sometimes be, as if of a chemical nature that draws one's attention to another, and how we are thought to be wired up to be attracted to a certain type, profile, or genetic make up, with the latter of course playing a big role in this film since it involves the cloning of a human being, and the existential exploration of whether a clone can ever be the same as its original, or the degree it is so similar. It raises interesting arguments about that of nature versus nurture, since one's personality and values are catalyzed by the growing up process, and while one can be grown from a petri dish, events that shape one's character are external and cannot be controlled, somehow.<br><br>But Womb pushes that boundary a little bit further. What if it involves a surrogate mother, won't her 9 months pregnancy in carrying the foetus play a part, and like the film had shown, care had been taken to grow the subject in a fairly controlled environment. Rebecca (Eva Green) and Tommy (Matt Smith) are on the cusp of a budding romantic relationship, where their years apart since young didn't even seem to damper their strong emotions toward each other, only for a sudden road accident to cruelly snatch one away from the other. In what would be a controversial move, Rebecca enrolls to have herself impregnated and becoming the surrogate mother of Tommy's clone, for the selfish belief that in doing so will allow Tommy to live again, much to the disappointment and shock of Tommy's mother, who chose to depart rather than to see a mirror of her lost child in another human being, now brought up by another woman.<br><br>It's the ultimate possessive love story, where one can now boast of having being there right from the start of a lover's life, nurturing him from a toddler to a young adult, to the point where one last left off. In most love stories, the feel good factor post tragedy is to discover one expecting the child of a lover now deceased, but in Womb and to a degree of morbidity, it's now the expecting of the lover himself that raises plenty of alarm bells, especially when sexual attraction comes into play, and clearly with the ulterior motive and desire to want to somehow break through strong taboos when opportune, to continue where the lovers last left off. But with Tommy 2 hooking up with a new found girlfriend in Monica (Hannah Murray), with the last act dealing with this three-way relationship, with the audience firmly in the know of how conflicted Rebecca must have felt. <br><br>Here's where Eva Green shines in playing a hopeful teenager to a woman who's confused, jealous and probably with a tinge of being jilted, unable to say the truth which she had hidden so well for years. Fans of Dr Who will probably lap at the chance of watching their hero in Matt Smith play the Tommy role, being a youth cut down before his prime, then in his second role as the relatively immature teenager who has yet to know what's in store for him when unexpected events get set in motion.-<br><br>So what got the censors here hot and heavy and to charge this with the highest rating possible, outside of an outright ban, is how there's a pervasive feeling of sexual attraction that never goes away, when Tommy 2 starts to appear in Rebecca's life. Granted that a mother naturally shows unconditional love toward her child, this one has a very explicit hint of intent that provokes. Take up the challenge with this unconventional love story, and see if you'd squirm when you get past the amazing visuals to reach its controversial, and to some, shocking, core,","user":"DICK STEEL","rank":[65,81]}]