[{"title":"Good versus Evil, Sin and Redemption: Graham Greene Revisited","rating":3,"date":"3 September 2011","review":"BRIGHTON ROCK is a British remake of the 1947 brilliant film noir based on the novel by Graham Greene an adapted for the screen by Graham Greene and Terrance Rattigan. This BRIGHTON ROCK has been updated from the original 1930s setting to the 1960s and the screenplay is by Rowan Joffe (who also directs) - tough competition with the original writers! The result is a dark film that relies on performances by some actors who are not up to the task and makes them seem even more weak by the presence of such brilliant actors in smaller roles as Helen Mirren, John Hurt, Philip Davis and Andrea Riseborough. <br><br>The story takes place in 1964 in Brighton, once a quiet seaside town, is suddenly overrun by gangs of sharp suited Mods and greasy Rockers looking for a riot. Looking to be the top Mod gangster, Pinkie Brown (Sam Riley) will stop at nothing to be the biggest name in the crime world - bigger than the competitor Colleoni (Andy Serkis). Pinkie witnesses the vicious death of fellow Mod Kite (Goeff Bell) and is determined to kill the perpetrator Hale (Sean Harris). Pinkie's ruthless and violent ambition takes over his mission and when he discovers that a waitress named Rose (Andrea Riseborough) who works at Snows, a café run by Ida (Helen Mirren), is involved tangentially in the murders, Pinkie decides to court the plain Jane Rose, knowing that if he marries her she cannot testify against him should she discover Pinkie's guilt in the murders. Ida had a 'connection' with Hale and sees through the veils of deceit Pinkie is placing on the innocent Rose, and she and her longtime friend Phil (John Hurt) undermine Pinkie's plans. Pinkie marries Rose - a gesture that secures Rose's fascination and new love for Pinkie - to keep her from testifying against him. As factors around the conflicts between the two gangs tighten and Pinkie fears for his end, he convinces his new bride to take part in a mutual suicide, an act that has a surprising end. <br><br>What is missing in this updated adaptation is Graham Greene's important emphasis on the theme of sin, guilt and Catholicism: there are attempts to bring these concepts into the script but they become of lesser importance than the action and dark evocation of a period piece. There mood is well described by the cinematography of John Mathieson, but the single most effective aspect of this film is the brilliant music score by the gifted British composer Martin Phipps, godson of Benjamin Britten. Were there not an original film for comparison the film would likely be better accepted. But for those who are ardent fans of the novels of Graham Greene this film adaptation will likely disappoint. It is currently available On Demand and simultaneously in theaters before the DVD is released here. <br><br>Grady Harp","user":"gradyharp","rank":[19,21]},{"title":"Why Make This Again?","rating":2,"date":"15 March 2011","review":"I went to see this version of Brighton Rock with my mum. She was keen to see how it matched up to the original Boulting Brothers film with Richard Attenborough. She and I were both disappointed.<br><br>I was actually really rather bored for the first half and wanted to run out of the cinema screaming. It seemed to take for ever to get going.<br><br>There were no characters I could empathise with. Rose who falls for bad boy Pinkie seemed too dim and snivelling to care about and Pinkie had so little charm I couldn't care less what happened to him. The actor Sam Riley's maturity (around 30)was against him playing the role of Pinkie, who I realised long into the film was meant to be in his teens.<br><br>I thought that, perhaps the story, wasn't for me.... My mum kept on that it wasn't as good as the \"classic\" original. So I thought I'd find out for myself and got hold of a DVD. Was she right? Yes. Although by no means perfect it had a robust sense of what it was: a British noir gangster film. Set in 1940s, shot in stark black and white it was gritty and hard and menacing.<br><br>Whereas the look and feel of this version seemed to be at odds with the subject matter. In it's attempt to be lavish, this production, up-dated to the 60s seemed at times too clean and shiny. On the other hand, at other times it was unrealistically grubby : Rose's home - a 60s socail housing tower block, which would in reality have been spanking new, was dressed down to look disgustingly filthy and run down. <br><br>These kinds of inconsitencies popped up not just in the design, but throughout the music, the camera-work and the diercting of the actors. The pacing of seemed to jump from set piece to set piece without a sense of flow or overall tone. The separate elements of the film didn't gel. The best description I can come up with is \"clonky\". In fact, I'd go further and say it is a ham fisted mishmash.<br><br>Sorry to the filmmakers, I think you wasted a lot of effort on this. which is a shame.","user":"beveryhill","rank":[53,72]},{"title":"Mildly engaging crime drama","rating":6,"date":"13 February 2012","review":"The main character of this movie is Pinkie Brown, a small-time thug in Brighton, England, in the 1960s. Pinkie's true evil nature comes out when he tries to take over a small gang of criminals after their leader had been killed by a rival gang. As played here, Pinkie is in his 20s and, as brash and amoral as he is, he and his mediocre cohorts are no match for the rival gang that basically runs underground crime in Brighton. <br><br>The action is sordid and ugly, but the glossy color photography works at cross purposes to conveying that mood. Much of the photography is more appropriate for an art film than for this down-and-dirty fare, making me think that maybe black and white would have been a more appropriate choice. As Pinkie, I found Sam Riley just a little too handsome for the part--he does not exude the menace and harsh personality that is Pinkie's nature.<br><br>I found the initial setup scenes rapid-paced and confusing, requiring close attention; if you don't follow what has happened early on, you will be at a loss to fully understand what happens later. An additional complication to my following the opening scenes was the fact that I am not a Brit and didn't always follow the cadences and clipped manner of speaking. I confess to starting the movie over after about fifteen minutes, with English subtitles turned on. That was a great help.<br><br>The score that often seems to aspire to the transcendent seems greatly out of place.<br><br>I wish I had seen this movie before having read the book, since having some of the images in mind would have been good. Never having been to Brighton, my mental picture of it would have been greatly enhanced by what is well captured here. While the movie strips from the book much of the depth of the themes of sexuality, morality, loyalty, and sin, there are things in the movie that I found improved upon the book. I liked Helen Mirren's portrayal of Ida as a more centered person than the blithe Ida of the book, and John Hurt fleshed out Ida's friend Phil better than what I got from the book. And there are a lot of little things. For example, I pictured the candy, Brighton rock, as being something like a candy cane rather than the weighty rod seen in the movie. I regret that Pinkie's lawyer Prewitt was deleted--he was a truly Dickensian character in the book. And why the great ending in the book was changed is beyond me.","user":"bandw","rank":[9,10]}]