[{"title":"Cause it's a long way to go, a hard row to hoe...","rating":8,"date":"8 September 2018","review":"This film is based off the memoir by David Sheff (played by Steve Carell) and Nic Sheff (played by Timothee Chalamet). It follows a father who is desperately trying to help to son and slowly coming to terms that maybe he can't. Let me tell you, this is some powerful stuff that is executed flawlessly by the actors. All were great but in particular Timothee and Steve are standouts. My bet is that the diner scene (\"This is who I am\") will be the clip chosen during awards season. But theres also some more subtle nuanced scenes too. In particular there is this scene right after Nic has relapsed by popping some pills and you can just tell he is thinking \"Why did I just do that?\". And your heart also breaks for David when you see him driving around looking for his son.<br><br>The director does choose with this film to present in a non-linear way. Often times it does show flashbacks. That might not be everyone's cup of tea but I think it works. I think it helps to delve into David's mind and understand where he's coming from. He probably is thinking \"Where did I go wrong?\" I also felt the director did a good job of establishing shots to remind you of a happier time without using flashbacks. For instance there is a scene where Nic is playing with his younger siblings in the sprinkler and then later (after another heartbreaking scene of Nic fleeing) there is a shot of the empty backyard with the sprinkler coming on.<br><br>The screenwriter was saying that he originally didnt want to do this film as he previously did a drug film (Candy -starring Heath Ledger) which was also based on his real life addiction with heroin. But ultimately decided to do this one as he never really had shown the other side of drug addiction. I thought he did a good job with it. It never glamourized doing drugs, but I also liked and appreciated that Nic was humanized in this. Yes, he is causing his family pain, but he isnt treated as the villain. You feel for him too.<br><br>Overall, I quite liked this film. And I also thought the soundtrack was on point. I think you will see this film pop up during awards season. Maybe Best Picture and Best Adapted Screenplay, but I think definitely for Timothee and Steve. It would be criminal if they werent there. Another thing I want to note is that about halfway through the credits there is a voiceover done by Timothee where he is reading out a poem that is briefly mentioned earlier. So that might be something you want to stick around for.","user":"mr_bickle_the_pickle","rank":[194,222]},{"title":"Must see","rating":9,"date":"13 October 2018","review":"Should be mandatory viewing at all schools and drug reform programs. Excellent performances and extremely authentic portrayal of addiction and its damaging affects on family and self.","user":"janinelewis-03488","rank":[140,165]},{"title":"POWERFUL PERFORMANCES BRING THIS TO LIFE","rating":9,"date":"21 September 2018","review":"This film could have been bogged down with its flashbacks and some narrative cliches, but man do Carell and Chalamet's performances make this film soar. 9/10.","user":"chloedevoy","rank":[120,147]}]