[{"title":"Impressive","rating":8,"date":"14 May 2018","review":"Although I do not often watch indies, I was certainly impressed by this movie. I came across this movie while reading an article online, and the title got me curious. This movie is really ultra-low budget and really hard to find anywhere which is not unusual considering how little known it is and was also released some years ago. Luckily I managed to find it, and it was worth a find.\nThe story is about David, his relationship with his family and his sister who returns home after a long absence. How relationships burden the choices we want to make has been explored well. The title 'Fighting Fish' describes both David, played by Val Emmich, and Alice, played by Anna Moore, who are fighting with their inner self and are struggling to cope with the responsibilities. The story seemed really earnest to me and I was particularly impressed by Emmich and Moore's performances.\nI do recommend this and wish that good low-budget movies are appreciated by the public. Making a good movie with a very low budget is a tremendously difficult job, these filmmakers deserve appreciation and better reception at box office.","user":"a-singh_7","rank":[3,3]},{"title":"Loved this movie","rating":9,"date":"19 December 2014","review":"I saw this at a festival and loved it. You have to pay attention, it's a dramatic story, but told in a very subtle way. While on the one hand it has a very intense subject matter, it's about so much more. There's a lot going on here. It looks beautiful, and the actors are so good. It is a strange love story, in a way. But one we can all relate to, even if we don't really want to. It brought me back to movies like Betty Blue, but also ones like Spectacular Now. The cinematography is also beautiful. The setting is in the countryside, and you really get the sense of nature, but also of the movie taking place in its own little world. I really enjoyed the music too. I recommend this highly.","user":"plum19-189-358542","rank":[3,6]}]