[{"title":"One-Dimensional Hollywood Fluff with Lousy Writing and Over-the-top Action...(spoilers)","rating":3,"date":"8 August 2014","review":"I'm not even quite sure where to begin with this movie. I mean, I had decent hopes for it. Leading up to it, so many people seemed to be taking it way to seriously. I mean, come on. Its about giant talking turtles who fight crime. Its not supposed to be that serious. Hoo, boy.<br><br>I guess I'll just start by saying this (spoilers ahead), the changes they made to the origin story don't make any goddamn sense, both in terms of simple logic and quality narrative structure. They completely removed any connection between Splinter and the Shredder, so say goodbye to any emotional connection or tension that that would have brought. And this version Splinter wasn't the ninja master, Hamato Yoshi or even a pet/student of Yoshi. In fact, Yoshi seems to have been omitted completely. So, how does Splinter become a ninja master himself? He reads a book. I'm not even joking. After both he and the turtles mutate he finds a book and teaches himself. And it wasn't even at the very beginning. I mean when Splinter begin teaching himself, the turtles are already walking and talking. He not only learned all of ninjitsu but also somehow mastered it, without any instruction or sparring, in less than ten years? AND he taught it to the turtles? BULLSHIT.<br><br>The turtles themselves are one of the few not-terrible parts of the movie. All of there individual personalities are right where they should be but we are also kind of short-changed on the amount of interaction they have with each other. A bunch of brothers together, getting up to shenanigans? What a great, natural way to have conflict! But no, the movie follows April way too much.<br><br>All of that is indicative of a larger problem with the writing. Both of the villains are BORING. The pacing is uneven and a lot of the dialogue is forced and ham-handed, Michelangelo was the worse in that respect. And believe me, I get it. Mikey is the loud mouth, party turtle. But is is possible (kind of necessary) that if a main character is annoying, to also be likable. Yes, it possible. Severus Snape. Perry Cox. Deadpool. These are all characters that are bad or annoying people but still likable as characters. After a few minutes of listening to Michelangelo, I just wanted him to shut the hell up. <br><br>It doesn't get any better with the villains. I don't remember the last time I watched a movie with such boring villains. Instead of just sticking with one main villain, the Shredder, we now have two...for some reason. WE have Eric Sachs, who is a rich scientist/industrialist and the Shredder, an evil ninja master with no personality. Eric Sachs is working for the Shredder for money? But isn't he already like a billionaire with a castle on a mountain and his own skyscraper?Doe he need more money? What the hell for? Shredder is the most shallow and one-dimensional out of this whole damn movie. We're not really told anything of his back story or shown any of his motivation for anything. The foot clan is also no longer a group of ninja warriors, they're...guys with guns. Completely useless guys with guns (that'll be relevant later).<br><br>They also unnecessarily tie April, Sachs and April's dad into the turtles' back story...for some reason. We don't even really meet April's father. And April is the one who saved them from the lab fire that killed her father...or wait, was it Eric who killed her father? The movie seems to confused on that point. And instead of keeping the baby turtles (like any little girl who likes animals would do) she...dumps them in the sewer? What the hell? The who thing is convoluted and doesn't make any damn sense.<br><br>April O'Neil is uninteresting and stupid. Seriously, I mean she is unintelligent. She is supposedly an educated journalist but spends so much time trying to convince he boss of a \"story\" of talking, crime- fighting turtles without one single goddamn lick of evidence. Vernon Fenway is apparently supposed to be the comic relief but none of his jokes are funny and his sole role in the film seems to be driving April around. And why the hell is Whoopi Goldberg in this? She had like six lines. Why is she here?<br><br>The camera-work was clichéd and chaotic. There were times when the camera was moving around too much for you to easily follow the action. There is also a serious lack of cool martial arts fights for a NINJA Turtles movie, which is not surprising when you turn their main antagonists from ninja into guys with guns. I also couldn't even begin to take the Shredder serious in the action scenes. Are those giant swiss army knives on his hands? What the hell?<br><br>Finally, the one thing, in my opinion, that sort of breaks the movie the most is that they made the turtles too damn powerful. Yes, the turtles are kind of superheroes. But wasn't being a bunch of kick-ass ninjas enough? No? You gotta give them super strength too? AND MAKE THEM BULLET PROOF!? Remember the previously said bit about the foot being a bunch of guys with guns? Yeah...you might see where I am going with this. It was bad enough to see the turtles throwing cars around and shattering concrete with punches. On some level, the audience needs to believe on some sort of fundamental level that the heroes are danger, that the threats that they face have meaning. Without that, there is no tension, no real conflict and with that...no excitement. No story.<br><br>This movie nuked the fridge.","user":"theLuauKing","rank":[320,443]},{"title":"Saw for free, still feel ripped off.","rating":1,"date":"13 September 2014","review":"Seriously, Michael Bay &amp; Co. should pay me for sitting through this ridiculous pile of tripe.<br><br>Grew up with the comics and cartoon show, loved the 1990 movie. Every sense I possess was repeatedly violated with this poor excuse of a greedy cash grab and pizza hut endorsement.<br><br>I knew not to expect, well, anything really that has Michael Bay's name attached to it, but somehow still managed to be surprised at the sheer badness.<br><br>The turtles themselves look strange, and act strange. Michaleangelo is like some weird semi-gangsta who is downright creepy in a continuing reference obsession with April O'Neil. Raphael is aloof, but exists little beyond that. That's as far as they went trying to define either one of them. <br><br>Leonardo, the brave leader, was completely robbed of his personality, characteristics, leadership and anything that would define him, and has always in the past. He is instead a dissolved Bouillon cube in a large pot of water....bland, bland, bland. His voice (Johnny Knoxville) is miscast, and would've been better befitting either Mikey or Raph...that is if they'd bothered to give them any personality.<br><br>The biggest violations however, lay with Donatello and Splinter, as it seems they thought that hyper-charging the characters would somehow make them interesting, endearing or watchable. \"Donatello does machines\" translates into exploiting him as a constant, textbook, super nerd. And he does absolutely nothing beyond that. Also, he looks like a Ghostbuster. Say hi to Dr. Donatello Stantz. <br><br>Instead of making Splinter the wise, insightful, deep, sensei he always has been, he's instead to a cardboard cutout that does a lot of \"action stuff\". Don't get me wrong, the Splinter of the cartoon and comics could certainly hold his own, but violence was always the last resort, and had a rationale. (reminds me of what they did to Yoda in the Star Wars prequels.) And he learns Ninjitsu from a book in the sewer, gone is any mysticism or any pivotal, emotional, or vital connection to important characters in the story.<br><br>Shredder is lame. There's no other way to put it. He is also a hyper charged extension \"more blades piled on the suit will make him better!\" He is unrecognizable beyond the pile of CGI blades, has no depth, no real motivation, and feels needlessly shoe horned into the \"story\" Especially since they terminated any connection with Splinter, or the long important history between them. (by the way, welcome to \"plot convenience playhouse\" when you find out that the turtles and Splinter were pets of April's when she was a girl. How convenient. <br><br>The biggest human violation is no doubt Megan Fox, who continues to show she's a vapid, terrible actress, incapable of emotion, facial expressions, or the ability to close her mouth. She's absolutely terrible and is no April O'Neil. Michael Bay continues to have an obsession with Megan Fox like you would not believe. <br><br>She also has no class, instead of choosing to take criticism constructively and look to improving herself and growing into a mature, capable lady, she instead publicly insults any who bashes this movie; (rightfully so) by saying \"f**k you\". Real mature Megan, and a great example for your children.<br><br>The best actor of the bunch, William Fichtner. I'm still trying to figure out what purpose he served and why he's in this movie to begin with, I keep looking, but...folks, I got nothing' (why is Will Arnett even here?)<br><br>There's also some defiance of physics as a mountain the size of Everest is apparently located not too far outside NYC, complete with a truck that slides down the side of it for ten straight minutes, with fast paced, confusing, unimpressive special effects. <br><br>The turtles are ridiculously bullet-proof (which leads me to why are the foot soldiers carrying machine guns? Or any guns for that matter?) The answer I came up with: lazy. Why bother to have some Ninjitsu students, or experts, or extras, in your Ninja movie, when it's easier to have a stunt guy fire a gun. (That or the entire budget went to lame special effects.) <br><br>Lots of low energy, thick glass shattering, metal side of van punching through escapes that make no sense at all. A yawn inducing, passionless, \"tower rolling down the buildings of NYC\" anti-climatic moments. Lame, just lame.<br><br>The solution: a marathon of the late 80's cartoon followed by a viewing of the 1990 movie..just to prove that Michael Bay hadn't killed my soul completely. 1/10.","user":"H_Spengler","rank":[96,129]},{"title":"Missing the basics of a great TMNT movie","rating":5,"date":"13 August 2014","review":"Like many other people, the original 1990 \"Teenage Mutant Ninja Turtles\" movie has a very special place in my childhood. Even if the movie wasn't all that great, it was fantastic for what it was trying to be. Now we're in 2014, where our beloved turtles have been given a whole new lick of paint with a straight-up reboot and have the daunting task of winning the long time TMNT faithful over. Needless to say that for the most part, I am one fan that was not entirely won over.<br><br>First and foremost, the Turtles. What is the fundamental premise of the TMNT? They're wise-cracking, pizza-eating, energetic teenagers that just so happen to be mutated ninja turtles that fight crime. The Turtles are goofballs, but in 2014, it's a little bit of a different story. There's still the humor, the jokes and comedy, but now the turtles are massive 6-foot-tall, muscle-bound turtle-men who have a very gritty feel to them, and when they're not in action, look way too real and off-putting. If they weren't green and didn't have shells, the Turtles would literally just be your average hulking action heroes. This franchise is about giant turtles who do martial arts. It's a goofy concept. Giving the Turtles a gritty makeover seems to miss the appeal of the characters in a fundamental way. However, despite the poor design choice of the Turtles, they really are a joy to watch. It might be a lot more serious than you'd expect from TMNT, but the Turtles are still wildly entertaining and more action-fueled than ever with the help of solid effects and choreography that bring the Turtle action to life. If you can withstand the eyesore that the Turtles' design brings, then there is still a lot of old school TMNT magic to revisit.<br><br>For the movie's main plot, you have what is essentially the most painfully basic, generic action story that a film can get. The movie is so predictable, it's almost laughable. What is also very disappointing is that the Turtles are no longer fighting crime, even though that's what is essentially believed, but a basic supervillain. Yes, the ultimate TMNT villain Shredder is in the film, but not only does he not get the screen time or proper development he deserves, he's basically cast aside as a secondary villain to the \"I'm rich but have to get richer\" villain that is Eric Sacks. It's disappointing to not be able to see the Turtles fight their way through dozens of foot soldiers like the old days, with all of the witty remarks during combat intact. There are still funny lines sputtered during combat, but the action scenes are so limited that there's simply not enough of it. <br><br>Not helping is the horrendous casting of Megan Fox as April O'Neil. In 1990, April O'Neil was the hot shot news reporter that made the amazing discovery of the Turtles and she developed an amazing bond with them. She was important to the story no doubt, but wasn't essential in the Turtle's story. Fast forward to 2014, and now April is nothing but the center of attention for everything in the movie, even essential back story information about the Turtles. Megan Fox amazingly gets much more screen time than the Turtles, and every time she comes on screen I cringe until our shelled heroes return. Not every action movie has to have an epic story line or to feel gritty and real. TMNT is supposed to be all about the opposite, but the unfortunate presence of producer Michael Bay is clearly felt in the direction of the film. From the camera shots, to the serious tone of the action to the slow motion parts, this movie has too much of a focus on seriousness, when it should be taking itself very lightly. <br><br>Like I stated earlier, despite the off-putting design and feel of the Turtles, they still are a lot of fun to watch and are the lifeblood of the film. What is missing, however, is the strong character development of the Turtles. There isn't enough down time in the movie to really get to know them. Some of the best moments of the 1990 film were in the form of the Turtles hanging out, making jokes, eating pizza and training together. That chemistry was not felt as strongly in the new TMNT and the movie just assumes that you all ready know who and what each Turtle is all about. But all you really find out is that one is a jokester, one's a tech geek, one's the leader and one has anger issues. More down time and better character development would've given the Turtles the extra boost to make them the incredibly entertaining bunch they're meant to be.<br><br>Being such a huge TMNT fan, I wanted to have higher expectations for this reboot. But with Megan Fox and Michael Bay attached, the poor look and design of the Turtles, along with the general off-setting feel of the film, I had to come in with lower expectations. There are some wonderful action sequences and the Turtles bring enough pop to the movie to make them likable and fun, but sadly, my low expectations were met in this failed attempt the reboot a childhood classic.<br><br>5/10","user":"slicedbread117","rank":[52,73]}]