[{"title":"Of Gods and Monsters....","rating":10,"date":"22 May 2011","review":"Being as I was a part of the London metal community in the seventies and eighties, a Hawkwind fan in my youth (saw them a few times in '72 and '73) and a Motorhead fan right from the beginning (I managed to catch their first few live shows in 1975 or whenever), I was, I guess, right at the front of this movie's core audience. Not even I, though, could have hoped for a more complete and more satisfying experience as the movie turned out to be! <br><br>Having had the privilege of spending time with the great man himself on a number of joyous occasions, I can happily report to any interested parties that 'Lemmy' is as honest a portrayal of the man as you could possibly hope for. He is exactly as this movie shows him to be, and that alone is enough reason for anybody - metal head or not! - to make the effort to see it. There is - and there will only ever be! - one Lemmy. Thank god (or maybe the other fella..?) that somebody had the balls to make this movie so that we may all cherish it in the years to come.","user":"Gloobey","rank":[16,16]},{"title":"Remarkable, well-made and highly interesting","rating":8,"date":"16 July 2011","review":"Remarkable documentary, both by not falling into the stereotypical rock 'n' roll trap of trying to show everything as hardcore, and also by showing Lemmy from several different angles, actually portraying him as more than a regular human being: multi-faceted, stupid, intelligent, very funny and a gentleman. Interviews with fellow musicians and celebrities mostly give something, rather than trying to impress. I feel the makers of this documentary have spent quite a lot of time at trying to find Lemmy, and I think this piece of work is commendable. A gleaming little pearl, documentary-wise. Even if you dislike Motörhead or even heavy metal music at all, this is great.","user":"pivic","rank":[11,11]},{"title":"Surprisingly warm hearted movie","rating":10,"date":"16 January 2011","review":"I managed to see this at the local cinema last night, the Riverview special late night showing, and it was a joy. It was a wonderful film and to watch it with a like minded audience enriched the experience.<br><br>The film is well shot, well edited and has great access to a wide range of people from Lemmy's past, and people who have been inspired by him. All the interviews seemed to give the same image of the man, which is one of the main points about him; he lives the life he wants, accepting the consequences and living an authentic life. The film is surprisingly funny and moving, and although he lives a life very different to most people I think it is quite life affirming. The film has a fantastic cast, well interviewed, some good shots of his music (but not so much that it would alienate people who are not into heavy rock'n'roll) some careful editing to give coherence, judicious use of slow-mo and worthwhile clips after the titles. I was smiling for most of this movie, which I did not expect.<br><br>This movie deserves the accolades heaped on it. It is an excellently made movie about a very interesting subject. I would love to see the team do another movie, or biographical movie, as their style here made what could have been a humdrum run through of one unusual lifestyle a wonderfully entertaining, informative and interesting film.","user":"BigMikeWright","rank":[26,29]}]