[{"title":"Our Love Became a Funeral Pyre","rating":9,"date":"26 March 2011","review":"When people watch the Oscars, they don't usually care about the Best Foreign Film nominees. Incendies provides so many reasons why people should actually get to see those nominees at all costs. Incendies is the kind of film that one walks away from feeling emotionally drained, one where it stays in the viewer's mind for days on end. Like an intense personal experience, it takes a lot to come to grips with the film's story, a moving plot full of twists and catharsis. At the New Directors/New Films Festival in New York, at which I saw this last night, Denis Villeneuve explained that he has made four films in Canada, but this is the first one to be released in America. Right now, I see no reason why Villeneuve, or any of the actors for that matter, shouldn't have a great future ahead of them.<br><br>Based on the play Scorched by Wajdi Mouawad, Incendies follows a non-linear plot that spans two generations. In the present day, Jeanne and Simon are twins who have lost their mother, Nawal. Nawal has stipulated in her will that Jeanne and Simon must return an envelope to the brother they didn't know existed who is currently living in a fictional Middle Eastern country. Only then can the twins give Nawal a proper burial. Jeanne feels obligated to return the letter, so she goes to the Middle East, only to realize some of Nawal's nastiest secrets. As Jeanne uncovers more about Nawal, the viewer is shown Nawal's story. The film builds up to an unforgettable ending that is sure to rock any viewer.<br><br>Incendies already had great source material. I've praised the plot enough, but one thing I must add is that the play is apparently four hours long, according to Villeneuve. It's impressive that this movie succeeds so nicely because I can't imagine that anything was cut. But to back up that source material, there's some really great acting. The entire cast plays their parts with such an emotional vigor that it seems impossible that this work of art wasn't autobiographical.<br><br>Furthermore, Villeneuve has made a film that relies on great filmmaking to impact the viewer. The cinematography is beautifully bland, surely a nod to some of the deserts in the Lebanon- like land where the movie takes place. Color scheme is also used to Villeneuve's advantage to show the parallels between Nawal and Jeanne's lives. Villeneuve seems to love working with extended zoom shots that shock the viewer with their overwhelmingly long silences. Why Villeneuve didn't receive critical acclaim (in America, at least) before Incendies is a mystery.<br><br>There are many movies about the Middle East. Some have failed miserably in their attempts to strike an emotional chord with critics and viewers alike (Redacted, Rendition), but others have been extremely successful (The Hurt Locker, Lebanon). Incendies could very well be one of the best films ever made about the conflicts in the Middle East. It has its flaws which keep it from being a masterpiece (maybe it could've lost five or ten minutes), but it is that rare type of film that really resonates beyond the initial viewing. Hopefully, Incendies will be remembered for years to come as the little, brilliant film that spawned the great fame of Denis Villeneuve.","user":"alexart-1","rank":[188,220]},{"title":"Unforgettable","rating":10,"date":"15 October 2010","review":"A bona fide masterpiece. As simple as that. It is ironic that one of the best films about the Middle East conflict, and specifically the tragic civil war in Lebanon, should be made by a Canadian film maker. Incendies is based on a play but it feels as though it has been adapted from a great literary work. In fact there is no specific mention of any country in the film but no one can be in any doubt that the unnamed country is Lebanon.<br><br>A Canadain-Lebanese woman dies in Canada and in her will she leaves two letters to her twin son &amp; daughter. One is to be delivered to their brother (whom they did not know existed) and the other to their father (whom they had presumed dead). To find these people they have to travel to Lebanon to unravel the mysterious past of their deceased mother. As we follow their search, flash backs slowly reveal to us key moments in the life of their mother.<br><br>There are extremely powerful and unforgettable images and scenes in Incendies. Suffice to say that even if you have no interest in the history of the Middle East, this film will capture your attention from the start and grips you right till the end. It is the third great film (and arguably the best)that I've seen on this topic after Waltz with Bashir and Lebanon. All of these are essential viewing.","user":"corrosion-2","rank":[265,323]},{"title":"A work of devastating power...","rating":9,"date":"26 January 2011","review":"\"Incendies (Scorched)\" opened in town this Friday, just days before it made the short list of nominees for Best Foreign Film for this year's Academy Awards. It played in the Vancouver International Film Festival 2010, but I missed it then.<br><br>Fortunately, it received theatrical distribution; this devastating film on the horrors of conflict and its enormous human costs simply must be seen. Denis Villeneuve's searing work, his fourth feature, is based on the celebrated play of the same name by Montreal native and artistic director of the French Theatre at the National Arts Centre in Ottawa Wajdi Mouawad. While there is no doubting the immediacy and impact it must have had as a piece of theatre, \"Incendies\" benefits from the transition to the larger canvas of the big screen, appropriate for the epic themes and emotional conflagrations it tackles.<br><br>When their mother dies and her will is read, twins Jeanne and Simon Marwan are stumped by its bizarre burial instructions. Nawal Marwan states that she must be interred naked and facing away from the sun in an unmarked grave, until the two letters she has left with the family notary are delivered on her behalf. One is addressed to the father the twins believed dead, the second to a son whose existence comes as a complete surprise to them. The will makes the twins realize that they did not know their mother at all. They have not had an easy relationship with her, and are understandably reluctant to comply with her terms.<br><br>The daughter Jeanne moved away and found refuge in the abstract realms of pure mathematics. Her sibling Simon, who remained at home, had the more complicated relationship because he dealt daily with Nawal's strangeness. Jeanne agrees to deliver the letter that was left to her, and embarks on an odyssey of discovery, in search of the father she has never known. Later, she convinces Simon to join her.<br><br>Although the Middle Eastern country is never named in the film, Wajdi Mouawad ascribes the inspiration for his play to Soha Becharra, a woman who was imprisoned for six years in Khiam, southern Lebanon. In an interview with the Montreal Gazette, he explained \"For me, the success of this play and the film is a way to give back some life to a woman whose life was taken away from her.\" The cinematic endeavor is hugely, powerfully successful: as Jeanne scours an alien land for clues of her mother's past, we see Nawal's tough life in flashback in the same locations that her daughter visits for the first time. Sectarian strife, tribal and religious warfare, family blood feuds, and honor killings have been the blight of the Middle East and areas as far as Afghanistan and what is now Pakistan, and parts of Africa. Bloodshed and violence have been a way of life; each side claims to be justified in killing to avenge earlier injustices. While humankind has not lost its baser urges—we just have to recall the recent incident of the young Afghani woman whose nose was hacked off, or the countless rapes in present day DR Congo—the film is a plea for reconciliation and forgiveness to bring about the much needed change.<br><br>Nawal barely escapes an honor killing due to her unwed pregnancy, gives up her baby son for adoption, and spends the rest of her life looking for this lost child. Along the way, she takes sides in the violence and is imprisoned for fifteen years for shooting a political leader. Upon her release, she begins life anew in Canada with her infant twins, the outcome of brutal rape at the hands of a torturer. Regardless of the change in geography, she remains haunted by the past and her unending quest for her lost child. How does one look for reparation and justice, when the perpetrators frequently flee the country of their misdeeds and seek asylum elsewhere? As she has not kept her word to her son to return to him, she feels unworthy of a proper burial. A character in the film wisely observes that death always leaves its traces, and Jeanne and Simon finally get to know their mother from the relics of her life.<br><br>The Belgian actress Lubna Azabal's heroic performance brings Nawal to awe-inspiring Brechtian life. Undefeated by each dehumanizing blow, she stoically navigates a war-crazed world devoid of any sense, her driving force is the need to reunite with her son. Mélissa Désormeaux-Poulin and Maxim Gaudette do excellent work as the siblings who gradually begin to understand their mother. Rémy Girard and Allen Altman, playing the Canadian and Middle Eastern notaries respectively, guide the siblings through their search, while Abdelghafour Elaaziz makes an impact in the small but important role of Abou Tarek the torture specialist. The rest of the characters are brought to life by a talented cast of unknown actors; in their hands, even the smallest roles acquire great significance. Denis Villeneuve's film honors the stories of these people by rigorously avoiding directorial excesses. Events and stories this powerful do not require embellishment, and Villeneuve's spare, dispassionate directorial style maximizes impact.<br><br>Someone remarked that \"Incendies\" is the closest contemporary approximation of Greek tragedy, and I agree with this assessment: the crimes and consequences are universal and timeless, and if a film holds up a mirror to question our capacity for barbarism, it is reason to applaud. Regardless of the outcome at the Academy Awards, \"Incendies\" is a major achievement for Canadian cinema.","user":"ilpintl","rank":[127,158]}]