[{"title":"This is NOT Taken -- The trailer is misleading","rating":8,"date":"29 January 2010","review":"This one surprised me, because I had seen very little advertising or hype for this movie. My friend and I watched the trailer and I thought, \"Eh, kinda looks like another 'Taken' or 'Death Sentence.' I'm so glad I was wrong.<br><br>This is not another \"father goes on rampage to kill the guy that kidnapped/murdered his child.\" It's actually a very involved thriller that has a fair few twists and turns around a conspiracy Gibson's daughter was involved in. Gibson actually does not go all gung-ho like Neeson did; rather, he was very careful in his investigations. His performance was brilliant, as was Ray Winstone's, though I found myself wishing he had a bit more screen time.<br><br>The pacing is pretty quick in some places, so it keeps you interested. Sometimes the plot may be a little convoluted, but it makes sense if one pays enough attention.<br><br>Also, I should note that there isn't nearly as much action as the trailer makes it seem. There is FAR more drama, though it's still plenty tense.<br><br>First movie of 2010 I've seen, and it's off to a great start. \"Edge of Darkness\" is well worth it, and certainly not the movie its advertising makes it out to be. Go see it, you won't regret it.","user":"Valcoran","rank":[238,286]},{"title":"An Icon","rating":7,"date":"16 February 2010","review":"Some people have bagged out this icon, but his performance in this movie was as good as ever. It was convincing, honest, and true to script. <br><br>I worked with Mel on this movie so feel that any review I give will be biased - reviews are best left to the viewers, after all, they are the ones who determine its success or failure - but I can assure you he was the ultimate professional - his career has many years left!<br><br>Bad reviews are of course as welcome as positive ones - as long as they are constructive - they are an avenue not only for others to ascertain the value of a movie but also an avenue for those involved to learn and improve (as well as gather praise where praise is due) - but I would highly recommend you see this one and make up your own mind. It is highly relevant to the current economic stasis in this country and a hint of what may be behind the scenes.","user":"daniel-usdirector","rank":[71,86]},{"title":"Mel is Back as a detective with drama, intrigue and action","rating":8,"date":"26 January 2010","review":"I saw this movie at an early screening and was delighted.<br><br>I give this movie three stars out of four, or 8 of ten points for great characters, intrigue, and some startling action scenes. It looses the 2 points because it does tend to slow down a little and become more dramatic at times but if you are a Mel Gibson fan you probably won't mind that at all. This movie reminded me a little of Taken, with a whole lot of Enemy of the State, and just a touch of Jason Bourne. Mel Gibson is engaging in his first acting role in years, although he definitely looks older now. It's hard to watch Gibson here without thinking of Martin Riggs in Lethal Weapon and there is some carryover but here Craven played by Gibson is the older, caring, Father who is also a cop although there is still some of of the craziness that made Mel so dynamic in a number of his roles. In some ways Mel reminded me here a little of Clint Eastwood in movies like Absolute Power and In the Line of Fire as the more mature protagonist who combines maturity and cunning with a fierce side that comes out in battle.<br><br>It's not giving anything away to say that the story is about Mel Gibson's character trying to find out who killed his daughter as that much is in the trailer. Mel plays a veteran detective and so has skills and resources we civilians don't. The movie takes a while to develop and takes great pains to show the love of Craven for his daughter in the opening scenes and then periodically remind us in flashbacks. There are a lot of characters which seem to be critical to building the intrigue of the movie; activists, defense contractors, government officials and various henchmen. The movie does a good job for a while of hiding who is working for whom. Suspense does build for most of the movie but a good bit before the end it is evident what is going on and the movie shifts from an action thriller to more of an pure action movie.<br><br>Ray Winstone plays an intriguing role as Jedburgh, deftly showing protagonist and antagonist sides at different times in a mysterious role. Danny Huston plays a multi-dimensional character, Jack Bennet, that is fun to watch. Bojana Novakovic as Emma Craven is a sweetheart. Jay O. Sanders plays a solid role as Detective Whitehouse.<br><br>The movie is definitely heavy on violence and acting independent of authority although I don't remember any swearing or sex scenes. Still it requires a mature audience as the hero's actions are probably not ones you want your kids emulating in your house. As with so many movies it portrays sides of business and government at their worst. So,since it is light on sexuality and vulgarity I would suggest that if you let your older kids go that you still discuss the extreme portrayals of the police, use of force, business and government.<br><br>It's good to see Mel back in action.","user":"markusws","rank":[179,242]}]