[{"title":"Skip it and watch the original instead","rating":2,"date":"25 August 2017","review":"As a fan of the original Death Note anime I am very disappointed in this film. It was poorly acted, horribly paced, and the drama felt more edgy than composed. The characters personalities were completely changed to the point where I didn't see why they even bothered maintaining the original names and The events of the story were changed so drastically I forgot that I was watching Death Note. In the original anime both L and Light were very calm and rational in how they made each decision, creating a suspenseful psychological drama, but in the film both of them do things that were very out of character and essentially made no sense. Overall this felt very rushed and poorly directed, I wouldn't be surprised if the director had never even heard of the original anime before doing this film.","user":"BeyondEternity","rank":[737,913]},{"title":"I wish I could rate it ZERO","rating":1,"date":"25 August 2017","review":"WARNING: THIS REVIEW CONTAINS SPOILERS!<br><br>Netflix's Death Note - SPOILER Review.<br><br>I believe a movie THIS bad deserves to be completely spoiled, if anything to be avoided like the plague.<br><br>Director Adam Wingard has achieved the impossible, he has taken the title of \"Worst live-action manga adaptation\" away from Dragonball: Evolution. DBE doesn't even come close to the complete disregard of source material this horrendous movie is guilty of.<br><br>Nat Wolff's Light Turner is nothing like Yagami Light from the manga. Light Turner is a bullied kid who starts his killing spree with a bully. Besides that he is a scarily child who is in way over his head with the book he's been bestowed upon so he reveals his secret to his High School crush, a cheerleader named Mia Sutton (Margaret Qualley), which we are supposed to believe that on the mere sight of the book becomes a raging psychopath that wants to kill everyone, and I mean everyone she feels like, and this was supposed to be the new version of Misa, right?<br><br>All the intelligence, all the cold and calculating aspects that made Yagami charismatic are completely gone, instead of Death Note we get \"The Killer Diary of a Wimpy Kid.\"<br><br>But nothing compares to what's done to L. The famous detective who is also cold, incredibly intelligent, and astute, is horribly played by Keith Stanfield as a maniac, and frenzy detective vigilante of sorts. Too many times in the film he loses it and even comes close to murdering Light in cold blood, either by running him over with a car or by shooting him. That is something L would never do.<br><br>The book has about 70 rules, and they are revealed when it is convenient to the plot. <br><br>And not even Willem Dafoe's Ryuk can save this abomination, his character appears like 10 minutes of the film, and Ryuk is not a bored Shinigami anymore, in this version he is a sadistic god of death who enjoys seen people die.<br><br>Adam Wingard is a complete hack, someone who either did not understand the manga, or thought of himself better and more capable to tell this story than the original writers. <br><br>His movie is not even worthy to be called Death Note, it is barely worthy to be called a movie as it is an outright blasphemy to the manga and the anime. It is by far the worst live-action adaptation I have ever seen.<br><br>I rate it 1 out of 10, simply because I cannot rate it lower on IMDb. <br><br>I had to watch it hoping I was wrong, but I encourage you to stay away from this filth.","user":"GomezAddams666","rank":[317,398]},{"title":"An insult to the original Death Note (Desu Nōto)","rating":1,"date":"25 August 2017","review":"I have never felt compelled to write any reviews but I felt that I needed to say something for this movie.<br><br>I normally like Netflix TV shows but movies lately have been really sub- par with this one being the worst I've seen from them.<br><br>This is a total waste of time and this movie should have never been made, it's an insult to the original Death Note (Desu Nōto). The plot was totally ruined since it was changed from the original, yeah they kept the premise but they decided it was a good idea to mix it up with stupid teen drama/relationship and a bunch of other nonsensical BS.<br><br>Go watch Desu Nōto instead if you haven't or if you have then watch it again!","user":"AntonioCalcano","rank":[682,888]}]