[{"title":"Exciting thriller, although unable to keep up with its predecessor","rating":7,"date":"8 September 2009","review":"Perspective: I am 25, Danish (thus understanding Swedish) and have not read the books.<br><br>\"The Girl Who Played with Fire\" continues smoothly from were \"Men Who Hate Women\" left off, and lets you easily connect with the core characters. Salander, Blomkvist and the Millennium crew are as usual exposing the darker sides of society and confronting the perpetrators, while Salander being under pressure from all directions.<br><br>Where the cruelty and surprises of its predecessor were essential for making it stand out among thrillers, I find this movie more mainstream in storyline and creativity. Salander has lost some of her mysterious goth charm, and the sex trafficking theme is only touched very softly, turning the movie into a regular investigation with a familiar cast of characters.<br><br>The movie is worth watching, but it's my impression that you should rather read the book first, to get a much deeper insight in the great novel.","user":"denglidendekop","rank":[139,166]},{"title":"Lisbeth back in action","rating":7,"date":"20 September 2010","review":"There's an important detail about the film version of The Girl Who Played with Fire (in fact, of the whole Millennium trilogy) that needs to be known in order to understand why some (myself included) perceive this as the most flawed installment in the series: originally, all three adaptations were shot for Swedish television, with six 90-minute episodes condensing Stieg Larsson's remarkable prose. Late in the game, it was decided to give The Girl with the Dragon Tattoo a theatrical release, albeit in a shortened version (half an hour was chopped off), and when that became the highest-grossing Swedish film of all time, the other two chapters received the same treatment, with the uncut versions held in storage until spring 2010. In the case of the second film, 60 minutes went missing in the TV-to-cinema transition, and it shows.<br><br>Picking up from the first episode, we catch up with Mikael Blomkvist (Michael Nyqvist) enjoying his newfound freedom and restored reputation, while troubled hacker Lisbeth Salander keeps mostly to herself. That is, until Millennium magazine enlists the help of two new collaborators for a special issue about sex trade, and the two are found dead, much like Lisbeth's sadistic guardian, Nils Bjurman. Evidence points to Salander being the killer, and with no way to defend herself she ends up on the run, desperate to prove her innocence, while Mikael tries to help her as much as he can from the office, eventually realizing he's in much bigger trouble than last time.<br><br>Based on the summary alone, The Girl Who played with Fire should be as great a thriller as its predecessor. That it isn't is essentially up to a couple of factors: firstly, new director Daniel Alfredson (brother of Let the Right One In's Tomas), who replaced Niels Arden Oplev for the last two bits of the trilogy, occasionally fails to capture the same raw atmosphere as in The Girl with the Dragon Tattoo; secondly, the aforementioned removal of one hour's worth of footage makes the whole thing feel a bit rushed, particularly in regards to new characters who are hastily introduced and then dispatched just as quickly. Additionally, the extended cameo of boxer Paolo Roberto, playing himself, will make little sense to non-Swedish viewers, though it is faithful to the book and allows for one kick-ass fight scene. As for the final twist, what came off as a shocking revelation on the written page loses a lot of its impact on screen, due in no small measure to Oplev virtually giving it away in the first film.<br><br>That the film manages to make any kind of impression is all thanks to one person: Noomi Rapace. Sure, Nyqvist's work is fun to watch, and the supporting players do their job well, but Rapace towers above all of them with her harried, mesmerizing portrayal of a rebellious yet strangely vulnerable woman who just won't take any crap from anyone. There are rumors of a possible Oscar campaign for her work in the trilogy (though if they had to single out a specific installment, the logical choice would be The Girl with the Dragon Tattoo), and she really deserves it, not least for her ability to show off her dramatic skills even in a moment as irrelevant as a gratuitous girl-on-girl scene (again, faithful to the book) that has clearly been added to compensate for occasional shaky plot points.<br><br>In short, The Girl Who Played with Fire is a great acting lesson and a fun thriller, but little more. A shame, given the high standards set by Lisbeth's first cinematic adventure.<br><br>6,5/10","user":"MaxBorg89","rank":[59,68]},{"title":"A fine sequel","rating":9,"date":"11 April 2010","review":"This film continues where \"The Girl with the Dragon Tattoo\" left off. I have to say that personally, I do not really understand the bad reviews, though I must also admit I have not read the books yet, so I am not comparing it to the book, I am simply viewing it as a film in it's own right, and perhaps my review is therefore more generous than it would be if I had read the book too.<br><br>I personally thought this movie was riveting, but for different reasons than the first. Firstly, there is a lot of action in this film, I feel it was done well, and it kept the film exciting. Secondly, the depths into Lisbeth's past were also revealed very well. If you didn't learn that Lisbeth is untimately very sensitive behind her \"cold\" exterior, you learn it from this film.<br><br>Yes, certain scenes could have been better shot, better directed etc, but these are minor drawbacks. I feel this is again a must-see, and a very good bridge to the conclusion of this millennium trilogy.<br><br>9/10 Recommended!","user":"MusicaEternal","rank":[82,112]}]