[{"title":"Inept, clichéd, poorly edited, huge unexplained plot holes","rating":30,"date":"30 August 2011","review":"This movie is totally inept. It's one of those films where the characters behave so stupidly you can't believe it. Every scene is a horror film cliché. As for horror, there is none. Some of the scenes are so darkly lit you cannot tell what is going on and I have a feeling the cinematographer did not know what he was doing. As for the script, plot holes abound. Things happen and then are dropped. Characters pop in the movie and are never seen again. One scene will suffice. SPOILER: The grounds keeper is attacked by the creatures with screwdrivers and box cutters, he staggers up the stairs, falls face down on the floor in front of his wife and the little girl. When the husband comes home, the man's wife tells him that her husband has had an \"accident\". No one asks how he had an \"accident\" with a screwdriver stuck into his eye and a pair of scissors in his shoulder. I was really disappointed with this movie. I would say save your money.","user":"StanleyStrangelove","rank":[67,87]},{"title":"Not much need to be afraid of this remake","rating":4,"date":"27 August 2011","review":"Pros: beautiful scenery/sets, a few good jumps, and about 5-10 minutes of eerie atmosphere <br><br>Cons: not very scary, too much CGI'd gremlins, and a very predictable/slow plot<br><br>Conclusion: rent the original and skip this remake<br><br>The much anticipated, by me, remake of the 1973 made for TV movie of the same name left me feeling extremely disappointed. The plot was fairly simple. A young girl Sally (Bailee Madison) moves in with her father Alex (Guy Pearce) and his girlfriend Kim (Katie Holmes), into a house Alex and Kim are fixing up to sell. Soon upon arriving, adventurous Sally discovers the house has a basement and that the family is not alone. The basement's fireplace is inhabited by little CGI'd creatures that terrorize the family, especially Sally. The actors I felt all did an adequate job playing their parts, especially young Sally (Bailee Madison), who played a convincingly cynical little girl fed up with being 'sold' by her mother to live with her father. Overall the movie was very predictable and offered very few scary moments. The creatures from the original, people dressed in little goblin costumes, were sparingly showed. I think it was way more effective than the over-shown little gremlins in this movie, which looked to me like Chihuahuas that could speak. Save your money and skip this one!","user":"inkleinedpuncture","rank":[108,155]},{"title":"Attack of the CGI furry babies!","rating":2,"date":"12 January 2012","review":"I saw the trailer for Don't be afraid of the Dark a few months ago and really wanted to see it, I begged my boyfriend but as always he makes fun of the fact how much I love horror movies and didn't take me. So I had to wait for the rental and now I actually find myself thanking him that we didn't waste our money on this stupid movie. I love haunted house stories, I think since Paranormal Activity, everyone has had their eyes back on that genre of horror. So naturally comes a remake from the 70's comes along that was a haunting child horror story and let's make it the most ridicules looking thing you'll ever see in your life.<br><br>In Blackwood Manor eight-year old Sally Hurst arrives in Rhode Island to live with her father Alex and his girlfriend Kim, both restoring it to put it on the market for their client Mr. Jacoby. Sally is depressed due to her mother forcefully putting her in Alex's care. On the first night of her stay, Sally is given a carousel-styled nightlight, the melodious tune it plays awakening the creatures in the ash pit. The next day, Sally wanders the grounds and finds the hidden basement's skylight. However, one of the workman restoring the house, Mr. Harris, warns her, Alex and Kim not to venture into the basement, although they do regardless. Sally takes interest in the sealed fireplace where she hears the creatures calling her name, and follows the mysterious voices. They are now haunting her and will do anything to get her down into the dark.<br><br>Where to start with the plot holes in this movie? The creatures are supposedly scared of light yet can walk through a party where there is light everywhere and somehow they could make it under the table? Then how is it that the handy man is attacked by these creatures, getting stabbed all over the place, including the scissors in his shoulder and when the maid comes in he says he had an accident! How you explain that one? The tool box just exploded? Of course you have the cliché where the father doesn't believe his daughter despite numerous episodes of her screaming hysterically that there are things attacking her and then his girlfriend tells him to listen but that's not enough apparently.<br><br>They also show a lot of these little monsters that are just laughable, I'm sorry but they did not terrify me in the least little bit. You step on them, they're little bugs, no big deal. They don't have any super powers, they have to convince children to follow them with stupid little faces so naturally as an adult this is just stupid. They don't fly, don't hypnotize people, don't have super strength, so it's just lame. The ending didn't make any sense what so ever. The only thing I could give the film credit too is that the atmosphere was creepy. The sets were amazing and did give a good way to give little chills here and there. Also when Sally looks under her sheet to see what creeped under, that was a pretty frightening scene if it wasn't for the silly CGI effects. But it wasn't enough to save the movie sadly. I was really looking forward to this movie, but it was a total let down, it's not scary or enjoyable and honestly after I'm done writing this review I'll probably forget about this movie.<br><br>2/10","user":"Smells_Like_Cheese","rank":[37,49]}]