[{"title":"Solid effort from Seagal.","rating":6,"date":"19 October 2009","review":"The Keeper: Seagal's delivers another film. The regularity of his releases brings a sense of excitement (well, to Seagal's fans anyway) but also trepidation. Will it have dubbing? Will it have doubling? Will it just plain old suck? On the most part, Seagal's DTV release normally tick a yes to all those questions. In recent years, Pistol Whipped and Renegade Justice were watchable exceptions. Pistol Whipped in particular was almost worthy of Seagal films of old. His last two have been pretty poor. Kill Switch was abysmal, while Driven To Kill was mediocre, suffering from lacklustre direction, poor cast, an all too whispery Seagal, and terrible editing. So does the Keeper deliver? On the wholeyes! Okay, this film isn't great by any stretch. But it's serviceable, and it kicks ass as well. Seagal actually has a bit of character in this, and shows off a bit more of the charisma that made him a star. As well as that, the co-stars are better than in his last few films, while the previous company he worked with, for Kill Switch, and Driven To Kill, has a reputation for half-assing. At least for The Keeper, there's a greater sense of effort to make something that delivers for the fans.<br><br>The Keeper opens with a worrying start. Dubbing! Oh dear lord! Not dubbing. However it's just in the beginning few lines, and in truth it's a couple of lines that are really needlessly added in. There was only one other moment later in the film I noticed any, but again, it was pointlessly added in. Mr Stand in still gets some screen time of course, but not that much. I'm also pretty sure, Seagal's double was given a supporting role in the film as another character, because one of the cast looks like he could double for Seagal for behind shots.<br><br>But anyway, The Keeper is a Seagal film, and first and foremost, it needs to kick ass. And it does. The action has a bit of punch to it. The gun fights are quick and punchy, while the fights are bone-breaking and violent. Sometimes in Seagal films, they stretch the action scenes out, and make them dull, when short and snappy would be better, particularly in hiding the budget. Generally here, the action is short and to the point. The only problem is, that the film could have done with more action, as the pace drags at times. There aren't many fights, but they are tightly edited, and Seagal beats the hell out of the bad guys. There's not quite some of the ingenuity to the fights that we saw in Pistol Whipped, which is a shame.<br><br>Keoni Waxman does a service-able job in direction. He's got more of an eye for direction than Seagal's previous director, Jeff King (who's first name is actually Wan). Truthfully he never does anything beyond okay, but in DTV land, that can be a blessing. And in fairness to him, he never does anything that's too lame. Seagal himself seems more interested in what he's doing here. He's back to his badass self, and showing some charisma again too. He won't be winning any Oscars, but at least there is some sort of character for him, and the film manages to throw in some moments of humour too. His last couple of films were slightly wretched to be honest. Elsewhere, the music is not too bad, and the film is his best looking one for a while (the main disappointment on Pistol Whipped was that it was shot on Super 16).<br><br>Overall though, this is a decent DTV film. It delivers what you'd expect. Some action, and some badassedness. The plot is simple, and again, for Seagal, that is better. No CIA intrigue sub plots to drag the film down. It also avoids the usual Seagal, revenge line, that's become a little tiresome for him. Early on in the film there's a few moments in the plotting that are just really, really (and I mean really) dumb, but they don't really drag the film down too much. At least The Keeper delivers the minimum you'd want and expect from Seagal. As for Seagals next two DTV specials, he'll be back with director, Keoni Waxman, which is a good sign. On The Run looks more action packed, so hopefully won't suffer the pacing issues of this film. It might lack some of the character of this one though. ***","user":"supertom-3","rank":[53,69]},{"title":"Solid but Unspectacular DTV with one really bizarre error","rating":6,"date":"11 February 2010","review":"\"The Keeper\" is better than most Steven Seagal Direct to Video films (but not as good as any of his theatrical films from back in the day, of course). I mean, anyone who says this is a downturn in quality obviously never saw \"Kill Switch\" or \"Out for a Kill,\" \"Today You Die,\" or any of the other Seagal DTVs that were so re-dubbed, re-edited, and filled with stock action sequences cut-and-pasted from other films that they were totally incomprehensible. At least \"The Keeper\" had a basic story you could follow and made sense overall. It's almost at the level of lower tier action flicks like Charles Bronson's \"Evil Men Do,\" or Burt Reynold's \"Malone\" (and about at the level of Van Damme's \"Border Patrol\"). Serviceable vehicles for aging action stars. And the film has a tiny bit of Seagal-dubbing at the opening, a few lame supporting performances, and some minor continuity and plot hole problems--the usual for super low budget action flicks. But the leading lady is pretty good--delivers her lines well and is sexy in that gangly, puppet-ish Scarlette Johanssen way). And the guy that plays her dad is channeling Levon Helm, so that's OK. The film's opening, where cop Seagal is shot and then has to train his way back to fighting health, is pretty good, but seems to be from a different movie; none of the characters it introduces appear later on in the movie (in fact, the opening incident isn't even mentioned later on). I suspect that the best parts of two not-that-great screenplays were melded together.<br><br>But the really WEIRD error in this otherwise workmanlike flick is that Seagal's character's name, Rolland Sallinger, changes halfway through to Rolland BALLINGER! Just out of nowhere, one of the other actors start calling him \"Ballinger\" instead of \"Sallinger\"! This is both the kind of thing you'd expect in a Seagal DTV, given that they are often slapdash, but also exactly what you wouldn't expect! I mean, Seagal's DTVs are notorious for the re-dubbing of dialog and the makers of The Keeper opted not to re-dubb dialog in a case where it actually would have made sense to do so!<br><br>All in all, though, this is a passable 90 minutes entertainment for fans of the giant, middle-aged, whispering bada$$ we all secretly love.","user":"curtis-8","rank":[18,21]},{"title":"Not as bad as I feared","rating":6,"date":"11 September 2013","review":"There was nothing of much interest on TV a couple of nights ago so I stumbled onto this one. I used to like Steven Seagal when he still made \"real\" movies so I thought, what the heck, let's watch it. I cannot say that my hopes were high though. After he started to spew out direct to DVD movies he have made some real crap ones.<br><br>I have to say that I was somewhat positively surprised. Sure it is not exactly Oscars material but it is a decent enough TV-movie and Seagal was pretty okay in playing the fairly silent but deadly ex-commando, or in this case ex-cop, that I personally want to see him as. Some people complain that he doesn't care and that he mumbles his dialog. I cannot say that I agree. He played his role as I would have expected. His silent manner, low voice and absence of emotions and outbreaks is what I hope for when I watch a Seagal movie. Also, the fighting in this movie was fairly okay compared to some of his movies where he seemed to be so out of shape that he just stood around and flapped his arms.<br><br>The story? Well pretty standard meh TV-quality bad guy tries to muscle in and extort the good guy. Good guy has daughter. Good guy's daughter gets kidnapped. The hero moves in and saves the day. Nothing really innovative and fantastic but good enough to serve as an excuse for some on-screen action and reasonably well implemented.<br><br>Not really a bad movie. Of course not really anything more than you would expect from a direct to DVD movie but not bad either and, as I said, way better than some of the crap Seagal have produced.","user":"p-jonsson","rank":[6,7]}]