[{"title":"A unique movie. Children will love it. Adults are just broken.","rating":9,"date":"29 November 2013","review":"Don't vote 10 for a movie if you feel it deserves a higher rating. If you vote 10, your vote does not count. Vote 9 instead.<br><br>This is a movie about dreams, imagination and magic. Also a film that tells us about Africa as the spiritual cradle of mankind. It's filled with beautiful little tales all united by the fantastic dreams shared by a boy and a girl. A journey of initiation and communion with nature on a deep spiritual level. It's so beautiful!<br><br>Maybe people that don't like this movie think it's lacking violence and a war of good against evil. Ain't you tired of that yet? Harry Potter, Lord of the Rings, they all need villains to justify being heroes. Here there is no need for any of that. And yet there is so much to enjoy! What a heart-warming quest! Learn to talk to the spirits of trees and animals. Learn the importance of tales and memory. So much in this movie that I haven't seen anywhere else! Congratulations to everyone that made this film possible. A true treasure for the children of the world.","user":"another_heavenly_world","rank":[6,7]},{"title":"heartwarming family film","rating":10,"date":"5 October 2013","review":"I cannot understand why this film has an average 3.0 rating. No, the cgi sequences aren't up to Hollywood blockbuster standards, the score is somewhat minimalistic, and some of the acting performances are a little under par, but this is essentially a heartwarming story of a girl who feels pity for an African street boy who finds refuge in the fantasy dream world of his African ancestors, and follows him there, where she discovers a place full of talking animals and magical spirits who help her in her search. The film is largely constructed as a dream sequence, something I feel it does extremely well, and is filled with beautiful images of Namibian landscape and wildlife.Eva Gerretsen is convincing in her role, as are the speaking animals. The film has a lightly moralistic tone (without writing spoilers, big game hunting is put in a negative light-hope you all agree with that-). We watched this film with our 9 year old twins, (boy+girl) and we all thoroughly enjoyed it. it is a wonderful introduction to the beauty of Africa, the importance of empathy amongst mankind, and is filled with beautiful animals both fantastic and real. No orcs, no battles, no horrific images (there is one fire spirit that I was concerned about who might be frightening to a 5-year-old, but he has a very friendly voice, and does nothing but help the girl). I've rated the film 10 because it really doesn't deserve the 3 average it has at the moment (I would normally rate it as a 7 or 8). It's a shame that so many films get rated on their technical, rather than story content.Thoroughly recommended as an intelligent and didactic children's film.","user":"fsa-809-395885","rank":[2,2]}]