[{"title":"This movie is gritty, fun, exciting, suspenseful, and rewarding.","rating":7,"date":"23 February 2020","review":"I had not heard anything about this movie before I watched it. Overall this film is a pleasant surprise. Jason Statham is good playing a similar type of role he has played before. The script is unique and is interesting the entire way. I would recommend this film.","user":"MR_Heraclius","rank":[34,35]},{"title":"Good but not great.","rating":7,"date":"26 May 2011","review":"A cop killing crim is giving the police the run around in old London town.<br><br>Blitz is a good movie that finally comes to life about 20 to 30 minutes in when we finally get to the main story. Once the chase is on with the odd couple partnership of tough rule breaking Tom Brant (Jason Statham) and gay straight laced Porter Nash (Paddy Considine) pursuing the cop killing criminal who's hungry for notoriety the Blitz (Aiden Gillen) the movie comes into it's stride. Before that we're inundated with so many characters it's a little confusing. What makes matters worse is that none of these side characters stories are ever really finished and the time wasted on them could have been spent giving a little more screen time to Porter Nash who is sadly underused.<br><br>Don't get me wrong though I enjoyed the film. Aiden Gillen is a brilliant bad guy, giving his character a Johnny Rotten swagger. I felt myself enjoying hating the Blitz and couldn't wait to see him get his just deserts but we could have done with getting a little more insight into his behaviour. Statham does a good job showing a little weakness now and then in his usually gruff demeanour. As I have already said Paddy Considine is great but not in it enough for my liking. London looks great and there is an exciting chase through the streets which is one of the high points of the movie.<br><br>I enjoyed the movie and would happily watch it again. It's biggest fault was trying to juggle too many story lines at once and unfortunately it dropped a couple of balls.","user":"Greenzombidog","rank":[80,109]},{"title":"I Loved This Movie!!","rating":9,"date":"29 November 2011","review":"Blitz is not getting much respect from reviewers on IMDb, and I'm very surprised by this. I loved it from the first minute to the last and ordered the Blu-Ray on line before the credits had even finished.<br><br>Statham plays an aggressive cop with an attitude, and if he's got a weapon in his hands (like a hockey stick) he'll wield it like a pro.<br><br>Paddy Considine plays a gay cop who's capable of taking the law into his own hands, and this allows him to work with Statham just beautifully.<br><br>Aidan Gillen plays a fabulous psycho with a thing for killing cops, and he's been one of my favourite British actors for the past 10 years anyway, so it would have been hard for him to screw this one up.<br><br>The action from the opening scene is great, Statham's lines are terrific stuff and had me laughing hard more than once, the odd-team Statham and Considine create is brilliant, the story doesn't get bogged down in personal problems, there are no annoying girlfriends, wives or kids to pull the actors and audience sideways away from the story (some directors seem to love putting that type of stuff in), the continuity issues others have mentioned are so minor they don't matter, the soundtrack was perfect, and the ending was everything I hoped it would be.<br><br>This film is never going to make the 'Greatest Films Ever Made' list, but its sure as hell fun to watch as far as I'm concerned. It doesn't beat around the bush getting started, doesn't waste time during the film, keeps up the fun, and what more do you want from Statham and an action film? To the film's detractors I say 'lighten up'! It's obvious from the first 10 minutes the film's creators weren't chasing Academy Awards, so why knock it so hard? It's meant to entertain for 90 minutes, and it does just that.","user":"go_titans","rank":[41,54]}]