[{"title":"Big guys and little guys and what we have to eat","rating":8,"date":"20 June 2009","review":"The message of 'Food, Inc.' is that most of what Americans now eat is produced by a handful of highly centralized mega-businesses,and that this situation is detrimental to health, environment, even our very humanity. The ugly facts of animal mistreatment, food contamination, and government collusion are covered up by a secretive industry that wouldn't talk to the filmmakers or let the interiors of their chicken farms, cattle ranches, slaughterhouses, and meatpacking plants be filmed.<br><br>Informed by the voices and outlook of bestseller authors Eric Schlosser ('Fast Food Nation') and Michael Pollen ('The Omnivore's Dilemma'), this new film is an exposé that offers some hope that things can be made better through grassroots efforts. True, Kenner points out, Monsanto, Smithfield, Perdue, et al. are rich and powerful. But so were the tobacco companies, and if Philip Morris and Reynolds could be fought successfully, so can the food industry. The fact that the vast Walmart is switching to organic foods because customers want them shows people vote effectively with their pocketbooks every time they buy a meal.<br><br>Other documentaries have covered this ground before. The 2008 French documentary 'The World According to Monsanto' (2008) focused on how that company, with government support, monopolizes seed planting, and Deborah Koons' 2004 'The Future of Food' went over similar ground. Jennifer Abbott and Mark Achbar's sweeping 2003 film 'The Corporation' (2003) touched on Monsanto's monopoly too. In more general terms, the ominous, narration-free German documentary 'Our Daily Bread' (Nikolaus Geyrhalter, 2003) delivered 'Food, Inc.'s' message about dehumanized factory-style food production with a European focus. Richard Linklater's 2006 'Fast Food Nation' grew out of Schlosser's book about how bad and disgusting American fast food is and how it undermines the health. These are all good films, and there are and will be lots more. As this new film mentions, exploitation and malpractice in the meat industry were exposed as far back as Upton Sinclair's 1906 muckraking book, 'The Jungle.'<br><br>'Food, Inc.' is a populist and practical film that speaks with the voices of farmers, advocates, and journalists, and focuses on food, what's wrong with it, and what we can do about it. Kenner offers lots of practical information and appeals to everyday people. The film goes back to the Fifties to show how the rise of fast food contributed to centralized, less diverse American food production. MacDonald's now much of the chicken, beef, potatoes, and many other foods produced in the country. The film explains that only a handful of companies control not only most of the beef, pork, chicken, and corn produced in the US but most other food products as well. Moreover not only is corn the major feed given to food animals, but a surprising amount of the tens of thousands of products sold at today's supermarket -- that packaged junk racked in the center of the store that Atkins and now Pollen have told us to avoid, are also derived from corn. Because of the way certain food products have government support, hamburgers are cheaper than fresh vegetables. Kenner focuses on a low-income Orozcos who both work and feel forced to rely on fast food meals because they fill them and their kids more economically than fresh produce bought at the market.<br><br>The new industry has developed chickens that grow bigger faster with more breast meat. They're kept in closed dark pens. The story is the same for all these poor mass produced critters, crammed together in great numbers, filled with antibiotics, deformed, suffering, ankle deep in their own excrement, brutally killed. The film has good footage of the big southern meat producer, Smithfield, showing how the new mega-food industry feeds off of exploited low-wage illegal immigrants who it treats as expendable, just like the animals.<br><br>An important spokesman in 'Food, Inc.' is an organic farmer (you could just say a stubbornly old-fashioned one) called Joel Salatin of Polyface Farm in Swoope, Virginia, who's also an author, though the movie doesn't mention his books. His cattle are grass-fed and watching them, we realize that's the way nature meant them to be. They roams free, living a healthy life, trimming back the grass while fertilizing it so it will grow back. Cattle weren't meant to live on corn, and doing so has led to infection. The industry solution to such problems is not to change back to earlier methods, but to add more chemicals. They're doing crazy things like adding bleach to hamburger filler to keep the burgers from being poison.<br><br>It's hard to keep a balance in such a documentary but Kenner tries. That Hispanic family is important. Slow food and organics have been a thing of the rich, as their dilemma illustrates. There could be more focus on everyday people and their difficult daily choices. The Walmart story is important too: Walmart customers are everyday people. It's easy enough for well heeled families to buy boutique produce at farmer's markets. Average Joes don't always have the time or the money for that. Also important is Barbara Kowalcyk, who works in Washington with her mother as an advocate for stricter laws. Her 2 1/2-year-old son Kevin died in 12 days from a virulent form of E. coli after eating a hamburger on vacation. She wants not sympathy but control of an indifferent industry. Carole Morison is another vivid voice: she is a southern chicken farmer who lost her contract with Perdue for refusing to switch to dark enclosed tunnel chicken coops, the latest in a series of enforced \"improvements\" that lead to more production at the cost of more cruelty. She also explains how the farmers in thrall to these big companies are kept in debt like indentured servants. <br><br>Armed with witty, clear graphics and ironically bright color, 'Food, Inc.' has a chance of gaining more converts to \"slow,\" organic, local food and opponents to crooked food regulation and monopolistic industry. This seems one of the most balanced and humane treatments of the subject yet.","user":"Chris Knipp","rank":[119,128]},{"title":"Must-see documentary for anyone who eats","rating":9,"date":"8 June 2009","review":"It is said that if you like eating sausage, you better not see how it is made. If you like eating meat, don't watch an animal being killed. If you have your fill of fruits and vegetables daily, don't think about the pesticides that coat them.<br><br>Our modern society has sanitized the presentation of food so that we can blissfully ignore what we should be concerned with: where food comes from, how it is raised, picked, handled, altered, transported and sold. Instead our attention is focused only on the awesome number of beautiful packages on market shelves, the unblemished fruits and vegetables available year round. In our increasingly artificial world appearance trumps taste, price trumps provenance, and industrialization gives us a false sense of safety.<br><br>It is therefore opportune to have the release of \"Food, Inc\". After you see it, you'll probably not shop for food in the same way. You may even change the kinds of food you eat. Not enough to convince me to become a vegetarian, but the ubiquitousness of corn and its derivatives, stated multiple times in the film, has made scouring of package labels a routine. The easy rule of not buying anything that contains more than five ingredients more frequently obeyed.<br><br>The film contains material that has already been brought out by others, for examples, (1) the problem of genetically modified seeds crossing into properties that do not want them and (2) the appalling conditions in which farm animals are kept. Some material is stressed too much, for example, the whole issue surrounding the tragic death of a kid from a very virulent form of E.coli and the attempts to establish regulations that might prevent such deaths. Individual cases are worth mentioning, but systemic and widespread issues are more compelling. The death of one is no doubt a tragedy but the impairment of thousands is of greater social consequence.<br><br>The issue of food regulation in general is a subject that I would have liked to see more of. The adverse effect of more regulation (as per the example above) can be too much regulation. The subject is briefly broached by the \"good farmer\" (Joel Salatin) who kills his chickens in the open. Ironically those chickens are likely to be more healthy and tasty. Regulation may eliminate this practice. Regulation can therefore have a negative impact on food culture. One of the best example of this is preventing the importation into the US of many delicious young unpasteurized cheese from Europe or even the marketing of such cheese by US producers. How many get sick from those cheese compared to the number of sick from peanut butter or spinach?<br><br>The film unwittingly projects a bit of naiveté in a couple of places. The segment about an individual being sued by a food conglomerate and essentially losing for lack of money is not news. This is a capitalist system: more money, better lawyers, almost certain victory. Yet the point is well taken that the food conglomerates are behaving in thuggish ways and acting with the protection of a complicit government (the best money can buy). But again, uncontrolled capitalism generates monopolies and they will fight tooth and nail to retain control and squash any semblance of competition. It's the logic of the beast. This not limited to food. Since voting habits have brought the US to this state of affairs, our only recourse as consumers is to eat bananas, and only bananas, for breakfast, lunch and dinner. It's called the Chiquita Diet.<br><br>In any case, this is a must-see documentary. The director is to be commended for having the courage of tackling this very important topic.<br><br>Don't forget to buy a five gallon basket of popcorn dripping with oleo and a big soda with plenty of high fructose corn syrup before going into the screening room. It may be the last time you do.","user":"rasecz","rank":[170,194]},{"title":"After the first death, there is no other","rating":9,"date":"12 July 2009","review":"The Center for Disease Control and Prevention has estimated that foodborne diseases cause approximately 76 million illnesses, 325,000 hospitalizations, and 5,000 deaths in the United States each year. If you are the mother of two-year-old Kevin Kowalcyk who died in 2001 after eating a hamburger contaminated with E. Coli, however, statistics do not tell the story of crushing personal loss. The tragedy of Kevin's premature death spurred legislation (known as Kevin's Law) introduced by Rep. Anna G. Eshoo, D-Palo Alto, that would give the U.S. Department of Agriculture the power to close down plants that produce contaminated meat but it has failed repeatedly to pass the U.S. Congress because of opposition from the meat industry. <br><br>E-Coli outbreaks and other food-safety related issues are discussed in the outstanding documentary Food, Inc., directed by Robert Kenner, a film, graphic in part, that may leave you with a severe case of indigestion. Kenner is an unabashed advocate for greater food safety and the film with commentary by Eric Schlosser (Fast Food Nation) and Michael Pollan (The Omnivore's Dilemma).attempts to convince the public of the shortsightedness of the mega-corporations that dominate the food industry and their \"faster, fatter, bigger, cheaper,\" method of increasing profits often at the expense of public safety. Representatives from food-producing giants such as Monsanto, Smithfield, Tyson and Perdue that control our food supply were invited to be interviewed for the film but declined or did not respond to Kenner's request. According to Schlosser, \"The industry doesn't want you to know the truth about what you're eating - because if you knew, you might not want to eat it.\" <br><br>Interviewing farmers and ranchers, Kenner learned that they are mostly at the mercy of mega-corporations like Monsanto which have increased their share of the soybean market from 2% to 90% in the last decade. Monsanto developed their own custom gene for soybeans and now threaten their customers with lawsuits for patent infringement if they save their own seeds to use the next year. The film observes that part of the reason why the food industry is so hard to regulate is that many of the government officials currently assigned to watchdog roles were once employed by the companies they now monitor and notes that FDA food inspections have plummeted from 50,000 in 1972 to 9,200 in 2006. <br><br>Other subjects covered are the treatment of cows that are forced to eat corn instead of grass (which then goes into Coke, high fructose corn syrup, diapers, decongestants, and batteries) and the dreadful conditions of chickens that are herded into darkened cages before they are slaughtered. On that subject, Kenner interviews Carole Morrison who was unwilling to jam her chickens into cages without sunlight and, as a result, had her contract canceled by a giant chicken conglomerate who refused to have any further business dealings with her. Also discussed are the growing rates of diabetes in young people, the soaring incidence of obesity, and the use of low paying illegal immigrants to work in the food processing industry.<br><br>In spite of the horror stories, however, Food, Inc. is not depressing and Kenner seems more interested in educating the public than frightening them. He shows that people can make a difference by citing the tobacco industry as well as the efforts of an entrepreneur from Stonyfield Farms who sold his line of organic products to Wal-Mart and a Virginia farmer who insists on raising animals with dignity and respect. To the strain of Bruce Springsteen singing Woody Guthrie's \"This Land is Your Land\", advice on how individuals can make a difference include – buy locally, shop in farmer's markets where possible, seek out quality and organic products even if they cost a bit more, and be sure to read the labeling to learn where a product comes from and the ingredients it contains. <br><br>Food, Inc. by itself may not be the catalyst that will preserve our health and well being and make food taste the way it did fifty years ago, but it is an important start and should be seen by anyone who eats, that means all of us. As the director puts it, \"I think we're beginning to see the dangers of this inexpensive food that these big agribusinesses are producing. And the more we can see the cracks in this system, the faster it's going to fall apart. I'm hoping that this film can help people to start to think about itPeople are becoming much more conscious of their food, and the more we think about it, the more good food we're going to get.\" I'll vote for that.","user":"howard.schumann","rank":[81,96]}]