[{"title":"Finally, a children's film that is worth seeing.","rating":8,"date":"15 August 2010","review":"Out of the hundreds of films and shows my four year old daughter has seen there are very few that I would confidently recommend as perfect for a little girl. \"Tinker Bell and the Great Fairy Rescue\" is one of these. Totally inoffensive and absolutely stunning production qualities make this one of the most pleasant films I have seen for children for many, many years. I am totally lost why this little visual masterpiece has had such little promotion. I recently saw a mother take a group of little girls to see Tim Burton's Alice in Wonder land and it was disturbing to see so many of them upset by the film. How was the mother to know that this PG rated version of a traditional children's story was going to be that far off the mark for the girls to enjoy. <br><br>Maybe the title \"Tinker Bell and the Great Fairy Rescue\" makes it sound a little trite and lame but the actual film is totally beguiling and charming.","user":"Hereafter","rank":[22,24]},{"title":"Head and shoulders above other animated children's films","rating":10,"date":"18 November 2012","review":"A superbly made film in every way! I was stunned by the utter beauty and charm of this and the previous animated 'Tinkerbell' films a few years ago, with their introduction to the world of fairies.<br><br>Colours are dazzling and sumptuous, imagery is almost 3D in appearance (yet sharper), the stories are well thought out, and in this third instalment - 'Tinkerbell and the Great Fairy Rescue', Disney does not disappoint!<br><br>I can't enthuse enough about the 'Tinkerbell' films, as they do not have the frenetic, brash, sometimes over-the-top action sequences that many other animated films such as 'Tangled', and even the later 'Ice Age' films have. There are very exciting sequences however, but they are well balanced with other aspects of the film.<br><br>They also don't have any smart-mouthed characters that are to be found in some animated films these days, and whom in my opinion are not good role-models for young children.<br><br>I see a great many films of all genres, and I do not even have any children, but after I saw the first Tinkerbell film, I had found it so sweet and entertaining - and such a breath of fresh air in our often ugly world - that I bought the following films, and waited with anticipation to see them. Tinkerbell is so cute, (yet feisty) with a perfectly suited voice - that it makes you wish that fairies were real.<br><br>Indeed, one becomes utterly submersed in Tinkerbell's fairyland adventures for the entire duration of the film - so well executed is it. I would go as far as to say that 'Tinkerbell and the Great Fairy Rescue' is the best animated film I have ever seen. Shrek, Finding Nemo, Madagascar,(to name but a few) pale by comparison. It is THAT good! <br><br>If you have young children, and would like them to see completely innocent, thoroughly entertaining films with good values, you cannot do better than let them view the recent 'Tinkerbell' films. I'm very sure that you will enjoy them immensely too!","user":"edwardwb","rank":[9,9]},{"title":"enchanting, gorgeous","rating":8,"date":"11 August 2010","review":"This British Disney Toon studios production is true pixie-dust for the hopeful family viewer. Astonishing 3D-like 2D imagery (why can't all films look this amazing?) is completely captivating and as an adult I felt myself being whisked into the genuine Disney magic of 60s films like MARY POPPINS and POLLYANNA......<br><br>TINKERBELL FAIRY RESCUE has the absolutely most breathtaking visuals, computer driven but timeless and earthy in beauty and fantasy. This is a simple but clever and funny animated feature. And for little girls and their 56 year old daddies, there is a few tears and a lot of excitement to be shared. I really applaud the tone story and sheer gorgeousness of this utterly enchanting family film. TINKERBELL herself reminded me of 50s MGM Musical star and singing sensation Jane Powell at her most beautiful. What a success TINKERBELL FAIRY RESCUE is. If you were also gob-smacked at ARTHUR AND THE INVISIBLES' imagery that looked 3D but was actually 2D, then this too is for you and your family.","user":"ptb-8","rank":[14,16]}]