[{"title":"Classic case of style over substance.","rating":6,"date":"7 March 2016","review":"Gangster Squad is entertaining as hell. It's also a total mess. Seriously, it's like watching a live-action cartoon with an A-list cast trying so hard to make this dialogue credible, but there's nothing they can do. It's a cartoon. Over the top, hammy dialogue, crazy shootouts with no consequence. If you don't shut your brain off within the first 20 minutes of this movie then you're doing something wrong. It's a shame because the plot is based off of the real life gangster Mickey Cohen who was the ruler of LA for a time, and the source material has endless potential. But the faster you can accept that that's not the kind of movie this is, the quicker you can appreciate it for its camp value. <br><br>Some things that stand out are Sean Penn's ridiculously over the top performance. Not that you can fault him for it. The part is written as a stereotypical gangster with temper issues and the script throws him these cheesy one-liners that wouldn't sound authentic coming from anyone's mouth. But to his credit, he's fun to watch. As is Brolin who plays the leader of the squad, and probably the most \"human\" character of them all. And there's Ryan Gosling is doing a really weird but oddly fitting voice for this time period with his natural charismatic charm. The supporting cast is good as well but they practically nothing to do. There's no pathos anywhere - it's all overblown bombast, and if you're okay with that, then I think you'll get a kick out of Gangster Squad.<br><br>If you're expecting LA Confidential 2, stay the hell away.","user":"lnvicta","rank":[59,63]},{"title":"You've already seen this movie, but better.","rating":12,"date":"12 January 2013","review":"Originally intended for release in September of 2012, Gangster Squad has belatedly hit theatres this week. The film follows the story of LA crime boss Mickey Cohen and a group of off-the-book beat cops to bring him down. \"Based\" on a true story (What movie isn't these days?) the film and its fantastic cast promise much but come across as bland and boring.<br><br>Set in Los Angeles in the 50's, Mickey Cohen (Sean Penn) is a crime lord who has taken over and there seems to be nobody who can stop him. The few good cops are outnumbered by the cops Cohen has bought and it seems all hope is lost. But Police Chief Nick Nolte decides something needs to be done and assigns good, hard cop Josh Brolin to put together a team to go after Cohen. What follows is the assembling of a team of not-so- perfect cops and the war they wage on Cohen's empire.<br><br>Sound familiar? That's because we've all already seen this movie, only done much better. You can tick the cliché's off as you watch. Good cop being grilled by his dirty cop superior? Check. Older tougher cop and his young protégé? Check. Evil henchman of the chief bad guy? Check. The list could go on but would approach spoiler territory. The climax of the film is somewhat predictable about half way through. You can foresee almost all of the events that will play out in the last 20 minutes and while it's enjoyable enough, it's nothing you haven't seen before.<br><br>The cast is a who's who list of names. Which makes the film all the more disappointing. With names like Brolin, Gosling, Penn and Stone they should blow you away. But the characters are nothing more than caricatures and nobody gets the chance to portray any real depth, with the possible exception of Giovanni Ribsi. Sean Penn looks bizarre in a mountain of makeup, although it matches his completely over the top performance. Ryan Gosling turns in a nicely subtle performance, but most of the rest of the cast are stuck in cardboard cut out roles with individual stories set on railway tracks. We all know where they're going to go, we just have to wait for them to get there.<br><br>Also worth mentioning in the reason for the delay in the film's release. Originally the film was to be released in September 2012, but then the Aurora shooting took place. At that time one of the key set pieces of the film was a scene in which the characters shoot at people from behind a movie screen in a theatre. Realising how disastrously that would be received in the wake of Aurora, the studio immediately suspended promotion for the film and set about reworking that scene. The cast re- assembled in August to reshoot the sequence, now taking place in Chinatown. <br><br>Something I liked: Robert Patrick's performance as the grizzled older gunslinger. As a Terminator 2 fan it was great to see him still taking out people almost at will.<br><br>Something I didn't like: The predictable climax. At the 60 minute mark I mentally made a list of things I thought would happen in the last 20 or so minutes of the film. Of my list of about 6 things, 5 of them happened exactly as I predicted.<br><br>Something that bugged me: The scenes with Josh Brolin and Nick Nolte seemed to be shot out of focus. It was particularly noticeable in the shots of Nolte. For a film with a budget of $75M, this just shouldn't happen.<br><br>Summary: Ultimately Gangster Squad is an enjoyable enough 100 minutes but isn't anything significant. There's no great performances, no spectacular set pieces nor any big moments that you'll go home talking about. For the ladies there's an ample amount of eye candy in the form of a suited and fedora-d Ryan Gosling, and for the gentlemen there's Emma Stone and a no-nonsense Robert Patrick. But the story fails to ever really leap off the page and become something. We're told Mickey Cohen is bad, but he's never anything more than \"that bad guy\". We don't hate him, we don't sympathise with him or desperately want him to be taken down. He's just \"the bad guy\". The same can be said for all of the characters, and the story as a whole. Which makes it on the whole, ultimately forgettable.","user":"jarryds","rank":[182,235]},{"title":"Guilty Pleasure","rating":5,"date":"9 January 2013","review":"Greetings again from the darkness. Admittedly, I am one of those who take movies very seriously. Good movies make me happy (even the sad ones), and bad movies make me sulk. Every now and then, one comes along that I find myself enjoying despite the warning buzzers blasting in my film snob brain. Such is the latest from director Ruben Fleisher (who also directed the entertaining Zombieland).<br><br>\"Inspired by true events\" should always be interpreted as a disclaimer that the movie will play fast and loose with history and the details of the story. Sean Penn plays Mickey Cohen, a renowned Los Angeles gangster from the late 40's. Due to widespread police corruption, Police Chief Parker (Nick Nolte) authorized an \"off the books\" team to take down mob operations (gambling, prostitution, etc). This much was documented in Paul Lieberman's book. How this story is presented by Fleisher and screenwriter Will Beall (signed on for the Justice League movie) has more in common with a comic book than actual history.<br><br>The movie is extremely beautiful to look at. It's slick and stylish with a glamorous color palette, and the production design is top notch - capturing the look and feel of a booming Los Angeles. If you are expecting the next \"L.A. Confidential\" or even \"The Untouchables\", you will be disappointed. It's more in line with \"Dick Tracy\", \"Scarface\", and \"Hoffa\". In other words ... it looks great and the action, characters and dialogue are all way over the top.<br><br>The cast is superb, but most are underutilized. Josh Brolin is the tough leader of the squad that features Ryan Gosling (the token cool womanizer), Robert Patrick (the token dead-eye gunslinger), Anthony Mackie (the innercity, knife-wielding token black cop), Giovanni Ribisi (the token geeky electronics expert), and Michael Pena (the rookie and token Hispanic cop). Unfortunately, my crude descriptions are just about as in-depth as the movie goes with any of them. In fact, Yvette Tucker playing Carmen Miranda, gets almost as much screen time as any of these cops as she sings \"Chica Chica Boom Chic\".<br><br>The violence is cartoonish in its fervor. The aim of these gangsters is among the worst in movie history, and that's quite an accomplishment. Using Tommy Guns and pistols, my estimate is that one in every 167 shots actually hits an intended target. Many elaborate set pieces are destroyed in the process. The exception is Robert Patrick's character, who is actually featured in a detective serial. He never misses ... even after being wounded. Penn plays Cohen as a ruthless mob boss, unwilling to accept any failure from his crew. And you know what that means. No pink slips here ... just ugly death via power drill, burning elevator or classic car tug-of-war.<br><br>An interesting note is the presence of three actors from recent cult TV shows. Holt McCallany (Lights Out), Mireille Enos (The Killing) and Troy Garity (Boss) all have key roles in the film, as does Jon Polito, whose face and voice make him a must-cast in any gangster film.<br><br>If you are able to turn off the logical and reasoning part of your brain ... just sit back and enjoy Emma Stone smoking a cig while wearing a red evening gown, an understated Ryan Gosling with an odd speech pattern, Sean Penn wearing a prosthetic nose and spewing hilarious bad guy lines, and the creepy feeling that Josh Brolin is just 25 years away from looking and sounding exactly like Nick Nolte ... then hopefully you can take this one for what it is - a guilty pleasure. www.MovieReviewsFromTheDark.wordpress.com","user":"ferguson-6","rank":[97,126]}]