[{"title":"Almost Great","rating":5,"date":"3 May 2011","review":"This movie could have been excellent (or at least rated above 5 / 10 stars) with one or two less loooong drawn out scenes of the main character crawling up (or down or over or through) the woods, stopping and looking out into the wild. Seriously, I wanted to shoot myself from about minutes 45 to 75. I suppose the screenwriter had no choice but to pad the movie since it was already going to be relatively short (hmmm, maybe it could be a Short instead?).<br><br>You would think that after 5 years of writing there would be much more than crawling and panning forest shots. Oh well.<br><br>Give me the first and last 30 minutes of the movie and I would be very happy with the outcome.","user":"nytexas","rank":[37,47]},{"title":"Lost","rating":7,"date":"29 September 2011","review":"This is a very uncomfortable film. Now I don't mean it is bad. I mean this is the type of film you can feel and you start to feel what the main character is going through. The whole movie is based around one main character played by Adrien Brody. He did an excellent job. The movie starts with him waking up in a car that had fallen off a small cliff. He is alive, but the people around him are dead. Through the whole film you are trying to piece together what happened. By the end you figure it out, but there are some things they leave untouched on purpose. Let the viewers mind come up with its own conclusions. This movie takes on a different type of scary. Like a real life scary. I remember a few scenes that when they happened, I couldn't help but shake my head and think much that would really suck in real life. The writers of the film made a good story and the director did a good job with little budget they probably had. This was a very nice suspenseful film.","user":"chelano","rank":[22,27]},{"title":"Small film, simple story, but entertaining.","rating":4,"date":"7 May 2011","review":"Wrecked is an interesting little low budget film that has a fairly promising premise that should attract the viewers (because the poster certainly won't).<br><br>A man wakes up in a car wreck in the woods with no idea of who he is or why he got there, with his only company being that of the dead body in the seat next to him. It soon becomes apparent that help is not coming and he has to get out of the car. But once he's free, his troubles have only just begun, as he finds out that he is not alone in the woods.<br><br>There is a lot to like about this little film. Adrien Brody does a great job of displaying how painful and lonely it would be if one was trapped in this particular situation, and of course the film rests on his acting and the great imagery and camera work. The film never becomes too slow, and there is always a new little plot point or clue that leads the viewer on. <br><br>Of course one should not go into this film expecting a sordid tale of survival and battles with mountain lions. Instead, what we have is a psychological exploration, where the woods serve as the back drop for all of the character's guilts and desires, and soon we are doubting what is real and what isn't. Think of J.G. Ballard's \"Concrete Island\" or Stephen King's \"Gerald's Game\". <br><br>While it is ultimately weak with a so-so story, \"Wrecked\" is worth watching at least once just to enjoy the work of Brody and the fluid flow of the film.","user":"Degree7","rank":[64,91]}]