[{"title":"Very enjoyable (forget werewolf)","rating":18,"date":"18 February 2011","review":"Expectations from other reviewers must have been too high. This movie is thoroughly enjoyable, despite the subject matter, which I suppose is the whole point. I found it to be comically dark as expected. Although in a lighter tone than \"I sell the dead\" which is another good film in the same vein. The casting was well composed and at times gave me the feel of a Terry Pratchett production. The sets and cinematography were spot on and very believable. I simply wouldn't try to compare this film to any of John Landis' previous works ,it stand on its own and demonstrates the dynamic abilities of both cast and crew. All in all worth a go if you are in the mood for a few good laughs.","user":"BurntEloi","rank":[38,44]},{"title":"Has its hit and miss moments, but mostly entertaining","rating":7,"date":"1 March 2011","review":"Burke and Hare is not a masterpiece by any stretch of the imagination, but it is not a bad film either or completely deserving of all the panning it got. It is far from talented director John Landis's best film not like Blues Brothers or An American Werewolf in London, but it is not his worst either as is the case with Blues Brothers 2000 and Beverly Hills Cop III.<br><br>Does Burke and Hare completely work? No it doesn't. Is it entertaining? On the most part yes, even with the hits and misses. The film to me was never laugh-out-loud hilarious excepting two or three scenes(Jessica Hynes's eureka moment inventing funeral parlours being one), most of the time it was still amusing. In my view, the sight gags were better than the script. The sight gags range from nicely understated such as the pot shots at Wordsworth, Lister and Greyfriars Bobby to crass slapstick such as chamber pot contents being dropped on heads. There is even a sex scene that raised a laugh, decide for yourself whether it is intentional or not, whether it was or not I personally did find it amusing. The script(the smart black humour kind) varies as well from having a good chuckle, raising a smile to where I found myself rather blank faced.<br><br>John Landis does do a credible job directing. He mixes contemporary innovation and social issue with ease, and although he doesn't quite make Burke and Hare the dark, smart, hilarious homage to Ealing comedy it strived to be or the throwback to American Werewolf(the comedy and horror elements are decent on their own but have mixed results together), there is evidence of the effort which is what mattered. The character development is very straight forward, that I do agree with, but the cast do make an effort to make us empathise with them, and I think they succeeded there. The Georgian setting is also convincing, the sets are beautifully evoked and I quite liked the costumes and cinematography too.<br><br>I do think all the cast have done better before, but I cannot deny this is a great cast. Simon Pegg and Andy Serkis are a well-matched double act. They work very well together, and both give entertaining performances in the process. I also liked seeing Christopher Lee, Ronnie Corbett, Paul Whitehouse(the scene where he is pushed down the stairs is hilarious) and Bill Bailey even if their appearances are rather brief. Isla Fisher(the love story between her and Pegg though is pretty weak and underdeveloped) and Jessica Hynes are alluring and do show at least some flair for comedy, Hynes actually is very funny, and while they should have had more screen time Tom Wilkinson and Tim Curry are suitably antagonistic and compelling. I do agree about the accents being variable, I had little problem with Pegg and Serkis and Wilkinson's was convincing, Curry just about passes, while Fisher's comes and goes and some of the cameos don't quite make it.<br><br>In conclusion, entertaining enough if somewhat hit-and-miss. With a longer length, perhaps more tighter pacing and some more care on the accents it could have been more. But the direction, setting and cast convinced me, so I enjoyed it. 7/10 Bethany Cox","user":"TheLittleSongbird","rank":[28,33]},{"title":"The biggest challenge the story faced was turning two mass murderers into characters you can follow, laugh with and have empathy for and I think this film does it really well.","rating":8,"date":"29 October 2010","review":"Released just in time for Halloween is the macabre tale of Burke and Hare! Set in 1820's Edinburgh, two Irish immigrants, William Burke (Simon Pegg) and William Hare (Andy Serkis), try one business venture after the next, and one after the next they fail. Just at the point where they're about to face financial ruin, the duo come up with an ingenious idea when they spot a in the niche in the market for the supply and demand of fresh dead bodies which manages to turn their fortunes around.<br><br>The story is inspired by true events which took place in Edinburgh between November 1827 and 31 October 1828 when the real life Bukre and Hare murdered 16 people and sold their bodies to a private anatomy lecturer, Doctor Robert Knox (played by Tom Wilkinson in the film), for dissection at Edinburgh Medical College. Although this is the 8th time their story has been brought to the big screen, this marks the first time that we see them as two likable lead characters.<br><br>From a screenplay penned by Nick Moorcroft and Piers Ashworth and directed by the legendary John Landis, Burke And Hare harks back to the days of the old Ealing Studios dark comedies like Kind Hearts and Coronets (1949) and The Ladykillers (1955) which director John Landis is very fond of. It looks at the friendship between these two guys and focuses on the idea of who the bad guys really are. The doctors or the killers themselves? Mixing in a little Shakespeare with an all female production of Macbeth by Isla Fisher's character, Ginny, an aspiring young actress whom Burke falls madly in love with, another layer is added to the story. While Ginny ponders what would drive a man like Macbeth to murder, Burke looks at her and explains the character's motivation; \"He did it for love\".<br><br>By and large, I really enjoyed Bukre and Hare. The biggest challenge the story faced was turning two mass murderers into characters you can follow, laugh with and have empathy for and I think this film does it really well. As Burke is talked into the business with Hare, there's never the slightest feeling that his friend is purposefully leading him down a path to his own downfall, unlike the real Hare who gave Burke up in the end to escape a public hanging. Another element of the movie which was enjoyable was seeing so many familiar faces turning up in smaller roles; Ronnie Corbett decked out in his red and blue uniform as Captain McLintock, Christopher Lee as Old Joseph, one of Buke and Hare's early unfortunates and perhaps the most hilarious scene of all is when they push Paul Whitehouse down a flight of stairs! It's a good one to see if you're after something dark and funny this Halloween.","user":"PatrickSamuel","rank":[54,72]}]