[{"title":"Don't allow the ratings fool You. It's a Good Vibe Movie.","rating":7,"date":"3 January 2019","review":"It was winter and i was alone home. I was anticipating there will be no wifi for a couple of days so i had some movies downloaded on my Netflix. Seeing Owen wilson and Paul Rudd on the cast, i thought this movie would be Rom Com. But as i start watching, i found out it's a Romantic Drama with lots of life lessons. I am lucky there was no Internet connection on that afternoon. It's a movie i am gonna suggest to everyone who is having a bad day. I am gonna watch it again.","user":"sunam007","rank":[23,23]},{"title":"How Do You Know Isn't Romantic Nor Comic","rating":7,"date":"14 September 2012","review":"How Do You Know is a romantic comedy that stars Reese Witherspoon, Paul Rudd, Owen Wilson and Jack Nicholson.The movie centers on the story of a passionate athlete who finds herself romantically torn between a narcissistic baseball star and a straight-laced businessman.It was directed, written and produced by James L. Brooks. <br><br>Lisa (Witherspoon) has sports been the definition of her life. Then, in the blink of an eye, she's cut from the team due to age and decline of skills. With her identity in crisis as she attempts to regain her footing in life,she begins dating Matty (Wilson),a Major League Baseball pitcher and notorious womanizer. Meanwhile, terminally honest businessman George (Rudd) finds himself on the road to financial ruin or worse after being wrongly implicated in a financial crime. As he struggles to clear his name and reconcile his turbulent relationship with his father, Charles (Nicholson);a chance meeting with Lisa at the lowest point in both of their lives leaves him optimistic that things may work out after all. Meanwhile, Lisa and George both realize that the only thing that's certain about the future is that we never know what fate has in store for us.<br><br>The film fails due to the fact that it is in the romantic comedy genre and it is neither romantic nor comic.It hardly generates any laughs despite the talent involved like Witherspoon and Nicholson.What's worse,there is no resolution involved in the relationship between George and Lisa except the fact that only the future knows what's in store for them.Everything was just left hanging in the air just like how they got attracted to each other except for experiencing bad things in life.It could have worked better if the screenplay addressed the connection between them instead of simply putting it as a plot requirement and nothing more.","user":"Desertman84","rank":[9,9]},{"title":"Underrated","rating":7,"date":"26 March 2011","review":"From looking at the casting, you would immediately think this to be a romantic comedy, and I guess that's where it starts going wrong.. from people going in to see this movie, expecting a chick flick and being disappointed.<br><br>I believe the reason for the poor reviews of this movie are due to the fact that is has been advertised and delivered as a romantic comedy.<br><br>True, it is fit for the romance genre, comedy.. not so much. But as far as romantic drama's go, this is an excellent picture for the modernized crowd.<br><br>That's because it is so much more. It is ideal for viewing of a well- intended inspiring somewhat-romantic movie. Humour is few and far between for a comedy-seeking crowd, however for those who connect to the characters, the humour is purely intended for those devised from caring for the characters.<br><br>Reese Witherspoon has perfected the role of Lisa, this is the movie that I would beg girlfriends to watch, due to her total delivery of the character throughout the entire picture, which is something most girls and women can relate to (whether they've reached that hurdle yet or not). <br><br>Which is where I feel the script originated from, life lessons. The script of the movie is all relatable in one aspect or other. It's moving to view a capture of these 'life lessons' within a movie, and I think if a movie can deliver that, then they have succeeded in making a good movie. Although the writing could have been sharper, better presented and wittier, it was decent enough for one to be indulged in the plot.<br><br>Paul Rudd, I thought, was a fantastic casting. Again, writing could of been better for a few of his lines where comedy was intended and some of his reactions.. but still I found him to be excellent and I enjoyed watching him.<br><br>Nice to see Jack Nicholson again, (huge fan of One flew over the cuckoo's nest!), his part was suitable if not a little long winded. I felt (again) wittier writing would have improved his character and performance hugely, however he delivered his part.<br><br>And Luke Wilson.. okay so we all know what kind of movie's he's known for now, and fair enough, he was a good casting for the part. My only itch is I'd like to see him doing more roles similar to Hutch, ala Starsky&amp;, dry detective types. <br><br>Moving on, as said above, this is not a movie to make you lol or rofl, merely a movie to be enjoyed from watching these character's journey of self-revelation's throughout.","user":"xcharxcharx","rank":[83,111]}]