[{"title":"Words cannot describe this awe-inspiring production","rating":4,"date":"30 August 2009","review":"And you thought Godzilla vs. the Smog Monster was the greatest monster battle ever recorded on film. <br><br>This is ineptitude at its comedic utmost, with a Plan 9 from Outer Space result: you either laugh at its level of inane silliness, hate it for the same reason, or just fall asleep while watching.<br><br>The plot: what plot? This script is pretty much a stew of ideas from other goofy monster monstrosities with pre-historic creatures occasionally showing up, brain-dead military that ineffectively shoot everything they have, useless scientists who apparently got their degrees from an on-line certification service, panicky mobs with screaming extras, hokey effects, intentionally moronic dialog, and pathetically atrocious acting. The cast knows it's campy to the extreme, and play along.<br><br>60 million years from now, when another species does archaeological digging, they may find a DVD of this. What will move them emotionally the greatest? The sensitive portrayal of \"scientist\" Debbie Gibson and the Japanese scientist guy making out in a broom closet? The said same scientists experimenting with different flavors of Gatorade (what were they trying to accomplish in that scene, anyway)? Perhaps the five minute struggle between the enormous sea creatures (only seen in periodic choppy three-second out-takes), or that dumb ponytail that Lorenzo Lamas still has? <br><br>Also, which of these inspired performances will be awarded the Oscar? The high-flying mega-shark that can swim at 500 knots, or leap 5 miles into the air and snag a plane moving at about 600 miles an hour? Or the big octopus, that swims around aimlessly with such precision? Debbie Gibson's line chewing while constantly pointing her nose directly into the camera? The mono-tonal Japanese scientist guy? Or Lamas, who utters delightfully uproarious quips in your ears every 15 seconds? Words in the English dictionary simply cannot adequately describe the sensitive portrayals in this film.<br><br>I hope future generations will experience this landmark cinema and utilize it as an insight of the sophistication of our present-day culture. I'd also like to see the looks on their faces.","user":"MartianOctocretr5","rank":[59,64]},{"title":"A Scintillating Cinematic Masterpiece","rating":10,"date":"21 August 2009","review":"Debbie Gibsons finest hour comes with a gritty, mesmerising performance in what has to be described as the film of the decade.<br><br>The plot, written by premier director Jack Perez, focuses on the age old undersea battle between the two aquatic giants of the sea, which, as we all know, is that of the Shark and the Octopus.<br><br>It was only after watching the film 8 times I was informed that the crisp special effects had been done using CGI......incredible! The shark is so lifelike i literally voided my bowels every time this nauseating monster came into shot Perhaps the biggest highlight, of this orgasmic blockbuster, is the romantic sub plot involving Gibson and Vic Chao. Thrown together in a time of world catastrophe the two scientists battle masterfully subtle feelings of sexual tension........now I don't want to spoil it for anyone, but lets just say there is a groundbreaking, red hot conclusion that will leave you shocked and stunned ;) The sequel, Massive Panda vs Quite Tall Aardvark, is due to hit our screens early in 2010, and, if this film is anything to go by, you will need to make advanced bookings at your local cinemas. During a private screening of the first rough cut, 31 people suffered crush injuries while fleeing in terror.","user":"coburn-mark","rank":[332,408]},{"title":"I had forgotten movies could be this bad","rating":2,"date":"30 May 2009","review":"I normally only watch the bigger budget movies with a few art house type sprinkled in, but I had heard about this title somewhere, so when I saw it at the video store I thought, what the heck? how bad could it be? The answer: Amazingly bad. Phenomenally bad. Utterly horrific. Not the worst movie ever, but close. When your movie wishes it was as good as Battlefield Earth, you know you have a problem. It wasn't even the good kind of bad, where you can laugh at the unintentional humor.<br><br>The good: Still trying to come up with something The bad: I know this is a low budget D-list movie, but come on - the effects and CGI were stunningly bad. They looked like they were done on my laptop over a weekend. They might have been acceptable in the early 90s.<br><br>To make it even worse, many of the CGI scenes were constantly repeated. Whenever the shark or octopus attacked, you usually saw it preparing or approaching for the attack several times using the exact same footage. Sometimes they even bothered to mirror image the scene to make it look different.<br><br>So many of the details were amazingly unrealistic. The dialogue was bad, the way people behaved and delivered lines, physics (as in what animals of that size could actually do), torpedoes were like firecrackers, etc.<br><br>Quality control was obviously lacking. When the shark approaches a battleship from the side, the ship is shown firing forward. Once, during a video call, for about a second a film crew member wearing a headset pops into existence beside the person on the call, and then disappears. The caller and those working in the background are obviously oblivious to this phantom man.<br><br>There was this laughably bad science scene where the main characters keep dumping vials of various colored liquids into test tubes of other colored stuff and then they all looked disappointed. This happened over and over for like 5 minutes. All without any dialogue or any clue as to what they were actually doing. We only knew they were looking for a \"solution\" to the problem of giant sea monsters. I guess dumping red goo into a vat of blue gunk and having it not turn a different color is not a solution to giant sea monsters. Gosh, I am glad they tried that, it might have worked! There was an embarrassingly bad romance side plot thrown in, and the build up to the final showdown was dull, and then that showdown was short and filled with repeats of the same footage over and over.<br><br>I almost never feel strongly enough about a movie to write a review, but for this one I had to. If I prevent even one person from seeing this movie, then I have done my job.","user":"buckramega","rank":[106,127]}]