[{"title":"Nice score.","rating":4,"date":"3 March 2015","review":"The score is terrific, the scenery is gorgeous, the acting is mostly pretty good, and the story is... nonsensical.<br><br>There are two story timelines. The opening story timeline is set in the fairly near future, sometime later in the 21st century, with what appear to be Americans. But we spend very little time there. The main story timeline is 18th century India.<br><br>The backdrop of the main storyline, in India in 1778, was interesting and realistic, except that the British East India Company leaders were all hopelessly one-dimensional villains. The lead roles were well-played, the lead characters were sympathetic, and the story was drew me in.<br><br>But when you tell a great, big, long story, it ought to have a point. It ought to have something to do with the climax. This one left me wondering, \"what was the point of all that?\"<br><br>Plus, there was almost no meaningful connection between the two timelines. It just didn't make sense.<br><br>And the story made a promise that it didn't keep. At the beginning, we see an interesting artifact -- a ring -- in the wreck of a long- sunken ship. Someone with the initials \"D.E.\" must have greatly valued it, we're told, because he or she drowned while clinging to the purse which contained that ring.<br><br>So, who was D.E., we wonder, and what was his story? The next scene takes us back in time, to 18th century India, and we settle back expecting to learn the story of D.E. and the ring. But we never do.<br><br>We do, indeed, hear a great long story -- but we never find out about D.E. and the ring, or how it got onto that shipwreck. That was very annoying.<br><br>And what's with the two names for this movie, anyhow? Is it called \"The Lovers\" or \"Singularity?\"<br><br>As Maxwell Smart would say, \"missed it by THAT much.\" I'll be generous and give it a 4, mainly just because I liked the music.","user":"dave355","rank":[34,36]},{"title":"The movie sank not the ship","rating":23,"date":"23 March 2015","review":"I was surprised at the bad review when I started watching the film. A lot of effort went into this production, with good acting, an interesting storyline, time travel, adventure and history. The chase to ave or kidnap the queen kept me glued to the screen. It was a thrilling roller coaster for about three-quarters of the film. The last quarter gave mixed messages, jumbled conclusions and added loose ends. Where was the director, did he fall asleep? the whole story hinges on an underwater discovery of a sunken British ship. What ship? Who was on it? Who drowned? The last time we saw the rings they were in the hands of the two characters in 1778 in a forest in India. How did the rings get on a ship? Not by the dead character in the forest! The last quarter of the film simply sinks the movie.","user":"formatt2007","rank":[25,31]},{"title":"Wonderful story gone bad","rating":3,"date":"15 February 2015","review":"I don't know how to describe it, how to put my finger on it, but it's pure and simply boring and it does not sink me into the story, it makes me want to fall asleep.<br><br>The story could have been good, but it was poorly execute. It feels broken, tangled in a silly way and the actors play is anything but credible. I started watching it 3 times and only got to the middle of it as I find it has no substance and nothing interesting.<br><br>Simply it is no \"The mission\" no \"The fountain\" no nothing I would want to watch to the end.<br><br>I give it 3 stars for the settings, landscapes and for the idea, nothing else.","user":"pisica00","rank":[44,60]}]