[{"title":"Speaking Eyes","rating":8,"date":"19 August 2009","review":"\"El Secreto de sus Ojos\" hit me with unspeakable strength. I didn't expect to like it so much, so I owe a review to those in analysis measures before seeing it or those interested in some opinion.<br><br>First off, Campanella works with flawless effort all of the technical aspects of the film. It even starts with a double exposure effect, mixed with some sad shots of a beautiful Buenos Aires that hints the spectacle ahead of us. One shot especially, from a chopper in a soccer field edited with a crane shot is breathtaking. Nothing to envy from Hollywood upper class.<br><br>But the main strength of the movie comes from the powerful narrative dominion Director Campanella has over characters, spaces and silences. Many moments are coldly tense, scary and very, very intense. This crossover from genres by Campanella couldn't have been better. Crime stories often fall in common places, this one relies on the fragile psychological state of the audience to draw all of it's intense dialog, acting and scenes.<br><br>I cannot stop recommending it, Argentina can open it's market with movies such as this. It has many, many memorable moments, it interwines comedy perfectly and it is doubtful you will instantly forget it, as it is so well constructed. See it if you can!","user":"billion_mucks","rank":[472,514]},{"title":"A masterpiece","rating":10,"date":"26 September 2009","review":"This is quite frankly an astonishing film. One that fills your entire array of senses and sensitivities, and the praise from Argentine reviewers here is 100 percent justified. Ricardo Darín turns in another majestic performance as a Buenos Aires court employee who is fiercely affected by the rape and murder of a young girl in 1974, a tragedy that dominates his life. Overlapping this theme is the powerfully sensual but never physical relationship between Darín and his superior, the investigating judge played by the superb Soledad Villamil. The connection between the two is electric. It's a pity this film cannot easily transcend the language barrier, if it was an English-language film of the same quality it would already be hailed as a masterpiece. The blending of tragedy, love, violence and humour is brilliant, and the comedy dialogue fantastic. One scene where Ricardo Darín is balled out for having searched an old lady's house is priceless in terms of comic timing and delivery. A wonderful performance also from Guillermo Francella as the court clerk with a drinking problem, in fact the secondary acting is all first-class. The camera-work is impressive, especially the swoop down into the football stadium and the closeups, and the script is also superb. Argentina has nominated the film as its candidate for best foreign film at the Oscar's, it deserves to walk it.","user":"torrelodones49","rank":[242,262]},{"title":"as good as anything out there","rating":10,"date":"4 December 2009","review":"Simply put, this is one of the finest films I've ever seen. I don't say that lightly, I don't exaggerate when it comes to talking about movies -- but everything about this one, from the acting to the writing, to the camera work, to the directorial decisions, is grade A. The story deals with deep matters, and it does so one step at a time, with a plot that moves steadily forward, gathering force, substance and intensity, not settling for easy answers or plot points, not cutting corners. The characters are complicated, interesting, believable, flawed, funny, tragic and deeply human.<br><br>I prefer not to get specific about what happens -- I mostly want to try to get across the quality of this bugger. So I'll say it again: it's one of the best films I've ever seen, as good as anything out there. If there's any justice, a lot of people will see it.","user":"tjdinvt","rank":[431,487]}]