[{"title":"Never never 4 out of 10","rating":7,"date":"31 July 2012","review":"Very strong thought provoking movie with a great subtle twist! Having seen this movies rating of 4 out of ten on IMDb, I had very low expectations for this movie. Having just watched the film I would rate it at least a 7!<br><br>Mickey Rourke produces his best performance since the wrestler and spun, to compare it it to his most recent work. Mickey is one of the best of all time when he is at this level, in a movie deserving of his skills.<br><br>Passion play also stars Bill Murray who displays a performance to equal his excellent display in mad dog and glory, playing a similarly dark character Bill shows that he is equal to the best in a serious role.<br><br>Having not been exposed to any of Megan Fox's past performances I can say she was excellent in her role and has great chemistry with Rourke. The score of the movie is perfect and added to the dream like atmosphere created by the movies director, in fact the whole production is top notch, professionally handled by a director who has created some really beautiful scenes. One you will watch more than once if you appreciate high quality acting and stylish direction.","user":"brianimdb-437-260206","rank":[22,28]},{"title":"there are 2 very different versions","rating":30,"date":"30 May 2011","review":"The original cut of this film was rushed out for the 2010 Toronto International Film Festival and got ROASTED by critics and Micky himself.... and its very easy to see how that could happen with such a delicate and light plot... it was completely re cut and then, due to the poor reviews, only shown on 2 screens grossing 2,000 (!) then to video.... ouch...<br><br>I just watched the directors / DVD cut and was impressed. It is delicate and nuanced. If you are a viewer who appreciates life meaning and subtlety in film as you might see in Terrence Malik, you can see how Passion Play is sort of an attempt at a life view. There is good cinematography and all the basic elements, and I'd describe it as strong but not excellent. <br><br>I'm not a Megan Fox fan, and while not top flight here, she is good. Who knows, if she can get a few more films to develop her career she may not regret the whole Michael Bay thing. Micky does a Wrestler echo with good effect. As usual, Bill Murray is by far the strongest talent, but in this case he doesn't have quite enough to work with and seems underused.<br><br>While not top flight, It's not a waste of your time. If you re one of these people who's got to have a completely traditional film structure, you will be disappointed... but for the philosophical among you... there is something worth watching here....","user":"smfilm","rank":[22,29]},{"title":"Good movie...surprised to see what critics said about it","rating":8,"date":"21 May 2011","review":"Don't know why most of the critics have lambasted the movie. It was a nice and entertaining movie, good story, all the actors have played their part beautifully. Megan Fox for once have shown some acting skills, Mr. Rourke is good and Bill Murray as always was excellent. The story was good, a bit predictable about the action Rourke will take. I was a bit surprised with the ending but that last smile on Mickey Rourke's face was enough to tell what was going through the entire movie. <br><br>I have read about what happened with the movie in TIFF and what Mr Rourke have said about the movie. But if anyone is thinking to watching this movie should first through these comments out of the mind. Watch this movie without any prejudice. All in all if someone will spend his one and half hour to watch this movie that will be spent good.","user":"raman-pthk","rank":[40,57]}]