[{"title":"A solid, tangled, British kidnapping flick.","rating":6,"date":"24 November 2010","review":"\"Tell him that he must pay the money, that he must do exactly as we ask or we will kill you. You tell him that you have no doubt that we will kill you.\"<br><br>The Disappearance of Alice Creed is a brutal little thriller about a woman who gets kidnapped by two men, who plan to use her to ransom £2 million from her wealthy father. The kidnapping itself goes flawlessly, and once she's securely locked up, there seems to be little that can go wrong to keep the men from getting the money. But, that wouldn't make for a very interesting movie, would it? Things go wrong, and the best-made plan can still end up being a disaster.&nbsp;<br><br>I was somewhat expecting The Disappearance of Alice Creed to be your standard kidnap and escape kind of movie, but I have to give it credit for throwing enough wrinkles in to make itself somewhat unique. The relationships between the two kidnappers and the title character end up being more complex than they initially seemed, and cracks of distrust turn the initially well-executed plan into a situation that perhaps no one will survive. &nbsp;<br><br>There's a strong current of tension that starts with the dialogue-free beginning and continues all the way to the very end. That's pretty impressive, in my opinion, and I hasn't seen many movies lately that keep things that taut for the entire time. In addition to the story, the acting was solid, as well. When a movie really only involves three actors (Gemma Arterton, Martin Compston, and Eddie Marsan), one weak link could ruin it. Thankfully, that's not the case, here.&nbsp;&nbsp;<br><br>Still, I'm not the greatest fan in the world of these kinds of movies, so even a good one like this (and it is good) has a hard time blowing me away. If you're a genre fan, though, I think you'll be pleased.","user":"lewiskendell","rank":[49,64]},{"title":"Very, VERY good. Looking forward to more J Blakeson works in future.","rating":10,"date":"4 May 2010","review":"A terrifically enjoyable film from debut writer-director J Blakeson. Apparently working to a tiny budget, he's proved that he has an incredible understanding of what makes a thriller film work.<br><br>There are three excellent performances (lucky, as with only three actors this needed to be the case), particularly Gemma Arterton as Alice Creed, who uses her wits and womanly wiles to make a stand against her tormentors, Vic and Danny.<br><br>Much has been made of the plot twists - but I still didn't see them coming at all! I thought they were ample to keep you guessing right to the last, and I kept changing my mind as to how I thought things would turn out. <br><br>I kept reading \"taut, claustrophobic and very well put together\" when I was researching this film, and I have to say it delivered on all counts. Excellent.","user":"ByeByeGordy","rank":[104,144]},{"title":"Passable thriller that rings a little hollow on occasion","rating":6,"date":"8 April 2013","review":"THE DISAPPEARANCE OF ALICE CREED is a three-hander that sees spoilt rich kid Gemma Arterton kidnapped by a couple of goons and tied to a bed while they demand a ransom from her father. That's the entirety of the plot; of course, it's little to sustain a ninety-minute running time with that alone, so the scriptwriter has to come up with twist upon twist to keep the viewer guessing as the running time progresses.<br><br>I was in two minds about this film. It's superficially entertaining to be sure, with lots of drama and attempts at tension, and the suspense bubbles along quite nicely as the tale progresses. But there are serious flaws along the way too, not least the entire lack of a sympathetic character.<br><br>Arterton is the obvious choice as somebody to root for, but her limited acting abilities combined with a rather obnoxious character mean that the viewer won't really care whether she escapes or even survives the ordeal. Note to scriptwriter: merely having somebody kidnapped isn't reason enough for a viewer to get behind them. As for the other two cast members, Eddie Marsan is a seasoned professional as ever, but Martin Compston is a little bland and whiny and gets way too much screen time.<br><br>THE DISAPPEARANCE OF ALICE CREED does well to avoid falling into clichéd territory - there's no torture, for instance, which would have been an obvious inclusion these days - but once you know the storyline it doesn't really have much in the way of rewatch value. I liked it well enough the first time around, though.","user":"Leofwine_draca","rank":[22,27]}]