[{"title":"When the Bough Breaks: Pretty paint by numbers stuff","rating":5,"date":"29 May 2018","review":"Morris Chestnut and Regina Hall star in this modern day Fatal Attraction-esque movie about a couple unable to have kids who welcome a surrogate into their home.<br><br>But of course this is Hollywood so nothing goes quite to plan and before you can say damn skippy, the soon to be mom becomes enamoured with the husband.<br><br>See that wouldn't be so bad if it weren't for the fact she's a complete psychotic, but how do you combat such a person when they're carrying your child?<br><br>We've seen this before, near enough this entire film to be honest but here it's done competently enough.<br><br>Morris Chestnut tends to always play the same brooding character (And does here) and Regina Hall is someone I cannot take seriously anymore after her zany stint in the Scary Movie franchise! I expect her to break out into some stereotypical satirical crazy expletive filled rant and find myself almost dissapointed that she doesn't.<br><br>When the Bough Breaks lacks in originality but does have its moments, sadly not enough to raise the bar above distinctly average.<br><br>The Good:<br><br>Morris Chestnut<br><br>Has a couple of interesting moments<br><br>The Bad:<br><br>Regina Hall<br><br>Seen it all before<br><br>Things I Learnt From This Movie:<br><br>When a girl hits on you keep it a secret from your wife, what could possibly go wrong?<br><br>Moral of the story, don't have kids.","user":"Platypuschow","rank":[20,21]},{"title":"Ignore the low rates,this movie is excellent.","rating":10,"date":"19 September 2016","review":"Young, professional and successful, John and Laura (Regina Hall) Taylor desperately want to have a baby, but are unable to conceive.<br><br>After exhausting all other options, the couple hire Anna, a beautiful young woman who agrees to become a surrogate mother for the Taylors.<br><br>Everything seems fine until Anna starts to develop a dangerous fixation with John as the pregnancy moves further along. The Taylors now find themselves playing a deadly game with a psychopath who holds the key to their future.<br><br>I advise you to ignore the low rates and watch this excellent movie.<br><br>I guarantee you are gonna enjoy watching this interesting movie from the beginning till the end.","user":"himes-38118","rank":[96,132]},{"title":"A Good Movie","rating":8,"date":"28 September 2016","review":"This movie is, I believe, a remake of \"The Hand That Rocks the Cradle\" from 1992. At least, a similar set of elements comes up in both movies, this time with a black cast rather than white. One way or another, it was a good movie, full of suspenseful points, and the acting was good. I liked it.<br><br>John and Laura Taylor cannot conceive a child, despite having made all efforts, and have resorted to hiring a surrogate mother, who is sweet (and seriously cute) and generally easy to like and love, a girl named Anna Walsh. But Anna isn't all she seems to be, living an unstable life and hiding her own deep and dark secrets as she develops inappropriate feelings for John, and her obsession with him turns dangerous and violent. What happens next? Buy a ticket and see the movie. LOL<br><br>PH","user":"pthef","rank":[39,57]}]