[{"title":"Sizzling Lightning Monster Flick","rating":5,"date":"23 November 2009","review":"I respect the opinions of other reviewers on IMDb, but sadly, from time to time, you spot a tendency for the writers of these movie reviews to follow the leader. If the first guy says a movie is lousy, the rest play copy cat. I'm going to play Devil's Advocate for this film. It is not a bad movie. It is an entertaining movie. The plot is a little predictable (small town setting; pumpkin festival bringing in the tourists; rugged Sheriff trying to protect the citizens; stupid Mayor squashing Sheriff's effort to warn the citizens; professional monster hunter in town to deal with the menace) and it is not much of a stretch to surmise the script's inspiration was Jaws. It is obviously a low budget film and most of the actors have thin resumes. But if you are looking for a Saturday afternoon fun session sitting around with the guys knocking back a few beers, and this flick comes on the SyFy Channel, ignore the naysayers who wrote such negative reviews, and give this film a try. It will reward you with a couple of hours of solid entertainment.","user":"Eventuallyequalsalways","rank":[16,18]},{"title":"Better than the other reviews say","rating":7,"date":"13 March 2010","review":"I liked this movie. Although the plot was a bit hokey (and what sci-fi movie doesn't have a hokey plot--after all, it is science-FICTION), it was still a decent movie.<br><br>Kevin Sorbo does a good job of the sheriff putting up with a real dorky and stupid mayor. The mayor is more concerned about the annual pumpkin festival getting ruined than caring about a storm that is coming in fast and could devastate the town while the sheriff takes the threat seriously.<br><br>The evil alien that IS the storm is the hokey part, but if you get past that dumbness, the movie is just fine.","user":"bpeck13","rank":[8,11]},{"title":"a lightning storms a comin'","rating":1,"date":"12 September 2009","review":"I have watched a lot of movies in my life, and from the biggest A productions, to quickie drive-in fodder from the 50's, to quirky little independent films, and Lightning Strike is without a doubt the silliest film I have ever seen! And I mean that in a bad way.<br><br>I don't know where to start, the bad acting, the bad writing, the ham handed \"character development,\" the fact that it's sort of a steal, bordering on a parody of Jaws, only with \"a lightning storms a comin'\" instead of a great white shark, or the seemingly endless scenes of Sheriff Hercules trying to talk the mayor to get people out of town because \"a lightning storms a comin'\" and getting people indoors would do no good, we have to get them out of town (storms don't happen outside of town?) so many times I thought the film had looped back about 20 minutes and started again.<br><br>Perhaps it's that according to his film you can dodge lightning if you see it coming first, I think that's the main thing that broke the needle on my silly meter.<br><br>Alright, alright I get it, the Saturday night Syfy movies are almost always dogs, and you know that coming into one and 19 times of out 20 you're going to end up getting just what you deserve for tuning in, but this puppy I fear abused that privilege.","user":"TerryMcC","rank":[14,30]}]