[{"title":"Perfect For Some Laughs","rating":9,"date":"9 October 2012","review":"I'll admit, when I watched this I didn't have particularly high hopes. I never put much hope into a comedy, because so often they either aren't funny at all or put every joke in the preview. However, I figured it deserved a chance considering my love of Olivia Wilde especially, but also the other big names like Hugh Jackman, Jennifer Garner, Ashley Greene, and so on. <br><br>Now, be warned, this is not the movie to watch if you expect to take anything seriously. That isn't to say it's a comedy about people doing stupid things and being immature, quite the opposite, but everything is taken in exaggeration. After all, it is a movie about sculpting butter, so don't expect some pulse pounding drama.<br><br>That being said, if you have a good sense of humour, and want to laugh, then this is the movie to watch. The acting was amazing from everybody, Garner gave me chills when angry, Wilde had me in tears from laughing, and Yara Shahidi was unexpectedly amazing in her role as the young foster child. I absolutely recommend it.","user":"NyxEos","rank":[36,44]},{"title":"Not Perfect, Not Terrible. I Enjoyed It.","rating":6,"date":"26 November 2012","review":"In small-town Iowa, an adopted girl discovers her talent for butter carving and finds herself pitted against an ambitious local woman in their town's annual contest.<br><br>Let me say right off the bat what I did not like about this film: the political angle. I did not mind the Newt Gingrich carving, but was it really necessary for the Picklers to be presented as Republicans? Their political views were not important -- their competitive spirit was.<br><br>That aside, it was pretty great. The ensemble cast is incredible -- Hugh Jackson, Jennifer Garner, Olivia Wilde (who steals the show on her bicycle)? Awesome. Ashley Greene outside of Twilight? Incredible. And Alicia Silverstone, who I had completely forgotten existed, comes back in a big way.<br><br>Some of the humor here is weak, and some of it is a bit cheap (two sex scandals are a key part of the plot)... but for a film about carving butter, it all ends up being pretty decent.","user":"gavin6942","rank":[25,32]},{"title":"Uneven but, entertaining satirical comedy","rating":7,"date":"20 December 2012","review":"Uneven but, at times, amusing offbeat comedy about the participants in a butter sculpture contest. When butter sculpture king, Bob Pickler (Ty Burrell) is asked to step aside after 15 years in the spotlight, his vengeful, social climber wife, Laura (Jennifer Garner) decides to enter to win to keep the Pickler name at the top. When she comes up against a truly talented 10 year old orphan, Destiny (Yara Shahidi) the gloves come off as Laura Pickler fights to keep herself socially relevant. While the film isn't perfect, the script by Jason A. Micallef provides some fun satirical wit and director Jim Field Smith guides a good cast through the hit and miss material well enough to entertain. And while for the most part, Butter is a fun satire of middle America, it does have a tendency to divert attention to subplots that don't serve the story. No more evident then Bob's involvement with a hooker (Olivia Wilde) who then becomes involved with the contest and Bob's daughter (Ashley Greene). It provides some sex and spice to the film but, nothing to the plot as does Hugh Jackman's brief appearance as an old flame of Laura's. While the film's focus does wander, there is enough there to make this an amusing enough watch and the cast helps carry things well enough when it flounders. More like 6.5","user":"jaguiar313","rank":[12,15]}]