[{"title":"You've Done Some Bad Things, Sweetie","rating":8,"date":"29 August 2010","review":"Greetings again from the darkness. An Australian movie that packs a wallop! Writer/Director David Michod delivers an unsettling look into one family's life of crime and corresponding order of things - the circle of life in the Animal Kingdom. Supposedly based on a true story, this is a tough family that you would not want as neighbors. These aren't Scorcese's smooth operators from \"Casino\" or \"Goodfellas\". No, these guys are worse.<br><br>The matriarch is played chillingly by Jacki Weaver. She is mother or grandmother to the guys (except for one outsider) in the band of crooks. While she messes with your mind through the story, it's not until the final 15 minutes when she really kicks it up a notch and becomes flat out frightening in her power.<br><br>There are only a couple of actors that most people would recognize. Joel Edgerton plays the outsider in the group, and the one trying to go straight by playing the stock market with his \"earnings\". The other is Guy Pearce, who plays the detective trying to both solve the cases and rescue young Josh, played by newcomer James Frecheville.<br><br>Not only is this the type of story that sucks you in, it is a reminder of just how distracting movie stars can be a to film. The lack of stars allows us to really be absorbed into this family, or better, this world of crime, deceit, corruption and paranoia. There is not a single superstar who appears - one who can capitalize on his film history of characters and immediately generate recognition. Here, the viewer must get to know an entire family for who and what they are. This is powerful stuff for a film lover.<br><br>The winner for best psychopath is Ben Mendelsohn as Pope. His dead eyes will scare you. His demeanor will scare you. His actions will disgust you. There are two lines in the film that help us make sense of what occurs. Early on, the narrator tells us that \"all crooks come undone\" at some point. Later, the detective (Pearce) tells us that in the Animal Kingdom, you are either weak or strong. The lines seems pretty clear.<br><br>The focus of the film is on Josh (Frecheville) who gets plopped into this family of criminals after his mom dies of an overdose and he calls his grandmother (Weaver). Josh spends the rest of the film trying to blend in while staying clean. Of course, even his stoic mask doesn't save him from the path of destruction created by Pope.<br><br>In the end, the film is about survival, adaptation and defining what really defines strong and weak, good and bad. If you enjoy powerful crime thrillers, this one is worth checking out ... and be appreciative for the lack of Hollywood star power. That's part of why it works!","user":"ferguson-6","rank":[117,136]},{"title":"Riveting story of crime and police vigilantism","rating":10,"date":"25 January 2010","review":"The backdrop to this movie is Melbourne, Australia in the mid-1980's, which (according to the director) had one of the highest per-capita murder rates in the world. At the time, there were several deaths in Melbourne in which wanted and suspected criminals were killed by the police under suspicious circumstances. These killings in turn supposedly ignited a slew of retaliatory murders perpetrated on police officers (cf. the \"Walsh Street\" police shootings).<br><br>This is a movie about a young man (Josh or \"J,\" played by James Frecheville) whose extended family are all criminals. Using the character of seventeen-year-old J as a sort of catalyst, the movie explores a variety of crime-related issues, from the effects of growing up in a world where criminal activity is the norm, to the escalation of crime that is a natural consequence of vigilantism (especially when the vigilantes are police).<br><br>The characters are all played very well, with exceptionally good performances given by Ben Mendelsohn, Jackie Weaver, Sullivan Stapleton and young James Frecheville in his debut as J.<br><br>While \"Animal Kingdom\" starts slowly (perhaps -too- slowly for some), it continually builds in intensity throughout the entire movie, culminating with an ending that is both shocking and yet inevitable. In particular, the movie has a very compelling scene played perfectly by Mendelsohn, with an awesome supporting role played by Luke Ford - I'm sure this scene repulsed many in the audience (it certainly repulsed me). At first, I feared that the scene was added by the director merely as a gratuitous exploitation of the audience's emotions. However, as the movie progresses, the scene's outcome becomes an integral part of the plot development, and is therefore necessary for the completion of the main story.<br><br>This movie will not be for everybody - the subject matter and the honest way in which the movie portrays it made the movie somewhat taxing at times to sit through. However, I think those willing to consider the necessity of telling the story of \"Animal Kingdom\" will find the movie entertaining and thought-provoking - I certainly did.","user":"DrPhoton","rank":[142,173]},{"title":"Great crime story","rating":9,"date":"7 June 2010","review":"After his mother dies, 17 year old J comes to live with his estranged grandmother and uncles, a family of felons. He enters the animal kingdom of suburban crime and stumbles through a minefield of sociopaths, cops and lawyers, all claiming to protect him. J soon learns though that trust means nothing when people are desperate.<br><br>This is a dramatic, well-made film that haunts the mind. Highly cinematic, meticulously crafted, thrilling and poignant in equal measure. The director emphasises realistic dialogue, multi-dimensional characters and underplays violence. Still, the film is palpably tense, there are scenes that will leave you shaking, even where there is no bloody payoff. As the body count builds even a car slowly reversing down a driveway becomes a menacing sight. The ending is satisfying.<br><br>The film is very well acted, young Frecheville keeps it natural and holds his own amongst titanic performances from veteran Aussies. Mendelsohn as Uncle Pope is particularly brilliant, dressed at Christmas from Lowes, this dorky suburban thug bullies the weak (including his passive younger brother Darren, unhappily entrenched in a life he cannot escape from), and who's confrontational behaviour springs from a deep well of paranoia. His maladjusted moral compass so skewed he frequently crosses into psychopathic territory. And yet he remains all too human, he's a mundane monster. Weaver too, leaves a memorable impression, where revelations abound in the film's third act.<br><br>My only complaint is that I would have liked to have seen a courtroom scene that is left to the imagination, we see corrupt police in action, why not a demonstration of hypocrisy in the justice system too? But this is a minor whinge in the grand scale of this ambitious story.","user":"gr0o0rg","rank":[81,107]}]