[{"title":"Once again a wonderful film gets thrashed due to, ironically, imaginary reasons","rating":9,"date":"30 March 2019","review":"I don't know what people were expecting from this movie and I really don't get the low scores. This movie was fun, adventurous, well acted and above all else very different and unique, with a brilliant twist on the Don Quixote story. This film did not come out of Hollywood's movie spewing machine so I would guess audiences nowadays are too dumb to comprehend a good work of art. A metaphor. An analogy. An intricate story that blends fantasy and real, history and present, fact and fiction.<br><br>This film was wonderful and I smiled all throughout. It is similar to films such as Holy Motors (2012), The Imaginarium of Doctor Parnassus (2009), Birdman or (The Unexpected Virtue of Ignorance) (2014) so if these ring a bell please give this film a chance. You will thank me later.<br><br>I rated it a 9 because so many people rated it so low and, honestly, it's at least a 7. Considering the fact I smiled all throughout the film I give it a 9 but objectively it as an 8.","user":"scaradu","rank":[96,114]},{"title":"An autobiographical tale about films, stories and dreams","rating":7,"date":"24 May 2018","review":"Not a masterpiece, not a disaster, The man who killed Don Quixote has the qualities and faults of what it is, that is to say, basically, a film for one spectator only : Terry Gilliam himself.\nAnnouncing its legend in the opening credits, the film takes pleasure in referring quite openly to the misadventures of Lost in La Mancha, most often through lines put in the mouth of the producer played by Stellan Skarsgard. These winks would be at best anecdotic, at worst narcissistic, if we didn't realize little by little that, we are in the presence of a true cinematic exorcism. Exorcism of this damned project, certainly. Exorcism also, through the character of Toby, of what Gilliam could have become if he had listened to the sirens of advertising and had become a soulless hack. Exorcism finally, and this is the most touching, of what Gilliam is afraid of becoming (and that he may have already become for some), that is to say an old fool who no longer interests anyone, an old dreamer in a materialistic world, a relic from another time, mocked and ridiculed. Thus, despite all its failures (problems of rhythm, lack of breath due to lack of money, episodic structure that works randomly and unfortunately makes Quixote disappear many times), we can only admire this film which bears on its face its testamentary dimension. Transmission, summary of a life, return on his youth, everything is there. Gilliam is Quixote, Gilliam is Toby, Gilliam will die but Gilliam is immortal since his dreams are forever with us on film. This is the bittersweet and somewhat crazy statement of The Man Who Killed Don Quixote, a film about films, a story about stories, an endless dream.","user":"jay-ros","rank":[134,162]},{"title":"Again, Gilliam Takes Us on a Thought-Provoking Wild Ride","rating":8,"date":"23 May 2018","review":"Maybe it helps to be familiar with Terry Gilliam's canon of work. But as a whole The Man Who Killed Don Quixote is a multi-layered story of the Ages of Man. The Dreamer and the Raconteur living in parallel lives.<br><br>What's fascinating is how the meanings of each of the characters and their story arcs fold into each other from the director, Terry Gilliam's own life to Adam Driver, playing a Gilliam figure all the way to Jonathan Pryce's man who's seemingly lost his mind. Part of me wonders how much of this is a farcical documentary or auto-biography.<br><br>Still as heady as it can be it still entertains. The acting is great, the characters are fully realized and the settings, cinematography and production design are signature styles of Gilliam: hand-crafted to bend to the will of his vision...as mad as it may be.<br><br>This is not a run-of-the-mill linear movie. It's not a popcorn flick. There's a lot to interpret and involve the audience so, don't expect instant gratification. To a lot of reviewers it seems they were overwhelmed by an unclear story. Which that may be true for those who don't want to be involved in the story. It asks a bit of self-reflection, it asks a bit of trust that the characters, working on several levels of psychosis, dreams, hallucinations and madness will all come to a natural conclusion in their story arcs and bring the global story of the film into one single point of focus:<br><br>We all had dreams once and we got lost. We may remember those dreams in our middle-age and yet in our old age we may become consumed by the dream to point of dreaming of our own existence.<br><br>If you like BRAZIL or THE IMAGINARIUM OF DOCTOR PARNASSUS you will like this film.","user":"Skinshark","rank":[93,122]}]