[{"title":"Creepy at first, but grows weird and yucky fast.","rating":4,"date":"22 February 2011","review":"Somewhat creepy, a voyeuristic \"ick\" factor, even decent acting but it never feels grounded and completely falls apart by the end. To its credit, the idea might've sounded better on paper, but doesn't work on film.<br><br>A major problem is we have little connection with our characters other than the likability and vulnerability Hilary Swank naturally brings to the screen. But there is no motivation for anything that happens: from coincidental meetings, to needing a giant apartment, to why the over-the-top infatuation, etc.<br><br>The plot holes are so gaping it ruins the realism. Seriously, would somebody visiting a hospital really find an ER doc extremely hot in scrubs? Is a $3800 apartment a good deal for any single lady? Why would a voyeur need to stalk around inside an apartment when he's got every vantage point from behind the walls? It's just full of dumb... and frankly, without realism you're removed from caring too much and it's not scary.<br><br>Oh, and if your only interest is peeking in on Hilary Swank (yes, pun intended), you'll likely be disappointed on that level as well.<br><br>Naturally the very moment \"the resident\" discovers the secrets of her landlord, she has no opportunity to escape, cell phone stops working, boyfriend is... well, basically the ending is full of chasing and one gotcha scare after another... and another... and another. Did they rewrite the script a bunch of times, but forget to remove the early endings? Perhaps the gotcha scares work on some level, but by the end I just wanted everything in fast-forward... and that's saying something for a movie where the credits roll after only 86 minutes. Skip it!","user":"david-2829","rank":[54,72]},{"title":"Maybe disturbing for some.","rating":6,"date":"6 August 2011","review":"Dr. Juliet Devereau rents an apartment in New York, large and affordable, but the owner Max begins to want more than just rent.<br><br>Director&nbsp;Antti Jokinen&nbsp;doesn't glamorise New York showing the older side of the city and keeps things moving with plenty of cuts and naturalistic lighting. The music adds some tension to the on screen proceedings to what is essentially a stalker/ voyeur thriller.&nbsp; &nbsp;<br><br>The cast includes a seasoned and accomplished cast including Hilary Swank,&nbsp;Christopher Lee as the&nbsp;creepy building owner&nbsp;August and his son Max played excellently by Watchmen's (2009) &nbsp;Jeffrey Dean Morgan. Morgan is first rate as the deranged obsessive weirdo and the casting of Swank&nbsp;as Devereau avoids the teen slasher cliché. Amougnst the spy-holes, secret doors and cavity walkways of the apartment it's great to see Lee in a contemporary role albeit small.&nbsp;<br><br>Anyone familiar with Single White Female (1992) or Pacific Heights (1990) will have an inkling what their in for. The Resident is a small tight thriller that has few surprises, yet, it's keeps you watching due to Swank's allure, the simplistic premise and&nbsp;Morgan's craziness.<br><br>Overall, nothing new, but maybe disturbing for many due to themes of intrusion and privacy being violated.","user":"amesmonde","rank":[12,14]},{"title":"Somebody likes your toothbrush","rating":5,"date":"12 June 2011","review":"This is a American shot thriller from a Finnish director and put out by the recently revived Hammer Film--yep, the British production company known for its atmospheric horrors. \"The Resident\" gives nods to \"Single White Female,\" \"One Hour Photo\" and \"Fatal Attraction,\" where it's a dark tale of infatuation that builds and builds into a roaring obsession due to an object of desire that's out of physical reach.<br><br>Some look for specific qualities or rewards in relationships than others, such as a momentary bit of comfort, physical release or warmth and security. There's a middle ground where you both meet in agreement, yet there are those that want things to fall specifically in place and only go the way they want them to. There's going to be zero compromise with those aggressively tuned people, just a one track freight train of a strong personality and another unsuspecting person caught frozen on the tracks.<br><br>A woman named Juliet, played by Hilary Swank, is looking for an apartment after hitting a rough spot. She works by day as a doctor and after living in her new residence for a short while she's being watched with a privy eye at night. This has a few unsettling moments, as the watcher slowly works themselves up to get close enough to know what the bristles of her toothbrush feel like, as well as the brand of her undergarments. There's no real surprise as to who it is as there's only four main characters shown and three of them quickly seem unlikely. The filmmakers realized about a third of the way in and dropped the whole mystery element in order to escalate the encroaching visits in first person to Juliet's apartment. If it wasn't predictable enough, she eventually starts to suspect something's amiss and decides to take matters into her own hands in order to figure out the truth about what's going bump at night and why she feels so weird in the morning. Though the closer she gets, it causes the person to step out from the shadows for a finale that wraps up somewhat abruptly.<br><br>\"The Resident\" has a formula that's been done before with films that deal with unabated fixations that lead to stalking and voyeurism. This was a common template for slasher films, though this is definitely missing the gore and guts, but intact is the cinematic thrills. This does take it another step further with a few memorable scenes that push things over the top even if it mostly hints at them without actually revealing them head-on in explicit detail. That seems to be the main purpose: to show some suspenseful scenes and to cut and paste characters into scenarios in order to make that happen, as the story itself felt straightforward and ultimately inevitable. This might be effective towards creeping out your squeamish girlfriend, as it gives paranoid thought to sleeping alone and putting blind trust into strangers, otherwise there's not a whole lot of substance here to mine or to come back to for replay value. (Also submitted on http://fromblacktoredfilmreviews.blogspot.com/)","user":"TheHrunting","rank":[22,29]}]