[{"title":"Finally yes Finally I have seen a good Action Film from 2015. Mad Max: Fury Road is the finest blockbuster of 2015!","rating":10,"date":"3 October 2015","review":"When I wrote this review 3 years ago I had no idea how many people hate this movie and they are preferring Mad Max 3 over this film. Claming Mad Max Beyond Thunderdome the third film is better film than this, really? Better than this? Listen folks it has no Mel Gibson so what? So what's your point? Gibson dropped out this film and he wasn't interested, it was in development for years, since in 2004 this movie was announced. George Miller did something different with this film and he got hate for it. I hate Mad Max Beyond Thunderdome to death! It is rated PG-13 family film and I wanted an action bloody rated R film not a boring stupid lame fu**** movie! I got an rated R bloody action film that I wanted in Mad Max: Fury Road. I was entertained and I enjoy it. <br><br>At least it wasn't so sick like was Beyond Thunderdome. Mad Max: Fury Road is my second favorite film in the franchise and this movie did it right and it correct that third film that it failed been an good action film. Like it or hate it, is your problem but in my opinion it is a good action violent movie and I love it to death I am an action junkie myself. Mad Max 2: The Road Warrior is my number 1 favorite film of all time. <br><br>I think Mad Max: Fury Road is George Miller's masterpiece. Finally, Finally after 30.years of fiasco Mad Max Beyond Thunderdome that completely destroyed the Mad Max Trilogy, George Miller finally come back and fix the mistake he did 30.years ago. Why wouldn't I love this film? This film is the best one in the series along side Mad Max 2: The Road Warrior at least for me it is the best film. It has action, high explosive and Tom Hardy been a real Mad Max unlike Mel Gibson was in Thunderdome. I am happy they made the 4th movie. Tom Hardy was a bad ass Mad Max. I didn't even noticed that we don't have Mel Gibson in here. Tom Hardy breaths life into Max Rockatansky and Charlize Theron is excellent and emotionally perfect as Furiosa. I love high speed and pursuit on a road which I seriously love this. The thing was more similar to Mad Max 2: The Road Warrior but much better, George Miller fix it, the film did not copy The Road Warrior the film has it is own story. All, the stunts and action sequences are SPECTACULAR. Immortan Joe was a fantastic villain in here he was really good. The film shows a real wasteland and the future which I am really happy about it. <br><br>NOTE: \"Don't waste your time if you have seen the original.\" from a hater review my reply: Yes I will waste my time watching this awesome action flick! Yes I have seen the Original Film Mad Max with Mel Gibson so many times than you ever did! I love this film much more than Mad Max because sometimes the original is very boring and the film has so much Drama in it and less Action than it is in Fury Road. I wanted to have an apocalyptic action film like are Fury Road and The Road Warrior which this film fix it. Finally yes Finally I have seen a good Action Film from 2015 and It is finally the finest blockbuster of 2015! <br><br>Mad Max: Fury Road is a 2015 post-apocalyptic action film directed and produced by George Miller, and written by Miller, Brendan McCarthy and Nico Lathouris. The fourth installment in the Mad Max franchise, it is an Australian and American venture produced by Kennedy Miller Mitchell, RatPac-Dune Entertainment and Village Roadshow Pictures. The film is set in a future desert wasteland where gasoline and water are scarce commodities.<br><br>10/10 Awesome film I have seen it twice. I love this film to death I love it! Fury Road would be the second favorite best film in the franchise.","user":"ivo-cobra8","rank":[214,321]},{"title":"An Action Masterpiece. Ridiculous In All The Right Ways. (9.5/10)","rating":10,"date":"14 May 2015","review":"George Miller returns to live-action filmmaking with one of the greatest action films ever put to screen. 'Mad Max: Fury Road' is ridiculous in all the right ways.<br><br>For those who have seen the original films and loved them, you'll fall in love all over again with this film. Tom Hardy takes the reigns this time around as Max - a man of few words who has been hardened by the world in which he lives. Along with him is Charlize Theron as Imperator Furiosa - a woman who seeks redemption by helping five young '\"wives\" escape from the film's antagonist.<br><br>Leading up to the film's release, many speculated if this would be just another action film that lacks a solid narrative and motive, but I am happy to say that this is simply not the case. Yes, the film does fill 80% of its run-time with action sequences, but it never gets in the way of the humanity between these characters that Miller has brought to life. There are some emotional moments. Specifically, with Theron's character. Is the story something we haven't seen before? Not at all. But in a film loaded with action, it's nice to see a solid narrative.<br><br>Now, how about those action sequences? Incredible - exhilarating - jaw-dropping. George Miller has put together some of the greatest, most memorable action set-pieces ever. One thing that sets the action in this film apart from a good majority of mediocre action films today is that every action the character's make have an affect on them. For good and for bad. The action is not pointless. It's motivated. And it's glorious to behold thanks to the use of practical effects, incredible stunt work and stunning cinematography.<br><br>'Mad Max: Fury Road' has set a new standard for action films. It's arguably the greatest action film of the 21st century. It's that good. George Miller has brought back what we loved about 80's action films while also brining new ideas to the table. It's the best time I've had in a theater in a long time, and I couldn't help but laugh in appreciation of the ridiculousness that was unfolding before my eyes. The film left me feeling giddy, with a big smile on my face.","user":"isaacsuttle","rank":[203,310]},{"title":"One of the greatest action films","rating":10,"date":"23 February 2020","review":"George Miller elevates action and violence to a true art form in this remake of a classic. The film is a gripping full adrenaline race across the desert of a post-apocalyptic future. The action sequences are mesmerizing and the work of a true master craftsman in action. What is perhaps the most enthralling part of the film is the absolutely absurd story and world building. Miller created a fantasy world where men playing flame throwing guitars and leaping through high speed chases on pull-vaults seems like a typical milk run. The movie keeps a relentless action pace that makes all of the absurdity seem so completely ordinary, which might be the real magic of this movie. This is only really possible because the action, filmography, set choices and music are so brilliant you cannot help but believe the insanity that plays out before you. You want to believe the fiction because of the quality of the production. The movie also features some surprisingly good performances. Charlize Theron being the real the star of the film, with the titular character really only acting as her support.","user":"MR_Heraclius","rank":[44,62]}]