[{"title":"A gentle, beautiful and sensitive anti-war film","rating":8,"date":"17 June 2013","review":"Having read and enjoyed the novel I decided to rent this movie, but while awaiting delivery I read all the reviews I could find. A very high proportion of these user reviews, both on IMDb and elsewhere, described a film that was totally boring, a complete waste of time, had nothing to do with resistance and was generally pointless.<br><br>All I can say in reply to these reviews is that films about war are not necessarily about violence, gunfire and cruelty. Put briefly, this film is a gentle story set in a beautiful Welsh valley, a tale of frightened farmer's wives left mysteriously without their menfolk, a group of German soldiers traumatised by war, an expression of human feeling and resistance to war in many and varied ways. If this doesn't appeal to you, then watch Rambo! If, however, you are a sensitive soul with a belief in human goodness, then watch this film and enjoy it! My only gripe is that I found the dialogue a little hard to follow - and there are no subtitles. Having said that, I accepted this difficulty and found that it didn't really affect my pleasure - the film doesn't rely heavily on dialogue. All-in-all a most enjoyable film and one that I will watch again - it certainly helped to hear the director's commentary on the DVD.","user":"maurice-714-270860","rank":[36,42]},{"title":"A touching but depressing tale of war, love, and loss.","rating":10,"date":"23 June 2015","review":"This film is breathtaking and beautiful with gorgeous scenery, cinematography, acting, and story line. It is a film that DEEPLY touches the heart.<br><br>Plot summary below:<br><br>Resistance is not really a good title for this movie since it is not really about resistance. The premise is that the D-Day invasion has failed and that Nazi Germany is in the process of occupying Britain and the war will be over soon. <br><br>A small group of German soldiers are sent on a mission to a secluded Welsh valley to look for a piece of medieval artwork reported to be there. This valley is extremely small with only a couple of farms on it. Meanwhile, all the husbands of the women there have disappeared. It never really explains what happened to them, but it can be surmised from the beginning of the film that they leave to participate in some guerrilla action and never make it back.<br><br>One of the main characters of the movie is the German Captain Albrecht. He notifies the women of the valley that his men will be posted there for a couple of weeks. He tries at first to find out where all the men went, but soon abandons that pursuit. <br><br>The main female character is farm wife Sarah, who feels extremely hurt and betrayed that her husband left in the middle of the night without saying anything (for her safety), but she also deeply misses him and is scared for both his safety and what this meas for her future. When the German soldiers show up this makes her feel even more alone and vulnerable. <br><br>Sarah and the rest of the women of the valley band together for support because the women feel scared and alone without their husbands and at first they don't want to have anything to do with the German soldiers. But Albrecht and his men are, for the most part, kind and compassionate to the people of the valley and treat them with respect while searching for the lost artifact, which was hidden before the invasion. The woman tell the soldiers they cannot cooperate with the enemy and be collaborators and the soldiers respect their wishes.<br><br>Soon the harsh winter comes and threatens the livelihoods of the women's farms and the soldiers catch food and start to offer help to the resistant women. When they help the women during a particularly bad storm, they start to come around and accept the help of the German soldiers around their farms who take on the tasks of their missing husbands. <br><br>Meanwhile, Albrecht has found the lost artifact but hides the location from both his men and the high command so they can stay there longer. He suffers from PTSD due to his men being killed in the war and also from the death of his wife and child in a bombing raid. The peaceful seclusion of the valley offers him something he has been longing far since the beginning of the war and he will do anything to keep it that way by keeping both the German command out of the picture and by stopping any communication into and out of the valley - his reasoning being that they can wait out the rest of the war in the valley so no more of his men get killed. The acting by Albrecht's actor Tom Wlaschiha is phenomenal and you can really see the pain in his eyes and face and the struggles he goes through, but you can also see his strength as he takes care of his men and his kindness and compassion for the women. <br><br>Albrecht develops a subtle relationship with Sarah who is missing her husband and who seems heavily depressed. Their relationship is probably the most interesting part of the film. The other women also develop different relationships with the soldiers as they work around the farm and care for them. The change in the women's attitude is also shown by the soldiers adopting the husbands' farming clothes.<br><br>A young boy who never went to the front was instructed before the invasion on how to resist the enemy. He spies on the valley and soon finds a way to interrupt their idyllic lives. I won't give away the ending but the whole movie is very heart-wrenching and you really feel for both the women, the group of soldiers, and the angry boy who wants to do his part in fighting the enemy.<br><br>This movie shows the horrors of war very honestly and really explores the nature of human beings and the feelings of love and loss during wartime.<br><br>It is not an action movie, but more of a slow character drama. It is HIGHLY RECOMMENDED.","user":"theredcomet","rank":[18,20]},{"title":"Not bad at all","rating":8,"date":"27 March 2012","review":"There will be spoilers in my review... I wasn't expecting that much from this film judging by its rating and reviews but I was pleasantly surprised. Well shot in a period style it offers a strange and perhaps inaccurate account of Wales if Hitler had taken Britain. I say inaccurate in account to a review on here that the Herman soldiers would have been more 'intimate' with the women which were, essentially, prisons of war. This may be true in reality and in many other horrifying an graphic representations of war in other films but this reviewer has failed to take into account the personality of the German captain who is obviously a kind soul who doesn't want to be mixed up in this as much as any other person! Seen in his protectiveness of his squad and eagerness to help the women farmers - hence no rape and pillaging. Some other reviews I would agree with, it is a bit slow at times but it is not overly long to make it seem tiresome and I do also agree that Sheen is wasted. The scene with the horse has been completely misunderstood by many too; obviously he was meant to shoot the woman but instead shoots the horse as he cant bring himself to do so. He has a local connection to her also so knows (and sees) the pain he has caused her by shooting her beloved horse - hence the tears. Some of the reviews on here are damn right stupid and i suggest you ignore and enjoy the film for yourself","user":"lufcwls","rank":[20,23]}]