[{"title":"Lower Your Expectations","rating":5,"date":"22 June 2018","review":"It is a shame that I will have to give this project a mediocre review, since I think the effort to tell Robert Mapplethorpe's story is admirable. Unfortunately, even though I am a fan of Ondi Timoner, the incredibly talented Director of We Live In Public, I would have to caution viewers to lower their expectations before entering the theater. <br><br>Perhaps what was most disappointing was the treatment of Patti Smith's character in the film. The actress, Marianne Rendon, was not up to the level that she should have been. The facts of the relationship are distorted, and the timeline also seems a bit off. In the movie, the character of Patti is working to support Robert; however, in real life, both of them worked to support each other. Patti gets annoyed with Robert (because of some unknown reason) and storms out, therefore, leaving Robert to find another lover/benefactor in the form of rich curator Sam Wagstaff -- yet in real life, Patti stayed with him quite a bit later on and was actually herself also funded by Sam Wagstaff when she went into a studio to record her first single. So the idea that Patti would never want to see or speak to Robert again is completely wrong, and Patti herself said publicly several times that what she and Robert had was much more than ordinary love. The scene of Patti walking out on Robert rings false, as does much of what Marianne has to work with. (I read her book Just Kids, her autobiography of that time, and it is quite clear that she would never have walked out of Robert's life, no matter what the outside circumstances.)<br><br>I had really hoped to see Patti and Robert creating the image of her first album cover (Horses), yet that scene seems to have been left out for some unknown reason. (Maybe a copyright issue?)<br><br>The film jumps forward quickly and does an awkward shift of Robert suddenly becoming famous and carrying his gripe against the world regardless of the fact that his photos are now being collected and respected. Oddly, he seems to be obsessed with the idea of \"biting the hand that feeds him\" on many occasions. Somehow, I feel this was an assumption by the writer and director and may not have actually been the real course of events. Robert is \"discovered\" (i.e., he sleeps with a guy who's rich) and the man who discovered him, Sam Wagstaff, is portrayed in the film as a gullible personality who falls under Robert's spell, and later on is prone to jealousy as Robert lives an obviously self-indulgent existence without a care in the world. As it is, Walstaff becomes quite successful and wealthy himself by the arrangement, and is therefore doubly compensated.<br><br>The lead actor, Matt Smith, does a professional job of portraying the famous photographer, and hits all the right notes. However, the material he gets to work with is all one-sided: apparently, according to the script, Robert Mapplethorpe could not get along with anyone, including none of his family members, not his first girlfriend (Patti Smith), not Sam Wagstaff, not a black man who was his muse named Milton, not his kid brother Edward, and of course, not his mother and father. In fact, (again, as the script dictates), he is painfully dropped by everyone -- and in one very \"on the nose\" moment, his \"black muse\" Milton says, \"You don't love anyone but yourself\" before smashing the famous photo that Robert took of him in the business suit -- and storming out of Robert's life -- of course, there is a bit of belief that needed to be suspended here. <br><br>As it is written, Robert Mapplethorpe is a crass, egotistic, over-hyped selfish brat who takes dirty pictures that are first, horribly rejected and later on, lavishly sought after by obnoxiously self-important and vain art dealers and critics. Yet, in spite of all that he achieves, and in spite of selling photos for thousands of dollars each, Robert is still living the life of a tortured artist. This leaves one to wonder, \nwhat exactly is his problem?<br><br>The scenes of Robert creating some of his famous photos are somewhat simplistic, i.e., the most that he seems to do to take a photo is to say \"Cross your legs\" and then \"Put your arms out\" -- as if it was just another day at the office. The scenes of some of the really erotic photos are about as exciting as someone taking wedding pictures (which, strangely enough, happens in a one scene set in San Francisco. As far as I can tell, Robert shot even Weddings, as long as it paid well. If this was a cartoon, a giant question mark would appear right about this point in the film, as if to say, 'Huh, say whut?'.)<br><br>In watching the film version, one can't help but wonder why is such a major artist being given such a simplistic biography. Was the budget too small? Was it too hard to include some of the more controversial issues? Issues such as the famous censorship case with the American Family Association (they declared his photos to be pornography) -- which, in hindsight, legitimized his work, and the resulting publicity pushed his fame into the public consciousness. <br><br>Surely a talented biographer as Ondi Timoner must have seen the irony of this series of events: unknown photographer takes erotic photos, no one takes any notice; the religious right denounces them, and suddenly everyone wants to see them -- bingo, instant fame. The story is really about our collective bigotry. We are all subject to the same fault: one only wants something when an authority figure tells us we can't have it. That's Ondi's territory -- and she does it so well.","user":"nick94965","rank":[44,51]},{"title":"The controversial sides (yes, plural) of Mapplethorpe get the big-screen treatment","rating":6,"date":"14 April 2019","review":"\"Mapplethorpe\" (2018 release; 102 min.) is a biographical movie about the life and times of controversial photographer Robert Mapplethorpe. As the movie opens, we are told it is \"Pratt Institute, Brooklyn, New York, 1969\", where a young Robert Mapplethorpe looks utterly bored. Next thing, we are in Manhattan, where Mapplethorpe is bouncing from place to place, and he is refused entrance to the Whitney Museum as he can't afford the $1 admission. Then one day, at the park, a young lady comes up to him asking for help. Turns out to be Patti Smith. They hit it of right away, and it's not long before they move in together at the Chelsea Hotel. By happenstance, another tenant there introduces Robert to a Polaroid camera... At this point we're less than 15 min. into the movie, and you;ll just have to see for yourself how it all plays out.<br><br>Couple of comments: this movie is written and directed by Ondi Timoner, best known for her music documentary \"DIG!\". As soon as I saw her name attached to \"Mapplethorpe\", I was pretty reasonably confident that we'd get a good movie. And it is a good enough, although by no means great, movie. The challenge faced by Timoner is how to bring the controversial sides (yes, in plural) of Mapplethorpe, both as to his personal life and as to his art, to the screen, without diluting the essence of the man and his work. In my book, Timoner strikes a good balance. The movie benefits greatly from the incredible performance by British actor Matt Smith in the title role. He really makes you believe that we are looking at the real Mapplethorpe. Beware: the movie contains a fair amount of nudity, mostly male nudity I might add. The early years between Mapplethorpe and Smith have also been covered in Patti Smith's brilliant memoir \"Just Kids\" (much better than this film, frankly). It is hard to believe that 2019 marks the 30th anniversary of Mapplethorpe's death... The movie's closing credits reference \"The Perfect Moment\" traveling exhibit later in 1989-90, where upon its exhibition at the Contemporary Arts Center here in Cincinnati in Spring of 1990, the CAC was charged with obscenity, the first museum ever to face such a charge, the movie reminds us. The CAC was subsequently acquitted by a unanimous jury, but the film makers \"accidentally forget\" to mention this in the movie's closing credits...<br><br>\"Mapplethorpe\" premiered at last year's Tribeca film festival to positive acclaim, and finally was released in theaters this weekend. The Saturday early evening screening where I saw this at my art-house theater here in Cincinnati, was attended okay but not great (about 20 people). Following the screening, there was an insightful, free-flowing half hour Q&amp;A session with Louis Sirkin, the Cincinnati lawyer who successfully defended the CAC against that obscenity indictment. If you have any interest in controversial art and a controversial artist, I'd readily suggest you check this out, be it in the theater, on VOD, or eventually on DVD/Blu-ray, and draw your own conclusion","user":"paul-allaer","rank":[8,8]},{"title":"Stylish but no depth","rating":7,"date":"8 June 2019","review":"If you are a fan of photography as art, are a photographer yourself, appreciate Mapplethorpe,or lived in the NYC area during the late 60s to late 80s this is a must-see. The movie is expertly shot and evokes that era to perfection. Matt Smith is excellent as Mapplethorpe and the movie is filled with characters who are totally of that time. Mapplethorpe's work is on display throughout the movie and it was interesting to see the little stories behind so many of his famous (or infamous depending on your outlook) photographs. The problem is, with it's many pluses, in the end there is little depth to this movie at all. Robert's life is portrayed as if this happened, then this, then this, on and on, not really examining any of it. I came away knowing nothing about him. As good as Matt is in the lead, he isn't given much to work with. It's as straightforward as , he lived, he took pictures, he died. I got as much from the movie, maybe less, then the book of his photographs I own.","user":"hampersnow-28905","rank":[7,7]}]