[{"title":"More than expected","rating":8,"date":"4 August 2011","review":"There are so many things right about this movie, the little things that are wrong are easily forgiven. Some slight plot holes, but the film and characters make up for it. The chemistry between Franco and Pinto is weak, however Franco plays his part. Lithgow is always a great asset to any production, and does a great job here.<br><br>Albeit you know the chimps are CGI, their eyes look amazing, with depth and personality, and along with their body language and facial animations, you really do forget they are CGI. The music is powerful and tense, and I loved the way it builds up through out the movie. Starting with light orchestra at the beginning, while starting to feel very tribal without overdoing it towards the end.<br><br>There are moments that are truly gratifying, and Caeser really steals the show with his evolution through out the movie. The journey Caeser takes really connects and you feel his plight. With moments of thought, heart and action, Rise really hits the mark for the audience it's aiming for.<br><br>Excellent entertainment all round!","user":"lodewickus","rank":[322,447]},{"title":"Apes Will Rise!!","rating":9,"date":"11 August 2011","review":"Disaster movies are a dime a dozen now a days. We have seen an influx of Alien takeovers recently and it is getting a bit stale I must admit. Don't get me wrong, I love films about ET's taking over, but Hollywood has beaten that horse to death. \"Rise of the Planet of the Apes\" is a welcome change to this trend pitting us measly humans against our closest ancestors, Great Apes. Directed by Rupert Wyatt (\"The Escapist\") and supported by the unbelievable WETA Digital (\"King Kong\", \"Lord of the Rings\", \"Avatar\") for special effects. \"Apes\" is a wonder of motion capture, an intelligent heart felt script with great direction. Unfortunately, the human actors left a lot to be desired. But this film isn't about the humans, it's all about the Simians.<br><br>As plots go, this is pretty basic. James Franco plays Will Rodman, a brilliant scientist with a breakthrough drug that just may cure Alzheimer's. Rodman and his team are using chimpanzee's to test this new drug and in the process find out that it increases intelligence as well as repair cells in the brain. One of the test subjects gets loose in an intense sequence and ultimately put down. It turns out that she had just given birth to a beautiful baby chimp who inherited this new \"altered\" gene. Rodman decides the only moral thing to do is to take the baby home while a co-worker tries to find a sanctuary but once Rodman finds out that this little ball of fur has the intelligence of a human child twice it's age he decides to keep and raise the chimp as a child. It's only a matter of time that our chimp Caesar figures out he is not like the other children in the neighborhood. Rodman is forced to give up Caesar to an \"Ape Sanctuary\" and there begins some of the most exhilarating revolutionary action I've ever seen.<br><br>Technically, this film is massive. The work WETA Digital did with motion capture (mo-cap) is truly a wonder to behold. Visual Effects Supervisor with WETA Digital Joe Letteri stated that they built on the technology used in \"Avatar\" to produce the most realistic and accurate portrayal of the actors suited to play the Simians. Andy Serkis (Gollum from \"Lord of the Rings\" and Kong from \"King Kong\") plays chimp Caesar. Serkis manages to fool all of us into believing he is a real animal with super intelligence. His facial emotions and mannerisms should most certainly nominate him for an Oscar. There is a real connection that the audience feels with Caesar and it is all thanks to Serkis' work. Without such an experienced mo-cap actor, this film would not have been such a success.<br><br>Not only is the technology used to create the revolution amazing, the action is top notch as well. Many times I found myself with my jaw on the floor from the intense sequences put to screen. Everything from a simple terrifying look from an angry ape to the full out battle on the Golden Gate Bridge was pulled off without a hitch. Many points to the pacing of the films action as it could have been the crutch that killed this beast of a film. One of the most amazing scenes in my opinion is when a group of apes are fleeing over top a suburban neighborhood through the trees. While this is going on we see some people on the street while leaves upon leaves are falling to the ground. This level of detail is apparent in every shot, brilliant work by the production team.<br><br>My only problems with this film is the acting from Franco and Freida Pinto, who plays the love interest. They both seemed to \"phone it in\" as it were. They were not overly impressive and just seemed stale. Maybe the director wanted them to tone it down so that Serkis would have more of an impact acting as a voiceless chimp. Either way, as I said in the beginning, this film wasn't about the humans. It's about compassion, freedom and understanding and on those levels the film is a grand success.","user":"CinemaPat","rank":[116,158]},{"title":"The most emotional Planet of the Apes film.","rating":9,"date":"5 August 2011","review":"To sum it up, a very powerful film falling just short of being a masterpiece. However, the only flaw in the film is that the film could have been just a bit longer! I am really hoping for a director's cut because there should have been a few more character development scenes between father and son, boyfriend and girlfriend, and even Ape and Human. I felt the movie was paced a bit too quickly but nevertheless, still contains very fleshed out characters driven by excellent performances throughout, from Lithgow, to Franco, to Cox and especially by Andy Serkis.<br><br>Cesar is by far the best animated character in the history of cinema. His facial expressions tell it all! You feel his rage, his fear, and his child like innocence through his wonderfully animated eyes. Not only is the C.G.I. good, but the character is written very well in general. You will go through all of those emotions yourself as you witness his journey. All I can say is that I now know why I try to walk my dog without a leash as much as possible. This movie just confirmed it for me! Through the film, you will understand what Cesar is feeling and why. The invisible character of the film is humanity itself, and at times, feels like a study of human nature.<br><br>Plot wise, it is very well told. I thought there was nothing cheesy about the script, although not as intelligent as the original, but not dumb either. There is some science fiction in the film, and other than the experimental drug, there was some other surprising Science fiction plot elements in it too which might lead into the sequel; if there is one of course, and I think there will be.<br><br>For the skeptics who think the film would be cheesy seeing all the apes battle armed policemen then think again. I too, was a bit skeptical at first, wondering how the apes would defeat an entire police force, but when you watch the film your doubts would dissipate. Just remember the physical ability of apes and how powerful the apes are, and how much more powerful they would be if they had brains! The action was very good, but as good as it was, I'd trade it in for more plot development. There were a bit too many plot jumps in the last 30 minutes, but all in all, it was directed very, very well. Coupled with a good score, mellow at times, but highly dramatic which heightens the tension. Speaking of tension, there is a lot of it in this film. If you're an animal lover like I am, then be warned; You will be in tears 30 seconds into the opening scene.<br><br>I also wanted to mention the original film even though it's tough to compare the two. This is an origins story that actually makes the original better. The original was more about the plot than the characters and they each stand apart and alone with their own merits and flaws. It was nice to see a few homages to the old classic, and don't be surprised if you see a character from the original as well. I highly doubt this film will disappoint the fans of the original and TV series! It will have you climbing trees!","user":"Dragonsouls","rank":[363,526]}]