[{"title":"Good","rating":7,"date":"23 February 2020","review":"Interesting movie, false advertising about the guy with the pistol, the fights were good, I do not know the full story about the 47 Ronin but I think this modern adoption was a good version of it, but they probably could have been more accurate to the original story and it would have been even better.","user":"MR_Heraclius","rank":[36,38]},{"title":"Not nearly as bad as haters are making it out to be!","rating":8,"date":"26 December 2013","review":"The reviews for this film seem to be pretty negative generally speaking. Pivoting around the historical inaccuracies and the addition of the \"Half Breed\" character played by Keanu Reeves to this legendary tail. More on that further in.<br><br>In a nut shell. 47 Ronin has a fair amount of mystical magic and demons peppered throughout a historical tail. A tale of Samurai who's master is killed and their status is reduced to Ronin. Only for them to rise up and seek revenge against the evil ruler and his witch who are responsible.<br><br>Let's get to some positive stuff. Visually the 47 Ronin is beautiful. The costumes design and color choices to separate each of the different clans is impressive in it's complexity. The villains are not just dressed in black, but a fair amount of purple and silver is mixed in to highlight the details in their armor. The sets have an epic feel that is grounded and doesn't feel to fantastic, but rather believable.<br><br>Now on to the \"Half Breed\", who mainly adds the taste of a forbidden love story as well as a lifeline to the audience, drowning is a sea of unfamiliar faces. Many, if not most reviewers who've pan this movie for the addition of the \"half breed\" character fail to realize his importance for the audience. Around the start of the third act, there's a scene where one of the samurai apologies for his treatment of the half breed in a way that communicates to the viewer exactly where a Ronin places in the Japanese cultural/social structure vs where a Samurai does. The inclusion of this character and his treatment throughout the movie is an important plot device. Seeing his treatment by the Samurai as an outcast in the first act, then later his acceptance once they are labeled as Ronin is vital to the evolution of the main Japaneses characters of the story. Not to mention it helps to bridge a gap for an audience unfamiliar with Japanese cultural and social structure.<br><br>Historical inaccuracy are common in Hollywood. I personally view the ones in 47 Ronin to be no more reprehensible then the ones committed in superheroes films. Yes, I am comparing changes made to characters from Batman, X-Men, Spiderman and Iron Man's cannon to this historical tale of the 47 Ronin. Deal with it, they're just stories after all. We really have no way to know it there really wasn't a half breed character, do we? After all, history is told by the winners, and often inaccurately.<br><br>With a 2 hour run time, it did feel a bit slow to start, setting the stage for the second and third act. Once it gets going tho, it moved rather nicely. I didn't find myself checking my watch every 10 minutes wondering when it would end like another holiday release I won't mention. If the trailer interests you then you could probably do worst at the box office this holiday season. I enjoyed it, but that's just my opinion.","user":"skot-21","rank":[388,533]},{"title":"An odd, fantastical twist on a true story - not as bad as you're expecting, though not as good as history would have it.","rating":6,"date":"18 December 2013","review":"It never bodes well for a film when its release date is delayed - much less when it's been pushed back a whole year, ostensibly to accommodate reshoots that would bump up Keanu Reeves' completely imaginary role in a Western blockbuster take on a classic, awe-inspiring tale right out of the Japanese history books. That way lies disaster and madness, one would think - and certainly the bland, monster-heavy trailers for 47 Ronin did the film no favours. Smack down your inner critic, however, and this epic fantasy flick - for that's what it is - turns out to be reasonably palatable fare.<br><br>The bare bones of the true story are all there: the kindly Lord Asano (Min Tanaka) is ordered to commit seppuku - ritual suicide by disembowelment - when he almost mortally offends Lord Kira (Tadanobu Asano - a nicely ironic name if ever there was one). This renders all the honourable samurai in Asano's service masterless i.e., ronin. Led by the noble Oishi (Hiroyuki Sanada), the loyal band of 47 ronin vow to avenge Asano - even though they have been ordered by their Shogun (top military commander) not to do so.<br><br>What's less accurate, of course, is pretty much all the rest of it. Reeves plays Kai, a half-British, half-Japanese orphan who's taken in by Asano but treated like an outcast by everyone in the household - except, of course, for Asano's loving daughter Mika (Kou Shibasaki). Kira's nefarious plans have the support of Mizuki (Rinko Kikuchi), a witch who can apparently take any form she likes: wolf, snake or dragon. It's all a bit nonsensical, especially when Kai tries to get swords for the ronin amongst some pretty creepy folk who have gone from society's outcasts to being part of what looks like a supernatural cult.<br><br>In other words, 47 Ronin is a faintly ridiculous addition to the wealth of Chūshingura - fictionalised accounts of the 47 ronin tale - that already exist in Japan. It's the kind of big, dumb blockbuster in which the good guys literally live to die another day as long as the plot calls for it. These fearless ronin even survive when the villain is protected by a witch with crazy mystical powers! She can set an entire field on fire, create poisonous spiders and turn into a dragon! And the ronin - at least 47 of them - live anyway! It's crazy! <br><br>That's what makes it all the more surprising when 47 Ronin turns out to be... well,actually not half-bad. Once you've accepted the sillier aspects of the film for what they are, it's easy to get swept along by its very earnest drama and spectacle. Reeves' storyline is a made-up jumble of nonsense, but is played very straight - this is, in effect, Sad Keanu: The Movie - and it just about works. Casting Reeves as the outsider allows him to do what he does best: play the role with stony-faced reserve, whether he's levelling up by battling demons in cage matches or pining moodily after Mika. Kai's restrained love story with Mika is fairly predictable stuff, with the girl fading a little too much into the background (don't expect any bloodletting from Shibasaki, Battle Royale fans), but it's salvaged by the rather non-Hollywood way in which it all ends.<br><br>For all that Reeves takes centre stage in the publicity campaign, the film belongs just as much to Sanada's Oishi. He undertakes a more arduous emotional journey: one that takes him from grudging to full-hearted acceptance of Kai's worth as a warrior and comrade. His relationship with his family is more fully examined than Kai's unwavering loyalty to the Asano clan. As Oishi plots his course of action, one that will bring him shame for disobeying the Shogun even as he avenges his master, he warns his wife and son Chikara (Jin Akanishi) to disavow him. Their reactions provide some of the most emotionally resonant moments in the entire film.<br><br>All things considered, the title of the film is a bit of a misnomer - it would more accurately be called 2 Ronin, subtitled Oishi And Kai's Excellent Adventure - and it suffers from a lamentable lack of humour and historical accuracy. But it's not a complete travesty. Tucked away beneath a layer of mystical beasts and witches lies a story with enough heart, nobility and soul to survive even the oddest twists and turns.","user":"shawneofthedead","rank":[176,246]}]