[{"title":"Bad Times On The Bayou","rating":6,"date":"30 March 2009","review":"Young college student from Boston, Jerry O'Connell out on some hijinks with friends in New Orleans comes across an old deserted mansion and sees the ghost of a woman there. He feels a real connection to her and the house. Years later, now an attorney, O'Connell moves to the area to start a law practice aimed at making insurance companies cough up what they owe flood victims. But it's more than business that Jerry's got on his mind.<br><br>He buys the old mansion and has plans to renovate and move in. But he sees some startling visions of the past around the turn of the last century. He makes a connection with Lauren Stamile who also has a connection to the house. She's the great great granddaughter of the woman that Jerry finds out was murdered.<br><br>Midnight Bayou is based on a Nora Roberts romance novel of the same name, though its characters could have been taken from the works of Tennessee Williams. Faye Dunaway plays the grandmother of Stamile who raised her and she's fine in the part. The really evil one is the prostitute/junkie of a mother Marcelle Baer to Stamile. She is a bad person in the past and present.<br><br>The film is a cut above most of the Lifetime network productions and recommended for devotees of Nora Roberts.","user":"bkoganbing","rank":[23,31]},{"title":"A Good Watch!","rating":8,"date":"13 September 2009","review":"I just finished watching Midnight Bayou and was very pleasantly surprised. I very thoroughly enjoyed the characters of Lina and her Grandmother Odette, the supernatural twist, although fairly predictable, was still intense to watch - and of course the Louisiana Bayou backdrop. There are two time lines playing out in this movie, and I felt it was done in the least confusing way possible, as you can very easily see the difference in decor and dress of each time line. What would have made this a bit more enjoyable for me would have been a bit of character development in the past time line, as well as a bit more romance in both time lines. But that isn't really the focus of this, it's about soul mates reaching across time and finding peace - it's about something deeper than romance. Jerry O'Connell doesn't do it for me as a romantic lead - he's got far too much comedy about his demeanour, however the character playing Lina was extremely sexy, sultry and sassy - just the kind of woman you'd picture out in the steamy bayou's of Louisiana - she did a terrific job with her character. My last thought to any potential viewers is to not expect Notebook quality romance, this is a TV Movie, and I say that with no malice intended - it should just be appreciated for what it is, and for the story it tells. You'll get romance, a bit of humour, suspense, history and a few thrills - Enjoy!","user":"bluestorm5","rank":[11,17]},{"title":"The Wheel Turns","rating":6,"date":"29 March 2009","review":"***SPOILERS*** Ghost story by Nora Roberts about the deep south that covers some 120 years and at least four generations of the New Oleans Manet family.<br><br>It's when young collage student Declan Fitzpartrick, celebrating Fat Tuesday, saw this ghostly young woman outside Manet Hall that he was determined in buying the long deserted mansion. Some eight years later and now having a very successful law practice in Boston Declan was now able to buy his dream house feeling that he had some strange and unearthly connection to it. Declan, in hiding his real intentions, plans on using it a law center for the local's in the area. It's then that Declan meets Lina Simone who's descendants once owned Manet Hall and whom he's connected to through the distant past-reincarnation-in ways he, who doesn't believe in the supernatural, could never have imagine!<br><br>The supernatural angle in the movie is a bit hard to follow in that were given two entirely different stories to what happened with Lina's great great great grandfather Lucian in the abandonment of him and is infant daughter by his wife, Lina's great great great grandmother, the former Manet Hall maid Abigail. We get most of this confusing story from Lina's Grandma Odette who seems to have supernatural powers herself in her knowing things, especially about Declan, that she has no way of coming up with.<br><br>The movie,almost by accident, really starts to heat up when Lina's junkie mom Marie Rose shows up from Huston needing quick cash, $10,000.00, to pay off her drug suppliers back in Texas. Trying to blackmail Declan, for her drug money, who has since fallen in love with her daughter-Lina-Marie Rose ends up getting into even deeper trouble, with the local sheriff, then she ever was with the drug dealers back in the Lone Star State. It's Marie Rose guilt, that lead to her drug addiction, which in fact activated the strange events that happened over 100 years ago leading to Abigail's mysterious disappearance. <br><br>What really saves the movie is the events that happened back then in the late 1890's, at Manet Hall, that somehow found their way back to the present-2009-with both Declan and Lina.****SPOILER ALERT****It's not only the difference between some 120 years but the reality in what happened back then as well as the change of identities of the major characters in the film that set up the movies unexpected, to everyone involved, as well as surprise ending!<br><br>I may take an unlimited amount of time but the \"Wheel of Life\"-Reincarnation- eventually makes amends for the mistakes made by those of us,all of humanity, who are art of it. Even if it in the end it takes as much as a dozen lifetimes for it to eventually correct them!","user":"sol-kay","rank":[16,31]}]