[{"title":"Much ado about the Morgans","rating":8,"date":"4 February 2010","review":"I've read so many critics trashing down this movie that I felt the need to come on its defense. I've seen it just a hour ago and for me it gave me what I was hoping to receive: after a tiring working day, traveling around in the rain, and not having time to lunch, I've stopped for dinner and between the Morgans and Mandela (Invictus) I went and bought a ticket for that romantic comedy. I don't understand how people can be so demanding about the genre. Everybody knows how a romantic comedy ends. It's not the story that matters and although I find Grant and Parker an unlikely match, they made me laugh and that was what I needed. \"It's so quiet here I can hear my cells dividing\". For that and a little bit more it was a pleasant experience, not so happy as Disneyland, though.","user":"pedro-lonet","rank":[67,81]},{"title":"Wyoming","rating":7,"date":"31 December 2010","review":"I really did enjoy this movie, it was predictable, yes. But which chick flick isn't? However, I stayed to see how they showed how their \"Wyoming\" was. It was fairly accurate. The actors dud pretty well were pretty good, we really do have horses, hunt, fish and some of the houses look exactly like that. There were some differences of course. In the larger cities, we don't always leave the cars unlocked but in smaller towns for sure. Friends and family are always allowed to take our truck or car. I say give the movie people a chance, maybe eventually they will film a correct Wyoming. At least this one was actually in the USA. Most of them are filmed in Canada... which looks nothing like the real Wyoming.","user":"Twlight_dreamer","rank":[16,18]},{"title":"Not Groundbreaking, But Entertaining Enough","rating":6,"date":"17 January 2010","review":"If you're expecting an original groundbreaking comedy, you're probably going to be disappointed by this film. But if you're looking for a bit of sweet entertainment, it will fit the bill. <br><br>The acting was pretty decent, and there were quite a few chuckles throughout the movie. If you're looking for much more than that, you'll probably want to pick another movie. The biggest disadvantage was that the plot was absolutely predictable. <br><br>However, I was impressed with the way it showed a couple trying to work through a very serious problem in their relationship. The romance part was fairly believable.<br><br>It's not a movie that I'm dying to see again or rushing to go out and buy, but it was an enjoyable way to spend some time. I went to see it with family, and we all more or less enjoyed it.","user":"wolflady26","rank":[43,55]}]