[{"title":"A new Martial Arts Star has emerged with a refreshing new Martial Arts Style!! Man, I love Asian Cinema!!","rating":8,"date":"18 June 2011","review":"Please check out Valen's Shadows review here: http://www.amazon.com/review/R28DSJSHY64RA2)<br><br>The above review sums it up best. I'm a Martial Arts trainee myself (Tae Kwon Do and Capoeira) and after watching this flick I feel Iko Uwais will add to the world of MA styles and techniques and become a rather recognizable star if only given a chance. A big mistake is to compare Uwais to Jaa which I see many fans of this genre do. Although its true that the films plot was very much like Ong Baks, the fighting however, was way more real than the ones done in Ong Bak. The film did not portray Uwais's role as a 'master' in Silat - it portrayed him as a 'young', 'innocent' newbie exposed to the dangers outside his village, and because he was lightly skilled in the arts of fighting and defending - he managed to stand up against the villains. It was believable in the end. Those that regard this film a lame martial arts film - are not into martial arts at all, and last but not least they don't understand it. In reality, exercising martial arts in a real upfront combat is far from appealing like depicted in any of Van Damme, Jason Statham, Scott Adkins and/or Michael J. Whites movies. This film was so realistic that it's hard for me to believe that they used any special effects or stunt-men at all in any of the fighting scenes. <br><br>I give Merentau plot 5/10 - while the fighting scenes and especially the new star an 8/10. <br><br>In other words - a great film for martial arts lovers (introduces a new style of fighting to the International audience which always is a thumbs up), while not so good for those into 'storylines' and 'acting' etc.<br><br>Watch it by removing any prejudices beforehand, don't compare it to something else, and I will guarantee you that those almost two hours of your time will not be disappointing.","user":"GoonJakesh","rank":[35,39]},{"title":"First time I've been ever in an in-theater applause...","rating":10,"date":"12 August 2009","review":"At first, looking at the way the managed the poster and all..I thought this would just be another copy-cat movie (well, we had to admit, neighboring countries cinema are way earlier in successfully creating such motion pictures)<br><br>But...<br><br>All the fighting scheme, supporting casts, location, technicalities...this movie is surely one helluva fresh breeze into Indonesian Cinema.<br><br>Last night, I was literally stunned and amazed by especially the actions and plot this movie had brought.<br><br>The spirit of Nationalism, Humanism and Martial Artistry is carried out at its best!!<br><br>Can't believe my own two hands when I clapped them together with the whole theater last night...<br><br>Surely, one step toward a better cinema for Indonesia..<br><br>Bravo!!","user":"blabberbrat","rank":[53,61]},{"title":"How this tumbles the last decade of MA movies","rating":7,"date":"17 March 2010","review":"For The Past ten years or so ever since the matrix came out and dazzle our eyes with fancy moves and dashing kicks, all MA movies tried to copy it out from small punches to the high kicks but they forgot that MA is more than CGI ,Flying and impossible jumps. Mernatu came after 25years or so dry spell from Indonesia and you might be thankful for that.<br><br>The movie plot and story simple in alota ways with subplot about life,parenthood,love and the underworld. what makes this movie so good is that the action is action no fakes or flaps, when they slug out they do slug it out, they use every kind of weapon near by, the hero get hit and hit back (that's what seems to allude others as the hero is untouchable even the Chinese and Asian movies falls in this pit recently) <br><br>In the end Merantau is A solid film, I enjoy and am sure others will enjoy it MA fan or not. I've never heard of Silat before this film but I can feel it's little more than a form of fighting rather than a way to explore one soul.","user":"amrllica","rank":[28,32]}]