[{"title":"I enjoyed this movie","rating":6,"date":"23 February 2020","review":"A novelty film, the novelty being seeing all of these great action stars together in one big action film. Unfortunately, most of them are past their prime, and it's hard to share the spotlight. The action is great, but it just isn't enough to carry the film this time. The characters and plot just aren't developed enough.","user":"MR_Heraclius","rank":[37,38]},{"title":"Sex and the city,.... for men!","rating":16,"date":"16 August 2010","review":"I laugh at many of the hate comments as what the hell did they expect? a romantic comedy? award winning performances? deep dialogues? Freudian complex character study? <br><br>common give me a break!!! from the start you should know this is all about guns,explosives and one liners from start to finish and homage to silly 80's and 90's action flicks. and this is simply exactly what you get!!<br><br>while i will never understand what most woman think so great about sex and the city( fashion? shoes? what the hell?)<br><br>so this is for men/boys who will be thrilled to see their old heroes from back in the days once more on screen kicking everybody's ass! (and no, i can appreciate intellectual and deep movies, but it often simply comes down with having the right expectations)","user":"iemand-anders1","rank":[867,1]},{"title":"Too much testosterone!","rating":13,"date":"13 August 2010","review":"Tough guys. Always going on suicidal missions. Threatened by bullets and blades. Running from explosions. Best friends waging wars. Nearly killing each other, then going to the bar later to laugh about it. Director and star, Sylvester Stallone, gets all his best men together to kick as much ass as humanly possible, allowing himself a severe beating from Steve Austin. Sly took a serious neck injury. Then he goes in front of a Comic Con audience and jokes about it. A man whose Double-\"R\" franchises, Rocky and Rambo have both been highly successful. But he keeps coming back for more pain and putting his body on the line for the sake of entertainment. There's nothing tougher than that!<br><br>The Expendables is a movie that lifts you up out of your seat, pats you on the head, gives you a lollipop then smashes you in the frickin' face! With a cast like Jason Stathum, Randy Couture, Jet Li, Mickey Rourke, Terry Crews, Dolph \"I Must Break You\" Lundgren, and cameos from Bruce Willis and Arnold Schwarzenegger, you'd think it would be one crazy mess. Surprisingly, it's more focused then you may think. Just a straight-forward action movie with a reasonable run time that sustains itself and never has a chance to feel dull. It doesn't try to be anything more than what it is.<br><br>The only negative: Some of the blood and explosions looked digital. Wish it could have been just a bit more authentic. Sometimes, there was a tad too many closeups during the fight scenes. With so many people fighting at the same time, sometimes I couldn't tell who was punching who. It didn't happen very often, but how cool would it be just for one moment to see three simultaneous fights from a super wide master shot? Never, but I can't blame them. At least let the cameras pull back and allow the choreography to do the work.<br><br>It feels nice to get my ass kicked by something I haven't seen yet. It's not Rambo. It's not Rocky. Nor is it another Die Hard or Terminator sequel. It's something fresh, yet feels like it came out of the 80's. It has the perfect blend of humor, blood, sweat, smart-ass comebacks, witty one-liners, and an overabundance of testosterone! Don't expect anything more than action, exposition, action, exposition, all with a nice cherry on top with sprinkles and grenades. And some real tough guys. We all wish we could be tough guys. But no, let's just watch'em instead.","user":"TheCinemassacre","rank":[330,492]}]