[{"title":"Not bad horror flick but Charisma makes it for me","rating":7,"date":"24 November 2012","review":"Huge Buffy/Angel fan and watched this on the Horror Channel (wow, actual horror on the Horror Channel, rare these days) largely because Charisma Carpenter is in it (just as I only watch Gossip Girl when Michelle Tractenberg is on as Georgina). Not the best film in the world but glad I watched it. I actually met Charisma at a convention a few years back (just as beautiful and charming in real life) and seeing her hairstyle in this I realise now she was in the UK filming this at the time and had just taken the weekend off to earn herself an easy $20,000 signing 2000 autographs (including my copy of Playboy with her posing nude).<br><br>The Good; really did remind me of Hammer House of Horror and a lot of the old horror anthologies you used to get. I later learned that I was spot on, this is a remake of a segment of the 1983 horror anthology 'Screamtime'. It's shocks are very good, the violence suitably nasty and a good performance from Charisma, similar to her scenes in the Angel ep 'To Shanshu in LA' where she's losing her mind. They throw a lot of sex into the mix too, not only with the cheating husband and his scantily clad bimbos but the scene where Charisma gets drug raped by his henchman (or does she? The way she grabs his hand during their sex makes you wonder if she's actually surrendered to her dark desires and become a willing participant in her own ravishment?). <br><br>The twist in the tail is a kicker, very clever and probably what attracted everyone to a remake in the first place. I had to rewatch it a couple of times before I realised that she's being tortured not by visions of what HAS taken place as everyone thought but by premonitions of what's GOING to take place. Good news for her as it means she'll no longer be driven crazy by it once it's happened and can get out of the asylum to enjoy spending her royalties, bad news for her cheating rat husband and the poor folks who moved into their house. <br><br>The Bad; The cheapness of the production shows through in many scenes. Will we ever have an American film set in the UK where they don't drive past famous landmarks such as the Houses of Parliament? (Interesting in 'Screamtime' the sub-stories were all set in Britain but framed by a overall story set in New York to give it transatlantic appeal). Some of the acting by the supporting cast is pretty rubbish, I'm not sure what Justin Hawkins of the band The Darkness was doing in this, he's not David Bowie. It's pretty obvious from the start that the husband is trying to 'Gaslight' Charisma, he may as well have 'villain' stamped on his forehead. <br><br>So all told, enjoyable film and I'm glad I watched it. 7/10","user":"Joxerlives","rank":[68,70]},{"title":"My Review Of \"Psychosis\"","rating":6,"date":"16 July 2013","review":"A serial killer unleashes his blood lust at a remote environmental-camp. Years later a horror novelist relocates to rural England and is plagued to the point of madness by horrific haunting of a massacre.<br><br>So I finally got around to watching Charisma Carpenter in \"Psychosis\". At first as it started out I thought maybe I had the wrong movie because it looked like a tradition psycho slasher flick however I was pleasantly surprised. After the story took off, the way that the film kept me constantly focused on the deceit of her husband, and constantly trying to figure out just what the film was about, it totally threw me for a loop with the ending. Brilliant execution of the story. This was not an easy script to keep cohesive and relatable. At any point the film could have fell apart with all the subtext and micro plots that seemed to flutter about in the telling of this story.<br><br>For the most part I felt I was watching a psychological thriller just a bit above Lifetime Movie abilities and constantly wondering what the beginning had to do with f*ckall in this movie. It kept me guessing and confused visually as to the characters that played out in the Macbeth styled dance of twisted tales of betrayal and deception. The cinematography was gritty and yet polished with its total control of the film by jumping from micro plot to micro plot. Is she crazy? Is she psychic? or is some people totally f*cking with her?! I just kept bouncing back. This turned out to be a really great film and you don't realize just how intricate and detailed the plot is until the last 15 minutes of the film and that is got me totally into the story and made me drop my jaw. The ending tied it all up so poignantly and perfectly. A great psychological profile of the depths of human psychosis.","user":"ASouthernHorrorFan","rank":[64,66]},{"title":"Reasonable psychological horror thriller.","rating":5,"date":"19 March 2012","review":"Psychosis is set in England &amp; starts as some Eco warrior protesters set-up a campsite in the middle of the countryside just outside London where a new motorway is going to be built, that night they are all brutally killed by some local man who goes mad. Jump forward over a decade &amp; one of the best selling crime novelists in the world Susan Golden (Charisma Carpenter) &amp; her corporate events organiser husband David (Paul Sculfor) move into a large country mansion near the fields where the murders took place, Susan has writer's block after suffering a nervous breakdown &amp; is feeling the pressure to finish her latest book &amp; feels the move away from California might be beneficial. Susan starts to experience terrifying visions, violent hallucinations, disturbing dreams along with strange unnatural events &amp; believes that her new house may be haunted. Is Susan's new home haunted? Is she having another breakdown? Are there perfectly reasonable explanations for what is happening? Or is there something much more sinister going on...<br><br>This British production was written &amp; directed by Reg Traviss &amp; is a feature length remake of the Dreamhouse segment from the British horror anthology film Screamtime (1986) which I have not seen so I cannot compare the two but I have to say that I was reasonably impressed by Psychosis &amp; didn't think it was that bad at all, it's hardly any sort of masterpiece but I felt it had enough going for it to make the 90 minutes I spent watching it worthwhile. The script has me in two minds, while I liked the basic premise &amp; I thought the final twist was particularly good &amp; fairly unexpected it's far from perfect with the chief complaint being that it's so slow &amp; it takes a very long time to get where it's going. The final twist does turn traditional expectation &amp; cliché on it's head quite effectively &amp; at the very least I was interested in where the film was going, there's a supernatural element, a hint of psychological thriller, some straight horror &amp; even a bit of a criminal subplot which all come together reasonably well. Unfortunately I found the two main character's poorly drawn &amp; I was never convinced at any time that they were a loving married couple, Susan is by far the more interesting &amp; developed character of the two. I am not sure what the creepy Peck guy is all about &amp; the scene when he first meets his new boss Susan &amp; flashes his cock at her comes out of nowhere &amp; is quite unsettling!<br><br>Set mainly in rural England this looks nice enough with an impressive looking stately home &amp; some attractive scenery. There's some nudity &amp; sex including the aforementioned cock flashing &amp; a strange scene set in a swingers party where a man is seen lying under a clear glass table looking up &amp; then a naked woman sit down on the table which presumably gives the guy a nice view! There are a few flashes of gore but they are few &amp; far between, the opening sequence features several hippies with names like Snake getting killed including an axe to the head &amp; the climax features a gory slit throat. Originally had the working title Vivid which was apparently changed because Vivid was also the name of a porn company &amp; brought about unwanted connections &amp; associations.<br><br>With a supposed budget of about $1,200,000 this had a modest budget but nowhere near as low as some films that are being made &amp; getting a wide release, the production values are good &amp; Psychosis is well made. By some strange coincidence Psychosis is actually the second Charisma Carpenter film I have seen in the past couple of days after I saw House of Bones (2011), not that I am a fan or anything but Carpenter is quite cute &amp; doesn't look like she's approaching forty. By the way, Psychosis is far better than House of Bones &amp; Carpenter puts in a much better performance but then there's far more to work with here than she had with the basic House of Bones which only really needed her to turn up on set &amp; not much else.<br><br>Psychosis is not a film for everyone, the slow pace &amp; an ending that (judging by the IMDb message board for Psychosis) not everyone seems to understand although I thought it was perfectly simple &amp; made sense within the context of the film up to that point. It comes down to personal opinion I suppose &amp; mine is that I quite liked Psychosis although I doubt I would ever want to see it again.","user":"poolandrews","rank":[57,60]}]