[{"title":"a worthy addition to a family DVD collection","rating":10,"date":"8 January 2012","review":"When reviewing a family movie, I look at it a few different ways: first, is it appropriate for my three kids; second, is it entertaining to me and my kids; and third, is there a decent storyline. I didn't see Yogi Bear in theaters and I am glad I didn't spend money, for a family of five, on tickets and concession items that go with taking my family to a big screen showing. However, I think this is one of the more appropriate and enjoyable family movies that I have seen in years. Yogi made me laugh and it was just long enough to keep my kids attention for the entire movie. The story line is basic and not to deep, which helps to keep the kids' attention. As a dad, I appreciate not having to explain everything to them and am able to enjoy the movie myself. I thought Dan Aykroyd's voice work on Yogi was over acted and made to sound like the cartoon I grew up on, but after a few scenes you get used to it. Justin Timberlake, as you would expect him to be, was funny voicing Boo Boo. Tom Cavanagh, as the abused Ranger Smith, was a clean cut likable character similar to the character he portrayed on the T.V. show ED, on which he starred. Anna Faris's part although limited, fit in the movie's overall context. T.J Miller, Nathan Corddry and Andrew Daly were entertaining fodder to Yogi's antics.<br><br>I watched this movie with my kids and I can't remember a part where at least one of them was not laughing. To me, that's all you can ask for in a family movie; no swearing, no violence, just good old fashioned Yogi Bear Fun. This is a movie that I will be buying for the collection.<br><br>Grade: A+<br><br>visit our site at www.twodudereview.com","user":"facebook-124-955845","rank":[12,14]},{"title":"Lovely and faithful to the original","rating":10,"date":"12 February 2011","review":"I am wondering why so many people come with criticism on this movie. First of all, this is a kids movie, based in a cartoon created in 1958. I watched that so many times, I am 24 years old and I still love watch it. I love the clear and simple jokes and how all the story goes around, well, I rather see Yogy Bear (movie or cartoon) than have to see aliens becoming children, robots, creatures that I never heard about. Because this is what keeps our kids on TV now days, when its not the video game. So, please, people that come to criticize, please, go find a movie where you find something interesting for yourselves. But don't come here with your awful words for something that makes so many kids laugh through decades. Its not fair, its not nice. Yogy bear will be in my memory forever and I am pleased that the movie made the best that could do.","user":"kaka-itu","rank":[23,30]},{"title":"Flawless big screen adaptation of Yogi for the fans","rating":10,"date":"13 January 2012","review":"This movie fulfilled all the expectations I had. I grew up watching dubbed Yogi Bear cartoons and I am kind of a fan of that kind of humor. Simplistic yet profound in some way, and always with a very positive attitude. That is exactly what this movie delivers. Plain old simple jokes for everybody, kids and parents.<br><br>If, like myself, you're a fan of Yogi Bear you won't be disappointed. Indeed this was the best carton to big screen adaptation I've seen. If you didn't use to watch the cartoon, then I don't know what your expectations might be, but I noticed most of the people are expecting what this movie is not.<br><br>The movie is very laid back. Photography and scenes are also very fresh and so is the cast performance. The cast fits the characters very well and gets the job done, there's no intense dramatic dialogs, but keep in mind that this is kid movie. The interaction between Yogi (and his faithful friend Booboo) and Ranger Smith is the cornerstone of Yogi Bear. The are friends and enemies at the same time. This passes a very positive message to the kids and the movie does it in a very faithful way, just like it was done in the cartoons. The other most characteristic aspect Yogi is his obsession for human food. Again, that is well featured in the movie.<br><br>A disturbing yet positive thing about this movie is the realism of the Town Mayor character's personality. It's supposed to be a caricature, but is a very accurate one.<br><br>Finally, computer generated characters and living ones work very well on this movie. Unlike most of the movies that resource to this mix, the cartoon characters blend well with the rest of the scene.<br><br>Great entertainment for all the family with some classic Yogi jokes.","user":"jsonacc","rank":[14,18]}]