[{"title":"Quality courtroom drama/thriller","rating":8,"date":"29 December 2013","review":"I think nowadays there's a shortage of these kind of movies, the last good one was The Lincoln Lawyer (which is quite similar to this one). It's the same recipe again: let's add a little personal drama (Cate could lose her daughter due to her alcoholism), an almost impossible case (female murderer from death row appeals, and Cate gets to defend her), an old case, where the character made the wrong decision, and the courtroom drama is ready.<br><br>But I think, this movie is using these \"clichés\" very well to create a good story. The main character has motivations, inner conflicts, and these are very well correlating with the main storyline and the whole message of the story. It's not something I should praise, but frankly, most movies are lacking this.<br><br>Anyway, the courtroom case is interesting, both the mood and the pace of the movie are satisfying, so I think it's quite enjoyable and also makes you think. And last, but not least, Kate Beckinsale convinced me, that she's not a bad actress, she just needs a good character to play.<br><br>If you liked Fracture or The Lincoln Lawyer, this one is for you.","user":"sjd912","rank":[73,79]},{"title":"Good tension, and enough mystery to keep you wondering until you know.","rating":8,"date":"8 February 2014","review":"Very solid courtroom drama with some nice twists, and great moments of tension. From the start you are introduced to everything in the same order, and at the same speed as our poor Cate, but as things progress you are pulled along right with her into the tapestry as it is woven around. Great cast Kate Beckinsale plays her roll on a thin knife's edge, and Nick Nolte has changed a lot over the years, but this roll really suits the man that he seems to be now. Cate is really put through many trials to learn who she really wants to be. I Enjoyed this one quite a bit, and would recommend it to any fans of the tense moments, and not knowing exactly what is going on until the characters you are following do. The real question left for you to answer for yourself is should you trust your heart, not the evidence?","user":"face-819-933726","rank":[18,19]},{"title":"Kate Beckinsale is Captivating","rating":7,"date":"29 May 2014","review":"I thought this film was fairly engrossing and intriguing, but was marred somewhat by contrivances and some non-believable plot elements.<br><br>Kate Beckinsale is quite captivating as Cate McCall, once a hot-shot and high priced attorney, but who has now been put on probation for alcohol and drug abuse. Part of her probation requires her to attend AA meetings, while another part calls for her to work pro bono for a Legal Aid type organization.<br><br>She's given the appeals case of a young woman convicted of first degree murder and serving a life without parole sentence. Cate soon begins to unravel evidence that may show that her client was framed and may indeed be innocent.<br><br>As the movie title suggests, Cate's trials are not all in the courtroom as she's struggling to gain sobriety from her addictions, as well as attempting to prevent her estranged husband from taking their young daughter to Seattle, for his new job. Additionally, a man she may have over zealously prosecuted, when she was with the DA's office years before, and who has recently be released from jail and declared innocent (after DNA testing), may be trying to stalk her.<br><br>The supporting cast is very strong here, with the great veteran actor Nick Nolte portraying Bridges, himself a defense attorney in recovery and helping Cate as her AA sponsor. Another terrific veteran actor James Cromwell plays Federal judge Jason Sumpter, whose bent for womanizing appears to be affecting his judicial decisions. Finally, Anna Anissimova is chilling and effective as Lacey Stubbs, the woman whose murder appeals' case is being handled by Cate.<br><br>I might mention there is no on screen showing of violence or sex here, but there is graphic and explicit testimony describing the above that is read during the movie.<br><br>Overall this film written and directed by Karen Moncrieff (The Dead Girl, Blue Car), as mentioned, was marred somewhat by nonsensical plot elements, but I still remained engaged throughout, and I would say it is worth a watch.","user":"larrys3","rank":[13,14]}]