[{"title":"Something Fishy Is Going On Here!","rating":10,"date":"23 August 2015","review":"I've been writing reviews for IMDb for ten years, and I think something fishy is going on here. STRAIGHT OUTTA COMPTON is getting very, very high reviews from the vast majority of IMDb reviewers -- but the nine and ten- star reviews are all getting pelted with \"negative\" marks, earning scores of \"1 out of 15\" likes.<br><br>So what's the problem? The problem is that this movie wasn't supposed to be a hit. The mass audience wasn't supposed to respond to the story of young black men facing oppression and coming out on top. The American people were not supposed to see the real truth about how their police treat minorities every day. <br><br>Quick, let's bury the good reviews! Let's spawn a phony backlash! Let's discredit Dr. Dre and Ice Cube on the basis of things they did twenty years ago. Oh, and let's all get sentimental about Eazy E because he's dead, and young black men are okay once they're dead. The dead ones are no longer scary and threatening. <br><br>The problem with this movie is that the people who made it actually dared to portray young, angry black men as heroic, not as criminals or predators. It's okay to glamorize white criminals, because Hollywood was built on that. From PUBLIC ENEMY to THE GODFATHER, white audiences have always loved to sentimentalize their own criminals. But you can't do that with black men who rap about crime, even when they aren't actually criminals themselves. When Cagney postures like a thug in some ancient piece of crap that's cool. But when black men do it today that's dangerous and irresponsible!<br><br>There are very powerful elements in this country that are terribly frightened by this movie. They're frightened because this movie gets white audiences to see young black men as something other than dangerous criminals. The scenes of NWA being roughed up by police are a terrible threat to the powerful elements in our society, who stay in power only by keeping white people scared of black men. They can't tolerate the idea of black male victims, so they instantly start a media backlash portraying the victims as criminals.<br><br>I say this is a good movie, a powerful, exciting film that presents a side of American life that is almost never seen on the screen. I know I'm not going to get many likes for this review, but what the hell. <br><br>I've got enough already.","user":"Dan1863Sickles","rank":[1,1]},{"title":"A great movie","rating":9,"date":"4 December 2016","review":"When reading other reviews about this movie, I really get frustrated due to the lack of understanding about what this movie is really about. A lot of empty reviews only giving 1 star due to \"explicit sexual content, and black men who does not respect the law\". <br><br>What people does not seem to understand is that this is a movie about the rise, and fall of the biggest rap group ever, how they evolved and what power, money, and fame can to a man (and in this case, his relationship to his friends). As much as anything, this movie really is a lot about the abuse that a lot of black males experienced from the police in the 80's (which is still a very relevant topic).<br><br>Personally I am a big fan of N.W.A, without that being the reason I am rating this movie 9/10. It is a really interesting true story about some of THE great rap artists of our generation. Great performances by actors who looks a lot like the original group, as well as Paul Giamatti. Great directing, the movie has a really nice action curve, keeping things interesting throughout the movie, and really gives the public a good insight of the life of some of the biggest stars in the world during the 80's/90's. <br><br>This is the first time i have ever written an review on IMDb, even though I have a lot of strong opinions about movies, but I really had to come to this movies defence. This is one of those movies I am really expecting to see a 8,3 star rating or something similar, and it really frustrates me to see a lot of people giving this movie unnecessary hate. GREAT MOVIE, if you like N.W.A, it is really worth your while, and if you are not, it is still worth a watch just because of the really intriguing true story that \"Straight Out Of Compton\" is.<br><br>9/10 movie<br><br>11/10 will watch again","user":"andreasi-15287","rank":[57,90]},{"title":"Don't Listen to the 1 Star Reviews","rating":10,"date":"25 August 2015","review":"Everyone one here who complains about the movie don't know what they're talking about. This movie is reality! Police brutality, growing up in the hood, the extravagant lifestyle of singers/rappers is all there. Someone complained about this being vulgar and not appropriate for kids? No duh, it's rated R. Even though it was a long movie, I didn't want it to end. You really felt what was going on in the movie. When they were angry, you were angry. When they were sad, you couldn't help but to feel that as well. Don't listen to the people complaining, and calling them \"selfish\". They're probably just upset at how the police were portrayed, which was the reality for N.W.A. The movie is amazing. Watch it. This movie was extremely enjoyable, and despite the length, it felt like it went by in the blink of an eye.","user":"nianikaila","rank":[71,125]}]