[{"title":"Horrible film, okay for the kiddies but torture for adults","rating":11,"date":"11 May 2010","review":"Some guy was giving out tickets to a test screening of this abomination to mankind, and I decided \"Eh, free film and I always liked Marmaduke\". Well, I was wrong. This film is a physically painful experience. This film consists of the BAD jokes from Marley &amp; Me. The difference is, Marley &amp; Me was touching and funny and cute. This is horrible. No more words to fit this. HORRIBLE! The horrible scene that sticks out the most is the dancing dogs sequence that features a ton of dogs dancing around to music in a park. I just saw a preview for this film on TV, and the song \"Tik Tok\" was playing during it. Tik Tok, during a dog film commercial. The writing is horrible, the acting is horrible, the effects are horrible, the jokes are horrible, the music is horrible, EVERY SINGLE LAST THING IS HORRIBLE! <br><br>I did not apply a rating to this review as 1 is too good for this.<br><br>EDIT: Under pressure from somebody, I watched the film in theaters to see if anything was different. I was wrong... IT WAS EVEN WORSE!","user":"Futurama_Fanatic","rank":[141,206]},{"title":"I liked the part where the fake dogs danced","rating":2,"date":"5 June 2010","review":"The funniest joke in the long-awaited live-action/CGI adaptation of everyone's second-least favourite comic strip Marmaduke is actually intentional, which is kind of impressive. Of course, it's not funny in the way that the filmmakers intended it to be funny so that's too bad I guess but it is actually a joke that is actually funny. Some connection had been made, through the layers of awful script and boring staging and legitimately creepy CGI. They intended to make me laugh, when they had the mean dog Bosco call out our Owen-Wilson-voiced hero in the middle of the hero's crowning moment, a big raucous \"O.C. rager\" of a party, icing our dog out with a growled, \"Marmaduke? More like Marmafake.\" And they did.<br><br>I laughed, I admit it. Marmapuke, Marmapoop, Marmadreck there's a lot of ways the screenwriters could have gone, and they chose Marmafake, whichwell dog-gone it, it doesn't even rhyme. Notes: I also laughed when the filmmakers, seeking to set the tone after Marmaduke &amp; family's big cross-country move to the O.C. from Kansas so the dad (Lee Pace) could work for a dog-food company with a mean boss (William H. Macy, for some inexplicable reason) by mixing \"California\" by Phantom Planet almost directly into \"California Love\" by 2Pac. I assume they'd spent all the soundtrack licensing money by that point, because they left out \"California\" by Belinda Carlisle and \"California\" by John Mayall and \"California\" by Joni Mitchell and \"Going back to Cali(fornia)\" by L.L. Cool J and \"Hotel California\" by the Eagles. Too bad. <br><br>Anyway Marmaduke is, we're told, a big, gangly goofy dog played by two or more real dogs in the film, that talks with a creepy CGI animated mouth. I'm pretty sure, at least, that they used more than one dog because sometimes Marmaduke has a big, dangly pair of testicles, and sometimes he doesn't, which is obviously problematic and I started thinking, while on-screen Marmaduke was having another interminable dialogue session with some other dog about something that to so brazenly, as filmmakers, use dogs with varying levels of testicle-havingness is kind of bold, almost as if they're saying \"Yeah, sometimes 'duke's got nuts and sometimes he doesn't. We don't care, because nobody will notice, and if they do notice, it's because you're a perverted weirdo who both looks at and notes dog's nuts.\" Which left me feeling vaguely insulted, and terribly aggrieved. <br><br>So Marmaduke has some friends that are dogs and some enemies, and he makes some mistakes and eventually gets sad and runs away from his family and his haughty girlfriend, voiced by Fergie from the Black-Eyed Peas, who is actually a better voice actor than she is a singer. Marmaduke then falls into a sink-hole along with another funny-looking but faithful and nice dog (voice of Emma Stone) and then or perhaps before then there is a dog-surfing championship and everything is fine, even the sub-plots about 'duke's dad's mean boss and his kid that hates soccer. <br><br>Kids might like it, but I doubt it, as aside from being creepy and awkward and really poorly plotted it's just dull. One of the first thing they teach you in screen writing school is \"show, don't tell\", that expository dialogue is a no-no and narrators all the more so. But dogs can't really act, and they don't really do anything except run around and eat sandwiches so for the film to have a narrative structure the dogs have to talk, a lot, explaining everything, and because dogs don't drive or frame houses or fold clothes they talk while just standing there looking around. It's hellaciously boring, but probably unavoidable as Marmaduke is clearly an intellectual property that fans have literally been screeching and rending their clothes to see brought to the big screen and given the ol' Hollywood treatment. <br><br>I don't have anything more to say about Marmaduke. 2/10","user":"thesubstream","rank":[67,95]},{"title":"Not as bad as 2.4","rating":5,"date":"3 September 2010","review":"I seriously think some users here on IMDb are being undeservedly harsh on this movie. What the motives are, I'm not too sure, but I can recommend some of them to watch the documentary Heckler. Now, back to subject, sorry for digressing, I've seen worse movies get higher ratings at IMDb. Now, I'm not really a fan of Owen Wilson or movies that have animals talking, but I feel this movie is at least a high 4 to low 5, in keeping in line with other movies reviewed on IMDb. I voted 5. I watched 2 movies - namely, Thomas the cool mule and that Aussie Ted movie that I would rank at 2 - 3 each, but not this movie. This movie is not brilliant or the best kiddies movie out there, but it's good, clean family fun. That's all I expected when I took my kid to watch this. And he enjoyed it. Unlike those other 2 movies I mentioned earlier.","user":"opineles","rank":[17,21]}]