[{"title":"A silly puerile comedy.","rating":8,"date":"28 November 2018","review":"No idea what people were hoping for who left 1 star reviews but this is exactly what I expected- a funny, foul-mouthed, immature and very entertaining comedy","user":"Burnsknight","rank":[104,124]},{"title":"Good giggle","rating":6,"date":"24 November 2018","review":"Certainly not 10/10 or even 1/10. It's original and good fun. A film that doesn't take itself too seriously. Which is why I'm amazed by the 1/10. Don't expect a blockbuster but a must see. A good night in and a good laugh.","user":"vdubclub","rank":[76,96]},{"title":"Seriously? What is all of the hubbub about?? It was Hilarious.","rating":8,"date":"24 August 2018","review":"I am a 64-year-old marketing guy, married to a 5th grade school teacher. Because is was available on Movie Pass, we decided to \"risk our morality\" and see this movie. Neither of us could figure out what all of the negativity and silly \"up in arms\" whining is about! We both found the movie hilarious, and far more clever than many of the other reviews are portraying.<br><br>WARNING... IT's A MUPPET MOVIE!!! If you have seen any of the other Muppet/Henson films, you know what to expect. Loads of Muppets interacting with humans...and acting silly. In this case, the jokes were raunchier, and more adult. Big whoop! But, even the crudest bits were pale in comparison to loads of other big Hollywood comedies out these days. There wasn't a single scene that was as gross and off-putting as the \"taking a dump in the manhole\" scene in \"Bridesmaids.\" The whole bit with the silly string? Hilarious...and silly. <br><br>See it. Especially if you can get a discount, or matinee price. No. Don't take kids. But, I am guessing there are tons of kids these days who wouldn't even blink at the humor. We have seen a ton of movies in the past few weeks...and we both agreed, compared to \"The Spy Who Left Me\" or \"the Meg\" this was gold.","user":"patricjmiller","rank":[322,456]}]