[{"title":"A \"must-see\" movie. Really. I'm not kidding.","rating":1,"date":"26 February 2011","review":"Don't be fooled by the rating. You have to watch \"Birdemic\" at some point.<br><br>This movies outshines \"Troll 2\" in every respect. It puts \"Plan 9 From Outer Space\" and \"The Room\" to shame. Imagine a movie that would be created solely to give film students a paper topic on how NOT to make movies. Every conceivable error has been made in making \"Birdemic.\" At first, you simply won't be able to believe that the film is not a spoof. But if you read about the film and about Nguyen, and if you take a few moments to watch the additional material on the DVD, you will soon agree that this was just a misguided effort on the entire production team's part.<br><br>The sound is the most outstanding example of sheer incompetence. The director clearly understood what Foley is, since the gunshots have all been added post-production, but I guess they just didn't have the time or money to dub the vast majority of the film after shooting. And it needs it. Badly.<br><br>The acting is uniformly terrible. Not bad. Terrible. Alan Bragh doesn't even rise to the level of fourth grade pageants. Whitney Moore is cute as a button and is aided by a bit of camel-toe in at least one scene, but she's the best of a poor lot. All the supporting cast is \"give your financial backers a small part\" bad.<br><br>If you want to explain blocking, editing, framing, sound markers, continuity, reverse shots, and other film terms to your friends, this is the film to use. None of it is done correctly.<br><br>While the CGI (and I use the term in only the broadest sense) birds are hilarious, my favorite scene is the \"retirement\" scene. I think that the word \"retirement\" is used six times in just three lines. Watch for it. It's hard to miss.<br><br>BUT...it's strangely watchable. In contrast to many bad movies, it's not boring. Consider it a train wreck that you simply can't tear your eyes from. Even the boring scenes (and there really aren't that many) have some aspect (poor sound, hilariously unrealistic dialogue, odd things going on in the background) that fascinate. You'll be giggling and poking your elbow into the side of the person beside you.<br><br>So, go rent it. Really. You won't regret it.","user":"innocuous","rank":[249,257]},{"title":"Definitely on the \"best of the worst\" list","rating":1,"date":"26 April 2011","review":"Let's be honest, if you even got as far as reading this review, then you're not looking for a good movie, so there's a good chance Birdemic is the movie for you. On the other hand, let me give you some practical advice; just start the movie at minute 47, because nothing of any real importance happens in the first half. It's entirely spent establishing an implausible relationship between a Nathalie (Whitney Moore), a hot fashion model and a Rod (Alan Bagh), computer geek. I know this sort of thing is a staple in horror and sci fi movies, but usually the nerd has some hidden charms. Rod is basically just annoying and full of himself. Also, the relationship normally develops in the context of the plot and involves at least *some* dramatic tension. In this case, they meet and she is immediately swept off her feet by his complete lack of charm and affected speech patterns. Oh yeah, he's also just landed a big business deal that will make him a millionaire. So much more Nathalie's wholesome image, the little gold digger! <br><br>Anyway, this whole process takes about 5 minutes. Where the other 40 go is a mystery. OK, they do find one dead bird on the beach. Consider yourself foreshadowed.<br><br>On second thought, start at minute 44 to catch the movie's only redeeming feature: a gratuitous slow pan of Moore in her underwear. But then *immediately* jump to minute 47 to escape the most awkward and unconvincing love scene in the history of cinema. Don't say you haven't been warned.<br><br>Then the action starts. After a night of passion, they awake to a full scale attack by badly rendered CGI birds which terrorize people and occasionally dive bomb the ground, exploding on impact. I don't mean they burst apart in a shower of bird guts; I mean they actually explode, with fire and smoke, like little Kamikazee pilots! This is never explained.<br><br>And that's pretty much it. The rest of the movie is basically spent running from these birds and occasionally fighting them off - first with coat hangers and later with the the stash of firearms and (almost) limitless ammo that one character inexplicably produces. Sometimes there's a variation on the explosion theme where the birds splatter people with something that appears to burn them like acid. <br><br>They run into a couple of people in their travels who explain this is all caused by global warming. This shameless pandering to social relevance loses any sympathy the film maker might otherwise have had. Also, I can believe that climate change might make birds aggressive, but could it really make them explode?<br><br>Just how bad an actor is Alan Bagh? Well, it should tell you something that he couldn't project any credible passion in a love scene with our scantily clad heroine. His dialog is delivered in a uniform stilted monotone, and he seems to avoid eye contact with either the camera or any of his fellow actors. In fact, even the scenes when he and Moore are walking in silence - and there are an annoyingly large number of these - are somehow not at all believable. I mean seriously, how hard is it to *walk* in a convincing manner? If I saw someone walking like that on the street, I would assume he had suffered some sort of head trauma.<br><br>Almost all of the actors are more or less equivalent to Bagh, with the arguable exception of Moore. Don't get me wrong, she's not great, but since she's the only person in the movie with any acting ability whatsoever, she comes across like Merryl Streep. Really, you find yourself longing for her speaking parts, because it's the only dialog that's doesn't literally make you cringe. Also, did I mention she's got a gratuitous underwear scene at minute 44?<br><br>A lot has been said about the poor quality of the CGI birds, but nothing can prepare you for how bad they really are. If Ed Wood had made this movie, he would have interspersed stock footage of flocks of birds with stuffed birds thrown in from off screen - and the result would have been much, much more effective!<br><br>Anyway, since they're worried about bird attacks, you would think they would, I don't know, stay indoors! By no, they're outside as much as possible. Part of this is because in the one day since the birds attacked civilization has completely crumbled, and they're forced to forage for food. <br><br>Just when you're continuing to wonder how they're going to end this this thing, the birds simply fly away, with no explanation. Huh?<br><br>Truly, a masterpiece.","user":"ejonconrad","rank":[31,31]},{"title":"The worst film made by anyone, ever, at anytime","rating":1,"date":"25 March 2010","review":"There are no words that come to mind after seeing this film. Travesty, horrific, absurd, ridiculous, and mind-numbingly stupid all come to mind but none of 'em quite describe just how awful this \"film\" really is. To see where everyone went wrong, let's break it down!<br><br>1. It takes 45 minutes until the actual plot begins to develop. By this time, the majority of viewers have fallen asleep or have taken their own lives.<br><br>2. The actor who plays Rod, Alan Bagh. He makes me miss Nicholas Cage. NO NOT THE BEES!!! AHHHH!!!<br><br>3. The birds. What do they do exactly? Nothing. The birds come down and fly directly in front of the victims face. Then they die for reasons only criminally insane director James Nguyen knows. God help us.<br><br>4. Read my parental advisory<br><br>5. \"Hey I thought I told you to stand back. These birds are contaminated\"<br><br>6. What is wrong with Rod's friend? And why can't he get a good looking girlfriend?<br><br>7. The dialogue. It's like watching a poorly translated foreign film. \"I like you and because you are pretty to me\" \"I thank you this words they make me happy\" \"Yaaaaaayyy...\"<br><br>8. This quote: \"Why would birds do something like that? Why would they just attack\" \"......I don't know\"<br><br>-------The good?<br><br>1. Thank god for Whitney Moore in lingerie. The only believable thing about this movie was that she got a job at Victoria's Secret.<br><br>And that's my review. Go see it. I guarantee you will never see a worse film.","user":"pledgerock","rank":[292,316]}]