[{"title":"Impending Doom With a Side of Honey","rating":9,"date":"21 June 2012","review":"Everyone knows about the calm that happens before the storm. In \"Seeking A Friend for the End of the World\", what's amazing is just how long that calm lasts.<br><br>Throughout the first part of this film, you can't help but wonder, as you watch, how you would react if you heard nonchalant reports on radio and TV about a 70-mile wide asteroid heading for Earth and destroying life as we know it. Would you seek refuge in a fallout shelter and hope for the best, or say \"To hell with it!\" and do all the things you couldn't do when there was established order with a purpose?<br><br>Dodge (Steve Carell) seems to find a third option no one else even tries to consider: sitting calmly and maintaining his own order as virtually everyone else is participating in an orgy or a riot. While being calm works for him as a survival instinct, it also reflects his loneliness. The more people surrounding him, the lonelier he seems.<br><br>Very similar to Bill Murray's character in \"Lost In Translation\", Carell is great at conveying so much despite doing so little. It becomes all the more fascinating when he's the only character in the movie who does not throw caution into the wind. After all, would you be this calm if the world was going to end?<br><br>Keira Knightley is Penny, a vibrant but distraught British woman who lives in the same building as Dodge. She appears one night outside his window, and is frantically crying after her realization that she can't fly back home to Great Britain to see her family. Knightley serves as a great contrast to Carell in many ways, and she is a welcome presence in this movie. And I am SO glad the film didn't try to cover her sweet British accent.<br><br>The film evolves into a sort of road-trip movie when a riot ensues outside their apartment building, and Dodge persuades Penny to drive to Somerset, Delaware because he knows someone who owns an airplane. As it turns out, Dodge also had a high school girlfriend who wrote to him a few months earlier, before his wife left him.<br><br>Sounds like a familiar journey from another movie? Well, \"Seeking A Friend For The End of the World\" takes you in one direction you think you're going, and then often makes a sharp left when you least expect it. The movie is also funnier than the title suggests, has some startling moments I never saw coming nor expected, and keeps you watching for many reasons.<br><br>Is there a love story between Dodge and Penny? Like the recent \"Salmon Fishing In The Yemen\" (2012), you find yourself unsure if the two main characters should fall in love, or if there is at least a little attraction, or if it really makes any difference.<br><br>There are other things you wonder while watching this movie. Most notably, is the world really going to end? Everyone in this movie seems to think so. While it's fascinating to see how different characters react to the news, you keep watching because you want to see if it really does. It can't be a dream or a delusion, can it?<br><br>It's great that in a summer season of action flicks and disaster films, there's one film that takes its time showing how ordinary people react to extraordinary things. There's an asteroid headed towards Earth, but there are no explosions, deaths, astronauts, superheroes, or even (surprisingly) camera shots of the sky in this movie whatsoever. Moviegoers who hated \"Armageddon\" (1998) will be relieved, I'm sure.<br><br>Besides Carell and Knightley, other fairly well-known actors show up so briefly, their appearances could practically be considered cameos. Still, every performance by everyone involved stays with you to the point where you probably pinpoint one character and say, \"Yeah, I'd probably be THAT guy given the circumstances\". As the doomsday clock counts down and the movie ends, you may find yourself reevaluating what you want the last image in your mind to be before it's all over.","user":"D_Burke","rank":[214,268]},{"title":"Beautiful. Left Me Speechless and Overwhelmed.","rating":10,"date":"24 March 2013","review":"I do not even know where to begin, so I'm just going to head into this review full steam ahead.<br><br>I sat staring at my iO screen for 20 minutes trying to decide between watching this - which I hadn't really heard any review from - and Celeste &amp; Jesse Forever. Instinctively, I went with this; I clicked Order and hoped for the best.<br><br>This was by far the most moving film I have ever seen. To give you a quick synopsis, our protagonist, Dodge, teams up with the overly optimistic and happy-go-lucky Penny, a fellow apartment complex resident, to travel to his high school sweetheart's house to tie loose ends before the world comes to an apocalyptic close.<br><br>Steve Carell truly nailed his performance. The audience watches his random heartbreak, internal conflict, and journey to love. Other reviewers have stated the film was \"dull\" and \"weak\" - but those reviewers also admit to fast forwarding and getting up. If they were smart, they would've waited, because that is all part of the film's magic. As a viewer, I felt like in the first 15 minutes I was at a standstill. I felt like I didn't even know what I was watching, almost uncomfortable. I can now say that was done intentionally. How would we respond to hearing about the world, that we live in, ending in our near future? With dullness, stillness, and discomfort. The weakness is really a success on behalf of the filmmakers; the viewer is a character in this madness. Steve Carell strengthens this to new extremes.<br><br>Keira Knightley is stunning. In physicality, but more importantly, in her character, Penny. I was instantly in love with this free willed, uppity character who says no to nothing but stands for everything good in this world: risk, love, spontaneity. Her mixed conflict juggling guilt, confusion, and optimism is portrayed impeccably through Keira's teary-eyed, heartfelt performance is truly astonishing; her ability to make the viewer feel as if they know her and relate to her is so beautiful and overwhelming. Again, the filmmakers did a wonderful job making the viewer feel as in love with her as other characters in the story are. <br><br>With these two spot-on, PERFECTLY cast performances, and a phenomenal vintage soundtrack to top it all off, I was left crying multiple times. I kid you not, I am a 16 year old male, cries at basically nothing, and sobbed the last ten minutes of the movie and countless times throughout. I highly recommend this to anyone who understands the underlying beauty in our hectic lives, and appreciates the time to take a step back and realize that life is short - and we are the lucky ones. Love carries us through life, and it is in that state-of-being where we are most in touch with humanity.<br><br>Moved. Touched. Overwhelmed. I will never forget watching this movie for the first time.<br><br>What would you do with the rest of your life if you had limited time left? After seeing this, I will make every second count.","user":"claymation8","rank":[113,144]},{"title":"Watch this before it's too late","rating":9,"date":"7 October 2012","review":"It's rare that I rate a movie this highly. No doubt many will disagree with this rating and I admit to having some doubts myself. I had to ignore the fact that Keira Knightly was miscast in the role of Dodge's (Steve Carell) friend, Penny. As I've mentioned in other reviews, she always seems to be overacting. This may be a personal thing as I'm sure others are enthralled by her work. Martin Sheen is not convincing as Dodge's father. The plot has some problematic moments.<br><br>These negatives aside, this is a movie driven by a compelling idea: What would you do if you had only three weeks to live? Well, some resort to taking drugs, others to sex, and others to suicide. Some persevere with dignity to the end. The absurdity of life and the value of death is highlighted, as strange as this may sound. Death puts life into its proper perspective. On the surface, this film has many elements of a romantic comedy and some may dismiss it as such. But look past the surface of this film and you will begin to appreciate it much more.<br><br>Of course, we are all facing the end of our own worlds, maybe not in three weeks or en masse, as is portrayed here, but through our individual mortality. Would you continue to work out, visit your dentist, or mow the lawn if you knew it was all soon coming to an end? Basically, the film looks at what in life is truly important. What is worth living for? Who would you want to spend those last moments with and why aren't you spending time with them now? Because this movie brings such existential topics into focus, I think it deserves an above average rating. Don't think of this as a grim, realistic look at life. There is a good deal of humor here. You'll have a few laughs, which, I believe, help to highlight the film's more serious elements.<br><br>My opinion of Steve Carrell has been on the rise ever since he starred in Dan in Real Life. In Seeking a Friend for the End of the World, he plays the role of a down and out loser to perfection.<br><br>In short, if you are seeking a movie to watch with a friend, this should be your choice. You'll have much to discuss afterwards. It may even make you re-evaluate what you have accepted as being important. Time is, after all, running out.","user":"SteveMierzejewski","rank":[140,184]}]