[{"title":"Not fast and furious. It's low and slow.","rating":8,"date":"8 May 2017","review":"\"Lowriders\" is a solid redemption drama wrapped in a celebration of a car culture that frankly doesn't often get the respect and attention it deserves. With all the fast and furious stuff going on out there, it's a breath of fresh air to just appreciate the art of the low and slow.<br><br>Directed by Ricardo de Montreuil, set against the backdrop of the lowrider society in Los Angeles, Southern California, Gabriel Chavarria plays a talented young graffiti artist, Danny, who's caught between the lowrider world inhabited by his old school father (Demian Bichir) and his ex-con brother (Theo Rossi). Co-starring Eva Longoria, Melissa Benoist, and Tony Revolori.<br><br>Last year you had a look at L.A. from the much vibrant musical point of view through \"La La Land,\" well, \"Lowriders\" gives you a different angle, and not the stereotypical gang turf war either. It's a clash between father and sons, about sins of the past and what they define as self-expression. I think the story blends the car culture and the family drama really well, the mix of those two makes sense in this film, and it speaks about the characters as well. There's plenty of conflict to go around, well-performed by all the actors involved.<br><br>You don't have to come from that background or from that neighborhood or you don't necessarily even have to know much about cars to be able to relate to \"Lowriders.\" It's one of those situations in which you can always tell beauty when you see one, whatever shapes and sizes, and so that's the kind of art that \"Lowriders\" offers. A lot of people look down on graffities, some of their reasons may be justified, but a lot of the times they also don't take the time to truly look at the work and try to understand what it's trying to say. Street artists may not have the same reputation that gallery or exhibit artists do but that kind of freedom is what \"Lowriders\" puts a spotlight on. It's a film that does the culture justice.<br><br>-- Rama's Screen --","user":"Ramascreen","rank":[21,33]},{"title":"\"Lowriders\" is engaging, interesting and entertaining.","rating":6,"date":"15 May 2017","review":"Lowrider is a term that refers to a certain type of low-riding car and the people who drive them. Lowrider cars have been modified with hydraulics so they can be raised or lowered by the flick of a switch and many of the cars can also bounce. They also have wire-spoke wheels, whitewall tires and detailed unique designs painted on them. Lowrider culture developed among the Mexican-American community in Los Angeles in the years following World War II. The hydraulic modifications came about after California passed a law making it illegal for any part of a car to be lower than the bottom of its wheel rims. The ability to adjust the height of the chassis allows the driver to skirt the law by raising the car when law enforcement is in the area and lowering it again after the danger of getting the lowrider impounded has passed. The painted designs are also a statement of individuality, celebrating Hispanic culture. These various aspects of the East L.A. car culture are found throughout the drama \"Lowriders\" (PG-13, 1:39) – along with the emotional story of one family being pulled apart by conflicting values.<br><br>Danny (Gabriel Chavarria) is a Mexican-American high school senior who's torn between his priorities and those of his father, Miguel (Demián Bichir). Miguel is a widower and recovering alcoholic who owns a custom garage and wants nothing more than to win an annual lowrider competition with his 1961 Chevy Impala, \"Green Poison\", which sports a hood design painted by Miguel's father. Danny considers himself an artist, but his canvases have all been L.A. bridges and buildings. After Danny gets arrested for a particularly dangerous graffiti stunt, Miguel is beyond disappointed, telling Danny that he's turning out just like his brother, Francisco (Theo Rossi), who people call \"Ghost\" and who is spending time in prison.<br><br>When Ghost is released from prison, he angers his father by taking Green Poison cruising – with Danny along for the ride – and announces that he's competing against Miguel in the upcoming lowrider competition. As the tension between Miguel and his older son rises, Danny continues fighting for his right to make his art. He starts dating a photographer named Lorelai (Melissa Benoist), who helps Danny get his art noticed, but not the way that he wants. The result of that lowrider competition accelerates the escalation of tensions between Miguel and Ghost, putting Danny in the middle, and leading to some serious consequences. In the midst of all this, a local police detective (Cress Williams) is repeatedly involved in the family's turmoil, Danny's best friend, Chuy (Tony Revolori), gets caught up in this whole mess and Danny's new stepmother, Gloria (Eva Longoria), is fighting to keep the family together.<br><br>\"Lowriders\" is engaging, interesting and entertaining. Although the details differ from family to family, the film's drama is something to which most people can relate. The script, by several writers, including Elgin James (\"Little Birds\") and Cheo Hodari Coker (\"Notorious\"), sometimes has the various family members take some nonsensical actions, but the strong cast (especially Bichir and Rossi) helps sell the story. And, thankfully, this is one movie about Mexican-Americans that has nothing to do with drugs (except for some alcohol). For many Movie Fans, the main attraction will be the vehicles of the film's title. Director Ricardo de Montreuil (helming his first American feature) celebrates lowrider culture without deifying it. The movie's balance makes it easy to enjoy seeing and learning about these rolling murals, which really are mechanical marvels, along with Danny's struggle for acceptance and the poignant family drama at the film's heart. \"B\"","user":"dave-mcclain","rank":[13,19]},{"title":"Not the movie you think it's going to be.","rating":8,"date":"19 November 2017","review":"Lowriders has a couple of things working against it right off the bat. First it's a Blumhouse release, which makes one think horror film. Two, the name implies it's a movie about cars, in the vein of The Fast and The Furious franchise. Lowriders is neither of these things.<br><br>What the movie is, is a family drama centred on a Mexican-American family in LA. The father owns a car shop, and is prepping to enter into a car competition for low-riding cars. These lowriders are portrayed as part of the culture down there, though I don't know enough to know how true that is.<br><br>Daniel, the main character in the movie, is a teen trying to find his way. He's a street artist (graffiti), but gets no recognition. His older brother, Francisco a.k.a Ghost just got out of jail, and recruits Daniel away from the father.<br><br>These different tensions are well played out and acted, and it's easy to get invested in the characters. Knowledge of the culture isn't necessary to find the good in the movie.","user":"mancinibrown","rank":[4,5]}]