[{"title":"A deep touching picture","rating":8,"date":"11 March 2011","review":"I have just been invited to watch the movie during a screening presentation in Rome and after several hours I'm still deeply touched. It's a film that makes you think, reflect. It's not an easy action movie, and in that sense, some maybe would get disappointed if they are thinking of it as another war movie. It's a drama that despite the cruel events that portraits opens your heart to hope and puts you on the quest for transcendence. As \"The Mission\", this new Joffe's film, uses the \"paralel\" life of two friends to show how difficult it is to make a fair decision while you are under stressful circumstances. Some people may judge this film as the Opus Dei answer to the Da Vinci Code attacks, and in a certain sense it is, but the film is not a propaganda movie, but a deep meditation from an agnostic point of view of the sense of life.","user":"sergiotapia","rank":[77,105]},{"title":"Good and deep, really interesting, maybe not a classic, but must seen!","rating":9,"date":"11 April 2011","review":"Roland Joffe wakes up after two decades of bad cinema. Like a the phoenix bird he come again with interesting cinema.<br><br>The film is technically quite interesting. It starts with a short sequence that shows the deepest Spanish soul in a lost village near France. This sequence has an impeccable cut and setting, and works as introduction of the characters and situation. In my opinion the best sequence (speaking as cinema \"freak\"). The best thing in the film is the photography, which takes the viewer 1920s Spain.<br><br>The script is also quite interesting. Although the main character in the film is the Spanish priest Josemaria Escriva, he is not the protagonist of the story. This makes the film more interesting, as it plays with 2 people weighting their importance by their personality and their role in the story. Josemaria is the alter-ego Manolo, both are attractive persons that keep the attention of the viewer, which at the end should judge. Another success of the script is the usage of time. The main story happens in 1920 and 1930, but it is told as memories in the 80s, when the son of Manolo has to write an article about Josemaria, which is going to be canonized by the Catholic Church. Robert discovers that his father came from the same little village of Josemaria, and asks to his father about him. The answer give the title to the film \"there be dragons\".<br><br>Now let's go with the dragons. The makers knew that the film was going to be surrounded by dragons. Opus Dei, communism, revolution, Catholics and the Spanish Civil War... this film has all the ingredients to be a big scandal. The film has the collaboration of some members of the Opus Dei (at least 2 of the producers are) and the organization has given information and access to the documentation about Josemaria. The film also shows a period of the Spanish history which still is a taboo in this country. In Spain, still today, there are mainly 2 opposite streams: pro-franquists and pro-republicans. The film success- in my opinion- to show that as in any war there were no good and bads (which has shocked the Spanish population), that in both sides there were good and bad people, good goals but bad means. My personal opinion is that it success to show the real left of Spain, breaking with the franquist propaganda of the left as communist criminals, but also breaking the view given to Americans by Hemingway that the left in Spain was the advocate of Democracy and freedom. Maybe the film fails to show the right-side of the war, but nevertheless is- in my opinion- the best representation of the civil war that I have seen in art. <br><br>Only a non-Spanish could make such a good representation of the Civil War, and only a person like Joffe could dive enough to make such a good representation. I like Joffe because he takes a field and goes deep enough to explain the reasons. It was shown in the Mission and in Killing Fields, and here we are in front of the same Joffe. I admire him because he forgets his own point of view (I have read that he is agnostic), investigates and tries to find the keystone. Some people has said that this film is the answer of the Opus to the Da Vinci Code well I think it comes to late, because the DVC was released 5 or 6 years ago. On the other hand, if it is an answer, it works well. The DVC shows us a people that, in my opinion, is impossible that are real I don't know but I don't believe that in the World are people so crazy for example they are shown flagellating themselves (which is also shown in There Be Dragons), but in the DVC they are doing so while they know that Christ wasn't God! It makes no sense, no one does something like that to offer to a God, that they know is not God at all As this the film is full of incoherences on the other hand There Be Dragons shows both what they do (not the myth) and also explains why In my opinion this is what makes the difference between good and bad cinema (when your idea is to speak about real things). <br><br>I would also like to answer to some of the critics: please speak about the film, because people wants to know about it. If we would like to know about the Opus we could go to their web page, or just write Opus in Google. Here we come to speak about cinema. Also someone said that the rating is not trustful because all the Opus Dei's people will vote 10 well they rate 10 because they liked it as a 10, and have the same right as the people that are not members of the association IMDb works democratically, so their vote counts as well. The only problem would be if they vote without having watched the film, if the organization has commanded to vote in IMDb but well there are some 150 high votes, it doesn't seem to be the result of some strange \"conspiracy\" Well, my final advice is: you will hear a lot about the film. Some people will speak really well about it, some really bad, and some will just speak about the Civil War or the Opus Dei with this film is gonna be really difficult to know if it is good or not so I suggest you to watch it and make your own opinion. It maybe not one of the best films in the last 10 years, but nevertheless it's a must watch.","user":"jorgesro","rank":[59,84]},{"title":"Movie left me thinking...","rating":10,"date":"24 March 2011","review":"I saw a screening of the movie a few weeks ago... to date, it continues to come back to me through out the day. It has left me thinking so much about my life, relationships, Love, my beliefs, my work, etc. There are so many layers to this movie... It's not a movie for the superficial or those who just want to be entertained over popcorn and then move on to their next thriller. It's a deep movie that engages the mind and heart, hopefully engaging the viewer to think of the morally pivotal moments in life and the choices made. I think there is a little bit of a Manolo in each of our lives... something each one of us needs to come to terns with. Hopefully, as with Manolo, there is a Josemaria in each of our paths. I highly recommend this movie! It's a movie you can't just see once!","user":"treosgsears","rank":[58,85]}]