[{"title":"An overly familiar plot....presented in a fresh and delightful manner","rating":7,"date":"28 December 2008","review":"Christmas-themed romantic comedies seem to be all the rage right now. You can watch about a hundred of these movies every December and the plots are generally the same: attractive single father (or mother) with steady, stable (boring) boyfriend (girlfriend) and cute kid(s) meets seemingly inappropriate man(woman) who works their way into their heart as well as instills the \"true\" meaning of Christmas. There are a few variations (sometimes Santa gets involved, sometimes there is some kind of magical element). The variation I like the least involves the children doing the matchmaking (Ugh! What child of any age has ANY interest in his or her parent's love life?) What does \"The Most Wonderful Time Of The Year\" offer? Nothing new EXCEPT sharp writing, actual comedy, and Henry Winkler. <br><br>Yes! Winkler really makes this movie with his funny, warm portrayal of our heroine's interfering uncle Ralph from Brooklyn. This is the first comedy I've seen him in in a long time, and he really does shine in these kinds of pictures.<br><br>However, Brooke Burns and Warren Christie are also very fun to watch as the mismatched couple. I liked that they didn't make Burns a Scrooge who hates Christmas. She is simply a busy woman who loves her son and wants Christmas to be special. And in her desire to do so, has lost sight of what Christmas should be. And kudos to Connor Christopher Levins who gives a boy with some mature habits (his penchant for organization) some very real childlike desires (his wish to believe in Santa even when logic dictates he shouldn't).<br><br>The plot moves along very briskly and the movie seems to end all too soon. Would that we could all be neighbors to such warm, funny and attractive people! There's even a good message about how we need to stopping stressing about Christmas.<br><br>My favorites quote (from Uncle Ralph): \"When it comes to life, she's dumber than a bag of barber hair!\"","user":"gee-15","rank":[34,36]},{"title":"Very cute movie.","rating":16,"date":"16 November 2010","review":"I am a sucker for Christmas movies. A Christmas Story, Home Alone, all of the old classics, I just adore them. They just get me in the mood for family, relaxation, and of course, the TRUE meaning of Christmas. This movie was no exception. I caught it for the first time December 09 during our first of five blizzards last year. I thoroughly enjoyed it. It was funny, charming, good leads, a cute kid, a decent story, and Henry Winkler. His Uncle Ralph was great. I was able to catch it from the beginning this time, so I enjoyed it even more. It aired on Hallmark on Sunday and I plan on keeping it on my DVR through the season.","user":"CranberriAppl","rank":[12,12]},{"title":"A new addition to my annual list of favorites!","rating":9,"date":"16 December 2008","review":"This movie is for you if you like pure romantic fluff in a Christmas setting. I personally love these type of movies so I loved this one. It's complete escapism for me but I'm also a romantic at heart. This one will definitely go in to my annual rotation and, if it does come out on video, I'll be purchasing it.<br><br>With these type of movies, the romantic leads don't always have chemistry but Brooke Burns and Warren Christie have boatloads of it. Of course, it doesn't hurt that Warren is one of the best looking men I've seen in a while :) The story is cute and uncomplicated - The Uncle of an impossibly beautiful single mom (Jen) shares a flight with an impossibly beautiful guy (Morgan) in his 30's who can't seem to settle down in one place (read: very full Passport). Several snow storms and canceled flights later, the Uncle convinces his niece to allow the \"stranger\" to stay with them \"for just one night\" until the airport re-opens. One night turns in to 2, etc, due to some finagling by the uncle who is convinced that Morgan is good for his niece. He is considerate, kind, helpful with household chores, and is wonderful with her son. He really helps Jen to find the \"Christmas Spirit\" so to speak. Not helping matters is that Jen has a boyfriend who is a self-centered jerk complete with $800 shoes and completely stuck-up parents. He is awful with her son and is responsible for the plot point that eventually drives Morgan and Jen together.<br><br>Yes, it's predictable. Yes, it's \"fluffy\". But, in all reality, that's what makes it an enjoyable movie for me. I love romance movies anyway and I really love those that are set during Christmas. If you feel the same way, and aren't looking for anything more out of it, you will love this movie.","user":"cam3150","rank":[41,47]}]