[{"title":"A Fine Little Chick Flick","rating":8,"date":"30 April 2012","review":"Oh yes, this is a chick-flick. One that is a proper showcase to prove Zac Efron has grown up to be a heck of a hunk! Also, you can never, ever find anything to fault with any performance turned in by Blythe Danner. She has been perfect in any role I've ever seen her in, this one is no exception. I have to say that logic does step in and you want, desperately, to say, \"Oh for goodness sake, just do what you came to do!\" But if that should have happened, it would have ended up a short movie, indeed. There is enough action, romance, gentle humor, wonderful Louisiana scenery, good people, bad people, decent story-line, fine acting.it's a pretty good movie. Nothing earth-shattering or Oscar-worthy happens here, perhaps, but it's a film I'd recommend and one I enjoyed watching.","user":"patsworld","rank":[73,88]},{"title":"Sweet and Dramatic Romance","rating":7,"date":"24 September 2012","review":"In Iraq, the marine Sergeant Logan (Zac Efron) finds the photo of a young woman with the message \"Keep Safe X\" on the back in the debris of a construction and he keeps it in his pocket. His action saves his life from a mortar fire and he believes that the girl is his guard angel that protects him.<br><br>When he returns to Colorado, he has difficulties to adjust to the civilian life with his sister's family and he decides to seek out the woman. Logan researches the landscape and finds that the place is Hamden, in Louisiana, and he walks with his dog Zeus to Hamden. <br><br>He discovers that the woman is Beth Green (Taylor Schilling), who is the owner of the Green Kennels with her grandmother Ellie (Blythe Danner). When Logan meets Beth, he is unable to tell the reason why he had traveled to Hamden. She assumes that he wants a job that she had advertised and Ellis gives the job to Logan. Soon Logan befriends Beth's son Ben (Riley Thomas Stewart) and becomes close to the family. But her former husband, Sheriff Keith Clayton (Jay R. Ferguson) does not want to make Logan's life easy.<br><br>\"The Lucky One\" is a sweet and dramatic romance, with pleasant characters. The director Scott Hicks explores the beautiful landscapes with a wonderful cinematography. The plot is very simple and predictable, but the chemistry among Zac Efron, Taylor Schilling, Blythe Danner and the boy Riley Thomas Stewart makes the film worth. My vote is seven.<br><br>Title (Brazil): \"Um Homem de Sorte\" (\"A Lucky Man\")","user":"claudio_carvalho","rank":[30,37]},{"title":"Nothing special","rating":6,"date":"25 April 2012","review":"There seems to be a consistent trend in the movies based on Nicholas Sparks' romance novels. They all contain sappy clichés and a lack of substance. There are two main elements that are repetitive in these novels: the relationship between two soul mates and the sickness/death of a loved one. From what I've heard, the books are exceptional, however, the movies always fall short.<br><br>Logan (Zac Efron) is a marine who serves three tours in Iraq. During the war, he happens to find a photograph of a beautiful girl and \"keep safe\" is written on the back. Directly after he picks it up, there is an explosion right where he had been standing before he found the picture. Logan asks around, desperately trying to find whose picture it is, but nobody claims it.<br><br>Now that he has the picture in his possession, he is invincible and his luck in the treacherous circumstances of war is incredible. After surviving his three tours, Logan is determined to find the girl in the picture to personally thank her for the good luck she brought him. He recognizes a tower in the picture and walks with his German shepherd, Zeus, from Colorado all the way to Louisiana.<br><br>Of course, Logan and the woman, Beth (Taylor Schilling), fall deeply in love, but struggle through the conflicts that arise. Sadly, most of this movie is revealed in the trailer, which seems to happen quite often these days.<br><br>Zac Efron does a decent job playing the character of Logan, however, he just can't pull off the tough-guy look that is essential in this film. He will always be remembered as Troy Bolton from \"High School Musical\". In any case, this is a tear-jerking, cheesy movie that most teenage girls would enjoy. It's not terrible, yet nothing special. I give \"The Lucky One\" a 6 out of 10.","user":"kgmarra","rank":[51,67]}]