[{"title":"A lot better than I thought.","rating":7,"date":"14 February 2020","review":"Jack the Giant Slayer is a hit and miss for the majority of this film it provides all the classic clichés and parts that we would see in a well known children's fairytale and it provides a fair bit of the usual good special effects and action sequences but outside that there isn't that much good about it","user":"MR_Heraclius","rank":[39,40]},{"title":"A film your children can watch","rating":7,"date":"1 June 2013","review":"Unlike many of Hollywood's reimaginings of fairy tales, this film is actually decent. One can let children watch this in the same manner our grandparents were reading the original stories. It has morals, it is pretty, actors play well and, most of all, it is not condescendingly stupid. Instead, one can actually enjoy this on almost all levels.<br><br>It was funny to see actors Ewan McGregor and Ewen Bremner play in a film together again (Rents and Spud), but they had no real interaction. Nicholas Hoult was OK as the hero of the story and Stanley Tucci, as usual, a great villain. The one that was rather disappointing was the princess, clearly a role that was not really thought out much more than \"cute damsel in distress, ready for the rescue\". Her father wasn't much either, but at least he had lines. Also, for a movie \"made in USA\" a great many English actors. Even the story was set in England, as we see in the end.<br><br>Bottom line: while not the best movie ever, it was certainly an entertaining blockbuster that retained a lot of the feel and plot of the original fairy tale. It also manages to have an insane body count without actually showing any blood. The US rating system is idiotic for sure. Anyway, the movie was fun. I can recommend it for an easy watch.","user":"siderite","rank":[58,69]},{"title":"Family Faire","rating":7,"date":"2 March 2013","review":"It's pretty much a guarantee that if you grew up with fairy tales, you would certainly know the story of Jack and The Beanstalk. I know I have; when I was a kid, this story was everywhere. I saw it played out by Mickey Mouse in the \"Fun and Fancy Free,\" by Snoopy in \"The Charlie Brown and Snoopy Show,\" and by Bugs Bunny in \"Jack Wabbit and The Beanstalk.\" The tale is a timeless child's fantasy story, and for that alone, this movie mostly succeeds.<br><br>After the opening credits, the film opens with an introduction of our two main characters: Jack (played by Nicholas Hoult, fresh off his role in last month's \"Warm Bodies\") and princess Isabelle (played by Elanor Tomlinson). Just like in the original fairy tale, Jack is a poor farm hand who is tricked into trading valuable livestock (in this movie it's a horse rather than a cow) for supposed \"magic beans.\" Princess Isabelle, however is pretty much the textbook definition of a Disney princess. Her mother is dead, her father is an over-protective king who wants her to marry someone she doesn't like, she's tired of her boring life in the palace and dreams of adventure. When I first came across this character, I immediately planned on chastising her as extremely clichéd in this review. However, once I began watching this in the context of a kids movie, I found this to be much more tolerable. Though in a 2013-released film, it still feels kind of dated.<br><br>Those expecting another \"Hansel and Gretel: Witch Hunters\" will be disappointed. This movie is pretty family-friendly overall and has a light hearted attitude throughout. Despite this film's hefty body count, the characters consistently joke around and get themselves into shenanigans. It could very well be irritating to those expecting a more mature fantasy based on the rating and advertising, as it does admittedly feel too silly at times. However, as a family film, the combination of violence and silliness makes it somewhat a fusion of the family films of the 80's and 90's respectively.<br><br>The rest of the characters are decently developed, including the sinister Lord Roderick (played by Stanley Tucci) and the noble knight Elmont (played by Ewan McGreggor). No character was given that much development, which I actually didn't really mind. I knew enough about each character, and in a fast-paced fairy tale like this, keeping the plot moving and interesting were the most important aspects.<br><br>The giants were pretty interesting too. In a way, they reminded me of the trolls in last year's \"The Hobbit: an Unexpected Journey,\" as they are excessively gross, uncivilized and high-tempered. I'm certain that kids will get a laugh out of their flatulent, booger-eating ways. I was initially concerned that this film would just portray them as unstoppable villains with no personality. Instead, the film fleshes them out a bit and gives them a motive for their actions. I certainly wouldn't mind a prequel film giving more meat to their hatred for mankind.<br><br>The cast gives their all, especially Nicholas Hoult. Here he brings to Jack the same charm and timidity he gave to R in \"Warm Bodies.\" I feel that he he has the capability and likability to carry a movie as the lead role, and I look forward to his future endeavors next year.<br><br>\"Jack The Giant Slayer\" will reasonably divide critics and audiences, but if I had kids, I would have no problem taking them to see this. It's a fun little adventure that kids and open-minded adults will get a kick out of.","user":"didonatope","rank":[111,140]}]