[{"title":"Dead Film Walking more like...","rating":4,"date":"18 November 2009","review":"'Dead Man Running' sees the cinematic Cockney wide boys Tamer Hassan and Danny Dyer join together for yet another jolly boys outing on the big screen. Except this time instead of playing raging football hooligans destroying East London one shop window at a time, they are instead pushed into the world of the British Gangster flick. Which sounds like potential entertainment, but it really isn't. It'll help you fill an hour and thirty minutes of free time, but you won't be rushing to see it again at the Cinema, or out to buy the DVD, or see to it on pay-television...<br><br>The opening scene of the film shows that the recession has had far and wide reaching consequences across the economic board as the underworld boss Mr Thigo (Curtis '50' Jackson) decides to draw in every penny from all the outstanding loans he is currently owed. While Nick (Hassan) is the unfortunate customer who is going to be made an example of by Thigo to make sure everybody pays up promptly and without hassle – Barclays Banking this is not. Nick is given twenty-four hours to acquire the hundred grand he owes Thigo otherwise he and his mother (Brenda Blethyn) will be sleeping with the fishes. Cue a frantic race across London with his business partner and working-class friend Bing (Danny Dyer) in tow as they attempt various different activities while trying to raise the debt and stay alive.<br><br>Hassan and Dyer play the typical characters you have seen them time and time again, and it is now becoming a little annoying as well as entirely predictable and boring. Nick is a former 'hardman' who was a resident at Her Majesty's service before taking the legal and law-abiding route so he could care for his family. While Bing is his right-hand man who is willing to do almost anything to help Nick obtain the £100,000 that he owes. Yet there is one gleaming performance in this stiff, wooden cast which is that of veteran British actress Brenda Blethyn who plays Nick's caring, soft, yet incredibly versatile mother who provides not only the biggest laugh of the film, but also the tensest scene as we uncover a secret she has kept buried under her blanket.<br><br>I was never expecting a brilliant film from Alex De Rakoff's British crime flick 'Dead Man Running', but I was expecting more considering the decent cast it contains. It fails to harbour the primarily British cast's potential and instead delivers a predictable narrative coupled with a terribly clichéd script. The biggest problem however is the fact that despite being evenly and well paced, the film has nothing which will keep an audience's attention for longer than five minutes.","user":"the_rattlesnake25","rank":[31,46]},{"title":"Very average Brit gangster flick","rating":5,"date":"4 November 2009","review":"I wasn't expecting great things from this movie and I wasn't disappointed. The plot is very two-dimensional but done reasonably well, the film is well-paced and directed competently with a fair bit going on in its 90-ish minute runtime. It's never going to trouble the Academy but it pretty much does what it says on the tin as a run-of-the-mill UK gangster flick.<br><br>The performances leave a little bit to be desired, however. Danny Dyer, who now seems hopelessly typecast, really phones in his performance and it would be nice to see him given a role which might stretch him. If he keeps taking roles like this one, though, it ain't going to happen. Here Dyer is reunited with his co-star from 'The Business' (ten times the film that 'Dead Man Running' is, by the way) Tamer Hassan. Hassan, again, means well but again he's given very little to work with. It's a shame as both he and Dyer have, I feel, more to offer than this formulaic 'good-guys-gone-a-little-bad' buddy-buddy nonsense.<br><br>The chief baddie is 'played' by Curtis 'fifty pence' Jackson and it's not good, people. I'm not a fan of his music but he undeniably has talent, just not on the boards. His performance is borderline embarrassing but thankfully he doesn't take up much screen time.<br><br>Not a great movie, not a disaster either. Just average.<br><br>I did chuckle when I saw the name of footballer Rio Ferdinand in the credits as an 'executive producer' and the Jar-Jar Binks lookalike even gets a dedicated (and very clunky) line in the script. Rio's got his insipid 'Number 5' online magazine going on and now fancies himself as a mover and shaker in the film world but someone really ought to take the big man to one side and quietly explain to him that he is not in any way 'cool', nor will he ever be. Stick to football, Rio, you're quite good at that (recent performances aside).","user":"Tin Tin-3","rank":[24,36]},{"title":"fun","rating":7,"date":"7 March 2010","review":"Well I enjoyed it. It was just good fun and made me smile several times. I'm unfamiliar with the two leads so I'm not fed up of them. Brenda Blethyn was terrific as usual.<br><br>The soundtrack was quite good too and I enjoyed the contrast when the classical piece took over.<br><br>Not sure the 'kill' would have been so clean with a sawn off shotgun. I thought they made a bigger mess than that.<br><br>\"This movie even has big football movie connections it was funded by non other than Rio Ferdinand...that's right I said that huge football star Rio ferdanando..or something like that.\" He's England Captain and plays for One of the World's Biggest clubs. I think that qualifies as pretty big.","user":"missapril75","rank":[14,24]}]