[{"title":"Predictable but enjoyable","rating":7,"date":"9 April 2010","review":"I bought this DVD for two reasons. First, I'm a long-time fan of the Bridges acting family. Second, I was a huge fan of Steve Irwin and I thought that the combination of Bindi Irwin and Beau Bridges would be marvelous. For me, it was. I have read the negative reviews of this movie here and, while the plot is pretty predictable (what family-oriented film plot isn't?), I thought that the chemistry between the actors was wonderful and I disagree with the cynics, especially about Bindi's performance. I found Bindi Irwin's performance to be charming and Beau Bridges didn't disappoint either. Together, they are irresistible even in an obvious plot like this one, and the music is lovely as well.<br><br>I have no small children at this time and as yet I have no grandchildren. I bought this DVD for myself, and I would do it again. This film is fun and joyous and brought tears to my eyes at the same time. It is engaging and appealing on its own, even with the reference to the \"Free Willy\" franchise. This film could stand on its own without that title.<br><br>Australia should consider Bindi Irwin to be a national treasure, and I found this movie to be absolutely charming.","user":"sligocait","rank":[21,28]},{"title":"Exceeded my Expectations","rating":7,"date":"30 April 2010","review":"I wasn't looking forward to watching the most recent addition to the Free Willy franchise. My choice to rent the movie was a last resort decision but fortunately I do not regret my choice. While the movie was far from a master piece and wasn't nearly as good as the first Free Willy it is still very entertaining. Once I became accustomed to the cliché family film feel of the movie I was able to enjoy the story for what it was. My biggest complaint is that the movie was very different from the other previous Free Willy films to the point where it should have been called something else. This Free Willy movie is obviously made for the younger audience, the acting is overly comedic, the bad situations are always humorously harmful and the entire movie is very predictable. The movie overall just seems much more family oriented then the first film. That is not necessarily negative, I just wasn't expecting the family style to be pushed as hard as it was. In addition to that, the protagonist Kirra took a while to warm up to. I thought Bindi Irwin was simply a poor actor at first but I eventually realized that the acting flaws seemed more like they were caused by the director constantly looking for the overly fun family film style. While the acting seemed flawed, in the end I rather liked the character.<br><br>If you enjoy family films then I believe you'll find the movie entertaining, however, if you're not accustomed to family films I suggest you avoid watching the movie, especially if your looking for a movie similar to the original Free Willy.","user":"mattcc119","rank":[12,18]},{"title":"Don't watch this if you enjoyed Free Willy 1, 2, or 3","rating":1,"date":"12 May 2010","review":"The fact that this movie is associated with Free Willy 1,2, or 3 is disgraceful! I was excited to see another Free Willy come out but in the end it was a bust. I purchased the movie and wish I could get my money back. The only scenes that focused on Orcas and not Bindi Irwin were computer generated images of whales. Also, Bindi blindfolds \"Willy\" (the impostor) which I think is a form of animal cruelty. The story was way more focused on Bindi and Beau than orca whales. Also, some people are calling it Free Willy 4 and it is not a sequel, but definitely not a remake. Bring back the original cast and make an actual Free Willy 4 with real whales and passionate human beings who aren't just trying to get their 15 minutes of fame. Bindi's a cute girl and a decent actress, but we watch Free Willy to see whales. We miss you Jesse!!!","user":"carlys299","rank":[14,27]}]