[{"title":"Incredible depiction of the internet","rating":9,"date":"13 August 2010","review":"One of the best aspects of this movie (which is NOT, as it has been marketed, a horror movie) is the depiction of the internet into a physical space. It is really, really well done, and anyone (even slightly) familiar with the world of chatrooms will be blown away by the realism.<br><br>The movie goes back and forth between \"real life\" (the outside world) and internet life (the conversations and chats of the protagonists, here represented into a physical reality, so as not to spend an hour and 46 minutes filming youth typing on a keyboard).<br><br>It is not a horror movie, but rather a good psychological thriller, with the story of a disturbed teen who tries to alleviate his own misery by making others miserable. It is also a good look into the seedier, sleazier parts of the internet, where anything can happen, and where violence (although entirely psychological) can be very, very real.","user":"TheLurkingFox","rank":[96,121]},{"title":"Interesting movie shows teen loneliness and the dangers of internet manipulation","rating":7,"date":"5 February 2011","review":"It's a rather odd movie, this Chatroom. Most of the story (not all) takes part in cyberspace, which is visualized in an interesting way. The chatroom is not shown through a computer screen with typed text, but as a real room where our characters meet. This gives this movie quite a strange feel, theatrical at points, but it is quite effective.<br><br>Will is the guy behind the chatroom. It all starts out fairly innocent but slowly we get drawn into his real intentions. The people who come in his chatroom all have their own issues. They are lonely in real life, traumatized or misunderstood, and in the chatroom they find people who they can tell their stories to. At first this seems to have a healing effect, but slowly we see that all is not what it seems to be.<br><br>What this movie shows, IMO, is the loneliness many people face, and also the dangers of using internet for our main communication. Like Will's mum tells him at one point; 'You can not help yourself if you are only talking to strangers. You need to communicate with us.' The plot is not too difficult to figure out and quite predictable, but it's worked out reasonably well and for me, the movie just got under my skin. There is no winner in this movie. I would not name this to be a thriller, but more a psychological drama. The feeling I am most left with is sadness.<br><br>Though this movie doesn't come close to the strength Hideo Nakata's 'Ringu' or 'Dark Water' have, and has a whole different feel to it, I do consider it worth watching.","user":"BloedEnMelk","rank":[23,28]},{"title":"A Novel Idea But Doesn't Deliver","rating":5,"date":"3 November 2010","review":"The concept of Chatroom is a really good idea: five teenagers join an online chatroom and the film portrays their conversations as if they are happening in the real world, in a physical room. I can see, with quite a bit of rewriting, this working as a very engaging stage adaption. However, this film doesn't deliver on the goods. If I could make some decisions here I would have kept the entire film surrealistic, keeping every scene in the virtual world instead of flashing back and forth from the online fantasy into the real world where the kids are typing into their laptops or phones. That would have taken quite a bit of more talent to write, however, as we'd have to stay engaged with a conversation in a My Dinner With Andre sort of way. Also, two of the characters are extremely neglected and their subplots are never carried through to fruition. I also have a hard time believing, even in the virtual world of the internet, that the villain here could actually manipulate everyone so easily without anyone really objecting. It would have been in that objection, in the passion of that debate, that this movie could have found its true energy. But unfortunately it relies too heavily on every parent's paranoid nightmare of the internet leading to suicide or a sexual predator. There are some novel ideas here but unfortunately this film does not realize the potential of those ideas.","user":"chicagopoetry","rank":[41,54]}]