[{"title":"Amanda Seyfried takes my heart away with her beauty an underrated tragic love drama","rating":8,"date":"18 February 2018","review":"Chloe (2009) is really underrated love tragic drama. It is not that bad of a film I really liked it. I am not a drama love story fan guy but this movie really surprise me. It was not boring, over long or over dramatic like some movies are! It has a love drama and it ends with a twist and with a tragedy on the end of the film. Amanda Seyfried took my heart away with her acting, her beauty and I feel remorse for her character. I understood her character. I know now is based on the earlier French film Nathalie... (2003) I know that film is praised since Chloe come out, but who cares! I hated Dear John and Notebook I hated those films. The only films I liked in drama were American Beauty, Great Expectations that was a based on a novel and The Vow I like those movies.<br><br>Chloe this movie also has an erotic thriller about seducing and manipulating other peoples and it has a message. Don't belive anything and anyone you hear from people. Julianne Moore is fantastic and the women can act. She is awesome actress she is one the actresses I like and that's rarely by me. Liam Neeson is excellent as always I love this guy. I love Taken, Non-Stop in which Julianne Moore and Liam Neeson reunite again. A Walk Among the Tombstones, Unknown and Run All Night. I love the actor even in this drama he is so good. The thriller that was in this movie reminds me in other movies like are: Fatal Attraction. The Game, Disclosure and The Boy Next Door. <br><br>8/10 this is a tragic love story and that a good one, It worked by me I understand the character, the movie worked better then in other movies. In my opinion I like it! Atom Egoyan did a good job directing this movie. Response to a nutcase below me: the movie is not bland it is at least much better than your stupid dumb movie Batman Vs Superman: Dawn Justice. F**K Off!","user":"ivo-cobra8","rank":[86,100]},{"title":"Something A LOT different for Amanda Seyfried....6.5/10","rating":6,"date":"24 May 2010","review":"This film reminded me of the 90's wave of erotic thrillers. It's got all the elements, including a healthy dose of softcore sex scenes which surprised me because Amanda Seyfried has such an endearing, innocent look about her. But she's such a good actress though that this doesn't prevent her from convincingly playing the role of seductive call girl Chloe. Julianne Moore plays Catherine, a gynecologist who suspects her flirtatious husband (Liam Neeson) is having an affair with one of his students. While at work Catherine observes Chloe entering and exiting hotels with several men so she can make a pretty good guess at Chloe's profession. Catherine decides to use Chloe as bait to see if her husband would submit to the temptation of an affair with Chloe.<br><br>And even though that is the basic storyline, there is so much more that is left unsaid; things Catherine thinks she knows but doesn't know about her husband, things Chloe knows about Catherine that Catherine herself doesn't even know; and in the middle of it all, the viewer who finds out we didn't know much at all about it all. The audience is pretty much kept in the dark as to what is really going on with Chloe until one small scene that immediately switches the direction of the movie. It's not one of those hokey melodramatic twists, but will definitely have you playing back the entire movie in your mind because it sheds everything in a new light. Chloe brags at the beginning of the film, in a voice-over narration, that she has the gift of intuiting what people want and need without it being said. She can be all things to all people. And unfortunately for Julianne Moore's character, Chloe is exactly right....just not in the way that you might initially think she is.<br><br>What makes this movie good is that it has layers. Just as in real life, people are inevitably much different than what they appear to be on the surface. In a lesser film, the characters and plot would be one-dimensional and by far less interesting.","user":"IheartCali5882","rank":[91,117]},{"title":"Textbook Egoyan","rating":8,"date":"18 July 2010","review":"If anyone was suited for remaking the French film Nathalie, it was Atom Egoyan, whose deeply twisted and occasionally perverse studies of sexuality, expressed through an apparently cold directorial eye, go hand in hand with a script that emphasized words over images (though there is a bit more flesh in the English-language transition). Hence the rather brilliant Chloe, whose prime accomplishment lies in its being less showy and pretentious than the director's previous foray into erotic secrets, the ambitious Where the Truth Lies.<br><br>Set in Egoyan's home town of Toronto, Chloe tells the story of the eponymous call girl (Amanda Seyfried) who is hired by gynecologist Catherine Stewart (Julianne Moore) when the latter starts to suspect her husband (Liam Neeson) is having an affair. Chloe's job is to casually approach him and see if he falls for her charm, thus indicating his propensity for adultery. However, as the girl's reports get more and more graphic, Catherine realizes she has put herself in an awkward position, one that it will be difficult to get out of.<br><br>A fascinating hybrid between psychological drama and erotic thriller (there's a vague hint of Fatal Attraction throughout the movie), Chloe is a rarity due to its attempt to analyze sex and its consequences without necessarily resorting to openly titillating imagery (a characteristic Egoyan shares with another Canadian maestro, David Cronenberg). The only downside of this approach is the same flaw that was much more evident in Where the Truth Lies, namely a deliberately slow pace that affects the thriller aspects but enhances the emotional poignancy, something that comes off as a paradox given the seemingly cold subject matter.<br><br>Furthermore, there is no coldness to be found in the carefully crafted performances: Neeson and Moore play the troubled couple with conviction, especially when things start getting more complicated (Moore's suspicious wife is a tour de force turn that should have received some award recognition), but the heart of the film lies, quite predictably, in Seyfried's hands, and she rises to the challenge by proving that she can do Big Love-style quality work on the big screen, embodying a complex, intriguing character light years away from her roles in Mamma Mia! and Mean Girls.<br><br>Overall, Chloe is a very good movie: sexy without being gratuitous, psychological without getting pompous and, like its title character, delightfully surprising.","user":"MaxBorg89","rank":[47,59]}]