[{"title":"Totally under-rated","rating":9,"date":"19 May 2015","review":"While many have claimed this title does not offer much that the others of this particular genre do, I have to disagree. This is a heartwarming story with genuine dialog between characters. Some of these conversations and interactions I have experienced firsthand. The cinematography captures the specific details that both add to the dialog and allow you to pick up more the second time around. The acting is very believable albeit a little over emphasized for comedy at times. The first time I saw this I had wished they rewrote a few of the lines, but after my second watch they seem fitting for the character and what they were going through at the time. I really did not like Phillip, and now I have come to realize he is that juvenile person frequently found in families. I approached this film without any prior knowledge of it and was pleasantly surprised. I concede it was not amazing, and given the cast list may spark high expectations for some, but going into any movie that way will leave you disappointed.","user":"jamessheridan88-214-992942","rank":[57,64]},{"title":"Brilliant and Visceral","rating":9,"date":"20 September 2014","review":"What a great film.<br><br>Ignore previous reviews. How people can ignore the realities of psychotic family behavior is beyond me. This film smartly peels the layers and transparently reveals all about people running astray with their lives and emotions. It captures how families really are or maybe should be. Americans are all too good at bottling and hiding their real feelings and the result is vapid soullessness. Not with this film. It displays like European honesty ensuring every word drips viscerally from their tongues until the effects are felt. So reassuring in a country gone soft and dull. Amazing performances, sharply written and wildly funny, this film will pull tears, smiles and laughs.","user":"Greg-112-226997","rank":[165,229]},{"title":"Tender, funny, sweet, silly and surprisingly wise.","rating":8,"date":"22 September 2014","review":"Looking at the starry cast of This Is Where I Leave You, it's easy to get excited about the film. But that excitement might easily fade away when you realise that the director at the helm of this family dramedy is Shawn Levy, best-known for resolutely mediocre films like Night At The Museum and The Internship. Surprisingly, however, Levy has crafted something witty, wise and quite wonderful from Jonathan Tropper's screenplay (adapted from the latter's own best-selling novel). Its narrative might struggle a little at points, and some characters fail to really leap off the screen the way they're clearly meant to. But This Is Where I Leave You is without a doubt Levy's most engaging, full-bodied effort yet: a rich, bitter, quirky film about love and family that teeters along the thin, broken lines dividing life and death, and comedy and tragedy.<br><br>Judd Altman (Bateman) is having the worst year of his life. He's just discovered that his wife Quinn (Spencer) is having an affair with his scumbag radio-host boss (Shepard). The last thing he can handle is the death of a family member. But home he must go in the wake of his father's demise. Once there, Judd and his siblings - driven Wendy (Fey), stern Paul (Stoll), and quirky Phillip (Driver) - must abide by their father's dying wishes, as relayed by their mom Hilary (Fonda): they are to sit shiva for seven days, a week in which secrets are revealed, tensions run high, and love sneaks through amidst all the lies and loss.<br><br>It's a situation rich with potential, one that could easily have taken the path of high melodrama or descended into outright buffoonery. Levy and Tropper go for something in-between. And so, in a film in which Judd struggles desperately to mourn his father after the implosion of his marriage, the sexual escapades of Paul and his baby-hungry wife Annie (Hahn) are telecast to the entire house via a baby monitor. Wendy re-connects with Horry (Olyphant), the brain-damaged childhood sweetheart she left behind for a loveless marriage to Barry (Lazar). Her brothers sneak off and get high during a service at the synagogue. The final result is a tangle of black humour and bittersweet tragedy, woven into a tapestry of joy and misery that's remarkably close to life itself.<br><br>What keeps the film's servings of tragedy and comedy from tipping into farce are its endearingly real characters. It's easy to see the wealth of love and resentment that binds the Altman family together. The siblings argue to the point of bloodshed over who will take over their dad's sporting goods shop, and they tease one another with the poker-sharp memories of years of enforced familiarity. But they also let their guards down around one another: Judd chats out his troubles with his sister Wendy, perched atop a roof; the siblings complain about the loss of privacy stemming from their mom's best-selling book about their childhoods, but still find themselves turning to her in moments of deepest grief. \"You're idiots,\" Wendy declares at one point to her brothers, \"But you're my idiots\" - a sentiment that most would agree applies particularly well to one's siblings.<br><br>Even the supporting characters are mostly well-served by the script, whether it's widowed next-door neighbour Linda (Monk), mother of Horry and keeper of a secret that will shock the Altman children when it's revealed; or Phillip's new fiancée Tracy (Britton), a sexy, intelligent therapist who knows just what a big mistake she's made in falling for the Altman family screw-up. It's particularly intriguing that Quinn isn't written off simply as a degenerate whore, but someone whose mistakes - though inexcusable - are rooted in as much heartbreak and sadness as she's causing Judd with her infidelity.<br><br>Unfortunately, not every character in This Is Where I Leave You rings quite so truly. While Judd freaks out about Quinn, especially when she flings a bombshell at him when she turns up at the Altman home, he also draws closer to Penny (Byrne) - the sweet, kooky girl who's held a torch for him since high school. In a film filled with so many quirky-but-realistic characters, each of whom could easily have taken the lead, Penny is an odd cardboard cutout of a dream girl. In effect, she bounces around and chirps supposedly insightful but painfully awkward things like, \"I've always seen you, Judd Altman\". Poor Byrne tries her best, and has a sweet chemistry with Bateman, but her character feels less like a genuine romantic option than the wishful thinking of a writer who's spent considerably more time fleshing out his other characters.<br><br>In news surprising to no one, Levy's ensemble cast is an absolute joy to watch in action. Bateman anchors the entire film with one of his most sensitive performances yet, but everyone around him gets a chance to shine. Fey, better known as a comedian, mines Wendy's troubled relationship with Horry for genuine emotional trauma, while Stoll and Driver round out the Altman quartet with steady, appealing turns as the eldest and youngest brothers who just can't get along. Fonda is luminous, carrying off the comedy - and her prosthetic breasts - with remarkable grace, while creating a picture of a tough, sexually progressive woman with plenty of depth and love for her children.<br><br>Like the fractured, dysfunctional family at its heart, This Is Where I Leave You isn't perfect. It can be insular at times, and its characters occasionally speak in perfectly tart soundbites that don't quite ring true. But Levy's film is also a tender, silly, deep, smart and ridiculous look at a family in mourning. It finds the hidden joys and awkward sadnesses in a group of people who sometimes love more than they like one another. And it serves as a potent reminder that life - happiness, tragedy, and everything in between - keeps happening, often when we least want it to.","user":"shawneofthedead","rank":[110,156]}]