[{"title":"Short on the science; long on the human factors","rating":7,"date":"1 May 2014","review":"Although this is a documentary about the world's greatest scientific undertaking, there's no need for those who've abandoned hope of understanding physics or other advanced sciences to roll their eyes and move on. This one is less about the abstract principles and obscure questions motivating thousands of scientists and dozens of governments to collaborate on the massive European nuclear facility CERN (European Organization for Nuclear Research) than about the personal and human factors behind it.<br><br>The script offers some degree of Physics for Dummies (present company included), in trying to explain the basics of what we know about subatomic particles, and what proving there's such a thing as the Higgs boson could mean about the nature of existence. The so-called \"God Particle\" was posited as the reason atoms collect to form all matter, including life as we know it, in the universe. Supposedly, learning not only that it exists, but what it weighs could either support arguments for some sort of intelligent or symmetrical design, or a cosmic randomness that might pervade through innumerable parallel universes.<br><br>But before you doze off, remember this is mainly about the people behind the curtain. We learn about their dreams and motives. We even share in many of their lighter moments, along with the suspense of whether this massive undertaking would even work, what it would help us understand, and where any results might lead academic endeavors in multiple disciplines for generations to come. It's less scientifically informative, or slickly produced, than the new incarnation of Cosmos that's been running on several TV networks. But it's more intimate in showing relatable emotions among the brainiacs who've devoted years of their lives to this highly speculative venture.<br><br>Perhaps the best feature of the film is its clarity about the underlying difference between science and other human pursuits like religion or politics. Everyone at CERN was seeking objective, provable answers, even if they unraveled their own beliefs. And all were dedicated to the mission with absolutely no idea of what commercial uses, if any, their outcomes might engender. It's the purity of human curiosity at its finest. Learning for its own sake. No one at NASA expected the space race to leave us with Tang and other related products. Time will tell on the practical applications and cultural developments we'll receive from the labors of these scholars. For now, it's reassuring to know they've got a place to find the answers.","user":"lotekguy-1","rank":[19,21]},{"title":"Why we (should, perhaps) care","rating":8,"date":"6 December 2014","review":"The Large Hadron Collider is a gigantic experimental apparatus, conceived in an attempt to discover the fundamental particles that make up the universe. This documentary about it is relatively light on the physics: in concentrates on the hopes of some of the scientists working on it, conveying their innate excitement for their subject rather than the technical details of how and why. But it does convey some of the reasons why this work is (at least theoretically) important: the Higgs Bosun, the previously elusive particle that was target number one for the LHC, is central to modern physical models of the universe; and moreover, determining its mass would help us choose between two broader theories: one is which the universe exists in a state of perfect symmetry, and the other in which it is just one of a huge array of universes, each with their own peculiar properties. And I think the documentary succeeds in inducing its audience to share these concerns. How this relates to the world as we perceive it on a daily basis is very unclear; but the urge to understand is something very fundamental in our humanity, and 'Particle Fever' conveys this well.","user":"paul2001sw-1","rank":[7,7]},{"title":"Far better than Oscar material: Every student, whatever age, should watch this film","rating":10,"date":"22 February 2014","review":"This is one of the two or three best documentaries I've ever seen. We were so lucky to see an advance screening at our movie preview club.<br><br>It's hard to believe that a documentary about particle physics and the Hadron collider could be dramatic, suspenseful, even thrilling. It's just as hard to make the subject matter - the creation and operation of a huge facility in Switzerland for the purpose of colliding sub-atomic particles at great speed to search for clues about the universe - both intelligible and accessible. Yet this film has brilliantly done both.<br><br>Accessibility is achieved partly through clear explanations from particle physicist (and co-producer) David Kaplan and other theoretical physicists, and several experimental physicists who work at the collider. Even more compelling are the clear, beautiful, and simple-to-understand graphics that accompany these explanations. Indeed, the great graphics begin right from the opening credits. All this is enhanced by the editing of multi-Oscar-winner Walter Murch.<br><br>The drama comes from the efforts of the experimentalists to prove the theorists' ideas true - especially the existence of the \"Higgs boson,\" the crucial particle of modern physics. The drama is enhanced by presenting a pleasant cast of surprisingly normal, friendly (and, of course, super-smart) physicists who have strong rooting interests in the outcome the way some of us might root for a sports team - but with so much more at stake. There's even tension (albeit friendly) between the \"multi-universe\" and \"dual symmetry\" camps. <br><br>Watch this film and you'll understand these phrases and so much more. I learned more than I ever thought I could. And in the most pleasant, enthusiastic, accessible way possible.","user":"richard-1967","rank":[36,48]}]