[{"title":"Transformers","rating":7,"date":"5 March 2020","review":"Not as fun as the first one, but definitely a step up from Revenge of the Fallen and a fine way to end a trilogy of Shia Lebouf.","user":"MR_Heraclius","rank":[39,41]},{"title":"Ugh...","rating":2,"date":"30 June 2011","review":"// Minor spoilers and bad guy ultimate plot revealed in last paragraph, but it's so stupid you want to know it. Long and rant filled review.<br><br>Let's start with 10 stars.<br><br>Rosie and Shia wouldn't know how to fake chemistry if someone wrapped a lead pipe in the periodic table and beat them upside their botoxed faces for an hour. The romance part is so awful, so cheesy in this movie, it takes down a star right off the bat. I will also mention the \"romance\" between Optimus Prime and America - the \"one and only real and holy country in the world\". *puke* <br><br>9 / 10.<br><br>Rosie has to be mentioned again as a standalone entry. I can imagine how the casting went.. Bay walks into modeling agency, closes his eyes and says \"Eeny, meeny, miny, moe, you're the clone that comes along!\", thereby picking out the 403rd pair of tits in the lineup. A horrible actress, pretentious character and a so obnoxiously unnecessary role the movie would have been two stars better if she were not there at all. Also, lips are not supposed to look like that. If I was Shia, I'd worry \"Are you sure your lips don't hurt? Can we kiss? Won't a stitch break or something?\"<br><br>7 / 10.<br><br>At one point, a guy \"hacks\" a bridge. He logs into the \"bridge control\" , and lowers it. Hollywood, bridges do not have an open internet connection with a designated port for \"Bridge Control API\", otherwise every hacker would be lowering and raising bridges everywhere.<br><br>6 / 10.<br><br>Since the black guy stereotypes in Transformers2 got some bad rep, Bay went the other way this time - Irish and Scottish. Yes, there is a green robot with an Irish accent, and a red robot with a huge belly and a beard, with a Scottish accent. How did that happen? Did they scan an Ire/Scot when they landed instead of a car? If so, weren't they supposed to turn into the robot-terminator-chick type from Transformers 2?<br><br>5 / 10.<br><br>Physics. Oh god, the physics. Dear Michael Bay, please realize the following: a) Moon sand is a highly corrosive and metal-unfriendly substance. Any kind of moving metalpart coming in that much contact with it would self destruct by the time it made 3 steps. b) One plane was enough to collapse a Twin Tower into dust. A seventy million billion ton robot shooting and crashing into a building will not make it \"tilt slightly\" and when that building falls, it will not get stuck between two others like a bridge, ever, regardless what it's made of, especially if that same robot is still crawling through it and destroying chunks. c) When stuff explodes near people, people tend to be stunned, burned and / or get shrapnel shot into their spines. They do not sit idly by and contemplate the situation. So if a grenade explodes in an office cubicle next to the one where the protagonist is standing, he will most probably DIE. d) You cannot grab a SHARP, MAD, DANGEROUS robot by the neck and keep it in control. You will LOSE YOUR FINGERS. e) Do you have any idea how much extra it costs to send an extra kilogram into space in a shuttle? Now imagine how much fuel and money you would need to send 10 million-ton robots into space with a regular human space shuttle launcher. f) When people fly through glass, they ALWAYS get cut. When they fly through 10 panes of glass, they DIE. When they fly through 20, they DON'T, because they got impaled on the 12th or 13th.<br><br>4/10<br><br>Stealing characters from other franchises just for the kick of it is not cool. You have a predator robot, a robot that is \"Q from James Bond\", etc. What...?<br><br>3 / 10.<br><br>Plot: If I was an evil genius and built a war-turning technology, I definitely would not build it so that it has exactly one weak point that, if struck, undoes absolutely everything it ever did, and I would definitely not leave it exposed. The bad guys' ultimate plan was to teleport their PLANET to Earth's atmosphere in order to rebuild it. This raises several issues: 1) You would have approximately 10 minutes to live, before Earth and Cybertron collided due to gravity. Those 10 minutes would be filled with an apocalypse due to uncontrollable floods caused by tides. 2) If you want 6 billion people for the sole purpose of slave labor, you should think about point 1). Also, it is stupid to believe 6 billion people could rebuild a robotic planet sooner or better than 1000 decepticons - you not only have to accommodate and feed the people, but also modify the planet's surface for them to be able to move on it. 3) There is a part where Megatron is chillaxing in an alley after a big fight, and the flat-lipped wonder of a model-clone that is Carly comes up to him spewing some bullshit about the other bad guy getting ready to betray him. Now, even if she made a point, I would still CRUSH that human insect. A meaningless pretentious bitch telling me what to think? I'm a god damn eleventy billion ton robot, you skank! *crush* The other critically stupid thing is the fact that Megatron then prevents the other bad guy from killing Optimus. If you have two enemies who are fighting, it is generally not a good idea to prevent them from killing each other! And while we're here, the decepticons could have won if the bad guy had just used one of the 994208 chances to kill Optimus he's had up until this point.<br><br>This brings the movie down to 1/10, but I'll give it a star for excellent special effects. 2/10.","user":"devolucija","rank":[589,882]},{"title":"Top Class Film","rating":9,"date":"15 December 2011","review":"Having watched this film I think Michael Bay definitely learnt from the mistake he made in ROTF. He cut out all of the stupid comedy e.g the twins.<br><br>He also made the overall plot a hell of a lot better, the way they linked in the moon landing to Transformers was fantastic I thought, and additionally the old footage they used was clever.<br><br>The action scenes were pumped up so much more, and I felt genuine sorrow when IronHide died, and BumbleBee was going to be executed. The background music composed by Steve Jablonsky was fantastic and never so more appreciated during the car chase scene when they are tyring to protect Sentinel.<br><br>People will criticise because it is a typical Hollywood block buster but if you want pure escapism then watch the film","user":"jatinder377","rank":[40,56]}]