[{"title":"Black Mass is a decent film, but it could have been great.","rating":7,"date":"21 September 2015","review":"Black Mass: A Near Miss<br><br>'Black Mass' is another is a line of crime dramas set in Boston. The film will inevitable be compared to 'The Departed.' And it falls short in the comparison. The acting is top rate, and Depp is much better, not as hammy, than the comic portrait of a crime boss by Nicholson in 'The Departed.' Depp is genuinely threatening in the film and the make-up job given him in the film adds to the fright. <br><br>'Black Mass' has the look of a 70s television show, and that works in its favor. In fact, the overall look of the film is exquisite. That, and the acting, are the two best things in the film. However, the movie is both too much and not enough. <br><br>'Black Mass' tries to cover too much and thus it lacks focus. This is where 'The Departed' succeeds. While 'The Departed' has many layers and character, it has a focus: the Southie, Billy. 'Black Mass' doesn't have a main theme, a main character, a main protagonist or antagonist. There are a bunch of characters in tense situations with some irony and symbolism. However, in the end, there is nothing to hold onto, no lessons, no emotions, love or hate, for any characters. <br><br>As I was watching, both my film buddy and I thought the same thing: Scorsese could have made this story work with his writing and directing. We also thought that in an era of long- form television that it could have made a great 10-20 episode show. Then it could have gone into depth about the childhood relationships between crime boss Bulger, his FBI friend Connolly and Whitey's brother, State Senator Billy Bulger. <br><br>As miniseries, it could have more deeply explored the racial tensions between the Irish and Italians with the African Americans stuck in the middle. It could have taken a deeper look into Boston politics and corruption, police corruption, and more. The miniseries could have also gone further into the Irish American funding of the IRA. As it was, it touched on each of those issues in an unsatisfactory fashion. If the film had taken a deeper look into any ONE of those themes, it would have made for a better movie. <br><br>Rating: Matinée<br><br>For the great look and outstanding acting, I suggest you see it on the big screen. Otherwise, wait for the miniseries. Hey, a man can dream. <br><br>Peace, Tex Shelters","user":"texshelters","rank":[143,192]},{"title":"Depp is Great...Movie Itself? Not So Much.","rating":5,"date":"25 September 2015","review":"Black Mass serves as a nice redemption for the floundering career of Johnny Depp, who has leaned more on quirky voices and loud makeup than his actual skills in recent years. His portrayal of mob boss Whitey Bulger is a powerhouse performance and easily his best since he first introduced the world to Jack Sparrow. It's too bad the movie as a whole doesn't fair quite as well. Despite a great cast and some interestingly insane source material, somehow a movie about one of America's most infamous criminals feels more like small claims court. Director Cooper focuses his narrative on Bulger's less-than-legal partnership with the FBI. It's a fascinatingly close-knit community we witness (agents, felons, politicians, and families alike) in which loyalty and corruption go hand-in-hand. It's a grimy yet quiet 70's-feel gangster film that engages its audience nearly as much as it reminds them of better films. Therein lies its big problem: What is Black Mass offering that hasn't already been perfected in other gangster films? Unfortunately, instead of a true movie-making vision, it's like a guy watched every crime drama from the last 40 years and just spit out a less-interesting copycat. Not that a counterfeit of something great can't still have its positives: the score is beautiful and the performances from the top-notch cast around Depp are nearly as superb as his, all of whom nail the oft-parodied Bostonian accent with aplomb. But with too many side plots to juggle, not enough cohesion to the storytelling, and an unfortunate lack of auteur vision, Black Mass just can't stand against the great American crime films of yore (Chinatown, Godfather, Goodfellas).","user":"matthewssilverhammer","rank":[155,219]},{"title":"What was the point?","rating":6,"date":"24 September 2015","review":"I swear to God I really really wanted to like this movie. I am kind of a fan of Bulger's for some sick reason and I felt like Johnny Depp was appropriately menacing and weird looking and did a good job with making the Violence believable. What failed was the writing. There is never really any attention paid to why Whitey was Whitey or how he got to be Whitey or why he wanted to be Whitey. His kid is dead his marriage ruined and he is just accumulating money to accumulate money? Why? He apparently has no vices to speak of except giving money to con men from the IRA. The whole thing just makes no sense. The whole thing just seemed apathetic.It could have been a real classic but they fornicated with the puppy yet again. It was just Depp looking weird and enjoying a WHitey Halloween costume while he strangled hookers and killed informants. Thanks Hollywood. I suspect you can blame the producers.","user":"thechristopherpennington","rank":[85,126]}]