[{"title":"Eclipse","rating":6,"date":"20 February 2020","review":"Eclipse is the beset Twilight movie so far and now I'm starting to give this series a little mercy. Yes, the writing is still bad, the CGI is awful, there's no chemistry between the leads, there's a lot of laughable dialogue, and terrible characters, but I enjoyed the movie and that's what movies are supposed to do. I'm actually going to watch the next movie with an open mind even if this movie wasn't that good.","user":"MR_Heraclius","rank":[38,39]},{"title":"The wife owes me big time!","rating":2,"date":"15 July 2010","review":"It took my wife nearly a week of constant begging to take her to see Eclipse. After having endured the first two movies and the subsequent years of self therapy to erase the memory, it took a lot of persuasion to guilt trip me into seeing this one as well.<br><br>Needless to say, I entered the movie theatre mentally preparing myself for two hours of torture. Frankly, Eclipse was just as bad as I had expected despite reassurances from female co-workers that \"It is much better than the last one... honest.\" I've never read the books nor do I plan to. I know nothing of the author however, I'm guessing she started writing this stuff when she was a twelve year old girl with delusions of what love should be.<br><br>This entire movie is nothing more than a very poorly written romantic dilemma, wrapped in a weak premise of vampire and werewolves in an attempt to lure extra interest. So far as stories go this one has no vigour or power what-so-ever. Depth? I've stepped in deeper puddles.<br><br>Approximately 80% of this movie is dedicated to examining the lead female's conflicting emotions. Does she want the vampire or the werewolf? Does she understand the lifestyle choice that comes with that decision? Is she willing to accept the risks? Does she understand the impact it will have on those around her? And finally... does anyone at all actually care? Yup, for two whole hours. (Six if you include the first two).<br><br>So surely this movie has some redeeming features? Perhaps the acting? Wrong. Stewart's (Bella), emotions range from mildly irritated to slightly concerned whilst trying to maintain an air of vulnerability that irritates instead of earning sympathy. For Pattinson (Edward), it's all about just looking pretty and his acting skills are reduced to nothing more bowing his head slightly so that he always appears to be gazing upwards in an attempt at looking intense. As for Lautner (Jabob), well we all know he can't act so he is reduced to a shameless and topless eye-candy prop.<br><br>In summary? Women are from Venus and men are from Mars. If you're a guy, you'll hate this. If you're a woman... you might like it. I'm not trying to belittle the sexes, it's just that type of movie.<br><br>Anyway, the wife can beg all she wants... there ain't no way I'm taking her to see the fourth one!","user":"xenomorph_uk","rank":[441,605]},{"title":"Eclipse: The Army of Sparkles!","rating":6,"date":"30 June 2010","review":"Ah, great, I can't believe I'm writing this kind of a review. I have never been so disappointed in my life, I went into Eclipse expecting a really bad movie like New Moon and it turned out to be much better than I expected. It's the best of the trilogy, even though that's not saying too much. New Moon was very possibly one of the worst movies I had ever seen, it was very poorly written and had God awful characters that are not likable in any way. Twilight, the first film, was so small for what it was trying to do and just wasn't very strong. However, working with a much better director like David Slade who did Hard Candy and 30 Days of Night, he knew not to take the film so seriously and it actually matured quite a bit.<br><br>As Seattle is ravaged by a string of mysterious killings and a malicious vampire continues her quest for revenge, Bella once again finds herself surrounded by danger. In the midst of it all, she is forced to choose between her love for Edward and her friendship with Jacob, knowing that her decision has the potential to ignite the ageless struggle between vampire and werewolf. With her graduation quickly approaching, Bella has so many decisions to make: if she will marry Edward, if she will become apart of the vampire clan, if she will choose Jacob instead, if she will abandon her family and life. As this is happening, Victoria is still seeking her revenge on Bella by creating an army of new born vampires who crave nothing more in the world than blood and will do anything for it. Having to decide if Bella's life is worth it, Jacob and Edward must come to peace with each other if they want to save Bella's life.<br><br>The actions sequences are a lot better and actually makes the film a lot more entertaining. As we see in the first two films, when the vampires run, it's a long shot so it looks very CGI and in this one we have more close up's making it look a lot more realistic. Even the werewolves looked a lot better than in New Moon. I'm betting David Slade called the computer company that did New Moon and said \"OK, you guys have got to be kidding with what you gave me; work on the image!\". Also the characters even go a little more in depth, Edward and Jacob are a little more interesting in this story. Honestly, if it were not for Bella, this would have been a much better movie.<br><br>See, this is where the downfall is with this series, besides the story, our main character Bella. She is very possibly one of the most flat characters ever written, she's so beyond boring. I can't honestly feel anything for her because she's just honestly a horrible person, she pits these guys against each other who are fighting for her and I can't even understand why they would fight for her. She's not that pretty, she's one tracked in thinking and she's a manipulator. When we finally are getting a little more interested in Jacob and Edward, Bella interrupts it. She's going from kissing Edward to kissing Jacob to kissing Edward and not even apologizing for it. I'm also convinced that Edward is gay, I'm not saying this as an insult, but there's a scene that reminded me of Will and Grace. Bella wants to sleep with Edward, but he wants to wait until they're married, he gets nervous when he kisses her and doesn't even want her undressed, in Will and Grace when we find out how they met, that's the exact same situation, only Will tells Grace after he proposes to her that he's gay. It's not insulting the character, I'm just having a very hard time believing that he loves her as he tells Jacob when asked him if Bella chose him instead, Edward says \"I'd let her\", what is that? Are you kidding me? That's Bella's great love? Wow.<br><br>With better direction though, this film does a lot better that I expected, even if it's not saying too much. It's just the story that is really bad, the dialog and characters. David Slade did the best he could and he even made it enjoyable when Edward and Jacob actually talked, Jacob even says when he has to warm up Bella in a blizzard \"I'm hotter than you\", I couldn't stop laughing at that. I think that line was added last minute, also same with when Edward sees Jacob and asks \"does this guy have any shirts?\", they actually had fun with the script and that's what picked up the film as well as better action scenes. But to sum this up, Eclipse is better than I expected, but it's a rental for me, but I'm sure the fans will like this one a lot better.<br><br>6/10","user":"Smells_Like_Cheese","rank":[50,67]}]