[{"title":"Please don't forsake me O' my Darlin'","rating":5,"date":"5 April 2009","review":"**SPOILERS** When hostage negotiator Lt. Phoebe McNamara got under the skin of fellow cop Arnie Meeks on showing him up in how to do his job things started to get hot an heavy between the two flatfoots. This happened when Officer Meeks was on the scene when a hostage taker ended up blowing his brains out before Phoebe, who should have been called earlier by Meeks, had a chance to talk him out of doing it.<br><br>Given a 30 day suspension by his boss Lt. Phoebe McNamara Meeks just couldn't help himself in taking it out on her to the point where he attacked Phoebe right in the police station stairway, wearing a ski mask, almost breaking her jaw. It's later that Phoebe is again targeted by some unseen psycho but by then it's obvious that Meeks isn't the guy. It's someone from Phoebe's past who holds her personally responsible for the death, while being held hostage, of someone very near and dear to him.<br><br>The film \"High Noon\" never really takes off with Lt. Phoebe McNamara and her new found boyfriend lottery winner and bar owner Ducan Swift being stalked by an unseen and deranged lunatic all throughout the movie. The guy goes so far as to gun down young hostage taker Charles \"Raz\" Jackson just as Phoebe was about to have him give himself up to the police just to make her look bad.<br><br>Fantasizing himself to be the late actor Gary Cooper, he even insist on being called Cooper by the police, the killer want's to replay the climatic shoot-out scene in the movie \"High Noon\" with him, as far as I can tell, playing the parts of both the good and bad guys in the film. He's also obsessed with clocks-that dominated the 1952 movie \"High Noon\"-that he sets his explosives with all to detonate at the 12 O'clock mark! The movie ends with Phoebe going against her better judgment and using, or having her fellow cops use, deadly force in finally putting the killer on ice, in the city morgue, only after he was just about to release the people that he was holding hostage! What shocked me about this is that Phoebe did far worse then what Officer Meeks did, not preventing a hostage holder from killing himself, and what she had him suspended from the force for!<br><br>Very uneven crime drama from the pen or typewriter of Nora Roberts with a number of confusing sub-plots, like Phoebe's shut-in mom Essie, that made the film even far more disjointed then it already was it that's at all possible.","user":"sol-kay","rank":[24,56]},{"title":"hmm.....not very wary of things","rating":6,"date":"20 February 2010","review":"Well...I haven't finished watching the movie, but there are a few things bugging me. <br><br>So, the main character is a cop/Hostage negotiator, right? She is attacked in the stairwell of the police building, after finding a torn up teddy bear on her front porch. The night she goes home, there is a weirdo outside whistling. Her house has no screens or alarm system that I can tell, and a low porch roof underneath her windows, where someone could EASILY enter the house. Yet, she has her window OPEN for the world, the curtains are open throughout the house and she is like, \"lalala....oh a guy whistling...\" What is THAT about. You do NOT put your couch underneath windows directly, it isn't safe unless you live in the boonies....you keep your windows shut if you have recently been attacked and for gosh sake be AWARE of your freaking surroundings. She isn't the brightest. Or the director made her not bright or something. <br><br>And, one more thing. Her child is very young and races to the door to answer it......how many times do parents need to be reminded that small children shouldn't answer the door...it isn't safe? Especially with wackos after you? Sheesh.<br><br>Disappointing.","user":"wingedheartart","rank":[5,11]},{"title":"Suspension of disbelief...","rating":13,"date":"13 April 2018","review":"Although a well-paced film, the notion that a late-twenties, diminutive (5'2\"), female with only two years on a police force would already be a lieutenant, is laughable--indeed misinformation--not to mention her running around virtually everywhere in high-heeled boots which would definitely NOT be police-issue!<br><br>The \"Baltimore\" setting--including uniform patches and cars with Maryland licence plates--was clearly a stretch, and way too clean and tidy to have been filmed in that seedy city. The closing credits revealed Calgary, Alberta as the main shooting location.<br><br>The star, Australian-born Ms. Emilie de Ravin, successfully hid her native accent. She must have had a good voice-coach after relocating to the U.S., although I imagine that an American or Canadian actor would be hard-pressed to successfully pull off a believable Australian accent without months of practice!<br><br>The boyfriend in the film, played by tall (6' 3 1/2\") Ivan Sergei, seemed miscast: a hulking, rather odd-ball character and, being a civilian, too often presumptuously showing up to chat with and comfort Ms. de Ravin right smack in the middle of her intense and dangerous police operations--something that would be seriously frowned-upon by the authorities in the real world.<br><br>Incidentally, the final scene took place at the corner of 16th Avenue and 7th Street, downtown Calgary where today as of this posting (April 2018) most of the retailers shown in the background no longer exist or have moved elsewhere.<br><br>In the case where a film's closing credits or IMDb data does not specify actual filming locations, I've developed the habit of attempting to identify them by freeze-framing on various, potential giveaways such as vehicle licence plates and/or specific infrastructure such as bridges, the logos on railway and public transit, retail and restaurant names (where they have not deliberately been altered), phone numbers on signage, and even mundane things like the type and colour of fire hydrants, etc.--information which can often be identified and tracked down via Google and online license plate directories in order to solve the mystery, although some places defy analysis. Too many films, for various reasons, do not or will not reveal where they shoot.","user":"newslogger44","rank":[0,0]}]