[{"title":"It's as bad as it sounds.","rating":1,"date":"6 March 2009","review":"Despite a few Dick Van Dyke cockney accents and one or two unintentional comedy moments, the first green street was a generally enjoyable film. Green street 2 on the other hand was just plain awful, for starters the whole film is set in what seems to be an American prison, this combined with acting that made the original look like Shakespeare I found myself wondering why I was still watching. The director tries to make up for this pathetic attempt at a plot with lots of mindless and pointless violence, don't get me wrong I'm certainly not oppose to a good punch up, this was mainly why I enjoyed the original there were some fantastic fight scenes that basically made the film, but no amount of hooligan action could save this tripe. I'm sure like me many will watch this because of the original, and I'm sure like me they will be left shaking their heads right up until the pointless football match finale.","user":"scott_o_souden","rank":[62,92]},{"title":"Terrible film","rating":1,"date":"11 April 2009","review":"Where to begin, this is wrong wrong wrong. I'm not sure i can put in words how bad this film is. Firstly the setting, this film is filmed entirely on location in the city of Whittier, CA USA. However since the subject matter is related to 2 London, England football clubs. West Ham and Millwall. The setting and scenes take away from the points of the movie. The violence appears at times to be violent for violence sake. The plot line is unrealistic, especially the scenes relating to the football game. Overall a complete shambles and disappointment. I assume this straight to DVD film is made for an American audience. However i feel if someone wants to watch a football in prison film, may i suggest Mean Machine with Vinnie Jones which looks Oscar winning compared to this awful awful film. A great way to fleece the public in a credit crunch, riding on the back of its more watchable and enjoyable prequel. Avoid at all costs!!!!!!!!","user":"pmahon08","rank":[38,56]},{"title":"Repellent, brain-numbing bilge","rating":2,"date":"24 April 2009","review":"STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday Morning <br><br>Following a 'can't back down' confrontation with his rival Millwall supporters, Dave (Ross McCall) and his gang are transferred to a tougher prison with a harsher regime, where they are pitted against the brutal Big Marc (Graham McTavish) and his blood thirsty section of the Millwall firm who are determined to make their lives hell.<br><br>I'm not going to start blaming Green Street 2 for problems in society, and am the most liberal minded when it comes to censorship, but this soulless straight to DVD sequel to the only average cinematic film is as base as it can get, with the minimal, simplistic story revolving around twisted thugs dishing out sickening, blood soaked hand to hand violence to each other. Since each side is as morally and humanistically dead as each other, it's tough to really see either side coming off as the good guys in the tacked on 'happy' ending that feels as flat and insincere as the plot has been so far up in the film.<br><br>Another objection is the lack of conviction. It's supposedly set in a tough English prison, yet the inside and (especially) the outside resemble more of an American one, making it pretty obvious it was filmed for a yank audience, along with the actors putting on unconvincing London accents when they're really Scottish, northern or even American themselves. As the lead star, McCall carries things along with enough (fake) cockney charm whilst getting convincing (given the nature of the film) support from Luke Massy and Nick Holender and McTavish certainly has presence as the villain, but the material is so weak none of them can shine. One fun thing you can do is play Spot the Character Actor, including 'Digital Man' Matthias Hues in literally a walk on part and even Bennett (from Commando) himself Vernon Wells (now really fat) as the prison governor, but the overall feeling you're left with is why the studios keep making these meaningless, cheap looking straight to DVD sequels in the first place and what drives anyone to want to watch them. *","user":"davideo-2","rank":[23,34]}]