[{"title":"I know what you're thinking, and it's not that movie","rating":2,"date":"25 July 2018","review":"The whole movie has a kind of grainy quality -- actually it's just really grainy... and the word quality probably shouldn't be associated with it. In a pointlessly surreal style, we are introduced to the \"players\" in a series of scene cuts, and it is implied that an alien has landed, and is being examined (or evaluated) in some kind of lab. <br><br>This is where the females make a point of stating how attractive they find the subject, but this is done in a way that is either creepy, or just really poorly acted - it's hard to tell which. The men on the team seem to indicate that the reaction of the women merits some kind of discipline, which would lead us to believe these beings have been encountered before and these responses lead to bad outcomes, but this is supposed to be the \"first\" man (alien).<br><br>Later we are shown some wreckage on a hillside (everything is around Los Angeles), but there isn't enough of it to have carried a gerbil, much less a man. The agents are tasked with killing people when necessary, and the movie descends into an exploration of their feelings about that, and to pad the movie, their interpersonal relationships were superficially examined.<br><br>No scene in the movie seems to get you to the end fast enough, and we know nothing more at the end than we did at the beginning.","user":"hughhemington","rank":[6,6]},{"title":"could have been a lot better","rating":2,"date":"7 April 2019","review":"For starters ted raimi,lesley ann warren and heather graham have been in a lot better and this sci fi pretty much just dragged on and the script was nowhere near what the movie is and was hoping for something to happen and not much was. might wanna skip this one.","user":"gregnorman2000-115-488321","rank":[3,3]},{"title":"Offbeat sci-fi obscurity","rating":7,"date":"17 May 2018","review":"A male alien who's irresistible to any and all women who encounter him arrives on Earth. It's up to burnt-out government agent Jake (a sturdy performance by Michael Raynor) to find him. Meanwhile, female agents Louise (an excellent Lesley Ann Warren) and Nan (an equally fine Roxana Zal) fall under the guy's spell. <br><br>Writer/director Danny Kuchuck relates the occasionally murky, but overall interesting and intriguing story at a deliberate pace, maintains a quirky and enigmatic mood throughout, astutely pegs the thankless and stressful nature of being a secret agent for the government, and neatly explores the themes of loyalty and betrayal. The sound acting by the capable cast holds the picture together: Kane Picoy contributes a stand-out turn as the ruthless Phil while Ted Raimi and Heather Graham are charming as a pair of newlyweds. Maure Silverman's wonky electronic adds to the oddball atmosphere. Greg Littlewood's pretty cinematography offers a wealth of striking visuals. While this movie suffers a bit from plodding pacing and a sometimes jumbled narrative, it's nonetheless worth seeing for those with a taste for idiosyncratic low-budget sci-fi fare.","user":"Woodyanders","rank":[1,4]}]