[{"title":"Not so much a movie, as IT is an intangible collection of scenes.","rating":5,"date":"8 September 2017","review":"IT truly is the scariest movie of all time... If you're 10 years old or younger, maybe.<br><br>I honestly am shocked by all the positive reviews and high rotten tomatoes score. Did I see a completely different movie? <br><br>IT starts off very well with a genuinely good opening scene. Great cinematography, atmosphere, lighting, a likable child whom you connect with easily, and an interesting encounter takes place between this kid and a very creepy clown. The dialogue is good, there is an eerie sense of dread, and a moment where IT aka Pennywise goes from being a friendly-ish clown to a terrifying villain in an instant through a very well placed awkward stare. It was a moment I wasn't expecting and gave me hope for the rest of the film, then... It's all downhill from there, after an almost laughable use of CG. <br><br>This movie has big issues. IT isn't scary. IT's story is weak, if you can even call it a story. IT has too many underdeveloped characters. And IT is a counterproductive villain with no concrete rules for what IT can or can not do.<br><br>The overuse of CG ruined any sense of tension or fear and Pennywise's tactics didn't make sense. If he feeds off fear, why reveal himself to each of the kids within a close time period? Why not concentrate on each child individually, causing far more mental torment and making them an easier kill? Pennywise also just randomly manifests himself anywhere at anytime, and disappears randomly. I don't find it scary when the antagonist manifests itself, attacks a character and right before doing damage IT vanishes..<br><br>The story is a mess and there are far too many characters. I swear the first 40 minutes is the longest montage in film history. A montage of each child's development and exposure to Pennywise. It was predictable and monotonous. As for the story, I don't know what to say, besides there really isn't one. Character motivations are weak, Bill is the only one who makes sense. Where were the parents at? Not a single parent seemed to care about their missing children. The few on screen parents there were, came off as caricatures. And there were a few scenes that felt completely pointless within context of the story. The school bully and his dad, being the oddest.<br><br>So in closing, IT is an uneven movie or more accurately a collection of scenes that don't flow well in a tangible story. There are some good laughs, and a few entertaining scenes. But all in all it's just an average movie. Which should've been an evident sign, when the original attached director Cary Fukunaga jumped ship.","user":"EndeAbgrunds","rank":[1,1]},{"title":"A scary movie that isn't scary.","rating":5,"date":"8 September 2017","review":"The opening scene is good. From there on...not as much.<br><br>I guess this movie will please those not familiar with the book much more than those who are. That being said, I don't think it is possible to make a satisfying adaption of \"It\" without doing it the Game of Thrones way. More time is needed to dwell on each of the novel's parts to create the feel the book gave us. To tell the story as it was told on paper. So I guess I'll forgive the filmmakers for that.<br><br>The kids are okay. They've managed to portray the losers and the relationship between them decently enough- considering the running time. Again: more time is needed for better development. Much of what actually happened between the kids and It has been cut, but again - running time. They had to.<br><br>That they've changed the setting from the 1958 to the 80s was a bad choice, and so are the other changes. They're creating scenes that aren't in the book. They're changing things that are there. The biggest problem I have with the film is the execution of the horror. Constant jump scares, way too much CGI, and a complete lack of understanding of the fact that less is more. Waiting for a scare is the scary part of horror, and this movie just throws everything at you constantly. It just isn't terrifying. At all.<br><br>I didn't find myself bored, though. Besides the poor performance when it came to being scary, it is an okay movie. It just isn't a good adaptation.","user":"bha099","rank":[484,748]},{"title":"Where was the tension?","rating":6,"date":"8 September 2017","review":"I think the film was good, but didn't really live up to expectations. I didn't find it that scary. Admittedly, one of the jump scares worked on me but otherwise I never felt any dread looming in the pit of my stomach. The film is gorier than the mini series. That's for sure. And I liked that updated aspect, but nothing particularly shocked me. There was quite a bit of special effects that just were not very good. And I think that's a big reason why I just wasn't very scared.<br><br>The other dumb thing I want to mention is that sometimes the characters fell into predictable horror movie tropes. Its just kind of silly when they've already been scared by Pennywise many times. Knows this all \"isn't real\" and yet will wander off by one of the missing kids going \"Come here\". I mean, really? You're going to fall for that? I think what does save this film are the performances. Bill does a good job with Pennywise. However, he does lack the charm that Tim Curry had. But those were always going to be big shoes to fill. (Clown pun not intended). The kids though were amazing. In particular Jaeden Lieberher (who played Bill) and Sophia Lillis (who played Bev) were the standouts. I also want to give a shoutout to Nicholas Hamilton (who played Henry) for managing to make me feel empathy for a bully. Finn Wolfhard (from Stranger Things) plays Richie who is meant to be the jokester of the group. And Finn does well with that character. I just wish the writers had laid off from the jokes some of the times. You're supposed to be building tension and it kind of gets ruined when he opens his mouth to make a joke about period blood or whatever.<br><br>I see the potential in this film. And I think it could have been really good. I just think they spent too much focus on \"shock value\" rather than building on an atmosphere.","user":"mr_bickle_the_pickle","rank":[313,495]}]