[{"title":"It's fun Summer Fare, Enjoy !","rating":9,"date":"19 June 2012","review":"I saw the Broadway play with the original cast and had a great time. The movie didn't disappoint me either. A cheesy love story tied together with great music from the hair band 80's was on purpose. Re-living that era, priceless. Go. Enjoy. This will definitely become a cult favorite in future years, bless 'em for preserving some amazing rock history. Ignore the professional critics, go have fun!<br><br>This is my first review attempt on IMDb, with hopes this helps those who are turned off by People, EW, local and national news professional (aka, paid) reviewers. I'm a pop culture junkie and a grandma, I don't always agree with the pros. I'm sorry Rock of Ages had a poor box office start out of the gate, but hopefully my little review piece will bring some fun to those clinging to their entertainment dollars. Great party experience!","user":"Broadway1697","rank":[238,324]},{"title":"Brilliant, finally a musical worth watching","rating":10,"date":"9 November 2012","review":"I feel compelled to submit a review for this movie, purely because some of the atrocious reviews I've seen contributed by others.<br><br>To give context, I grew up in the 80s and 90s, and pretty much know all the songs backwards - surprisingly... decades later. I did not grow up in LA, or the States for that matter, but I most certainly grew up with just about every song played in this movie.<br><br>I absolutely hate musicals. With a passion. So, even though my friends encouraged me to watch this movie, I resisted. Eventually I caved, and all I can say is that I absolutely loved the movie! My wife loved the movie, but in all honesty, our 10 year old thought it was OK - purely because she didn't know any of the songs.<br><br>If you love rock, and grew up with 80s rock, this movie is for you. This movie isn't called Rap of Ages or Pop of Ages or R&amp;B of Ages or Classical Music for the Ages... it's called Rock of Ages. Reviewers posting they walked out after 15 minutes, really shouldn't contribute here. And quite frankly, you need to have a serious problem if you are analyzing the actors voices with respect to the original artists. This movie is good fun, and true to the times... <br><br>This movie is THE musical for all rockers out there! Absolutely wonderful fun for the family, with a stellar performance from the entire cast. A good couple of chuckles in there, and if you're over 35 years old... I dare you to not sing along with some of those classics. With so much rubbish coming out of Hollywood to keep the nay-sayers busy with their critical reviews, this is a refreshing change.<br><br>If rock is not your choice of music, skip this movie... but if you grew up in the 80s, you should appreciate the music, fun and experience portrayed in this movie.<br><br>This movie rocked!","user":"springstone","rank":[111,152]},{"title":"I'm 60, I want to have some fun, and this movie was fun","rating":8,"date":"19 June 2012","review":"I'm 60, I want to have some fun, and this movie was fun. It put me right in the Bourbon Room audience, blithely wearing the tasteless and bizarre outfits that I couldn't wear because I was setting a standard of decorum for my kids in those days, and embarrassing them was anathema. It features a period of Rock (1987) when the genre was flanked by inane crap \"music\" aimed at the 13-16 year olds I was raising. Fortunately they didn't bite. This movie features the memorable music of the decade that my grandson is now still honoring. This music and that of the late 60's and early 70's helped me as a beleaguered working mom \"Rock\" through a day of commutes, housework, and culture shock. I don't \"get \" the focus on plot and antics that some of the more \"serious\" reviewers are stroking themselves with. I paid $8.00 and didn't fancy myself being at a rock concert or a stage play, but I got all of that feel and more. I would have paid $30 just to see Baldwin grunged, and desperate but hopeful. Cruise's character looked shaky at first. But as usual, in trademark style, he starts off blasé and then explodes into passion and surprise. Paul Giamatti and Zeta-Jones were fun to despise in their hypocrisy. Hough and Boneta were fresh, talented and beautiful. Mary J. Blige (Justice Charlier) was superb, and although I never \"got\" Russell Brand before, he was the most fun of all. Leave your pretense at home. PLOT!? Yada Yada. If you are pushin' or draggin' 60, go pig out on some Italian and party with \"Rock of Ages\".","user":"joycebaker-401-57878","rank":[157,230]}]