[{"title":"Very poor!","rating":3,"date":"27 May 2015","review":"Despite being an adult nearing 30, I am still very partial to kids animated films and 90% of the time I thoroughly enjoy them. This film, however, was incredibly poor. The storyline and script but appalling and it felt really dragged out. It was also incredibly predictable. I was surprised by the lack of humour too. Obviously, this is aimed at children, my son, who is 4, watched it quietly. He is a dinosaur fanatic. He only seemed truly captivated towards the end when there was a little more action involving the dinosaurs but it certainly didn't get the rave reviews that other films like How To Train Your Dragon or even Disney's Dinosaur received. A rainy day DVD film at best - and that's if you're desperate.","user":"monkey_bean10","rank":[3,3]},{"title":"It's cute but average.","rating":5,"date":"14 November 2014","review":"It's cute, silly and slightly low-brow but it's a bit of animated fun. Overall the story is nothing special and feels pretty generic. There are parts that keep you engaged and other times the story seems to be lagging a bit. Not terrible though. I will say that the animation was pretty. All the characters looked like individuals and were uniquely special. It was something I was not expecting from a low-budget animated movie. There were also quite a few action sequences that were very well illustrated.<br><br>My final recommendation would be that if you have a young son who loves Dinosaurs then this is a great choice but you must love the subject matter to love the film. There just isn't enough substance otherwise.","user":"Shopaholic35","rank":[3,3]},{"title":"The voice actor cast deserved a better story and more focus to detail","rating":4,"date":"18 August 2014","review":"It took almost 18 months since the film's premiere in South Korea to reach Germany, but now it has. Being a fan of all kinds of animated films, I thought I'd give it a chance. I watched a German synchronized version, so I didn't get to hear the voices of some well-known American actors including several Emmy nominees and winners: Melanie Griffith, Jane Lynch, Rob Schneider and the Baldwin brothers Stephen and William doing the voices for the two main antagonists. The only one I'd like to emphasize is Tara Strong, not known by many, but with quite an impressive body of voice acting in recent years. Director Yoon-suk Choi was mostly involved with Korean non-animated television so far and the other director John Kafka brought some animation experience to the table from working on Rugrats or Ninja Turtles TV series.<br><br>Unfortunately, despite that (or because of that) the film only succeeded very rarely. It's really only for children who won't think about it in depth and just enjoy the images and funny(?) actions of the characters. There's no real deeper meaning or captivating action in this one. The whole coke OK the time machine subplot was pretty terrible I thought. Or the fact that he needed years to build the machine the first time, but now with the help of the mother from one of the disappeared kids it takes hours. Well.. I guess you shouldn't think about it too much or you could probably even criticize the concept of time travel as a whole.<br><br>The film had its moments though too. Many of these involved the dino-mum: the language barrier for example or the moment she realizes that she is not the main character's real mother was actually quite a bit touching. Surly and Sarco were truly intimidating, not sure if too much for smaller children and the fight sequences involving them weren't all that bad. However, the switches between the T-Rex mom and those two changed so quickly and randomly, it felt a bit strange. As a whole, I can't really recommend this film and it's really only a must see for people who want to see every animated movie there is.","user":"Horst_In_Translation","rank":[3,3]}]