[{"title":"Surprisingly Enjoyable","rating":7,"date":"4 January 2013","review":"I didn't even know this movie existed until I got an email about a private screening. I went just because I didn't have anything to do and didn't expect much. Anything with Sylvester Stallone is guaranteed to be your run of the mill, cheesy, action flick with guns, explosions and cheesy one liners. This is exactly what this movie was but this time I enjoyed it from start to finish.<br><br>First, I'd like to say that Stallone's on screen chemistry with Sung Kang is awesome. The dialogue between is always laugh out loud. I don't think I've a movie where Stallone's sarcastic sense of humor just made me let out a loud yelp of laughter but this movie did. Kudos to the writer for writing all those comedic one liners, every scene is guaranteed to make you giggle. Sung Kang was also enjoyable in his character of a determined, yet rookie cop from out of state trying to solve a murder case. Reminded me of Jackie Chan in Rush Hour, minus the strong accent. Also, Jason Momoa (besides being sexy) did very well as the villain of the film. Towards the beginning he was a little one note but as the the film progresses he starts to show off more and more. The twist at the end definitely allowed him to get more shine and let the world know he can do more than just be Conan The Barbarian. <br><br>The action in the movie was really enjoyable as well. There were times in the theater where all the watchers would cheer or let out a \"Damn\" or \"Wow\" because you literally could feel every punch, kick, slam, shot and everything else. The ending fight scene was my fave. Some of the cinematography and shots seemed a little off being that the budget for this film was slightly high. But overall, it's an enjoyable film. No complex script, no Oscar worthy acting, just a simple yet solid plot, good action, cheesy and funny one liners, believable characters and not too long. <br><br>I'd recommend this movie for all the true action lovers that don't always need a complex, layered storyline. Just a fun, action flick to watch on a Friday night with your buddies or maybe even date, if you're girlfriend is into that type of stuff!","user":"champjohnson29","rank":[107,143]},{"title":"Entertaining and Bloody","rating":7,"date":"28 January 2013","review":"In case you can't discern from the title, this is a *very* violent film, so don't be a putz and take your five or six year old kid, like a couple of people did at the Independence, Missouri AMC screening tonight. There are more triple-taps to the head than any film in recent memory, to the point that it becomes rather over the top by the time the film ends All that said, Walter Hill has woven yet another well-paced, engrossing buddy film actioner with a pretty good left hand twist. Stallone plays a weary New Orleans hit-man very convincingly, and with a very wry sense of humor. Were he any more droll, he would have to become a British citizen.<br><br>\"Bullet\" has everything an Action fan loves...really nasty bad guys, impossibly punishing fights, explosions, hot women, and main characters you can actually care something about. The plot isn't suspenseful, but it isn't meant to be, as our heroes go on what for one is a vendetta, and for the other a bumbling police investigation. Indeed, Sung Kang's Washington DC detective seems at times to have the insight of a rock, but Kang is pretty and plays well alongside the grizzled Stallone.<br><br>All and all, if you enjoy this sort of film, well...you'll enjoy \"Bullet to the Head\".","user":"Elspode","rank":[98,135]},{"title":"It almost feels like you've been thrown back in time to the 80s or early 90s!","rating":8,"date":"31 May 2013","review":"'BULLET TO THE HEAD': Four Stars (Out of Five) <br><br>Sylvester Stallone in a classic 80s style revenge action film directed by none other than Walter Hill (who helmed such popular 70s through 90s action flicks as 'THE WARRIORS', 'THE LONG RIDERS', '48 HOURS', 'RED HEAT', 'EXTREME PREJUDICE', 'TRESSPASS' and 'LAST MAN STANDING'). The film is based on a graphic novel (of the same name, when translated to English) by Alexis Nolent and illustrated by Colin Wilson. It was scripted by Alessandro Camon and puts Stallone in a buddy tale as a hit-man teamed with a cop out to revenge the killing of his partner. It also pits Stallone in a classic axe fight with Jason Momoa (of 'STARGATE: ATLANTIS', 'BAYWATCH' and 'GAME OF THRONES' fame. He also played Conan in the recent 'CONAN THE BARBARIAN' reboot). The film also co-stars Sung Kang (most well known from 'THE FAST AND THE FURIOUS' franchise), Christian Slater and Adewale Akinnuoye-Agbaje. It's a great throwback to 80s action flicks and Stallone and Hill fans should be thrilled with it.<br><br>Stallone plays James Bonomo, a hit-man in New Orleans who takes an assignment to kill a dirty cop, named Hank Greely (Holt McCallany), with his partner, Louis Blanchard (Jon Seda), but leaves a witness alive, a prostitute the cop was sleeping with named Lola (Weronika Rosati). Bonomo and Blanchard are later attacked at a bar by another hired killer named Keegan (Momoa). Keegan kills Blanchard but fails to defeat Bonomo in a bathroom brawl. Bonomo later learns that Keegan is working for a man named Robert Morel (Akinnuoye-Agbaje) who wants a file Greely had. Bonomo of course wants revenge for the death of his partner. A cop named Taylor Kwan (Kang) comes to town to investigate the death of his ex-partner, Greely, and pieces it together that Bonomo was involved. The two reluctantly team up to stop Morel and Keegan. The beautiful Sarah Shahi also co-stars as Bonomo's daughter, who helps him out when Kwan is in need of medical attention (because she's a tattoo artist).<br><br>The film, for me, had exactly the same feel as the old neo-noir revenge flicks from two to four decades ago (the same ones that Stallone used to star in or Hill used to direct). While watching it it almost feels like you've been thrown back in time to the 80s or early 90s! It's just great nostalgic fun and Stallone is perfect in it. Kang makes a great sidekick and Momoa is an awesome bad guy. It's of course perfectly directed by Hill as well (who hasn't changed at all in style in the last thirty-some years). The script isn't very deep and the lines are sometimes very cheesy but that's the way it's supposed to be. I enjoyed it more than 'EXPENDABLES' co-stars, of Stallone's, latest action vehicles (Schwarzenegger's 'THE LAST STAND' and Statham's 'PARKER'), which came out in theaters weeks apart from each other. They all underperformed greatly at the box office (especially this one) but people are idiots and have poor taste in movies (also all three will kill on video). It's a great B action film, the kind that Stallone and Hill are legendary for!<br><br>Watch our movie review show 'MOVIE TALK' at: http://www.youtube.com/watch?v=sH2nsN_uuBI","user":"Hellmant","rank":[56,75]}]