[{"title":"Gosh, aren't we all being a little too serious in these reviews","rating":7,"date":"9 March 2011","review":"Gulliver's Travels is fun, a fantasy, not taking itself seriously light comedy. You won't learn anything, you won't cry, you won't witness historic cinema in the making. You will spend an hour and a half watching an enjoyable family film that doesn't pretend to be anything more than a fun adaptation of an age old tale by Jonathan Swift.<br><br>I marked the film 7 because I enjoyed watching it, isn't that enough? Must everything be critiqued so much that we lose enchanting family films that just cheer us up momentarily.<br><br>Sometimes; Now this might upset the media studies students who seem to be taking over IMDb, sometimes I don't want to have to concentrate on plots and sub plots, sometimes I just want watch a film and escape for a bit, is that OK with you, must everything be Cannes fodder? If you want to have fun and watch a dumb romantic comedy watch Gulliver's Travels, if you're an over serious sneering sceptic... don't. It's that simple.","user":"jools_69","rank":[116,144]},{"title":"Farcical Send Up Of Jonathan Swift's Political Novel","rating":8,"date":"10 June 2011","review":"who really knows what jonathan Swift would have thought of this. some of it is done in the spirit of his original story and it even includes the shocking urination part of Swift's book and the anti-war message that Swift inferred. basically this is mostly a irreverent and silly send up of a serious political allegory. how can you even look at Jack Black standing around in unkempt cargo shorts, tennis shoes and a t-shirt and take any of this seriously?<br><br>mostly this film was cute and had very little of Jack Black's trademark racy humor. this was sort of like 'school of rock' meets fairy tale Disney. certainly the modernized, irreverent adaptation that had little to do with the novel seemed typical Disney.<br><br>probably the best thing about this is Black. that's good enough for me. Black is the reason why i watch his movies in the first place and i usually find him entertaining. i was one of those rare persons who found 'Year one' funny. it's a added plus here that the movie has good FX and production values.<br><br>if there is any \"real\" message to be found here, besides the fact that JB is always cute, is the obvious one, inside every little guy is a great big giant of a man waiting to emerge.<br><br>this movie is certainly dedicated to the \"little guy\" everywhere. i'm also sure the author Swift would also like us to remember one of the main themes of his original story, \"WAR! WHAT IZ IT GOOD FOR? ABSOLUTELY NOTHING!\".","user":"johnstonjames","rank":[13,15]},{"title":"Well, certainly it didn't blow my mind, at all, but it is fun, nice family fun","rating":6,"date":"3 January 2011","review":"Saw this one in 3D. First thing you should know: there's no reason to pay the extra money for the 3D version as pretty much the coolest 3D stuff I saw that day (saw it last Saturday afternoon) was on the trailer of the new Transformers movie. Second thing you should know: I'm not familiar at all with the book or with any of the other movies. Maybe that's why I'm one of the few ones here in IMDb who gave more than 4 stars to this movie. <br><br>Anyway, there's really nothing amazing going on here. The story is as predictable as you can imagine and well, Jack Black is yet again playing Jack Black. We all knew this, and frankly I don't think there's a person who can't tell how is this movie going to be like before seeing it.<br><br>I knew, and went to see it anyways as it was pretty much *the* movie of 2010's Christmas. I mean, I'm a sucker for Jack Black movies and even though the trailer never really convinced me, I had to check it out. Maybe The School of Rock and the Tenacious D movie (big fan of both) were more than enough for the punk rock Jack Black but it seems is inevitable to have him \"rocking\". So here some references to Guitar Hero and KISS are present. Jack Black is put as a sucker for rock music and movies, Star Wars especially. That simple thing delivers the best moments of the movie: Gulliver making the Lilliputians act Stars Wars and Titanic and perform as KISS. It ain't pop culture references heaven but definitely delivers the goods (also some Avatar references were funny). <br><br>Gulliver's Travels may not be Jack Black's funniest movie, but in the end it was just what I expected: a decent family entertainment that will be soon forgotten but that is enjoyable to watch.","user":"RainDogJr","rank":[51,74]}]