[{"title":"Nicely done","rating":6,"date":"6 July 2011","review":"Nicely shot, if slightly claustrophobic, thriller set in the 60's, that was better than I expected. <br><br>After a young woman is found setting fire to an abandoned house she is taken to the local asylum. There she meets 5 other young women, all patients because of various mental 'illnesses'. <br><br>What follows is a ghost story which, at times, had me quite spooked.It seems that the girls have upset someone who is unwilling to forgive them. Various escape attempts, therapy sessions and red herrings follow. OK, it's no classic, but it had a genuinely interesting story that kept me hooked until the end. <br><br>Well worth a watch","user":"lisakeenan72","rank":[58,73]},{"title":"Old school thriller","rating":7,"date":"4 April 2013","review":"I felt it was very drawn out. Tiny little pieces were given along the way and it built to a huge, twist finish. The characters were believable and there left enough unclosed at the end to make your own decision, without any confusion - it ended without ending.<br><br>It is very riveting despite the drab surroundings, the acting does grip you, the baddies frustrate, the goodies you want to cuddle and there's one mysterious character. The doctor, it's impossible to determine which side he is on.<br><br>Very good film by a great man. Not a John Carpenter classic but worth a watch.","user":"georgi_lindsey","rank":[17,19]},{"title":"Cloning Carpenter","rating":6,"date":"22 January 2011","review":"I'm 36 years old and in 1981 the first horror movie I saw was John Carpenters \"Halloween\". I was 6 year old and subsequently I became an úber fan of the Director. I've worshiped the great ones (Assault on precinct 13, Halloween, The Fog, Escape from New York, The Thing, Prince of Darkness) enjoyed the good (Christine, Star Man, Big Trouble in little China, They Live, In the mouth of madness, Vampires) and stomached the bad (Escape from L.A, Village of the damned, Memoirs, Ghosts of Mars). \"The Ward\" seems to fall into all of these categories. Sometimes it's great, more often than not it's good but regrettably when it's bad it's really bad. Perhaps it was the lack of a traditional Carpenter score (although the score by Mark Kilian is suitably haunting, memorable and atmospheric) or maybe it was the somewhat derivative \"jump\" scares or could it have been the inconsistent overall tone because to me it felt like I was watching a movie made by someone trying to emulate Carpenter rather than a movie by \"The Master\" himself. Don't get me wrong, technically it's excellent and it contains a few moments of genuine tension but there was something missing from the ingredients that make a great Carpenter movie and I think that something is called suspense. It's a shame really because with its eerie location, its linear, albeit uninspired storyline and its quirky characters this had the potential to bring the Director back to the top where he truthfully belongs but throughout I couldn't help feel that Carpenter's become jaded within the genre. His techniques that were groundbreaking during his prime have been exploited by every other Horror Director of the last 20 years. So instead of evolving above this and carving a revolutionary way forward as he once did so gracefully, Carpenters now imitating his old self and his techniques just don't seem to cut it anymore. To be fair it's an enjoyable and fast moving 88 minutes but from an old Pro like John Carpenter I was expecting something a lot more terrifying. When Carpenter reviewed his initial cut of \"The Fog\" back in 79 he found it plodding and just not scary enough so he went back and re-shot scenes then re-cut it into the classic it is today. I think if Carpenter had taken the same approach with this movie it could've been up there with the best of the best but something tells me that he's become indifferent, lost his passion and dare I say \"only in it for the money\". Over time I may grow to love this like I grew to love \"Prince of Darkness\" but as of right now it's left me feeling somewhat dis-satisfied.","user":"murnank","rank":[103,140]}]