[{"title":"I do like the story, but I absolutely dislike the misperceived origins from Croatia","rating":4,"date":"1 July 2012","review":"This movie is about an American photographer Bryan (who wanted to travel the world and take photographs of all the wonders he encounters along the way but he got stuck with taking photographs of pets in weird costumes) and a Croatian woman Masha (she wants to have her own dance studio) who are forced to get married so she can stay in the USA. The reason why he is forced to marry this girl he had never met, is because he had an incident with the cat (he was supposed to take photographs of her) which belonged to her mother. Her father is a mafia boss so he took that incident as a basis of making him marry his daughter but only on paper. Her father plans on marrying her for his best man when she gets a permit to stay in the USA and everything settles down. After the wedding,to fool the INS agents, they are also sent on a honeymoon. There she gets kidnapped and you would never believe who the kidnappers are (I will not tell you because it's one of the best parts of the movie). As you may have already assumed, they develop feelings for each other so he wants to rescue her without the help of her father. He is successful and she is returned unharmed to her parents. At that point her father agrees on them staying together but Bryan doesn't want to have anything to do with them anymore because of his near death experience and all the shooting and because her father is a criminal. The end of the movie is expected, it is a happy end but I will not spoil the surprise how it got that way. Maybe the best character in the movie is Ernesto, the guy who drives them around in a tropical resort and helps them along the way. He has the best jokes and the best unexpected (funny) behavior.<br><br>Now for the thing I hated most and was absolutely DISAPPOINTED with is the so-called Croatian origins. How could they not do at least a few minutes research to get at least one thing right??? I am from Croatia and I am insulted by it. The names (Masha, Vadik, Borislava...) and the accent they have and the wedding customs are all Russian, not Croatian in the slightest. And the music used on the wedding is Turkish/Russian... It is incredible how ignorant some people are. They needed a few minute research on the internet to pick some Croatian names, one of our songs for the wedding and one wedding custom to use. And what is with that accent of theirs? Typical Russian mafia accent used on the movies, Croatians are very adaptable and have a very easy ability to learn and pronounce other languages. In our weddings, we do not have the custom to shout \"Gorko, Gorko, Gorko\" (translation: bitter), so a groom would kiss a bride. It is disgraceful to use Russian style and perception under a Croatian name. If they wanted to use our country as the base of the story they should have learn about it and do at least one thing right. They completely misjudged and misused our name, our country and our customs. For me, that ruined the whole movie, the interesting story and quite a few very funny moments.","user":"ivana-ciglar-411-241017","rank":[37,49]},{"title":"Terrible, a complete waste of time.","rating":2,"date":"22 September 2012","review":"OK, it's a romcom, but does that mean it has to be dumb, unfunny, and trite? Obviously those who make such movies feel the movie viewing public must want their romantic comedies made like this. This film was made in 2009 and is just now seeing some viewing light. They should have kept it hidden and maybe burn all the copies. A complete waste of time. You can have as many decent actors in a film, but if the writing is poor and the script is an insult to our intelligence, you get what this film is - a mess! Nothing makes sense here, the acting is terrible but the script is so poor and filled with so many things we've seen before that most of us could write a better story without much effort.","user":"iraz","rank":[24,36]},{"title":"Silly Rom-Com! 3/10","rating":3,"date":"1 February 2014","review":"Review: This movie is more silly that funny. I found the leading character pretty annoying, and Vinnie Jones is playing his usual cockney hard nut, but if you don't take the movie seriously then it's just harmless fun. The storyline is really unbelievable, and the ending was pretty corny, but that's what you expect from a Rom-Com nowadays. I was surprised to see Kathy Burke in such a weak movie, but she didn't play a major role. As I hadn't really heard of this movie before, I didn't have high expectations so I wasn't massively disappointed. Average!<br><br>Round-Up: If this film had a leading character that wasn't so dumb, then it might have been half decent, but he just got on my nerves after a while. It's obvious that the director didn't really think the storyline through that well because it got ridiculous after a while. It just goes from one weird scene to the next, which makes its unpredictable in some ways, but silly in another. It was a waste of a good cast, except for the leading character, but you can tell that there wasn't a big budget so it shouldn't have been a massive lose.<br><br>Budget: $6million Worldwide Gross: N/A<br><br>I recommend this movie to people who are into there silly Rom-Com's about an arranged marriage that goes totally wrong. 3/10","user":"leonblackwood","rank":[13,18]}]