[{"title":"Why?","rating":3,"date":"17 June 2014","review":"Why would they remake a film by the master? The whole idea behind remaking films is to remake something that was maybe a good idea but had bad execution. The original Oldboy is a 10 top to bottom, story, script, action, actors, direction, why did they try to remake perfection. <br><br>Josh Brolin is good but when you start comparing him to the pain and anguish Min-Sik Choi convaed in the Korean version there is no way to compare the two. Also I like Spike Lee and some of his work but he was the wrong choice for this. <br><br>Still not sure who thought this was a good idea, it's like eating a McRib when you can have Korean BBQ, which one sounds better to you. Watch the Korean version.","user":"davidlee2014","rank":[186,230]},{"title":"Simply put, some movies should never be remade.","rating":4,"date":"28 November 2013","review":"Simply put, some movies should never be remade. \"Oldboy\" serves as a stark reminder with only a few exceptions: Americanized remakes of beloved and admired foreign films inevitably result in disappointment. For viewers unfamiliar with the history behind Spike Lee's \"Oldboy,\" the 2013 film is a remake of the cult-classic 2003 South Korean film of the same name, directed by Chan-wook Park. The Korean masterpiece possess a highly stylized, gritty sensibility while providing an emotional depth to its characters. Iconic director Spike Lee's \"Oldboy\" is as a handsomely shot piece of genre entertainment, but it fails in its attempt to define itself, resulting into a completely pointless, watered-down underwhelming thriller.<br><br>An alcoholic whose life is falling apart, Joe (Josh Brolin) is far from the ideal father who is willfully neglecting his three-year-old daughter, Mia. Drugged and kidnapped one night, Joe awakens in a small room with a television, only to learn that he's been framed for the murder of his ex-wife, and will spend the next 20 years trapped in this cell where he is held as a prisoner. During the duration of his imprisonment, he trains his mind and body for escape attempts while pouring his heart out to Mia in letters. After two decades of torment, Joe is suddenly set free, seeking out an old friend Chucky (Michael Imperioli), and meeting Marie (Elizabeth Olsen), an advocate for the homeless who helps him in his cause. Hunting for the individual who locked him away, Joe spares no one as he works his way to Adrian (Sharlto Copley), a deranged man masterminding the mystery Joe and Marie are now determined to solve.<br><br>Director Spike Lee, working from a screenplay by Mark Protosevich \"I Am Legend\" (2007), chooses to simply rehash the plot for his American remake, and quickly rushes through the unusual and unique storyline unable to establish an emotional connection with the audience which the original film develops so well. Lee's picture clocks in at a lean 104 minutes, 16 minutes shorter than Park's \"Oldboy.\" As a result, the storytelling is rather straightforward, and it forces Lee to rush through crucial sequences which are not given the adequate time to develop. Subtly goes by the waste side, and almost abandoned completely early into the third act in favor of expeditious explanations.<br><br>The remake remains largely faithful to the story of the 2003 effort, but seriously lacks in intensity and a sense of meaning. The original film achieves a sublime blending of ultra-violence with extreme art, while the remake feels bogged down in its copycat status, and its overall lighter tone hampers its enigmatic, disconcerting story of revenge. My advice is to avoid this altogether, pull up the original on Netflix, and deal with the subtitles America.","user":"nesfilmreviews","rank":[330,420]},{"title":"Not a movie but an insult to the original","rating":1,"date":"28 November 2013","review":"THIS WILL BE A SPOILER FREE REVIEW! (Except for the ending, but don't mind, i will warn you) <br><br>First of all, excuse me for my writing, i'm not a native English speaker.<br><br>So, i got the \"chance\" to see the oldboy remake yesterday in a sneak preview. I left the cinema shaking of anger, and i wasn't the only one. Maybe my rating of 1 is a bit to harsh, maybe i would have given it a 3 if i didn't know the original, but i did, and i had to compare the 2. And in that comparison the movie is just an insult.<br><br>The original was incredible poetic (especially in its visuals and its dialogue)and had an incredible good script. The characters were super plausible and likable. In the remake everything that was special about the original got lost.<br><br>The poetic overall tone from the original is absolutely lost and got replaced by pure clichés. So there's nothing to win on the aesthetic side The plot twists where also changed from the original, but here is the big problem: They don't work!! The characters are totally unlikeable and their relationship feels so incredible forced and constructed. The final twist is so incredibly dumb because the motivation of the bad guy to do the things he does just doesn't seem to be anywhere near realistic (and is a shame if you know why the original \"villain\" did the things he does). I will explain this later, but i have to spoil the hell out of it to do so.<br><br>Another thing that made this movie bad where the action scenes. Some of them were pretty brutal and seemed a bit out of place. But the worst are the scenes that they took from the original (if you know the original i think you can guess which one i mean). I couldn't get rid of the feeling that they wanted to satisfy the fans from the original by \"adding\" classic scenes, but they just do it way worse. Especially the one legendary scene from the original feels so brutally out of place. They forced it to be there cause they thought it HAD to be there.<br><br>So, if you don't know the original movie, just go watch this one instead, even as a standalone film oldboy isn't good cause it builds on relationship and charactermotivations that totally felt forced and driven by clichés.<br><br>If you're a fan of the original avoid this movie at any costs cause it will only make you angry... i even shouted a loud \"F*** YOU!!!\" to the screen and got applause for it. Trust me, its healthier for your blood pressure to not watch this movie.<br><br>And now some little extra explanations with BIG SPOILERS!!!<br><br>He knows about his daughter the whole time!! He sees a TV-show about his case where they interview his daughter, so he knows how she looks. But once he is released they tell him that they captured his daughter so his biggest motivation is to find his daughter (they only tell him if he can explain why they imprisoned him)!! So his major motivation is to find his daughter and not just to solve the puzzle!! Well, not my kind of change (i don't know... it kinda felt pretty cliché the villain really felt like a bad villain, while in the original he was just one mysterious, but kinda human, guy), but okay why not. At least i wanted to know the ending, so there was a reason not to leave the cinema.<br><br>Now the twist: The TV Show was staged and the woman he fell in love with during his revenge was actually his daughter. Not a bad change, but the real problem is that NO ONE is actually interested in their love! The whole story point that they fell in love with each other was so incredibly bad executed!! It just felt like the biggest cliché of the movie, they absolutely wanted a love story in the movie (cause hey... there must be a love story in every movie, must it?!). But it absolutely doesn't feel real!! So just nobody seemed interested in that plot twist!!! And why did they do this? Cause the whole family of the villain got raped by their father! And Josh Brolin saw how his sister had sex... he didn't even knew that this was her father. He just told a few people that she had sex!! And then the father decided to kill the whole family... WHY?!!! No one knew that it was her father... no one could knew!!! So the villain is not the loving brother from the original, its a sick guy that got raped and now want josh brolin to feel the love he felt!!! REALLY?!!! ARE YOU KIDDING ME?!!!! In the original the whole thing was an incredibly sad story build around a small fault with a big impact the main character did once... And the whole story felt human and realistic! And now we have a dehumanized psychopath with weird motivation that forces us into a final plot twist we are absolutely not interested in!!<br><br>This is not a remake, this is a disrespecting insult to the original. I hope that people will not associate oldboy with this movie and will instead go watch the original","user":"king-kahuna","rank":[281,374]}]