[{"title":"Very solid","rating":8,"date":"10 March 2013","review":"I read some of the reviews here, and I think that some who have reviewed this extremely negatively (as in 1/10) are those who appreciate a movie with lots of explosions, and maybe some guys with their tops off, flexing their muscles to accentuate just how tough they are.<br><br>Luckily, there isn't much of that in Stand Up Guys. It's character-driven, centered on the relationship between Val (PAcino) and Doc (Walken), both of whom are spectacular.<br><br>There's some great dialogue between the two, and despite what you may read on here, the story is quite solid, if simplistic. I don't think people have fully grasped these characters in some reviews, or the meaning of the title \"Stand Up Guys\". They're throwbacks, and the situations they encounter represent the direction the world has headed over the years, a world that Doc is forced to be a part of, despite wanting a quieter life.<br><br>I won't go on any further, but I found the characters endearing, and the relationship between Val and Doc kept me on the hook.<br><br>Nice soundtrack, too.<br><br>Cheers","user":"b-meyers","rank":[133,156]},{"title":"You Gotta Love Pacino and Walken Together","rating":10,"date":"12 November 2012","review":"\"Stand Up Guys\" is a reunion of elderly gangsters. Alan Arkin, Al Pacino and Christopher Walken are in their twilight years, after long careers as mobsters. This Noah Haidle scripted black comedy is a treat for the ears, as these New York wise guys reminisce about the past. The soundtrack of blues greats and Jon Bon Jovi songs is perfectly on point.<br><br>Impressions of Walken are fun, but Walken himself does the best Walken. You crave more lines from him. Pacino is at his best here, and great Pacino? Forget about it. <br><br>After serving 28 years in prison, Pacino is released. His best friend, played by Walken, picks him up in a car that was probably new when Pacino began his sentence. Walken takes his friend out for one last night of partying before Walken must kill him to fulfill a contact put out by the mob boss.<br><br>Walken and Pacino rescue Alan Arkin from a rest home, where he is fading away. Arkin is resurrected to be the wheel man to drive a stolen car on their last night out. Along the way, they meet a variety of quirky and interesting people. <br><br>Understated, extremely fine acting make this one of the best films of Walken's or Pacino's careers. Seeing them together is like savoring the finest of fine wine. See it.<br><br>Great script, great acting, great music. What else do you need?","user":"ligonlaw","rank":[116,140]},{"title":"Walken and Pacino - Just like bacon and eggs but even better","rating":9,"date":"17 January 2013","review":"The film has a nice genuine feel about it, great story, great acting and a great soundtrack that compliments the film and characters! I found myself getting sucked in to the characters and as much as I enjoy seeing Walken act and hearing his dialogue, Pacino was great in this film too. He's not an angry mobster but a likable criminal one of his best films I think. Walken doesn't give us the old stories that we are used to but his presence is just perfection.<br><br>Do not expect this film to be full of gangster violence and action, this is the other end of the career. Experience and heart goes a long way.<br><br>I have to say that if this film was made with a different cast I think it would have been slow and easy to miss, walken and pacino make the film as genuine as they come.","user":"d0wen","rank":[177,222]}]