[{"title":"highest accolades","rating":9,"date":"18 August 2013","review":"I'll start by stating that I'm a 62 year old white male. I did not grow up in the South - but I did live for a year in Louisiana in the early 70's. I lived through every news event that was portrayed in the movie - that is, I saw and read about them in the actual news when these things happened. Many posters on the boards say that the movie is inaccurate. Then they go on to say things like: His name was changed, he didn't have 2 sons, he didn't look anything like Forest Whitaker, Nixon was miscast, etc. True, the details of The Butler's family life have been dramatized. That is called movie making. The movie was historically accurate in every important way. I don't say that every single detail was true, nor am I saying the portrayal of these historical events was 100% exactly as portrayed. But it is far more accurate (and important) than your average popcorn POS that pervades the theaters these days. I want to state that I have rarely, if ever, been as emotionally affected by any movie. It is brilliant, provocative, artistic, and has a social purpose. Like it or not, persons of African descent have been victimized, downtrodden, brutalized, persecuted, tortured, lynched, raped, and murdered - and only because of their skin color. HOORAY to Lee Daniels for making this movie! Hooray to Forest for being a sensitive, intelligent, highly gifted actor. Hooray to Oprah, whose performance is beyond stellar. Hooray to anyone involved with this movie. Not to say that ALL movies have to take you to the places that this movie does. I guess there is a place for Pacific Rim and Wolverine. So if you think that movies have no business delving into our racist and brutal history, then see one of those movies. But to say that this movie is irrelevant or inaccurate - well, as I said I lived through it all. It is not. What it is, is an exceptional, mature movie for those that want a little more than monsters (the fictional kind). My wife and I went through a whole packet of tissues - we were blubbering like fools. BRAVO!!!!! 9 (rather than 10) stars only because the 10 star reviews are often discounted as over- the-top hero worship. But if Ironman, The Avengers, etc are 10 stars (and I liked those), this movie rates 100 stars - because it is 10X better, more important, more relevant, and more thought provoking.","user":"marfrie56","rank":[458,619]},{"title":"Civil Rights 4 Dummies & Stunt Casting. But Whitaker is GREAT.","rating":5,"date":"20 August 2013","review":"There's a scene about halfway through Lee Daniel's \"The Butler\" that is perfect. <br><br>African-American White House butler Cecil Gaines (Forest Whitaker) asks his boss, Mr. Warner, for equal pay for African American staff. They are paid less than white staff, he complains. The audience has been watching Cecil Gaines for a while now, and we know he is an admirable man. He certainly deserves equal pay. <br><br>Warner tells Gaines that if he is not happy with his salary, he can go work someplace else. <br><br>Gaines is trapped in an invisible prison of white supremacy, and he knows it. Whitaker's face shows all the agony of that moment. He quietly leaves Warner's office. <br><br>Forest Whitaker is utterly brilliant in this scene, as he is in the rest of this choppy, heavy-handed, misguided film. <br><br>That scene is worth the entire rest of the film \"The Butler.\" That scene has everything the rest of the film lacks: subtlety, intelligence, and faith in its audience. <br><br>Otherwise, \"The Butler\" is Civil Rights for Dummies plus an overload of stunt casting. <br><br>\"The Butler\" tells the story of Cecil Gaines, an African American White House butler. The movie tells us it wants us to pay attention to this humble, working class man. The movie depicts none other than Martin Luther King Jr, right before his assassination, delivering a speech on the importance of domestic workers. <br><br>But the movie belies its own message. \"The Butler\" doesn't have faith in its audience. It believes that we won't pay attention to this humble, admirable butler. So the film dumps one big Hollywood star and tabloid celebrity after another in small roles, and the film beats us over the head with a dumbed-down, sensationalized, hate-whitey version of Civil Rights. <br><br>Stunt casting: Mariah Carey is on screen for about two minutes as Cecil's mother, and Vanessa Redgrave is on screen for about three minutes as his first employer. The casting of the presidents Cecil worked for is flagrantly weird. It's as if the movie wants to set the audience abuzz over why this or that actor was chosen. John Cusak as Richard Nixon? Alan Rickman as Ronald Reagan?? Robin Williams as Dwight Eisenhower??? Jane Fonda as Nancy Reagan???? Did the people who cast this film take any of it seriously? James Marsden, though, is fine as JFK. <br><br>Oprah Winfrey plays Cecil's wife, Gloria. Oprah gives a fine performance. The problem is, she is Oprah Winfrey, and her presence as a celebrity never left my mind as I was watching her. Rather than being moved by the plot, my mind wandered. I thought about her recent public scandals, the Swiss purse incident, and calling Trayvon Martin a modern Emmet Till. I thought about her boyfriend Steadman. I wondered why he has never married Oprah. Again, Oprah's performance was spot on, but the script was not compelling enough to allow me willing suspension of disbelief. <br><br>The film's dumbed down version of Civil Rights is aesthetically and historically criminal. In the first five minutes of the movie, the film depicts two African Americans lynched together beside an American flag. They remain on screen for quite a while. The film returns to the image. A black woman is raped by a white man. Again, weird casting: Alex Pettyfer, one of the most handsome men in the world, is the rapist. Why? Then a black man is killed. The n word is tossed around liberally. Crosses are scary – the Klan burns one and attacks a freedom rider bus. The film eventually states, in so many words, that America was a \"concentration camp\" for African Americans for hundreds of years, worse than what the Nazis did to the Jews. <br><br>All the whites on screen are rich and powerful. All the blacks, including the Black Panthers, are good, innocent, humble, hard-working, harmless. The Civil Rights movement is all but exclusively black. <br><br>This just isn't true. Comparing the Holocaust to slavery and Jim Crow isn't accurate. The Black Panthers did some very bad things, including to their own members. Thousands were lynched, not millions, thousands of those lynched were white. The largest mass lynching in America was of Italian immigrants; Leo Frank was lynched for being a Jew. <br><br>African Americans made up roughly ten percent of the population; had whites not been part of the Civil Rights Movement, African Americans could never have achieved what they did. The film insists that the Civil Rights Movement was inspired by a \"brown man,\" Gandhi. But in fact Gandhi was inspired by Tolstoy, Thoreau, Christ, and the Bhagavad Gita. The film alludes briefly to Andrew Goodman and Michael Schwerner, but does not name them. The film refers to these Jewish Civil Rights martyrs only to cynically dismiss their sacrifice. Americans only care about dead whites, the film says. If that were true, the Civil Rights Struggle would not have achieved what it did. Jim Zwerg, a white man, endured a horrible beating on one freedom ride because he, like many Civil Rights heroes, was inspired by the Judeo-Christian tradition. <br><br>I've lived in the Indian Subcontinent, where the religiously mandated caste system, for millennia, has doomed Untouchables to lives in Hell. I lived in Africa, where the slave trade still flourishes. From a world perspective, the United States is not remarkable because it had slavery and Jim Crow. From a world perspective, the United States is remarkable because it produced the Abolitionists, John Brown, martyrs like Goodman and Schwerner and Viola Liuzzo and heroes like Jim Zwerg and Rabbi Heschel. \"The Butler\" presents an unbelievable conundrum – a country populated exclusively by evil, rich white supremacists somehow magically changed in 2008 and elected an African American president and presto changeo everything was better for black people.","user":"Danusha_Goska","rank":[218,347]},{"title":"\"Those Who Ignore HistoryAre Doomed to Repeat It!\"","rating":9,"date":"8 February 2016","review":"..........................................................from Pasto,Colombia...Via: L.A. CA., CALI, COLOMBIA....and ORLANDO, FL <br><br>******** POSSIBLE MINOR SPOILERS ********* <br><br>There are, undoubtedly, scenes in Lee Daniel's The Butler that made me feel quite uncomfortable. Most certainly, many other viewers will echo similar discomfort experienced while watching this near great movie. Unfortunately, the existence of atrocities and flagrant injustices in our not too distant past doesn't mean that they should be whitewashed or airbrushed out of our collective memories! (Absolutely no pun intended here) <br><br>Don't let me give you the wrong impression about The BUTLER. In just over 2 hours until end credits, there are but a scant few minutes of images that some of us would, perhaps, just as soon forget. At the heart of this remarkable film, is a tale of a great generational divide between estranged father and first-born son; redemption, change, forgiveness, repentance and catharsis are also pivotal elements in this \"Inspired by a True Story\" drama painted on a historical backdrop canvass.<br><br>Although The BUTLER does highlight the tremendous progress our society has made in the past century toward fulfillment of Dr. Martin Luther King's \"Dream\", obviously, there is an undercurrent underscoring the fact that this area is one that involves constant self-reinvention to ensure continued improvement.<br><br>There are multiple noteworthy elements here. First, Oprah Winfrey's triumphant return to an on-screen leading role. Despite having done numerous voice-overs in recent years, BUTLER represents the end of a 15 year hiatus, when she participated in the ill-fated BELOVED. Her performance, although not quite Oscar nomination caliber, would win, without a doubt, an Academy Award for best \"Billionaire Female Actor on the Planet\", if such a prize existed! Accepting this role surely resulted in reduced income for Oprah in 2013. If that doesn't make her participation in this project a \"Labor of Love\", what would? <br><br>BUTLER is my pick for 2013 Best Ensemble Performance Golden Globe. Cast Credits give the impression of a page lifted directly from a Who's Who in Acting &amp; Entertainment! Cuba Gooding, Jr.; Robin Williams, in a refreshing, but brief, appearance as a pensive and soft-spoken President Eisenhower; Vanessa Redgrave; Clarence Williams III; James Marsden as President Kennedy; John Cusack, as an ever brooding and duplicitous President Nixon; David Oyelowo, as the rebellious prodigal son; Terence Howard; Lenny Kravitz; Mariah Carey; Jane Fonda, who sparkled as Nancy Reagan and Alan Rickman as her careful-not-to-step-on-her-toes husband, Ronald! The only weak link, in my opinion, was Liev Schreiber as President Lyndon B. Johnson. His portrayal just did not resonate with me.<br><br>Quite frankly, despite analyzing carefully for any historical missteps, there were only a couple rather minor ones that were noticeable. About three-quarters into BUTLER, the story-line, focus and viewer interest level seemed to sputter a bit, but got right back on track rather quickly.<br><br>The film did attempt to provide moments of comic relief from the oftentimes somber on-screen events, most of them evoking healthy laughter but a handful of them kind of fell flat. If it weren't for these few mentioned flaws, BUTLER most definitely would have been rewarded with a 10*Star* rating! When released on DVD, rest assured it will be added to my 800+ collection! <br><br>.ENJOY/DISFUTELA!! <br><br>Any comments, questions or observations, in English o en Español, are most welcome!","user":"TonyKissCastillo","rank":[19,25]}]