[{"title":"Really Not Good!","rating":2,"date":"1 December 2013","review":"I love movies and I also will check out most independent produced pictures as well. When I saw this had a small but functional budget, I gave it a chance.<br><br>All I can say is this. The best acting in this movie came from the animated creatures. <br><br>The script is weak and they managed to include almost every stereotype that has ever existed, yet not one of them could act!<br><br>Seriously, you will spend time that you can never get back and life is just too short to care! Don't waste your time.<br><br>Just my thoughts!","user":"yourlife","rank":[18,22]},{"title":"You're better off staying well clear from this ranch!","rating":1,"date":"21 December 2013","review":"Even from the trailer, Raptor Ranch from the get go was one such movie to not expect too much from and to not take too seriously. The trailer did look sort of fun, if in a guilty-pleasure sort of way, and any movie deserves to be seen fairly. Sad to say that from personal opinion Raptor Ranch is every bit as bad as the reviews and ratings here say(and no I am not one of those immature people who voted 1 literally a year before Raptor Ranch was even released), one of those instances where the ridiculously hyperbolic IMDb plot summary is more entertaining than anything in this movie put together. Even for a low-budget movie the movie looks cheap. It has a very drab look, is edited awkwardly often and the dinosaurs not only move with such stiffness but they are poorly designed and textured- they would belong more at home in perhaps 70s-80s high school art projects- as well as not blending at all within the backgrounds. The soundtrack is at best forgettable and it adds little if at all to the movie. The dialogue sounds improvised judging from the delivery and sounds incredibly stilted, the humour often forced. If you're looking for any excitement, suspense, tension and surprises, look somewhere else, the storytelling is incredibly simplistic and predictable with a story that is nowhere near enough to sustain the length, even before the ending you can tell they were running out of ideas. Raptor Ranch tries to incorporate different genres, like horror, thriller, comedy and action-adventure and because of primarily the forced humour, the complete lack of creativity and the atmosphere being next to non-existent it fails miserably at every single one. You don't engage with any of the characters, it is true that every stereotype seems here and they are written very poorly, coming across as obnoxious and spoilt brats. In fact you find yourself rooting for the dinosaurs and they are also the best actors, that's saying little because they also have a lack of personality so you cannot relate to anything that goes on within the story and what's happening to the characters. When the dinosaurs' acting is little to write home about, that goes to show actually at how awful the acting is, it doesn't even look like acting. The action is limp and even the death scenes lack originality and suffer from the worst of the editing, the only thing that they succeed in doing is that you are secretly glad that with every killing that there is one less annoying character to \"care\" about. All in all, an amateurish mess(so much so it is very difficult to find a shred of entertainment value), prehistoric terror is a far from apt description and it is best left forgotten. 1/10 Bethany Cox","user":"TheLittleSongbird","rank":[15,20]},{"title":"So messy it should be Raptor Ranch Dressing...","rating":2,"date":"5 December 2013","review":"Well, this movie had prehistoric raptors and Lorenzo Lamas... So what could possibly go wrong?<br><br>Aside from just about everything?<br><br>This movie was really awful, sorry for being so direct and blunt. But it needs to be said. The 2004 \"Raptor Island\" movie, also with Lorenzo Lamas in it, was equally bad. And yet there is something alluring to these kind of cheesy movies. Perhaps it is the fact that you know it is going to be bad that makes you want to sit down for a laugh or two.<br><br>The story here is about a strange, old man who apparently has been creating dinosaurs on his farm (for some odd reason we don't get to know why, much less to be told just how about he went doing this). A local native girl, along with a singer and his groupies and three young college friends become stuck in the small town, terrorized by the prehistoric raptors. And called to the case are two federal agents.<br><br>Right, this storyline was really not believable in any sense, and there were just so many things that didn't make sense throughout the movie. And for being federal agents, then I must say that those two in the movie were about the most ineffective and lazy of agents around.<br><br>There was no excitement, thrills or scares throughout this movie. And the pace just trotted ahead in a very monotone pace, which actually cased me to nod off two or three times along the movie. And I can't claim that dozing off here and there caused me to miss out on anything crucial to the storyline.<br><br>The dinosaurs were awkward and badly animated most of the time. However, once in a while they did actually come off as believable enough. However, don't expect anything near \"Jurassic Park\" in any way.<br><br>The dialogue throughout the movie was unbelievably forced and stuttering. There was no natural flow, and most of the actors and actresses weren't really helping the movie along in a positive way.<br><br>You know very well how this movie is going to be, and sure enough, it turned out to be exactly as bad as expected.<br><br>There might be some odd enjoyment in this movie if you are a head-over-heels fan of anything even remotely tied to dinosaurs. But for us regular movie watchers, nah, not so much to come here for...","user":"paul_haakonsen","rank":[10,15]}]