[{"title":"finally a zombie flick reminiscent of the good ol' days!","rating":8,"date":"19 September 2011","review":"this movie is great. i briefly recall seeing the poster for it a while back but i'd since forgotten about it up until the other day when i took a gamble on watching it and was happy within the first 10 minutes after seeing the style and effects.<br><br>like another reviewer stated, the movie is shot on 35mm film, not on digital like modern Hollywood flicks. this gives it a very classic look and feel, reminiscent of the George a Romero film like dawn of the dead in '78 and day in '80.<br><br>the zombie effects and makeup as far as i could tell used no CGI whatsoever and the gore, though not too frequent, looks great when it's on screen.<br><br>the undead are also nearly always on screen, and combined with their excellent makeup, great camera work and complete lack of unnecessary music, have a very menacing feel as they creep up on the films 2 protagonists.<br><br>the films setting is beautiful and a fantastic change from the norm's of busy city streets and urban environments. it is shot in west African locations such as Burkina Faso and Ghana, as well as the Sahara desert. it really is a breath of fresh air in the zombie movie genre.<br><br>the story is fairly simple. an American military engineer washes up on the coast of west Africa after his evacuation flight crashes. as the sole survivor he attempts to reach a northern military air field to re-attempt his escape, and runs into a soldier of the African military who is trying to find his son during the chaos.<br><br>overall i give this movie an 8 out of 10. and that's only because i wasn't keen on the acting by the American protagonist played by Robert freeman, and a couple small sections of the movie are quite slow.<br><br>the film does leave itself open for the possibility of a sequel and i would be more than happy to watch it if it mirrors the quality of this.","user":"adamcarlton","rank":[84,103]},{"title":"A Serious Slice Of Zombie Horror","rating":17,"date":"17 October 2011","review":"The dead are returning to life and attacking the living. After surviving a plane crash American Air Force Engineer Lieutenant Brian Murphy teams up with a local army Sgt. Daniel Dembele and they try to stay alive in dead infested war-torn Africa.<br><br>It's well filmed with the competent naturalistic visual style reminiscent of Monsters, less is also more in The Dead's case. Imran Ahmad's music score complements the on screen deeds and while not particularly memorable it is subtle and effective enough.<br><br>The African setting is a welcomed change, the on location shoot gives it an eerie real feel. The costume design appears authentic. Dan Rickard's special effects and Max Van De Banks' makeup are first rate, bones sticking out of legs, wounds, bites and the dead getting hit and shot at are executed perfectly. The traditional shambling sluggish dead are creepy enough and retain an air of menace.<br><br>The zombie/virus market has been saturated with countless sub-par films. There have been a few welcomed additions arguably - the Dawn of the Dead remake, cross genre Australian film Undead, 28 Days virus flicks, comedies including Shaun of the Dead, Zombieland and actioner Le Horde, Eaters, Mutant to name a few. I personally I like sober zombie films and The Dead is probably the most grounded undead film since Romero's original trilogy. Director and writer team Howard and Jonathan Ford manage to give their zombie offering scope, emotion and anxiety that arguably lacked in Land and Survival of the Dead respectively.<br><br>Due to the constraints of the story there's little dialogue. That said, what there is rings true and the characters are given time to develop. The acting all round is of a high standard, with fitting performances from both leads Rob Freeman and Prince David Oseia.<br><br>My only grumble is that there's been so many zombie films lately it mars the freshness that The Dead delivers. Intentional or unintentional as with Romero's films there is indeed a social commentary running though The Dead and the African setting is debatably no accident. The Dead may lack comradely wordplay but it doesn't try to reinvent the wheel.<br><br>Overall, The Dead gives the viewer a much needed solid piece of realistic zombie entertainment. Recommend.","user":"amesmonde","rank":[32,38]},{"title":"\"Return of the Romero Zombies\"","rating":7,"date":"26 September 2011","review":"This is a zombie movie in Africa which contains old school, slow walking zombies. The lead characters are people with families who are just trying to get home or find their loved ones. They are not trying to solve the mystery of the outbreak, which makes it a simple, but very entertaining piece of film.<br><br>There is a huge difference in picture quality; Sometimes you are looking at dark images with too much artificial grain, at other times you are seeing beautiful African scenery with some nifty shots. Meanwhile, the undead are never far away. This resulted in the best feature of the whole movie; you never felt safe EVER. The threat of slow zombies always shambling towards the main characters gave me that freaky feeling only Romero delivered. It worked.<br><br>This movie doesn't really excel at anything, but it is still very enjoyable. It has some minor continuity flaws (like cleaning a blood smeared face with just a dry cloth) but it doesn't get in the way. It doesn't deliver perfect acting, but it isn't terrible to watch either. It lacks a film score but there's still enough tension without it. Even with these minor flaws, I feel The Dead was a welcome change in the zombie genre and I would recommend it to any zombie fan.","user":"jarlian","rank":[42,53]}]