[{"title":"one of the most underrated movies ever","rating":8,"date":"19 March 2019","review":"I'm disappointed to see that this film still hasn't garnered the attnention it deserves. Even back when it came out it did so pretty quietly and was thus buried under other big budget flicks. Rarely though does a comedy keep you entertained and laughing throughout pretty much the entire film. Most comedies try and fail, or take breaks from the humor with someone else to preserve material. But Ferrell and Wahlberg play off of eachother perfectly in this film and have real chemistry to keep the film quality high. This is also one of the mostquotable films ever. 9 years later and my dad and I still shoot off a \"I'm a peacock captain, you gotta let me fly\", or a \"if I were a lion and you were a tuna I'd swim out to the middle of the ocean and freakin eat you\" every once in a short while. I definitely recommend this movie for fans of comedy","user":"ratpackaustin","rank":[51,56]},{"title":"The Other Guys: An Excellent Action Comedy and Satire","rating":10,"date":"29 October 2018","review":"I have to say, I did not expect this film to be as good as it was. Another great addition to the buddy cop genre, as well as a satire of it, this film has huge laughs, and good action sequences. I really can not for the life of me understand why this movie catches so much hate as I've seen in other reviews here. Yes, there are some weak points, as with any movie, but the good HEAVILY overshadows the bad.<br><br>Will Ferrel and Mark Wahlberg star as Allen Gamble and Terry Hoitz, two under-achieving New York cops who, along with everyone else on the force, live in the shadow of the two super-cops, Christopher Danson (Dwayne Johnson) and P.K. Highsmith (Samuel L. Jackson). When an unexpected turn of events puts Danson and Highsmith out of commission, Allen and Terry decide to step up and take on an investigation of their own, leading to a tangle with foreign operatives, and an arrogant billionaire.<br><br>The Other Guys knows what it wants to be, and it achieves its goal in spades. People should know what they're getting into with this, as it delivers exactly what it advertises; a spoof of the 'buddy cop' genre, and a fast-paced action comedy for anyone to enjoy.<br><br>I don't understand how a lot of people cannot find anything in this movie funny. From start to finish, I found it hilarious, and laughed out loud several times. There's just as much smart humor and witty interplay between characters as there is random, often weird humor that is present in many of Ferrel's films, and the writing manages to balance the smart humor and the random, sometimes dumb humor very well. There are definitely some loud, sometimes obnoxious moments, such as Ferrel's occasional outbursts, and his 'Gator' emotional episodes, especially the \"Pimps Don't Cry\" music number, but aside from those small instances, I really had a ball watching this.<br><br>The movie starts, and ends, with action, and in between are a bunch of great moments. There's an intense opening car chase, a parking lot fight scene, an office building shootout, and an intense-action-packed final car chase and standoff that I really enjoyed, especially considering the tone of the film. I think it's important to note that even though this film is, at heart, a comedy, the action remains serious, and it's never really slapstick or funny. The first and last car chases were especially entertaining, and they felt very \"Bad Boys\"-ish.<br><br>Ferrel and Wahlberg have great chemistry, and their constant bickering and clashing of personalities really is consistently funny. They both throw themselves into their roles, and their dedication made this movie that much more fun. Ferrell is hilarious, time and again proving himself as one of the best comedy actors out there (you can't help but laugh just by looking at him), and Wahlberg is one of my favorite actors, so it was a joy to watch them together. Michael Keaton also delivered a hilarious, underrated performance, so props to him.<br><br>Overall, I highly, highly recommend it, to both fans of the genre, and fans of the actors. 10/10.","user":"monkeysgalore","rank":[28,32]},{"title":"I couldn't stop laughing","rating":9,"date":"5 June 2016","review":"I don't normally write reviews but after reading some of the awful reviews some people wrote about this film I had to come to its defence.<br><br>This film had me laughing from start to finish. If you like the silliness of Will Ferrell films or the humour in Ted then you will love this film. The comedy can be played very deadpan despite the surrealness (is that a word) of the situation. The comic timing is great and the chemistry between all the main characters is excellent. When I saw this film only had a 6.7 IMDb rating I was a little reluctant to watch it but I saw the trailer and that drew me in. I didn't regret it.<br><br>If you want some great laughs, watch this film.","user":"Clarets2016","rank":[19,23]}]