[{"title":"A winner","rating":9,"date":"19 March 2009","review":"I lived in Turkey when Mahsun Kirmizigul was a folk(arabesk) singer then I moved away...<br><br>I'm a rock/hip hop woman, I never paid much attention to him; always thought his kind of music was \"beneath me\". How elitist, how inconsiderate of me! <br><br>I moved back to Turkey 2 months ago from US and I watched \"Gunesi Gordum\" today...<br><br>Mahsun Kirmizigul won my respect, my admiration today...<br><br>Gunesi Gordum is an amazing movie. Every scene in the movie, every actor is spot on. It touches extremely sensitive subjects in Turkey and comes out a winner.<br><br>This movie makes you cry for the terrorists' family AND for the soldier that died defending his country. A son is a son. That's what this movie shows you without politicizing it.<br><br>It makes you see the pain of the homophobic brother facing the transvestite brother.<br><br>It makes you see how \"privileged\" you are while a big part of your country / world is just trying to HOLD ON....<br><br>Thank you Mahsun for this movie. I really hope you get the recognition you deserve.","user":"S_M_G","rank":[76,108]},{"title":"it is far far away from being a classic or what so ever","rating":7,"date":"31 October 2009","review":"I watched the movie yesterday and thought on it for a while. Let me share my humble opinion on some aspects of the movie. The story was crafted to make it as tragic as possible by putting problems of people who were forced to migrate in the focus and spicing it with social adaptation. While trying to point some problems like terror and the social pressure, the choices were too far from each other. If the story was focusing only on the migrating family, it could have been much better. The gay issue didn't fit the whole movie at all and it looks like a patch trying to gain sympathy. So, for the plot, it is over exaggerated tragedy. Acting is good, especially the main characters did a pretty good job. I am afraid, I can't be that positive for the directing and technical aspects. The fighting scene was very clumsy. Overall camera usage was pathetic. This movie is an Oscar candidate by now. I don't think it has the slightest chance. Although the movie is quite good in some aspects, it is far far away from being a classic or what so ever...","user":"EchoMaRinE","rank":[21,34]},{"title":"Kurdish issue has never been exposed this way!","rating":8,"date":"15 March 2009","review":"I have to confess that Mahsun Kirmizigul was not a name for me to follow or mention in any atmosphere until i watched Gunesi Gordum (means \"I Saw The Sun\"). There is a big kurdish issue in Turkey. It's not just in the southeast but in the entire country. This is the point where this film break through: How this problem effects all these people?<br><br>The story starts in a village in southeast, surrounded by the mountains which are also the permanent residences for the PKK terrorists. Davut and his brothers and their children and grandsons lives there. Davut has three sons. One, is a terrorist, lives on the mountains and fights against the Turkish army, believes that he is fighting for their people. The other one is a soldier in the army. And the youngest one is disabled because of a mine explosion. Even only the structure of this family gives us a spectacular aspect of the district. They have to leave the village and go somewhere else to live. It's not a choice they made, it is a must! The story goes on with their new lives. Some in Istanbul and some in Norway. Are they really their lives or did something or someone take it from them? Did they want it to be that way? In a scene Havar (played by Demet Evgar) says \"A man of this land can be a korucu (means village guardian), a soldier or a terrorist. There is no 4th option!\" or in another one Davut (acted by Altan Erkekli) who begins to live in Norway says \"No matter if here is a heaven, i'd prefer my land\".<br><br>Even the source of the kurdish issue is not the main subject in the film, it still has something to say about how this issue effects people of this country. And there is a solution proposal made by a captain of Turkish army: \"What if state gives a hand to the people of this district?\". Even some side stories harms the main one, and the film is lacking to answer why there is a such a problem and its involvement with PKK, Mahsun Kirmizigul, the writer and the director of the movie manages to tell his story maybe in the simplest way it could be, like it has never been before. Especially Altan Erkekli and Serif Sezer are shining in their roles. Suggested to the ones curious about the issue...","user":"makiratli","rank":[17,27]}]