[{"title":"Not avoiding the melodrama but keeping it not melodramatic","rating":9,"date":"8 July 2012","review":"A year ago I wrote a review about Matching Jack, an Ausralian film about almost the same sort of story. I complained then that despite of the superb acting, the story itself followed every cliché in the book. Well this one is more or less writing the textbook of how to do it right. It doesn't avoid any of the unavoidable melodrama of such a story but it does it without ever letting it spill over. The acting is superb in this one too, but the story makes you feel like you're viewing real people and not a movie about real people, and in this case it works for the film. It's nice to see Andy Serkis for real this time - he does a wonderful job even when not hidden behind fancy CG. Also excelling are the two young leads Thomas Brodie Sangster and Aisling Loftus. There's something in this sort of story that brings out the best from actors. In such a movie if they didn't do it properly it would've turned the film downright unwatchable.","user":"ayoreinf","rank":[31,34]},{"title":"Overall, great film.","rating":23,"date":"23 April 2012","review":"\"Death of a Superhero's\" titular character is fifteen years old, and  fifteen is a pretty rough age. The body's changing, hormones are  overloading the brain, and the once pointless female is miraculously  the best thing on the planet. Combine that with school, starting to  think about your future, parents, a menial job, and being surrounded by  other hormone imbalanced punks, and fifteen is a pretty crappy age. But  that's what the average fifteen-year-old boy has to deal with. Adding  chemotherapy into the mix is only going to make life all the more  unbearable.  \"Death of a Superhero\" is about Donald (Thomas Brodie-Sangster) coping  with his life- threatening cancer. Given his low chance of survival,  Donald toys with the idea of suicide. He stands in front of trains and  teeters on the edges of bridges. To help manage his emotions with his  practically imminent demise, Donald draws himself as a superhero  battling the evil Dr. Glove. We see animated sequences of Donald's  alter ego saving lives and battling evils that parallel the dilemmas in  his own life.  Donald's parents are torn on how to handle his deeply imbedded  depression. Psychiatrists have seemingly been a lost cause, but in one  last attempt, Donald's parents hire Dr. Adrian King (Andy Serkis). Dr.  King seems to create a balanced relationship with Donald as he stays  honest with his situation and acknowledges his anger instead of trying  to subdue it. Dr. King is the Dirty Harry of psychiatrists as he's  grizzled, blunt, and seems to have a perpetual hangover. Working with a  sense of reality, Donald feels comfortable enough to actually open up  to Dr. King.  \"Death of a Superhero\" has a nice mentality. It's brutally honest, but  there's a fair sense of humor and heart. It's always nice seeing Andy  Serkis in his actual skin and Thomas Sangster's performance is nothing  short of impressive. The animated sequences show Donald's resentment  better than words ever could, and the movie's pacing is fairly quick  for what would be expected with this subject matter. This movie's been  out for about three days, since I wrote this review, and I'm already  hearing comparisons to \"50/50.\" Both are good movies with similar  plots, but the themes are radically different.","user":"jkrawczyk-2","rank":[17,24]},{"title":"Superheroes Don't Make Compromises","rating":7,"date":"3 July 2013","review":"I love resilience. The relentless search for true love. The reason for us to be here and to have faith. Death of a Superhero is as grim as it is bad ass. Fantastic portrayal of an adolescent soul trapped in between the fear of an unfulfilled life and a sense of rightness. The film makes no compromises even in the face of death, instead turns everything into a comic book fantasy. The Superhero lives on. Risqué, Surreal,Emotional and funny at times. Death Of a Superhero tells a story that we avoid talking about and rarely deal with so boldly. Must watch for all of us whether you have lost a dear one or not. The plot gives enough time for the characters to evolve. The combined effect of performances, cinematography and music builds a world you would want to linger around for a while.","user":"organicsocial","rank":[8,12]}]