[{"title":"There'd better be some Oscar nominations coming for this little gem.","rating":8,"date":"14 November 2010","review":"SPOILER: \"But I can't forever carry them kids and my mom, not without that house.\"<br><br>Winter's Bone is a stark, almost documentary-like movie about a poor teenage girl named Ree&nbsp;in the Ozarks who supports her near-catatonic mother and two younger siblings during her meth-cooking father's many brushes with the law. When he disappears before a court date and the family's home is at risk if he doesn't show up, Ree (Jennifer Lawrence) investigates amongst the locals to find out where he might be. But, some people don't like the questions she's asking, and her life may be at risk, along with her family home.&nbsp;<br><br>The plain, unobtrusive way that the camera observes events really helped draw me into the movie, to the point where I honestly forgot that I was watching a movie, at all. This effect was heightened by some excellent performances; especially from Jennifer Lawrence and John Hawkes (Teardrop). Lawrence had a star-making (and award worthy) performance, in my opinion. Ree is probably my favorite movie character of the year (well, perhaps next to Hit Girl), and Lawrence plays her with a realism and stubborn toughness that makes you believe that this seventeen year-old girl wouldn't wilt under the kind of circumstances that would overwhelm most adults. Her love for her family seems completely genuine, and there's never a word or a glance where she seems like she's \"acting\". &nbsp;It's all very natural, and I was beyond impressed.<br><br>The plot was quite tense and engrossing, as Ree pursues the mystery of where her father is with a dogged intensity, despite the fact that it leads her into some very dangerous (and violent) situations. The sparse, beautiful winter settings are a perfect backdrop for the story. It's been a while since I've seen a movie that does as good a job as this one in communicating a sense of place.<br><br>Winter's Bone may not be for everyone, though. There are no shoot-outs or florid romantic scenes. The moments of happiness are small, fleeting, and poignant; like a gift of generosity from a neighbor who knows you're in need, or the quiet assurances of an older sister to her younger siblings. In Winter's Bone, our world is never in danger...but one family's certainly is. I liked the movie the first time around, enjoyed it even more the second, and heartily recommend it if you're interested.","user":"lewiskendell","rank":[240,279]},{"title":"Bread and Butter","rating":8,"date":"27 June 2010","review":"Greetings again from the darkness. A double award winner at the Sundance Film Festival, this film is based on Daniel Woodrell's novel and is directed by Debra Granik. It's opening sequence slaps the viewer with the bleak unforgivingness of life in the backwoods of the Ozarks. This is land of people that time has passed by.<br><br>The basic premise of the story is that 17 year old Ree Dolly (played by Jennifer Lawrence) is responsible for raising her brother and sister and caring for her mentally-blank mother while maintaining a mostly positive outlook on the present and future. Reality strikes again when the local sheriff arrives to inform her that her missing, meth-lab running father has an upcoming court date. He used their land and house as collateral for his latest bond. If he fails to show, they will lose their home. Instead of breaking down, Ree pledges to find him and starts out on a hazardous journey, unlike we have seen on screen.<br><br>This community of mountain people are distrusting of outsiders, but stunningly, are just as paranoid around insiders and even family members. Their way of life seems to depend on pure independence, even though they all seemed intertwined in the same illegal activities and daily quest for survival. Some kind of odd code exists - ask nothing, give nothing and get rid of any obstacles.<br><br>The driving forces of the story are Ree and her constant hope and courage, and her bond to her dad's only brother, Teardrop played chillingly by John Hawkes. Teardrop tries to toughen up Ree and get her to accept her plight, while Ree constantly shows his there is reason to plow forward.<br><br>The film is very well written and the local filming brings a harsh reality that was crucial to the film's success. Additionally, I was stunned at the fierceness displayed by Jennifer Lawrence as Ree. Her performance reminded me of my first exposure to the talents of Meryl Streep (The Deer Hunter) and Evan Rachel Wood (Thirteen). Talk about powerful and exciting ... what she did with this role vaults her immediately into a very small group of actresses who can carry a movie with their presence. I am anxiously awaiting her next appearance - a Jody Foster project.<br><br>I also want to mention the music in the film. The vocalist, Marideth Sisco, is also the vocalist in the living room band who makes an appearance in one scene. Her voice truly captures the balance of hope and acceptance of plight. This is not a movie for everyone, but it is fascinating and hardcore.","user":"ferguson-6","rank":[124,156]},{"title":"Haunting, Grim, but somehow Optimistic","rating":10,"date":"8 August 2010","review":"Winter's Bone is about a 17 year old girl name Rolly Dee set out to find her father who put their house for his bailbond and then vanishes. If she doesn't find him, her family will be turned out to the Ozarks. Challenging her outlaw kin's code of silence and risking her life, Ree hacks through the lies, evasions and threats offered up by her relatives and begins to piece together the truth.<br><br>Let me, just begin by saying this movie is perfectly acted. Jennifer Lawrence gives an Oscar Worthy performance as Rolly Dee. I was surprised how excellent she was, because I was sceptical of her in the \"The Bill Engvall\" show. But she turned me to a believer and boy, she can REALLY act. Her performance actually surpasses some of Meryl Streep's performances. Hopefully the Academy will recognize her and give an Oscar nomination or maybe even a win! The film is well directed by Debra Granik and is easily her best work yet. She definitely has potential to become the \"new\" Kathryn Bigelow. Anyways the film is really bleak and powerful, but it still has a tone of hopeful in it. Very interesting and mesmerizing movie to watch. It is a bit slow at times, but trust me it never gets boring or dull.<br><br>10/10 Highly recommended.","user":"Loving_Silence","rank":[295,389]}]