[{"title":"Low budget homage to a giant of a boxer.","rating":6,"date":"26 April 2012","review":"I would like you people please to disregard the IMDb score and see this movie for yourself. It appears that view have watched this, and indeed if you remove the idiotic \"bollbashers\" (those who rate 1 on every film by Uwe), you would get an average of 6.4, a more suitable score for this film.<br><br>As a whole, this is not a great movie. But I had a unique pang of excitement when Joe Louis was on screen. Max Schmeling is played by Henry Mask, and the boxing matches were very similar to the real thing. The authenticity stems from both the director, who boxed at an amateur level for 15 years, and the \"star\" was a gold medallist, who had previously held the IBF world light-heavyweight title. This occasionally transcends into flat acting that on a whole was plainly mediocre. Still, Schmeling himself wanted him to play the role.<br><br>This film deals with 14 years of his life, and shows how the Nazis used him as propaganda, and how he went against their values- even saving Jewish boys from Kristallnacht. He has a blooming romance that comes across as a bit cliché, but in all this movie was interesting, and very truthful to Schmelings actual life. Some bits are omitted or mentioned in brief, but actual footage was organically placed into the film to make it seem more like the Nazi period of time. You can't help but feel your looking at true history - that of a German hero.<br><br>Concludingly, an average boxing film about an above average man. 6/10.","user":"amiableshark","rank":[10,10]},{"title":"Profile of a Great German Boxer but not a War Film","rating":9,"date":"9 November 2011","review":"I found this to be a very enjoyable movie indeed and in sharp contrast to the stinging comments made about the movie generally. Yes it is essentially a Boxing movie with a Nazi War theme but there is no blood, minimal violence, no bad language, no offending sex scenes and everything in the film, given the nature of the storyline to do with Nazis, is done in very good taste.<br><br>True, it is not a great film and I do not think the director ever intended it. He may have intended a personal message with the film and expressed a love of boxing and also of a German Boxing icon.<br><br>Max Schmeling was a respected fighter both before and after the War. Whether he was a Nazi or not is a concern or issue for the film and there are no scenes I recall in the film which show Schmeling in direct contact with anyone acting as Adolf Hitler. His respect for Joe Louis is humbling.<br><br>He lived a long life and was successful in business. He has stood the test of life in ways that modern boxing icons such as Bruno, Bugner, Tyson and even Mohammed Ali have not.<br><br>Max Schmeling had a Jewish manager and married a Czech woman. There is nothing about the film which could possibly give offence to a German or anybody else unless they were looking to be offended.<br><br>Yes the storyline is simplistic enough, there is no dwelling on Max Schmelings involvement in the war or on the exact nature of how he suffered injury and near death in the war. Enough to vaguely refer to it and not wonder more.<br><br>Remember the film is for entertainment and is not a documentary. If the latter then some of the films other comments will be more relevant.","user":"mrcibubur","rank":[24,27]},{"title":"A story that should have been told","rating":7,"date":"27 January 2013","review":"I enjoyed this movie because it related the struggles of a man who was first a good sport and a gentleman. He was a boxer but not a violent person. While that might sound like a contradiction, in his case he was a gentleman who had no hostility toward anyone unless they were in the boxing ring. Out of the ring he truly cared for people. He may actually have been a bit naive where it came to understanding the Nazi mindset. It almost cost him his life. He managed to be himself through the whole Nazi reign of terror and eventually became an asset to his homeland which was in great need of healing after the war.<br><br>The proof that he cared for others is in the fact he rescued a father and sons during the kristallnacht event. And after his death he left his entire estate to charity. It was a sizable sum as he was a notable business man with Coca-Cola in Germany. His mansion is now the embassy for the Libyan ambassador.<br><br>The acting was not on Oscar level, but that didn't ruin the movie for me. I rented the DVD for the story and it did a good job of delivering that. As someone with ancestry from Germany I take heart in the fact there were many Germans who did not support the Nazis. They are given very little notice which is to me, most unfair. My ancestors came to America in 1732, the sons married all German descent wives until my father married my Irish mother in 1945. So I have a great deal of German background.<br><br>I will confess it was the title that caught my eye at the rental place. I wanted to learn what this movie had to say about a man who became a hero to his homeland.<br><br>There was so much turmoil during Max's life. It pleases me to learn he became successful after the war. He was a thoughtful and generous man known to help others. He stayed friendly toward Joe Louis and even arranged meetings and later helped Joe get a respectful burial.<br><br>Max's clean life style and generosity toward others paid well. He lived to be a ripe old 99.<br><br>I rated this movie a 7 not due to the acting, it wasn't as bad as some suggest, but rather because it did a good job of telling the story of a man who remained true to self and did not bend to those who he knew were wrong.","user":"headhunter46","rank":[6,6]}]