[{"title":"very very similar to movies like Father of the Bride","rating":2,"date":"8 February 2011","review":"This movie was OK but the plot's been used many times before. Guy and girl come home to parents and announce they are getting married. Then both families have to get along as they plan the wedding. And of course either the dads or the moms don't get along. In this case, it's the dad that don't get along. It starts from the beginning as Lucia's dad, Miguel, whom tows trucks, picks up Marcus's dads, Brad, car to impound. Brad arrives in time but Miguel still tows the car. Then they have dinner with their kids that night and meet for the second time and find out they are to be in laws. So much quarreling ensues.<br><br>The best scene is when Migual and Brad go to this bar to find a dj and Miguel gets hammered on pink nipples. Of course, the kids have second thoughts but everything works out in the end.<br><br>FINAL VERDICT: Not very interesting. Skip it.","user":"MLDinTN","rank":[9,10]},{"title":"Flawed but enjoyable","rating":6,"date":"10 July 2010","review":"Do not pay attention to the ridiculously low rating this film has accumulated. It's hardly one of the best movies you'll ever see, but it is overall much more enjoyable than not.<br><br>The young leads are a charming, believable couple, and you do root for them.<br><br>I thought the more obvious (meaning unfunny) racial jokes were actually kept to a respectable minimum, considering that culture clash is the main premise of the movie.<br><br>Some scenes work better than others. One involving the families figuring out the \"seating schematic\" is quite clever and funny. One involving a bathroom is a rather shameless and unfunny ripoff of a scene from \"Father of the Bride.\" <br><br>Carlos Mencia, I have to say, I don't think is funny or a particularly good actor. I kept finding myself imagining someone else in the part (*cough* George Lopez... or anyone else, really). But he wasn't enough to ruin the movie for me.<br><br>The best parts of the movie were the story with Forest Whitaker and Regina King, and anything with Charlie Murphy, who has a small but hilarious role. The one scene featuring him and Taye Diggs was the one time I laughed HARD. And yes, as another reviewer pointed out, the actress playing the sister was excellent.<br><br>Most of the plot points are predictable, yes, but I didn't really hold that against \"Our Family Wedding.\" I at least had a better time than I've had at most real weddings. I give it a 6 out of 10.","user":"cerule14","rank":[23,31]},{"title":"How is Carlos Mencia successful. Explain this to me someone","rating":2,"date":"15 March 2010","review":"Our Family Wedding is a grim prospect on its face: a frantic wedding movie meets an uproarious culture clash movie, where two patriarchs - the smooth African-American and the fiery Latino - do hilarious battle and then there's some romance somewhere. It fails to deliver even on that meagre promise. Forest Whittaker and Carlos Mencia play the fathers of young lovers Marcus and Lucia (Lance Gross and America Ferrera) who return home to L.A. to announce their surprise engagement and plans to be married immediately. Things get complicated, when we learn that Lucia's family don't really like black people, and Marcus' father, a neat-freak radio DJ-cum-ladies'-man, doesn't like Mexican people. Predicaments predictably follow, in the proper order and to factory specifications.<br><br>Despite a legitimately (for the most part) talented cast and a set-up almost guaranteed to be worth at least a few forced laughs, the film manages to be almost completely devoid of humour. It's a punishing, depressing display. The film knows what beats to hit, and tries with heroic, military determination to hit them only to fail, every single time. We're presented with the really uncomfortable knowledge that the film knows it should be funny, here, here and here, and is really trying, honest - see how the goat tries to have sex with the fancy man!? - but just can't quite haul it's hackneyed self anywhere close to an actual laugh. It's ugly and it tries to make you complicit in its ugliness, like when you walk in on your roommate three quarters of the way through an extra large pizza and they try and make you eat the last slice.<br><br>To do the obvious thing and fail at it is the worst thing an artist can do. To offer a thin-gruel compromise to your audience, to say \"here's a trite, rote ethnicity-clash wedding comedy that you know will be derivative but what else are you going to watch come on it can't be terrible\" and then to hand them something terrible is just... rude. To ask us to watch Carlos Mencia flail his way through a grim, graceless Mr. Hulot-inspired bit of non-comedy is mean, and makes us feel badly about ourselves and the choices that brought us here.<br><br>One bright spot: Anjelah Johnson as the tomboy sister of the bride is the only actor in the film that's able to wring a couple of laughs out of it, and the sisters' relationship is one of the only interesting things in a film that's otherwise not much more than a grim procession of joyless clichés. 2/10","user":"thesubstream","rank":[47,77]}]