[{"title":"Good movie","rating":8,"date":"23 February 2020","review":"Kung Fu Panda 2 was not as good as the original. The story isn't as good and neither is the \"Jack Black humor\" that made the original what it was. That being said, the villain is really good and the plot is still pretty good. 2 is also a little more predictable. Overall, Kung Fu Panda 2 is a good movie, although it fails to be as good as the first.","user":"MR_Heraclius","rank":[37,38]},{"title":"An emphatic return with a darker story; great movie with lots in it for the adults as well","rating":10,"date":"25 May 2011","review":"The question that has been floating around about Kung Fu Panda 2 is if it is Shrek 2 or Toy Story 2 of animated sequels? Well, I'm happy to say it's Toy Story 2 kind of animated sequel - a genuine good movie that takes risks and succeeds rather than rehashing the first movie.<br><br>Po isn't as much of a gastro-kung-fu fighter and fanboi from the first movie but has grown in his personality; he's less the Jack Black as a panda and more of a character that stands on it's own. However, Po is now the tragic hero in a Greek style prophecy which foretells of a warrior in black and white who would defeat a certain Lord Shen who has invented a new weapon that could spell the end of kung-fu. As Po learns that he is adopted, he struggles to find out about his past and the strange symbol from his nightmares. The heavy subject matter doesn't weight down the movie and is continually and cleverly able to escape into funny moments without losing gravitas. It successfully weaves the topics of fatherhood, friendship and family into a colorful story that even though we know how it will end, it gets there very very emphatically.<br><br>I'm really glad that Kung Fu Panda 2 didn't go the route of being a purely children's movie and didn't go the route of being built on jokes of Po's eating and Po's weight. I suppose the fortune cookie philosophy of master Shifu is slightly missed but purely a small quibble in a good movie. As a final note, maybe it's because of my eyesight with a weaker left eye, I barely noticed the 3D at all. Highly recommended movie.","user":"MosHr","rank":[128,163]},{"title":"Furry, Ferocious, and Fun!","rating":10,"date":"27 May 2011","review":"Furry, Ferocious and Fun!<br><br>This Memorial Day weekend I watched Kung Fu Panda 2, the sequel to the action packed comedy starring Po (Jack Black) and the fearsome five. The first movie was a fun kids movie that had a lot of catchy one liner phrases, a few kick butt actions scenes, a lot of situational comedy, and a story that was about working hard and finding your inner strength. Now three years later, the fellows at Dreamworks have presented a sequel to this animal centered comedy, which follows after the two duds we saw in Shrek the Third and Shrek Forever After. Is this sequel following the same path that the last Shrek films took, or does it shine on its own? My answer to this question is that it does indeed shine on its own.<br><br>The story starts out with a background story about the villain Shen (Gary Oldman) and his lust for power to rule over China, eliminating any forces that try to stand in his way. Not long after the introduction, Po and the gang come back into the picture before Po is called to Master Shifu (Dustin Hoffman) to learn about finding inner peace. However, the peaceful air is soon disturbed by a pack of wolf soldiers and an action fight sequence soon starts that puts most action movies to shame. As the wolves retreat Po, along with the fearsome five, set out to defeat Shen and find inner peace. <br><br>Over the course of the journey, Po provides that classic comedy that made him famous in the first film as he uses phrases like awesome, so hardcore, and freaking in providing that awkward and childish enthusiasm that makes him stand out. His enthusiasm is still balanced out by his lack of stamina and large girth comedy which is cleverly integrated into both combat and non combat scenes. Clumsiness also plays a role in Po's ability to make us laugh, as what starts out as the stylish moves of a kung fu master quickly turns into a blundering mistake that somehow seems to work for Po. All of these aspects are brought together by Jack Black's voice work as he finds a way to bring a juvenile tone to the comedy, while still sounding wise and honorable during the serious scenes.<br><br>Perhaps one of the strongest aspects about this movie is the balance of story, action, and detail. The story, or should I say stories, are detailed enough to provide character development that older audiences will like, but at the same time is catchy, simple, and fun enough to allow younger audience members to get a gist of what's going on. The integration of action and chase scenes keeps the pace of the movie going while also keeping the attention of the audience glued to the screen, a plus for those that have a hard time sitting through a movie. <br><br>What really brings all of these strengths together though is the camera and musical works that add that finishing touch to the movie. The camera work is smooth and not really jumpy and allows one to see what's going in almost every scene. An exception to this style occurs in some of the fighting seen at the end, but it's not too bad so most should be able to slide ignore it. While the camera's capture the action, the music that plays during every scene has been selected to bring out the emotions of the scene and make you feel it deep in your heart. Whether it be fast flying punches, sad flashbacks, or the findings of inner peace and the acceptance of the past the music catches all of these emotions in a brilliant combination of strings, percussions, and other orchestra instruments to make you feel like you are in the movie.<br><br>Although this movie has a lot, and I mean a lot of good aspects, there are still some weaknesses that one may find. The comedic styles of Po can get a little stale at times, especially hearing the word hard core about ten times. A second thing is that Po pulls off a little too much Yoda at some points in the movie, I won't say too much more to avoid ruining the movie. Perhaps a third thing one might not like is how long it takes to finish off the final battle. Although the movie is only an hour and half long, some might find the final battle dragged out a little too long and want it to just end, this was not a problem for me however.<br><br>Overall Kung Fu Panda 2 is a sequel that is a must see, especially for kids and fans of the series. Even if you haven't seen the first one yet, which was the case with my cousin, one will be able to find some part of this movie to enjoy. Laughs, actions, drama, story, and heartfelt emotions are all in this movie and the wide appeal to many audiences makes this a great movie for a youth group or friend outing. Thus my Robbie Rating for this movie is 9.8-10.0. I hope that you enjoy this movie as much I did. Recommended audience members: Kids, Dreamworks fans, Kung Fu Panda lovers, action lovers, comedy lovers, etc. People who should avoid this movie: Horror fans and fans looking for a movie with blood, because it doesn't have any of it.","user":"rgkarim","rank":[73,100]}]