[{"title":"A pointless remake of an excellent British film.","rating":4,"date":"25 May 2010","review":"Despite having double the budget and some pretty big Hollywood stars the 2010 release adds nothing whatsoever, and in fact is in many ways inferior.<br><br>Not only are there some very lacklustre performances in particular from Chris Rock and Martin Lawrence as the two sons of the deceased, but the camera work in some sections is truly awful with the decision to use \"handheld\" or steadicam photography resulting in the picture shaking so badly in some sections that it is almost hard to watch.<br><br>Despite all this many of the best moments of the original are copied perfectly and work just as well as they did the first time around meaning that there are several good laughs to be had, but when you've got the choice of watching this or the original there's really no contest.<br><br>Distinctly average.","user":"NorthernDragon","rank":[160,198]},{"title":"Uninspired remake of a great comedy","rating":15,"date":"15 August 2010","review":"This film is about the funeral of a family man. the funeral turns out to be very eventful with many surprises.<br><br>\"Death at a Funeral\" is almost the same as the British original, be it the title or the plot. The British one was really funny, I remember myself laughing very hard when I watched it. This remake, is mildly funny, but it is just in a different league. It uses cheap humour to make people laugh, and it lacks the witty dialog of the original. Moreover, characters are less sympathetic and more annoying in this remake. Despite a few funny moments, I would stay \"Death at a Funeral\" is an uninspired remake of a great comedy. <br><br>Maybe filmmakers will bear in mind that remaking such a recent film in the same language with the same plot is not such a good idea, as it will inevitably draw comparisons between the original and the remake.","user":"Gordon-11","rank":[47,58]},{"title":"Awful remake","rating":2,"date":"22 March 2019","review":"Recommend passing on this one and watch the original released in 2007. The first version was incredibly funny. This one was barely amusing.","user":"schubej-1","rank":[8,8]}]