[{"title":"They have yet to go their separate ways","rating":9,"date":"10 March 2013","review":"Is there any song more American than \"Don't Stop Believin'\" by Journey? It concluded The Soprano's, it's the theme song of the Chicago White Sox, and has achieved enormous notoriety in film and television. It is, essentially, one of the best rock songs ever written by one of the best rock bands ever formed, Journey. It also begins the new documentary about Journey, titled Don't Stop Believin': Everyman's Journey, centering around Arnel Pineda, the new Filipino lead singer of the band.<br><br>After Journey's lead singer Steve Perry left the band in 1998, the gang was scrambling to find a new voice. After a few replacements, temporary and official, they settle on a Filipino man named Arnel Pineda, who lead guitarist Neal Schon found on Youtube after spending hours searching for a new possible frontman. Pineda discovered that several dozens of Youtube videos had been posted of him singing with his coverband called \"The Zoo.\" When Schon stumbled up his cover of \"Faithfully,\" and continued watching additional Journey songs, as well as Survivor and Aerosmith, he knew he found their guy. The problem was, could it work? The hardest part about replacing a member of a classic rock band, the lead singer, nonetheless, is that the fans of the music want the sound, style, and rhythm to stay the same. How would fans respond to Journey's choice to make a short, Filipino man from a third-world country their lead singer? The documentary shows the hesitance from the fan-members, including the obligatory racist remarks Pineda got when he first signed on with the band. \"I'm not cute; I'm short, I'm so Asian,\" a self-conscious Pineda states. He recalls his first concert in 2008 in Chile, in front of thousands of people, with pinpoint detail to how he felt that specific night. Before the concert, he states, his lips were trembling, his heartbeat was slowing, his voice and breathing became faint, and everything \"was moving in slow-motion.\" Until he got up on stage and sung his heart out, along with jumping wildly and running from the opposite ends of the stage. It showed the band that not only was Pineda bringing his amazing voice and talent to the table, but also, his kinetic energy and charisma.<br><br>In many ways, Arnel Pineda reminds me of the singer-songwriter Sixto Rodriguez, who was profiled in Searching for Sugar Man, which won Best Documentary Feature at the Oscars this past year. The film concerned the immense popularity of a singer named Rodriguez in South Africa, which lead to two filmmakers researching the man's roots in America, where he became reclusive and part of the obscure when he realized his albums did nothing but fail in his homeland. Pineda and Rodriguez have the same kind of personality; they're somewhat shy, self-conscious, modest, and beyond charismatic.<br><br>The documentary shows how the band has been affected with Arnel Pineda now leading the iconic group, and it seems that it couldn't have been more positive in terms of popularity. We see how Journey is playing in different parts of the world now, and that there is a stunning influx of Filipino attendees at their concerts now. One wonders if it's still necessarily politically correct to refer to the band as the all American rock band.<br><br>I fell in love with Don't Stop Believin': Everyman's Journey, not just because of the inclusion of unforgettable tunes such as \"Anyway You Want It\" and \"Separate Ways,\" but mainly because of the likability of Pineda, and how the group currently functions with him. He's such a talented, brave soul, who wandered the streets of Manila to be the lead singer of a larger-than-life rock band. Documentaries are known for shedding light on smaller, more overlooked areas in a big world, and in that case, Pineda's story needed to be told. If you don't experience an emotional resonance with Pineda or his story during the final sequence, where he belts out \"Don't Stop Believin'\" to an incalculable crowd, you may have the inability to be moved.<br><br>Starring: Arnel Pineda, Neal Schon, Ross Valory, Jonathan Cain, and Deen Castronovo. Directed by: Ramona Diaz.","user":"StevePulaski","rank":[16,17]},{"title":"Steve Who?","rating":7,"date":"5 May 2012","review":"The 55th San Francisco International Film Festival recently closed with a screening of \"Don't Stop Believin' - Everyman's Journey,\" Ramona Diaz's new documentary chronicling the journey of Arnel Pineda. His trek from a Phillipine cover band to lead vocalist for the classic rock band \"Journey\" (via You Tube) is an incredible story. <br><br>Diaz got a \"heads up\" from a Phillipine emigration official and jumped on the opportunity to capture Pineda's growth from anxious audition-er to full-fledged rock star. From recording studio to concert tour bus, to venues around the United States and - finally - to a triumphant Manila concert, you can't help but root for this incredible likable performer. Pineda is genuinely humbled by the opportunity given him, and always seems to be waiting for the balloon to burst. <br><br>The other members of \"Journey\" (Neal Schon, Jonathan Cain, Ross Valory, Deen Castronovo) quickly realize they've managed to capture 'lightning in a bottle' again, and mentor Pineda through the hard times of touring. As we already know how the story turns out, there's a noticeable lack of suspense or conflict - or at least any that we see. Schon hinted at the Q&amp;A after the screening that he may have been a bit problematic at times, but it doesn't show in the finished film. <br><br>At just under two hours, the film is a bit too long for its own good. The scenes \"on the road\" get a bit repetitive and, as I stated earlier, we already know how the story ends. The film's excess length is almost made up for by the personable Pineda and, indeed, all the members of the band. Almost, but not quite. This was the second time I'd screened the film, but my first time with an audience. While the film plays much better in a theatre with a kick-ass sound system set to \"11\" and surrounded by fans, I could sense the audience start to get a bit restless when the film started to drag.<br><br>Perhaps they were getting restless hoping for the band to come up on stage for the post-screening Q&amp;A. Indeed they did, along with Director Diaz and the film's producers. After a few expected questions (\"Have you ever met Steve Perry?\") I managed to get one in that expanded on a statement made by a fan in the film. A Phillipino fan says something along the lines that the band \"didn't realize that when they made Pineda their lead singer that they were adopting an entire country.\" I asked the members of the band how this new fan base had impacted them. Jonathan Cain stated how appreciative they were, especially for the fact they \"actually buy CD's.\" Pineda chimed in \"and merchandise!\" Ross Valory also jumped in to confirm another statement made in the film, that the Phillipino fan's \"won't take NO for an answer!\" He didn't elaborate. <br><br>\"Don't Stop Believin - Everyman's Journey\" is a rock and roll film minus the sex and drugs (for the most part.) It is a joyous film, a \"Horatio Alger\" tale for the rock and roll age and, needless to say, the soundtrack ROCKS!<br><br>www.worstshowontheweb.com","user":"soncoman","rank":[13,16]},{"title":"Inspiring documentary","rating":8,"date":"14 October 2013","review":"Ramona Diaz' \"Don't Stop Believin': Everyman's Journey\" may not be the most \"important\" documentary of the past several years, but it is certainly one of the most fascinating. And uplifting.<br><br>The movie begins with a predicament: the remaining members of the classic rock group Journey have decided to both return to the studio to start recording new material and go on tour where they will need to perform all their familiar hits for their millions of rabid fans who are expecting them to sound the way they did decades before. Yet, their lead singer, Steve Perry, has long since left the group. What are a bunch of aging rockers to do? The answer they come up with is to mount a search for someone who can approximate Perry's distinctive and universally recognizable vocal stylings. That's where Arnel Pineda comes in - an amateur singer in the Philippines who had previously posted 60 videos of himself mainly doing cover versions of Journey's hits on-line. The similarity between his voice and the voice of Perry is uncanny, so the group plucks him out of obscurity and puts him front-and-center with them on stage and in the studio. This movie is a record of that experience.<br><br>To show just how far he's risen, the movie briefly chronicles Arnel's hardscrabble life as an orphan in the Philipines, often living on the streets, literally singing for his supper and that of his siblings. Drug and alcohol abuse and a broken marriage also figure prominently in Arnel's pre-Journey history. But all that is in the past, as now he not only gets to perform with his favorite band, but he is happily married with a young daughter. Indeed, the only negative aspect of the tour for Arnel is that it requires him to be away from his home and loved ones for such an extended period of time. But such is the life of a rock star.<br><br>The movie also fleshes out the history of the band itself, from its years of worldwide success to its periods of wilderness-wandering obscurity, from its temporary dissolution in the '90s to its successful comeback today. These experienced, wiser heads are able to keep this newbie focused on not only what is good about touring, but the potential pitfalls that await someone not ready for all that comes with fame and glory and life on the road. Thanks in large part to them but also to his own inner strength of character, Arnel is able to keep his feet planted firmly on the ground, even while his head is, understandably, in the clouds.<br><br>And indeed throughout the experience, Arnel remains a humble, self-effacing figure, a man who, despite being overwhelmed by the adoration of Journey's fans, never allows himself to forget where it is he came from and how extraordinarily blessed he is in being able to live out this never-in-my-wildest-dreams fantasy-come-true.<br><br>As for the original members of the band - Neal Schon, Ross Valory, Jonathan Cain, Deen Castronova - they do tend to become bit-players in the film while Arnel takes center stage, but it is clear that they are equally cognizant of the fact they owe as much to Arnel as he does to them for helping make this hugely successful comeback possible. It is obvious that the members not only welcome Arnel in with \"open arms\" but that a genuine bond of fellowship and friendship has developed amongst them.<br><br>As Arnel himself admits, this is really a rock music Cinderella story with Neil Schon, who discovered him, as the fairy godmother and the tour the grand ball.<br><br>And the whole thing culminates in a raucous performance of \"Don't Stop Believing\" before a stadium full of screaming, adoring Filipino fans, all beaming with pride at the sight of a home town boy hitting the big time - and if that scene doesn't leave you with a lump in your throat and a chill running up and down your spine, you just might want to get those two organs checked out for defectiveness.<br><br>Even those who don't much care for Journey - if any such people exist amongst us - can have a great time with this film.","user":"Buddy-51","rank":[5,5]}]