[{"title":"Brilliant film, a must watch, instant classic","rating":10,"date":"15 April 2019","review":"I've seen my fair share of manga movie adaptations, and I gotta say, this is the greatest of them all. This film perfectly encapsulates the spirit of Garfield, somehow maintaining his rocking hot body in 3D animation form. The character arc of Garfield in Garfield's Pet Force is comparable to the one of Charles Foster Kane in Citizen Kane, perhaps surpassing what's classified as the greatest movie of all time. At first, Garfield struggles with overindulgence and laziness, representing two of the 7 deadly sins, Sloth and Gluttony. His will and love for his city, however, is enough to overcome and turn away from that dangerous path. The ending scene of him dancing with Arlene in space represents his final freedom from his sins, as he peacefully passes after his intense battle with the beast, and more importantly, his struggle with his sins. As Garfield represents Sloth and Gluttony, the other characters also all represent a deadly sin. Nermal represents Greed, as he is constantly blinded by his greed for power, even refusing to give it up after the battle was over for his own gains. Vetvix represents Wrath, as her undying hatred could only be succumbed by her own weapon near the end. Betty demonstrates unquenchable Lust for Garzooka's furry, masculine physique, even risking her own life and traveling to space to acquire a taste of Garzooka. Odie represents Envy, always having to dwell behind Garfield's shadow, unable to show his own true worth. Pride is shown in Garzooka, as his own pride puts the Pet Force in danger, when he gives them the serum and believes that they can defeat Vetvix. But as it turns out, they couldn't, and are combined into a deformed meatball of super-pets. Garfield eventually has to step back into the light in order to right their mistakes and save his town. There has been no other movie that has a plot as rich and thrilling as Garfield's Pet Force, and it's an impressive feat considering that it was written by Jim Davis himself.<br><br>Now let's get to the artistic filmography and directorial genius of Mark A. Z. Dippé. His technique and ability to transform any landscape into an artwork is shown greatly in this film, and one can truly appreciate every single frame of this masterpiece. There are multiple hidden meanings and themes in this film, that I will encourage you, the viewer, to search for yourself. You will find pride and joy in rewatching this movie countless times, discovering something new to awe at during every new viewing.<br><br>The animation is also outstanding, surpassing the ones of Spider-Man Into the Spiderverse, even though Pet Force was released 9 years prior. The fact that this movie did not receive an Oscar for best animated film while Spiderverse did is outrageous, and shows the racial bias in the Academy Awards. The only reason this film was rejected from it's glory was due to the fact that there was an African American present in the film. It is a shame that we live in a society that still encourages the discrimination of minorities.<br><br>Garfield's Pet Force was the single greatest manga adaptation, and perhaps even the greatest film created by humankind, that should be praised and preserved for many generations. It is not an understatement when I say that the entire English subject of the American school system should be replaced by a class only analyzing this film. I am currently blind after watching this movie nonstop for 10 years straight after its original release, and my nurse is assisting in writing this review to help spread the genius of Jim Davis and his crew. My wife has left me and took the children 5 years ago because she did not understand the complexity of Jim Davis' mind. I am glad such a inferior being has left my life, and will enjoy seeing her suffer under the might of Garfield in the afterlife. I will be holding a private screening of Garfield's Pet Force in Cinemark Tinseltown in Grapevine, Texas at 4:30 on April 22, and I hope to see those who read this there, eager to indulge in Garfield culture.","user":"jiholee-02862","rank":[3,3]},{"title":"Only for... the very young, and not in heart but mind","rating":1,"date":"13 May 2011","review":"A little context: I, 22 year old, go to movies all the time with both my parents. There's few movies I can't get anything good out of, so I enjoy watching most. Even more so knowing my parents are happy in my company.<br><br>My feelings: Going in the theater with a cheery attitude for this 3D Computer Generated movie, from the moment it started I hoped for it to get better than the awkwardly innocent silliness that kept accumulating in both the movie play and in my unprepared mind. I felt so dumb for letting my parents decide to see this rather than the other option (my would-be 3rd viewing of Thor), and also for having the trailer -shown to me some months earlier- purposely forgotten.<br><br>My review: The plot summary is true, so I don't need to tell you anything more about it. What one could -wrongly- expect is that the way the plot unravels or is presented has some quality that redeems it for being merely a kid's movie cashing on the Garfield license. However this pic has nothing special going for it, just the dumb by-the- numbers approach. Sure, they put some effort into making it, they made a single slightly amusing scene with jumping out 3D stuff, whatever. By all that's good, this pic isn't worth the time spent on any part of the movie process, not the producing, not the animating,{...}, and very specially not experiencing it. There are a ton of better things a child could (and should) be doing, and you would be a bad parent if you force this upon your child.<br><br>Closing: Me and my parents? Why, we endured the whole of it thinking maybe each other would feel offended if any of us walked out and kept hoping it would get any better at any time soon; in retrospective we were a bunch of good-meaning fools. Except my dad who mercifully fell asleep.","user":"RickIsEnough","rank":[6,11]},{"title":"My son LOVES \"the cat movie\"","rating":8,"date":"24 December 2011","review":"In response to the reviewer above me, this is a little kids movie!<br><br>Anywho, my boy just loves this film. We watch it on Netflix at least once or twice a week. It is a great silly film. It doesn't hold much educational value, but I could care less- it's Garfield, it's cool. I highly recommend this film for 3-9 year old children. <br><br>The best part: Parents, this isn't one of those types that make you want to put a drill to your temple. Get it, let your kids have something to laugh at. It is still the good ole' lazy cat that would rather eat lasagna than get off his bum and his dorky and gullible owner.","user":"imahottguy","rank":[4,7]}]