[{"title":"TWILIGHT BREAKING DAWN","rating":6,"date":"20 February 2020","review":"I'd say, stay for the first 15 minutes then come back for the last 20 minutes, just so that you can skip all of the nonsense in between. Surprisingly, the werewolves have taken a dire turn in this franchise which is a crying shame because their presence in the two other films were refreshing and light handed. In one of the worst scenes ever, they all confront each other through telepathy which is hard to watch because the voice acting is so out of place. The wedding scene was gratuitous and the birth scene was ripped out from the pages of hell. Bizzare.","user":"MR_Heraclius","rank":[37,38]},{"title":"Forced To See This","rating":2,"date":"3 December 2011","review":"I know I'm late in reviewing this and probably no one is reading this review, but I had a hot date for this one and I couldn't say no. She really wanted to see this, and she had a thrill in dragging me along despite me not wanting to see this at all. I was never going to see this or any Twilight movie for that matter. She loved this one. I did not.<br><br>The problem, the biggest problem to me, is that it's very, very, very boring. NOTHING HAPPENS! Let's see, we see Jacob take off his shirt in the first two seconds of the movie and then Bella and Edward awkwardly have a wedding with fake smiles on their face. Then she has nightmares, possibly to show some form of entertainment throughout this boredom of a movie, and then there's the reception. That was the only scene I liked in the movie. At least it provided some humor. Then they go off to Rio... and nothing really happens. Yeah, they keep having sex and Bella just keeps wanting more. She calls her dad who is the only likable character, at least to me, in the whole series and then she finds out she's pregnant with some hell spawn, I guess. And vampires and werewolves get ticked off.<br><br>Then the dumbest moment happens. The wolves talking to each other. I swear it looked like a Saturday morning cartoon because they were so faked CGI and their voices was so Saturday morning cartoonish that Twi- hards should be offended! Anyway, the movie just drags and drags and I caught myself falling asleep. I held my date's hand and practically made out with it just to keep from falling asleep. I made it through the film. Thank God for that.<br><br>After the film, she really looked at me in hopes that I would love it like she did. I really couldn't lie to her and I hate telling her how much I couldn't stand the film. She explained the whole lore of the Twilight series and I still don't get it. I hate these movies. Unfortunately she is dragging me to part 2. At least I can spend more quality time with her.","user":"Fields201","rank":[131,167]},{"title":"Breaking Dawn: I miss Buffy","rating":1,"date":"5 January 2012","review":"Let me start by saying that I would claim these movies to be in the best of cinema category if they just changed the genre from \"drama, romance, horror\" to \"comedy\". That's seriously all they need to do because the awful dialog is back, the horrendous story and the terrible characters are back. You know the funny thing is, the story actually has some extreme potential to be a great horror story with some in depth drama and dimensional characters with a powerful conflict. A vampire has sex with a human impregnating her with a child that will most likely kill her but she doesn't want to give the baby up so easily. But this is Twilight, where Bella Swan likes to play boys back and forth like a pin pon ball and the boys are chumps.<br><br>The newlyweds Bella Swan and Edward Cullen are finally together forever as they are wisked away to a private island where they make love for the first time, but everything is cut short when a series of betrayals and misfortunes threatens to destroy their world. Bella soon discovers she is pregnant, and during a nearly fatal childbirth, Edward finally fulfills her wish to become immortal. But the arrival of their remarkable daughter, Renesmee, sets in motion a perilous chain of events that pits the Cullens and their allies against the Volturi, the fearsome council of vampire leaders, setting the stage for an all-out battle. In the end of the movie, Bella, with her baby cut out of her and injected with vampire venom, finally wakes up from a coma. But will she turn into a vampire in time to raise a cute little CGI vampire baby? You'll have to wait another year to find out.<br><br>I swear on my life, Bella Swan would have made a great Shakespeare villain somewhere. This is the most selfish, manipulative, self righteous little (you know the B word that I cannot say on IMDb) ever in the history of books or cinema. She finally gets her wish, she's married Edward with the same \"enthused\" look that she always has with that dumb open mouth grin with bunny teeth and yet she's STILL flirting around with Jacob, sometimes in front of her husband! She's made every bad decision known to man, yet she still continues the same path where she wants to remain human for a few more nights because she doesn't want to hurt on her honeymoon, umm, you've been begging to be a vampire and picking at Edward every chance you get and when told that he could kill you she's like \"yeah, it's cool\". He hurts her with bruises and she's like the abused wife \"no, it's OK, I know he loves me\". Then she gets pregnant and everyone is begging her to get rid of the baby as it will kill her, she says with the same dumb grin and expression of monotone voice \"it's a miracle\". Oh, my God, how this is supposed to be the woman that these two guys are fighting over? She's so boring, so awful, not pretty, doesn't have any special talent, what is wrong with this world that they think she is worth fighting for?! All these immortals are risking their lives for this girl who is the blandest character you've ever seen.<br><br>Jacob comes into Edward's home, disrespects him and cuddles up to Bella and Edward is cool with it, almost encourages it. Taylor Lautner, I give him a little credit because during this one sick scene where Bella says she'd name the baby if it was a boy \"Edward Jacob\" and he has a look of disgust that I had too. Finally, someone almost stood up to Bella! I'm not crazy! They use full songs during the movie that are so random and out of place that it felt so awkward. The story is 30 minutes long into a 2 hour movie that isn't interesting and is an unintentional comedy. Billy Burke is the only actor who seems to give any kind of emotion to his role and I think he's just playing it like he's expressing in real life that he's just sick of this franchise. I give the movie credit for making me laugh hysterically, I needed a good laugh and Breaking Dawn definitely gave that to me. No matter which director they get, this series is doomed and tame. They are milking it for every penny by splitting a book that was written by a 5 year old into a 2 part movie that is drawn out with no suspense or interesting moments. I don't know why women(I'm a woman by the way) love this franchise, it's insulting and absolutely horrible. I have to cut the comment off but just trust me, I could go on about how bad this movie is but we'll sum it up by saying: skip it.<br><br>1/10","user":"Smells_Like_Cheese","rank":[88,116]}]