[{"title":"Disney discovers The Great Pyrenees !!","rating":7,"date":"19 December 2009","review":"\"Santa Buddies\" is an entertaining family flick, that really hits the mark when it comes to the Christmas spirit. The dogs are fun to watch and very adorable and the cast is OK, with known names as Christopher Lloyd (Back To The Future) and George Wendt (House, Cheers TV-series). Not just for the kids among us, it is enjoyable for anyone. Talking dogs is nothing new, but it is nicely done with lots of funny moments. <br><br>But what kind of dog is that white puppy and the great white one ? Well the answer is: Pyrenean Mountain Dogs, also known as the Great Pyrenees. We happen to own one ourselves and they are kind of rare. It is nice to finally see them on the big screen.","user":"homecoming8","rank":[17,22]},{"title":"Love this magical movie","rating":10,"date":"14 November 2012","review":"This movie was full of Christmas magic and inspiration. I loved it, and will always list this movie as one of my favorite Christmas movies. It shows how important it is to have Christmas spirit, and never lose faith in Santa Clause. The puppies in this movie are so cute, I love movies with animals in them. I would recommend this movie to anyone and everyone of all ages! If you ever lose faith in the spirit of Christmas this is a movie to come to. It is so heartwarming and full of love. It reminds us that Christmas is about more than presents, and miracles do come true on Christmas if you truly believe. This movie shows us that those who are bitter and cold have not let Christmas into their hearts. If only you accept Christmas, you will feel it's magic. This movie shows that, and helps to inspire.","user":"lucynm","rank":[5,5]},{"title":"Kids need Air Buddies films...","rating":10,"date":"25 November 2009","review":"I am a big fan of the Air Buddies series. It's hard to find clean fun in movies nowadays, even from Disney. I think my children really enjoy these films. The story lines are sweet and heartwarming but not too complicated for younger ones to misunderstand. I find each of the buddies so unique and creative in their own ways.<br><br>As soon as this movie started I noticed that, like all the buddies movies, the CG is terrible, but still believable for little eyes. The scenes of the toy factory really bring in the Christmas spirit for me. I was also surprise to see Christopher Lloyd back in films.. He has a wonderful role in this one. Also the soundtrack and all the songs are just wonderful.<br><br>If you don't like the buddies... at least rent this one for your kids.. it's a really touching Christmas tale. It teaches the kids about responsibility for your actions, friendship, giving, and the importance of Christmas cheer.","user":"crash523","rank":[20,29]}]