[{"title":"Forced...","rating":2,"date":"26 October 2013","review":"The characters and jokes seem forced... The special agent seems to be written to be kooky, but is nothing like the spectacular character Defoe played, and comes across as annoying. Almost bad enough to be laughable - hard to watch.The plot does not seem to be cohesive. A very few characters in the movie come across as believable - many say their lines, but the words sound odd... I am working hard to write anything else about this movie to make ten lines since I really thought it was awful and there are only so many ways you can talk about how terrible the lines, characters and lack of plot are. I am rarely a fan of sequels and this movie proves exactly why I am hesitant to watch subsequent offerings on good movies.","user":"elizgomez","rank":[14,15]},{"title":"I got what I wanted as a fan. Others might not.","rating":8,"date":"21 November 2009","review":"I am an avid fan of the original movie. While the concept of vigilantism has been around for decades in film, it was never communicated in such a way. The original movie was both entertaining, and made certain statements about society. After all, isn't the first purpose of film to entertain, and the second to create a message? If the first movie focused on the message, the second seemed to focus more on the entertainment. I'm OK with that. I already know what the McManus boys are all about. Still, it was refreshing to see Il Duce's beginning as a killer, even catching a glimpse of the first version of the gun vest.<br><br>I was very skeptical of Clifton Collins Jr., thinking that he would simply be a stand-in for Rocco. He wasn't. He had his own personality, although I would have liked to have seen him involved in what the boys were doing on a more personal level. It was like he was waiting for them to come along just so he would have an excuse to kill mobsters.<br><br>The humor, slow-motion gunfights, and light-hearted moments were back. During the first half, I sometimes felt the humor needed to be left behind and the serious tone needed to come into play, but the second half delivered that aspect very well, so it balances out in the end.<br><br>Julie Benz. Hmmmm. Attractive, intelligent, fun. But the southern accent is so thick I had a hard time focusing on anything else.<br><br>I would like to make a special note of how ridiculous it is for someone to dual-wield Desert Eagles, even if they have compensators attached.<br><br>Still, none of my complaints stopped me from enjoying the movie. I watched it for what it is. An over the top-low(er) budget film that was written to please fans of the original. I took it for what it is, and I think I'm better off for it.<br><br>Many people criticize Troy and the films themselves, some going so far as to say fans should go kill themselves. The internet, where everyone thinks their opinion is fact, and everyone is a hardass. If you don't like the movies, fine, but please, don't insult the intelligence of the fans. Liking something that you don't doesn't make us any less intelligent than you. If you want to pick on someone, pick on the Twilight fans that think those movies are a real representation of love and vampire mythology.<br><br>I hear Troy can be a bit of a douche. Maybe that's true, maybe it isn't. What isn't true, is that the movies do not rip off of Tarantino. I like Tarantino's work, but he was not the first person to do the flashback narrative, dual wielding of pistols, slow motion gunfights, etc. etc. That's like saying Halo was the first good shooter. All movies borrow elements from one another. They're called themes and archetypes.<br><br>All in all, an enjoyable film that gives the fans a taste of what they've been missing for ten years. The editing is a little spotty at times, and not everything hits the right beat, but simply to see the boys in action again was enough to make me smile and laugh out loud, and once again, isn't that what movies are supposed to do? Its supposed to entertain us.","user":"thedarkwolf333","rank":[207,288]},{"title":"What a waste...","rating":2,"date":"18 February 2010","review":"Let me clarify something right off the bat... I am not a fanboy who rated this thing a 10 and down votes every negative review here. But I'm also not a hater. I enjoyed parts of the original movie when it came out. Sure it gets a little sillier with each subsequent viewing and there's nothing terribly original about it but it had an infectious style and a solid cast.<br><br>To be blunt, I can't even believe this sequel is for real. And I'm shocked how many fans of the first film say they enjoy it. For me this was a complete misfire every step of the way. The plot is ludicrous. Not because it's too complicated but because it just defies logic. It is not a compelling story on any level. It's an excuse to get the boys back in their pea coats and shooting guns in slow motion. There isn't a single plot point that's credible or followed through on. The movie keeps changing what it's really about. It doesn't feel like layers in a mystery are being pulled back. It feels like Duffy had no idea what this was really about and just kept letting the script wander. Characters are introduced halfway through with no real purpose or development.<br><br>The acting just flat out sucks. And I like a lot of these actors. Aside from Billy Connolly and Peter Fonda no one understands how to be subtle. They all crank it to eleven and turn themselves into cartoons, not characters. I thought the first one did a much better job of balancing the humor, action, and drama. Duffy appears clueless on how to accomplish that this time out. The bad guys aren't remotely threatening and even the returning detectives are made to look like buffoons at every turn.<br><br>The action scenes in the first film contain a lot of creative ideas that aren't shot as well as they could have been. They're not terrible, but not mind blowing. This one is just embarrassing. Every action beat consists of slow motion, techno music, and the brothers standing in plain view and not getting hit once (until the end when the script requires them to).<br><br>It also just feels smaller and cheaper than the original. The settings in the first one seemed real and dirty. We got a sense of the blue collar life in Boston. This one feels like it was shot on sitcom sets. And with hardly any extras it feels like our main characters and villains are the only people in the city.<br><br>I know you're all going to bury this review because you don't agree but there wasn't a single thing I found redeeming about this movie. Bad script, bad acting, bad directing, bad music, bad editing... it's just bad.","user":"headfulofghosts126","rank":[199,312]}]