[{"title":"A superb performance from Romola Garai","rating":8,"date":"14 August 2011","review":"Anne Keyes disturbingly uncovers a sinister plot without apparent motive in a story told as a flashback in a way that is helpful to its audience.<br><br>This is a very British film about guilty pasts, family values and inner strength set around the outbreak of WW2. As with much British mystery drama on screen there is a lavish dedication to quality acting, strong story telling, and brilliant cinematography. It is a compelling watch despite some plot flaws and moments when the story doesn't quite flow as convincingly as it should. But there is tension, intrigue, suspense, and menace in just the right quantities to keep us gripped and interested.<br><br>Romola Garai gives us a superbly convincing portrayal of Anne with some great support notably from Jeremy Northam (Balcombe), Sam Kubrick-Finney (young Walter), Hugh Bonnevile (Gilbert) and Juno Temple (Celia). Some familiar faces also provide strong cameos.<br><br>My one reservation about the film, and what stops me from awarding more than eight out of ten, is that it is slightly too cold, too austere, too abrupt when, perhaps, we are in need of a little warmth and camaraderie. But this is a story about the outbreak of war and the destruction heaped upon truth, privilege and family values and so it is a matter of subjective judgement. You should go and see it for Romola Garai's performance alone.","user":"perkypops","rank":[20,22]},{"title":"Be very careful with your praise...!","rating":6,"date":"24 April 2011","review":"Glorious 39, when I first heard of it, ticked all of the boxes for what I would normally like in a film - Romola Garai, David Tennant, Bill Nighy, 1930s setting, war drama, so on and so forth. In what now seems a somewhat exaggerated tidbit of praise, Company called the film \"This year's Atonement\". As somebody who has both seen and read Atonement in great detail, these are big words that create big expectations, not all of which were met, unfortunately.<br><br>Acting-wise, I felt that the cast as a whole worked well with the dialogue and character types that they had been given. Bill Nighy is, as always, a delight to watch, but his dialogue was not so much of a delight. If somebody finished every single sentence to me with \"darling\", as did their children, I would become suspicious of them long before Anne ever did. However I rather feel that Romola Garai has been, of late, a sort of amorphous mystery woman who is at first playful to the point of annoyance, followed by quivering and tearful, concluded with blankly staring into space. 'Emma', 'Daniel Deronda' and even to an extent 'Atonement' seem to follow this much of the time. As much as I like her as an actress, I never feel that there is any real defining trait (nor intelligence?) to her characters, though perhaps this is because of input other than her own.<br><br>Hugh Bonneville and David Tennant were excellent in slightly lesser roles, although their close relationships to the main characters remain the most intriguing mysteries of the film. I found myself repeatedly wishing that they hadn't died, if only to have two likable characters to watch by the end.<br><br>My main gripes with the film were the ridiculous framing of the story with modern-day, and of course the ending. The story-telling by the cousins was both unnecessary and implausible, and I would have been content with the 1930s parts on their own, as I gained nothing from the modern day section except that Walter remained a weirdo right up until old age. His character as a whole seemed like a cardboard insert to remind us that yes, we should be scared, and yes, this is a very creepy situation. Did he have parents? Did anybody ever know where he was at any given moment? How did he manage to have his own personal bubble wherever he went? The ending was, undoubtedly, the most pointless attempt at a dramatic ending that I have seen yet. I dislike being so harsh about it, but the Atonement comparison had set me up for a surprise ending that really hits home and makes you see the whole story in a new light. Instead I saw an elderly lady sneering at her cousins, presumably for having been in the same place as some people who did bad things.<br><br>To summarise, I guess I must say that Glorious 39 felt like more of a patchwork of filmic ideas (and clichés) than a coherent plot. Very few surprises were actually unexpected - you cannot expect an audience to have the same emotional connections to characters as your lead does, nor their naivety. We will suspect anybody and everybody, more so if they seem good on first appearances. And of course, this applies doubly when we have rented it out because it is a mystery! The film had its good points, naturally - as has been mentioned, it was visually \"sumptuous\", particularly in regards to costuming. I felt that the subject matter and, to an extent, the characters had potential, but Poliakoff would have done well to approach a few friends with the script and ask \"Does this make sense to you guys?\".<br><br>Sorry Company, but Atonement this most definitely is not.","user":"zombequin","rank":[23,27]},{"title":"I found this movie absolutely gripping","rating":10,"date":"11 September 2011","review":"Reviewers simply don't \"get\" the underlying tension of the film, which probably relies too much on viewers' understanding that many, many aristocrats/Tories were trying to avoid war with Hitler and often sympathized with him. If you don't know that, then you don't grasp the stakes of the film. Few British people would NOT know this, given that their abdicated king Edward and his wife Wallis Simpson openly admired Hitler, and many other high-borns found him quite right to attack democracy in its heart.<br><br>Romula Garai, one of the world's finest new actresses, carries the movie with her endless shading of emotions, her eyes opening to the horror that her family really is despite its large, warm embrace of her. And Bill NIghy is absolutely transcendent as her loving father and Tory MP who is supposed to negotiate American aid to Britain and who lets us know he is fiercely anti-war because of the destruction and death it deals. Is he what he seems, though?<br><br>I found this one of the few grounded portrayals of the British upper class attitudes pre-war than anything else I've yet seen.","user":"big_O_Other","rank":[46,59]}]