[{"title":"Touching Portrait of a Young Girl","rating":8,"date":"27 March 2011","review":"I was amazed at how non-political this movie was. There was a great deal of controversy around it, so I was expecting a polemic. It was nothing of the kind. It portrays the childhood and adolescence of a Palestinian girl, along with stories of her mother and her school headmistress. These stories illustrate, to some degree, the Palestinian history from 1947 to 1993. But the focus is on the women's stories. I think this is a movie that will be appreciated far more by women than by men. It is poignant and respectful. Most women will find something with which to identify in this film. The cinematography is beautiful and the lead actors are compelling in their roles. The movie has been criticized as disjointed, but that's because real life does not have a formulaic dramatic arc. And sadly, there is no \"conclusion\" to the movie because the conflict is ongoing.","user":"nyshrink","rank":[40,49]},{"title":"One of the most important reviews I have added to IMDb","rating":9,"date":"9 April 2011","review":"Run, don't walk, to see this movie. If you miss it while it is in the theaters, put it in your Netflix queue. My wife and I see a lot of movies, independent and mainstream and this is one of the best. <br><br>Yesterday we saw a mainstream movie, Hanna, which was a major disappointment, except for the excellent acting of Saoirse Ronan. I gave it a 5 because the story was so terrible and I didn't have any emotional involvement concerning what happened to Hanna. <br><br>We generally don't go to two movies, two days in a row, but I was so disappointed in Hanna and have been interested in possibly seeing Miral since I heard Rula Jebreal on NPR's Tell Me More. She wrote the novel and the screenplay the movie was based on. I was surprised that she received such a chilly reception on the show, so I remembered to check out the movie online.<br><br>On METACRITIC, which contains reviews by major critics, there were 17 reviews; 3 positive, 12 mixed and 2 negative. Overall it was given a 45 out of 100 which means generally mixed reviews and near the low end of that scale. Keep in mind that Hanna got a 64 which means generally favorable reviews. I read a number of the critic's reviews of Miral as I often do before seeing a movie <br><br>I also read all of the six reviews available at that time on IMDb. There were only five usable as one was written by a person who, in my opinion, had an agenda and, based on his review, had not seen the movie.<br><br>Having consulted METACRITIC and IMDb, I was convinced that my wife and I might like this movie, but would probably not rate it above a 6 or 7 out of ten after we saw it. I always keep in mind that there are movies with overwhelming favorable reviews that I have hated, including The Diving Bell and The Butterfly which had the same director, Julian Schnabel, as this movie. Lost in Translation is also in that category.<br><br>My wife and I came to this movie without prejudice for one side or the other. We were just looking for a well made movie that would entertain us. We were so pleasantly surprised. The acting was excellent, the story involving, and we were quite tense in the last third of the movie. Unlike Hanna, we really cared what happen to Miral.<br><br>I agree with Spencergo, this movie should be seen by a wider audience, but I know it won't. The reason that this review is so important to me is most people will skip this movie because of the mixed reviews, and they shouldn't. Unfortunately, many independent films, like Rabbit Hole last year, get missed. I sincerely hope you give this movie a try if you can find it at your local independent theater.","user":"jwbeller","rank":[44,58]},{"title":"Quite Possibly the Best Palestinian-Israeli Film to Date","rating":11,"date":"11 July 2011","review":"A drama centered on an orphaned Palestinian girl (Freida Pinto) growing up in the wake of Arab-Israeli war who finds herself drawn into the conflict.<br><br>You might wonder: Freida Pinto is Indian, so why was she cast as Palestinian? -- Some critics took exception to this, or the idea that she is too beautiful to play an ordinary girl. Are ordinary girls not allowed to be beautiful? And while her Indian heritage may seem out of place, I think this should be overlooked in light of the fact she is a tremendous actress and sold the character well.<br><br>What is so great about this film is that the politics are not the issue. The life of a young girl is. This is a film that shows the humanity of the Palestinians -- the DVD cover asks if Miral has the \"face of a terrorist\". After seeing the film, you have to say no. While the story covers a wide swath of history, from 1947 to the 1993 Oslo agreement, the politics are not the problem.<br><br>Schnabel tells me many of the critics were negative, and I do see some complaints that the editing was choppy, or the bizarre remark that Schnabel does not know how to direct women. Presumably many critics took exception to the positive portrayal of the Palestinians and the negative portrayal of the Israelis.<br><br>In fact, though, this is how one might view the film if looking for a certain angle. The Israelis are presented negatively, yes, but not inaccurately. But the Palestinians are not really presented positively -- just as human beings. There is still a father telling her daughter not to get mixed up with the PLO, and one scene has a stepfather raping his wife's daughter. That can hardly be seen as being positive (though the real point here is that people should be judged as individuals, not as members of a group).<br><br>The cast is all excellent, with plenty of Arab flavor. We have Willem Dafoe (a native of my city, Appleton) and Vanessa Redgrave for the \"white\" aspect. And then Alexander Siddig, probably best known as Bashir from \"Star Trek\", somewhere in-between (Siddig was born in Sudan, but was educated in London).<br><br>The film is PG-13, making it less raw but more accessible to audiences. This may have toned down the realism a bit, but it in no way compromised the emotional outreach that was a steady undercurrent.<br><br>Geoffrey Macnab calls the film \"courageous and groundbreaking\", while Mike Goodridge calls it \"sincere and thought-provoking\". Both are correct. The more unusual comment comes from Claudia Puig, who says, \"Schnabel puts his unmistakable dreamlike stamp on the film.\" Now, Schnabel is first and foremost a painter, so his goal is art. But to call this film \"dreamlike\" just seems off. This struck me as pure realism all the way. But who am I to judge? <br><br>Anyway, great film, and one that will be sure to spark discussion regardless of which side (if any) you stand on in the ongoing Middle East debate.","user":"gavin6942","rank":[16,20]}]