[{"title":"Mundane, Monotonous Redemption","rating":8,"date":"1 November 2011","review":"I normally don't like to call out other reviewers on their views, but I feel like the review that's posted on the page doesn't do this film justice at all. Sure, Jenna Fischer plays a very annoying character, and sure, her son is annoying as all get out, but to claim that either doesn't grow is a little rough. <br><br>I think the movie does a great job at exemplifying the tribulations of real life, and it's exactly the point of the film not to have a huge ending where everyone involved has an epiphany and changes all of his or her ways. Everyone has a ton of problems, but the fact that they aren't shown climbing triumphantly out from them is exactly how real life is, how many of you can just walk away from a rough marriage, or problems with a child, or the suspicion of an affair? These aren't things one can simply \"Get over\" within the span of days, or maybe even ever, and this movie shows that in a way that is quietly elegant. The viewer is left with the statement that things are going to be better, and the viewer has to trust that they will be, as opposed to being shown that they are. <br><br>It's a quirky sad film, one that doesn't really make the viewer feel all that great, but it certainly leaves enough room for a quiet warmth; a slow hope that stays with the viewer after the movie ends. It's a great film, an annoying and frustrating and awkward film, but a great film nevertheless. The viewer sees human beings interacting with each other, and very human reactions. It's nothing that's going remain with you for days, but it will make you smile.","user":"sam-becherer","rank":[15,17]},{"title":"Jenna Fischer Shines in Ensemble Cast","rating":8,"date":"26 June 2011","review":"This indie dramedy casts cutie-pie Jenna Fischer (of TV's \"The Office\") as Laura, a woman suffering from a variety of problems—dead-end marriage, unappreciative son, bitchy sister, condescending mom—that no amount of beer and cigarettes can make go away. Then things take a turn for the worse. The movie is about how lies infect the soul—how they grow, like a cancer, and end up spoiling life. There are impressive turns by Ron Liebman and Lesley Ann Warren as Laura's parents, and Kim Coates as a calculating attorney—the embodiment of Satanic dishonesty, he might as well have been carrying a trident. \"A Little Help\" may not wind up in a lot of the year's Top 10 lists, but I found myself caring about the characters, warts and all. (For once, Fischer is photographed in a way that is not particularly attractive). A winning effort by first-time feature writer/director Michael J. Weithorn.","user":"brettster","rank":[21,28]},{"title":"Great little movie","rating":9,"date":"21 May 2010","review":"Saw this tonight at the Seattle International Film Festival. I was not expecting such a good movie. The writing and performances had the full house laughing throughout. This is definitely a \"dramedy\" though. A lot of touching moments between Jenna Fischer's character and Daniel Yelsky, as well as Jenna and Rob Benedict. I expect this film to do quite well once it picks up a distributor. If I had to compare it to other films, James L. Brooks better films came to mind, as well as PT Anderson -- mostly because of the superb casting and writing. I wouldn't change a thing about this movie. I almost forgot to mention the new songs by Jakob Dylan that fit the movie so well. I'm still going to see another 15 or so movies at SIFF, but I fear I have already seen the best film that will screen at the festival.","user":"erpmeis","rank":[29,43]}]