[{"title":"Not Oscar material but enough to keep my interest","rating":7,"date":"22 October 2009","review":"Having never read Nora Roberts version, I came to this movie with an open mind. A few other reviewers have found numerous faults with this movie but to be fair to it, this movie dealt with so many issues that honestly do affect people in real life. Guilt. Blame. Feeling of being deserted by parents. Uncommitted love. Greed.<br><br>My spoilers are very mild and should not ruin the surprises in the movie. They do not reveal the ending or the killer.<br><br>There are no exploding gas stations or cars flying through the air, so if you need that sort of thing to be entertained this movie is not for you.<br><br>There were enough clues to throw my suspicion in several directions, so you really won't be sure \"who done it\" until the very end of the movie. I had a couple red flags pop up then down and it turns out one of them was correct. If it had been a game of Clue, it would have been one of my guesses.<br><br>Now let's address the scenery. Filmed in Alberta Canada we are treated to some incredibly gorgeous mountain scenes and an Oh so wonderful log home by a running stream. My Oh my, I would love to have a cabin like that. Maybe one day. But now back to the movie.<br><br>According to the story line, the hero is in Alaska at the invitation of the town mayor. It seems someone wanted an \"outsider\" to be impartial as police chief in this humble little town. The new chief is running away from some very unpleasant dealings in the town of Baltimore, MD. He is an experienced cop which will prove to be a necessary skill before the movie ends. The mayor is a delightful older lady and crusty enough for us to believe she has lived in the far north all her life.<br><br>Two climbers find a body by accident. Someone had committed a murder fifteen years earlier and it has been frozen in time.<br><br>There are the usual grumpy suspects to give us a wide assortment to chose from. There are some plot twists and turns, and a bit of humor you might catch unless you are a big city person who has never lived in a small town and known people like these.<br><br>I loved the scenery and the log buildings. I hadn't seen Rosanna Arquette for awhile and I thought she was quite attractive as well as LeAnn. There are some fellows I assume the ladies would find to be eye candy as well.<br><br>The baiting of the bear at the cabin might actually have worked as planned to eliminate the new police chief. Knowing how bears are the city cop might have tried to take the bear with his little nine mm pistola and lost his life to one very angry bear. I do feel the \"friendship\" between our hero and LeAnn was a bit too rushed, but in cold climates relationships might heat up a bit faster than normal? There were some clichés near the end. The interfering state cop gets wounded when he absolutely had the drop on the bad guy, The girlfriend injects herself into the shootout scene and gets wounded.<br><br>I think the actors did a reasonably good job with their roles. I never got the feeling they were \"acting\" as I have seen in some other movies. I now have the desire to read the novel to learn why others believe the book is better.<br><br>It at least has a happy ending, which I like, and I would hope you will too. I actually watched it a second time to determine how many clues I missed as to who the murderer was. I had the bad guy pegged at one time but then let another clue pull me off track.<br><br>Watch it just to see how well you do catching the killer. When it is over will you feel like a Columbo or just a dumbo?","user":"headhunter46","rank":[9,10]},{"title":"Death by Moosemeat","rating":4,"date":"28 April 2009","review":"*** Spoiler Alert *** My wife is a devoted Nora Roberts fan, and so I have done my duty as a faithful and loving husband to DVR and watch all of these movies with her.<br><br>From the husband's perspective, they're not terrible, but I certainly hope that the plotting in the books themselves hold up better than some of the plotting in the movie adaptations.<br><br>In this one, early on we get two boys out hiking and finding a body. Do they take note of the spot and hike home to notify someone? No, one stays with the body while the other hangs around a clearing on a mountainside to flag down the search plane.<br><br>Seriously folks ... not going to happen that way.<br><br>The acting and parts of the mystery were OK for a good while, and then we get to: Attempted murder by HANGING MOOSE MEAT (read with loud ponderous voice).<br><br>That got my eyes rolling to the point where the rest of the movie was hard to pay attention to.<br><br>Shooting it out with the bad guy during the middle of a parade, as this ending had it, was a bit hard to take too. This is not a town that was easy to get out of. The guy didn't know yet that he'd been nailed as \"the guy\". So of course officers would have simply waited until after the parade, keeping him in sight, and quietly arrested him later in his office.<br><br>I think the sheer volume of movies of this type (and/or novels of this type) mean that writers have to try to push a bit to get something different into their story. That is a fine sentiment, but not when 'what is different' defies any logic whatsoever.<br><br>This is not a knock on Nora. As I said, my wife devours everything she writes, and my wife is an educated, professional, and intelligent woman ... so the books can't be doing too much of this. The movie sure did, however.","user":"vranger","rank":[9,10]},{"title":"My reaction to this film is much warmer than the frigid Alaskan scenery.","rating":7,"date":"2 October 2010","review":"I'm puzzled by the reactions of those who trash this film. It's no world-beater, but it's a fairly entertaining film most fans will probably enjoy viewing. Nothing particularly novel here, but it's well enough done for a TV movie and if nothing else has some great scenery.<br><br>Possible spoiler: There is one serious flaw in the script. The newspaper editor is murdered and the killer tries to make it look like suicide, even leaving a phony suicide note on the editors computer. The problem here is that there is no mention of any attempt to ascertain whether there were powder stains on the dead man's hand.<br><br>I was put off by the existing reviews before watching, but now think those reviews are unfair. We're not talking about a classic work of cinema here, but I have seen really bad movies, and this one is certainly better than those.","user":"bill-790","rank":[3,3]}]