[{"title":"A Big improvement over Iron Man 2 : Defending an Underrated Marvel third entry!","rating":9,"date":"22 October 2015","review":"Iron Man 3 (2013) is A Marvel pure, fun, popcorn, Action Film and the third entry of the Iron Man trilogy. It is an awesome superhero Action flick a huge improvement over Iron Man 2 (2010) and million ways better than the new Marvel comic book film Avengers: Age of Ultron (2015)!!!!!!!! This film is very criticized and bashed from it is fans. I admit it the first time I watched this film, I hated it, with the Mandarian joke the twist and Guy Pearce been the bad guy and so on. But now after I watch it I was highly impressed and Entertained, this film wasn't boring it had less humor in it and was the most serious with action scenes. Shure there is less Iron Man and more Tony in it, but doesn't ruined my loving for Iron man trilogy! The most what I love of this film is. There wasn't any Avengers in it trough the whole film. Only Mark Ruffalo as Bruce Banner/Hulk made a cameo scene on the end of the credits but that was it and it did not bother me or annoyed. The story centers around Tony Stark not Avengers, that is why I just love this movie! Thank god Jon Favreau step down as the Director and Shane Black replaced him! I was surprised by the fact that Disney allowed Shane Black making an Action film flick in Lethal Weapon and Die Hard With a Vengeance style! Yes Action style!<br><br>I am defending this film against haters. I know a lot of people who will see my review will put it down, just like 30 people put down my review Avengers: Age of Ultron (2015)! First off this film isn't Die Hard With A Vengeance or Lethal Weapon film even tough Tony and Rhodes are fighting with guns without their armors. I love the film because it is serious it has Action. Gwyneth Paltrow did a wonderful performance as Pepper un like she did in Iron Man 2. And yes fans I am saying it. She was so damn annoying in Iron Man 2, I disliked watching her in that movie, in this film she is a supporting and caring girlfriend unlike Iron Man 2.<br><br>I love this film because The film sets place after the events of The Avengers on Christmas Eve!!! Tony Stark (the always wonderfully charismatic Robert Downey Jr.) is falling apart. This is the first time I see Tony Stark and Iron Man in a snow in Christmas, This film reminds me on Batman Returns (1992) Tim Burton's film. It is pretty good. The attack on Tony's house whit helicopters blowing Tony's house to pieces was the first time in the film I ever saw. Gwyneth put Iron Man Armor on in and she saved Maya Hansen that was outstanding. The scene was pure action! There was kid in this film and no he wasn't annoying, he did a good job helping Tony Stark against his post traumatic stress disorder attacks. Not annoying kid and I think he did a good job. Tony Stark was brilliant fixing and building a new armored suits. Iron Man saved 13. passengers from falling off the airplane Air Force One, tough he crashed in the truck, I loved that scene. Aldrich Killian participated in the development of Extremis thereby amassing a group of Extremis-enhanced soldiers under his command. Killian played by an awesome Guy Pierce did a wonderful job portraying a villain to Tony Stark. I really think Guy Pierce just did an amazing job portraying a villain in Iron Man 3 he was some A.I.M. soldier creating a terrorist attacks and he was brilliant to make an alias Mandarin! To mask his illegal activities as terrorist attacks he created the idealized terrorist persona known as the \"Mandarin\"! that was brilliant and I love the twist!<br><br>Tony Stark, is proved in this third and more than likely final chapter in the solo run of Iron Man. Iron Man 3 or Three as it appears in the end credits amps up the action and closes out the trilogy on a high note setting Tony's eventual return in summer 2015's Avengers: Age of Ultron. But in his most darkest moments he is challenged by his emotions of what happened to him in New York, while dealing with the biggest threat he has encountered: Mandarin. Without given any plot points away for those who may have not seen this, but Iron Man 3 is well worth the admission and then some. People Iron Man 3 sets up Marvel's Phase 2 of features.<br><br>This is the best Iron Man movie yet, better than Iron Man 2 and Avengers: Age of Ultron (2015) Loved the storyline and Tony was a genius and brilliant again as usual. Great special effects. A very busy, action- and humour-packed comic-book flick. Better than Iron Man 2, but not nearly as good as the original. As usual, Ben Kingsley (as Trevor Slattery) rocked, as did even-sexier-when-angry Gwyneth Paltrow. :-D The acting. Robert Downey is as good as ever, Paltrow, Pearce, Cheadle &amp; Co follow not far behind. The best is Ben Kingsley, though, although his character is ... no, I just want to mention the Good here.<br><br>Iron Man 3 (stylized on screen as Iron Man Three) is a 2013 superhero film featuring the Marvel Comics character Iron Man, produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures.<br><br>When Tony Stark's world is torn apart by a formidable terrorist called the Mandarin, he starts an odyssey of rebuilding and retribution.<br><br>The rating I am giving to this movie is 9/10","user":"ivo-cobra8","rank":[139,175]},{"title":"love this movie highly recommend","rating":8,"date":"24 February 2020","review":"It's always hard to see a movie with Robert Downey, Jr. and not find his sarcasm and personality incredibly charming. He really shows why he is one of the best on-screen superheroes today by showing that he can have good chemistry with everyone ... even a young child. This is a huge step-up from \"Iron Man 2,\" which failed in many different ways. It features a very promising villain that could also be the setup for future installments of - not only the \"Iron Man\" movies, but the entire Marvel Cinematic Universe.","user":"MR_Heraclius","rank":[40,51]},{"title":"Hated it at first, I like it more each time I re-watch","rating":8,"date":"9 November 2013","review":"The first time I saw this movie I really didn't like it, I had just come off the high of \"The Avengers\" and let me make it clear, this one isn't as good. That said it is significantly better than Iron Man 2 and that's because the story is deeper and direct. There's a lot less focus on explosions and fancy effects (although there is plenty of that) and more on dialogue and character development.<br><br>One thing I like about this movie is that you get to learn more about Tony Stark, as much as I loved his arrogance in IM1, 2 at the end of Avengers he was humbled and that continues in this one. On the one hand I love the suits and the fancy technology but it's Robert Downey's sarcasm and wit that make him so great for this franchise.<br><br>Yes there is a big plot twist but it by no means ruins the movie and while I was not a fan of the ending, you can see where things are going towards Avengers 2.<br><br>It may not be for you, my only advice is to make sure you watch it again. I was angry the first time I did and thought the movie was a joke, each additional time I've watched it I take something more from it and enjoy it a little more.","user":"shangsta","rank":[75,102]}]