[{"title":"Carter thinks he's past it all ....","rating":8,"date":"13 February 2014","review":".... but Carter learns he misperceived something important! What a fun movie to watch! Everybody plays their part well.<br><br>Poor Carter is caught in the middle of everybody's problems and needs. Then he discovers his past isn't quite what he thought it was! He has to pull all the family together for a wedding and maybe along the way he fixed a lot of lives.<br><br>This is a feel good flick and it's done very well - no problems for me! You might not laugh out loud but I'm sure anyone will smile throughout this story!<br><br>Watch it! You'll like it!","user":"cekadah","rank":[9,9]},{"title":"A few funny moments, but too clearly a personal catharsis","rating":4,"date":"8 February 2014","review":"As I started watching this movie, it became very obvious that this was a very personal, cathartic movie. I have no problem with that, it's done all the time--but what's important, interesting, funny, and meaningful to the writer/director, doesn't always translate into something meaningful to the viewer unless there is far more skill in the storytelling. And that is what I think this movie lacked.<br><br>The plot simply covers the story of a a kid named Carter (and his younger brother Trey) who's father was a philanderer as a husband, as well as fairly cold and distant as a father. The father and mother haven't spoken for 20 years and the father has gone through several other step moms over those years.<br><br>I'm sure the \"seminal\" moment of Carter's 9th birthday was a huge deal to writer, but it was thrust at us so quickly at the beginning of the movie that we didn't have time for any background/setup to even know or care what was going on. To me, that scene which was apparently so pivotal ended up a throwaway scene because the writer seemed so eager to tell it that he told it too soon without any context whatsoever.<br><br>So we fast forward to Carter's now-successful (at least career-wise) life. There are a lot of funny moments here, but nothing we couldn't see in a half-hour sitcom. But the road the movie takes us down is a bit meandering and it seems very clear that we're going to have some sort of too-neatly wrapped up happy ending designed to close every loose end with a perfect situation and end all the pain of all the children who've gone through this situation.<br><br>To me, it just smacked too much of someone dumping his messed-up life on us and his wish of what could have been. It didn't make for an entertaining movie. Maybe a half-hour episode of Trophy Wife or something would have been a better venue for this story. Jimo","user":"jimojimo","rank":[21,27]},{"title":"Good fun","rating":7,"date":"25 September 2016","review":"Think the reviews are unfair - it's a well made film, it's different and the cast are great.<br><br>No, it's not perfect. It's the not the best film ever made - but it is a good film, it's not the same story line that's been churned out a million and one times. Its definitely worth a watch, and the cast is great.<br><br>I love the multiple genres included in the film, it created a real life feel to it. Adam Scott is a great lead with a great cast around him. This is a great film to just chill out and watch without to much thinking that be enjoyed by all.","user":"monkey_bean10","rank":[5,5]}]