[{"title":"Beats my family gatherings for verbal mud wrestling.","rating":9,"date":"9 January 2014","review":"\"My wife takes pills, and I drink. That's the bargain we've struck.\" Beverly Watson (Sam Shepherd)<br><br>Let the acting begin: As if the race had begun to determine the most disaffected member of the most dysfunctional family ever depicted on film, August: Osage County is the most violent film this year without a drop of visible blood.<br><br>In order to pull off this Eugene O'Neil-Tennessee Williamsl-Sam Shepherd-like dramatic version of Tracy Letts' play (Letts is the screenwriter as well), director John Wells needed to have an A-list cast; he does just that. In arguably the best acting of the year, Meryl Streep plays Violet Weston, the drug-addled schizophrenic matriarch of a family where dinners end up with broken plates and hearts. Although her performance is a tour de force (when are hers not?), the Oscar may elude her this time because her character is so unlikeable, and, well, she eats most of the available scenery.<br><br>Heading the rest of the cast is Julia Roberts as daughter Barbara Weston, a soon-to-be-divorced realist absorbing the punches of mom and Barbara's Pippi-Longstocking-chasing husband (Ewan McGregor) until she almost can't take it anymore. This is the best acting of Roberts' career. <br><br>As if the challenges were not enough for a Thanksgiving in any of our families, Juliann Nicholson's Ivy Watson is so vulnerable that she has fallen for first cousin, Charles (Benedict Cumberbatch), a liaison discouraged by the family rank and file, whose ethical button is pushed by such irregularity but never their alcoholism and verbal abuse buttons.<br><br>The ultra-emotional violence and the pervasive shouting may turn away some delicate-souled audience members, but for me a language lover, sparring at the dinner table is delightful out-of-control wit. Acerbic to be sure, but not dull.<br><br>Barbara encapsulates the horror of the family: \"Thank God we can't tell the future, or we'd never get out of bed.\"","user":"jdesando","rank":[51,61]},{"title":"a sick bunch gathers to mourn a family member","rating":10,"date":"18 November 2013","review":"\"August: Osage County\" is a stunning, powerful play written by Tracy Letts - it rocked Broadway and won the Pulitzer Prize. And it's going to rock a movie theater near you. This isn't a movie for everyone. It's exhausting, it's full of really despicable people, and it's mighty depressing. But the acting is so terrific, the roles so strong, that you don't want to miss it.<br><br>It's the story of the Weston family: Violet, a drug-addicted cancer patient (Meryl Streep); her husband Beverley, a well-known poet (Sam Shepard); their daughters Barbara (Julia Roberts), Karen (Juliette Lewis), and Ivy (Julianne Nicholson); Violet's sister Minnie Fae Aiken (Margo Martindale), her husband Charles (Chris Cooper), and their son, known as Little Charles (Benedict Cumberbatch).<br><br>When Beverley commits suicide, the family gathers and it's wretched from the beginning. Violet is totally drugged, Barbara and her husband (Ewan McGregor) are in the process of breaking up, Ivy has a secret boyfriend and, though she stayed behind and has been caring for her mother, she's ready to leave for New York, and Karen arrives with her fiancée (Dermot Mulroney) who has been married three times and seems a little too interested in Barbara's 14-year-old daughter. When Little Charles arrives on a later bus than he was supposed to take, his mother belittles him in front of everyone. Little Charles is considered a not so little loser, and is the only likable one in the film.<br><br>Each daughter has reacted differently to having parents like Violet and Beverley. Barbara is hard and tough like her mother, Ivy keeps her feelings and desires to herself, and Karen is a dingbat looking for love, probably in all the wrong places. The Aiken dynamic - obviously Violet and Minnie were forced to grow up to be as tough and mean as possible in order to survive; Charles is quiet with a fury underneath, and Little Charles looks like he's going to break in two any minute. He shares the same secret as Ivy: they're in love and planning to go away together.<br><br>This is a grueling story of the destructive force of addiction, the danger of anger, the hurt of betrayal, and the pain caused by keeping secrets.<br><br>I was not fortunate enough to see the Broadway play so I can't compare the performances. I thought Meryl Streep was terrific - it's the kind of role actresses love, a sort of Martha in Virgina Woolf gone completely haywire, and except for Helen Mirren and Judy Dench, there's no one better to tackle it than Streep. Julia Roberts gives what is probably her best performance. She's not a favorite of mine, and I don't find her a particularly good actress, but she almost pulls this off, probably because of the talent surrounding her. Margo Martindale as the caustic and bitter Minnie, who reminds her niece that she's not just her \"fat old aunt\" is sensational. Violet, Barbara and Minnie have the showiest roles.<br><br>In the male roles, Sam Shepard, though his role is small, is elegant and sympathetic, and Chris Cooper doesn't have much to do until a showdown with Minnie, which is galvanizing. And Benedict Cumberbatch - what can I say - I adore the man. He's a nasty villain in Star Trek and here, an insecure young man who hates himself for his tardiness and inability to keep a job. He's heartbreaking. He can do anything and he proves it here as he sings -- yes, sings! -- to Ivy.<br><br>Your family, no matter the problems, will look like Leave it to Beaver after you see this film. See it - enjoy the fabulous acting and be grateful that you're not going home to anything like it. I hope.","user":"blanche-2","rank":[153,196]},{"title":"Intense Film","rating":10,"date":"19 November 2013","review":"This film was amazing. The cast, director, and cinematographer are top notch. It will surely be nominated for several Oscars. I had a chance to view it during a Film Festival and was excited that I got a ticket to this sold out showing. But then, halfway through the movie, I nearly walked out. <br><br>The outrageous, violent, destructive behavior of the characters and between the characters hit a little too close to home for my comfort. For those who think the actions of the characters seem over the top, let me assure you they are not. When you mix addiction, lies, and a lifetime of pain, you get exactly this type of toxic concoction. <br><br>I required multiple tissues to get me through to the end, but ultimately I stayed (as a film lover, I could not bring myself to walk out of such a wonderfully crafted movie). I'm glad I did.","user":"mjcr93","rank":[129,173]}]