[{"title":"Visually compelling, bad writing","rating":6,"date":"22 May 2019","review":"The plot was extremely predictable and the dialog was weak, however Alicia Vikander's physical performance was amazing and there were a few standout moments of cinematography.","user":"dandelionpike","rank":[30,38]},{"title":"Makes Angelina's Version Look Like Shakespeare","rating":3,"date":"17 March 2018","review":"Angelina Jolie brought the highly popular video game to the big screen. Her versions were campy, cheesy and ridiculous - but they were a far cry better than this new version of Tomb Raider.<br><br>This Tomb Raider had two very good games (recently updated) to use as resource material and it looks like the only thing that they used was the idea of the island, the ship crashing on the rocks and the look of Lara Croft. The screenwriters ignored all the great characters that were in the game that would have brought this to life, they ignored the fact that a ship needs a crew (ridiculous point number one: one person manning an entire ship), they ignored the entire Trinity aspect of the game, they ignored all the good puzzle solving techniques, they ignored the fact that Lara was wealthy and trained herself in martial arts and weapons.<br><br>This movie starts out with Lara sparring and she is awful at fighting. Why? Why would you make her awful at fighting when that is the entire basis of the Tomb Raider series - that she can fight and is a strong woman who can defend herself. They have three teenage boys basically frighten her off - so she is afraid of three teenagers, but minutes later is hitting everyone (trained mercs) with a bow. <br><br>The father/daughter subplot was useless and not needed in this film. It was an aspect that drug the film down. And of course, the usual find daddy alive all these years and only to have a negative outcome.<br><br>The script was horrible. The writing was so juvenile and nothing was explained or written well. The direction was terrible. The acting was dreadful. The only positive was that Vikander looked the part - that was the only positive.<br><br>Don't believe the hype that the \"paid critics\" were given money to falsely promote this film. You would be better served playing Tomb Raider and Rise of the Tomb Raider - you would be more entertained watching the cut scenes from those two games on your computer than watching this boring garbage.","user":"galahad58-1","rank":[629,985]},{"title":"A little underwhelming","rating":6,"date":"20 August 2018","review":"Ironically in 'Tomb Raider' they got the hard part right and messed up the easy part. The hard part in my opinion was correctly casting 'Lara Croft'. To follow in the shoes of a peak-of-her-powers Angelina Jolie is no easy feat. They pulled that off though by finding Alicia Vikander who was excellent in this film. The part they messed up though, and why this is such a bland experience, was they just didn't give her anything interesting to do. <br><br>The film starts off fun. The character introductions are clever, interesting and get you amped for what is to come. Then when the actual adventure begins the entire film stalls and never manages to start up again. The location was mildly interesting, but for almost the entire film to be set on the one island just felt lazy and uncreative - especially with a runtime near 2 hours. Also the villain was about as dull as they come.<br><br>Vikander is what saves this from being a total misfire though. She has the look, the charisma and the sexiness to pull off the character with ease. There was a bit of controversy with the films poster and her abnormally long neck in it. I couldn't help but notice that she does have a very long neck in reality, but the poster was still taking things a bit far clearly. I certainly couldn't recommend this as a film to rush out and see because it is so uninspiring and middle of the road. It's not terrible, it just never dares to be great.","user":"jtindahouse","rank":[67,96]}]