[{"title":"this movie gets it","rating":9,"date":"1 September 2011","review":"As someone who was diagnosed with cancer two years ago (non-small cell lung cancer--and a nonsmoker to boot!) I've been through the gantlet, from 4 different kinds of chemo, several surgeries, and a wide variety of medical care from indifferent to deeply caring. So, trust me when I tell you, that this movie gets it.<br><br>It gets what it is like to receive a horrific diagnosis out of the blue, the numbness and shock of dealing with it, the well meaning friends and acquaintances who say the stupidest things (\"every time I feel sorry for myself, I just think of you...\"), and those friends who really become your rock as you go through the miasma of treatment and try to still make your life have meaning. Again, this movie gets it.<br><br>Joseph Gordon Levitt and Seth Rogen deserve high praise for the honesty that they bring to their performances. There was not a false note anywhere. The rest of the cast is terrific as well. I plan to see it again when it is released in a month.<br><br>This is a quiet film but it packs a great deal of power. I thought the humor was wonderfully placed, because without humor, life with cancer is unbearable. As too many folks know so well. Go see it and be entertained and learn a bit and rejoice in life even with cancer.","user":"reginac23","rank":[504,545]},{"title":"It's a balancing act.","rating":28,"date":"28 September 2011","review":"How does a filmmaker combine humor and drama in a story about a 27 year old man diagnosed with cancer? Easy: Just give them equal measure with the title 50/50 -- light treatment of a dark subject.<br><br>Adam (Joseph Gordon-Levitt) has to deal not only with his own emotions when he is diagnosed, but also those of a close friend, Kyle (Seth Rogen), an inveterate partier and ribald quipper, and his chronically worrisome mother (Anjelica Huston). Losing his girlfriend, Rachael (Bryce Dallas Howard) along the way adds to the potential downbeat. <br><br>Yet director Jonathan Levine and writer Will Reiser keep it all as upbeat as possible, not in small part due to Rogen's constantly funny chatter, which comes at just the right times as the plot gets heavy with cancer surviving techniques (the film turns out to show the way to battle: with humor). <br><br>Of course, Rogen has had training playing a similar role in Funny People with Adam Sandler. No one plays a weed-smoking buddy better than he. Gordon-Levitt is also an actor who can just about better than anyone else play the soulful, endearing, slow-moving romantic as he did in (500) Days. As a cancer victim, he engages the audience in observation of a vulnerable hero, who fights with a serenity and equanimity that could be a model for those wishing to survive and those who wish to help.<br><br>50/50 is a comedy with compassion, a distant cousin to the prevalent bromances that rarely treat the support men give each other in times of real danger. Usually it's vacuous women who supply that danger and significant support. Hooray for the men this time.","user":"jdesando","rank":[88,102]},{"title":"The perfect balance between drama and comedy, '50/50' depicts cancer the right way","rating":9,"date":"30 September 2011","review":"Most movies don't know how to handle cancer. Heck, most people don't know how to handle cancer — and I'm not talking about the patients. Cancer, or any other terminal illness for that matter, almost always plays some kind x-factor in a film — that is when a film even dares to enter a realm often deemed depressing and \"not for the movies.\" Most often, scripts will position cancer as a tearjerking emotional turning point in a film or as the initial spark of some banal \"live life to the fullest\" comedy.<br><br>\"50/50\" puts an end to that. Written semi-autobiographically by cancer survivor Will Reiser, it would seem it takes one to write one. Although cancer drives the entire story, the story doesn't fixate on cancer or melodramatize the terrible truths we already know about potentially fatal illness. Perhaps you could tell as much from the trailer thanks to some typical Seth Rogen antics, but the injection of contemporary R-rated humor is neither irreverent, insensitive nor an attempt to simply put a positive spin on a depressing subject. Life — believe it or not — doesn't stop for cancer. People don't sit in the hospital the entire time and then lie at home in bed the rest. Reiser's story provides a mostly unforced and honest depiction of a young man's diagnosis and treatment for potentially fatal spinal cancer, one where cancer isn't the conflict in and of itself, but the way it so dramatically changes the behavior of the people whose lives it enters and positively and negatively alters relationships.<br><br>Joseph Gordon-Levitt continues his spree of playing absolutely lovable main characters as Adam, a play-it-safe 27-year-old who after the initial shock handles his diagnosis in stride, keeping his ups and downs internal other than when the script cues him to let it out a bit. The more external symptoms come from Adam's girlfriend (Bryce Dallas Howard), best friend Kyle (Seth Rogen) and mother (Anjelica Huston).<br><br>Other than focusing on these relationships, director Jonathan Levine (\"The Wackness\") puts particular emphasis on character perspective, which will change instantaneously at points throughout the film. In one terrific sequence, Adam enters the hospital for his first chemo treatment and gets bummed out by all the sick and ailing people in the hallway. After the older men he meets while getting treatment (Philip Baker Hall and Matt Frewer) give him some marijuana-filled pastries, he leaves down the same hallway high as a kite, suddenly elated despite the same negative images lining the hall. Levine understands that so much of how you deal with cancer relates to mood and perspective at any given time.<br><br>Levine coaxes brilliant and thoughtful performances out of his actors. Even though Rogen exerted his usual shtick a bit more than needed, he handles his character as written, someone who wants desperately to help his best friend but hides behind shallow self-centered form of support that many men turn to because they can't communicate emotions all that well.<br><br>The women of \"50/50\" also deliver if not more so. Howard's character is an unlikable mess but she gives her performance convincingly. Anjelica Huston perfects the ideal on-screen mother, the best since Melissa Leo's Oscar-winning mother in \"The Fighter.\" Anna Kendrick also continues to blow me away with her talent. She plays a psychiatrist working on her PhD who receives Adam as just her third patient. She gives such lifelike quirks to her characters and Katie plays right to her strengths.<br><br>But in a drama/comedy about cancer, the key lies in tone and for that Levine should become an A-list director. \"50/50\" could have easily turned into a Hollywood hack-job like the various comic-toned cancer films before it, a film that either overplays the dramatic or overcompensates with the humorous, but \"50/50\" might be one of film's best balancing acts between the two. The shifts feel completely natural between moments of deep sentiment and moments of levity. Those who can't help but fixate on this being a movie about cancer will likely have to remind themselves to feel serious when \"50/50\" just wants you to simply absorb it as you would any other film.<br><br>Other than some predictable moments and plot devices to give the film a nicer Hollywood sheen, \"50/50\" provides a genuine and heartfelt movie experience, one that neither goes for the emotional sucker punch nor the sugarcoated version. Instead of making us look at cancer in a specific way, it makes us look at the way we look at cancer — or any uncomfortable subject — the way we talk about it or don't talk about it, the way we interact with those who live with it and the way we cope with it ourselves. That way when someone we love has a serious problem, we can ultimately do what's best for that person.<br><br>~Steven C<br><br>Visit my site, moviemusereviews.com!","user":"Movie_Muse_Reviews","rank":[119,142]}]