[{"title":"I wish I could say otherwise but I can't lie like that.","rating":6,"date":"22 February 2020","review":"A film that utterly lacked any substance. There was promise at the beginning with a great opening introducing us to the anti-heroes which was awesome. And then.... Nothing? Stranded such a talented cast fighting comical looking goons and an anti-climax of a villian. The two stars are for Viola Davis and Margot Robbie who give their roles everything. Every other character is disposable and forgettable. And Jared Leto as the Joker? Lets say no more.","user":"MR_Heraclius","rank":[48,52]},{"title":"Awful","rating":1,"date":"10 August 2016","review":"My god, that was AWFUL. Just random made-for-trailer tiny scenes that add to nothing, have zero depth and don't make up a coherent plot. Wall-to-wall inappropriate songs that come at random times. Boring plot (if you can even call it that), boring and indistinguishable flat characters. Harley Quinn was annoying. Jared Leto did his best as The Joker but had absolutely nothing to work with - he just appears at random times for a few seconds and disappears. There's no depth and no story. If you've seen the trailers, you basically saw all the one-liners and \"money shots\".<br><br>If all that isn't enough, the last third of the movie is simply unwatchable.<br><br>I don't think David Ayer is a bad director (I liked HARSH TIMES and FURY), but this is definitely his worst movie yet and I'm pretty sure it's due to massive pressure from the producers.","user":"room102","rank":[560,742]},{"title":"They're the bad guys LOL","rating":3,"date":"4 August 2016","review":"Disappointment. That's actually far better than what I felt after watching this movie. I wanted to leave the cinema about 30 minutes before the end but that's against my personal policy so I tried plan B but found nothing to poke my eyes out so I watched, and cried...<br><br>-First, where is Deadshot? No, because all I saw from start to end is goody Will Smith playing the good family guy, very far from the cold hearted hired assassin he is supposed to play.<br><br>-Second, what was that false publicity? The Joker appeared a lot in the trailer but he has absolutely no purpose in this movie apart from being the background story of Harley Quinn. Really, you remove him, you get the same movie but with only half of the theatre full.<br><br>-Third, while I'm on her, the guys who made this movie obviously didn't get the relationship between Harley and the Joker. The Joker don't give a damn about her, she is his tool, he can throw her from a bridge without a second thought while Harley has developed a serious Stockholm Syndrome toward him. In this movie they are all lovey-dovey, at the end of the movie I nearly expected to see them leave in a car with \"Just Married\" written on the back with a \"And they lived happily ever after.\"<br><br>-The first half of the movie is actually not that bad, the villains really look and act like villains most of the time but everything started to fall apart after Will Smith reunite his troops after they failed the mission the first time, each one of them just want to drop everything and leave but then Will Smith says they can't give up and of course all the bad guys listen to him because he is Will Smith (God?). That was when I did my first face-palm.<br><br>-This movie is 50% Will Smith, 40% Harley Quinn, and 10% the others. Really, apart from the first two, the others are just background characters, to make a comparison, in Guardian of the galaxy, you got one hero but you know the background stories of every members of the team, and they get their fair share of screen time. In this movie, they just don't care.<br><br>-The jokes, sorry... The \"jokes\", well, I think the quotes speaks for themselves. Sometimes it's funny, most of the times it's not and sometimes they even try to explain the joke you understand but don't find funny. I think Warner tried to be more funny and less dark in this movie after they got some bad reviews about Batman Vs Superman being too dark but that's just ridiculous, they remade some scenes to add jokes and sometimes it even breaks the action.<br><br>-And while I'm on it, Batman vs Superman had an impact in the DC Universe, it starts with the consequences of what happened in Man of Steel and at the end of it, the world has changed. In this movie, there is no progression of the DC Universe, it feels more like one of those filler episode you don't want to watch in any series.<br><br>-I won't talk about the end of this movie because, as a sadist, I want you to go watch this movie and suffer during the two hours needed to finally reach the end credits. Just know that the last minutes are actually way worse than the rest of the movie. Enjoy ;)<br><br>Anyway, as a DC fan, I wanted to see Harley Quinn in a movie but certainly not in this one. I really, really, REALLY hope that Warner won't use this movie as a reference to make Justice League because if they do I'll have to formulate an official request to DC so they can let Marvel do their movies :D See you all in 2017.","user":"silvermick","rank":[507,698]}]