[{"title":"Choose: Mediocre thriller","rating":4,"date":"17 October 2017","review":"Similar in method to Seven (1995) this well cast little thriller doesn't live up to its potential.<br><br>A new criminal has emerged, one who presents his victims with a horrific choice such as which limb he'll cut off or which family member they have to kill.<br><br>The concept has potential, the execution however is lacking.<br><br>The movie has moments of intelligence and strong writing but sadly that's all it has, moments.<br><br>Katheryn Winnick, Kevin Pollak &amp; briefly Bruce Dern star in this lackluster effort that should have been a great deal better.<br><br>For a far more intelligent and well conceived movie about forced difficult choices then I suggest Would You Rather (2012) <br><br>The Good: <br><br>Couple of nice touches in the script <br><br>The Bad: <br><br>Very underwhelming <br><br>Potential squandered<br><br>Things I Learnt From This Movie: <br><br>Bruce Dern looks identical in every film he's ever been in <br><br>If Scarlett Johansson &amp; Teresa Palmer had a baby it'd look like Katheryn Winnick","user":"Platypuschow","rank":[8,8]},{"title":"The Ultimate Movie Review! - http://tss5078.blogspot.com - @tss5078","rating":5,"date":"1 August 2012","review":"Choose is an ambitious horror movie, featuring a psychopath who makes their victims choose their fates, stating that every choice has a consequence. The story is a seemingly good one and the key to finding this person is finding the pattern, a good old fashion detective story. It's a very solid story too, in the beginning they actually pretend you have a brain, and let you try and figure some things out for yourself. Initially, I was fascinated with this film, but somewhere along the way they figured that we wouldn't get it and they started dumbing it down for us, leading to an ending that just destroys the film. I absolutely hate it, when I sit through and enjoy a movie, only to have it ruined at the end by some ridiculous, sensationalized, Hollywood ending that doesn't make any sense! The story was strong, the cast was great, and I was really into this thing, but like our economy, things just started getting worse and worse, leading up to an ending that was completely idiotic. It's not a bad movie, in fact it starts out as a great movie, but if you decide to give it a try, I'm warning you ahead of time, you won't like how it ends!","user":"Tss5078","rank":[9,11]},{"title":"This movie or a good one? CHOOSE!","rating":2,"date":"12 November 2010","review":"Caught this at Leeds Hyde Park Picture House's Night of the Dead and wish I hadn't. Dull, by-the-numbers serial killer slasher that has one gimmick - the killer makes his victims choose between two nasty punishments - that proves to be a lot less interesting than the you'd think.<br><br>Cue a plucky young journalist who uses the power of Google searching to solve a series of local crimes that her father, a high-ranking police officer, inexplicably doesn't seem to give a toss about.<br><br>The script has unintentional laugh-out-loud moments, and that's about the best I can say about this gently steaming pile of tepid naffness.","user":"harekrishna","rank":[34,52]}]