[{"title":"Great Horror More Serious Than Camp","rating":9,"date":"14 October 2018","review":"Totally surprised by how awesome this was. I was expecting some campy shallow high school horror film and instead got real thrills, real scares, and REAL CHARACTERS! Can't stress that enough. Awesome performances by actors who had characters written as real people, not effen cardboard cutouts like most slasher films. The only thing that kept me from giving this a ten and declaring it perfect was it is a little thin on any level other than shock-fest. We're treated to a weird family and twisted attachments but it could have been a vehicle to actually SAY something. But even though it didn't make me put on my thinking cap or change my world-view, it was still so much more impressive than I was prepared for!","user":"zandertowne","rank":[18,18]},{"title":"Loved it","rating":7,"date":"27 September 2010","review":"I wouldn't have thought, that I could watch one more torture horror movie and be entertained by it. \"The Loved Ones\", however, may be the last movie of that subgenre to actually be worthwhile. Really worthwhile, that is.<br><br>Much like \"Wolf Creek\", another Australian horror movie that took an ancient old premise and turned it into a tense and thrilling hellride, \"The Loved Ones\" is so masterfully crafted, it succeeds where it should fail. The actors - first and foremost the devilish pairing of Robin McLeavy and beady eyed John Brumpton - are just terrific, as is the cinematography and the set pieces. Beautiful bubblegum pink mixes with blood and guts. Director/writer Sean Byrne knows how to balance his first feature film between repulsive scenes and comedic relief.<br><br>In the end \"The Loved Ones\" becomes almost cartoonish and Tarantino-esquire in its climax: The movie has got you rooting so much against the villains that when they finally get theirs, you will howl in satisfaction.<br><br>Yep, \"The Loved Ones\" is the torture movie to end all torture movies. Hopefully, because NOW really everything has been said that needed to be said in that subgenre.","user":"Superunknovvn","rank":[79,114]},{"title":"Imaginative, frightening, delightful.","rating":10,"date":"10 October 2010","review":"The horror genre is in as sad a state as ever. But it's not for lack of trying. The talent is there. The fan base is there. The possibilities are there. The main issue is a lack of common sense on behalf of producers and distribution companies. As with 2009's fabulous anthology \"Trick 'r Treat\", Australian-made \"The Loved Ones\" is a masterpiece that screened in numerous festivals to rave reviews from critics and audiences alike, only to be egregiously ignored by distributors. There is no way to justify how the much-maligned \"Chain Letter\" can open nationwide, while this bloodied gem must sit on the shelf, waiting for Hollywood to take notice. Writer-director Sean Byrne's auspicious debut is a cracked-out thrill ride, one that fans of the morbid and outrageous will eat up once given the chance to actually experience it.<br><br>High school senior Brent Mitchell (Xavier Samuel) is enjoying a leisurely drive with his father, when a mysterious figure appears in the road, causing Brent to crash directly into a tree. His father is killed instantly. Six months later, Brent has found himself in a pit of grievance. Obsessed with suicide and slowly withdrawing from his mother, he finds solace only in marijuana and his caring girlfriend, Holly (Victoria Thaine). When meek wallflower Lola Stone (Robin McLeavy) asks Brent to be her date to the end-of-school dance, he politely declines. Huge mistake. Before the end of the night, Brent will be abducted and bound, and discover that he has become a most unwilling guest to Lola's very own dream prom, hosted by her doting father (John Brumpton). The party favors? A rusty fork, a syringe, a hammer, and a power drill.<br><br>A quirky, suspenseful blend of 1986's \"Pretty in Pink\" and 1990's \"Misery\", \"The Loved Ones\" is a decidedly grotesque horror-comedy with more on its mind than merely grossing out audiences. By distilling the plot to its bare essentials, and not bogging down the proceedings in unnecessary exposition or explanation, director Byrne has crafted a lean, taut, perversely funny scare-a-thon. On top of that, it is not without relevant social implications, including the repercussions of grief, the indescribable hold that parents and children have on each other, and (yes) the fiery wrath of the high school female.<br><br>Byrne clearly has a respect and adoration for the genre, as he seems to have dissected exactly what it is about these films that audiences find appealing. The film is violent, to be sure, but just when it seems that the gore may become gratuitous or over-powering, an inspired stroke of dark comedy undercuts the action. As it stand, \"The Loved Ones\" recalls the reckless, rowdy spirit of the 80's, a time in which a committed group of filmmakers and actors pushed boundaries with the intent of taking the audience along for the journey. But at the same time, the picture is strikingly modern, forming its own identity with no intention of being a throwback.<br><br>Xavier Samuel is excellent as Brent, identifiable despite his character's gloomy condition. When the viewer first meets Brent, he is in an emotional wreck with no apparent hope for recovery. But when he finds himself staring death in the face, he must summon up every ounce of strength he possesses to fight back and survive. Victoria Thaine is a beacon of warmth as girlfriend Holly, who becomes fearful of Brent's whereabouts, and makes an effort to find him. John Brumpton is terrific as Eric Stone, a very sick man whose borderline-incestuous relationship with his daughter has sunk to unfathomable depths.<br><br>By and large, though, the film belongs to Robin McLeavy. Intent on making her party a diabolical night to remember, Lola is a villain far more threatening than initially thought possible. Because of the passion and focus she obviously brought to the role, McLeavy's portrayal transcends that of a one-note monster. Instead, she brilliantly interprets Lola as a petulant, psychotic little girl who doesn't take kindly to unrequited love, and sees her torture victims as toys in desperate need of fixing. Her chemistry with Brumpton is ripe with chaotic, demented hysteria. But it also rings true that they love - and need - each other. Lola Stone should join the canon of great horror villains, and that is not merely hyperbole.<br><br>The editing by Andy Canny is impeccably judged, keeping the story moving along at a nimble 84 minutes. Simon Chapman's cinematography is crisp, colorful, and drenched in mood. A highlight is the use of a disco ball that hangs in Lola's kitchen, casting romantic sparks of pink and purple over the sobering violence below. The soundtrack is energetic and well-chosen, making unforgettable use of Kasey Chambers' \"Am I Not Pretty Enough?\". Practical gore effects are used to illustrate the harm done to Brent and others, and they are perfection, always convincing and never once calling attention to themselves. And finally, special mention must go to Xanthe Huebel's costumes, particularly Lola's indelible hot pink dress. In every respect, the film could not look or sound better.<br><br>There are so few contemporary horror movies - let alone ones of the B.T.K. variety - that actually have something to say about the dark, unpredictable recesses of human nature, not to mention hold the ability to delight, intimidate, and ultimately satisfy even the most jaded fans. \"The Loved Ones\" is one such film. It is among the finest, most enjoyable movies the genre has seen in years, and seems destined for cult status. But in order for that to happen, it needs to be seen by the audience it so richly deserves.<br><br>NOTE: If you are thinking about looking up the trailer for this film............................ don't. It gives so much away, and part of the fun is the many surprises the movie has in store. If you absolutely must watch the trailer, stop it at exactly 1 minute!","user":"robertrosado","rank":[68,106]}]