[{"title":"The human face of something confronting","rating":9,"date":"23 March 2009","review":"The Age Of Stupid has just opened on 78 screens across the UK - a remarkable feat for a genre-defying independent feature made on a shoe string, funded by ordinary households and distributed with a launch budget of just £130,000. To put this in perspective, An Inconvenient Truth opened in 2006 on just 18 screens and a typical UK-wide release spends around £650,000 telling people to go and see their film.<br><br>So why all the fuss?<br><br>Four years ago McLibel director Fanny Amstrong and producer Lizzie Gillett set about making a documentary called (at the time) Crude, which charted the ugly side of the oil industry. Fast forward to 2009 and the project has finally emerged as a surprisingly human and touching call-to-arms about climate change called Age Of Stupid.<br><br>The film opens in 2055 with Pete Postlethwaite, archivist of a ruined earth, looking back at images of the present day, trying to answer the question of why humanity didn't save itself when it had the chance. Archival news material and animated sequences are used to provide background and context, but the focus is on documentary stories of real people facing the effects of our hunger for fossil fuels.<br><br>As a result, the film does not labour under the burden of attempting to sway the undecided through facts and figures - though it's possible that even Sarah Palin herself could not fail to be affected by the story of Fernand Pareau, an octogenarian French mountain guide, showing us the glacier he loves as it withers away before his eyes.<br><br>As we explore the ageing archivist's question, we encounter \"not in my back yard\" anti-wind farm protesters, committed climate change activists and an entrepreneur who dreams of ending poverty by starting India's third budget airline. Blame is ultimately laid at the feet of our culture of consumerism, and the implication is that profound social changes will be required to survive the present age - poignantly exemplified in a sequence involving Alvin DuVernay, a hurricane Katrina survivor who, having lost all of his possessions, philosophically reflects on what it took for him to realise what was actually important to him.<br><br>At the time of writing, around half of the IMDb votes have given the film a rating of 9 or 10 and around a quarter have given it rating of 1. This polarisation is not about artistic merit, but between those for whom the film has deeply resonated and those who find it confronting and uncomfortable.<br><br>I've read some complaints about the film being preachy, and it is certainly true that there is forceful criticism of  say  Shell's operations in the Niger delta and the Iraq war. There is no attempt to present any positive outcome of these interventions, but then I'm not expecting a rush of filmmakers wanting to fill this particular gap in the market.<br><br>In general the voices of dissent come from the mouths of those directly affected, and indeed it is the human face of these stories that is one of the film's engaging strengths. History's witness is not always the great orator we want it to be, but over 90 minutes the film manages to maintain a good pace and link the various threads together.<br><br>The Age Of Stupid has dispensed with convention in a multitude of ways, not the least of which is the way it has forced its way onto our screens, seemingly through sheer force of will alone. Ultimately the merit of the film is not about the quality of editing or its performances, but its transformational potential. I genuinely think that many viewers will leave the cinema and, like Alvin DuVernay, start to question the world which surrounds them, and it is this quality which makes The Age Of Stupid a truly remarkable film.","user":"chrisf-38","rank":[82,113]},{"title":"Not perfect, but a must-see for all","rating":8,"date":"5 April 2009","review":"The Age of Stupid is a film about climate change, but it's not An Inconvenient Truth: Part Deux. Whereas the purpose of Al Gore's 2006 box office hit was to shake us from our slumber of self-comforting denial, Stupid is designed to take hold of our heads and smash our faces repeatedly into a table until we get up and do things differently.<br><br>It's indicative of how the debate has shifted over the last few years that Stupid does not spend time linking climate change with greenhouse gas emissions. The film states that less than 1% of climate scientists believe that there is any doubt about that link (even if this number rises to 60% when the general public are asked their opinion). The debate is over at long last, so the intention of Stupid is to use human stories to illustrate what a serious pickle our species has got itself into.<br><br>Stupid is mostly a documentary following the very different lives of six individuals and families around the world. The subjects include an oil geologist who lived in New Orleans when Hurricane Katrina hit, attempting to deal with the devastation of losing everything he owned to a natural disaster that was probably worsened by the burning of oil that he discovered.<br><br>Stupid is immaculately produced, carefully involving the audience in the on screen emotions, from sharing the heartbreak of the elderly French mountain guide witnessing a glacier recede, to the frustrated anger of the environmentalist whose wind farm had been blocked by a local NIMBY campaign.<br><br>Linking the documentaries together is a series of animated fact files from Passion Pictures (famous for the Gorrilaz) and an innovative fictional subplot starring Pete Postlethwaite. Postlethwaite plays the role of an archivist in 2055, responsible for curating a climate-proof store of human culture, history and scientific discovery, as well as two pickled specimens of every creature on Earth. At this stage, the planet is all-but uninhabitable and the archivist creates the film as a warning for whichever civilisation finally inherits the Earth.<br><br>Stupid focuses on the idea that it was our behaviour in the years up to 2015 that caused unstoppable climate change, culminating in the near- extinction of life by the middle of the century. Postelthwaite's character struggles to comprehend quite why we did nothing to stop our own suicide even when we knew that we could.<br><br>So is it a good film? Yes, it's bordering on the brilliant. At times it made me laugh, at other times it filled me with tears, and at one point I literally swung my fist in anger at the Daily Mail worshipping, house price obsessed, anti-wind lobbyists. Stupid isn't perfect; I felt that a couple of the documentary subjects distracted from the main issue of climate change by focusing on the evils of Big Oil. However, I would still challenge anyone who sees this film to leave the cinema without a fire in their belly.<br><br>Sadly, The Age of Stupid has not been seen by many people. It is an independent film which was funded entirely by small contributions from public investors. As such, it hasn't had the benefit of large distribution networks and, three weeks after release, is only now available at a few commendable cinemas. I shared the experience with 13 other people at the Panton St Odeon in London. Elsewhere, Horne and Corden's Lesbian Vampire Killers was probably playing to a full house. The Age of Stupid sounds like quite an apt title to me.","user":"robcowen","rank":[61,94]},{"title":"Great Film Must See","rating":10,"date":"15 March 2009","review":"The film contrasts a bleak future that we are heading towards with the current way people carry on as usual. The archivist (Pete Postlethwaite) looks after the best of the planets museum exhibits, and looks back from the year 2055 at how we got there. He observes a group in Bedfordshire stopping a potential wind farm from getting through planning, an entrepreneur in India starting a low cost airline, a woman surviving in Nigeria torn by Shell's oil extraction, children exiled from Iraq and a man retired from the oil industry living in New Orleans during and after Hurricane Katrina. The scenarios show how complicated it can be to make a difference, but that its something we need, and must, do.","user":"treebeardman","rank":[51,87]}]