[{"title":"Well acted character study - NOT an action film","rating":7,"date":"14 July 2016","review":"I heard grumblings from two guys who were leaving the theater behind me after seeing THE INFILTRATOR that this movie did not have nearly enough action/bloodshed for them. I think they were expecting another SCARFACE or GOODFELLAS. That is not what this movie is. This movie is a character study of a man who goes undercover with the Pablo Escobar drug cartel and develops relationships/friendships with these bad guys in order to bring them down. The real conflict in this film is not the action, but rather, the RE-ACTION of \"the infiltrator\" - will he remember that he is just playing a role to bring down the bad guys, or will he lose himself in the role and the relationships and become a bad guy himself?<br><br>If you are looking for an action movie, this movie will be a little too slow for you. If you are looking for good acting and a strong character study, then this is a very enjoyable film.<br><br>Much of that enjoyment hinges on the performance of Bryan Cranston as Robert Mazur, \"The Infiltrator\". We follow him as he dives deep into this criminal organization. Cranston is in about 90% of the scenes of this movie, so his performance better be strong or this will be one long movie, indeed. Fortunately for us, his performance is better than strong. He continues his string of fascinating/watchable performances and he more than anchors this film and makes it worth watching.<br><br>Ably assisting him is a strong supporting cast - Amy Ryan (as his boss), Jason Issaacs (somewhat wasted as the District Attorney), Benjamin Bratt (as one of the main bad guys), Olympia Dukakis (in a fun turn as his aunt) and Diane Kruger (defying age as another agent posing as his fiancé - when I first saw her I thought \"that's a young Diane Kruger\" until I realized it WAS Diane Kruger!). Finally, John Leguizamo as Mazur's partner, Emir Abreu is TERRIFIC. The best performance I've seen from him in quite some time. If this movie was a little better and a little later in the season, I'd be touting him for an Academy Award nomination.<br><br>If you want blood, guts and action, wait for the Jason Bourne film. If you want an interesting, gripping film that is well acted check out the Infiltrator - you'll be glad you did!<br><br>7 (out of 10 stars) and you can take that to the Bank (of Marquis)","user":"bankofmarquis","rank":[82,94]},{"title":"More about BCCI than it is about Escobar.","rating":8,"date":"16 July 2016","review":"\"The Infiltrator\" brings the story of undercover agent Robert Mazur. As the movie opens (with Rush's \"Tom Sawyer\" blasting away), we are reminded that it is \"Tampa, Florida 1985\", and we see Mazur at work, in what turns out the be the last phase of an undercover job. Due to his length of service, Maruz is offered the possibility to retire with full benefits. Instead, to the dismay of his wife Ev, he decides to take on one more job, far more complicated and dangerous than he ever imagined. As this point we're not even 15 minutes into the movie, but to tell you more would spoil your viewing experience, you'll just have to see for yourself how it all plays out.<br><br>Couple of comments: this movie is directed by Brad Furman, who previously brought us the Matthew McConaughey-fronted thriller \"The Lincoln Lawyer\". Screenplay is by Ellen Brown Furman (I imagine related to the director, but don't know for a fact). This is a narco crime drama that is essentially \"The Sting\" on steroids: can Maruz (in his undercover role as Bob Musella) and his rookie partner Kathy Ertz pull off a sting of gigantic proportions, right under the noses of the feared Colombia drug cartel of Pablo Escobar? As you have probably noted, the connection with Pablo Escobar is played up in the movie's marketing materials. The reality is that Escobar is perhaps hovering over the movie in spirit, but the movie in fact is a lot more about what happened with BCCI (the UK's Bank of Credit and Commerce International), the 7th largest private bank at that time. (And if you are looking for a true Escobar crime drama, check out \"Escobar: Paradise Lost\", starring Benicio Del Toro and Josh Hutcherson.) \"The Infiltrator\" has many great moments, and is tense almost from the get-go. Bryan Cranston, on the heels of the excellent \"Trumbo\" last year (but still best known for his work on TV's \"Breaking Bad\"), delivers yet another winning performance. But the big surprise for me was the outstanding work from Diane Kruger as the rookie undercover partner. She is superb (aside from being superbly beautiful). Lots of great songs throughout the movie, including The Who's \"Eminence Front\", which plays not once but twice in the movie! <br><br>\"The Infiltrator\" opened this weekend and I couldn't wait to see it. The Friday evening screening where I saw this at here in Cincinnati was attended very nicely, somewhat to my (pleasant) surprise. I found \"The Infiltrator\" to be a riveting narco crime-drama, the likes of which we don't get to see enough, and would encourage you to check it out, be it in theaters, on VOD or eventually on DVD/Blu-ray. \"The Infiltrator\" is HIGHLY RECOMMENDED!","user":"paul-allaer","rank":[53,68]},{"title":"Breaking Good","rating":6,"date":"15 July 2016","review":"Bryan Cranston is not your typical movie star, although he seems like it. Underneath the cool-high-school-dad exterior, there's an actor of great depth and unexpected power. You'll know it when you see a scene involving his character, said character's wife, and a restaurant on their anniversary dinner. Cranston seems to have benefited during his years as Walter 'Heisenberg' White on TV's Breaking Bad. And it has contributed greatly in this biographical crime thriller, about as straightforward and predictable as a stab in the gut.<br><br>Yes, Brad Furman's (The Lincoln Lawyer, Runner Runner) directorial efforts here will not be known for their signature riffs, as there is none to speak of. It's standard thriller fare, the kind that would do well had it been released between the late 1980s and early 1990s; pure genre fare that caters to mostly adult film-goers that aren't interested in seeing computer-generated superpowers or rubble. In other words, unoriginal yet mature, grown-up stuff.<br><br>The Infiltrator, however, is textbook example of how great casting can elevate shopworn genre material into solid entertainment, as the always-reliable Cranston has proved here. Sure, he is strongly supported by a bevy of intriguing cast members including Benjamin Bratt, John Leguizamo and the lovely Diane Kruger; but in portraying real-life undercover agent Robert Mazur shimmying his way up through Pablo Escobar's criminal empire, Cranston's understated but strong everyman presence confidently carries the movie solely. That quality alone replaces the tediousness often found in similar true-crime movies with an intense amount of uneasy suspense and grounded credibility, providing lots of fun for Cranston fans as long as they do not expect anything groundbreaking.<br><br>Breaking Good, indeed.","user":"dvc5159","rank":[54,70]}]