[{"title":"Normality is out of the question.","rating":8,"date":"24 July 2009","review":"I give up. After sitting in front of the computer for almost half an hour, tossing and turning thoughts in my head as I try to write something about my latest adventure at the Auckland International Film Festival – \"Dogtooth\", I've decided that it is not possible to do so.<br><br>What I will say is this: watching \"Dogtooth\" was one of the strangest experiences I've ever had. I have honestly never seen any other film like it. Sometimes hysterical, sometimes shockingly intense. It is a hypnotic trip that displays brilliant originality and borderlines pure insanity. In my humble opinion, it is a film that should be watched by every single person, for the experience alone. Sadly, like so many other gems, I'm almost certain that this film will never find a wide release, so, please do seek it out, I beg you all.<br><br>I am so glad that I watched the movie cold, as the only things I knew about the movie was a promotional photo and the fact that it's Greek, a decision that I believe made the experience even more powerful for me, and a decision that I advise you all to take.","user":"allstar_beyond","rank":[344,436]},{"title":"Not that strange or removed from anyones reality","rating":10,"date":"13 May 2010","review":"A whole language of deceit is created by a father to make sure that his family don't venture into the unknown which he fears will corrupt them. This film talks about the myths and lies we are told to maintain status quo and the appearance of stability and normality. It explores the abuse of protecting a child from outside influences to the extreme of denying human instincts and inquisitiveness about their world. Its shows how telling children lies for their own safety makes them fearful of the world and patronises there innate understanding about life. Its amazing because it creates a world with an absurd, fully realised, vocabulary that is completely understood by the members of this family ; its surreal nature forces you to question the oddness and the parameters of your own existence. A life unquestioned and unexplored leads to a stagnant swamp of confusion.","user":"riffraffrichard","rank":[237,300]},{"title":"love or hate","rating":10,"date":"10 June 2010","review":"I was expecting some kind of \"The Village\" film... Just to avoid spoiling.. The lights turned on, the credits were running and everyone was quiet and searching for answers in others looks. Its best surprise that I've got in years. You don't have to be special to watch it, just sit and you'll end it living it, even that it isn't your life. I appreciate latter how good the movie was when I realized that all the scenes didn't need background violins to drive your emotions to a certain field. Everything goes by itself naturally. I just registered to post this, as I couldn't believe those bad reviews. I'm a normal guy that doesn't read reviews, but this movie is different and I was curious about how would other people feel about it. Maybe its one of those that you just love or hate, but at the end you'll feel something that isn't indifference.","user":"xfreakart","rank":[165,225]}]