[{"title":"Among history's worst films","rating":12,"date":"12 October 2011","review":"This motion picture has to be one of the most stupid films I have ever seen. I'm even surprised I watched it till the end (Its 7.4 rating influenced me, I admit). It vaguely makes a connection between scenes, the protagonist changes his personality without any viable explanation, antagonists are poor imitations of evil individuals in other films, and the overall script is embarrassing. This movie is amusingly boring (I know, a paradox...right?). I can't imagine why someone would want to do a film like this. One of the most annoying things about it is that it constantly makes viewers feel that they are about to see something interesting. It quickly disappoints, however... I wouldn't recommend it!","user":"shogun_alessandro1","rank":[18,23]},{"title":"Be very afraid...","rating":2,"date":"4 December 2011","review":"Wow. What a stinker. We pick out three obscure films every Friday and this was in the last batch. One of the big problems other than how boring it is is that it takes itself VERY seriously. Shot in B &amp; W to give it some kind of artistic feel, it just contributes to the dullness, and trust me this script is DULL. The protagonist is a very goofy looking \"actor\" who is incapable of emoting. Apparently he is some kind of cult star and maybe the movie is made exclusively for his fans, so I don't know maybe I'm missing some kind of inside joke. The effects look like they were made on the spot except the cat-thing which looked like it was a rubber puppet.I would love to give some props as this was obviously a no budget picture, but it's trying so desperately to be a Rosemary's Baby or some other kind of real movie that it couldn't possibly succeed. Some of the shots were nice so they had a decent cameraman, now if they had just replaced everything else it might have worked. One more thing, whoever you are who wrote that long glowing review is either connected to the production or should not be writing reviews because you are seriously misleading people.","user":"karenLovesMovies007","rank":[8,10]},{"title":"Hated It!","rating":14,"date":"14 October 2011","review":"This movie dragged on worse than a political speech...I actually found myself rooting for the demons to kill off the boring main character to stop his droning voice that wouldn't end.<br><br>The Black and White film added nothing to this film except perhaps it saved on using color film. I would suggest using a camcorder for this stinker so it could be recorded over.<br><br>The best actor in this film was the Sphinx cat who did a great job of not running away from embarrassment for being in this movie.<br><br>The demon at the end was really cheesy, I think it was one of those rubbery Boglin hand puppets from the 80's.","user":"mariebaptiste","rank":[9,12]}]