[{"title":"Great for kids!","rating":9,"date":"28 March 2011","review":"My 4 year old loved this DVD. Perhaps even more than the Cars movie itself. It's far more fast-paced and slapstick than the full movie, that's for sure, and the main character switches from Lightning McQueen (not played by Owen Wilson here) to his Cars sidekick Mater.<br><br>The lovable truck tells all kind of far fetched stories which had my son laughing along all the way, each one adding the twist when McQueen said he didn't believe the story he would get dragged into the fantasy by Mater who would play mind-games with McQueen and make him think he was there when it happened. That could have got repetitive, but my son loved it every time, especially when he knew it was coming towards the end of these shorts.<br><br>Great DVD, and gives good hope that the upcoming Cars II will be a lot more fun than the first one. Not that it was a bad film, but at times it was incredibly slow for a children's movie. This is a wonderful purchase.","user":"PersonalTrainerRussHowe","rank":[9,9]},{"title":"Well animated and enjoyable...but formulaic.","rating":7,"date":"6 December 2010","review":"As long as you set your expectations a bit lower, you'll enjoy these very short CGI films. I say set your standards lower because the cartoons are very, very short...and they follow the same formula in each and every one. Each consists of Mater (one of the main characters in the full-length film \"Cars\") telling what sound like wild fibs. And, each time his friend McQueen says he doesn't believe the story...only to then get confirmation that the story WAS true and that McQueen himself was a witness--though he somehow forgot. While the cartoons are quite trivial, they are gorgeous--with some of the nicest CGI I have seen. As a result, they hold up well on the new DVD \"Mater's Tall Tales\"--a compilation of all of these short films. Each short is only about 4-5 minutes in length and kids will love 'em. Adults will enjoy them for a while--until they notice that each short is pretty much the same pattern being repeated again and again.","user":"MartinHafer","rank":[7,10]},{"title":"Everything that \"Cars 2\" should have been","rating":8,"date":"13 July 2012","review":"I liked very much this, personally I think that all the shorts included in \"Mater's Tall Tales\" were much better than the disappointing \"Cars\" sequels, being way more enjoyable and entertaining.<br><br>Even if each one of this shorts tends to follows a very similar pattern, the result is still pretty satisfying and well done, having an excellent animation, many new humorous situations that work incredibly well.<br><br>Also, unlike in \"Cars 2\", here Lightning McQueen has an important role in each one of the stories told by Matter, instead of being just a secondary character.<br><br>Without being the best work done by Pixar, it still something pretty good.","user":"Rectangular_businessman","rank":[2,2]}]