[{"title":"B movie that sometimes goes to A, sometimes goes to C","rating":4,"date":"31 May 2014","review":"I enjoyed it. I did. I am a big fan of horror and i have seen \"almost\" all horror movies. <br><br>First, for futur filmmakers, Do not use CGI if you can use good old school effects. Don't be lazy.<br><br>Pros: The girls were sexy and scary! Just a bit of boobs. Not a lot of gore, but OK. Great picture quality, it surprised me.<br><br>Cons: coherence of plot and of characters. CGI Some Scenes look to clean. <br><br>Not for everybody, there are better movies available, but for a fan of B movies. It was good.","user":"thorndamien","rank":[13,17]},{"title":"Something I would recommend.","rating":6,"date":"23 May 2014","review":"But hear me out: first of all, the effect are simply laughable, bad, incredibly weak and cheap, even for an 80's movie! I know it sounds like a joke, but it's not, bear this in mind, the effects will be something to bring a smile instead of fascination or anything else. Secondly, the ending will look rather stupid, but it takes a little patience, cause there is more than meets the eye.<br><br>Now that I put down the bad parts, let me tell you why I would recommend it: it lacks jump scares, but it has that old school tension, it frightens you as you watch and see what happens, your eyes are stuck to the glass and your heart rate is growing, little by little. It made me feel like an 14 years old kid again, watching his first scary \"in the woods\" movie. So for this great touch, I graded it a 6, sure, some will say it's way too much, but for me it really did the trick. Got me wanting more, waiting patiently to see what happens next, even the ending was something I craved for. So I was there, from the beginning to its end, felt quite good too. It was like a blast in the past, and for that I am thankful to everyone involved in the making of \"Demon Legacy\".<br><br>Now that you know what to expect, it's up to you to decide if you'll take it for a watch or not, but I'm telling you, it's great for a late night movie, alone or with friends, with something to chew on and some drinks. It made my night!<br><br>Cheers!","user":"gothic-fiction","rank":[22,36]},{"title":"OK but not good","rating":4,"date":"20 January 2017","review":"This movie was OK, but not good. The acting was OK, and the story line was descent. While I love sexy sorority girls in horror movies, the movie lacked coherence and a sense of direction and purpose. There were numerous occasions during the course of the movie where it failed miserably to connect the dots. I found myself having to try to connect the dots myself on a board where the dots were scattered like the stars at night. As the movie was drawing to a close, a characters unceremoniously showed up from left field. Trying to make sense where certain characters fit into to the movie as a whole was like trying to hammer a round peg into a rectangular hole. In the end, the movie seems to fall flat like a cake made with no eggs. I rendered it a 4 because an honest effort was made to turn this B horror into a -A horror movie.","user":"ezra-52172","rank":[2,3]}]