[{"title":"Hollywood Reporter delivered an unfair bashing of this exciting sequel","rating":7,"date":"20 February 2011","review":"Having watched the first Largo Winch movie just a few days earlier, I was excited to view the sequel and it definitely delivered on many levels. The acting by Tomer Sisley as the unwilling billionaire heir Largo Winch is by far stronger than in the original movie, and the other main characters such as the Burman villager Malunai and Alexandre Jung (played by the now late Laurent Terzieff) contributed to the storyline in an endearing and believable way.<br><br>The Burma Conspiracy contains most of the elements of a great action movie. Strong acting, colourful characters and as an extra bonus we're also introduced to a comical Eastern European villain. The have upped the pace significantly relative to the first Largo Winch flick, and added a few fairly violent action scenes but nothing that detracts the attention from the main plot in a negative way. The movie takes the viewer on a tour of some exciting locations such as Thailand, Burma, Hong Kong and Switzerland and the scenery is indeed eye-catching even for the most seasoned traveller.<br><br>Hollywood Reporter gave this movie an unfair bashing in their recent review. For any honest fan of action movies, The Burma Conspiracy is certainly one not to be missed and most definitely places itself in the upper echelons of releases in this genre to have hit the cinema in the last few years. It is indeed quite a shame that cinema distribution outside the Francophone countries has been fairly limited.","user":"westernwinds","rank":[84,106]},{"title":"Inferior to the first one","rating":6,"date":"4 March 2012","review":"But not by that much. Actually the main actor does help a lot and the vote could have been lower without him. Sharon Stone on the other hand, seems almost completely misplaced. I'm not sure if they had American backing or if the director/producer or whoever was a fan of hers, but she almost put me off the movie. And I quite like her in other movies, but this one ...<br><br>With that being said, we get more of Largo and his back-story. While I'm not familiar with the source material (haven't read anything, only watched the first movie), it seems like there is a rich story behind the character. I'm not sure if there will be another installment into the series (could go even further back I guess), but I do know that Largo made an impression on me overall. Good action-thriller that delivers what it needs to","user":"kosmasp","rank":[17,22]},{"title":"Sequel that does not disappoint.","rating":7,"date":"21 May 2011","review":"I loved the 2008 first motion picture 'Largo Winch'. I will no doubt have a pro bias in my review unless the movie strays too far from the original over all genre and quality. Jérôme Salle's direction and his collaboration with Julien Rappeneau for the script, produced another action packed thriller. Sharon Stone figures in the top credit but it was probably to attract more of an American audience than the first movie did; her role does not require much on screen time as the billing would have you expect. What part she had, she performed as the professional she is. She has sex appeal for a 53ish, like only a handful of Hollywood hotties past their prime; they age better than us regular folks. Tomer Sisley shines once more and with no less acumen; the French production syndicate has to be proud of their on screen hero Largo Winch. <br><br>I hope we can be treated to a third part or over time even a series; this second tome ends with so much promise. Again, the quality and quantity of action output for the relatively low budget bodes well for more Largo Winch. I hope you read my review of the original 2008 release. The fight scenes are choreographed with max effect and remind me of the \"Banlieu 13\" movies 2004 &amp; 2009; they generate audience Ooohs and Ahhhs like nothing else. <br><br>In fact Hollywood has been hiring Cyril Raffaelli to capture a little of that magic in films like \"Live Free or Die Hard \" , \"Kiss of the Dragon\" and \"The Incredible Hulk\" and countless more where if you pay attention you will notice a departure from the traditional ass kicking we now feel blasé with. Look up Cyril's choreography credits and you will be impressed.<br><br>Well everyone raved about the third \"Bourne \"movie with Matt Damon; it's that type of action fighting I'm talking about here. Less special effects and more special training, like circus people refined training. Having seen special features about the training, the actors/stunt people go through over two three and four months even, to perform a 4 second shot is what I call dedication and the results will attract new fan following like moi. My own reaction watching a particular scene performed by David Belle (one I just referred as the 4 second shot in Banlieu 13 ), a champion also in the movement for more of this French in origin, action sequences, was a reaction with much surprise cursing. I mean numerous \"Holy Sh*t\" and \"F*ck me\" and \"Damn\" he's good. Largo Winch has that feel and I liked it as much as the first.","user":"JohnRayPeterson","rank":[12,17]}]