[{"title":"waste of time fake reviews, get a life you sad people","rating":1,"date":"26 January 2015","review":"OK to start off the film was absolutely rubbish, the acting was atrocious and the storyline was just plain silly. As for the fake reviewers on here ( dougjillscarbrough) i might add that this guy who gave this film 10 stars is very 'close and also knows his work schedule lol ' with the director hence the big amazing review. People really need to start watching the actual movie instead of praising a guy who makes a diabolical movie. People really need to stop using the rating system on IMDb to create false hope for people expecting a good movie. One tip i will give to the guy who wrote the 10 star review ( you may want to possibly not make it so obvious how close you are with the director and is fabulous work ethics. Please for the love of god get a grip. Bottom line this film should not have even been made its that rubbish take my advice people don't be fooled by these 10 star reviews from people who have only been a member for like the past month who only have the one review. Come on to the silly idiots out there who do this, people are not that dumb","user":"thomasevans51","rank":[3,5]},{"title":"A Wonderful Thinker's Thriller - A time well spent.","rating":10,"date":"1 October 2010","review":"STRICKEN is a modern, thinker's thriller. When we left the theater after viewing, we, like many other viewers, were so excited and happy. Stricken was like a beloved yet terrifying Alfred Hitchcock film, filled with twists and turns, never allowing you to figure out the story until the triumphant climax at the end. This is no slasher film, but a poignant treatise on honor, loyalty and self sacrificial caring for other people, even when faced with unspeakable evil. A woman sitting next to me was hiding her head under her coat during the film and later told me STRICKEN was, \"...The scariest film I have ever seen.\" The story is deep and the characters very full and round. Stars David Fine (Pursuit of Happiness, Sweet November), and Stephanie French, give powerful performances that pull the viewer in, motivating us to really care about them. The Direction of the award winning script by Matt Sconce shows focused attention to detail. Tasteful camera movement and shrewd use of lighting for conveying mood in each scene are trademark Sconce direction, and the film is very artistic. As Sconce was also the writer of the screenplay, one can see STRICKEN as his canvas for that beautiful work of art. The musical score is beyond masterful, and Composer James Merkey is a 'John Williams' before anyone knows he is a genius. Special effects are flawless and help tell the story, rather than distracting the viewer. Stricken is one of those films that rarely comes along: A great, interesting, and exciting lower budget film that holds its end up with the big boys. One young lady had seen four films before STRICKEN the week we watched it and said, \"STRICKEN, by far, is the best film I have seen all week\" That says it all.","user":"jsemperparatus","rank":[5,22]},{"title":"The movie (Stricken), is a work of genius!","rating":10,"date":"15 September 2010","review":"This movie was created on a very low budget. Can you imagine what Matt Sconce, and his very talented actors, and crew could create with a Hollywood budget? Matt Sconce, is without question headed for the big time. Matt Sconce has all the necessary creative tools to produce quality films. The casting of characters could not have been better. Detective Scott Aro, played by David Fine, gave a solid believable performance through the entire film. You could feel his years of relentless agony, in the search for a savage killer! Sarah Black played by Stephanie French, equally helped to carry the show down its dark, twisted, and surprising path of events. She had a sweet, charming innocents, about her, yet you could feel the presence of the ungodly daemon that possessed her. Stephanie French could transpose herself into a horrible monster right before your eyes! There was not one week character in the entire movie. The Thriller movie (Stricken), was just that a real thriller. I was on the edge of my seat through the entire movie. This is a must see movie. I foresee a sequel to this movie in the future. Doug Scarbrough","user":"dougjillscarbrough","rank":[4,21]}]