[{"title":"Watch it once ... then never again.","rating":8,"date":"30 September 2011","review":"Give it to Mel Gibson. The man can act. He is one of the best and does not disappoint.<br><br>I rented this simply because I couldn't take the curiosity any longer. I had no idea what it was about.<br><br>Every performance here is solid and believable and deep.<br><br>The movie is about depression. So don't be surprised if you are left feeling ... depressed. I was. The movie concluded with an upbeat feel, but left me yearning for more.<br><br>This is one of those movies that, well, you watched it; you knew you had to - kind of like Schindler's List - then you put it away to never visit it again because you know the emotional pain that it delivers.","user":"Glock_Boy","rank":[27,31]},{"title":"Broken Man Facing His Demons Works for Gibson","rating":8,"date":"18 March 2011","review":"Although it's difficult to watch Mel Gibson now without the backdrop of alcoholism, abuse, bigotry, rants and disappointment, this role may actually be the perfect role for him to re-appear on the screen with sympathy and hope of redemption. He plays this role perfectly and the viewer is sucked into the emotion and distress of all characters dealing with their own challenges. It's a beautiful movie with a powerful message. Some have criticized Jodie Foster's directing, but I found the film to be very balanced with the right amount of comedy and tragedy. I loved the camera work and editing, especially with the Beaver as its own character. I also liked the secondary storyline about the teenagers. All the performances were very good. I think the entire movie is very well done, and although I have not changed my personal opinion of Mel Gibson at all, the movie does make you very sympathetic towards families dealing with crisis including his own, and as an actor, he pulls off a very difficult role.","user":"lmelnick-999-260424","rank":[143,189]},{"title":"Mel may be flawed in life but the movie is a keeper","rating":6,"date":"6 May 2011","review":"I'd give this movie a full ten if not for confusion over the \"weighted average\" system in which IMDb supposedly disregards a lot of extreme highs or lows. And speaking of highs and lows, who better than a bi-polar actor to not only accept a stigmafied role of someone with a mental disorder but also to get past that and offer the meat and potatoes of entertainment as well? Full disclosure: I am on Team Mel when it comes to an ex girlfriend making headlines with her personal life with reckless disregard for the personal and professional toll; an overkill gesture followed-up ultimately by withdrawal of charges. . .<br><br>I won't get into debates over context and word choices in someone's private conversations or during a fit of rage. But others like to, and perhaps for that reason I was only one of about 21 people in the late showing of The Beaver opening night at the Varsity in Toronto, cinema 8. Apparently the VIP cinema there had a screening that started 20 minutes earlier, but I don't know how that or earlier screenings were attended. I'm hoping the movie does better. Even with a small crowd, the audience I was in responded with laughter where appropriate, and the atmosphere was often charged with anxious energy. <br><br>Jodie Foster is very dear in her own performance, and her directing choices don't falter. Mel gives glimpses of his goofy persona and one can speculate about which bits of whimsy might have been his contributions, but he also lets us dislike the character a bit or the condition he suffers and the film goes to some dark places. Nobody in the theatre dared laugh at the point that is most drastic and also anxiety inducing. In someone else' hands this film could easily be a TV Movie of the Week.<br><br>The woman who played the Sheriff in Signs is again Mel's confidant in The Beaver for the half of the story involving his business. Anton Yelchin (the new Scotty in Star Trek) is impressively grounded even as he suffers through some of his father's inherited symptoms and those typical of teens anyway. <br><br>If you are poisoned against Mel, I'm not going to say go see it but I'll go out on a limb and suggest that one of the opening sequences where he is at his lowest ebb might be especially entertaining for people who hate him and there is a certain gallows humour that might allow you to relax your guard. The daring premise and loving execution of the film from everyone involved is a nice mix and the film deserves a better fate than it is likely to get with gossips fanning the flame of scandal. <br><br>\"Everyone loves a train wreck, especially one they're not in.\" - The Beaver<br><br>I know people are clogging the box office lines for Thor this weekend, and I haven't heard anything negative about that movie but I'm glad I saw The Beaver and that I can honestly say it is more than just weird; it is actually also out on a limb and inspiring without feeling like a cheat. That's my two cents anyway.","user":"Jawsphobia","rank":[128,170]}]