[{"title":"Tension filled survival horror.","rating":8,"date":"5 February 2020","review":"I first saw this in 2010 on a dvd which I own. As a fan of Adam Green, this film surpassed my expectations.\nRevisited it few days back as I am planning to watch the remake Break.<br><br>It is about three friends who get stranded in their ski lift chair far above the ground on a Sunday afternoon. One of the fella feels he has no choice but to jump from the ski lift chair and get help, as they will not survive up there in the bitter cold until Friday.\nWhat we have here is bitter cold, frostbite, dangerous height n wolves.\nThe movie is scary n tension filled. The compound fracture scene is not for the squeamish. Very well done.\nIn most Bollywood films, the hero jumps from 10 floors n land straight on the ground like a cat without any compound fracture or shin bone breaking.","user":"Fella_shibby","rank":[26,28]},{"title":"A chilling film ;p","rating":8,"date":"23 November 2012","review":"Okay so this was a great movie, but i never want to watch it again. <br><br>Ever.<br><br>You get so involved with their situation and you're sucked into it, you feel their pain and horror. Ir leaves you feeling unsettled. A lot like 'Buried' did if you have seen that film.<br><br>95% of the film is set in the same location but this doesn't mean it is boring at all. Absolutely not. <br><br>So be prepared for an unsettling experience if you choose to watch this film.<br><br>By no means is it bad though, it just motivates powerful feelings.","user":"lahna_may","rank":[50,73]},{"title":"Top-notch survival horror","rating":12,"date":"12 May 2010","review":"A college student goes on a weekend ski/snowboard outing with his girlfriend and his jealous buddy. It was supposed to be just the guys, but Parker came along, much to buddy Lynch's dismay. She is still learning, and as a result of this, the trio spends most of the day on a bunny slope. After some complaining from Lynch, they decide to go on a quick run down the mountain before the day is through, but there's bad weather moving in. They manage to convince the lift operator to let them go, but through a series of unfortunate circumstances, the lift is stopped midway up the mountain leaving them stuck as the place shuts down for the week. With bad weather, the freezing cold and a large drop between them and the ground, the chances for survival are looking slim. And that's not taking the pack of hungry wolves into account.<br><br>I caught this at the Parks Mall AMC back in February and thought it was fantastic. It's from the Open Water/Black Water/The Canyon school of survival horror. All of those films are intense portraits of people stuck in some form of wilderness nightmare with little hope of escape, but Frozen may just be my pick for best of the bunch. At one point early on into the trio's predicament, I discovered that I had unknowingly squeezed my hands together so tightly that they had fallen asleep, so it's safe to say that the tension got to me. The characters also really grew on me as the film wore on, and I actually felt really bad for them. This is Emma Bell's first film, and I was quite impressed with her performance. While she has a spotty moment or two, for a first-timer, I'd say she knocked it out of the park. Her standout scene takes place when she's relaying her fears about what might happen to her puppy if she dies on the lift, and if he'd think she abandoned him.<br><br>Kudos to Adam Green for shooting this film on location. There are no green-screens or studio sets to be found here. Green and company found an actual lift to go out and shoot on. Equal amounts of kudos must go to the actors, as they were the ones up on the lift braving the elements for the authenticity a film of this type needs. Their hard work and tolerance paid off, as I often felt like I was right there on the lift with the characters. The chilly atmosphere vividly leaps off the screen, the bleak nature of the situation in which these three find themselves never in doubt. This film also hit a little closer to home for me, as I spent a week of skiing, etc. in Winter Park, CO not two months prior to watching this at the theater. With that fresh in my mind, I was left with an even stronger feeling of \"What if?\".<br><br>Also effective is the sparingly used score, usually played over visuals of the abandoned ski park. There are some gruesome bits, particularly the hand scene from the trailer and a discovery towards the film's end, but most of the tension comes from the predicament itself and some of the debasing things the characters have to do. Needing to take a leak while stuck on a ski lift may not be a big deal if you're a guy, but Parker's options aren't so easy.<br><br>I didn't think much of Adam Green's Hatchet. Frozen, on the other hand, is worth raving about.","user":"Cujo108","rank":[100,156]}]