[{"title":"A Nutshell Review: Exorcismus","rating":7,"date":"22 January 2011","review":"The Exorcist stands out as the definitive film about exorcism with priests battling it out with demons in possession of a young girl's body, and to date no film can surpass that brilliance, and I am of the opinion it will stand the tests of time and various interpretations of the horror sub-genre to knock it off its perch. Attempts will come and go and it's up to filmmakers to find certain spins to their stories so that they don't get drowned out. The Last Exorcism by director Daniel Stamm was quite an effort with its documentary styled narrative with those huge twists that came with it, and the Anthony Hopkins starrer The Rite will hit our shores quite soon.<br><br>Then there's Exorcismus right now by Spanish director Manuel Carballo, which tells of a young girl Emma (Sophie Vavasseur, the schoolgirl in Resident Evil: Apocalypse) whose family suspects she needs mental help for her recurring fits and behaviour, until an inexplicable levitation opened their minds to engage the services of their relative Christopher (Stephen Billington), a priest with a tainted record in exorcism no less, to try and save their kid from the clutches of whatever demon is possessing her. That's the basic crux of the story, but what the film is about comes from the manipulation that mankind is capable of, and the folly and greed of man's pride, wanting to prove oneself to peers for that one-upmanship, or to exact some unintentional vengeful hatred arising from petty, hissy fits.<br><br>As the saying goes, don't push your luck and tempt the devil, because you'll never know the true impact of such an unwarranted pact, that you'll probably live to regret it. The film opens with the persistently angry teenager Emma, whom we learn through the course of the narrative isn't quite the docile, demure girl disciplined through home-schooling and always under the watchful eyes of mom, but one who does not hesitate in dabbling with mushrooms, and oh, the ouija board. All these spell trouble, and trouble does come knocking. Half of the show went to Sophie Vavasseur's performance as Emma, and she plays her role quite well, continuing the legacy of fellow peers who have stepped into the shoes of characters possessed by demons, in providing a fitting rendition with what some may say is the same old usual bag of tricks with bile spewing and eye rolling.<br><br>On the other corner of the ring is Stephen Billington as the priest Christopher, who is as eager to assist his niece as he is to laying down some ground rules which are a bit peculiar even for horror fans, such as performing it outside of holy grounds, not engaging more spiritual help from fellow brothers of the cloth, and not arresting the problem on the spot, spreading the exorcism over a number of days, with vast periods of intervals as well. This raises alarm bells of course, but all will be addressed as the film wears on, leaving room for various dastardly deeds to be performed, as if a lesson to be learnt against the dabbling with the occult.<br><br>For an audience looking for cheap scares and thrills, this is not that film unfortunately, even though it is steeped in the horror sub-genre of possessions. You don't get to see much since the details of the exorcisms are kept under wraps by way of the narrative, although you do get glimpses of it in the final act that turn out to be nothing quite new from what's already been done, such as the trash talking, sexual come-hithers, and more levitations, together with the Lord's Prayer, use of holy water and other equipment in a priest's arsenal.<br><br>Like The Last Exorcism, this film also relied on the final act to differentiate itself in quite radical terms, so it's pretty much hit and miss, and more of the latter if you're expecting something to make you jump at your seat, or linger in your thoughts way after the end credits roll. I bought into the explanation so it didn't turn out too bad, but be warned, if you're not receptive to little creative sparks adopted by the filmmakers, then perhaps this may be quite frustrating to sit through given a number of plot conveniences you have to buy into, and having more talk than to show for it.","user":"DICK STEEL","rank":[24,29]},{"title":"A Dark Film of Horror with a Surprising Twist","rating":6,"date":"14 April 2011","review":"The fifteen year-old Emma Evans (Sophie Vavasseur) has an argument with her mother Lucy (Jo-Anne Stockham) since she wants to go to a concert in London with her friends Rose (Isamaya French) and Alex (Tommy Bastow). Emma immediately has a convulsion and her family takes her to the hospital, but the doctors do not find any physical problem. Then her father John (Richard Felix) tries to convince his wife to send Emma to school, instead of homeschooling, but she prefers to keep Emma in the family-based education. Lucy sends her daughter to the psychoanalyst believing that she has psychological problems and Emma asks her friend Rose to record her session of hypnosis though the cellular but the doctor dies along the session. When Emma listens to the tape, she believes she is possessed by the devil and asks her parents to be submitted to an exorcism with her uncle, Priest Christopher Taylor (Stephen Billington). However her skeptical mother is against the ritual and recalls that Chris was responsible for the death of a teenager, Ana, in the past in an unsuccessful exorcism. But when Emma levitates in the kitchen in front of her family, her parents call Chris. The priest demands to move to their house; to film the ritual of exorcism alone with Emma; and advises that Lucy and John should never believe in the devil's words. When Emma's little brother Mark (Lazzaro E. Oertli Ortiz) is hit by a car and dies, Emma confesses to her mother that Chris has taught her how to summon the devil. Then she used an Ouija board and her blood to be free from her family and the devil has possessed her. Her revelation, associated to her discovery about the real motives of the exorcism of her uncle, leads her family to a tragedy. <br><br>\"La Posesión de Emma Evans\" is a dark film of horror with a quite predictable story but a surprising twist. The Irish actress Sophie Vavasseur has a good performance in the role of a girl that is possessed by option by the devil and sees the end of her former affectionate family and the insanity of her uncle. My vote is six.<br><br>Title (Brazil): \"Exorcismus – A Possessão\" (\"Exorcismus- The Possession\")","user":"claudio_carvalho","rank":[19,23]},{"title":"Demonic Possession With a Twist","rating":9,"date":"9 March 2011","review":"Exorcismus, not surprisingly, starts off fairly predictable, following in the footsteps of pretty much every other possession film out there, but toward about the midway point things suddenly change course, leading you in an original and disturbing direction. While most films seem only interested in patterning themselves on Friedkin's The Exorcist, Carballo introduces us to a \"not-so-innocent\" young girl with dark secrets, constantly locking horns with her progressive parents. Instead of jumping right into the possession, the director leads us to wonder whether Emma's malady is nothing more than the calculated tantrum tactics of a conniving teenager. This, of course, keeps us guessing while tension slowly builds and the signs of possession become evident.<br><br>The film occasionally has a documentary feel, thanks to the cinematography of Javier (Romasanta) Salmones, successfully bringing you closer to the characters without forcing you to participate, like The Possession of David O'Reilly. Naturally that only works when you're given genuine characters to connect with and in my opinion the actors all did a wonderful job, with 19-year-old Sophie (Resident Evil: Apocalypse) Vavasseur turning in the most impressive, and probably physically exhausting, performance as Emma.<br><br>Bottom line, when you watch a possession film you want to see some actual demonic possession, whether that's bending backwards, walking on walls, vomiting pea soup or using foul language. In the case of this film, the director could have kept things ambiguous without ever showing us anything supernatural but, thankfully, he didn't go that route. Exorcismus doesn't depend on wild CGI possession gags but they are used and when they are its to great effect as they're never over-the-top.<br><br>Written by David (The Devil's Backbone) Muñoz, Exorcismus features capable actors, solid CGI and some thrilling sequences that ooze tension and terror. This film is definitely worth checking out but be sure to rent first.","user":"wildsidecinema","rank":[22,31]}]