[{"title":"A genre-breaking classic","rating":10,"date":"8 October 2012","review":"There can be little doubt that Cloud Atlas will become a classic that will be watched over and over again by its devoted followers, just like its predecessors by Stanley Kubrick and Ridley Scott. Despite the many questions I had in my mind when I left the theater and the moments during the film when I felt disappointed or confused, I knew this, and I have not stopped thinking about the movie and longing to be back in front of the screen.<br><br>It is easy to criticize this movie as some have done for being overly ambitious, pandering to low taste, being too simple or too complex, with too few actors or too many, or even for celebrating revenge violence against professional critics who write negative reviews. They may all be correct, but these critics will still put themselves in the same category as those that warned audiences against 2001 or Blade Runner. The truth is that Cloud Atlas is profound in its reach, its visual and acoustic impact, its mesmerizing flow and its completely ground-breaking storytelling, and movie goers will see it and feel it in their guts. <br><br>It is a movie that is a product of our age of internet-driven universal knowledge and vision, and the freedom we have to travel the world and jump between ages, genres, images and identities at our will. It reminds us that we are human and that we can still hear our heart beat, if we listen.","user":"christianlotzny","rank":[1,1]},{"title":"Quite an achievement","rating":9,"date":"26 October 2012","review":"\"Cloud Atlas\" is nearly three hours in length, but I wasn't bored for a minute. The film alternates between six very different stories quite seamlessly, creating an exhilarating experience. It's part sci-fi, part historical drama, part love story, part comedy. Any number of things could have gone wrong with the film. All the different genres it brings together might have failed to coherently mesh. But they did, and it's something to see.<br><br>The film takes us on shipboard in the 1800s, where a young man forms an unlikely bond with a stowaway, a runaway slave. It tells the sensitive, melancholy story of a promising young composer in the 1930s – separated by prejudice and misfortune from his lover, a man named Sixsmith. It also brings us to 1973, where an intrepid reporter finds herself caught up in a web of murder and intrigue. In the present day, the film offers up the comedic tale of a publisher on the run from a gang of thugs. Plunging into the future, it shows a dystopian vision of Seoul, South Korea that is comparable to \"Blade Runner\" and a primitive post-apocalyptic Hawaii.<br><br>Linking these stories together are the simple thematic elements of love, compassion, and a love for liberty. The correspondence between the composer Robert Frobisher and Sixsmith depicts the plain beauty of love as well as any film I have seen, as do tender moments between the central characters of the portion of the film set in the futuristic New Seoul. Even in the blatantly comic segment with Jim Broadbent as the publisher, a deep passion for freedom and human dignity shines through.<br><br>All the actors do a great job in their multiple roles. You can care for Tom Hanks one moment as a villager in a future Hawaii, and then revile him in the next scene where he plays a truly despicable doctor. The best performances are given, however, by Doona Bae and Jim Broadbent. I think they surpass all the rest. Bae plays a \"fabricant\", a kind of clone designed to serve humanity. Her gradual awakening to her own self-worth, to the subjugation of herself and of her people, is beautifully and movingly conveyed. She is heartbreaking in this role. Broadbent is equally excellent as the publisher Cavendish. His expressive face and popping eyes are ideal for comedy – and he's hilarious. But he's more than that. Broadbent infuses the character with a sense of sorrow and weariness at key moments. Cavendish has depth, a history, regrets from his past. Broadbent brings all this out brilliantly without losing his comic touch.<br><br>Everything in \"Cloud Atlas\" comes together to create a film I found thought-provoking and highly entertaining. I don't hesitate to recommend it.","user":"TheHighVoltageMessiah","rank":[492,657]},{"title":"The Wachowskis join forces with Tom Tykwer and overhaul the meaning of the word Epic!","rating":8,"date":"8 September 2012","review":"Kudos to all the filmmakers for adapting this famously \"unfilmable\" novel in such an inventive way. There are SIX separate timelines that switch after every scene, but instead of the plot, the narrative continuity follows the theme of the film. Once you clue in to that overall theme, it is no longer confusing when the story jumps from a runaway slave in the 1800s to a post apocalyptic future battle between some of the last humans remaining on earth.<br><br>All this audacious style and structure makes Cloud Atlas a curiosity to say the least, but the film is lifted to the realm of \"Masterpiece\" by the all-star ensemble cast. This impressive collection of actors fires off amazing performances like the Expendables 2 fires off high caliber bullets. I mean this will long be considered one of the greatest acting clinics ever filmed, and a high point in some already outstanding careers, as the end credits alone are astonishing to watch.<br><br>Overall this is a movie that transcends the simple elements of stars and plots and special effects, and boldly assumes to take the cinema to another level of storytelling, much like Avatar took film to a new level of technology a few years ago. The ambition, the technical brilliance and the passion that was put into this film makes it one of the great epics of our time.","user":"torontodog","rank":[795,1]}]