[{"title":"Disappointing","rating":4,"date":"1 December 2014","review":"In the intro, a girl finds an envelope on her car. It has a \"rule\" written for her. She thinks it's a joke from her ex so goes to his home to confront him but she's being followed. He isn't there so she goes swimming topless in his pool. But the stranger is also there, dressed all in white and leaves her another envelope with a rule. Then he stabs her to death.<br><br>Next we meet some girl who is bring brought back to the house of bad girls by the police. She's the tough trouble-maker. We meet the rest of the troubled girls--the slutty one, the innocent bookworm, the innocent troubled one, and some other girl who's roommates with tough chick. In charge is some nice lady, her man, and some strict school teacher type lady. There's some other guy there as well.<br><br>At first not much happens except for bickering and verbal abuse by the obnoxious tough chick. Then finally she goes takes a shower and an envelope appears. She flips out and accuses everyone else, in particular her roommate. Some more envelopes start appearing. Then a video of one of the guys being held captive. The girls can't use their phones, they can't and won't escape. They just wait for the guy in white to strike. And eventually he does. People start getting hurt and it's not clear who the bad guy or girl is. Eventually the girls try and defend themselves and the police arrive after all. Then we learn who the villain is.<br><br>House Rules for Bad Girls has a promising start with an intro credit scene featuring attractive strippers. Things get better in the intro scene with the voluptuous swimming pool girl. For a moment I thought this would be an awesome softcore thriller like those of the 90s. But then things go downhill considerably. The image gets very dark, sound gets low. The girls aren't particularly attractive and there's almost no nudity. The shower scene doesn't show any skin. Only one other girl gets topless for a second. The violence is lame. The blood is CGI, but very well done. And the story for the most part isn't all that interesting, but the twist was good. A major problem is that you can't root for any of these characters. The main girl is a real nasty piece of work and we learn nothing about the others. Acting is uneven but acceptable. Some actors do well, others not so much and there's problems with the dialogue re-recording. I'm fond of movies like these but you've got to be willing to give something to the audience--attractive naked girls, violence, gore, at least one good character, etc. House Rules for Bad Girls has the right idea but doesn't try hard enough.","user":"TdSmth5","rank":[9,14]},{"title":"A Fiver","rating":5,"date":"3 August 2014","review":"Well at this writing there were no reviews for the film which I just watched on Snag Extreme so I thought I'd write one. Here's the \"plot:\"<br><br>Becca has just arrived back to New Hope (a girls ranch) to find that there is a new set of rules she is going to need to follow.<br><br>Yeah? Actually I think this movie is a reason to show smoking hot naked chicks getting slaughtered.<br><br>And trust me, I'm talking slaughtered and I'm talking smoking hot naked bodies.<br><br>I'm not sure there IS a pot beyond this.<br><br>The movie actually looks good and has decent production values. Adding the smoking how naked bodies into the mix means you aren't going to get the best acting and some of the sound is tinnie because they didn't fix it in post production.<br><br>But you're not watching it for that are you?<br><br>It's a fairly typical sort of genre film and after the first slashing it gets a bit slow for a while.<br><br>It's not a horrible movie. Surprise! It's OK.<br><br>Not great. Just OK. Takes itself too seriously","user":"arfdawg-1","rank":[4,6]}]