[{"title":"Many plot holes","rating":29,"date":"29 December 2014","review":"Hard to ignore some gaping mistakes in the plot:<br><br>1. The lead character finds the money, but not the briefcase full of \"liquid O\" that is right behind it. He finds a box full of cash, but does not look in the ceiling again to see if there is more, or anything else up there?<br><br>2. The thugs find the drugs in the apartment after the police have searched the apartment. The police, suspecting that there is a drug tie-in, never think to look in the drop-down ceiling?<br><br>3. The couple is about to be evicted, and about to lose \"the house.\" This means the house they are renting? Why not move into the house that he is fixing up and has inherited? It had a roof and walls, and he knows carpentry. No rent to pay if they move into the house, yes? <br><br>4. No one seems concerned that a police officer, or someone dressed as a police officer, shot a detective and continued shooting in a public park. Never mentioned on the news they listen to? Never brought up in any of the conversations among the characters?<br><br>5. When nailing the thug to the floor, the lead male is somehow able to know exactly where both of his feet were positioned, although the floor is solid where he is standing, with none of the cracks that can be seen in other parts of the floor. <br><br>6. The same thug, hiding from people with guns, lights a cigarette, which might not seem wise, since smoke could be seen coming from the room where he is hiding, or smelled. But no one does see or smell it, including Khan, who walks right up to, and almost past, the room before being shot at.<br><br>7. No one tries to put out the fire, which is confined to a small section of the house once the shooting has ended. <br><br>And of course, the clichés were terrifying--the couple trying to have a child and learning at the end that they were going to have a child. The detective who has lost a child to drugs, and is now seeking to destroy the drug trade? Somehow, the obvious cliché was missed--this couple needed a dog. A dog, wounded in the battle with the drug dealers, but recovered by the end and leaping into their laps after the news that a child is on the way. If you're going to do it badly, go ahead and do it badly.","user":"greggjohns","rank":[16,17]},{"title":"A movie that has been done so many times that nothing can help the repetition of the plot. A b-movie with better acting.","rating":5,"date":"26 October 2014","review":"\"Whenever you find a pot of gold there's always a monster guarding it.\" Tom (Franco) and Anna (Hudson) are married and struggling. They are weeks away from losing their house and the job market is dry. They are cleaning up an apartment of one of their tenants who died they find a huge bag of cash. After going back and forth on what to do with the bag they decide to just take what they need to keep the house for another month. Little by little they begin to take more but then someone comes looking for the money. Keep in mind when you read this that I watch every movie we order for the store. There are at least 2 movies a month that come out with the exact idea. The only difference this one has is that big name actors are in this. People find a bag of money with like $1 million in it and think what should we do...we will only spend a little of it to help us out. Soon most of the money is gone then they act shocked when someone comes looking for it. I have always wondered if a bad movie can be made good by adding great actors. According to this movie the answer is no. This is still a b-rate overdone movie with better acting. Overall, a movie that has been done so many times that nothing can help the repetition of the plot. I give this a C+.","user":"cosmo_tiger","rank":[28,32]},{"title":"Good People=Average Film","rating":6,"date":"26 September 2014","review":"Good People is an average action thriller starring James Franco and Kate Hudson in the lead roles. They are an American Couple living in London, who stumble upon 220 000 pounds when the crook to whom they are renting their basement to dies of a drug overdose. In debt to their eyeballs they are tempted to keep the money and not to inform the lead detective (Tom Wilkinson) of their discovery. The plan is that they will only spend as much as they need to stay afloat financially. The trouble is that their deceased tenant double crossed a bunch of his criminal cronies and they want the money back. They In turn stole the money and a bunch of drugs from a French drug dealer called Khan. And soon, he is involved in the plot as well. No one has come for the money, and no one is coming utters Franco's character at one point. Yeah right. <br><br>Predictably, the Protagonists are soon being assaulted and chased by the criminals who want their cash and product back. In the end, all the various criminals, the policeman and the married couple congregate in one place and there is a shoot out. As for who is left standing....well, let's just say that there are no major twists that will leave you shocked by the ending. <br><br>Overall, the movie is not bad and has entertainment value if you feel like watching a relatively straightforward suspense action thriller. The plot is overly simplistic however and there is not much character development of either the good people or the bad ones in the film. There are subplots in the film which are supposed to enrich the characters and add suspense but they somehow look coincidental, feel rushed and are not too suspenseful. In the end the movie is watchable and entertaining to a point but not extremely memorable.","user":"nebk","rank":[31,39]}]