[{"title":"Actually Not That Bad","rating":5,"date":"8 September 2014","review":"I love horror movies and honestly, I'll give almost anything a chance which means I have watched some truly awful movies. Abandoned Mine is definitely not even a candidate for that list. It's not a great movie, but it's far from terrible. I felt invested enough to continue watching until the very end. <br><br>Sure, it's cliché. But I think the movie goes out of its way to acknowledge that. It has a generic title. It takes place on Halloween. The characters tell a scary story in front of the haunted, abandoned, so-scary-oh-god-no mine about its past on the not quite 100 year anniversary of the tragedy that caused it to be haunted. So, I don't think the movie's really trying to take itself all that seriously. <br><br>The actors are actually fairly strong for a movie like this. Alexa Vega is always a treat and though she's playing the female character who's afraid of everything, it's hardly ever grating which takes talent. Reiley McClendon straddles the line between jerk and jerkily charming for most of the movie. Adam Hendershott plays a generic, ex-jock character and does it well though his freak out at one point is actually quite good. Charan Prabhakar plays a character that is a stereotype but is also very aware of that; his deadpan delivery of some of the more outlandish lines really sells the character as the best thing about the movie for me. Then there's Saige Thompson. She's not a bad actress but she's definitely the weakest of the group, her big, dramatic moment being the worst in the film. <br><br>The main thing the movie does wrong is abandon the majority of its ambiguity near the very end causing it to lose whatever originality it had.","user":"KissofLye","rank":[10,12]},{"title":"Better than the low rating would suggest","rating":6,"date":"26 August 2013","review":"Some people amaze me when they review a movie that they only watched for 15 minutes and automatically rate it the lowest possible score. No way this is a 1 out of 10. It's not even a 3.6 out of 10, which is its current rating. I give it a solid 6, give or take 1 point depending on how graphic you like your horror films to be.<br><br>There's no need for me to give the plot outline, it's already been given. For a low budget film, the acting, the lighting, the setting and the story are all above par. And let's not forget it is a bit claustrophobic at times as well. Not as much so as THE DESCENT, but still very good for the small amount of money involved. Again, I would like to give props for the lighting. For a movie like this, set inside an abandoned mine, the lighting couldn't have been any better. Great job all around. Not violent, but very well paced, acted and directed. If nothing else, great fun for the entire family. Kid-friendly stamped and approved.","user":"Reaper-of-Souls","rank":[15,24]},{"title":"Ghost movie for the children...","rating":3,"date":"16 August 2013","review":"\"Abandoned Mine\" is sort of a scary movie for children. Or at least I hope so, because if this was seriously meant as a horror movie, then it just failed utterly and completely. There was absolutely nothing scary about the movie, aside from the fact it was lacking scared and the level of boredom it managed to invoke.<br><br>The story in \"Abandoned Mine\" is about a group of young friends who go out to an allegedly haunted mine together to celebrate Halloween. They have a good time and goof around, until one of them starts telling the tale that took place one hundred years earlier. And as a storm starts to roll in, the youngsters seek shelter within the mine shaft, and as curiosity gets the better of them, they decide to venture deeper into the mine to have a look around and see if they can scare up some spirits and ghosts for Halloween.<br><br>For a family movie, then \"Abandoned Mine\" would be adequate, as there is no gore, no mutilation, no scary parts, no nothing, in it to upset the viewers. But if you sit here and watch it, hoping it to be a proper horror movie, like I did, you will be sorely disappointed.<br><br>As a movie taking place in a haunted mine, there never was any sense of dread, claustrophobia or panic to be felt throughout the movie. Whether it was because of a fairly weak storyline or because the actors failed to portray such emotions, well I am most likely to say because of the lack of a proper storyline.<br><br>The people hired for the roles in \"Abandoned Mine\" were doing good enough jobs with their given characters, although they just didn't have much to work with.<br><br>If you want to be properly entertained by one of the spelunking horror movies, your money would be better spent on either of the \"The Descent\" movies. \"Abandoned Mine\" failed on many levels.","user":"paul_haakonsen","rank":[13,21]}]