[{"title":"Disney presents \"Road Trip for Girls\"","rating":4,"date":"3 October 2009","review":"...at least if Disney movies contained lots of topless nudity. <br><br>The plot: A girl (Jenna Dewan), who has devoted her life to chastity and following rules, goes to college on scholarship from an organization that promotes celibacy. She inadvertently gets drunk at a party and is filmed topless by \"Chicks Go Crazy\" (this movie's fictional version of \"Girls Gone Wild\"). She and her new-found college friends embark on a journey to save her reputation and her scholarship by getting the footage back. Along the way she learns lots of lessons about life and love, and we see a lot of breasts.<br><br>Although it has lots of (attempted) college humor, the storyline is that of a typical formulaic teen movie, complete with morals and cliché moments. Sometimes it's rather painful. One scene in particular stands out in my mind, where the main character and a guy who's falling in love with her are listening to the radio and actually break out into song (clearly lip-syncing with prerecorded voices). Reminded me of Aladdin (\"A Whole New World\").<br><br>I think what annoyed me most was the background music, which is cornily reminiscent of typical family films (\"Honey I Shrunk the Kids\" came to mind specifically, for some reason). I've never seen a film that contained so much adult content and yet felt so geared towards being a family movie. I really don't know who this movie was made for. On the one hand, the story is so fluffy it seems like pubescent girls were the target demographic. On the other hand there's the raunchy college humor and frequent nudity. So I'm not really sure who they were hoping this would appeal to.<br><br>As a late edit to this comment: I wanted to mention one positive aspect of this film, and that is its message regarding \"Girls Gone Wild\", which was aimed perhaps at those girls who value that kind of attention. The message is delivered in true teen cliché fashion, but nevertheless, it is a decent message that I haven't seen mentioned before.","user":"equazcion","rank":[73,93]},{"title":"what a waste of time","rating":2,"date":"13 October 2009","review":"I give a 2: the image is focus, sounds match lips and lighting OK.<br><br>Other than that it's a TOTAL WASTE OF TIME, one of the worst movie I ever saw!! (and I don't use that often), even if you can see it for free (wich was my case, I won't get in the details) the investment is too high!<br><br><ul><li>It's suppose to be a comedy: didn't laugh once; - the scenario is... plain stupid and sooo predictable; - the characters are... walking stereotypes; - the \"message\" is... ridiculously presented;</li></ul><br><br>what else? boobs, basically this looks to me like an exploitation film.<br><br>Hollywood as lost all creativity when exec approve such projects.","user":"zoroastre","rank":[50,104]},{"title":"It was OK, not terrible.","rating":4,"date":"9 January 2010","review":"OK, so i borrowed this movie from a buddy, and watched it by myself. I wasn't expecting much when i started it.. And i didn't get much. Just lots of boobies. But that has to be the only good thing about this movie. There is hardly any plot for it. And what little there is just dissolves towards the end of the movie.<br><br>As for the acting.. It's not great.. but watchable. It's a real shame that Rob Schneider is doing movies like this now.<br><br>But anyway, if you just want a movie with a large amount of nudity in it, then just watch this.<br><br>I Give it a 2* out of 5*<br><br>Enjoy.<br><br>Alex","user":"Donalex","rank":[12,20]}]