[{"title":"Watch it for Brittany Murphy but it's not great","rating":4,"date":"10 August 2010","review":"This is one of Nora Roberts' weaker stories. The romance and drama are very predictable and not very interesting.<br><br>Brittany Murphy's appearance here is really poignant. She looks a bit gaunt. But her face is fascinating as always.<br><br>The story is very predictable - you can see who did it from a mile away. The nasty look of the villain is too obvious.<br><br>Jason Lewis looks a bit haggard. <br><br>Watch it to see one of Brittany's last appearances. Other than that it's not great even for this kind of movie. I know you can't expect too much from this kind of lifetime hallmark thing but this one is weak.","user":"phd_travel","rank":[6,6]},{"title":"Brittany Murphy makes this work","rating":6,"date":"30 April 2009","review":"Without Brittany Murphy, this film would probably be saccharin schmaltz. The story is kind of pedantic:<br><br>Failed child star inherits a Virginia mansion from her grandmother, a two-time Oscar winner from the late 60s, early 70s, who died from an apparent suicide before Murphy's character was born.<br><br>The plot includes some intrigues about her grandmother's secret affair with a mysterious married man.<br><br>...and she has to deal with bad feelings the townies have toward her family...and there's a lot of creaking and sneaking and lame scare tactics.<br><br>All through this lame frame work of scenes...Brittany Murphy makes a silk purse out of a sows ear. She turns water into wine. She gives so much on screen with her realistic and edgy performance. I've watched this lame movie three times already, because Brittany Murphy is mesmerizing in this. She doesn't even have to say any lines, and you get what she's trying to communicate. Everything shows in her face and body language.<br><br>Even when the killer is revealed, and the plot unravels into lame predictability...she still makes it work. I keep watching because I'm amazed that she makes this script sound organic, as though they weren't lines from a Lifetime Original Movie. She delivers as though she's actually thinking and feeling what is written on the page. I'm totally blown away...by Brittany Murphy...not by the film its self.","user":"amber-248","rank":[11,15]},{"title":"Your kin has brought us nothing but sorrow and misery!","rating":6,"date":"12 April 2009","review":"***SPOILERS*** Going back to her roots in Virginia's Shenandoah Valley former child movie star Cilla McGowan, Brittany Murphy, is determined to restore her grandmother's,the legendary Academy Award winning actress and singer, Janet Hardy (Tiffany Morgan) southern mansion. The place over the last thirty five years has gone to pot since Janet's tragic death-at age 38-back in the winter of 1971 from a massive overdose of barbiturates.<br><br>It doesn't take long for Cilla to make enemies in town with the angry and a bit unstable-to say the least- Old Man Carl Hennessey, Wallace Merck, suspiciously snooping around her house. Hennessey later shows how very very unneighborly like he is by him spitting in Cilla's face when she confronted him about his very strange and bizarre actions. It turned out that Cilla's Uncle Johnnie was responsible-by driving drunk-in Carl's son-who was a passenger in Johnnie's car- ending up paralyzed from the neck down!<br><br>There's also the fact that Janet was also having an affair with one of her neighbors that by Cilla uncovering his love letters, all unsigned, to her strongly hinted that she got pregnant by him! This may well have lead, in Janet's lover trying to save his marriage, to her murder not suicide as reported by the, back then in 1971, local coroner!<br><br>Getting romantically involved with her next door-or next farm- neighbor Ford Sawyer, Jason Lewis, a local graphic designer Cilla soon becomes the target of some local lunatic who, like some half dozen others in town, has it in for her for what Cilla's family-or late Grandma Janet Hardy-actions did to him. It's this shadowy psycho who's constantly breaking into Cilla's now restored mansion,and wrecking the joint, while she's away mostly spending her nights at Ford's place. It soon becomes evident to the police that Old Man Hennessey isn't the person that's committing these property crimes and acts of terror since he's been locked up all the time that they've been happening to Cilla. Then who's the person committing them?<br><br>As we all suspect, due to her very wild and anything goes lifestyle, the person driving poor Cilla's nuts has to be the man, or possibly his very jealous wife, whom Janet had an affair with just before her sudden and mysterious death! It's then that Cilla as well as her boyfriend Ford Sawyer realizes that it was that person who very possibly murdered Janet, and had it made to look like a suicide, and now in her getting close to the truth is going to do the very same thing to Cilla!","user":"sol-kay","rank":[12,30]}]