[{"title":"No reason to seek out Cop Out","rating":3,"date":"19 March 2010","review":"What was Kevin Smith thinking? An audacious critic of society and film in particular, and no stranger to poking fun at himself I can foresee, a few years down the road, a sheepish Smith laughing off his involvement in this torturously unfunny genre film. What he may lack in compelling direction skills, he more than makes up for in witty screenplays with equal balance raunch and insight having crafted classics such as Clerks and Chasing Amy. With Smith absent from the writing role there is absolutely no reason to seek out Cop Out.<br><br>Calling Cop Out a 'buddy cop' film would be a gross misnomer. To qualify as such, we would actually have to witness some aspect of 'buddy'. Bruce Willis and Tracy Morgan, who co-star, have absolutely no chemistry and I did not believe for a single second they would ever be friends, or even be able to tolerate one another for that matter. Furthermore, I did not believe for a single second that Tracy Morgan could ever be a cop. I am willing to suspend some disbelief in movies like this but c'mon. This role would have been kin to casting Betty White in Taken. Morgan is a very funny man in supporting situations, with 30 Rock being an apt example (Although that show benefits from Tina Fey's screenplay. If she had penned Cop Out this review could be reading far differently) but as with actors like Chris Rock and Chris Tucker, a little goes a long way.<br><br>Then we have Bruce Willis who just seems eager to leave. I have never seen Willis mope his way through a movie like this; all of his roguish charms seemed drained by the horrific writing and familiarity of the gags. To make matter worse yet, we get a horrendous performance from Sean William Scott, also a very funny man, whose character is as annoying as it is perfunctory. Many have been calling this a familiar rehash of buddy cop flicks of years past; I wish. I would have begged for a Beverly Hills Cop XXII over this near abomination.<br><br>The plot, in case you care, centers on Willis' and Morgan's Jimmie and Paul, two NYPD detectives who stumble into a drug ring after Jimmie's prized baseball card is stolen in front of his eyes during a robbery. He needs the card to pay for his daughters wedding and as he searches with the help of the criminal by which it was stolen (William Scott) uncovers more than he had in mind.<br><br>In summation, this film fails as a comedy, fails as an action film, fails as a breakout role for Tracy Morgan, fails as a return to the cop genre for Willis and mars Kevin's Smith's mostly unblemished track record. Originally titled A Couple of Dicks, the title was then changed to what you now see on the marquee. I can only assume this was a backhanded reference to the state of Smith's creative integrity.<br><br>Read all my reviews at simonsaysmovies.blogspot.com","user":"Simon_Says_Movies","rank":[145,230]},{"title":"Cheaply done buddy film","rating":5,"date":"9 January 2011","review":"Cop Out has a few laughs, but otherwise it's a surprisingly bland experience. It suffers from a generic storyline, questionable performances and the simple fact that almost none of the intended sources of humour achieve the desired effect.<br><br>Bruce Willis (an old timer) and Tracy Morgan (a new timer) are an odd couple indeed, but they had potential. The problem is that their levels of commitment to the film are polarized. Willis seems lazy and uninterested never putting much effort into it. Morgan on the other hand, tries way too hard. His larger than life style of crudeness is more clumsy than funny, and he upstages pretty much everyone else in the cast.<br><br>After about ten minutes, we have a pretty good idea of how this film is gonna play out, but we go with it in the hope that the trip is worth while. Unfortunately there are more silly contrivances and poorly written lines than there are laughs. The only time when Cop Out is funny (and remotely clever) is over a Good Cop Bad Cop routine that Willis and Morgan have. There are enough action movie jokes to make it clear to the audience that at least Kevin Smith has the self-awareness necessary for satire. But from what I saw, Cop Out isn't really a satire at all. It no better or worse than any other failed cop/comedy. I'm not sure if it's laziness or lack of thinking behind it, but Cop Out hasn't got the goods","user":"Samiam3","rank":[22,31]},{"title":"Cop Out : BeatDown Reviews","rating":7,"date":"10 August 2010","review":"Do you want to know the reason why some people did not like this movie? I'll tell you why. They take this movie too seriously. I mean yeah there are some problems in the movie but then again, nothings perfect.I watched this film and within 10 mins into the movie, I was laughing my butt off. I believe that more people will enjoy this film if they just relax and unwind while watching this film, and to not take it so seriously.<br><br>The story is about two cops Jimmy Monroe(Bruce Willis) and Paul Hodgens(Tracy Morgan). Jimmy has to pay for his daughters wedding in order to not look like a fool in front of his ex-wife's new husband Roy(Jason Lee) who is much richer than him. So he decides to sell off his prized possession, a 1952 Andy Pafko card. However, Jimmy was robbed halfway through the transaction by Dave(Sean William Scott). Now he and his partner have to go across the city causing mayhem an violence just to find his card.<br><br>Now I bought this film on DVD so there are special features . Just deleted scenes. This film may have a clichéd storyline but it has great lines to make you laugh out loud and Kevin smith does a pretty good job at directing the duo. Although not his best, surely one of the funniest. Bruce and Tracy just have excellent chemistry and that is also what makes this movie shine.","user":"jwchoo1","rank":[18,26]}]