[{"title":"Action yes, but hell of a character study as well","rating":9,"date":"30 September 2013","review":"The arrogant action film actor is a bully with a temper and after one tantrum too many finds himself without any willing co-stars, so enter the inscrutable gangster who was in a movie once as an extra and still enjoys watching films. A request for an autograph leads to the first showdown between the actor and the gangster. Western films have led us to believe Joe Pesci and Robert De Niro (and now Steve Buscemi as Nucky Thompson) are the stereotypical gangsters that whack and or whip out a garrote at the smallest slight. Not the stoic Gang-pae, played so well by Ji-Seob So, who barely needs any dialog to convey his thoughts or reactions. From the moment he agrees to be on screen, and to fight for real, I began to get a feeling of dread. His line to the action star about finally becoming a real actor was as heartbreaking in its own way as the events that followed. Like I said, action yes, but the characters made made it a solid film.","user":"findwilliams","rank":[12,13]},{"title":"pretty good","rating":8,"date":"24 May 2013","review":"I started watching this movie, expecting a standard gangster action movie. And that's what I got.<br><br>But goddamn dude, the acting in this movie from the gangster guy was just so mesmerizing, that 2 hours went by like nothing. And to me the acting in this movie in general plus the interesting premise has elevated this to, like more than your typical gangster action movie. <br><br>sorry first review<br><br>anyhow this is a pretty good movie. It succeeds as a gangster action, but its like, more than that and you should watch it, cuz you could be pleasantly surprised<br><br>soo....8/10<br><br>watch it<br><br>and again I apologize, I know, it's a shitty review","user":"chat_boy","rank":[12,13]},{"title":"A giant Truck that Crushes Your Expectations into Little Pieces of Regret!","rating":9,"date":"16 July 2012","review":"First of all, I'd love to point out that I've seen all the 3 films of this director and this was the last one I saw. <br><br>When i got the glimpse of the faces of the two actors, I though This would be a predictable ''there is a problem'', ''gangster'' film. Nevertheless I watched it for the sake of the director. <br><br>(I highly recommend his two other films. Both are very very awesome.)<br><br>When the film was over, i was left speechless, shocked and regretfully happy inside my heart.<br><br>This film goes over the humane problems and unfolds all the rigid and complex architecture of attitudes in two people: a gangster and an actor.<br><br>Acting, script/Story/plot, scenes, originality: all 10/10. This film is a masterpiece and is Highly Recommended to anyone who appreciates complex and masterful directing. Just watch it. Pure awesomeness. You will not forget this.","user":"achi_oragvelidze","rank":[14,17]}]