[{"title":"Great","rating":10,"date":"30 November 2019","review":"The last 5 minutes of the movie explain everything. 2 things:<br><br>1- The photo of his daughter and Jimmy. These 2 persons are these ones that he loves the most. It reminds him how he lost them both. Frank killed his best friend and he lost his daughter after she understood he did it.<br><br>2- The door half open at 1 minute before the end. Jimmy used to let the door of his bedroom open because he trusted Frank. Frank broke the trust and as a result he could never talk to his daughter again. This door represent the trust, and show that trust must never be broken. Trust is even more important than love because without trust there can be no real love.<br><br>Great movie, great actors, congratulations Mr Scorsese.","user":"chevallierjulien","rank":[1,1]},{"title":"It's brilliant, but best to go in with as few expectations as possible","rating":10,"date":"8 November 2019","review":"When I love a movie as much as I loved The Irishman, I feel torn. On one hand, I want to review it and rave about it and try to convince others to see it. But then on the other hand, I realise that doing so could set expectations too high, which could then lead to some people getting disappointed (this happens a lot with horror movies that get hyped at film festivals and then rejected by disappointed wide audiences, like with The Witch, It Follows, and Hereditary).<br><br>So that leaves me in a tricky situation, and I'll compromise by praising the film as much as I can without overhyping, whilst also making vague comments that won't be specific enough to ruin what the film has to offer (because yes: it's a Scorsese film. He has an incredibly varied filmography when you break down just what he's made over the last half-century, and so you're never going to get exactly what you'd expect).<br><br>Okay, acting: phenomenal. Besides Goodfellas, Pesci's best performance ever. This is the best De Niro's been since Cape Fear. This is the best Al Pacino has been in at least three decades. These men are old, and all accomplished and wealthy enough to retire happily at this point, but thankfully they all agreed to not only star in this movie, but commit themselves 100%. No one's phoning it in here. While the supporting cast are uniformly solid, these three steal the show and I hope all get Oscar nominations come awards season.<br><br>Scorsese, to no one's surprise, directs brilliantly throughout, making every scene purposeful and captivating. The movie is long, but deservedly so. The various pay-offs towards the film's conclusion would not hit nearly as hard if the film didn't spend so long building character, suspense, and emotion.<br><br>As crude as it might sound, this movie- at about the halfway point- made me forget how badly I needed to use the theatre's restroom. At a certain point, I accepted that I couldn't miss a second, and leaving the room for even a moment was totally out of the question.<br><br>If you can see this at a cinema, and can handle three and a half hours without a toilet or snack break (no intermission!), then by all means, watch it on a big screen, because it's beautiful and ultimately the best way to experience a film of this scope and spectacle. But it'll be on Netflix soon, and perhaps some would prefer to watch it in the comfort of their own home, where snack/toilet breaks are possible.<br><br>Whatever you do, make sure you ultimately watch it. Films like this don't come around too often, and this is such a perfect swan-song for this talented group that I doubt we'll see these legends together again.<br><br>It's bittersweet, but if this is Scorsese's, De Niro's, Pacino's and Pesci's farewell to the crime genre, then it's an amazing note to go out on.","user":"Jeremy_Urquhart","rank":[1,1]},{"title":"The Last Of Its Kind","rating":8,"date":"28 November 2019","review":"I don't know where to start on this one other than thanking Netflix for being the only distributor to fund this movie so we could see Big screen legends take their last big swing. The set and screen is smaller than I liked it to be, it being released on a streaming site but it's better than never seeing it.<br><br>It's not a flawless movie and I wouldn't necessarily call it a masterpiece or something new and innovative. But for an old genre gangsta flick it's easily one of the best ones out there.<br><br>The plot is a lot like Godfather 2 from De Niros perspective but that's all there is. It is more grounded and far too subtle compared to Goodfellas. And that's a good thing considering the age of the lead actors in the movie. But that doesn't mean its dull, gray and dreary because it isn't. It is surprisingly humorous, has some very serious scenes and doesn't shy away from giving us a blast of nostalgia every now and then.<br><br>The cinematography is quite different from the usual modern movies we are accustomed to. It doesn't have an overabundance of Wes Anderson symmetric shots or Roger Deakins like Wide angle shots. The film was shot in a very old timey way with the camera pans and edits. The editing in the movie is great and the score is fitting. Technical aspects considered it isn't innovative or something jawdropping, but that was never supposed to be the main focus of the movie.<br><br>The main focus for me was absolutely the acting. And why wouldn't it be with a cast like this? Al Pacino and Robert De Niro for the 1st time on screen together since Heat. Joe Pesci and De Niro since Goodfellas. Joe Pesci coming out of retirement and Martin Scorsese directing all these legends on screen together! If this doesn't get you excited for this film then I'm afraid nothing will.<br><br>Speaking of acting my god do they act! Robert De Niro gives his best performance in his older age with this. Joaquin Phoenix was a top contender for best Actor Oscar and I agreed with that but after watching THE IRISHMAN everything changed. Robert De Niro basically steals his Oscar like a gangsta and gives the best performance of the year so far. Old Bobby here still giving top notch actors a run for their money and the guy is 76 years old!<br><br>When was the last time you saw Al Pacino give a really good performance? Well that's exactly what he does here and it feels so good to see him find his glory days. He is his usual shouty self but shines better when he tones it down and let expressions speak.<br><br>And boy have I missed Joe Pesci over the years and don't worry he's still intense as usual. And that's weird considering he is extremely toned down in this movie. If you're looking for a violent Joe Pesci like he was in Goodfellas you'll be disappointed. But if you're looking for an intimidating Pesci with a huge presence then you're in the right place.<br><br>Harvey Keitel is in the movie for a very short time but he did his job fantastically. Ray Romano was a surprising standout and I can't believe how he kept up on the same plane as some of these industry legends. He doesn't really have a bigger role and basically gets lost as the film progresses but he made the most of his screentime.<br><br>The film is 3hours and 30 minutes long but it never felt that long honestly. The first 2 hours went by a breeze but the 3rd hour was unapologetically slow. It felt a bit dragged on during the final hour and felt it was skipping ahead at the same time. it wasn't boring in any way but felt it could've been handled better. The CGI de-aging is so good that after a while you get confused how old the lead actors actually are. This is the best de-aging tech I've ever seen honestly.<br><br>Despite it being slow in the latter end it still is a fantastic film. It doesn't set out to do something different, it doesn't try to set it aside from the herd. Scorsese did what he does best and made the movie he wanted to make. Its more of a last big hurrah for these living legends than something out to be a flawless masterpiece. It will most likely be the last of its kind and also the last collaboration of Scorsese with these acting legends. Considering the time we are in this might as well be the last Scorsese film, it most definitely is the last Joe Pesci appearance in a movie and the last good mobster hit with genre legends like Al Pacino and De Niro. So enjoy it while you can and savor it. Remember this movie 10 years from now and rejoice that you were alive to witness something truly fantastic. THE IRISHMAN is a farewell for most of these legends and a loveletter to the genre. It's the last of its kind and it went out in true mobster style.","user":"redcanofevil","rank":[471,650]}]