[{"title":"Fresh insight on relationships","rating":7,"date":"5 August 2009","review":"Just saw Separation City in my home town (and where the movie is set) of Wellington, New Zealand. Wellington looks great, and overall it is a though provoking story, and refreshingly offers up the male point of view on long term relationships.<br><br>There are some great gags, the first half of the movie produced plenty of laughs. The second half delivers quite nicely with farcical elements, but with plenty of emotion as well.<br><br>The acting is pretty good, the direction good (if a little unimaginative), and the script does well to capture some unique male experiences that I haven't seen in cinema before.<br><br>The only thing I really didn't like were the terrible voice-overs. At times they worked, but other times they were completely redundant and spoiled the moment. I really hope that they edit out about 90% of the narration before this film is released internationally.<br><br>but those are only minor criticisms - overall, it's a good film, engaging and enjoyable, and with a fresh insight into modern relationships.","user":"jonpovey","rank":[14,16]},{"title":"I loved this film","rating":10,"date":"9 August 2009","review":"At last a New Zealand film about real people in real situations. This film is written by Tom Scott a political journalist and one of New Zealand's best loved satirical cartoonists. His own real life experiences are evident throughout the film as the characters move from one hilarious situation to another. Set mainly in Wellington, New Zealand's capital and home of parliament, it shows the beauty of Wellington and the real New Zealand character. The actors are very believable and so funny that I was laughing out loud in the theater. My only complaint was that it wasn't longer. This is a great film about friends and the frailty of familiarity. It has great insight and will touch all who see it. My suggestion. Just get out and see it.","user":"jhainey","rank":[17,27]},{"title":"An interesting perspective, let down by lazy directing","rating":7,"date":"22 August 2009","review":"One of the few romance/comedy-dramas where I could empathise with the protagonist, Separation City delivers an interesting and surprisingly realistic view on love, romance and life in general. That's not to say that I haven't heard it all before, however it was delivered in a frank yet not \"in your face\" manner, making this movie stand out from dozens of other films on this subject. Having said that, the movie really suffers from lazy directing. It also doesn't help that being a New Zealand movie they had to cast at least one New Zealand lead, and with all due respect to Danielle Cormack, she was out of her depth here, particularly when surrounded by the ever brilliant Thomas Kretschmann, as well as Rhona Mitra and Joel Edgerton. The scene at the beach towards the end of the film really exposes her weakness as an actress, although part of the blame lies with the surprisingly weak dialogue in that scene, which was not characteristic of this movie, I must add. <br><br>3 comments about this movie can help me illustrate my frustration with it:<br><br>1) The narration. Overly elaborate, at pains to explain every little nuance, every feeling, it felt as if the director didn't trust the actors to deliver the message through their acting. I wonder if they ever tried screening it without the narration just to see if the movie holds up on its own, because I'd bet it would. <br><br>2) Lazy directing. (here be spoilers). An example of this is Klaus painting a pohutakawa tree back in his apartment in Berlin, with Katrien's voice-over telling us that he is painting landscapes of the distant shores. Wouldn't it be better to embed a flourishing pohutakawa somewhere in the movie so that once back in Berlin and painting it, the viewer would recognise it and understand Klaus is painting a New Zealand landscape? (spoilers END) <br><br>3) Why was Mike Minogue (Errol the Fireman) in this film and what did his character contribute is beyond me.<br><br>Overall not a bad effort, I definitely agree with the message it conveys, but I do hope they release a director's cut version with no narration or at least significantly reduce the amount of it.<br><br>7/10","user":"AlienByChoice","rank":[4,5]}]