[{"title":"In case you are not aware of it, this makes Phillip K. Dick officially one of the most influential storytellers in the last 50 years.","rating":10,"date":"10 June 2012","review":"In case you are not aware of it, this makes Phillip K. Dick officially one of the most influential storytellers in the last 50 years. His books have inspired such Sci Fi classics as Blade Runner, Total Recall, Minority Report, and now, the Adjustment Bureau. At least 19 films and television episodes have been created from his works.<br><br>The story is an interesting take on the notion there is a God in the universe who is carefully directing the actions and happenings on the planet. Here, of course, the element of 'faith' is removed and instead the Chairman makes plans and has the Adjustment Bureau to make sure the plans are kept on track. These 'agents' merely interfere when they need to, making suggestions that set actions in place. Theology is not in the plan, just a pattern to prevent mankind from becoming extinct by their own hand.<br><br>This is a different type of Sci Fi film, and it would take an actor with the flexibility of Matt Damon to play David Norris. His confident yet humble portrayal of the politician is riveting and interesting throughout. Emily Blunt portrays the blossoming ballerina with verve and appeal, sort of a cross between the focused artist and the determined woman who puts her career ahead of herself. Anthony Mackie and John Slattery work well as the adjustment agents sent to sidetrack Norris from reaching Elise.<br><br>Overall, the film moves well, offers some interesting twists, and allows us the interesting perspective of predestination without the burden of deity. Rated PG-13 for language, some sexuality, and a few brief scenes of violence, I personally can't think of a single scene that would be too intense for a ten year old. Collectible is a little early to say, but certainly a film you will want to see again.","user":"fredericksmith1952","rank":[46,55]},{"title":"Intelligence mixed with big-budget Hollywood action to form the new science fiction romance genre","rating":7,"date":"6 March 2011","review":"I'm starting to like this new genre of science fiction romance that \"The Adjustment Bureau\" falls into. Hollywood seems to have learned how to add a significant amount thought to their films, just with their usual dumbing-down procedures.<br><br>David (Matt Damon) has met Elise (Emily Blunt) and based on one spontaneous kiss and one flirtatious encounter, he's determined that she's the one he's supposed to be with. They have other plans. Oh yes, the indefinable, ambiguous pronoun \"they\". Just to keep a sense of the intrigue afloat, I'll define \"they\" as the men of \"The Adjustment Bureau\". What they want, we don't really know. But David wants the girl—a beautiful girl—but just a girl nonetheless.<br><br>For us, questions of free will, fate, soul mates, success and pre-defined destinies abound. All running around an intricate maze of New York architecture. Although intricate might not be the best word because there's nothing here for us to figure out; the film lays everything out well in advance, and over and over again in case you missed it. At least there's intelligence to the story but unfortunately no subtlety.<br><br>\"The Adjustment Bureau\" has pretty city-scapes and pretty people playing more profound characters than pretty people usually play. As with most genre-mixing films, there is something for everybody. I got the intelligence that is usually sorely missing from big-budget Hollywood action films although I could have done with a bit more respect.","user":"napierslogs","rank":[109,163]},{"title":"A well made and more thoughtful film that you might be expecting","rating":8,"date":"9 March 2011","review":"What if your own free will was nothing of the sort. Every move you made was in accordance with a master plan, any kinks or imperfections \"adjusted\" by persons unknown, constantly on hand to ensure you stayed on track.<br><br>Many people might assume that their lives are quite the reverse, with all the bad decisions they have made, anything resembling a master plan is unlikely.<br><br>David Norris (Matt Damon) is a rising New York Congressman with his heart set on becoming a young Senator, everything is going according to plan until he meets the beautiful quirky ballerina, Elise (Emily Blunt) in a mens restroom.<br><br>Elise inspires him in ways that he could not have imagined but any longer term relationship is not part of the plan the \"Men in Grey\" have mapped out. They do not like their careful plans messed with, ever. Although they do get to wear Trilby's, which not only look cool but are also a necessary tool for their profession.<br><br>The many scenes between Blunt and Damon are very believable and natural, real chemistry in action and is fun to watch. Blunt is a breath of fresh air in the congressman's driven life, living more in the moment than he possibly ever did before.<br><br>Just when you think the film will descend into a smorgasbord of special effects, the story goes into the opposite direction. A thoughtful and character driven piece about choices and the ripple effect each path taken, or not taken, has on your own and other peoples lives.<br><br>Terence Stamp, still with one of the best voices in the business, together with Anthony Mackie &amp; John Slattery, do good work as the agents attempting to get everything back on track.<br><br>There are some good lines and Damon can play an aspiring politician with ease, no doubt he could be one in real life if he chose to move in that direction.<br><br>The central question of defining who we are by the choices we make is explored and it is good to see another movie messing with our heads, if only just a little. If we have no free will are we still the people we thought we were, very deep but don't panic, the film does not get too caught up in this existentialism.<br><br>The action is limited, there are no cars exploding and the body count is non existent, a refreshing change from most modern films. A film that could have been made in the 50's from a story point of view, although actually based on a short story by Phillip K Dick of \"Do Androids dream of electric sheep\" fame, the inspiration for \"Blade Runner\".<br><br>Production values are good, although not of the highest flight. The costumes worn by the adjustment police are rather dodgy and look like guys with spare motorcycle helmets sprayed black. Not what you would expect in a big budget Hollywood movie, a small point but quite noticeable.<br><br>Similar to many films of this genre, the movie has to decide how to wrap everything up neatly. The final reel is perhaps a little disappointing but that depends on how you would want the film to end, somehow it feels that the easier option was taken.<br><br>Summary <br><br>A well made and more thoughtful film than you might be expecting.<br><br>Well acted with a believable romance, a light dusting of Sci-Fi and a great story. \"Inception\" lite perhaps, which is certainly recommendation enough for any film.<br><br>http://julesmoviereviews.blogspot.com/","user":"julian-mumford","rank":[95,141]}]