[{"title":"A ludicrous pageant of ineptitude... a 'How-Not-To Guide' to martyrdom","rating":7,"date":"16 May 2010","review":"Like Charlie Chaplin's Hitler, Chris Morris' 'Four Lions' shows that no subject can escape comic scrutiny; humour always seems to find the ability to expose the ridiculous in otherwise appalling situations. This satirical black comedy vents its disgust at the pseudo-morality of suicide bombing, whilst managing to portray its terrorists with an affection that allows the audience an unexpected emotional attachment with these supposed figures of violence.<br><br>The film follows a terrorist cell of blundering, inept, and impossibly stupid would-be suicide bombers on their quest towards martyrdom – we follow them failing miserably in a Pakistan training camp, trying to run through sheep fields whilst carrying bags of explosives, attaching bombs to crows, all the time creating a chaotic 'blooper' reel of attempted martyrdom videos. These suicide bombers are not the feared assassins of popular imagination, but absurd and easily led dupes who encourage laughter and ridicule – and significantly, in the end, pity.<br><br>The comedy of 'Four Lions' lies in the power of its bathos: the film reduces the dreaded spectre of suicide bombing to a ludicrous pageant of ineptitude. It's a film with fast laughs and dim wit in abundance, an absurd 'How Not-To Guide' to martyrdom.<br><br>However, the audience cannot help but feel pity for the characters as their plot reaches its climax. There is a sad inevitability to the group's last moments together; despite the horror of what the bombers are planning, the audience has been lulled into sympathising with their situation. The sadness of the film comes with the audience's realisation that these characters are regular, likable, funny, naive people – they are not monsters in themselves, but made monstrous by their susceptibility to absurd, immoral teachings.<br><br>The lead character Omar's interactions with his wife and young son are painful in their twisted depiction of the ideal family unit. At one point Omar (played by Riz Ahmed) tells his son a bedtime story about 'Simba's Jihad'. It is a scene that is touching, funny and uncomfortable all at once, a reflection of our responses to the film as a whole.<br><br>'Four Lions' is provocative in its comic parody of an emotional subject, but there is never any sense that it wishes to be deliberately inflammatory. Instead, the story is told with warmth and sharp humour; it offers us a fine concoction of derision and sympathy, pulling at our affections whilst cutting the terrifying down to the clownish.<br><br>James Gill ------ Find more reviews, news and previews at www.singleadmission.co.uk","user":"jamesgill-1","rank":[152,180]},{"title":"both hilarious comedy and contemporary social commentary","rating":9,"date":"25 March 2010","review":"The film can be approached from two angles; as a comedy and as an important contemporary cultural text. As a comedy it succeeded beyond expectations. Part of the pleasure surely came from the spectacle of the event; a sold out screening with cast and crew present along with regional cultural references that resonated infectiously with many in the audience, but this can take nothing away from the many levels of comedy at work within this film. There were elements of overacted screwball comedy; there were underplayed facial expressions and reactions that added a wealth of character and personality to the comedy; further still, there were elaborately constructed situational set pieces. All these elements along with explosively dynamic dialogue that was well delivered combined to send the audience into tears of laughter.<br><br>In a separate issue to the comedy there was the cultural commentary, which is always going to draw attention when it is such a taboo subject as Jihad: a word that is often avoided at all costs. The film unapologetically offers a plethora of questions around motivation, meaning and justification which it never falls into the trap of giving patronizing, melodramatic answers to nor does it preach any solutions.<br><br>The many characters were all utilised to give different points of views and different perspectives; the main protagonist Omar (Riz Ahmed) was fully fleshed out, with the other characters used to offer differing ideas and obviously the above mentioned comic relief. Omar's brother for instance had such a minor part but raises questions around what he considers a true following of Islam, which he promotes as peaceful, but is then exposed as intrinsically sexist due to the way he practically locks his wife in a cupboard. That being said, Islam itself was to a large extent sidelined and the film much more overtly dealt with identification and senses of belonging for a demographic that has partial but not complete grips on the many angles of where its identity is created; this includes Barry (Nigel Lindsay), the Caucasian convert amongst the group.<br><br>Four Lions is easily funny enough to reach a very wide audience, where viewers will be left without answers and therefore forced to discuss these issues, which are too often brushed under the proverbial rug.<br><br>twitter - @destroyapathy","user":"destroy-apathy","rank":[175,210]},{"title":"Expected laughs < Actual laughs","rating":3,"date":"3 September 2010","review":"I'm no easy viewer and too often do I find myself being bored while watching a movie, or just barely interested.<br><br>I wasn't expecting much from this one and after a quick reading of the synopsis, I just thought \"say whaat ?\". As a reminder you might check again the IMDb summary and try to picture it seriously, you would expect some \"sofa talking action\" - as a friend would describe movies that have more dialogs than action scenes.<br><br>Long story short : that is, without any doubts, the most stupidly funny movie I've seen this year and if you haven't seen it already ... just go (Ok to be honest, I would also put Revenge of the Fallen even if its last year, the level of stupidity is clearly enough for a couple of years).<br><br>Whatever you are looking in a movie this one will deliver, it is filled with dumb-touching characters despite their \"mission\" as terrorists. The acting is not only great as a comedy but just strait out great, any one in the movie have something special and memorable.<br><br>Hell, you could even try to get a social commentary out of it but that'd be a long stretch, it's meant to be a comedy with a soul not just the usual \"a few scenes funny and forget me next week\" kind of movie.<br><br>I was really pleased to find this gem completely by chance and hope you will too as this is how comedy films are meant to be.","user":"bladou","rank":[83,101]}]