[{"title":"Arthur was a good movie, coming from someone who hasn't seen the original","rating":8,"date":"10 April 2011","review":"Let me start this off by saying that I have never seen the original Arthur. There is also no sense in me going over the plot or the differences between this and the original because that is covered in so many different reviews and I am guessing this isn't the only review that you will read. I am 29 years old and I wouldn't even consider myself a Russell Brand fan but after seeing this movie that is starting to change. <br><br>I went into Arthur with an open mind. I did not have another movie to compare it to, since I didn't see the original, and I throughly enjoyed the movie. Russell Brand was OK in 'Forgetting Sarah Marshall' and I really didn't enjoy his movie \"Get Him to the Greek\" but Arthur was a different type of comedy compared to his typical work. The best thing I can compare this movie to is \"The Wedding Singer\". Not because of the plot or the actors but because \"The Wedding Singer\" put Adam Sandler in a slightly toned down more caring/romantic version of things had done before. There was less slap stick and I actually ended up liking Adam Sandler more because of it. The same can be said about Arthur. This isn't OVER THE TOP Russell Brand like most of his other movies. I wouldn't say it's 'down to earth' Russell Brand either, more like some place in between.<br><br>Even if you have seen the original try to go to see this movie and not compare it to the original. It's the same as The Dark Knight vs Batman with Michael Keaton. Both were good movies but you couldn't really compare them. <br><br>What surprised me at the end of the movie was my brother (32 years old) saying he actually liked this better than the original, which he watched last weekend. He said the one liners were better and Russell Brand made a more convincing drunk. My guess is because Russell is probably always this drunk when he isn't filming movies!<br><br>Arthur made me laugh out loud, which is something I typically don't do. The story was decent (typical romantic comedy) and even though the movie slowed down about 3/4 of the way in, it had to because of the story. Do yourself a favor and see this movie at some point. It doesn't have to be in the theater since there aren't any eye popping sound effects or state of the art 3D in it...(though the city of New York was a GORGEOUS back drop)<br><br>Go see it. Turn your brain off for a bit and enjoy the movie for what it is. Don't compare it to the original but compare it to the other things Russell has done and you will see that he might actually have a great future at comedy ahead of him. <br><br>Final Verdict: 8 out of 10","user":"rob-a-mcclellan","rank":[110,181]},{"title":"Take Arthur for 2011 not 1981","rating":5,"date":"12 April 2011","review":"The original Arthur, was and is a great film. It was funny, well written and well acted. It garnered 4 Oscar nominations and 2 wins. It won 4 out of 5 Golden Globes. John Gielgud so deserved his award so well that year. Dudley Moore, in the title character, had the same lovable charm that Russel Brand has in this remake. But, there are several things missing which make the 2011 version an OK film, and not a part of cinema awards. First, its 2011 and not 1981. The original version would never be made today. Plain and simple. Arthur was a drunk. A hard drinker, who fell down, slurred words,and yes, even was driving drunk in several scenes. No way would that get approved today, or anyone think it was funny. It was this funny drunk that made Dudley's Arthur so much fun, even though today we would rush for interventions or rehab. Second, the director forgot this is a New York film. It is set in New York, but so much changed from one film to the other that the setting was indifferent here. No more neighborhood bars, dinners, landmark shopping sites, or eateries. There is one really good scene involving Grand Central, but it does not make up for the lack in the rest of the film. Linda becomes Naomi in the new film. She is not a New Yorker. Does not look like one, or act like one. She plays the part well, but its just not the same. Again, this remake could be set anywhere. Can you imagine the original anywhere but NY! Third, as good as Helen Mirrim is, she is not the Hobson that John Gielgud presented. She will not get any awards for this presentation. So, if you do not make any comparisons, you will like the film, but most likely not fall in love with it for 30 years. The film is well acted, written in parts, but it steals one lines too much from the original, that just seemed forced here or are not well placed. Whereas we see Arthur drink, he never really seems drunk. The relationship with Hobson is presented as a mother/son, rather than father/son. It was hard to believe in the relationship as much as the previous film. The chemistry between Arthur and Naomi was believable and flow very well throughout the film. Susan Johnson, played by Jennifer Garner had much more of a role here than the original. It needed to be reverted back. It was just not funny. Lastly, Nick Nolte was just plain horrible and nasty. He could have been written out completely. It made no sense for plot development. So, the new Arthur is as an OK remake, but not as good as it could have been.","user":"jburton395","rank":[60,101]},{"title":"Haters gonna Hate","rating":8,"date":"10 April 2011","review":"I thought this film was simply brilliant. The acting in it was great, the comedic timing perfect, the script well written, and the setting well shown. Yes, once again it is a movie set in New York, but there's a reason why they can't having them there. It's an amazing city. And this movie showcases that very well. I appreciated the range of humor they had in there as well. Some of it was raunchy, and then at other times it was mild and a relief from some of the over the top jokes. The climax was well done, humorous yet tasteful at the same time, and the conclusion was very appropriate. <br><br>I heard some people complaining about how this movie was showcasing how rich people have it made and it wouldn't be received well today because of the economic climate. That was ridiculous. If anything, it shows how money really can't buy happiness, and that the most important thing in this world is that we have each other. Overall, very enjoyable film that one should go into with an open mind and just have a good time.","user":"SpartanIII","rank":[108,193]}]