[{"title":"Very amusing zombie comedy with just some minor issues","rating":8,"date":"1 September 2012","review":"The trailer for this movie actually represents what you get very, very well. Quite a bit of gore and funny moments. In fact, I thought that I would find it less funny than I did. There is some really witty writing here.<br><br>However, what already bothered me in the trailer really did not sit well with me in the movie too. Namely when the writing goes from witty to dim-witted. Mostly because of those one-liners. Although even some of the serious dialog seems just too unnatural and clichéd.<br><br>Also, for my taste, there is a little bit too much cutting to a certain location where people are stuck. There is nothing going on aside from some of the pretty awful dialog I just referred to.<br><br>A minor complaint, since there is still plenty of gory action going on, would be that there are some scenes in which gore spatters from off-screen where I would have preferred to see the action on-screen.<br><br>In the end, it is about a fun, gory ride and \"Cockneys vs Zombies\" sure delivers when it comes to that. However, productions such as \"Tucker and Dale vs Evil\" or \"Shaun of the Dead\" have demonstrated that one doesn't have to rely on formulaic dialog and one-liners so heavily in order to create a fun splatter film that is actually fun.","user":"5h4d0w","rank":[43,64]},{"title":"Clue is in the title","rating":7,"date":"19 September 2012","review":"I guess that's the best described movie title since Snakes on a plane. The movie delivers fully on its title and that's all you can expect from it, isn't it? A year ago Frightfest audiences were treated to a glimpse of some footage from the film. August 2012 the same audience (or whoever came again) got to see the whole film. And I'd say it played pretty well with most people.<br><br>I liked it too. The humor is good, you get Cockney language thrown in a couple of times and one the slowest chases you'll see in any film. And it works really good tension-wise. Mr. Ford of course is a delight to watch and he must have had a lot of fun on the set. You can't and shouldn't take a movie like that serious. Otherwise you'd have trouble enjoying this","user":"kosmasp","rank":[34,50]},{"title":"Great English Zombie Flick.","rating":8,"date":"21 October 2012","review":"First, it's a movie about zombies and it's English, so don't go in expecting some grandiose academy award winners. What we have is a film that is meant to be watched and enjoyed. It's purpose is to entertain us with zombies, gore, and the best type of dry Brit humor one can find. A job it accomplishes rather nicely.<br><br>It never takes itself seriously but doesn't go full on to cheeky parody mode either. I have to agree that like Shaun of the Dead or Tucker &amp; DAle Vs Evil, this one has successfully blended a great comedy with a good horror flick. though I'll warn it's more about the good gore one finds rather than scares.<br><br>By far the strongest actor would be Alan Ford who fills the character role of \"Grandad\" brilliantly as the cantankerous grandfather of the two leads and the caretaker of an old folks home. He has some of the best lines- most of which you simply don't expect or at least won't know what the heck is gonna be said next. right from the get go with opening credits you have the idea it's gonna be a fun, somewhat satirical ride and indeed it is. In all, the plot isn't that much of a stretch(it's zombies) but the actors and director make it work. it has a decent music score too. after viewing it may not be in some horror fan's top fav list, but it will certainly not disappoint. (also if you like crass British slang you'll like this movie)","user":"Ashman711711","rank":[42,64]}]