[{"title":"It may skip a couple of beats, but this is still a pretty great number.","rating":8,"date":"11 March 2014","review":"Typically, coming-of-age stories unfold in a predictable fashion: kid tentatively ventures into the world beyond the one he knows, where he encounters people and things that will change him and his outlook on life forever. It would be easy to dismiss Kill Your Darlings as yet another entry in a tired genre: the tale of a poet who finds his voice through a heady cocktail of sex, drugs and college. But John Krokidas' debut feature film, which takes as its subjects the American poets of the revolutionary Beat Generation, fits in so much more, as it explores a haunting search for life and legacy that teeters close to the edge of death.<br><br>Allen Ginsberg (Daniel Radcliffe) arrives at Columbia University keen to start a life away from the shadow of his famous dad, poet Louis Ginsberg (David Cross), and his mentally unstable mother (Jennifer Jason Leigh). He meets the electrifying Lucien Carr (Dane DeHaan), a rebel radiating so much charisma and ambition that it's easy to forget his lack of actual talent. Lucien brings together the aspiring artists who will soon come to change the literary world with their words: Allen, William S. Burroughs (Ben Foster) and Jack Kerouac (Jack Huston). As their lives intersect, their destinies intertwine, tangled up in the form of David Kammerer (Michael C. Hall), a man hopelessly caught in Lucien's enthralling spell.<br><br>Krokidas keeps this fascinating brew of hormones, hope and horror bubbling throughout, effectively nailing the champagne fizz of youth: a time when you could do ridiculous things, and remember them as romantic and revolutionary. Allen yearns, Jack drinks, William sucks nitrous oxide into his lungs in a bathtub, and Lucien keeps them all spinning. You don't have to know the Beat poets or their work to recognise the fire burning in these young men. Slicing and dicing pages of old classics, the boys make their manifesto quite literal: they will not rely on or succumb to tradition; their work will be conscribed by neither rhyme nor meter.<br><br>The most intriguing thing about Kill Your Darlings is that it refuses to romanticise this budding intellectual movement. The Beat poets may have become the idols of literary hipsters everywhere, but Krokidas takes care to tuck their ingenuity and creativity into the recognisable rhythms of everyday life. Desperate to hang onto Lucien's interest, Allen practically stumbles into his own talent. To create magic, he jerks off in front of his typewriter, or stupidly ties a noose around his neck to come a little closer to death. These young men, Krokidas seems to be saying, are treading a fine line between inspiration and tomfoolery. It's only when Allen recites a poem - on a moonlit night, on a stolen boat - that Lucien is comprehensively struck by his genius, as are we.<br><br>When the film spins into darker, more murderous territory, it moves from coming-of-age story to crime thriller - a genre shift that, oddly, works quite well within the universe established by Krokidas, as it allows Allen to contemplate the darker, less palatable side of Lucien's volatile personality. But it also becomes that much harder to separate the facts of these characters from Krokidas' fiction. David's tragic obsession with Lucien - one that the film suggests Allen could have shared - finally kicks off a tragic twist of events that unfold in a very particular way in Kill Your Darlings. Arguably, Allen ends up in an emotional place in the film that doesn't quite sit right with what actually transpired in real life, as told to us by a series of title cards just before the end credits.<br><br>Less controversial is the young cast, all of whom do first-rate work in disentangling the complex web of relationships that exists amongst these characters. Radcliffe is still a mite stiff as an actor, but this is his best on-screen performance yet: brave, bold, and proof that he's willing to challenge anyone's ideas of what he can do on screen. DeHaan is a firecracker as the capricious Lucien, burning so brightly that it's no wonder the other characters can't tear themselves away from him. Hall gets to sound a note of quiet desolation as David, whose infatuation isn't played simply as the unrequited lust of a madman. Only Elizabeth Olsen - as Jack's long-suffering girlfriend - is called upon to play a stereotype.<br><br>All in all, Kill Your Darlings marks an impressive debut for Krokidas. Shaken and stirred with a gloriously jazzy soundtrack and a colour palette that shifts from light to murky in a heartbeat, the film practically radiates tension both sexual and intellectual. It might have a little trouble with the facts of the matter, but, taken on its own merits, this is a smart, intoxicating look at how adolescent dreams must necessarily give way to the chilling bite of reality.","user":"shawneofthedead","rank":[51,62]},{"title":"Unsteady Beat","rating":4,"date":"20 November 2013","review":"College professor David Kammerer was the buzzkill/albatross of the Beat Generation, that small group of bohemian writers who, during the 1940's, began what would change literature while incipiently shaping the pivotal hippie era and, well, the rest is history <br><br>Kammerer's adoration for young pretty boy Lucien Carr, and the murder that resulted, is covered in several Jack Kerouac novels including VANITY OF DOLUOZ, DESOLATION ANGELS and even his first venture, TOWN AND THE CITY <br><br>But the main character is poet Allen Ginsberg, equal to Jack in the Beat template along with the strange, mythical William Burroughs Young HARRY POTTER icon Daniel Radcliffe plays Ginsberg with the kind of sympathetic pathos begging for a transformation: in this case, drug-use leading to writing leading to homosexuality But we're skipping ahead <br><br>When Allen first escapes his crazy mother and becomes a Columbia University freshman, he's somewhat of an empty canvas Enter Dane DeHaan as Lucian Carr, an elfin, blond-haired/blue-eyed contemplating beatnik before there was such a thing Despite being the poster child for cerebral pretentiousness, Carr becomes an instigative mentor to Ginsberg <br><br>The more interesting scenes have the duo clashing with the uptight status quo while discovering drugs, jazz and planning a foundational \"New Vision\" to put the older poets (ala Ogden Nash) to rest And, like the sound of an orchestra tuning, there's only an eerie squeezebox of intention sans the necessary talent to progress their (at that point) lofty ideals <br><br>Legendary author Jack Kerouac, whose ON THE ROAD – along with Ginsberg's epic poem HOWL – ignited the Beat Generation, is a third-fiddle womanizer and the least important here Meanwhile, a lanky Burroughs mumbles through experimental drug trips and the character that should have been more prominent is Kammerer himself, the bearded college professor played by DEXTER star Michael C. Hall With only a sporadic dash of scenes, mostly involving Kammerer desperately hounding Lucien while a peripheral friendship/romance with Ginsberg blossoms, he serves more as a distraction than an essential catalyst... treated like a special guest star throughout.<br><br>What's ironic is the Kammerer/Carr case slowed down the spontaneity of the Kerouac novels, and amounts to little here The real purpose of KILL YOUR DARLINGS is Carr's hypocrisy countered by Ginsberg's realization as a homosexual morphing into a significant generational spokesman And in that, Radcliffe's edgy demeanor exceeds a visually pleasing but ultimately monotone story, rushing through what's really important: the collaborating genius between the three primary Beats<br><br>Instead we're left with a cinematic version of Ginsberg and Carr's grandiloquent NEW VISION A potential spark without any real burn.","user":"cultfilmfreaksdotcom","rank":[38,49]},{"title":"Absolutely amazing.","rating":10,"date":"19 July 2013","review":"I had the opportunity to see this movie at the Sundance film festival this year. Absolutely amazing. John Krokidas is a visionary. This is proof that there is an acting life for Daniel Radcliffe after Harry Potter. It is a thrilling and provocative must see. The film flows beautifully and keeps you entranced. This film pushes the limits to new depths that the industry is in desperate need of. I left the film feeling like my mind had been opened to a whole new level. I will watch this movie again and again. But keep in mind it is not for the faint of heart, it is very intense. If you want passion, betrayal, sex, drugs and as rock and roll as the 40's can get, this is your movie.","user":"jhinrichs2002","rank":[134,189]}]