[{"title":"Rated on pure entertainment factor","rating":8,"date":"5 February 2016","review":"This movie is so fun and so campy. Is it winning any awards?...no. But the acting is good. It's got a great cast and they do a really good job. I was very pleasantly surprised with Pride and Prejudice and Zombies.<br><br>It's a romance. It's horror. It's comedy.<br><br>Go for the fun of it and don't take it seriously. This is not a classic Victorian novel and this is not a true tale of zombies like most die hard zombie fans think of them (ie. The Walking Dead or the more classic Night of the Living Dead). I am a true zombie lover. I loved \"28 Days Later\", \"The Walking Dead\", \"Zombieland\", etc. This is not one of those, so if you don't expect to see that when you go to this movie, I think you will enjoy it.","user":"razzel","rank":[193,219]},{"title":"Enormously Funny And Surprisingly Touching","rating":8,"date":"5 February 2016","review":"I know most people who love PRIDE AND PREJUDICE by Jane Austen are furious about this movie even existing, let alone being successful. But I actually liked it a lot!<br><br>I know the original classic fairly well (I'm a former high school English teacher and a current college librarian) and I was astonished almost from the very beginning at how much of the dialogue comes direct from Jane Austen's novel. All of the issues that really matter and the conflicts that draw the reader into the novel are still very much alive in the movie. It's just that they are juxtaposed against the horror of the walking dead. <br><br>I can't say enough about the good looking young (and not so young) cast members. I was absolutely blown away by how seriously Lily James and Sam Riley took the relationship between Elizabeth and Mr. Darcy. Both of them are so skilled at projecting courage and integrity combined with deep feelings and hidden pain. They never seem silly even when they're doing very silly things, i.e. cutting each others' clothes to bits in a sword fight. Bella Heathcote and Douglas Booth as Jane Bennett and Mr. Bingley are almost as good, and I have to say, visually they are absolutely perfect as the characters from Jane Austen's novel. And the supporting players are absolutely outstanding! You just cannot go wrong with Charles Dance as Mr. Bennett. His performance is exactly what you would hope for in a serious adaptation. Though that's true of every actor in the cast, really. Lena Headey is an exquisite Lady Catherine DeBurgh, though her character is ultimately just a little more sympathetic towards Elizabeth than she is in the novel. Even Jack Huston, who has been a hero of mine ever since his epic role as disfigured World War One veteran Richard Harrow in BOARDWALK EMPIRE, is an effective villain as Mr. Wickham. Best of all is Matt Smith, who takes the thankless role of the hateful Mr. Collins and turns it into an irresistible Peter Sellers style comic explosion. He's that good. <br><br>Let's face it, a Jane Austen zombie movie is not for everyone. But if you're willing to be open minded and you enjoy great acting, comedy and romance, this just might be for you. The sword fights are exciting, the love scenes (including the arguments) are authentically romantic, and the blood and guts are never really that gross. Oh, and if you do go and see the movie, make sure to stay through the closing credits, because the last joke of the film is really the best!","user":"Dan1863Sickles","rank":[213,254]},{"title":"A very unexpected and entertaining movie.","rating":9,"date":"20 March 2016","review":"Genreally, I like zombie movies a lot because of their post- apocalyptic vibe.<br><br>Normally though, I find the genre comes in 2 distinct flavours; serious stuff like \"28 Days/Weeks Later\" or campy B flavoured offerings like \"The Scouts Guide To The Apocalypse\".<br><br>This movie however defies the genre. The closest comparisons I could make would be \"Abraham Lincoln: Vampire Hunter\" or \"Penny Dreadful\" but with more humour. It follows the story of Pride and Prejudice so closely I kept looking for Keira Knightly to appear.<br><br>The production quality however is what surprised me the most; it's incredibly high with great sets, realistic costumes, lighting and cinematography. There was a lot of attention to detail.<br><br>This is a very unique and interesting mash-up which I quite enjoyed. I am surprised it's not rated higher on IMDb but I believe it deserves a watch regardless.","user":"Phazed-101","rank":[91,106]}]