[{"title":"Watchable! 5/10","rating":5,"date":"9 November 2014","review":"Review: I'm surprised that this movie wasn't bigger than it was because it's quite an epic movie with some fairly big names in the cast. I did find the leading character a bit annoying, but Michael Sheen was a joy to watch. The storyline wasn't bad either. Basically it's about young boy whose looking for his kidnapped brother whilst on a quest to find a magical box which can turn anything into gold. With the help of Michael Sheen, he ends up working in a hotel which is were all the clues lead, to find his brother and the box. It's not exactly Indianna Jones, but it's a mysterious tale which leads the audience down many different avenues after following the many clues. I think that the director wasted a lot of time on trivial matters in the middle of the movie, but the showdown at the end was half decent and it looked very glossy. Personally I thought that the movie was OK and I'm surprised that it made such a lose at the box office. Average!<br><br>Round-Up: I think this movie would have been much better if Michael Sheen and Sam Neill had more scenes and if there was an actor with more screen charisma, playing the lead. The director left the storyline open for a sequel, but judging by the lose at the box office, I doubt that we will be seeing one anytime soon, which is a shame because the concept wasn't that bad. All the clues did seem to drop on the main characters lap with ease, but he did have the help of his new found friend, who he falls in love with, and the great Sheen who helped his partner in many sticky situations. In all, I honestly think that people would enjoy this film if they gave it a chance, but you do have to be in the right frame of mind to watch it.<br><br>Budget: $25million Worldwide Gross: $14,000 (Terrible!)<br><br>I recommend this movie to people who are into there mysterious, magical movies about a quest to find a magical box which can turn anything into gold. 5/10","user":"leonblackwood","rank":[15,16]},{"title":"Strong start, but loses focus and ends with a thud","rating":3,"date":"9 January 2014","review":"When this film began I was exhilarated. Not knowing anything about the film prior to screening, the cast is the first thing to impress. Visually, it is handsomely mounted. I anticipated another classic adventure favorite unfolding before me.<br><br>Unfortunately the film becomes laden with details and loose threads as it moves along, and fails to gain steam or provide answers. There are side stories that are intriguing when introduced, but never pursued. Then there are \"discoveries\" which are made much too easily, one wonders why nobody made them before.<br><br>Aneurin Barnard who plays Mariah, the older brother in the family, appeared to be the next heartthrob-in-the-making; handsome, talented, appealing. But it isn't to be as I doubt many people will rush to this film. Michael Sheen is splendid as he hams his way through this film, but he is unmatched by any other players, mostly due to the troubled screenplay with which they contend. Sam Neill is wasted in a role of broad villainous strokes that are tired and worn out.<br><br>Other characters appear and then aren't heard from again, supposedly until the sequel. By the time this film ends, there isn't a coherent TEAM of triumphant adventurers over a defeated foe, just kids who made it through a harrowing experience with the help of some grown-ups who are never strongly defined.<br><br>The film shifts abruptly from classic adventure to science fiction, which is such a bumpy transition, I was thrown off.","user":"cantake8","rank":[42,51]},{"title":"A young English man is pulled into an Indiana Jones type of adventure","rating":7,"date":"29 April 2014","review":"This is a good, entertaining, slightly-cheesy, mystery/action movie you can absolutely watch with your kids.<br><br>I honestly don't understand the low ratings. Note that it is \"Indiana Jones LIKE\" in nature, but Indiana Jones it is not. It is not meant to be and it is not meant to be taken too seriously.<br><br>What it is, is:<br><br>1:Fun 2:Clean 3:Well acted (for the most part. I suspect some characters were meant to be cheesy) 4:well filmed.<br><br>I enjoyed it. I feel it's completely safe to watch with young children, and that is a rare thing. I recommend you give this movie a chance, ESPECIALLY if you're a parent looking for something you can watch with your kids that YOU can enjoy at the same time...","user":"dr-t-tolentino","rank":[25,29]}]