[{"title":"The most awe inspiring documentary of it's kind .... ever!","rating":10,"date":"14 April 2009","review":"Anyone who watches this documentary and does not walk away feeling absolutely humbled or at the very least - completely blown away needs to re-evaluate their mind. This is just such a piece of work. I have seen countless documentaries on astronomy, astrophysics, cosmology etc. but nothing has even come close to delivering the idea that we live in a most amazing universe like this movie does. It also does so in a most unpatronising way - treating the viewer with mucho intelligence. Hey - this is not a review - just a comment that I had to make after watching this. I will look forward to watching this again and again. One should never tire of experiencing anything like this. Watch it - experience it - enjoy it and most of all - learn from it!! - J.R. Ortiz, England","user":"heavenlymedia","rank":[98,107]},{"title":"A Mind-Blowing, Soul-Expanding Trip Through the Known and Unknown","rating":10,"date":"27 May 2009","review":"My wife and I watched this astounding documentary last night. We both sat there with our mouths literally agape as this astonishing film pulled us into a journey from earth, through our solar system, our Galaxy, galaxies beyond our own, and all the way back to the beginning of time. As another reviewer commented, the tone is not from the point of view of \"I'm a brilliant scientist and I know a lot more than you.\" You are guided along instead as if you were a tourist on a tour bus through the heavens. Before the film was over, I had achieved an epiphany. This to me was more than a film...it changed my life. It is beautiful, poetical, and it will shock you with its unadorned majesty.","user":"jjjppplll","rank":[61,70]},{"title":"Excellent all the way through!","rating":10,"date":"24 May 2010","review":"Walking into this title I was uncertain due to it's completely CGI approach to rendering the various celestial bodies that inhabit our universe. What I found was the animation and story telling absolutely wonderful. Alec Baldwin was good here with his subtle low voice adding a perfect match as we travel through the heavens.<br><br>Bearing in mind I have my own views and ideas on origins, this film was still hands down an excellent production. The detailed descriptions of the various planets, stars, nebula, and black holes were all there. The best part about it is that they took you to those places-close up, in the comfort of your living room.<br><br>I'm a big fan of shows like \"The Universe\" and other various science documentaries and I found this to be top notch. Sit back, grab a snack and a cold one and enjoy this fine flick. 5 out of 5 stars and an IMDb 10.","user":"riedud","rank":[27,35]}]