[{"title":"I am one of the only ones on earth that loves this sequel?","rating":9,"date":"31 October 2019","review":"Wildly disturbing and absurdly bizarre! I appreciate enjoying something that not many others do, it makes me proud to be different. Awesome how Rob Zombie didn't want his vision ruined so he took the honor of directing rather than anyone else. I love how gross and nightmare fueled this Halloween II is! Scout Taylor Thompson really did incredible even if not many others did she deserves credit and so does Tyler Mane! I also understand the hate this gets, sure it has many flaws, but come on does every horror have to be perfect, no way and this is great for down times like at night. Lastly I love the soundtrack!!","user":"UniqueParticle","rank":[19,22]},{"title":"Dear Lord....","rating":1,"date":"30 August 2009","review":"I was an extra in this movie, and even on the set I knew it was going to be a disaster....what I was unprepared for was the level of disaster that they took it to.<br><br>I have no problem with language or violence, but I do have a problem with it when there is no good reason. The script sounds like it was written by a middle schooler (honestly, who uses THAT many F bombs in regular conversation?). And the violence, while somewhat expected, went WAY over the top as far as simply telling the story. On the plus side, whoever did the makeup effects for this movie has one heck of a demo reel to show off now.<br><br>I'll agree that casting Maclolm McDowell as Dr. Loomis was a good move...it would have been even better if they had made him even remotely likable. Same goes for virtually any of the characters in H2.<br><br>Oh, memo to those who griped about Michael grunting....he grunted in Carpenter's original as well...just check out the scene where he strangles Lynda, or when he's breaking into the closet, or choking Laurie.<br><br>And of course they had to go the whole \"oh-my-God-she's-his-SISTER!\" route, which was stupid in the first HALLOWEEN 2 and is even more so this time around. John Carpenter came up with the idea in 1981 and even he admits it was a dumb one. Michael Myers is far more terrifying as simply the \"boogeyman\".....anybody could be his victim, nobody is safe. With this lame subplot, as long as you aren't related to him or between him and a relative, you're safe! Maybe it's nostalgia for the \"good old days\", but I think I'll avoid any of Mr. Zombie's future HALLOWEEN efforts and simply stick with Carpenter's classic....the unequaled original.....","user":"madness30043","rank":[186,289]},{"title":"Halloween II was a total waste of time and money!","rating":1,"date":"28 August 2009","review":"First off, I am a fan of Rob Zombie's \"The Devil's Rejects\" and \"House Of A 1000 Corpses.\" Also, I liked Rob Zombie's first Halloween. It wasn't great, but it was decent. I was looking forward to having a lot of fun watching this sequel; only to be set up for extreme disappointment. The movie lacked suspense. Also, for some reason, Rob must have thought that to be extremely loud is to be scary. Wrong! Also, Laurie Strode a/k/a Angel Myers was so whiny and unstable, I couldn't wait for her to be killed, which, sad to say, never happened. Every character was just a cookie cut-out waiting to be killed. There were many of the actors in which you didn't even get a good look at their faces before they were killed. The movie was disjointed and extremely loud and gory. I love gory, but this was a bit over the top. Michael Myers was popping up everywhere. It was too much like a Wile E. Coyote cartoon. Oh, I guess Sheri Moon Zombie wanted a bigger role. Wow! What a big mistake! She cannot act. And she was annoying. Also, Sam Loomis's character was only there to be killed off. Believe me, by the end of the movie, you'll be cheering for his death. I also didn't like the fact that the movie veered so much into her nightmares that most times you didn't know if it was real or just a nightmare; or was Michael Myers like Freddy Krueger and he could be anywhere. All of the characters were white trash and severely stupid. I never thought a movie could be so violent and gory yet be so dreadful and boring at the same time. As I was watching the movie, I kept thinking about the original Halloween 2. It was a much better movie. Also, Rob Zombie should know better! Introduce the characters and let us get to know them before you go and kill them. In this movie, Michael Myers went on a happy and silly killing spree, popping up everywhere at the same time, with such silly and extremely loud stabbing sounds! Rob, do you know what overkill is? Do you actually know how to write a decent screenplay without excessive \"F\" words? And can you write a movie without having to put your wife in it? It's not enough to have style, Rob, you also need to have some substance in there. Halloween 2 (2009) was just a stylish piece of crap.","user":"ethaskins","rank":[114,184]}]