[{"title":"Kross is a star, one of the year's best films","rating":10,"date":"24 September 2009","review":"I attended the North American Premiere of \"Same Same But Different\" at the 2009 Toronto International Film Festival. Directed by Detlev Buck from a Ruth Toma script, this is a classic tale of star-crossed lovers featuring young David Kross and Apinya Sakuljaroensuk as Ben and Sreykeo, a German boy and Cambodian girl brought together by chance and destined to be together. Most won't recognize the name but will remember Kross' performance as Kate Winslet's young lover in the award-winning \"The Reader.\" An epic sweeping love story spanning two continents, \"Same Same But Different\" is \"Romeo and Juliet\" meets \"Dr. Zhivago\" meets \"Pretty Woman.\" Kross carries this film from opening to closing credits. Just as he startled the world in \"The Reader,\" the now 19-year-old enters leading man status here. \"Same Same But Different\" is a must-see for lovers of romance (and who doesn't), made all the more touching because it's based on a true story. The film is visually stunning with breathtaking cinematography, costume design, and art direction all beyond compare. This is definitely one of the best films of the year.","user":"larry-411","rank":[30,42]},{"title":"A star is born, and she's from Thailand","rating":8,"date":"28 November 2010","review":"Sometimes one is undecided on whether to watch a film in the cinema and waits for the DVD to come out - only to discover that one has ruined one's experience for oneself, because the film in question cannot really be appreciated on a small screen. This is very much the case with the German, but almost entirely English-spoken 'Same same but different': it's the first German film in a long time that makes abundant use of cinematography instead of television aesthetics (not counting Tom Tykwer's recent international oeuvre). Upon its premiere in Locarno last year, it received an award by Variety for its international potential - well deserved, indeed. But apparently it failed to strike a cord in most viewers nevertheless, probably because the story sounds more depressing than romantic.<br><br>Well, it isn't really: it's very much a love story. One reason why I initially bypassed it was director Detlev Buck's previous record of light-weight comedies of limited entertainment value, but here, he somewhat returns to his early-90s beginnings, the films he built his reputation on: 'Karniggels' (1990) and 'Wir können auch anders' (1993). In these little marvels, Buck managed to convey character depth by small gestures, which made you forget the budget constraints these productions had. With his success, he would later abandon this laconic narrative style in search of big screen liability, which was very unfortunate for his early fans. 'Same same but different' reveals Buck as one of the few real professionals German cinema has, because he combines this big production with the simplicity of his auteur days.<br><br>That effort would be in vain if he wouldn't have the cast to support him, and that's where this film becomes really interesting to me. Much has been said about the freshness of David Kross, who has been fortunate to land a lead in a big-budget production at very young age ('The Reader'), and therefore manages to bring a genuine sense of guilelessness into his acting. But given that he has been portraying (so far) average characters thrown into extraordinary situations, I believe that his roles cannot be taken for a proof of talent, as he's just interpreting things in a way most people would. The few moments when 'Same same but different' feels awkward arise when his character Ben is forced into individual actions he's unwilling to take - most of the time, he just allows everything to happen, and it is this passivity that fits Kross more than anything else.<br><br>The real star of the film - and the reason why I seriously regret not having watched this in the cinema - is Apinya Sakuljaroensuk. It was essentially her minimalistic performance in Pen-ek Ratanaruang's Ploy which made that film one of my favorites of 2008. There's something absolutely commanding about her from the very first moment she appears on screen, something that forces you to gaze at her as intensely as she does, a beatific, ephemeral shroud of what I would in lack of better terms call beauty from the inside. If the comparison is not too bold: I had an equal sense of awe at an actress only when I watched 'Roman Holiday' for the first time. Yes, I'm talking about Audrey Hepburn, believe it or not. I'm rather curious as to what future may hold for this barely 20-year-old, who handles the complexities of her part so well - a young woman balancing love and calculation, dream and reality in precarious, yet purposeful ways.<br><br>In short: a surprisingly deep tale of love against all odds, not as depressing as some of you may think, and lacking only in a supporting cast to make the story as believable as it actually - being based on a true story - is.","user":"Radu_A","rank":[14,18]},{"title":"must see it","rating":1,"date":"1 November 2014","review":"a special mixture. romance and cultural differences, great performance and touching atmosphere, force of detail, a true story, inspired music, remarkable script and David Cross in a role who transforms the promising role from the in a certitude. a film about love and frontiers. and, more, important, about feelings and right manner to discover the other. the sensitivity and delicacy, the borders between characters, the good way to use the old theme of stranger in new world, the remarkable job of David Cross and the precision of Apinya Sakuljaroensuk work are good motifs for see it. or, more exactly, for must see it. because it has the beauty and fragility of a real useful film for remind small fundamental things who defines the life.","user":"Vincentiu","rank":[5,7]}]