[{"title":"Beautiful, profound, moving","rating":10,"date":"10 October 2010","review":"Just ahead, I'll tell you how to know if you'll love or hate this movie (very few will be in between). But first, I'm always surprised to see people reading the novel, rushing to the movie, and then expressing disappointment with remarks such as, \"there are gaping holes.\" A 2-hour movie is a 110-page screenplay, which means a 300-page novel becomes a 6-hour miniseries. Get Martin Scorcese, hire \"Never Let Me Go\" novelist Kazuo Ishiguro to write the screenplay, and cast it right, and you'll have a shot at making a miniseries that CAN be compared to the novel; otherwise, let's understand the limitation and let the film stand on its own. I didn't read Ishiguro's novel, and I found Mark Romanek's film (screenplay by Alex Garland) to be a beautiful, profound and complete meditation on life. It demonstrates the best and worst of human behavior, the beauty of undying love, and the heroism of accepting responsibility (or fate in this case). To me, the story is uplifting and memorable, in spite of its overall sad and melancholy tone. What's more, it's seamless, from the superb performances by Carey Mulligan, Keira Knightley, and Andrew Garfield, to the near perfect direction by Romanek, to its gorgeous cinematography with muted color palette, to its precise wabi-sabi production design (the beauty of worn and broken things). But how can you know if you'll like this film or not?<br><br>Forget the Sci-Fi angle; it's insignificant except as a stepping-off point for a story that reveals great truths: That life is short, your choices have consequences, and at the end none of us may feel we've had enough time to love, or just get things right. But I can safely say... If you interpret your movies literally, you will not like this film. If you need action, a fast pace, explosions and special effects, you will not like this film. If your idea of a great movie is Inception, forget it. <br><br>On the other hand, if you can appreciate a fine story by Henry James, Edith Wharton, or Katherine Anne Porter, this film is made for you. If you enjoyed Todd Haynes' lovely melodrama, Far from Heaven, or Oren Moverman's powerful movie, The Messenger, or Tom Ford's poignant film, A Single Man, you'll love this picture. The story addresses themes of love, longing, jealousy, betrayal, courage, atonement, and perhaps most important \"acceptance.\" The film also asks us to consider the \"morality of science,\" and some might find this aspect chilling, but to me the larger human themes overwhelm this one. <br><br>When I saw Never Let Me Go, the theater was about one-third full, but probably one-third of these folks walked out by the half-way point. And, surprisingly, the couple sitting behind me got up and walked out 10 minutes before the end, once they were convinced (revealed by their groans) that the story would not have a happy ending. Apparently, they were looking for the \"feel good movie of the year.\" Sadly, they missed the most extraordinary and beautiful ending -- most of the emotional power comes in that last 10 minutes -- but then I suppose they wouldn't have understood it. But to me, Never Let Me Go is the \"feel good movie of the year,\" precisely because it tells the truth: life is beautiful because there are hopes and dreams, love and loss, tears and tragedies. <br><br>One final note: Keira Knightley and Andrew Garfield are excellent in their roles, but Carey Mulligan is the standout -- she shows a wisdom and weariness far beyond her years, and handles difficult emotional material with a sublime restraint that makes the whole thing work. I feel we are witnessing the early work of the next Deborah Kerr, Sarah Miles, or Vanessa Redgrave. <br><br>This is an excellent film, one of the best of the year, and not to be missed by those who appreciate depth and literary quality.","user":"dick-sanders","rank":[422,508]},{"title":"Excellent cinematic adaptation","rating":8,"date":"25 October 2010","review":"I just recently finished reading Never Let Me Go. I have very rarely been so intrigued by the subject matter of a book and at the same time so bored by its style. Never Let Me Go, the book, was deadly dull. Still, I was so intrigued, as I say, by the plight of these characters, that I was compelled to see how the book translated to the big screen. You might say I felt this novel and original storyline deserved a second chance.<br><br>All in all, I give the movie adaptation a thumbs up, with one big caveat: I think those who did not read the book first would be left scratching their heads. While the book was slow and plodding (and devoted MUCH too much detail to certain occurrences in the storyline), nevertheless it offered the opportunity for reflection on the subtleties of what was taking place. Given the pacing of a typical movie, if you blink, you might miss something momentous and I think that was the case with this movie, so it certainly helped to have read the book prior to seeing the film. The screenwriters did an excellent job of condensing the book, and I felt, after having read it, that condensing was precisely what this otherwise compelling and poignant story required.<br><br>Never Let Me Go was a lyrical and visually beautiful production. The accompanying musical score was appropriate to a sad and heartbreaking story. The acting was terrific - especially by Cary Mulligan whose sad eyes reveal the melancholy of her character, and Keira Knightly, especially in the hospital scene where she portrays a nearly depleted \"donor.\" I didn't care much for the male lead, but his one outbreak of emotion upon having his hopes of a \"deferral\" dashed was very significant. And the character of Miss Lucy comes across as more sympathetic in the movie than in the book.<br><br>My criterion for a good movie is this: If it stays with me once I hit the sidewalk in front of the theater, rather than evaporating like smoke, well, that's a good movie. Never Let Me Go has stayed with me. The ending left me with a feeling that although these fictionalized characters were little more than lab rats, we all, in a sense, share a similar fate. Life is short, loss hurts, live and love while you can. <br><br>It rarely happens that I enjoy a movie adaptation more than the book on which it was based, but I would have to say that was the case here. Bravo.","user":"lauralmhs","rank":[198,244]},{"title":"\"Never Let Me Go\" - Never Let Go of this film...","rating":10,"date":"5 March 2011","review":"\"Never Let Me Go\" is one of the most distressing and depressing films I've ever seen, so it's easy to imagine why this film, despite a wealth of positive reviews, failed at the American box office so badly last year. What people are missing, however, despite its grim subject matter (including one of the most upsetting, yet profoundly moving endings ever), is one of the most intelligent, thought-provoking, and well-acted films in recent memory.<br><br>Music video director Mark Romanek has had a somewhat easy transition into the way of feature filmmaking (he made his debut in 2002 with the creepy Robin Williams thriller \"One Hour Photo\"), and \"Never Let Me Go\" is easily the director's best work. Screenwriter Alex Garland adapted Kazuo Ishiguro's novel of the same name, and the plot centers on three life-long best friends who are also wrapped up in a love triangle. Kathy (Carey Mulligan) loves Tommy (Andrew Garfield), but Tommy is currently engaged in a loveless relationship with their mutual friend Ruth (Keira Knightley, in what is easily her best and in my opinion, most tolerable performance yet).<br><br>Their tangled love affair is set against the backdrop of a revisionist history beginning in 1978 and ending in 1995, when the three are young children being raised at a prestigious boarding school called Hailsham somewhere on the English countryside. Over the course of their growing up together, they gradually learn the horrifying truth about the school and the grim significance of what their lives really mean in this world, because, as they also discover, their predetermined lives on this Earth will be short and they have very little time to understand each other and what life and love really mean.<br><br>To really describe the plot any further will be a great disservice to the true-to-life performances of this film's three daring young leads and the filmmakers. \"Never Let Me Go\" is a daring combination of heartfelt drama, romance, and dystopic science fiction. The latter film genre serves only as a backdrop and never once does the picture descend into pointless action scenes and special effects as a means for its characters to try to escape their fates, or ultimately responsibilities to the rest of humankind. (In fact, \"Never Let Me Go\" actually has more in common with Rob Reiner's 1986 comedy-drama \"Stand by Be\" than anything written by Philip K. Dick.) No, although these three characters have accepted the inevitably of their incredibly short lives, they are still determined to enjoy what time they have left together and that is the whole point of this powerful and emotionally-driven film.<br><br>Anyone who dismisses this film because of the negative reviews (yes, there were a few) saying it's too bleak and depressing are selling themselves short. They'd also be missing one of the most powerfully acted and ultimately moving films I've ever seen. They'd also be missing one of the greatest films of 2010, that's for sure, and that's the real tragedy of \"Never Let Me Go\": that so many people ignored such an incredibly great and brilliant film about life, love, and humanity.<br><br>Never Let This Film Go.<br><br>10/10","user":"dee.reid","rank":[136,170]}]