[{"title":"Latifah does all she can, but the weak material and lack of sparkle really works against her","rating":30,"date":"30 December 2010","review":"Both Leslie Wright and cousin Morgan Alexander are big Nets fans; however while Leslie is a fan of the team, Morgan is more interested in landing herself a husband and becoming a NBA-wife. When Leslie chances upon a meeting at a gas station with loyal Nets point guard Scott McKnight, she gets an invite to his birthday party and of course Morgan springs into action. Morgan has the looks to capture her man but Leslie appears to have more in common with him. When Scott gets injured, Leslie is employed as live-in physiotherapist supporting his attempts to save his NBA career.<br><br>I didn't expect Just Wright to be a great film but I was happy to meet it on its own genre ground and play by its rules. The reason for this was my ongoing interest in Common's acting career; this is perhaps founded in bitterness since he has only done one album since he started focusing on the acting (and it was rubbish) – so I'm keen to see the projects that make the loss (IMO) of such a great artist worthwhile. Since he was the leading man here I thought perhaps this would be the one. The problems with it start immediately as the plot is overly messy, getting a lot of establishment done very quickly – meeting Scott, proposing to Morgan, getting injured, getting Leslie into the job; all work done just to get to the \"once they spend time together they find one another\" part of the film that we all know is coming. This rather serious and rapid stuff gives the first half of the film an overly earnest air that it doesn't warrant, can't carry and never escapes.<br><br>The second half of the film see the film become about the professional couple of Leslie and Scott and this focuses on them being together and finding a chemistry. It is obvious and a bit cheesy but it is what the whole film should have been like (and the film be only 90 minutes long as well). However this is not to say that this part is particularly good either – the main problem is that the material is not particularly inspired, nor is it particularly charming. It is this second quality that is missing most because this sort of film needs charm to make the formula work. Sadly the material doesn't produce it and the chemistry between the two leads is not all it should be.<br><br>This is not down to Latifah though, because she works her sparkle for every last drop – she literally gives 100% in every scene and it does show. Common, on the other hand, misjudges his material – partly because he has to deal with more of the \"earnest plotting\" in the first half. He carries his character too serious and too earnestly to get the mood right. He works \"OK\" with Latifah but the chemistry just doesn't work as well as it should and it is partly his fault. Patton looks good despite having a terrible character who is all about being a plot device in the weaker first half. Meanwhile the cast is packed with faces from black entertainment (Rashad, Grier) and lots of NBA players showing up – presumably to make the film more marketable thanks to their presence.<br><br>Just Wright does start to get a bit better in the second half when the messy and serious plot setting is done and Latifah's sheer work-rate starts to win the viewer over, but she cannot do it alone and indeed she doesn't. It is not an awful film but it should have been more formula focused, stayed closely to the genre and have delivered the material to match the effort put in by Latifah. Sadly this is another film that makes Universal Mind Control feel like an even worse album than it was.","user":"bob the moo","rank":[10,10]},{"title":"A VERY predictable but also a very charming story!","rating":6,"date":"10 October 2010","review":"Queen Latifah shows us everything she's got in Just Wright, a charming romantic comedy about finding true love right in front of you. Just Wright is about Leslie Wright, a physical therapist who is also a massive basketball fan and so, when she gets the opportunity to become Scott McKnight's physical therapist, she is over the moon. The only thing is, Leslie wants their relationship to be more than professional, however her cousin Morgan wants to be a wife to any basketball player and her eyes are on Scott. So as you would expect, Just Wright is yet another predictable and cliché romantic comedy, however this is different as this is actually very enjoyable. The greatest quality about the movie is the story. Even though it's predictable from the first sixty seconds of the movie and had many rom-com clichés, it doesn't spoil the movie because the story was just very charming and is one of those heart-warming stories that will make you smile all the time. This isn't one of your usual Zellwegger romantic comedies where a ditzy woman falls in love with her perfect guy who she clapped eyes on in the first minute and slapstick comedy ensues. This is about a professional relationship growing into friendship growing into something more without the use of the woman falling over every ten seconds or getting out her over-sized knickers to get laughs, which is another quality I loved about Just Wright. The comedy used in Just Wright is basically through charm, the lines that Queen Latifah and Common's characters use can make you giggle in some parts. The acting was good and was a massive strength of the movie and Queen Latifah and Common stand out from the entire cast with their marvellous performances as their characters. The chemistry between Queen Latifah and Comm0n was brilliant and very believable.<br><br>The characters were written well and they actually had personalities, which is a little unusual to see in romantic comedies considering that most rom-coms have one-dimensional personalities. Just Wright really should have sunk with the very predictable story and the romantic-comedy clichés but writer Michael Elliot and director Sanaa Hamri have made it work and have both done a great job on this movie, you can tell the attention has been put into it. The movie might be predictable but it works because of the charm and the likable leads. Queen Latifah and Common both have done a great job in playing their characters and adding charm to the movie. Some people may think Just Wright is another one of those movies that mixes predictable romantic-comedies with sport and while they might be right, the movie is much more than that. With charming performances and a good story along with it, this beats quite a few movies in its genre.<br><br>I don't have anything bad to say about Just Wright, it's one of those movies that's good to watch because of it's nice and charming story and characters. Also, another thing that I loved about Just Wright is the fact that the leads are different to the usual characters you see in romantic-comedy movies and shows that love comes in all shapes and sizes, which was a nice change to see. Overall, this is a good little movie to see and not take seriously. It's very predictable and you'll more than likely guess everything within the first minute of the movie but it's such a charming movie and the story is a good story to follow. If you like Queen Latifah as an actress, then you need to watch this as she gives out a very good performance. This is definitely different to the other romantic-comedies that you see today and it's a welcoming change. To those who plan on making romantic-comedy movies, take a leaf out of this movie's book as the film was what the movie title suggests.<br><br>Read more reviews at: www.dudedazzmoviereviews.wordpress.com","user":"dudedazzreviews","rank":[14,15]},{"title":"The cast tries hard, especially Latifah. Clearly they are defeated by a weak script","rating":5,"date":"5 January 2011","review":"(Credit IMDb) Leslie Wright is a straight-shooting physical therapist who gets the gig of a lifetime working with NBA All-Star Scott McKnight. All is going well until Leslie finds herself falling for Scott, forcing her to choose between the gig and the tug-of-war inside her heart. Oblivious to her romantic overtures, McKnight is instead drawn to the affections of Leslie's childhood friend Morgan, who has her sights set on being an NBA trophy wife. Is Leslie destined to play the role of \"best friend\" forever or will Scott finally see that what he always wanted is right in front of him?<br><br>I actually enjoyed bits and pieces of this movie, it was really starting off well, but it didn't take long to head into a downward spiral. I like the fact for once both love interests intentions are honorable and such, but it was all too predictable. For starters, it's possible yes, but am I really supposed to believe a big star like Scott McKnight (Common) could be that nice? It just felt a bit too dreamy to me, and while I think it would be lovely for today's world, I really don't see that happening. The performances aren't a question, in fact it's arguable that all of them were either above average or great, it's just the script is too phony and a bit too weak. The finale itself also reeks of clichés, and turns into your typical Romance ending.<br><br>The Acting. Queen Latifah is purely the heart of this film. She clearly put every ounce of effort she had in this movie, and it shows. Her performance is electrifying and full of energy and charisma, but the script just doesn't back all that up unfortunately. She is everything a Woman should be in this world, and she pulled it off with conviction and believability. Common himself is also pretty good, not as good as Latifah, but good. He's charmingly nice (Bit too nice if you ask me) and did as much as he could, while having competent and believable chemistry with Latifah. Paula Patton plays her deceiving, greedy role to a T, showing a little heart at the end. Pickens Jr. Rashad (Of Cosby fame) and Pam Grier do well as the respected parents. Dwight Howard, Dwayne Wade has amusing cameos.<br><br>Bottom line. I didn't mind this, and it kept me watching. But it could have been so much more, and it deserved more with all the effort the cast gave to it. Watch it just for Latifah, her performance is worth the price of admission.<br><br>5 ½ /10","user":"callanvass","rank":[17,19]}]