[{"title":"Off-Balance and Falling Flat","rating":7,"date":"29 November 2015","review":"\"Details\" reminds me of the type of movie that was popular in the mid-2000's: every character is just a bit off. Tobey Maguire plays a obstetrician, Jeff, who's addicted to porn; his wife is cheating on him; his neighbor sniffs basil; his female friend gets him high in her husband's vintage car then they proceed to have sex...you get the idea. It's one weird tangent after another. Jeff engenders little sympathy in viewers up through the scene where he tries to buy off the cuckolded husband, Frank (Ray Liotta), who puts in a powerful performance during their confrontation.<br><br>Maguire's character makes an attempt to change his ways at this point by donating a kidney to his sick buddy, Link (Haysbert). That leads to a second powerful scene(in the church), but not until after the healed buddy kills Jeff's \"unreasonable\" pregnant neighbor. Sounds complicated, I know.<br><br>The church scene gets cut off way too quickly, though, IMO (like a sudden fade-out during a killer guitar solo). The movie hurries back to safer ground with the final scenes playing out in domestic \"bliss.\" Jeff and his wife lay their secrets on the table and decide to stay together and not go to the authorities \"for the good of the children.\"<br><br>It's all so absurd. Wasn't there a police investigation? Surely, Jeff's name would come up in that he was the dead woman's next door neighbor and her obstetrician. Oh well. The movie tries to walk the tightrope between farce and drama. Apart from a couple of scenes with Liotta and Haysbert, it felt much closer to farce.","user":"jcbinok","rank":[6,6]},{"title":"Rambunctious... Horny... Raccoons...","rating":9,"date":"22 June 2012","review":"Tobey Maguire is a pitch perfect anti-hero in this bizarre, absurd, dark movie about love and raccoons. The movie plays like a demented fairy tale, replete with butterflies, rainbows and cross-bows. The audience I saw it with was in stitches. But this isn't really a comedy. I wouldn't even call it a black comedy. I'd say the movie is more of a magical absurd comedy, if that is even a genre. It plays like a fever dream, swinging wildly between realism and camp. I was surprised about 100 times during the watching of this film, and to tell much more about it would just spoil the fun of it for you. Suffice to say, you will not get what you're expecting. If you want something normal, this isn't it... I will warn that sometimes the movie makes your stomach turn, as you're forced to live in the shoes of a morally suspect character... but I think that was the point. There are no good or bad people in this movie. There are only morally gray people, who behave like raccoons... hungry, horny, needy and desperately seeking worms... I was lucky enough to see it in a recent festival screening. I think it will be really interesting to see how general audiences respond....","user":"bennyprofane","rank":[49,69]},{"title":"A series of events that could potentially really mess up one's life.","rating":6,"date":"30 April 2013","review":"The Details is a dark comedy with an incredible cast and good writing. What I really enjoyed was the fact that the filmmakers didn't seem to sugar coat anything and try to deceive you that a perfect family exists, and that people don't struggle with temptation and guilt on everyday basis. It's a greatly exaggerated story of an ordinary man with ordinary problems that get him into an extraordinary mess. Casting is incredible, and all actors deliver great performances. Unfortunately, none of the characters, with the exception of Tobey Maguire's Jeff Lang is truly developed, which could have made that film even better. Some of the scenes seem a little redundant, for example the boat scene at the beginning of the movie, but that doesn't really spoil the movie as a whole. All in all, it's an interesting piece of work. It will probably not inspire you or stay in your memory forever, but it will definitely make you think about your actions, and how quickly things in life can get ugly.","user":"greg-kostrzewa87","rank":[14,18]}]