[{"title":"Don't HOP too far.","rating":6,"date":"6 April 2011","review":"I am glad, finally a holiday comedy about Easter, and like Garfield and Scooby Doo, It mixes live action with CGI animation. Now I really liked the animation, the Easter Bunnys warehouse where they make candy for Easter is the most awesome thing since Willy Wonkas Chocolate Factory. Not to mention Hugh Laurie, Russell Brand, and Hank Azaria voice there characters perfectly, and provide much of the films humor.<br><br>Now the live action was not as funny, at times James Marsden slips by with a funny line. but other than that it's all pretty stale. Even David Hasselhoff making fun of himself, hasn't he done enough of that already. I know what they are trying to do, a Santa Clause, but with Easter. And they did alright, but they could have done a little better.","user":"DarkVulcan29","rank":[36,46]},{"title":"Good Easter Movie","rating":7,"date":"31 March 2018","review":"This is one of the only Easter films I know which is perfect for the holidays without being about Jesus. Such a cute little film which makes me laugh and I never get tired of. Perfect family Easter film.","user":"life-of-hapiness","rank":[11,13]},{"title":"A horribly tedious film","rating":4,"date":"21 April 2011","review":"This time, the phrase \"From the producers of Despicable Me\" did not sound like a warning, but as a recommendation, because I moderately enjoyed that movie. Unfortunately, Hop ended up being a horrible film which uses the most cloying and tiring routines from the family cinema. In a few words, I found the story to be boring, the humor to be excessively simple and trite, and the performances (with one exception) to be lacking of any life or energy. However, the solid animation and vivacious music might fool to some kids to make them believe they are having fun.<br><br>I previously mentioned that almost all the performances (also the voice ones) feel listless. The only actor who shows conviction in his role is James Marsden as the leading character. His best attribute in this movie is that he makes us to believe he is genuinely interacting with a rabbit which would not exist on the screen until months later, during the post-production. And I also liked the fact that he takes his character seriously; thinking about it better, I think that that is what makes the relationship between his character and the rabbit credible. Unfortunately, Marsden's competent work was not enough for saving this movie from being an absolute tedium.<br><br>And just in case the screenplay was not questionable enough, Hop forces its premise even more in order to justify the use of sporadic rock-and-roll songs, with the hope of looking \"cooler\". Besides, the excuse of the rabbit wanting to be a rock singer is simply a rehash of the old cliché \"son who refuses to follow his father's steps\". Anyway, I think that Hop is an atrocious movie which made me feel like genuinely wasting my time. In other words, avoid it at any cost.","user":"Argemaluco","rank":[25,35]}]