[{"title":"The film that truly proves what a visual medium film is","rating":7,"date":"20 January 2015","review":"I implore anybody that has seen this movie once, and not liked it, to watch it once more. This time, however, take into account that film is a visual medium. Instead of expecting a narrator or a character to easily explain to you what is happening try paying attention to what is happening. Examine and truly THINK about what is expressed visually. The brilliant part about Under The Skin is how well it tells a story without dialog, without running commentary, and without the central character saying much at all.<br><br>Think about the purpose of what the female character is doing. The entire story tells itself so easily if you let it. The problem with the modern movie-goer, and admittedly myself, is that we want things explained to us. We're happy to be treated like ignorant flatheads that don't know our butts from our elbows. Look at any other review here on IMDb and pay close attention to what is being criticized. They are mostly the same things over and over again.<br><br>They don't criticize what is conveyed through the film's imagery. Instead, they say things like \"Not enough was explained.\" \"This film had no plot.\" \"The movie went nowhere.\" or \"Nothing happened.\" At the risk of sounding smug, I will say that these people are looking for the wrong things in this movie, or any movie. When going into any new film it's important to remember the medium you're choosing to entertain you. It's not like a book on tape, or music. Movies can explain the plot, story, character motivations, and roles without having to have a character, or narrator explain it to you.<br><br>I was one of those people that didn't \"get\" this film and gave it an extremely low rating of 1 star. But I decided to change to a 7 after much reflection on the content and thoughts it provoked afterward. After reading over 5 or 6 positive I got curious. Why do so many people think this movie is fantastic and innovative? I implore you to look up the video review by Renegade Cut.<br><br>This one video, in addition to Under The Skin, made me rethink what I think a movie should be. It can be artistic, and different, and entertaining without following the well established formula for modern movies. Personally, I feel like people in general are too harsh. A one star rating should be reserved for terrible films, with nothing to say at all. Well, that's not this film. It certainly has plenty to say about what it's like to be an outsider, and what a gift it truly is to be human.<br><br>A one star rating should be reserved for the most thoughtless trash in existence. This isn't even close to that. Was it for me? No, but I certainly \"get\" it. I get what the message is, and what it was trying to do. That I had to think to myself \"What did I just watch?\" was enough for a 7 star rating. It made me think, re-evaluate, and wonder. As much as I like Guardians of the Galaxy, or Indiana Jones, I have to ask myself \"Did either one of those films make me feel this way?\" No, they didn't.<br><br>And also, do films necessarily have to be for entertainment? To which I also say no. Films can be about raising a question, or provoking a thought, or experiencing emotions. Maybe the tedium of a scene evokes boredom, but what if that's the point of the scene being shown? Look past your eyes, think about what the director's intent was, and I think you'll enjoy this one way more on a repeat viewing.","user":"Daggerborn","rank":[249,344]},{"title":"Amazing but not for everyone","rating":6,"date":"6 October 2013","review":"This is a film that will divide audiences, for sure - but, don't forget, so did 2001: A Space Odyssey when it came out. Despite the presence of a mainstream actress, and a science fiction premise, this is an art film 100%, inviting a very subjective response from audiences. Which isn't to say it doesn't have a plot, though. Addressing the confusion of previous IMDb comments - the men that Johansson's alien traps have their innards sucked out and transported through a cosmic portal. One scene makes that pretty hard to miss! The film is about her developing a morality based on her actions, and trying to escape the purpose on earth that she's functioned for, that her overseers (the people on motorbikes - also aliens in human form) make sure she goes through with) <br><br>A super-creepy music score, amazing visuals and a brave &amp; mesmerizing performance from SJ combine for a film that will be talked about for years to come. Ignore whatever you read about it - especially the bad comments here, which are completely ignorant - and go in with an open mind.","user":"spacejunk001","rank":[249,365]},{"title":"The non-spoiler trailers represents this wonderful movie perfectly","rating":10,"date":"9 August 2014","review":"Did any of the 100+ 'one star' 'worst film ever' reviewers see the trailer for 'Under the Skin'? If they had, they would have known exactly what they were in for. I'm just guessing that the prospect of seeing Scarlett Johansson naked had many of them them throw caution into the wind. And then they felt cheated. Serves them right.<br><br>The trailer perfectly captures the mood of this film, without giving anything away. Distancing, cold, slow, with a continuous sense of doom, terrifying, but also heartbreaking. Some scenes (on the beach, the last passenger, the two guys) will stay with me forever.<br><br>An amazing performance by Scarlett Johansson, who was given very little dialogue and had to act non-verbally for most of the running time. Superb soundtrack, editing, and cinematography. It takes some effort to keep up and fill in the blanks (an easy film this is not), but the rewards are ample. But please, see the trailer first.","user":"adrian-15","rank":[189,286]}]