[{"title":"Well I liked it","rating":9,"date":"29 May 2019","review":"I found this to be funny and smart and don't think it got a great promotion considering the number of reviews comparing it to Superbad. (It's not Superbad because it's 2019, oh and also because it's a different movie)\nBillie Lourde has some excellent line reading in this. It's bizarre and surreal and that's just the way I like my comedy.","user":"ashallj","rank":[248,415]},{"title":"I don't get it","rating":5,"date":"15 May 2019","review":"Of course, as usual the ten-star advance \"user reviews\" here are from people who \"mysteriously\" have never written an IMBD review before--i.e. studio shills. But \"Booksmart\" has gotten great early reviews, and several people I know who saw early screenings really did love it. So I went in fully expecting to enjoy it, and was dismayed when immediately--I mean, even before the opening title--the film was making \"Funny, huh? Wasn't that funny?!?\" noises despite nothing particularly funny happening. I'll give Olivia Wilde points for making a very colorful and energetic movie that might indeed convince a lot of people through sheer high spirits that it's a great comedy. But instead it felt just strenuous to me, trying too hard to cover the fact that the funny, clever, witty material wasn't actually there.<br><br>The premise is ridiculous--bookworm protagonists are horrified to discover that after all their sacrifices for the future, all the party-hearty types at their high school ALSO got into Ivy League schools. This would make sense if it took place in a wealthy community where everyone was a \"legacy\" student thanks for their family's donations. But the movie makes a point of singling out two characters as the only \"truly rich\" ones here. Those two, like every character save the two lead girls, are complete \"SNL\"-style caricatures. What's worse, they all also seem to be played by actors who are about a decade too old, once again apart from the two lead girls.<br><br>Even so, the premise and the casting and everything might have worked if \"Booksmart\" were an outright farce. But it seems to be aiming to be sorta-kinda \"real,\" while the characters nonetheless behave like no teenagers past or present. Everything here is so over-amped and contrived for effect, yet the ingenious comedy situations and bright lines that approach might have served are nowhere to be found.<br><br>Like I said, I don't get it--it's a very lively and well-crafted movie that nonetheless felt completely phony and unfunny to be. It's not boring, but I have no idea what people who like it are responding to, beyond the fact that \"'Superbad' for high school senior girls\" is probably good enough for many. But I liked \"Superbad\" well enough, and this movie just did nothing for me. You could say it aims for a mix of \"Superbad\" and John Hughes, but those movies do a much better job turning recognizable teenage life into farce with some heart, and if Wilde intended something similar (I'm not sure what she intended, beyond punching across every scene as if she might never be allowed to direct again), she misses the mark. A for effort, C for derivative/uninspired content, and D for over-effortfully trying to hide that empty content. It's like a student paper with a very splashy cover but nothing original or thoughtful inside.","user":"ofumalow","rank":[601,1]},{"title":"I don't get it either","rating":5,"date":"24 May 2019","review":"I just saw this. The first review I saw here (also titled \"I don't get it\" and also 5 stars, summed up my feelings, so I won't repeat all that it said. (Except, and I suppose a minor point, but as that other review mentioned, some of the actors are way too old for the roles, e.g., Billie Lourd is 27 and looks 27.) And it strains plausibility at times. (Miss Fine just happened to have a sequined dress in Beanie Feldstein's size in her car?)<br><br>I read two glowing reviews, on AVClub and Vulture, and it has a 97% critical consensus on RottenTomatoes, so clearly critics are liking it. I just don't understand why.<br><br>I don't have know how many times I've seen Lady Bird, a far superior high school movie (in which Beanie F. costarred). This isn't a bad movie; it's a bit scattered tonally, and I kept reading that the characters weren't the usual high school stereotypes and were fleshed out, when actually that's not true.<br><br>It is...mildly witty. I guess see it and see what you think if you're curious. Word of mouth will be the ultimate determination of its success. For me, it's vastly overhyped.","user":"SeemsSensible","rank":[341,600]}]