[{"title":"HESHER---best film I saw at Sundance 2010","rating":10,"date":"15 March 2010","review":"I saw \"Hesher\" at Sundance and your review is so far off the mark it is unbelievable. \"Hesher\" IS very original and very funny. It will also leave a lump in your throat. Believe me, I saw 12 films at Sundance and \"Hesher\" was far and away the best. Perhaps your reviewer was confused because \"Hesher\" is really both funny and serious and a clever script nails it on both counts. From the first frame until the ending, there is not one dull moment and the cast is fabulous. At first, the character \"Hesher\" is sort of not likable but the way that Joseph Gordon-Levitt plays him, with a ' Cary Grant-ish' twinkle in his eye and his tongue placed firmly in his cheek, you can't help but cheer for this twisted rocker. The rest of the cast is a really great ensemble...you want ORIGINAL! They are all playing \"against type.\" Besides Joseph Gordon-Levitt's captivating performance there is Natalie Portman, playing a homely looser without self esteem. She is so good you would never dream that this poor thing is a major movie star. Then there is Rainn Wilson playing a part so totally different than his 'Dwight Schroot' on the 'Office\" that, with the beard he wears, most people will not even know it's him. He plays a man that is so devistated by his recent loss that he hasn't really decided if he wants to keep on living or not. A wonderfully touching performance by an actor known mainly as a doofus on a TV show. Devin Brochu, who plays the young boy T.J., doesn't seem like he's acting at all. A great job of directing by Spencer Susser is evident by the way he has molded this young actor, with very little experience, into a character who's pain you can feel. Lastly, kudos are in order for Piper Laurie, the attractive young leading lady of yore (she played Paul Newman's girlfriend in the \"Hustler\") and more recently was the witch of a mother in \"Carrie\", who makes the grandmother who is slowly loosing her marbles, a great friend and confidant of Hesher. The two of them, the near-Alzheimerland grandma and the wild and crazy (like a fox) Hesher are two very unlikely philosophers that have not been seen before in any film that I recall. If that is not an ORIGINAL concept I don't know what is! My suggestion: have your reviewer see it again, this time with his or her eyes OPEN. Otherwise, you will be missing one of the best films of this or any year.","user":"marciarealestate","rank":[181,239]},{"title":"Angel of Death, and Life","rating":9,"date":"12 February 2010","review":"Dark. Very, very dark, and profane, and vulgar, and raw, and rough, and funny and sacrilegious and did I mention vulgar. But I loved it! It's real life. This film yields one the most interesting discussions about how God is speaking through films. A fracked-up family. A pryomaniacal, head-banging, angel of death. A sweet and sexy grocery clerk. And Metallica music what more do you need? This film is Psalm 88. It's a boy screaming to the heavens, \"Why God? Where are You? Why don't you help me?\" It's a once happy and bright life ruined by a car wreck. A mother killed. A son trying to be a man. A father dealing with depression. And a strange, reluctant \"savior\" that brings the family to the precipice of death; and life.<br><br>I think the greatest theme in this film comes when Hesher says he lost a (body part), but he has another one. Yes, the boy lost his mom, and his dad his wife, but they still have each other. Life is completely messed up, but we have each other.<br><br>Joseph Gordon-Levitt, Natalie Portman, Rainn Wilson, Devin Brochu: beautifully acted. This film is the epitome of Beauty from Ugliness, Life from Death, Sacred from Profane.","user":"quelleproductions","rank":[160,213]},{"title":"Review From Film Crewmember","rating":8,"date":"15 May 2011","review":"I admit, it is a taboo for crewmen on a film to make a comment about it... sometimes you can be sued and can often breed bad mojo. However, I extend my neck on the chopping block for this film because not only because a few months of my life were spent on 14+ hours days with this cast/ crew/ and director but it was a... unique... project.<br><br>This was an unusual film to work on. Start with a Writer/Director who's fervently passionate about his work (...okay, I've seen that before) but with a twist. Add an almost impossible idealism in a man of school boy enthusiasm whose facial expression varied between, \"I won the girl of my dreams,\" \"Yeah, that's it... but do it again(and again)\" to watching that hopeful idealism melt away as though you just told the persevering child that ha-ha you won't be an astronaut but rather a feeble emasculated yes man to a control freak wife. To say the Director was passionate about making his story real, real meaning matching that fully developed story that had vividly existed in the inner invaginations of his brain for years, doesn't begin to convey the sheer depth of it. <br><br>Firstly, the cast was phenomenal. Mr. Wilson especially was an amazing actor to watch perform. It is a subtle character of nominal lines but without a word he was able to convey an impressive character. The production could not have hoped for a better casting in this part.<br><br>Mr. Levitt was, as I believe most already know, a pro. His professionalism and seemingly innate ability to portray his character, to bring his character to life, was amazing to watch and a pleasure to work with.<br><br>Now we come to Devin as T.J. The lengths this gentleman was put to was intense. Yet never a complaint. Brushed himself off, caught his breath, and did it again. My compliments to Devin for his amazing dedication to his character and this film. I've never seen a new actor his age work so hard, diligently, and without complaint.<br><br>Now to the film. The script is not easy to read, painful in fact as the dialog slaps you in the face at least every other line. I confess I had my apprehensions at first... it seemed just too much.<br><br>However, these apprehensions faded as the type of the script was performed to the mind's eye of the Director and Cast. This film is very much about the not said, but the movements/ actions/ expressions. The subtle, and the beneath the surface story that is so much closer to truth and reality and than the superficial first glance.<br><br>Look at the typeface only, and the superficial facade of the characters will be all you see and doing so will fall nicely in line with the design of the characters' protective layers. Scratch deeper, or simply pay attention to what the characters are really portraying... The moorings and underpinnings in these characterizations, and how they combine into the plot, gives a profound yet simplistic look at human behavior and how people cope with identity, loss, and the need to be loved.<br><br>My hat off to this amazing cast, it's crew, and Mr. Susser.","user":"motionpicturemedics","rank":[149,200]}]