[{"title":"A genuinely touching story about falling into love told elegantly","rating":9,"date":"5 September 2013","review":"I usually shun writing reviews here or anywhere else, but this film is really well written and acted. I am surprised with the 6.8 score, for I believe it should be at least of 8.5.Firstly, the combination of Vera Fermiga acting as the mother of taissa, who is, I believe her youngest sister in real life is smart and interesting, and there is this natural chemistry between the two. Andy Garcia, manages to pull off, in my opinion, one of his best performances on screen. I also loved that campus was a very dominant participant in the film, long shots, the use of natural light, and campus life in general helped in believing that, such a love story could actually occur in just a few hours of roaming the campus lawn. If you are trying to decide whether to watch this film or not, then go watch it, I thoroughly enjoyed it and I hope this tips the balance for you in its favor.","user":"Motibenya","rank":[74,87]},{"title":"If you liked the Before Sunrise trilogy you will love this. A movie I liked much more then expected. Romantic and real.","rating":7,"date":"1 March 2014","review":"\"By the time the afternoon bell rings you will have fallen in love. I guarantee it.\" George Hartman (Garcia) and his son arrive at Middleton College for a tour. While there he meets Edith Martin (Farmiga) who is doing the same with her daughter. The two begin talking and soon strike up a fast friendship that over the course of the day evolves into something that makes them question everything. I'll start by saying I wasn't really excited about watching this. I expected a basic love story with out much substance. What I did find was I liked it much more then I expected. While the movie is really nothing more then two people talking for an hour and a half it was actually entertaining to watch. The best way to really describe what happens in this is to compare it to the Before Sunrise trilogy. This has the same feel. Two people meet and we watch their relationship grow over a few hours. The most entertaining aspect of the movie is watching how the roles of the children and parents switch. The parents have the college experiences and the kids stress about everything else. Overall, if you liked the Before Sunrise movies then you will like this as well. Better then I expected, it was very romantic and a very real love story. I give this a B+.","user":"cosmo_tiger","rank":[29,32]},{"title":"College visit leads to parents' education in their marriages and selves.","rating":8,"date":"13 February 2014","review":"This \"little film\" is surprisingly ambitious — and effective. <br><br>It subverts the college student rom-com by focusing on the parents at their nest emptying. For both generations this new liberation can be terrifying. As Edith tells another parent, the kids' departure leaves the parents realizing how little they know or are connected to their 18-year partners. The theatrical scene Edith plays with George reveals how a marriage can hide lives of quiet desperation. In the crowning irony, the two college roommates coolly watch the two adults getting stoned and acting wacky, under their knowing eye. <br><br>The film also replays the old Benedict/Beatrice device of characters who initially snipe at each other gradually discovering themselves simpatico. George and Edith begin and end as opposites, but they switch poles. At first he's the rod-ass and she's the bohemian free spirit. She cures his fear of heights, he her temptation to be totally carefree. By the end he's loosened up enough to want to have an affair with her and she retreats to the safer ground of self-denial.<br><br>Their respective kids replay that shift. Conrad leaves the security of his studly \"million dollar smile\" to pursue his disembodied, faceless role on campus radio. Wilder and more precocious Audrey takes to heart her idol's distinction between healthy ambition and unhealthy obsession.<br><br>In both those relationships — and in the respective parents' scenes with their kids — there is ample demonstration of what Audrey reads from her idol's book: linguistics must deal with what is not said as much as with what is. Heard sentences are meaty but those unheard are meatier. Hence the really delicate work in facial expression and body language throughout, especially as the leads increasingly open up and connect. Hence the confessional Truth behind the two parents stage \"performance.\"<br><br>The campus name, Middleton, puts all its characters in some middle. The two teens are pivoting into adulthood. The two parents are turning from the stability of their unfulfilling marriages into self-realization — or not. Both turn passive at the moment of decision, as imaged in their letting their kids drive. When George prefers the long way home he's taking more time to face the life he dreads, to put behind the happier alternative he has just encountered. Informed by the reflections on French films, we don't get the usual American film's happy ending. But the chance remains. We're hoping this one-shot might lead to a Richard Linklater trilogy where we can follow these so very touching and appealing lovers into a happier afterlife. <br><br>Finally the film is about what a college education should be. The two parents get a college education in one day when they meet new people, try out each other's alien perspectives and experience, act out exploratory expressions of themselves, learn to breathe more freely and deeply, get new insight into themselves and each other, test experimental things they never would in their outside (aka \"real\") lives, and end up significantly altered, illuminated, broadened in understanding and emotion, whichever road they pursue. <br><br>It's an idyllic university, a slice of heaven, so the disciplines represented are literature, language, horticulture, the arts, and the pulse is in the library. The linguistics (!) professor's office is a jaw-dropper. The salutary absence of Business, High Tech, a football team, make the setting as Edenic as the two leads' romantic discovery. For more see www.yacowar.blogspot.com","user":"maurice_yacowar","rank":[14,15]}]