[{"title":"Very, very underrated.","rating":7,"date":"20 August 2012","review":"When I first saw the previews for this film, I was on the fence about seeing it. To me, it looked like it could be a pretty good movie, or an absolute train wreck. Then I read the reviews, which weren't very good, and I was less sure about seeing it. A few days ago, I saw it out of boredom at a cheap movie theater. As I began to watch the film, I realized that the movie was very uplifting and emotional, with lots of other feelings. I can admit, I cried during the film and I think everyone else in the theater did too. This movie wasn't all perfect though. It was very predictable, and when something happened in the middle of the film, I could basically tell how it would end. All in all, I walked out of the theater feeling good, and I hope to see it again soon.<br><br>A word of advice, DO NOT LISTEN TO THE REVIEWS OF THIS MOVIE. The Odd Life of Timothy Green is a great family movie to see, and it really gives you that warm feeling when you leave the theater.","user":"jabaligian","rank":[133,183]},{"title":"Great, great movie!","rating":10,"date":"23 July 2012","review":"What a wonderful movie! Because you can read the summary, I will just tell you our reaction to it. We were lucky enough to receive tickets to a pre-release screening of this moving. We took the whole family, 5 boys ages 5-16, and my husband and myself. Everyone loved it. Even the 5 year old, and that is no small thing. This movie will make you laugh and cry and then laugh again. And the laughing moments range from chuckles to totally surprise you as they burst out of your chest howls out loud. <br><br>Though we have our boys, we are waiting to adopt a girl, so the theme of parents who want a child that they can't seem to have, and the theme of taking in a child that you didn't give birth to and/or adoption really hit home for us. I sat at the end of the movie and cried, and they were tears of laughter and sadness and hope all mixed up together. Even if you're not interested in adoption, this is really a touching show. <br><br>I wish Disney made more movies like this. Totally clean, nothing even remotely possibly offensive, and yet it wasn't just a kid show. It was interesting, engaging, witty. As noted above - good for everyone from ages 5 to 40!","user":"keilanil","rank":[137,216]},{"title":"This review makes me feel like an old curmudgeon","rating":7,"date":"14 August 2012","review":"I like Peter Hedges' other films. I wish I could have liked this more. Its' heart and message are so in the right place, but it plays like a schmaltzy movie of the week. Jennifer Garner, whom I have really enjoyed in other roles, overplays this one and is very disappointing. The kid who plays Timothy is good enough. His young female friend Odeya Rush is the best in the cast. Joel Edgerton is perfect for Lifetime movie of the week. They are all really likable. So I just wished I liked the film more. And the message is terrific. I cry in schmaltzy films but I think it says much about this film in that the only time it brought any tears was in the final scene which was grounded in reality. When the fantasy was going I just wasn't sucked in.<br><br>7 may be a generous rating, but this is a solid family film with a strong positive message. There is a big audience out there for this film. I don't really want to discourage them from seeing it.","user":"somf","rank":[47,75]}]