[{"title":"Lessons to be learned","rating":7,"date":"22 December 2011","review":"Restless tells the story of two controversial -but somehow the same- teenage characters and their perspectives of dealing with death. Enoch (Henry Hopper) has dropped out school and tries to cope and face his fears by attending funerals. That's how he meets Annabel (Mia Wasikowska), a girl with a terminal disease and a love for life and nature. There's also the ghost of a Japanese kamikaze Hiroshi (Ryo Kase), from WWII and it seems that he is a story inside the story of this film. Sometimes you may think that his part is unnecessary in the plot, although, in the end it turns out that he wasn't so much irrelevant after all.<br><br>The film is not as morbid as you might think. There won't be any moment where your heart will feel heavy. Every scene is a walk-through towards realization and the art of getting familiar with the absolute fact such as death and the importance of love and the \"now\" moment.<br><br>The photography is soft and atmospheric and so is the music. Keep in mind that the director (Gus Van Sant) is the one who also directed Good Will Hunting, a brilliant movie. I first saw Mia Wasikowska in Alice in Wonderland, then in Jane Eyre and i believe she's one of the many talented young actresses that'll stand out in the industry. Henry Hopper on the other hand is the son of the late -and great- Dennis Hopper. His filmography is still in its early stages but he seems very promising.","user":"synevy","rank":[27,29]},{"title":"Small gem, great tribute to Nouvellevague","rating":9,"date":"30 December 2011","review":"This underrated film was released just before Christmas in Tokyo. As a long time fun of the director, I enjoyed very much this beautiful film. It appears to be an ordinary boy-meets-girl story with somewhat quirky atmosphere, but inside I found the film is filled with homage to the Nouvellevague cinema. <br><br>Among them, I remember the film \"Cleo de 5 a 7\" by Agnes Varda (1962), which includes discussions of mortality, despair and the meaning of life. I also felt the airs of Jean-Luc Godard and François Truffaut. If you love the French films in 60s, I believe you will enjoy and appreciate it more. <br><br>The line by Hiroshi (the Ghost) summarizes the theme of this film. <br><br>\"We have so little time to say any of the things we mean. We have so little time for any of it.\"","user":"Masako-2","rank":[31,36]},{"title":"Beautiful, Romantic and Sad","rating":8,"date":"30 June 2013","review":"Enoch Brae (Henry Hopper) is a morbid teenager that enjoys attending funerals. He meets the teenager Annabel Cotton (Mia Wasikowska) in a memorial service and they start to see each other. Enoch has lost his parents in a car accident and lives with his aunt Mabel (Jane Adams). His best and only friend is the ghost of the Japanese kamikaze pilot Hiroshi Takahashi (Ryo Kase) and Enoch neither goes to school nor has a car. Annabel is terminal with brain tumor and lives with her sister Elizabeth (Schuyler Fisk) and her mother Rachel (Lusia Strus). She loves to read about birds, especially the water birds. Soon the unlikely couple falls in love with each other improving their lives.<br><br>\"Restless\" is a beautiful, romantic and sad movie about love, life and death. Enoch Brae recalls Harold, from \"Harold and Maude\", a teenager with a trauma attracted by memorial services. Mia Wasikowska is wonderful in the role of the sweet Annabel, a teenager terminally ill that loves life. The story is sensitive and their romance is heartbreaking. My vote is eight.<br><br>Title (Brazil): \"Inquietos\" (\"Restless\")","user":"claudio_carvalho","rank":[14,15]}]