[{"title":"A visual and nostalgic treat!","rating":9,"date":"7 July 2011","review":"I watched and loved the anime 'Starblazers' as a kid and now 30+ years on I find out they've made a live action version of the series that I knew absolutely nothing about! Well, I just HAD to watch it, not expecting anything great.... putting my hopes as high as a SciFy movie of the week or a campy Godzilla movie.<br><br>Boy was I surprised! The movie does leap right into things without the background development of the main 'spaceship' or real character introductions, but to enjoy the movie, especially if you have any familiarity with the source cartoon, it really didn't hinder it that much. When the 'Yamamoto' took off and the special effects were introduced, I almost crapped my pants! It looked FANTASTIC!! Exactly like my 9 year old mind pictured as if it were brought to life!<br><br>This movie is FAR from Shakespeare, but for an action space romp, popcorn munching entertainment vehicle... it sure impressed me silly... especially compared to the dreck coming out of Hollywood these days.<br><br>If you have fond memories of 'Starblazers', this is a MUST SEE... even if you never saw the cartoon, I'd highly recommend this as a decent time waster.... you could do far worse!","user":"viligeidiot","rank":[40,49]},{"title":"Toho's new masterpiece","rating":20,"date":"20 July 2011","review":"This latest production of Reiji Matsumoto's classic series deserves high ratings for its production value especially considering its low budget of 12 million USD, which is less than a fifth of average Hollywood motion pictures.<br><br>In the year 2199 earth is under attack by planet Gamiras and is hopelessly contaminated by radiation. One day they receive a transmission from planet Iskandar with a plan for warp engine and a wave cannon. In their last hope, people of Japan uses this information to transform battleship Yamato - a world war II relic that is now exposed out of a dried up sea bed into a spaceship. They set out to Iskandar which exists in the great Magellan nebula in hopes of finding an answer to earth's problem.<br><br>I see touch of Babylon 5 and Battlestar Galactica in the overall looks and feel of the props, ships and the battle sequences, but it's certainly the very best special effects science fiction I've ever seen to come out of Japan. I'd say that Japanese sci-fi have finally come of age in this movie.<br><br>The final sequence of this movie is very Japanese in my opinion, and might be over melodramatic for the international audience, but the movie was made for the Japanese viewers, so I don't have any problems there.<br><br>Takuya Kimura has a habit of stretching out the ending of a word when calling out orders, and speaking dramatically which sounded odd at times, and the dead pan acting of Meisa Kuroki could have been more charming, but overall things were believable and didn't mess up the story.<br><br>Beautifully done movie with real feeling of being out there in space, with unbelievable special effects considering its budget. This is certainly the best sci-fi movie to come out of Japan, and is Toho's new masterpiece.","user":"ebiros2","rank":[37,47]},{"title":"Relatively faithful to the original series","rating":8,"date":"5 April 2011","review":"Well, considering the length of the original series, the movie producers have done well cramming it all into a 2-hour long film.<br><br>There are a few flaws in the movie I thought needed a bit more work on.<br><br>1. There is little feelings of romance between Kodai Susumu and Mori Yuki. It just felt flat. This, I attributed, to the target audience of the original animated series.<br><br>2. The melodrama at the end, on the bridge, was very Japanese..... in the 1970s. It should have been shorter and more modernized. I guess one has to be a die-hard fan not to find that scene particularly long-winded.<br><br>3. There wasn't enough battle footage of the Yamato and her enemies. This I was seriously looking forward to, but was left disappointed.<br><br>4. I wish Mr Kimura would shed a few tears, that would have made his performance more believable.<br><br>That said, there were quite a few good points about the movie, 1. Realistic space-fighter maneuvers. The big turnarounds of spaceships and fighters in American sci-fi is just plain BS. The only other sci-fi that got it right was Babylon 5.<br><br>2. Up until the bridge scene right at the very end, I was actually not aware of the time passing.<br><br>3. This movie have some of the better Japanese actors in recent years. Overall, their performances are well delivered and their friendships believable.<br><br>4. Swearing and vulgarities are non-existent in the entirety of the movie (or none that I am aware of). This is a rarity these days, especially with all the filth coming out of American and European films.<br><br>5. The graphics and SFX are quite good. They are quite realistic. I have no problem with much of it except for those SFX sounds the lasers and beams made.... sound very arcade-like and very 70s.<br><br>This movie is worth the ticket you paid for.","user":"darkmax","rank":[47,70]}]