[{"title":"Shoot the guy who payed for this!","rating":1,"date":"24 January 2012","review":"I can't believe someone payed to produce this piece of s***. I can't believe they could hire a crew to work on this. and where did they pick their crew? right off the street by random? even that would have made a better movie.<br><br>pick literally any porno and you will get better acting, better production quality, even better laughs.<br><br>there are a few scenes involving fecal matter, one in particular quite graphic and disgusting. what they show in that scene sums up my opinion about this movie!<br><br>and i can't believe they went to trouble of getting an R rating and then just show one titty shot. only *one*. you would think something as low as this at least would be saturated by nudity so they can attract an audience. but nope. just one.<br><br>so don't waste your time. stay away from it.<br><br>i just wished to know the finance process allowing this kind of crap being produced. maybe some rich kid wanted to make a \"movie\" and his daddy paid for this s***. and he literally paid for s***.","user":"picosie","rank":[11,12]},{"title":"Tasteless, Soulless, utter waster of time","rating":18,"date":"18 September 2011","review":"I genuinely used to believe that every movie however badly made, deserves at least one view, as it has involved a lot of hard work by at least a few people. There are of course scores of movies that refute this statement. Cougar Hunting sails to the top of this pile, through the complete lack of a plausible story, sorry acting and absolutely nothing to write home about. In a train wreck of an attempt to join the American Pie / Eurotrip style of movie making, this flick is a perfect example of how not to make movies. None of the jokes are even remotely funny, toilet humor this isn't - its a new level of tasteless...the characters portrayed by the so called actors, clearly tells you that that some people do not watch their own movies. Brainless, tasteless, classless...An utter waste of time. Please do not attempt to come within a mile of this sorry excuse for a movie...","user":"cgkirtikar","rank":[12,17]},{"title":"Teen humor","rating":9,"date":"31 August 2011","review":"I personally enjoyed this film. It contains a humor best suited to teenagers. It is extremely raunchy but if you enjoy dirty humor then you will definitely find this film to be precisely what your looking for, It reminded me of the \"American Pie\" films. Very dirty humor with a group of cheeky boys just looking to get laid. Don't let that put you off though as its not all about sex. The main storyline may come as a surprise to some as most reviews build it up to be purely about sex. This film is definitely rated R for a reason so i would not suggest watching it if you don't appreciate that the content of this is extreme. I highly recommend it.","user":"lettybabe1","rank":[9,14]}]