[{"title":"Why the Low Rating?","rating":7,"date":"26 November 2010","review":"Sure You Again isn't Oscar-material, but I don't think it was intended to be. But if you watch it keeping in mind that is a light-hearted, fun summer comedy for the family, you will appreciate it, mainly because of the strong and hilarious female cast. Sigourney Weaver, Jamie Lee Curtis, Kristen Bell and Odette Yustman all shine on-screen in their own ways, yet complement each other so well. The chemistry of the cast contributes to the film's charm. I was especially impressed with Kristen Bell because this is the first comedy/chick-flick I've personally seen her in, and she was really cute and funny! She had a lot of charm, great comedic timing, and I kept thinking in my head how gorgeous she is all throughout the movie. She's a really versatile actress. The veterans, Sigourney, Jamie Lee, and Betty White were all hilarious as well. If you're looking for a fun, positive family film with lots of laughs, you've found your movie.","user":"mamamia126","rank":[73,94]},{"title":"Funny & Cute","rating":7,"date":"11 October 2010","review":"I just don't get the bad and nasty reviews on here. We saw the movie last night and thought it was very funny and cute. This is not a film to be taken seriously it is supposed to be farce and it was nice to unplug from the real world for two hours and just have some fun. Jamie Lee and Sigourney where great in their respective roles and the rest of the cast was good especially the young actor who played \"Tim\" he was great and the ending is funny. If your looking for some \"I don't want to think for a while\" time this is good afternoon flick to sit back, eat popcorn and watch. You may want to wait until the DVD comes out but this is not in anyway a bad movie. Considering the violent trash 3D overload crap Hollywood has been vomiting onto the screen this past year \"You Again\" was a breath of fresh air.","user":"qualityguyftl","rank":[75,100]},{"title":"A Movie That Has Its Moments But Really Needs A Few More","rating":6,"date":"25 September 2010","review":"If nothing else, you have to like this for the high-powered cast that was put together. With well known stars such as Jamie Lee Curtis, Sigourney Weaver, Victor Garber and even Betty White you know there will be quality performances. The lead actress is the lesser known Kristen Bell (recently seen in Couples Retreat) and there are a number of cameos from the likes of Patrick Duffy and one who pops up for only a moment at the end who I guess I won't name since the cameo is uncredited and should probably come as a surprise. With those names, this couldn't be a disaster, and it wasn't.<br><br>The story has its moments. At times, it's actually very funny. Bell plays a former high school geek whose brother is suddenly getting married to the girl who made her teenage years a complete misery and whose wedding she decides she wants to break up. Meanwhile her mom (Curtis) discovers that the bride's aunt (Weaver) was someone she had a falling out with in high school. The unnamed cameo at the end is a continuation on the theme, with the mystery cameo being someone Betty White's character had a falling out with in high school, so these families have a 3 generation long feud to overcome to make this marriage work. To me, I thought most of the laughs occurred in two settings - when Curtis visits Weaver at her hotel and then at the rehearsal dinner. There are a lot of laughs in those scenes.<br><br>Unfortunately, although there are some good laughs in this, there aren't enough laughs in this. In fact, sometimes the movie gets downright heavy and far too serious; at times the characters seem to be truly hurtful to each other in a less than fun way, and the movie seems to forget that it's a comedy. It does have its moments. It just needed to have more.","user":"sddavis63","rank":[25,34]}]