[{"title":"Terrific, ultra claustrophobic suspense nightmare","rating":9,"date":"2 September 2010","review":"Buried is a film that keeps things deadly simple, one character, one location and a one line but horribly inspired plot, those looking for flashy visuals or big action should turn far, far away from this one. It's worth noting though that the film is well directed and photographed, director Rodrigo Cortes has a nimble eye for visuals and angles to keep things visually interesting, while cinematographer Eduard Grau gets the best out of the mere two light sources to make the experience a frighteningly vivid one. The plot sees Ryan Reynolds waking up in a coffin, with nothing more than a cell-phone and his lighter to help him out, things develop through his series of fraught, occasionally bleakly amusing and increasingly desperate communications with the outside world. Its rather interesting to see a film so based around interactions on a mobile phone, devices so often objects of fear, suspicion, or in the case of some horror films and of course the cinematic experience for the viewer, irritations. Here every ring is crucial, the battery bar is nail-biting, even the light of the screen is important. For me, just as interesting was the choice of lead. I've never had time for Ryan Reynolds, a face from some of the worst in lowbrow comedy and someone I never expected to appreciate breaking through into not just serious film but something as bold in its structure as this. A lot of people are likely to dislike the film on a fundamental level, but Reynolds gives the performance of his life here, running through a rainbow of emotions, angry, sarcastic and terrified are but a few. Compelling and sympathetic, likely physically arduous too (though I'd don't know how the film was made it must have been tough, barring serious trickery) he holds the film wonderfully. The script is of course of utmost importance too, and writer Chris Sparling does mostly terrific work. An ordinary man reacting as best he can to a nightmare, drawing on the sort of resourcefulness he probably hoped he'd never need, occasionally breaking down but keeping ploughing on, shades of dark humour in the protagonist's travails on the phone, its endlessly interesting and as time goes on, nail-bitingly suspenseful. I had minor issues with realism in the film, and there was at least one interesting little aside that could have been developed a bit more, but overall this is a great achievement. It surely won't appeal to everyone and my rating might seem generous, but for doing this well on such a risky concept, and putting together a suspenser that remains thought provoking after, a 9/10 from me.","user":"Bloodwank","rank":[263,420]},{"title":"An endless thrill ride, with one main actor.","rating":10,"date":"15 August 2010","review":"I caught this gem at Sundance earlier in the year. It was part of the 'Park City at midnight' group of films, which showcased horror and thriller movies, and played them at, can you guess? Midnight. I saw Buried on the last night of the festival, Ryan Reynolds wasn't there, but both the director and writer were. It was a small theater on Main street, very artsy in it's look. But once the film started I had eyes only for the screen.<br><br>It starts off with Ryan waking up, trapped in a box. A long box, the length of a human body, buried deep beneath the ground. From there the film plays out in an awe inspiring way, especially seeing as there's only so much you can reveal from one location. The way Rodrigo Cortes handled the filming is truly exceptional. From the start the camera switches between closely claustrophobic, and flying high above Ryan, showing the box with him inside and black all around. It's constantly on the move just like our main character's thoughts. Diving in when the action is intense, and then cutting to black when you don't think you can take any more.<br><br>The pacing and plot of the film were nothing short of genius. And Chris Sparling, the writer, should be commended for his work. He said after the showing, that after having his scripts rejected for their cost of locations he decided to go for a cheep but genius idea. One location, one star, and a wealth of idea's. It makes a film like 'Salt' look like a giant waste of resources, when Buried does what even some of the best thrillers can't do, it brings us inside the character's head, and does it all without a romp through the city, or blowing things up.<br><br>If you're one of those people who loves to sit on the edge of your seat, chewing at your fingernails, while you're constantly asking yourself what's going to happen next. Then by all means watch Buried, and consider yourself lucky that you're not in his shoes...","user":"shreke2003","rank":[242,389]},{"title":"Apparently for mature audiences only..","rating":7,"date":"27 January 2011","review":"Buried seems to be a very divisive film. I'm seeing lots of 1 star reviews, and lots of 8-10 star reviews.<br><br>**THIS REVIEW CONTAINS SPOILERS**<br><br>I won't rehash the plot, as every other review seems to. I will say that the movie is extremely taut, claustrophobic, well-paced and tense, and that at every step you will believe that this man - who has woken up buried alive - is desperate to survive and is trying to come up with a possibility of escape.<br><br>The reason that this movie is getting so many 1 star reviews is because it is REALISTIC. Yes, REALISTIC.<br><br>I imagine most of the reviewers giving it low scores are viewers who don't yet have the maturity to face up to a hopeless situation. Most movies these days give the hero impossible odds to overcome, and he DOES overcome them... because it's a movie. In real life impossible odds means that you fail, you lose. Say goodbye.<br><br>Well, the odds are impossible in this movie. The main character wakes up in a box with almost zero mobility. The air supply is limited. He has only a lighter and a mobile phone (initially). He is in a foreign country, with no knowledge of his precise location. It is a nightmare situation. The odds are practically impossible. Yet we do believe that survival is possible. No, we almost DEMAND it. We hope and we pray that he will get out of that box. We empathise completely with his situation, but we believe there must be a way out.<br><br>And that is why the movie is garnering such a mixed response. He doesn't get out. It was doomed from the start. He's been put in there by men who don't give a damn whether he survives or not. By men who've killed other innocent people and will continue to do so because their country is war torn and they are angry and desperate. His only hope is the US government and a hostage working group, whom he communicates with by phone. Every conversation is an exchange of information, with Reynolds's character offering whatever information he can in exchange for vague promises of help, and the various people on the other end of the phone having their own agendas and needs. But ultimately what can they do? His location is unknown and his phone is untraceable. They're looking for a needle in a dusty haystack. He can't get himself out and they can't find him to get him out.<br><br>Read all of the 1 star reviews for comments like \"why didn't the guy just use the knife to dig himself out?\" and \"he wastes oxygen using the zippo for light, what an idiot\". He doesn't use the knife because every crack in the box lets sand in, and without the manoeuvrability to stand up, he would increase the speed at which he is buried. Remember, he cannot sit up, reach past his thighs, or even lift his head all the way up. And he uses the zippo for light because the alternative is to save oxygen while sitting there in the dark waiting for death. Action requires the use of resources, but only action gives the hope for success. Everyone seems to criticise his actions but I haven't yet seen a plausible escape plan offered up. <br><br>If you're the type of person who thinks that if you were buried alive you would simply one-inch-punch your way out Kill Bill style then you're not going to like Buried. It's as simple as that, because your solution is fantasy and you will have no interest in seeing how such a situation would actually play out.<br><br>This movie is about THE CHARACTER's choices. It's about what HE chooses to do for survival. If the viewer has the wisdom to accept the reality of the situation presented, and the understanding that this isn't some safe video game puzzle but rather a man's struggle to not die alone in a box somewhere in Iraq then they will find this movie hauntingly powerful.<br><br>If you only want happy endings and the overcoming of impossible odds then you will probably hate this film. It will upset your delicate notion that life is sparkly and everything works out for the best. You will probably give it 1 star and explain how you would have killed the snake, cut off it's tail and used it as a hose to breathe through. <br><br>But one thing's for sure: it will get under your skin and it will evoke a REACTION from you. And isn't that what good cinema is about anyway? See this film. You might hate it. But at least it will make you THINK.","user":"offaroundthebend","rank":[38,55]}]