[{"title":"An unbiased review","rating":6,"date":"29 June 2014","review":"Clearly most of the people who wrote reviews are friends or family of the director. The flowery language alone is an obvious tell. A few people reviewed it very harshly as a response to the over the top praise. I'll do neither.<br><br>This movie has several interesting ideas, some lovely visuals, uneven acting, a mildly incoherent plot and low to middling production values. The best shots are in the first 2 minutes and the last several minutes. The use of classical music makes sense for the plot but at times the stature of the music just underscores the generic quality of most of the filming. It doesn't have the lush beauty required to sell this story. <br><br>It wants to be the Shining, the Omen, Blue Velvet or Don't Look Now. It's not. At minimum it would need 10 times the budget to look that good. I believe the director could do more if he had more to work with but the reviews comparing the movie to those things as if they are on the same footing are deeply dishonest. It aspires to those heights and can't begin to reach them. That said, for an unknown horror flick it's pretty good. You get the feeling the director could remake it with real money and a tighter script and knock it out of the park.","user":"abbykern","rank":[57,72]},{"title":"Flawed, Weird but Worthwhile Watching","rating":6,"date":"22 May 2017","review":"When Sarah (Diane Dalton) returns home in Oregon from a mental institution, her husband Alan (Randy Schulman), who is a critic of classical music, tells that they will travel to watch operas in Italy since he will write articles about them. Sarah does not want to travel but Alan introduces the hot Kelly (Lindsey Haun) to her telling that she will be the caretaker of the house. When they leave the house, the small-time criminal Jesse (Blake Berris), who is Kelly's boyfriend, unexpectedly arrives at the house. Then Kelly's unintelligent brother Tim (RJ Mitte) arrives to stay with his sister in the house. Kelly had a love affair with Alan and feels comfortable in the house. Meanwhile Jesse steals Alan's convertible to sell to a dealer but he sees the boy Adam (Micah Nelson) alone in the supermarket and decides to bring him home to ransom him despite the protest of Kelly that seeks out his parents. Adam feels good in the house and soon they learn that the house is haunted but they surprisingly stay there. Meanwhile in Italy, secrets are disclosed about the past of Alan, Sarah and Adam and why Sarah had a mental breakdown. <br><br>\"House of Last Things\" is a flawed and weird film with a non- chronological screenplay that explains most of the mysteries and is worthwhile watching. The story is intriguing and disclosed like a puzzle but there is lack of explanation for many things, such as who is the bizarre lady that visits Alan and Kelly; or the reference to the Garden of Eden. The cast has great performances and the unknown Lindsey Haun is very sexy. The final transformation of Kelly and Jesse is certainly inspired in David Lynch. In the end, \"House of Last Things\" is an original film of haunted house. My vote is six.<br><br>Title (Brazil): Not Available","user":"claudio_carvalho","rank":[8,8]},{"title":"Take a turn, and follow the twists till you are rewarded with your own interpretations.","rating":8,"date":"25 May 2014","review":"House of Last Things﻿ or The Last House (which really made no sense, and now makes little more) is a twisted thriller/horror/cracked-reality like The Shining from Stephen King﻿ with very broad strokes taken to deliver a visual effect sometimes working it's way into your subconscious in the back ground long before you even notice that it was always messing with you. The truth is what is fighting to get free, and the other truths that are forced up trying to get to the source are all equally vague until they are not anymore. I have to add the balloon had to have been stuck in the tree, and Adam was climbing up to get it, not just hiding. I believe that the house was trying to get that across as well taking some of the blame, and giving some to the tree. They do touch on the House having memories that it is trying to work through. The basics of the opening act are really just slow, and fulfilling dropping you in to the second act not liking the boyfriend, completely suspicious of the Brother, and uncertain why this girl is permitting these sorts of behaviors. So I was surprised when during that second act I found that I was Enjoying the twists back, and forth from Italy, and the strange Wacky Wednesday kind of stuff that is messing with everyone. There is a lot of energy tying the owners of the house to the sitters. If you like mixed up, twisted magical movies that are trying to keep you off guard all the time, and you know you be rewarded for taking the ride; then this is one I recommend you sit back, and soak in.<br><br>Jesse of www.Jesse.ca","user":"face-819-933726","rank":[56,80]}]