[{"title":"Good, Bad and Ugly","rating":5,"date":"25 April 2012","review":"This movie is not the greatest as you would guess with not a very good cast nor an original story line. To start with the acting. The actors performances were all average apart from Isabella Calthorpe's, her acting was awful. Directing was average, nothing special. <br><br>The film starts of with Sarah Tyler coming back to England from the United States after a long time. We find out about each of the characters personalities and their previous relationships before Sarah left for USA.<br><br>Then the action starts with the creature appearing and the family trying to survive. Trying alternate solutions to find an escape or protect themselves from the creature. <br><br>The ending was surprising. It could have been better. No explanation was given on why such events happened which was frustrating and made things seem pointless and too simple. <br><br>Pretty gross scenes with gore. Stupid decisions and bad storyline. Maybe you can have a laugh with friends while watching this but I don't think it's much more than that.","user":"SuperMah","rank":[32,40]},{"title":"I second the good the bad and the ugly","rating":2,"date":"26 April 2012","review":"I think the integrity of IMDb has gone to sh_t because of fake posts, fake ratings by those involved in the film.<br><br>I rented this one, seeing a &gt;8/10 review from some 25 people. I can't say it was anything but a waste of money. I'm a huge horror film fan, and watch anything that comes out and doesn't get abysmal ratings on here. I had to watch this one in fast forward. The initial dialog, and characters were interesting. Acting seemed fine. Once the creature and killings enter in, we are left with incoherent camera flashes, and a claustrophobic mess. When we finally see the creature, we understand why they decided to hide it till the end. The quality of the creature effects definitely are the bad. The story the ugly.. and the acting, and characters... the good.<br><br>The film had a lot of things done very well. Others very badly.","user":"LovinMoviesMakinGames","rank":[20,24]},{"title":"Decent horror romp hamstrung by budget limitations","rating":6,"date":"2 September 2010","review":"I saw this at FrightFest in London and was engaged right up to the final reel where things came a bit unglued.<br><br>The film deals with an estranged daughter coming home to visit her father and step-family at their ancestral manor. A building storm cuts off the power and an aborted party in the hay-barn is moved to the house, where the family discover that something *else* has crept into the house ahead of them.<br><br>There follows a horror genre cat-and-mouse chase around the house interior where the group of youths are steadily picked off by the monstrous invader during their efforts to contact the authorities and call for help.<br><br>Much of this section of the film is quite tense and well-played and this second reel is where I found most enjoyment. The creature responsible for the mounting chaos is never shown (other than a clever Gollum-style silhouette in one shot) and works for the film rather than against, leaving imagination to fill in the blanks.<br><br>Only in the final act of the movie do we learn the origin of the creature (although this particular twist is not difficult to see coming much earlier in the movie) and see it in more detail, which is where things fall down a bit.<br><br>When budgets are tight, prosthetics and animatronics typically suffer - the visual effects for the creature are a bit wobbly (which shouldn't really matter that much if the editing is tight or evasive) and although the body count is high and the corpses are suitably eviscerated and mangled (with probably the best effects of the movie) somehow the revelation of the responsible party left me feeling flat. Many of the actual murders also happen off-screen or in cut-away, which was another source of frustration for a horror fan.<br><br>Ultimately, this is a decent movie and the second act is where all the tension is rooted, but I found the ending lacking something. At the festival, the director explained they only had something like 18 days to shoot which would certainly impact on the final film.<br><br>If you like monster movies and have a free hour and a half, you could do a lot worse than watch 13Hrs.","user":"bad_badger","rank":[24,31]}]