[{"title":"Very watchable","rating":7,"date":"5 July 2010","review":"OK, it's a TV movie, and the locales and accents all but scream \"filmed in Canada.\" Still, I found it remarkably compelling. I was visiting Bulgaria, where it happened to appear on a TV channel after 1 a.m., and although I wasn't intending to watch the whole thing I wound up doing so anyway. So, it kept me involved.<br><br>As to the \"penny-shaving\" scheme another commenter mentioned, this goes back even further, because I remember it being the basis of a \"Dragnet\" episode that must have first aired in the late '50s or early '60s. Again, though, I found the plot as developed in this movie believable. Oldies but goodies, right?","user":"JSmith125","rank":[13,14]},{"title":"Web of Lies - It's Worth Being on DVD","rating":10,"date":"2 May 2011","review":"Web of Lies is definitely a film worth watching, i found it interesting, it had good twists and a good ending. After watching it I decided to see if I could buy it on DVD, but after searching a number of websites I came up empty, and then i read a review of Web of Lies on here, and it appears it is just a TV movie. I think a film as good as this should be out on DVD, I would definitely buy it and recommend it to people who like films like this one. I'm disappointed that I can't get it on DVD, but if it ever does come out on DVD, i'll keep an eye out for it and buy it as soon as I get the chance. If anybody knows if or when it will be out, please let me know, I don't want a good film to be restricted to the TV. It's a film worth keeping for years.<br><br>Marty G","user":"spiritoftheshark93","rank":[7,11]},{"title":"Not happy","rating":6,"date":"18 January 2010","review":"Summary: As someone else noted, I did not like the main character, and I found the overall plot to be too transparent. Frankly, for my tastes, they could just have put Andrew in a room by himself and filmed whatever happened for 90 minutes, and come up with a much better film. He's the only reason I watched it, and the entire 6/10 score is for him. Zero for everything else.<br><br>Plot: How many times do we have to go back to the tired penny shaving nonsense made popular by Superman III, but also seen in the excellent Office Space, and numerous other films? This has been done to death, and more importantly, it has been done better. Just stop it already.<br><br>Setting: Again, someone needs to tell Canadian filmmakers that Toronto, Vancouver, and in this case Montreal do not look like NYC. They just don't. Throwing in the Empire State Building or the Chrysler Building every once in a while only serves to re-emphasize the difference. If Canada wants to make bad films, why don't we at least make them set in Canada? Why insult our neighbour to the south? If we're proud of this schlock (and somebody is, because our logos are all over the credits) then why isn't it set here? <br><br>Costuming: I thought whoever decided what financial software people look like has obviously never stepped anywhere near such an outfit. These are very conservative environments. They don't dress like whores, even in the back.<br><br>Direction/Editing/Writing: The visual aids were ridiculous. Did we really need to see disappearing coasters? Did we really need the sweetener-packet demonstration? I guess so. Because if you buy that you can follow a series of RANDOMLY generated accounts with ANOTHER series of randomly generated accounts, you do need a visual aid. Or maybe it's me. I could swear they told us the accounts were random. If the final account ISN'T random, then it would be easily found by examining the source code to determine how the final account is decided.<br><br>Computer Effects: Speaking of source code, since when is it executable? When does a comment line suddenly become a command prompt? If you're going to go to the trouble to mock up a computer screen, at least give the audience a little credit.","user":"rgcustomer","rank":[9,16]}]