[{"title":"I had to fast-forward to finish this movie.","rating":2,"date":"7 May 2011","review":"this was terrible - a waste of the 45 minutes i was able to whittle it down to.<br><br>josh duhamel's character is a spineless cad (he leaves katie holmes outside under a tree?! and she's OK with that?!), which highlights the most fatal flaw of this movie, and i think another user's review mentioned it already - you don't feel for any of the characters. the movie tries to make you pity them, how they are lost and torn, and still searching for happiness and drowning their sorrows in alcohol, but you really just end up rolling your eyes.<br><br>the final blow was the ridiculous, anti-climactic ending. did the weather really save the groom and the maid of honor, or will the wedding be rescheduled? why are they smiling at each other? because they are terrible people? the failure of this movie is not on the heads of the actors. someone did say that anna paquin might have been miscast, but i think adam brody stuck out like a sore thumb to me the most. he sounded like and acted like his TV series character, and seemed like he was still in high school, much less than having graduated 10 years ago.<br><br>only the soundtrack was good, and although it could have launched this review to 3 stars, it went back down to 2 because of the strange, poorly chosen final track, an upbeat tune that closed out a confusing, muddled tragedy.","user":"gpcheng87","rank":[10,10]},{"title":"Filled with potential, but ultimately disappoints","rating":3,"date":"19 February 2011","review":"I wanted to like this movie, I usually enjoy small character studies, but sadly this film was a disappointment. Maybe it was too much to expect Katie Holmes to carry the story. Unfortunately her lack of range and/or talent is obvious in this film. And, Anna Pacquin, who is so good and fiery in True Blood, is left with little to do except be a bitch. Malin Ackerman plays a riff on her 27 Dresses role. Candice Bergn is mostly absent in the film. Finally, Josh Duhamel stumbles through the movie with the same stunned look on his face for the whole film. It is hard to imagine either woman in this film would be attracted to him. Character driven films are only enjoyable when we learn and understand the motivation behind the characters, or when we watch them grow and evolve. In this film we learn little of the character's background story or motivations, and there certainly is no growth. Overall the film is a sad mess, and I will not be recommending it to my friends.","user":"llsee","rank":[46,55]},{"title":"Boring script, bad acting, limp direction","rating":3,"date":"10 February 2011","review":"Since Galt Niederhoffer wrote the book and screenplay and directed this movie, she has nobody to blame for its terrible awfulness but herself. The screenplay has lots of boring gaps in which this supposedly bright, witty group wanders around without saying much at all. Although they are all supposed to be college buddies, the obvious ten-year age gap between Anna Paquin and Josh Duhamel makes this proposition laughable.<br><br>Katie Holmes acting here is so bad that it makes Josh Duhamel look like DeNiro, which is saying something. The whole movie hinges on the chemistry between the two leads, and there is none whatsoever. Sidekicks Jeremy Strong and Rebecca Lawrence are virtual non-entities. Candice Bergen does the same geriatric reprise of Murphy Brown that she recently did on the TV series \"House,\" with no better results. If Elijah Wood was going for creepy he succeeded, but to no great purpose.<br><br>That leaves only the performances of Anna Paquin, Malin Akerman, and Adam Brody to save this stinker. Akerman is the standout of the three, and it's only when she is on screen do you have the sense that something interesting could happen. Unfortunately, she not on screen all that much.","user":"sleemon","rank":[46,58]}]