[{"title":"Skillful and Innovative Independent Film","rating":8,"date":"25 February 2012","review":"I'm stunned by the reviews this film received. It makes me wonder what audiences are looking for. Giant robot cars, maybe? Stereo-typical heroes and bad guys (with capes!)? This is an independent film and the reviews read like they were written by a church group. This film is innovative and clever and extraordinarily well written. Sublette and Cates' work here deserves better reviews than these. I feel bad that they have to be subjected to this type of unenlightened ridicule for such a wonderful film. I suspect that the film just didn't get a chance to find its audience (which is not the Bridesmaids/Hangover crowd). Lucky is a different type of romantic comedy that successfully takes brave risks and they all pay off. On to specifics:<br><br>The screenplay was an extraordinary piece of writing. I won't give anything away, because if you like quirky independent film, you should see this movie. But, some of the scenes were beautifully nuanced. In particular, the final scene, which was an extremely difficult scene to pull off. Sublette manages to make it work. The pacing, editing, and direction are all as good as it gets. And the way the screenplay subtly builds these characters so that we believe their relationship (as bizarre as it may be) is masterful.<br><br>The acting is superlative. Hanks and Ari Graynor are ideally cast as nebbish serial killer and quirky love interest, and their performances are exquisite. I was amazed at their work in this film. The emotionality of the scenes required refined acting chops and they delivered.<br><br>I'd kill to work with any one of these creative talents and think they should be lauded for this film.","user":"kevin-1272","rank":[27,35]},{"title":"Worth watching","rating":8,"date":"19 May 2012","review":"Lucky is the kind of film that proves indie movies can hold their own against the studios. This dark comedy is a movie-lovers movie. Well written, superb acting, great directing and a memorable soundtrack make this a fun, if quirky film.<br><br>The pace of the movie is good in that it takes it's time to tell the story without unnecessary scenes or long silences. It baffles me that some people find this movie dull of boring. It doesn't have car chases or CGI characters throwing crap at the audience. \"Lucky\" is not for kids, anyone who think it's dull should find the next 3D IMAX extravaganza to keep their attention.<br><br>Hanks is ideal in this role playing a mild mannered serial killer who still lives with his mom (Ann Margret – looking great) with a lifelong crush on Ari Graynor who doesn't give him a second glance until he wins the lottery. <br><br>If you like movies like \"Heathers\", \"Fargo\" or \"Lars and the Real Girl\", you'll enjoy \"Lucky.\"","user":"antoniodiggs","rank":[11,14]},{"title":"It's a comedy about killing people, people! Lighten up!","rating":7,"date":"25 March 2013","review":"I'll assume that you know this is a dark comedy about a serial killer. If you can swallow that premise, you're halfway there. If not, walk away while you still can.<br><br>Good, you're still here. Maybe you have a slightly sick sense of humor, or maybe you're simply able to differentiate fiction from reality. One way or another, I think you'll be entertained by this film.<br><br>Like any good dark comedy, it makes no attempt to moralize, rationalize or justify the characters' criminal actions. Think of the scene in \"Pulp Fiction\" when they accidentally blow a guy's head off and sit there bickering with bits of brains in their hair. Think of the scene in \"The Prophecy\" where Christopher Walken, playing the angel of death, snatches a poor dying cancer patient from her blissful demise and forces her to become his servant simply because he can't drive a car. If you cracked a smile at these or any other shockingly morbid bits of dark comedy, then read on.<br><br>Though not as hyper violent as \"Pulp Fiction\" or as action packed as \"The Prophecy\", this film \"Lucky\" keeps the same sort of biting, surreal, amoral humor. There haven't been too many romcoms that center around murder and psychosis, and for that I give this bonus points for originality.<br><br>It earns extra points for Ari Graynor's EXCELLENT performance as the detestable gold-digger whose wacky descent into madness makes us suddenly start to root for her. Again, this is in keeping with the theme that even detestable characters can become our heroes. Ari's performance is one of the best examples of how to sway the audiences sympathy even though, in real life, such a character wouldn't be worth the trouble of spitting on her.<br><br>Similarly, Colin Hanks, with his boyishly innocent face and perpetual deer-in-the-headlights expression, makes you cheer for him even though he butchers people with no remorse. Throw in the lovely Ann-Margaret as the creepy mother, and you have a film with flawless casting. Oh, and how could I forget Jeffrey Tambor? Note to self: never, ever forget Jeffrey Tambor.<br><br>My only criticism of this film is that the ending comes upon you quite fast and may seem slightly implausible the way it's hastily explained in the final scene. But maybe that's the point. Like an unexpected punchline to a joke, it's probably designed to whack you senseless. But I would've loved to have seen more of Ari losing her mind, having ghostly hallucinations and transforming from clever manipulator to total flake. That's really what made me love this movie.<br><br>I also seem to recall that the music was pretty cool. I had never heard of the band Transcargo before, but I really liked their song \"Kissing the Day\" (listen to it on Myspace). I also liked \"Whatever Gets You By\" by The Features. These and other songs are quirky, happy-ish tunes that are brilliantly juxtaposed against the macabre story.<br><br>If you like dark comedies that make light of murder, don't hesitate to check this out. So many dark comedies rely on unspoken satire for laughs, but this one dives boldly into comedy territory. I haven't seen too many of those madcap, slapstick style dark comedies. Similar films include the Roberto Benigni film \"Il Mostro\" about a nerdy schlep (Benigni) who is being investigated for multiple gruesome murders, the Chinese film \"A Woman, A Gun and a Noodle Shop\" which is a comedy remake of the Coen Brothers' thriller \"Blood Simple\", and an obscure gem called \"Mambo Cafe\" about a family that tries to stage a murder at their restaurant to improve business.","user":"rooprect","rank":[6,7]}]