[{"title":"A terrific film, Jerry's best performance","rating":9,"date":"16 June 2013","review":"MAX ROSE must get distribution. If/when it does, Jerry Lewis will win an Oscar for Best Actor.<br><br>If you only know Lewis as the icon rubber-faced \"HEY LAAAAADY\" comic of films like THE NUTTY PROFESSOR and CINDERFELLA, you are in for a delightful surprise. Even if you loved Jerry in Scorsese's brilliant KING OF COMEDY, you'll still be shocked by the depth and delicacy of his performance in the title role, a man whose life begins to unravel after the death of his beloved wife of 60+ years, Eva -- beautifully played by Clare Bloom.<br><br>Lewis has been prepping for his role for more than 3/4 of a century and he lights up the screen. Seeing his work here makes me wish he'd done more than the slapstick comedies that made him an icon. He's a damned fine dramatic actor.<br><br>Writer-Director Daniel Noah has crafted a story that is at once tender, heartbreaking, honest, textured and captivating. It is that rarest of things - an actual \"movie\" with a plot and compelling characters.<br><br>Noah allows Jerry to pay subtle homage to his own past without overshadowing the heart, the drama or the honesty of Max's odyssey. <br><br>The supporting cast is excellent, notably a group of 80-somethings including Mort Sahl and Rance Howard.<br><br>Daniel Noah is a filmmaker to be reckoned with. I hope this film brings him the success he deserves.","user":"Sgolds23","rank":[58,68]},{"title":"Touching, moving and funny...","rating":8,"date":"19 June 2013","review":"Before the screening began, we were informed that the print we were about to see was a work in progress. All the usual provisos were announced: \"We're still editing, the score is temp, it's not fully color corrected\" and so on. While I normally wouldn't write a review of an unfinished film, I was so touched and moved by this film, I can't help but share my thoughts.<br><br>As pretty much everyone knows, \"Max Rose\" marks the return to the screen of film and television legend Jerry Lewis, who has not been in a movie since the 1995 comedy \"Funny Bones.\" In \"Max Rose,\" he plays the title character, an 87-year old musician who has just lost Eva, his wife of over 60 years. As we first meet him, he shows the grief and pain of a man who has had his entire world ripped away from him. The attempts of his son Christopher (Kevin Pollak) and granddaughter Annie (Kerry Bishé) to console him are dismissed. It is at Eva's funeral that we learn Max is experiencing much more than the normal pain associated with losing a spouse. In the midst of his eulogy, Max declares himself a failure, and his 65 years of marriage a lie. <br><br>Just after Eva's death, Max had found a compact while going through her possessions. Inside that compact was a very intimate inscription to his wife from another man, with the date corresponding to a time in 1955 when Max was away from home, recording an album. Max is sure that Eva was unfaithful to him, and he embarks on a mission to find out more about the \"other man.\" He tears the house apart, looking for anything that will lead him to the identity of Eva's mysterious suitor. <br><br>A health scare makes it clear to Christopher and Annie that Max can no longer live alone, and they make the agonizing decision to put him in an assisted living facility. <br><br>In the facility, Max makes the acquaintance of three colorful residents (Mort Sahl, Lee Weaver, Rance Howard) who help to slowly chip away at Max's issues and insecurities, and to find a resolution to the doubts that plague him.<br><br>\"Max Rose\" is an amazing, emotional journey that is tender, moving and insightful. At times there are moments that are quite funny, made even more so by the fact that the humor is never forced nor is it there as an homage to the film's star. The laughs come from a very real place and are inspired by the story.<br><br>Watching Jerry Lewis in this film makes one wish he hadn't spent so much time away from the screen. Even in moments with little to no dialogue, his eyes and movements speak with more emotion and eloquence than a Shakespearean actor delivering a five-page monologue. This is a role that Lewis has seemingly lived his entire life to portray, and he holds nothing back. The biggest compliment I can pay is that I never felt I was watching Jerry Lewis, but rather became absorbed, entwined and totally involved with a man named Max. Lewis is in virtually every scene in the film, a Herculean task for any actor, much less one of his advanced age. There is not a false note to be found in his performance.<br><br>The supporting cast is impressive, and they inhabit their characters with the same talent and dedication as Mr. Lewis. Kevin Pollak portrays Max's estranged son, and while we have seen this kind of dysfunctional relationship presented in many films and television shows, Pollak makes the audience feel the pain of a man who desperately want to connect with his father before it's too late.<br><br>Kerry Bishé, recently seen as part of the ensemble cast of \"Argo,\" comes into her own as Max's loving granddaughter. Their private moments are some of the film's most charming scenes, and they are a clear indication of the love Max is still capable of. Annie wants nothing more than to comfort and care for this man she adores and idolizes. Max allows her to get closer than anyone else, but she's still frustrated at his refusal to deal with the schism between father and son, and concerned with his fixation on Eva's unknown admirer. <br><br>Seen in flashbacks and fantasy conversations, Claire Bloom portrays Eva, and she is luminescent. One can easily comprehend why Max would spend a lifetime devoting himself to this woman, and why the thought of her being unfaithful would crush him so completely.<br><br>In smaller, but key roles, the rest of the cast make the most of their screen time. Mort Sahl, Lee Weaver, Rance Howard, Fred Willard, Illeana Douglas and Dean Stockwell all deliver textured performances that more than enhance the story.<br><br>It is hard to believe that this is only the second effort of Daniel Noah as a director (he also wrote the screenplay). He handles his cast with practiced ease and skill, no small feat considering the legendary pedigree of his star. <br><br>At its heart, \"Max Rose\" is a heartwarming story that celebrates love, between spouses, between families and friends. Noah shows us that love knows no boundaries, and is certainly not diminished with age, but only grows stronger. The elderly are portrayed as they should be- as real human beings, with dignity and strength and humanity, not as the doddering old fools we so often see on screen. The characters that populate the world of \"Max Rose\" are people we all know and love. This is a film that should be seen and appreciated by audiences of every generation, both as a beautiful cinematic experience, and as a reminder to truly appreciate those we hold most dear to ourselves. Well done, Mr. Noah. Well, well done, Mr. Lewis, and welcome back.","user":"michae9962","rank":[25,32]},{"title":"Well worth the long wait...","rating":8,"date":"17 January 2017","review":"Back in 2013, Jerry Lewis did something many people never expected he made a film. Think about it87 years old and making yet another movie after a long absence from the big screen. Millions of fans about the world were eager to see this film and apparently it made a big splash at Cannes. However, oddly, the movie sat on the shelf for three more years—with no release and folks wondering what happened to the picture. Then, inexplicably, in late 2016 the film was released.but only to a tiny number of theaters! Why?! Why the long delay and then why the incredibly limited release?! Here where I live in Florida, I couldn't find any place to see this film and I was really anxious to see \"Max Rose\". Thank goodness we can all finally see the film, as \"Max Rose\" finally, finally, finally is out on Netflix and you can stream this excellent film in the comfort of your own home.<br><br>The most important thing you need to know about Max Rose is that it's not like any of Lewis' other films. It's definitely not a comedy and it stars Lewis but was written and directed by Daniel Noah. So folks hoping to see a Nutty Professor style film will be terribly disappointed. As for me, I didn't mind at all, as I've always thought that Lewis' dramatic roles have been among his best— such as in \"The King of Comedy\" and the amazingly good made for TV movie, \"Fight for Life\". <br><br>The other thing you really need to know about \"Max Rose\" is that it's very slow and deliberately paced. It clearly is not for everybody and plays much more like an indie film than anything from Hollywood. So if you are looking for pratfalls, laughs and excitement, then you might want to pick another movie. I actually enjoyed the movie very much but must admit there were a few slower and even painful patches.<br><br>The story is about a man who, naturally, is named Max Rose (Lewis). The film begins with the death of his wife of 65 years and Max is beside himself with grief as well as not knowing what to do with himself. He also soon becomes very confused and angry when he finds something which would seem to indicate that early in their marriage, she'd been unfaithful to him. So now, on top of his loneliness and major upheaval of his life, Max is forced to come to terms with who his wife might have really been---all coinciding with his being moved to a retirement community.<br><br>I enjoyed this movie for many reasons. Foremost is that movies tend to ignore the elderly and their problemsas if, somehow, by not thinking or talking about this we might somehow be able to avoid old age ourselves. I love that \"Max Rose\" confronts aging and death head on and never flinchesand I really respect that. Additionally, Lewis was great in a very underplayed and introspective sort of performance. In a word, he was believable. And finally, it's just so nice to see Jerry Lewis back on the screen and makes you wish more of our aging stars were not only in our hearts but doing what they love mostworking and entertaining us all.","user":"MartinHafer","rank":[8,12]}]