[{"title":"When Daniel Craig met Rachel Weisz","rating":7,"date":"20 November 2013","review":"I was certainly interested in seeing \"Dream House,\" since I just got back from seeing this couple in \"Betrayal.\" Let me tell you, from a strictly visual point of view, both of them are gorgeous, not to mention both wonderful actors on stage and on screen.<br><br>I gather from reading a few reviews that this film suffers from the director having the final cut taken from him, a bad trailer, and being incorrectly advertised.<br><br>I had never heard of it until I rented it. It's a thriller about a man named Will Attenton (Craig) who quits his job in order to spend time with his wife (Weisz) and two daughters. They have bought a place away from the city, but they didn't know that three of the previous four inhabitants of the house had been murdered by the husband and father. After some strange happenings, Will tries to find out what happened, which includes going to the institution where the father, Peter Ward, was sent after the murders. He was incapable of standing trial. What Will finds out is a huge shock.<br><br>I actually liked this film, and I would have liked to have seen the director's cut, since apparently the actors were all up in arms about Jim Sheridan not being permitted to do what he wanted with the final product.<br><br>I think for that reason, it's a tad confusing, nothing that a second viewing wouldn't solve. It's not as bad as it's been reviewed to be, and I think one poster was right - people were expecting a horror film and were disappointed. Well, I will never be disappointed about not seeing a horror film. And I'm a sucker for Daniel Craig.","user":"blanche-2","rank":[27,27]},{"title":"Y'all crazy, it's good.","rating":9,"date":"26 February 2013","review":"Am I the only one that really liked this movie? Am I the only one that thought it was insanely clever, with a sick double-twist ending? Maybe not, but from the other reviews it seems like I'm one of the few! I agree with the other review - I watched this because I thought it was a horror movie, and it is much more of a psychological creepy awesome movie. But it's good, enough said.<br><br>Daniel Craig and Rachel Weisz are great, enough said.<br><br>Written really well, and directed well. Once you think 'ah, nice, cliché, I see the ending' - nope! Give it a shot, it's a really great movie. I feel like with a few modifications it could've been even better, on par with The Sixth Sense, but it was still great. I'd watch it again.","user":"wesawyournoobs","rank":[90,110]},{"title":"A decent thriller that was advertised wrong","rating":7,"date":"9 November 2011","review":"The previews and commercials for Dream House led one to believe it was a horror film, it is not, not at all. I think that is where a lot of the disappointment is coming from. It is a pretty good thriller, once you get used to the fact that that is what you are watching. The storyline, basically that horrible things have happened and we the audience have to figure it out along with the main character, is not the tired thriller standard, or at least the details are different enough to not seem tired. It's actually intriguing and the answer to the mystery is not obvious miles out, even if the climax sort of is. The acting is really quite good too. People who like mystery thrillers should enjoy the film, fans of scary movies will mostly not like it.","user":"Nysa11","rank":[132,165]}]