[{"title":"The Wolverine","rating":8,"date":"12 February 2020","review":"Wolverine plus Samurai makes a pretty good combination for me. A great film that is based on the X-Men comic books and movie series.","user":"MR_Heraclius","rank":[39,40]},{"title":"WORST X-men movie ever (by far).","rating":3,"date":"27 July 2013","review":"Usually plot holes are isolated. This movie was however one giant plothole. <br><br>(1) Grandpa<br><br>This is what I understood at the end of the movie: Turns out Grandpa is a bad ass who just wanted to magically suck Wolverine's healing powers and live forever. So what he did was (i) Invite Wolverine to Japan; (ii) Fake his own death; (iii) As part of his plan (?) inject a spider onto Wolverine's heart so that he loses his healing powers--What in the world did this achieve for evil Grandpa?; (iv) As part of his plan (?) allow his granddaughter to be subject to multiple assassination attempts, just so that Wolverine will keep following her; (v) Then after leaving a trail of crumbs for Hansel and Gretel, captures his granddaughter, and lures Wolverine to some sort of lair, where his powers can be sucked.<br><br>The (?)'s indicate where I am not sure if it was really part of Grandpa's plan or things just worked out this way. <br><br>Given the tremendous amount of uncertainty involved in the above plan (e.g. Wolverine might've been killed, in which case no powers to suck; his granddaughter might've been killed, in which case end of story, and Wolverine would've returned to the Yukon to chill out with grizzlies), you'd think there'd been a simpler and cleaner way to do all this. But no. <br><br>All this is quite forgivable, compared to other things that went wrong. <br><br>(2) Viperwoman<br><br>What the hell is motivating her? What does she want? Is she working for herself? Or is she working for Grandpa and if so, why? <br><br>How did she inject the spider onto Wolverine's heart? Just by kissing him in the middle of the night? (This was never clarified.)<br><br>(3) Japanese Father and Japanese Fiancé<br><br>OK so it turns out the whole family (except pretty granddaughter) are a bunch of one-dimensional assholes. This is clichéd and boring and stupid, but still acceptable if you at least make some effort explaining what exactly was motivating them. <br><br>Japanese Father wants to kill his own daughter just because Grandpa willed her everything? (Oh, and this too was part of Grandpa's grand masterplan?)<br><br>Japanese Fiancé is just some asshole who's engaged to pretty granddaughter (this, BTW, is explained for us gaijin simply by the line that \"You're not Japanese, so you won't understand\"). He's the minister of justice or something. And he likes to have white hookers in his hotel room. Uh, and what else do we know about him? Nothing! Basically he's just some asshole who somehow wants to do bad things. <br><br>There are many other things wrong with this movie. E.g.,<br><br>(4) Totally artificial and forced chemistry between Wolverine and pretty Japanese granddaughter.<br><br>I literally cringed whenever they hooked up. <br><br>(5) Jean Gray bad dreams BS was just LAME<br><br>I can think of only two things I liked about the movie: (A) The Nagasaki A-bomb scene. Pretty sick, think it's the first time I've seen it portrayed up-close in any movie. (B) The black ninjas, doing their thing in the middle of the night and flying across roof-tops.<br><br>Other than that this movie was total scheisse.","user":"chunkmeal2","rank":[469,664]},{"title":"You know you are a bad director when:","rating":3,"date":"10 August 2013","review":"You know you are a bad director when...<br><br>you negate the conclusion of the previous movie.<br><br>your plot makes absolutely no sense whatsoever.<br><br>you have more plot inconsistencies than Swiss cheese.<br><br>your favorite X-men character fights and moves with the grace of a rock.<br><br>your favorite X-men character acts like a cretin and his decisions are abysmally bad.<br><br>your favorite X-men character gets totally owned by a... ¿corporate samurai?.<br><br>your favorite X-men character loses his power more than half of the film.<br><br>your favorite X-men character cuts a tree with an axe and then gets tired.<br><br>you can cut adamantium.<br><br>you can drill into adamantium.<br><br>your adamantium cutter fails to cut flesh.<br><br>Japanese swords can withstand adamantium.<br><br>your villain is not even clownishly developed.<br><br>your villain has absolutely no motivation for how she acts. NONE. Worst villain ever.<br><br>your villain sheds her skin for no reason.<br><br>inexplicably you can suck a mutant of its power with a giant adamantium suit.<br><br>you kill a bear for no reason.<br><br>grandpa is a douche for the completely wrong reasons.<br><br>you take 50 rope arrows to your back and not try to get lose.<br><br>you have an awesome army of ninjas, yet in the end they decide to go on a sudden camping trip.<br><br>!!!!! you perform heart surgery on yourself, even if you can't heal back !!!!!<br><br>you don't pass out during heart surgery on yourself, but scream with excruciating pain when someone cuts your nails.<br><br>you live after performing heart surgery on yourself.<br><br>the best scene in the film is a scene after the credits.<br><br>you force a love relationship that is somehow immoral and has no meaning or conclusion.<br><br>your film has an ending without any conclusions; except Wolverine now has crappier claws.<br><br>You know you have a successful PR when:<br><br>people still pay to see this mess.<br><br>Be warned.","user":"MisterHOH","rank":[331,470]}]