[{"title":"You've already seen the funny parts","rating":6,"date":"22 January 2014","review":"I love Kevin Hart don't get me wrong. His stand up is hilarious and I also love Ice Cube's movies AND the two of them have great chemistry on screen and all but....it wasn't that funny. This movie had its' funny parts but the problem is most of them you already saw on the preview. This won't go on my list of funniest movies I've ever seen but it had decent action and decent humor. It had a little twist toward the end but thinking of the premise movies like Meet the Parents were funnier or Twenty one jump street or The Heat but what can I say it was filmed well and the two of them together provided enough entertainment so the film is worth a watch.","user":"doofuspoofus","rank":[51,62]},{"title":"Hart gets to do what Hart does best","rating":6,"date":"28 August 2014","review":"Ride Along with Kevin Hart and Ice Cube isn't reinventing the game but Hart is hilarious and worth the watch.<br><br>Ben is trying to win over his girlfriend's brother James, so James invites him on a 24 hour Ride Along patrol. Ben thinks it's to get to know him but James is really trying to scare him away.<br><br>Technically speaking the plot is about how Ben interferes while James tries to capture a leader of a crime syndicate Omar while on the ride along. Really the ride along is just excuse for insane situations to occur within that setting.<br><br>Long term this movie will probably be pretty forgettable. As a comedy it is consistently funny and reminiscent of old school improv riffs with the antagonizing eccentric and the straight man. Kevin Hart gets to be absolutely ridiculous, per the usual as Ben: running his mouth, acting a fool, letting self deprecating jokes happen at his expense. I'm a huge fan of the character Kevin Hart has created – while it is the same in every movie it is enjoyable in every movie. Ice Cube is a good polarity as James to Hart's Ben. His smile muscles might be broken. At times he might even be too serious detracting from the chemistry of the duo.<br><br>The situations these temporary partners get into are random and feel like filler but are funny comedy routines and I'm glad they are still in the film. In an ideal world the writers would've cleaned up the script for a more believable story. Despite this Ride Along is definitely worth the rental just for Hart's antics.<br><br>More reviews at our website!","user":"ArchonCinemaReviews","rank":[12,15]},{"title":"Fun buddy comedy","rating":7,"date":"18 October 2014","review":"When you think of Ice Cube you think of the hardcore rapper from NWA, the gangster persona, not complex actor. Yet since becoming an actor Ice Cube; real name (O'Shea Jackson), has developed himself into quite the character actor. The comedic prescence of Kevin Hart and this budding police comedy brings the movie full tilt. There is a great story line that suggests looking for comfort and approval betweent Hart's character and Cube's. There are hilarious comments throughout the film and the writing was quite original. This is a great movie with strength in the plot, the characters and just fun throughout. There is no doubt I would highly recommend this to everyone. Kevin Hart is becoming the fast uprising comedic actor of late.","user":"torstensonjohn","rank":[9,11]}]