[{"title":"Alternately quirky and affecting, this heartwarming movie with its laid-back charm and deadpan humour is anchored by a virtuoso performance by Sean Penn","rating":7,"date":"31 March 2012","review":"Is there a role which eludes Sean Penn? In Italian director Paolo Sorrentino's English-language debut following his 2008 Cannes hit 'Il Divo', the two-time Academy Award winner takes on an unlikely comedic role as an over-the-hill pop star named Cheyenne and pulls it off with aplomb. Indeed, even though the movie never does quite come together as a cohesive whole, Penn's brilliant performance more than anchors the entire film, and you'll find yourself hard-pressed to take your eyes off him.<br><br>To say that Penn owns the entire movie is not an overstatement- right from the start, Penn mesmerises with a bizarre get-up consisting of a jet-black fright wig and all-black lipstick and eyeliner even in the comfort of his own sprawling home. As is typical of such characters, Cheyenne suffers from depression, and besides doing the groceries while his fireman of a wife (Frances McDormand) is off at work, spends most of his time in the day hanging out with a spunky teen Mary (Eve Hewson) at a café in a shopping mall.<br><br>Purpose is what is lacking in his life- haunted by the suicide of two brothers who said they were inspired by his lyrics, Cheyenne has not been able to return to his music since. For the first half hour, Sorrentino familiarises his audience with the idiosyncrasies of his lead character as well as his marriage with his wife Jane, and thanks to an empathetic performance by Penn, your heart will go out to this lost soul searching for that elusive thing called meaning. It is testament to Penn's flawless performance that you'll still feel the warmth and heart behind his character's eccentricities.<br><br>Cheyenne awakens from his stupor when he gets news that his father is dying and promptly makes the travel by cruise- because of his fear of flying- to New York. Unfortunately, he arrives too late, missing the very last opportunity to connect with the father he has not spoken to in years. So when his cousin Richard (Liron Levo) informs him that his dad was obsessed with tracking down a Nazi war criminal at Auschwitz named Aloise Lange (Heinz Lieven), Cheyenne takes it upon himself to complete his father's mission.<br><br>And so begins a road trip across the United States, each pit-stop in Michigan, New Mexico and finally Utah offering memorable encounters with locals that in their own way serve to give him closure and reconciliation. Mirroring Cheyenne's own inner transformation, Sorrentino adopts a measured pace as Cheyenne meets a history teacher (Joyce Van Patten), a war widow (Kerry Condon), his dad's fellow Nazi hunter Mordecai Midler (Judd Hirsch) and finally of course Lange himself. Less patient viewers will probably be frustrated, but those willing to accept the laid-back tone of the film will find Cheyenne's journey a rather therapeutic one- especially in its closing lesson on the importance of learning to let go of the past.<br><br>Sorrentino, who co-wrote the script with Umberto Contrarello, also lightens the mood of the film with some well-placed deadpan humour, delivered with panache by Penn. A scene where Cheyenne meets a gaggle of women in the lift discussing which brand of lipstick is best and finally gives them due advice just to shut them up is sharply hilarious, while his well-meaning attempt at match-making Mary with an earnest shopping mall staff proves sweet and amusing. But through the varying types of humour, it is Penn's unpretentious acting that makes them work- with a recurring gesture of Penn casually blowing a wisp of hair falling across his face perhaps the most consistently delightful narrative device. Among his co-stars, McDormand shines in her role as Cheyenne's wife, and a sequence where she is practising tai-chi in her lawn while distracted by her husband in the upper window one of the best moments in the film.<br><br>For rock fans, the participation of David Bryne is no doubt a highlight in itself, and Sorrentino pleases his fans with an extended concert scene that has the rock star performing the title song of the film while a woman in a room that reflects a period setting floats above the crowd. Nonetheless, for us cinephiles, the delight is in watching Sean Penn take on an unlikely comedic role in spite of his dramatic credentials. If it isn't yet apparent, we'll say it again- Penn's flawless performance is good enough reason to visit this place, and it's one that is warm, touching and unexpectedly affecting. <br><br><ul><li>www.moviexclusive.com</li></ul>","user":"moviexclusive","rank":[57,71]},{"title":"Surrender into it's reality","rating":10,"date":"13 August 2012","review":"I'm a DVD man.Films are my most important relaxation methodology. For me, the whole purpose of a film is to transport me into another reality, even a 'factually historic' film does this, for that reality was never subjectively mine. Occasionally a film comes along that is so incredible in it's ability to 'transform my reality' that it becomes embedded not only in my memory but leaves laser-like traces sparkling in my consciousness.<br><br>This was such a film for me.<br><br>No spoilers here, but some aspects of the photography are amazing,simply beyond surrealistic,more glowingly minimalistic in their utter magnificence. How the hell can you make a supermarket shopping trip into an adventure journey through a time-warped window of photographic beauty? Watch out for the car at the gas station scene. It's a visually structured scene that hit my eyes with astonishment.<br><br>The acting is superb.Yet, that word seems so inadequate to describe Sean Penn's utterly mind-blowing performance. I had to keep reminding myself that this was Sean Penn and these continued reminders simply made his performance all the more brilliant.<br><br>In the manner of an 'old Master',Paolo Sorrentino places layer after layer of subtle strokes to compose a mesmerizing work. He takes his time about it, as though each stroke of his brush must be precisely executed so that the whole may be that 'other reality' I seek in my film watching.<br><br>If you will watch this then you must prepare yourself to surrender totally into ' it's reality'- I found it well worth the capitulation.","user":"KexUK","rank":[53,70]},{"title":"2011 Best!","rating":10,"date":"25 October 2011","review":"I can't lie, i was expecting a \"normal\" movie by an Italian director, like Muccino's movies- not great, a little weak here and there and kinda boring-! \"This Must Be the Place\" instead is a great flick, probably the best movie of 2011, great story, amazing acting, a photography that leave you speechless. It's a must see. Plus it make you smile, it's ironic, Sean Penn has fun with his character, he plays with it, his moves and his voice are always perfect, it good to see an actor in such a great shape. This is one of those pictures that remind you why going to the movie is such an amazing thing to do!<br><br>Ciao ciao, Alberto","user":"creolalbe","rank":[100,154]}]