[{"title":"An Excellent Adaptation of \"Unfilmable\" Lovecraft","rating":26,"date":"26 July 2011","review":"In 1928, Miskatonic University folklore professor Albert Wilmarth enjoys debunking theories of the occult, even though he is roundly trounced – on radio, no less – by Charles Fort when they have a debate on whether certain stories in Vermont that have come to light following a flood are based in fact. He has also been carrying on correspondence with an intelligent, yet fearful, farmer in Vermont, who insists that the strange beings seen in the floodwaters are real, and are all around his farm. Wilmarth is curious, especially after he finds the original manuscript of a very rare book of folklore collected in Vermont back in the 1800s, containing stories which seem to correspond to what his farmer correspondent, Henry Akeley, has described in his letters. So when he receives a strange letter from Akeley that completely up-ends the farmer's previous fears about alien creatures and that invites Wilmarth to come to the farm to discuss the wondrous things that he has learned, well, Wilmarth can't possibly turn the invitation down. But when he arrives in the hills of Vermont, the local folk he meets all seem downright hostile, and when he arrives at the farm, he finds that Akeley himself is not well. And that is just the beginning of the discoveries that await him....<br><br>This film, created by a collective called the HP Lovecraft Historical Society, is clearly lovingly made – done in black and white and in the style of the early 1930s, it tells one of Lovecraft's more evocative tales and then expands upon it. (Lovecraft's story ends at about the one-hour mark of the film, which continues for another 40 minutes or so.) The atmosphere is terrific, and the style of the story-telling really permits the audience to feel themselves back in the early 1930s, even up to the various mad-scientist gadgets that evoke such classics as the lab in the original \"Frankenstein\" film. The monsters are more or less what one might expect to see in an early 1930s film based on an HP Lovecraft story, but that doesn't make them any less menacing or eerie. You don't need to be a Lovecraft fan to love this movie, though it wouldn't hurt; you probably don't even need to be a fan of old movies. You just have to love movies, especially ones with great atmosphere and straight-up acting and a storyline that keeps you involved every step of the way. Highly recommended!","user":"alisonc-1","rank":[53,57]},{"title":"Sandy Petersen likes this movie","rating":10,"date":"26 October 2011","review":"I'm Sandy Petersen, and some people know me as a game designer (I wrote the original game Call of Cthulhu, for instance). I helped fund The Whisperer in Darkness, though I had no creative input (and expected none). <br><br>The movie is, in my obviously prejudiced opinion, a masterwork of taking an unfilmable Lovecraft story, and getting it not only on film, but in such a way to make it accessible to those who have not yet read the tale. <br><br>I don't understand the reviewer who says it seems like a mishmash of Lovecraft - has he even read the original tale? This movie was taken straight from it. Some characters are added to dramatize events which, in the story, are in the form of posted letters, but that certainly doesn't hurt the film. Yes there is a lot of dialog, but the camera is not static - things move, shadows lurk, and the dialog itself is terrifically ominous. <br><br>It does not follow the near-standard Hollywood 3-act-play sequence, to its everlasting credit. Instead the sinister elements keep building steadily until they reach a climax and even feature an artsy epilogic montage. Just as with the story, the evidence before Albert Wilmarth (the main character) keeps growing until he can no longer deny his eyes. Even the revelation of the alien horrors is done bit by bit. First we see a footprint, then a blurred photo, then a shadow on a wall, then on a curtain, then a single leg, then a brief shot of one walking offscreen behind some humans. Ultimately we see them fully and they are worth the wait. <br><br>But it's not just the aliens - every element of the story grows in this manner. As you learn the alien plan bit by bit, the horror and tension mounts. <br><br>Every death in the movie was unexpected to me. As a long-term expert in horror films, I'm used to being able to peg who lives and who dies often in the opening credits, so this was a nice surprise. <br><br>The movie has subtlety and class. One good example is the scene with the young girl, Hannah. Albert Wilmarth is hiding out with her in a barn, trying to avoid detection. He converses with her, and tells her of his own daughter, who died of influenza years ago. The scene is touching, but just before it degenerates into bathos, he offers to sing Hannah a song which he once sang to his own child, and Hannah shakes her head, and says, \"No\". Just in the nick of time! I saw an early version of the film, and this scene with the child is what convinced me to invest my money in this movie. The whole thing is very professional. <br><br>It is not an action film, though it contains action. It is a cerebral horror film. There are no \"boo\" moments, and every moment segues logically into every other. It is a tightly knit coherent hole.","user":"spetersen-79-962044","rank":[45,49]},{"title":"Weird Doings Among the Green Mountains of Vermont","rating":8,"date":"25 January 2013","review":"One cannot help but give full marks to the H.P. Lovecraft Historical Society for their efforts to bring H. P. Lovecraft's eerie stories to the screen in a manner in keeping with the texture and mood of the original material. Although there have been other attempts to film Lovecraft stories, most have generally been unsatisfying failures due to misguided attempts to modernize or glamorize them. Not so with HPLHS, who have gone out their way to keep faithful to the period and locales in which the tales were set, even going so far as give the film the feel of an early-1930s black-and-white movie. Even their logo is an homage to the the old Universal Studios logo of the early 1930s (the studio which produced such classic horror movies as Frankenstein, Dracula and The Mummy), replacing the familiar airplane-circling-the-earth with a dirigible.<br><br>The plot involves Albert Wilmarth, a college anthropology professor specializing in folklore, who becomes intrigued by a series of unusual newspaper stories reported from a rural part of Vermont after a period of particularly heavy rains. It seems that bodies have been observed washing down from the mountains in the swollen rivers, bodies which are, reportedly, neither human nor animal. The bodies apparently also recall, among the older inhabitants, old tales of strange beings that live in remote parts of the hills, beings that are neither human nor animal, and possibly not even of terrestrial origin. Wilmarth begins his investigation into these stories on the basis that they are nothing more than mere interesting folklore, but soon finds himself dealing with something far more sinister. <br><br>Admittedly, the producers of the movie added some material and characters not present in the original story. In fact, the short story actually ends at a point only about one hour into the film. However, the original version was, after all, only a short story, and I suppose the makers felt that they had to add some material to the plot in order to expand the short story into a full-length movie. nevertheless, the movie still does a far better job of evoking the feel of H.P. Lovecraft's writing than any other movie versions of his works, with the only possible exception being the resent silent film version of The Call of Cathulhu, which was made by the same producers.<br><br>One addition to the film is a debate staged between the protagonist, Professor Wilmarth, and Charles Fort. While that was not a part of H.P. Lovecraft's original story, it is interesting period touch because Charles Fort was actually a real person, a celebrated and controversial author of the early 1900s who was known to contemporaries as \"The Mad Genius of the Bronx\". Fort, who died in 1932, wrote about what are now called paranormal phenomena before that term was even invented, and is credited, among other things, with coining the word \"teleportation\".","user":"robertguttman","rank":[14,14]}]