[{"title":"chicken burrito and kentucky fried chicken","rating":2,"date":"27 April 2012","review":"This is my first ever review on IMDb and after watching this movie a few hours ago I was compelled to register on IMDb so I could play the Battleship guessing game with you (similar to the original Battleship, only that it's not).<br><br>Q1: How does a radio telescopes work? Do they <br><br>A - Detect and collect data on radio sources <br><br>B - Shoot some type of visible light laser beam to another solar system in the hope to communicate with aliens?<br><br>Answer: B - It's hard for someone to imagine how a signal is sent. <br><br>Q2: What would be the best way for an alien ship to travel once on earth? <br><br>A - Fly <br><br>B - Hop on the water (in one direction) like a cross between a water strider and a frog<br><br>Answer: B - Also staying true to their weapons system which only work line of sight.<br><br>Q3: Once the alien destruction robots are launched to attack and weaken the human defense, do they <br><br>A - Destroy 20 unarmed helicopters <br><br>B - Ruin a field where kids are playing baseball <br><br>C - Destroy the only remaining docked Battleship equipped with Harpoon and Tomahawk missiles <br><br>D - Attack some concrete pillars holding up a section of a freeway<br><br>Answer: A,B,D - Who would ever think that the USS Missouri had a better chance of attacking the aliens as opposed to a freeway.<br><br>Q4: Your a bad-ass alien who traveled ten's of light years to take over another planet, what do you bring as a personal weapon? <br><br>A - A ray guy than can evaporate anything in sight <br><br>B - Any other type of projectile weapon <br><br>C - A knife that looks like a screwdriver<br><br>Answer: C - The only weakness being that it takes this weapon 20 seconds to warm up, giving a double leg amputee enough time to walk up to the armored alien kick-box it in the head and take off it's helmet.<br><br>Q5: The humans have fired a tomahawk missile at your alien ship. What do you do? <br><br>A - Try to shoot it down with your own weapons <br><br>B - Try to maneuver your ship out of the way <br><br>C - Have your alien ship hop directly into the missile<br><br>Answer: C - Oh yes that's right the alien ship is only equipped with grenades and it can only move in the direction it is facing. <br><br>Q6: Your building an alien war ship that will be used to take over a planet. What material do you use to protect the bridge? <br><br>A - A type of super strong metal <br><br>B - Glass<br><br>Answer: B - Taking over a planet is not so easy when a few sniper rifle rounds breaches the hull on the bridge and kills the alien commander. <br><br>If you got 0% then watch the trailer and save yourself from having your intelligence insulted.<br><br>If you got above 1% then steal a chicken burrito, become captain of the navy in a few years and save the planet from an alien invasion by taking commands from an officer 20 ranks below you.","user":"mmxool","rank":[617,814]},{"title":"What \"Battle LA\" could have been.","rating":7,"date":"1 June 2012","review":"OK, first of all, yes, this movie has more holes than the surface of the moon. Some of the plot points, tactics, technical gaffes, etc. etc. etc. are so bad and stupid as the be insulting. Seriously, if you are up on your military technology at all it's best to go to this movie seriously drunk so that you won't care about the dumbness.<br><br>That said, it's actually a pretty fun movie. And, yes, I think it's better than Battle Los Angeles or even the latest Transformers. Why? Because this movie didn't make the same critical mistakes of trying to have Acting in the damn film. Nothing slows down a good action flick like a damn love story in the background, or the hero dealing with his feelings or, worse still, putting brats in the line of fire. Battleship had none of that - just a bunch of thick-headed do- gooders doing what they do best and not really learning a whole lot about anything, including themselves, in the process. <br><br>Another thing I like is that there is an appreciation for the warships and the people who serve on them. The timing of the ACDC music for the going-into-battle scene is perfectly done. You can't help but smile.<br><br>The alien technology is actually pretty imaginative and the animation is good. It's not as over- the-top as Battle LA - where there was so much going on you get overwhelmed. But when the aliens want something blowed up, they do so with conviction. Mind you, some of the technical deficiencies of the alien technology will leave you wondering how these creatures managed to cross a galaxy. But try not to worry about that - the writers sure didn't.<br><br>The cast is OK. Neeson is decent as the admiral or whatever, and even Rihanna does an acceptable job. We're not talking about \"Apocalypse Now\" kinds of performances, but it wasn't horrible either. It was at least semi-believable.<br><br>Look, this ain't no \"Bedford Incident\". But it's a pretty decent way to kill a couple hours and snarf down some popcorn. All the folks griping about the technical problems - well, it's all true - but who cares? This movie doesn't pretend to be realistic. Hell, in the credits it's \"Based on the game by Hasbro,\" so go in prepared and enjoy.","user":"gonzoville","rank":[162,209]},{"title":"If you fail to enjoy this movie, life sucks for you","rating":10,"date":"21 May 2014","review":"In reality a technologically advanced species would wipe us out within five minutes. Result? No movie<br><br>Therefore, this movie depends upon a sequence of improbable happenstances to allow it to progress<br><br>We have a suitably driven central character and a capable side cast who take up the spirit of the piece, which is essentially heroism in the face of extreme odds<br><br>If you cannot suspend your disbelief for the duration in order to feel the bravado humanity is genuinely capable of, you do not have the capacity in yourself<br><br>Your score for this movie directly correlates to how happy you are as a person","user":"duncan_ford","rank":[98,134]}]