[{"title":"Really Really Good","rating":9,"date":"2 December 2010","review":"All I can say is... Big Wow. Boy did I enjoy this film. The story-line is a cross between The Fugitive and a human heist plot movie. There were moments where I genuinely really didn't know which way the story would end. Has to be one of the best, if not the best film I've seen this year.<br><br>I just had to watch right through to the end. The only down side, were the roles of the 2 main cops. I'm not sure if 2 real cops would be as persistent. But I guess if they weren't, then the film would be a fair bit shorter.<br><br>I can't think of any other bad things about it, as it does what it is supposed to do, make you care about the characters and keep you gripped till the end. All in all very entertaining. <br><br>Definitely worth watching.","user":"blackledgec","rank":[324,382]},{"title":"Intriguing thriller","rating":10,"date":"11 January 2011","review":"The Next Three Days <br><br>The best films are those where you are introduced to characters who do the unpredictable believably, or people you think will be key players die in the opening scene, someone you least expect turns out to be the murderer, these are the films that keep you guessing and keep you involved. In Paul Haggis' intense thriller he chooses a wise and well crafted angle to lure you in and hold your attention. The development of John Brennan and his gradual transformation over time before your very eyes.<br><br>Meet John Brennan, he's a normal average working man, slightly nerdy even, living a fairly dull routine life. When his wife is imprisoned for murder John, as you would expect of a normal average slightly nerdy working man follows the rules of appeal in an attempt to win her freedom. Three years pass and the realisation that his wife will remain behind bars for life hits home. When normal people find themselves in hopeless situations desperation can drive them to do very abnormal things. <br><br>What Haggis works brilliantly into both his screenplay and direction is the gradual metamorphosis of Brennan's persona as he becomes fixated on breaking his wife out of prison. Brennan doesn't suddenly become the all American action hero capable of great feats of courage. We have a knowledge of his character from the beginning of the film and Haggis does not treat the audience as idiots, we know that Brennan cannot walk into a phonebox and there's a sudden change into superman. This would not work for John Brennan, the nerdy schoolteacher, what we see however is how little by little, piece by piece he falls more and more out of control, deeper and deeper out of his depth. We know this is not the normal behaviour of Brennan, but the screenplay is so well crafted and Crowe delivers the character to us perfectly that both the scenarios and Brennan remain at all times, believable. He makes tremendous mistakes and shows real human failings and frailties that as we ride along with him we're never far from the belief that it will all go very wrong, very soon. Haggis treats us to a wonderfully woven story that rolls along with ease, then suddenly the momentum builds into a Tsunami of real tension. Brennan is completely exposed and you fear for his outcome. <br><br>If a director can pull you into the story, make you care about a character, and if during the course of that film allow you to watch that character change in a very real and gradual way then he has delivered a truly great film.<br><br>Haggis' screenplay does not allow the audience to get ahead of the story. Developments are unexpected and plausible scenarios affect action and reaction. Some events have no bearing on the outcome but you cannot know which are red herrings and which are genuine avenues rather you find yourself wondering where this will all lead to, making The Next Three Days a complex and intriguing thriller very much in the cerebral and classical sense such as North by Northwest or Vertigo. <br><br>A tremendous, faultless film.<br><br>10/10","user":"Henry_Ireton","rank":[165,193]},{"title":"Tense and Entertaining, The Way They Used to Be...","rating":9,"date":"5 December 2010","review":"Russell Crowe is a pretty reliable star, one who commands the screen with intelligence and enough bravado to get away with a film like this. Somehow, audiences and critics are getting more demanding and expect brainier and tighter story lines, but it's still plenty of fun to see a light, crazy ride like this... One where the hero is besieged by unfortunate circumstances and must one way or another succeed or die. With the help of Haggis' strong direction and a very good performance by Crow, we're treated to two hours of action, where one doesn't have to do a lot of thinking, just watching Crowe dodge bullet after bullet and cheer him along to the nail-biting end.<br><br>The main reason the film works is Crowe gives it his best, scene after scene his eyes tells us his character is committed to his family, and he will stand by them no matter what. There is very little background given to us, except for an opening scene which serves the purpose of planting the seed of doubt in our minds, but this only helps fuel the sense of despair and sadness that threatens to destroy this family.<br><br>Little by little, we follow Crowe's teacher, as he races against the clock to help his wife, and soon enough, he is dealing with the scum of society and an increasingly suspicious police force. Relationships with his family are tense at best, and any new relationships are threatened his wife's past. It's the attention to this intimate and personal moments that makes us care for him, even when he makes a couple of disturbing moves.<br><br>One thing you won't be is bored, as the circle tightens, so that his quest might not get his desired results. Fine work is done by a cast that includes Brian Dennehy, Liam Nelson, and Jsson Beghe. This is what movies are made for.","user":"aharmas","rank":[201,237]}]