[{"title":"A movie about the most unlikable group of teens on a plane","rating":5,"date":"18 October 2010","review":"A female novice pilot who has no business driving a car much less flying a plane, decides to take the most unlikeable group of friends on a plane ride for reasons really unknown. Her mom died on a plane, so I guess she wanted to die too or something. her friends include the most annoying jock character written, a undeveloped boyfriend character (a most important character by the end for some random reason), a love lost emo and a shallow best friend. They end up in a mysterious cloud, things happen that really don't make sense and the ending you see coming a mile away. The main girl is a raging c-word to her pointless boyfriend (apparently this is a important plot point?). These kids sans the boyfriend remind you of the popular kids you hated in high school. The positives reviews Have to be plants from the industry. Avoid this film, the premise is awful and you end up wanting whatever it is in the cloud to eat them faster. Note to writers of these films, stop writing for the twilight, jersey shore crowd and make the characters quasi likable so the viewer can be emotionally invested, I was more sympathetic to whatever was in the clouds than these people.","user":"dragonkings01","rank":[135,177]},{"title":"Half-baked Idea ruined by bad script.","rating":4,"date":"31 October 2010","review":"First off-- the premise of the movie was intriguing: An airplane takes off for a trip with a young Girl Pilot and her friends. A mechanical mishap sends it off into a dark cloud in another dimension where dark things lurk.<br><br>THAT was the basic premise that caught my interest. A bit of Twilight Zone. A piece of Stephen King. A dash of Outer limits, maybe. . .<br><br>THEN I actually WATCHED the movie.<br><br>What ruined it principally was the casting: No, I don't blame the Actors themselves, but the Character/Plot premise that presupposes that any story stocked with good-looking young adults posing as Teenagers acting out the normal angst, trivia and emotional immaturity of Teenagers is somehow Must-Watch Movie-Making. Uhm. . NOT.<br><br>The second flaw was the script. Again, teen angst, teen bickering, off-the-cuff fist fights, Teen boyfriend-girlfriend drama and immature cursing may work in your generic stock Haunted House or dark abandoned Mental Institution, but NOT in the small cabin of a twin engine turbo-prop. And the fact that the titular star of the story, the young female pilot, spent most of her time facing BACKWARD and participating in the on-going fracas instead of FOCUSING ON FLYING THE PLANE adds to the unbelievability.<br><br>And I must say that while I know that what we call blithely 'Autopilot' automation is actually VERY ADVANCED Technology that is WAY BEYOND COOL today-- the several times that the pilot gets OUT OF THE SEAT (Remember, she HAS NO CO-PILOT) and CLIMBS into the back seat to have heated emotional showdowns while a plane FULL OF FRIGHTENED TEENAGERS Flies itself. . .and NO-ONE even says: WOULD YOU PLEASE PAY ATTENTION TO FLYING THE PLANE, LADY?!? That beggars belief.<br><br>The movie would have been a better, deeper thriller had it been cast with character-study adults as opposed to a bunch of bickering teens.<br><br>If you want to watch this-- Rent it - Don't Buy.<br><br>And rent it as a group event with your friends-- and be ready to tear it apart as the action ensues.","user":"Rabh17","rank":[38,49]},{"title":"Stupidest. Movie. Ever.","rating":2,"date":"18 November 2010","review":"First, this film is so technically ridiculous, a little research could have helped it a bit. But just a tiny bit. <br><br>If you're going to make a movie about four teens in a small airplane, maybe you could at least do some research on General Aviation 101-- since flying is the entire setting of your film. Like how a young pilot like that doesn't just rent a 6-seat twin engine plane like it's a Hyundai Sonata, while she doesn't even have her Instrument Rating (typically a must for planes of that size.) Then there are stupid script misses like the fact that our Pilot Heroine blames the plane's malfunctioning altimeter on \"magnetic disturbances.\" Altimeters are affected by air pressure. Not magnetism. Script bloopers like that abound in this one.<br><br>Come on, writers. It was like shooting a story set in New York City then showing the characters walk up to a hot dog stand...and order sushi. Bad research.<br><br>Technicalities aside, prepare for a lame flick that basically consists only of a bunch of teens yelling at each other that they're going to die. For an hour.<br><br>Some here say the film had an awesome Twilight Zone ending. Really? Where was it? There was an attempt at a twist-- but when the credits rolled, I still didn't even know what that supposed twist was supposed to be. (WARNING: POSSIBLE SPOILER!) Was there time travel involved? Ghosts? Sixth Sense type stuff? Huh? <br><br>And if you think that's dumb, you should see what great heroic act turns everything Hunky Dory. You'll gag.<br><br>Disappointing.","user":"tntpucca","rank":[36,52]}]