[{"title":"Such bad writing, what a disappointment!","rating":1,"date":"31 October 2010","review":"OK this movie was extremely disappointing. From the plot, do the characters, to the acting to the three 3D, it was one poorly written premise after the next.<br><br>The first thing that was stupid...The opening trap...This one left me feeling the writers purposely set out to make it stupid and unbelievable. The scene opens with hundreds of people walking by the window with three people tied up (you only see two of them until the trap begins). The reason jigsaw puts them in the trap was just plain stupid (two guys manipulated by one girl), and must have taken 5 seconds to come up with...Also, does anyone honestly think in such a public place, no one would notice two people tied to construction equipment??? And then, the only attempt from the crowd to save them was one small women trying to bang the glass with a briefcase, obviously the glass wasn't going to break and so that was it, no more attempts...Really?? And not only that, but everyone was watching like it was some movie, taking pictures with their camera phone...I was literally laughing in the theater at how stupid it was...In the end, the only person who died was the girl, who frankly, out of the three, deserved it most, and you didn't care at all...<br><br>Second thing that was stupid and totally not believable....Bobby's character or the main character...(Bobby was a guy who lied about surviving a jigsaw trap, so he could sell books and lead a publicized support group of real jigsaw survivors) This again made me feel like the writers just gave up and used the first idea that came to mind...Why was it not believable? Because if someone had gone through a jigsaw trap, there would have been a police report a thorough investigation, all sorts of documentation about what happened, where it happened, people involved, hospital reports about his injuries...So how he can write an entire book, get it published, do book signings, go on TV, lead a support group; without having any proof other than fake scars is BEYOND ME...<br><br>Not only that, but the decision to make Bobby's trap about going through a house and trying to help out his colleagues is completely unoriginal...(SPOILER) After everything unfolded and everyone died, I was left feeling that writers didn't want to make anyone live because then they would have had to think harder about the plot...Besides the characters in the traps are so thin and meaningless to the other characters, you really don't care at all when they die because they contribute nothing to the story line anyway...<br><br>Third thing that was stupid...Hoffman's character....His motive the entire movie was revenge on Jill tuck for putting him a trap...(Spoiler) His character for the entire movie was nothing more than a thug...He just walked around stabbing people in the neck until he got to Jill...I mean how freaking stupid is that? Again, I was left feeling the writers had no desire to put anymore thought into the movie and said \"Screw it, I'm done thinking about this movie...Let's just make him stab people in the neck and be done with it..\"<br><br>Fourth thing that was stupid...Gibson's character...In the past, Hoffman saved this cop's life (told to the audience via flashback) but then brutally killed Gibson's attacker, Gibson reported him for excessive brutality and Hoffman held a grudge ever since...STUPID premise!! (Spoiler) The goose chase Hoffman puts them on was retarded and required no thought...He led them to a room and they all got shot by a sub machine gun.<br><br>Fifth that was stupid...The ending and Doctor Gordon's character....(Total Spoiler) It was always rumored before Saw 7 came out that Doctor Gordon was still alive helping out jigsaw...So I was really excited to see how it would pan out...Man, what a disappointment...You see him once in the survivor support group for about 30 seconds and then doesn't show up until the last two or three minutes of the movie, where he attacks Hoffman....The writers decided that a thirty second flash back was all that was necessary to explain his involvement with Jigsaw, after that, he puts Hoffman in the room from the first movie (where Dr. Gordon originally hacked off his own leg) and shuts the door...You don't see him die! And the movie ends...<br><br>(Spoiler) But wait, what happened to Bobby? Nothing, he goes through each trap, trying to save the lives of his colleagues, but fails them all...He finally gets to his wife in the last trap, fails at saving her, she is burned alive and the last time you see him on the screen is crying in front of the furnace that is burning his wife. Out of any character in the movie, I really wanted her to live because she did absolutely nothing wrong...<br><br>So again, this movie was such a waste of time...The plot on ALL LEVELS felt rushed and meaningless, completely unoriginal and POORLY written....Perhaps I held it to a higher standard because the first one was BRILLIANT!!! and the others good, but it's really nothing more than a mindless slasher movie...In fact, the only thing I can say good about the movie is the traps are pretty cool...There are a lot of them, and they're creative...<br><br>All that being said, I am glad I saw it... because at least now, I have NO DESIRE TO SEE ANOTHER SAW MOVIE...If they come out with Saw vs Freddy or Jason; I'm leaving the country.","user":"courantesiii-782-91305","rank":[85,104]},{"title":"The Final Chapter Falls Flat (Spoiler-Free Review)","rating":2,"date":"29 October 2010","review":"\"If it's Halloween, then it must be Saw\" We've heard this tag line repeated over the years, and it's no surprise another Saw film has popped up into cinemas. There is, however, a catch to this installment: it's the final chapter. As a loyal fan of the series, I was excited last year with Saw VI and saw it as the perfect opportunity to end the series. Sure there were a few unanswered questions, but I didn't think it was worth another film to get the answers. Obviously, the producers disagreed with me and not only went for a seventh installment, but also gave into the latest 3D phenomena to cash in some bucks.<br><br>Financially, the producers put themselves in a nice position. There were tons of movie-goers paying to see Saw 3D. As far as credibility goes, the producers threw it out the window. Saw 3D is, without a doubt, the worst installment in the series. It's badreally badand I can't stress that enough. Not only does the film deliver a ridiculous plot, but it also fails visually, leaving movie goers with empty wallets and a short-coming 3D experience.<br><br>Saw VIIexcuse me, I mean Saw 3Dtells the story of Bobby Dagen, a Jigsaw survivor who makes profit from his grisly experience by writing books and televising interviews on television. He also acts as a counselor to surviving Jigsaw victims, guiding them towards psychological recovery. Life seems good for Bobby, until he is thrust into a horrific game where the goal is to save his wife before the timer hits zero. Meanwhile, Detective Hoffman hunts down Jill Tuck, seeking revenge over the events of the last film.<br><br>There's a lot going on in Saw 3D, and you honestly never get bored with it. There are eleven traps (the highest in franchise history) and the Hoffman and Jill story line is presented on the side. The problem, however, is that we've seen this all before. We've seen someone go through a series of tests against a timer, we've seen gruesome traps, and we've seen the now predictable twists. Not only is the material in the film recycled, it's poorly made. The plot is ludicrous, the acting is horrible, the traps lack creativity, and the 3D looks cheap and isn't utilized at all (pretty disappointing considering it was shot with 3D cameras).<br><br>Tobin Bell, whose character died in Saw III, is in the film for an estimated five minutes, possibly even less. Carey Elwes, who played the infamous Dr. Gordon in the original Saw is back this time around, but also has very limited screen time. It's a shame that a majority of the main characters are pushed to the side for Bobby Dagen's game, which in essence, turns out to be a waste of time. The traps are boring, the shock value has completely disappeared, and you ultimately don't feel for any of the characters in the film. All of these cons, along with the cheap 3D, make for a horrible film that shouldn't even bear the Saw title.<br><br>It's even difficult putting the blame on some of the film makers. Director Kevin Greutert was forced to return since Lionsgate had a clause in his contract for another film. He was set to direct Paranormal Activity 2, but was pulled in to Toronto a week before the filming of Saw 3D. He attempted vigorous re-writing of the script, but it proved to be difficult since a majority of the sets were already built. Greutert tries his best to salvage the film, but it ultimately falls into pieces due to the production and incoherent story line. Producer Mark Burg and writers Patrick Melton and Marcus Dunstan should be ashamed for giving into 3D and crazy fan theories online.<br><br>Overall, the only positive thing about Saw 3D is that the franchise is finally over. It's run its course, and while I expected the film to be poor, I didn't expect it to come to this. After following the franchise for six long years, I honestly feel betrayed and cheated after the final twist. The Saw franchise started with an interesting concept and ran with it, but it fell flat on its face at the finish line.","user":"Legend07","rank":[139,194]},{"title":"Anticlimactic and rushed FINAL CHAPTER Made the last 6 MOvieS PointLESS","rating":5,"date":"3 November 2010","review":"This movie was a huge letdown , publicity made me believe that this will be final piece of the puzzle which will connect all the previous movies, so i was at least expecting something more intelligent and a shocker twist of an ending, what we got instead seemed to be a rushed attempt to close all loopholes from the previous chapters.<br><br>I followed this SAGA not just because of the gore but also the story which i thought would end in a very epic scale ,this final chapter just offered more gore and took the simplest and easiest way out of the story, It felt like wasting a 7 year long wait for a good ending and instead we get a mediocre and Pointless one.","user":"ArmyOfAsh21","rank":[115,163]}]