[{"title":"Very underrated.","rating":9,"date":"5 May 2011","review":"I'm not often writing critics on IMDb, but when i checked the page of this movie I was really surprised that there were so few reviews.<br><br>I must confess that I haven't heard anything about this movie before I read that there will be free theater screenings of \"Kill the Irishman\" in my hometown. As far as i know, the film also had a very limited theater release in the USA, which is a sad thing because this movie was surprisingly good and well-crafted and was one of the best films I've seen in the last months.<br><br>The film tells the true story of Danny Greene, a tough irish gangster - and let me tell you, it is definitely a story worth telling.<br><br>I guess many of you are informed about the story of Danny Greene, so i won't go further into the story.<br><br>The movie features an impressive cast including Ray Stevenson, Val Kilmer, Christopher Walken and many other familiar faces known from other mob movies. Ray Stevenson gives an incredibly good performance as Danny Greene and manages to keep his character really violent, but also likable. This movie could give him a career boost for bigger roles.<br><br>The direction and the cinematography are very nice and i'm hoping this movie will enable Jonathan Hensleigh more work soon, because he's definitely a talented craftsman.<br><br>In some reviews i read that other people complained that this movie is just a ripoff of Goodfellas. That isn't true. The movie stands well on his own, despite featuring some actors known from Goodfellas, and wasn't that also the case in Shows like The Sopranos? Why complain about that? And last but not least, it IS a true story and who grows sick of seeing good mobster movies? Definitely not me.","user":"NemedyNM","rank":[106,127]},{"title":"An exciting ride!!","rating":9,"date":"8 May 2011","review":"Review by Ruby: If you are reading this, you have probably read the background info about The Irishman Danny Greene and his Italian buddy John Nardi who worked and broke the law many times over in the streets of Cleveland throughout the 1970s. In addition to Greene and Nardi, many of the cast members were familiar \"mob types,\" and testosterone was practically flying off the screen in the midst of bravado, fistfights, gunfire, and countless explosions. But there was an actual story to follow also, so it offered more substance than much of the drivel that manages to run in the theatres today.<br><br>Even though they were gangsters, Greene and Nardi were surprisingly likable characters—for killers, that is—mostly because of the charismatic acting of the two leads, Ray Stevenson and Vincent D'Onofrio. The supporting characters were interesting also, including the talents of Christopher Walken, Val Kilmer, Steve Schirripa, Paul Sorvino, Tony Lo Bianco, and Mike Starr.<br><br>Interspersed with the actors' scenes were actual clips of film footage from local newscasts of the day, which added authenticity and a touchstone to the amazing story that unfolded in Cleveland some 30-40 years ago.<br><br>I highly recommend \"Kill the Irishman\" as an action-packed, escapist, period piece, featuring superior acting and excellent film editing. It was a thoroughly enjoyable 100+ minutes!","user":"calico2-1","rank":[66,79]},{"title":"Deserved a bigger budget","rating":7,"date":"12 June 2011","review":"Kill the Irishman tells the story of Danny Greene and his rise from rags to riches through the mob and their many attempts at killing him. Being of Irish decent, the aspect of this one Irish guy who kept getting on the Italian mob's nerves, it peaked my interest. <br><br>The film has a great story to tell and I can only imagine how amazing the film would have been if they had a director like Martin Scorsese behind the camera. That's what I kept feeling while I watched this film, that it was a Scorsese wannabe. That's not exactly a bad thing, because I did enjoy the film, but I wanted to enjoy it so much more. <br><br>There are aspects of the film that are great and if a masterful craftsman were behind the camera than I can honestly see this film being one of the best of the year. The film feels short on a lot of things, mainly the small things that would have made this film great. The relationship between him and his wife was nonexistent. The smaller characters played by Christopher Walken, Val Kilmer and Vinnie Jones deserved more screen time. There was a relationship between Stevenson and Kilmer that was interesting, as one was a cop and the other a known mobster, but the film decided not to dive any further than two scenes. I hate to throw Goodfellas into the mix, but had the story been crafted more like that film, then this could have been great. <br><br>The story is based on true events, with some liberties of course. Some of the special effects, like the car bombings are incredibly poor. A story like this deserves a bit more attention to detail from the writer and director. It felt like they loved the story, but didn't know exactly how to tell it. Again, if they had proper backing in the budget department, then this film would have been really great. The car bombing scenes are really poorly done and this is such an integral part of the film. Some of them are actual explosions, others aren't. It's poor production values, stick with the real thing. <br><br>Kill the Irishman is a good movie when it should be a great movie. In terms of gangster flicks, it's one of the better ones. It's nowhere near the calibre of Goodfellas or Donnie Brasco. It feels like the odd film that wants to be apart of the family. It just falls short of admittance. A good film is good film though.","user":"Matt_Layden","rank":[35,46]}]